{"raw_text": "Off-colour Gardener storms to win\n \n Britain's Jason Gardener shook off an upset stomach to win the 60m at Sunday's Leipzig International meeting.\n \n Gardener clocked 6.56 seconds to equal the meeting record and finished well ahead of Germany's Marc Blume, who crossed the line in 6.67 secs. The world indoor champion said: \"I got to the airport and my stomach was upset and I was vomiting. I almost went home. \"I felt a little better Sunday morning but decided I'd only run in the main race. Then everything went perfectly.\" Gardener, part of the Great Britain 4x100m quartet that won gold at the Athens Olympics, will now turn his attention to next weekend's Norwich Union European Indoor trials in Sheffield.\n \n \"Given I am still off-colour I know there is plenty more in the tank and I expect to get faster in the next few weeks,\" he said. \"It's just a case of chipping away as I have done in previous years and the results will come.\" Scotland's Ian Mackie was also in action in Leipzig. He stepped down from his favoured 400m to 200m to finish third in 21.72 secs. Germany's Alexander Kosenkow won the race in 21.07 secs with Dutchman Patrick van Balkom second in 21.58 secs. There were plenty of other senior British athletes showing their indoor form over the weekend. Promising 60m hurdler\n \n clocked a new UK record of 7.98 seconds at a meeting in Norway. The 24-year-old reached the mark in her heat but had to settle for joint first place with former AAA champion Diane Allahgreen in the final.\n \n , who broke onto the international scene at the Olympic Games last season, set an indoor personal best of 16.50m in the triple jump at a meeting in Ghent. That leap - 37cm short of Brazilian winner Jadel Gregorio's effort - was good enough to qualify for the European Indoor Championships. At the same meeting,\n \n finished third in 7.27 seconds in a high-class women's 60m. The event was won by European medal favourite Christine Arron of France while Belgium rival Kim Gevaert was second. Britain's Joice Maduaka finished fifth in 7.35. Olympic bronze heptathlon medallist\n \n made a low-key return to action at an indoor meeting in Birmingham. The 28-year-old cleared 1.76m to win the high jump and threw 13.86m in the women's shot put.\n", "llama3.2:1b": ["Jason Gardener won the 60m event at Leipzig International, clocking 6.56 seconds to equal the meeting record.", "He finished ahead of Germany's Marc Blume and will focus on next weekend's Norwich Union European Indoor trials.", "Other British athletes performed well in Leipzig, including Scotland's Ian Mackie who finished third in the 200m.", "Other senior British athletes also competed, including a promising 60m hurdler who set a new UK record."], "llama3.2:3b": ["Jason Gardener won the 60m at Leipzig International with a time of 6.56 seconds, beating Germany's Marc Blume by 0.11 seconds.", "Despite feeling unwell after vomiting at the airport, Gardener's performance was strong enough to equal the meeting record and set him up for next weekend's Norwich Union European Indoor trials."], "gemma2:2b": ["Jason Gardener won the men's 60m at Leipzig, equalizing the meeting record.", "Ian Mackie competed in the 200m, with Alexander Kosenkow winning.", "Promising hurdler and triple jumper achieved new UK records.", "Joice Maduaka finished fifth in the women's 60m."], "qwen2.5:0.5b": ["Gardener, Britain's Jason Gardener, won the 60m hurdles at the Leipzig International meet.", "He clocked a time of 6.56 seconds and finished ahead of Germany's Marc Blume.", "Gardener said he had an upset stomach after feeling nauseous during his preparation run.", "He now aims to improve in the next few weeks to get faster in the upcoming European Indoor trials.", "Scotland's Ian Mackie also competed at the same meet, finishing third with a time of 21.72 seconds.", "Other British athletes were also making progress: Promising hurdler Diane Allahgreen was the fastest woman's 60m hurdle and cleared 7.98 seconds."], "qwen2.5:1.5b": ["British athlete Jason Gardener wins the 60-meter event at the Leipzig International meeting, clocking 6.56 seconds and equaling the previous record of 6.67 secs, after recovering from an upset stomach earlier that day.", "He finishes ahead of Marc Blume while fellow Briton Ian Mackie competes in a shortened race but still achieves third place.", "Other senior British athletes participate in indoor track events, with promising hurdler clocking a new UK record and triple jump champion setting personal bests."], "qwen2.5:3b": ["Britain's Jason Gardener won the 60m race at the Leipzig International meeting, equaling the meeting record with a time of 6.56 seconds.", "Recovering from an upset stomach issue that led him to consider withdrawing initially, Gardener felt much better by Sunday morning and decided to compete in the main event.", "He plans to focus on upcoming European Indoor trials in Sheffield after this success.", "Scotland's Ian Mackie ran third in the 200m race.", "Alexander Kosenkow of Germany won with a time of 21.07, followed by Patrick van Balkom from the Netherlands at 21.58.", "In other races, a promising UK 60m hurdler set a new national record and placed second in the final heat.", "A triple jumper broke an indoor personal best to qualify for European Indoor Championships.", "Additionally, a heptathlete returned to competition after the Olympics, winning high jump and shot put events with respectable performances."], "opencoder:1.5b": ["The text you provided is rather long, it contains several important points that should be summarized as follows:\n\n1) Off-colour Gardener shook off an upset stomach to win the 60m at Sunday's Leipzig International meeting.", "2) Gardener clocked 6.56 seconds to equal the meeting record and finished well ahead of Germany's Marc Blume, who crossed the line in 6.67 secs.", "3) The world indoor champion said: \"I got to the airport and my stomach was upset and I was vomiting.", "I almost went home.\"", "I felt a little better Sunday morning but decided I'd only run in the main race.", "Then everything went perfectly.", "Finally, the summary is concise and preserves key points.", "Note that the text was rather long so it's impossible to cover all the points in this response."], "smollm:1.7b": ["The summary should be:\n\n\"Britain's Jason Gardener shook off an upset stomach to win the 60m at Sunday's Leipzig International meeting, finishing well ahead of Germany's Marc Blume who crossed the line in 6.67 secs.", "The world indoor champion said: \"I got to the airport and my stomach was upset and I was vomiting.", "I almost went home.", "\"I felt a little better Sunday morning but knew there is plenty more in the tank and the results will come.\"", "Scotland's Ian Mackie was also in action in Leipzig, he stepped down from his favourite 400m to 200m to finish third in 21.72 secs.", "Germany's Alexander Kosenkow won the race in 21.07 secs with Dutchman Patrick van Balkom second in 21.58 secs.\""], "deepseek-r1:1.5b": ["The Leopold 60m race saw Jason Gardener from Britain win at the Leipzig International meeting, finishing ahead of Germany's Marc Blume with a time of 6.56 seconds and beating him by 0.11 seconds (6.67s).", "He noted his stomach issues but ultimately decided to run only part of the race, showcasing his determination.", "Jason Gardener is part of a quartet that won gold at the Athens Olympics.", "Scotland's Ian Mackie finished third in 21.72 seconds.", "Germany's Kosenkow secured victory with van Balkom second, while a British athlete took third in 7.35s for Joice Maduaka and bronze in both the high jump and shot put.", "At Leopold, Jason Gardener set a new UK record of 7.98 seconds and tied his personal best.", "He also won a high-class women's 60m race in 7.27s, third overall with Kim Gevaert."], "tinyllama:1.1b": ["In Leipzig, Jason Gardenier won his first race of the indoor season with a time of 6.56 seconds to equal the meeting record in the 60m.", "He finished ahead of Germany's Marc Blume by nearly two seconds, with Blume coming home in second place.", "In Norwich Union European Indoor trials in Sheffield, Scotland's Ian Mackie lowered his own favoured distance from a 400m to an 200m race to finish third in 21.72 sec.", "Germany's Alexander Kosenkow won the 200m with 21.07 seconds, while Australia's Dwayne van Balken, who had been expected to challenge for the win, finished second in 21.58 sec.", "Other notable performances included 60m hurdler\n \n finishing joint first in Norway with a new UK record of 7.98 seconds in his heat, while former AAA champion Diaine Allagreen was also in action and set an indoor personal best of 16.50m in the triple jump at a meeting in Ghent.", "The event was won by Brazilian winner Jaadel Gregorio with Joice Maduaka finishing fifth in 7.35 sec.", "Overall, there were plenty of athletes showing their indoor form over the weekend."], "tinydolphin:1.1b": ["\n Britain's Jason Gardener won a record-equaling 60m at Sunday's Leipzig International meeting in his quest for the indoor world title.", "The world indoor champion clocked 6.56 secs, just two hundredths of a second behind Germany's Marc Blume.", "Despite being sick earlier in the week, Gardener was determined to win and finished ahead of Germany's Marc Blume by 21 meters.", "This marks the first time he has won the 60m indoors.", "Jason will now focus on the upcoming Norwich Union European Indoor trials in Sheffield next weekend.", "The Great Britain 4x100m quartet that won gold at the Athens Olympics also includes Ian Mackie, who was off-colour but still managed to improve his record."], "phi:2.7b": [" Jason Gardener won the 60m race at the Leipzig International Meeting, clocking a time of 6.56 seconds.", "He overcame an upset stomach and vomiting before the event.", "Gardener is now focusing on next weekend's Norwich Union European Indoor trials.", "Scottish athlete Ian Mackie also competed in the 400m but had to move up to 200m due to feeling off-colour.", "Germany's Alexander Kosenkow won the race in 21.07 seconds while Patrick van Balkom finished second in 21.58 seconds.", "British athletes also showed their indoor form, with Sarah Winward setting a new UK record in the 60m hurdles and Joice Maduaka winning the high jump at an indoor meeting in Birmingham."], "orca-mini:3b": [" Britain's Jason Gardener won the 60m race at Sunday's Leipzig International meeting despite feeling unwell with an upset stomach.", "Gardener clocked 6.56 seconds, equalizing the meeting record and finishing well ahead of Germany's Marc Blume, who crossed the line in 6.67 seconds.", "Gardener will now focus on next weekend's Norwich Union European Indoor trials in Sheffield, where he expects to get faster in the next few weeks.", "Ian Mackie, another British athlete, stepped down from his favored 400m to 200m and finished third in 21.72 seconds at a meeting in Leipzig.", "Patrick van Balkom of the Netherlands won the race in 21.58 seconds.", "Diane Allahgreen, formerly of the AAA champion, set a new indoor personal best of 16.50m in the triple jump at a meeting in Ghent.", "Jadel Gregorio of Brazil won with a long jump of 37cm.", "In the women's 60m, Olympic bronze heptathlon medallist Christine Arron of France won in 7.27 seconds, while Belgium's Kim Gevaert was second and Joice Maduaka finished fifth.", "Gardener's teammate"], "hermes3:3b": ["Jason Gardener wins 60m race despite upset stomach; British athlete sets new UK triple jump record in Ghent."], "stablelm-zephyr:3b": ["At Leipzig International meeting, Britain's Jason Gardener overcame an upset stomach to win the 60m race with a time of 6.56 seconds, equaling the meeting record.", "He expressed confidence that he will get faster in the coming weeks.", "Scotland's Ian Mackie also competed, finishing third in the 200m event.", "A UK record was set by a promising 60m hurdler at a Norwegian meeting, and another British athlete broke their indoor personal best in triple jump at a meeting in Ghent.", "Olympic bronze heptathlon medallist made a low-key return to action at an indoor meeting in Birmingham."], "stablelm2:1.6b": ["British runner Jason Gardener wins the Leipzig International 4xC event, setting a new meeting record with 6 seconds, while Scotland's Ian Mackie finishes third in a different event.", "A promising young female sprinter broke a UK record by timing her run at a meeting in Norway.", "A high jumper also impressed by clearing 1.5 meters during an indoor meet in Birmingham.", "An Olympic bronze heptathlon medallist returned to action with success in a women's throw event in the same meeting in Birmingham."], "granite3.1-dense:2b": ["British athlete Jason Gardener, known for his role in the Athens Olympic gold-winning 4x100m team, unexpectedly won the 60m at the Leipzig International meeting, clocking 6.56 seconds to equal the record and outpace Germany's Marc Blume (6.67 secs).", "Despite a severe upset stomach, Gardener decided to compete and performed exceptionally well.", "He plans to focus on improving his speed in upcoming trials.", "In other events:\n- Ian Mackie from Scotland, shifting from 400m to 200m, secured third place (21.72 secs) at the same meet, while Germany's Alexander Kosenkow won (21.07 secs), and Dutchman Patrick van Balkom took second (21.58 secs).", "- Promising 60m hurdler Emily Freeman set a new UK record of 7.98 seconds in Norway, finishing joint first with Diane Allahgreen in the final; her personal best was 16.50m in Ghent's triple jump.", "- Christine Arron (France) won the women's 60m event at an indoor meet in Birmingham, followed by Kim Gevaert (Belgium) and Joice Maduaka (Britain).", "- Emily's high jump cleared 1.76m, and she threw 13.86m in the shot put, marking her return after the Olympics."], "chatgpt-4o-latest": ["Jason Gardener overcame an upset stomach to win the 60m at the Leipzig International meeting, clocking 6.56 seconds to equal the meeting record.", "Despite feeling unwell, he decided to compete only in the main race and performed strongly.", "Gardener, a member of Britain's Olympic gold-winning 4x100m team, now focuses on the upcoming European Indoor trials.", "Scotland's Ian Mackie finished third in the 200m, while other British athletes also showed strong indoor form.", "A 60m hurdler set a new UK record of 7.98 seconds in Norway, and a triple jumper achieved an indoor personal best of 16.50m in Ghent, qualifying for the European Indoor Championships.", "In the women's 60m, a British sprinter finished third behind Christine Arron and Kim Gevaert.", "Olympic heptathlon bronze medallist made a low-key return in Birmingham, winning the high jump and competing in the shot put."]}