{"raw_text": "Kenya lift Chepkemei's suspension\n \n Kenya's athletics body has reversed a ban on marathon runner Susan Chepkemei after she made an official apology.\n \n Athletics Kenya (AK) had suspended the two-time London Marathon runner-up for failing to turn up to a cross-country team training camp in Embu. \"We have withdrawn the ban. Chepkemei has given a reason for her absence,\" said AK chief Isaiah Kiplagat. \"She explained she had a contract with the organisers of the race in Puerto Rice and we have accepted her apology.\"\n \n The Kenyan coaching team will now decide whether Chepkemei can be included in the team for this month's world cross country championships. The 29-year-old would be a strong contender at the event in France and is hopeful she will be granted a place in the 32-strong squad. \"I am satisfied that the whole saga has been brought to an end,\" Chepkemei said. \"I am ready and prepared to represent my country. \"I will be disappointed if I am not given a chance to compete at the world cross country championships.\" AK had insisted it was making an example of Chepkemei by banning her from competition until the end of 2005. But the organisation came under intense international and domestic pressure to reverse its decision. The 29-year-old took part in the 2002 and 2003 London Marathons and was edged out by Radcliffe in an epic New York Marathon contest last year.\n \n The two-time world half-marathon silver medallist will be back to challenge Radcliffe at this year's London event in April. AK also dropped its harsh stance on three-time world cross country 4km champion Edith Masai. Masai missed Kenya's world cross country trials because of an ankle problem but AK insisted it would take disciplinary action unless she could prove she was really injured. \"Subject to our doctor's confirmation, we have decided to clear Masai,\" added Kiplagat.\n", "llama3.2:1b": ["Kenya lifts Chepkemei suspension after marathon runner apologizes and pays the fine; Athletics Kenya (AK) will consider her for the world cross country championships this month.", "Chepkemei was suspended in 2005 for failing to attend a training camp but apologized and has since withdrawn the ban.", "The Kenyan coaching team will decide whether she can compete in the event, which is scheduled for April in London."], "llama3.2:3b": ["Kenya's athletics body has lifted a ban on marathon runner Susan Chepkemei after she made an official apology for missing a cross-country team training camp.", "The Kenyan coaching team will now decide whether Chepkemei can compete in this month's world cross country championships.", "The decision comes after intense international and domestic pressure to reverse the ban."], "gemma2:2b": ["Kenya lifted the suspension on Susan Chepkemei and Edith Masai, who were banned for missing training camps.", "The ban was reversed after Chepkemei apologized for her absence due to a race commitment in Puerto Rico.", "Masai's ban was lifted as she received medical confirmation of an ankle injury.", "Both athletes have a chance to compete at the world cross country championships and the London Marathon."], "qwen2.5:0.5b": ["Kenya lifts suspension on Susan Chepkemei after denying her participation in London marathon"], "qwen2.5:1.5b": ["Kenya has lifted the ban on marathon runner Susan Chepkemei after she apologized for missing a cross-country training camp and qualified for this month's world championships.", "Chepkemei expressed her intention to compete in France at the event.", "AK originally banned Chepkemei from competition until the end of 2005 but later reversed its decision following an apology and dropped three-time cross country champion Masai's suspension after confirming she was not injured."], "qwen2.5:3b": ["Kenya's athletics body has lifted a suspension on marathon runner Susan Chepkemei after she apologized for missing a cross-country team training camp due to a race contract in Puerto Rico.", "Athletics Kenya agreed to her apology and will now decide if she can be included in the country’s squad for this month's world cross country championships.", "While AK initially banned Chepkemei until 2005, international and domestic pressure led to its reversal.", "The organization also dropped its disciplinary action against Edith Masai, who missed trials due to an ankle injury."], "opencoder:1.5b": ["Kenya lift Chepkemei's suspension\n\nAthletics Kenya (AK) reversed a ban on marathon runner Susan Chepkemei after her official apology.", "The kenyan coaching team will now decide whether Chepkemei can be included in the team for this month's world cross country championships."], "smollm:1.7b": ["The summary should contain the following key points:\n\n1.", "The athletics body has reversed a ban on marathon runner Susan Chepkemei after she made an official apology.", "2.", "Athletics Kenya (AK) had suspended the two-time London Marathon runner-up for failing to turn up to a cross-country team training camp in Embu.", "3.", "AK said it gave a reason for her absence and accepted its apology.", "4.", "Chepkemei has given a reason for her absence and is hopeful she will be granted a place in the 32-strong squad at the world cross country championships.", "5.", "Chepkemei is satisfied that the whole saga has been brought to an end and is ready to compete at the world cross country championships.", "6.", "Chepkemei took part in the 2002 and 2003 London Marathons and was edged out by Radcliffe in an epic New York Marathon contest last year.", "7.", "The two-time world half-marathon silver medalist will be back to challenge Radcliffe at this year's London event in April.", "8.", "AK also dropped its harsh stance on three-time world cross country 4km champion Edith Masai and cleared her for competition after she could prove she was really injured."], "deepseek-r1:1.5b": ["Kenya athletics Kenya (AK) suspended Susan Chepkemei after she was not present at an athlete training camp in Embu.", "The organization granted her a reason for her absence upon being cleared of the race ban.", "She has expressed her satisfaction, stating she is ready to compete in this month's world cross country championships, though AK wants to reverse the decision because Kenyan coach Isaiah Kiplagat claims it was an example to force her out until 2005.", "Chepkemei, a 29-year-old marathon runner and world half-marathon medallist, will return for the April London event and remains hopeful of competing.", "AK has dropped its strict stance on Edith Masai, who missed trials due to an ankle problem, but will enforce disciplinary action unless her injury is proven.", "The ban was in place since 2005 and AK aims to reverse it as a role model."], "tinyllama:1.1b": ["Kenyans were shocked when athletics body Athletics Kenya (AK) announced that two-time London Marathon runner-up Susan Chepkemei had been suspended for failing to turn up to a cross-country team training camp in Embu after the 2003 race.", "AK claimed that she failed to provide clear reasons for her absence but subsequently reversed their decision and apologized to Chepkemei for the ban, citing her contract with the organisers of the race in Puertorico.", "The suspension was expected to affect Chepkemei's chances at the forthcoming world cross country championships in France.", "However, following international and domestic pressure, AK reversed their decision and offered Chepkemei a place in the team for this month's event.", "In an effort to appease concerns, AK also dropped its stance on three-time world cross country 4km champion Edith Masai, who had been suspended despite not attending trial races due to an injury."], "tinydolphin:1.1b": [" Kenya Athletics suspended marathon runner Susan Chepkemei in December for missing a cross-country team training camp in Embu.", "However, Athletics Kenya (AK) has withdrawn the ban and Chepkemei has explained her absence to give her more time to prepare for the world cross country championships in France.", "The two-time London Marathon runner-up will be competing at this year's event against American Edith Masai."], "phi:2.7b": [" Kenyan Athletics Kenya (AK) has reversed a ban on marathon runner Susan Chepkemei after she apologized for not attending a training camp in Embu, where she was suspended by the organization for failing to attend a cross-country team training camp.", "The Kenyan coaching team will decide whether she can participate in this month's world cross country championships.", "Chepkemei is a strong contender at the event and hopes to be granted a place in the 32-strong squad."], "orca-mini:3b": [" Kenya's athletics body reversed a ban on marathon runner Susan Chepkemei after she apologized for missing a cross-country team training camp in Embu.", "The coaching team will decide whether Chepkemei can be included in the world cross country championships."], "hermes3:3b": ["Kenya's athletics body lifts ban on runner Susan Chepkemei after apology for missing training camp."], "stablelm-zephyr:3b": ["Kenya's athletics body, Athletics Kenya (AK), has reversed the suspension of marathon runner Susan Chepkemei after she issued an official apology for failing to attend a training camp in Embu.", "AK chief Isaiah Kiplagat confirmed that Chepkemei provided a reason for her absence and explained that she had a contract with the organizers of the London Marathon, which AK accepted.", "The suspension had been intended to run until the end of 2005 but was reversed following international and domestic pressure.", "Chepkemei is now hopeful to be included in the world cross country championships this month and will challenge Radcliffe in the upcoming London Marathon in April.", "AK also decided to clear three-time world cross country 4km champion Edith Masai, subject to a doctor's confirmation, after she missed Kenya's world cross country trials due to an ankle problem."], "stablelm2:1.6b": ["Kenya's Athletics Kenya (AK) has reversed the suspension of marathon runner Susan Chepkemei after she apologized for not attending a cross-country team training camp in Embu.", "The two-time London Marathon runner-up will be included in the team for this month's world cross country championships, provided her coaching team approves.", "Chepkemei had initially failed to turn up to the camp due to a contract with the organizers of a race in Puerto Rico.", "AK suspended her until the end of 2015 after insisting it was making an example of her by banning her from competition until the end of that year.", "However, under international and domestic pressure, AK has now dropped its harsh stance on three-time world cross-country 4km champion Edith Masai as well."], "granite3.1-dense:2b": ["Kenya's athletics organization, Athletics Kenya (AK), has lifted the suspension of marathon runner Susan Chepkemei after she provided an official apology for missing a cross-country team training camp in Embu due to a contract commitment in Puerto Rico.", "The 29-year-old, a two-time London Marathon second-placer, is now in contention for the upcoming world cross country championships in France.", "AK initially intended to maintain the ban until late 2005 but faced international pressure to reverse their decision.", "Additionally, AK has dropped disciplinary action against three-time world cross country 4km champion Edith Masai, who missed trials due to an ankle injury, following confirmation from Kenya's medical team."], "chatgpt-4o-latest": ["Kenya's athletics body has lifted the suspension of marathon runner Susan Chepkemei after she apologized for missing a training camp, citing a contractual obligation in Puerto Rico.", "Athletics Kenya (AK) accepted her explanation, and the coaching team will now decide if she can join the squad for the world cross country championships in France.", "Chepkemei, a strong contender, hopes to compete.", "AK initially banned her to set an example but faced pressure to reverse the decision.", "She has previously competed in major marathons and will challenge Radcliffe again in the London Marathon.", "AK also cleared Edith Masai, a three-time world cross country champion, after verifying her ankle injury."]}