{"raw_text": "Verdict delay for Greek sprinters\n \n Greek athletics' governing body has postponed by two weeks the judgement on sprinters Costas Kenteris and Katerina Thanou for missing doping tests.\n \n The pair are facing lengthy bans for the missed tests, including one on the eve of last year's Athens Olympics. They were set to learn their fate by the end of February, but late evidence from them has pushed the date back. \"A decision is now expected by around mid-March,\" said one of their lawyers, Michalis Dimitrakopoulos. Kenteris, 31, who won the men's 200m title at the 2000 Sydney Games and Thanou, 30, who won the women's 100m silver medal in Sydney, face a maximum two-year ban if found guilty. The athletes, who spectacularly withdrew from the Athens Olympics, have been suspended by the International Association of Athletics Federations (IAAF) for missing the three tests. The IAAF said the sprinters had failed to provide samples for tests in Tel Aviv, Chicago and Athens and ordered Greek athletic's governing body, Segas, to hold a disciplinary inquiry. The athletes also face a criminal hearing in Greece over the missed drugs tests and have been charged with faking a motorcycle accident on the day of the Athens test, which led to them spending four days in hospital. Following the final hearing in late January, the athletes sounded confident they would be acquitted. \"I am confident and optimistic,\" Thanou had said at the time. \"We presented new evidence to the committee that they were not aware of.\" It was not clear what this new evidence was.\n", "llama3.2:1b": ["Greek athletics governing body postpones verdict for sprinters Costas Kenteris and Katerina Thanou due to late evidence, delaying decision by two weeks.", "The pair are facing a maximum two-year ban if found guilty.", "They were set to learn their fate by the end of February but new evidence has pushed the date back."], "llama3.2:3b": ["Greek athletics' governing body has postponed the judgement on sprinters Costas Kenteris and Katerina Thanou for missing doping tests by two weeks, now expecting a decision by mid-March.", "The pair face lengthy bans and a criminal hearing in Greece over the missed tests, which include one on the eve of last year's Athens Olympics."], "gemma2:2b": ["Greek sprinters Costas Kenteris and Katerina Thanou's doping test case has been postponed, with a decision now expected by mid-March.", "They face potential bans up to two years if found guilty for missing three drug tests in Tel Aviv, Chicago, and Athens.", "The athletes were suspended by the IAAF after failing to provide samples and are facing criminal charges related to faked accident during the test period."], "qwen2.5:0.5b": ["Athletes Costas Kenteris and Katerina Thanou will face a maximum two-year ban for missing doping tests in Greece if found guilty, after being suspended by the International Association of Athletics Federations (IAAF) due to missed drugs tests in Australia and the US.", "The athletes have been charged with faking a motorcycle accident on the day of their Athens Olympic trials, which led them to spend four days in hospital."], "qwen2.5:1.5b": ["Greek sprinters Costas Kenteris and Katerina Thanou's doping test verdicts have been delayed by two weeks, with a decision expected around mid-March due to late evidence from them regarding the missed tests, including one before the 2008 Athens Olympics.", "Both athletes face potential two-year bans for failing to provide samples for three IAAF-approved doping tests and are facing criminal hearings over faked medical records leading to hospital stays following their withdrawal from the 2004 Olympics."], "qwen2.5:3b": ["Verdict delay for Greek sprinters: Greek athletics' governing body postponed by two weeks the judgement on Costas Kenteris and Katerina Thanou, who are facing lengthy bans for missing doping tests in Tel Aviv, Chicago, and Athens, set to be announced around mid-March.", "They face a maximum two-year ban from athletics.", "The pair withdrew from the 2018 Athens Olympics due to their suspension by the IAAF.", "Their criminal hearing over fake motorcycle accident allegations is ongoing, with Thanou suggesting new evidence was presented to the committee for her exoneration."], "opencoder:1.5b": ["Greek athletics' governing body has postponed by two weeks the judgement on sprinters Costas Kenteris and Katerina Thanou for missing doping tests.", "The pair are facing lengthy bans for the missed tests, including one on the eve of last year's Athens Olympics.", "They were set to learn their fate by the end of February, but late evidence from them has pushed the date back.", "\"A decision is now expected by around mid-March,\" said one of their lawyers, Michalis Dimitrakopoulos.", "Kenteris, 31, who won the men's 200m title at the 2k Sydney Games and Thanou, 30, who won the women's 100m silver medal in Sydney face a maximum two-year ban if found guilty.", "The athletes, who spectacularly withdrew from the Athens Olympics, have been suspended by the International Association of Athletics Federations (IAAF) for missing the three tests.", "The IAAF ordered Greek athletic's governing body, Segas, to hold a disciplinary inquiry.", "The athletes also face a criminal hearing in Greece over the missed drugs tests and have been charged with faking a motorcycle accident on the day of the Athens test, which led to them spending four days in hospital.", "Following the final hearing in late January, the athletes sounded confident they would be acquitted.", "\"I am confident and optimistic,\" Thanou had said at the time."], "smollm:1.7b": ["The summary is concise and preserves key ideas and details, including:\n\n1.", "The delay in the verdict on Greek sprinters Costas Kenteris and Katerina Thanou for missing doping tests.", "2.", "The late evidence from them has pushed the date back to around mid-March.", "3.", "A decision is now expected by around mid-March if found guilty.", "4.", "The athletes, who spectacularly withdrew from the Athens Olympics, have been suspended by the International Association of Athletics Federations (IAAF) for missing the three tests.", "5.", "The IAAF said the sprinters had failed to provide samples for tests in Tel Aviv, Chicago and Athens and ordered Greek athletic's governing body, Segas, to hold a disciplinary inquiry.", "6.", "The athletes also face a criminal hearing in Greece over the missed drugs tests and have been charged with faking a motorcycle accident on the day of the Athens test, which led to them spending four days in hospital.", "7.", "Following the final hearing in late January, the athletes sounded confident they would be acquitted."], "deepseek-r1:1.5b": ["Greece's sprinters faced a two-week delay in their doping test verdict.", "Costas Kenteris and Katerina Thanou are set to face lengthy bans for missing three tests, including those at the 2000 Athens Olympics.", "The IAAF suspended them for international competitions but now expects a disciplinary inquiry into their failed samples.", "They were charged with faking a motorcycle accident on their test day and have been accused of being suspended by the governing body.", "After an optimistic conclusion in late January, Thanou and Kenteris are set to confront their case in Greece.", "The IAAF ordered a disciplinary investigation, and Segas is handling it now."], "tinyllama:1.1b": ["Greek athletes Costa Kenteri and Katerinia Thanou have been postponed from their scheduled judgement on drug-testing violations, as a late submission of evidence suggests that they may face an almost two-year ban if found guilty by the IAAF.", "The Athens 2000 Sydney Games champions are accused of failing to provide samples for tests in Tel Aviv, Chicago, and Athens, where police said they were involved in a motorcycle accident resulting in four days in hospital.", "Despite sounding confident that they would be cleared following the final hearing, the athletes remain on trial while the IAAF reviews their case, but it is not clear what new evidence was presented to the committee."], "tinydolphin:1.1b": [" The Greek Athletics' governing body has postponed the judgement on two sprinters, Costas Kenteris and Katerina Thanou, over missing doping tests from the eve of the Athens Olympics in 2016.", "The pair will now wait until around mid-March to learn their fate, which is expected to be a lengthy decision due to late evidence being found."], "phi:2.7b": [" The Greek Athletics Federation has postponed the judgement on sprinters Costas Kenteris and Katerina Thanou, who missed doping tests before the Athens Olympics.", "They face two-year bans if found guilty and will be charged with faking a motorcycle accident to avoid testing.", "They have presented new evidence but its details were not disclosed."], "orca-mini:3b": [" Greek athletics' governing body has postponed by two weeks the judgement on sprinters Costas Kenteris and Katerina Thanou for missing doping tests.", "They face lengthy bans for the missed tests, including one on the eve of last year's Athens Olympics.", "The athletes have been suspended by the International Association of Athletics Federations (IAAF) for missing the three tests."], "hermes3:3b": ["Greek sprinters Costas Kenteris and Katerina Thanou doping test delay extended, set to learn their fate by mid-March."], "stablelm-zephyr:3b": ["The Greek Athletics governing body has delayed the judgment by two weeks for sprinters Costas Kenteris and Katerina Thanou, who missed doping tests.", "They were initially set to face sanctions in February but now expect a decision around mid-March.", "The athletes, who previously won medals at the Sydney Olympics, could face a maximum ban of two years if found guilty.", "They have been suspended by the International Association of Athletics Federations (IAAF) for missing three tests and also face criminal charges in Greece over faking a motorcycle accident on the day of their Athens test."], "stablelm2:1.6b": ["The Greek Athletics governing body has delayed the verdict for sprinters Costas Kenteris and Katerina Thanou, pushing back their potential lengthy bans from doping tests by two weeks.", "The pair face a max two-year ban if found guilty, but current late evidence from them affected the original end of February deadline for their fate to be determined.", "A new decision is expected around mid-March.", "Kenteris won the men's title at the Sydney Games and Thanou won the women's silver medal in 2004 Athens Olympics, both facing suspensions by IAAF for missing three tests; however, they also face criminal hearings for missed drugs tests and a fake motorcycle accident leading to hospital stays."], "granite3.1-dense:2b": ["Greek sprinters Costas Kenteris (200m Sydney gold winner) and Katerina Thanou (Sydney 100m silver medalist) have had their verdict on doping test absences postponed from late February to mid-March due to recent evidence.", "Both athletes face potential two-year bans if found guilty, stemming from missing crucial tests in Tel Aviv, Chicago, and Athens, including one just before the 2004 Athens Olympics.", "They have been suspended by the IAAF and are also under criminal investigation in Greece for faking a motorcycle accident to avoid testing on the day of their Athens test, leading to hospitalization.", "Despite initial optimism following a late-January hearing where they presented new evidence, the outcome remains uncertain."], "chatgpt-4o-latest": ["Greek sprinters Costas Kenteris and Katerina Thanou's verdict for missing doping tests has been delayed by two weeks due to late evidence.", "They face potential two-year bans for missing tests, including one before the 2004 Athens Olympics.", "Suspended by the IAAF, they are also under criminal investigation in Greece for allegedly faking a motorcycle accident to avoid testing.", "Their final hearing was in January, and they remain optimistic about acquittal, citing new but undisclosed evidence.", "A decision is expected by mid-March."]}