{"raw_text": "Call for Kenteris to be cleared\n \n Kostas Kenteris' lawyer has called for the doping charges against the Greek sprinter to be dropped.\n \n Gregory Ioannidis has submitted new evidence to a Greek athletics tribunal which he claims proves the former Olympic champion has no case to answer. Kenteris and compatriot Katerina Thanou were given provisional suspensions in December for failing to take drugs tests before the Athens Olympics. The Greek tribunal is expected to give its verdict early next week. Kenteris and Thanou withdrew from the Athens Olympics last August after missing drugs tests on the eve of the opening ceremony. They were also alleged to have avoided tests in Tel Aviv and Chicago before the Games.\n \n But Ioannidis said: \"Everything overwhelmingly shows that the charges should be dropped.\" Ioannidis also said he has presented evidence that will throw a different light on the events leading up to the pair's sensational withdrawal from the Athens Games. The lawyer added that he has proof the authorities \"knew\" Kenteris was in Germany at the time he was alleged to have missed a test in Chicago. Nick Davies, spokesman for athletics' ruling body the IAAF, which handed out the provisional bans, said: \"We can't comment because we were not present at the hearing and don't know what was said behind closed doors. \"We expect a verdict from the Greek Athletics Federation before the end of February and will obviously be making a statement then.\" Kenteris won 200m gold at the 2000 Sydney Olympics, while Thanou won silver in the 100m.\n", "llama3.2:1b": ["Kostas Kenteris' lawyer calls for charges to be dropped against him due to new evidence presented by Gregory Ioannidis, who claims proves Kenteris has no case.", "The Greek athletics tribunal is set to give its verdict next week on whether Kenteris and compatriot Katerina Thanou should face doping charges."], "llama3.2:3b": ["Kostas Kenteris' lawyer has submitted new evidence to a Greek athletics tribunal arguing that doping charges against the sprinter should be dropped.", "The lawyer claims that all charges should be dropped and will present evidence that throws new light on events leading up to the pair's withdrawal from the Athens Olympics."], "gemma2:2b": ["Kostas Kenteris' lawyer has requested that doping charges against him be dropped, presenting new evidence to a Greek athletics tribunal.", "He claims the charges should be dropped because there is overwhelming proof that Kenteris did not break any rules.", "The tribunal will reach its verdict early next week."], "qwen2.5:0.5b": ["Kostas Kenteris' lawyer has asked for doping charges against Greek sprinter to be dropped, and former Olympic champion Gregory Ioannidis submitted new evidence showing no case exists.", "The Greek athletics tribunal expects a verdict early next week.", "They were initially accused of failing drug tests on the eve of the Athens Games, but later claimed they avoided testing in Tel Aviv and Chicago.", "Kenteris and Thanou withdrew from the games last August after missing drugs tests at the opening ceremony.", "They were also suspected of avoiding tests in Berlin and Chicago.", "The athlete has presented new evidence that authorities \"knew\" he was in Germany before his alleged drug miss, while the ruling body will provide a verdict soon."], "qwen2.5:1.5b": ["Kostas Kenteris' doping charges are being called for clearance, with new evidence presented claiming he has no case to answer.", "The Greek sprinters were suspended before Athens Olympics but withdrew after drug tests missed on them at other events.", "Their lawyer claims Ioannidis has proof authorities knew they were in Germany when allegedly missing a test there and suggests the suspension should be lifted."], "qwen2.5:3b": ["Kostas Kenteris' lawyer has called for doping charges against the Greek sprinter to be dropped.", "Lawyer Gregory Ioannidis submitted new evidence claiming that Kenteris and his compatrit Katerina Thanou had no case to answer, as they withdrew from Athens Olympics in August after missing tests before the opening ceremony.", "Ioannidis argued authorities knew Kenteris was in Germany when he supposedly missed a test in Chicago.", "The Greek athletics tribunal is expected to give its verdict early next week, while IAAF spokesman Nick Davies cannot comment due to not being present at hearing."], "opencoder:1.5b": ["Kostas Kenteris' lawyer has called for the doping charges against the Greek sprinter to be dropped.", "Gregory Ioannidis has submitted new evidence to a Greek athletics tribunal where he claims proves the former Olympic champion has no case to answer.", "Kenteris and compatriot Katerina Thanou were given provisional suspensions in December for failing to take drugs tests before the Athens Olympics.", "The Greek tribunal is expected to give its verdict early next week.", "Kenteris and Thanou withdrawn from the Athens Olympics last August after missing drugs tests on the eve of the opening ceremony.", "They were also alleged to have avoided tests in Tel Aviv and Chicago before the Games, but Ioannidis said: \"Everything overwhelmingly shows that the charges should be dropped.\"", "The lawyer added he has presented evidence that will throw a different light on the events leading up to the pair's sensational withdrawal from the Athens Games.", "The IAAF, who handed out the provisional bans, said: \"We can't comment because we were not present at the hearing and don't know what was said behind closed doors.\"", "We expect a verdict from the Greek Athletics Federation before the end of February, and the pair will surely make a statement then.", "Kenteris won 200m gold at the 2,000 Sydney Olympics, while Thanou won silver in the 100m race."], "smollm:1.7b": ["Call for Kenteris to be cleared\nKostas Kenteris' lawyer has called for the doping charges against the Greek sprinter to be dropped.", "Ioannidis has submitted new evidence to a Greek athletics tribunal which he claims proves the former Olympic champion has no case to answer.", "Kenteris and compatriot Katerina Thanou were given provisional suspensions in December for failing to take drugs tests before the Athens Olympics.", "The Greek tribunal is expected to give its verdict early next week.", "Kenteris and Thanou withdrew from the Athens Olympics last August after missing drugs tests on the eve of the opening ceremony.", "They were also alleged to have avoided tests in Tel Aviv and Chicago before the Games.", "But Ioannidis said: \"Everything overwhelmingly shows that the charges should be dropped.\"", "Ioannidis also said he has presented evidence that will throw a different light on the events leading up to the pair's sensational withdrawal from the Athens Games.", "The lawyer added that he has proof the authorities \"knew\" Katerina was in Germany at the time she was alleged to have missed a test in Chicago.", "Nick Davies, spokesman for athletics' ruling body the IAAF, which handed out the provisional bans, said: \"We can't comment because we were not present at the hearing and don't know what was said behind closed doors.", "We expect a verdict from the Greek Athletics Federation before the end of February and will obviously be making a statement then.\"", "Katerina Thanou won 200m gold at the 2000 Sydney Olympics, while Kostas Kenteris won silver in the 100m."], "deepseek-r1:1.5b": ["Kenteris' lawyer Gregory Ioannidis has called for the doping charges against Kenteris to be dropped, claiming there was no case based on new evidence.", "The Greek athletics tribunal is expected to decide soon, after athletes withdrew from the Olympics due to test failures in 2000.", "Thanou won gold in the 200m at Sydney and silver in 100m."], "tinyllama:1.1b": ["Athletics lawyer Kostas Kenteri's new evidence to clear up the suspicions surrounding Greek sprinter Kostas \"Kent\" Ioannidis has been submitted to a Greek tribunal, which is expected to announce its verdict next week regarding the pair's provisionally suspended doping cases.", "The Athens Olympic champion was allegedly given provisional drug tests for two years before missing an examination in Tel Aviv and Chicago, while the former Olympian was said to have avoided testing in Athens before leaving their country to avoid further tests at the 2000 Sydney Games.", "Ioannidis also provided evidence that showed Kent's withdrawal from the Athens Olympics overwhelmingly supported by evidence, but his lawyer previously denied any wrongdoing on the part of the Athens Olympic organizing committee.", "The Greek Athletics Federation has not commented on the latest developments, citing the need to await the tribunal's decision."], "tinydolphin:1.1b": [" Katerina Thanou and her compatriot, Greek sprinter Kostas Kenteris, had their doping charges against them dropped by the Greek Athletics Federation (GEA) earlier this month.", "However, their lawyer, Gregory Ioannidis, has submitted new evidence to the tribunal which he claims proves Katerina Thanou has no case to answer.", "The Greek tribunal is expected to make a verdict on February 25.", "The Greek Athletics Federation had initially given provisional suspensions to Kenteris and Thanou for failing to take drug tests before the Athens Olympics in 2016, leading to their withdrawal from the event.", "The athletes claimed that they were not informed about the presence of prohibited substances on the eve of the opening ceremony and had done so only after receiving warnings from their coaches."], "phi:2.7b": [" Kostas Kenteris' lawyer has called for his doping charges to be dropped after he submitted new evidence showing that Kenteris had no case to answer.", "The former Olympic champion was suspended in December for failing to take drugs tests before the Athens Olympics, but Gregory Ioannidis claims he has proof the authorities knew Kenteris was in Germany at the time of a test in Chicago.", "The Greek Athletics Federation is expected to give its verdict early next week."], "orca-mini:3b": [" The lawyer for Kostas Kenteris has called for the doping charges against him to be dropped, citing new evidence submitted by his lawyer that he claims proves the Greek sprinter's innocence.", "This comes after the former Olympic champion and compatriot Katerina Thanou were given provisional suspensions in December for failing to take drugs tests before the Athens Olympics.", "The Greek tribunal is expected to give its verdict early next week."], "hermes3:3b": ["Kenteris's lawyer demands doping charges against him to be dropped."], "stablelm-zephyr:3b": ["Kostas Kenteris' lawyer asks for doping charges against Greek sprinter to be dropped, citing new evidence that he claims disproves Kenteris' case.", "The Greek athletics tribunal is set to give its verdict early next week on whether to drop the charges.", "Kenteris and compatriot Katerina Thanou were suspended in December for failing to take doping tests before the Athens Olympics.", "They withdrew from the Games last August after missing multiple drug tests.", "Ioannidis, Kenteris' lawyer, asserts that he has presented evidence showing authorities knew Kenteris was in Germany when he missed a test in Chicago.", "The IAAF spokesman remains silent on the matter and expects a verdict from the Greek Athletics Federation by the end of February."], "stablelm2:1.6b": ["Kostas Kenteris' lawyer asks for his charges to be dropped after submitting new evidence showing that Kenteris has no case against the Greek tribunal and former Olympic champion Katerina Thanou.", "The tribunal is expected to give its verdict early next week after hearing new evidence from Gregory Ioannidis, who claims that everything strongly shows that the charges should be dismissed.", "The IAAF, which handed out the provisional bans, cannot comment on the matter as they were not present at the hearing and do not know what was said behind closed doors.", "A verdict from the Greek Athletics Federation is expected by the end of February and will be made by athletics' ruling body, the IAAF.", "Kenteris won a gold medal in Sydney while Thanou won silver in the same games."], "granite3.1-dense:2b": ["Kostas Kenteris' lawyer, Gregory Ioannidis, has requested the dropping of doping charges against the Greek sprinter.", "New evidence suggests Kenteris had no reason to avoid drug tests before the 2004 Athens Olympics.", "The Greek athletics tribunal is set to rule on the case soon.", "Kenteris and his compatriot, Katerina Thanou, withdrew from the Games after allegedly missing tests in Germany, Tel Aviv, and Chicago.", "Ioannidis claims authorities knew Kenteris was in Germany during the Chicago test.", "The International Association of Athletics Federations (IAAF) cannot comment until they receive the tribunal's verdict, expected by the end of February.", "Kenteris won 200m gold at the 2000 Sydney Olympics; Thanou took silver in the 100m."], "chatgpt-4o-latest": ["Kostas Kenteris' lawyer, Gregory Ioannidis, has called for the doping charges against the Greek sprinter to be dropped, presenting new evidence to a Greek athletics tribunal.", "Kenteris and Katerina Thanou were provisionally suspended in December for missing drug tests before the Athens Olympics and had also allegedly avoided tests in Tel Aviv and Chicago.", "Ioannidis claims the evidence proves Kenteris was in Germany when he was accused of missing a test in Chicago and argues the charges should be dismissed.", "The Greek tribunal is expected to deliver a verdict soon.", "The IAAF, which issued the provisional bans, declined to comment but expects a decision by the end of February.", "Kenteris won 200m gold at the 2000 Sydney Olympics, while Thanou won silver in the 100m."]}