{"raw_text": "London hope over Chepkemei\n \n London Marathon organisers are hoping that banned athlete Susan Chepkemei will still take part in this year's race on 17 April.\n \n Chepkemei was suspended from all competition until the end of the year by Athletics Kenya after failing to report to a national training camp. \"We are watching it closely,\" said London race director David Bedford. \"There is a long way to go before the race and we are hoping the situation will be satisfactorily resolved.\" The camp in Embu was to prepare for the IAAF World Cross Country Championships later this month. Chepkemei however took part and finished third in last Sunday's world best 10K race in Puerto Rico. The 29-year-old has finished second to Paula Radcliffe in the 2002 and 2003 London races as well as in November's New York City marathon.\n", "llama3.2:1b": ["London Marathon organisers are hoping Susan Chepkemei will still participate on 17 April, but Athletics Kenya suspended her from competition until the end of the year over missing a national training camp."], "llama3.2:3b": ["London Marathon organisers are hoping Susan Chepkemei will still participate despite being banned from all competition until the end of the year after failing to report to a national training camp, with her performance in last Sunday's world best 10K race in Puerto Rico adding uncertainty."], "gemma2:2b": ["London Marathon organizers are hoping that banned athlete Susan Chepkemei will participate despite her suspension.", "Chepkemei was suspended by Athletics Kenya for failing to report to a national training camp, but she finished third in the 10K race in Puerto Rico last Sunday.", "She has a history of strong performances at the London Marathon and other major races."], "qwen2.5:0.5b": ["London Marathon organisers hope Susan Chepkemei, who failed to report to a national training camp due to her doping record, will still take part in this year's London Marathon on April 17th.", "She finished third in the last Sunday's World Cross Country Championships race and has won both New York City marathons and November's New York City marathon as well as the 2002 and 2003 London races."], "qwen2.5:1.5b": ["London Marathon organizers are hopeful that banned athlete Susan Chepkemei will still compete despite her suspension, given the long process of resolution."], "qwen2.5:3b": ["London Marathon organisers are hoping banned athlete Susan Chepkemei will participate in this year's race on 17 April.", "Despite being suspended by Athletics Kenya, Chepkemei competed and placed third in a world best 10K race last Sunday.", "She has previous success at the London Marathon, finishing second in both 2002 and 2003, as well as in November's New York City marathon.", "London race director David Bedford says they are hoping the situation will be satisfactorily resolved before the April race."], "opencoder:1.5b": ["London hope over Chepkemei\n\nLondon Marathon organisers are hoping that banned athlete Susan Chepkemei will still take part in this year's race on 17 April.", "Chepkemei was suspended from all competition until the end of the year by Athletics Kenya after failing to report to a national training camp.", "\"We are watching it closely,\" said London race director David Bedford.", "\"There is a long way to go before the race and we are hoping the situation will be satisfactorily resolved.\"", "The camp in Embu was to prepare for the IAAF World Cross Country Championships later this month.", "Chepkemei took part and finished third in last Sunday's world best 10K race in Puerto Rico.", "The 29-year-old has finished second to Paula Radcliffe in the 2002 and 2003 London races as well as in November's New York City marathon."], "smollm:1.7b": ["London hope over Chepkemei is a summary of the text, preserving key ideas and details.", "The main idea is that London hope over Chepkemei will still participate in the London Marathon on 17 April.", "This information can be summarized as follows:\n\n* London hope over Chepkemei is a summary of the text.", "* It preserves key ideas and details, including the main idea (London hope over Chepkemei) and supporting details (the main idea, the athlete's name, the sport, and the race).", "* The summary does not include explanations or reasoning processes."], "deepseek-r1:1.5b": ["London hope over Chepkemei  \nLondon Marathon organisers hope Susan Chepkemei will participate this year's marathon on April 17th.", "Chepkemei was suspended by Athletics Kenya until the end of the year after failing to report at their training camp.", "The director, David Bedford, hopes for a satisfactory resolution before the race.", "She participated but finished third in Puerto Rico last Sunday and showed strong performance in previous marathons."], "tinyllama:1.1b": ["London Marathon organizers hope that Chepkemei, who was suspended from competition after failing to report for a national training camp until the end of the year, will still participate in this year's race on April 17th despite a long-standing dispute.", "Bedford, director of London Race Director, says there is \"a long way to go before the race\" and that an \"attempt is being made\" to \"satisfactorily resolve\" the situation.", "The campaign for Chepkemei's participation, which was announced in October, will have to wait until after the IAAF World Cross Country Championships in Puerto Rico.", "Despite finishing third in last Sunday's world-class 10K race, Chepkemei has already participated in two previous London Marathons."], "tinydolphin:1.1b": [" In an unexpected turn of events, Susan Chepkemei, a suspended athlete who had been banned for not reporting to a national training camp, has been allowed to participate in the London Marathon, which is scheduled to take place on April 17th.", "However, it remains to be seen how the situation will be resolved, as Athletics Kenya, the organization responsible for disciplinary actions, has yet to make an official announcement."], "phi:2.7b": [" Susan Chepkemei, a banned athlete from Kenya, is still being watched by the organisers of this year's London Marathon on 17 April despite her suspension until the end of the year by Athletics Kenya after she did not attend a national training camp.", "The race director hopes that the situation will be resolved satisfactorily before the race takes place."], "orca-mini:3b": [" London Marathon organizers are still hopeful that banned athlete Susan Chepkemei will participate in this year's race on April 17th despite her recent suspension from all competition by Athletics Kenya.", "The situation is still uncertain and the race directors are closely monitoring the situation.", "Chepkemei recently finished third in a world best 10K race in Puerto Rico, but the banned athlete has previously won the London Marathon and has set multiple world records in distance running."], "hermes3:3b": ["London Marathon hoping Chepkemei participates, despite Athletics Kenya ban."], "stablelm-zephyr:3b": ["London Marathon organizers hope that banned runner Susan Chepkemei will participate in the race on 17 April, despite her suspension from Athletics Kenya until the end of the year for failing to report to a national training camp.", "London race director David Bedford monitors the situation closely, expressing hope that it will be resolved satisfactorily before the event.", "Chepkemei participated in a recent 10K race in Puerto Rico and has previously finished second in the London Marathon in 2002 and 2003 as well as in the November New York City marathon."], "stablelm2:1.6b": ["London hopes for Chepkemei: Despite suspension, Susan Chepkemei may run in the London Marathon on April 14th due to ongoing developments related to her attendance at an IAAF World Cross Country Championships training camp and her performance in a recent race.", "Key points include Chepkemei's third-place finish in Sunday's world best K race in Puerto Rico, as well as her top finishes in recent marathons like the 2nd and 3rd London races and the November New York City marathon."], "granite3.1-dense:2b": ["London Marathon organizers, led by David Bedford, are maintaining optimism that suspended Kenyan athlete Susan Chepkemei will compete in the April 17 event.", "Chepkemei was banned until year-end for not attending a national training camp in Embu, intended for the IAAF World Cross Country Championships.", "Despite this ban, she recently competed and finished third in a 10K race in Puerto Rico.", "Chepkemei has previously impressed at London Marathons, finishing second to Paula Radcliffe in 2002 and 2003, as well as in the 2004 New York City marathon."], "chatgpt-4o-latest": ["London Marathon organisers hope banned athlete Susan Chepkemei can still compete in the April 17 race.", "Chepkemei was suspended by Athletics Kenya for missing a national training camp for the IAAF World Cross Country Championships.", "London race director David Bedford said they are monitoring the situation and hope for a resolution.", "Despite the ban, Chepkemei recently finished third in a 10K race in Puerto Rico.", "The 29-year-old has previously placed second to Paula Radcliffe in the 2002 and 2003 London Marathons and the 2004 New York City Marathon."]}