{"raw_text": "Chepkemei hit by big ban\n \n Kenya's athletics body has suspended two-time London Marathon runner-up Susan Chepkemei from all competition until the end of the year.\n \n Athletics Kenya (AK) issued the ban after Chepkemei failed to turn up for a cross country training camp in Embu. \"We have banned her from all local and international competitions,\" said AK chief Isaiah Kiplagat. \"We shall communicate this decision to the IAAF and all meet directors all over the world.\" The 29-year-old finished second to Paula Radcliffe in the 2002 and 2003 London races, and was also edged out in an epic New York Marathon contest last year.\n \n But the ban will prevent the two-time world half-marathon silver medallist from challenging Radcliffe at this year's London event in April. Global Sports Communications, Chepkemei's management company, said she had wanted to run in the World Cross Country Championships in March. But AK maintained it was making an example of Chepkemei as a warning to other Kenyan athletes. \"We are taking this action in order to salvage our pride,\" said Kiplagat. \"We have been accused of having no teeth to bite with and that agents are ruling over us.\" KA has also threatened three-time women's short-course champion Edith Masai with a similar ban if reports that she feigned injury to avoid running at the cross country world championships are true. Masai missed the national trials in early February, but was included in the provisional team on the proviso that she ran in a regional competition. She failed to run in the event, citing a leg injury.\n", "llama3.2:1b": ["Kenya's athletics body has suspended athlete Susan Chepkemei from all competitions until the end of the year after failing to attend a training camp and not being cleared by Athletics Kenya for the London Marathon."], "llama3.2:3b": ["Athletics Kenya suspended Susan Chepkemei for the rest of the year after she failed to attend a cross-country training camp.", "Chepkemei, a two-time London Marathon runner-up, will not be able to compete at this year's London event in April.", "AK made the decision as an example to other athletes, stating they have been accused of having no teeth and being controlled by agents."], "gemma2:2b": ["Kenyan athlete Susan Chepkemei has been banned from all competition until the end of the year by Athletics Kenya (AK) for failing to attend a cross country training camp.", "The ban comes after AK claims that Chepkemei missed the training camp without explanation.", "AK also stated they are using this as an example to other Kenyan athletes.", "Meanwhile, Edith Masai faces a potential ban if reports of faking injury to avoid running in a world championship event prove true."], "qwen2.5:0.5b": ["Kenya's Athletics Kenya suspended two-time London Marathon runner-up Susan Chepkemei from all competition until the end of the year due to her failure to participate in a cross country training camp in Embu.", "AK chief Isaiah Kiplagat stated that she would communicate this decision to the IAAF and all meet directors worldwide, while 29-year-old Chepkemei finished second to Paula Radcliffe in two London races last year.", "She is allowed to run in the World Cross Country Championships in March if competing at the London event in April.", "Additionally, she faces a similar ban from Global Sports Communications for feigning injury to avoid running at the cross country world championships."], "qwen2.5:1.5b": ["Kenya's Athletics Kenya (AK) suspended Susan Chepkemei from all competitions due to her failure to attend a training camp.", "The ban will prevent Chepkemei from competing at London Marathon and World Cross Country Championships this year.", "AK views it as an example for other Kenyan athletes, warning about \"agents ruling over us\" following accusations of being unable to enforce rules effectively."], "qwen2.5:3b": ["Kenya's Athletics Kenya has banned Susan Chepkemei from all competitions until the end of the year after her absence from an Embu cross country training camp.", "The ban will prevent Chepkemei, who finished second to Paula Radcliffe in London Marathons and was a two-time world half-marathon silver medalist, from competing in this year's London event.", "The decision was made by AK chief Isaiah Kiplagat as a warning to other Kenyan athletes following accusations of KA having weak enforcement.", "Edith Masai is also under threat of similar ban for allegedly feigning injury."], "opencoder:1.5b": ["The Kenyan athlete Chepkemei hit by a ban from all competitions until the end of the year from a cross country training camp in Embu.", "The athlete finished second in the 2002 and 2003 London races and was also edged out in a New York Marathon contest last year.", "However, it is important to note that the ban will prevent Chepkemei from challenging Radcliffe at this year's London event in April.", "Global Sports Communications issued a warning to other Kenyan athletes saying they had wanted to run in World Cross Country Championships, but AK maintained it was making an example of Chepkemei.", "\"We are taking these actions in order to save our pride,\" Kiplagat explained."], "smollm:1.7b": ["Chepkemei hit by big ban: Kenyan athletics body suspends two-time London Marathon runner-up Susan Chepkemei from all competitions until end of year for failing to turn up for cross country training camp."], "deepseek-r1:1.5b": ["Athletics Kenya suspended Susan Chepkemei, excluding her from all races until the end of the year.", "She had shown up for a training camp, facing skepticism after failing to attend an event.", "Chepkemei aims to compete in the World Cross Country Championships but KA warns against it by feigning injury, threatening other Kenyan runners.", "She had previously won marathons and placed second in the NYC marathon, though she missed trials early on but was included in a team that could run despite her injury."], "tinyllama:1.1b": ["Kenyan cross-country runner Susan Chepkemei has been suspended from all competition after AK Athletics Kenya issued a ban due to her failure to turn up for training camp in Embu and the disqualification of three-time women's short-course champion Edith Masai.", "The two-time London Marathon runner-up was reportedly denied a chance at competing in the 2021 World Cross Country Championships due to AK's actions, which are said to be \"making an example\" of Chepkemei as a warning to other athletes.", "AK has also threatened three-time women's short-course champion Edith Masai with a similar ban if she feigned injury to avoid running at the cross country world championship events in March."], "tinydolphin:1.1b": [" The Athletics Kenya (AK) has suspended two-time London Marathon runner-up Susan Chepkemei from all competition until the end of the year.", "This comes after she failed to make it to the cross country training camp in Embu without informing her coach or team, and subsequently failed to turn up for the camp.", "Athletics Kenya (AK) has banned her from all local and international competitions, including the prestigious London Marathon.", "This ban also extends to all meet directors across the world.", "The 29-year-old finisher second to Paula Radcliffe in the 2002 and 2003 London races, and was also edged out in an epic New York Marathon contest last year.", "She will not be eligible to challenge reigning world half-marathon silver medallist Paula Radcliffe at this year's London event.", "Global Sports Communications (GSM) has been representing Chepkemei's management company, and has been accused of having no teeth to bite with the accusation being that they have been ruling over Kenyan athletes in a similar manner to AK.", "In addition, KA has threatened three-time women's short-course champion Edith Masai with a similar ban if she continues to avoid running at the cross country world championships.", "Masai missed the national trials earlier this year, but was included in the provisional team on the proviso that she competed in a regional competition.", "She failed to do so, citing a leg injury."], "phi:2.7b": [" Kenya's athletics body has banned Susan Chepkemei from all competitions until the end of the year for failing to attend a training camp.", "The ban is intended as an example to other Kenyan athletes and could prevent Chepkemei from challenging Paula Radcliffe in the upcoming London Marathon."], "orca-mini:3b": [" Kenya's Athletics Body Suspends Susan Chepkemei from All Competitions for Failure to Attend Cross Country Training Camp.", "Chepkemei was banned from all local and international competitions after she failed to turn up for a cross country training camp in Embu.", "This decision was made by the Athletics Kenya (AK) chief Isaiah Kiplagat, who said that the ban would prevent Chepkemei from challenging Paula Radcliffe at the London Marathon this year.", "The ban is an example to other Kenyan athletes and is meant to restore pride for the organization."], "hermes3:3b": ["Susan Chepkemei suspended from athletics in Kenya until end of 2021 for not attending cross country training camp."], "stablelm-zephyr:3b": ["Athletics Kenya has suspended two-time London Marathon runner-up Susan Chepkemei from all competitions until the end of the year for failing to attend a training camp in Embu.", "The ban prevents Chepkemei from challenging Paula Radcliffe at this year's London event and sets a example to other Kenyan athletes.", "Athletics Kenya also threatened three-time women's short-course champion Edith Masai with a similar ban if reports of her feigning injury are true."], "stablelm2:1.6b": ["Kenya's Athletics Kenya has suspended two-time London Marathon runner-up Susan Chepkemei until year-end due to her unexplained absence from a cross country training camp in Embu.", "AK banned her for all local and international competitions after she failed to turn up for the event, leading AK to issue a warning to other Kenyan athletes.", "The ban prevents Chepkemei from challenging Paula Radcliffe at this year's London Marathon."], "granite3.1-dense:2b": ["Kenya's Athletics Board has suspended two-time London Marathon runner-up Susan Chepkemei from all competitions until year-end due to her failure to attend a cross country training camp in Embu.", "The 29-year-old, who previously finished second to Paula Radcliffe at the 2002 and 2003 London Marathons and the New York Marathon in 2018, will miss this year's London event.", "AK chief Isaiah Kiplagat stated they would communicate this decision to the International Association of Athletics Federations (IAAF) and all meet directors globally.", "The ban aims to demonstrate authority and counter accusations of ineffective management by athletes' agents.", "Additionally, AK is threatening a similar suspension for three-time women's short-course champion Edith Masai, who reportedly feigned injury to skip the cross country world championships."], "chatgpt-4o-latest": ["Kenya's athletics body, Athletics Kenya (AK), has suspended Susan Chepkemei from all competitions until the end of the year for failing to attend a cross country training camp.", "AK chief Isaiah Kiplagat stated that the ban applies to both local and international events and will be communicated to the IAAF.", "Chepkemei, a two-time London Marathon runner-up and world half-marathon silver medallist, will miss the 2005 London Marathon.", "Her management company claimed she intended to compete in the World Cross Country Championships, but AK insisted the ban serves as a warning to other athletes.", "AK also warned Edith Masai of a similar ban if allegations that she feigned injury to avoid competing are confirmed."]}