{"raw_text": "Collins appeals against drugs ban\n \n Sprinter Michelle Collins has lodged an appeal against her eight-year doping ban with the North American Court of Arbitration for Sport (CAS).\n \n The 33-year-old received the ban last month as a result of her connection to the federal inquiry into the Balco doping scandal. She is the first athlete to be banned without a positive drugs test or an admission of drugs use. CAS has said that a ruling is normally given within four months of an appeal. Collins was suspended by the US Anti-Doping Agency based on patterns observed in her blood and urine tests as well as evidence in the Balco investigation. As well as being hit with the ban, Collins was stripped of her 2003 world and US indoor 200m titles. The San Francisco-based Balco laboratory is at the centre of the scandal which has rocked the sport. The company has been accused of distributing illegal performance-enhancing drugs to elite athletes.\n", "llama3.2:1b": ["Michelle Collins appeals her eight-year doping ban against her with CAS, after being suspended by US Anti-Doping Agency due to blood and urine test results and Balco investigation evidence."], "llama3.2:3b": ["Michelle Collins appeals against an eight-year doping ban with the North American Court of Arbitration for Sport (CAS) due to her connection to the Balco doping scandal, the first athlete banned without a positive test or admission."], "gemma2:2b": ["Michelle Collins appealed her eight-year doping ban imposed by the US Anti-Doping Agency based on evidence from the Balco investigation."], "qwen2.5:0.5b": ["Sprinter Michelle Collins, who was previously banned by the US Anti-Doping Agency for participating in an investigation into a drug case involving the US Olympic Committee, has lodged an appeal against her ban with the North American Court of Arbitration for Sport (CAS).", "She is among the first athletes to be given a three-year ban without admitting to using drugs."], "qwen2.5:1.5b": ["Sprinter Michelle Collins appeals against her eight-year doping ban, becoming the first athlete banned without a positive test or admission due to association with Balco's doping scandal and its investigation into US anti-doping agency violations.", "The ruling is expected within four months."], "qwen2.5:3b": ["Michelle Collins, a 33-year-old sprinter, has appealed against an eight-year doping ban imposed by US Anti-Doping Agency (USADA) due to her connection to the Balco doping scandal.", "This ruling is considered unprecedented as it was given without a positive drug test or admission of use.", "CAS said a decision would be made within four months and Collins had her 2003 world and US indoor 200m titles stripped along with the ban.", "The San Francisco-based Balco laboratory, suspected of distributing illegal performance-enhancing drugs to elite athletes, is at the center of this scandal affecting sports globally."], "opencoder:1.5b": ["Collins appeals against drugs ban, with Michelle Collins lodging an appeal for her eight-year doping ban on the North American Court of Arbitration for Sport (CAS).", "She was suspended by the US Anti-Doping Agency based on her observations in her blood and urine tests, as well as evidence in the Balco investigation.", "The 33-year-old received the ban last month after her connection to the federal inquiry into the Balco doping scandal."], "smollm:1.7b": ["Collins appealed against her eight-year doping ban with the North American Court of Arbitration for Sport (CAS).", "Sprinter Michelle Collins received the ban last month as a result of her connection to the federal inquiry into the Balco doping scandal.", "She is the first athlete to be banned without a positive drugs test or an admission of drugs use.", "CAS has said that a ruling is normally given within four months of an appeal.", "Collins was suspended by the US Anti-Doping Agency based on patterns observed in her blood and urine tests as well as evidence in the Balco investigation.", "As well as being hit with the ban, Collins was stripped of her 2003 world and US indoor 200m titles.", "The San Francisco-based Balco laboratory is at the centre of the scandal which has rocked the sport.", "The company has been accused of distributing illegal performance-enhancing drugs to elite athletes."], "deepseek-r1:1.5b": ["Michelle Collins appeals against an eight-year doping ban granted by the North American Court of Arbitration for Sport (CAS).", "As the first athlete in her field to receive this ban without a positive drugs test or admission, she is also suspended from the US Anti-Doping Agency.", "The appeal highlights the challenging and controversial nature of such bans, which were granted after a federal investigation into the Balco doping scandal, where a company was accused of distributing illegal performance-enhancing drugs to elite athletes."], "tinyllama:1.1b": ["Collins lodges appeal against eight-year doping ban with North American Court of Arbitration for Sport, appealing against her connection to Balco scandal.", "The 33-year-old sprinter received a ban as a result of her connection to the federal inquiry into Balco doping manipulations.", "Collins is the first athlete to be punished without admitting drug use, and CAST has said that a ruling will normally be given within four months.", "She was suspended based on patterns observed in blood and urine tests as well as evidence in the Balco investigation.", "Collins was stripped of her 2003 world and US indoor 200m titles, but is appealing against her ban based on her connection to the scandal."], "tinydolphin:1.1b": [" Sprinter Michelle Collins, a prominent figure in the world of athletics, has lodged an appeal against her eight-year doping ban with the North American Court of Arbitration for Sport (CAS).", "Collins, who was initially suspended by US Anti-Doping Agency based on patterns observed in her blood and urine tests, is appealing the ban's duration and the nature of the prohibited substances she used.", "CAS has scheduled a ruling for within four months after receiving her appeal.", "Collins, a sprinter from Australia, was named the first athlete to face a doping ban without a positive drug test or an admission of drugs use.", "Her suspension followed the federal inquiry into Balco that resulted in a conviction and criminal charges against some of its former employees."], "phi:2.7b": [" Sprinter Michelle Collins appealed against an eight-year doping ban, becoming the first athlete banned without a positive drug test or admission of use.", "She was suspended by US Anti-Doping Agency for patterns observed in her blood and urine tests and evidence in the Balco investigation, which is at the center of the scandal that has rocked the sport."], "orca-mini:3b": [" Michelle Collins, a former sprinter, has filed an appeal with the North American Court of Arbitration for Sport (CAS) against her eight-year doping ban, which was imposed due to her connection to the federal inquiry into the Balco doping scandal."], "hermes3:3b": ["Michelle Collins appeals 8-year drugs ban; connected to Balco doping scandal, without positive test or admission.", "CAS will decide ruling within 4 months."], "stablelm-zephyr:3b": ["Sprinter Michelle Collins appeals her eight-year doping ban by the North American Court of Arbitration for Sport (CAS) due to her connection to the Balco doping scandal.", "The 33-year-old athlete is banned without a positive drugs test or admission of drug use, and CAS will rule within four months of the appeal.", "She was stripped of her 2003 world and US indoor 200m titles as well.", "The San Francisco-based Balco laboratory is at the center of the scandal, which has accused the company of distributing illegal performance-enhancing drugs to elite athletes."], "stablelm2:1.6b": ["Michelle Collins appeals a 8-year doping ban by the North American Court of Arbitration for Sport (CAS), following her involvement in the Balco doping scandal.", "As the first athlete banned without a positive drug test or an admission of drug use, Collins faces further consequences as she is stripped of her titles and suspended by the US Anti-Doping Agency due to patterns observed in her blood and urine tests, as well as evidence from the Balco investigation.", "The San Francisco-based Balco laboratory is at the center of the scandal that has shaken the sport."], "granite3.1-dense:2b": ["Michelle Collins, a 33-year-old sprinter, has filed an appeal with the North American Court of Arbitration for Sport (CAS) against her eight-year doping ban.", "The ban was imposed by the US Anti-Doping Agency due to patterns in her blood and urine tests and evidence from the Balco investigation, which linked Collins to a performance-enhancing drug distribution scandal.", "This makes her the first athlete to be banned without a positive test or admission of drug use.", "The ruling on her appeal is expected within four months.", "As part of the ban, Collins has been stripped of her 2003 world and US indoor 200m titles."], "chatgpt-4o-latest": ["Sprinter Michelle Collins has appealed her eight-year doping ban to the North American Court of Arbitration for Sport.", "She was banned without a positive drug test or admission of use, based on blood and urine test patterns and evidence from the Balco doping scandal investigation.", "Collins was also stripped of her 2003 world and US indoor 200m titles.", "The Balco laboratory, accused of distributing illegal performance-enhancing drugs, is central to the scandal.", "A ruling on her appeal is expected within four months."]}