{"raw_text": "Isinbayeva heads for Birmingham\n \n Olympic pole vault champion Yelena Isinbayeva has confirmed she will take part in the 2005 Norwich Union Grand Prix in Birmingham on 18 February.\n \n \"Everybody knows how much I enjoy competing in Britain. I always seem to break records there,\" said Isinbayeva. \"As Olympic champion there will be more attention on me this year, but hopefully I can respond with another record in Birmingham.\" Kelly Holmes and Carolina Kluft are among other Athens winners competing. The organisers are hoping that Isinbayeva's main rival, fellow Russian Svetlana Feofanova, will also take part in the event. The pair had a thrilling battle in Athens which ended with Isinbayeva finally jumping a world record of 4.91m to claim the gold medal. Isinbayeva, 22, has set 10 world records in the pole vault, three of which have come on British soil.\n", "llama3.2:1b": ["Olympic pole vault champion Yelena Isinbayeva will compete at the 2005 Norwich Union Grand Prix in Birmingham on February 18."], "llama3.2:3b": ["Olympic pole vault champion Yelena Isinbayeva will compete at the 2005 Norwich Union Grand Prix in Birmingham on February 18, with a focus on breaking records."], "gemma2:2b": ["Yelena Isinbayeva will compete in the 2005 Norwich Union Grand Prix in Birmingham on February 18th.", "She is aiming for another world record and hopes to respond to increased attention as Olympic champion.", "Fellow Russian Svetlana Feofanova, her main rival, may also participate."], "qwen2.5:0.5b": ["Olympic champion Yelena Isinbayeva will participate in the Norwich Union Grand Prix in Birmingham on February 18th.", "She also participated in Athens with Kelly Holmes and Carolina Kluft as rivals."], "qwen2.5:1.5b": ["Isinbayeva confirms participation in the 2005 Norwich Union Grand Prix in Birmingham alongside other Olympic and Grand Prix winners including Kelly Holmes, Carolina Kluft, and Svetlana Feofanova."], "qwen2.5:3b": ["Olympic pole vault champion Yelena Isinbayeva will participate in the 2005 Norwich Union Grand Prix in Birmingham on 2月18日.", "She enjoys competing there and hopes to break another record.", "Other Athens winners like Kelly Holmes and Carolina Kluft are also participating.", "The event aims for fellow Russian rival Svetlana Feofanova's participation, who previously competed with Isinbayeva in Athens, ending with Isinbayeva setting a world record of 4.91m.", "At 22 years old, Isinbayeva has set ten pole vault records, nine on British soil."], "opencoder:1.5b": ["\"Isinbayeva heads for Birmingham.", "Olympic pole vault champion Yelena Isinbayeva has confirmed she will take part in the 2005 Norwich Union Grand Prix in Birmingham on 18 February.", "\"The event took place on 18th February, and she met with another record there.", "Kelly Holmes and Carolina Kluft are among other athletes competing.", "The organisers hope that Isinbayeva's rival, fellow Russian Svetlana Feofanova will also take part.", "Despite her remarkable victories in the pole vaulting event, she has yet to claim the world record for jumping.", "With 22 years and a stunning record of over 4.91 meters, Isinbayeva is set to climb further records in future events.\""], "smollm:1.7b": ["Summarizing the text:\n\n1.", "Isinbayeva heads for Birmingham\n\t* The main idea is that Yelena Isinbayeva will be competing in the 2005 Norwich Union Grand Prix in Birmingham, and this event will be her first major competition outside of Russia.", "2.", "Olympic pole vault champion Yelena Isinbayeva has confirmed she will take part in the 2005 Norwich Union Grand Prix in Birmingham on 18 February\n\t* The main idea is that Yelena Isinbayeva, a world-class pole vauler, will be competing in the 2005 Norwich Union Grand Prix in Birmingham.", "This event will be her first major competition outside of Russia.", "3.", "Everybody knows how much I enjoy competing in Britain\n\t* The main idea is that Yelena Isinbayeva enjoys competing in Britain, and this experience will likely help her prepare for the 2005 Norwich Union Grand Prix in Birmingham.", "4.", "I always seem to break records there\n\t* The main idea is that as an Olympic champion, Yelena Isinbayeva has a strong track record of breaking world records in the pole vault.", "This experience will likely help her prepare for the 2005 Norwich Union Grand Prix in Birmingham.", "5.", "As Olympic champion there will be more attention on me this year, but hopefully I can respond with another record in Birmingham\n\t* The main idea is that Yelena Isinbayeva's experience as an Olympic champion will likely lead to increased attention and recognition from the public and media, including her participation in the 2005 Norwich Union Grand Prix in Birmingham.", "However, she hopes to set another world record in Birmingham this year by competing against other top athletes.", "6.", "Kelly Holmes and Carolina Kluft are among other Athens winners competing\n\t* The main idea is that Yelena Isinbayeva will be competing with other top pole vaulers from around the world, including Kelly Holmes and Carolina Kluft.", "This will likely include other notable athletes who have also won multiple world records in the pole vault."], "deepseek-r1:1.5b": ["Yelena Isinbayev is an Olympic pole vault champion with a passion for British sports.", "She will compete at the Norwich Union Grand Prix on February 18th, aiming to win with a world record of 4.91 meters against Svetlana Feofanova in Athens.", "She's one of the top female pole vaultists with 10 world records, three from Britain."], "tinyllama:1.1b": ["Isinbayeva will participate in the Norwich Union Grand Prix in Birmingham on February 18th.", "The athlete is known for her successes in Britain and has set records there.", "She plans to respond with another world record, along with Svetlan Feofanova, one of her main rivals from Athens who also competed in the event.", "The Norwich Union Grand Prix is set to be a thrilling affair with Isinbayeva's main rival Kelly Holmes and Carolina Kluft also competing."], "tinydolphin:1.1b": [" Based on the provided text, it appears that Isinbayeva is headed for the 2005 Norwich Union Grand Prix event to be held in Birmingham.", "This event was held in 2005 and featured prominent athletes such as Kelly Holmes, Svetlana Feofanova, and Carolina Kluft.", "Additionally, Yelena Isinbayeva, an Olympic pole vault champion, is confirmed to participate in the event."], "phi:2.7b": [" Yelena Isinbayeva will compete in the 2005 Norwich Union Grand Prix in Birmingham.", "She loves competing in Britain and hopes to break another record this year.", "Her main rival, Svetlana Feofanova, is also a former Olympic champion and is expected to take part in the event.", "The organisers are hoping for exciting competition with the addition of other Athens winners like Kelly Holmes and Carolina Kluft."], "orca-mini:3b": [" Olympic pole vault champion Yelena Isinbayeva will compete in the 2005 Norwich Union Grand Prix in Birmingham on February 18th."], "hermes3:3b": ["Yelena Isinbayeva to compete in 2005 Norwich Union Grand Prix in Birmingham on 18th February.", "Olympic champion pole vaulter expects more attention but aims for record there."], "stablelm-zephyr:3b": ["Olympic pole vault champion Yelena Isinbayeva confirmed participation in the 2005 Norwich Union Grand Prix in Birmingham on 18 February.", "She enjoys competing in Britain and aims to break more records there this year as an Olympic champion.", "Other Athens winners, Kelly Holmes and Carolina Kluft, will also compete.", "The event's organizers hope that Isinbayeva's main rival, Svetlana Feofanova, will join the competition as well.", "Isinbayeva set 10 world records in pole vaulting, with three of them achieved on British soil."], "stablelm2:1.6b": ["Yelena Isinbayeva will compete in the Norwich Union Grand Prix in Birmingham on February 15th.", "As an Olympic champion, she'll draw attention, but aims to break another record there.", "Other athletes include Kelly Holmes and Carolina Kluft, with hopes of Russian rivals Svetlana Feofanova also participating.", "Isinbayeva's three world pole vault records have been set in Britain."], "granite3.1-dense:2b": ["Olympic pole vault champion Yelena Isinbayeva, 22, will participate in the 2005 Norwich Union Grand Prix in Birmingham on February 18.", "Known for breaking records in Britain, including three world records on this soil, Isinbayeva aims to set another record in the event.", "Competing alongside her are fellow Athens champions Kelly Holmes and Carolina Kluft.", "Her main rival, Svetlana Feofanova, is expected to join, having had a memorable duel with Isinbayeva at the 2004 Athens Olympics where Isinbayeva secured gold by jumping 4.91m, her tenth world record in pole vault."], "chatgpt-4o-latest": ["Olympic pole vault champion Yelena Isinbayeva will compete in the 2005 Norwich Union Grand Prix in Birmingham on 18 February.", "She enjoys competing in Britain, where she has set multiple records, and hopes to achieve another.", "Other Athens Olympic winners, including Kelly Holmes and Carolina Kluft, will also participate.", "Organizers hope her main rival, Svetlana Feofanova, will join the event.", "Isinbayeva won gold in Athens with a world record jump of 4.91m and has set 10 world records, three in Britain."]}