{"raw_text": "Bekele sets sights on world mark\n \n Olympic 10,000m champion Kenenisa Bekele is determined to add the world indoor two mile record at February's Norwich Union Grand Prix in Birmingham.\n \n The 22-year-old will again be chasing a record held by his compatriot and mentor Haile Gebrselassie, who set the mark at the same meeting in 2003. \"I am still as hungry to do as much as I can in this sport,\" said Bekele. \"And aiming for the two mile world record in Birmingham is the next of those targets.\" Gebrselassie's current record stands at eight minutes, 04.69 seconds. And Bekele is no stranger to overhauling world marks at the National Indoor Arena. The Ethiopian broke the world indoor 5,000m record on his debut at the meeting last year. Compatriots Mulugeta Wondimu, Abiyote Abate and Markos Geneti, the world indoor bronze medallist over 3000m, will race against Bekele on 18 February. The meet has already attracted a crop of Olympic talent. Britain's 800m and 1500m champion Kelly Holmes is taking part in the 1000m. Swedish heptathlon gold medallist Carolina Kluft will contest the 60m hurdles. While men's 4x100m relay gold medallists Jason Gardener and Mark Lewis-Francis will go head-to-head in the 60m.\n", "llama3.2:1b": ["Kenenisa Bekele, Olympic 10,000m champion, aims to break Haile Gebrselassie's indoor two mile record at Norwich Union Grand Prix in Birmingham."], "llama3.2:3b": ["Kenenisa Bekele aims to break Haile Gebrselassie's world indoor two mile record at February's Norwich Union Grand Prix in Birmingham, a target he has set for himself."], "gemma2:2b": ["Kenenisa Bekele aims to break Haile Gebrselassie's world record in the two mile at the Norwich Union Grand Prix in Birmingham.", "He seeks to follow up on his recent success breaking the world indoor 5,000m record at the same venue.", "The event includes a number of Olympic athletes competing, including Kelly Holmes and Carolina Kluft."], "qwen2.5:0.5b": ["Olympic athlete Bekele aims to add the world indoor two mile record at February’s Norwich Union Grand Prix in Birmingham.", "He is determined to break Haile Gebrselassie's current record of eight minutes, 4.", "69 seconds and wants to surpass it by one minute, while also chasing a target for his own personal best.", "Compatriot Marken Gebrselassie, who won the two mile mark at the same meeting in 2003, will be aiming to break Haile's record.", "The meet has already attracted an influx of Olympic talent with Britain’s 800m and 1500m champion Kelly Holmes, Swedish heptathlon gold medallist Carolina Kluft and a promising men's 4x100m relay team."], "qwen2.5:1.5b": ["Kenenisa Bekele aims to set a new world indoor two-mile record at the February Norwich Union Grand Prix in Birmingham, aiming to match or beat his mentor Haile Gebrselassie's mark of eight minutes, 04.69 seconds.", "He has previously broken the world indoor 5,000m record and will compete against fellow Ethiopian athletes alongside Olympic talent including American sprinter Kelly Holmes and Swedish heptathlete Carolina Kluft in the meet."], "qwen2.5:3b": ["Olympic 10,000m champion Kenenisa Bekele aims to break the world indoor two mile record at February's Norwich Union Grand Prix in Birmingham, where his mentor Haile Gebrselassie previously held the mark.", "Bekele is targeting a new eight-minute record set by Gebrselassie in 2003.", "Other notable participants include Mulugeta Wondimu, Abiyote Abate, and Markos Geneti, who won bronze for Ethiopia in 3000m indoors.", "The event also features Olympic talent such as Kelly Holmes (800m/1500m), Carolina Kluft (heptathlon), and Jason Gardener/Mark Lewis-Francis (4x100m relay)."], "opencoder:1.5b": ["Bekele sets sights on world mark at the Olympic 10,000m champion Kenenisa Bekele is determined to add the world indoor two mile record at February's Norwich Union Grand Prix in Birmingham.", "Gebrselassie, who set the mark at the same meeting in 2003, is no stranger to overhauling world marks at the National Indoor Arena.", "The Ethiopian broke the world indoor 5,000m record on his debut at the meeting last year.", "Compatriots Mulugeta Wondimu, Abiyote Abate and Markos Geneti, the world indoor bronze medallist over 3,000m, will race against Bekele on 18 February."], "smollm:1.7b": ["Bekele sets sights on world mark, Olympic 22-year-old set to add record at February's Norwich Union Grand Prix in Birmingham."], "deepseek-r1:1.5b": ["Bekele is determined to break a world record at Birmingham's 2-mile race.", "He aims to set the same two-mile world record as his mentor in 2003 but also hopes to break it here.", "Bekele will challenge Gebrselassie, who has an eight-minute 45-second record.", "Competitors include Wondimu, Abate, and Geniti from previous races.", "The race on February 18th is set up with athletes like Holmes, Kluft, and others."], "tinyllama:1.1b": ["Kenenisa Bekele, the 22-year-old Olympian from Ethiopia, has set his sights on adding the world indoor two mile record to the mark held by compatriot Haile Gebrselaasie at the Norwich Union Grand Prix in Birmingham.", "The athlete is aiming to break the eight-minute mark and will race against a host of other international competitors, including Britain's Kelly Holmes in the 100m and Carolina Kluft in the 60m hurdles.", "The meet has already attracted some of the world's top athletes, including American triple jump champion LaShawn Merritt and Olympic heptathlon champions Carolina Kluft and Jason Gardenier."], "tinydolphin:1.1b": [" Kenenisa Bekele, Olympic 10,000m champion, has set his sights on the world indoor two mile record at February's Norwich Union Grand Prix in Birmingham.", "The 22-year-old will aim to add the world record to the one he achieved with compatriot Haile Gebrselassie in 2003.", "Bekele is no stranger to overhauling world records at the National Indoor Arena, having broken the previous two mile world indoor mark in 2017."], "phi:2.7b": [" Kenenisa Bekele, an Olympic champion 10K runner from Ethiopia, is aiming to break Haile Gebrselassie's record of eight minutes and four seconds for the indoor two-mile race at the Norwich Union Grand Prix in Birmingham on February 18th.", "Bekele has already set a new world record in the 5K indoors last year.", "Other talented runners in the same event include Kelly Holmes, Carolina Kluft, Mark Gardener, and Mark Lewis-Francis."], "orca-mini:3b": [" Bekele, Kenenisa, aims to break Haile Gebrselassie's world indoor two mile record at the Norwich Union Grand Prix in Birmingham.", "He is determined to do so, having already broken the world indoor 5,000m record on his debut last year.", "Other Olympic talents like Kelly Holmes and Carolina Kluft will compete in the 1000m."], "hermes3:3b": ["Kenenisa Bekele aims to set world indoor two-mile record in Norwich Union Grand Prix meeting in Birmingham, aiming to break Haile Gebrselassie's current record (8:04.69)."], "stablelm-zephyr:3b": ["Olympic 10,000m champion Kenenisa Bekele aims to break the world indoor two mile record at the Norwich Union Grand Prix in Birmingham in February.", "He'll chase the record held by Haile Gebrselassie, which stands at 8 minutes, 4.69 seconds.", "Bekele has previously broken world records at the National Indoor Arena, achieving the same feat last year in the indoor 5,000m event.", "Compatriots Mulugeta Wondimu, Abiyote Abate, and Markos Geneti will also compete against Bekele on February 18th.", "The meet is set to feature a lineup of talented athletes, including British 800m and 1500m champion Kelly Holmes, Swedish heptathlon gold medallist Carolina Kluft, and men's 4x100m relay gold medalists Jason Gardener and Mark Lewis-Francis competing in the 60m event."], "stablelm2:1.6b": ["Kenenisa Bekele aims to break the world indoor two-mile record at February's Norwich Union Grand Prix in Birmingham, following a successful debut last year with fellow Ethiopian Haile Gebrselassie's current record of eight minutes, 2 seconds.", "With experience at the National Indoor Arena, Bekele plans to challenge this mark and continues his pursuit of Olympic success against rivals including Mulugeta Wondimu, Abiyote Abate, and Markos Geneti.", "The event has attracted several Olympic athletes such: Kelly Holmes (Olympic 4m), Carolina Kluft (heptathlon), Jason Gardener & Mark Lewis-Francis (men's 4xm relay)."], "granite3.1-dense:2b": ["Olympic 10,000m champion Kenenisa Bekele, aged 22, intends to challenge Haile Gebrselassie's world two-mile record (8:04.69) at the February Norwich Union Grand Prix in Birmingham.", "Bekele, known for breaking the world indoor 5,000m record at this event last year, will face competition from fellow Ethiopians Mulugeta Wondimu, Abiyote Abate, and Markos Geneti.", "The meet, set to take place on February 18, also features Olympic talents like British 800m and 1500m champion Kelly Holmes, Swedish heptathlon gold medalist Carolina Kluft, and men's 4x100m relay gold medalists Jason Gardener and Mark Lewis-Francis."], "chatgpt-4o-latest": ["Kenenisa Bekele, Olympic 10,000m champion, aims to break the world indoor two-mile record at the Norwich Union Grand Prix in Birmingham.", "The record, set by his mentor Haile Gebrselassie in 2003, stands at 8:04.69.", "Bekele, who previously broke the world indoor 5,000m record at the same venue, will compete against fellow Ethiopians Mulugeta Wondimu, Abiyote Abate, and Markos Geneti on 18 February.", "The event will also feature Olympic champions Kelly Holmes, Carolina Kluft, Jason Gardener, and Mark Lewis-Francis in various races."]}