{"raw_text": "Greek sprinters suspended by IAAF\n \n Greek sprinters Kostas Kenteris and Katerina Thanou have been suspended after failing to take drugs tests before the Athens Olympics.\n \n Athletics' ruling body the IAAF said explanations from the pair and their former coach as to why they missed the tests were \"unacceptable\". It added that Kenteris and Thanou had been \"provisionally suspended pending the resolution of their cases\". They face two-year bans if found guilty by the Greek Athletics Federation. The suspension also covers the athletes' controversial coach, Christos Tzekos. Kenteris, the 2000 Olympic 200m champion, and Thanou, the women's 100m silver medallist from the same Games in Sydney, also face a criminal hearing in Greece over the missed tests. They failed to appear to give samples in Chicago and Tel Aviv shortly before the Athens Games and again in Athens on 12 August, the eve of the opening ceremony. Greek prosecutors have also charged them with faking a midnight motorcycle crash which led to them spending four days in hospital. Some medical staff have been charged with writing false medical reports. Wednesday's statement said the Greek Federation (SEGAS) would convene a disciplinary hearing for the trio to determine whether there had been doping violations.\n \n \"There will be a final right of appeal from the decision of the Greek Federation to the Court of Arbitration for Sport,\" the IAAF said. Tzekos insisted he and the runners had nothing to hide. \"The IAAF's decision means nothing,\" he said. \"We'll be presenting all our arguments to SEGAS - we're innocent.\"\n", "llama3.2:1b": ["Greek sprinters Kostas Kenteris and Katerina Thanou have been suspended by the International Association of Athletics Federations (IAAF) for failing to take drug tests before the Athens Olympics.", "They face two-year bans if found guilty, along with coach Christos Tzekos, who also denies any wrongdoing.", "The suspension covers their actions in Chicago and Tel Aviv as well as their involvement in a fabricated motorcycle crash that led to their hospitalization."], "llama3.2:3b": ["Greek sprinters Kostas Kenteris and Katerina Thanou have been suspended by the IAAF after failing to take drugs tests before the Athens Olympics, facing two-year bans if found guilty.", "They also face a criminal hearing in Greece over missing tests and faking a motorcycle crash.", "Their coach Christos Tzekos is also covered under the suspension.", "The Greek Federation will convene a disciplinary hearing to determine whether there were doping violations."], "gemma2:2b": ["Greek sprinters Kostas Kenteris and Katerina Thanou have been provisionally suspended by the IAAF for missing drug tests before the Athens Olympics.", "Their coach, Christos Tzekos, has also been suspended.", "The pair face a two-year ban if found guilty by the Greek Athletics Federation.", "The Greek athletes missed drug tests in Chicago, Tel Aviv, and Athens, prompting charges of faking a motorcycle crash and false medical reports.", "A disciplinary hearing will be held by the Greek federation to determine their doping violations."], "qwen2.5:0.5b": ["Greece suspended Kostas Kenteris and Katerina Thanou from athletics after failing drug tests, while their former coach was given a temporary ban pending an investigation.", "The IAAF ruled that the pair had been \"provisionally suspended\" due to their failed drug tests in Athens.", "They face two-year bans if found guilty by the Greek Athletics Federation.", "A criminal hearing is set for Kenteris and Thanou over missed doping tests.", "Charges were also made against their coach, Christos Tzekos, for faking a motorcycle accident that led to them spending four days in hospital."], "qwen2.5:1.5b": ["Greek sprinters Kostas Kenteris, Katerina Thanou, and coach Christos Tzekos have been suspended by the International Association of Athletics Federations (IAAF) for failing drug tests before the 2016 Olympics in Athens.", "They face two-year bans if found guilty.", "The trio missed tests in Chicago, Tel Aviv, and Athens due to a criminal investigation into alleged doping violations including faking a motorcycle accident."], "qwen2.5:3b": ["Greek sprinters Kostas Kenteris and Katerina Thanou were suspended by the IAAF after failing drugs tests before Athens Olympics.", "They face two-year bans from Greek Athletics Federation if found guilty, along with controversial coach Christos Tzekos.", "The trio also faces a criminal hearing over missed tests in Chicago and Tel Aviv; they allegedly faked a motorcycle accident to avoid testing at Olympic Games.", "If doping violations are confirmed, the IAAF will allow final appeal through Court of Arbitration for Sport.", "Tzekos insists innocence and plans to present all arguments to Greek Federation."], "opencoder:1.5b": ["Greek sprinters Kostas Kenteris and Katerina Thanou have been suspended after failing to take the drugs tests before the Athens Olympics.", "The athlete who took the test was Christos Tzekos.", "The suspension covers the athletes' controversial coach, Christos Tzekos.", "They face two-year bans if found guilty by the Greek Athletics Federation."], "smollm:1.7b": ["Greek sprinters suspended by IAAF after failing to take drugs tests before Athens Olympics"], "deepseek-r1:1.5b": ["Greek sprinters Kostas Kenteris and Katerina Thanou were suspended after failing to pass drug tests at the Athens Olympics, citing unacceptable explanations from their pair and former coach Christos Tzekos.", "They face a two-year ban if guilty and criminal charges over missing samples, four hospital days in a crash, medical staff lies, and SGA's disciplinary hearing pending resolution."], "tinyllama:1.1b": ["Greek sprinters Kostas Kenteri and Katerinia Thanou have been suspended by the International Association of Athletics Federations (IAAF), after failing to take drug tests before the Athens Olympic Games.", "The athletes were provisionally suspended pending the resolution of their cases, including the suspension of their coach, Christos Tzekos, who was charged with forging doping reports.", "The IAAF statement said the suspensions involved three-year bans if found guilty by SEGA (Sports Federation of Greece) and were \"consequent upon provisional suspension pending the resolution of their cases\".", "Greek prosecutors have also charged some medical staff with writing false medical reports, leading to the trio spending four days in hospital.", "The Athens Olympic Games had already been marred by doping violations involving athletes and coaches, including the suspension of 36-year-old Greek runner Evangelos Kouros over failed drug tests at the Beijing Games."], "tinydolphin:1.1b": [" The Greek sprinters Kostas Kenteris, Katerina Thanou, and Christos Tzekos were suspended after they failed to take drug tests before the Athens Olympics.", "Athletics' ruling body, the IAAF, stated that explanations from the pair and their former coach were \"unacceptable\".", "The athletes face two-year bans if found guilty by the Greek Athletics Federation.", "The suspension also covers the coach, Christos Tzekos.", "The Greek prosecutors have charged the athletes with faking a midnight motorcycle crash that led to them spending four days in hospital, and some medical staff have been accused of writing false medical reports."], "phi:2.7b": [" Greek sprinters Kostas Kenteris, Katerina Thanou, and their former coach Christos Tzekos have been suspended from the IAAF after failing to take drugs tests before the Athens Olympics.", "The athletes face a two-year ban if found guilty of doping violations.", "They also faced criminal charges in Greece over faking a motorcycle crash that led them spending four days in hospital.", "Some medical staff have been charged with writing false medical reports."], "orca-mini:3b": [" The Greek sprinters Kostas Kenteris and Katerina Thanou have been suspended by the IAAF after failing to take drugs tests before the Athens Olympics.", "Their former coach, Christos Tzekos, has also been provisionally suspended pending the resolution of their cases.", "They face two-year bans if found guilty by the Greek Athletics Federation.", "The suspension also covers the athletes' controversial coach, Christos Tzekos.", "The trio have faced charges related to a motorcycle crash that led to them spending four days in hospital and false medical reports being written by some medical staff.", "The Greek Federation will convene a disciplinary hearing to determine whether there were doping violations.", "The IAAF has stated that the decision means nothing and they will present their arguments to SEGAS, but Tzekos maintains his innocence."], "hermes3:3b": ["Greek sprinters Kostas Kenteris and Katerina Thanou suspended by IAAF for missing drug tests before Athens Olympics."], "stablelm-zephyr:3b": ["Greek sprinters Kostas Kenteris and Katerina Thanou have been suspended by the IAAF for failing to take drug tests before the Athens Olympics.", "Their explanations were deemed \"unacceptable,\" and they face two-year bans if found guilty by the Greek Athletics Federation.", "They also miss their coach, Christos Tzekos, who insisted he and the runners had nothing to hide.", "There will be a final right of appeal from the decision of the Greek Federation to the Court of Arbitration for Sport."], "stablelm2:1.6b": ["Greek sprinters Kostas Kenteris and Katerina Thanou, along with their former coach Christos Tzekos, have been suspended by the IAAF due to failed drug tests before the Athens Olympics.", "They face two-year bans if found guilty by the Greek Athletics Federation.", "Suspended athletes also include Kenteris, Olympic champion, and Thanou, silver medallist from the same Games in Sydney.", "The criminal hearing in Greece revolves around missed tests, faking a motorcycle crash for medical purposes, and possible doping violations."], "granite3.1-dense:2b": ["Greek sprinters Kostas Kenteris and Katerina Thanou, along with their former coach Christos Tzekos, have been suspended by the International Association of Athletics Federations (IAAF) for failing to undergo drug tests before the 2004 Athens Olympics.", "The trio is provisionally suspended and faces potential two-year bans if found guilty of doping violations.", "They also stand accused in Greece for faking a motorcycle crash, which led to their hospitalization.", "The IAAF stated that the coach's unacceptable explanations support the suspension, as do those of Kenteris and Thanou.", "A disciplinary hearing will be held by the Greek Athletics Federation (SEGAS) to address doping allegations, with a final appeal possible to the Court of Arbitration for Sport.", "Coach Tzekos maintains their innocence."], "chatgpt-4o-latest": ["Greek sprinters Kostas Kenteris and Katerina Thanou have been suspended by the IAAF for failing to take drug tests before the Athens Olympics.", "The IAAF deemed their explanations and those of their coach, Christos Tzekos, \"unacceptable\" and imposed a provisional suspension pending further investigation.", "They face potential two-year bans if found guilty by the Greek Athletics Federation.", "The athletes also face a criminal hearing in Greece for missing tests in Chicago, Tel Aviv, and Athens, and for allegedly faking a motorcycle crash to avoid testing.", "Greek prosecutors have charged medical staff with falsifying reports.", "The Greek Federation (SEGAS) will hold a disciplinary hearing, with a final appeal possible at the Court of Arbitration for Sport.", "Tzekos maintains their innocence."]}