{"raw_text": "Collins banned in landmark case\n \n Sprinter Michelle Collins has received an eight-year ban for doping offences after a hearing at the North American Court of Arbitration for Sport (CAS).\n \n America's former world indoor 200m champion is the first athlete to be suspended without a positive drugs test or an admission of drugs use. Collins' ban is a result of her connection to the federal inquiry into the Balco doping scandal. The 33-year-old was found guilty of using performance-enhancing drugs. The US Anti-Doping Agency (USADA) decided to press charges against Collins in the summer. The sprinter has consistently protested her innocence but the CAS has upheld USADA's findings. \"The USADA has proved, beyond a reasonable doubt, that Collins took EPO, the testosterone/epitestosterone cream and THG,\" said a CAS statement. \"Collins used these substances to enhance her performance and elude the drug testing that was available at the time.\" So far a total of 13 athletes have been sanctioned for violations involving drugs associated with the Balco doping scandal. World record holder Tim Montgomery is also facing a lifetime ban after being charged by the USADA. His hearing before the CSA has been rescheduled for June next year.\n \n Drug enforcement chiefs in the US have vowed to crack down on cheats. USADA chief executive officer Terry Madden said the action taken against Collins was further proof of that. \"The CAS panel's decision confirms that those who violate the rules will be sanctioned as part of USADA's ongoing efforts to protect the rights of the overwhelming majority of US athletes that compete drug-free,\" said Madden. The USADA has built its cases on verbal evidence given to the federal investigation into Balco rather than test results. The San Francisco-based Balco laboratory faces steroid distribution and money laundering charges. The trial is expected to open next March.\n", "llama3.2:1b": ["Michelle Collins, a 33-year-old American sprinter, was banned from competition for eight years after being found guilty of doping offenses in the summer.", "Collins was linked to the federal inquiry into the Balco doping scandal and used performance-enhancing drugs including EPO and testosterone/epitestosterone cream.", "The US Anti-Doping Agency (USADA) pressed charges against Collins, which were upheld by the North American Court of Arbitration for Sport (CAS)."], "llama3.2:3b": ["Michelle Collins banned for 8 years due to doping offences, connected to Balco scandal, USADA's first conviction without admission or positive test result, 13 athletes sanctioned so far, including Tim Montgomery facing lifetime ban, USADA vows to crack down on cheats with new decisions confirming rule violation sanctions."], "gemma2:2b": ["Michelle Collins was banned for eight years for doping offenses, after being found guilty of using performance-enhancing drugs, despite protesting her innocence.", "This ban comes as part of a larger USADA investigation into the Balco doping scandal.", "13 athletes in total have been sanctioned due to violations connected to the Balco case, including Tim Montgomery who faces a lifetime ban."], "qwen2.5:0.5b": ["American sprinter Michelle Collins, a former world indoor 200m champion, has received an eight-year ban for doping offences after being suspended without positive drugs tests or admitting drug use in a landmark case at the North American Court of Arbitration for Sport (CAS).", "The CAS upheld USADA's findings and her connection to the federal Balco doping scandal.", "Collins' ban is the first athlete to be sanctioned for violations involving performance-enhancing drugs associated with the Balco doping scandal.", "She has protested her innocence but the CAS has upheld USADA's evidence, proving that she used EPO, THG, and other performance-enhancing drugs to improve her endurance race times.", "In total, 13 athletes have been sanctioned by USADA for violations involving drugs associated with the Balco doping scandal.", "World record holder Tim Montgomery is also facing a lifetime ban for violating USADA's rules related to performance-enhancing drugs."], "qwen2.5:1.5b": ["Michelle Collins, former U.S. world indoor 200m champion, banned for eight years after CAS upheld USADA's doping charges; first athlete suspended without positive test or admission.", "13 athletes have been sanctioned involving Balco scandal, including Tim Montgomery facing lifetime ban.", "USADA's cases built on verbal evidence and non-test results; federal inquiry into Balco ongoing with expected trial next March."], "qwen2.5:3b": ["Sprinter Michelle Collins received an eight-year ban for doping offenses after a hearing at the North American Court of Arbitration for Sport (CAS).", "She became the first athlete suspended without a positive test or admission of drug use, linked to the Balco doping scandal.", "The US Anti-Doping Agency (USADA) charged Collins in summer and found her guilty using EPO, testosterone/epitestosterone cream, and THG to enhance performance.", "So far, 13 athletes have been sanctioned for Balco-related violations, with World record holder Tim Montgomery facing a potential lifetime ban.", "USADA's chief executive Terry Madden stated that those who violate rules will be sanctioned as part of their efforts to protect drug-free athletes.", "The trial at the federal investigation into Balco is expected to open in March."], "opencoder:1.5b": ["Collins banned in landmark case\n\nSprinter Michelle Collins, 33-years-old, received an eight-year ban for doping offences at the North American Court of Arbitration (CAS), a hearing that upheld USADA's findings.", "\"The USADA has proved, beyond a reasonable doubt, that Collins took EPO, the testosterone/epitestosterone cream and THG,\" said a CAS statement, highlighting how her use of drugs improved her performance and thwarted drug testing available at the time.", "However, the sprinter has repeatedly propped up her innocence despite the verdict upheld by USADA's findings.", "Tim Montgomery, a world record holder, is also facing a lifetime ban after being charged in court."], "smollm:1.7b": ["Collins banned in landmark case"], "deepseek-r1:1.5b": ["Michelle Collins, a former US Olympic athlete, has been banned for doping at a landmark CAS hearing.", "She is the first athlete suspended without drug testing or drug use admission following her participation in the federal Balco doping scandal.", "The ban, amounting to an eight-year suspension, was sustained by CAS after she cited her connection to the federal investigation.", "USADA's July decision led to the suspension of 13 athletes and Tim Montgomery, who is now facing a lifetime ban with his hearing rescheduled for June next year."], "tinyllama:1.1b": ["The North American Court of Arbitration for Sport (CASB) has imposed a strict ban on sprinter Michelle Collins, finding her guilty of using performance-enhancing drugs after admitting of use before the Balco investigations began.", "The athlete was sanctioned by the CASB after the USA Anti-Doping Agency decided to press charges against her in a summer hearing.", "\"Collins used these substances to enhance her performance and elude the drug testing that was available at the time,\" stated a statement from the Court.", "Collins will receive an eight-year ban, with the first six years being suspended after the athlete was found guilty of using testosterone/epitestosterone cream and tamoxifen during the Balco scandal.", "The 33-year-old sprinter had consistently denied her involvement in drug use but USA Anti-Doping Agency decided to press charges against her after a thorough investigation into the Balco case.", "So far, 13 athletes have been sanctioned for violations involving doping associated with Balco scandal.", "The US has voiced to further crack down on cheats and will continue enforcing drug rules in future cases."], "tinydolphin:1.1b": [" Collins was banned from sports activities after being found guilty of using performance-enhancing drugs in a hearing at the North American Court of Arbitration for Sport (CAS).", "This ban has been handed down by a panel consisting of drug enforcement officials from the US and Canada.", "The decision has had a significant impact on athletes, especially those involved in endurance events such as track and field.", "Collins will not be allowed to participate in any events or competitions during her suspension period.", "This ban is significant because it marks the first time an athlete has been banned for doping-related offenses without having a positive drug test.", "The USADA, which is responsible for enforcing drug laws and regulations in the US, has decided to press charges against Collins following her guilty verdict.", "It remains unclear whether or not she will face any further penalties other than the eight-year ban that has been issued by the CAS."], "phi:2.7b": [" In a landmark case, Michelle Collins, an American sprinter, was banned for eight years after being found guilty of using performance-enhancing drugs without any positive drug tests or admissions of use.", "She is the first athlete to be suspended without such evidence.", "The ban comes as part of a federal inquiry into the Balco doping scandal, which implicated her in the use of EPO and other substances.", "The US Anti-Doping Agency (USADA) pressed charges against Collins in the summer, and the CAS has upheld their findings.", "13 other athletes have already been sanctioned for violations involving the same drugs associated with the Balco scandal.", "World record holder Tim Montgomery is also facing a lifetime ban after being charged by the USADA.", "The USADA's crackdown on cheats will continue as they seek to protect the rights of drug-free American athletes."], "orca-mini:3b": [" Michelle Collins, a former world indoor 200m champion in America, has received an eight-year ban for doping offenses after a hearing at the North American Court of Arbitration for Sport (CAS).", "She was found guilty of using performance-enhancing drugs and the US Anti-Doping Agency (USADA) decided to press charges against her.", "The CAS has upheld USADA's findings, and Collins has been banned from competing in sports events for eight years.", "The CAS statement mentioned that Collins used EPO, testosterone/epitestosterone cream, and THG to enhance her performance and elude drug testing available at the time.", "Tim Montgomery, a fellow athlete, is also facing a lifetime ban after being charged by the USADA.", "His hearing before the CSA has been rescheduled for June next year.", "The drug enforcement chiefs in the US vow to crack down on cheats, and the USADA has taken action against Collins, further proof of that."], "hermes3:3b": ["Michelle Collins get 8-year doping ban without positive test; first athlete suspended for Balco connection."], "stablelm-zephyr:3b": ["Sprinter Michelle Collins received an eight-year ban from the North American Court of Arbitration for Sport (CAS) for doping offenses related to her connection to the federal inquiry into the Balco doping scandal.", "She is the first athlete to be banned without a positive drug test or admission of drug use.", "The US Anti-Doping Agency (USADA) charged Collins with using performance-enhancing drugs, and although she protested her innocence, CAS upheld their findings.", "Thirteen athletes have been sanctioned for violations involving drugs associated with the Balco doping scandal.", "Drug enforcement chiefs in the US vowed to crack down on cheats following the sanctions."], "stablelm2:1.6b": ["Sprinter Michelle Collins receives an eight-year ban for doping offenses, including her connection to the BALCO doping scandal.", "She was found guilty of using performance-enhancing drugs, despite repeatedly protesting innocence.", "This marks the first suspension without a positive test or admission of drug use.", "World record holder Tim Montgomery is facing a lifetime ban due to his involvement in the Balco doping scandal.", "The USADA has built its cases on verbal evidence given to the federal investigation into BALCO rather than test results."], "granite3.1-dense:2b": ["Michelle Collins, a 33-year-old former US indoor 200m champion, has been banned for eight years without prior positive drug tests or confessions by the North American Court of Arbitration for Sport (CAS).", "The ban stems from her involvement in the Balco doping scandal.", "Collins was found guilty of using performance-enhancing substances like EPO, testosterone/epitestosterone cream, and THG to boost her performance, despite protesting her innocence.", "This makes her the first athlete to receive such a ban solely based on connection to the Balco investigation.", "Thirteen athletes have been sanctioned for doping linked to the scandal, with another, Tim Montgomery, facing a potential lifetime ban due to similar charges.", "The US Anti-Doping Agency (USADA) built its case on verbal evidence from the Balco federal inquiry rather than test results.", "CAS confirmed USADA's findings, emphasizing Collins' intent to evade drug testing.", "USADA CEO Terry Madden highlighted this decision as part of their commitment to protect clean athletes and enforce rules against cheaters.", "The trial for the Balco laboratory, accused of steroid distribution and money laundering, is set to begin next March."], "chatgpt-4o-latest": ["Sprinter Michelle Collins has been banned for eight years for doping offences by the North American Court of Arbitration for Sport (CAS), despite never failing a drug test or admitting to drug use.", "Her suspension stems from her involvement in the Balco doping scandal, with the US Anti-Doping Agency (USADA) proving she used performance-enhancing drugs.", "Collins has denied the allegations, but CAS upheld USADA's findings.", "Thirteen athletes have been sanctioned in connection with Balco, and world record holder Tim Montgomery faces a potential lifetime ban.", "USADA has relied on verbal evidence from the federal investigation rather than test results.", "US drug enforcement officials have pledged to continue cracking down on doping, and the Balco laboratory faces trial for steroid distribution and money laundering next March."]}