{"raw_text": "Jones doping probe begins\n \n An investigation into doping claims against Marion Jones has been opened by the International Olympic Committee.\n \n IOC president Jacques Rogge has set up a disciplinary body to look into claims by Victor Conte, of Balco Laboratories. Jones, who says she is innocent, could lose all her Olympic medals after Conte said he gave her performance-enhancing drugs before the Sydney Olympics. But Rogge said it was too early to speculate about that, hoping only that \"the truth will emerge\".\n \n Any decision on the medals would be taken by the IOC's executive board and could hinge on interpretation of a rule stating that Olympic decisions can only be challenged within three years of the Games closing. The Sydney Olympics ended more than four years ago, but World Anti-Doping Agency chief Dick Pound said the rule may not apply because the allegations are only coming out now. \"We will find a way to deal with that,\" Pound said. In a statement released through her attorney Rich Nichols, Jones repeated her innocence and vowed she would be cleared. \"Victor Conte's allegations are not true and the truth will be revealed for the world to see as the legal process moves forward,\" she said. \"Conte is someone who is under federal indictment and has a record of issuing contradictory, inconsistent statements.\"\n", "llama3.2:1b": ["The International Olympic Committee (IOC) has opened an investigation into doping claims against Marion Jones, who denies all allegations.", "The IOC disciplinary body will examine Victor Conte's claims about Jones receiving performance-enhancing drugs before the 2000 Sydney Olympics.", "A decision on the medals could be made by the executive board after three years, but World Anti-Doping Agency chief Dick Pound suggests that the rule may not apply due to recent revelations."], "llama3.2:3b": ["An investigation into doping claims against Marion Jones has been opened by the International Olympic Committee after Victor Conte alleged that Jones received performance-enhancing drugs before the Sydney Olympics.", "Jones denies the allegations and vows to be cleared, while IOC president Jacques Rogge hopes that \"the truth will emerge\" without speculating on potential medal revocation."], "gemma2:2b": ["The International Olympic Committee (IOC) has initiated an investigation into doping claims against Marion Jones.", "Victor Conte alleges he provided her with performance-enhancing drugs before the 2000 Sydney Olympics.", "Jones denies any wrongdoing.", "The IOC's decision on whether to strip her of her medals could hinge on a rule limiting challenges to decisions made within three years of the Games."], "qwen2.5:0.5b": ["An investigation into doping claims against Marion Jones began by the International Olympic Committee (IOC) with the involvement of Victor Conte, Balco Laboratories' representative.", "Conte claimed he gave Jones performance-enhancing drugs before the Sydney Olympics.", "However, IOC president Jacques Rogge hopes that \"the truth will emerge\" and does not speculate about the outcome.", "The decision on medals would be made by the executive board and based on interpretation of a rule stating Olympic decisions can only be challenged within three years from the Games' end date, which ends more than four years after the Sydney Olympics.", "Dick Pound stated that the rule may not apply because the allegations are coming out now, while Rich Nichols reiterated Jones' claim of innocence.", "The attorney said Conte is under federal indictment and has a record of issuing contradictory statements."], "qwen2.5:1.5b": ["The International Olympic Committee investigates doping claims against Marion Jones, potentially leading to her losing all Olympic medals if true, with no concrete outcome expected until further investigation reveals the truth."], "qwen2.5:3b": ["Jones doping probe begins; IOC sets up disciplinary body after Victor Conte claims she used performance-enhancing drugs before Sydney Olympics.", "Jones denies allegations and asserts her innocence.", "Any decision on medals could depend on whether the three-year rule applies due to recent revelations.", "World Anti-Doping Agency chief suggests finding a way to address this.", "Jones reaffirms her innocence and promises legal process will reveal truth."], "opencoder:1.5b": ["\"In this investigation, a doping probe started by an Olympic medalists team, the International Olympic Committee (IOC) president Jacques Rogge set up a disciplinary board to investigate allegations made by Victor Conte, a company specializing in performance-enhancing drugs.", "The_IOC's executive board ruled that if the rule governing Olympic decisions is set to only be challenged three years after the closing of the Games, the Sydney Olympics lasted more than four years.", "After the announcement, a statement from the World Anti-Doping Agency Chief Dick Pound, who said it might not apply due to the lack of recent allegations, suggested a potential resolution method.", "The president then proposed an interim solution that would allow for further investigation and clarification on the true nature of the doping accusations.\""], "smollm:1.7b": ["Jones doping probe begins"], "deepseek-r1:1.5b": ["Jones doping probe begins; IOC investigation into Victor Conte claims; if true, Jones could lose medals; Rogge sets disciplinary body but may delay decision; Olympic executive board decides medal outcomes; rule allows challenges within three years after Games end; Sydney Olympics ended four years ago; rule may not apply due to new allegations; Jones denies doping and vows to clear him."], "tinyllama:1.1b": ["A joint investigation into alleged doping claims against Marion Jones by the International Olympic Committee (IOC) has been launched after the American athlete denies using performance-enhancing drugs during the Sydney Olympics.", "The IOC's executive board is set to consider the results of the investigation, while the rule that only challenges decisions within three years of Games closing could be applied if interpretations are made on allegations that date back more than four years ago.", "Jones has been cleared of any wrongdoing by World Anti-Doping Agency (WADA) chief Craig Reedie, but her lawyer Rich Nichols claims she is \"clearly innocent\" and that the allegations are only coming to light now due to a delay in the process."], "tinydolphin:1.1b": [" The International Olympic Committee (IOC) has opened an investigation into doping claims against American sprinter Marion Jones.", "This comes after Victor Conte alleged that Marion Jones used performance-enhancing drugs before the Sydney Olympics in 2000.", "The IOC president, Jacques Rogge, announced this probe, stating that it was too early to make a judgment on whether Marion Jones is guilty or innocent.", "A decision on the medals could be made by the executive board of the IOC and may hinge on interpretation of an article from the World Anti-Doping Agency (WADA), which says Olympic decisions can only be challenged within three years of the Games closing.", "This statement, however, has sparked debate among experts as to whether this rule actually applies in the case of Jones's allegations or if the timeline for a decision is too short given that the claims have been brought against her years after the Olympics ended."], "phi:2.7b": [" IOC president Jacques Rogge has started an investigation into doping claims against Marion Jones by setting up a disciplinary body.", "Any decision on her Olympic medals would be made later by the executive board and may depend on interpretation of a rule regarding legal challenges.", "Jones maintains her innocence but is waiting for the truth to come out."], "orca-mini:3b": [" The International Olympic Committee opened an investigation into doping claims against Marion Jones after Victor Conte, of Balco Laboratories, made allegations that Jones received performance-enhancing drugs before the Sydney Olympics.", "The IOC's disciplinary body will look into these claims, and it is too early to speculate about whether Jones will lose her Olympic medals.", "The rule stating that Olympic decisions can only be challenged within three years of the Games closing may not apply because the allegations are only coming out now.", "Jones reiterates her innocence and vows to be cleared.", "Conte is someone who has a record of issuing contradictory, inconsistent statements."], "hermes3:3b": ["Marion Jones doping investigation started by IOC; seeks truth about doping claims against Jones."], "stablelm-zephyr:3b": ["The International Olympic Committee (IOC) has opened an investigation into doping claims against Marion Jones, involving Victor Conte's Balco Laboratories.", "IOC president Jacques Rogge set up a disciplinary body to look into the allegations.", "Jones denies any wrongdoing and could potentially lose her Olympic medals if the claims are proven.", "The decision on her medals will be taken by the IOC' executive board, with a rule stating that Olympic decisions can only be challenged within three years of the Games ending.", "However, World Anti-Doping Agency chief Dick Pound suggests that this rule may not apply in this case as the allegations have just emerged."], "stablelm2:1.6b": ["The International Olympic Committee opened an investigation into doping claims against Marion Jones after IOC president Jacques Rogge established a disciplinary body.", "However, Jones could lose all her medals due to allegations by Victor Conte, who claimed she received performance-enhancing drugs before the Sydney Olympics.", "The decision on medal challenge will be made by the IOC's executive board and may depend on interpretation of the rule stating that decisions can only be challenged within three years of the Games closing.", "Jones maintains innocence and vows a legal process will reveal the truth."], "granite3.1-dense:2b": ["The International Olympic Committee (IOC) has initiated an investigation into doping allegations against Marion Jones by Victor Conte, the founder of Balco Laboratories.", "Conte claims he provided Jones with performance-enhancing drugs before the 2000 Sydney Olympics.", "If proven, this could result in Jones losing all her Olympic medals.", "IOC President Jacques Rogge emphasized that it's premature to speculate on potential outcomes, hoping for the truth to surface.", "The decision would be made by the IOC's executive board, potentially considering a three-year rule stating Olympic decisions can't be challenged after four years from the Games' end.", "World Anti-Doping Agency (WADA) chief Dick Pound suggested this rule may not apply due to the late emergence of allegations.", "Jones, through her attorney, maintains her innocence and expects full exoneration as the legal process progresses.", "She criticized Conte's history of inconsistent statements and his current federal indictment."], "chatgpt-4o-latest": ["The International Olympic Committee has launched an investigation into doping allegations against Marion Jones, based on claims by Victor Conte of Balco Laboratories.", "Jones, who denies the accusations, could lose her Olympic medals if the claims are proven.", "IOC president Jacques Rogge emphasized that it is too early to speculate on the outcome.", "The decision on her medals may depend on the interpretation of a rule limiting challenges to Olympic results within three years, though World Anti-Doping Agency chief Dick Pound suggested the rule may not apply in this case.", "Jones reiterated her innocence, dismissing Conte’s allegations as false and inconsistent."]}