{"raw_text": "Johnson accuses British sprinters\n \n Former Olympic champion Michael Johnson has accused Britain's top sprinters of lacking pride and ambition.\n \n \"At the moment, the biggest factor on the mind of British sprinters is to be number one in Britain,\" the world 200m and 400m record holder told Five Live. \"Athletics at the moment is all about international competitions and they need to show a little more pride.\" However, Linford Christie countered: \"It's easy to criticise when you haven't gone through the system here.\" Johnson was involved in a verbal spat with Britain's Darren Campbell earlier this year. The American had cast doubt on Campbell's claims he had torn a hamstring in the wake of his failure to reach the Olympic 100m and 200m finals.\n \n And the American remains highly critical of aspects of British sprinting. \"The only time you see British sprinters getting upset or riled is when there is a debate as to which one is better than the other,\" he claimed. \"Athletes here have to compete more outside the UK. Their focus has to be on being the best in the world and not just on being the top British sprinter.\" Speaking at an elite coaches' conference in Birmingham, Johnson also argued that although there has been more investment in the sport in Britain, it had not necessarily reaped the rewards. \"You can't fix everything with money,\" he admitted. \"You contrast the situation here to that of some US athletes who have no funding. \"Those who aren't funded might be hungrier and more motivated because their road to success is a lot more difficult and challenging. \"So when they get to the top they are more appreciative.\"\n", "llama3.2:1b": ["Michael Johnson accuses British sprinters of lacking pride and ambition, citing their focus on international competitions rather than being number one in Britain.", "Linford Christie counters that criticizing British sprinters after going through the system is unfair.", "Johnson also criticizes British athletes' lack of motivation due to external factors such as funding, calling those without it hungrier and more motivated."], "llama3.2:3b": ["Michael Johnson accuses British sprinters of lacking pride and ambition, claiming they prioritize being Britain's number one over international competition.", "He criticizes the focus on domestic debates rather than global achievements, saying athletes should strive to be world-class rather than just best in Britain.", "Johnson also argues that investment has not necessarily led to improved results, suggesting that some US athletes, without funding, are more motivated and appreciative of their success."], "gemma2:2b": ["Michael Johnson criticized British sprinters for prioritizing national recognition over global competition, saying they lack ambition and pride.", "He also criticized Darren Campbell's claims about hamstring injuries after Olympic failures.", "Michael Johnson further argued that increased investment hasn't translated into better results, and suggested that athletes without funding are often more motivated to succeed."], "qwen2.5:0.5b": ["British sprinters are often criticized for lacking pride and ambition, but American runner Darren Campbell has accused Johnson of this.", "In his speech at an elite coaches' conference in Birmingham, Johnson argued that British athletes should focus on being world-class competitors rather than just their own country's top sprinter.", "He also claimed that there is a debate about the best athlete in Britain to compete with."], "qwen2.5:1.5b": ["Michael Johnson accuses British sprinters of lacking pride and ambition, emphasizing international competitions over national dominance and criticizing underperformance in major events despite financial investment."], "qwen2.5:3b": ["Former Olympic champion Michael Johnson has accused Britain's top sprinters of lacking pride and ambition, focusing too much on being number one in Britain rather than competing internationally.", "Linford Christie countered that criticism by pointing out the challenges sprinters face in British athletics.", "Johnson also noted a lack of competitive spirit among British sprinters and suggested athletes need to prioritize international success over just being the best in Britain.", "He further criticized the level of investment in British sports, comparing it unfavorably to some US athletes who work harder without financial support."], "opencoder:1.5b": ["Former Olympic champion Michael Johnson has accused Britain's top sprinters of lacking pride and ambition.", "John has criticized British sprinting for showing a lack of confidence in them.", "He said that the biggest factor on the mind of British sprinters is to be number one in Britain, while he also pointed out that it's easy to criticise when you haven't gone through the system here."], "smollm:1.7b": ["Johnson accuses British sprinters of lacking pride and ambition.", "At the moment, the biggest factor on the mind of British sprinters is to be number one in Britain.", "Aathletics at the moment is all about international competitions and they need to show a little more pride.", "However, Linford Christie countered: \"It's easy to criticise when you haven't gone through the system here.\"", "Johnson was involved in a verbal spat with Britain's Darren Campbell earlier this year.", "The American had cast doubt on Campbell's claims he had torn a hamstring in the wake of his failure to reach the Olympic 100m and 200m finals.", "And the American remains highly critical of aspects of British sprinting.", "\"The only time you see British sprinters getting upset or riled is when there is a debate as to which one is better than the other,\" he claimed.", "\"Athletes here have to compete more outside the UK.", "Their focus has to be on being the best in the world and not just on being the top British sprinter.\"", "Speaking at an elite coaches' conference in Birmingham, Johnson also argued that although there had been more investment in the sport in Britain, it had not necessarily reaped the rewards.", "\"You can't fix everything with money,\" he admitted.", "\"You contrast the situation here to that of some US athletes who have no funding.", "Those who aren't funded might be hungrier and more motivated because their road to success is a lot more difficult and challenging.", "So when they get to the top they are more appreciative.\""], "deepseek-r1:1.5b": ["Johnson accuses British sprinters of lacking pride and ambition, stating they show more through international competition rather than personal success.", "Linford counters critics who find it easy to criticize without a system.", "Johnson argues that funding isn't enough for sports success and that encouraging competition outside the UK helps sprinters achieve greatness."], "tinyllama:1.1b": ["Johnson accuses British sprinters of lacking ambition, expressing frustration that top athletes have not shown as much pride in their country as their American counterparts do.", "The former Olympic champion also questions the focus on Britain's best sprinters being ranked outside of the UK rather than focusing solely on being the best internationally.", "Despite a recent spat with British sprinter Darren Campbell, Johnson remains critical of aspects of British athletics and admits that money has not always equated to success."], "tinydolphin:1.1b": [" The British sprinters accuse their competitors of lacking ambition and pride, while accusing foreign sprinters of having a better reputation for international competition.", "Johnson believes that Britain's athletes may not be as committed to being the best in the world due to increased investment in the sport.", "He also criticizes the way some athletes are treated outside of Britain.", "Linford Christie countered with a defensive statement, expressing frustration about his exclusion from the Olympic finals.", "Johnson's comments come amidst a verbal spat between the two athletes earlier this year."], "phi:2.7b": [" Former Olympic champion Michael Johnson accuses Britain's top sprinters of lacking pride and ambition, stating that athletes in the UK should focus on being the best in the world rather than just the top British sprinter.", "He also argues that although there has been more investment in the sport in Britain, it hasn't necessarily led to better results compared to some US athletes who have no funding but are more motivated due to their difficult journey to success."], "orca-mini:3b": [" Johnson accused Britain's top sprinters of lacking pride and ambition.", "Linford Christie disagreed, saying that it was easy to criticize when one has not gone through the system.", "Johnson remains critical of aspects of British sprinting and believes that athletes should focus on being the best in the world rather than just being the top British sprinter."], "hermes3:3b": ["Michael Johnson accuses British sprinters of lacking pride, ambition, and focus on world-level competition instead of just being UK's best."], "stablelm-zephyr:3b": ["Former Olympic champion, Michael Johnson, criticizes Britain's top sprinters for lacking pride and ambition.", "He suggests that British athletes should focus on being the best in the world instead of just being the top British sprinter.", "Johnson also compares the situation to US athletes who might be more motivated due to facing a more challenging road to success.", "Linford Christie counters, mentioning that it's easy to criticize without going through the British sprinting system."], "stablelm2:1.6b": ["Former Olympic champion Michael Johnson criticized Britain's top sprinters for lacking pride and ambition, while UK athlete Linford Christie defended them.", "Johnson argued that British sprinters focus on being the best in the world rather than just being top British performers.", "He also mentioned how athletes face more competition outside of the UK due to funding issues.", "A comparison was made between the situation in Britain and that of US athletes without financial support."], "granite3.1-dense:2b": ["Michael Johnson, a former Olympic champion, criticizes British sprinters for lacking international pride and ambition, focusing primarily on being the best in the UK rather than striving for global dominance.", "He suggests that their competitive spirit is ignited only when debating individual superiority within the country, not in international events.", "Johnson also highlights that while Britain has invested more in athletics, it hasn't yielded optimal results compared to unfunded US athletes who may be more motivated and appreciative due to their arduous path to success.", "This critique was part of a verbal exchange with Darren Campbell following Johnson's doubts about Campbell's injury claims after his Olympic disqualifications."], "chatgpt-4o-latest": ["Michael Johnson criticized British sprinters for lacking pride and ambition, focusing too much on being the best in Britain rather than excelling internationally.", "He argued that they need to compete more outside the UK and prioritize global success.", "Linford Christie defended British athletes, saying Johnson did not understand their system.", "Johnson also questioned Darren Campbell's injury claims and remained critical of British sprinting culture.", "Speaking at a coaching conference, he noted that increased investment in British athletics had not necessarily led to success, suggesting that US athletes without funding might be more motivated due to their tougher path to the top."]}