{"raw_text": "IAAF to rule on Greek sprint pair\n \n Greek sprinters Kostas Kenteris and Katerina Thanou are expected to find out on Wednesday if they will be banned for missing drugs tests this summer.\n \n The International Association of Athletics Federations (IAAF) council held a conference call on Tuesday and are set to announce their decision. Kenteris and Thanou could be suspended for up to two years. The duo withdrew from the Olympics after missing a test but claimed they had suffered a motorcycle crash. The Greek authorities have also brought criminal charges against the sprinters for avoiding a drugs test and faking an accident. Their former coach Christos Tzekos is also facing charges and all three are awaiting a trial date.\n \n However, the IAAF will determine the sprinters' future on the track after carefully considering all the evidence. The sport's ruling body is expected to direct the Greek federation in what action it should take against the sprinters. Kenteris and Thanou can appeal against any decision at the Court of Arbitration for Sport. The sprinters both sent written explanations to the IAAF, which have been taken into account. The IAAF sent an official warning to the sprinters and coach Tzekos after they were discovered training in Qatar rather than in Crete, where they had said they would be. But Kenteris and Thanou then went on to skip tests in Tel Aviv and Chicago, when they decided to fly back to Greece early. Just before the Olympics, the pair dramatically missed another test in Athens before withdrawing from the Games. Kenteris, 31, won gold in the 200m at the Sydney Olympics in 2000, where Thanou, 29, won silver in the 100m.\n", "llama3.2:1b": ["Greek sprinters Kostas Kenteris and Katerina Thanou are set to face a two-year ban from competition after missing drugs tests this summer.", "The International Association of Athletics Federations (IAAF) council will announce its decision on Wednesday, with possible suspensions for up to two years."], "llama3.2:3b": ["Greek sprinters Kostas Kenteris and Katerina Thanou are expected to find out if they will be banned for missing drug tests this summer after a conference call by the IAAF council.", "They could face up to two years of suspension.", "The duo claimed a motorcycle crash but Greek authorities brought criminal charges against them, their coach Christos Tzekos also faces charges."], "gemma2:2b": ["Katerina Thanou and Kostas Kenteris face potential two-year suspension from the IAAF for missing drug tests this summer.", "The IAAF is expected to rule on their case Wednesday.", "The duo's withdrawal from the Olympics after missing tests and a possible fake accident has led to criminal charges against them and their coach.", "They can appeal the decision at the Court of Arbitration for Sport."], "qwen2.5:0.5b": ["The International Association of Athletics Federations (IAAF) will rule on whether Greek sprinters Kostas Kenteris and Katerina Thanou should be banned for missing drugs tests this summer.", "The IAAF council is set to announce their decision, with the duo potentially suspended for up to two years.", "While both coaches and former teammates are facing criminal charges and trials, the IAAF will consider all evidence before ruling on whether they should be banned from the Olympics."], "qwen2.5:1.5b": ["The IAAF council will decide on Wednesday whether Greek sprinters Kostas Kenteris and Katerina Thanou, who missed drug tests after withdrawing from the Olympics, will be banned for up to two years."], "qwen2.5:3b": ["IAAF to rule on Greek sprinters Kostas Kenteris and Katerina Thanou after missing tests this summer.", "They could face up to two-year bans.", "The IAAF will decide their future based on all evidence; they can appeal at CAS.", "Former coach Christos Tzekos is also facing charges.", "Initially accused of a motorcycle crash, the pair skipped tests in Tel Aviv and Chicago before withdrawing from Olympics due to another missed test in Athens.", "Both sent explanations, which were considered by IAAF."], "opencoder:1.5b": ["The International Association of Athletics Federations (IAAF) to rule on a Greek sprint pair who were expected to find out on Wednesday if they will be banned for missing drugs tests this summer.", "After hearing the IAAF's decision, the pair left the Olympics and had a motorcycle crash.", "The Greek authorities have also brought criminal charges against the sprinters for avoiding a drugs test and faking an accident.", "The former coach Christos Tzekos is facing charges and both are awaiting a trial date.", "However, the IAAF will determine the future of the sprinters after considering all the evidence.", "The sport's ruling body has taken the decision and directed the Greek federation in what action it should take against the sprinters.", "The pair can appeal their decisions at the Court of Arbitration for Sport.", "The sprinters both sent written explanations to the IAAF, which have been taken into account.", "They have also been sent an official warning to the sport's court.", "In Qatar, they were inconsiderable when it was announced that they would be flying back to Greece early.", "After the Olympics, they missed another test in Athens before withdrawing from the Games."], "smollm:1.7b": ["The summary should be:\nIAAF to rule on Greek sprint pair's drug test ban"], "deepseek-r1:1.5b": ["Katerina Thanou and Kostas Kenteris are expected to be reviewed by the International Association of Athletics Federations (IAAF) for missing drug test results before the Greek sprinters compete in the Olympics.", "They could face suspension up to two years if they miss tests.", "The pair withdrew from the Olympics after an incident, though authorities charge them for avoiding a test and faking an accident.", "Their coach Christos Tzekos is also charged, with all three on trial.", "The IAAF will decide their future in careful consideration of evidence.", "They can appeal against any ruling at the Court of Arbitration for Sport.", "Katerina won gold in the 200m at the Sydney Olympics, while Kostas won silver in the 100m there."], "tinyllama:1.1b": ["The International Association of Athletics Federations (IAAF) is expected to announce its decision on Wednesday regarding the Greek sprinters Kostas Kenteri and Katerinia Thanou who were suspended for missing drug tests this summer due to a motorcycle crash and an alleged motorbike accident, respectively.", "The IAAF council will hold a conference call on Tuesday and is expected to announce the duo's future on track, after carefully considering all evidence in their decision.", "The sprinters have submitted written explanations that were taken into account by the governing body, but Kenteri and Thanou can appeal against any decision at the Court of Arbitration for Sport.", "Both sent official warnings to the IAAF after being found guilty of training in Qatar rather than in Crete as they had initially claimed.", "However, Kenteri and Thanou then skipped tests in Athens before withdrawing from the Olympics."], "tinydolphin:1.1b": [" IAAF to rule on Greek sprinters' absence from Olympics due to missing drugs tests"], "phi:2.7b": [" The IAAF is set to rule on the Greek sprinters' suspension for missing drugs tests this summer after a motorcycle crash was claimed by the duo.", "If banned, Kenteris and Thanou could be suspended for up to two years.", "Their former coach is also facing charges.", "However, they can appeal against any decision at the Court of Arbitration for Sport."], "orca-mini:3b": [" The Greek sprinters Kostas Kenteris and Katerina Thanou are expected to face disciplinary action from the IAAF after missing drugs tests this summer.", "They claimed they had a motorcycle crash, but their former coach and authorities have brought criminal charges against them for avoiding a drugs test and faking an accident.", "The IAAF will decide on their future on the track after carefully considering all the evidence.", "Kenteris and Thanou sent written explanations to the IAAF, which have been taken into account.", "They were warned by the IAAF after being discovered training in Qatar instead of Crete and then went on to skip tests in Tel Aviv and Chicago.", "Just before the Olympics, they dramatically missed another test in Athens before withdrawing from the Games.", "Kenteris won gold in the 200m at the Sydney Olympics in 2000, where Thanou won silver in the 100m."], "hermes3:3b": ["IAAF to decide on banning Greek sprinters Kostas Kenteris and Katerina Thanou for missing drugs tests."], "stablelm-zephyr:3b": ["Greek sprinters Kostas Kenteris and Katerina Thanou face potential bans of up to two years for missing drug tests this summer.", "The International Association of Athletics Federations (IAAF) council will decide on Wednesday whether they should be suspended.", "Greek authorities have also charged the athletes and their former coach with criminal charges.", "The IAAF will consider all evidence before directing the Greek federation to take action against the sprinters, who can appeal any decision at the Court of Arbitration for Sport."], "stablelm2:1.6b": ["The International Association of Athletics Federations (IAAF) will make a decision on whether Greek sprinters Kostas Kenteris and Katerina Thanou should be suspended for up to two years due to missing drugs tests this summer.", "The IAAF council held a conference call but did not announce their decision.", "If found guilty, they could face a suspension of up to two years.", "Both athletes withdrew from the Olympics after missing tests but claimed they suffered a motorcycle accident and faced criminal charges in Greece for avoiding a drug test and falsifying an accident claim.", "Their former coach, Christos Tzekos, is also facing similar charges.", "The IAAF will determine Kenteris and Thanou's future on the track after considering all evidence.", "They can appeal any decision at the Court of Arbitration for Sport."], "granite3.1-dense:2b": ["The International Association of Athletics Federations (IAAF) is set to announce on Wednesday whether Greek sprinters Kostas Kenteris and Katerina Thanou will receive up to two-year bans for missing drug tests this summer.", "The pair, who withdrew from the 2004 Athens Olympics after failing to attend a test, are also facing criminal charges in Greece for avoiding a test and faking an accident.", "Kenteris won gold in the 200m at the 2000 Sydney Olympics, while Thanou secured silver in the 100m.", "Their former coach, Christos Tzekos, is also charged and awaiting trial.", "The IAAF will consider all evidence before directing the Greek federation on potential disciplinary actions, with Kenteris and Thanou having the right to appeal through the Court of Arbitration for Sport."], "chatgpt-4o-latest": ["Greek sprinters Kostas Kenteris and Katerina Thanou are awaiting an IAAF decision on whether they will be banned for up to two years for missing drug tests.", "They withdrew from the Olympics after claiming they had a motorcycle accident, but Greek authorities have charged them with avoiding a test and faking the crash.", "Their former coach, Christos Tzekos, also faces charges.", "The IAAF is reviewing the evidence and will direct the Greek federation on further action, with the sprinters having the option to appeal.", "They previously received a warning for training in Qatar instead of Crete and missed multiple tests in Tel Aviv, Chicago, and Athens before withdrawing from the Games.", "Kenteris won 200m gold at the 2000 Sydney Olympics, while Thanou took silver in the 100m."]}