{"raw_text": "Gebrselassie in London triple bid\n \n Double Olympic 10,000m champion Haile Gebrselassie will race in the London Marathon for the next three years.\n \n The Ethiopian legend won Sunday's Almeria half-marathon in Spain on his return from an operation on his Achilles tendon. He was third in London in 2002 in his first serious attempt at the marathon. \"It is a coup for us to secure Haile's presence for the next three years and it guarantees a quality race,\" said race director David Bedford. Gebrselassie will face Olympic champion Stefano Baldini, world champion Jaouad Gharib, and arch-rival Paul Tergat, the current world record holder. \"If I didn't think I could win I would not be here,\" said Gebrselassie, who has set world records on 18 occasions in his illustrious career and is keen to add the marathon record to his collection. \"There are a lot of fantastic runners in the race but I shall be doing my utmost to upset them.\"\n", "llama3.2:1b": ["Haile Gebrselassie will run in the London Marathon for three years starting with Sunday's Almeria half-marathon win."], "llama3.2:3b": ["Haile Gebrselassie will compete in the London Marathon for three years starting from this year's event, guaranteeing a high-quality race with top athletes like Stefano Baldini and Paul Tergat."], "gemma2:2b": ["Haile Gebrselassie will race in the London Marathon for the next three years, joining Olympic champion Stefano Baldini, world champion Jaouad Gharib and Paul Tergat, who holds the current world record.", "Gebrselassie is aiming to win the marathon record."], "qwen2.5:0.5b": ["Haile Gebrselassie will compete in London Marathon for three years, as Almeria half-marathon winner was third in 2002 and won world records on 18 occasions."], "qwen2.5:1.5b": ["Gebrselassie, double Olympic 10,000m champion, will run London Marathon for three years after securing world records and aiming to break the marathon record.", "Competing against Olympic champions, world champions, and arch-rivals."], "qwen2.5:3b": ["Gebrselassie, a triple Olympic 10,000m champion, will run the London Marathon for three years starting from next year.", "He won a half-marathon in Spain and placed third in London in 2002.", "The race director views this as an advantage due to Gebrselassie's presence.", "He faces competition from Baldini, Gharib, and Tergat, the current world record holder.", "Expressing his confidence to win, Gebrselassie aims to upset other runners in the race despite their quality."], "opencoder:1.5b": ["Gebrselassie in London triple bid, who will race in the London Marathon for the next three years.", "Haile Gebrselassie won a double Olympic 10,000m champion athlete in Spanish on his return from an operation on his Achilles tendon.", "He was third in London in 2002 and promised a quality race.", "\"Gebrselassie will face Stefano Baldini, Jaouad Gharib, and Paul Tergat – with plans to upset them, I am sure they will be pleased,\" said Gebrselassie's director David Bedford."], "smollm:1.7b": ["Gebrselassie will race in London for the next three years, with the possibility of winning the Olympic 10,000m title and securing the world record.", "He has already won the London Marathon twice, and is keen to add the marathon record to his collection."], "deepseek-r1:1.5b": ["Gebrselassie will race in London's marathon for the next three years as a triple-bidding Olympic 10K champion.", "He returned to marathons after an Achilles tendon operation and placed third in London's marathon in 2002.", "Director David Bedford hopes Gebrselassie can secure his presence, aiming for a quality race.", "The race will feature Stefano Baldini, Jaouad Gharib, and Paul Tergat, with Gebrselassie confident to win and plan to outdo them all."], "tinyllama:1.1b": ["In the upcoming London Marathon, Ethiopian legend Haile Gebrselaasie will race for three years alongside world champion Stefanó Baldini, Olympic champion Jaouad Gharib, and world record holder Paul Tergat.", "The three-time Olympian won the Almeria half-marathon in Spain last weekend with a time of 1:00:52, which guarantees a top performance at the marathon.", "Despite not being sure if he could win, Gebrselaasie said that he will do everything possible to upset his rivals.", "The race is set to take place on April 4th and 5th, and will be broadcast live by NBC."], "tinydolphin:1.1b": [" Gebrselassie will compete in the London Marathon for three years, solidifying himself as an accomplished athlete and continuing his unparalleled career in the sport.", "He has won the Almeria half-marathon in Spain earlier this year and will now aim to conquer the marathon distance at the London Marathon in 2015.", "This prestigious event attracts some of the world's best runners, including Olympic champions, and presents a unique opportunity for Gebrselassie to showcase his exceptional skills on the treadmills."], "phi:2.7b": [" Haile Gebrselassie will compete in the London Marathon for three years after winning the Almeria half-marathon.", "He hopes to add the world record to his collection and intends to challenge for victory despite facing tough competition."], "orca-mini:3b": [" Haile Gebrselassie, an Ethiopian legend and double Olympic 10,000m champion, will participate in the London Marathon for the next three years.", "He won Sunday's Almeria half-marathon in Spain and was third in London in 2002 in his first serious attempt at the marathon.", "He will face Olympic champion Stefano Baldini, world champion Jaouad Gharib, and Paul Tergat, the current world record holder."], "hermes3:3b": ["Haile Gebrselassie triple bids for London Marathon over 3 years, after winning Almeria half-marathon post-Achilles operation."], "stablelm-zephyr:3b": ["Haile Gebrselassie, the double Olympic 10,000m champion, will compete in the London Marathon for three years starting in 2013.", "He recently won a half-marathon in Spain after recovering from an Achilles tendon operation.", "Gebrselassie previously participated in the marathon in 2002, finishing third.", "The race director is excited to have him join for the next three years and mentioned that his presence guarantees a high-quality competition.", "Gebrselassie will face other notable runners including Olympic champion Stefano Baldini, world champion Jaouad Gharib, and arch-rival Paul Tergat, who holds the current world record for marathons.", "Gebrselassie is eager to set a new marathon record and believes he can beat other talented competitors in the race."], "stablelm2:1.6b": ["Ethiopian legend Haile Gebrselassie will compete in the London Marathon for the next three years, facing off against fellow athletes Stefano Baldini, Jaouad Gharib, and Paul Tergat.", "After an operation on his Achilles tendon, Gebrselassie won the Almeria half-marathon in Spain before facing London's third-place finish.", "He aims to add the marathon record to his collection and challenge for victory in the prestigious race."], "granite3.1-dense:2b": ["Haile Gebrselassie, a dual Olympic 10,000m champion from Ethiopia, has committed to competing in the London Marathon for the upcoming three years.", "After recovering from an Achilles tendon operation, he won the Almeria half-marathon on Sunday.", "Gebrselassie, known for his 18 world record-setting performances, will race alongside Olympic champion Stefano Baldini, world champion Jaouad Gharib, and current world record holder Paul Tergat in London.", "Despite the strong competition, Gebrselassie expressed determination to challenge for the win, aiming to add the marathon record to his impressive legacy."], "chatgpt-4o-latest": ["Haile Gebrselassie, the double Olympic 10,000m champion, has committed to competing in the London Marathon for the next three years.", "Returning from Achilles tendon surgery, he recently won the Almeria half-marathon in Spain.", "Gebrselassie, who finished third in London in 2002, will face top competitors including Olympic champion Stefano Baldini, world champion Jaouad Gharib, and world record holder Paul Tergat.", "Confident in his chances, Gebrselassie aims to win and add the marathon world record to his 18 career world records."]}