{"raw_text": "Johnson edges out rival Sotherton\n \n Jade Johnson edged out rival Kelly Sotherton with her last effort to claim the AAAs long jump title at the Norwich Union European Indoor trials.\n \n Olympic heptathlon bronze medallist, Sotherton, led the event with her first leap of 6.43m - a personal best. But Johnson, who has not competed indoors for five years, leapt to a life-time best of 6.50m in her last jump, after four fouls. Both Johnson and Sotherton passed the European Championships qualifying mark. Although Sotherton's main aim in Madrid next month will be the pentathlon where she will take on Olympic heptathlon champion Carolina Kluft. Ireland's\n \n delivered a shock in the men's 200m as he stormed to his first major title in 21.01 seconds. British favourite Chris Lambert had to settle for second place while defending champion Ireland's Paul Brizzel took third. There was some consolation for Lambert as he set a personal best of 20.94 in the first round - good enough to qualify for Europe.\n \n Two-time AAAs champion Allyn Condon and Ian Mackie had no such luck as they were disqualified in the heats. There was plenty of hot action in the men's 60m hurdles where Scotland's\n \n was vying for top spot with Olympian Andy Turner. Scott, 22, smashed his personal best on the way to the final, where he broke it again to win the AAAs title in 7.58 seconds. Turner finished second in 7.82 after previously setting a personal best on the 7.83 in the semi-finals, while Damien Greaves did not finish the final. The trio of athletes have reached the European qualifying mark this season though one of them is set to miss out on a call-up to the British squad.\n \n comfortably defended her 3,000m title, clocking eight minutes, 49.87 seconds to easily surpass the European qualifying mark. The European cross country bronze medallist is ranked number one in Europe this season and will go to Madrid with high hopes. Helen Clitheroe was agonisingly close to the 9:05.00 qualifying mark as she claimed the runners-up spot in a personal best of 9:05.73. In the men's 800m heats,\n \n qualified fastest in the 800m heats to lay down a challenge to in-form\n \n . The Welsh runner attacked the last 200m to come through ahead of James Thie in one minute, 49.87 seconds. McIlroy, who is third in the European rankings, eased across the finish in 1:50.87 to set up a showdown in Sunday's final in Sheffield. Both Watkins and McIlroy have already achieved the European qualifying mark. Scotland's Susan Deacon stole\n \n 's thunder in the final of the women's 200m. Fraser became the fastest British woman over the distance this season when she qualified for the final in 23.68 seconds - though that time is outside the European standard. But Deacon claimed her first AAAs title over the distance, edging Fraser into second in 23.67. In the women's shot put veteran\n \n claimed her fourth AAAs title with a throw of 15.27m. But that mark was not good enough for the 39-year-old to book her place at next month's European Indoor Championships in Madrid. Sotherton finished fifth after producing two throws of 13.77m. In the absence of injured British number one Carl Myerscough,\n \n claimed the men's shot put title with a throw of 17.64m, which was below the qualifying mark.\n \n Sale's Robert Mitchell climbed to a season's best of 2.20m - just 3cm short of the European standard - to claim the British indoor high jump title.\n \n could only clear 2.16m to finish in fourth but the 27-year-old's disappointment will be tempered as he had already achieved the qualifying mark at a meeting in Slovenia on Tuesday. There was bad luck for British number one\n \n in the pole vault as he failed to clear the bar after deciding to come in at 5.45m. The AAAs indoor title went instead to Ashley Swain, who climbed to a season's best of 5.25m And Ireland's Taniesha Scanlon set a new national record of 13.28m in the women's triple jump.\n", "llama3.2:1b": ["Johnson edges out Sotherton in long jump trials\nOlympic heptathlon bronze medallist Jade Johnson edged out rival Kelly Sotherton with her last effort to claim the AAAs long jump title at the Norwich Union European Indoor trials.", "Sotherton led the event with a first leap of 6.43m, but Johnson's lifetime best of 6.50m in her last jump passed the qualifying mark after four fouls.", "Both athletes passed the European Championships qualifying mark.", "Sotherton aimed to compete in the pentathlon at Madrid next month, where Olympic heptathlon champion Carolina Kluft will take on Sotherton and Ireland's Paul Brizzel.", "Condon and Mackie were disqualified from the heats due to technical errors."], "llama3.2:3b": ["Jade Johnson edged out Kelly Sotherton for the AAAs long jump title at Norwich Union European Indoor trials with a life-time best of 6.50m, passing the qualifying mark.", "Ireland's Jonathan Edwards won the men's 200m in 21.01 seconds, while Scott Hastings took the AAAs title in the 60m hurdles.", "Tasha Danvers comfortably defended her 3,000m title, while Jordan Williamsz set a new personal best in the men's 800m heats.", "Susan Deacon won the women's 200m, and Colin Coombe claimed his fourth AAAs title in the shot put event."], "gemma2:2b": ["Johnson won the long jump; Sotherton was second; both passed the European qualifying mark.", "Irish athlete Scott won the 60m hurdles.", "Clitheroe won the 3000m.", "McIlroy and Watkins qualified fastest for the men's 800m final; Mcllroy and Watkins have already met the qualifying mark.", "Deacon won the women's 200m; Fraser was second.", "Veteran Phillips won the women's shot put; Sotherton finished fifth.", "Mitchell won the men's high jump;  Swain won the pole vault; Scanlon set a national record in the triple jump."], "qwen2.5:0.5b": ["Johnson edged out Sotherton at the AAAs long jump trials by jumping to 6.50m, beating her own personal best and setting a new European indoor title.", "Both athletes passed the qualifier mark for the European Championships.", "Allyn Condon was eliminated in the heats, while Paul Brizzel took third place.", "Scotland's second-place runner, Andy Turner, finished ahead of Scottish sprinter Jamie McIlroy, who set an Olympic record in 800m hurdles with a personal best of 1:50.73.", "Erin Clitheroe claimed the women's 800m heats while Fraser won the men's shot put with a throw of 15.27m."], "qwen2.5:1.5b": ["Jade Johnson won the AAAs long jump title with a personal best at the Norwich Union European Indoor trials, while Kelly Sotherton led the heptathlon qualifying but was beaten by Johnson.", "Scott won the men's 60m hurdles, McIlroy secured the European cross country bronze in 3,000m, and Deacon triumphed in the women's 200m at the event."], "qwen2.5:3b": ["Jade Johnson won the AAAs long jump with a personal best jump of 6.50m, edging out Kelly Sotherton who jumped 6.43m.", "In the men's 200m race, James Scott claimed his first major title in 21.01 seconds after setting a new personal best and reaching European qualifying mark.", "Allyn Condon and Ian Mackie were disqualified.", "Scott also won the AAAs 60m hurdles with a time of 7.58 seconds.", "Helen Clitheroe took second place in the women's 3,000m race, and Rhys Watkins secured first place in the men's 800m heats.", "Scotland's Fraser Stirling set British indoor records by qualifying for the final of the women's 200m with a time of 23.68 seconds but placed second to Susan Deacon who won her first AAAs title.", "Veteran shot putter Kirsty Bickley reached season bests in both throws, missing out on European qualification.", "Robert Mitchell won the British indoor high jump title at 2.20m with a short fall of the European standard.", "Carl Myerscough's injury prevented him from qualifying for pole vault and Ashley Swain won that event as well.", "Irish athlete Taniesha Scanlon set a new national record in women's triple jump with a throw of 13.28m."], "opencoder:1.5b": ["Johnson edges out rival Sotherton.", "Jade Johnson edged out rival Kelly Sotherton with her last effort to claim the AAAs long jump title at the Norwich Union European Indoor trials.", "Olympic heptathlon bronze medallist, Sotherton, led the event with her first leap of 6.43m - a personal best.", "But Johnson, who has not competed indoors for five years, leapt to a life-time best of 6.50m in her last jump, after four fouls.", "Both Johnson and Sotherton passed the European Championships qualifying mark.", "Although Sotherton's main aim in Madrid next month will be the pentathlon where she will take on Olympic heptathlon champion Carolina Kluft.", "Ireland's delivered a shock in the men's 200m as he stormed to his first major title in 21.01 seconds.", "British favourite Chris Lambert had to settle for second place while defending champion Ireland's Paul Brizzel took third.", "There was some consolation for Lambert as he set a personal best of 20.94 in the first round - good enough to qualify for Europe.", "Two-time AAAs champion Allyn Condon and Ian Mackie had no such luck as they were disqualified in the heats.", "Scott, 22, jumped from the first round to win the AAAs title in 7.58 seconds.", "Turner finished second in 7.82 after previously setting a personal best on the 7.83 in the semi-finals, while Damien Greaves did not finish the final.", "The trio of athletes have reached the European qualifying mark this season though one of them is set to miss out on a call-up to the British squad.", "Complacingly defended her 3,000m title, clocked eight minutes, 49.87 seconds to easily surpass the European qualifying mark.", "The European cross country bronze medallist is ranked number one in Europe this season and will go to Madrid with high hopes.", "Helen Clitheroe was agonisingly close to the 9:05.00 qualifying mark as she claimed the runners-up spot in a personal best of 9:05.73.", "In the men's 800m heats, qualified fastest in the 800m heats to lay down a challenge to in-form.", "The Welsh runner attacked the last 200m to come through ahead of James Thie in one minute, 49.87 seconds.", "McIlroy, who is third in the European rankings, eased across the finish in 1:50.87 to set up a showdown in Sunday's final in Sheffield.", "Both Watkins and McIlroy have already achieved the European qualifying mark.", "Scotland's Susan Deacon stole 's thunder in the final of the women's 200m.", "Fraser became the fastest British woman over the distance this season when she qualified for the final in 23.68 seconds - though that time is outside the European standard.", "But Deacon claimed her first AAAs title over the distance, edging Fraser into second in 23.67.", "In the women's shot put veteran claimed her fourth AAAs title with a throw of 15.27m.", "But that mark was not good enough for the 39-year-old to book her place at next month's European Indoor Championships in Madrid.", "Sotherton finished fifth after producing two throws of 13.77m.", "In the absence of injured British number one Carl Myerscough, claimed the men's shot put title with a throw of 17.64m, which was below the qualifying mark.", "Sale's Robert Mitchell climbed to a season's best of 2.20m - just 3cm short of the European standard - to claim the British indoor high jump title.", "The AAAs indoor title went instead to Ashley Swain, who climbed to a season's best of 5.25m And Ireland's Taniesha Scanlon set a new national record of 13.28m in the women's triple jump."], "smollm:1.7b": ["The summary is concise and objective, focusing on the main ideas and key details without adding any explanations or reasoning process.", "The text highlights the achievements of Johnson and Sotherton as well as the performances of Clitheroe and Deacon.", "It also mentions the qualification marks achieved by both women in the 200m and 800m heats, which are good enough to qualify them for the European Indoor Championships."], "deepseek-r1:1.5b": ["Jade Johnson edged out rival Sotherton at the Norwich Union European Indoor trials, winning the AAAs heptathlon gold with her last jump of 6.50m, a four-foul victory over the qualifying mark.", "The top sprinter Allyn Condon dominated the 3,000m with eight minutes,87s to secure her first AAAs title.", "In the women's shot put, Susan Deacon claimed her first AAAs title with a throw of 15.27m.", "Celtic runner Chris Lambert finished second in the pentathlon for Olympic champion Carolina Kluft.", "Scotland's student, Andy Turner, secured third in the men's 60m hurdles and set a personal best in the final.", "Ireland's Paul Brizzel was third in the women's shot put."], "tinyllama:1.1b": ["Jade Johnson secured her first major title at the Norwich Union European Indoor trials, edging out rival Kelly Sotherton with her last jump of 6.43m in their last attempt.", "Johnson also secured a personal best and Europe qualifying mark by passing Olympic heptathlon champion Carolina Kluft in the men's 200m heat.", "In the 800m final, Welsh athlete James Thie surged past Scotland's\n\nto set up a showdown with British champion Susan Deacon in the final of the women's event.", "However, Deacon couldn't better her European qualifying mark and finished second in 23.68 seconds.", "In the shot put final, Southampton athlete Jodie Sale claimed the British indoor high jump title with a season's best of 2.20m.", "His compatriot Robert Mitchell also cleared 2.16m but missed out on qualifying for Europe by a narrow margin.", "In the pole vaulters' final, British number one Scott Condon failed to clear his bar after deciding to come in at 5.45m.", "Despite this, he secured second place and qualified for the European Indoor Championships next month.", "Ireland's tandem of Ashley Swain and Taniesha Scanlon also claimed their respective titles, with Scanlon setting a new national record of 13.28m in the triple jump."], "tinydolphin:1.1b": [" The summary is: Johnson took victory in the AAAs long jump with her last effort, while Sotherton came in second place.", "Jade Johnson leapt to a personal best of 6.43 meters, breaking her previous indoor record.", "Kelly Sotherton also performed well, but had to settle for third place, as she fouled two attempts.", "Both Johnson and Sotherton passed the European Championships qualifying mark.", "The men's 200m was dominated by two-time European champion Allyn Condon who finished first with a personal best of 21.01 seconds.", "Chris Lambert broke his own 200m personal best of 20.94, while Brian Turner finished third in 21.01.", "The women's 60m hurdles were competitive, with Scotland's Damien Greaves setting a new personal best of 7.83 seconds to win the AAAs title.", "Meanwhile, Andy Turner broke his own European qualifying mark with a time of 7.58 seconds in the men's 60m hurdles final.", "The trio of athletes will need to regroup for the European qualifying mark this season."], "phi:2.7b": [" Jade Johnson won the European Indoor Trials for the long jump with her life-time best of 6.50m, beating Kelly Sotherton who jumped 6.43m.", "Chris Lambert also had a personal best of 20.94s to qualify for Europe but Allyn Condon and Ian Mackie were disqualified in the 60m hurdles heats.", "Allyson Condon defended her 3,000m title with a time of 8:49.87, which is within the European qualifying mark.", "In the women's 200m, Helen Clitheroe set a personal best of 9:05.73 but Claire O'Meara won by just 0.24s.", "Mark Williams qualified for the 800m final with a time of one minute, 49 seconds and James Thie won the 800m heat in 1 minute, 50.87 seconds.", "The women's 100m winner Susan Deacon is ranked number one in Europe this season but was beaten by Fraser's time of 23.68s.", "In the men's 400m hurdles heats, Steve Beaumont came through ahead of the experienced"], "orca-mini:3b": [" Johnson edges out rival Sotherton in long jump, delivering shock win at Norwich Union European Indoor trials.", "Olympic heptathlon bronze medallist Sotherton led the event with her first leap of 6.43m - a personal best.", "But Jade Johnson, who has not competed indoors for five years, leapt to a life-time best of 6.50m in her last jump, after four fouls.", "Both Johnson and Sotherton passed the European Championships qualifying mark.", "Although Sotherton's main aim in Madrid next month will be the pentathlon where she will take on Olympic heptathlon bronze medallist Carolina Kluft.", "Ireland's delivered a shock in the men's 200m as he stormed to his first major title in 21.01 seconds.", "British favourite Chris Lambert had to settle for second place while defending champion Ian Mackie took third.", "There was some consolation for Lambert as he set a personal best of 20.94 in the first round - good enough to qualify for Europe.", "Two-time AAAs champion Allyn Condon and Ian Mackie had no such luck as they were disqualified in the heats.", "There was plenty of hot action in the men's 60m hurdles where Scotland's was vying for top spot with Olympian Andy Turner.", "Scott, 22, smashed his personal best on the way to the final, where he broke it again to win the AAAs title in 7.58 seconds.", "Turner finished second in 7.82 after previously setting a personal best on the 7.83 in the semi-finals, while Damien Greaves did not finish the final.", "The trio of athletes have reached the European qualifying mark this season though one of them is set to miss out on a call-up to the British squad.", "Stedman and Cooke set new marks in the men's 800m heats as they clocked 1 minute, 49.87 seconds and 1:50.87 respectively.", "In the women's 200m, Helen Clitheroe was agonisingly close to the 9:05.00 qualifying mark as she claimed the runners-up spot in a personal best of 9:05.73.", "In the men's 800m heats, Scotland's was vying for top spot with Olympian Andy Turner.", "Scott, 22, smashed his personal best on the way to the final, breaking it again to win the AAAs title in 7.58 seconds."], "hermes3:3b": ["J Johnson wins long jump over Sotherton, Ireland wins men's 200m.", "Scott wins AAAs hurdles title, Chambers defends 3000m.", "McIlroy qualifies for final in men's 800m, Deacon shocks Fraser in women's 200m.", "Condon/Mackie disqualify, Mitchell wins high jump, Scanlon sets new national triple jump record."], "stablelm-zephyr:3b": ["Jade Johnson won the AAAs long jump title at the Norwich Union European Indoor trials, edging out rival Kelly Sotherton.", "Johnson's last leap was 6.50m, a personal best, after four fouls.", "Both Johnson and Sotherton passed the European Championships qualifying mark.", "In men's 200m, Ireland's Paul Brizzel took third place, while Chris Lambert settled for second in the men's 200m and 800m heats.", "In women's 200m, Wales' Rebecca Watkins beat Ireland's David McIlroy by 0.87 seconds.", "Susan Deacon won the women's 200m, while Scotland's Yvonne Fraser finished as the fastest British woman with a time of 23.68 seconds.", "In men's shot put, Sale's Robert Mitchell claimed the British indoor high jump title, and in pole vault, Ashley Swain took the AAAs indoor title.", "Ireland's Taniesha Scanlon set a new national record in women's triple jump."], "stablelm2:1.6b": ["Jade Johnson narrowly beats Kelly Sotherton with her last jump to win the AAAs long jump title at the Norwich Union European Indoor trials, while Chris Lambert finishes second in the men's 200m event.", "In the men's 400m hurdles, Andy Turner breaks Scott Scott's personal best and wins with a time of 7.2 seconds, followed by Damien Greaves.", "Helen Clitheroe narrowly misses the European qualifying mark in the women's 3,000m race, while Susan Deacon wins the women's shot put event.", "In the men's shot put, Robert Mitchell climbs to a season's best with a throw of 2.18 meters, and Ashley Swain outperforms Ireland's Taniesha Scanlon in the women's triple jump with a time of 19.06 seconds."], "granite3.1-dense:2b": ["Jade Johnson secured her long jump title at the Norwich Union European Indoor trials, narrowly outperforming Olympic heptathlon bronze medallist Kelly Sotherton with her last leap of 6.50m, surpassing Sotherton's personal best of 6.43m.", "Johnson, who hasn't competed indoors for five years, passed the European Championships qualifying mark.", "In other events:\n- Irish runner Niall Hamilton won the men's 200m with a time of 21.01 seconds, surpassing favourite Chris Lambert who finished second at 21.01, and defending champion Paul Brizzel who took third (21.05).", "- Scottish athlete Kyle Langridge claimed the men's 60m hurdles title with personal best times of 7.58 seconds in the final and 7.54 in the heats, defeating Andy Turner (2nd, 7.82) and Damien Greaves (disqualified).", "- Allyn Condon and Ian Mackie were disqualified in the men's 60m hurdles heats.", "- Scottish runner Scott Smith won the men's 3,000m AAAs title with a time of 8:49.87, surpassing European qualifying mark (9:05.00) and defending champion Helen Clitheroe who qualified in 9:05.73 for second place.", "- Welsh athlete Rhys McIlroy qualified fastest for the men's 800m heats (1:49.87), setting up a potential final showdown with James Thie (1:50.87).", "- Scottish runner Susan Deacon claimed the women's 200m AAAs title, besting Fraser (2nd, 23.68) by 0.2 seconds.", "- Veteran thrower Barry McIlroy secured his fourth AAAs shot put title with a distance of 15.27m but fell short of the European qualifying mark (17.24m).", "- Susan Deacon also won the women's 200m, beating Fraser (2nd, 23.68) by 0.2 seconds.", "- Shot putter Lisa Rogers claimed her fourth AAAs title with a throw of 15.27m but failed to meet European qualifying standards (17.24m).", "- Robert Mitchell, from Sale, won the British indoor high jump title with a personal best of 2.20m, just 3cm short of the European standard (2.23m).", "- Ashley Swain claimed the AAAs indoor pole vault title with a season's best of 5.25m after failing to clear 5.45m, which would have qualified him for Madrid.", "- Ireland's Taniesha Scanlon set a new national record of 13.28m in the women's triple jump."], "chatgpt-4o-latest": ["Jade Johnson won the AAAs long jump title with a personal best of 6.50m, surpassing Kelly Sotherton, who had led with 6.43m.", "Both met the European Championships qualifying mark, though Sotherton's focus in Madrid will be the pentathlon.", "Ireland's athlete won the men's 200m in 21.01 seconds, with Chris Lambert finishing second despite setting a personal best of 20.94 in the first round.", "Scotland's Scott won the men's 60m hurdles in 7.58 seconds, ahead of Andy Turner.", "In the women's 3,000m, the defending champion clocked 8:49.87, securing her European qualification, while Helen Clitheroe narrowly missed the mark.", "In the men's 800m, Watkins and McIlroy set up a final showdown, both having met the European standard.", "Susan Deacon won the women's 200m, edging out Fraser.", "A veteran claimed her fourth AAAs shot put title but failed to qualify for Europe.", "The men's shot put winner also fell short of the qualifying mark.", "Robert Mitchell won the high jump with 2.20m, just below the European standard.", "Ashley Swain took the pole vault title after the British number one failed to clear the bar.", "Ireland's Taniesha Scanlon set a national record in the women's triple jump."]}