{"raw_text": "Tomlinson stays focused on Europe\n \n Long jumper Chris Tomlinson has cut his schedule to ensure he is fully fit for the European Indoor Championships.\n \n The 23-year-old has a minor injury and has pulled out of international meets in Madrid and Lievin this week as well as warm-weather training in Lanzarote. \"It's nothing serious,\" said his coach Peter Stanley. \"He strained a muscle in his abdomen at the Birmingham meeting but is back in full training.\" Sprinter Mark Lewis-Francis will also not compete in Madrid on Thursday. The Birmingham athlete, who clocked a season's best of 6.61 seconds over 60m in Birmingham last week, also prefers to focus his attentions on next month's European Indoor Championships.\n \n Lewis-Francis, who was runner-up to British team-mate Jason Gardener at the Europeans three years ago, will continue his training at home. Meanwhile, Tomlinson is still searching for this first major medal and this season he has shown he could be in the sort of form to grab a spot on the podium in Madrid. The Middlesbrough athlete jumped a season's best of 7.95m at the Birmingham Grand Prix - good enough to push world indoor champion Savante Stringfellow into second.\n", "llama3.2:1b": ["Tomlinson focuses on Europe, pulling out of Madrid and Lanzarote due to a minor injury.", "Sprinter Lewis-Francis also stops training in Madrid.", "Tomlinson is seeking his first major medal, while Lewis-Francis trains at home for the European Indoor Championships."], "llama3.2:3b": ["Chris Tomlinson has cut his schedule to focus on the European Indoor Championships due to a minor injury that caused him to pull out of international meets in Madrid and Lanzarote, while Mark Lewis-Francis will not compete in Madrid but will continue training at home."], "gemma2:2b": ["Chris Tomlinson is prioritizing his European Indoor Championships preparation by reducing competition and training, citing a minor abdominal muscle strain.", "Sprinter Mark Lewis-Francis will focus on home training as well while aiming for podium success at the event."], "qwen2.5:0.5b": ["Chris Tomlinson stays focused on Europe by focusing on European Indoor Championships."], "qwen2.5:1.5b": ["Chris Tomlinson, 23, cuts schedule for European Indoor Championships amid minor injury concerns; sprinters Lewis-Francis and Gardener focus on next meet in Madrid."], "qwen2.5:3b": ["Chris Tomlinson has trimmed his schedule to prepare for the European Indoor Championships due to a minor abdominal strain.", "At 23, he skipped recent international meets and warm-weather training in Madrid and Lanzarote.", "His coach, Peter Stanley, mentioned it was just a muscle strain that's fully healed now.", "Sprinter Mark Lewis-Francis will also skip Madrid as he focuses on the upcoming European Indoor Championships.", "Tomlinson, who clocked a season-best 6.61 seconds in Birmingham and jumped his best of 7.95m (good for second place globally), aims to secure his first major medal."], "opencoder:1.5b": ["Tomlinson stays focused on Europe.", "The 23-year-old has a minor injury and has pulled out of international meets in Madrid and Lievin this week as well as warm-weather training in Lanzarote.", "\"It's nothing serious,\" said his coach Peter Stanley.", "\"He strained a muscle in his abdomen at the Birmingham meeting but is back in full training.\"", "Sprinter Mark Lewis-Francis will also not compete in Madrid on Thursday.", "The Birmingham athlete, who clocked a season's best of 6.61 seconds over 60m in Birmingham last week, also prefers to focus his attentions on next month's European Indoor Championships.", "The Middlesbrough athlete jumped a season's best of 7.95m at the Birmingham Grand Prix - good enough to push world indoor champion Savante Stringfellow into second."], "smollm:1.7b": ["Tomlinson stays focused on Europe for his first major medal"], "deepseek-r1:1.5b": ["Tomlinson is focused on Europe, but has minor injuries in Spain and Lanzarote.", "He pulled out of international meets there and training in Lanzarote as well.", "Lewis-Francis isn't competing in Madrid.", "Tomlinson has good performance in Birmingham, clocking 6.61 seconds for the 60m, aiming to win in Madrid.", "Lewis-Francis is improving from his recent results and will focus training at home after splitting up with Gardener."], "tinyllama:1.1b": ["Summary: Tomlinson stays focused on Europe with an injury and plans to compete in only two events this week - a minor one in Madrid and another at Lievin later this week.", "Lewis-Francis also opts not to compete in Madrid, preferring instead to focus on the upcoming European Indoor Championships where he is set to chase his first major medal."], "tinydolphin:1.1b": [" Summary: Tomlinson, a notable long jumper from Middlesbrough, has decided to prioritize Europeans over other international meets this season.", "As a result, he will be absent from Madrid, Lievin, and other competitions, but his coach is confident he can still win at the European Indoor Championships if he focuses on full training."], "phi:2.7b": [" Chris Tomlinson, the long jumper, is focusing on Europe and has cut his schedule due to a minor injury he sustained during a competition in Birmingham.", "He pulled out of international meets in Madrid and Lievin this week as well as warm-weather training in Lanzarote.", "Meanwhile, sprinter Mark Lewis-Francis will not compete in Madrid.", "Tomlinson is still searching for this first major medal this season but has shown he could be in the sort of form to grab a spot on the podium in Madrid."], "orca-mini:3b": [" Tomlinson stays focused on Europe despite injury and pulls out of international meets."], "hermes3:3b": ["Chris Tomlinson focuses on European Indoor Championships, abstains from competitions due to minor injury."], "stablelm-zephyr:3b": ["Long jumper Chris Tomlinson reduces his schedule due to a minor abdominal muscle strain, but is back to full training.", "He focuses on competing at the European Indoor Championships, aiming for his first major medal.", "Tomlinson's season's best jump of 7.95m puts him ahead of world indoor champion Savante Stringfellow.", "Sprinter Mark Lewis-Francis also withdraws from Madrid meet but trains at home, intending to focus on the upcoming European Indoor Championships."], "stablelm2:1.6b": ["Chris Tomlinson has reduced his schedule for European Indoor Championships due to a minor injury, focusing on full fitness.", "He withdrew from international meets and warm weather training in Lanzarote but is back in full training.", "Sprinter Mark Lewis-Francis won't compete in Madrid as he aims for next month's European Indoor Championships.", "Tomlinson showed potential with a season's best of 7.20m at the Birmingham Grand Prix, pushing world indoor champion Savante Stringfellow into second place."], "granite3.1-dense:2b": ["Chris Tomlinson, a 23-year-old long jumper, has reduced his training schedule due to a minor abdominal muscle strain from the Birmingham meeting.", "He's opted out of this week's meets in Madrid and Lievin, as well as a warm-weather training session in Lanzarote.", "His coach, Peter Stanley, assures that Tomlinson is back to full training.", "Similarly, sprinter Mark Lewis-Francis will miss the Madrid meet and focus on preparing for the upcoming European Indoor Championships.", "Both athletes prioritize their European Indoor Championship goals over less significant competitions.", "Tomlinson, known for his potential to secure a podium spot, recently achieved a season's best jump of 7.95m at the Birmingham Grand Prix, which placed him second behind world indoor champion Savante Stringfellow."], "chatgpt-4o-latest": ["Long jumper Chris Tomlinson has reduced his schedule to stay fit for the European Indoor Championships, skipping international meets in Madrid and Lievin due to a minor abdominal strain.", "His coach Peter Stanley assures it is not serious, and Tomlinson has resumed full training.", "Sprinter Mark Lewis-Francis is also skipping Madrid to focus on the championships.", "He recently ran a season-best 6.61 seconds over 60m and will continue training at home.", "Tomlinson, still seeking his first major medal, showed strong form by jumping a season-best 7.95m at the Birmingham Grand Prix, beating world indoor champion Savante Stringfellow."]}