{"raw_text": "Johnson uncertain about Euro bid\n \n Jade Johnson is undecided about whether to contest next month's European Indoor Championships in Madrid despite winning the AAAs long jump title on Saturday.\n \n The 24-year-old delivered a personal best of 6.50m to win the European trials but had to wait until her final jump after four failures. \"I don't want to go if I am not going to get a medal,\" said Johnson. \"I will have to see how I am jumping in the next competition and I'll have to have a conversation with my coach.\" Johnson, who finished seventh in last year's Olympic Games, has not competed indoors since 2000. And the Commonwealth and European silver medallist believes her lack of experience in the early part of the season has knocked her confidence. \"It's the stress,\" said Johnson. \"I am not used to feeling this, this early. I am just used to training. \"But if I'm doing this kind of thing, then I will have to see how it goes.\" Johnson next competes in the high-class Birmingham Grand Prix on 18 February.\n", "llama3.2:1b": ["Jade Johnson is uncertain about whether to contest the European Indoor Championships in Madrid, citing concerns over her experience and confidence ahead of a 24-year-old indoor competition debut."], "llama3.2:3b": ["Jade Johnson is uncertain about competing in the European Indoor Championships due to concerns over her performance.", "She won the AAA long jump title with a personal best, but had four failures before her final jump.", "Johnson plans to assess her jumping ability in her next competition and has not competed indoors since 2000."], "gemma2:2b": ["Jade Johnson is uncertain about competing in the European Indoor Championships due to her lack of experience and desire for a medal.", "She won the AAAs long jump title but must wait until after her next competition to decide."], "qwen2.5:0.5b": ["Johnson unsure about contesting European Indoor Championships."], "qwen2.5:1.5b": ["Jade Johnson is unsure about competing at European Indoor Championships after winning a personal best but has concerns due to lack of indoor experience and recent failures.", "She plans her next competition, the Birmingham Grand Prix, which takes place in two weeks."], "qwen2.5:3b": ["Johnson uncertain about Euro bid despite winning AAAs long jump title; undecided due to lack of indoor experience and recent medal performances, preferring not to compete without a strong chance of winning medals.", "She will consider her performance at upcoming competitions and consult with coach before making decision.", "Next competition is Birmingham Grand Prix on 18 February."], "opencoder:1.5b": ["\"At first glance, the text seems to be discussing a contest between a 24-year-old American athlete and his coach, who are both undecided about whether they should contest the European Indoor Championships in Madrid in the next month.", "The athlete's personal best is a six-foot-long jumper, but he must wait until her final jump to compete.", "He says he doesn't want to go if he can't get a medal; he explains that he has to see how he is jumping and have a conversation with his coach about the sport.\"", "Johnson (who finished in the high-class British Grand Prix on 18 February) is not sure about the Euro bid.", "Despite winning the AAAs long jump title on Saturday, it was a personal decision.", "The athlete had a personal challenge but he felt that it would distract him from his main competition.", "He is confident that if he were to go ahead and compete there, he could achieve a medal.", "In addition, the athlete believes that his lack of experience in the early part of the season has put him on edge."], "smollm:1.7b": ["Johnson is uncertain about Euro bid\nThe 24-year-old delivered a personal best of 6.50m to win the European trials but had to wait until her final jump after four failures.", "\"I don't want to go if I am not going to get a medal,\" said Johnson.", "\"I will have to see how I am jumping in the next competition and I'll have to have a conversation with my coach.\"", "Johnson, who finished seventh in last year's Olympic Games, has not competed indoors since 2000.", "And the Commonwealth and European silver medallist believes her lack of experience in the early part of the season has knocked her confidence.", "\"It's the stress,\" said Johnson.", "\"I am not used to feeling this, this early.", "I am just used to training.", "But if I am doing this kind of thing, then I will have to see how it goes.\"", "Johnson next competes in the high-class Birmingham Grand Prix on 18 February."], "deepseek-r1:1.5b": ["Johnson is undecided about competing at the Eurobid due to being decided next month in Madrid after winning the AAAs title but failing four jumps before the final one.", "She aims for a medal if she doesn't make it, mentions the stress from early races where she lacks confidence, hasn’t competed indoors since 2000, and expects to see her performance at Birmingham Grand Prix on February 18."], "tinyllama:1.1b": ["Johnson uncertain about Euro bid despite winning AAAs long jump title and having to wait until final jump for Madrid indoor meet, but discussing with coach whether she'll compete if not getting medal in season-opening events."], "tinydolphin:1.1b": [" Jade Johnson is considering participating in the European Indoor Championships held in Madrid next month despite having won a prestigious title at last year's Commonwealth Games.", "However, she has been struggling to break her personal best and may need to reconsider her decision based on her disappointing performances this season.", "The 24-year-old long jumper acknowledged that she might not be ready for the upcoming competition, adding to her uncertainty about whether she should compete.", "However, Jade Johnson's coach insists that she must take time to recover and improve before deciding on her participation in the contest.", "In the meantime, she has other options open to her as she contemplates her participation in the Birmingham Grand Prix on 18 February."], "phi:2.7b": [" Jade Johnson is considering not competing in the European Indoor Championships due to her lack of confidence and experience.", "She won the long jump title at last month's European trials but has four misses in a row.", "However, she will have to see how she performs in the next competition before making a decision.", "She also competes in the Birmingham Grand Prix on February 18th."], "orca-mini:3b": [" Jade Johnson is unsure about participating in the European Indoor Championships as she won't know if she will get a medal until her final jump.", "She also doesn't want to compete indoors without getting experience from earlier seasons and believes her lack of confidence is causing stress."], "hermes3:3b": ["Johnson undecided on Euro Indoor Championships entry."], "stablelm-zephyr:3b": ["Jade Johnson is unsure about participating in the European Indoor Championships in Madrid despite winning the AAAs long jump title.", "She set a personal best of 6.50m but wants to see how she performs in the next competition before making a decision.", "Johnson, a Commonwealth and European silver medallist, believes her lack of early-season experience has affected her confidence.", "Her next event is the Birmingham Grand Prix on 18 February."], "stablelm2:1.6b": ["Jade Johnson is indecisive about participating in the European Indoor Championships due to uncertainty regarding her chances for a medal, despite winning the AAAs long jump title.", "She struggled during the final jump at the European trials but plans to evaluate her performance in future competitions before making a decision.", "As a Commonwealth and European silver medallist with no indoor competition since 2019, Johnson is concerned about her lack of experience in training leading to early season stress.", "However, she hopes to see how the situation unfolds during the Birmingham Grand Prix on February."], "granite3.1-dense:2b": ["Jade Johnson, a 24-year-old long jumper who recently secured an AAAs title with a personal best of 6.50m at the European trials, is contemplating whether to participate in the upcoming European Indoor Championships in Madrid.", "Her decision hinges on her performance in the following competition and discussions with her coach.", "Johnson, a previous Olympic Games competitor and Commonwealth/European silver medalist, hasn't indoor-jumped since 2000 due to early-season training focus.", "She attributes her current uncertainty to the stress of indoor competition, as she's not accustomed to it this early in the season.", "Her next event is the prestigious Birmingham Grand Prix on February 18."], "chatgpt-4o-latest": ["Jade Johnson is uncertain about competing in the European Indoor Championships despite winning the AAAs long jump title with a personal best of 6.50m.", "She wants to ensure she can win a medal before committing and will assess her performance in upcoming competitions.", "Johnson, who finished seventh in the Olympics, has not competed indoors since 2000 and feels her lack of early-season experience has affected her confidence.", "She will next compete at the Birmingham Grand Prix on 18 February."]}