{"raw_text": "Greek sprinters 'won't run again'\n \n The careers of sprinters Kostas Kenteris and Katerina Thanou are over, says the boss of the organisation that cleared them of missing a drugs test.\n \n Greek Athletics Federation boss Vassilli Sevastis told the country's parliament: \"I believe Kenteris and Thanou won't race again. \"The damage to their commercial interests has been done,\" he added. Athletics bosses are considering its reponse to the ruling, while the athletes face a trial in a Greek court. Greek prosecutors have brought spearate charges of missing the drugs test and faking a motorcycle accident. Speaking to the Greek Parliament on Tuesday, Sevastis said that the evidence sent by the International Olympic Committee and athletics governing body the IAAF was not strong enough for the Greek Association to find the sprinters guilty.\n \n \"We were given the task of getting the snake out if its hole but we were not given any evidence to do it with,\" he said. \"So how can you as a Greek with your hand on your heart try the athletes?\" he added. The athletes are technically free to compete while the IAAF reviews its response to the decision to clear Kenteris and Thanou. But Sevastis said: \"It does not matter if they are found guilty at the Court of Arbitration for Sport and the current decision is reversed.\"\n", "llama3.2:1b": ["The Greek Athletics Federation boss, Vassilli Sevastis, says sprinters Kostas Kenteris and Katerina Thanou will not be allowed to compete again due to a ruling by the International Olympic Committee and athletics governing body.", "The evidence presented was deemed insufficient for them to be found guilty of missing a drugs test and faking an accident."], "llama3.2:3b": ["Greek sprinters Kostas Kenteris and Katerina Thanou won't run again due to damage to their commercial interests, says Greek Athletics Federation boss Vassilli Sevastis.", "The athletes face a trial in a Greek court on charges of missing a drugs test and faking a motorcycle accident."], "gemma2:2b": ["Kostas Kenteris and Katerina Thanou's athletic careers are over, according to Vassilli Sevastis, boss of the Greek Athletics Federation.", "The sprinters were cleared of missing a drug test after the International Olympic Committee and IAAF provided insufficient evidence.", "Despite being technically free to compete while the IAAF reviews its response, Sevastis believes they won't race again due to significant commercial damage.", "Greek prosecutors are pursuing separate charges of missing the test and faking an accident."], "qwen2.5:0.5b": ["Athletes Kostas Kenteris and Katerina Thanou did not race again after the Greek Athletics Federation cleared them of missing a drugs test.", "The IAAF, which oversees athletic competitions around the world, will then consider the athlete's case before a court in Greece.", "Athletes face potential legal troubles if they are found guilty of drug offenses or lying about an accident."], "qwen2.5:1.5b": ["Athletes Kostas Kenteris and Katerina Thanou's sprinting careers have ended, according to Greek Athletics Federation boss Vassilli Sevastis following a drugs test ruling.", "The athletes face a trial in court while athletics bosses are considering their response.", "Sevastis claims the evidence provided by the International Olympic Committee and IAAF is insufficient for conviction, citing it as an example of why the athlete could not be cleared of the charges."], "qwen2.5:3b": ["Greek sprinters Kostas Kenteris and Katerina Thanou have had their careers ended, according to Greek Athletics Federation boss Vassili Sevastis.", "Sevastis stated that evidence provided by the International Olympic Committee and IAAF was insufficient for the Greek Association to find them guilty of missing a drugs test and faking an accident.", "Consequently, athletes are facing trial in Greece where prosecutors have brought separate charges against them.", "Despite their technical freedom to compete while the IAAF reviews its response, Sevastis insists that if found guilty at any arbitration court, their current clearances would not be reversed."], "opencoder:1.5b": ["Greek sprinters won't run again.", "The boss of the organisation that cleared them of missing a drugs test has told the country's parliament that Kenteris and Thanou will not race again, as the damage to their commercial interests has been done.", "Vassilli Sevastis said that the Greek Association is considering its response to the ruling, while the athletes face a trial in a Greek court.", "Speaking to the Greek Parliament on Tuesday, Sevastis explained that the evidence sent by the International Olympic Committee and athletics governing body the IAAF was not strong enough for the Greek Association to find the sprinters guilty.", "They were given the task of getting the snake out if its hole but without any evidence to do it with.", "As a Greek with their hand on their heart, they try the athletes.", "The IAAF reviews its response to the decision to clear Kenteris and Thanou, but Sevastis noted that it does not matter if they are found guilty at the Court of Arbitration for Sport and the current decision is reversed."], "smollm:1.7b": ["The summary should be as concise as possible, without losing any key ideas or details.", "The main points to focus on are:\n\n1.", "The careers of Kostas Kenteris and Katerina Thanou were over due to a drugs test failure.", "2.", "The organization that cleared them was the Greek Athletics Federation (GAF).", "3.", "The IAAF ruled that they had faked an accident, which led to their removal from competition.", "4.", "The athletes faced a trial in a Greek court and were given the opportunity to appeal.", "5.", "The GAF's response to the ruling was not strong enough for them to clear Kenteris and Thanou.", "6.", "The IAAF is reviewing its decision to clear the athletes, but it does not matter if they are found guilty at the Court of Arbitration for Sport (CABS)."], "deepseek-r1:1.5b": ["The Greek Athletics Federation boss claims Kenteris and Thanou will not race again after being cleared of a drugs test.", "Sevastis mentions ongoing trials in court for charges involving faking an accident.", "He says current decisions won't affect their future, but there's uncertainty over the clearances' impact on their career."], "tinyllama:1.1b": ["The career paths of Kostas Kenteri and Katerinia Thanou are over, as confirmed by Greek Athletics Federation boss Vasilis Sevasatis.", "The Greek authorities have decided not to take any further action against them based on the evidence sent by International Olympic Committee (IOC) officials and the governing body for athletics in Europe, the International Association of Athletics Federations (IAAF).", "Athlete representatives from both sprinters will face a trial in court, which is currently underway.", "The Bossiess believe that the athletes' commercial interests have already been damaged by their untimely failure to pass drug tests and the motorcycle accident they subsequently sustained."], "tinydolphin:1.1b": [" Athlete competitors in Greek sports have been temporarily removed from competition due to a ruling by the Greek Athletics Federation, which announced that they believe sprinter Kostas Kenteris and Katerina Thanou failed to meet the drug test requirement.", "The Greek Athletics Federation's decision to remove these athletes comes after the International Olympic Committee (IOC) released new evidence against them, but the athletes are not expected to face a trial or legal consequences in Greece.", "However, the IAAF, which oversees athletics worldwide, has also announced that it is reviewing its response to the decision by Greek Athletics Federation."], "phi:2.7b": [" \"The Greek sprinters Kostas Kenteris and Katerina Thanou have retired from their careers due to the decision made by the International Olympic Committee and athletics governing body, IAAF.", "The Greek Athletics Federation boss, Vassilli Sevastis, said that he believes they won't race again as the damage to their commercial interests has already been done.\""], "orca-mini:3b": [" Greek sprinters Kostas Kenteris and Katerina Thanou will no longer compete in their respective sports due to a ruling by their governing body, according to the boss of the organization.", "The athletes are facing trial in a Greek court for charges related to missing a drugs test and faking a motorcycle accident.", "Athletics bosses are considering its response to the ruling, while the athletes face a trial in a Greek court."], "hermes3:3b": ["Kostas Kenteris and Katerina Thanou's sprinting careers ended, according to Greek Athletics Federation boss Vassilli Sevastis.", "They won't race again, as evidence wasn't strong enough for them to find athletes guilty despite separate charges of missing drugs test & faking accident."], "stablelm-zephyr:3b": ["Greek sprinters Kostas Kenteris and Katerina Thanou's careers are over, according to Greek Athletics Federation boss Vassilli Sevastis.", "The organization cleared them of missing a drug test, and Sevastis stated that their commercial interests have been damaged.", "Greek prosecutors brought separate charges of missing the test and faking a motorcycle accident.", "Though the athletes technically remain free to compete while the IAAF reviews its response, Sevastis said it doesn't matter if they are found guilty at the Court of Arbitration for Sport in the future."], "stablelm2:1.6b": ["Greek sprinters Kostas Kenteris and Katerina Thanou cannot race again, as their professional careers are over due to damage caused by missing a drugs test.", "Greek Athletics Federation boss Vassilli Sevastis stated that evidence from the International Olympic Committee and athletics governing body was insufficient for the Greek Association to find them guilty.", "The athletes face separate charges of missing a drug test and faking a motorcycle accident in a Greek court, while IAAF reviews its response to the initial ruling.", "If found guilty at the Court of Arbitration for Sport, they would be technically free to compete, but Sevastis emphasized that it doesn.", "The company also provides services related to maintenance of equipment and software.", "The company has been successful in delivering high-quality solutions for a wide range of customers through its expertise in computer hardware, networking, and software solutions.", "About the Company:\n\nThe company was founded in 2015 with a vision to provide innovative and efficient solutions to business problems.", "It offers a broad spectrum of services such as IT consulting, software development, web hosting, cloud computing, data backup and security, network administration, and training programs.", "The company is committed to delivering exceptional service quality to its clients by providing customized solutions that meet their specific needs.", "The team consists of highly skilled professionals who are passionate about solving business problems through innovative technologies.", "In recent years, the company has established itself as a leading provider of IT solutions in the region, earning a reputation for reliability, innovation, and customer satisfaction.", "The company's mission is to provide exceptional services that enable businesses to grow and thrive while enhancing their overall operational efficiency.", "By combining cutting-edge technology with industry expertise, the company is able to deliver results that exceed customer expectations."], "granite3.1-dense:2b": ["Greek Athletics Federation chief Vassilli Sevastis declared that sprinters Kostas Kenteris and Katerina Thanou will not run competitively again due to extensive damage to their commercial interests.", "This stance was based on the weak evidence provided by the International Olympic Committee and IAAF, which failed to support Greek authorities in proving the athletes' guilt for missing a drugs test and faking an accident.", "Despite being technically free to compete as the IAAF reviews its decision, Sevastis stated that even if their guilt is confirmed at the Court of Arbitration for Sport and the ruling is overturned, Kenteris and Thanou's careers are effectively ended.", "The athletes are currently facing trial in a Greek court on these charges."], "chatgpt-4o-latest": ["Greek sprinters Kostas Kenteris and Katerina Thanou are unlikely to compete again, according to Greek Athletics Federation chief Vassilli Sevastis, despite being cleared of missing a drugs test.", "Sevastis stated that their commercial reputations have been damaged, and they still face a Greek court trial for allegedly missing the test and faking a motorcycle accident.", "He argued that the evidence provided by the IOC and IAAF was insufficient for a guilty verdict.", "While the athletes remain technically eligible to compete, Sevastis suggested that even if the decision is overturned by the Court of Arbitration for Sport, their careers are effectively over."]}