{"raw_text": "Moyes U-turn on Beattie dismissal\n \n Everton manager David Moyes will discipline striker James Beattie after all for his headbutt on Chelsea defender William Gallas.\n \n The Scot initially defended Beattie, whose dismissal put Everton on the back foot in a game they ultimately lost 1-0, saying Gallas overreacted. But he has had a rethink after looking over the video evidence again. He said: \"I believe that I should set the record straight by conceding that the dismissal was right and correct.\" Moyes added: \"My comments on Saturday came immediately after the final whistle and at a point when I had only had the opportunity to see one, very quick re-run of the incident.\"\n \n The club website also reported that Beattie, who seemed unrepentant after Saturday's match, insisting Gallas \"would have stayed down a lot longer\" if he had headbutted him, has now apologised. Moyes continued: \"Although the incident was totally out of character - James has never even been suspended before in his career - his actions were unacceptable and had a detrimental effect on his team-mates. \"James did issue a formal apology to myself, his team-mates and to the Everton supporters immediately after the game and that was the right thing to have done. He will now be subjected to the normal club discipline. \"He is a competitive player but a fair player and I know how upset he is by what has happened. However, I must say that I do still believe the Chelsea player in question did go down too easily.\" Speaking immediately after the game, Moyes said: \"I don't think it was a sending-off, I have been a centre-half in my time and I would have been ashamed to have gone down as easily as that.\n \n \"Not in a million years would John Terry have gone down in the same way. I have never heard of anybody butting somebody from behind while you are running after them. \"What has happened to big, strong centre-halves? I thought it was a push initially and I still don't think it was a sending-off.\" An angry Beattie initially said: \"He (Gallas) would have stayed down a lot longer if I had headbutted him. \"I can tell you it wasn't an intentional headbutt. We were chasing a ball into the corner and William Gallas was looking over his shoulder and blocking me off. \"He was stopping as we were running and I said to myself 'if you're going to stay in my way I'll go straight over you'. Our heads barely touched and it wasn't an intentional headbutt.\"\n", "llama3.2:1b": ["Moyes defends Beattie's headbutt on Gallas after video evidence shows the incident was not as severe as initially thought.", "Moyes initially defended Beattie but has rethought his comments, stating he believes the dismissal was correct.", "Beattie apologized and is subjecting himself to normal club discipline for the incident."], "llama3.2:3b": ["David Moyes has changed his mind on James Beattie's dismissal for headbutting Chelsea defender William Gallas, now saying the penalty was correct.", "Beattie had initially defended himself and blamed Gallas' reaction.", "He later apologized to Moyes and teammates, but will still face club discipline."], "gemma2:2b": ["James Beattie will face disciplinary action from Everton for his dismissal during a match against Chelsea.", "David Moyes initially defended the incident, but reconsidered after reviewing video evidence.", "He acknowledged Beattie's actions were unacceptable and issued an apology.", "While believing Gallas overreacted, Moyes also believes Beattie's headbutt was unintentional."], "qwen2.5:0.5b": ["Moyes will discipline striker James Beattie after his headbutting on Chelsea defender William Gallas.", "The Scottish manager defended his decision, saying the incident was out of character but that his team lost the game by a large margin.", "He later apologised for Gallas' overreaction and said he would now face club discipline."], "qwen2.5:1.5b": ["Everton manager David Moyes has disciplined striker James Beattie for his headbutt on Chelsea defender William Gallas, following the dismissal that put Everton on the back foot against Chelsea.", "Moyes initially defended Beattie but later acknowledged the dismissal was correct after reviewing the video evidence and reiterating that Beattie's actions were unacceptable despite being out of character.", "Moyes also emphasized that although Beattie had a fair chance due to his poor discipline history, he did not respect teammate William Gallas when headbutting him during a game against Chelsea."], "qwen2.5:3b": ["Everton manager David Moyes has decided to punish striker James Beattie for his headbutt on Chelsea defender William Gallas, reversing his initial stance.", "Initially supportive of Beattie, Moyes changed his mind after reviewing the video evidence.", "Beattie now apologized and will face club discipline despite insisting he didn't intend to harm Gallas with the headbutt.", "Moyes expressed regret over Beattie's actions, emphasizing it was an \"out-of-character\" incident for the player, who is described as competitive but also fair.", "Beattie initially claimed he intended only to push and not hit Gallas deliberately, arguing that Gallas should have stayed down longer due to his physical strength."], "opencoder:1.5b": ["Moyes U-turn on Beattie dismissal: The Scot made a mistake that cost Everton's life, and Gallas' response was unchartered.", "James Beattie had been outmatched by his headbutt on Chelsea defender William Gallas.", "Despite the incident, it marked the club's commitment to fairness and professionalism in the professional footballing system."], "smollm:1.7b": ["The summary is concise, preserving the key ideas and details of the original text.", "The main points are:\n\n1.", "Moyes will discipline Beattie after all for his headbutt on Chelsea defender William Gallas.", "2.", "The Scot initially defended Beattie, whose dismissal put Everton on the back foot in a game they ultimately lost 1-0.", "3.", "He has had a rethink after looking over the video evidence again.", "4.", "Moyes added: \"I believe that I should set the record straight by conceding that the dismissal was right and correct.\"", "5.", "Moyes also apologized to James Beattie, his team-mates and the Everton supporters immediately after the game.", "6.", "He will now be subjected to the normal club discipline.", "7.", "Moyes believes Beattie did go down too easily.", "8.", "Moyes has never heard of anybody butting someone from behind while you are running after them.", "9.", "He thought it was a sending-off, not an intentional headbutt.", "10.", "Beattie initially said: \"He (Gallas) would have stayed down a lot longer if I had headbutted him.\"", "The summary captures the key points of the original text, preserving the main ideas and details while avoiding unnecessary information or explanations."], "deepseek-r1:1.5b": ["Moyes decided to discipline James Beattie for his headbutt against William Gallas in Chelsea's game.", "Initially defended by Everton, who dismissed him, but Moyes later reconsidered after reviewing evidence and re-ran the incident quickly.", "Beattie apologized after Saturday's match, addressing himself, team-mates, and supporters.", "Moyes imposed normal discipline on Beattie while acknowledging Terry's similar behavior without intent.", "Beattie initially seemed defensive and unrepentant before the match, and he later defended Gallas for blocking him."], "tinyllama:1.1b": ["The Everton manager, David Moyes, has discouraged James Beattie from a potential second red card after the incident during their Premier League match against Chelsea.", "Moyes initially defended Beattye's actions by stating that the dismissal was \"right and correct,\" but has since apologized for his comments.", "The Everton manager stated that Beattye insists Gallas would have stayed down if he had headbutted him, while Gallas himself has reportedly apologized to himself and team-mates.", "In a further statement, Moyes claimed that Beattye's actions were \"unacceptable\" and detrimental to his team-mates' behavior, but has acknowledged that he still believes the player in question was guilty of pushing him."], "tinydolphin:1.1b": [" A summary of the key points in this text are: \n- Everton manager David Moyes has discipline striker James Beattie for a headbutt on Chelsea defender William Gallas.", "- The incident resulted in a red card, with Moyes stating his rethinking following the footage and admitting he initially thought it was justified.", "- Beattie's apology to himself, his teammates, and fans follows shortly after his dismissal at Everton, where he also apologized.", "- The incident sparked controversy, but Moyes believes it was right and correct.", "- Although he initially believed Gallas would have stayed down a lot longer if Beattie had headbutted him, his later apology has absolved Beattie of any wrongdoing."], "phi:2.7b": [" Everton manager David Moyes will discipline striker James Beattie for his headbutt on Chelsea defender William Gallas during their game.", "After initially defending Beattie, Moyes has had a rethink after reviewing the video evidence again and believes the dismissal was correct.", "Beattie has since apologized to his team-mates, supporters, and manager."], "orca-mini:3b": [" David Moyes reversed his initial defence of James Beattie after reviewing video evidence.", "Beattie was disciplined for his headbutt on Chelsea defender William Gallas, who Moyes claimed would have stayed down longer if Beattie had headbutted him.", "Beattie apologized and was subject to club disciplinary proceedings."], "hermes3:3b": [" Everton manager Moyes retracts defense of striker Beattie, admitting he should have been dismissed for headbutting Chelsea defender Gallas."], "stablelm-zephyr:3b": ["Everton manager David Moyes has admitted that striker James Beattie should be disciplined for his headbutt on Chelsea defender William Gallas, which initially led to Beattie's dismissal.", "Despite initially defending Beattie, Moyes now believes the dismissal was right and correct.", "Beattie issued a formal apology to Moyes, his teammates, and Everton supporters after the match and will face normal club discipline."], "stablelm2:1.6b": ["Everton manager David Moyes plans to discipline striker James Beattie for a headbutt on Chelsea defender William Gallas.", "Initially, Moyes defended Beattie and said Gallas overreacted, but changed his mind after reviewing video evidence.", "Beattie apologized, despite insisting that Galla's would have stayed down longer in the incident.", "Moyes believes the player showed \"total disrespect\" to his teammates and Everton fans."], "granite3.1-dense:2b": ["Everton manager David Moyes has reversed his stance on the dismissal of striker James Beattie, now acknowledging that the red card was justified after reviewing video evidence.", "Initially defending Beattie, claiming Gallas overreacted, Moyes now admits the dismissal was correct.", "Beattie initially dismissed the incident as a push rather than a headbutt, stating Gallas would have stayed down longer if he had headbutted him.", "However, after further review, Moyes confirmed that Beattie's actions were unacceptable and negatively impacted his team.", "Beattie has since apologized to Moyes, teammates, and Everton supporters.", "Despite the apology and disciplinary action, Moyes still believes Gallas exaggerated his fall."], "chatgpt-4o-latest": ["Everton manager David Moyes has reversed his initial defense of striker James Beattie, now agreeing that his red card for headbutting Chelsea's William Gallas was justified.", "Moyes initially claimed Gallas overreacted but changed his stance after reviewing video evidence.", "Beattie, who initially downplayed the incident, has since apologized to Moyes, his teammates, and Everton fans.", "Moyes acknowledged Beattie's competitive nature but deemed his actions unacceptable, stating the club will discipline him.", "However, Moyes still believes Gallas went down too easily.", "Beattie insisted the contact was unintentional, arguing that Gallas was blocking him and their heads barely touched."]}