{"raw_text": "Smith keen on Home series return\n \n Scotland manager Walter Smith has given his backing to the reinstatement of the Home International series.\n \n Such a plan is to be proposed by the new chief executive of the Northern Irish FA, Howard Wells, at the next meeting of the four home countries. The English FA has expressed doubt as to whether the fixtures could be accommodated at the end of each season. But Smith said: \"Bringing it back would add meaning to friendly games and that's something that's needed.\" The Home International series was done away with in 1984, with the traditional Scotland-England fixture continuing until 1989. That game is one Smith would be delighted to see reinstated. \"The Scotland v England match was a highlight of the end of the season,\" he added. \"I was in Italy for their friendly with Russia last week and they made seven substitutions while only around 20,000 fans turned up to watch. \"England were criticised for the 0-0 draw against Holland - the way Scotland were slammed in the past for poor results in friendlies. \"You have to put a performance on in friendly games. If you don't, they can be de-motivating. \"It can be a dangerous road to go down, if players don't apply themselves in the manner they should. \"So I would support the return of the home internationals - the only problem would be fitting them in to the fixture schedule.\"\n", "llama3.2:1b": ["Scotland manager Walter Smith supports reinstating the Home International series.", "New Northern Irish FA chief executive Howard Wells is proposing the plan at the next meeting with the four home countries, citing its potential to add meaning to friendly games and improve player motivation.", "Smith would support such a return, particularly after England's 0-0 draw against Holland in a recent friendly."], "llama3.2:3b": ["Walter Smith supports reinstating the Home International series, believing it adds meaning to friendly games and can motivate players.", "The idea is to be proposed by Northern Irish FA chief executive Howard Wells at the next meeting of the four home countries."], "gemma2:2b": ["Walter Smith supports the reinstatement of the Home International series.", "The new CEO of Northern Irish FA suggests reinstating it, and there are plans to discuss this at the next meeting of the four home countries.", "England's doubt about accommodating the series at the end of each season is mentioned but Smith emphasizes that it would add meaning to friendly games."], "qwen2.5:0.5b": ["Smith is back on the Home International series with Scotland's help.", "He believes bringing it back adds meaning and fits better into the fixture schedule, as players don't get enough time to perform on friendly games."], "qwen2.5:1.5b": ["Walter Smith backs reinstatement of Home International series.", "The plan aims to return the Scotland-England friendly match, which ended in 1984, and includes bringing it back at the end of each season.", "Smith supports this idea, stating that it would add meaning to friendly games and be needed for motivation.", "However, he suggests potential scheduling conflicts with other fixtures."], "qwen2.5:3b": ["Smith supports reinstatement of Home International series.", "Proposed by Northern Irish FA's new CEO, Howard Wells, at upcoming meeting.", "Smith believes it adds meaning to friendly games needed.", "Series ended in 1984 but Scotland-England match highlighted end of season.", "Smith criticizes lackluster performances in friendlies and worries about fitting them into fixture schedule."], "opencoder:1.5b": ["\"Engaging a friendly game and providing meaningful results is crucial for retaining fans.", "It's important to reintroduce the Home International series, which was a highlight of the end of the season, without compromising on style or atmosphere.", "The return of the Home series with a friendly atmosphere can be achieved while keeping up with the growing fan base.", "It’s a time to rejuvenate players and create new opportunities for fans to meet and enjoy each other in friendly format.\""], "smollm:1.7b": ["Smith keen on Home series return"], "deepseek-r1:1.5b": ["Smith has expressed support for the return of the Home International Series after being opposed to it, proposing its reinstatement following Howard Wells' meeting with the four home countries at the Northern Irish FA's next meeting.", "The series was last held in 1984-85 as a traditional Scotland-England fixture, continuing until 1989.", "Smith is particularly excited about the Highlights of the season, including Scotland v England matches, which he believes would enhance the series' meaning.", "He highlights England's criticism for past poor results against friendlies, such as 0-0-Holland draws, and acknowledges the potential dangers of not applying to the fixture schedule."], "tinyllama:1.1b": ["Scotland manager Walter Smith believes that bringing back the Home International series is essential for adding meaning to friendly games and ensuring that Scotland's performances are held to high standards.", "The former England FA chief executive, Howard Wells, has proposed this plan for the next meeting of four home countries, including Wales and Northern Ireland.", "Smith, who would love to see the series reinstated, believes that a Home International series would provide opportunities for players to apply themselves in the manner they should.", "He also mentioned the importance of fitting the schedule around the fixture games, which he thinks could be de-motivating if not applied properly."], "tinydolphin:1.1b": [" Scotland manager Walter Smith has expressed his support for bringing back the Home International series as an essential part of any friendly game schedule, adding that such a plan would add meaningful games and improve player application.", "The England vs. Scotland fixture is one Smith particularly values, recalling past games in which England's performance was criticized.", "Smith believes it can be detrimental for players if they do not give their best in friendly matches.", "The Home International series, suspended in 1984 due to player shortages, was reinstated in 1989 and has been an important part of the English FA's strategy to maintain a strong connection with Scotland."], "phi:2.7b": [" Walter Smith, Scotland manager, has given his support for reinstating the Home International series.", "The plan is to be proposed by the new chief executive of the Northern Irish FA, Howard Wells, at the next meeting of the four home countries.", "Such a plan would add meaning to friendly games and bring back a highlight of the end of the season - Scotland-England match.", "Smith believes that it can be a dangerous road if players don't apply themselves in friendlies.", "He supports reinstating the Home International series, but has concerns about fitting them into the schedule."], "orca-mini:3b": [" Scotland manager Walter Smith backs the reinstatement of the Home International series, which was done away with in 1984 and continued until 1989.", "The proposal is set to be made by the new chief executive of the Northern Irish FA at the next meeting of the four home countries.", "The England FA has expressed doubt over whether the fixtures could be accommodated at the end of each season.", "However, Smith believes that bringing back the Home International series would add meaning to friendly games and make them more exciting.", "He also supports the idea of having a performance requirement in friendly games to encourage players to give their best."], "hermes3:3b": ["Walter Smith supports reintroducing Home International series."], "stablelm-zephyr:3b": ["Scotland manager Walter Smith supports reinstating the Home International series, which will be proposed by the new Northern Irish FA chief executive Howard Wells at the next meeting of the four home countries.", "The series was discontinued in 1988, with the Scotland-England match remaining until 1989.", "Smith highlights the need for meaningful friendly games and expresses his delight in watching the match again.", "However, he acknowledges the challenge of fitting the fixtures into the existing schedule."], "stablelm2:1.6b": ["Scotland manager Walter Smith is supporting the reinstatement of the Home International series as proposed by new chief executive Howard Wells, despite concerns about scheduling.", "The original plan was dropped in 2014, but Smith believes it adds meaning to friendly games and needs to be brought back.", "Scotland's traditional England-Scotland game continues until 2098."], "granite3.1-dense:2b": ["Scotland manager Walter Smith endorses the proposed reinstatement of the Home International series, advocated by Northern Irish FA chief Howard Wells.", "This series was last played in 1984 and featured a significant Scotland-England fixture until 1989, which Smith values highly as a season highlight.", "He believes reinstating the series would add importance to friendly games, making them more engaging for fans.", "Smith cites examples of England's recent friendly match against Russia, where substitutions were made despite a small attendance, and their 0-0 draw with Holland as reasons why such fixtures are crucial.", "He emphasizes that if players don't perform well in these games, they can become demotivating.", "While acknowledging scheduling challenges, Smith supports the return of home internationals due to their potential benefits for team morale and fan engagement."], "chatgpt-4o-latest": ["Scotland manager Walter Smith supports reinstating the Home International series, which Northern Irish FA chief Howard Wells plans to propose.", "While the English FA doubts the feasibility of scheduling the matches, Smith believes they would add meaning to friendlies.", "The series ended in 1984, with the Scotland-England fixture continuing until 1989, a match Smith would like to see return.", "He argues that friendlies lack competitiveness, citing low attendance and excessive substitutions in other international matches.", "Smith warns that unmotivated performances in friendlies can be detrimental and supports the series' return, though scheduling remains a challenge."]}