{"raw_text": "Newcastle 2-1 Bolton\n \n Kieron Dyer smashed home the winner to end Bolton's 10-game unbeaten run.\n \n Lee Bowyer put Newcastle ahead when he fed Stephen Carr on the right flank, then sprinted into the area to power home a header from the resultant cross. Wanderers hit back through Stelios Giannakopoulos, who ended a fluid passing move with a well-struck volley. But Dyer had the last word in a game of few chances, pouncing on a loose ball after Alan Shearer's shot was blocked and firing into the top corner. Neither side lacked urgency in the early stages of the game, with plenty of tackles flying in, but opportunities in front of goal were harder to come by. Bolton keeper Jussi Jaaskelainen had to make two saves in quick succession midway through the first-half - keeping out Shearer's low shot and Dyer's close-range header - but that was the only goalmouth action of note. And it was almost out of nothing that the Magpies took the lead on 35 minutes. Bowyer found space with a neat turn on the half-way line and striding forward picked out Carr to his right. He then continued his run and with perfect timing made his way into the box where he met Carr's cross with a downward header into the far corner. Bolton had produced little going forward at this point but they responded well.\n \n They were level within six minutes thanks to a smart finish from Giannakopoulos. Jay-Jay Okocha twisted and turned on the edge of the area and after a neat exchange of passes involving Kevin Davies and Gary Speed, the Greek striker found the bottom corner with a first-time strike. The Magpies were opened up again before half-time as Davies set Giannakopoulos in space and Given had to block at his near post. But the home side survived, and they should have re-taken the lead with the first meaningful attack of the second half. Fernando Hierro cynically chopped down Dyer on the edge of the area with the midfielder clean through. But the veteran defender escaped with a booking as there were other defenders nearby, and from the resultant free-kick Laurent Robert curled the ball just wide. Bolton were creating little going forward and they seemed content to frustrate the Magpies. Their strategy seemed to be working until the 69th minute. Alan Shearer's snap-shot was charged down and Dyer reacted first to smash the ball past the despairing Jaaskelainen from six yards.\n \n - Bolton boss Sam Allardyce \"I am bitterly disappointed with the result, but I am probably more disappointed with the second-half performance. \"In the first half we had put them under a lot of pressure, and our goal matched theirs in quality. \"I thought it would lift us and that they might be tired after playing a lot of games, but unfortunately we were not up for the battle in the second half. \"We allowed them to heap too much pressure on us, and in the end we cracked.\" \n  - Newcastle boss Graeme Souness \"We deserved the win. We had a really good second half. \"Bolton are a difficult side to play. You have to match them physically first but we did that, and then we played some football. \"We had a slow first 45 minutes when we looked a bit tired but we got going after that. The scoreline flattered them and we could have had one or two more goals.\" Newcastle: Given, Carr, Boumsong, Bramble, Babayaro, Dyer, Faye, Bowyer, Robert (Jenas 77), Ameobi, Shearer. Subs Not Used: Butt, Harper, Milner, Hughes. Goals: Bowyer 35, Dyer 69. Bolton: Jaaskelainen, Hunt (Fadiga 14), N'Gotty, Ben Haim, Candela, Giannakopoulos, Okocha (Vaz Te 77), Hierro (Campo 64), Speed, Gardner, Davies. Subs Not Used: Jaidi, Poole. Booked: Ben Haim, Hierro. Goals: Giannakopoulos 41. Att: 50,430 Ref: S Dunn (Gloucestershire).\n", "llama3.2:1b": ["Newcastle United 2, Bolton Wanderers 1\n\nKieron Dyer scored the winner for Newcastle with a goal in the 69th minute after Alan Shearer's shot was blocked.", "Bolton struggled to find scoring opportunities and were led by goalkeeper Jussi Jaaskelainen, who made two saves in quick succession during the first half.", "The Magpies dominated the game at times, but Bolton's defense held strong until Dyer's goal.", "Newcastle equalized just before halftime with Wanderers' substitute Stelios Giannakopoulos scoring a smart finish after a neat exchange of passes involving Kevin Davies and Gary Speed.", "The second half saw Bolton re-take the lead through Fernando Hierro, but Newcastle scored again just six minutes later when Alan Shearer fired past Jaaskelainen from six yards out."], "llama3.2:3b": ["Newcastle beat Bolton 2-1 with Kieron Dyer scoring the winner after a goal from Lee Bowyer and Stelios Giannakopoulos equalized for Bolton.", "Alan Shearer had a snap-shot charged down before Dyer scored, with neither side creating many chances despite a lot of tackles being made."], "gemma2:2b": ["Newcastle won 2-1 against Bolton in a game with few clear chances.", "Dyer scored the winning goal for Newcastle after Alan Shearer's shot was blocked.", "Bolton had a good start but were unable to capitalize on their opportunities, allowing Newcastle to take control of the second half and ultimately secure victory."], "qwen2.5:0.5b": ["- Newcastle won 2-1 Bolton\n\nThe Manchester United manager Qwen provides a summary of the match between Manchester United and Bolton Wanderers:\n\n- Manchester United started well with Kieron Dyer scoring an own goal to give them a 1-0 lead.", "- Bolton responded by giving their attacker, Stephen Carr, a header to score from an area.", "- Alan Shearer scored a penalty for Bolton but conceded it.", "- The game ended in a draw as both teams finished the match with equal scores.", "This summary captures the key points of the match's outcome and the performances of each team."], "qwen2.5:1.5b": ["Bolton's 10-game unbeaten run was ended by Newcastle's 2-1 victory in a match where both sides struggled for goals and lacked urgency until the second half when Newcastle scored with a late Dyer header.", "Bolton's Sam Allardyce criticized the team's performance, while Graeme Souness praised Newcastle's improved second-half play despite their slow start to the game."], "qwen2.5:3b": ["Newcastle won 2-1 against Bolton in a game where Kieron Dyer scored the winning goal after Bolton had tied it through Stelios Giannakopoulos.", "The match started with no clear chances but Newcastle took the lead when Lee Bowyer assisted Stephen Carr for a header, followed by Alan Shearer's low shot that Jaaskelainen saved.", "Bolton equalized shortly after with Stelios Giannakopoulos' volley.", "Newcastle regained the lead in the 69th minute as Kieron Dyer scored from close range on a free-kick, ending Bolton's 10-game unbeaten run.", "Bolton boss Sam Allardyce criticized his team for not performing well in the second half, while Newcastle manager Graeme Souness praised his side's performance and strategy."], "opencoder:1.5b": ["Newcastle 2-1 Bolton\n\nKieron Dyer smashed home the winner to end Bolton's 10-game unbeaten run.", "Lee Bowyer put Newcastle ahead when he fed Stephen Carr on the right flank, then sprinted into the area to power home a header from the resultant cross.", "Wanderers hit back through Stelios Giannakopoulos, who ended a fluid passing move with a well-struck volley.", "But Dyer had the last word in a game of few chances, pouncing on a loose ball after Alan Shearer's shot was blocked and firing into the top corner.", "Neither side lacked urgency in the early stages of the game, with plenty of tackles flying in, but opportunities in front of goal were harder to come by.", "Bowyer found space with a neat turn on the half-way line and strided forward picked out Carr to his right.", "He then continued his run and with perfect timing made his way into the box where he met Carr's cross with a downward header into the far corner.", "Bolton had produced little going forward at this point but they responded well.", "They were level within six minutes thanks to a smart finish from Giannakopoulos.", "Jay-Jay Okocha twisted and turned on the edge of the area and after a neat exchange of passes involving Kevin Davies and Gary Speed, the Greek striker found the bottom corner with a first-time strike.", "The Magpies were opened up again before half-time as Davies set Giannakopoulos in space and Given had to block at his near post.", "But the home side survived, and they should have re-taken the lead with the first meaningful attack of the second half.", "Fernando Hierro cynically chopped down Dyer on the edge of the area with the midfielder clean through.", "But the veteran defender escaped with a booking as there were other defenders nearby, and from the resultant free-kick Laurent Robert curled the ball just wide.", "Bolton were creating little going forward and they seemed content to frustrate the Magpies.", "Their strategy seemed to be working until the 69th minute.", "Alan Shearer's snap-shot was charged down and Dyer reacted first to smash the ball past the despairing Jaaskelainen from six yards.", "- Bolton boss Sam Allardyce \"I am bitterly disappointed with the result, but I am probably more disappointed with the second-half performance.", "\"In the first half we had put them under a lot of pressure, and our goal matched theirs in quality.", "\"I thought it would lift us and that they might be tired after playing a lot of games, but unfortunately we were not up for the battle in the second half.", "\"We allowed them to heap too much pressure on us, and in the end we cracked.\"", "- Newcastle boss Graeme Souness \"We deserved the win.", "We had a really good second half.", "\"Bolton are a difficult side to play.", "You have to match them physically first but we did that, and then we played some football.", "\"We had a slow first 45 minutes when we looked a bit tired but we got going after that.", "The scoreline flattered them and we could have had one or two more goals.\"", "Newcastle: Given, Carr, Boumsong, Bramble, Babayaro, Dyer, Faye, Bowyer, Robert (Jenas 77), Ameobi, Shearer.", "Subs Not Used: Butt, Harper, Milner, Hughes.", "Goals: Bowyer 35, Dyer 69.", "Bolton: Jaaskelainen, Hunt (Fadiga 14), N'Gotty, Ben Haim, Candela, Giannakopoulos, Okocha (Vaz Te 77), Hierro (Campo 64), Speed, Gardner, Davies.", "Subs Not Used: Jaidi, Poole.", "Booked: Ben Haim, Hierro.", "Goals: Giannakopoulos 41.", "Att: 50,430 Ref: S Dunn (Gloucestershire).\""], "smollm:1.7b": ["Output only the summary as plain text—no explanations, no formatting, no reasoning process."], "deepseek-r1:1.5b": ["Newcastle 2-1 Bolton  \nKieron Dyer closed in on the goal with a header to end Bolton's unbeaten run.", "Lee Bowyer scored from halfway.", "Giannakopoulos made two saves before equalizing for Bolton, who responded with a late goal by Faye.", "Dyer and given scores showed he matched their quality in the second half despite a late fall.", "Both teams had key players: Newcastle with Given, Carr, Boumsong, etc., and Bolton with Jaaskelainen, Hunt, N'Gotty, etc."], "tinyllama:1.1b": ["Newcastle United defeated Bolton Wanderers by a goal to nil in a thrilling match at St. James' Park, with the home side securing their first win under new manager Chris Waddle.", "The game was played in a scrappy and unpredictable manner, with both teams putting on a display of physicality throughout.", "Newcastle dominated much of the game's action, scoring from an unexpected angle through Stephen Carr late on.", "Despite being ahead at halftime, the Magpies struggled to maintain their momentum after the break and allowed Bolton to mount a comeback.", "The match went down as a close but competitive affair, with both sides playing strong football and creating many chances.", "In an exciting final quarter, Newcastle took the lead through a clever free-kick from Alan Shearer, only for Bolton to strike back through Luca Synot.", "However, the Magpies' pressure eventually paid off as their star striker Robert, who had been kept quiet in the first half, scored the winner with a sharply struck goal in the 69th minute.", "Newcastle: Given, Carr, Boumsong, Brab, Babayaro, Dyers (Hughes 77), Fahey (Jenas 54), Bowyer, Robert (Jeans 81), Améi, Shearer.", "Subs Not Used: Butt, Harper, Milner, Hughes.", "Goals: Robert 35, Shearer 69.", "Bolton Wanderers: Jaaskelainen, Huntington, N'Golo Kante (Campo 77), Ben Haim, Gardner, Giannakopoulos, Speed, Okocha (Vaz Te 45), Hierro (Campo 81), Diamont, Giannelli.", "Subs Not Used: Jaidi, Poole.", "Booked: Gardner, Giannelli.", "Goals: Shearer 30, Giannelli 69.", "Attendance: 50,430 Referee: Stuart Sunter (Gloucestershire)"], "tinydolphin:1.1b": [" Summarized as per the AI's understanding of the text and provided in an easy-to-understand manner.", "Newcastle United won against Bolton Wanderers in a tightly contested match, with Kieron Dyer scoring the decisive goal with a header to end the unbeaten run for both teams.", "This victory is seen as an important win for Newcastle, who have been struggling recently with their league form."], "phi:2.7b": [" Newcastle won 2-1 against Bolton in a tense game of soccer.", "Dyer scored the winner with a powerful header after a long ball from Carr on the right flank.", "Bolton had a goal disallowed for offside and were more aggressive early on, but they could not create many chances or score.", "They did manage to get some goals back through Giannakopoulos, who curled in two close-range shots, but Newcastle sealed the victory with a late counter-attack that finished in the corner.", "The match was watched by 50,430 fans and saw both teams play well, especially Dyer and Shearer, who scored for their clubs."], "orca-mini:3b": [" Newcastle beat Bolton 2-1 with goals from Kieron Dyer and Jay-Jay Okocha, while Alan Shearer's snap-shot was charged down by Kieron Dyer."], "hermes3:3b": ["Newcastle beat Bolton 2-1 with Kieron Dyer scoring the winning goal.", "Bolton ended their 10-game unbeaten run."], "stablelm-zephyr:3b": ["Newcastle won 2-1 against Bolton, with Kieron Dyer scoring the winning goal after a loose ball following Alan Shearer's shot being blocked.", "Lee Bowyer had earlier put Newcastle ahead, and Stelios Giannakopoulos equalized for Bolton.", "The game saw few chances and both teams exerted pressure throughout.", "Despite this, Newcastle should have scored more goals and took the lead before half-time thanks to a fortunate bounce of the ball, while their defense held up against a frantic Bolton attack in the second half.", "Bolton manager Sam Allardyce was disappointed with the result and his team's performance in the second half.", "Newcastle boss Graeme Souness felt that they deserved the win and had a good second half after initially struggling."], "chatgpt-4o-latest": ["Newcastle ended Bolton's 10-game unbeaten run with a 2-1 victory.", "Lee Bowyer opened the scoring for Newcastle in the 35th minute with a header from Stephen Carr's cross.", "Bolton equalized six minutes later through Stelios Giannakopoulos, who finished a well-worked passing move with a volley.", "The game had few clear chances, but Kieron Dyer secured the win in the 69th minute, firing into the top corner after Alan Shearer's shot was blocked.", "Bolton struggled to create opportunities in the second half, and Newcastle's pressure paid off.", "Bolton manager Sam Allardyce was disappointed with his team's second-half performance, while Newcastle boss Graeme Souness felt his side deserved the win."], "stablelm2:1.6b": ["Newcastle beat Bolton 2-1 with Kieron Dyer scoring the winner in a game of few chances.", "Lee Bowyer and Stephen Carr scored for Newcastle, while Stelios Giannakopoulos hit the equalizer for Wanderers after Jay-Jay Okocha set him up.", "Alan Shearer's shot was charged down by Dyer to give the Magpies the lead, but Bolton responded with a goal from Stelios Giannakopoulos."], "granite3.1-dense:2b": ["Newcastle United secured a 2-1 victory over Bolton Wanderers, ending the latter's 10-game unbeaten run.", "Kieron Dyer scored the decisive goal in the 69th minute, capitalizing on a charged-down shot by Alan Shearer and calmly slotting it past Jussi Jaaskelainen.", "Bolton equalized through Stelios Giannakopoulos, who finished a well-worked team move in the 41st minute.", "The match featured few scoring opportunities, with most action occurring in the first half, where both goalkeepers made crucial saves.", "Newcastle's Lee Bowyer opened the scoring with a powerful header from Stephen Carr's cross, while Giannakopoulos equalized shortly after.", "In the second half, Newcastle dominated possession and pressure, nearly taking the lead through Fernando Hierro's free-kick that hit the post.", "Newcastle boss Graeme Souness praised his team's second-half performance, while Bolton's Sam Allardyce expressed disappointment in their lackluster second-half display after a strong first half."]}