{"raw_text": "Middlesbrough 2-2 Charlton\n \n A late header by teenager Danny Graham earned Middlesbrough a battling draw with Charlton at the Riverside.\n \n Matt Holland had put the visitors ahead in the 14th minute after his shot took a deflection off Franck Queudrue. But Middlesbrough peppered the Charlton goal after the break and Chris Riggott stroked home the equaliser. Shaun Bartlett's strike put Charlton back in front but that lead lasted just six minutes before Graham rushed onto Queudrue's pass to head home. The match burst to life from the whistle and Charlton defender Hermann Hreidarsson had sight of an open goal after just six minutes. Hreidarsson received Danny Murphy's free-kick from the right but he crashed his free header wide of the far post. The Iceland international looked such a danger the Boro bench could be heard issuing frantic instructions to mark him.\n \n Charlton's early pressure paid off when Bartlett received a long ball from Talal El Karkouri in the box and laid it off to Holland who buried his right-footed strike. Szilard Nemeth, recalled in place of Joseph-Desire Job, was twice denied his chance to get Middlesbrough back on level terms by Dean Kiely. The striker played a great one-two with Jimmy Floyd Hasselbaink only to see Kiely get down well to smother his shot before directing a header straight into the keeper's arms. Boro had plenty of time on the ball but the Addicks comfortably mopped up the pressure - with Kiely tipping a Hasselbaink header over the bar - to take their lead into half-time.\n \n It was all one-way traffic after the break at the Riverside as Middlesbrough poured forward and Kiely even saved Hreidarsson's blushes when he palmed the ball away to prevent a Charlton own goal. But the Addicks keeper could do nothing about Riggott's equaliser in the 74th minute. The Boro defender looked suspiciously offside as he got on the end of Gareth Southgate's misdirected effort, but despite the Charlton protests his goal stood. The Addicks did not let their heads drop and Bartlett left the Boro defence standing, picking up Hreidarsson's cross to easily sink his right-footed strike. But substitute Graham was on hand to grab a share of the points for the home side. The 19-year-old striker nodding home the equaliser - and his first Premiership goal - with five minutes left on the clock.\n \n \"I felt we did enough to win the game even though the first half was lacklustre. \"We dominated after the break, the players showed a fantastic response and we should have gone on to win. \"But for (Charlton goalkeeper) Dean Kiely, who made three tremendous saves, we could have scored five or six.\"\n \n \"To take the lead and then to get penned back, it feels a little bit like a defeat,\" admitted Kiely. \"We were winning but Middlesbrough kept knocking on the door. But we stood up and credit to us we didn't capitulate. \"We'll kick on now. Our short-term ambition is to progress from the seventh place finish from last year.\"\n \n Nash, Reiziger (Graham 82), Riggott, Southgate, Queudrue, Parlour (Job 86), Doriva, Nemeth (Parnaby 87), Zenden, Downing, Hasselbaink.\n \n Subs Not Used: Cooper, Knight.\n \n Riggott 74, Graham 86.\n \n Kiely, Hreidarsson, Perry, El Karkouri, Young, Konchesky, Murphy (Euell 78), Holland, Kishishev, Thomas (Johansson 72), Bartlett.\n \n Subs Not Used: Fish, Jeffers, Andersen.\n \n Konchesky, Hreidarsson, Perry.\n \n Holland 14, Bartlett 80.\n \n 29,603\n \n M Riley (W Yorkshire).\n", "llama3.2:1b": ["Middlesbrough drew 2-2 with Charlton at the Riverside.", "Middlesbrough scored through Danny Graham's late header and Shaun Bartlett's strike after Charlton's early pressure paid off.", "Chris Riggott equalized for Charlton in the 74th minute, but Graham equalized again just minutes later.", "Charlton dominated the match after the break, with substitute Dean Kiely making several key saves to preserve a lead he had scored through Gareth Southgate's misdirected effort.", "Middlesbrough pushed forward and Graham added his second goal of the game in injury time.", "The match was described as a \"close but not conclusive\" draw, with Charlton ultimately failing to capitalise on their initial lead."], "llama3.2:3b": ["Middlesbrough drew 2-2 with Charlton at the Riverside.", "Matt Holland scored for Charlton in the 14th minute but Chris Riggott equalised before Shaun Bartlett put Charlton ahead again.", "However, substitute Danny Graham scored a late winner to earn Middlesbrough a share of the points."], "gemma2:2b": ["Middlesbrough and Charlton played to a 2-2 draw.", "Danny Graham scored the equalizer for Middlesbrough in the 86th minute.", "The match was back and forth with Charlton taking an early lead before Middlesbrough dominated after halftime.", "Both teams had chances, but neither could break through until Graham headed home the equalizer."], "qwen2.5:0.5b": ["Middlesbrough beat Charlton 2-2 after a late header from Danny Graham and equaliser by Chris Riggott.", "Charlton's early pressure earned them the lead at half-time but Middlesbrough dominated in the second half.", "Kiely saved Bartlett's goal and Graham scored the winning goal for Middlesbrough.", "Charlton needed to win five games to avoid a relegation place.", "The text is a summary of a football match between Middlesbrough (vs Charlton) that took place at Riverside Park on 2/3/19.", "It mentions the key players,比分及表现，但没有详细描述比赛过程或球员细节。"], "qwen2.5:1.5b": ["Middlesbrough drew 2-2 with Charlton.", "Danny Graham scored the winner late on after Chris Riggott equalized in the 74th minute.", "Both sides had chances but neither managed to secure a win."], "qwen2.5:3b": ["Middlesbrough drew 2-2 with Charlton at the Riverside.", "Matt Holland gave Charlton a lead in the 14th minute, followed by Chris Riggott equalizing for Middlesbrough late in the second half.", "Danny Graham scored an equalizer in injury time for Middlesbrough, while Shaun Bartlett put Charlton ahead briefly but was also disallowed.", "Both teams had opportunities to win early on, with Dean Kiely making crucial saves for Charlton.", "The match ended as a pointshare, with both sides praising their efforts despite the result."], "opencoder:1.5b": ["Middlesbrough 2-2 Charlton\n\nA late header by teenager Danny Graham earned Middlesbrough a battling draw with Charlton at the Riverside.", "Matt Holland had put the visitors ahead in the 14th minute after his shot took a deflection off Franck Queudrue.", "But Middlesbrough peppered the Charlton goal after the break and Chris Riggott stroked home the equaliser.", "Shaun Bartlett's strike put Charlton back in front but that lead lasted just six minutes before Graham rushed onto Queudrue's pass to head home.", "The match burst to life from the whistle and Charlton defender Hermann Hreidarsson had sight of an open goal after just six minutes.", "Hreidarsson received Danny Murphy's free-kick from the right but he crashed his free header wide of the far post.", "The Iceland international looked such a danger the Boro bench could be heard issuing frantic instructions to mark him.", "Charlton's early pressure paid off when Bartlett received a long ball from Talal El Karkouri in the box and laid it off to Holland who buried his right-footed strike.", "Szilard Nemeth, recalled in place of Joseph-Desire Job, was twice denied his chance to get Middlesbrough back on level terms by Dean Kiely.", "The striker played a great one-two with Jimmy Floyd Hasselbaink only to see Kiely get down well to smother his shot before directing a header straight into the keeper's arms.", "Boro had plenty of time on the ball but the Addicks comfortably mopped up the pressure - with Kiely tipping a Hasselbaink header over the bar - to take their lead into half-time.", "It was all one-way traffic after the break at the Riverside as Middlesbrough poured forward and Kiely even saved Hreidarsson's blushes when he palmed the ball away to prevent a Charlton own goal.", "But the Addicks keeper could do nothing about Riggott's equaliser in the 74th minute.", "The Boro defender looked suspiciously offside as he got on the end of Gareth Southgate's misdirected effort, but despite the Charlton protests his goal stood.", "The Addicks did not let their heads drop and Bartlett left the Boro defence standing, picking up Hreidarsson's cross to easily sink his right-footed strike.", "But substitute Graham was on hand to grab a share of the points for the home side.", "The 19-year-old striker nodding home the equaliser - and he first Premiership goal - with five minutes left on the clock.", "“I felt we did enough to win the game even though the first half was lacklustre.", "”We dominated after the break, the players showed a fantastic response and we should have gone on to win.", "“But for (Charlton goalkeeper) Dean Kiely, who made three tremendous saves, we could have scored five or six.”\n\n“I'll kick on now.", "Our short-term ambition is to progress from the seventh place finish from last year.”"], "smollm:1.7b": ["Summarize the following text concisely, preserving key ideas and details.", "The United States has a long history of immigration, with people from many countries coming to the country in search of a better life.", "The first immigrants came to America in 1607 when the English established the first permanent settlement at Jamestown.", "Over time, more and more people immigrated to the United States, including those from Europe, Asia, Africa, and Latin America.", "The early years of immigration were marked by discrimination and prejudice against non-white immigrants.", "However, as the country grew and prospered, attitudes towards immigration began to change.", "In 1852, Congress passed the Chinese Exclusion Act, which banned Chinese immigrants from entering the United States for 10 years.", "This was followed by other laws that restricted immigration from certain countries, including those from Europe.", "In the early 20th century, the United States experienced a large wave of immigration, particularly from Southern and Eastern Europe.", "Many of these immigrants settled in urban areas, such as New York City and Chicago, where they established communities and businesses.", "The country also became a destination for refugees fleeing war and persecution in their home countries.", "In recent years, the United States has become a more accepting and welcoming country to immigrants.", "In 1965, Congress passed the Immigration and Nationality Act, which abolished national origin quotas and allowed for greater immigration from non-European countries.", "Today, the United States is one of the largest recipients of international students and refugees in the world.", "Despite these changes, there are still many challenges facing immigrants to the United States today.", "Many face discrimination and xenophobia, while others struggle to access basic rights such as healthcare and education.", "However, the country remains a beacon of hope for people seeking a better life, and its history of immigration continues to shape its identity and culture.", "Some notable examples of immigrant groups in the United States include:\n\n* The Irish, who came to America in large numbers during the Great Famine of 1845-1852.", "* The Germans, who immigrated to the country in the late 19th and early 20th centuries.", "* The Italians, who arrived in the United States in the late 19th century.", "* The Mexicans, who have been a major source of immigration to the United States since the 1980s.", "* The Asian Americans, who are a growing and diverse group of immigrants from countries such as China, India, and Korea."], "deepseek-r1:1.5b": ["Middlesbrough defeated Charlton 2-2 at Riverside with Danny Graham's late header setting Middlesbrough in a difficult situation after the break.", "Middlesbrough scored through Matt Holland, Chris Riggott, and Shaun Bartlett, while Charlton's goal came through Chris Riggott.", "Hermann Hreidalsson blocked a clear goal attempt by Graham, and Boro held on to their pressure to win despite early lead from Shane.", "Charlton held firm, though Graham made a late goal.", "Middlesbrough scored again in the second half, and Graham added his first professional goal with five minutes left."], "tinyllama:1.1b": ["In the match between Midlendsbrough and Charlton at the Riverside, midfielder Danny Graham scored a late goal for his side to earn a battling draw.", "Despite a strong start by Charlton, the Iceland international saw several early chances go against him as Midlendsbrough struggled to find their rhythm in the first half.", "However, with the introduction of substitute midfielder Danish Hasselbaink, the Addicks kept up their pressure and eventually took the lead through Danny Murphy's header.", "With Charlton's hopes of a comeback sunk, substitute goalkeeper Dean Kiely saved a late equaliser for Midlendsbrough and earned them a draw in a thrilling encounter at the Riverside."], "tinydolphin:1.1b": [" A summary of the match between Middlesbrough and Charlton is provided, with the focus being on goalkeeper Dean Kiely's performance, as well as the outcome and discussions surrounding both teams' shortcomings."], "phi:2.7b": [" Middlesbrough drew 2-2 with Charlton at the Riverside on December 12th, 2018.", "The match began with a late header from teenager Danny Graham for Middlesbrough, but Matt Holland quickly equalized for the visitors in the 14th minute.", "After that, Chris Riggott scored two goals within six minutes to put Middlesbrough back in front.", "However, Shaun Bartlett scored for Charlton and the match became more competitive.", "Charlton's early pressure paid off when Talal El Karkouri passed to Matt Holland who scored twice.", "In the end, Middlesbrough won 2-2, with Danny Murphy scoring a late equalizer."], "orca-mini:3b": [" Middlesbrough drew 2-2 with Charlton at the Riverside in a match where the visitors dominated after the break but failed to score.", "Goals from Danny Graham and talisman Chris Riggott helped Boro earn a share of the spoils, while the Addicks had opportunities to win the game through Franck Queudrue and Matt Holland.", "But substitute Graham snatched a point for the home side with just six minutes left on the clock.", "It was a game where both teams had their chances but couldn't convert them, and the draw keeps Middlesbrough in fourth place, while Charlton remain in 10th."], "hermes3:3b": ["Middlesbrough draw Charlton 2-2; Graham scores late header for Boro."], "stablelm-zephyr:3b": ["Middlesbrough drew with Charlton 2-2 at the Riverside, with a late header by Danny Graham earning the home team a point.", "Matt Holland had put Charlton ahead in the 14th minute, but Middlesbrough applied pressure after the break and Chris Riggott equalized in the 74th minute.", "Shaun Bartlett's strike put Charlton back in front, only for Danny Graham to head home in the 86th minute to secure a point for Middlesbrough.", "Both teams' benches communicated frantically to mark Hermann Hreidarsson of Charlton, who seemed a constant danger."], "chatgpt-4o-latest": ["Middlesbrough and Charlton played to a 2-2 draw at the Riverside Stadium, with teenager Danny Graham scoring a late equalizer.", "Charlton took the lead in the 14th minute when Matt Holland's shot deflected off Franck Queudrue.", "Middlesbrough pressed hard after halftime, and Chris Riggott equalized in the 74th minute.", "However, Charlton regained the lead through Shaun Bartlett six minutes later.", "Middlesbrough responded quickly, with Graham heading in Queudrue's pass in the 86th minute to secure a point.", "Charlton goalkeeper Dean Kiely made several key saves to deny Middlesbrough a win."], "stablelm2:1.6b": ["Teenager Danny Graham scores a late header to give Middlesbrough a 2-2 draw against Charlton at the Riverside.", "Matt Holland put Charlton in front in the 1st minute, but Chris Riggott and Shaun Bartlett scored for Middlesbrough after the break.", "The match was filled with action and tense moments, with Dean Kiely making three crucial saves for Charlton."], "granite3.1-dense:2b": ["In a Premier League match at the Riverside, Middlesbrough drew 2-2 with Charlton.", "Early in the game, Charlton's Hermann Hreidarsson nearly scored from a free kick, wide of the post.", "This led to Matt Holland scoring for Charlton after receiving a long ball and converting it into the net.", "Despite dominating possession, Middlesbrough struggled to equalize until the 74th minute when Chris Riggott scored with what appeared to be an offside decision against him.", "Shaun Bartlett then put Charlton back in front, but only for six minutes before Danny Graham, a 19-year-old substitute, headed home an equalizer.", "The match was characterized by intense pressure from Middlesbrough after the break, with numerous chances missed and Charlton goalkeeper Dean Kiely making crucial saves.", "Kiely expressed regret about not preventing a potential five or six-goal defeat, emphasizing his team's resilience in holding their lead until Graham's late equalizer secured the draw for Middlesbrough."]}