{"raw_text": "Dundee Utd 4-1 Aberdeen\n \n Dundee United eased into the semi-final of the Scottish Cup with an emphatic win over Aberdeen.\n \n Alan Archibald prodded United ahead in 19 minutes and James Grady made it two from close range 10 minutes later. Richie Byrne's header gave Aberdeen a way back into the game, but Stevie Crawford restored United's lead from 18 yards before half time. The scoring was completed by Grady just after the break - a superb shot on the turn making it 4-1. Tony Bullock in the United goal was called into action for the first time with just over a quarter-of-an-hour on the clock. Noel Whelan laid the ball off to Jamie Winter on the edge of the box, but his first-time effort was gathered by the United keeper. Moments later though, the home side took the lead. Barry Robson whipped in a free kick from the right, which Stevie Crawford caught on the volley. Russell Anderson failed to deal with it and Whelan's clearance off the line landed kindly at the feet of Archibald, who poked the ball into the net. United doubled their lead after 29 minutes when Grady tapped the ball into an empty net after Robson had headed Mark Wilson's cross off the angle of post and bar. But only three minutes later Aberdeen clawed their way back into the match. A free kick from the left by Winter was met powerfully by the head of Byrne at the back post, leaving Bullock helpless.\n \n United restored their two-goal lead four minutes before the end of a highly entertaining first half. Jason Scotland played a perfectly-weighted pass into the path of the onrushing Crawford and he coolly beat Ryan Esson from 18 yards. United ended the game as a contest just two minutes after the interval. Grady received a pass from Crawford with his back to goal on the edge of the box and after taking one touch, he spun to volley the ball past the despairing dive of Esson. The home side were in complete control and it required a good stop from Esson to keep out Robson's drive after 62 minutes. The keeper denied the same player again 10 minutes later, beating away his fierce shot from the left of the penalty area. Robson saw another long-range effort tipped round the post before a cute lob was headed off the line.\n \n Bullock, Duff, Wilson, Ritchie, Archibald, Scotland (Samuel 63), Brebner, Kerr (Cameron 87), Robson, Crawford, Grady.\n \n Colgan, Dodds, Kenneth.\n \n Brebner.\n \n Archibald 19, Grady 29, Crawford 41, Grady 47.\n \n Esson, Hart, Anderson, Diamond, Byrne (Morrison 75), McNaughton, Heikkinen (Foster 27), Winter, Clark (Stewart 51), Mackie, Whelan.\n \n Blanchard, McGuire.\n \n : Anderson, Diamond.\n \n Byrne 33.\n \n 8,661\n \n K Clark\n", "llama3.2:1b": ["Dundee United won 4-1 over Aberdeen in the Scottish Cup semi-final.", "Dundee United scored two goals early in the second half and then one more before halftime.", "James Grady scored two goals for United, with Alan Archibald scoring a goal just after the break.", "Aberdeen scored one goal in the first half but it was cancelled out by United's 4-1 win at the end of regular time."], "llama3.2:3b": ["Dundee United defeated Aberdeen 4-1 in the Scottish Cup to reach the semi-final.", "Stevie Crawford and James Grady scored two of the goals for United, while Richie Byrne scored one for Aberdeen.", "Dundee United took a lead before half-time with Crawford's goal and doubled it with Grady's strike after a free kick.", "Grady sealed the win with his third goal just after the break, beating Ryan Esson from 18 yards out."], "gemma2:2b": ["Dundee United defeated Aberdeen 4-1 in the Scottish Cup semi-final.", "Alan Archibald opened the scoring for United, followed by James Grady (2 goals).", "Richie Byrne scored for Aberdeen.", "Stevie Crawford scored twice to put United ahead, and Grady sealed the win with a brilliant goal before halftime.", "The second half saw more goals from United, but an effort from Aberdeen's Byrne."], "qwen2.5:0.5b": ["Dundee United beat Aberdeen to reach the semi-final of the Scottish Cup.", "Dundee United scored first with a penalty by Archibald and then James Grady netted two goals from distance.", "Grady scored another goal in extra time after Robbie Burns' header.", "Aberdeen pulled ahead in their second half, but Dundee United scored again to hold onto the lead.", "They were reduced to 2-0 down before losing the game.", "Some highlights:\n1.", "Dundee United beat Aberdeen to reach semi-final.", "2.", "Dundee United took the lead with a penalty by Archibald and two goals from distance by James Grady in extra time.", "3.", "Dundee United scored again against Aberdeen in their second half.", "4.", "Aberdeen were reduced to 2-0 down but still held on with a score of 3-1.", "5.", "They played for more than an hour before losing the game.", "The summary is condensed into a single, concise passage without including any unnecessary details or explanations."], "qwen2.5:1.5b": ["Dundee United won the Scottish Cup semi-final 4-1 over Aberdeen."], "qwen2.5:3b": ["Dundee United won the Scottish Cup semi-final with a 4-1 victory over Aberdeen.", "Alan Archibald and James Grady scored in the first half for Dundee United, who were ahead until Richie Byrne's header after halftime.", "Stevie Crawford then doubled the lead before Jamie Grady's goal just after half-time.", "Aberdeen tried to respond through Noel Whelan but failed as Dundee maintained control, with Jason Scotland scoring a crucial goal from a free kick.", "The home side held on for a 4-1 victory despite multiple attempts by Aberdeen, led by goalkeeper Tony Bullock."], "opencoder:1.5b": ["Dundee Utd 4-1 Aberdeen\n\nAlan Archibald prodded United ahead in 19 minutes and James Grady made it two from close range 10 minutes later.", "Stevie Crawford restored United's lead from 18 yards before half time.", "The scoring was completed by Grady just after the break - a superb shot on the turn making it 4-1.", "Tony Bullock in the United goal was called into action for the first time with just over a quarter-of-an-hour on the clock.", "Noel Whelan laid the ball off to Jamie Winter on the edge of the box, but his first-time effort was gathered by the United keeper.", "Moments later though, the home side took the lead.", "Barry Robson whipped in a free kick from the right, which Stevie Crawford caught on the volley.", "Russell Anderson failed to deal with it and Whelan's clearance off the line landed kindly at the feet of Archibald, who poked the ball into the net.", "United doubled their lead after 29 minutes when Grady tapped the ball into an empty net.", "Aberdeen clawed their way back into the match, a free kick from the left by Winter was met powerfully by the head of Byrne at the back post, leaving Bullock helpless.", "United restored their two-goal lead four minutes before the end of a highly entertaining first half.", "Jason Scotland played a perfectly-weighted pass into the path of the onrushing Crawford and he coolly beat Ryan Esson from 18 yards.", "United ended the game as a contest just two minutes after the interval.", "Grady received a pass from Crawford with his back to goal on the edge of the box and after taking one touch, he spun to volley the ball past the despairing dive of Esson.", "The home side were in complete control and it required a good stop from Esson to keep out Robson's drive after 62 minutes.", "The keeper denied the same player again 10 minutes later, beating away his fierce shot from the left of the penalty area.", "Robson saw another long-range effort tipped round the post before a cute lob was headed off the line."], "smollm:1.7b": ["The summary should be concise and to the point, preserving the key ideas and details of the text.", "The goal is to provide a brief overview of the main points made in the original text without including unnecessary information or analysis.", "Here's an example of how you could summarize the given text:\n\n\"Dundee United eased into the semi-final of the Scottish Cup with an emphatic win over Aberdeen.", "Alan Archibald prodded United ahead in 19 minutes and James Grady made it two from close range 10 minutes later.", "Stevie Crawford restored United's lead after 29 minutes when Robson had headed Mark Wilson's cross off the angle of post and bar.", "But only three minutes later Aberdeen clawed their way back into the match.", "A free kick from the left by Winter was met powerfully by the head of Byrne at the back post, leaving Bullock helpless.", "United restored their two-goal lead four minutes before the end of a highly entertaining first half.", "Jason Scotland played a perfectly-weighted pass into the path of the onrushing Crawford and he coolly beat Ryan Esson from 18 yards.", "United ended the game as a contest just two minutes after the interval.", "Grady received a pass from Crawford with his back to goal on the edge of the box and after taking one touch, he spun to volley the ball past the despairing dive of Esson.", "The home side were in complete control and it required a good stop from Esson to keep out Robson's drive after 62 minutes.", "The keeper denied the same player again 10 minutes later, beating away his fierce shot from the left of the penalty area.", "Robson saw another long-range effort tipped round the post before a cute lob was headed off the line.\"", "Note that this summary should be concise and to the point, avoiding unnecessary information or analysis.", "The goal is to provide a brief overview of the main points made in the original text without including unnecessary details or examples."], "deepseek-r1:1.5b": ["Dundee United won their semi-final against Aberdeen with a thrilling 4-1 victory.", "They scored early, reaching two goals from close range after James Grady's fourth-minute goal.", "Stevie Crawford restored the lead just after half-time.", "The game was completed on its way to 4-1 by Grady before the break.", "United maintained control through a strong first-half run, with Jason Scotland's pass finding Ryan Esson.", "The home side came back in the second half but were stopped near the end.", "Essential substitutions and moments like Grady's header from the spot and Crawford's corner-kick set the tone.", "The match was entertaining with key moments highlighted by Grady scoring a late winner.", "Key players involved include Alan Archibald, James Grady, Stevie Crawford, and others who played crucial roles in securing the win.", "Summary: Dundee United 4-1 Aberdeen, secured dominance early; key goals scored by Grady and Crawford; intense match with numerous substitutions."], "tinyllama:1.1b": ["During the first half of a highly entertaining Scottish Cup match between Aberdeen and Dundee United, the home team took a two-goal lead through an emphatic goal from Alan Archibauld and a superb effort from Jamie Winter.", "Aberdeen's goalkeeper, Noel Whelan, was tested twice with free kicks from Robson and Brebner but managed to keep out their shots.", "United quickly responded in the second half and doubled their lead through Mark Wilson's header, before Jason Scotland scored an extras-free goal for the visitors.", "The home team ended the game as a contest just two minutes after the interval with a penalty kick saved by Dundee United's Ryan Esson.", "United held on to book a place in the semi-finals of the Scottish Cup, which will be played at Hampden Park on March 25th."], "tinydolphin:1.1b": [" In summary, the match was won by Dundee United who managed to defeat Aberdeen with a final score of 4-1.", "The match took place in the Scottish Cup and was played at Dundee's home ground, Palmerston Stadium.", "The game had plenty of action on both sides with goals from Alan Archibald, Richie Byrne, and Stevie Crawford contributing to the victory for United.", "Aberdeen's goal came from a free kick that was headed by Jason Scotland, which was then volleyed into the net by Barry Robson."], "phi:2.7b": [" Dundee United won 4-1 against Aberdeen in the Scottish Cup semi-final with Alan Archibald and James Grady scoring two goals each, while Stevie Crawford and Tony Bullock helped secure the win for United.", "Despite a goal from Aberdeen's Richie Byrne, United dominated the game and won thanks to an excellent performance by their goalkeeper Noel Whelan."], "orca-mini:3b": [" Dundee United beat Aberdeen 4-1 in the Scottish Cup semi-final.", "Alan Archibald scored two goals for the home team in the first half, while Stevie Crawford scored a goal from close range in the second half.", "The game was intense with both teams having chances to score but it ended up as a comfortable victory for the home team."], "hermes3:3b": ["Dundee Utd beat Aberdeen 4-1 in the Scottish Cup match.", "Alan Archibald and James Grady scored two goals each for Dundee United, with Richie Byrne scoring Aberdeen's goal."], "stablelm-zephyr:3b": ["Dundee Utd reached the semi-finals of the Scottish Cup after a dominant 4-1 victory over Aberdeen.", "Alan Archibald and James Grady scored early goals, with Grady scoring from the rebound.", "Stevie Crawford restored Dundee's lead before half time with a long shot.", "Dundee United continued their strong performance in the second half, with Grady scoring again and Jason Scotland setting up Crawford for a goal.", "Dundee Utd were in complete control throughout the game, ending it as a strong contender in the competition."], "chatgpt-4o-latest": ["Dundee United secured a place in the Scottish Cup semi-finals with a dominant 4-1 victory over Aberdeen.", "Alan Archibald opened the scoring in the 19th minute, followed by James Grady's close-range finish 10 minutes later.", "Richie Byrne's header briefly gave Aberdeen hope, but Stevie Crawford restored United's two-goal lead before halftime.", "Grady sealed the win just after the break with a superb volley.", "United controlled the game, with Aberdeen's goalkeeper Ryan Esson making several key saves to prevent further damage."], "stablelm2:1.6b": ["Dundee Utd defeated Aberdeen 4-1 in the Scottish Cup quarterfinals, with goals from Alan Archibald (2), James Grady, and a superb shot by Grady just after halftime.", "Richie Byrne had a goal for Aberdeen but was immediately answered by Crawford's two-goal performance.", "The match was filled with action, with United dominating from the start, ending the game as a contest just 25 minutes in."], "granite3.1-dense:2b": ["Dundee United secured their place in the Scottish Cup semi-finals with a commanding 4-1 victory over Aberdeen.", "Alan Archibald and James Grady scored early goals for Dundee United, while Richie Byrne's header briefly brought Aberdeen back into contention.", "Stevie Crawford extended the lead just before halftime from a penalty kick.", "After the break, Grady added another goal with a stunning turn and volley.", "Bullock made crucial saves to keep Aberdeen in the match, but United's dominance was evident as they controlled possession and created numerous scoring opportunities.", "The home team's performance showcased their skill and determination, with Crawford and Grady standing out as key contributors."]}