{"raw_text": "Clyde 0-5 Celtic\n \n Celtic brushed aside Clyde to secure their place in the Scottish Cup semi-final, but only after a nervy and testing first half.\n \n The home side's Craig Bryson had a goal chopped off before Stan Varga headed Celtic into the lead. Alan Thompson scored from the penalty spot at the start of the second half after Shaun Maloney had been fouled. Stilian Petrov slid in a third, Varga tapped in his second and Craig Bellamy completed the rout with a fine drive. Bryn Halliwell was the busier keeper early on, saving from Bellamy, Chris Sutton and Juninho. Clyde had the ball in the net after half-an-hour through a tremendous strike from Bryson, but the referee had already blown for a foul by Petrov. From the resulting free kick, Darren Sheridan curled the ball round the Celtic wall only for the post to deny him. Back at the other end, Halliwell did well to come off his line and block Bellamy's effort to lift the ball over him. The keeper misjudged a corner that Stephane Henchoz headed wide, but a similar scenario five minutes before the break led to the opening goal. The ball was delivered from the left and Halliwell was left floundering as Varga glanced the ball into the net.\n \n Maloney replaced the injured Sutton at half time and he marked his first competitive appearance after a year out injured by helping his side take a two-goal lead just after the break. The young striker fired a free kick straight into the Clyde wall but as he collected the rebound, he was tripped by Bryson and Thompson converted the penalty. Sheridan and Bellamy were involved in something of a flare-up that led to both being booked after the intervention of the assistant referee. Juninho brought out another good save from Halliwell and then Petrov saw a tremendous effort come off the top of the bar. But Petrov and Juninho combined brilliantly to allow the Bulgarian to make it 3-0 on the hour mark - a quick one-two giving him the time and space to steer the ball past Halliwell from 12 yards. Varga got his second goal of the game as Celtic drove home their advantage - Thompson whipped in a corner from the right and the unmarked defender simply tapped the ball over the line from a couple of yards out. Celtic were utterly dominant by this stage and Bellamy opened his scoring account for the club after a fine move involving Aiden McGeady, Jackie McNamara and Maloney culminated in the Welshman hammering the ball into the net. Halliwell kept the deficit at five by pushing a McGeady shot wide as the game petered out.\n \n Halliwell, Mensing, Bollan, Balmer, Potter, Sheridan (Burns 61), Arbuckle (Gilhaney 61), Gibson, Bryson (Jones 78), Malone, Harty.\n \n Morrison, Wilson.\n \n Mensing, Sheridan.\n \n Douglas, Henchoz, McNamara, Balde, Varga, Juninho Paulista, Thompson, Lennon (Lambert 70), Sutton (Maloney 45), Petrov (McGeady 70), Bellamy.\n \n Marshall, Laursen.\n \n Thompson, Bellamy.\n \n : Varga 40, Thompson 48 pen, Petrov 60, Varga 68, Bellamy 72.\n \n 8,200\n \n C Thomson\n", "llama3.2:1b": ["Clyde 0-5 Celtic\n \nClyde's goal was scored in the first half through Bryn Halliwell saving Juninho's strike.", "Craig Bryson scored for Celtic after Stuart Petrov headed them into the lead.", "Juninho broke free from his defenders and rounded Halliwell to score another goal.", "Bellamy converted a penalty, followed by Varga scoring two goals with two minutes left in the first half.", "After the break, Clyde's goal was scored by Morrison but Celtic's three goals were sealed with Varga scoring his second after 40 minutes, Thompson scoring his first competitive goal after being replaced at halftime and Bellamy scoring on his debut after being replaced again at halftime."], "llama3.2:3b": ["Celtic defeated Clyde 5-0 in the Scottish Cup semi-final, with Stan Varga scoring twice and Craig Bellamy completing the rout.", "The game was marked by a tense first half, but Celtic dominated after the break, with goals from Alan Thompson, Stilian Petrov, Shaun Maloney, and Varga before Bellamy sealed the win."], "gemma2:2b": ["Celtic won the Scottish Cup semi-final against Clyde with a scoreline of 8-0 after an intense first half.", "Celtic scored through Varga (2), Thompson (penalty) and Bellamy.", "Clyde had a goal disallowed for a foul by Petrov, but then they also conceded two goals to their opponents before halftime.", "Celtic dominated the game, finishing with a scoreline that reflected their dominance."], "qwen2.5:0.5b": ["Celtic defeated Clyde in the Scottish Cup semi-final with a tight victory.", "In the first half, Celtic had an early lead due to Craig Bryson scoring a goal and Alan Thompson scoring from the penalty spot.", "Varga scored a second goal for Celtic after Shaun Maloney fouled him.", "Stilian Petrov scored a third for Celtic.", "Clyde dominated the second half and won the game with a 3-0 victory, aided by a penalty kick by Darren Sheridan.", "The match was watched by 8,200 people."], "qwen2.5:1.5b": ["Celtic routed Clyde 5-0 in the Scottish Cup semi-final.", "Craig Bryson's goal was disallowed, but Stan Varga scored three times and Alan Thompson converted a penalty for Celtic.", "Clyde's only score came from Darren Sheridan after halftime."], "qwen2.5:3b": ["Celtic defeated Clyde 5-0 in the Scottish Cup semi-final, securing their place.", "Craig Bryson's early goal was ruled out, followed by Stan Varga's first-half header and penalties from Alan Thompson after Shaun Maloney's foul.", "Celtic scored three more goals: Stilian Petrov's slide-in, Varga's second, and Craig Bellamy's drive in the second half.", "Clyde had an initial equalizer saved off a Bryson shot; however, Clyde's keeper Bryn Halliwell made several key saves throughout the match.", "Maloney scored from a penalty after being fouled by Shaun Maloney at halftime.", "Celtic continued to dominate until Bellamy opened his account with a goal involving Aiden McGeady and Jackie McNamara.", "The game ended 5-0 in favor of Celtic, with Clyde's goalkeeper Halliwell making several critical saves."], "opencoder:1.5b": ["Clyde 0-5 Celtic\n\nCeltic brushed aside Clyde to secure their place in the Scottish Cup semi-final, but only after a nervy and testing first half.", "The home side's Craig Bryson had a goal chopped off before Stan Varga headed Celtic into the lead.", "Alan Thompson scored from the penalty spot at the start of the second half after Shaun Maloney had been fouled.", "Stilian Petrov slid in a third, Varga tapped in his second and Craig Bellamy completed the rout with a fine drive.", "Bryn Halliwell was the busier keeper early on, saving from Bellamy, Chris Sutton and Juninho.", "Clyde had the ball in the net after half-an-hour through a tremendous strike from Bryson, but the referee had already blown for a foul by Petrov.", "From the resulting free kick, Darren Sheridan curled the ball round the Celtic wall only for the post to deny him.", "Back at the other end, Halliwell did well to come off his line and block Bellamy's effort to lift the ball over him.", "The keeper misjudged a corner that Stephane Henchoz headed wide, but a similar scenario five minutes before the break led to the opening goal.", "Maloney replaced the injured Sutton at half time and he marked his first competitive appearance after a year out injured by helping his side take a two-goal lead just after the break.", "The young striker fired a free kick straight into the Clyde wall but as he collected the rebound, he was tripped by Bryson and Thompson converted the penalty.", "Sheridan and Bellamy were involved in something of a flare-up that led to both being booked after the intervention of the assistant referee.", "Juninho brought out another good save from Halliwell and then Petrov saw a tremendous effort come off the top of the bar.", "But Petrov and Juninho combined brilliantly to allow the Bulgarian to make it 3-0 on the hour mark - a quick one-two giving him the time and space to steer the ball past Halliwell from 12 yards.", "Varga got his second goal of the game as Celtic drove home their advantage - Thompson whipped in a corner from the right and the unmarked defender simply tapped the ball over the line from a couple of yards out.", "Celtic were utterly dominant by this stage and Bellamy opened his scoring account for the club after a fine move involving Aiden McGeady, Jackie McNamara and Maloney culminated in the Welshman hammering the ball into the net.", "Halliwell kept the deficit at five by pushing a McGeady shot wide as the game petered out.", "Halliwell, Marcos, Bollan, Balmer, Potter, Sheridan (Burns 61), Arbuckle (Gilhaney 61), Gibson, Bryson (Jones 78), Malone, Harty.", "Morrison, Wilson.", "Douglas, Henchoz, McNamara, Balde, Varga, Juninho Paulista, Thompson, Lennon (Lambert 70), Sutton (Maloney 45), Petrov (McGeady 70), Bellamy.", "Marshall, Laursen.", "Thompson, Bellamy.", ": Varga 40, Thompson 48 pen, Petrov 60, Varga 68, Bellamy 72.", "8200\n\nC Thomson"], "smollm:1.7b": ["The summary is concise and to the point, capturing the main ideas of the text while omitting unnecessary details.", "The key points are:\n\n1.", "Clyde 0-5 Celtic won their first game in a semi-final against Celtic.", "2.", "Craig Bryson scored from the penalty spot after Stan Varga headed Celtic into the lead.", "3.", "Alan Thompson saved from Bellamy and Chris Sutton after a foul by Petrov.", "4.", "Stilian Petrov slid in a third, Varga tapped in his second and Craig Bryant completed the rout with a fine drive.", "5.", "Clyde had the ball in the net after half-an-hour through a tremendous strike from Bryson, but the referee had already blown for a foul by Petrov.", "6.", "From the other end, Halliwell did well to come off his line and block Bellamy's effort to lift the ball over him.", "7.", "Maloney replaced the injured Sutton at half time and he marked his first competitive appearance after a year out injured by helping his side take a two-goal lead just after the break.", "8.", "Juninho brought out another good save from Halliwell and then Petrov saw a tremendous effort come off the top of the bar.", "9.", "Varga got his second goal of the game as Celtic drove home their advantage - Thompson whipped in a corner from the right and the unmarked defender simply tapped the ball over the line from a couple of yards out.", "10.", "Halliwell kept the deficit at five by pushing a McGeady shot wide as the game petered out."], "deepseek-r1:1.5b": ["Celtic secured their Scottish Cup semi-final place despite a challenging first half.", "In the second half, Alan Thompson scored from the penalty spot at the start, Stilian Petrov scored twice, and Grant Bellamy finished the match with a fine drive to win 3-0 over their home team.", "Halliwell held the key position early on, saving multiple shots before scoring in the second half, which were tripped by Bryson and Thompson.", "The game ended with a goalcyckle featuring Connor Halliwell.", "The final scoreline was 3-0 in favor of Celtic."], "tinyllama:1.1b": ["Summary: Clydiad secured their place in the Scottish Cup semi-final with a 3-0 victory over CeltiC at home.", "The hosts had taken the lead through Craig Bryson's goal and had added two further strikes, both from substitute Alan Thompson.", "The game was played in intense conditions with CeltiC taking advantage of Clydiad's nervousness to score two quick goals in the first half before Stan Varga equalized in the second.", "The home side held on for a comfortable victory and progressed to the final round."], "tinydolphin:1.1b": [" The final score was: Clyde 1 - 5 Celtic."], "phi:2.7b": [" In the match between Clyde and Celtic, Celtic won with a final score of 4-1.", "Celtic's Alan Thompson scored two goals from penalties.", "Clyde had their best player, Darren Sheridan, but he was sent off before halftime.", "In the second half, Celtic came back strong and took a 2-0 lead.", "They scored again, with a goal from Craig Bellamy after Celtic was awarded a penalty due to a foul on Juninho.", "The game ended with a final score of 4-1 in favor of Celtic."], "orca-mini:3b": [" Celtic comfortably beat Clyde 5-1 in a Scottish Cup semi-final qualifier, securing their place with a nervy and testing first half.", "However, Craig Bryson had a goal controversially disallowed before Stan Varga headed Celtic into the lead.", "Alan Thompson scored from the penalty spot at the start of the second half after Shaun Maloney had been fouled.", "Stilian Petrov slid in a third, Varga tapped in his second and Craig Bellamy completed the rout with a fine drive.", "Bryn Halliwell was the busier keeper early on, saving from Bellamy, Chris Sutton and Juninho.", "Clyde's Bryson had a goal chopped off before Stiliyan Petrov scored a third for Celtic after the break.", "The young striker fired a free kick straight into the Clyde wall but as he collected the rebound, he was tripped by Bryson and Thompson converted the penalty.", "Sheridan and Bellamy were involved in something of a flare-up that led to both being booked after the intervention of the assistant referee."], "hermes3:3b": ["Celtic beat Clyde 5-0 in the Scottish Cup semi-final.", "Stan Varga and Craig Bellamy scored twice each, while Alan Thompson also found the net from a penalty."], "stablelm-zephyr:3b": ["Celtic secured their place in the Scottish Cup semi-final after a dominant 5-0 victory over Clyde, with Stan Varga netting a double.", "Alan Thompson scored from a penalty kick, while Stilian Petrov and Craig Bellamy also scored in the first half of the game.", "After the break, Maloney replaced injured Chris Sutton and helped his team take control of the match, leading to their eventual dominance.", "Clyde's Bryn Halliwell tried hard to save his team, but ultimately Celtic were too strong, with Varga scoring his second goal late in the game."], "chatgpt-4o-latest": ["Celtic secured a 5-0 victory over Clyde to reach the Scottish Cup semi-final, overcoming a challenging first half.", "Clyde's Craig Bryson had a goal disallowed before Stan Varga headed Celtic into the lead.", "Early in the second half, Alan Thompson converted a penalty after Shaun Maloney was fouled.", "Stilian Petrov added a third goal, followed by Varga's second, and Craig Bellamy completed the rout with a powerful strike.", "Clyde's Bryn Halliwell made several saves but was unable to prevent Celtic's dominance.", "Maloney, returning from injury, played a key role, while Petrov and Juninho combined effectively for the third goal.", "Celtic controlled the game in the latter stages, with Bellamy scoring his first goal for the club.", "Halliwell prevented further damage by saving a late Aiden McGeady effort as the match concluded."], "stablelm2:1.6b": ["Celtic defeated Clyde 5-0 in the Scottish Cup semi-final, with goals from Stan Varga (3), Alan Thompson (1), Stilian Petrov, and Craig Bellamy.", "Celtic was dominant throughout the game, with keeper Bryn Halliwell making several important saves.", "Clyde managed only one goal through a strike from Bryson after half an hour, but were unable..\n```python\nCeltic defeated Clyde 5-0 in the Scottish Cup semi-final, with goals from Stan Varga (3), Alan Thompson (1), Stilian Petrov, and Craig Bellamy.", "Varga got his second goal of the game as Celtic drove home their advantage.", "Clyde had only scored once before this point in the match.", "Halliwell kept the deficit at five by pushing a McGeady shot wide as the game petered out.", "Halliwell, Mensing, Bollan, Balmer, Potter, Sheridan (Burns 2, Gibson 1), Arbuckle (Gilhaney 2), Gibson, Bryson (Jones 2), Malone, Harty.", "(Morrison, Wilson).", "Mensing, Sheridan, Douglas, Henchoz, McNamara, Balde, Varga, Juninho Paulista, Thompson, Lennon (Lambert 2), Sutton (Maloney 2), Petrov (McGeady 2), Bellamy.", "Marshall, Laursen.", "(Thompson, Bellamy).", "Varga 2, Thompson 2 pen, Petrov 2, Varga 2, Bellamy 2.", "```"], "granite3.1-dense:2b": ["Celtic secured their spot in the Scottish Cup semi-final with a 5-0 victory over Clyde at Celtic Park.", "The match was intense and nerve-wracking during the first half, with Clyde's Craig Bryson missing a penalty early on.", "Celtic's goals came from Stan Varga (2), Alan Thompson (2), and Stilian Petrov, while Bryn Halliwell made several crucial saves for Clyde.", "The turning point was a quick corner conversion by Thompson after the substitution of injured Sutton, followed by a goal from Juninho's assist to Petrov.", "Varga added his second, and Bellamy scored with a well-executed team move.", "Despite Clyde's efforts, including a post-clearance shot by Halliwell and a blocked effort by Bellamy, Celtic dominated the game and ultimately secured their semi-final berth."]}