{"raw_text": "Kenyon denies Robben Barca return\n \n Chelsea chief executive Peter Kenyon has played down reports that Arjen Robben will return for the Champions League match against Barcelona.\n \n \"He's been responding well to treatment and started running on Friday, but we'll have to wait and see,\" he told BBC Five Live's Sportsweek. \"We're looking to getting him back as soon as possible, but he'll be back when it's right for him and for us. \"There's no plans at the moment around the Barcelona game.\" His comments contradict those of chiropractor Jean Pierre Meersseman who treated the Dutchman after he fractured his foot at the start of February. Robben had been expected to be out for six weeks, but Meersseman hinted that the winger could be fit for the vital Stamford Bridge game on 8 March. \"I hope he can be back and I will try to help him make that happen,\" Meersseman told the Mail on Sunday. \"I put everything right with Arjen's foot the last time I saw him 12 days ago. It was an obvious correction and easy to perform. \"I know he was pleased with what I did and now that he is running again. I am due to see him one more time again in the next few days.\" Meersseman is the medical co-ordinator at Italian side AC Milan.\n", "llama3.2:1b": ["Chelsea chief executive Peter Kenyon has denied reports that Arjen Robben will return for the Champions League match against Barcelona, citing treatment and rehabilitation progress but delaying his return until he is \"back when it's right for him and for us.\""], "llama3.2:3b": ["Chelsea chief executive Peter Kenyon has denied reports that Arjen Robben will return for the Champions League match against Barcelona, contradicting comments from Robben's chiropractor Jean Pierre Meersseman who suggested he could be fit in time for the game on March 8."], "gemma2:2b": ["Kenyon says Arjen Robben will not be playing in the Champions League match against Barcelona.", "Robben's chiropractor believes he could return, but Kenyon says there are no plans for his return yet."], "qwen2.5:0.5b": ["Chelsea chief executive Peter Kenyon has denied Robben Barca's return for a Champions League match against Barcelona.", "He expressed hope that the injury was fixed, but noted he will wait to see if it is good enough for him and his team.", "Kenyon does not provide details about when he expects Robben to be back."], "qwen2.5:1.5b": ["Chelsea denies Arjen Robben's return for Champions League match against Barcelona, stating he will be back only when right for both club and individual.", "Chiropractor Jean Pierre Meersseman supports Robben's fitness to play but expects recovery time of six weeks due to a January foot fracture."], "qwen2.5:3b": ["Peter Kenyon, Chelsea's executive, denies reports of Arjen Robben returning for the Champions League match against Barcelona, stating they are waiting until it’s right for Robben and Chelsea.", "This contradicts chiropractor Jean Pierre Meersseman who earlier suggested Robben might be fit in time for the game on 3 March.", "Meersseman had previously stated he corrected Robben's foot in February allowing for a quicker recovery."], "opencoder:1.5b": ["Kenyon denies Robben Barca return\n\nChelsea chief executive Peter Kenyon has played down reports that Arjen Robben will return for the Champions League match against Barcelona.", "He's been responding well to treatment and started running on Friday, but we'll have to wait and see.", "He told BBC Five Live's Sportsweek: \"We're looking to getting him back as soon as possible, but he'll be back when it's right for him and for us.\"", "There's no plans at moment around the Barcelona game.", "His comments contradict those of chiropractor Jean Pierre Meersseman who treated the Dutchman after he fractured his foot at the start of February.", "Robben had been expected to be out for six weeks, but Meersseman hinted that the winger could be fit for the vital Stamford Bridge game on 8 March.", "\"I hope he can be back and I will try to help him make that happen.\"", "Meersseman told the Mail on Sunday: \"I put everything right with Arjen's foot the last time I saw him 12 days ago.", "It was an obvious correction and easy to perform.\"", "Meersseman is the medical co-ordinator at Italian side AC Milan."], "smollm:1.7b": ["The summary should be: Chelsea chief executive Peter Kenyon has denied Robben will return for the Champions League match against Barcelona, and there are no plans to get him back as soon as possible.", "There have been reports that Arjen Robben is expected to be out for six weeks, but it's unclear if he can be fit for Stamford Bridge on 8 March.", "The summary should preserve key ideas and details: Chelsea chief executive Peter Kenyon has denied Robben will return for the Champions League match against Barcelona; there are no plans to get him back as soon as possible; there have been reports that Arjen Robben is expected to be out for six weeks, but it's unclear if he can be fit for Stamford Bridge on 8 March."], "deepseek-r1:1.5b": ["Kenyon has denied Robben's return to the Champions League match against Barcelona, stating that he is responding well but hasn't returned yet.", "On the other side, Meersseman treated Robben after his foot injury in February and expressed hope for him to be fit for the game on March 8th.", "He mentioned that he kept track of things and plans to see him again soon."], "tinyllama:1.1b": ["Kenyon denies Arjen Robben return for Champions League match against Barcelona"], "tinydolphin:1.1b": [" A report from Five Live suggests that Chelsea boss Peter Kenyon has played down reports that Arjen Robben will return for the Champions League match against Barcelona on 8 March.", "Speaking to BBC Five Live's Sportsweek, Kenyon insists he is still awaiting confirmation from Robben's coach and medical staff before making a final decision about his fitness for the crucial game.", "The 30-year-old Dutch winger has been out since February with a fractured foot but has begun running on Friday, despite earlier reports suggesting that he would not be ready to face Barca.", "Robben's injury could prove crucial for Chelsea if they are to progress in the competition and secure their first title in eight years, as the Netherlands international is a key playmaker for manager José Mourinho.", "The Blues have not yet commented on the situation but it appears Kenyon may wait until Robben is completely fit before making any official announcement."], "phi:2.7b": [" Chelsea CEO Peter Kenyon has stated that Arjen Robben will return when it's right for him, contradicting a report that he could be fit for a Champions League game against Barcelona.", "A chiropractor treated Robben after he fractured his foot in February and said he was pleased with the progress he had made.", "Robben is currently running but it is unclear if he will make it back to action before the Stamford Bridge match on March 8th."], "orca-mini:3b": [" Kenyon denies Robben Barca return"], "hermes3:3b": ["Kenyon dismisses Robben's potential return for Barcelona match."], "stablelm-zephyr:3b": ["Chelsea CEO Peter Kenyon dismissed reports of Arjen Robben returning for a Champions League match against Barcelona.", "Robben has been treating his fractured foot and running again, but will return when ready and suitable for the team.", "A chiropractor, Jean Pierre Meersseman, previously treated Robben's foot and hoped he would be fit for the Stamford Bridge game on March 8th."], "chatgpt-4o-latest": ["Chelsea chief executive Peter Kenyon downplayed reports that Arjen Robben would return for the Champions League match against Barcelona, stating there were no current plans for his comeback.", "While Robben has responded well to treatment and resumed running, Kenyon emphasized that his return would depend on the right timing.", "His statement contradicts chiropractor Jean Pierre Meersseman, who suggested Robben could be fit for the crucial match on 8 March.", "Meersseman, who previously treated Robben’s foot injury, expressed optimism about his recovery and planned to see him again soon."], "stablelm2:1.6b": ["Kenyon denies reports of Robben's return for Champions League match, as Arjen Robben continues to recover from foot fracture treatment; Peter Kenyon plans a speedy return but considers Robben's readiness and benefit for both him and team.", "This information contradicts the predictions made by chiropractor Jean Pierre Meersseman who treated Robben after an earlier injury."], "granite3.1-dense:2b": ["Kenyon, Chelsea's chief executive, has dismissed rumors that Arjen Robben will play in the upcoming Champions League match against Barcelona on March 8.", "Kenyon stated Robben is progressing well from a foot fracture and could return to training soon, but there are no immediate plans for him.", "This contradicts chiropractor Jean Pierre Meersseman's optimistic predictions, who treated Robben after the injury in February.", "Meersseman, medical co-ordinator at AC Milan, initially hoped Robben would be fit within six weeks but now believes he might return sooner."]}