{"raw_text": "Wright-Phillips to start on right\n \n England coach Sven-Goran Eriksson has revealed Shaun Wright-Phillips will start against the Netherlands.\n \n But Wright-Phillips will not make his first start for England playing on the left, as had been widely expected. \"Shaun Wright-Phillips will probably start the game,\" said Eriksson. \"But I'm not going to start Wright-Phillips on the left.\" Eriksson also revealed that Wes Brown will start alongside Jamie Carragher in the injury-hit centre of defence. When asked if Brown and Carragher would start Eriksson replied: \"I could tell you yes. \"It's a blow that four or five central defenders are away because of injuries. \"On the other hand it's good for Carragher and Brown to show what they can do at this level. That's positive.\" The England coach said that he had been impressed by Wright-Phillips' form for Manchester City. \"He deserves his chance. He has been playing well all season and I look forward to seeing him.\" And he added that Andy Johnson and Stewart Downing - the other two new players in the squad - would also get a chance to impress. \"Wright-Phillips, Downing and Johnson will start or get the chance to play some part. \"Johnson was not in my plans a year ago but he is doing a great season and scoring a lot of goals. \"Downing is another one making a great season. He is young, talented and there are not too many left-footed players in the squad.\"\n", "llama3.2:1b": ["Shaun Wright-Phillips will start against Netherlands on the right side, despite not being expected to play on the left where he usually starts for England.", "Wes Brown and Jamie Carragher will form a centre-back pairing alongside each other.", "Wright-Phillips is impressed by his Manchester City performance this season and has been called up to the national team as well, while Andy Johnson and Stewart Downing also get chances to impress in their first games."], "llama3.2:3b": ["Shaun Wright-Phillips will start for England against the Netherlands, with Wes Brown and Jamie Carragher likely to pair at centre-back.", "Wright-Phillips will not play on the left as expected, but has been playing well all season.", "Andy Johnson and Stewart Downing are also set to get a chance to impress in their first starts."], "gemma2:2b": ["Shaun Wright-Phillips will start the game against the Netherlands.", "Wes Brown will play alongside Jamie Carragher in central defense.", "Andy Johnson and Stewart Downing will also get playing time."], "qwen2.5:0.5b": ["England coach Sven-Goran Eriksson revealed that Shaun Wright-Phillips will start against the Netherlands instead of Andy Johnson and Stewart Downing, who were injured last year.", "However, Wright-Phillips remains on the left side of the lineup due to expected injuries and expectations for his form in Manchester City."], "qwen2.5:1.5b": ["England coach Eriksson says Wright-Phillips will start against Netherlands on right wing but won't play as expected on left, replacing Wes Brown in center defense with Jamie Carragher alongside.", "Eriksson praises Wright-Phillips' form and highlights Johnson's and Downing's potential for the team."], "qwen2.5:3b": ["England coach Sven-Goran Eriksson has revealed that Shaun Wright-Phillips will start against the Netherlands on the right wing, contrary to expectations.", "Eriksson also mentioned that Wes Brown and Jamie Carragher would play alongside each other as a central defender pair.", "The coach highlighted the positive aspect of four or five central defenders being unavailable due to injuries for showing potential at this level.", "Eriksson praised Wright-Phillips' form with Manchester City, stating he is deserving of his chance.", "Additionally, Eriksson mentioned that Andy Johnson and Stewart Downing would also get chances to impress despite not being initially in his plans."], "opencoder:1.5b": ["Wright-Phillips to start on right\n\nEngland coach Sven-Goran Eriksson has revealed Shaun Wright-Phillips will start against the Netherlands.", "Eriksson also revealed that Wes Brown will start alongside Jamie Carragher in the injury-hit centre of defence.", "When asked if Brown and Carragher would start, Eriksson replied: \"I could tell you yes.\"", "The England coach was impressed by Wright-Phillips' form for Manchester City.", "He had been playing well all season and look forward to seeing him.", "And he added that Andy Johnson and Stewart Downing - the other two new players in the squad - would also get a chance to impress."], "smollm:1.7b": ["The summary above should preserve key ideas and details from the original text:\n\n1.", "Wright-Phillips will start on the right side of the field against the Netherlands.", "2.", "Wright-Phillips will not make his first start for England playing on the left, as had been widely expected.", "3.", "Sven-Goran Eriksson has revealed that Wright-Phillips will probably start the game.", "4.", "Wes Brown and Jamie Carragher will start alongside Wright-Phillips in the injury-hit centre of defence.", "5.", "Wright-Phillips will not make his first start for England playing on the left, as had been widely expected.", "6.", "Wright-Phillips will probably start the game.", "7.", "Eriksson has been impressed by Wright-Phillips' form for Manchester City.", "8.", "Wright-Phillips deserves his chance to impress.", "9.", "Wright-Phillips is playing well all season and I look forward to seeing him.", "10.", "Andy Johnson and Stewart Downing will also get a chance to impress.", "The summary should preserve the key ideas and details from the original text, while omitting any unnecessary information or explanations."], "deepseek-r1:1.5b": ["Shaun Wright-Phillips will start against the Netherlands but not on the left side.", "Wes Brown and Jamie Carragher are starting together despite injuries.", "The coach is impressed by his form for Manchester City, though he expects to see him again with Wes starting where expected.", "He also mentions Andy Johnson and Stewart Downing as likely starting spots due to their performance."], "tinyllama:1.1b": ["England coach Sven-Goran Eriksson has revealed that Shaun Wright-Phiillips will start against the Netherlands after playing on the left.", "However, he plans to start right-back Wes Brown and defensive midfielder Jamie Carragher at the same time.", "Eriksson was impressed by Wright-Phiillips' performance for Manchester City, and stated that Downing and Johnson will also get a chance to impress.", "The squad includes four new players who will receive opportunities to showcase their talent in England's upcoming matches."], "tinydolphin:1.1b": [" The summary: England coach Sven-Goran Eriksson confirmed that Shaun Wright-Phillips will start against the Netherlands with an expectation of playing on the right wing.", "However, he noted that Wright-Phillips would not make his first start for England playing on the left.", "Brown and Carragher are set to start alongside each other in the defense unit.", "England has been depleted due to injury, but manager Eriksson sees positive aspects in new players Andy Johnson and Stewart Downing."], "phi:2.7b": [" The England coach Sven-Goran Eriksson has revealed that Shaun Wright-Phillips will start against the Netherlands, but not on the left side of defence as expected.", "Wes Brown and Jamie Carragher will start alongside him in the centre of the field due to injuries.", "The coach also praised Johnson's performance and Downing's talents."], "orca-mini:3b": [" England coach Sven-Goran Eriksson revealed that Shaun Wright-Phillips will start against the Netherlands, but he won't make his first start for England playing on the left, as had been widely expected.", "Wes Brown and Jamie Carragher will start in the injury-hit center of defense.", "Eriksson said that he was impressed by Wright-Phillips' form for Manchester City and that Andy Johnson and Stewart Downing will also get a chance to impress."], "hermes3:3b": ["Shaun Wright-Phillips to start for England against Netherlands.", "Eriksson says Wright-Phillips will not start on left, Wes Brown to play alongside Jamie Carragher in center of defense."], "stablelm-zephyr:3b": ["England coach Sven-Goran Eriksson has announced that Shaun Wright-Phillips will make his debut for England but will not play on the left as initially speculated.", "Instead, he will start alongside Jamie Carragher in defense.", "Eriksson also mentioned that Andy Johnson and Stewart Downing, two new players in the squad, will also get a chance to play.", "He praised Wright-Phillips' performance with Manchester City and highlighted the positive impact of giving playing opportunities to younger, talented players due to injuries affecting the central defenders."], "chatgpt-4o-latest": ["England coach Sven-Goran Eriksson confirmed that Shaun Wright-Phillips will start against the Netherlands but on the right, not the left as expected.", "Wes Brown will start alongside Jamie Carragher in central defense due to injuries.", "Eriksson praised Wright-Phillips' form for Manchester City and said he deserves his chance.", "He also stated that Andy Johnson and Stewart Downing would get opportunities to play, highlighting their strong seasons and contributions."], "stablelm2:1.6b": ["England coach Sven-Goran Eriksson will start Shaun Wright-Phillips against the Netherlands, but he won..", "The summary of this text is: England football coach Sven-Goran Eriksson will begin Shaun Wright-Phillisp with Manchester City against the Netherlands due to his impressive form.", "Additionally, Wes Brown and Jamie Carragher will join Wright-Phillisp in the center of defense despite the injury setback of four central defenders.", "Eriksson mentioned he has been impressed by Wright-Phillips' performance and Andy Johnson and Stewart Downing are also expected to earn their chance to play or start the game."], "granite3.1-dense:2b": ["England coach Sven-Goran Eriksson has announced that Shaun Wright-Phillips will likely start in the upcoming match against the Netherlands.", "However, Wright-Phillips won't play on the left flank as anticipated; instead, he'll be stationed centrally.", "Eriksson praised Wright-Phillips' strong form for Manchester City, expressing confidence in his ability to perform at this level.", "Additionally, England's newcomers Andy Johnson and Stewart Downing will feature or have opportunities to contribute.", "The injury-prone central defense pairing of Wes Brown and Jamie Carragher will start, providing a chance for both players to demonstrate their capabilities despite the absences due to injuries."]}