{"raw_text": "Premier League planning Cole date\n \n The Premier League is attempting to find a mutually convenient date to investigate allegations Chelsea made an illegal approach for Ashley Cole.\n \n Both Chelsea and Arsenal will be asked to give evidence to a Premier League commission, but no deadline has been put on when that meeting will convene. \"It's hard to put a date on it,\" a Premier League spokesman confirmed to BBC Sport. \"It's not a formal situation where they've got so much time to respond.\" Arsenal and England defender Cole reportedly met Blues boss Jose Mourinho and chief executive Peter Kenyon in a London hotel 11 days ago. Chelsea have yet to officially confirm or deny the meeting, which would be in breach of Premier League rule K3.\n \n Now the Gunners have asked for an inquiry to look into claims that their player has been \"tapped up\". Both clubs have pledged to co-operate with the inquiry which will be conducted on a single day as opposed to being run as an ongoing evaluation. Cole is in negotiations with the Gunners over extending his current deal which ends in 2007. And his Arsenal team-mate Robert Pires has urged the England left-back to stay at Highbury. Pires told the Evening Standard: \"He has been at Arsenal for ever. He is a very attacking left-back and I think he is enjoying his football because at Arsenal he plays in an offensive team. \"I am not sure he will get the same pleasure at Chelsea, even though they are doing so well at the moment. \"I have built a fantastic playing relationship with Ashley. \"We play together so well - we could do it with our eyes shut. \"But you have to respect the decision of the player. Everybody has that right.\"\n", "llama3.2:1b": ["Premier League is investigating allegations that Chelsea made an illegal approach for Ashley Cole, who will be called to give evidence.", "Chelsea and Arsenal are being asked to cooperate with the investigation, but no deadline has been set.", "Cole met with Mourinho and Kenyon at a London hotel 11 days ago.", "Arsenal and England team-mate Robert Pires have urged Cole to stay at Highbury despite Chelsea's recent success."], "llama3.2:3b": ["The Premier League is investigating allegations Chelsea made an illegal approach for Ashley Cole, who met Blues boss Jose Mourinho and chief executive Peter Kenyon in a hotel 11 days ago.", "Arsenal will provide evidence, and both clubs have pledged cooperation with a single-day inquiry into the claims of \"tapping up\"."], "gemma2:2b": ["The Premier League is attempting to schedule a meeting with Chelsea and Arsenal to investigate allegations regarding Ashley Cole's potential move from Arsenal to Chelsea.", "An inquiry will be conducted on a single day, where both clubs are expected to provide evidence.", "The investigation comes after claims of an illegal approach by Chelsea for Cole.", "Arsenal defender Robert Pires urged Cole to stay with the club.", "Both clubs have pledged to co-operate with the inquiry, but no formal deadline has been set for the meeting."], "qwen2.5:0.5b": ["The Premier League is investigating allegations that Chelsea's Ashley Cole was approached by someone from an illegal background, but details are not fixed and a date cannot be determined due to time constraints.", "Arsenal confirmed a meeting with Mourinho and Kenyon, but they have yet to confirm or deny the claims.", "Both clubs pledged to conduct an inquiry on a single day as opposed to being conducted as an ongoing evaluation.", "Cole has been negotiating for his extension at Arsenal while his contract at Chelsea is nearing its end."], "qwen2.5:1.5b": ["Premier League investigating allegations Chelsea made an illegal approach for Ashley Cole, both clubs pledge cooperation on a single day, Cole and Pires express mixed views on potential move to Chelsea, Arsenal team-mate urges Cole to stay at Highbury."], "qwen2.5:3b": ["Premier League attempts to find a date for an investigation into allegations Chelsea made an illegal approach for Ashley Cole, who met with Mourinho and Kenyon 11 days ago.", "Both clubs are asked to cooperate in a single-day inquiry, running as a formal evaluation process.", "Cole is negotiating a new deal at Arsenal, which he may extend beyond 2007.", "His teammate Robert Pires urges him to stay at Highbury, highlighting his enjoyment of playing there and the offensive team dynamic.", "No official date has been set for the commission's meeting."], "opencoder:1.5b": ["The Premier League is planning to find an appropriate date to investigate alleged illegal behaviour by a player.", "The player, Ashely Cole, is involved in a meeting between Chelsea and Arsenal where they are seeking evidence from the Premier League commission.", "Cole reportedly met with Jose Mourinho's boss and former England central executive Peter Kenyon in a London hotel on 11 days ago.", "Both clubs have yet to formally confirm or deny the meeting, which would breach the rules of the Premier League K3.", "England defender Cole, who is facing intenseNegotiations over his current deal with the Gunners, has urged Arsenal and England left-back Robert Pires to stay at Highbury on a single day.", "Pires, who is an attacking midfielder, expressed satisfaction when they took part in the meeting, indicating a positive relationship with the player.", "However, concerns around the possibility of future conflicts continue.", "As a result, the club's efforts have been limited and there has been no formal agreement to meet again."], "smollm:1.7b": ["The Premier League is attempting to find a mutually convenient date to investigate allegations Chelsea made an illegal approach for Arsenal.", "Both clubs will be asked to give evidence to a Premier League commission, but no deadline has been put on when that meeting will convene.", "\"It's hard to put a date on it,\" a Premier League spokesman confirmed to BBC Sport.", "\"It's not a formal situation where they've got so much time to respond.\"", "Arsenal and England defender Cole reportedly met Blues boss Jose Mourinho and chief executive Peter Kenyon in a London hotel 11 days ago.", "Chelsea have yet to officially confirm or deny the meeting, which would be in breach of Premier League rule K3.", "The Gunners have asked for an inquiry to look into claims that their player has been \"tapped up\".", "Both clubs have pledged to co-operate with the inquiry which will be conducted on a single day as opposed to being run as an ongoing evaluation.", "Cole is in negotiations with the Gunners over extending his current deal which ends in 2007.", "And his Arsenal team-mate Robert Pires has urged the England left-back to stay at Highbury.", "Pires told the Evening Standard: \"He has been at Arsenal for ever.", "He is a very attacking left-back and I think he is enjoying his football because at Arsenal he plays in an offensive team.", "\"I am not sure he will get the same pleasure at Chelsea, even though they are doing so well at the moment.", "\"I have built a fantastic playing relationship with Ashley.", "\"We play together so well - we could do it with our eyes shut.", "\"But you have to respect the decision of the player.", "Everybody has that right.\""], "deepseek-r1:1.5b": ["The Premier League is investigating allegations against Chelsea about player Ashley Cole, planning an event for them to meet at a commission.", "Arsenal and Chelsea will present evidence, but no deadline has been set.", "Currently, the meeting between Cole and Mourinho occurred 11 days ago in London.", "Chelsea hasn't confirmed or denied it, while they've agreed to co-operate with an inquiry into claims of \"tapping up.\"", "Chelsea is in negotiations for a contract extension ending next year, and Robert Pires from Arsenal has requested his inclusion at Highbury despite being in good form there."], "tinyllama:1.1b": ["The Premier League is attempting to find a mutually convenient date for an investigation into allegations that Ashley Cole made an illicit approach for Blues defender Chelsa, but there are no concrete deadlines set as of yet.", "The Premier League's commission has been approached with a proposal to have Arsenal and England defender Cole meet Blues boss Jose Moulinho and chief executive Peter Kenyon in London on January 11, which would violate the rule K3 that prevents Premier League clubs from discussing specific players with other teams.", "Meanwhile, Gunner's chairman Martin Keane has pleaded for the inquiry to be conducted as a single day rather than running as an ongoing evaluation, and English left-back Robert Piré is urging Cole to stay at Highbury despite his current contract expiring in 2007.", "Arsenal and Chelsa are negotiating extending Cole's contract."], "tinydolphin:1.1b": [" A leading British newspaper, the Daily Mail, reports that Premier League authorities are currently considering whether to hold a meeting to investigate allegations made by Chelsea against Ashley Cole.", "The investigation is being led by Premier League chairman Richard Scudamore and chief executive Peter Kenyon, but no specific deadline has been set for when this investigation will take place.", "Both Chelsea and Arsenal are involved in the matter, with the Blues pledging to cooperate with any inquiry into the claims made by Cole regarding a potential approach from the Gunners.", "Chelsea defender Ashley Cole has reportedly met Blues boss Jose Mourinho and chief executive Peter Kenyon in London, but there has been no official confirmation or denial of the meeting between these two parties.", "Meanwhile, Arsenal and England left-back Robert Pires is urging his teammate to remain at Highbury until a decision is made on his future, as both clubs are considering whether to extend Cole's current deal."], "phi:2.7b": [" The Premier League is investigating claims made by Chelsea regarding an alleged illegal approach for Ashley Cole.", "Both teams will be asked to give evidence to a commission, but there is no set date for when it will convene.", "Chelsea and Arsenal's CEO reportedly met at a London hotel 11 days ago, which would be in breach of Premier League rule K3.", "Arsenal has asked for an inquiry, which will be conducted on a single day, while Cole is negotiating with the Gunners over extending his deal.", "Cole's team-mate Robert Pires believes Cole should stay at Arsenal and respects his decision to leave or not."], "orca-mini:3b": [" The Premier League is trying to find a date to investigate allegations made against Chelsea and Ashley Cole.", "Both Chelsea and Arsenal will be asked to give evidence but no deadline has been set for the meeting.", "It is unclear if the meeting will be ongoing or single-day.", "Cole's contract with Arsenal is up in 2007 and he is in negotiations with the club.", "Robert Pires, who is also an Arsenal player, has urged Cole to stay at Highbury."], "hermes3:3b": ["Premier League tries to find date for investigating Chelsea's alleged illegal approach for Ashley Cole."], "stablelm-zephyr:3b": ["The Premier League is seeking a convenient date to investigate allegations that Chelsea made an illegal approach for Arsenal defender Ashley Cole.", "Both Chelsea and Arsenal will provide evidence, but no specific timeline has been set.", "The inquiry will look into claims that Cole was \"tapped up\" by Chelsea and will be conducted on a single day.", "Arsenal teammate Robert Pires supports Cole's decision to stay at Highbury, stating that he enjoys playing in an offensive team at Arsenal."], "chatgpt-4o-latest": ["The Premier League is working to schedule a meeting to investigate Chelsea's alleged illegal approach for Arsenal defender Ashley Cole.", "Both clubs will provide evidence, but no deadline has been set.", "Reports suggest Cole met Chelsea manager Jose Mourinho and chief executive Peter Kenyon, which would breach Premier League rules.", "Arsenal has requested an inquiry, and both clubs have agreed to cooperate.", "The investigation will be conducted in a single session.", "Meanwhile, Cole is negotiating a contract extension with Arsenal, and teammate Robert Pires has urged him to stay, emphasizing their strong playing relationship."], "stablelm2:1.6b": ["The Premier League is planning an investigation into allegations made by Chelsea about Arsenal's Ashely Cole engaging in an illegal approach for his services.", "The meeting will be conducted by a single day inquiry, with no set deadline for its convening.", "Both clubs have pledged to cooperate with the inquiry and maintain that Cole has been \"tapped up.\"", "Cole is in negotiations to extend his current deal ending in 2017, which teammate Robert Pires supports."], "granite3.1-dense:2b": ["The Premier League is planning to convene a single-day inquiry into Chelsea's alleged illegal approach for Arsenal defender Ashley Cole, following a reported meeting between Chelsea officials and Cole 11 days ago.", "Both clubs have committed to cooperate with the investigation, which aims to address Cole's \"tapping-up\" by Chelsea.", "Cole is currently in negotiations for an extension of his Arsenal contract, set to expire in 2007.", "Arsenal teammate Robert Pires has urged Cole to remain with the club, emphasizing their strong on-field chemistry and suggesting that playing at Chelsea might not offer the same joy due to potential changes in tactics or the player's style of play."]}