{"raw_text": "Weir poised for Sunderland move\n \n Larne's teenage star Robbie Weir is poised to join Sunderland after turning down a move to Stoke City.\n \n The 17-year-old Irish League midfielder was also being chased by Rangers and Fulham, but Mick McCarthy's side appear to have won the race. But Larne boss Jimmy McGeough has yet to confirm that Weir is on his way from Inver Park. \"I heard on Sunday that he has joined Sunderland, but not from the lad himself,\" he said. ''Robbie has an agreement with Larne that he can negotiate with interested clubs.\n \n ''Personally, I would rather see him making an impact at local level to build up his physique before moving into the full-time game. ''He has been on trial with a number of clubs. But it would be great to see him making it at Sunderland.''\n", "llama3.2:1b": ["Robbie Weir is poised to join Sunderland after turning down a move to Stoke City, with Larne boss Jimmy McGeough still undecided about the move."], "llama3.2:3b": ["Robbie Weir is poised to join Sunderland after turning down a move to Stoke City, following trials with Rangers and Fulham."], "gemma2:2b": ["Robbie Weir is poised to join Sunderland after turning down a move to Stoke City.", "Larne boss Jimmy McGeough confirmed that Weir can negotiate with interested clubs, and he hopes for his development in the local league before moving into full-time football.", "Sunderland appears to have won the race for Weir's services."], "qwen2.5:0.5b": ["Robbie Weir is poised for a move from Inver Park to Sunderland after Rangers and Fulham expressed interest in him, but his future remains uncertain at this time.", "He currently plays for Larne, which he joined on Sunday, but has not yet been confirmed as part of the deal.", "His agent believes that he can negotiate with other clubs before making his move."], "qwen2.5:1.5b": ["Robbie Weir, 17, from Larne, Northern Ireland, is set to join Sunderland after being turned down by Stoke City and Rangers/Fulham.", "His agreement with Larne allows him to negotiate with other clubs.", "The move would be beneficial for both Sunderland and Robbie's local development."], "qwen2.5:3b": ["Robbie Weir, 17, an Irish League midfielder, is set to join Sunderland after previously being linked with Stoke City and Rangers.", "Larne's Jimmy McGeough hasn't officially confirmed the move but hears it's finalized.", "Despite interest from other clubs, Weir has an agreement allowing him to negotiate with others.", "McGeough prefers Weir to develop at Larne first before entering the professional game.", "He supports a Sunderland move for Weir."], "opencoder:1.5b": ["\"Weir is set to move for a new team in Sunderland after a move against Stoke City.", "Larne, having played for both Fulham and Rangers, has agreed to join Sunderland as an midfielder.", "He's also been chased by the side, and McCrea’s team have confirmed that Weir is on the move from Inver Park.", "\"Weir will discuss his plans with Larne in person this Sunday.", "He's agreed to negotiate with interested clubs and potentially make an impact at a local level before starting the game there.", "His move has been under intense scrutiny by club players, but he seems to be keen to showcase his skills and build up physique."], "smollm:1.7b": ["Weir is poised for Sunderland move, and Larne's teenage star Robbie Weir appears to have won the race after being chased by Rangers and Fulham.", "Mick McCarthy's side appear to have won the race, but there are no details yet on whether Weir will join them or not.", "It would be great if he could make an impact at local level before moving into the full-time game."], "deepseek-r1:1.5b": ["Robbie Weir is set to join Sunderland after declining a move to Stoke City.", "Larne's teenage star was also considered by Rangers and Fulham but has yet to confirm an offer from Inver Park.", "Jimmy McGeough of Larne remains undecided, stating that Robbie has agreed to the deal with interested clubs.", "He prefers Robbie's impact at the local level before moving into the full-time game."], "tinyllama:1.1b": ["Weir made a decision to join Stoke City, and Mickey McCartney's side reportedly offered Robbie WeiR the chance to play in their first-team setup, despite interest from several other clubs.", "Larne midfielder WeiR is expected to sign for the Scottish Premier League outfit after rejecting offers from Stoke City, Fulham, and others.", "Despite not confirming that his move was finalized until later in the week, McCartney expressed confidence in his ability to make an impact at the club's level before pursuing further opportunities abroad."], "tinydolphin:1.1b": [" Based on the provided text, the summary should describe the following key ideas:\n1.", "Larne's teenage star Robbie Weir is poised to join Sunderland after turning down a move to Stoke City and Rangers.", "2.", "The 17-year-old Irish League midfielder was also being chased by Rangers and Fulham, but McCarthy's side appear to have won the race.", "3.", "Jimmy McGeough has yet to confirm whether Robbie Weir is on his way from Inver Park.", "4.", "The player has an agreement with Larne that he can negotiate with interested clubs."], "phi:2.7b": [" Robbie Weir is considering joining Sunderland after turning down offers from Stoke City, Rangers, and Fulham.", "Larne's manager Jimmy McGeough confirmed that they were interested in signing him, but Weir has yet to confirm the move.", "The assistant notes that Weir will need time to build up his physique before playing at a full-time level."], "orca-mini:3b": [" Robbie Weir, a 17-year-old Irish League midfielder, is poised to join Sunderland after turning down a move to Stoke City.", "Larne's manager, Jimmy McGeough, confirmed the transfer but did not confirm if it was to Sunderland."], "hermes3:3b": ["Robbie Weir, 17, set to join Sunderland, turning down Stoke City move; also considered by Rangers and Fulham."], "stablelm-zephyr:3b": ["Robbie Weir, a 17-year-old midfielder from Larne, is expected to join Sunderland after turning down moves to Stoke City and being pursued by Rangers and Fulham.", "Although the confirmation from Larne's boss Jimmy McGeough hasn't been made, he expressed his preference for Weir to build up his skills at the local level first before moving into the full-time game."], "chatgpt-4o-latest": ["Robbie Weir, a 17-year-old Larne midfielder, is set to join Sunderland after rejecting a move to Stoke City.", "He was also pursued by Rangers and Fulham, but Sunderland appears to have secured his signing.", "However, Larne manager Jimmy McGeough has not received direct confirmation from Weir.", "McGeough noted that Weir has an agreement allowing him to negotiate with clubs but expressed a preference for him to develop locally before moving into full-time football.", "He acknowledged Weir's trials with multiple clubs and hopes he succeeds at Sunderland."], "stablelm2:1.6b": ["1-year-old Robbie Weir is set to join Sunderland after turning down offers from Stoke City, Rangers, and Fulham.", "Irish League midfielder was also pursued by Larne but manager Jimmy McGeough hasn  confirm his departure.", "Mick McCarthy's side appears to have won the race, though Larne boss has yet to officially announce Weir's move."], "granite3.1-dense:2b": ["Larne's 17-year-old star, Robbie Weir, is reportedly close to joining Sunderland following his rejection of an offer from Stoke City.", "Rangers and Fulham had also shown interest, but it appears Sunderland will secure his services.", "Larne manager Jimmy McGeough has not officially confirmed the transfer, stating that Weir still has an agreement with the club for negotiations.", "McGeough expressed preference for Weir to gain experience at local level before transitioning into professional football."]}