{"raw_text": "Highbury tunnel players in clear\n \n The Football Association has said it will not be bringing charges over the tunnel incident prior to the Arsenal and Manchester United game.\n \n Arsenal's Patrick Vieira had earlier denied accusations that he threatened Gary Neville before the 4-2 defeat. Vieira also clashed with opposing skipper Roy Keane and referee Graham Poll had to separate them. \"The referee has confirmed that he is satisfied he dealt with the incident at the time,\" said an FA statement. It means United's win will pass off without further intervention from the governing body, whose new chief executive Brian Barwick was in the Highbury stands.\n \n \"I didn't threaten anybody. They are big enough players to handle themselves,\" said Vieira. \"I had a talk with Roy Keane and that's it. Gary Neville is a big lad, he can handle himself. \"They just played better than us and deserved to win.\" Neville admitted there had been incidents before the game, but insisted it had not distracted his focus. \"There were a couple of things that did happen before the game which disappoint you,\" he said. \"Especially from players of that calibre, but it's a tough game and we've been around a long time.\" Neville admitted that he had not enjoyed the match, which was punctuated by fouls and the sending off of Mikael Silvestre for head-butting Freddie Ljungberg . \"I thought it was a horrible game in the first half, and it was not much better in the second,\" he said. \"There is no way that should have happened in a football match.\"\n \n After the match, Keane accused Vieira of starting the row. \"Patrick Vieira is 6ft 4in and having a go at Gary Neville. So I said, 'have a go at me',\" he said. \"If he wants to intimidate our players and thinks that Gary Neville is an easy target, I'm not having it.\" Manchester United manager Sir Alex Ferguson added: \"Vieira was well wound up for it. \"I've heard different stories. Patrick Vieira has apparently threatened some of our players and things like that.\"\n", "llama3.2:1b": ["The Football Association has stated it will not be bringing charges over the tunnel incident involving Arsenal players Patrick Vieira, Gary Neville, Roy Keane, and referee Graham Poll prior to the match against Manchester United.", "Patrick Vieira denied accusations that he threatened Gary Neville before the game.", "Vieira said he had a conversation with Keane about the incident but there was no further action taken.", "Roy Keane also admitted to being upset by the game, saying it was \"a horrible game in the first half and not much better\" in the second.", "Gary Neville admitted that the match was disappointing due to fouls and a head-butt foul on Freddie Ljungberg."], "llama3.2:3b": ["The Football Association will not bring charges over the tunnel incident before the Arsenal and Manchester United game, with referee Graham Poll satisfied he dealt with the incident at the time.", "Arsenal's Patrick Vieira denied threatening Gary Neville and claimed a pre-game talk with Roy Keane was all that happened.", "Neville said the incidents did not distract his focus, while Keane accused Vieira of starting the row.", "Sir Alex Ferguson also described Vieira as \"well wound up\" before the game."], "gemma2:2b": ["The FA will not charge Arsenal's Patrick Vieira over a tunnel incident with Manchester United's Gary Neville before their game.", "Vieira denies threatening Neville, while Neville admits some pre-game incidents happened, but he doesn't believe they affected his focus.", "The match was marked by fouls and a sending off for Silvestre after headbutting Ljungberg.", "Keane accuses Vieira of starting the row with Neville, and Ferguson claims Vieira is \"well wound up.\""], "qwen2.5:0.5b": ["The FA will not bring charges over the Highbury tunnel incident, as Arsenal's Patrick Vieira denied threats against Gary Neville and had a talk with Roy Keane.", "The match was punctuated by fouls and sending off for head-butting Freddie Ljungberg.", "Manchester United manager Sir Alex Ferguson said Vieira was well-worn up, while Sir Alex Ferguson added that Patrick Vieira has apparently threatened some of their players."], "qwen2.5:1.5b": ["The FA will not pursue charges after the incident involving Arsenal's Patrick Vieira during the match against Manchester United, as reported by Football Focus.", "Vieira denies threatening Neville but admits to a brief altercation with Keane; Ferguson claims Vieira may have been overreacting.", "The game was marred by fouls and violent clashes, including sending off Silvestre for headbutting Ljungberg in the first half."], "qwen2.5:3b": ["The Football Association will not bring charges over the tunnel incident before Arsenal vs Manchester United, where Arsenal's Patrick Vieira denied threatening Gary Neville.", "Vieira had a physical altercation with Roy Keane which referee Graham Poll managed.", "Arsenal lost 4-2 to Manchester United, who won without further FA intervention.", "Post-match, Gary Neville expressed dissatisfaction with fouls and player behavior, while Keane accused Vieira of starting the row.", "Despite incidents before the game, Ferguson claimed Vieira was agitated."], "opencoder:1.5b": ["The Football Association has said it will not bring charges over the tunnel incident prior to the Arsenal and Manchester United game.", "Arsenal's Patrick Vieira had earlier denied accusations that he threatened Gary Neville before the 4-2 defeat.", "However, the referee confirmed that he dealt with the incident at the time, which is clear enough from the statement.", "It means United's win will pass off without further intervention from the governing body.", "Vieira said they didn't threaten anybody.", "They are big enough players to handle themselves.", "He had a talk with Roy Keane and that's it.", "Gary Neville is a big lad, he can handle himself.", "They just played better than us and deserved to win.", "Neville admitted there had been incidents before the game, but insisted it had not distracted his focus.", "He said: \"There were a couple of things that did happen before the game which disappoint you,\" he said.", "Especially from players of that caliber, but it's a tough game and we've been around a long time.", "He had a talk with Roy Keane and that's it.", "It was not much better in the second half.", "After the match, Keane accused Vieira of starting the row.", "\"He is 6ft 4in and having a go at Gary Neville.", "So I said, 'have a go at me',\" he said.", "He insisted that it was not much better in the second half.", "Manchester United manager Sir Alex Ferguson added: \"Vieira was well wound up for it.", "\"He has heard different stories.", "Patrick Vieira has apparently threatened some of our players and things like that.\""], "smollm:1.7b": ["Highbury tunnel players in clear"], "deepseek-r1:1.5b": ["The Football Association has not yet made charges for the Arsenal vs. Manchester United game prior to the 4-2 defeat.", "Patrick Vieira of Arsenal denied threatening Gary Neville, while Roy Keane clashed with his skipper and referee.", "The FA confirmed that their handling of the incident was appropriate.", "United won without needing further intervention from Brian Barwick's new chief executive.", "Sir Alex Ferguson noted issues at Vieira but dismissed them as minor."], "tinyllama:1.1b": ["The Football Association stated that they will not be bringing any charges against the Highbury tunnel incident involving Manchester United's Gary Neville and Arsenal's Patrick Vieira, prior to the Arsenal and Manchester United game.", "The incidents had previously been attributed to large, experienced players such as Roy Keane and Gary Neville.", "After the match between Arsenal and Manchester United, Manchester United manager Alex Ferguson stated that United's win was not distracted by a \"horrible game\" in which Vieira started the row.", "Ferguson called for Vieira to apologize to Keane and the rest of his team-mates.", "However, Vieira has denied any threats or intimidation from Keane."], "tinydolphin:1.1b": [" In summary, the Football Association declined to bring charges against Arsenal and Manchester United players after a tunnel incident occurred during their clash prior to the match.", "However, Arsenal's Patrick Vieira claims he did not threaten Gary Neville before the game, as alleged by opposing captain Roy Keane and referee Graham Poll.", "This disagreement led to several fouls being called and a red card being shown to Silvestre for head-butting Freddie Ljungberg.", "Manchester United manager Sir Alex Ferguson also accused Vieira of starting the row, which he claimed prompted him to react."], "phi:2.7b": [" The Football Association will not charge any player or team in the Highbury tunnel incident, which occurred before Arsenal's game with Manchester United.", "Patrick Vieira denies making threats towards Gary Neville but admits to having a verbal altercation with him during the match.", "Despite the row between Vieira and Keane, both players insist that they can handle themselves on the field."], "orca-mini:3b": [" The Football Association declined to take action against Patrick Vieira following the tunnel incident prior to the Arsenal and Manchester United game.", "Vieira denied accusations that he threatened Gary Neville and clashed with Roy Keane and referee Graham Poll.", "The incident was handled by the referee at the time."], "hermes3:3b": [" Arsenal no charges over Highbury tunnel incident before Arsenal-Man Utd game.", "FA satisfied with referee handling."], "stablelm-zephyr:3b": ["The Football Association (FA) announced it will not charge Arsenal's Patrick Vieira over a tunnel incident prior to the game against Manchester United.", "The FA stated that referee Graham Poll was satisfied with handling the situation at the time.", "Both Vieira and opposing skipper Roy Keane allegedly clashed, but no further intervention from the governing body is necessary as United's win stands.", "Manchester United's Gary Neville dismissed accusations of intimidation, stating he could handle himself, while Sir Alex Ferguson mentioned hearing different stories about threats made by Vieira towards their players."], "chatgpt-4o-latest": ["The Football Association will not bring charges over the tunnel incident before Arsenal's match against Manchester United.", "Arsenal's Patrick Vieira denied threatening Gary Neville and clashed with Roy Keane, but referee Graham Poll handled the situation.", "Vieira downplayed the incident, while Neville acknowledged pre-match tensions but remained focused.", "The match was rough, with fouls and Mikael Silvestre sent off for head-butting Freddie Ljungberg.", "Keane accused Vieira of targeting Neville, while Sir Alex Ferguson suggested Vieira was highly charged for the game.", "The FA's decision means United's 4-2 win stands without further action."], "stablelm2:1.6b": ["The Football Association will not bring charges over the tunnel incident before a game between Arsenal and Manchester United.", "Arsenal's Patrick Vieira denied threatening Gary Neville, despite clashes with Roy Keane and the referee.", "Manchester United won the match, but there were incidents earlier in the game.", "Both players admitted to emotions being heightened during the match, but insisted it was a tough game for both teams.", "Sir Alex Ferguson accused Vieira of starting the row regarding intimidation of opposing players."], "granite3.1-dense:2b": ["The Football Association (FA) decided not to charge Arsenal's Patrick Vieira or his team over a tunnel altercation before the 4-2 Manchester United win, citing referee Graham Poll's handling of the incident.", "Vieira denied threatening Gary Neville and had words with Keane but insisted both players could handle themselves.", "Neville acknowledged pre-game incidents but maintained they didn't distract him.", "Manchester United manager Sir Alex Ferguson claimed Vieira had been \"well wound up\" and threatened their players, though he later retracted the statement.", "The match was marred by foul play, including Mikael Silvestre's head-butting of Freddie Ljungberg, leading to a red card for Silvestre.", "Both Neville and Keane described the game as unpleasant due to its harshness."]}