{"raw_text": "Bellamy under new fire\n \n Newcastle boss Graeme Souness has reopened his dispute with Craig Bellamy after claiming the Welshman was \"not good enough\" for the Magpies. Bellamy left Newcastle to join Celtic on loan after a major row with Souness. Souness - who refused to refer to the 25-year-old by name - said Bellamy did not score enough goals \"The chap that's just gone has scored 9.3 goals a season in his time in senior football - half of those weren't even in the top flight,\" said Souness. \"That's not good enough for a striker at a club like this. \"We need to have two strikers who are near 20 goals on a regular basis.\"\n \n Bellamy turned down a move to Birmingham in favour of joining Celtic after a disagreement about the Welsh international playing out of position quickly escalated. Earlier in the week, Souness had said that he risked losing the confidence of the players and damaging his own reputation if he had not taken a hard line after Bellamy accused him of lying.\n \n \"There are certain things you can forgive and forget,\" said Souness. \"But if I'd been seen to be weak in this case there was no future for me with the players in the dressing room or any job I have after Newcastle.\" He could then return to St James' Park - and he says that he wants to. However, it would seem unlikely he will play for Newcastle again as long as Souness remains in charge.\n", "llama3.2:1b": ["Craig Bellamy left Newcastle to join Celtic on loan after a dispute with manager Graeme Souness.", "Souness claims Bellamy did not score enough goals during his time at the club, saying 9.3 goals per season is \"not good enough\" for a striker.", "However, Bellamy denied being played out of position and accused Souness of lying about him scoring goals in the top flight."], "llama3.2:3b": ["Graeme Souness has reopened his dispute with Craig Bellamy, claiming the striker was \"not good enough\" for Newcastle due to a low goal-scoring record of 9.3 goals per season, and stated that he needs two strikers scoring near 20 goals each.", "Bellamy left Newcastle after a major row over playing out of position, with Souness saying he risked losing player confidence if not tough on the situation."], "gemma2:2b": ["Newcastle manager Graeme Souness criticized Craig Bellamy for his goal-scoring record during his time at the club, claiming Bellamy was \"not good enough.\"", "Souness's comments followed a public dispute between them and Bellamy's loan move to Celtic.", "Souness stated he needs two strikers who consistently score over 20 goals, while also highlighting the need for strong leadership within the dressing room.", "Despite wanting to return to Newcastle, it appears unlikely that Souness will ever have Bellamy back on his squad under his current reign."], "qwen2.5:0.5b": ["The Welsh Premier League club Newcastle United announced on Monday that Graeme Souness has reopened his dispute with Craig Bellamy after claiming the English striker was \"not good enough\" for the Magpies.", "Souness is now refusing to refer to the 25-year-old by name, while Bellamy turned down a move to Birmingham in favor of joining Celtic after a disagreement about the Welsh international playing out of position quickly escalated."], "qwen2.5:1.5b": ["Graeme Souness has reopened a dispute with Craig Bellamy over the Welsh striker's performance after leaving Newcastle on loan to Celtic following a disagreement about playing time.", "Souness criticizes Bellamy's goal-scoring record, saying he only scores half his goals outside of senior football leagues, despite being highly sought after by other clubs.", "Despite initial refusal, Bellamy accepted a move to Birmingham due to disagreements with Souness regarding position and playing time.", "Souness believes that if he hadn't taken a hard line on the situation, he would have lost players' trust and damaged his reputation, thus ending up unemployed at Newcastle.", "However, Souness insists that Bellamy is not suited for the role of a top striker player, insisting on two such strikers scoring near 20 goals per season."], "qwen2.5:3b": ["Newcastle boss Graeme Souness has renewed criticism of Craig Bellamy, saying the Welshman did not score enough goals (9.3 per season) and is \"not good enough\" for the club.", "This comes after Bellamy left Newcastle to join Celtic on loan following a dispute over playing position.", "Souness indicated he would like to return to Newcastle but doubts Bellamy will play there again if Souness remains in charge."], "opencoder:1.5b": ["Bellamy under new fire; Newcastle boss Graeme Souness reopened dispute with Craig Bellamy; Souness questioned whether the Magpies had played well.", "Souness claims that the Welshman did not score enough goals and requested that two strikers be hired, who are near 20 goals on a regular basis."], "smollm:1.7b": ["Bellamy under new fire: Bellamy's dispute with Souness over his performance has led to a rift between the two.", "Bellamy refused to refer to the 25-year-old by name, saying that Souness did not score enough goals \"The chap that's just gone has scored 9.3 goals a season in his time in senior football - half of those weren't even in the top flight.\"", "Bellamy turned down a move to Birmingham after a disagreement about the Welsh international playing out of position quickly escalated.", "Earlier in the week, Souness had said that he risked losing the confidence of the players and damaging his own reputation if he had not taken a hard line after Bellamy accused him of lying.", "There are certain things you can forgive and forget: However, if I'd been seen to be weak in this case there was no future for me with the players in the dressing room or any job I have after Newcastle.", "Bellamy could then return to St James' Park - and he says that he wants to.", "However, it would seem unlikely he will play for Newcastle again as long as Souness remains in charge."], "deepseek-r1:1.5b": ["Souness takes Bellamy out for a loan after their conflict, criticizing Bellamy's performance and wanting two top strikers at Celtic.", "Bellamy left Newcastle, hoping to return for future, but Souness focused on avoiding problems with his career."], "tinyllama:1.1b": ["Souness under new fire: Graeme Souness claimed that Welsh international Craig Bellamy was \"not good enough\" after the Magpie's boss refused to refer to him by name.", "Souness said Bellamy did not score enough goals for a striker at a club like this, and he risked losing his own reputation if he didn't take a hard line.", "Bellamy turned down a move to Birmingham in favour of playing for CeltiC after Souness accused him of lying.", "While it is possible that Souness will return to Newcastle, there is no indication as of now that he would continue to coach the team."], "tinydolphin:1.1b": [" Blessed be the womb and home with which my soul is conceived."], "phi:2.7b": [" Craig Bellamy left Newcastle to join Celtic due to a dispute with his former manager Graeme Souness who claimed the Welshman was not good enough for the team.", "The disagreement escalated after Bellamy accused Souness of lying.", "Souness had also refused to refer to Bellamy by name and believed he needed two strikers who were near 20 goals on a regular basis.", "Bellamy turned down a move to Birmingham in favor of joining Celtic, which led to his departure from Newcastle.", "Souness later said that losing the confidence of players and damaging his reputation could have consequences for his future at the club."], "orca-mini:3b": [" The text reports on Newcastle boss Graeme Souness's criticism of Craig Bellamy, stating that the Welshman was not good enough for the Magpies and that he needs to score more goals to be considered a striker at a club like Newcastle.", "Bellamy turned down a move to Birmingham in favor of joining Celtic after an argument with Souness about playing out of position.", "Souness risks losing the confidence of the players and damaging his own reputation if he had not taken a hard line after Bellamy accused him of lying."], "hermes3:3b": ["Bellamy criticized as not scoring enough goals by Newcastle manager Souness, disputes over player positioning led to Bellamy leaving for Celtic on loan."], "stablelm-zephyr:3b": ["Newcastle boss Graeme Souness reopens dispute with Craig Bellamy, stating the Welshman is \"not good enough\" for the Magpies.", "Souness highlights that Bellamy scored 9.3 goals per season during his time at Newcastle, which he deems insufficient for a striker at their level.", "This disagreement was initially about Bellamy playing out of position, but now also involves his overall performance and goal output.", "Bellamy could potentially return to St James' Park, but it seems unlikely he will play under Souness while the disagreement persists."], "chatgpt-4o-latest": ["Newcastle manager Graeme Souness has reignited his dispute with Craig Bellamy, stating the striker was \"not good enough\" for the club.", "Bellamy left for Celtic on loan after a major fallout with Souness, who criticized his goal-scoring record.", "Bellamy had turned down a move to Birmingham after a disagreement over his playing position escalated.", "Souness defended his tough stance, saying showing weakness would have undermined his authority.", "Although Bellamy has expressed a desire to return to Newcastle, it seems unlikely as long as Souness remains in charge."], "stablelm2:1.6b": ["Newcastle boss Graeme Souness criticized Craig Bellamy for not scoring enough goals despite his impressive record of 9.3 per season in senior football.", "Souness wants two strikers with near league-leading goal averages, while Bellamy turned down a move to Birmingham for Celtic due to disagreements over playing position.", "Souness acknowledges that he risked losing players' confidence and damaging his own reputation if he hadn \"been seen to be weak\" in the situation.", "However, it is unclear whether Souness will return to Newcastle as long as he holds power there."], "granite3.1-dense:2b": ["Graeme Souness, Newcastle manager, has reignited his dispute with Craig Bellamy, who previously left the team on loan to join Celtic following a significant disagreement.", "Souness criticized Bellamy's goal-scoring record, stating that scoring 9.3 goals per season (half in lower divisions) is insufficient for a top-flight striker at Newcastle.", "This led to Bellamy's departure after he accused Souness of lying about a matter involving playing position.", "Souness emphasized the importance of maintaining strong player morale and his own reputation, warning that weakness could jeopardize his future in football management.", "He expressed unwillingness to compromise on this issue, implying Bellamy is unlikely to return to Newcastle under Souness' leadership due to their ongoing conflict."]}