{"raw_text": "Wenger handed summer war chest\n \n Arsenal boss Arsene Wenger has been guaranteed transfer funds to boost his squad the summer.\n \n The club's managing director, Keith Edelman, stressed that the development of their new £350m stadium had no affect on Wenger's spending power. \"The money is there. Don't worry we've got it,\" Edelman told BBC Sport. \"Hopefully, we'll spend it this summer and in the coming years. Arsene attends all our board meetings and he knows our finances are very strong.\"\n \n Edelman added that it was pointless having a brand new stadium if the team did not match the surroundings. \"Its great to have nice, new surroundings, but if the team aren't performing on the pitch, then there isn't great respect in having a fabulous stadium,\" he said. \"It's important that we had sufficient funds for our team in place, before we began on the stadium.\"\n", "llama3.2:1b": ["Arsenal boss Arsene Wenger has been guaranteed transfer funds to boost his squad this summer despite not receiving funding for their new £350m stadium due to strong finances."], "llama3.2:3b": ["Arsene Wenger has been guaranteed transfer funds to boost his squad this summer, despite the development of the new £350m stadium having no impact on his spending power.", "The club's managing director, Keith Edelman, stated that Wenger attends all board meetings and is aware of the team's strong finances, but emphasized the importance of the team performing well in order to earn respect for the new stadium."], "gemma2:2b": ["Arsenal has received funding to boost its squad this summer.", "Managing director Keith Edelman confirmed this financial support is separate from the construction of their new stadium.", "He assured Arsene Wenger of the club’s strong finances and stated that spending will be prioritized for team improvement."], "qwen2.5:0.5b": ["Arsene Wenger has been guaranteed £350m transfer funds to boost his Arsenal squad and ensure they can play at their new £350m stadium this summer.", "The club's managing director, Keith Edelman, emphasized that while the development of the new stadium had no impact on Wenger's spending power, it was important for Arsene to have sufficient funds before embarking on the project."], "qwen2.5:1.5b": ["Arsene Wenger has been guaranteed transfer funding to enhance Arsenal's squad during the summer, despite plans for a new £350m stadium.", "Edelman emphasizes the club's strong financial position and importance of both current performance and stadium quality."], "qwen2.5:3b": ["Arsene Wenger has been guaranteed transfer funds to bolster Arsenal's squad this summer and beyond, despite the club's new £350m stadium project.", "Managing director Keith Edelman emphasized that financial strength remains strong, with Wenger fully informed about these finances.", "Edelman stressed the importance of team performance matching impressive surroundings, suggesting it would be pointless having a top-of-the-line stadium without an equally capable team."], "opencoder:1.5b": ["Wenger handed summer war chest to Arsenal boss Arsene Wenger, who has been assured with transfer funds to boost his squad.", "The club’s managing director, Keith Edelman, stressed that development of their new £350m stadium had no impact on Wenger's budget.", "\"The money is there; don't worry we've got it,\" Edelman said.", "He explained that he hoped this summer and in the future years would spend all funds on the stadium to ensure they could perform effectively at home.", "Edelman further added that having a new stadium without a clear understanding of how it works or why it matters was pointless.", "He mentioned that Wenger's budget is strong, as the team has sufficient funds in place before he begins with the stadium.", "\"It’s important that we had these funds beforehand so we could begin on the stadium,\" Edelman stressed."], "smollm:1.7b": ["Wenger has been guaranteed transfer funds to boost his squad this summer.", "The club's managing director assured that the development of their new £350m stadium would not affect Wenger's spending power.", "In fact, he had already received a guarantee for the development of their new stadium and was confident that it would be used effectively in the coming years.", "Edelman added that it was pointless having a brand new stadium if the team did not match the surroundings.", "\"Its great to have nice, new surroundings, but if the team aren't performing on the pitch, then there isn't great respect in having a fabulous stadium,\" he said.", "\"It's important that we had sufficient funds for our team in place, before we began on the stadium.\""], "deepseek-r1:1.5b": ["Arsenal's new £350m stadium has been secured with guaranteed transfer funds by manager Keith Edelman, despite not worrying about how it will affect his spending power.", "He noted the new surroundings but emphasized securing sufficient funds for team performance before investing in the stadium."], "tinyllama:1.1b": ["Weingarner handed summer war chest (summarizes the given text as 'weingarner has a guaranteed transfer budget for summer spending') due to his development of new stadium.", "Edelmman emphasized that the money was not affected by Arsenal's new stadium, and that their financial strength is very strong, as he attended all meetings with the club's board.", "The team's lackluster performance does not affect the size of Weingarner's transfer budget for the upcoming summer season."], "tinydolphin:1.1b": [" In response to Arsenal boss Arsene Wenger receiving transfer funds guaranteeing his squad during the summer transfer window, managing director Keith Edelman expressed optimism about the club's financial situation.", "He mentioned that the funds are there and can be utilized as needed for the team's development and future successes.", "The new £350m stadium is expected to be completed by 2018, providing Wenger with a substantial amount of financial leverage in his quest to improve Arsenal's on-field performance."], "phi:2.7b": [" Arsenal's managing director Keith Edelman has confirmed that club's football manager Arsene Wenger will have access to transfer funds this summer.", "The money is there and the new £350m stadium will not affect their spending power.", "It is essential to have a strong team in place to match the new surroundings of the stadium."], "orca-mini:3b": [" Arsenal boss Arsene Wenger was given transfer funds to boost his squad this summer.", "The club's managing director, Keith Edelman, stated that Wenger had no affect from the development of their new £350m stadium."], "hermes3:3b": ["Arsene Wenger gets summer transfer funding for Arsenal."], "stablelm-zephyr:3b": ["Arsenal's managing director, Keith Edelman, assured fans that Arsenal boss Arsene Wenger is guaranteed transfer funds for the summer to strengthen the squad.", "Edelman reassured that the £350m development of the new stadium won't affect Wenger's spending power, emphasizing the importance of having sufficient funds for the team before starting the stadium construction."], "chatgpt-4o-latest": ["Arsenal manager Arsene Wenger has been assured transfer funds to strengthen his squad despite the club's £350m stadium development.", "Managing director Keith Edelman confirmed the club's strong financial position and emphasized that having a top stadium is meaningless without a competitive team.", "He assured that funds were secured for the squad before starting the stadium project."], "stablelm2:1.6b": ["Arsenal manager Arsene Wenger receives guaranteed transfer funds from the club to strengthen his squad during the summer.", "Club managing director Keith Edelman assures there is no impact from building a new £250 million stadium and stated that they will spend the money this summer and in the future.", "Edelman emphasizes the importance of performing on the pitch despite having a modern facility."], "granite3.1-dense:2b": ["Arsenal's managing director, Keith Edelman, confirmed that manager Arsene Wenger will have ample transfer funds this summer and in subsequent years to enhance the squad.", "Despite the club's £350m investment in a new stadium, Edelman assured BBC Sport that financial constraints do not impact Wenger's budget.", "He emphasized that having a modern stadium is meaningless if the team fails to perform on the pitch.", "Edelman stressed that securing sufficient funds for the team was crucial before embarking on the stadium project."]}