{"raw_text": "Palace threat over Cantona masks\n \n Manchester United fans wearing Eric Cantona masks will not be allowed in Selhurst Park on Saturday.\n \n United fans are planning to mark the 10th anniversary of Cantona's infamous kung-fu kick on Crystal Palace fan Matthew Simmons by wearing the masks. But Palace stadium manager Kevin Corner has warned: \"If they wear them inside Selhurst Park they will be immediately rejected on safety grounds. \"And no fans wearing Cantona masks will be allowed entry to the stadium.\" United fans had declared Saturday as 'Cantona Day' and had planned to wear masks, that were popular during the Frenchman's time as a player at the Old Trafford club. Cantona received a nine-month ban following the incident and Palace are keen to avoid an incident that would stir up ill feeling between the two sets of supporters. Four months after the Cantona incident a Palace fan, Paul Nixon, was killed prior to an FA Cup semi-final at Villa Park.\n", "llama3.2:1b": ["Manchester United fans planning to wear Eric Cantona masks will not be allowed into Selhurst Park on Saturday due to safety concerns."], "llama3.2:3b": ["Manchester United fans wearing Eric Cantona masks will not be allowed into Selhurst Park on Saturday due to safety concerns and a desire to avoid stirring up ill feeling between supporters, following Cantona's infamous kung-fu kick in 1991."], "gemma2:2b": ["Manchester United fans planning to wear Eric Cantona masks to celebrate the 10th anniversary of his kung-fu kick on Crystal Palace supporter Matthew Simmons will not be allowed into Selhurst Park.", "This decision is made by the stadium manager to avoid potential safety concerns and disturbances between supporters.", "The incident's impact on both clubs and fans remains significant, with a tragic death occurring four months after the Cantona incident."], "qwen2.5:0.5b": ["Manchester United fans wearing Eric Cantona masks will not be allowed in Selhurst Park on Saturday.", "Palace stadium manager Kevin Corner has warned that if they wear them inside, they will be immediately rejected.", "No fans wearing Cantona masks will be allowed entry to the stadium."], "qwen2.5:1.5b": ["Manchester United fans planning to wear Eric Cantona masks in support of his 10th anniversary are denied entry into Selhurst Park by Crystal Palace's stadium manager due to safety concerns."], "qwen2.5:3b": ["Manchester United fans planning to wear Eric Cantona masks for his 10th anniversary of infamous kick on Crystal Palace fan Matthew Simmons will not be allowed inside Selhurst Park due to safety concerns.", "Palace manager Kevin Corrner has banned fans from wearing such masks, fearing it could stir up tensions between supporters.", "This follows a previous incident four months after the event where a Palace fan died before an FA Cup semi-final at Villa Park."], "opencoder:1.5b": ["Palace threat over Cantona masks\n\nManchester United fans wearing Eric Cantona masks will not be allowed in Selhurst Park on Saturday.", "United fans are planning to mark the 10th anniversary of Cantona's infamous kung-fu kick on Crystal Palace fan Matthew Simmons by wearing the masks.", "But Palace stadium manager Kevin Corner has warned: \"If they wear them inside Selhurst Park they will be immediately rejected on safety grounds.\"", "And no fans wearing Cantona masks will be allowed entry to the stadium."], "smollm:1.7b": ["The summary should be:\n\nUnited fans will not be allowed in Selhurst Park on Saturday because they are wearing Eric Cantona masks and are planning to mark the 10th anniversary of Cantona's infamous kung-fu kick by wearing them inside the stadium.", "Palace fans have also planned to wear Cantona masks, but this time they won't be allowed entry into the stadium.", "United fans had declared Saturday as 'Cantona Day' and had planned to wear masks, which were popular during the Frenchman's time at the Old Trafford club.", "The summary preserves key ideas and details:\n\n1.", "The summary starts with a brief introduction that sets the scene for the text.", "2.", "It then provides a concise overview of the main points or ideas in the text.", "3.", "The summary does not include any additional information, explanations, or reasoning processes.", "4.", "It only includes the key ideas and details from the original text."], "deepseek-r1:1.5b": ["Manchester United fans will be wearing Eric Cantona masks on Cantona Day at Selhurst Park in support of his legacy.", "Palace manager Kevin Corner fears potential safety issues if they enter inside wearing masks.", "Paul Nixon, killed four months later in Villa Park during an FA Cup semi-final, adds to feelings of tension between supporters.", "Fans aim to avoid conflict and highlight the event instead."], "tinyllama:1.1b": ["Palace fans planning to wear Eric Cantona masks in Selhuursst Park on Saturday are being warned that they could be rejected due to safety concerns related to the infamous kung-fu kick, which took place at Crystal Palace during a game between Manchester United and Cantona's former team, as reported by the Daily Mirror.", "The match was held in 1992, just months before Cantona received a nine-month suspension from the English Premier League for his infamous tackle on Simmon's knee.", "Palace stadium manager Kevin Cornor has urged fans to \"avoid and not wear\" Eric Cantona masks while visiting Selhuursst Park, warning of safety concerns associated with such costumes.", "Despite the fan's initial plan to wear the masks outside the stadium in order to commemorate the occasion, Palace is reportedly keen to avoid any potential disturbances that could cause trouble for supporters during a match at Selhuursst Park."], "tinydolphin:1.1b": [" Manchester United fans are planning a day dedicated to Eric Cantona, the infamous kick from which Matthew Simmons was injured, and have decided to wear his likeness in a gesture of protest.", "However, Palace stadium manager Kevin Corner has warned that if they do so inside the Selhurst Park stadium, they will be immediately rejected, and no fans wearing Cantona masks will be allowed entry.", "The decision is likely to result in a heated match between these two clubs, but one can only hope that fans on both sides show respect towards each other."], "phi:2.7b": [" Fans planning to wear masks in celebration of Eric Cantona's infamous kick on Crystal Palace will not be allowed entry into Selhurst Park due to safety concerns.", "The event is scheduled for Saturday, and United fans had declared the day as 'Cantona Day'.", "Palace stadium manager Kevin Corner has warned that any fans wearing the masks inside Selhurst Park will be immediately rejected."], "orca-mini:3b": [" Manchester United fans will not be allowed to enter Selhurst Park on Saturday if they wear Eric Cantona masks.", "The masks were popular during Cantona's time as a player at Old Trafford.", "United fans planned to mark the 10th anniversary of Cantona's famous kung-fu kick on Palace fan Matthew Simmons by wearing the masks.", "However, Selhurst Park stadium manager Kevin Corner warned that if fans wear them inside the stadium, they will be immediately rejected due to safety concerns.", "United fans also declared Saturday as 'Cantona Day' and planned to wear the masks, which were popular during Cantona's time as a player.", "However, Palace are keen to avoid any incidents that could stir up ill feeling between the two sets of supporters."], "hermes3:3b": ["Manchester U fans w/ Eric Cantona masks barred from Selhurst Park on Sat, over safety concerns for 10th anniv.", "of Cantona's kung-fu incident on Crystal Palace fan."], "stablelm-zephyr:3b": ["Manchester United fans planning to wear Eric Cantona masks at Selhurst Park on Saturday will not be allowed in due to safety concerns.", "Palace stadium manager has warned that fans wearing these masks will be rejected and no entry will be granted.", "This comes as an effort to avoid any potential incidents between the two sets of supporters.", "The incident involving Cantona led to a nine-month ban for the player, and Palace is cautious about avoiding similar issues in the future."], "chatgpt-4o-latest": ["Manchester United fans will not be allowed to wear Eric Cantona masks at Selhurst Park on Saturday.", "The masks were intended to mark the 10th anniversary of Cantona's infamous kung-fu kick on Crystal Palace fan Matthew Simmons.", "Palace stadium manager Kevin Corner stated that fans wearing the masks would be denied entry on safety grounds.", "United fans had planned 'Cantona Day' to honor the former player, but Palace wants to prevent any tensions between supporters.", "The club is particularly cautious as a Palace fan, Paul Nixon, was killed four months after the Cantona incident."], "stablelm2:1.6b": ["Manchester United fans will not be allowed in Selhurst Park due to planned Eric Cantona mask-wearing, despite warnings from palace stadium manager Kevin Corner about safety concerns.", "The masks were originally popular during Cantona's time as a player and sparked controversy after the Frenchman received a nine-month ban for the incident.", "Four months after the event, a fan was killed at an FA Cup match."], "granite3.1-dense:2b": ["Manchester United fans planning to wear Eric Cantona masks as part of a 10th anniversary tribute to the infamous kung-fu kick on Crystal Palace fan Matthew Simmons will be barred from entering Selhurst Park.", "Stadium manager Kevin Corner has issued a warning that such masks will result in immediate rejection due to safety concerns.", "Crystal Palace, seeking to prevent potential resurgence of past tensions, emphasizes their commitment to maintaining a peaceful atmosphere between supporters.", "The incident occurred four months after Cantona's kick, when Palace fan Paul Nixon tragically died before an FA Cup semi-final at Villa Park."]}