{"raw_text": "Ajax refuse to rule out Jol move\n \n Ajax have refused to reveal whether Tottenham's boss Martin Jol is on the Dutch champions' shortlist to become the Amsterdam club's new coach.\n \n Jol, who has coached in his native Holland, has guided Spurs to the Premiership's top eight. An Ajax spokesman told BBC Sport: \"The coach must fit our profile - a coach who understands the Dutch league and offensive and distinctive football. \"We need to find a solution soon, so someone is in place for next season.\" Ronald Koeman quit as Ajax boss last week after their exit from the Uefa Cup. Jol has been linked with the vacant post at Ajax, with reports saying he has fallen out with Spurs' sporting director Frank Arnesen. But in a statement on Spurs' website, Jol said: \"I'm happy here, I'm not in discussion with anyone else, I don't want to go elsewhere.\" Ajax have enlisted the help of Dutch legend Johann Cruyff, currently a consultant at Barcelona, to help find a new head coach. Cruyff has admitted he has been impressed by the way former RFC Waalwijk coach Jol has turned round Spurs' fortunes since taking over from Jacques Santini. Tonny Bruins Slot and Ruud Krol are currently in charge of Ajax, who are third in the Dutch league.\n", "llama3.2:1b": ["Ajax have refused to rule out Martin Jol becoming their new coach, despite reports that he may be leaving Tottenham Hotspur.", "The Dutch club is looking for a coach who understands their league style and can lead them to success.", "Johan Cruyff, a former Ajax legend, has been enlisted to help find a new head coach after Jol's departure."], "llama3.2:3b": ["Ajax refuse to confirm Martin Jol's involvement as their new coach, citing a need for a coach fitting their profile, despite reports of him falling out with Spurs' sporting director Frank Arnesen.", "Ajax are searching for a solution to find a new head coach after Ronald Koeman's departure, with the help of consultant Johann Cruyff."], "gemma2:2b": ["Ajax is searching for a new head coach after Ronald Koeman left.", "They have not confirmed whether Martin Jol is on their shortlist but haven't ruled it out either.", "Jol has led Tottenham to a top-eight finish and denies having any interest in leaving the club.", "Ajax has turned to legendary Johan Cruyff for help in finding a new coach.", "Ajax currently sits third in the Dutch league, with Tonny Bruins Slot and Ruud Krol as interim coaches."], "qwen2.5:0.5b": ["Ajax's Martin Jol is reportedly interested in replacing Tottenham's boss Ronald Koeman.", "However, they've yet to make a decision on their new head coach.", "Ajax have enlisted Dutch legend Johann Cruyff as a consultant to help find a new head coach."], "qwen2.5:1.5b": ["Ajax have not ruled out Martin Jol as a candidate to become Tottenham's new head coach."], "qwen2.5:3b": ["Ajax have not confirmed if Martin Jol is on their shortlist to replace Ronald Koeman as coach.", "Despite coaching Tottenham to top eight spots in English Premier League, Jol has reportedly fallen out with Spurs' sporting director.", "An Ajax spokesman stated they seek a coach who understands Dutch football and offensive tactics.", "They are seeking a solution soon for the upcoming season.", "While Jol denied any discussions with other clubs, including Ajax, Dutch legend Johann Cruyff recommended him to the club."], "opencoder:1.5b": ["\"Ajax refuse to rule out Jol move.", "Ajax have refused to reveal whether Tottenham's boss Martin Jol is on the Dutch champions' shortlist to become the Amsterdam club's new coach.", "Jol, who has coached in his native Holland, has guided Spurs to the Premiership's top eight.", "An Ajax spokesman told BBC Sport: \"The coach must fit our profile - a coach who understands the Dutch league and offensive and distinctive football.\"", "We need to find a solution soon, so someone is in place for next season.", "Ronald Koeman quit as Ajax boss last week after their exit from the Uefa Cup.", "Jol has been linked with the vacant post at Ajax, with reports saying he has fallen out with Spurs' sporting director Frank Arnesen.", "But in a statement on Spurs' website, Jol said: \"I'm happy here, I'm not in discussion with anyone else, I don't want to go elsewhere.\"", "Ajax have enlisted the help of Dutch legend Johann Cruyff, currently a consultant at Barcelona, to help find a new head coach.", "Cruyff has admitted he has been impressed by the way former RFC Waalwijk coach Jol has turned round Spurs' fortunes since taking over from Jacques Santini.\""], "smollm:1.7b": ["Ajax refuse to rule out Jol move for shortlist as Amsterdam club's new coach.", "Jol have guided Spurs to top eight in Uefa Cup.", "Ajax have hired Cruyff to help find new head coach.", "Jol is not in discussion with anyone else, but they are happy here and don't want to go elsewhere."], "deepseek-r1:1.5b": ["Ajax has not ruled out Jol moving to become the new coach for Amsterdam.", "Martin Jol was on Tottenham's Dutch champions' shortlist and previously led Spurs to the Premiership top eight after coaching there since 2014.", "Jol is linked with Johann Cruyff, a former RF C Wallwijk coach, and currently leads Ajax to third place in the Dutch league.", "Ronald Koeman has left Ajax after their Uefa Cup exit last week."], "tinyllama:1.1b": ["Ajax have ruled out any possibility of Martin Jol becoming their new coach, citing his profile as a coach from the Uefa Cup exit of Tottenham Hotspur.", "Ajax have enlisted the assistance of Ajax legend and Dutch football icon Johann Cruyff to help find a new head coach, with reports suggesting that Jol's name is being bandied about in relation to the vacant position at the club.", "Joл has also been linked with Ajax after news broke that Ronald Koeman had left the club for Manchester United, and it is unknown as of yet if there will be any changes made to the Ajax coaching staff or the team's approach under his leadership."], "tinydolphin:1.1b": [" Ajax refuse to rule out Jol move, rejecting suggestions that Tottenham Hotspur manager Martin Jol is on their shortlist for coach.", "The club's statement, published by BBC Sport, emphasizes the need for a solution soon, so someone can be in place for next season.", "Ronald Koeman quit as Ajax boss last week after their exit from the Uefa Cup.", "Jol has been linked with the vacant position at Ajax and the report claims he has fallen out with Spurs' sporting director Frank Arnesen.", "Ajax enlisted the help of Dutch legend Johann Cruyff to find a new head coach."], "phi:2.7b": [" There is no summary as plain text provided for the text because it is just a short paragraph discussing Martin Jol's possible move to become the new coach for Ajax.", "The article does not provide any additional details or context regarding this topic."], "orca-mini:3b": [" Ajax have refused to rule out Martin Jol as their new coach, with Tottenham Hotspur's sporting director Frank Arnesen reported to have fallen out with him.", "Ronald Koeman left his post as Ajax boss last week, and reports suggest Jol has fallen out with Arnesen.", "However, Spurs' website states that he is happy at the club and not in discussion with anyone else.", "The current coaches, Tonny Bruins Slot and Ruud Krol, are in charge of Ajax, who are currently third in the Dutch league."], "hermes3:3b": ["Ajax refuse to confirm if Martin Jol for Ajax coach discussion is ongoing."], "stablelm-zephyr:3b": ["Ajax is considering Martin Jol as a potential new coach for their team, but has not revealed if he is on their shortlist.", "They want someone who understands the Dutch league and offensive football.", "Jol, former coach of Spurs, has experience in the Netherlands and guided Spurs to the top eight in the Premiership.", "However, Ajax wants to find a solution soon for next season, as they currently have Johann Cruyff assisting them in finding a new head coach."], "chatgpt-4o-latest": ["Ajax have not confirmed whether Tottenham manager Martin Jol is on their shortlist for a new head coach.", "Jol, who has experience in Dutch football, has led Spurs to the Premiership's top eight.", "Ajax seek a coach familiar with Dutch football and attacking play after Ronald Koeman's resignation.", "Reports suggest Jol has issues with Spurs' sporting director, but he insists he is happy at Tottenham.", "Ajax have enlisted Johan Cruyff to help find a new coach, and he has praised Jol's work.", "Meanwhile, Tonny Bruins Slot and Ruud Krol are temporarily in charge as Ajax sit third in the Dutch league."], "stablelm2:1.6b": ["Ajax has declined to comment on potential new Coach Martin Jol for their team, though Jol is highly regarded for his experience coaching in the Netherlands and for turning around Tottenham's fortunes.", "Johan Cruyff, a consultant at Barcelona, will assist in finding a new head coach.", "Ajax currently sits third in the Dutch league with slot & krol as current coaches."], "granite3.1-dense:2b": ["Ajax is seeking a new head coach following Ronald Koeman's departure last week due to their Uefa Cup elimination.", "Tottenham's Martin Jol, known for his offensive style and Dutch football expertise, has been touted as a potential candidate.", "However, Ajax has not confirmed whether he is on the shortlist or in talks with them.", "Despite links suggesting a falling-out with Spurs' sporting director Frank Arnesen, Jol stated he is content at Tottenham and not considering other opportunities.", "To aid in the search, Ajax has engaged Dutch football legend Johann Cruyff, who praised Jol's transformation of Spurs.", "Currently, coaching duties are handled by Tonny Bruins Slot and Ruud Krol, with Ajax third in the Dutch league."]}