{"raw_text": "Prutton poised for lengthy FA ban\n \n Southampton's David Prutton faces a possible seven-match ban when he goes before the Football Association.\n \n The 23-year-old has admitted two charges of improper conduct following his dismissal against Arsenal. The first charge relates to his failure to leave the field promptly, pushing referee Alan Wiley and remonstrating with assistant referee Paul Norman. And the second charge is for using threatening words and/or behaviour to a match official during the 1-1 draw.\n \n Paolo di Canio was given a seven-match suspension when he pushed referee Paul Alcock over in a Premiership game between Sheffield Wednesday and Arsenal in 1998. Prutton will be joined at Wednesday's hearing by Saints boss Harry Redknapp, who believes that the FA will throw the book at his player. Redknapp himself sprinted along the touchline to help physio Jim Joyce and coach Denis Rofe shepherd the enraged Prutton away from referee's assistant Norman. \"David has made a big mistake and he knows it. I can't condone what he's done. He was out of order but he knows that,\" said Redknapp. \"He's a decent lad. He over-reacted badly for some reason - he had a rush of blood from somewhere. Off the pitch you couldn't meet a nicer lad.\" Prutton has apologised publicly for his actions and to Arsenal's Robert Pires, who was injured in a wild tackle by the Saints' midfield man.\n \n He said: \"It's an horrendous situation. I apologise to the ref and linesman, who were only doing their job. \"I've also seen what happened to Pires' leg and I'm sorry for that as well.\" \"I apologise for the people who saw it. I know you get lots of kids going to the match now and they don't pay money to see that sort of thing. \"It's not a cop-out, but it was all a bit of a blur. Sometimes you react and it's beyond your control, \" added Prutton.\n", "llama3.2:1b": ["David Prutton will face a possible seven-match ban from the Football Association after admitting two charges of improper conduct following his dismissal against Arsenal.", "The incidents include pushing referee Alan Wiley and assistant referee Paul Norman, and using threatening words to match official Robert Pires during a 1-1 draw in 2018.", "Prutton apologized for his actions and also expressed remorse towards Pires' injured leg."], "llama3.2:3b": ["David Prutton faces possible 7-match FA ban for improper conduct after being dismissed from Southampton's game against Arsenal, with charges including failure to leave the field promptly and using threatening words towards referee Alan Wiley.", "Saints boss Harry Redknapp supports ban, saying Prutton over-reacted badly but is a decent lad."], "gemma2:2b": ["David Prutton faces a possible seven-match ban from the Football Association for improper conduct after his dismissal against Arsenal.", "He admitted two charges: failing to leave the field promptly and using threatening words or behavior towards a match official.", "Southampton manager Harry Redknapp believes the FA will impose a harsh penalty, while Prutton has apologized publicly and to injured player Robert Pires."], "qwen2.5:0.5b": ["David Prutton faces a possible 7-match FA ban after admitting two charges related to improper conduct in his first match since the start of the season.", "He will face hearing from Football Association officials and his club.", "He is accused of pushing referee Paul Alcock over during an Arsenal game, allegedly over an argument with Norman about whether it was appropriate for Prutton to use his left leg while on the field.", "Prutton apologizes for his actions and says he has already apologized to Arsenal's Robert Pires and others who saw him in the match."], "qwen2.5:1.5b": ["Southampton midfielder David Prutton faces a possible seven-match ban by the Football Association after admitting two charges following his dismissal against Arsenal."], "qwen2.5:3b": ["Southampton's David Prutton faces a possible seven-match ban after admitting two charges of improper conduct: failing to leave the field promptly, pushing referee Alan Wiley, and remonstrating with assistant referee Paul Norman during his dismissal against Arsenal.", "He also used threatening words to match official during a 1-1 draw.", "Former player Paolo di Canio faced a similar punishment for a similar incident in 1998.", "Prutton will be heard by Southampton's boss Harry Redknapp and the FA.", "The 23-year-old apologized publicly, apologizing to the referee and injured Arsenal player Robert Pires.", "He acknowledged he acted out of control but claimed it was beyond his control."], "opencoder:1.5b": ["The Football Association (FA) has a potential seven-match ban on David Prutton.", "After leaving the club, he faced a possible seven-match ban when going before the FA in 1998.", "Prutton was an 23-year-old footballer who admitted two charges of improper conduct against Arsenal.", "The first charge is related to his failure to leave the field promptly and causing a referee to remonstrate with an assistant referee.", "The second charge involves using threatening words and/or behaviour to a match official, which goes against the FA's rules.", "The suspension was given by Paolo di Canio, who was given a seven-match suspension when he was pushed by Paul Alcock over in a Premiership game between Sheffield Wednesday and Arsenal during 1998.", "He will be joined at Wednesday's hearing with Saints boss Harry Redknapp, who believes the FA will throw the book at his player.", "Redknapp also sprinted along the touchline to help physio Jim Joyce and coach Denis Rofe to assist in a violent situation.", "David Prutton has been publicly apologised for his actions and for Arsenal's Robert Pires, who suffered an injury during a wild tackle by Saints' midfield man."], "smollm:1.7b": ["Summarization:\n\nPrutton faces a possible seven-match ban due to two charges of improper conduct related to his behavior during an Arsenal match in 1998.", "The first charge relates to his failure to leave the field promptly and pushing referee Alan Wiley, while the second charge is for using threatening words and/or behavior to a match official during the 1-1 draw."], "deepseek-r1:1.5b": ["David Prutton faces a possible seven-match ban from the FA after being dismissed against Arsenal.", "He is suspended for improper conduct related to his actions and has been joined in a hearing by Paul Alcock (the referee) along with Saints boss Harry Redknapp, who supports him.", "Prutton apologized publicly for the incident involving Robert Pires and criticized the situation as excessive and out of control."], "tinyllama:1.1b": ["Prutton, the defender for Southampton, has been charged with two counts of improper conduct by referee Neil Swarbrick following his dismissal during a Premier League match against Arsenal in 2001.", "The first charge involves Prutton's failure to leave the field promptly, while the second relates to threatening words and/or behavior towards an assistant referee and his physio.", "Although the FA has no plans for sanctions against Prutton, they are likely to be severe in relation to other players with similar offenses."], "tinydolphin:1.1b": [" Prutton is set to face a seven-match suspension from the Football Association (FA) after he was given two charges of improper conduct following his dismissal against Arsenal in a match that saw him punch referee Alan Wiley and remonstrate with the assistant referee Paul Norman.", "The 23-year-old has admitted both charges, which could see him face a significant period away from the pitch if he is found guilty of the offences.", "This ban could keep Prutton out of action for several months as he awaits the outcome of his FA case."], "phi:2.7b": [" Southampton's David Prutton may face up to seven matches suspension after he was caught using offensive language towards a match official and pushing the referee during an FA game.", "The 23-year-old has already received two charges of improper conduct for similar actions in the same game against Arsenal.", "This is not the first time that Prutton has faced disciplinary action, as he previously received a seven-match suspension for a similar offense against Sheffield Wednesday's player Paolo di Canio in 1998.", "His coach and his team's manager have expressed disappointment in his behavior and believe that the FA will take a strict approach with him."], "orca-mini:3b": [" Southampton's David Prutton faces a seven-match ban when he goes before the Football Association following his dismissal against Arsenal.", "He admitted two charges of improper conduct for pushing referee Alan Wiley and remonstrating with assistant referee Paul Norman.", "Prutton apologized to the referee and linesman for his actions and to Arsenal's Robert Pires who was injured in a wild tackle by the Saints' midfielder."], "hermes3:3b": ["David Prutton faces potential 7-match FA ban for improper conduct after admitting two charges (for leaving field promptly, pushing/refusing to leave referee, remonstrating with assistant referee) during Southampton vs Arsenal game."], "stablelm-zephyr:3b": ["Southampton's David Prutton faces a possible seven-match ban for improper conduct during his dismissal against Arsenal.", "The 23-year-old has admitted two charges: not leaving the field promptly and using threatening words and behavior towards a match official.", "Prutton's apology mentions he regrets the incident, and that it was a blur, beyond his control.", "Paolo di Canio received a similar ban in 1998 for pushing a referee."], "chatgpt-4o-latest": ["Southampton's David Prutton faces a potential seven-match ban after admitting two charges of improper conduct following his red card against Arsenal.", "He failed to leave the field promptly, pushed referee Alan Wiley, and used threatening language toward an official.", "A similar incident in 1998 saw Paolo di Canio receive a seven-match suspension.", "Southampton manager Harry Redknapp expects a harsh punishment but acknowledges Prutton's remorse.", "Prutton has publicly apologized to the officials and Arsenal's Robert Pires, who was injured in the match, expressing regret for his actions and their impact on spectators."], "stablelm2:1.6b": ["Southampton's David Prutton faces a seven-match ban after admitting two charges of improper conduct following his dismissal against Arsenal.", "The first charge involved pushing referee Alan Wiley and remonstrating with assistant referee Paul Norman, while the second charge was for using threatening words and/or behaviour to a match official during a 1-1 draw.", "Prutton will be joined at Wednesday's hearing by Saints boss Harry Redknapp, who believes that the FA will throw the book at his player.", "Prutton has apologized publicly for his actions and to Arsenal's Robert Pires."], "granite3.1-dense:2b": ["David Prutton, 23, Southampton's midfielder, is set to face a potential seven-match ban from the Football Association after admitting two charges of improper conduct following his dismissal during a match against Arsenal.", "The first charge involves failing to leave the field promptly and physically confronting referee Alan Wiley and assistant Paul Norman.", "The second charge pertains to using threatening words or behavior towards a match official.", "Paolo di Canio, in 1998, received a similar seven-match suspension for pushing referee Paul Alcock.", "Prutton's manager, Harry Redknapp, anticipates a severe punishment from the FA and acknowledged his player's mistake, emphasizing that Prutton knows he acted inappropriately due to an emotional overreaction.", "Prutton has publicly apologized for his actions, including injuring Arsenal's Robert Pires with a dangerous tackle, and expressed regret for the spectators who attended the game."]}