{"raw_text": "Cudicini misses Carling Cup final\n \n Chelsea goalkeeper Carlo Cudicini will miss Sunday's Carling Cup final after the club dropped their appeal against his red card against Newcastle.\n \n The Italian was sent off for bringing down Shola Ameobi in the final minute of Sunday's match. Blues boss Jose Mourinho had promised to pick Cudicini for the final instead of first-choice keeper Petr Cech. The 31-year-old will now serve a one-match suspension commencing with immediate effect.\n \n Cudicini kept a club record 24 clean sheets last season for Chelsea, but Petr Cech has established himself as first choice for Mourinho since moving to Stamford Bridge in summer 2004. The 22-year-old Czech Republic international has set a new Premiership record of 961 consecutive minutes without conceding a goal, a mark which is still running. But Mourinho has used Cudicini regularly in the Carling Cup, and the Italian has only let in one goal in his four appearances during Chelsea's run to the final.\n", "llama3.2:1b": ["Chelsea goalkeeper Carlo Cudicini will miss Sunday's Carling Cup final due to his red card against Newcastle.", "He will serve a one-match suspension starting immediately following the appeal."], "llama3.2:3b": ["Carlo Cudicini will miss Sunday's Carling Cup final due to a one-match suspension after being sent off against Newcastle for bringing down Shola Ameobi.", "The decision follows Cudicini keeping 24 clean sheets last season and Mourinho choosing Petr Cech as his preferred goalkeeper since 2004, but using him in the Carling Cup to good effect with only one goal conceded."], "gemma2:2b": ["Carlo Cudicini will miss Chelsea's Carling Cup final due to a one-match suspension for a red card received in the previous match.", "He had been initially promised a starting spot, but Petr Cech remains the first choice keeper."], "qwen2.5:0.5b": ["Chelsea goalkeeper Carlo Cudicini will miss Sunday's Carling Cup final after being sent off for bringing down Shola Ameobi in the final minute of the match.", "The Italian has a club record 24 clean sheets last season, but Petr Cech is set to return as Chelsea's first-choice keeper.", "Cudicini and Cech have been used frequently together during Chelsea's run to the final, with Cudicini allowing only one goal in his four appearances."], "qwen2.5:1.5b": ["Chelsea goalkeeper Carlo Cudicini will miss Sunday's Carling Cup final due to a red card against Newcastle, resulting in a one-match suspension.", "Despite having kept 24 clean sheets last season, he now must serve that suspension immediately following the match.", "Mourinho has previously favored him for the final but is replacing him with Petr Cech as first choice after Cudicini's recent performances during the Carling Cup runs."], "qwen2.5:3b": ["Chelsea goalkeeper Carlo Cudicin misses the Carling Cup final due to a red card he received against Newcastle.", "The club appealed unsuccessfully, resulting in a one-match suspension.", "Cudicin kept 24 clean sheets for Chelsea last season, but first-choice keeper Petr Cech has dominated since joining in 2004.", "Cudicin was used regularly in the Carling Cup and had conceded only once in four appearances leading up to the final."], "opencoder:1.5b": ["\"The goalkeeper will miss Sunday's Carling Cup final after Carling Cup dropped their appeal against red card due to Newcastle.\"", "The club sent off for bringing down the Shola Ameobi match in the final minute of Sunday's match.", "Cudicini kept a club record of 24 clean sheets last season in the Chelsea, but Petr Cech has established himself as the first choice keeper for Mourinho since moving to Stamford Bridge.", "The 22-year-old Czech Republic international has set a new Premier League record of 961 consecutive minutes without a goal, marking which is still running.", "Cudicini will now serve a one-match suspension commencing with immediate effect after Carling Cup."], "smollm:1.7b": ["Chelsea will miss Sunday's Carling Cup final after the club dropped their appeal against Newcastle.", "The Italian was sent off for bringing down Shola Ameobi in the final minute of Sunday's match.", "Blues boss Jose Mourinho had promised to pick Cudicini for the final instead of first-choice keeper Petr Cech.", "The 31-year-old will now serve a one-match suspension commencing with immediate effect.", "Cudicini kept a club record 24 clean sheets last season for Chelsea, but Petr Cech has established himself as first choice for Mourinho since moving to Stamford Bridge in summer 2004.", "The 22-year-old Czech Republic international has set a new Premiership record of 961 consecutive minutes without conceding a goal, a mark which is still running.", "But Mourinho has used Cudicini regularly in the Carling Cup, and the Italian has only let in one goal in his four appearances during Chelsea's run to the final."], "deepseek-r1:1.5b": ["Cudicini missed the Carling Cup final after being denied an appeal due to a red card.", "Mourinho was set to select him but received a one-match suspension for his dismissal last Sunday.", "Chelsea has 24 clean sheets last season, while Petr Cech holds a nine-year record of no goals in a row and remains their favorite."], "tinyllama:1.1b": ["Cudicini misses Carling Cup final after losing appeal against Newcastle player\nCheersea goalkeeper Carlo Cudicini will miss Sunday's Carling Cup final after dropping their appeal against his red card, with Blues boss Jose Mourinho promising to pick him for the match instead.", "The Italian was sent off in the 89th minute of their match against Newcastle United, bringing a one-match suspension beginning immediately for Cudicini.", "However, new first choice keeper Petr Cecch has established himself as the club's first choice since signing for Stamford Bridge in 2004.", "Despite being in an impressive run with only conceding one goal during their Carling Cup run, Mourinho has used Cudicini regularly during his appearances, with a total of 961 consecutive minutes without conceding a goal."], "tinydolphin:1.1b": [" - The Carling Cup final will be without Cudicini, who was sent off for bringing down Shola Ameobi in the match.", "- Chelsea will now have a one-match suspension against them from the start of the match, with Cudicini serving it starting with immediate effect."], "phi:2.7b": [" Carlo Cudicini will miss the Carling Cup final due to a red card received for bringing down Shola Ameobi in the final minute of Sunday's match against Newcastle.", "The Italian goalkeeper was set to play, but he will now serve a one-match suspension.", "Petr Cech has established himself as the first choice keeper, and the"], "orca-mini:3b": [" Chelsea goalkeeper Carlo Cudicini will miss Sunday's Carling Cup final after being sent off for bringing down Shola Ameobi in the final minute of a match against Newcastle.", "The Italian was promised to be picked for the final instead of first-choice keeper Petr Cech, but he will now serve a one-match suspension commencing with immediate effect."], "hermes3:3b": ["Carlo Cudicini to miss Carling Cup final due to red card against Newcastle, serving one-match ban."], "stablelm-zephyr:3b": ["Chelsea goalkeeper Carlo Cudicini will miss the Carling Cup final after the club dropped their appeal against his red card against Newcastle.", "Cudicini was sent off for bringing down Shola Ameobi in the last minute of the match, and now serves a one-match suspension starting immediately.", "Petr Cech has established himself as first choice goalkeeper under manager Jose Mourinho since joining in 2004."], "chatgpt-4o-latest": ["Chelsea goalkeeper Carlo Cudicini will miss the Carling Cup final after the club dropped their appeal against his red card for fouling Shola Ameobi.", "Manager Jose Mourinho had planned to start Cudicini over first-choice keeper Petr Cech, but the Italian will now serve a one-match suspension.", "Cudicini, who set a club record with 24 clean sheets last season, has been regularly used in the Carling Cup, conceding only one goal in four matches.", "Meanwhile, Cech has established himself as Chelsea's first-choice keeper, setting a Premiership record of 961 consecutive minutes without conceding a goal."], "stablelm2:1.6b": ["Goalkeeper Carlo Cudicini will miss the Carling Cup final due to receiving a red card against Newcastle, despite the club appealing it.", "He was sent off for a foul play against Shola Ameobi and will serve a one-match suspension starting immediately.", "Cudicini kept a club record with clean sheets last season while Petr Cech has become Chelsea's first-choice keeper since joining in 2013.", "However, Cudicini has been used frequently in the Carling Cup, with only letting in one goal in his four appearances during Chelsea's run to the final."], "granite3.1-dense:2b": ["Carlo Cudicini, Chelsea's 31-year-old goalkeeper, will not participate in Sunday's Carling Cup final due to a one-match suspension resulting from his red card against Newcastle during the match's final minute.", "This decision follows the club's withdrawal of their appeal.", "Manager Jose Mourinho had initially intended to select Cudicini over first-choice Petr Cech for the final, citing Cudicini's recent performance in keeping 24 clean sheets last season and his limited goal concessions in four Carling Cup appearances this year (one goal).", "Despite Cudicini's strong record, Cech remains Mourinho's first-choice keeper due to his streak of 961 consecutive minutes without conceding a goal since joining Chelsea in 2004."]}