{"raw_text": "Tottenham bid &#163;8m for Forest duo\n \n Nottingham Forest have confirmed they have received an £8m bid from Tottenham for Andy Reid and Michael Dawson.\n \n Reid rejected a move to Southampton after Forest accepted a cash-plus-players offer while Spurs had made previous bids for the 22-year-old. Spurs had also made an undisclosed offer for 21-year-old defender Dawson. Forest chief executive Mark Arthur said: \"We've received an £8m bid from Spurs for the two players and we're considering the offer.\" Southampton's offer for Republic of Ireland international Reid comprised £3m-plus and two players - Brett Ormerod and Darren Kenton.\n \n Spurs had seen previous bids of £3m, £4m and £5m for Reid rejected by the Championship club.\n", "llama3.2:1b": ["Tottenham have received an £8m bid from Forest for Andy Reid and Michael Dawson after Forest accepted a cash-plus-players offer."], "llama3.2:3b": ["Nottingham Forest have accepted an £8m bid from Tottenham for Andy Reid and Michael Dawson."], "gemma2:2b": ["Tottenham has bid £8 million for Andy Reid and Michael Dawson from Nottingham Forest.", "Forest is considering the offer while Southampton's offer was previously rejected."], "qwen2.5:0.5b": ["Forest have received an £8m bid from Tottenham for Andy Reid and Michael Dawson."], "qwen2.5:1.5b": ["Nottingham Forest received an £8 million bid from Tottenham for Andy Reid and Michael Dawson."], "qwen2.5:3b": ["Tottenham offered £8m for Andy Reid and Michael Dawson from Nottingham Forest, with an undisclosed offer for Dawson as well.", "Reid previously rejected a move to Southampton but accepted Forest's cash-plus-players bid after Spurs' previous offers were declined.", "Forest is considering the Tottenham bid while Southampton had offered £3m plus two players for Reid.", "Tottenham's previous bids for Reid were also turned down."], "opencoder:1.5b": ["Tottenham Forest have received an £8m bid from Tottenham for Andy Reid and Michael Dawson.", "After accepting a cash-plus-players offer from Nottingham Forest, Reid was not willing to move away from Southampton despite the previous bids from both Spurs and other clubs.", "The offer was considered as an undisclosed amount by both club officials.", "The club made offers of £3m, £4m and £5m for Reid, but they were all rejected.", "The club also suggested for Darren Kenton who is a Republic of Ireland international.", "It is clear that the club has not disclosed any specific reason why it was decided to reject the move by Reid."], "smollm:1.7b": ["The summary should be: Tottenham bid &#163;8m for Forest duo\n\nThis summary captures the main points from the original text, preserving key ideas and details while omitting unnecessary information.", "The goal is to provide a concise overview of the main points without adding any additional context or explanations."], "deepseek-r1:1.5b": ["Tottenham bid €8m for Andy Reid and Michael Dawson from Nottingham Forest, which had previously been considered by the club but was subsequently rejected."], "tinyllama:1.1b": ["Tottenham Hotspur has submitted a £8m offer to Nottingham Forest for midfielders Andy Reid and Michael Dawson.", "Forest rejected the initial Spurs bid of £3m, £4m, and £5m.", "Spurs will now consider their latest offer before deciding on the transfer."], "tinydolphin:1.1b": [" This text provides a summary of events involving Nottingham Forest and Tottenham Hotspur involving two Premier League players named Andy Reid and Michael Dawson.", "In total, it mentions both players have accepted financial offers from Tottenham Hotspur.", "The text also mentions that the initial offer from Southampton for one player was £3m but Spurs later increased their bid to a reported £4m and then increased it again to a reported £5m.", "Both clubs are currently assessing the offer from Tottenham Hotspur, with both Forest and Tottenham Hotspur potentially making offers to the players they want."], "phi:2.7b": [" Nottingham Forest received an undisclosed bid from Tottenham for Andy Reid and Michael Dawson, with a reported value of £8 million.", "The deal was accepted after rejecting offers from other clubs including Southampton.", "This is the fourth previous bid from Spurs for Reid."], "orca-mini:3b": [" Tottenham made an £8m offer for Andy Reid and Michael Dawson, who are both on loan at Forest from the club.", "Forest is considering the offer."], "hermes3:3b": [" Tottena 8m bid for Nottingham Forest's Reid and Dawson"], "stablelm-zephyr:3b": ["Tottenham submitted an £8m bid for Nottingham Forest players Andy Reid and Michael Dawson.", "While Southampton offered £3m-plus-two players, Forest accepted a cash-plus-players deal for Reid and considered Spurs' offer for Dawson.", "Tottenham had previously made lower bids that were rejected by the Championship team."], "chatgpt-4o-latest": ["Tottenham have submitted an £8m bid for Nottingham Forest's Andy Reid and Michael Dawson.", "Reid previously rejected a move to Southampton, whose offer included £3m plus two players.", "Spurs had made earlier bids for Reid and an undisclosed offer for Dawson.", "Forest's chief executive confirmed they are considering Tottenham's latest offer."], "stablelm2:1.6b": ["Tottenham has offered £8 million for Nottingham Forest duo Andy Reid and Michael Dawson.", "Both players have received offers from their respective clubs but have not yet decided on which one to accept.", "Spurs had previously submitted bids of £3 million, £4 million, and £5 million for Reid but were rejected by Forest.", "The chief executive of Nottingham Forest, Mark Arthur, confirmed the receipt of an £8 million bid from Tottenham for both players."], "granite3.1-dense:2b": ["Nottingham Forest has received an £8 million bid from Tottenham for defenders Andy Reid (22) and Michael Dawson (21).", "Previous attempts to sell these players, including an offer of £3 million plus two players to Southampton for Reid, were rejected.", "Tottenham had previously made undisclosed offers for both players but saw those bids declined by Forest.", "The club is now evaluating the new Tottenham proposal."]}