{"raw_text": "Real in talks over Gravesen move\n \n Real Madrid are closing in on a £2m deal for Everton's Thomas Gravesen after the Dane's agent travelled to Spain to hold talks about a move.\n \n John Sivabaek told BBC Sport: \"I'm here to listen to what Real have to say. Nothing has been agreed, but this is a big opportunity for any player.\" The 28-year-old's contract expires in the summer, but Real want a quick deal. Sivabaek added: \"I will be meeting Real on Wednesday. There is serious interest, but it is Everton's hands.\" Everton must decide whether to cash in now on the Denmark midfield man, or risk losing him for nothing in the summer. Manager David Moyes has defiantly claimed that he expects Gravesen to still be at Everton when the transfer window closes at the end of January.\n \n Moyes said: \"I speak to Tommy regularly and we know where we are at. \"There's been no contact. We don't want to lose him.\" Real Madrid general manager Arrigo Sacchi is the driving force behind the move, convincing vice-president Emilio Butragueno and new coach Wanderley Luxemburgo that Gravesen is the right man for the Bernabeu. Everton must weigh up whether it is worth taking the money on offer for Real and risk their own ambitions for European football. Gravesen has been outstanding as Everton have established themselves in the Premiership's top four this season.\n", "llama3.2:1b": ["Real Madrid are closing in on a deal to sign Thomas Gravesen from Everton with an £2m offer, according to his agent.", "The 28-year-old midfielder is set to leave Everton when his contract expires in the summer unless Real can secure him early.", "David Moyes claims he expects Gravesen to stay at Everton until January but wants to sell if possible to prioritize European football ambitions."], "llama3.2:3b": ["Real Madrid are closing in on a £2m deal for Thomas Gravesen, whose contract expires in the summer.", "The Dane's agent is holding talks with Real, while manager David Moyes claims to expect Gravesen to stay at Everton until January."], "gemma2:2b": ["Real Madrid are close to signing Thomas Gravesen from Everton for £2 million.", "Gravesen's agent traveled to Spain for talks, but a deal is not yet finalized.", "Everton must decide whether to sell Gravesen now or risk losing him for free in the summer.", "Real Madrid see Gravesen as a good fit for their team."], "qwen2.5:0.5b": ["Real Madrid are negotiating a £2m transfer to acquire Everton midfielder Thomas Gravesen, according to reports, with Danish agent John Sivabaek visiting Spain to discuss a move.", "Gravesen is coming off his contract at Liverpool and is currently on loan at Everton for the summer.", "Real Madrid general manager Arrigo Sacchi is backing him after his performance in the Premiership this season has been exceptional."], "qwen2.5:1.5b": ["Real Madrid close in on £2m deal to sign Thomas Gravesen from Everton, with interest growing stronger since agent visited Spain; 28-year-old midfielder on contract expiry next summer; manager David Moyes insists player will remain at club when transfer window closes in January despite claims of interest from other clubs."], "qwen2.5:3b": ["Real Madrid are close to signing Thomas Gravesen from Everton for a £2m deal after his agent traveled to Spain for talks.", "Gravesen, 28 and about to leave his contract, is under serious interest from Real but Everton must decide whether to cash in now or risk losing him for free at the end of the season.", "Manager David Moyes insists he will still have Gravesen at Everton by January's transfer deadline.", "Real Madrid's general manager Arrigo Sacchi is behind the move, convinced it's a fit for Bernabeu.", "Everton must balance taking the money on offer against their own ambitions in European football."], "opencoder:1.5b": ["Real Madrid are closing in on a £2m deal for Everton's Thomas Gravesen after the Dane's agent travelled to Spain to hold talks about a move.", "Real want a quick deal, but Everton must decide whether to cash in now on the Denmark midfield man or risk losing him for nothing in the summer.", "Moyes is speaking with Tommy regularly and we know where we are at.", "There has been no contact.", "Real Madrid general manager Arrigo Sacchi drives the move, convincing vice-president Emilio Butragueno and new coach Wanderley Luxemburgo that Gravesen is the right man for the Bernabeu.", "Everton must weigh up whether it is worth taking the money on offer for Real and risk their own ambitions for European football.", "Gravesen has been outstanding as Everton have established themselves in the Premiership's top four this season."], "smollm:1.7b": ["The summary of the text above should be:\n\nReal Madrid are closing in on a £2m deal for Everton's Thomas Gravesen after the Dane's agent travelled to Spain to hold talks about a move.", "John Sivabaek told BBC Sport: \"I'm here to listen to what Real have to say.", "Nothing has been agreed, but this is a big opportunity for any player.\"", "The 28-year-old's contract expires in the summer, but Real want a quick deal.", "Sivabaek added: \"I will be meeting Real on Wednesday.", "There is serious interest, but it is Everton's hands.\"", "The summary should preserve key ideas and details from the original text while omitting unnecessary information."], "deepseek-r1:1.5b": ["Real Madrid is considering a £2m deal for Thomas Gravesen from Everton.", "The agent has traveled to Spain to discuss the move.", "John Sivabaek from BBC Sport commented that nothing has been agreed but it's an opportunity for any player, mentioning Real's quick interest in signing.", "Sivabaek will meet them on Wednesday and highlighted serious interest.", "Everton must decide whether to secure Gravesen now or risk losing him for their summer window.", "Manager David Moyes expects Gravesen to stay until the transfer window closes.", "Real general manager Arrigo Sacchi convinced others that Gravesen is the right fit, aiming for European football.", "Everton's decision involves weighing the offer against potential ambitions in Europe."], "tinyllama:1.1b": ["Real Madrid have approached Everton over a potential move for Thomas Gravesen, who is contracted to expire in June.", "The midfielder has impressed this season for the Toffees, and there has been speculation about a deal for him.", "Real Madrid's agent, John Siabaek, has reportedly flown to Spain to hold talks with the club over the move.", "Everton is said to be keen on the player but must decide whether to let him leave or risk losing him for nothing in January.", "The Spanish giants have been pushing for a deal, but it remains to be seen if they can cash in now before the transfer window closes.", "Real Madrid boss David Moyes has hinted that he expects Gravesen to stay at Everton when the window opens at the end of January."], "tinydolphin:1.1b": [" Real Madrid have close to a £2 million deal for Everton's Thomas Gravesen, according to reports from BBC Sport.", "The Dane's agent, John Sivabaek, flew to Spain to hold discussions with Real over the transfer, and it appears as though the two parties are close to finalizing the agreement.", "The 28-year-old midfielder has a contract that expires in the summer, but Real seeks a quick deal in order to secure his services.", "Sivabaek added that there is serious interest from Everton in trading Gravesen for nothing, and he will meet with Real on Wednesday to finalize the deal.", "Everton must decide whether to cash-in now or risk losing Gravesen for nothing when the transfer window closes at the end of January.", "Manager David Moyes has expressed his belief that Gravesen is still an integral part of the team and will continue to be, stating that he expects the midfielder to still be at Goodison Park until the summer.", "Real Madrid general manager Arrigo Sacchi and coach Wanderley Luxemburgo are pushing for the deal, convinced that Graveson's talent is invaluable to the club.", "In the midst of this drama, Everton must weigh up their ambitions for European football and consider whether it is worth taking the cash to keep Gravesen at Goodison Park.", "However, if they cannot match Real Madrid's offer, they may risk losing him altogether."], "phi:2.7b": [" Thomas Gravesen's agent travelled to Spain to negotiate a £2m transfer deal with Real Madrid, but nothing has been agreed yet.", "The 28-year-old Dane will make his move before the end of January if all goes well.", "Everton must decide whether or not to take advantage of this opportunity as the transfer window closes at the end of next month.", "David Moyes believes that Gravesen will stay with Everton for the summer, despite there being interest from Real Madrid."], "orca-mini:3b": [" Real Madrid are close to signing Thomas Gravesen from Everton for £2m after his agent travelled to Spain for talks.", "Real want a quick deal, but Everton must decide whether to cash in now or risk losing him for nothing in the summer.", "Moyes has claimed that he expects Gravesen to still be at Everton when the transfer window closes."], "hermes3:3b": ["Real Madrid discussing $2m deal for Thomas Gravesen (Everton, midfielder) after agent talks."], "stablelm-zephyr:3b": ["Real Madrid is close to signing Everton's Thomas Gravesen for £2m, with negotiations ongoing.", "The 28-year-old Danish midfielder's contract expires in summer but Real wants a quick deal.", "Gravesen's agent, John Sivabaek, will meet with Real Madrid on Wednesday.", "Everton must decide whether to sell now or risk losing him for free in the summer.", "Manager David Moyes believes Gravesen will still be at the club when the transfer window closes on January 31st.", "Real Madrid's drive for Gravesen is supported by vice-president Emilio Butragueno and new coach Wanderley Luxemburgo."], "chatgpt-4o-latest": ["Real Madrid are close to signing Everton's Thomas Gravesen for £2m, with his agent John Sivabaek in Spain for talks.", "Gravesen's contract expires in the summer, but Real want a quick deal.", "Everton must decide whether to sell now or risk losing him for free.", "Manager David Moyes insists he expects Gravesen to stay, though Real's general manager Arrigo Sacchi is pushing for the move.", "Gravesen has been key to Everton's strong season, making the decision crucial for their European ambitions."], "stablelm2:1.6b": ["Real Madrid nears a £2 million deal for Thomas Gravesen from Everton after his agent held talks in Spain.", "The 30-year-old midfielder's contract expires at the end of the summer, but Real wants a quick deal.", "Gravesen has been outstanding for Everton as they establish themselves in the top four position this season.", "Everton must decide whether to accept the offer or risk losing him in the summer."], "granite3.1-dense:2b": ["Real Madrid is nearing a £2 million deal for Everton midfielder Thomas Gravesen, with his agent, John Sivabaek, meeting Real's general manager Arrigo Sacchi in Spain to discuss terms.", "Gravesen's contract expires in the summer, making him an attractive target for the Spanish club.", "However, Everton must decide whether to sell now or risk losing Gravesen free of charge when his contract ends.", "Manager David Moyes remains confident that Gravesen will remain with the team until the January transfer deadline.", "Real Madrid's decision-makers are convinced of Gravesen's value, and Everton must consider the potential impact on their own ambitions for European football."]}