{"raw_text": "FA probes crowd trouble\n \n The FA is to take action after trouble marred Wednesday's Carling Cup tie between Chelsea and West Ham.\n \n Police in riot gear were confronted by a section of the West Ham support after the match which the Blues won 1-0. Mateja Kezman, the scorer of Chelsea's goal, needed treatment on a head injury during the match after being hit by a missile, believed to be a coin. A spokeswoman for Chelsea said the club would await the referee's report before deciding on its course of action. Kezman was forced off the field to receive treatment on a cut above his eye but was able to continue.\n \n Chelsea assistant boss Steve Clarke said: \"I would rather talk about the football but we think it was something thrown from the crowd. He did not require stitches.\" West Ham boss Alan Pardew said: \"It's a shame because I thought there was good English banter in the crowd. \"There's big rivalry between the two clubs and it is a shame if that's happened. From where I was standing I didn't see any trouble.\" Former Hammers star Joe Cole also had a plastic bottle thrown at him, while Frank Lampard was pelted with coins as he was preparing to take a penalty. Lampard's spot-kick was saved to the delight of the Hammers' fans, who have still not forgiven him for leaving Upton Park. The FA will seek reports from the clubs and the police, and will review video evidence and the referee's report. Police in riot gear battled with West Ham fans in the Matthew Harding stand and at least one supporter required treatment. Fans are also thought to have clashed outside the ground after the game. Scotland Yard said there had been 11 arrests for alleged public order, drugs and offensive weapon offences.\n \n The FA is already looking into the trouble at Tuesday's heated Carling Cup tie between Millwall and Liverpool.\n", "llama3.2:1b": ["Here is a concise summary of the text:\n\nChelsea won a 1-0 match against West Ham on Wednesday, but were marred by crowd trouble after the game, including a reported coin thrown by an unknown source towards Chelsea player Mateja Kezman who suffered head injuries.", "The incident was deemed minor and Kezman continued to play.", "However, police were confronted with riot gear and fans clashed outside the ground before being dispersed.", "Three people (including one fan) are in hospital for treatment after being injured."], "llama3.2:3b": ["Chelsea beat West Ham 1-0 in a Carling Cup match marred by fan violence after Mateja Kezman was hit with a missile during the game.", "Several players, including Frank Lampard, were pelted with coins or had objects thrown at them.", "The FA will investigate and review evidence from reports, video footage, and police statements before deciding on action against West Ham and its fans."], "gemma2:2b": ["Trouble erupted at Wednesday's Chelsea vs. West Ham Carling Cup match, with missiles thrown from the crowd injuring players like Mateja Kezman.", "The FA will investigate reports from clubs and police, including video evidence, after a section of West Ham fans clashed with police in riot gear, leading to 11 arrests.", "The FA is also looking into similar incidents at Tuesday's Millwall vs. Liverpool match."], "qwen2.5:0.5b": ["Chelsea won 1-0 against West Ham and faced a crowd problem after the match.", "UEFA will investigate the incident with police and officials.", "Some fans clashed outside the ground, while some of Chelsea players were hit by coins.", "The FA is currently looking into the matter involving West Ham fans."], "qwen2.5:1.5b": ["The Football Association investigates a row over crowd disturbances following matches involving Chelsea, West Ham, and two other clubs."], "qwen2.5:3b": ["The Football Association will take action following disturbances during Wednesday's Carling Cup match between Chelsea and West Ham where a section of West Ham supporters threw objects like coins, leading to injuries.", "Mateja Kezman required medical attention for a head injury sustained from such an object.", "Both clubs will provide reports on the incident, with police in riot gear involved in clashes outside the venue.", "The FA is also investigating similar disturbances at a previous match between Millwall and Liverpool."], "opencoder:1.5b": ["The FA probes crowd trouble in the football match between Chelsea and West Ham on Wednesday.", "After a defeat by Blue, they engaged in a remarkable protest against the goal scored by the former England player, Mateja Kezman.", "The club has been awaiting the report from the referee for decision before proceeding with its course of action.", "The supporters have also clashed outside the stadium after the match."], "smollm:1.7b": ["The summary should be:\nThe FA takes action after trouble marred a Carling Cup match between Chelsea and West Ham.", "Police in riot gear were confronted by a section of the West Ham support after the match which the Blues won 1-0.", "Mateja Kezman, the scorer of Chelsea's goal, needed treatment on a head injury during the match after being hit by a missile believed to be a coin.", "A spokeswoman for Chelsea said the club would await the referee's report before deciding on its course of action.", "Kezman was forced off the field to receive treatment on a cut above his eye but was able to continue.", "The summary should preserve key ideas and details, including:\n- The FA takes action after trouble marred a Carling Cup match between Chelsea and West Ham.", "- Police in riot gear were confronted by a section of the West Ham support after the match which the Blues won 1-0.", "- Mateja Kezman, the scorer of Chelsea's goal, needed treatment on a head injury during the match after being hit by a missile believed to be a coin.", "- A spokeswoman for Chelsea said the club would await the referee's report before deciding on its course of action.", "- Kezman was forced off the field to receive treatment on a cut above his eye but was able to continue."], "deepseek-r1:1.5b": ["The English Football Association (FA) is investigating traffic at Wednesday's Chelsea vs. West Ham match, after a Chelsea goal was hit by a missile during the game.", "Chelsea will wait for the referee's report before deciding on their action, with Mateja Kezman needing treatment but continuing in the team.", "Alan Pardew and Steve Clarke disagree, with Pardew suggesting good English banter and Clarke saying it was thrown from the crowd.", "The FA is also investigating a 11-arrest case involving public order, drugs, and offensive weapons.", "Fans clashed outside after the match.", "The FA will review evidence and reports."], "tinyllama:1.1b": ["The Football Association (FA) has expressed concerns about crowd trouble after West Ham supporters threw coin-shaped objects and faced off against the Clarets during their match on Wednesday.", "The FA boss, Stuart Pearson, confirmed that \"there was a lot of incident and there's big rivalry between the two clubs\".", "West Ham assistant boss Steve Clark also criticized the crowd, stating, \"I'd rather talk about football, but we think it was something thrown from the crowd.\"", "Both Cole and Lampard were also hit by coin-shaped objects during their match.", "A West Ham spokesman stated that the FA will investigate the incident after the game, while a Liverpool spokesperson said that they would be \"reviewing video evidence and the referree's report\".", "The FA is considering punitive measures against fans who attacked players and the police in riot gear were also present at the match."], "tinydolphin:1.1b": [" A summary of the provided text includes: \"The Football Association (FA) is to take action after a troubling match between Chelsea and West Ham on Wednesday.\"", "The text also mentions that police in riot gear were confronted by fans at Stamford Bridge, where Chelsea won 1-0.", "The incident involved a coin, which led to Mateja Kezman getting injured.", "Chelsea manager Steve Clarke stated that he would prefer to discuss the situation with the referee first but acknowledged the issue was likely due to good English banter between fans.", "West Ham boss Alan Pardew also expressed his disappointment with the incident and mentioned a shameful incident from the crowd, while former Hammers player Joe Cole also got into trouble for throwing a plastic bottle at him.", "The FA has yet to officially identify the culprit or take any action in response to the disturbance.", "Additional details about police intervention and arrests were not included in this summary."], "phi:2.7b": [" The FA has stated that it will review video evidence and the referee's report after West Ham fans pelted Frank Lampard with coins during the match.", "Police were forced to intervene, resulting in several arrests for public order offences.", "The incident took place at Chelsea's Carling Cup match against West Ham.", "The Blues won 1-0, with Mateja Kezman scoring the winning goal but requiring treatment on a head injury after being hit by a coin believed to be a missile.", "A spokesperson for Chelsea said they would wait for the referee's report before taking any action."], "orca-mini:3b": [" The text reports on trouble during a Chelsea-West Ham match after a player was hit by a missile and needed treatment for a head injury.", "Police in riot gear faced off with West Ham fans, and at least one supporter required treatment.", "The FA is investigating the incident and will review video evidence and the referee's report."], "hermes3:3b": ["FA to investigate action after crowd disturbances during Chelsea-West Ham Carling Cup match."], "stablelm-zephyr:3b": ["The Football Association (FA) will take action following crowd trouble during Wednesday's Carling Cup match between Chelsea and West Ham.", "West Ham supporters confronted police in riot gear, resulting in injuries to Chelsea's Mateja Kezman and former Hammers player Joe Cole.", "West Ham manager Alan Pardew criticized the behavior of his fans and praised their potential for good English banter.", "The FA will review video evidence, the referee's report, and receive reports from the clubs and police.", "Scotland Yard reported 11 arrests for public order, drug, and offensive weapon offenses.", "The FA is also looking into trouble at Tuesday's match between Millwall and Liverpool."], "chatgpt-4o-latest": ["The FA will take action after crowd trouble marred Chelsea's 1-0 Carling Cup win over West Ham.", "Police in riot gear clashed with West Ham fans, and Chelsea's Mateja Kezman was injured by a thrown coin.", "Frank Lampard and Joe Cole were also targeted with objects from the crowd.", "West Ham manager Alan Pardew downplayed the incidents, while Chelsea's Steve Clarke confirmed Kezman did not need stitches.", "The FA will review reports from the clubs, police, and video evidence.", "Scotland Yard reported 11 arrests for public order, drugs, and weapon offences.", "The FA is also investigating trouble at the Millwall vs. Liverpool match."], "stablelm2:1.6b": ["The Football Association (FA) will investigate crowd trouble at a recent Carling Cup match between Chelsea and West Ham after multiple fans were injured by objects thrown from the stands.", "Chelsea's Mateja Kezman required treatment for a head injury, while other players like Frank Lampard and Joe Cole were also targeted with missiles.", "The FA is awaiting a report from the clubs and police before assessing video evidence and the referee's findings.", "There have been arrests for alleged offenses such as public order, drugs, and offensive weapons.", "A similar situation is being reviewed in another match between Millwall and Liverpool."], "granite3.1-dense:2b": ["FA intervention is required following crowd disturbances post-Chelsea vs West Ham (1-0 win for Chelsea) match.", "Police confronted West Ham fans, including those who threw objects at players like Mateja Kezman and Joe Cole.", "The FA will examine reports from both clubs and the police, along with video evidence and the referee's report.", "Eleven arrests were made for various offenses.", "This incident follows similar trouble at the previous day's Millwall vs Liverpool match."]}