{"raw_text": "Santini resigns as Spurs manager\n \n Tottenham manager Jacques Santini has resigned for \"personal reasons\".\n \n The former France manager moved to White Hart Lane this summer but now wants to return to France. Santini said: \"My time at Tottenham has been memorable and it is with deep regret that I take my leave. I wish the club and the supporters all the best. \"Private issues in my personal life have arisen which caused my decision. I very much hope that the wonderful fans will respect my decision.\" He added: \"I should like to thank (sporting director) Frank Arnesen and (chairman) Daniel Levy for their understanding.\" Assistant coach Martin Jol has been put in temporary charge and will take care of team affairs for Saturday's Premiership match against Charlton.\n \n Arnesen said the club were sad to see Santini go: \"We are obviously disappointed that Jacques is leaving us. We fully respect his decision. \"I can assure you that the club will act swiftly to minimise the impact of Jacques' departure. \"Our priority is to ensure that this season's performance remains unaffected by this move. \"I shall make a further statement on Monday, clarifying our position. We wish Jacques well.\"\n", "llama3.2:1b": ["Jacques Santini has resigned as Tottenham manager due to personal reasons and private issues in his life.", "He will remain in charge of the team until Saturday's Premiership match against Charlton, with assistant coach Martin Jol taking over temporary responsibilities."], "llama3.2:3b": ["Tottenham manager Jacques Santini has resigned due to private issues in his personal life and will return to France, citing memorable experience but deep regret for leaving the club.", "Assistant coach Martin Jol will take temporary charge for Saturday's match."], "gemma2:2b": ["Jacques Santini resigned as Tottenham manager for personal reasons.", "He expresses regret and hopes fans will respect his decision.", "Assistant coach Martin Jol will temporarily manage the team until Saturday's game.", "The club is disappointed but respects Santini's decision.", "They are focused on ensuring no disruption to the season."], "qwen2.5:0.5b": ["Former Spurs manager Jacques Santini resigned as the team's head coach due to personal reasons.", "He plans to return to France with Tottenham, but will take over from Frank Arnesen and Martin Jol temporarily.", "Arnesen expresses his disappointment at Santini's departure, while both he and Jol express their commitment to ensure the club's performance remains unaffected by this change."], "qwen2.5:1.5b": ["Santini resigns as Tottenham manager due to personal issues; Arnesen denies regret and commits to minimizing impact of departure.", "Assistant coach Jol will temporarily take over."], "qwen2.5:3b": ["Tottenham manager Jacques Santini has resigned for personal reasons.", "The former France coach, who took over in the summer, wants to return to France.", "Assistant coach Martin Jol has been put in temporary charge until Saturday's match against Charlton.", "Tottenham’s sporting director Frank Arnesen expressed disappointment but said they would act swiftly to minimize impact."], "opencoder:1.5b": ["Santini resigns as Spurs manager\n \nTottenham manager Jacques Santini has resigned for \"personal reasons\".", "The former France manager moved to White Hart Lane this summer but now wants to return to France.", "He said: \"My time at Tottenham has been memorable and it is with deep regret that I take my leave.", "I wish the club and the supporters all the best.\"", "Private issues in his personal life have caused him decision.", "He very much hope that the wonderful fans will respect his decision.", "He added: \"I should like to thank Frank Arnesen and Daniel Levy for their understanding.", "The director and chairman made sure that the decision was taken with due consideration.\""], "smollm:1.7b": ["Santini resigns as Spurs manager."], "deepseek-r1:1.5b": ["Spurs manager Jacques Santini has resigned from Tottenham due to personal reasons, following a move from France.", "He will return to France after what was initially planned but will take over temporarily until Saturday's Premiership game against Charlton.", "He expressed regret for his departure, hoping supporters would respect his decision and assured the team of swift action to mitigate the impact of his move.", "An assistant coach is handling team matters during his temporary tenure."], "tinyllama:1.1b": ["Tottenham manager Jacques Santiñ has resigned due to personal reasons.", "The former France manager has moved to White Hart Lane this summer but has now decided to return to France for health reasons.", "Santiñ has tendered his resignation, stating that he wishes the club and fans to respect it.", "He has been put in temporary charge for Saturday's Premier League match against Charlton.", "Arnesen has assured the club of their full support in finding a replacement for Santiñ.", "The club has been disappointed by his departure but are committed to ensuring the performance of this season is unaffected.", "A further statement will be released on Monday clarifying the position."], "tinydolphin:1.1b": [" Assistant coach Martin Jol has been appointed interim manager after the departure of Tottenham manager Jacques Santini for personal reasons.", "The club have expressed their understanding and respect for his decision, but the timing of his departure is currently not clear, as he remains in charge of the team."], "phi:2.7b": [" Tottenham manager Jacques Santini resigned for \"personal reasons\" and wishes the club and supporters all the best.", "Private issues in his personal life caused the decision.", "Martin Jol is now temporary coach and will manage team affairs for Saturday's Premiership match against Charlton.", "Frank Arnesen and Daniel Levy understand Santini's decision.", "The club will act swiftly to minimise the impact of Santini's resignation, with a priority on maintaining this season's performance.", "In one sentence: Tottenham's manager Jacques Santini resigns due to personal reasons, with Martin Jol taking temporary charge for Saturday's Premiership match against Charlton.", "The club and assistant coach Frank Arnesen will make further announcements on Monday."], "orca-mini:3b": [" Santini resigned as Tottenham manager due to personal reasons.", "He wants to return to France and cited private issues in his personal life as the reason for his decision.", "Assistant coach Martin Jol has been put in temporary charge and will take care of team affairs for Saturday's Premiership match against Charlton.", "The club was disappointed to see Santini go but respected his decision."], "hermes3:3b": [" Jacques Santini resigns as Tottenham Hotspur manager for personal reasons, with Santini wishing club success and fans understanding.", "Assistant coach Martin Jol takes temporary charge until replacement is found."], "stablelm-zephyr:3b": ["Tottenham manager Jacques Santini resigns for personal reasons and wishes the club and supporters well.", "His departure is due to private issues in his personal life.", "Assistant coach Martin Jol will take temporary charge for Saturday's match against Charlton.", "The club expresses disappointment but respects Santini's decision, and aims to minimize the impact of his departure."], "chatgpt-4o-latest": ["Tottenham manager Jacques Santini has resigned for personal reasons, citing private issues and a desire to return to France.", "He expressed gratitude to the club and its supporters, hoping they respect his decision.", "Assistant coach Martin Jol will take temporary charge for the upcoming match against Charlton.", "Sporting director Frank Arnesen acknowledged the disappointment but assured that the club would act swiftly to minimize the impact and maintain performance.", "Chairman Daniel Levy and Arnesen thanked Santini and wished him well, with further clarification expected on Monday."], "stablelm2:1.6b": ["Spurs manager Jacques Santini has resigned due to personal reasons, hoping the fans respect his decision.", "He wishes to return to France and wishes sporting director Frank Arnesen and chairman Daniel Levy understanding.", "Assistant coach Martin Jol will take temporary charge.", "The club is minimizing the impact of this move on the season's performance."], "granite3.1-dense:2b": ["Jacques Santini, Tottenham's newly appointed manager, has resigned due to personal reasons, citing private issues that necessitated his departure from France.", "Santini expressed regret for leaving the club and wished success to both the team and fans.", "Assistant coach Martin Jol will temporarily assume his duties until the end of the season.", "The club's sporting director, Frank Arnesen, announced that they respect Santini's decision and are committed to maintaining the team's performance throughout the remaining matches.", "A statement is expected from Arnesen on Monday to provide more details about the club's strategy following Santini's resignation."]}