{"raw_text": "Jansen suffers a further setback\n \n Blackburn striker Matt Jansen faces three weeks out after surgery to treat a cartilage problem.\n \n But central defender Lorenzo Amoruso is moving closer to fitness following a knee operation. Rovers' assistant manager Mark Bowen said: \"Matt had a small operation to trim knee cartilage. \"It's a tiny piece of work, which should be a fairly quick recovery. Lorenzo is also jogging for the first time, along with kicking a ball.\" Jansen's career has been dogged by injury since a freak scooter accident two years ago.\n \n He returned to first-team action soon after Mark Hughes' appointment as Blackburn boss and marked it with a goal against Portsmouth in his first appearance of the season. Bowen added: \"I'm guessing, but I reckon maybe two to three weeks before he is back in action completely.\" The Rovers assistant boss forecast a longer time spell for Amoruso's availability for first-team duties. Bowen said: \"There's still some scar tissue present so it will be some weeks. \"It's a case of see how he goes. You can't put a real time on a comeback, we'll see how he progresses.\"\n", "llama3.2:1b": ["Matt Jansen faces three weeks out after surgery for a cartilage problem, while Lorenzo Amoruso is moving closer to fitness following a knee operation and jogging/kicking a ball.", "Jansen has struggled with injuries since a scooter accident two years ago and returned to first-team action soon after Mark Hughes' appointment as Blackburn boss, but may need longer to recover from his latest injury."], "llama3.2:3b": ["Matt Jansen faces three weeks out after surgery to treat cartilage damage, while Lorenzo Amoruso moves closer to fitness following a knee operation, with Rovers' assistant manager Mark Bowen estimating two to three weeks before Jansen's return and several more weeks for Amoruso."], "gemma2:2b": ["Matt Jansen is out for 2-3 weeks with cartilage surgery.", "Lorenzo Amoruso is progressing after knee surgery and jogging.", "His return to first team action is still uncertain."], "qwen2.5:0.5b": ["Here is the summary in plain text format:\n\nMatt Jansen, Blackburn Rovers' central defender, has faced surgery to treat knee cartilage problems.", "Lorenzo Amoruso, the club's assistant manager, mentions that he is recovering from knee surgery.", "Jansen's career was affected by an accident two years ago and returned to first-team action soon after Mark Hughes became the team's new boss.", "The assistant manager predicts a longer time for Amoruso's availability on first-team duties as there is still some scar tissue present."], "qwen2.5:1.5b": ["Matt Jansen, Blackburn's striker, is out for three weeks due to surgery for cartilage treatment following a knee operation.", "Lorenzo Amoruso is expected to return to fitness soon after his own knee operation and has started jogging.", "Jansen's career was hampered by injury since an accident two years ago, with no clear timeline on when he will be fully fit again."], "qwen2.5:3b": ["Jansen faces three weeks recovery from knee surgery while Amoruso is progressing with jogging and kicking a ball after a minor knee operation, with an estimated two to three weeks before full fitness for Jansen and possibly longer for Amoruso.", "Jansen's career has been hindered by recurring injuries since 2018."], "opencoder:1.5b": ["Jansen suffers a further setback against cartilage operation after surgery to treat a cartilage problem.", "His central defender is moving closer towards fitness following a knee operation.", "Rovers' assistant manager Mark Bowen has mentioned that \"Matt had a small operation to trim knee cartilage\".", "Lorenzo Amoruso is also jogging along with kicking a ball.", "Jansen's injury started after the accident happened two years ago and he returned to action soon after hisappointment by Blackburn boss and marked it with a goal against Portsmouth in his first appearance of the season.", "The assistant manager has forecasted for an extended time period following Amoruso's availability for first-team duties.", "Bowen has explained that there is still some scar tissue present in Jansen's body suggesting further weeks."], "smollm:1.7b": ["Jansen suffers a further setback after surgery to treat a cartilage problem.", "But central defender Lorenzo Amoruso is moving closer to fitness following a knee operation.", "Rovers' assistant manager Mark Bowen said: \"Matt had a small operation to trim knee cartilage.", "It's a tiny piece of work, which should be a fairly quick recovery.\"", "Lorenzo is also jogging for the first time, along with kicking a ball.", "Jansen's career has been dogged by injury since a freak scooter accident two years ago.", "He returned to first-team action soon after Mark Hughes' appointment as Blackburn boss and marked it with a goal against Portsmouth in his first appearance of the season.", "Bowen added: \"I'm guessing, but I reckon maybe two to three weeks before he is back in action completely.\"", "The Rovers assistant boss forecast a longer time spell for Amoruso's availability for first-team duties.", "Bowen said: \"There's still some scar tissue present so it will be some weeks.", "You can't put a real time on a comeback, we'll see how he progresses.\""], "deepseek-r1:1.5b": ["Jansen has been struggling again due to a recent injury from a scooter accident two years ago.", "He has been out for three weeks and undergoing surgery.", "Amoruso, who had a minor operation, is starting to jog but hasn't played yet.", "Rovers are forecasting Amoruso may need additional time back in the team, while Jansen is expected to return sooner after Hughes took over as manager."], "tinyllama:1.1b": ["Blackburn Rovers assistant manager Mark Bowen reports that Matt Jansen will undergo surgery to repair cartilage damage in his knee, but the forward is expected to miss three weeks before regaining full fitness.", "Blackburn's assistant manager, Mark Bowen, also notes that Lorenzo Amoruso has started jogging and kicking a ball but will need time to recover from surgery.", "The Rovers assistant bosse expects Jansen to return to first-team action within two to three weeks, though there is still some scar tissue present, meaning it may be longer before he fully recovers."], "tinydolphin:1.1b": [" The Rovers assistant manager, Mark Bowen, has revealed that both Matt Jansen and Lorenzo Amoruso are nearing fitness after undergoing successful procedures to treat cartilage issues.", "Both players have been sidelined for considerable periods due to injuries sustained in accidents; however, with the recent appointment of Mark Hughes as Rovers' boss, they may be back in contention soon.", "Bowen has now forecasted that it might take two to three weeks for Jansen to fully recover from his surgery, while Amoruso will need a similar amount of time to regain match fitness."], "phi:2.7b": [" Blackburn striker Matt Jansen needs three weeks to recover from knee surgery, but central defender Lorenzo Amoruso is expected to return faster following his own knee operation.", "Jansen's career has been hampered by injuries since a scooter accident, while Amoruso's scar tissue will require more time to heal before he can play for the first time this season."], "orca-mini:3b": [" Matt Jansen faces three weeks out after surgery to treat a cartilage problem while central defender Lorenzo Amoruso is moving closer to fitness following a knee operation."], "hermes3:3b": [" Matt Jansen (Blackburn striker) expected to be out for 2-3 weeks after cartilage surgery.", "Lorenzo Amoruso (Rovers central defender), closer to fitness following knee operation but recovery timeframe uncertain."], "stablelm-zephyr:3b": ["Blackburn striker Matt Jansen faces a three-week absence due to cartilage surgery, while central defender Lorenzo Amoruso nears fitness after a knee operation.", "Assistant manager Mark Bowen provides updates on both players' recoveries, with Jansen expecting a quick return and Amoruso expected back in \"two to three weeks\" but with potential for longer recovery time."], "chatgpt-4o-latest": ["Blackburn striker Matt Jansen will be out for three weeks after undergoing minor knee cartilage surgery, though a quick recovery is expected.", "His career has been plagued by injuries since a scooter accident two years ago.", "Meanwhile, defender Lorenzo Amoruso is making progress after knee surgery, jogging and kicking a ball for the first time.", "Assistant manager Mark Bowen estimates Jansen could return in two to three weeks, while Amoruso's recovery remains uncertain due to lingering scar tissue."], "stablelm2:1.6b": ["Blackburn striker Matt Jansen is set to be sidelined for three weeks after undergoing surgery for a cartilage issue.", "Meanwhile, central defender Lorenzo Amoruso is moving closer to fitness following knee surgery, potentially returning within two to three weeks.", "Both players have endured injuries due to previous health issues, such as Jansen's scooter accident and Amoruso's scar tissue in his knee."], "granite3.1-dense:2b": ["Matt Jansen, Blackburn Rovers' striker, is out for approximately three to four weeks after undergoing surgery to address a minor knee cartilage issue.", "This setback further complicates his injury-prone career, which began two years ago due to a scooter accident.", "Despite this, Jansen recently returned to action following Mark Hughes' appointment as the manager, scoring in his first match.", "In contrast, Lorenzo Amoruso, a central defender, is making progress after knee surgery.", "He has started jogging and kicking a ball, though Rovers assistant manager Mark Bowen expects this to take several weeks before Amoruso can fully return to first-team play due to residual scar tissue from his operation."]}