{"raw_text": "Bristol City 2-1 Milton Keynes\n \n Leroy Lita took his goal tally to 13 for the season as his double earned City an LDV Vans Trophy win.\n \n The striker finished off Scott Murray cross from close range just seconds before half-time. Lita then made it 2-0 on 52 minutes, but Dons' substitute Serge Makofo then netted a great volley to make it 2-1. The visitors almost took the tie to extra time with a late 30-yard bullet from Richard Johnson which was well held by Steve Phillips.\n \n Phillips, Amankwaah, Coles, Hill, Fortune, Murray (Anyinsah 59), Doherty (Harley 45), Dinning, Bell, Lita (Cotterill 72), Gillespie. Subs Not Used: Orr, Brown.\n \n Hill.\n \n Lita 45, 52.\n \n Bevan, Oyedele, Ntimban-Zeh, Crooks, Puncheon, Kamara (Makofo 64), Chorley, Herve (McKoy 45), Tapp (Johnson 45), Mackie, Pacquette. Subs Not Used: Martin, Palmer.\n \n Pacquette, Chorley, Johnson, McKoy.\n \n Makofo 66.\n \n 3,367\n \n J Ross (Essex).\n", "llama3.2:1b": ["Bristol City scored twice in the first half, with Leroy Lita's goal and Scott Murray cross.", "Lita made his 13th goal of the season after a double for Bristol City.", "The visitors were close to winning at half-time but the equalizing volley by Serge Makofo was followed by a late penalty from Richard Johnson which was saved by Steve Phillips."], "llama3.2:3b": ["Bristol City won the LDV Vans Trophy by defeating Milton Keynes 2-1.", "Leroy Lita scored twice in the first half to give City a 2-0 lead before Serge Makofo's late volley reduced the deficit.", "Richard Johnson's long-range shot was saved by Steve Phillips, securing the win for Bristol City."], "gemma2:2b": ["Leroy Lita scored a double for Bristol City in their LDV Vans Trophy win over Milton Keynes.", "Lita's goals were the only difference after he capitalized on a Scott Murray cross just before half-time and then added another after 52 minutes.", "Despite a late shot from Richard Johnson, Steve Phillips kept the visitors at bay as they advanced to the next round."], "qwen2.5:0.5b": ["Bristol City scored twice in the first half to lift their league position above Milton Keynes by a comfortable 1 point.", "The goal was scored by Leroy Lita after being given a penalty for offside.", "Makofo then added another goal, making it 2-1 with time remaining in extra time.", "Charlie Hill finished his game for Bristol City with just four goals in the first half.", "The match was played on Saturday at the City Stadium in Bristol, England."], "qwen2.5:1.5b": ["Bristol City secured a LDV Vans Trophy win with two goals in the second half after a score of 2-1 against Milton Keynes.", "Leroy Lita scored twice, including on a close-range header from Scott Murray's cross just before halftime, then followed up with an own goal.", "The match ended with Milton Keynes substituting Serge Makofo netting at the expense of Bristol City."], "qwen2.5:3b": ["Leroy Lita scored twice for Bristol City, helping them win the LDV Vans Trophy over Milton Keynes with a final score of 2-1.", "His first goal came from Scott Murray's cross just before halftime, followed by an equalizer from substitute Serge Makofo in the second half.", "Richard Johnson had a late effort saved by Steve Phillips.", "Bristol City lineup: Hill, Cotterill, Lita (Cotterill 72), Doherty, Bell, Fortune, Murray, Gillespie; Milton Keynes team: Bevan, Oyedele, Ntimban-Zeh, Crooks, Puncheon, Kamara (Makofo 64), Chorley, Herve (McKoy 45), Tapp (Johnson 45), Mackie, Pacquette.", "Attendance was 3,367, with J Ross of Essex as the referee."], "opencoder:1.5b": ["The output would be a summary of the given text:\n\nBristol City 2-1 Milton Keynes\n\nLeroy Lita took his goal tally to 13 for the season as his double earned City an LDV Vans Trophy win.", "The striker finished off Scott Murray cross from close range just seconds before half-time.", "Lita then made it 2-0 on 52 minutes, but Dons' substitute Serge Makofo then netted a great volley to make it 2-1.", "The visitors almost took the tie to extra time with a late 30-yard bullet from Richard Johnson which was well held by Steve Phillips.", "The visitors finished off a close range finisher and scored a goal in 52 minutes, but Dons' substitute Serge Makofo made a great volley to make it 2-1.", "Lita also led the season with 13 goals, while Dons' substitute Serge Makofo earned a trophy win."], "smollm:1.7b": ["Bristol City 2-1 Milton Keynes"], "deepseek-r1:1.5b": ["Bristol City 2-1 Milton Keynes  \nLeroy Lita scored for Bristol City with a double against Scott Murray, earning them a trophy win.", "Lita scored again to tie at two goals on five minutes, then Makofo netted an impressive goal to make it 2-1.", "The match was tight in extra time with Richard Johnson's late 30-yard bullet held by Steve Phillips.", "Key players included Leroy Lita (scoring four and five goals), Serge Makofo, Hill goalkeeper, and substitutions from Orr, Brown, Amankwaah, Coles, Hill, Fortune, Murray (Anyinsah), Doherty (Harley), Dinning, Bell, and Lita.", "Makofo scored 66th goal for Bristol City with 3,367 possession minutes."], "tinyllama:1.1b": ["The Bristol City defeated Milton Keynes Dons in their LDV Trophee match by a score of 2-1 with two goals scored by Leroy Litta.", "The game ended with a lead of two goals to nil, but a late goal from Richard Johnson was well held by Steve Phillips.", "In the match, Amakunwa made a volleyed goal in the 52nd minute and the substitute Serge Makofo scored another goal in the 89th minute to seal the victory for the hosts.", "The visiting team's last attempt at extra time was blocked by Steve Phillips with a long-range shot.", "The match saw several substitutions and no goals from the visitors, who ultimately lost the match 2-1."], "tinydolphin:1.1b": [" Bristol City secured a hard-fought victory over Milton Keynes Dons with a dominant 2-1 win in the LDV Vans Trophy.", "The game was marked by two fantastic goals from Leroy Lita, who put his team ahead and then sealed the victory for Bristol City with a well-taken second goal just before halftime.", "The match took place at Ashton Gate and saw an impressive performance from both teams.", "Lita's first goal came in the fourth minute, after he was fouled by Richard Johnson.", "He calmly slotted the ball past Dons' goalkeeper Steve Phillips, making it 1-0 for Bristol City.", "The second goal of the game went to the visitors as Serge Makofo scored a great volley from just outside the area.", "It was well-saved by Milton Keynes' goalkeeper, Steve Phillips, but his save did not deter Lita who netted the rebound to make it 2-0 for Bristol City.", "The home side almost sealed an extra-time victory in the 72nd minute when Richard Johnson's shot was blocked by Bristol City's goalkeeper, Steve Phillips.", "But Bristol City held on and claimed a well-deserved victory in this LDV Vans Trophy match.", "The official attendance for the game was 3,367 spectators who supported their local team."], "phi:2.7b": [" Leroy Lita scored two goals to help Bristol City win the LDV Vans Trophy 2-1 in a match against Milton Keynes Dons, with Richard Johnson and Serge Makofo also on target for their teams.", "Bristol City eventually won 3-2 after a late penalty from Johnson.", "Leroy Lita was the top scorer with 13 goals for City."], "orca-mini:3b": [" The text reports on a game between Bristol City and Milton Keynes in the LDV Vans Trophy, with Bristol winning 2-1.", "Lita scored twice for the visitors, with Hill and Makofo scoring for MK Dons in response.", "Johnson's goal was almost a late winner, but the hosts held on to earn a point."], "hermes3:3b": ["Bristol City v Milton Keys Dons (2-1)\nLita scores double; Lita(45',52'), Makofo(66')"], "stablelm-zephyr:3b": ["Bristol City won the LDV Vans Trophy against Milton Keynes 2-1, with Leroy Lita scoring 13 goals for the season.", "Scott Murray scored close range just before half-time, and Lita made it 2-0 on 52 minutes.", "Dons' substitute Serge Makofo netted a great volley to make it 2-1.", "Steve Phillips held a late 30-yard bullet from Richard Johnson.", "Bristol City's team was composed of Phillips, Amankwaah, Coles, Hill, Fortune, Murray (Anyinsah 59), Doherty (Harley 45), Dinning, Bell, Lita (Cotterill 72), and Gillespie."], "chatgpt-4o-latest": ["Leroy Lita scored twice to secure Bristol City a 2-1 victory over Milton Keynes in the LDV Vans Trophy.", "Lita netted just before half-time and added a second in the 52nd minute.", "Milton Keynes' substitute Serge Makofo responded with a volley in the 66th minute.", "A late 30-yard strike from Richard Johnson was well saved by City's goalkeeper Steve Phillips, preventing extra time."], "stablelm2:1.6b": ["Bristol City won 2-1 against Milton Keynes after goals from Leroy Lita and a late equalizer by Serge Makofo.", "Lita's double helped the team secure an LDV Vans Trophy victory.", "A great volley by Makofo made it 2-1 before Dons substitute Serge Makofo scored an impressive goal to make it 2-2.", "In the second half, Johnson nearly scored a late goal for MK but was held by Steve Phillips."], "granite3.1-dense:2b": ["Bristol City defeated Milton Keynes in the LDV Vans Trophy, 2-1.", "Leroy Lita scored twice for Bristol City: once just before halftime and another midway through the second half.", "Serge Makofo, a substitute, scored a volley for Milton Keynes, making it 2-1.", "In the final moments of the match, Richard Johnson's long shot was saved by Bristol City goalkeeper Steve Phillips, preventing extra time.", "Key players for Bristol City included Lita (45', 52'), Fortune, Doherty, and Gillespie.", "Milton Keynes' goals were scored by Makofo (66').", "The game took place at J Ross Stadium in Essex with a crowd of 3,367 spectators."]}