{"raw_text": "Hereford 1-1 Doncaster\n \n Hereford win 3-1 on penalties.\n \n Rovers took the lead on 59 minutes as Michael McIndoe's corner found Adriano Rigoglioso, whose stunning volley soared into the top right of the net. Danny Williams equalised for the hosts after 72 minutes with a crisp finish from just insist the penalty box. McIndoe saw an extra-time penalty saved, giving Mills the chance to net the winning penalty.\n \n Mawson, Travis, Mkandawire, James, Robinson, Daniel Williams, Stanley, Hyde (Pitman 105), Purdie (Mills 83), Brown, Stansfield (Green 102). Subs Not Used: Smith, Scott.\n \n James.\n \n Daniel Williams 72.\n \n Ingham, Mulligan, Fenton, Morley, Priet (Ryan 79), McIndoe, Ravenhill (Price 90), Rigoglioso, Tierney (Jackson 79), Beardsley, Coppinger. Subs Not Used: Warrington, Maloney.\n \n Rigoglioso 59.\n \n 1,375\n \n T Parkes (W Midlands).\n", "llama3.2:1b": ["Hereford won 3-1 on penalties after a scoreless tie with Doncaster in the FA Cup quarterfinal match."], "llama3.2:3b": ["Hereford won 3-1 on penalties against Doncaster after the match ended 1-1 after extra time, with Adriano Rigoglioso scoring in the 59th minute and Danny Williams equalizing in the 72nd.", "Michael McIndoe scored a crucial penalty for Doncaster before being saved, allowing Mills to seal victory."], "gemma2:2b": ["Hereford defeated Doncaster 1-1 after a penalty shootout with a score of 3-1.", "Rigoglioso opened the scoring for Rovers while Danny Williams equalized for Hereford.", "After extra time, Mills scored the winning penalty."], "qwen2.5:0.5b": ["Hereford won 3-1 at Doncaster in penalty shootouts with Rovers winning after extra-time.", "Hereford scored on 59 minutes from a corner by Adriano Rigoglioso and Danny Williams equalised for the hosts.", "Mawson, Travis, Mkandawire, James, Robinson, Daniel Williams, Stanley, Hyde (Pitman 105), Purdie (Mills 83), Brown, Stansfield (Green 102)."], "qwen2.5:1.5b": ["Hereford defeated Doncaster 3-1 in a penalty shootout after a 1-1 draw in extra time.", "Michael McIndoe's equalizer and James Purdie's winning penalty sealed the victory for Hereford."], "qwen2.5:3b": ["Hereford defeated Doncaster 1-1 after a penalty shootout, with Michael McIndoe's corner giving Adriano Rigoglioso the opening goal.", "Danny Williams equalized for Doncaster in extra time.", "Hereford's Mills scored from the spot to win on penalties.", "Hereford lineup: Mawson, Travis, Mkandawire, James, Robinson, Daniel Williams, Stanley, Hyde, Purdie (Mills 83), Brown, Stansfield (Green 102).", "Doncaster lineup: Ingham, Mulligan, Fenton, Morley, Priet (Ryan 79), McIndoe, Ravenhill (Price 90), Rigoglioso, Tierney (Jackson 79), Beardsley, Coppinger.", "Not used: Smith, Scott.", "Rigoglioso scored in the 59th minute.", "Attendance 1,375 at T-Parkes (W Midlands)."], "opencoder:1.5b": ["The Hereford win against Doncaster on penalties highlights a remarkable performance by Michael McIndoe that took the lead on 59 minutes and finished in 72 minutes.", "The hosts, who scored an extra-time penalty at Mill, equalled for Danny Williams with a clear finish from the penalty box.", "McIndoe saw the chance to save the winning penalty, giving Mills the chance to net the penalty and gain the win.", "The match between The Hereford and Doncaster features a mix of forward and defense players, some of whom have scored goals during the match.", "Some of the key players include Travis Mawson, Mkandawire James, Daniel Williams, Robby Ingham, Mulligan Fenton, Morley Priet, McIndoe Ravenhill, Rigoglioso, Tierney Jackson, Beardsley and Coppinger.", "The match also includes subbing as specified (Smith, Scott), and no substitutes have been used.", "The match's results total 13775 points, representing a remarkable performance by some of the key players during the match."], "smollm:1.7b": ["Hereford won 3-1 on penalties."], "deepseek-r1:1.5b": ["Hereford 1-1 Doncaster  \nHereford won 3-1 on penalties.", "Rovers led with Michael McIndoe scoring a stunning volley by Adriano Rigoglioso in the top right corner.", "Millward equalised for the hosts after a penalty save from Danny Williams.", "The match ended in an extra-time deadlock, which Millward tied up with a winning penalty.", "Mawson scored 72 points, Mills had 83 points.", "T Parkes (W Midlands) won the game against Hereford and Doncaster in the 1-0 final."], "tinyllama:1.1b": ["Hereford vs Doncaster Rovers: A thrilling penalty shootout ends with the visitors winning on penalties after a tense and tight match.", "The match was filled with intense pressure from both sides, as Both teams had chances to score in regulation time.", "Doncaster took the lead on 59 minutes thanks to a corner by Michael McIndoe, who headed the ball into the top right corner of the net.", "However, Hereford's striker Adriano Rigolegioo saved Milltown's chance from going in, and this led to an extra time penalty shootout.", "In the end, Doncaster won on penalties after Daniel Williams scored the winning penalty against James and the visitors netted their penalties.", "Both teams had chances to score but in the end, a thrilling match ended with Hereford emerging victorious thanks to their extra time heroics."], "tinydolphin:1.1b": [" Please provide the full text for the given summary, including key points and details from the given text, with explanations for any unfamiliar terms or concepts."], "phi:2.7b": [" Hereford won the match 3-1 on penalties against Doncaster after a goalless first 90 minutes.", "Michael McIndoe's corner found Adriano Rigoglio who scored the first goal for Hereford with a stunning volley.", "Danny Williams equalized for Rovers, but Mills scored the winning penalty in extra time.", "The full lineup of players was James."], "orca-mini:3b": [" Hereford won 3-1 on penalties against Doncaster."], "hermes3:3b": [" Soccer match result:\n Hereford and Doncaster drawn 1-1\n Hereford won 3-1 on penalties\n Hereford's scoring players: Rigoglioso (59'), Daniel Williams (72') (penalty)\n No additional player numbers or details provided."], "stablelm-zephyr:3b": ["In a closely contested game, Hereford claimed victory with three penalty goals, defeating Doncaster 3-1.", "Doncaster took the lead in the 59th minute through Adriano Rigoglioso's volley, which was equalized by Danny Williams 72 minutes later.", "Mills scored the winning penalty during extra time.", "The match featured substitutions for both teams and multiple goal attempts throughout the game."], "chatgpt-4o-latest": ["Hereford and Doncaster drew 1-1, but Hereford won 3-1 on penalties.", "Doncaster took the lead in the 59th minute through Adriano Rigoglioso's volley from a Michael McIndoe corner.", "Hereford equalized in the 72nd minute with Danny Williams' finish from just inside the penalty box.", "McIndoe missed an extra-time penalty, allowing Mills to score the decisive penalty in the shootout.", "The match was attended by 1,375 spectators and officiated by T Parkes from the West Midlands."], "stablelm2:1.6b": ["Hereford and Doncaster tied 1-1 after extra time on penalties.", "Hereford wins 3-1 in the penalty shootout.", "Rovers took the lead with a stunning volley by Adriano Rigoglioso.", "Danny Williams equalized for hosts in the 15th minute, and McIndoe's save led to the winning penalty for Mills.", "Notable names like Mawson, Travis, Mkandawire, James, Robinson, Daniel Williams, Stanley, Hyde, Pitman, Purdie, Brown, Stansfield (Green), Smith, Scott, Warrington, and Maloney were substituted in or out."], "granite3.1-dense:2b": ["In a closely contested match at T Parkes Stadium in the West Midlands, Hereford secured a 3-1 victory over Doncaster on penalties following a 1-0 deficit.", "Adriano Rigoglioso's impressive volley in the 59th minute put Doncaster ahead.", "Danny Williams equalized for Hereford with a well-taken goal in the 72nd minute.", "Despite Michael McIndoe saving an extra-time penalty, Hereford's Mills scored the winning penalty.", "The match saw 1,375 spectators and featured lineups of 11 players each, with several substitutions made during the game."]}