{"raw_text": "Wolves appoint Hoddle as manager\n \n Glenn Hoddle has been unveiled as the new Wolves manager.\n \n The ex-England coach has been given a six-month contract to succeed Dave Jones, who was sacked after the club's poor start to the season. Wolves chairman Rick Hayward said: \"We're delighted Glenn is here. He has a six-month contract so we can test each other out and see if it works.\" Hoddle, who will work alongside Stuart Gray, has been out of the game since he was sacked by Spurs in 2003. Gray, who has been caretaker manager, was assistant boss when Hoddle was manager at Southampton. \"I'm delighted to be here,\" said Hoddle.\n \n \"I saw the massive potential that Wolves have got and their desire and amibition to get back into the Premiership parallels my ambitions. \"Stuart Gray has done a fantastic job as caretaker manager. We've worked together at Southampton and I'm delighted to be back with him.\" Wolves chief executive Jez Moxey defended the decision to give Hoddle a short-term contract. \"We hope it will work out for both parties and we extend it for the long term,\" he said. \"Most managers want a four-year contract and then expect it to be paid off if it doesn't work out. \"For somebody of Glenn's calibre to come in on a short-term contract and put his reputation on the line, it demonstrates his commitment and self-belief and the potential he thinks is here.\" Hayward revealed that Hoddle was one of the first to be approached after Jones' departure. \"He was not available at the time because he was looking at various other things,\" he explained. \"Five weeks later we're back on track and this a tremendous opportunity for Wolves.\"\n \n Hoddle began his managerial career as player-boss with Swindon before moving on to Chelsea and then taking up the England job. His spell in charge of the national side came to an end after the 1998 World Cup when he made controversial remarks about the disabled in a newspaper interview. The 47-year-old later returned to management with Southampton, where he again succeeded Jones - as he has now done at Wolves. He engineered an upturn in Saints' fortunes before being lured to White Hart Lane by Tottenham - the club where he made his name as a player. That relationship turned sour at the start of the last campaign and he left the London club early last season. Since then he has applied unsuccessfully for the post of France manager and had also been linked with a return to Southampton. Wolves are currently 17th in the Championship and have a home game against Millwall on Tuesday.\n", "llama3.2:1b": ["Glenn Hoddle, an ex-England coach, has been appointed as Wolves' new manager after Dave Jones was sacked.", "Hoddle will work alongside Stuart Gray and has taken on a six-month contract to test his management abilities with the club.", "The chairman of Wolves is pleased that Hoddle joined, citing potential for improvement in the team's performance.", "The 47-year-old coach, who previously managed Southampton, returned to Wolves after initially declining the offer due to concerns about short-term contracts."], "llama3.2:3b": ["Glenn Hoddle appointed as Wolves manager on six-month contract, succeeding Dave Jones.", "Hoddle will work alongside Stuart Gray and has a short-term deal that could be extended if successful."], "gemma2:2b": ["Glenn Hoddle is the new manager of Wolverhampton Wanderers after Dave Jones was sacked.", "His six-month contract will allow for testing his capabilities before potentially extending it long term.", "Hoddle has previously managed at Southampton, Chelsea, and England.", "He worked with assistant Stuart Gray at Southampton and expressed excitement about the potential of Wolves to return to the Premier League.", "The club sees this short-term appointment as a demonstration of Hoddle's self-belief and commitment."], "qwen2.5:0.5b": ["Glenn Hoddle is appointed as the new manager of Wolves, replacing Dave Jones who was sacked after their poor start to the season.", "Hoddle will work alongside Stuart Gray at the club, with Hoddle having previously been the caretaker manager at Southampton and Grey being a former assistant manager at Wolves."], "qwen2.5:1.5b": ["Wolves appointed former England coach Glenn Hoddle as manager, replacing Dave Jones who was sacked after poor start to season.", "Hoddle had been caretaker since being sacked by Spurs in 2003.", "Wolves chairman praises Hoddle's potential and ability to fit into team culture while defending short-term contract decision."], "qwen2.5:3b": ["Glenn Hoddle has been appointed as new Wolves manager following Dave Jones' sacking due to poor season performance.", "Hoddle, an ex-England coach, will work alongside caretaker manager Stuart Gray.", "He was given a six-month contract and expressed excitement about working with Wolves.", "Chairman Rick Hayward praised the short-term deal's potential benefits.", "Hoddle had previously worked under Gray at Southampton before joining England national team where he clashed with club owners.", "The 47-year-old is currently in his second managerial role at Wolves, who are 17th in Championship and face Millwall on Tuesday."], "opencoder:1.5b": ["Wolves appoint Hoddle as manager.", "Glenn Hoddle has been unveiled as the new Wolves manager.", "The ex-England coach has been given a six-month contract to succeed Dave Jones, who was sacked after the club's poor start to the season.", "Rick Hayward said: \"We're delighted Glenn is here.", "He has a six-month contract so we can test each other out and see if it works.\"", "Hoddle, who will work alongside Stuart Gray, has been out of the game since he was sacked by Spurs in 2003.", "Gray, who has been caretaker manager, was assistant boss when Hoddle was manager at Southampton.", "\"We're delighted to be here,\" said Hoddle.", "\"Let's see if it works for both parties and we extend it for the long term,\" he said.", "\"Most managers want a four-year contract and then expect it to be paid off if it doesn't work out.\"", "Jez Moxey defended the decision to give Hoddle a short-term contract.", "\"We hope it will work out for both parties and we extend it for the long term,\" he said.", "Hoddle began his managerial career as player-boss with Swindon before moving on to Chelsea and then taking up the England job.", "His spell in charge of the national side came to an end after the 1998 World Cup when he made controversial remarks about the disabled in a newspaper interview.", "The 47-year-old later returned to management with Southampton, where he has now done at Wolves.", "He engineered an upturn in Saints' fortunes before being lured to White Hart Lane by Tottenham - the club where he made his name as a player.", "That relationship turned sour at the start of the last campaign and he left the London club early last season.", "Since then he has applied unsuccessfully for the post of France manager and had also been linked with a return to Southampton.", "Wolves are currently 17th in the Championship and have a home game against Millwall on Tuesday."], "smollm:1.7b": ["Wolves appoint Glenn Hoddle as manager"], "deepseek-r1:1.5b": ["Glenn Hoddle has been appointed as the new Wolves manager after Dave Jones was fired.", "He will hold a six-month contract with Gray alongside Stuart Gray, who previously managed the club at Tottenham.", "Hoddle's long-term plans include engineering improvements for their football and testing management against each other.", "He made controversial remarks about disabled players during a newspaper interview in 1998.", "His successful return to management with Southampton has been pivotal, as well as his role with Tottenham earlier in his career.", "He attempted an attempt at French management but failed.", "Wolves are currently ranked 17th in the Championship and will face Millwall on Tuesday."], "tinyllama:1.1b": ["Wolverhampton Wanderers have appointed ex-England coach Glen Hoddle as their new manager, following the dismissal of former caretaker boss Stuart Gray at the end of last season's disastrous campaign in which they finished 17th in the Championship.", "The club's chairman Rick Hayward praised HoDDLE for his \"massive potential\" and \"ambition to get back into the Premier League\".", "Wolves are currently 17th in the table, but are unbeaten at home this season with nine wins and just one defeat (a 3-2 loss to Derby County).", "The appointment of HoDDLE represents a significant coup for Wolves, who have been without a permanent manager since Dave Jones was relieved of his duties after the start of last season's campaign."], "tinydolphin:1.1b": [" The appointment of Glenn Hoddle as the new Wolverhampton Wanderers manager is an important step for the club, which has been struggling this season.", "Hoddle comes with a proven track record in management, having held previous roles at Southampton and Chelsea.", "As a player-coach, he led the England team to victory during the 1998 World Cup.", "However, his decision not to take on the same role at Wolves may have been influenced by his past controversies.", "The club has also expressed its confidence in Hoddle's ability to turn things around and return to the top of the table."], "phi:2.7b": [" Glenn Hoddle, former England coach, has been announced as the new Wolves manager.", "He will work under Stuart Gray and has a six-month contract.", "Hoddle left the game after being sacked by Spurs in 2003 but was out of the game for two years.", "Gray, who was assistant to Hoddle at Southampton, has done a fantastic job as caretaker manager.", "Hoddle is excited to be back with his former teammate and is committed to getting Wolves back into the Premiership.", "The move shows Hoddle's self-belief and potential, and the club hopes it will work out for both parties.", "The decision to give Hoddle a short-term contract reflects his ambition and willingness to take risks.", "Wolves chairman Rick Hayward believes that this is a tremendous opportunity for the new manager."], "orca-mini:3b": [" Wolves appoint Glenn Hoddle as their new manager, after sacking Dave Jones following a poor start to the season.", "Hoddle will be given a six-month contract and will work alongside Stuart Gray.", "The ex-England coach was approached by Wolves after Jones' departure and is confident in his abilities as a manager."], "hermes3:3b": ["G Hoddle appointed as Wolves manager; 6-mth contract, following Dave Jones' sacking."], "stablelm-zephyr:3b": ["Glenn Hoddle has been appointed as the new manager of Wolves, replacing Dave Jones who was sacked due to the team's poor start to the season.", "Hoddle, a former England coach, will work with Stuart Gray and has been given a six-month contract for testing purposes.", "The club's chief executive Jez Moxey defended the short-term contract, saying it demonstrates Hoddle's commitment and self-belief.", "Wolves are currently 17th in the Championship."], "chatgpt-4o-latest": ["Glenn Hoddle has been appointed as the new Wolves manager on a six-month contract, replacing Dave Jones after the club's poor start to the season.", "Wolves chairman Rick Hayward expressed optimism about the arrangement, while Hoddle, who last managed Spurs in 2003, highlighted Wolves' potential and ambition.", "He will work alongside Stuart Gray, who previously assisted him at Southampton.", "Wolves chief executive Jez Moxey defended the short-term contract, emphasizing Hoddle's commitment.", "Hoddle, who has managed Swindon, Chelsea, England, Southampton, and Tottenham, was initially unavailable when first approached but later accepted the role.", "Wolves are currently 17th in the Championship and face Millwall next."], "stablelm2:1.6b": ["Glenn Hoddle is named as the new Wolves manager, succeeding Dave Jones after the club's poor start to the season.", "Hoddle has a six-month contract to evaluate his potential with fellow assistant Stuart Gray.", "Housed with CEO Jez Moxey, Hoddle began his managerial career as a player-boss with Swindon before moving on to Chelsea and England.", "He has succeeded Jones at Southampton and engineered an upturn in their fortunes before leaving Tottenham.", "The text discusses the appointment of Hoddle, the reasons behind it, and how Wolves are currently performing in the Championship."], "granite3.1-dense:2b": ["Glenn Hoddle, a former England coach and player-manager, has been appointed as Wolves' interim manager for six months following Dave Jones' dismissal due to the team's poor performance this season.", "Hoddle, 47, previously managed Southampton, where he had a successful tenure before joining Tottenham and later France's national team.", "He left those positions after controversial remarks about the disabled in an interview.", "Now back with Wolves, Hoddle expressed his excitement about the club's potential to return to the Premier League and praised caretaker manager Stuart Gray for his work during Jones' absence.", "The move aims to assess the fit of Hoddle within the team before considering a longer-term contract extension.", "Wolves, currently 17th in the Championship, face Millwall on Tuesday."]}