{"raw_text": "FA charges Liverpool and Millwall\n \n Liverpool and Millwall have been charged by the Football Association over crowd trouble during their Carling Cup match on 26 October.\n \n Millwall, who lost the match 3-0, have also been charged over alleged racist behaviour by their supporters. During the match at Millwall's new Den Stadium, seats were ripped up and four people were ejected from the ground. A disabled fan was injured at the perimeter of the pitch and riot police were needed to control the situation. Liverpool fans claimed the trouble was sparked by chants about the Hillsborough disaster, where 96 supporters were crushed to death in April 1989. But Lions chairman Theo Paphitis has denied the claims. He has said CCTV footage showed the catalyst for the trouble was a Liverpool fan attacking a Millwall fan in the west stand. However, Millwall have been charged with two breaches of FA rules. They have been charged with failing to ensure that fans refrained from racist and/or abusive behaviour and for failing to prevent spectators throwing missiles onto the pitch. Liverpool have been charged with one breach for failing to prevent their fans conducting themselves in threatening and/or violent and/or provocative behaviour. Both clubs have until 23 December to respond.\n", "llama3.2:1b": ["Liverpool and Millwall have been charged by the FA over crowd trouble during a Carling Cup match on October 26, including alleged racist behavior from Millwall's supporters and disruption of police control at one end of the pitch."], "llama3.2:3b": ["Liverpool and Millwall have been charged by the FA over crowd trouble during a Carling Cup match on October 26.", "Millwall has been charged with two breaches, including racist behavior and throwing missiles onto the pitch.", "Liverpool has been charged with one breach for violent and provocative behavior.", "The charges stem from incidents including injured fans, ejections, and riot police involvement."], "gemma2:2b": ["Liverpool and Millwall have been charged by the Football Association for crowd trouble during their Carling Cup match on October 26th.", "Liverpool has been charged with one breach for failing to prevent fans' threatening or violent behavior, while Millwall has been charged with two breaches for failing to ensure fans refrained from racist and/or abusive behavior and for allowing spectators to throw missiles onto the pitch.", "Both clubs have until December 23rd to respond."], "qwen2.5:0.5b": ["The Football Association (FA) has been investigating crowd trouble at Liverpool and Millwall's Carling Cup match on 26 October, while the league club were also charged with alleged racist behavior.", "The fans ejected from the Den Stadium during the match at Millwall are believed to have attacked supporters in the west stand.", "The incident is seen as a catalyst for the league's troubles."], "qwen2.5:1.5b": ["Liverpool and Millwall have been fined by the Football Association after a match involving crowd trouble and alleged racist behavior during a Carling Cup game on October 26, where Liverpool won 3-0 but fans clashed with those from Millwall at their new stadium, leading to injuries and police intervention.", "Both clubs were charged with breaching FA rules regarding racist and abusive fan behavior."], "qwen2.5:3b": ["FA has charged both Liverpool and Millwall over crowd trouble during their Carling Cup match on 26 October, where four people were ejected and a disabled fan was injured.", "Millwall faces charges for alleged racist behavior and failure to control the crowd, while Liverpool is accused of failing to prevent threatening and violent behavior from fans.", "Both clubs have until December 23rd to respond."], "opencoder:1.5b": ["Liverpool and Millwall, two prominent football clubs, have been charged over alleged threats to football culture and behaviour during a match at Carling Cup, a London-based football competition.", "During the match, Liverpool and Millwall faced a crowd-stricken situation that left supporters torn between the defeat and the victory.", "It occurred on 26 October in their home city, Liverpool.", "A group of supporters were thrown up by fans who attacked and defamed each other.", "The attack also sparked chants about the Hillsborough disaster in April 1989, where supporters were crushed into pieces.", "The match culminated with Millwall, a former English football player who lost 3-0 to Liverpool, being charged over alleged racially aggressive behaviour during the match.", "The match was hosted at Millwall's new Den Stadium, where several seating areas were taken up by riot officers and spectators were thrown from around the pitch.", "A disabled fan was also injured, and Liverpool fans grappled with the situation in a manner that they attacked and defamed others.", "It is important to note that during their match they also engaged in provocative behaviour against fans who had been subjected to the same tactics.", "Liverpool fans have alleged that the trouble was sparked by fan appeals that were not attended to, CCTV footage showing supporters clashing between their lines, and other incidents.", "But fans' personal attacks on fans, a practice known as 'battling with the crowd', and accusations of bullying are not inconsistent with the claims made about the match.", "Liverpool and Millwall have until 23 December to file pleas to appear before the Corporation's Crime and Sentencing Squad for their actions, and to take any legal action against them."], "smollm:1.7b": ["The FA has charged Liverpool and Millwall with two breaches of FA rules, one breach of FA rules over racist and/or abusive behaviour by Millwall fans and the other breach of FA rules over failing to prevent spectators throwing missiles onto the pitch.", "Both clubs have until 23 December to respond to these charges."], "deepseek-r1:1.5b": ["FA Charges Identified in Football Match  \n\nThe Football Association has charged Millwall with being accused of racist behavior by their supporters during a Carling Cup match on 26 October.", "The incident involved a loss to Liverpool (3-0).", "Seating was ripped up, four people ejected, a disabled fan injured, and riot police were needed.", "Liverpool fans claimed the trouble was due to chants about the Hillsborough disaster from April 1989, but Millwall chairman Theo Paphitis denies these claims and attributes the issue to a previous attack at Millwall's west stand.", "Both clubs were charged for failing to prevent racist behavior by supporters.", "Liverpool was also accused of failing to prevent threatening behavior by their own fans.", "The matches are set to conclude by 23 December."], "tinyllama:1.1b": ["Liverpool and Millwall have been charged by the FA over crowd trouble during a Carlings Cup match on 26 October.", "The FA has also charged Millwall for alleged racist behavior, with two incidents of abuse directed at spectators being attributed to fans who were tackled outside the stadium.", "The Liverpool supporters' club (LSC) have claimed that the trouble was caused by chanting about the Hillsborough disaster, but it is alleged that the Millwall attacker was also part of the crowd that attacked a Liverpool fan at the stadium.", "Both clubs were charged with breaches of two FA rules relating to spectator behavior."], "tinydolphin:1.1b": [" The FA has charged Liverpool and Millwall, two English football clubs, over crowd trouble that occurred during a Carling Cup match on October 26th.", "The charges are regarding alleged racist and abusive behavior by fans at the Den Stadium in Millwall's stadium.", "This event led to violence and caused injuries to both supporters.", "Liverpool has been charged with one breach for failing to prevent their fans from conducting themselves threateningly, provoking or violent and/or provocative.", "Millwall has been charged with two breaches for not ensuring fans refrained from racist and abusive behavior.", "The charges are pending any further explanation or reasoning."], "phi:2.7b": [" Liverpool and Millwall were both charged by the Football Association following crowd trouble during a Carling Cup match at Millwall's new Den Stadium on October 26, including alleged racist behavior from Millwall fans and threats from Liverpool fans.", "The incidents sparked debates about Hillsborough disaster chants, but Lions' chairman denied these claims.", "Both clubs have been charged with two breaches of FA rules for failing to prevent abusive behavior by fans and throwing missiles onto the pitch."], "orca-mini:3b": [" Liverpool and Millwall were charged by the FA over crowd trouble during their Carling Cup match on October 26th, with Millwall being charged for alleged racist behavior by their supporters during the match at their new Den Stadium."], "hermes3:3b": ["Football Association charges Liverpool and Millwall over crowd trouble and racist behavior during Carling Cup match on 26th October."], "stablelm-zephyr:3b": ["Liverpool and Millwall have received FA charges related to crowd trouble and alleged racist behavior during a Carling Cup match on October 26.", "Millwall was charged for losing the match 3-0 and allegedly allowing fans to engage in racist and abusive behavior, resulting in seats being ripped out and four people being ejected from the stadium.", "A disabled fan was injured, and riot police were needed to control the situation.", "Liverpool has been charged with a single breach for not preventing fans from engaging in threatening and violent or provocative behavior during the match.", "Both clubs have until December 23 to respond to the charges."], "chatgpt-4o-latest": ["Liverpool and Millwall have been charged by the FA over crowd trouble during their Carling Cup match on 26 October.", "Millwall also faces charges for alleged racist behavior by their supporters.", "The match saw seats ripped up, four people ejected, and a disabled fan injured, requiring riot police intervention.", "Liverpool fans claimed the violence was provoked by chants about the Hillsborough disaster, but Millwall chairman Theo Paphitis denied this, citing CCTV footage showing a Liverpool fan attacking a Millwall supporter.", "Millwall has been charged with failing to prevent racist and abusive behavior and missile-throwing, while Liverpool faces a charge for failing to control violent or provocative fan behavior.", "Both clubs have until 23 December to respond."], "stablelm2:1.6b": ["The Football Association has charged Liverpool and Millwall over crowd trouble during a Carling Cup match on October 13th, which resulted in seats being ripped up and four people ejected from the ground.", "Both teams have been charged with alleged instances of Racist behavior by their supporters.", "The actual cause for the trouble was allegedly triggered when a Liverpool fan attacked a Millwall fan in the west stand.", "Meanwhile, Millwall has faced two breaches of FA rules; failing to ensure fans refrained from abusive and/or Racistic behaviour, and for failing to prevent spectators throwing missiles onto the pitch.", "Liverpool has also been charged with breaching FA rules for failing to prevent their fans' conduct being threatening or violent or provocative.", "Both clubs have until December 13th to respond."], "granite3.1-dense:2b": ["Liverpool and Millwall, following a Carling Cup match on 26 October, have been charged by the Football Association (FA).", "The incident occurred at Millwall's new Den Stadium, where Liverpool won 3-0.", "Key issues include:\n\n1.", "Crowd trouble: Seats were damaged, four people were ejected, and a disabled fan was injured near the pitch.", "Riot police intervened due to escalating tensions.", "2.", "Alleged racist behaviour: Millwall supporters are accused of racially abusive conduct, which they deny.", "3.", "Liverpool's involvement: A disabled fan claims the disturbance was triggered by chants about the Hillsborough disaster; however, Lions' chairman Theo Paphitis refutes this, stating CCTV footage indicates a physical altercation between two fans as the trigger.", "4.", "FA Rule violations: Millwall faces charges for not preventing fan racism and missile-throwing, while Liverpool is accused of allowing threatening, violent, or provocative behaviour by their supporters.", "Both clubs have until 23 December to respond to the charges."]}