{"raw_text": "Real will finish abandoned match\n \n Real Madrid and Real Socieded will play the final six minutes of their match, which was abandoned on Sunday because of a bomb scare.\n \n The Bernabeu was evacuated with the score at 1-1 and two minutes of normal time remaining in the game. The teams will now play the final two minutes, plus four minutes of injury time, on 5 January. Brazilian Ronaldo and England captain David Beckham had to wait in the street in their kit after the abandonment. Real Sociedad president Jose Luis Astiazaran said: \"We thought the best thing was to play the time remaining.\"\n \n Hundreds of fans streamed across the pitch on their way to the exits after the game was called off. Tourists and fans took advantage of the opportunity for a photograph between the famous stadium's goalposts. The two clubs met the Spanish FA on Monday and Astiazaran added: \"We thought about giving the game as concluded but after talking with the FA we decided there was no precedent for that and the best thing was to play the time that was remaining.\" Real Madrid director of sport Emilio Butragueno praised the spectators inside the ground for their conduct. \"I'd like to highlight the behaviour of the fans, who showed great maturity and it was an example of good citizenship,\" he said. Butragueno confirned, before confirming that Tuesday's charity match - which has been billed as \"Ronaldo's friends against Zidane's friends\" - will go ahead as planned. \"I'd also like to take the chance to say that tomorrow's game will take place,\" Butragueno declared of the \"Partido contra la Pobreza\" (Game Against Poverty). He added: \"Football is important for society and we want to show that. \"We also think that football should be a fiesta, we had programmed and people deserve to enjoy the game.\"\n", "llama3.2:1b": ["Real Madrid and Real Sociedad's match was abandoned on Sunday due to a bomb scare at the Bernabeu Stadium.", "The teams will play the final two minutes, plus four minutes of injury time, on January 5.", "Hundreds of fans streamed out of the stadium after the game ended in a draw.", "The Spanish FA has decided not to replay the game but instead allowed spectators to take photos with the goalposts."], "llama3.2:3b": ["Real Madrid and Real Sociedad will play the final six minutes of their abandoned match on January 5.", "The match was called off due to a bomb scare and fans streamed across the pitch as it ended in a 1-1 draw.", "The teams will play two minutes of normal time plus four minutes of injury time, with Brazilian Ronaldo and England captain David Beckham waiting in the street in their kit after the game was abandoned."], "gemma2:2b": ["Real Madrid and Real Sociedad will resume their abandoned match on January 5th, adding two minutes of normal time plus four minutes of injury time.", "The decision to play the remaining time was made after discussions with the Spanish FA.", "Fans behaved responsibly during the evacuation.", "The charity match against poverty scheduled for Tuesday will go ahead as planned."], "qwen2.5:0.5b": ["The Real Madrid and Real Sociedad will play 6 minutes of their match on Sunday because of a bomb scare.", "The teams have now started playing 24 minutes in the final six minutes, with four more minutes of injury time remaining.", "Hundreds of fans streamed onto the pitch to take photos.", "Tourists and fans took advantage of the opportunity to take photos between the famous stadium goalposts.", "Both clubs met the Spanish Football Association on Monday and Astiazaran praised the fans' conduct inside the ground.", "The game is planned for Tuesday, but Aspazar informed that it will go ahead as planned."], "qwen2.5:1.5b": ["Real Madrid and Real Sociedad will play their match with 6 minutes left on January 5th instead of the originally planned time remaining in the abandoned match on Sunday due to a bomb scare.", "The two clubs met with the Spanish FA on Monday, but decided not to give the game as concluded because it was unprecedented.", "Real Madrid director Emilio Butragueno praised the fans' behavior during the game and confirmed that Tuesday's charity match will go ahead despite being billed as \"Ronaldo's friends against Zidane's friends.\""], "qwen2.5:3b": ["Real Madrid will play the final two minutes plus four of injury time against Real Sociedad on 5 January after their match was abandoned due to bomb threats on Sunday when the score was 1-1 with two minutes left.", "The clubs agreed to continue the match, and Astiazaran stated there was no precedent for declaring a game concluded early.", "Fans behaved well during the abandonment, prompting praise from Real Madrid's director of sport.", "A charity match against FIFA will be held as planned on the same day."], "opencoder:1.5b": ["Real Madrid and Real Sociedad will play the final six minutes of their match, which was abandoned on Sunday because of a bomb scare.", "The Bernabeu was evacuated with the score at 1-1 and two minutes of normal time remaining in the game.", "They will now play the final two minutes, plus four minutes of injury time, on 5 January.", "Brazil's Ronaldo and England captain David Beckham had to wait in the street in their kit after the abandonment.", "Real Sociedad president Jose Luis Astiazaran said: \"We thought the best thing was to play the time remaining.\"", "Fans watched the crowd stream across the pitch on their way to the exits.", "They met with satisfaction after watching the game unfold as planned.", "The two clubs met the Spanish FA on Monday and Astiazaran added: \"We thought about giving the game as concluded but after talking with the FA we decided there was no precedent for that and the best thing was to play the time that was remaining.\"", "Real Madrid director Emilio Butragueno praised the spectators.", "\"I'd like to highlight the behaviour of the fans, who showed great maturity and it was an example of good citizenship,\" he said.", "Butragueno confirmed.", "He also celebrated the victories in Saturday's match as planned, which has been billed as \"Ronaldo's friends against Zidane's friends.\"", "The football is important for society, and we wish to show that.", "We also think football should be a fiesta, and we had programmed and people deserve to enjoy the game."], "smollm:1.7b": ["The summary above captures the main ideas of the text while preserving key details such as the title, authors, and publication date.", "The summary is concise and free of unnecessary information, focusing on the essential points that convey the main idea of the text."], "deepseek-r1:1.5b": ["The Real Madrid and Real Sociedad teams play their final 6 minutes of a game against a bomb scare on January 5th.", "The Bernabeu was evacuated with a draw at 1-1, two minutes remaining.", "Fans will attend the final two minutes plus injury time to watch the game.", "Ronaldo and Beckham waited in their kit, while fans from the pitch took photos.", "Emilio Butragueno praised the fans' maturity for the final moments and promised a charity match against Zidane's friends on Tuesday."], "tinyllama:1.1b": ["Real Madrid and Real Sociedad will play a two-minute extra period on January 5, after the abandonment of their match due to a bomb scare.", "The Bernabeu was evacuated with the score at 1-1, two minutes remaining in normal time, and four minutes of injury time remaining.", "The teams agreed to continue the game as planned on Monday, with fans streamed across the pitch.", "The Spanish Football Federation confirmed that \"Royal Madrid's friends against Zidane's friends\" will go ahead as scheduled on January 5, while Butragueno emphasized the importance of football and its positive effects in society."], "tinydolphin:1.1b": [" Real Madrid and Real Sociedad will play the final six minutes of their match, which was abandoned on Sunday because of a bomb scare.", "The Bernabeu was evacuated with the score at 1-1 and two minutes of normal time remaining in the game.", "Brazilian Ronaldo and England captain David Beckham had to wait in the street in their kit after the abandonment, while Real Sociedad president Jose Luis Astiazaran said: \"We thought the best thing was to play the time remaining.\"", "Hundreds of fans streamed across the pitch on their way to the exits after the game was called off.", "Tourists and fans took advantage of the opportunity for a photograph between the famous stadium's goalposts.", "Real Madrid director of sport Emilio Butragueno praised the spectators inside the ground for their conduct.", "\"I'd like to highlight the behaviour of the fans, who showed great maturity and it was an example of good citizenship,\" he said.", "Butragueno confirmed that Tuesday's charity match - which has been billed as \"Ronaldo's friends against Zidane's friends\" - will go ahead as planned.", "\"I'd also like to take the chance to say that tomorrow's game will take place,\" Butragueno declared of the \"Partido contra la Pobreza\" (Game Against Poverty).", "He added: \"Football is important for society and we want to show that.", "We also think that football should be a fiesta, we had programmed and people deserve to enjoy the game.\""], "phi:2.7b": [" Real Madrid and Real Sociedad will play the final six minutes of their abandoned match at Bernabeu Stadium on January 5th with additional four minutes of injury time.", "Ronaldo and Beckham waited outside in their kit after the abandonment.", "Fans were allowed to take photographs between goalposts, and a charity match was scheduled for Tuesday as planned."], "orca-mini:3b": [" Real Madrid and Real Sociedad will play the final six minutes of their match, which was abandoned on Sunday because of a bomb scare.", "The Bernabeu was evacuated with the score at 1-1 and two minutes of normal time remaining in the game.", "The teams will now play the final two minutes, plus four minutes of injury time on 5 January.", "Ronaldo and Beckham had to wait in the street in their kit after the abandonment.", "The two clubs met the Spanish FA on Monday and decided to play the time that was remaining.", "Real Madrid director of sport praised the spectators inside the ground for their conduct.", "The charity match will go ahead as planned."], "hermes3:3b": ["Real Madrid, Real Sociedad play final 6 mins of abandoned match<|end_of_text|><|begin_of_text|>5\nFinal two minutes, plus injury time scheduled on Jan 5; bomb scare caused abandonment"], "stablelm-zephyr:3b": ["Real Madrid and Real Sociedad will play the remaining six minutes of their abandoned match on January 5th.", "The teams met with the Spanish FA to discuss the possibility of playing the remaining time, as there was no precedent for this situation.", "After considering the factors, they decided to proceed with the game.", "Many fans took advantage of the opportunity to take photos between the goalposts.", "Real Madrid director of sport Emilio Butragueno praised the conduct of the fans during the incident and confirmed that the charity match \"Ronaldo's friends against Zidane's friends\" will go ahead as planned."], "chatgpt-4o-latest": ["Real Madrid and Real Sociedad will complete the final six minutes of their match on 5 January after it was abandoned due to a bomb scare with the score at 1-1.", "The Bernabeu was evacuated, leaving players like Ronaldo and David Beckham waiting outside in their kits.", "Real Sociedad's president and the Spanish FA agreed to finish the match rather than declare it concluded.", "Fans exited the stadium in an orderly manner, with some taking photos on the pitch.", "Real Madrid's Emilio Butragueno praised the spectators' behavior and confirmed that a charity match featuring Ronaldo and Zidane will proceed as planned, emphasizing football's role in society."], "stablelm2:1.6b": ["Real Madrid's match with Real Socieded was abandoned due to a bomb scare but will now finish in two minutes of extra time on January 5th.", "Fans streamed off the pitch after the abandonment, while Ronaldo and Beckham waited outside in their kits.", "The clubs and FA discussed playing the remaining time, with Real Madrid's Emilio Butragueno praising fans for their behavior.", "A charity match is planned, and football should be a fiesta according to the director of sport."], "granite3.1-dense:2b": ["Real Madrid and Real Sociedad will resume their abandoned match on January 5, playing an additional two minutes of normal time followed by four minutes of injury time.", "The game was halted on Sunday due to a bomb scare, leaving fans streaming out of the Bernabeu Stadium as the score was tied at 1-1 with two minutes left.", "Real Madrid's director of sport, Emilio Butragueno, commended fans for their maturity and good citizenship during the incident.", "The scheduled charity match, \"Ronaldo's friends against Zidane's friends,\" remains on course for Tuesday, emphasizing football's importance in society as a fiesta for its audience."]}