{"raw_text": "Poll explains free-kick decision\n \n Referee Graham Poll said he applied the laws of the game in allowing Arsenal striker Thierry Henry's free-kick in Sunday's 2-2 draw with Chelsea.\n \n Keeper Petr Cech was organising his defensive wall when Henry's quick free-kick flew in, which angered Chelsea. \"The whistle doesn't need to be blown. I asked Henry 'do you want a wall?'. He said 'can I take it please?' He was very polite. I said 'yes',\" said Poll. \"I deal with the laws of the game. I deal with fact.\" Poll added: \"I gave the signal for him to take it. That's what he did. \"The same thing happened when I refereed Chelsea against West Ham in an FA Cup replay two years ago - when Jimmy Floyd Hasselbaink scored - and I don't remember them complaining about that.\" Henry explained why he paused before striking the ball for the goal, which put Arsenal 2-1 ahead.\n \n Henry told BBC Radio Five Live: \"The ref asked me if I wanted 10 yards or if I wanted to take it straight away and I said that I wanted to take it straight away. He said to me, 'go'. \"It looks a bit strange because I took my time. I was waiting for Eidur Gudjohnsen to move and give me some space. \"At one point, he turned and that's when I tried it.\" Former referees' chief Philip Don backed Poll's decision to allow the strike. \"The advantage should go to the non-offending team. On this occasion it was Arsenal,\" Don told BBC Radio Five Live. \"Referees have been told to ask the player 'do you want to take the quick free-kick?' or 'do you want me to get the wall back 9.15 metres?' \"If they say 'quick', the referee tends to move away and allow the kick.\" Don was head of the referees for the Premier League and revealed all clubs were informed of free-kick options. \"We spoke to all the Premier League clubs as well as all the Football League clubs in the summer of 2003 explaining what the situation was,\" he added \"We gave them the option of either the quick free-kick or the 'ceremonial' free-kick. Players and clubs were aware of what referees were doing.\"\n", "llama3.2:1b": ["Referee Graham Poll allowed Thierry Henry to take a free kick on Arsenal's second goal in a 2-2 draw with Chelsea, despite complaining about Chelsea's defensive wall being \"strange\".", "The referee had instructed Henry to take the ball straight away.", "Henry explained he wanted to take it directly, and was waiting for an opponent to move before taking his time.", "Philip Don, former referees' chief, backed Poll's decision, stating that the advantage should go to the non-offending team.", "The Premier League introduced free kick options in 2003, instructing players and clubs on what referees could do in this situation."], "llama3.2:3b": ["Referee Graham Poll allowed Arsenal's Thierry Henry to take a free kick without waiting for Chelsea's defensive wall to be fully organized, citing the laws of the game which state that players can choose whether or not to use the quick free-kick option.", "Henry had previously asked if he wanted to take it quickly, and Poll had given him permission to do so.", "Former referees' chief Philip Don backed the decision, stating that the advantage should go to the non-offending team and that all clubs were informed of the free-kick options in 2003."], "gemma2:2b": ["Referee Graham Poll allowed Thierry Henry's quick free kick in the Arsenal vs Chelsea game because he followed the laws of the game, allowing Henry to take the shot after being asked if he wanted a wall.", "Former referees' chief Philip Don confirmed this decision was standard practice and players were informed of these rules at clubs nationwide."], "qwen2.5:0.5b": ["Referee Graham Poll allowed Arsenal striker Thierry Henry's free-kick in a 2-2 draw with Chelsea, explaining that he applied laws of the game rather than penalizing Chelsea for not giving way to Henry.", "Keeper Petr Cech organized his defensive wall when Henry's quick free-kick flew in, which angered Chelsea.", "When asked if he wanted to take Henry's goal, Henry said \"can I take it please?", "\", and Poll allowed him to do so.", "The same thing happened two years ago with Jimmy Floyd Hasselbaink scoring against West Ham: he took the 10-yard option instead of running out of time."], "qwen2.5:1.5b": ["Arsenal's Thierry Henry received a free-kick during a 2-2 draw with Chelsea, despite an initially angered Cech.", "Referee Graham Poll stated that he allowed the goal because it was within the rules regarding quick kicks and not considering it a foul.", "The decision aligns with previous refereeing practices involving players taking quick free-kicks under certain circumstances.", "Former referees' chief Philip Don agreed with Poll's interpretation, emphasizing the importance of following the laws of the game and allowing appropriate decisions based on what the player desires, particularly when faced with potentially controversial situations like this one."], "qwen2.5:3b": ["Referee Graham Poll allowed Arsenal striker Thierry Henry to take a free kick despite Chelsea's objections, explaining that he applied the laws of the game.", "Henry took his time before striking the ball, which put Arsenal ahead 2-1 in their draw with Chelsea.", "Former referee Philip Don supported Poll's decision, favoring the non-offending team and allowing quick free kicks when requested."], "opencoder:1.5b": ["\"Graham Poll explained free-kick decision in game\"\n\nReferee Graham Poll said he applied the laws of the game to allow Arsenal striker Thierry Henry's quick free-kick in a 2-2 draw with Chelsea.", "The keeper Petr Cech was organizing his defensive wall when Henry's quick free-kick flew in, which angered Chelsea.", "\"The whistle doesn't need to be blown,\" he said.", "\"I asked Henry 'do you want a wall?'", "He said 'can I take it please?'", "He was very polite and asked if Henry wanted to take the ball for the goal - hence the signal to him to take it straight away.\"", "The same thing happened when I referred Chelsea against West Ham in an FA Cup replay two years ago, where I don't remember them complaining about that.", "When Jimmy Floyd Hasselbanck scored, where he paused before striking the ball for the goal, which put Arsenal 2-1 ahead.", "Thierry Henry told BBC Radio Five Live: \"The ref asked me if I wanted 10 yards or if I wanted to take it straight away and I said that I wanted to take it straight away.", "He turned and tried it.\"", "Former referees' chief Philip Don backed his decision, hoping the kick would go to the non-offending team.", "The advantage should go to the non-offending team in this case.", "They explained their rules, which involved either a quick free-kick or a ceremonial one, and they were aware of what players and clubs were doing.", "\"We spoke to all the Premier League clubs as well as all the Football League clubs in the summer of 2003 explaining what the situation was.\""], "smollm:1.7b": ["The summary is concise, preserving key ideas and details from the original text.", "The main points are:\n\n1.", "Poll explains free-kick decision\n2.", "Referee Graham Poll said he applied the laws of the game in allowing Arsenal striker Thierry Henry's free-kick in Sunday's 2-2 draw with Chelsea\n3.", "Keeper Petr Cech was organizing his defensive wall when Henry's quick free-kick flew in, which angered Chelsea\n4.", "Poll gave signal for him to take it\n5.", "Referee dealt with laws of the game and fact\n6.", "Poll didn't complain about that\n7.", "Henry explained why he paused before striking the ball for goal\n8.", "Referees asked for 10 yards or if they wanted to take it straight away\n9.", "Henry told BBC Radio Five Live: \"The ref asked me if I wanted 10 yards or if I wanted to take it straight away and I said that I wanted to take it straight away\"\n10.", "Former referees' chief Philip Don backed Poll's decision to allow the strike\n11.", "Referees have been told to ask the player \"do you want to take the quick free-kick?\"", "or \"do you want me to get the wall back 9.15 meters?\"", "if they say \"quick\"\n12.", "All clubs were informed of free-kick options\n13.", "Poll spoke with all the Premier League clubs as well as all the Football League clubs in the summer of 2003 explaining what the situation was\n14.", "Poll gave them the option of either the quick free-kick or the \"ceremonial\" free-kick\n\nThe summary captures the main points from the original text, preserving key ideas and details while avoiding unnecessary information."], "deepseek-r1:1.5b": ["Poll, the referee Graham, allowed Thierry Henry in Arsenal's match against Chelsea due to a foul call, despite Cech being polite in dealing with the free-kick.", "Henry paused before striking for the goal, possibly avoiding an easy penalty.", "Don, a former referee, supported Poll by emphasizing the importance of quick free-kicks and others' safety.", "Clubs were informed about options in 2003 to manage free-kicks during FA Cup replays."], "tinyllama:1.1b": ["Poll, a former Premier League referee, explained that Arsenal striker Thierry Henry took advantage of the laws of the game in allowing his free-kick during a match between Chelsea and Arsenal in 2004.", "The decision was approved by the league's chief referee, Phil Don, and all Premier League clubs were informed of the options available to players and officials prior to the match.", "Poll explained that on this occasion, he asked Henry if he wanted a quick free-kick or a \"ceremonial\" free-kick from where Chelsea's goalkeeper Petr Cecch was organizing his defensive wall.", "Both options were available for players but Arsenal striker Henry decided to take the \"ceremonial\" option after being informed that the law dictates that the free-kick should be taken straight away and not paused like in a penalty.", "Poll said he dealt with the laws of the game by giving Henry permission to take his chance and Henry explained why he took the shot, saying he wanted to take it \"straight away\" from where Cecch was organizing his wall."], "tinydolphin:1.1b": [" Poll, a renowned referee, deemed the Arsenal vs. Chelsea free-kick decision based on the rules set by the English Football League (EFL), Premier League, and the Football Association (FA).", "Despite Chelsea's frustrations, Poll maintained his authority by asking Henry if he wanted a wall before taking the kick.", "The decision allowed both teams equal opportunities to score goals, as it is not mandatory for players to take a direct free-kick in these situations."], "phi:2.7b": [" Referee Graham Poll allowed Arsenal's Thierry Henry to take a quick free kick, as stated by Henry himself.", "The defender Petr Cech was initially prepared to set up a defensive wall behind the striker.", "Poll followed the laws of the game and made his decision based on the situation in the match.", "He did not blow the whistle but gave Henry permission to take the free-kick.", "This is similar to another situation when he allowed Chelsea's Jimmy Floyd Hasselbaink to score with the same circumstances.", "Henry explained why he paused before taking the free-kick, as he was waiting for his teammate to move and give him some space.", "Don, a former referee's chief, supported Poll's decision and stated that the non-offending team should have the advantage in this situation.", "Referees were advised to ask players if they wanted a quick or ceremonial free-kick before making their decision.", "All Premier League clubs were informed of the options, and players and clubs were aware of what the referees were doing."], "orca-mini:3b": [" Referee Graham Poll allowed Arsenal striker Thierry Henry's free-kick in Sunday's 2-2 draw with Chelsea because he dealt with the laws of the game and did not blow the whistle.", "Henry explained why he paused before striking the ball for the goal, which put Arsenal 2-1 ahead.", "Poll said that he asked Henry if he wanted a wall, and he replied \"yes.\"", "The advantage should go to the non-offending team, and Poll followed the laws of the game in allowing the strike."], "hermes3:3b": ["Hermes 3 Summary:\nReferee Poll allowed Arsenal's Henry to take a quick free-kick in a match against Chelsea due to prior agreement with Henry.", "He claimed he followed rules of the game."], "stablelm-zephyr:3b": ["Referee Graham Poll allowed Arsenal striker Thierry Henry's quick free-kick in Sunday's 2-2 draw with Chelsea, stating that he followed the laws of the game.", "This decision had happened previously when Poll was refereeing Chelsea against West Ham two years prior.", "Former referees' chief Philip Don supported Poll's decision and mentioned that referees have been instructed to ask players if they want a quick free-kick or prefer a traditional wall setup.", "All Premier League and Football League clubs were informed of the free-kick options in the summer of 2003."], "chatgpt-4o-latest": ["Referee Graham Poll defended his decision to allow Thierry Henry's quick free-kick in Arsenal's 2-2 draw with Chelsea, stating he followed the laws of the game.", "Chelsea's goalkeeper Petr Cech was setting up a defensive wall when Henry scored, leading to complaints.", "Poll explained that he asked Henry if he wanted a wall, and when Henry requested to take the kick immediately, Poll permitted it.", "Henry clarified that he waited for space before striking.", "Former referees' chief Philip Don supported Poll, emphasizing that referees give the advantage to the non-offending team and that clubs were informed of free-kick options in 2003."], "stablelm2:1.6b": ["Referee Graham Poll allowed Arsenal striker Thierry Henry's free-kick in a 2-2 draw with Chelsea due to adherence to the game's laws, despite it initially angering Chelsea.", "This decision led to controversy as Henry explained that he waited for space from teammate Eidur Gudjohnsen before attempting to strike the ball.", "Former referees' chief Philip Don supported Poll's decision stating that \"the advantage should go to the non-offending team\" on this occasion, which was Arsenal.", "All Premier League and Football League clubs were informed of free-kick options."], "granite3.1-dense:2b": ["Referee Graham Poll permitted Arsenal's Thierry Henry to take a quick free-kick during their 2-2 draw with Chelsea, citing the laws of the game.", "When asked by Poll if he wanted 10 yards or to take it immediately, Henry opted for the latter.", "Chelsea expressed frustration due to Henry's delay before striking the ball, which was intended to catch Chelsea's defensive wall off-guard and benefit Arsenal.", "Former referees' chief Philip Don supported Poll's decision, emphasizing that the advantage should go to the non-offending team in such situations.", "He revealed that clubs were informed of free-kick options: either a quick kick or a ceremonial one, with referees typically moving back 9.15 meters for the former."]}