{"raw_text": "Bellamy fined after row\n \n Newcastle have fined their Welsh striker Craig Bellamy two weeks' wages - about £80,000 - following his row with manager Graeme Souness.\n \n But Bellamy, 25, has not been put on the transfer list, although he did not train with the first team on Tuesday. Magpies chairman Freddy Shepherd told the Newcastle Evening Chronicle: \"It is not about money. It is about a player thinking he is bigger than this club. \"No individual is, be it the chairman, the manager or a player.\" Souness dropped Bellamy for Sunday's game against Arsenal, claiming the Welshman had feigned injury after being asked to play out of position. \"When I heard what the manager was saying I was in shock,\" Bellamy said. \"I thought 'not only has he gone behind my back, he's lying',\" he said in response to Souness' remarks. And the Wales international refused to apologise. \"I won't apologise because I have done nothing wrong,\" he told the Evening Chronicle. \"There's no doubt about it, I am out of here.\" The difficult relationship between Souness and Bellamy boiled over at the weekend, and has led to a war of words in the media.\n \n Bellamy's claim that Souness had lied about the background to the bust-up was strongly denied by Shepherd, who accused the striker of \"cheating\" the club. \"I wish to put the record straight regarding the Bellamy situation,\" said Shepherd. \"Craig walked off the training ground saying his hamstring was tight (on Friday), but what he failed to reveal was that he had told other members of the squad before training that he intended to feign injury. \"When Graeme discovered this he immediately ordered Bellamy to attend a meeting in my office. \"At that meeting Bellamy admitted to Graeme and I that he had told the players that he was going to \"fake\" an injury in training and walk off. \"He also agreed at that meeting to apologise to his team-mates for his behaviour. He didn't do this which resulted in the action taken by the manager at the weekend, which I fully support. \"In my book this is cheating on the club, the supporters, the manager and his own team-mates. \"He is paid extremely well and I consider his behaviour to be totally unacceptable and totally unprofessional.\"\n \n Bellamy's latest outburst would appear to make his chances of a first-team recall remote. But even before Newcastle said the player would not be sold, Bellamy insisted he had no intention of handing in a transfer request. \"I don't want the fans to think for one minute that I wouldn't play for this club,\" he said. \"I'd play anywhere for this club, even in goal. \"It's a very difficult situation for me at the moment but I'd never ask to leave this club. \"This club means so much to me. I couldn't do it because I know I couldn't come back here and play against Newcastle. It would hurt too much.\"\n", "llama3.2:1b": ["Craig Bellamy has been fined £80,000 by Newcastle for his role in a team dispute with manager Graeme Souness.", "Bellamy was dropped from the starting lineup after claiming he had faked an injury to avoid playing out of position, but refused to apologize despite being told this would damage the club's reputation."], "llama3.2:3b": ["Newcastle fined striker Craig Bellamy £80,000 for a row with manager Graeme Souness, who dropped him from the first team for feigning injury after being asked to play out of position.", "Bellamy claims Souness lied about their dispute but was accused by chairman Freddy Shepherd of \"cheating\" the club."], "gemma2:2b": ["Craig Bellamy was fined two weeks' salary by Newcastle for a row with manager Graeme Souness.", "Bellamy claims he feigned an injury after being asked to play out of position, while Souness stated that Bellamy lied about the situation.", "Bellamy denies apologizing and refuses to leave the club.", "The fine is unrelated to a potential transfer request from Bellamy who insists on playing for Newcastle despite his dispute with Souness."], "qwen2.5:0.5b": ["A Welsh striker named Craig Bellamy has faced a tough situation after he accused Graeme Souness of lying about the background of their team's problems.", "The Wales international denied the accusation, saying that he had lied about an injury he told other players before training.", "Newcastle Football Club said they would not sell Bellamy because they consider his behavior to be cheating on the club and his own team-mates.", "Bellamy has insisted that he will play anywhere for the club even if he can't make a first-team return, saying he would \"play anywhere for this club.\""], "qwen2.5:1.5b": ["Welsh striker Craig Bellamy, fined £80,000 for allegedly lying about a training injury, refuses to apologize following his row with manager Graeme Souness.", "The relationship between the two is said to have deteriorated due to their differences over Souness's treatment of Bellamy during a game against Arsenal."], "qwen2.5:3b": ["Newcastle fined Craig Bellamy two weeks' wages after a row with manager Graeme Souness, who dropped Bellamy for playing injured in a match.", "The club chairman, Freddy Shepherd, claimed Bellamy had lied about being injured and accused him of \"cheating\" the club.", "Despite this, Bellamy refused to apologise and has stated he intends to stay at Newcastle.", "His latest outburst makes his return to first-team uncertain."], "opencoder:1.5b": ["\"Newcastle have fined their Welsh striker Craig Bellamy two weeks' wages - about £80,000.", "The challenging relationship between Souness and Bellamy has resulted in a war of words in the media.", "He admitted to Graeme and I that he had told the players that he was going to \"fake\" an injury in training and walk off.", "It's a very difficult situation for me at the moment but I'd never ask to leave this club.\""], "smollm:1.7b": ["Bellamy fined after row with manager, but not put on transfer list."], "deepseek-r1:1.5b": ["Newcastle have fined Craig Bellamy over a row with Graeme Souness for two weeks' wages, around £80k.", "He is 25 and hasn't been moved to the transfer list but didn't train with the first team on Tuesday.", "The manager stated it's about a player thinking he's bigger than Newcastle's club.", "Bellamy denied everything, including lying about Souness's background.", "His recent comments suggest he may leave the club, which has already decided not to sell him and is cautious about his behavior."], "tinyllama:1.1b": ["The Newcastle Premier League team, Newcastle United, has suspended Welsh striker Craig Bellamy for the next two weeks following his row with manager Graeme Souness about playing positions after training.", "However, Bellamy, who refused to apologize for the incident and claimed that Souness had lied about the background to the scuffle, refused to train again until a meeting was scheduled between him, Souness, and his teammates.", "The club then issued a statement regarding Bellamy's behavior in which they said he had been suspended from training for the next two weeks but would not be sold, stating that Bellamy insisted that he had no intention of handing in a transfer request despite previous outbursts.", "Despite his claims, Bellamy remains a crucial player to Newcastle's chances and would likely not leave the club if released."], "tinydolphin:1.1b": [" In summary, the player Craig Bellamy has been fined by his team, Newcastle United, for a row with manager Graeme Souness, after missing training due to a hamstring issue.", "The player later apologized but claimed that he was being \"lied\" about the reason for his absence.", "Despite this, it appears that he will not be sold and may need to find another team if he wants to play for Newcastle again."], "phi:2.7b": [" Craig Bellamy, Newcastle's Welsh striker, was fined two weeks' wages by the club for a row with manager Graeme Souness.", "Despite not being put on the transfer list, Bellamy refused to apologize and claimed Souness had lied about the background to their argument.", "The difficult relationship between the two eventually led to a war of words in the media.", "Shepherd, the Newcastle chairman, denied Bellamy's claims that Souness had lied and accused him of cheating the club by faking an injury.", "Bellamy's latest outburst would seem to make his chances of being recalled to the first team remote, but he insisted he had no intention of giving up on the club and said he wouldn't leave unless asked to do so."], "orca-mini:3b": [" Newcastle fine Craig Bellamy two weeks' wages after row with manager Graeme Souness.", "However, Bellamy is not put on transfer list and has not trained with first team on Tuesday.", "The relationship between Souness and Bellamy boiled over at the weekend, leading to a war of words in the media.", "Bellamy admitted to Graeme Souness that he intended to feign injury in training and walk off, resulting in the action taken by the manager at the weekend.", "Despite this, Bellamy insisted he has no intention of asking to leave the club."], "hermes3:3b": ["Newcastle fines Bellamy after row over manager Souness; denies transfer list, claims player thought himself bigger than club."], "stablelm-zephyr:3b": ["Newcastle fined Welsh striker Craig Bellamy two weeks' wages, around £80,000, following a row between him and manager Graeme Souness.", "The conflict arose when Souness claimed Bellamy feigned injury during a game against Arsenal after being asked to play out of position.", "Bellamy refused to apologize and maintained he had done nothing wrong.", "Despite the fine, Newcastle's chairman Freddy Shepherd dismissed Bellamy's claims and accused him of cheating the club.", "This situation appears to make Bellamy's chances of returning to the first team remote.", "However, Bellamy insists he has no intention of submitting a transfer request and would play anywhere for the club that means so much to him."], "chatgpt-4o-latest": ["Newcastle fined striker Craig Bellamy two weeks' wages (£80,000) after a dispute with manager Graeme Souness but did not place him on the transfer list.", "The conflict arose when Souness accused Bellamy of feigning injury to avoid playing out of position, which Bellamy denied, calling the manager a liar.", "Club chairman Freddy Shepherd supported Souness, revealing Bellamy had admitted to faking injury in training and failed to apologize to teammates.", "Shepherd labeled Bellamy's actions as \"cheating\" and \"unprofessional.\"", "Despite the fallout, Bellamy insisted he would not request a transfer, expressing his deep attachment to Newcastle.", "However, his chances of a first-team return appear slim."], "stablelm2:1.6b": ["Newcastle striker Craig Bellamy has been fined two weeks' wages, around £60,0..\nMagician Neil Sedaka was a hit on the music scene during the 1970s with hits such as \"Breaking the Ice\" and \"Love My Way.\"", "The feud between Newcastle United manager Graeme Souness and Welsh international Craig Bellamy erupted following a disagreement over Souness's claim that Bellamy had feigned injury to avoid playing in a certain position.", "Souness dropped Bellamy for Sunday's game against Arsenal, claiming the Welshman had feigned injury after being asked to play out of position.", "Despite claims that he was on the transfer list, Bellamy has not been added to it and did not train with the first team on Tuesday.", "However, in an interview with the Newcastle Evening Chronicle, Magpies chairman Freddy Shepherd strongly accused the striker of \"cheating\" the club, stating that Craig walked off the training ground saying his hamstring was tight (on Friday), but failed to reveal that he had told other members of the squad before training that he intended to feign injury.", "Sedaka is known for popular songs such as \"I've Got You Under My Skin,\" and \"Love.\"", "The latter includes lyrics like: \"The answer isn't love, isn't it?", "/ If you don't know where your happiness lies.\"", "Bellamy's latest outburst would make his chances of a first-team recall by Newcastle remote.", "However, even before Newcastle said the player would not be sold, Bellamy insisted he had no intention of handing in a transfer request.", "\"I don't want the fans to think for one minute that I wouldn't play for this club,\" he said.", "\"I'd play anywhere for this club, even in goal.\"", "It's a very difficult situation for me at the moment but I'd never ask to leave this club.", "This club means so much to me.", "I couldn't do it because I know I couldn't come back here and play against Newcastle.", "It would hurt too much.\"", "In conclusion, both Sedaka and Shepherd express strong opposition to Bellamy's behavior, calling his actions \"cheating\" on the club, supporters, manager, and teammates.", "Despite this, Bellamy insisted he had no intention of requesting a transfer from the team."], "granite3.1-dense:2b": ["Newcastle has fined Welsh striker Craig Bellamy £80,000 (two weeks' wages) for his disruptive behavior following a row with manager Graeme Souness.", "Despite the financial penalty, Bellamy will not be transferred, as chairman Freddy Shepherd emphasized that the fine was about Bellamy's disrespect for the club, not its value.", "The conflict began when Bellamy allegedly feigned injury to avoid playing out of position, a claim denied by Souness and backed up by Shepherd, who revealed Bellamy had previously informed teammates about his intention to fake an injury.", "This behavior was deemed \"cheating\" on the club, supporters, manager, and teammates.", "Bellamy refuses to apologize or consider a transfer, stating his unwavering commitment to Newcastle, even if it means playing in goal against them due to the emotional toll of such an action."]}