{"raw_text": "Gronkjaer agrees switch to Madrid\n \n Jesper Gronkjaer has agreed a move to Atletico Madrid from Birmingham City.\n \n The 27-year-old winger spent just five months at St Andrews following a £2.2m move from Chelsea in July after playing for Denmark at Euro 2004. He is set to move during the January transfer window in a deal rumoured to be about £1.4m, subject to a medical. \"We will meet with the player's representative to finalise the contract and decide when he will sign,\" said Atletico sporting director Toni Munoz. Gronkjaer has been targeted by Blues fans and was sarcastically applauded when taken off against Everton last month. Boss Steve Bruce had said that he would be happy to let the Danish international go if the price was right. He added: \"I'm not going to say the decision to let him go is down to the fans' reaction towards him.\n \n \"He has had a tough time since the summer with the loss of his mother and finding it difficult to adjust to a new club and a different area. \"He has been terrific and not missed a day's training and is someone if your daughter brought them home you would be delighted. \"It just hasn't quite worked out here for him. But we'd like to get back most of what we spent.\"\n", "llama3.2:1b": ["Gronkjaer agrees to move to Atletico Madrid from Birmingham City in a deal rumored to be around £1.4m, subject to a medical.", "The 27-year-old winger has been targeted by Blues fans and faced criticism for his time at St Andrews before being moved back home.", "He will leave during the January transfer window with boss Steve Bruce saying that while the decision is not solely based on fan reaction."], "llama3.2:3b": ["Jesper Gronkjaer agrees to move to Atletico Madrid from Birmingham City, expected in January transfer window in a deal around £1.4m, following a tough time since his mother's loss and struggles adjusting to the new club."], "gemma2:2b": ["Jesper Gronkjaer will move from Birmingham City to Atletico Madrid in a deal worth around £1.4m.", "The transfer is expected to happen during the January transfer window and is subject to a medical.", "Gronkjaer was targeted by fans at Birmingham and Steve Bruce indicated he would be willing to sell him if the right price was offered, although Gronkjaer has received positive feedback from manager Steve Bruce who notes his professionalism despite personal difficulties since joining the club."], "qwen2.5:0.5b": ["Jesper Gronkjaer, 27, has agreed to leave Birmingham City and move to Atletico Madrid.", "He had played 5 months at St Andrews following a £2.2m move from Chelsea in July.", "The transfer is scheduled for the January transfer window.", "Atletico are considering a deal worth about £1.4m, subject to a medical.", "This is expected after the Danish international missed three games against Everton last month due to a sore knee.", "They have not decided when he will sign."], "qwen2.5:1.5b": ["Jesper Gronkjaer has agreed to join Atletico Madrid from Birmingham City, with the club reportedly paying about £1.", "4 million in a January transfer window deal that also includes a medical."], "qwen2.5:3b": ["Gronkjaer, 27, agrees to join Atletico Madrid from Birmingham City.", "He moved to St Andrews in July for £2.2m after playing for Denmark at Euro 2004.", "The transfer is rumored to be worth about £1.4m and subject to a medical.", "Gronkjaer struggled with his new club, facing difficulties related to the loss of his mother and adjusting to Birmingham City.", "Atletico Madrid's sporting director Toni Munoz said they would finalize contract details and arrange Gronkjaer’s signing during January transfer window.", "Birmingham boss Steve Bruce stated he wouldn't have let him go if it wasn’t for financial reasons; Gronkjaer was previously sarcastically applauded by Blues fans."], "opencoder:1.5b": ["Gronkjaer agrees to move to Madrid.", "Jesper Gronkjaer has agreed a move to Atletico Madrid, which follows a £2.2m move from Chelsea in July as a Danish international.", "He will spend five months at St Andrews and is set to move during January in a deal that could be worth about £1.4m, subject to a medical condition.", "Gronkjaer has been targeted by fans and was praised when he was taken off against Everton last month.", "The Danish international boss Steve Bruce said the move would be a \"happy thing\" for him.", "He added: \"I'm not going to say the decision to let him go is down to the fans' reaction towards him.", "He has had a tough time since the summer with the loss of his mother and finding it difficult to adjust to a new club and a different area.\"", "Gronkjaer's performance was not missed by the Danish international, which means he will be great for Atletico Madrid."], "smollm:1.7b": ["Gronkjaer has agreed to move to Madrid from Birmingham City, with a proposed transfer window in January 2023.", "He will sign during the January transfer window and is expected to leave his current club, Everton, at the end of the transfer window.", "Gronkjaer was taken off last month against Everton and has been targeted by Blues fans, but he has not been given a formal reason for his departure from Everton.", "He has been praised by his team's management for his performance in the summer, but there is no indication that this will be enough to persuade him to stay at Everton."], "deepseek-r1:1.5b": ["Jesper Gronkjaer has agreed to move to Atletico Madrid, replacing a 27-year-old winger who spent five months there after a £2.2m transfer from Chelsea in July.", "He was also with Denmark for Euro 2004.", "The deal is set to start during the January transfer window at a reported £1.4m cost.", "Atletico director Toni Munoz mentioned meeting the player's representative to finalize contract terms and signing date.", "Gronkjaer has faced challenges, including losing his mother, adjusting to a new club, and a tough time while playing well but not fully fitting in at Atletico.", "Blues fans were sarcastically praised for him when he was sent off against Everton last month.", "Steve Bruce said he'd let the player go if the price matched expectations, emphasizing it wasn't his reaction."], "tinyllama:1.1b": ["According to Jesper Gronkjaer, Atlético Madrid has agreed to sign the Danish winger from Birkinham City during the January transfer window, subject to a medical and with an estimated transfer fee of around £1.4m.", "Groskjaer was initially signed by Birmingham City for around £2.2m but only played five months due to injuries.", "He has been targeted by fans and has recently received support from Blues supporters, which is reflected in his potential move away."], "tinydolphin:1.1b": [" In the January transfer window, Birmingham City manager Steve Bruce confirmed that Gronkjaer has agreed a switch to Atletico Madrid from Birmingham City.", "The 27-year-old winger spent just five months with the Blues following his £2.2m move from Chelsea in July and is set to sign for the Spanish side on a loan deal until the end of the season.", "Gronkjaer will not be signed until January 2018, subject to a medical.", "The winger has been heavily criticized by Blues fans due to his performances under Steve Bruce and will face a hostile reception upon his return to the Premier League."], "phi:2.7b": [" Jesper Gronkjaer, a Danish winger who moved from Chelsea to Birmingham City in July 2004, has agreed a move to Atletico Madrid during the January transfer window.", "The deal is rumoured to be around £1.4m, subject to a medical."], "orca-mini:3b": [" Jesper Gronkjaer has agreed to join Atletico Madrid from Birmingham City during the January transfer window after spending just five months at St Andrews following a £2.2m move from Chelsea in July.", "The Danish winger was targeted by Blues fans and sarcastically applauded when taken off against Everton last month.", "Steve Bruce, the manager of Birmingham City, has said that he would be happy to let Gronkjaer go if the price is right."], "hermes3:3b": ["Jesper Gronkjaer agrees move to Atletico Madrid, joining from Birmingham City during January transfer window."], "stablelm-zephyr:3b": ["Summary: Jesper Gronkjaer, the 27-year-old Danish winger, has agreed to move from Birmingham City to Atletico Madrid during the January transfer window.", "The £1.4m deal is subject to a medical.", "Gronkjaer spent five months at St Andrews after his £2.2m move from Chelsea in July 2004.", "Atletico's sporting director, Toni Munoz, will finalize the contract with Gronkjaer's representative and decide when he will sign.", "Blues fans were critical of Gronkjaer during his time at the club, and Steve Bruce, the team manager, stated that they would like to recoup most of their initial investment in Gronkjaer.", "The player struggled with personal issues after the loss of his mother and adjusting to a new club."], "chatgpt-4o-latest": ["Jesper Gronkjaer has agreed to move from Birmingham City to Atletico Madrid during the January transfer window for a reported £1.4m, pending a medical.", "The 27-year-old winger joined Birmingham from Chelsea for £2.2m in July after Euro 2004 but struggled to settle.", "Atletico sporting director Toni Munoz confirmed discussions to finalize the contract.", "Gronkjaer faced criticism from Birmingham fans, and manager Steve Bruce acknowledged his difficulties, including personal challenges, but insisted the decision to sell was not solely due to fan reaction.", "Bruce praised Gronkjaer's professionalism and hoped to recoup most of the transfer fee."], "stablelm2:1.6b": ["Jesper Gronkjaer has agreed to move from Birmingham City to Atletico Madrid during the January transfer window, reportedly worth £1.4m.", "The 1-year-old winger was previously at Chelsea and played for Denmark at Euro 2016.", "He will sign a contract with Atletico sporting director Toni Munoz once finalized by his representative.", "Boss Steve Bruce said it wasn't down to fan reaction; instead, Gronkjaer's tough time since the summer loss of his mother and adjusting to new clubs contributed to the decision."], "granite3.1-dense:2b": ["Jesper Gronkjaer, a 27-year-old Danish winger, has agreed to transfer from Birmingham City to Atletico Madrid during the January transfer window.", "The deal is reportedly worth approximately £1.4 million, contingent on a successful medical.", "Gronkjaer joined Birmingham in July for £2.2 million following his release from Chelsea.", "His tenure at St Andrews was brief, spanning only five months due to the challenges of adapting to a new city and club after his mother's death over the summer.", "Despite initial difficulties, he maintained consistency in training, earning positive feedback from Bruce.", "However, fans' reception was initially negative, often sarcastically applauding him when substituted.", "Manager Steve Bruce, acknowledging Gronkjaer's dedication and potential, agreed to let him go for the right price, expressing hope to recover some of their initial investment."]}