{"raw_text": "Campbell rescues Arsenal\n \n Sol Campbell proved to be an unlikely match-winner to earn Arsenal a hard-fought win at Portsmouth.\n \n The England defender lashed home a 25-yard shot for his first goal in 16 months to take Arsenal back into second spot, five points behind Chelsea. But before Campbell scored the best two chances of the game fell to Pompey striker Ricardo Fuller. In the first half he blasted wide when clear, and his control let him down in the second half when well placed. Portsmouth got plenty of bodies behind the ball to deny Arsenal space in the early stages. But their marking was slack at a corner and Patrick Vieira should have done better when the ball fell to him 16 yards out. A mistake by Arjan de Zeeuw let Thierry Henry in behind the Pompey defence on 17 minutes but as he bore down on goal Linvoy Primus got in a saving tackle. With just Fuller as an out-and-out striker, Portsmouth's shape made life difficult for Arsenal. But a delightful touch by Robin van Persie gave Henry a sight of goal, although the angle was too tight for his shot to trouble Jamie Ashdown.\n \n Ashdown caused hearts to flutter on 28 minutes when he missed his punch at a corner and Kolo Toure headed just wide and, as Arsenal began to press, Van Persie blasted over a good opportunity after Henry had set him up. Henry took a quick return pass from Vieira but Ashdown was out quickly to block, and there were some anxious seconds for Pompey as the ball ran loose before Matthew Taylor cleared. After playing second fiddle, Portsmouth should have taken the lead on 34 minutes. Referee Howard Webb played a good advantage to allow Steve Stone to send Gary O'Neil away but, having shrugged off Toure, the Pompey midfielder planted his shot wide from 10 yards. As half-time approached, Henry teased a shot through a ruck of players and inches wide. At the other end, Fuller broke clear but failed to hit the target as Toure closed him down.\n \n Fuller was given the best chance of the match so far on 48 minutes when Patrik Berger's break and slipped pass played him clear. But a poor first touch lost him the opportunity and even when he checked back and went down under Vieira's challenge, referee Webb was not interested. Fuller paid the price when he gave way on 55 minutes to Aiyegbeni Yakubu, who returned after six weeks out with a knee injury. But it needed alert reflexes and safe handling from Ashdown to cling on to Van Persie's shot as Henry sniffed for scraps.\n \n Portsmouth were growing in confidence and keeper Manuel Almunia had to stand his ground to beat away a powerful shot from Berger. Arsenal were struggling to find their rhythm but took the lead through the unlikely source of Campbell. The England defender needed little invitation as Pompey backed off to stride forward and lash a ferocious shot past Ashdown. Arsenal might have stretched their lead two minutes later when Mathieu Flamini escaped his marker to flash a header wide from Henry's free-kick. Almunia went full length to grab Berger's long-range shot, while Ashdown palmed away substitute Dennis Bergkamp's shot.\n \n Ashdown, Griffin, De Zeeuw, Primus, Taylor, Stone, O'Neil, Faye (Berkovic 83), Berger, LuaLua, Fuller (Yakubu 55).\n \n Subs not used: Hislop, Quashie, Cisse.\n \n Almunia, Lauren, Toure, Campbell, Cole, Pires, Flamini, Vieira, Clichy, Van Persie (Bergkamp 68), Henry.\n \n Subs not used: Lehmann, Fabregas, Senderos, Hoyte.\n \n Cole.\n \n Campbell 75.\n \n 20,170.\n \n H Webb (S Yorkshire).\n", "llama3.2:1b": ["Arsenal scored a hard-fought win against Portsmouth by winning the match 1-0.", "Ricardo Fuller was Portsmouth's best chance of scoring, but Patrick Vieira made several key saves to deny him.", "However, Thierry Henry provided Arsenal with a crucial goal when he blasted over a good opportunity on 28 minutes after Jamie Ashdown made an early save.", "Arsenal also had to deal with Portsmouth's striker Steve Stone being sent away for foul play, which allowed Gary O'Neil to break through and shoot wide from 10 yards.", "At the other end of the pitch, Campbell's 25-yard shot was the only goal of the match and Arsenal took a hard-fought win.", "Fuller had several chances but none of them were converted into goals, despite being involved in one of Portsmouth's best efforts on the ball."], "llama3.2:3b": ["Arsenal won at Portsmouth as Sol Campbell scored his first goal in 16 months, making a late 1-0 comeback from behind to earn the team a hard-fought win.", "Patrick Vieira missed a clear chance before Thierry Henry was denied by Jamie Ashdown's save on his return from injury.", "Ricardo Fuller had several good chances for Pompey but ultimately squandered them as Arsenal took control in the second half with Campbell scoring the winning goal in the 75th minute."], "gemma2:2b": ["Arsenal defeated Portsmouth in a tight match, with Sol Campbell scoring the winning goal after several missed chances for both sides.", "Fuller had the best opportunity for Portsmouth but failed to capitalize on it.", "Arsenal struggled to break through early and relied heavily on Campbell's strike.", "The win keeps Arsenal second in the league with five points behind Chelsea."], "qwen2.5:0.5b": ["A Portsmouth team with goalscorer Robin van Persie was looking to win the league when the England striker, now named Arsenal's defender Campbell, scored his first goal in over a month.", "This allowed Arsenal to regain their position at the top of League Two after a 5-point gap with Chelsea.", "The game began brightly for both sides as Portsmouth held possession well but struggled to find a way into the Arsenal rhythm.", "Their best chance came when Ashley Young slipped pass played across to full-back Billy Wright, who shot just wide.", "As the game progressed, Arsenal made some crucial saves and started to gain an advantage.", "But their goalkeepers were powerless against Manchester United goalkeeper Manuel Almunia, who kept out all of his shots.", "In the 48th minute, Arsenal's Mathieu Flamini crossed from the left and van Persie volleyed a header past Almunia for his first league goals as a player in his new club.", "Meanwhile, defender Robin van der Woude picked out another goal through defender Aiyegbeni Yakubu from the right and his own cross into the box.", "This was followed by a corner kick for goalkeeper Tom Wood who saved the ball after Yan Yousuf had been trying to score it.", "As the game progressed, Arsenal's best chance came when full-back Zinedine Zidane made a great move with the ball in his hands to shoot past Almunia into the top corner.", "This was followed by a header from Mathieu Flamini that was saved by Almunia but allowed van der Woude to add another goal.", "In the 75th minute, Arsenal's goalscorer, Robin van Persie, scored his second league goal as a player in his new club, beating referee Howard Webb.", "This was followed by a penalty for defender Ashley Newell who missed it and goalkeeper Manuel Almunia kept it out.", "In the 108th minute, Van Persie volleyed over from the penalty spot after an excellent opportunity had been taken.", "In the second half, Arsenal continued their dominant form as they made many more good shots that were well off target.", "They also made a couple of important saves to keep their lead up.", "However, Portsmouth's goalkeeping was strong and they would be able to take the game into extra time.", "In the end, Arsenal were victorious with their second league title since 2015 and their first ever League One title as a player in their new club.", "They held on to win by two goals to zero."], "qwen2.5:1.5b": ["Sol Campbell scores first goal in six months as Arsenal defeats Portsmouth 3-2 to move above Chelsea."], "qwen2.5:3b": ["Sol Campbell scored a crucial goal to help Arsenal beat Portsmouth 1-0.", "Despite early chances for Portsmouth's Ricardo Fuller and poor defending from their backline, Arsenal held on.", "Full-back Patrick Vieira missed an opportunity before Campbell’s late strike broke the deadlock.", "Portsmouth struggled without injured striker Ricardo Fuller and were outplayed by Arsenal until the final stages.", "The game attracted 20,170 spectators at the Stadium of Light, with Howard Webb as referee."], "opencoder:1.5b": ["The text is summarizing the following:\n\n\"Campbell rescues Arsenal.", "At first glance it seems like an unlikely match-winner, but there are some crucial details about how he scored his best two chances of the game.\"", "The important parts of the summary are Campbell's performance during the match (his scoring), the defensive line (Carmel), and the goal scorer (Arsenal).", "It preserves key ideas like the importance of performance on a team as a whole, and the role of individual players in determining a match's success."], "smollm:1.7b": ["The summary is concise and to the point, preserving key ideas and details of the original text while omitting unnecessary information.", "The main points are:\n\n1.", "Campbell rescues Arsenal\n\t* In the second half, Arsenal scored a 25-yard goal for their first win in 16 months.", "2.", "The England defender lashed home a 25-yard shot for his first goal in 16 months to take Arsenal back into second spot, five points behind Chelsea.", "3.", "The England defender proved to be an unlikely match-winner to earn Arsenal a hard-fought win at Portsmouth.", "4.", "Campbell scored the best two chances of the game fell to Arsenal's goalkeeper Ricardo Fuller.", "5.", "Before Campbell scored, Arsenal had already won 20 minutes and were ahead of their opponents by three points.", "6.", "The England defender was an unlikely match-winner because he proved to be an excellent striker and a good team player.", "7.", "Arsenal's marking was slack at the corner but they got plenty of bodies behind the ball to deny Arsenal space in the early stages.", "8.", "Portsmouth got plenty of bodies behind the ball to deny Arsenal space in the early stages, but Arsenal had more time to get into possession and create scoring opportunities.", "9.", "The England defender proved to be a good team player by playing well with his teammates and helping them win the game.", "10.", "Campbell was an excellent striker who helped Arsenal win the match.", "The summary does not include any information about the referee, the score of the match, or any other details that are important for understanding the text."], "deepseek-r1:1.5b": ["Sol Campbell proved an unlikely match-winner for Arsenal's hard-fought win against Portsmouth with his first goal in 16 months.", "Arsenal clinched the game 2-0 after fuller scored his first major goal in six weeks and a well-timed header from fulla gave another chance.", "The team struggled, especially with fuller failing to hit targets and key substitutions causing issues.", "Campbell made up for lost chances with van persie's spot-kick, while the opposing side managed to recover from some poor moments."], "tinyllama:1.1b": ["Cambell rescue Arsenal to a hard-fought win at Portsmouth with his first goal in 16 months, contributing to Pompey's control on the pitch.", "In the first half, they failed to score a clear goal but managed to deny Arsenal space through defensive mistakes.", "However, Arsenal manager Arsène Wenger took advantage of their lack of creativity and scored two goals in quick succession, both from Campt's headed shot.", "Pompeu midfielder Steve Stone also contributed with a penalty conversion, which kept Arsenal's lead in the match at 2-0 going into half-time.", "Despite losing a defender to injury, Portsmouth kept Arsenal on their toes throughout and eventually, Arsenal manager Arsène Wenger made substitutions to ensure they won the game 3-1."], "tinydolphin:1.1b": [" Arsenal 2-1 Pompey: A Tale of Two Half-Time Chances"], "phi:2.7b": [" The game between Arsenal and Portsmouth ended in a draw.", "Sol Campbell was the only goal scorer of the match for Arsenal.", "Both teams had their fair share of good chances to score, but unfortunately they couldn't convert them into goals.", "Portsmouth struggled with possession, and Arsenal were able to create more opportunities by pressing forward and maintaining their possession."], "orca-mini:3b": [" Sol Campbell rescued Arsenal from two-goal defeat with a goal on the last kick of the game at Portsmouth."], "hermes3:3b": ["Sol Campbell scores, helps Arsenal win against Portsmouth."], "stablelm-zephyr:3b": ["Sol Campbell scored a 25-yard goal for Arsenal, rescuing them from a potential defeat against Portsmouth.", "The match was hard-fought with both teams playing defensively.", "Portsmouth had two early chances, which were missed by Ricardo Fuller.", "Arsenal took the lead when Sol Campbell's shot beat Portsmouth goalkeeper Jamie Ashdown.", "Throughout the match, there were few clear opportunities until Campbell scored his goal and handed Arsenal the lead back after they had been trailing for much of the game."], "chatgpt-4o-latest": ["Sol Campbell scored a stunning 25-yard goal to secure a 1-0 victory for Arsenal against Portsmouth, moving them back to second place in the league.", "Portsmouth's Ricardo Fuller missed two key chances, while Arsenal struggled to break down a well-organized defense.", "Thierry Henry and Robin van Persie had opportunities, but Portsmouth goalkeeper Jamie Ashdown made crucial saves.", "Portsmouth grew in confidence, with Patrik Berger testing Arsenal's Manuel Almunia, but Campbell's powerful strike in the 75th minute sealed the win.", "Arsenal nearly extended their lead, but Portsmouth continued to press until the final whistle."], "stablelm2:1.6b": ["Sol Campbell scores a crucial goal for Arsenal in a 2-1 win against Portsmouth, helping the team return to second place by just five points.", "Ricardo Fuller had earlier equalized for Portsmouth but it was Campbell's decisive shot that sealed the victory.", "Arsenal's lead could have been extended when Mathieu Flamini made an assist; however, they managed to hold on to their lead with solid defending and goalkeeper performances."], "granite3.1-dense:2b": ["Sol Campbell scored Arsenal's crucial goal in a hard-fought 1-0 victory over Portsmouth at Fratton Park.", "Despite Portsmouth's defensive strategy, Arsenal's Thierry Henry had several chances, including an early header that narrowly missed the target and a shot that was blocked by Manuel Almunia.", "Campbell's match-winning goal came in the 75th minute after Patrick Vieira provided a pass following a break.", "Portsmouth's Ricardo Fuller was the best chance for the home team, with two missed opportunities early in the game, but failed to convert any of his chances.", "Arsenal maintained their second-place position in the Premier League, five points behind leaders Chelsea, with 20,170 spectators in attendance."]}