{"raw_text": "Blues slam Blackburn over Savage\n \n Birmingham have confirmed Blackburn made a bid for Robbie Savage - but managing director Karen Brady has called it \"derisory\".\n \n Rovers have reportedly offered £500,000 up front for the Wales star, 30, with the fee rising to £2.2m. But Brady told The Sun the bid was \"a waste of fax paper and my time\". She added: \"The way things are going all this could affect the relationship between the clubs. They've got into Robbie's head. But he's not for sale.\" Savage's future at Birmingham has been the source of speculation for several weeks, with some fans criticising his performances for the club earlier in the season. However, good displays against West Brom and Aston Villa have impressed Blues fans. \"The crowd gave me a massive standing ovation when I came off on Saturday which was nice,\" he said. \"It was fantastic even though I was criticised by a number of them in recent weeks and on Saturday it showed how much I mean to them. \"It's not for me to say (about transfer rumours), it's between the two clubs. \"I haven't created the speculation myself, I haven't phoned every national newspaper saying, 'Blackburn are trying to buy me'. It's not up to me.\" Birmingham manager Steve Bruce insists he does not want to sell Savage. \"A lot is said and written about Sav but he has been terrific for Birmingham City the last two and a half years,\" he said.\n \n \"The fans love him because he epitomises them. He works hard, They like people like that and there are not many like him. \"And why the hell should I sell him to someone else? I am not interested.\"\n", "llama3.2:1b": ["Birmingham manager Karen Brady has rejected a £2.2m bid from Blackburn for Robbie Savage, describing it as \"derisory\" due to concerns about their relationship.", "Despite speculation that Savage may be leaving Birmingham, his future at the club seems secure.", "Manager Steve Bruce also rejects the idea of selling Savage, citing his on-field performances and fan support."], "llama3.2:3b": ["Birmingham City managing director Karen Brady has rejected a £2.2m bid from Blackburn for Robbie Savage, calling it \"derisory\".", "Savage's future at the club has been speculated due to poor performances earlier in the season, but good recent displays have won over fans.", "Manager Steve Bruce insists he doesn't want to sell Savage, saying he's \"terrific\" and a key part of the team who embodies the club's spirit."], "gemma2:2b": ["Blackburn Rovers have bid £500,000 up front for Robbie Savage, but Birmingham's managing director Karen Brady rejected the offer as \"derisory\".", "Brady confirmed she believes Blackburn have tried to manipulate Savage into considering a move.", "The player himself stated he's not for sale and has received support from fans.", "Birmingham manager Steve Bruce also denied interest in selling Savage."], "qwen2.5:0.5b": ["•  Birmingham made a bid for Robbie Savage but it was \"derisory\", meaning Brady called it a waste of time.", "• Rovers have offered £500, 000 up front for Savage.", "The fee could rise to £2.", "2 million.", "• Fans believe Savage is not available and speculation is high about his future at Birmingham City.", "• Steven Bruce believes he doesn't want to sell Savage.", "• Fans love him as a defender, because he works hard and everyone likes people like that."], "qwen2.5:1.5b": ["Blackburn bid £500,000 for Savage but was rejected by Birmingham's managing director; Brady called the offer \"derisory\".", "Fans appreciate Savage despite criticism during his tenure at Birmingham; manager Bruce insists he doesn't want to sell Savage."], "qwen2.5:3b": ["Blues deny Blackburn's £500,000 bid for Robbie Savage, who has impressed with recent performances.", "Despite speculation, Savage insists he hasn't initiated transfer rumors and maintains strong support from Birmingham fans.", "Manager Steve Bruce confirms the club does not want to sell Savage."], "opencoder:1.5b": ["\"Blues slam Blackburn over Savage: Birmingham have confirmed Blackburn made a bid for Robbie Savage - but managing director Karen Brady has called it 'derisory'.", "Rovers have reportedly offered £500,000 up front for the Wales star, 30.", "The way things are going all this could affect the relationship between the clubs.", "They've got into Robbie's head.", "He's not for sale.", "Fans criticised his performances for the club earlier in the season.", "Good displays against West Brom and Aston Villa have impressed Blues fans.", "'The crowd gave me a massive standing ovation when I came off on Saturday which was nice,' he said.", "'It was fantastic even though I was criticised by a number of them in recent weeks and on Saturday it showed how much I mean to them.", "It's not for me to say about transfer rumours, it's between the two clubs.", "I haven't created the speculation myself, I haven't phoned every national newspaper saying, 'Blackburn are trying to buy me'.", "It's not up to me.'", "Birmingham manager Steve Bruce insists he does not want to sell Savage.\""], "smollm:1.7b": ["Here is the summary:\n\nBBC Sports has confirmed that Blackburn have made a bid for Robbie Savage - but managing director Karen Brady has called it \"derisory\".", "Robbie Savage, 30, has reportedly offered £500,000 up front for the Wales star, 30, with the fee rising to £2.2m.", "But Brady told The Sun the bid was \"a waste of fax paper and my time\".", "She added: \"The way things are going all this could affect the relationship between the clubs.\"", "They've got into Robbie's head.", "But he's not for sale.", "Rovers have reportedly offered £500,000 up front for the Wales star, 30, with the fee rising to £2.2m.", "But Brady told The Sun the bid was \"derisory\".", "She added: \"The way things are going all this could affect the relationship between the clubs.\"", "They've got into Robbie's head.", "But he's not for sale.", "Good displays against West Brom and Aston Villa have impressed Blues fans.", "\"The crowd gave me a massive standing ovation when I came off on Saturday which was nice,\" he said.", "\"It was fantastic even though I was criticized by a number of them in recent weeks and on Saturday it showed how much I mean to them.\"", "It's not for me to say (about transfer rumors), it's between the two clubs.", "BBC Sports has confirmed that Blackburn have confirmed Robbie Savage has made a bid for Robbie Savage - but managing director Karen Brady has called it \"derisory\"."], "deepseek-r1:1.5b": ["Blues Slam Blackburn over Robbie Savage  \nBlackburn has offered £500k up front for Robbie Savage, but is considering a £2.2m fee.", "Karen Brady says the bid is \"derisory.\"", "Savage's future at Birmingham City remains under speculation, with fans criticizing him earlier in the season.", "Blues fans are impressed by his performances against West Brom and Aston Villa but are unsure if they should sell him to another club.", "Steve Bruce insists he won't sell Savage."], "tinyllama:1.1b": ["According to Birmingham Football Club's management team, Manchester United and Chelsea have both made offers for Robbie Savage, but the Bluebirds have reportedly offered a wretched £500,000 up front.", "However, Blues boss Karen Bradley claims this bid is \"waste of fax paper and my time\".", "She also insists that transfer rumours surrounding Savage are false and does not want to sell him.", "The Rovers' fan base has been vocal in their praise for the Welsh star, but some fans have criticized his performances for the club.", "Despite the transfer rumors, Savage was hailed by many for good performances against West Brom and Villa.", "The Blues boss is reportedly not interested in selling him to any of the two clubs mentioned, stating that he is not for sale."], "tinydolphin:1.1b": [" Birmingham manager Steve Bruce insists he does not want to sell Robbie Savage, stating that the fans love him because of his dedication and hard work.", "He claims that the Blues have reached out to Blackburn Rovers regarding a potential bid for the Wales international but has yet to make an official offer.", "However, Brady, the managing director of Birmingham, seems unimpressed by Savage's current form and criticized him earlier in the season.", "Despite this, it is not clear what the outcome of the negotiations will be as both clubs have been reluctant to comment on the situation."], "phi:2.7b": [" Birmingham has confirmed Blackburn making a bid for Robbie Savage but Karen Brady has dismissed it as derisory.", "Rovers reportedly offered £500,000 up front for Savage's transfer fee rising to £2.2m.", "However, Brady believes the bid is a waste of time and calls for an end to speculation about his future at Birmingham City."], "orca-mini:3b": [" Blues manager Steve Bruce has confirmed that Blackburn made a bid for Robbie Savage but the offer was deemed \"derisory\" by managing director Karen Brady.", "The bid was reportedly worth £500,000 up front and potentially rising to £2.2m.", "However, Brady said that the deal would affect the relationship between the clubs and that Savage himself might be affected by the speculation.", "Some fans had criticised Savage's performances earlier in the season but he has since impressed with good displays against West Brom and Aston Villa."], "hermes3:3b": ["Birmingham disowns Blackburn's derisory bid for Robbie Savage, claiming it as \"waste of fax paper\"."], "stablelm-zephyr:3b": ["Birmingham has rejected Blackburn's bid for Robbie Savage, with Karen Brady calling it \"derisory\".", "Rovers offered £500,000 up front and a total of £2.2m, but Birmingham manager Steve Bruce and Wales player Savage himself both expressed that they do not want Savage to leave.", "Earlier in the season, some fans criticized Savage's performances, but recent good displays have improved his standing among Blues supporters.", "The speculation about a transfer is not something Savage created, according to an interview with Birmingham City Fan Channel."], "chatgpt-4o-latest": ["Birmingham have rejected Blackburn's bid for Robbie Savage, calling it \"derisory.\"", "Blackburn reportedly offered £500,000 upfront, rising to £2.2m, but Birmingham's managing director Karen Brady dismissed it as a waste of time.", "She accused Blackburn of unsettling Savage but insisted he is not for sale.", "Savage's future has been uncertain, with mixed fan reactions, though recent performances have won supporters back.", "Savage denied fueling transfer speculation, saying it's between the clubs.", "Birmingham manager Steve Bruce praised Savage's contributions and made it clear he has no intention of selling him."], "stablelm2:1.6b": ["Birmingham rejected a £2.2m bid from Blackburn for Robbie Savage, with managing director Karen Brady calling it \"derisory\".", "Rovers offered up-front fee of £1m and could have raised it further, while Birmingham's Steve Bruce insists he doesn 't want to sell the player who epitomizes his fans' values."], "granite3.1-dense:2b": ["Blackburn Rovers reportedly made a £500,000 upfront bid for Birmingham City's Robbie Savage, with potential future payments of £2.2m.", "However, Birmingham managing director Karen Brady dismissed the offer as \"derisory\" and warned it could strain club relations.", "She emphasized that Savage is not for sale.", "Despite recent fan criticism due to subpar performances, Savage has recently impressed with strong displays against West Brom and Aston Villa.", "He acknowledged the crowd's support during his substitutions in those matches but stated he doesn't initiate transfer rumors.", "Birmingham manager Steve Bruce firmly declared he has no intention of selling Savage, praising him as a fan favorite who embodies hard work and team spirit, with Birmingham fans appreciating such qualities."]}