{"raw_text": "Mexicans tracking unhappy Juninho\n \n Mexican outfit Red Sharks Veracruz hope to sign Juninho if the Brazilian decides to leave Celtic frustrated at his lack of first-team action.\n \n Their president, Gustavo Parente Sanchez, says Juninho \"does not wish to remain in Scottish football anymore\". Agent Brian Hassell insists that the 31-year-old Brazilian midfielder is determined to win back his place. \"But, if the manager is not going to pick him, that's a different ball game,\" he told The Sun. \"That's something we'd have to look at. Juninho deserves respect. He is not a little kid.\" Hassell warns that Juninho could reconsider his future at Celtic unless he is given a run of games by the end of the January transfer window.\n \n Juninho was signed from Middlesbrough during the summer, but he has failed to live up to high expectations and has lost his place to 18-year-old Aiden McGeady. \"He has 50 caps for Brazil and he's the best signing Celtic ever made,\" insisted Hassell. \"He wants to play for Martin O'Neill, but does Martin O'Neill want to play him? \"Juninho is not someone who has come through the Celtic ranks. He deserves much more respect.\" Sanchez is bullish about his hopes of prising Juninho from the Scottish champions, although Hassell believes Mexico would not be his preferred destination. \"We have already spoken with Juninho and he said, if he has no firm offer from a club in Spain, Veracruz will be his destination,\" Sanchez told his club's official website. Celtic manager O'Neill is no respecter of reputations. \"The onus is on Juninho to force his way into the team,\" he said. \"Players get a game on merit. That's the way it has always been and that is certainly the case at Celtic Park.\"\n", "llama3.2:1b": ["Mexican outfit Red Sharks Veracruz are interested in signing Brazilian midfielder Juninho if he leaves Celtic, despite his lack of first-team action.", "His agent Brian Hassell says Juninho \"deserves respect\" but believes a run of games by the end of January would change his decision.", "Juninho was signed from Middlesbrough and has 50 caps for Brazil, but is reportedly unhappy at Celtic and wants to play for Martin O'Neill, who he thinks would be more likely to give him game time."], "llama3.2:3b": ["Mexican outfit Red Sharks Veracruz hope to sign Juninho from Celtic if he doesn't regain first-team action, agent Brian Hassell says.", "Juninho signed with Celtic in summer but has lost his place to Aiden McGeady due to poor form.", "Hassell warns that Mexico could be a destination for Juninho if he is not given more game time by the end of January."], "gemma2:2b": ["Red Sharks Veracruz, a Mexican club, are interested in signing Juninho if he leaves Celtic.", "Juninho's agent states that he desires to stay and earn a place in the team.", "However, his agent also says that if the manager does not offer him playing time, they will consider other options.", "Juninho has been unable to secure a consistent position at Celtic due to competition from Aiden McGeady.", "Juninho's agent suggests that Mexico could be his preferred destination if he doesn't secure a move in Europe.", "The Celtic manager insists players must earn their place in the team based on merit and performance."], "qwen2.5:0.5b": ["Mexican outfit Red Sharks Veracruz hope to sign Juninho, who is unhappy with Celtic manager Martin O'Neill's decision not to sign him in January.", "Agent Brian Hassell insists Juninho \"does not wish to remain in Scottish football anymore\" and that if he leaves Celtic, he would be looking for a different club.", "Coach Gustavo Parente Sanchez says Juninho \"deserves respect\" but believes his contract with Celtic is more important than his future at the club."], "qwen2.5:1.5b": ["Red Sharks Veracruz hopes to sign Juninho from Celtic if the Brazilian midfielder decides to leave due to lack of first-team action, citing respect for his credentials as Brazil's best signing ever but demanding a chance."], "qwen2.5:3b": ["Mexican outfit Red Sharks Veracruz aims to sign unhappy Brazilian midfielder Juninho from Celtic, who have failed to incorporate him due to Aiden McGeady's emergence.", "Juninho’s agent insists he deserves more respect and a game, while Celtic manager Martin O'Neill believes players should earn their place through performance.", "Juninho has 50 caps for Brazil but lacks a firm offer elsewhere, with Sanchez hinting Veracruz as his preferred destination despite Hassell’s belief that Spain would be his first choice."], "opencoder:1.5b": ["Mexicans tracking unhappy Juninho: A Mexican outfit Red Sharks Veracruz hope to sign Juninho if the Brazilian decides to leave Celtic frustrated at his lack of first-team action.", "Their president, Gustavo Parente Sanchez, says Juninho \"does not wish to remain in Scottish football anymore\".", "Agent Brian Hassell insists that the 31-year-old Brazilian midfielder is determined to win back his place.", "\"But, if the manager is not going to pick him, that's a different ball game,\" he told The Sun.", "\"That's something we'd have to look at.", "Juninho deserves respect.", "He is not a little kid.\"", "Hassell warns that Juninho could reconsider his future at Celtic unless he is given a run of games by the end of the January transfer window.", "Juninho was signed from Middlesbrough during the summer, but he has failed to live up to high expectations and has lost his place to 18-year-old Aiden McGeady.", "\"He has 50 caps for Brazil and he's the best signing Celtic ever made,\" insisted Hassell.", "\"He wants to play for Martin O'Neill, but does Martin O'Neill want to play him?", "\"Juninho is not someone who has come through the Celtic ranks.", "He deserves much more respect.\"", "Sanchez is bullish about his hopes of prising Juninho from the Scottish champions, although Hassell believes Mexico would not be his preferred destination.", "\"We have already spoken with Juninho and he said, if he has no firm offer from a club in Spain, Veracruz will be his destination,\" Sanchez told his club's official website.", "Celtic manager O'Neill is no respecter of reputations.", "\"The onus is on Juninho to force his way into the team,\" he said.", "\"Players get a game on merit.", "That's the way it has always been and that is certainly the case at Celtic Park.\""], "smollm:1.7b": ["Mexicans tracking unhappy Juninho"], "deepseek-r1:1.5b": ["Juninho is unsatisfied at Celtic with his lack of first-team activity and frustration about moving to Scottish football.", "The Spanish outfit Red Sharks hope to sign him if he leaves.", "Juninho was from Middlesbrough but hasn't made caps, with Aiden McGeady instead.", "The club president believes Juninho deserves respect, but concerns arise if he doesn't land in January.", "Celtic manager O'Neill is content with the player's potential."], "tinyllama:1.1b": ["Mexican outfit Red Sharks Veracruz are planning to sign Juninho, the Brazilian midfield player who recently joined them during the summer transfer window.", "Junior is not currently in their first-team squad, and Red Sharks Veracruz president Gustavo Parentes Sanchez claims that he deserves respect despite Juninho's lack of first-team action so far.", "He also warns him to prove his worth or risk losing his place to 18-year-old Aiden McGeady.", "Juninho has previously played for Midlestown, but Sanchez believes that he deserves better treatment at Celtic Park.", "The club's manager O'Neill is not necessarily against Junior's staying at the Spanish club, as they have had previous talks about his potential move to Veracruz.", "However, Juninho does not see himself as a top-level player and has expressed his intentions of seeking a new challenge elsewhere."], "tinydolphin:1.1b": [" This text is an overview of an article about Brazilian footballer Juninho, who was signed by Celtic but has not had much impact on the team.", "The author mentions that Celtic may have a hard time keeping him if they don't receive a suitable offer from another club in Spain or Veracruz.", "He also discusses how Mexico would be his preferred destination despite previous statements about Celtic."], "phi:2.7b": [" The article reports that Red Sharks Veracruz, a Mexican football club, wants to sign Brazilian midfielder Juninho from Celtic as they believe he deserves more respect.", "Agent Brian Hassell insists that Juninho is determined to regain his place in Scottish football, but only if he receives proper chances and recognition.", "However, the new Mexican president, Gustavo Parente Sanchez, has already confirmed his intention of offering Juninho a contract, which could force Celtic to look for another solution."], "orca-mini:3b": [" Mexican outfit Red Sharks Veracruz hope to sign Juninho if the Brazilian decides to leave Scottish champions Celtic frustrated at his lack of first-team action.", "Their president, Gustavo Parente Sanchez, says Juninho \"does not wish to remain in Scottish football anymore\" and wants to play for Martin O'Neill.", "Aiden McGeady has replaced him in the team.", "Hassell insists that Juninho deserves respect, but he believes Mexico would not be his preferred destination."], "hermes3:3b": ["Red Sharks Veracruz interested in signing unhappy Brazilian footballer Junino, if he leaves Celtic without first-team action."], "stablelm-zephyr:3b": ["Mexican club Red Sharks Veracruz may sign Brazilian midfielder Juninho from Celtic if he decides to leave due to lack of first-team action.", "Agent Brian Hassell highlights Juninho's desire to play for Martin O'Neill but emphasizes that the 31-year-old deserves more respect from the team.", "President Gustavo Parente Sanchez is confident in their chances of signing Juninho, although Hassell mentions that Mexico isn't the player's preferred destination.", "If Juninho doesn't receive a firm offer from a Spanish club, Veracruz will be his choice.", "Celtic manager O'Neill puts the onus on Juninho to earn his place in the team through merit."], "chatgpt-4o-latest": ["Mexican club Red Sharks Veracruz are interested in signing Juninho if he decides to leave Celtic due to a lack of first-team opportunities.", "Veracruz president Gustavo Parente Sanchez claims Juninho no longer wants to stay in Scottish football, but his agent Brian Hassell insists the midfielder is determined to fight for his place.", "However, Hassell warns that Juninho may reconsider his future if he is not given regular playing time by the end of the January transfer window.", "Juninho, who joined Celtic from Middlesbrough in the summer, has struggled to meet expectations and lost his spot to 18-year-old Aiden McGeady.", "Hassell argues that Juninho, with 50 Brazil caps, deserves more respect and questions whether manager Martin O’Neill wants to play him.", "Sanchez is confident about signing Juninho, though Hassell suggests Mexico is not his preferred destination.", "Sanchez claims Juninho will join Veracruz if he does not receive a firm offer from a Spanish club.", "O’Neill, however, insists that selection at Celtic is based on merit and that Juninho must earn his place in the team."], "stablelm2:1.6b": ["Mexican club Red Sharks Veracruz seeks Brazilian midfielder Juninho if he chooses to leave Scottish team Celtic, despite his lack of first-team action.", "Agent Brian Hassell insists that Juninho will win his place back but warns about manager's decisions.", "Juninho signed from Middlesbrough this summer has failed expectations and lost place to Aiden McGeady.", "Celtic manager O'Neill prefers meritocracy in football."], "granite3.1-dense:2b": ["Red Sharks Veracruz, a Mexican soccer team, aims to sign Brazilian midfielder Juninho from Celtic due to his dissatisfaction with limited first-team opportunities.", "His agent, Brian Hassell, asserts that Juninho desires regular playing time but acknowledges the manager's potential reluctance to bench him.", "Hassell warns that unless Juninho sees consistent game time by January, he may reconsider his future at Celtic.", "Juninho, a 50-cap veteran of Brazil and considered one of Celtic's best signings, has been outshone by younger Aiden McGeady.", "Despite this, Celtic manager Martin O'Neill emphasizes that players earn their places through merit rather than reputation.", "Veracruz president Gustavo Parente Sanchez is confident in securing Juninho's services but expects Mexico as his preferred location."]}