{"raw_text": "Celtic unhappy over Bulgaria date\n \n Martin O'Neill hopes to block Stilian Petrov's call-up by Bulgaria during Celtic's busy festive programme.\n \n The Celtic manager does not view the friendly against Valenciana - a region of Spain - on 28 December as important. \"I can't say I was overly pleased at the fixture being played just after Christmas,\" said O'Neill. \"We will have to speak with the Bulgarian FA. It's their prerogative for them to arrange a fixture and our prerogative how we handle it.\" Bulgaria's game comes between Celtic's Boxing Day meeting with Hearts and their 2 January fixture against Livingston. O'Neill believes the extra game will not help a midfielder whose season has already been affected by injury. \"They have organised a game at a rather awkward time,\" he added. \"When we were out playing Barcelona, I spoke with the Bulgarian manager, Hristo Stoichkov, and he mentioned this game to me. \"We pay his wages, we are the ones that if an awkward fixture is going to be played at some stage or another it should be to our benefit, rather than anyone else. \"I have said this before, but Bulgaria are the one nation who seem to organise a lot of friendly games.\"\n", "llama3.2:1b": ["Celtic manager Martin O'Neill is unhappy with Bulgaria's call-up for a 28 December game due to its timing and scheduling."], "llama3.2:3b": ["Celtic manager Martin O'Neill hopes to block Stilian Petrov's call-up for Bulgaria due to concerns about the timing of their match against Valenciana on December 28.", "The extra game is seen as awkward and may further affect Petrov, who has already suffered from injury this season."], "gemma2:2b": ["Celtic manager Martin O'Neill opposes Bulgaria's game against Stilian Petrov scheduled between Celtic's Boxing Day and January 2nd fixtures due to its timing and potential effect on Petrov's injury recovery.", "He hopes to block the match with the Bulgarian FA, emphasizing that this is their responsibility."], "qwen2.5:0.5b": ["Celtic's Martin O'Neill hopes not to use his game against Bulgarian team Valenciana for an extra game during the season.", "He believes it won't help a midfielder hurt by injury after Celtic played Barcelona and Barcelona organised a game with him instead."], "qwen2.5:1.5b": ["Celtic manager Martin O'Neill opposes Bulgarian call-up due to Christmas fixture between Celtic and Valenciana on December 28th, hoping it won't affect Petrov's schedule."], "qwen2.5:3b": ["Celtic manager Martin O'Neill expresses dissatisfaction over Bulgaria's upcoming friendly against Valenciennes on 28 December during Celtic's busy festive schedule.", "O'Neill believes the fixture occurs awkwardly between Celtic’s Boxing Day match with Hearts and their January 2 game against Livingston.", "He argues that such a date would not benefit Celtic, given the club pays Stilian Petrov's wages and suggests it should be advantageous to them rather than other clubs like Bulgaria."], "opencoder:1.5b": ["Martin O'Neill hopes to block Stilian Petrov's call-up by Bulgaria during Celtic's busy festive programme.", "The Celtic manager views the friendly against Valenciana on 28 December as important.", "Martin said that he was overly pleased at the fixture being played just after Christmas and requested a consultation with the Bulgarian FA for arrangements.", "The extra game between Celtic's Boxing Day meeting with Hearts and their 2 Januaryfixture against Livingston is not likely to help a midfielder whose season has already been affected by injury.", "Hristo Stoichkov suggested this game, but it was agreed upon by both parties."], "smollm:1.7b": ["Celtic manager Martin O'Neill hopes to block Stilian Petrov's call-up by Bulgaria during Celtic's busy festive programme."], "deepseek-r1:1.5b": ["Celtic manager Martin O'Neill is upset over a Bulgaria match on Boxing Day, fearing it might not be crucial given injuries.", "He plans to block Stilian Petrov's call-up but isn't certain about the Bulgarian fixture between Celtic and Hearts.", "O'Neill believes an awkward fixture shouldn't be taken for someone else's benefit.", "\"I can't say I was overly pleased,\" he said.", "\"We'll have to talk with the Bulgarian FA.\""], "tinyllama:1.1b": ["Celtić unsatisfied with Bulgaria friendly date"], "tinydolphin:1.1b": [" Celtic manager Martin O'Neill has expressed concerns about the decision by Bulgarian FA to schedule a friendly match against Stilian Petrov's Celtic team just after Christmas.", "The match is scheduled for December 28 and O'Neill believes it will not be in Celtic's favor as they have an upcoming Boxing Day encounter with Hearts, while a midfielder whose season has already been affected by injury is having a game against Livingston on January 2."], "phi:2.7b": [" Celtic manager Martin O'Neill is hoping to block Bulgarian midfielder Stilian Petrov's call-up during their busy festive programme.", "He believes the extra game against Bulgaria will not help a player whose season has already been affected by injury and is pleased that they are playing their prerogative as opposed to anyone else's."], "orca-mini:3b": [" Celtic manager Martin O'Neill hopes to block Stilian Petrov's call-up by Bulgaria during their busy festive programme.", "The two sides will meet on 28 December, just after Christmas, and the extra game could cause an injury to the midfielder for Bulgaria."], "hermes3:3b": ["Celtic manager opposed to Bulgaria calling Stilian Petrov for friendly during busy festive schedule."], "stablelm-zephyr:3b": ["Celtic manager Martin O'Neill is unhappy about Bulgaria's decision to schedule a friendly game between the two teams just after Christmas, as he believes it will not help the injured midfielder involved.", "O'Neill plans to speak with the Bulgarian FA to address the scheduling and insists that Celtic should benefit from such an awkward fixture arrangement."], "chatgpt-4o-latest": ["Celtic manager Martin O'Neill hopes to prevent Stilian Petrov from joining Bulgaria for a friendly against Valenciana on 28 December, as it falls during Celtic's busy schedule.", "O'Neill questions the importance of the match and plans to discuss the issue with the Bulgarian FA.", "The game is scheduled between Celtic's fixtures against Hearts on Boxing Day and Livingston on 2 January.", "Concerned about Petrov's fitness after injuries, O'Neill criticizes Bulgaria for frequently organizing friendlies and insists that club commitments should take priority."], "stablelm2:1.6b": ["Celtic manager Martin O'Neill aims to block Stilian Petrov's call-up by Bulgaria during Celtic's busy festive schedule as he does not view the game against Valenciana as important.", "O'Neil believes that an extra game will not help a midfielder affected by injury, and they must speak with the Bulgarian FA regarding scheduling.", "The Bulgaria match comes between Celtic's Boxing Day meeting with Hearts and their 2 January fixture against Livingston."], "granite3.1-dense:2b": ["Celtic manager Martin O'Neill expresses dissatisfaction with Bulgaria's scheduled 28 December friendly match against Valenciana, Spain.", "The game falls between Celtic's Boxing Day and 2 January fixtures, coinciding with midfielder Stilian Petrov's injury recovery.", "O'Neill plans to discuss this matter with the Bulgarian FA, emphasizing that scheduling such a match at an inconvenient time is not beneficial for Celtic, who pay Petrov's wages.", "This isn't the first instance of Bulgaria arranging unusual fixtures; O'Neill previously noted their propensity for organizing them."]}