{"raw_text": "Newcastle line up Babayaro\n \n Newcastle manager Graeme Souness is closing in on signing Chelsea defender Celestine Babayaro when the transfer window reopens.\n \n Souness is bidding to bolster his defence and, according to reports, contract negotiations are at an advanced stage with the player. Babayaro has been in the Premiership since 1997 when he moved to Chelsea for £2.25m from Anderlecht. But the 26-year-old has been surplus to requirements this season. Souness would not be drawn on specifics over individual players.\n \n But he said: \"All I can tell you is that the chairman has worked really hard in the last couple of months to try to do deals. \"We have said from day one we want to strengthen, and that is what we are hoping to do in the coming weeks.\"\n", "llama3.2:1b": ["Newcastle manager Graeme Souness is closing in on signing Chelsea defender Celestine Babayaro after contract negotiations with Anderlecht reached an advanced stage."], "llama3.2:3b": ["Newcastle manager Graeme Souness is closing in on signing Chelsea defender Celestine Babayaro with contract negotiations at an advanced stage, aiming to bolster his team's defense."], "gemma2:2b": ["Newcastle manager Graeme Souness is close to signing Chelsea defender Celestine Babayaro when the transfer window opens.", "The 26-year-old has been surplus to requirements at Chelsea this season and Souness hopes to strengthen his defense with him."], "qwen2.5:0.5b": ["Graeme Souness, Newcastle manager, is considering signing Chelsea defender Celestine Babayaro after the transfer window reopens.", "The player has been with the club since 1997 but has spent a season with them at £2.", "25m."], "qwen2.5:1.5b": ["Graeme Souness plans to sign Chelsea defender Celestine Babayaro for Newcastle when the transfer window opens.", "Negotiations with the player are advanced, but specific details of individual deals were not provided.", "Babayaro has been surplus since moving from Anderlecht in 1997 to Chelsea for £2.25m."], "qwen2.5:3b": ["Newcastle manager Graeme Souness is close to signing Chelsea defender Celestine Babayaro when the transfer window reopens.", "The 26-year-old has been with Chelsea since 1997 and is surplus to requirements this season.", "Newcastle aims to strengthen its defense, though specific players have not been named.", "Chairman efforts to make signings in the last few months are noted, with Souness hoping to finalize deals in coming weeks."], "opencoder:1.5b": ["Newcastle line up Babayaro\n\nNewcastle manager Graeme Souness closes in on signing Chelsea defender Celestine Babayaro when the transfer window reopens.", "According to reports, Souness has advanced contract negotiations and the player has been in the Premier League since 1997 when he moved to Chelsea for £2.25m from Anderlecht.", "However, the 26-year-old has surpassed his set expectations this season.", "Souness would not be drawn on specifics over individual players.", "He says: \"All I can tell you is that the chairman has worked really hard in the last couple of months to try to do deals.", "We have said from day one we want to strengthen, and that is what we are hoping to do in the coming weeks.\""], "smollm:1.7b": ["The summary above preserves key ideas and details:\n\n1.", "The manager Graeme Souness is bidding to sign Chelsea defender Celestine Babayaro when the transfer window reopens.", "2.", "Souness is bidding to bolster his defence and, according to reports, contract negotiations are at an advanced stage with the player.", "3.", "Babayaro has been in the Premiership since 1997 when he moved to Chelsea for £2.25m from Anderlecht.", "4.", "Souness would not be drawn on specifics over individual players."], "deepseek-r1:1.5b": ["Graeme Souness is considering a potential transfer for Celestine Babayaro, aiming to bolster Newcastle's defense as the transfer window opens.", "The player has been at Chelsea since 1997, moving from Anderlecht for £2.25m.", "There are rumors of contract negotiations with Babayaro.", "Souness mentioned chairman efforts and plans to strengthen the team from day one.", "He won't share details but hopes to work on him."], "tinyllama:1.1b": ["Newcastle manager Graeme Souness is planning to sign Chelsea defender Celestiine Babayaro when the transfer window reopens.", "According to reports, contract negotiations are at an advanced stage with the player, and Souness intends to bolster his squad with the 26-year-old who was born in Belgium but has been playing for Anderlecht since 1997.", "As for specific players, Souness declined to comment on individual deals, stating that he is merely working to strengthen the team."], "tinydolphin:1.1b": [" Newcastle manager Graeme Souness is looking to bolster his defense by signing Chelsea defender Celestine Babayaro when the transfer window reopens.", "In recent reports, the player's contract has expired and negotiations have reached an advanced stage with the club.", "Souness has previously been linked with a move for Manchester United's DeAndre Yedlin, but it remains unclear whether he will pursue that option or prioritize Babayaro."], "phi:2.7b": [" Newcastle manager Graeme Souness is close to signing Chelsea defender Celestine Babayaro when the transfer window reopens as he aims to strengthen his team's defence.", "The player has been with Chelsea since 1997 but has not played at a high level this season.", "However, Souness will not provide specific details and the chairman is also working on securing deals for other players."], "orca-mini:3b": [" Newcastle is close to signing Celestine Babayaro from Chelsea when the transfer window reopens.", "Souness is trying to improve his defense by negotiating with Babayaro.", "However, he refused to reveal specific details about individual players."], "hermes3:3b": ["Newcastle nearing contract for Chelsea defender Babayaro.", "Souness aims to bolster defence."], "stablelm-zephyr:3b": ["Newcastle's manager, Graeme Souness, is reportedly close to signing Chelsea defender Celestine Babayaro during the upcoming transfer window.", "Babayaro has been with Chelsea since 1997 and is expected to bolster Newcastle's defense.", "Contract negotiations between the player and the club are said to be at an advanced stage."], "chatgpt-4o-latest": ["Newcastle manager Graeme Souness is close to signing Chelsea defender Celestine Babayaro when the transfer window reopens.", "Negotiations are reportedly at an advanced stage as Souness looks to strengthen his defence.", "Babayaro, who joined Chelsea from Anderlecht in 1997 for £2.25m, has been deemed surplus to requirements this season.", "While Souness did not confirm specific targets, he acknowledged the club's efforts to secure new signings in the coming weeks."], "stablelm2:1.6b": ["Newcastle manager Graeme Souness nears signing Chelsea defender Celestine Babayaro after contract negotiations advance, aiming to strengthen defense.", "Babayaro has been in Premiership since 2007 when moving from Anderlecht but became a backup this season; no specifics on individual players mentioned by Souness."], "granite3.1-dense:2b": ["Newcastle manager Graeme Souness is nearly finalizing a transfer for Chelsea's 26-year-old defender, Celestine Babayaro.", "The player has been with Chelsea since 1997, signing for £2.25m from Anderlecht.", "With Babayaro deemed surplus to requirements this season, Souness is confident in completing the deal during the upcoming transfer window.", "Chairman's efforts have led to these advancements, and Souness reaffirmed Newcastle's commitment to strengthen their defense."]}