{"raw_text": "Lewsey puzzle over disallowed try\n \n England's Josh Lewsey has claimed he was denied a late try in his side's Six Nations loss to Ireland.\n \n The Wasps wing insisted he grounded the ball when he was bundled over the line and said referee Jonathan Kaplan had made a wrong decision. \"I'm positive I touched the ball down over the line,\" Lewsey told BBC Sport. \"It certainly wasn't a turnover. \"I was driven over and I put the ball on the ground. The whistle went and I let go of the ball.\" Lewsey added: \"One of the Irish players scooped it back after the whistle and to our surprise the referee then gave a turnover. \"As far as I'm concerned, that incident and Mark Cueto's effort from Charlie Hodgson's cross-field kick that led to what looked like a good try were the two key elements in the game.\"\n \n Cueto was also puzzled as to why his try had been disallowed by Kaplan. \"I don't think I could have been offside for, without a doubt, I was behind the ball,\" said the Sale player. \"The move was a planned technique, it was not off the cuff. We rehearse it time and time again. \"I wouldn't say we were robbed, some decisions go with you and some go against you. Today they went against us and that's tough at international level.\"\n", "llama3.2:1b": ["Josh Lewsey claims he was denied a late try by referee Jonathan Kaplan in the Six Nations match against Ireland due to a disputed ground ball.", "Lewsey says he grounded the ball after being tackled, but the Irish players then scooped it back.", "Referee Kaplan disallowed his try and ruled it a turnover."], "llama3.2:3b": ["Josh Lewsey of England claims he was denied a late try in their Six Nations loss to Ireland due to a referee's decision, stating he grounded the ball over the line but was ruled as a turnover.", "Sale player Mark Cueto also had his try disallowed after claiming it was not offside and was part of a planned technique."], "gemma2:2b": ["Josh Lewsey of England believes a try was disallowed in their Six Nations loss to Ireland.", "He claims he grounded the ball while being driven over, while Irish players scooped up the ball after the whistle.", "Mark Cueto of Sale also disputed his try being disallowed, citing offside and planned technique."], "qwen2.5:0.5b": ["England's Josh Lewsey claims he grounded the ball when he was bundled over the line in their Six Nations loss to Ireland.", "He says referee Jonathan Kaplan made a wrong decision, while his team had another Irish player scoop it back after the whistle.", "Cueto was puzzled by the disallowed try and doesn't believe he could have been offside."], "qwen2.5:1.5b": ["England's Josh Lewsey claims he made a late try but was denied due to referee Jonathan Kaplan's ruling on whether the ball had been grounded, leading to concerns about the fairness of International Rugby decisions."], "qwen2.5:3b": ["England's Josh Lewsey claimed he was denied a late try in his side’s Six Nations loss to Ireland, insisting he grounded the ball when tackled over the line.", "Referee Jonathan Kaplan had ruled it a turnover instead.", "Wasps wing said Kaplan made a wrong decision and that one of the Irish players scooped up the ball after the whistle.", "Sale player Mark Cueto was also puzzled about his try being disallowed, arguing he wasn't offside and rehearsed the move repeatedly.", "He felt decisions went against their team at an international level."], "opencoder:1.5b": ["\"Lewsey puzzle over disallowed try in a game involving England's Josh Lewsey\"\n\nEngland's Josh Lewsey was denied a late try in a Six Nations loss to Ireland following his attempt to ground the ball when he was dragged off the pitch and said that ref.", "Jonathan Kaplan made an incorrect decision.", "He confirmed this through a statement on BBC Sport, stating that it wasn't a turnover.", "\"I am confidently saying I touched the ball down over the line.\"", "He then added: \"One of the Irish players scooped it back after the whistle and surprised the referee to have a turnover.\"", "The player dismissed the incident as a result of two primary elements in the game – the attempt at grounding the ball and the ref'erence decision."], "smollm:1.7b": ["Lewsey claimed he was denied a late try in his side's Six Nations loss to Ireland.", "England's Josh Lewsey said he was driven over and put the ball on the ground after the whistle, but later claimed Mark Cueto's effort from Charlie Hodgson's cross-field kick that led to what looked like a good try were the key elements in the game.", "The Wasps team insisted Lewsey touched the ball down over the line when he was bundled over the line and said referee Jonathan Kaplan had made a wrong decision.", "\"I'm positive I touched the ball down over the line,\" Lewsey told BBC Sport.", "\"It certainly wasn't a turnover.\"", "Lewsey added: \"One of the Irish players scooped it back after the whistle and to our surprise the referee then gave a turnover.", "As far as I'm concerned, that incident and Mark Cueto's effort from Charlie Hodgson's cross-field kick that led to what looked like a good try were the two key elements in the game.\"", "Cueto was also puzzled as to why his try had been disallowed by Kaplan.", "\"I don't think I could have been offside for, without a doubt, I was behind the ball,\" said the Sale player.", "\"The move was a planned technique, it was not off the cuff.", "We rehearse it time and time again.", "\"I wouldn't say we were robbed, some decisions go with you and some go against you.", "Today they went against us and that's tough at international level.\""], "deepseek-r1:1.5b": ["Lewsey was denied a late try in his side's Six Nations loss to Ireland due to an incorrect penalty by Jonathan Kaplan.", "He claimed he grounded the ball incorrectly, stating it wasn't a turnover but instead gave a turnover when an Irish player picked up the ball after the whistle.", "Cueto explained that his try was disallowed because it wasn't offside, and he believed the kick used was part of their planned technique.", "Kaplanski's confusion stemmed from thinking it might be against him for not following their usual strategy."], "tinyllama:1.1b": ["Josh Lewsey claimed he was denied a late try in England's loss to Ireland due to incorrect decision-making from the referee.", "The Wasps wing insisted he grounded the ball when he was bundled over by an Irish player and said Kaplan incorrectly ruled out the turnover.", "Lewsey added that the disallowed attempt came as a surprise, with Cueto also unsure why his try had been ruled out."], "tinydolphin:1.1b": [" In the Six Nations match between England and Ireland, Josh Lewsey claimed he was denied a late try by referee Jonathan Kaplan.", "The Wasps wing insisted he touched the ball down when he was bundled over the line, while Kaplan said he made the wrong decision.", "According to Lewsey, \"I'm positive I touched the ball down over the line,\" but Kaplan ruled out the turnover as well as Hodgson's kick."], "phi:2.7b": [" Lewsey claims he should have been allowed a late try in his side's Six Nations loss to Ireland as the referee disallowed it due to a turnover by an Irish player.", "Cueto, also confused, says he was offside during his try.", "Both players were disappointed by the decision and acknowledge that some decisions can be tough at international level."], "orca-mini:3b": [" England's Josh Lewsey claimed he was denied a late try in his side's Six Nations loss to Ireland.", "Lewsey convinced himself that he grounded the ball when he was bundled over the line and said referee Jonathan Kaplan made an incorrect decision.", "\"I am certain I touched the ball down,\" Lewsey stated.", "\"It wasn't a turnover.\"", "The Wasps wing added that one of Irish players scooped it back after the whistle and to his amazement, the referee then awarded a turnover.", "\"Mark Cueto's try was disallowed by the referee as well,\" Cueto said.", "\"I don't think I could have been offside for without a doubt, I was behind the ball.\""], "hermes3:3b": ["Josh Lewsey denied try in England-Ireland Six Nations match, claims he grounded ball before being tackled and insists referee made wrong decision."], "stablelm-zephyr:3b": ["England's Josh Lewsey claimed he was denied a late try in the Six Nations match against Ireland.", "He said referee Jonathan Kaplan made a wrong decision, as he believed he grounded the ball when pushed over the line.", "Lewsey also mentioned Mark Cueto's disallowed try due to a controversial call from the referee regarding an offside.", "Both players expressed their dissatisfaction with the decisions that went against them during the game."], "chatgpt-4o-latest": ["England's Josh Lewsey claimed he was wrongly denied a late try in their Six Nations loss to Ireland, insisting he grounded the ball before an Irish player scooped it back.", "He criticized referee Jonathan Kaplan's decision, believing it was a key moment in the game.", "Mark Cueto also questioned why his try from Charlie Hodgson's cross-field kick was disallowed, asserting he was onside and that the move was rehearsed.", "While disappointed, Cueto acknowledged that decisions can go either way in international rugby."], "stablelm2:1.6b": ["Winger Josh Lewsey claims he was denied a late try in England's Six Nations loss to Ireland due to incorrect decision by referee Jonathan Kaplan.", "Lewsey believes he grounded the ball when tackled, with an Irish player scooping it back before the ref giving a turnover.", "Both Lewsey and Cueto questioned why their tries were disallowed while others went unnoticed."], "granite3.1-dense:2b": ["Josh Lewsey, an England wing, contends he scored a try during their Six Nations match against Ireland but was incorrectly ruled a turnover by referee Jonathan Kaplan.", "Lewsey asserts he grounded the ball when being tackled and that Irish players retrieved it after the whistle.", "Mark Cueto, another England player, also questioned the disallowed try, claiming he was onside and the play was premeditated, not a spontaneous reaction.", "Both players view the non-award of their potential tries as significant, with Lewsey deeming it alongside Charlie Hodgson's cross-field kick to Cueto as crucial game elements."]}