{"raw_text": "Bell set for England debut\n \n Bath prop Duncan Bell has been added to England's 30-man squad to face Ireland in the RBS Six Nations.\n \n And with Phil Vickery sidelined for at least six weeks with a broken arm and Julian White out with a neck injury, Bell could make his England debut. Bell, 30, had set his sights on an international career with Wales. But last December, the International Rugby Board confirmed that he could only be eligible for England as he had travelled on tour with them in 1998. England coach Andy Robinson could take a gamble and call inexperienced Sale Sharks prop Andrew Sheridan into his front row. But Sheridan favours the loosehead side of the scrum and a more likely scenario is for uncapped Bell - who was among the tryscorers when England A beat France A 30-20 nine days ago - to be drafted in. Robinson also has an injury worry over centre Olly Barkley, who withdrew from Bath's starting line-up to face Gloucester last weekend.\n \n He was due to have a hospital scan on Monday, while Gloucester centre Henry Paul, who started at fly-half against Bath, limped out at Kingsholm because of an ankle problem. Despite Barkley's three missed penalties in the 18-17 defeat against France, he is expected to retain his place at inside centre, although Leicester's in-form prospect Ollie Smith would be an obvious replacement. Bath coach John Connolly rates Barkley as no better than a 50/50 chance to make the Dublin trip. Uncapped fly-half Andy Goode has been named in a 30-man training squad for the Ireland game, and he strengthened his selection claims by kicking 28 points during Leicester's record 83-10 win against Newcastle on Sunday. England's players are due to meet at their Surrey training base on Monday.\n", "llama3.2:1b": ["Bath prop Duncan Bell is added to the England 30-man squad ahead of an Ireland match, with coach Andy Robinson considering inexperienced prop Andrew Sheridan in the front row.", "Centre Olly Barkley faces injury concerns and is expected to retain his place, while fly-half Ollie Smith could replace him if he misses out."], "llama3.2:3b": ["Duncan Bell has been added to England's 30-man squad to face Ireland in the RBS Six Nations, possibly making his debut after traveling with the team in 1998.", "With Phil Vickery and Julian White injured, Bell could replace Andrew Sheridan or start at prop.", "Centre Olly Barkley is expected to retain his place despite a poor performance against France, but may be replaced by Ollie Smith if he suffers an injury."], "gemma2:2b": ["Duncan Bell has been added to England's 30-man squad for the Ireland game, he may make his debut.", "Phil Vickery and Julian White's injuries open the door for Bell, with Andrew Sheridan as another option.", "Olly Barkley's ankle injury is a concern, leading to potential replacements like Ollie Smith.", "Andy Goode's impressive performance for Leicester strengthens his selection claims.", "England players will meet at their Surrey training base on Monday."], "qwen2.5:0.5b": ["England's 30-man squad is set for a clash with Ireland in the RBS Six Nations.", "Duncan Bell, who was set to debut for Wales, could make his international debut if he can secure a hospital scan on Monday.", "Bath coach Andy Robinson plans to call upon Andrew Sheridan as a loosehead side and uncapped prop Duncan Bell, while Leicester's Ollie Smith would be an obvious replacement.", "England's players are expected to meet at their Surrey training base on Monday."], "qwen2.5:1.5b": ["Bath prop Duncan Bell set to make England debut in RBS Six Nations match against Ireland, replacing injured Phil Vickery and Julian White.", "Robinson considers uncapped Bell as a likely starting option despite age and injury concerns with Barkley.", "Connolly rates Barkley as 50/50 chance for Dublin trip; Goode's training squad call strengthens his selection claims.", "England meeting at Surrey base on Monday."], "qwen2.5:3b": ["Bath prop Duncan Bell has been added to England's squad for the RBS Six Nations match against Ireland, potentially making his debut after Phil Vickery and Julian White are sidelined.", "Bell was initially eligible for Wales but became eligible for England in 1998 through a tour.", "Coach Andy Robinson may consider Andrew Sheridan or uncapped Duncan Bell for the front row.", "Olly Barkley, who played as an inside centre last week, could return after recovering from ankle injury; Ollie Smith from Leicester is considered as a potential replacement.", "Fly-half Andy Goode has been named in England's training squad and showed promise with 28 points against Newcastle.", "The team will meet at their Surrey training base on Monday."], "opencoder:1.5b": ["Bell set for England debut: To face Ireland in the RBS Six Nations.", "England coach Andy Robinson can take a gamble and call inexperienced Sale Sharks prop Andrew Sheridan into his front row.", "The International Rugby Board confirmed that he could only be eligible for England as he had travelled on tour with them in 1998.", "England coach John Connolly rates Barkley as no better than a 50/50 chance to make the Dublin trip.", "England's players are due to meet at their Surrey training base on Monday."], "smollm:1.7b": ["Bell set for England debut"], "deepseek-r1:1.5b": ["Bell was selected for England's debut in the Six Nations with a strong case due to his international career with Wales.", "He aimed to join the 30-man squad facing Ireland but faced IRB constraints as he had traveled with Wales.", "The team includes young star Duncan Bell, who is among tryscorers when England beat France earlier.", "Bell was expected to make an impact at the front row, and Robinson considered Sheridan or other replacements.", "Bath's lineup suffered from three missed penalties and center issues, but coach Connolly rates his chance of making the trip as 50-50.", "Other key players like Goode made their selections.", "The squad is set to meet on Monday for training updates."], "tinyllama:1.1b": ["Summary: Bath prop Duncan Bell, who was ruled ineligible for England due to a broken arm and neck injury, is set to make his debut during the RBS Six Nations match against Ireland on February 1.", "The International Rugby Board (IRB) confirmed that he could only be eligible for England as he had travelled on tour with Wales in 1998.", "England coach Andy Robinson has a gamble of uncapped Bath prop Andrew Sheridan into his front row, while centre Olly Barklay is likely to miss the match due to ankle trouble.", "Leicester fly-half Andy Goode has been named in an 30-man training squad for the Ireland game, with Bath coach John Connoelly ranking Barklay as no better than a 50/50 chance of making the Dublin trip.", "The players are set to meet at their Surrey training base on Monday."], "tinydolphin:1.1b": [" A summary of this text is: England rugby team announced the addition of Duncan Bell, a Welsh prop, to their squad for the upcoming Six Nations match against Ireland.", "The 30-man squad also includes Phil Vickery, who has been sidelined due to an injury and is set to miss at least six weeks.", "This adds to England's 30-man squad list and potentially boosts their chances of winning the Six Nations title."], "phi:2.7b": [" England coach Andy Robinson may take a chance with uncapped prop Duncan Bell in the upcoming RBS Six Nations game against Ireland, as Phil Vickery and Julian White are sidelined due to injuries.", "Although Bell was initially set to play for Wales, he can only be eligible for England because of his previous tour with them in 1998.", "Robinson also has concerns about Olly Barkley's ankle injury but Leicester prop Henry Paul is expected to start at fly-half."], "orca-mini:3b": [" Bath prop Duncan Bell has been added to England's 30-man squad to face Ireland in the RBS Six Nations, with Olly Barkley ruled out through injury and Andy Goode named in a 30-man training squad."], "hermes3:3b": ["Duncan Bell included in England 30-man squad for Ireland RBS Six Nations match.", "Bell could make debut due to Phil Vickery and Julian White injuries."], "stablelm-zephyr:3b": ["Duncan Bell, a Bath prop, has been added to England's 30-man squad for the RBS Six Nations match against Ireland.", "With Phil Vickery sidelined and Julian White unavailable, Bell could make his debut.", "Although he originally aimed for an international career with Wales, he became eligible for England in 1998 when he toured with them.", "England coach Andy Robinson may opt to use uncapped Andrew Sheridan or risk Ollie Smith as alternatives.", "Centre Olly Barkley is also injured but expected to retain his place due to three missed penalties against France.", "Uncapped fly-half Andy Goode has been named in a 30-man training squad for the Ireland game, bolstering his selection claims."], "chatgpt-4o-latest": ["Bath prop Duncan Bell has been added to England's 30-man squad for the RBS Six Nations match against Ireland, with a potential debut due to injuries sidelining Phil Vickery and Julian White.", "Bell, previously aiming for a Wales career, was confirmed eligible for England by the IRB.", "Coach Andy Robinson may also consider inexperienced prop Andrew Sheridan, though Bell is the more likely choice.", "England also faces injury concerns over centre Olly Barkley and Gloucester's Henry Paul.", "Despite Barkley's recent struggles, he is expected to retain his place, with Ollie Smith as a possible replacement.", "Uncapped fly-half Andy Goode has been included in the squad after an impressive performance for Leicester.", "England's squad will convene for training on Monday."], "stablelm2:1.6b": ["Duncan Bell, a Bath prop, has been added to England's \"England-7\" squad for the match against Ireland in the RBS Six Nations.", "With Phil Vickery and Julian White sidelined by injuries, Bell could make his debut.", "He had previously targeted a Wales career but his eligibility changed so he can play for England.", "Andrew Sheridan is another option as he favors the loosehead side of the scrum.", "Coach Andy Robinson may opt for an inexperienced player like Bell or shift Barkley to inside center in case of injury.", "Ollie Smith could be a replacement if Barkley doesn.."], "granite3.1-dense:2b": ["Duncan Bell, a 30-year-old prop from Bath, has been included in England's 30-man squad for the upcoming RBS Six Nations match against Ireland.", "This selection is due to Phil Vickery's six-week injury and Julian White's neck injury.", "Bell had initially targeted a Welsh international career but can now play for England, having been part of their 1998 tour.", "He scored tries in England A's recent victory over France A, making him a likely debutant.", "England coach Andy Robinson might also consider uncapped prop Andrew Sheridan, who favors the loosehead position.", "Centre Olly Barkley, however, faces uncertainty due to ankle issues from last weekend's match against Gloucester and is awaiting a hospital scan.", "Despite three missed penalties in that game, he is expected to retain his position at inside center, with Ollie Smith as a potential replacement.", "Fly-half Andy Goode, named in the training squad, has been impressive, scoring 28 points during Leicester's dominant 83-10 win over Newcastle.", "England players will convene at their Surrey training base on Monday to prepare for the Ireland match."]}