{"raw_text": "Jones happy with Henson heroics\n \n Wales fly-half Stephen Jones admitted he was happy to hand Gavin Henson responsibility for taking the match-winning kick against England.\n \n Jones had missed three earlier shots at goal when Wales, 9-8 down, were awarded a long-range penalty with four minutes left in Cardiff. \"I knew the percentages of Gavin reaching it were far higher than me,\" Jones said. \"When he said he wanted it, there were no problems.\" Jones had seen a long-range effort fall a whisker under the crossbar on the hour, before Charlie Hodgson put England in front with 10 minutes left. \"I looked at where it was and I knew I was going to struggle to make it,\" Jones added. \"I said to Gareth (Thomas, the Wales captain) 'This is touch and go.' It was out of my range and obviously Gavin is phenomenal when it comes to distance. He was confident and fancied it. \"There were no questions that he'd miss it the way he was playing. He had a superb game.\" Jones was happy to hail Henson's heroic contribution to Wales' first win over England in Cardiff since 1993. \"Physically he's a specimen: he's a balanced player, he glides when he runs and obviously he's got a great kicking game as well,\" Jones said.\n \n \"His defence was superb, he made some great hits and he had a great game. \"I'm glad he's Welsh.\" Victory over England for the first time since 1999 will no doubt fuel expectations of what Wales might achieve in this year's Six Nations. But they now face three away fixtures in Italy, France and Scotland before completing their campaign against Ireland in Cardiff. \"People all over the world want to see Wales back at the top table of world rugby,\" said a proud coach Mike Ruddock. \"But we are not there yet. The next step is finding the consistency to get further wins. \"We have to travel this week and we can't afford to get too giddy about this result. \"We have got to be professional and keep focused on facing Italy.\"\n \n None more so than Henson, who can now expect to have the same sort of spotlight thrust upon him as the likes of Jonny Wilkinson and Brian O'Driscoll. The confident 23-year-old is undaunted by the prospect of dealing with such weighty expectations however. \"I'm the sort of player who likes pressure on me,\" he said. \"It makes me more concentrated and I think I perform better under more pressure. \"I set a high standard against England and I've got to back it up next week. \"Two years ago when we played Italy I wasn't involved and we lost, so we've got to put that right next week.\"\n", "llama3.2:1b": ["Jones happy with Henson's performance\nHenson awarded match-winning kick by Wales Jones happy for Henson's contribution to the win over England.", "Henson said he was confident in his ability to reach the ball when asked.", "Henson credited his defense and kicking game for his success.", "Jones praised Henson as a \"specimen\" with great physical attributes, gliding ability, and a superb kicking game.", "The Wales victory will fuel expectations of Welsh performance next year's Six Nations.", "Henson can expect more attention from fans if he continues to perform well"], "llama3.2:3b": ["Stephen Jones praises Gavin Henson's heroic kick in Wales' 9-8 win over England, calling him a \"phenomenal\" kicker with a \"superb game\".", "Jones also notes that Henson is balanced and has great defensive skills.", "Mike Ruddock emphasizes the need for consistency to build on this result, saying they must remain focused on facing Italy's next match."], "gemma2:2b": ["Stephen Jones was happy for Gavin Henson to take the match-winning kick against England as he had a higher success rate in long-range penalties.", "Henson scored the winning kick after Wales were awarded a penalty with four minutes left in their match.", "This win is only their second over England since 1999 and will fuel expectations but they now have to focus on future games, starting with Italy.", "Gavin Henson expects to face similar pressure from fans as other stars of the sport."], "qwen2.5:0.5b": ["Stephen Jones is happy with Gavin Henson's heroic contribution in the match against England, praising his kicking game and physical attributes.", "He expects Wales' first win since 1993, and now focuses on their upcoming away fixtures in Italy, France, and Scotland before finishing their campaign against Ireland.", "The coach Mike Ruddock praises Jones' performance under pressure, while Henson is pleased to have the same level of attention given him as other experienced players like Jonny Wilkinson and Brian O'Driscoll."], "qwen2.5:1.5b": ["Stephen Jones praises Gavin Henson's heroics in Wales' 39-32 win over England, leading the team past a two-year losing streak with their first Six Nations victory since 1999.", "Despite missing crucial kicks earlier in the game, Jones believes Henson was confident and successful when given responsibility for the match-winning penalty, which secured the Welsh team's first win against English national champions after an absence of over three decades."], "qwen2.5:3b": ["Jones praised Henson for taking Wales' match-winning penalty kick in the win over England.", "Jones admitted he was confident Henson had a higher chance of scoring than himself.", "Ruddock emphasized the need for consistency moving forward despite this victory.", "Henson, now under increased media attention, expressed readiness to handle such pressure and ambitions."], "opencoder:1.5b": ["Jones has been happy with Henson's heroics over the past match.", "After Gavin had taken the match-winning kick against England, he was happy to hand Henson's responsibility for taking Wales' first win in Cardiff.", "After missing three earlier shots, Jones said he knew the percentages of Gavin reaching it were far higher than him.", "He looked at where it was and there were no problems.", "However, Charlie Hodgson put England in front with 10 minutes left on the hour.", "It was out of his range and obviously Gavin is phenomenal when it comes to distance.", "He was confident and fancied it, \"There were no questions that he'd miss it the way he was playing.\"", "In the defence, Jones made some great hits and had a fantastic game, \"I'm glad he's Welsh.\"", "The next step will no doubt fuel expectations of what Wales might achieve in this year's Six Nations campaign.", "But they now face three away fixtures in Italy, France and Scotland before completing their campaign against Ireland in Cardiff.", "Henson has consistently done well, keeping Gavin focused on facing Italy.", "He said that it makes him more concentrated and he thinks he performs better under more pressure, \"I set a high standard against England and I've got to back it up next week.\"", "This will certainly fuel expectations of what Wales might achieve next season."], "smollm:1.7b": ["Jones was happy with Henson's heroic contribution to Wales' first win over England in Cardiff since 1993 because he believed Gavin Henson had a superb game."], "deepseek-r1:1.5b": ["Jones successfully handled a penalty kick challenge when Wales fell 9-8 in Cardiff with four minutes remaining.", "He missed three shots but demonstrated confidence, especially his ability to handle distance, as he led the penalty taker to victory.", "Jones was happy with Gavin Henson's impressive performance and is looking forward to their first victory over England since 1993.", "The team will face three away matches in Italy before facing Ireland in Cardiff."], "tinyllama:1.1b": ["The Welsh team was happy with their heroic efforts by fly-half Gavin Henson in the victory over England.", "Speaking about Henson's performance, Wales captain Mike Ruddock said that the fly-half had taken three missed shots at goal and showed confidence and fancies them to be out of reach.", "Welsh coach Mike Ruddock believes that Henryson is now ready for bigger challenges such as facing Italy and Scotland in their upcoming matches.", "He is aware of his own high standards, stating that he set a high bar for himself against England, but will perform better under pressure next week when they face Italy."], "tinydolphin:1.1b": [" Wales manager Mike Ruddock praised Gavin Henson for his heroic kick against England, which secured a much-needed win.", "\"His kicking game was phenomenal and he made some great hits,\" said Ruddock.", "\"Physically he's a specimen—he's a balanced player with great vision and his defence was superb.\"", "Henson also contributed to Wales' offense with an impressive touch and goal-scoring ability, according to the coach.", "Despite facing significant pressure from England, Henson delivered a key moment for Wales, which will serve as motivation for the team's upcoming matches."], "phi:2.7b": [" Stephen Jones admitted he was happy to hand Gavin Henson responsibility for taking the match-winning kick against England, which Wales won 9-8 in Cardiff.", "Henson's game had been superb, with a balanced approach, great kicking ability and a successful long-range penalty in the first half.", "However, there were still three away fixtures to face before Ireland.", "Despite this, coach Mike Ruddock was optimistic about Wales' future as a top rugby nation and hoped that this win would fuel further success.", "Henson, at only 23 years old, showed no sign of being intimidated by the expectations that came with his performance, and was confident in his ability to back up high standards against Italy next week."], "orca-mini:3b": [" Jones was happy with Henson's heroics, praising his physicality, defensive skills, and kicking game.", "Wales faced three away fixtures in Italy, France, and Scotland before completing their campaign against Ireland in Cardiff.", "Henson can now expect to have the same sort of spotlight thrust upon him as Jonny Wilkinson and Brian O'Driscoll."], "hermes3:3b": ["Jones happy for Henson's heroics in Wales' win over England.", "Henson had better range and confidence for match-winning kick."], "stablelm-zephyr:3b": ["Stephen Jones was content with giving Gavin Henson the responsibility of scoring the match-winning kick against England.", "Henson had a remarkable game, displaying his skills as a player who runs smoothly, makes hits in defense, and has a strong kicking game.", "Coach Mike Ruddock emphasized the need for consistency and cautioned his team not to get too carried away after their victory over England.", "Henson remained confident under the weight of high expectations and aimed to back up his performance against Italy next week."], "chatgpt-4o-latest": ["Wales fly-half Stephen Jones was happy to let Gavin Henson take the decisive long-range penalty that secured a 11-9 victory over England, their first in Cardiff since 1993.", "Jones had missed earlier attempts and acknowledged Henson's superior range and confidence.", "Henson's overall performance, including strong defense and kicking, was praised by Jones and coach Mike Ruddock.", "The win raises expectations for Wales in the Six Nations, but Ruddock emphasized the need for consistency with upcoming away matches.", "Henson, unfazed by increased attention, welcomed the pressure and aimed to maintain his high standards in the next game against Italy."], "stablelm2:1.6b": ["Wales fly-half Stephen Jones is happy with Gavin Henson's crucial kick in the match against England, as Henson displayed exceptional skills both defensively and offensively.", "Wales won 9-8, marking their first win over England since 1995 in Cardiff.", "Coach Mike Ruddock hopes for more consistency from his team to achieve further wins in this year's Six Nations tournament.", "The next challenge is finding the necessary focus amid pressure."], "granite3.1-dense:2b": ["Wales fly-half Stephen Jones expressed satisfaction with teammate Gavin Henson's successful long-range kick against England, which secured Wales' first victory over their rivals in Cardiff since 1993.", "Despite his own poor performance in earlier attempts, Jones trusted Henson's exceptional distance-kicking skills and believed he had a better chance of making the crucial penalty.", "Jones praised Henson's overall contribution to the match, highlighting his strong defense and athletic abilities.", "Coach Mike Ruddock emphasized the importance of maintaining consistency to achieve further wins in the Six Nations, with Italy, France, Scotland, and Ireland awaiting Wales on their upcoming away fixtures.", "Henson, a confident 23-year-old, embraces pressure and aims to build on his impressive performance against England, particularly seeking to prevent similar results in future matches."]}