{"raw_text": "England 'to launch ref protest'\n \n England will protest to the International Rugby Board (IRB) about the referee's performance in the defeat by Ireland, reports the Daily Mail.\n \n England coach Andy Robinson has called on ex-international referees Colin High and Steve Lander to analyse several of Jonathan Kaplan's decisions. \"I want to go through the tape with Colin and Steve,\" Robinson told the Daily Mail. \"I want to speak to the IRB about it. I think only one side was refereed.\" High, the Rugby Football Union's referees' manager, claimed Kaplan made three major errors which changed the outcome of Sunday's match. England were beaten 19-13 by the Irish in Dublin, their third straight defeat in the 2005 Six Nations. \"The International Rugby Board will be disappointed,\" High told the Daily Mail. \"Jonathan Kaplan is in the top 20 in the world but that wasn't an international performance. \"It would not have been acceptable in the Zurich Premiership. \"If one of my referees had done that, I would have had my backside kicked for making the appointment. \"If any English referee refereed like that in a European match, there would be an inquest. No question about that. \"If someone had performed like that, he would have been pulled from the next game.\"\n", "llama3.2:1b": ["England's rugby coach Andy Robinson will protest to the International Rugby Board over Jonathan Kaplan's performance during England's 19-13 defeat to Ireland.", "High and Lander, ex-international referees who analyzed several of Kaplan's decisions, are calling for a review."], "llama3.2:3b": ["England will protest to the IRB over Jonathan Kaplan's refereeing performance in their 19-13 defeat by Ireland, citing three major errors made by Kaplan which changed the outcome of the match."], "gemma2:2b": ["England will protest to the International Rugby Board (IRB) about the performance of referee Jonathan Kaplan in their recent loss against Ireland.", "England's coach, Andy Robinson, has requested analysis by ex-international referees Colin High and Steve Lander.", "High asserts that Kaplan made three major errors that influenced the game's outcome.", "He criticizes Kaplan's performance as failing international standards and comparing it to performances in domestic leagues."], "qwen2.5:0.5b": ["England's coach Andy Robinson is calling on ex-international referees Colin High and Steve Lander to analyze Jonathan Kaplan's decisions in their ref protest against the loss of Ireland at Six Nations.", "The Irish won 19-13 by a margin of 20 points, with England having beaten them 19-13 in Dublin four years ago.", "England is disappointed that Jonathan Kaplan performed poorly and lost the position he held as a referee on Sunday.", "Robinson wants to speak to the International Rugby Board (IRB) about this and believes it would not be acceptable if only one side was refereed by someone other than himself.", "In response, High claims that Jonathan Kaplan made three major errors in his decisions which changed the outcome of the game, but argues that these were not international performances.", "He also suggests that if English referees had performed like that in an European match, there would be an inquest."], "qwen2.5:1.5b": ["England will protest to the International Rugby Board over referee Jonathan Kaplan's performance in their Six Nations defeat by Ireland."], "qwen2.5:3b": ["England will protest to the IRB against referee Jonathan Kaplan's performance in their 19-13 loss to Ireland in the Six Nations, claiming three major errors changed the match outcome.", "Ex-international referees Colin High and Steve Lander analyzed tapes and claimed Kaplan made mistakes that affected the game’s result.", "England coach Andy Robinson wants to speak with IRB about it; High stated Kaplan's performance was unacceptable for an international game and would have resulted in severe consequences if committed by one of his own referees."], "opencoder:1.5b": ["England will protest to the International Rugby Board (IRB) about the referee's performance in the defeat by Ireland, reports the Daily Mail.", "England coach Andy Robinson has called on ex-international referees Colin High and Steve Lander to analyse several of Jonathan Kaplan's decisions.", "\"I want to go through the tape with Colin and Steve,\" Robinson told the Daily Mail.", "\"I want to speak to the IRB about it.", "I think only one side was refereed.\"", "High, the Rugby Football Union's referees' manager, claimed Kaplan made three major errors which changed the outcome of Sunday's match."], "smollm:1.7b": ["The summary is concise and to the point, preserving key ideas and details of the original text.", "It does not provide explanations or justifications for the referee's performance, nor does it offer opinions or reasoning processes.", "The main points are conveyed through a clear and straightforward language."], "deepseek-r1:1.5b": ["England will launch a protest against the International Rugby Board (IRB) over the referee's performance in a 2005 Six Nations defeat by Ireland.", "England's coach Andy Robinson has instructed ex-international referees Colin High and Steve Lander to review kapton's decisions, which were found to have three major errors leading to their loss to Ireland 19-13.", "The IRB expressed disappointment with kapton's performance as it was not an international one, stating he was in the top 20 but not an international referee.", "England will report this matter to the IRB, and if kapton had done such an incident elsewhere, including Europe, there would be serious repercussions."], "tinyllama:1.1b": ["England will launch a ref protest against Ireland's performance in the defeat by England, citing the actions of former international referees Colin High and Steve Lander as the basis.", "The International RuGBy Board (IRB) has been asked to investigate the \"major errors\" made by Kaplan during the match.", "England coach Andy Robinson has called for a meeting with ex-international referees Colin High and Steve Lander to discuss the performance of Kaplan.", "The IRB has been informed that \"if one of [High's] referees had performed like that in an European match, he would have been pulled from the next game.\""], "tinydolphin:1.1b": [" England launches a protest to the International Rugby Board (IRB) over their defeat against Ireland in the Six Nations Championship.", "High, the Referees' Manager for the Rugby Football Union, claims Kaplan made three major errors that changed the outcome of the match.", "The IRB is disappointed by Kaplan's performance and may impose a sanction on him if his behavior is deemed unsatisfactory."], "phi:2.7b": [" England will protest to the International Rugby Board (IRB) against the referee's performance in their defeat by Ireland, where only one side was refereed and three major errors were made by Jonathan Kaplan according to ex-international referees Colin High and Steve Lander."], "orca-mini:3b": [" England will protest to the International Rugby Board (IRB) about the referee's performance in the defeat by Ireland, reports the Daily Mail."], "hermes3:3b": ["England plans protest to IRB over referee's performance during loss to Ireland."], "stablelm-zephyr:3b": ["England plans to protest with the International Rugby Board (IRB) about the performance of the referee, Jonathan Kaplan, in their 19-13 defeat by Ireland.", "England coach Andy Robinson is seeking input from ex-international referees Colin High and Steve Lander to analyze Kaplan's decisions.", "High claims that Kaplan made three major errors which altered the outcome of the match, stating it would not have been acceptable in the Zurich Premiership or European competition."], "chatgpt-4o-latest": ["England plans to protest to the International Rugby Board (IRB) over referee Jonathan Kaplan's performance in their 19-13 defeat to Ireland in the 2005 Six Nations.", "Coach Andy Robinson has enlisted former referees Colin High and Steve Lander to review Kaplan's decisions, believing only one side was officiated.", "High, the Rugby Football Union's referees' manager, identified three major errors that influenced the match's outcome and criticized Kaplan's performance as below international standards.", "He suggested that such officiating would not be acceptable in domestic or European competitions and could lead to disciplinary action."], "stablelm2:1.6b": ["England will protest to the International Rugby Board (IRB) against several referee decisions during their defeat by Ireland, according to reports from the Daily Mail.", "England coach Andy Robinson has asked ex-International referees Colin High and Steve Lander to analyze Jonathan Kaplan's decisions after calling on them for help in addressing one side of the refereeing performance, which he believes affected the outcome of the match between England and Ireland, losing their third straight game in the Six Nations series.", "Rugby Football Union's referees' manager, Colin High, claimed three major errors by Kaplan changed the match result, while High insisted that only one side was refereed, and it would not have been acceptable in a European league match."], "granite3.1-dense:2b": ["England's rugby coach, Andy Robinson, is set to protest to the International Rugby Board (IRB) regarding referee Jonathan Kaplan's performance in their 19-13 defeat by Ireland during the 2005 Six Nations.", "Ex-international referees Colin High and Steve Lander will be consulted, as they'll review several contentious decisions.", "Robinson believes Kaplan made three critical errors that influenced the match's outcome.", "England's coach plans to speak with the IRB about the perceived uneven refereeing.", "High, the Rugby Football Union's referees' manager, agrees, stating Kaplan's performance was not up to par for an international level and would be deemed inacceptable even in lower-level European competitions."]}