{"raw_text": "Ruddock backs Yapp's credentials\n \n Wales coach Mike Ruddock says John Yapp has what it takes as an international.\n \n The 21-year-old Blues prop is the only uncapped player in Wales' Six Nations squad, gaining a chance in the absence of Ospreys loose-head Duncan Jones. \"John is a young man with a big future. He has been playing with the Blues for two years and has racked up mileage on his playing clock,\" said Ruddock. \"He has international size, is a big, physical lad and a good ball-carrier with a high tackle-count.\" Ruddock's assessment was backed up by Yapp's coach at the Blues, former Wales and Lions prop Dai Young.\n \n \"John's been on an upward curve all season and is going from strength to strength,\" Young told BBC Sport Wales. \"His ball carrying gives us good go-forward, he impresses in defence and his work-rate is excellent. \"He's working hard on his scrummaging technique, which he is keen to improve to become a destroyer on the loose-head. \"To be fair to him he's not quite there with the scrummaging yet, but nobody can fault his effort, commitment and attitude. \"John's a very strong man and is eager for the challenge, if he's pitched in he won't let anyone down. \"He's developing quickly, but I hope he isn't pushed too quickly in a way that would hurt his development.\"\n \n Ruddock hopes that the selection of Yapp and Dragons lock Ian Gough - out of the international reckoning since falling out with former coach Steve Hansen - will send a message to other players in Wales. \"John and Ian have been rewarded for impressing during the Heineken Cup competition,\" said Ruddock. \"Both of them have played well, and we want to send a message out that consistently playing well gets you in the squad. \"We believe this is an exciting squad representing traditional values of Welsh rugby, and based on the performances in the November internationals. \"We have strength and experience up front, and well-recognised talent, pace and skill behind. \"The management team just want to get hold of the players and get out on the training pitch at the moment. \"They are all due in on Sunday, and that's when the hard work starts.\"\n", "llama3.2:1b": ["Mike Ruddock backs John Yapp's international credentials after being chosen for Wales' Six Nations squad despite not being an uncapped player.", "Yapp has been playing with the Welsh Blues for two years and has gained a chance to participate due to the absence of Ospreys loose-head Duncan Jones.", "Dai Young, Yapp's coach at the Blues, praises Yapp as a strong, physical young man with good ball-carrying skills, who is working hard on his scrummaging technique.", "Ruddock hopes that Yapp and Dragons lock Ian Gough being selected will show other players that consistent performances earn them a spot in Wales' squad."], "llama3.2:3b": ["Wales coach Mike Ruddock backs John Yapp for international selection citing his physicality, ball carrying, and high tackle count.", "Yapp's coach Dai Young describes him as strong, eager to improve, and working hard on his scrummaging technique.", "Ruddock hopes Yapp's selection along with Ian Gough will send a message that consistent performances get players into the squad, emphasizing Wales' strength and experience up front."], "gemma2:2b": ["Mike Ruddock believes John Yapp has the potential to be an international player for Wales.", "Yapp is an uncapped player on the Six Nations squad, replacing Duncan Jones.", "Both Ruddock and Yapp's coach at the Blues praise Yapp's physicality, ball-carrying ability, and work ethic.", "Ruddock hopes the selection of Yapp and Ian Gough will encourage other players to focus on consistent performance."], "qwen2.5:0.5b": ["Wales' Mike Ruddock praises John Yapp for his promising credentials as a young international rugby player.", "Ruddock backs the selection of Yapp and Dragons lock Ian Gough to send a message about consistency playing well getting players into the squad, especially given their strong performances in Heineken Cup competition."], "qwen2.5:1.5b": ["Wales coach Mike Ruddock backs John Yapp as an international prospect despite being uncapped, praising his ball carrying skills, physicality, and strong work ethic.", "Coach Young also supports this assessment, noting Yapp's focus on improving scrummaging technique and effort in defense.", "Ruddock hopes the selection of Yapp along with Dragons lock Ian Gough will encourage other players to perform well, sending a message that consistent good play leads to squad inclusion."], "qwen2.5:3b": ["Wales coach Mike Ruddock backs John Yapp for his international potential, describing him as a young player with a bright future.", "Yapp, an uncapped prop who has been playing for Blues for two years, possesses qualities such as size, physicality, and ball-carrying ability.", "His coach at the Blues, Dai Young, praises Yapp's development, noting his impressive performance in defense and good work-rate.", "Ruddock believes that selecting Yapp and Ian Gough, another player from a different team who was out of favor with Steve Hansen, will send a positive message to other players.", "Ruddock hopes this selection reflects traditional Welsh rugby values and acknowledges the strength and experience at the front row."], "opencoder:1.5b": ["Ruddock backs Yapp's credentials.", "The 21-year-old Blues prop is the only uncapped player in Wales' Six Nations squad, gaining a chance in the absence of Ospreys loose-head Duncan Jones.", "John Yapp has international size, is a big, physical lad and a good ball-carrier with a high tackle-count.", "Ruddock's assessment was backed up by Yapp's coach at the Blues, former Wales and Lions prop Dai Young.", "Young told BBC Sport Wales, his ball carrying gives us good go-forward, he impresses in defence and his work-rate is excellent.", "John's been on an upward curve all season and is going from strength to strength.", "Ruddock hoped that the selection of Yapp and Dragons lock Ian Gough - out of the international reckoning since falling out with former coach Steve Hansen - will send a message to other players in Wales.", "Both of them have played well, and we want to send a message out that consistently playing well gets you in the squad."], "smollm:1.7b": ["Ruddock backs Yapp's credentials by saying that John Yapp has what it takes as an international.", "He says that Yapp has been playing with the Blues for two years and has gained a chance in the absence of Ospreys loose-head Duncan Jones.", "Ruddock believes that Yapp has international size, is a big, physical lad and a good ball carrier with a high tackle-count.", "He also believes that Yapp's coach at the Blues, former Wales and Lions prop Dai Young, supports his assessment.", "Ruddock says that John Yapp has been on an upward curve all season and is going from strength to strength.", "He believes that Yapp's ball carrying gives them good go-forward, he impresses in defence and his work-rate is excellent.", "Ruddock also believes that Yapp's efforts are developing quickly but hopes that he isn't pushed too quickly in a way that would hurt his development.", "Ruddock hopes that the selection of Yapp and Dragons lock Ian Gough - out of the international reckoning since falling out with former coach Steve Hansen - will send a message to other players in Wales.", "He believes that both of them have been rewarded for impressing during the Heineken Cup competition and based on their performances in the November internationals, Yapp and Gough are strong men who have developed well.", "Ruddock also wants to get hold of the players and get out on the training pitch at the moment."], "deepseek-r1:1.5b": ["Ruddock backs John Yapp as an international with his future potential highlighted in Wales' Six Nations squad.", "Yapp, described as big, strong, and agile, is focused on developing and aims to make a significant impact.", "He works hard on scrummashing but has room for improvement.", "The team expects Yapp to perform well, emphasizing their traditional values and past success.", "Ian Gough, who was recently out of the international field due to personal issues, has been praised.", "Management hopes all players are ready for Sunday's match without rushing into it."], "tinyllama:1.1b": ["Elite Welsh rugby player John Yapp is a future international with strong credentials as an uncapped prop for the upcoming Six Nations squad, with Blues coach Mike Ruddock confident of his progressing from the chaos.", "While previous players like Ospreys lock Ian Gough have been passed over in favour of more established names like Welsh No.8 Dai Young, Ruddock believes Yapp's performance in the November internationals has earned him a place on the team.", "The management team is expected to attend training sessions on Sunday, but with the players currently in a state of flux following the departure of coach Steve Hansen and the resignation of former star player Gethin Jenkins."], "tinydolphin:1.1b": [" 1.", "Ruddock names John Yapp as having what it takes for him to be an international.", "2.", "He says that John is a young man with a big future who has been playing with the Blues for two years, gaining experience on his playing clock.", "3.", "Yapp's coach at the Blues, Dai Young, also praises John's physical size and ball-carrying abilities.", "4.", "John's coach at the Blues, Steve Hansen, believes that John is ready to make a step up in skill and development.", "5.", "Both Ruddock and Young hope that by having Yapp and Dragons lock Ian Gough also on their team, it will send a message about consistently good players."], "phi:2.7b": [" The coach Mike Ruddock believes John Yapp has what it takes as an international player for Wales.", "Despite being uncapped, Yapp's potential is recognized by his coach Dai Young, who praises his size, strength, ball-carrying ability, defensive skills, and work-rate.", "Young hopes that the selection of Yapp will send a message to other players in Wales that consistent play gets rewarded with a spot in the squad.", "The management team is eager to get hold of their players and start training at the moment, as they aim to build a strong Welsh rugby squad based on traditional values."], "orca-mini:3b": [" Wales coach Mike Ruddock backs John Yapp's credentials as an uncapped player in their Six Nations squad, with the 21-year-old Blues prop being the only one to gain a chance due to Duncan Jones' absence.", "Ruddock praises John's size, physical presence, and high tackle count, and backs his work ethic and attitude.", "Young's assessment of Yapp is also backed up by former Wales and Lions prop Dai Young, with both praising his effort, commitment, and attitude.", "However, Yapp's scrummaging technique is still improving, and Ruddock hopes that the selection of him and Ian Gough will send a message to other players in Wales."], "hermes3:3b": ["Wales coach Ruddock supports Yapp for international spot, praising his size, physicality, ball carrying, and defensive abilities.", "Young, Yapp's Blues coach, suggests not to push him too quickly to avoid hindering his development."], "stablelm-zephyr:3b": ["Wales coach Mike Ruddock backs 21-year-old Blues prop John Yapp's credentials as an international player.", "Though Yapp is the only uncapped player in Wales' Six Nations squad, Ruddock and former Wales and Lions prop Dai Young praise his physicality, ball-carrying abilities, and high tackle-count.", "Yapp's performance during the Heineken Cup competition has earned him a spot in the squad alongside Dragons lock Ian Gough.", "Rudduck hopes this selection will send a message to other players in Wales that consistently playing well gets you in the squad."], "chatgpt-4o-latest": ["Wales coach Mike Ruddock supports John Yapp's potential as an international player, selecting the 21-year-old Blues prop for the Six Nations squad in the absence of Duncan Jones.", "Ruddock praises Yapp's size, physicality, ball-carrying ability, and defensive work, with Blues coach Dai Young also commending his progress, work ethic, and commitment.", "While Yapp is still refining his scrummaging, Young believes he is ready for the challenge.", "Ruddock also includes Ian Gough, signaling that strong performances in club rugby can earn national selection.", "He emphasizes the squad's balance of experience and talent, eager to begin preparations."], "stablelm2:1.6b": ["Wales coach Mike Ruddock praises young prop John Yapp for potential as an international rugby player.", "Yapp has only one cap with Wales' Six Nations squad but gained opportunity due to injury to Ospreys loose-head Duncan Jones.", "Coach Dai Young supports Ruddock's assessment, noting Yapp's improvement all season, including his ball carrying, defense, and work rate.", "Yapp is working on improving scrummaging technique for potential as a forward.", "Ruddock hopes this selection sends a message that consistently performing well in competition leads to squad inclusion.", "The management team aims to get the players ready for Sunday training sessions, which will begin the hard work."], "granite3.1-dense:2b": ["Wales coach Mike Ruddock endorses John Yapp's international credentials as a 21-year-old Blues prop, citing his size, physicality, ball-carrying ability, and high tackle count.", "This selection comes in the absence of injured Ospreys' Duncan Jones for the Six Nations.", "Ruddock's sentiment is echoed by Yapp's coach at the Blues, Dai Young, who praises Yapp's progression this season and his commitment to improving scrummaging technique.", "Additionally, Ian Gough, another Blues player, has also been selected, marking a return from his previous tensions with former coach Steve Hansen.", "Ruddock views these selections as a message to other Welsh players that consistent high performance leads to international recognition.", "The team is expected to be strong and well-rounded, blending tradition and modern talent.", "The selected players are due for training on Sunday, marking the beginning of intense preparation."]}