{"raw_text": "Player burn-out worries Robinson\n \n England coach Andy Robinson says English rugby has to act now to prevent injury destroying players' careers.\n \n He will be without a host of big names for the Six Nations as the intensity of professional rugby union hits players. \"Injuries are part of the sport but we have to have a look at the amount of injuries that occur in the English season,\" Robinson told BBC Sport. \"I think players are probably going to have three or four years taken off their careers.\" Robinson will be missing an entire midfield for the Six Nations with the likes of Jonny Wilkinson, Mike Tindall and Will Greenwood injured.\n \n Rugby union has become far more physically demanding since the game went professional nearly 10 years ago. As a result three of the major stakeholders in English rugby have launched an \"injury audit\" to find out how players are coping. The audit is jointly funded by the Professional Rugby Players' Association, the Rugby Football Union and Premier Rugby. As far as Robinson is concerned its findings must not be ignored. \"I think there's an injury audit coming out in March that's got some great information in there that I think everybody in the English game has got to look at,\" he said. \"If we don't the situation is going to get worse and not better, so I think rugby as a whole has got to look at this.\"\n", "llama3.2:1b": ["England coach Andy Robinson will be absent from the Six Nations due to injuries sustained by his team's big names, including Jonny Wilkinson, Mike Tindall, and Will Greenwood.", "A \"injury audit\" is being conducted by English rugby stakeholders to assess players' injuries.", "If not completed, it could lead to a decline in player careers."], "llama3.2:3b": ["England coach Andy Robinson says injuries are destroying players' careers, with some possibly losing 3-4 years of playing time, due to the increasing intensity of professional rugby union.", "An \"injury audit\" is being launched in March to address the issue, which Robinson urges stakeholders to take seriously to prevent further decline."], "gemma2:2b": ["England coach Andy Robinson expresses concerns about injury rates in professional rugby, leading to significant player absences from the Six Nations.", "He believes these injuries are impacting players' career longevity.", "The Professional Rugby Players' Association, Rugby Football Union, and Premier Rugby have launched an \"injury audit\" to address this issue.", "Robinson urges stakeholders to analyze its findings, emphasizing the need for proactive solutions before the situation deteriorates further."], "qwen2.5:0.5b": ["England coach Andy Robinson expresses concern about the intense professional rugby season affecting players' careers.", "He says injuries are part of the sport but that English rugby needs to address the amount of injuries that occur in the summer.", "Robinson will miss three or four years off his career due to injuries, including Jonny Wilkinson, Mike Tindall and Will Greenwood, who were injured during England's World Cup campaign.", "The Injury Audit project was launched by the Professional Rugby Players' Association, the Rugby Football Union and Premier Rugby, and Robinson believes it must be taken seriously if rugby as a whole needs to improve."], "qwen2.5:1.5b": ["England coach Andy Robinson warns of player burnout due to increased professional rugby demands leading up to the Six Nations tournament, with potential for players to lose three or four years from their careers.", "An injury audit is needed to address concerns about injuries in English rugby during this season."], "qwen2.5:3b": ["England coach Andy Robinson worries about player burnout due to injuries destroying careers.", "He will be without key players like Jonny Wilkinson, Mike Tindall, and Will Greenwood for the Six Nations because of injuries.", "Professionalism in rugby union has increased physical demands since it became professional nearly 10 years ago.", "Three major stakeholders are conducting an \"injury audit\" funded by the Professional Rugby Players' Association, Rugby Football Union, and Premier Rugby to assess player welfare.", "Robinson believes these findings must be addressed as ignoring them could worsen the situation for rugby as a whole."], "opencoder:1.5b": ["\"Player burnout worries England coach Andy Robinson.", "He will be without an entire midfield for the Six Nations due to injuries from previous professional matches.", "The injury audit will help find out how players are coping in the English season.", "It suggests that there might be a potential increase in rugby union intensity as it has become more demanding since the game went professional nearly 10 years ago.\""], "smollm:1.7b": ["The summary should be concise and focus on the main points of the text:\n\n\"Player burn-out worries Robinson\" - The key idea is that player burnout is a concern for England coach Andy Robinson.", "\"England coach Andy Robinson says English rugby has to act now to prevent injury destroying players' careers.\"", "- This sentence highlights the specific issue of player burnout and the need for action from England coaches.", "\"He will be without a host of big names for the Six Nations as the intensity of professional rugby hits players.\"", "- The key idea is that Robinson will not have the support of his top players, which could affect the team's performance in international matches.", "\"I think players are probably going to have three or four years taken off their careers.\"", "- This sentence provides more specific details about the impact of player burnout on a player's career.", "\"Robinson will be without a host of big names for the Six Nations with the likes of Jonny Wilkinson, Mike Tindall and Will Greenwood injured.\"", "- The key idea is that Robinson will not have his top players in international matches due to injuries."], "deepseek-r1:1.5b": ["Robinson, the English rugby coach, is concerned about player burnout during the Six Nations and will miss major players.", "He warns that injuries are part of the sport but must assess seasonal injuries to ensure career recovery.", "England has launched an injury audit to understand how players cope with physical demands, which involves three main stakeholders.", "Robinson believes findings from the audit must be seriously considered to prevent worsening situations and improve the overall community's performance."], "tinyllama:1.1b": ["English Rugby has identified significant concerns related to players' career burnout from a combination of professionalism in rugger-union, rising intensity during the season, and the potential impact on three major stakeholders: RuGBP Player's Association (PRA), RFU, and Premier Rugby.", "In response, Robinson intends to conduct an \"injuiry audi\" to determine the severity of player injuries and their impact on players' careers.", "The result must not be ignored, and action must be taken now to prevent injury destroying players' careers.", "As a result, rugby has become much more physically demanding since professionalization."], "tinydolphin:1.1b": [" Injury-ravaged England rugby faces a potentially significant impact on its players' careers if pro sport doesn't take a more proactive approach.", "The Three Lions face a substantial gap in midfield with several key players out of action, including veterans like Jonny Wilkinson, Mike Tindall, and Will Greenwood who are all currently injured.", "Andy Robinson, the English rugby coach, has expressed his concern about the situation, suggesting that professional rugby union might be leading to \"injuries being part of the sport.\"", "He goes on to say that players' careers could be affected by this rapid increase in injuries and suggests that changes need to be made to ensure the long-term growth and success of the sport."], "phi:2.7b": [" Andy Robinson, England's coach, expressed concern about player burn-out and injury concerns that will affect players' careers during the Six Nations tournament.", "He emphasized that injuries are common in professional rugby but the amount of injuries in the English season is alarming.", "The game has become increasingly physically demanding since it went professional, which means more serious consequences for players.", "As a result, an \"injury audit\" has been launched by three major stakeholders to find out how players can cope better.", "The findings of this audit must be taken seriously and not ignored to prevent the situation from getting worse."], "orca-mini:3b": [" England coach Andy Robinson warns of burn-out worries and says players are likely to have three or four years taken off their careers due to injuries.", "He will be missing an entire midfield for the Six Nations with Jonny Wilkinson, Mike Tindall, and Will Greenwood injured.", "The game has become more physically demanding since it went professional, and the injury audit will reveal how players are coping.", "The stakeholders in English rugby must not ignore its findings."], "hermes3:3b": ["English rugby coach Robinson worries about player burn-out due to injury in professional rugby union, calling for action to prevent career destruction."], "stablelm-zephyr:3b": ["England coach Andy Robinson warns that professional rugby is at risk of damaging players' careers due to high rates of injury.", "He estimates that many big names will be absent for the Six Nations tournament, with injuries contributing to three or four years worth of career disruptions.", "Rugby union's physical demand has increased since it went professional nearly a decade ago, prompting an \"injury audit\" by major stakeholders to understand player coping strategies.", "Robinson emphasizes the importance of examining these findings to prevent the situation from worsening."], "chatgpt-4o-latest": ["England coach Andy Robinson warns that the intensity of professional rugby is shortening players' careers by three to four years due to injuries.", "He will be without key players like Jonny Wilkinson, Mike Tindall, and Will Greenwood for the Six Nations.", "Rugby has become more physically demanding since turning professional, prompting an \"injury audit\" funded by key rugby organizations to assess player well-being.", "Robinson stresses that the audit's findings, due in March, must be taken seriously to prevent the situation from worsening."], "stablelm2:1.6b": ["England coach Andy Robinson warns that preventing injury damage to players' careers may require substantial adjustments in English rugby due to an increasing intensity of professional play.", "He notes a high number of injuries during the season and predicts a loss of up to four years from affected players, as several key midfield members are unavailable for the Six Nations tournament.", "This growth in physical demands has led to an \"injury audit\" by major stakeholders within rugby to assess players' coping strategies.", "According to Robinson, any findings must be considered seriously, asserting that rugby as a whole needs to address these concerns."], "granite3.1-dense:2b": ["England rugby coach Andy Robinson warns of significant career disruptions due to injuries in the sport, citing an impending absence of key players like Jonny Wilkinson, Mike Tindall, and Will Greenwood for the Six Nations.", "The intensity of professional rugby union has led to a substantial increase in injuries over the past decade, with Robinson emphasizing that these injuries could potentially extend careers by three or four years.", "To address this concern, major stakeholders—the Professional Rugby Players' Association, the Rugby Football Union, and Premier Rugby—have initiated an \"injury audit.\"", "Robinson urges immediate attention to its findings, stating that ignoring them will exacerbate the issue rather than resolve it."]}