{"raw_text": "Hodges announces rugby retirement\n \n Scarlets and USA Eagles forward Dave Hodges has ended his playing career to pursue a coaching role in the States.\n \n The 36-year-old, who has 54 caps, was Llanelli's player of the season in 2001/2, but has battled injury for the last two of his seven years at Stradey. He tore a pectoral muscle against the Ospreys on Boxing Day, an injury that would have kept him out for the season. \"Realising I would be unable to play this season, the club and I agreed to end my contract early,\" said Hodges.\n \n \"It allows me to move back to the US and pursue opportunities there and allows the Scarlets to look to the next generation.\" The Scarlets have begun to rebuild their squad for next season after a disappointing Heineken Cup campaign, with plenty more signings and departures expected in the coming weeks.\n \n Scarlets chief executive Stuart Gallacher confirmed that 17 of the current squad would be out of contract in the summer. \"We have a deliberate policy whereby around half the squad are coming out of contract and they know they won't all be re-signed, it's a chance to invigorate the squad,\" he said. \"I'm positive about the future of the Scarlets both on and off the field.\" Gallacher was keen to pay tribute to the role back-five forward Hodges has played at Stradey Park, though. \"David has been a highly influential member of our squad for seven years,\" said Gallacher. \"He is a real professional and we thank him for the part he has played in our success. \"I am sure he has an enormous contribution to make to the development of rugby in the US and we wish him and his family well.\" Hodges described his years at Stradey as \"the best time of my life.\"\n", "llama3.2:1b": ["Dave Hodges, a 36-year-old former Scarlets and USA Eagles forward, has announced his retirement from playing rugby.", "He will end his contract early to pursue a coaching role in the US.", "Hodges played for Llanelli in seven years before being diagnosed with a torn pectoral muscle, which would have kept him out for the season.", "He will be able to move back to the US and help rebuild the Scarlets' squad.", "The team's chief executive Stuart Gallacher expects 17 of the current players to leave their contract at the end of the summer."], "llama3.2:3b": ["Dave Hodges, a 36-year-old forward for Scarlets and USA Eagles, has announced his retirement from playing due to recurring injuries.", "He will pursue a coaching role in the US and allow the Scarlets to rebuild their squad for next season."], "gemma2:2b": ["Dave Hodges, a Scarlets and USA Eagles forward, retired from playing rugby to pursue coaching opportunities in the United States.", "He has 54 caps for his country and was Llanelli's player of the season in 2001/2.", "After battling injuries over the last two seasons, he ended his contract early with the Scarlets.", "The club is now rebuilding its squad for next season, with a number of players set to become free agents.", "Hodges played a significant role at Stradey Park and will be missed by both the team and club."], "qwen2.5:0.5b": ["### Summary:\nRugby player Dave Hodges announced his retirement from rugby league after being unable to continue playing due to injuries.", "He is now looking to pursue a coaching role in the USA, joining Scarlets, where he has been part of the Scarlet side for seven seasons.", "Key ideas and details summarized:\n\n- **Player:** Dave Hodges\n- **Retirement:** Rugby League player ends his playing career after sustaining injuries during his career.", "- **Coaching Role:** Willing to pursue a coaching role in the USA based on his previous experience with Stradey Park.", "- **Club:** Scarlets, professional rugby league club.", "- **Career:** Played for Stradey for seven seasons (1996-2003), having 54 caps and being one of the best players in Wales."], "qwen2.5:1.5b": ["Hodges, 36, announces retirement from playing after two seasons due to injury.", "He returns to coaching role in the United States, replacing injured Scarlets player.", "The club looks to rebuild for next season following a disappointing Heineken Cup campaign.", "Hodges' 54 caps and seven years at Stradey Park are highlighted as highlights of his career."], "qwen2.5:3b": ["Hodges, a 36-year-old Scarlets player with 54 caps, has retired from playing due to recurring injuries.", "He will pursue coaching opportunities in the United States and help the Scarlets rebuild their squad for next season.", "Hodges' tenure at Stradey Park was described as influential by the club's CEO, who thanked him for his contribution despite announcing that around half of the current team would be departing."], "opencoder:1.5b": ["Hodges announces rugby retirement\n\nScarlets and USA Eagles forward Dave Hodges has ended his playing career to pursue a coaching role in the States.", "The 36-year-old, who has 54 caps, was Llanelli's player of the season in 2001/2, but has battled injury for the last two of his seven years at Stradey.", "He tore a pectoral muscle against the Ospreys on Boxing Day, an injury that would have kept him out for the season.", "\"Realising I would be unable to play this season, the club and I agreed to end my contract early,\" said Hodges.", "The Scarlets have begun to rebuild their squad for next season after a disappointing Heineken Cup campaign, with plenty more signings and departures expected in the coming weeks.", "Scarlets chief executive Stuart Gallacher confirmed that 17 of the current squad would be out of contract in the summer.", "\"We have a deliberate policy whereby around half the squad are coming out of contract and they know they won't all be re-signed, it's a chance to invigorate the squad,\" he said.", "\"I'm positive about the future of the Scarlets both on and off the field.\"", "Gallacher was keen to pay tribute to the role back-five forward Hodges has played at Stradey Park."], "smollm:1.7b": ["Hodges announced rugby retirement"], "deepseek-r1:1.5b": ["David hodges retired after 36 years of rugby, seeking coaching opportunities in the US.", "He had 54 caps but suffered a pectoral injury that kept him out for the season, and he is expected to return.", "The Scarlets are starting to rebuild their squad, with new signings and departures expected, and the CEO acknowledged 17 players being out of contract.", "hodges was influential as a forward over seven years at Stradey, and the CEO expressed thanks for his contributions."], "tinyllama:1.1b": ["Scarlets and USA Eagle forward Dave Hoaghes has announced his retirement from professional rugby to pursue a coaching role in the States.", "The 36-year-old spent five seasons at Llanerch Rugby Club, where he played a pivotal role as a player and captain.", "Despite enduring injuries, Hoaghes opted to give up playing for the remainder of his contract early this season, allowing him to move back to the US and pursue opportunities there.", "Scarlets chief executive Stuart Gallacher confirmed that 17 of the current squad would be leaving contracts and inviting others out of them in the coming months, while he himself expressed pride in Hoaghes' seven-year stint at Stradey Park.", "The Scarlets have been busy in recent weeks signing numerous players and exploring new coaching talent for next season, with a deliberate policy to bring around half of the squad out of contract during a rebuilding process."], "tinydolphin:1.1b": [" A senior Scarlets player, Dave Hodges, has decided to end his professional career and pursue a coaching role in the United States.", "The 36-year-old forward had been a key player for the Scarlets for seven years, and he was instrumental in their successful Heineken Cup campaigns during that time.", "However, Hodges suffered a serious injury against the Ospreys on December 25th that would have kept him out of action for the season.", "In an announcement released today, he has announced his retirement from professional rugby and will be pursuing opportunities in the US to retrain and continue to grow as a coach."], "phi:2.7b": [" Dave Hodges, a rugby player who has played for Llanelli and Scarlets, has announced that he will be retiring from playing to pursue coaching opportunities in the US.", "He is leaving due to an injury that prevented him from participating in the current season.", "The Scarlets have begun rebuilding their squad for next season, with many more signings and departures expected.", "Scarlets' chief executive Stuart Gallacher expressed his gratitude towards Hodges for his contributions during his seven-year tenure at Stradey Park."], "orca-mini:3b": [" Dave Hodges, a forward for the Scarlets, announced his retirement from playing due to injury.", "He will move back to the United States to pursue coaching opportunities.", "The Scarlets have started rebuilding their squad for next season and confirmed that 17 players will be out of contract in the summer.", "Hodges was a key member of the team for seven years and has contributed to their success."], "hermes3:3b": ["Hodges quits rugby, announces Scarlets retirement; 36-year-old USA Eagles forward ends playing career due to injury; Scarlets rebuilding squad for next season."], "stablelm-zephyr:3b": ["Rugby player Dave Hodges, who played for both Scarlets and USA Eagles, has retired from playing to pursue a coaching career in the United States.", "This decision was made after he ended his contract early with Scarlets due to injury issues that would have kept him out of the upcoming season.", "The 36-year-old had 54 caps and was Llanelli's player of the season in 2001/2002.", "With plans to rebuild their squad for next season, the Scarlets are expecting more signings and departures in the coming weeks."], "chatgpt-4o-latest": ["Dave Hodges, Scarlets and USA Eagles forward, has retired from rugby to pursue a coaching career in the US.", "The 36-year-old, who earned 54 caps, was Llanelli's player of the season in 2001/2 but struggled with injuries in recent years.", "A torn pectoral muscle on Boxing Day would have sidelined him for the season, leading to an early contract termination.", "The Scarlets are rebuilding after a poor Heineken Cup campaign, with 17 players out of contract.", "Chief executive Stuart Gallacher praised Hodges' contributions, calling him a professional and influential player.", "Hodges described his time at Stradey as the best of his life."], "stablelm2:1.6b": ["Coaching role in the US ends Dave Hodges' playing career with Scarlets.", "He announced retirement due to injury, allowing early end of contract for both club and player.", "Hodges will move back to US for opportunities while Scarlets rebuild squad for next season.", "Scarlets CEO Stuart Gallacher mentions influence of Hodges on squad's success but also acknowledges need to invigorate squad."], "granite3.1-dense:2b": ["Dave Hodges, a 36-year-old Scarlets and USA Eagles forward, has retired from professional rugby due to recurring injuries.", "Despite being Llanelli's player of the season in 2001/2002, his career was marked by constant battles with injury, including a significant one that forced him to sit out the entire 2022 season.", "Hodges decided to end his contract early with the Scarlets to move back to the US and pursue coaching opportunities.", "This decision enables the Scarlets to focus on developing younger players for their upcoming Heineken Cup campaign.", "Scarlets CEO Stuart Gallacher praised Hodges' professionalism and influence during his seven-year tenure, expressing confidence in his future contributions to rugby in the US."]}