{"raw_text": "Funding cut hits Wales Students\n \n The Wales Students rugby side has become a casualty of the Welsh Rugby Union's reorganisation at youth level.\n \n An amalgamated Under-18 side formed from separate schools and national youth teams plays its first match on Thursday, against Italy at the Gnoll. But that move has seen the WRU decide to end its funding of representative sides such as Wales Students. As a result, traditional international fixtures against England and France in the New Year have been cancelled. The Welsh Students Rugby Football Union feels that it is unable to properly prepare for or stage the matches. The secretary of the Welsh Students Rugby Football Union, Reverend Eldon Phillips, said: \"It is a shame that fixtures cannot be maintained this year. \"The competition provided by the strong English and French teams has enabled the Welsh Students to test themselves in high quality matches. \"The increasing number of young rugby players entering Higher Education look for the biggest challenge, that is representative rugby, but this year that opportunity will be denied them. Players who have played for Wales Students before going on to win full senior representative honours include Robert Jones, Rob Howley, Jon Humphreys, Darren Morris, Martyn Williams and Ceri Sweeney.\n", "llama3.2:1b": ["The Welsh Rugby Union's funding cut affects the Wales Students rugby side, which plays its first match of the season against Italy.", "The union decides to end funding for representative sides like Wales Students due to financial constraints, leading to cancelled international fixtures against England and France in the New Year.", "The decision impacts players who have competed for Wales Students before winning senior honors, including Robert Jones, Rob Howley, Jon Humphreys, Darren Morris, Martyn Williams, and Ceri Sweeney."], "llama3.2:3b": ["The Welsh Rugby Union's reorganisation of youth level has led to the end of funding for representative sides like the Wales Students.", "As a result, traditional international fixtures against England and France have been cancelled, denying young rugby players valuable match experience."], "gemma2:2b": ["The Welsh Rugby Union has discontinued funding for the Wales Students rugby side, resulting in cancellations of international matches against England and France.", "This decision impacts young players seeking competitive experiences as they transition to higher education."], "qwen2.5:0.5b": ["The Welsh Rugby Union announced a plan to end funding of their representative teams such as the Wales Students rugby team due to recent changes in the structure of the Welsh Rugby Union's youth level programs.", "The Wales Students team is currently playing its first match of the year against Italy, but these changes have seen the WRU decide not to support them financially in this season."], "qwen2.5:1.5b": ["The Welsh Rugby Union has cancelled fixtures against England and France due to funding cuts, leaving the Wales Students rugby side unable to prepare adequately for these traditional international matches.", "This decision affects players who have previously represented Wales at senior level, including former stars such as Robert Jones, Rob Howley, Jon Humphreys, Darren Morris, Martyn Williams, and Ceri Sweeney, losing opportunities to compete with higher-quality teams."], "qwen2.5:3b": ["Wales Students rugby side faces cancellation of fixtures against England and France due to the Welsh Rugby Union's reorganisation.", "An amalgamated Under-18 team has replaced separate school and national youth teams for first matches in January, leading to an end of Wales Students funding.", "This affects traditional high-quality match opportunities traditionally providing challenges for young players aiming for full senior representation, including former Wales Students who went on to win senior honours such as Robert Jones, Rob Howley, Jon Humphreys, Darren Morris, Martyn Williams and Ceri Sweeney."], "opencoder:1.5b": ["The key idea in the given text is the loss of funding from the Welsh Rugby Union for a rugby team like Wales Students.", "The reasons behind this decision were likely because the union's goal was to increase international matches but in this case they decided it would be better to focus on the rugby field rather than expanding into other leagues.", "They also believed that the English and French teams could handle the increased competition better."], "smollm:1.7b": ["The funding of representative rugby sides at youth level has been cut in the Welsh Rugby Union due to the reorganisation of the WRU at the youth level.", "The decision was made as part of a larger effort to reduce costs and increase efficiency within the union.", "As a result, traditional international fixtures against England and France have been cancelled.", "The Welsh Students rugby football union feels that it is unable to properly prepare for or stage the matches due to the lack of funding.", "The secretary of the Welsh Students rugby football union, Reverend Eldon Phillips, said: \"It is a shame that fixtures cannot be maintained this year.\"", "The increasing number of young rugby players entering Higher Education look for the biggest challenge, that is representative rugby, but this opportunity will be denied them.", "Players who have played for Wales Students before going on to win full senior representative honors include Robert Jones, Rob Howley, Jon Humphreys, Darren Morris, Ceri Sweeney and Ceri Sweeney."], "deepseek-r1:1.5b": ["Funding cuts have caused Wales Students rugby to be a casualty at the Welsh Rugby Union's youth reorganization.", "The team has amalgamated schools and national youth teams for their first match against Italy at Gnoll on Thursday, which is expected to be their first international match this year.", "This move caused the WRU to end funding for representative sides, including Wales Students, leading to the cancellation of traditional fixtures against England and France in January.", "The Welsh Students feel shame as they now can't maintain these matches.", "Players like Robert Jones, Rob Howley, Jon Humphreys, Darren Morris, Martyn Williams, and Ceri Sweeney have won full senior honors before, but this year they are excluded from higher-level matches."], "tinyllama:1.1b": ["Amalgamated youth team formed from schools and national rugby teams plays its first match against Italy at the Gnoł in the week starting January 2023.", "The Welsh Rugby Union has cancelled funding for traditional international fixtures against England and France because of the lack of proper preparation for or hosting of matches.", "The representative sides such as Wales Student's RuGBY Football Union feel that they are not properly prepared to stage such matches, which would otherwise provide a challenge for more established players."], "tinydolphin:1.1b": [" The Welsh Rugby Union (WRU) announced that it will no longer fund the Under-18 Wales Students rugby team due to budget constraints.", "This move has led to a significant change in the playing schedule for the team, which was set to play against England and France in the New Year.", "The decision to discontinue funding comes as the WRU struggles to maintain its competitive edge against English and French teams.", "As a result, international fixtures like matches against England and France have been canceled.", "Welsh Students Rugby Football Union (WSRFU) Secretary Reverend Eldon Phillips expressed his disappointment that the team will not be able to participate in these crucial matches.", "The increased competition provided by strong English and French teams has made it difficult for Wales Students to compete against them, while also limiting the opportunities for young rugby players to gain experience and represent their country."], "phi:2.7b": [" The Welsh Rugby Union has ended its funding of the Under-18 side formed from separate schools and national youth teams due to reorganization, resulting in cancelled international fixtures against England and France.", "The Welsh Students Rugby Football Union believes that this will affect their ability to prepare for or stage matches."], "orca-mini:3b": [" The Welsh Rugby Union's reorganization at youth level resulted in the cancellation of traditional international fixtures against England and France in the New Year for the Wales Students rugby side.", "Funding for representative sides such as Wales Students was cut due to the reorganization, which left the Welsh Students Rugby Football Union unable to properly prepare for and stage the matches.", "The cancellation of these fixtures has denied young rugby players entering Higher Education the opportunity to test themselves in high quality matches."], "hermes3:3b": ["Wales Students rugby side loses funding, leading to cancelled international matches against England and France due to reorganization."], "stablelm-zephyr:3b": ["Wales Students rugby side ends funding due to Welsh Rugby Union's reorganization, leading to cancellation of international fixtures against England and France.", "Former Wales Students players have gone on to become senior representatives, highlighting the disappointment for current players seeking challenge and opportunity in representative rugby."], "chatgpt-4o-latest": ["The Welsh Rugby Union's reorganisation at the youth level has led to the defunding of the Wales Students rugby team.", "An amalgamated Under-18 side now replaces separate schools and national youth teams, with its first match against Italy.", "As a result, traditional Wales Students fixtures against England and France have been cancelled, as the Welsh Students Rugby Football Union cannot properly prepare for them.", "Secretary Reverend Eldon Phillips expressed disappointment, noting that the competition helped players develop.", "Many former Wales Students players, including Robert Jones and Rob Howley, later achieved senior representative honours."], "stablelm2:1.6b": ["Wales Students rugby team is affected by the Welsh Rugby Union's restructuring of youth level teams; the amalgamated Under- side will play Italy but loses funding for representative sides.", "As a result, traditional international fixtures against England and France in 2019 have been canceled.", "The Welsh Students Rugby Football Union feels unable to properly prepare for or stage these matches due to the loss of funding.", "Notable past players include Robert Jones, Rob Howley, Jon Humphreys, Darren Morris, Martyn Williams, and Ceri Sweeney."], "granite3.1-dense:2b": ["Funding for the Wales Students rugby team has been cut by the Welsh Rugby Union (WRU) due to reorganization at youth level.", "This decision affects the team's upcoming matches against England and France, which have been postponed or canceled.", "The Welsh Students Rugby Football Union, led by Secretary Reverend Eldon Phillips, expressed disappointment as these games provide crucial high-quality challenges for young rugby players transitioning to higher education.", "Notable alumni of the Wales Students team include Robert Jones, Rob Howley, Jon Humphreys, Darren Morris, Martyn Williams, and Ceri Sweeney, who later achieved senior representative honors."]}