{"raw_text": "Calder fears for Scottish rugby\n \n Former Scotland international Finlay Calder fears civil war at the SRU could seriously hamper his country's RBS Six Nations campaign.\n \n Four members of the executive board, including the chairman, David Mackay, have resigned after a simmering row. And Calder said: \"This is terrible news for every level of Scottish rugby. \"David is a successful businessman and I thought that if anybody could transform the negative atmosphere and rising debt level, it was him.\" Mackay's executive board has been in a power struggle with the general committee, which contains members elected by Scotland's club sides. \"He has been driven out by people who seem happier waging civil war than addressing the central issue that professional rugby can't be run by amateurs,\" said Calder.\n \n \"In fact, I don't understand why we are still having this argument 10 years after professionalism arrived. \"But I don't believe the rest of the SRU will take this lying down. \"I think the banks will be dismayed at this decision and, ultimately, it is them who pull the strings. \"So I wouldn't be surprised if they reviewed their position. But, in the wider picture, what message does this send out?\" He thought the work of Scotland's coaches, who have been attempting to arrest the decline of the national side, would be made much more difficult. \"Matt Williams and Willie Anderson must be wondering, 'what have we walked into here?'\" said Calder. \"And we can now expect weeks of arguments and acrimony just at a time when we should be looking forward to the Six Nations Championship. \"I am very, very disappointed, more than you can imagine. Why do so many Scots have this knack of turning on each other when the going gets tough?\"\n", "llama3.2:1b": ["Calder fears Scottish rugby's professional football league could be damaged by a civil war over leadership and management issues, particularly with four members of the executive board resigning after disputes with the general committee.", "Calder believes the decision will hurt Scotland's RBS Six Nations campaign and has expressed disappointment at the ongoing conflict."], "llama3.2:3b": ["Finlay Calder fears civil war in Scottish rugby over boardroom resignations amid power struggle between executive and general committee, potentially impacting Six Nations campaign and national team's performance."], "gemma2:2b": ["Calder is worried about civil war within the Scottish Rugby Union (SRU) which could hinder Scotland's RBS Six Nations campaign.", "Four board members resigned due to a power struggle, with the chairman being ousted, and Calder believes this will impact professional rugby management negatively.", "The situation could disrupt coaching efforts and signal instability in the SRU's financial position."], "qwen2.5:0.5b": ["Former Scottish rugby player Finlay Calder fears that civil war could hinder Scotland's chances of winning the Rugby World Cup in 2019-2020 after a power struggle has erupted among senior executives.", "He believes Mackay, who controls the SRU's executive board, should have been promoted to head the club by David Mackay, the chairman.", "However, Mackay resigned amid a simmering row over his role.", "This highlights the power struggles within Scotland’s professional rugby scene and the potential for civil conflict that could undermine Scotland’s rugby ambitions."], "qwen2.5:1.5b": ["Former Scotland international Finlay Calder fears civil war within Scottish Rugby Union (SRU) could severely hinder its RBS Six Nations campaign due to executive board resignations and power struggles between the SRU's chairman, David Mackay, and general committee members elected by club sides.", "Calder believes professional rugby should have been managed by professionals since professionalism arrived 10 years ago but thinks the decision will likely be reviewed by banks as well as potentially changing the work of Scotland's coaches."], "qwen2.5:3b": ["Calder expresses fears that civil war within the Scottish Rugby Union (SRU) could severely impact Scotland's RBS Six Nations campaign.", "Former Scotland international Finlay Calder criticizes David Mackay, SRU chairman who resigned along with four others in a power struggle with the general committee containing club-elected members.", "Calder believes this decision will make it harder for coaches to address national side’s decline and questions why the issue of professionalism still persists 10 years after its introduction.", "He expects banks, pulling the strings, might review their position and warns that ongoing arguments could hinder Scotland's preparations for upcoming Six Nations Championship."], "opencoder:1.5b": ["Calder fears for Scottish rugby.", "Former Scotland international Finlay Calder fears civil war at the SRU could seriously hamper his country's RBS Six Nations campaign.", "Four members of the executive board, including the chairman, David Mackay, have resigned after a simmering row.", "And Calder said: \"This is terrible news for every level of Scottish rugby.", "David is a successful businessman and I thought that if anybody could transform the negative atmosphere and rising debt level, it was him.\"", "The argument 10 years after professionalism arrived.", "I don't believe the rest of the SRU will take this lying down.", "But, in the wider picture, what message does this send out?", "They thought the work of Scotland's coaches, who have been attempting to arrest the decline of the national side, would be made much more difficult."], "smollm:1.7b": ["The summary is concise and conveys the main ideas from the original text:\n\n1.", "Calder fears for Scottish rugby due to a rift in the executive board.", "2.", "The four members of the executive board, including the chairman, David Mackay, have resigned after a simmering row.", "3.", "Calder said that if anybody could transform the negative atmosphere and rising debt level, it was him.", "4.", "David is a successful businessman and I thought that if anybody could transform the negative atmosphere and rising debt level, it was him.", "5.", "Calder believes that the SRU will be dismayed by this decision and ultimately, it is them who pull the strings.", "6.", "He thinks the work of Scotland's coaches, who have been attempting to arrest the decline of the national side, would be made much more difficult.", "7.", "I am very disappointed, more than you can imagine.", "Why do so many Scots have this knack of turning on each other when the going gets tough?"], "deepseek-r1:1.5b": ["Calder fears for his country's RBS Six Nations campaign after Scotland may face civil war-related funding issues.", "Key players, including David Mackay, have resigned from the executive board.", "Calder believes David, a successful businessman, is on the brink of change but others are upset about the power struggle.", "He suggests banks might react negatively, leading to a review, while he doubts more progress in addressing the issue than 10 years ago.", "He worries about coaches facing more competition for the championship and the frustration some Scots feel switching sides when challenges arise."], "tinyllama:1.1b": ["Scottish rugby is facing an uncertain future after four members of the executive board resigned following a simmering dispute with the Scottish Rugby Union's (SRU) general committee.", "Despite Calder's statement, the SRU's chairman David Mackay has been driven out by an increasingly powerful group of professional players and administrators who are unhappy with the financial struggles and perceived lack of success on the field.", "The power struggle between the executive board and the general committee could further damage Scotland's reputation as a nation that can manage its own rugby affairs.", "Calder also expressed concerns about the impact of this issue on the wider picture, suggesting it would make the job of coaches and administrators even more difficult.", "Despite the negative outcomes for Scottish rugby, Calder remained optimistic about the prospects of the Six Nations Championship, stating that he was disappointed but not surprised."], "tinydolphin:1.1b": [" Former Scotland international Finlay Calder has expressed his dissatisfaction with the Scottish Rugby Union (SRU) executive board and board chairman, David Mackay, for allowing a power struggle among members.", "According to Calder, he believes that this internal turmoil could significantly impact the upcoming Six Nations Championship campaign for Scotland's national rugby team.", "He further states that, despite the negative atmosphere created by the power struggle within the executive board and board chairman, he hopes that David Mackay can transform the situation and restore professionalism to Scottish rugby."], "phi:2.7b": [" Former Scotland international Finlay Calder fears Scottish rugby could seriously impact their RBS Six Nations campaign due to a power struggle at the SRU executive board with members resigning.", "The rest of the SRU will likely respond and banks may review their position, potentially making it more difficult for Scotland's coaches to lead the national side during an important tournament like the Six Nations Championship."], "orca-mini:3b": [" Calder fears for Scottish rugby after executives resign and civil war simmering row."], "hermes3:3b": ["Calder worried about Scottish rugby impact from SRU executive board resignation."], "stablelm-zephyr:3b": ["Former Scotland international Finlay Calder expressed concern over the potential civil war within the Scottish Rugby Union (SRU) that could negatively impact the RBS Six Nations campaign.", "After a row, four members of the executive board, including chairman David Mackay, resigned.", "Calder mentioned that the SRU should focus on professionalism instead of arguing and doubted the rest of the organization would accept the situation.", "He also expressed disappointment in the upcoming weeks filled with arguments, making it difficult for Scotland's coaches to manage the national team decline."], "chatgpt-4o-latest": ["Former Scotland international Finlay Calder fears that internal conflicts within the Scottish Rugby Union (SRU) could harm Scotland's Six Nations campaign.", "The resignation of four executive board members, including chairman David Mackay, follows a power struggle with the general committee, which represents club sides.", "Calder criticizes the ongoing dispute, arguing that professional rugby cannot be managed by amateurs and warning that banks may reconsider their support.", "He believes the turmoil will make the coaches' jobs harder and expects weeks of discord instead of preparation for the tournament.", "Calder expresses deep disappointment, lamenting Scotland's tendency for internal conflict in difficult times."], "stablelm2:1.6b": ["Former Scotland international Finlay Calder expresses concern about the ongoing conflict at the Scottish Rugby Union (SRU), potentially hindering Scotland's RBS Six Nations campaign.", "Four members of the executive board, including chairman David Mackay, resigned following a disagreement with the general committee elected by club sides.", "Calder questions why there is still debate on professionalism despite its implementation and anticipates challenges ahead during the Six Nations Championship."], "granite3.1-dense:2b": ["Former Scotland rugby player Finlay Calder expresses deep concern over the recent resignation of key executives from the Scottish Rugue Union (SRU), including chairman David Mackay, due to a longstanding power struggle with the general committee.", "This internal strife, which Calder finds perplexing given professional rugby's 10-year existence, has left him disillusioned and worried about its impact on Scotland's RBS Six Nations campaign.", "The discord could hinder coaches Matt Williams and Willie Anderson's efforts to improve the national team's performance.", "Calder predicts further arguments and acrimony, which he believes will distract from preparations for the Six Nations Championship.", "He anticipates potential consequences might prompt financial backers, like banks, to reconsider their involvement in Scottish rugby."]}