{"raw_text": "Lomu relishing return to action\n \n Former All Black star Jonah Lomu says he cannot wait to run out on the pitch for former England rugby union captain Martin Johnson's testimonial on 4 June.\n \n The 29-year-old had a kidney transplant in July 2004 but will play his first full match for three years, leading a southern hemisphere side at Twickenham. \"I actually started training three weeks after my operation but I was very limited until a few months ago. \"Now it's basically bring it on!\" said the giant winger. \"The match on 4 June will be my first 15-man game but I have a training schedule which is quite testing and combines with sevens and a whole lot of things,\" said Lomu. \"I have got so much energy since my operation that I train three times a day, six days a week.\n \n \"Mohammed Ali has always been my ideal. Coming back to rugby, people said 'you are dreaming' but it always starts off with a dream. \"It's up to you whether you want to make it a reality.\" Opinion has been divided on whether Lomu should attempt to return to the game after such a major operation. But when Lomu was asked whether he was taking a risk he replied: \"As much as someone going down the road being hit by a bus. \"There are a lot of people in the world with one kidney who just don't know it. \"I have talked this over, had a chat with the donor and this is to set my soul at peace and finish something I started in 1994 [when he made his All Blacks debut].\" At his lowest ebb Lomu was so ill he could barely walk, but he says he is now getting stronger every day and his long-term target is to play for New Zealand again. \"The only person who saw me at my worst was my wife,\" he added. \"I used to take two steps and fall over but now I can run and it is all coming back, and a lot more quickly than I ever thought it would. \"To play for the All Blacks would be the highest honour I could get. That is the long-term goal and you have to start somewhere.\"\n", "llama3.2:1b": ["Jonah Lomu will play his first full match in three years on June 4 as part of England rugby union captain Martin Johnson's testimonial at Twickenham, marking a return to action after a kidney transplant in July 2004.", "Lomu will be playing in a 15-man game and has been training since July, with a rigorous training schedule that includes sevens matches and other activities."], "llama3.2:3b": ["Jonah Lomu will play in Martin Johnson's testimonial on June 4th, after recovering from a kidney transplant with an intense training schedule that includes sevens.", "He is eager to return to rugby, saying \"now it's basically bring it on!\"", "Lomu plans to focus on playing for New Zealand again and believes he has made the right decision in returning to the sport."], "gemma2:2b": ["Jonah Lomu will play his first full match in three years at Martin Johnson's testimonial on June 4th.", "He had a kidney transplant in 2004 and has been training intensely, aiming for long-term goals of playing for the All Blacks again.", "Lomu acknowledges the risks involved, citing his determination to continue his rugby career, but he says he is getting stronger every day and his passion remains high."], "qwen2.5:0.5b": ["Lomu returns after kidney transplant, says he will run out on the pitch for Martin Johnson's testimonial.", "Lomu has trained three times a day since his operation and plans to play in his first full match for New Zealand side Twickenham.", "He says it is up to him whether or not he wants to return to rugby after such a major operation."], "qwen2.5:1.5b": ["Former All Black Jonah Lomu excitedly anticipates returning to action for Martin Johnson's testimonial on June 4, following a kidney transplant in July 2004 that limits him to three years of full match play.", "He is now training intensively after resuming his rugby career from three weeks post-operation."], "qwen2.5:3b": ["Former All Black Jonah Lomu, who had a kidney transplant in 2004, will return to action by playing his first full match since then at Martin Johnson's testimonial on June 4th.", "Despite being limited until recently due to training after the operation, Lomu is now preparing intensively and plans to train three times a day, six days a week.", "He views returning to rugby as much like any other risk, given that many people have one kidney without knowing it.", "His long-term goal is to play for New Zealand again, having been in his lowest health state since 1994 when he made his All Blacks debut."], "opencoder:1.5b": ["\"Lomu is feeling stronger every day as he continues to strive for a future where he can play rugby again and achieve his goals.", "Every time he walks, he's running; he can't just sit there and think about anything.\"", "- Lomu said."], "smollm:1.7b": ["Lomu relishing return to action after kidney transplant"], "deepseek-r1:1.5b": ["Jonah Lomu is set to return to action after a significant kidney transplant in July 2004 and will start training three weeks before his operation.", "He plans to play Martin Johnson's testimonial match at Twickenham on June 4 as his first full game.", "The match will be his first 15-man encounter but includes extensive training involving sevens and other activities, requiring three days of training each week.", "opinions suggest it could be a risk, yet Lomu aims to make this a reality with a long-term goal of playing for New Zealand again.", "He's committed to building a legacy as the highest honor in rugby."], "tinyllama:1.1b": ["The former rugby union star Jonah Lo Mu, who underwent a kidney transplant in July 2004 but returned to full training three months later, will lead a southern hemisphere side at Twickenham on 4 June.", "In contrast, Lo Mu is currently experiencing a high level of energy and has a training schedule that includes seven days a week and multiple training sessions per day.", "Opinion has been divided on whether Lo Mu should attempt to return to the sport after such a major operation, but when asked about his motivation, Lo Mu replied that he was taking a risk by attempting to play rugby again after being \"hit by a bus.\"", "However, the former All Black star is aiming for a return to the game in as soon as three years, with his long-term goal of playing for New Zealand again."], "tinydolphin:1.1b": [" The summary: Former New Zealand rugby union captain Martin Johnson's testimonial will include performances from former players, including Jonah Lomu.", "Lomu was born in Nairobi, Kenya and had a kidney transplant in July 2004.", "He is now training three times a day to get back on the field after missing nearly three years due to his health."], "phi:2.7b": [" Former All Black Jonah Lomu has a kidney transplant but will play his first full match in three years at Martin Johnson's testimonial on 4 June.", "He trained six days a week for the past few months with a training schedule combining sevens and 15-man games.", "His dream is to play rugby again, despite some people saying he was taking too much of a risk after such an operation.", "But Lomu says it feels like \"starting off\" his career in rugby."], "orca-mini:3b": [" Jonah Lomu relishes his return to action after a major kidney transplant.", "He will lead a southern hemisphere side at Twickenham in a testimonial for former England captain Martin Johnson, and has set his long-term target of playing for New Zealand again.", "Opinion is divided on whether he should attempt to return to the game after such a major operation, but Lomu himself says he is taking it \"to set my soul at peace\"."], "hermes3:3b": [" Jonah Lomu looks forward to playing his first full match after kidney transplant on 4th June test match against southern hemisphere team, aiming to return to playing for New Zealand All Blacks."], "stablelm-zephyr:3b": ["Former All Black star Jonah Lomu is eager to play in former England rugby union captain Martin Johnson's testimonial match on June 4, marking his first full match in three years since having a kidney transplant in July 2004.", "Lomu now trains three times a day, six days a week and aims to play for New Zealand again in the long term.", "Despite initial concerns about his return to the game, Lomu believes his experience shows that many people in the world have one kidney but are not aware of it."], "chatgpt-4o-latest": ["Jonah Lomu, former All Black star, is excited to return to rugby in Martin Johnson's testimonial match on 4 June, marking his first full game in three years after a kidney transplant in 2004.", "He resumed training soon after surgery and now follows an intense regimen.", "Inspired by Muhammad Ali, Lomu is determined to make his comeback despite divided opinions on the risks.", "He sees this as fulfilling an unfinished journey from his 1994 debut and aims to play for New Zealand again.", "Once too weak to walk, he now feels stronger daily and is eager to prove himself on the field."], "stablelm2:1.6b": ["Former All Black star Jonah Lomu eagerly looks forward to his return to rugby in June, playing a testimonial match for former England captain Martin Johnson.", "After undergoing a kidney transplant, Lomu resumed training and now trains three times a day, six days a week.", "Despite opinions on whether he should attempt to return to the game after such an operation, Lomu remains determined to play for New Zealand again, aiming to one day play for the All Blacks."], "granite3.1-dense:2b": ["Former New Zealand rugby star Jonah Lomu, who had a kidney transplant in 2004, is set to return to action for England's testimonial match on June 4.", "Despite medical concerns, Lomu has been training intensively, exercising three times daily, six days a week, and combines this with sevens rugby.", "He likens his energy levels to those of former boxer Mohammed Ali.", "Lomu aims to play for the All Blacks again, emphasizing that his return is about fulfilling a lifelong dream and setting his soul at ease after the transplant.", "His recovery has been remarkable, enabling him to regain strength and mobility, with his wife being the only person who witnessed his severe illness."]}