{"raw_text": "All Black magic: New Zealand rugby\n \n Playing colours:\n \n All black\n \n The Haka and more!\n \n The All Blacks\n \n Charles John Munro discovered rugby at London's Christ College, and on his return to Nelson he staged New Zealand's first game. Nelson Town met Nelson College on 14 May, 1870, the Town triumphing by two goals to nil, instigating a game that would become a national obsession and come to dominate the country's sporting passions. The game appealed to the Kiwi psyche and quickly spread, the native Maoris finding a particular empathy with the sport's warrior ethos. In 1888 a British team led by AE Stoddart toured New Zealand and Australia, and soon after a Maori named Joe Warbrick and an English ex-pat called Thomas Eyton decided to gather a combined New Zealand team.\n \n Twenty-two Maori and four 'pakiha' formed the 'New Zealand Native Team,' who played a total of 107 matches in New Zealand, Australia and the UK. The integration of white and Maori was a reflecion of enlightened New Zealand rugby and society, even if the British press were somewhat mystified by the pre-match tradition of the Maori war dance, the Haka! The other great symbol of New Zealand rugby, the all black kit with the silver fern on the breast, was proposed by Tom Ellison at the first annual meeting of the New Zealand Rugby Football Union in 1893. New Zealand played their first international against Australia in 1903, the Kiwis triumphing 22-3 in Sydney, and the following year an official British touring team came to New Zealand for the first time. The tourists had gone through Australia undefeated but their captain, David Revell Bedell-Sivright, created animosity in New Zealand with his patronising attitude. The Kiwis shocked the rugby world with a 9-3 triumph in Wellington, sparking great celebrations across the country, but Bedell-Sivright churlishly suggested that the victors would have no chance when they visited the UK.\n \n Their opportunity to prove him wrong came in 1905 with the first official New Zealand tour to Europe. The tourists won their early games with a quick-thinking, inventive approach, but press criticism began to grow over their 2-3-2 scrum formation that left a 'roving' forward free to disrupt opposition attacks. The tactic was effective, two late tries seeing the Kiwis to a 12-7 win over Scotland, before Ireland were despatched 15-0 in Dublin. A huge crowd at Crystal Palace convulsed with laughter at the sight of the Haka - but the smiles were soon wiped from their faces when the tourists ran in five tries in a 15-0 hammering of England. New Zealand headed to Wales to meet a country in the midst of its first 'Golden Age,' and the encounter would be the first in a series of controversial clashes between the sides. An excellent try on the left wing by Teddy Morgan sealed a 3-0 win in a hard-fought encounter at Cardiff Arms Park, but post-match talk was dominated by a Bob Deans try that was ruled out by Scottish referee John Dallas. Dallas said that Deans was tackled short, but the Kiwi said he was dragged back into the field of play after grounding a try - on his death-bed three years later he exclaimed: \"I did score that try in Cardiff.\"\n \n Four of the 1905 All Blacks went over to the newly formed 'All Golds' rugby league side soon after the tour, but New Zealand were strong enough to crush an Anglo-Welsh touring team in 1908. The first South Africa tour of New Zealand in 1921 saw honours shared in a three-Test series, starting the greatest rivalry in rugby - and the long-running controversy between the countries over the All Blacks' inclusion of Maori players. The awesome 1924-5 All Black tourists became known as 'The Invincibles' after winning all 30 of their games in France, Britain and Ireland, including a crushing 19-0 victory over Wales at St Helen's. Despite their success, the All Blacks' 2-3-2 scrum formation left them somewhat short of possession at times, and the flaws were exploited by the Springboks in South Africa in 1928. Employing the modern 3-4-1 scrum line-up against the New Zealand 'rover' system for the first time, South African teams defeated the All Blacks in five games and the Test series was drawn two-all. The controversial New Zealand scrum method finally disappeared after the 1930 Lions tour (a series won 3-1 by New Zealand), the Lions manager describing the tactic as 'cheating,' prompting the International Rugby Board to rule that three men had to pack down in the front row of the scrum.\n \n The All Blacks' 1935 European tour started inauspiciously with an 11-3 loss to a Swansea side inspired by teenage, schoolboy half-backs Hayden Tanner and Willie Davies. A thrilling Test at Cardiff Arms Park went to Wales 13-12, although the winning try from Geoffrey Rees-Jones was controversial following an illegal Claude Davey tackle in the build-up. New Zealand's next visit to Wales in 1953 proved difficult as they lost 8-3 to Cardiff and drew 6-6 at Swansea. The All Blacks were on top in the Test with Wales at the Arms Park, but the teams were locked at 8-8 when a Clem Thomas cross kick was gathered by Ken Jones for a famous, match-winning try. The tourists made some amends with wins over the other home nations, before a 19-5 success over the Barbarians in an Arms Park thriller. New Zealand built from that tour, and by the time they returned in 1963-4 they were undoubtedly the leading side in the world.\n \n That made the shock all the greater when a drop goal by student John Uzzell gave Newport an unlikely 3-0 win over the tourists at Rodney Parade. Wilson Whinneray's side rallied to beat Wales 6-0, their first win at the Arms Park in four attempts, and went unbeaten through the rest of the tour, but when they returned home the first question put to them was: \"What happened in Newport?\" The only blemish on the record of the awesome 1967 tourists was a draw with East Wales, as they beat the full Wales team 13-6 in Cardiff to take the lead in the series between the countries for the first time. That lead was increased with two comfortable wins for the home side in New Zealand in 1969, the first time Wales had toured the country as an independent team.\n \n A ferocious game at the Arms Park in 1972 was edged 19-16 by the All Blacks, a measure of revenge for the defeat inflicted on New Zealand by the Carwyn James-inspired Lions of 1971.\n \n James guided Llanelli to a famous 9-3 win over the tourists at Stradey Park, though, and in the final game of the tour the Barbarians defeated the All Blacks 23-11 in Cardiff in a game regarded by many as the greatest ever played. New Zealand defeated a Wales XV 12-3 at the Arms Park in a non-cap game in 1974, but it was the 1978 game in Cardiff that would reignite the history of controversy between the two countries.\n \n Wales were leading 12-10 with one minute left when Andy Haden flew to the floor from a line-out. Television pictures clearly showed that he dived, but English referee Roger Quittenton was fooled and awarded a penalty, duly converted by Brian McKechnie for a 13-12 win. Since that infamous game, the competition has largely left Wales v New Zealand fixtures as the men in red have slipped from the pinnacle of the world game. A crushing 23-3 win for New Zealand in Cardiff in the Welsh Rugby Union's 1980 centenary game was a sign of things to come. The new professionalism in the southern hemisphere game that had left Europe behind was shown as the All Blacks swatted Wales aside 49-6 in Brisbane in the semi-final of the inaugural World Cup. The Kiwis went on to claim the Cup, and would inflict further misery on Wales on their ill-fated 1988 tour of New Zealand.\n \n A young, talented Wales side left Britain full of confidence as Triple Crown winners, but one of the greatest ever New Zealand teams demolished them 52-3 and 54-9. After also taking some fearful beatings in the provincial games, Wales captain Jonathan Davies returned home calling for urgent change in the national game, but as his views were ignored he - along with a generation of Wales' best players - chose to head north to rugby league.\n \n A 34-9 win in Cardiff followed for New Zealand in 1989, and at the 1995 World Cup Wales' big talk was made to look embarrassing as the All Blacks eased to victory in Johannesburg. A crushing 42-7 Kiwi triumph in Wembley followed in 1997, and as Wales' misery increased they turned to New Zealand for their salvation in the shape of coaches Graham Henry and Steve Hansen. There was a temporary resurgence in the Welsh game, but when an experimental New Zealand side came to Cardiff's new Millennium Stadium in 2002 they left with a 43-17 victory.\n \n A bruising 55-3 defeat followed for Wales in Hamilton in 2003 as Hansen built towards the World Cup, but in Australia it was a remarkable performance against the All Blacks that gave his side renewed hope. Wales were given no chance going into the game, but in the course of the match they rediscovered the value of attacking flair to lead 37-33 early in the second half. New Zealand rallied to a 53-37 win, but the style shown by Wales has been used as an inspiration as they look to a better future. They now face an All Blacks team led by Henry and Hansen, coming to Europe with a weakened squad at the end of a long season. An encouraging display against South Africa has inspired a confident Wales camp to believe they can claim their first win over the men in black for over 50 years. They have a chance, but clearly history is not on their side.\n", "llama3.2:1b": ["This article provides an overview of rugby union's history between New Zealand and Wales, highlighting significant matches, teams, and players that have played a crucial role in shaping their rivalry.", "**Early Rivalry (1890s-1940s)**: The two countries' first encounters date back to the late 19th century.", "In the early years of rugby union, both countries competed in international competitions without establishing clear rivalries.", "However, it wasn't until after World War II that the rivalry began to take shape.", "**1971 and Beyond (1967-1988)**: The infamous 1971 Lions tour by England's Carwyn James inspired New Zealand to win their first-ever test match against the All Blacks.", "This victory sparked a period of intense rivalry between the two teams, with notable matches including:\n\n* 1972 game in which Wales defeated the All Blacks 19-16\n* 1978 game in Cardiff, where Andy Haden's infamous dive for a penalty attempt led to a 13-12 win by Wales\n\n**1995 and Beyond (1989-2002)**: The Welsh team's dominance continued until they faced New Zealand in the 1995 World Cup.", "However, under the leadership of Graham Henry, Wales began to experience success:\n\n* 1997 game in Wembley Stadium saw a 42-7 Kiwi victory\n* 2003 game in Hamilton was notable for Hansen's revival as a player and coach\n\n**Modern Era (2002-Present)**: Under Steve Hansen's guidance, Wales have experienced resurgence, while New Zealand continues to be the dominant force:\n\n* 2002 match against Cardiff saw Hansen build momentum with a 43-17 victory\n* In Australia in 2003, Wales' performance inspired by their All Blacks opponents provided hope for future rivalries\n\n**Legacy and Future**: The history between New Zealand and Wales remains complex, but it is evident that their rivalry has played a significant role in shaping the sport.", "As both teams continue to compete at various levels of rugby union, their on-field encounters are sure to remain intense and storied."], "llama3.2:3b": ["This article provides a comprehensive history of the rivalry between Wales and New Zealand in rugby union, from 1967 to present day.", "Here's a summary of the key points:\n\n* The All Blacks first toured Wales as an independent team in 1969, but were defeated by Wales for the first time.", "* The rivalry has been marked by controversy over the years, including a notable incident in 1978 where Andy Haden was awarded a penalty try against Wales despite being clearly fouled.", "* In the 1980s and 1990s, New Zealand dominated the series, with the All Blacks winning several matches in quick succession.", "* A turning point came in 2002 when Wales won a match against New Zealand for the first time since 1969, but it was quickly followed by a 55-3 defeat in Hamilton.", "* In recent years, Wales have struggled to beat the All Blacks, with their last win coming in 1995.", "However, under coaches Graham Henry and Steve Hansen, there has been a renewed emphasis on attacking flair and Welsh players have rediscovered their ability to challenge top-level teams.", "* The article concludes that while history is not on Wales' side, they do have a chance of beating the All Blacks for the first time in over 50 years."], "gemma2:2b": ["## A History of Wales vs. New Zealand: From Glory to Despair\n\nThis text chronicles the long and storied rivalry between Wales and New Zealand rugby teams, highlighting key moments, victories, and losses in the process.", "**The Early Days:** The rivalry dates back to the early days of international matches with both countries making appearances in Rugby World Cups and gaining legendary status for their clashes.", "Early wins saw New Zealand dominate, especially in the 1980s and 1990s.", "**Rising Stars:**  Despite periods of dominance from New Zealand, Wales' spirit never truly dimmed.", "Their rise to prominence was marked by a resurgence in talent and an ability to compete head-on with the New Zealand giants.", "The text describes the impact of figures like Andy Haden and Jonathan Davies who played crucial roles in shaping their national game.", "**Turning Points:** Key moments defined the history of this rivalry, notably:\n\n* **1978 Controversy:** A famous match where a controversial penalty by referee Roger Quittenton secured an unlikely victory for New Zealand over Wales.", "* **Wales' Resurgence:** The Welsh team’s resurgence in the late 1990s and early 2000s inspired them to challenge the status quo, despite facing heavy losses against their adversaries from across the globe.", "* **New Zealand's Dominance:** A shift in power saw New Zealand dominate the rugby scene with exceptional success and a series of crushing victories that left Wales struggling for answers.", "**The Future:** This rivalry continues with an undercurrent of hope and anticipation.", "Despite the long string of losses, the Welsh team is looking to challenge their rivals with renewed confidence and determination.", "The text leaves readers pondering: Can Wales finally overcome New Zealand's formidable strength?", "This summary captures the key themes that run through this piece of historical writing on the rivalry between Wales and New Zealand in rugby."], "qwen2.5:0.5b": ["The answer to the question \"What were the significant events or achievements of New Zealand Rugby World Cup team during the 2002 World Cup?\"", "can be summarized as follows:\n\nA young and talented Wales side called the All Blacks made an impressive start to the 2002 World Cup.", "They defeated Australia, won their first World Cup match, and even drew against South Africa before falling at the end of the tournament.", "This was a significant achievement for the team because it marked them as one of the world's greatest Rugby teams in history.", "The key points from this summary are:\n\n1.", "**2002 World Cup**: Wales made an impressive start to their 2002 World Cup campaign, defeating Australia and drawing against South Africa.", "2.", "**Significant achievement**: This victory was a significant step up the world rankings for the Welsh side because it showed they were one of the best teams in rugby.", "3.", "**Impressive performance**: The team showcased their attacking skills by winning convincingly over Australia and drawing comfortably with South Africa, which is often seen as a weakness for rugby teams like Wales.", "4.", "**Longevity of the squad**: While this victory was not unprecedented for Wales in World Cups yet, it was still a significant achievement due to the high expectations and the desire to be the best team in history.", "5.", "**Controversy surrounding the 2002 World Cup**: Despite their successes, there were some criticisms about the World Cup tournament itself that year.", "However, these issues didn't significantly impact the overall positive perception of Wales at the time.", "This summary encapsulates the significant achievements and events during the 2002 World Cup for the Welsh rugby team in terms of their performance on the field and their world ranking."], "qwen2.5:1.5b": ["Sure, I'd be happy to help summarize or provide additional details about the rugby match between New Zealand and Wales that you described.", "Could you please clarify if there are any specific aspects of this particular game or series of matches that you're particularly interested in?", "It could be a historical event, statistical breakdown, key players involved, team strategies, or anything else related to this international rugby contest.", "You might also want to know:\n\n- Were you rooting for the Welsh team?", "- Which country do you think has the better rugby overall, New Zealand or Wales?", "- Are there any particular statistics you would like to discuss (e.g., tries scored, wins/losses, etc.)?", "Let me know so I can tailor my response accordingly!"], "qwen2.5:3b": ["This text provides an extensive overview of historic confrontations between the New Zealand national rugby union team (known colloquially as \"the All Blacks\") and Wales, highlighting significant matches, moments of rivalry, and the historical significance of such games in shaping both nations' rugby traditions.", "Here are key takeaways from this text:\n\n1.", "**Rivalry History**: The article emphasizes the long-standing and intense rivalry between New Zealand and Wales, particularly evident in their high-profile encounters like the 2009 World Cup semi-final.", "2.", "**Notable Matches**:\n   - The 1978 Cardiff game where Welsh referee Roger Quittenton awarded a penalty for a diving player was controversial and marked a low point for Wales.", "- The 1995 Rugby World Cup in Johannesburg, with New Zealand winning by 42 points against Wales (42-7), became infamous due to the significant margin of victory.", "3.", "**Impact on Wales**:\n   - After losing heavily to New Zealand, Wales's national team struggled for improvement and began looking towards rugby league instead.", "- The Welsh Rugby Union faced criticism for not adequately addressing its players' poor performance against New Zealand, leading many top talents to switch to rugby union in England.", "4.", "**Modern Context**:\n   - Recent matches have seen Wales making a comeback under coaches like Graham Henry and Steve Hansen, although the team remains short of form.", "- There's optimism that this period could lead to Welsh success over New Zealand for the first time in over 50 years following their victory against South Africa.", "5.", "**Future Implications**:\n   - With Wales now facing a high-quality All Blacks side led by experienced coaches, there is a sense of opportunity as well as challenge.", "- The match carries historical weight and traditional rivalry, suggesting that this outcome might be significant for both teams' standing in the sport globally.", "Overall, the text underscores the enduring nature of the New Zealand-Wales rugby rivalry and how recent developments could potentially shift this balance.", "It also highlights broader issues within Welsh rugby regarding player recruitment and national team performance."], "opencoder:1.5b": ["The given text appears to be an autobiography of a football player named \"James Taylor\".", "Following are some interesting insights about this player:\n\n1.", "\"Sum user\": The first clue that \"James Taylor\" made is the sum user in the text, which suggests he has spent lots of time with the fans playing at the stadium.", "2.", "\"Siblings\": James Taylor and his brother, Christopher Taylor, are brothers who have played together in their respective leagues, suggesting they may be friends or family members.", "3.", "\"Mileage\": It's not clear what specific mileage (distance covered) \"James Taylor\" has traveled on the field or other specific occasions.", "4.", "\"Club Matches\": The player plays for a football club, and he typically competes in different leagues throughout his career.", "For instance, he has won three major league titles and two minor league titles.", "5.", "\"League Table\": He is also associated with the league table, indicating he may have participated or competed in certain leagues.", "6.", "\"Team Membership\": Like James Taylor, he plays for a team and has shown significant contributions to this team.", "This could imply that he may have been part of the team's success, such as winning the team's title or scoring goals.", "7.", "\"Past Wins\": He has won various titles and leagues throughout his career.", "The number of wins can indicate how many years he has played in the sport.", "8.", "\"Career Length\": It's also not clear what specific length (seasons) \"James Taylor\" has been playing for at all times, suggesting he may have been a long-time player or a time traveler.", "9.", "\"International Matches\": He plays for international football matches and occasionally interns with other clubs in different leagues.", "10.", "\"Future Goals\": The last words of James Taylor might suggest his plans for future career development, such as staying up to date with latest sports trends or exploring different leagues.", "These insights provide an interesting perspective on how the player may have performed over time and what they may be aiming for their next goals in football."], "smollm:1.7b": ["The 2018 Rugby World Cup was held from July 19 to July 31, 2018, and it was won by New Zealand.", "The tournament was the second-most successful in the history of the Rugby World Cup, with a total of 67 points (out of 150).", "The United States dominated the competition, winning 11 matches to take the overall lead.", "They were led by quarterback Tom Brady, who won Super Bowl LIV and is widely considered one of the greatest players in NFL history.", "The US team also had a strong squad, with quarterback Patrick Mahomes leading the charge.", "The United Kingdom came second, winning 12 matches to take the overall lead.", "They were led by midfielder Harry Kane, who won Super Bowl LIV and is widely considered one of the greatest players in English Premier League history.", "The UK team also had a strong squad, with midfielder Kylian Mbappé leading the charge.", "The United States finished their campaign 13-20, while the UK finished 14-17."], "deepseek-r1:1.5b": ["The story of US vs. Wales is a tale of two rival sports teams navigating a vast and complex history from 1963 to 2003.", "The US and Wales were deeply tied through football, with Wales winning three crucial series against the US, including the 1984 series which ended in their favor.", "Key points include:\n\n- **Rivalry**: From early 1963 to late 2003, the two teams played back-to-back series against each other, with Wales winning the 1967 series (US win), 1971 series (Wales win), and 1978 series (Wales win).", "The US dominated 1984, losing both series against Wales.", "- **Coaches**: James guided the US to a remarkable victory in 1967, while Wales' head coach took charge of the UK Series later that year.", "- **Player Impact**: Players like Andy Haden and Jonathan Davies were pivotal, with McKechnie being influential for Wales' late series success against New Zealand.", "- **Turned Away**: Wales faced a significant challenge in 1989 when they lost to New Zealand, but then turned around in 2003, securing a win that inspired the team and set them on a trajectory towards a historic World Cup victory over South Africa.", "- **Shift to Rugby League**: After two international series, Wales decided to play rugby league instead of football.", "This shift was motivated by their growing influence as an independent team, with players like Jonathan Davies leading the way.", "The narrative highlights the enduring rivalry and how each side adapted through history, while Wales' journey from football to rugby league marked a turning point in their national identity."], "tinyllama:1.1b": ["In summary, there have been numerous controversies and historical rivalries between the All Blacks and the All Blacks Rugby Club of New Zealand, including the following:\n\n1.", "1905: The first ever international match between New Zealand and Australia (Rugby Union) ended in a draw due to New Zealand's refusal to participate without a coach.", "2.", "1907: A Rugby League International between Australia and New Zealand was played, but both sides were in disorganised conditions and the game finished 3-3.", "3.", "1914: The All Blacks won a series against France by 12-6, despite not having one of their most experienced players (Rugby Union), due to injury.", "4.", "1915: New Zealand defeated Australia in a rugby union match and gained an opportunity for a decisive win over them later.", "The All Blacks were able to get a draw (1-1) which gave them the opportunity to play the second game, which they won by 26 points to 7 points, despite having not played well for most of the first game.", "5.", "1918: The third and final Rugby Union series between New Zealand and Australia ended in a draw (0-0), with neither team scoring a try.", "6.", "1922: In the second rugby union test match between New Zealand and Australia, the All Blacks played their first ever Test match, winning by 33 points to 17, despite playing poorly.", "The next two tests were drawn due to weather conditions.", "7.", "1925: A Rugby League International between Australia and New Zealand ended in a draw (0-0).", "8.", "1926: In the first rugby union Test match of the Second World War, New Zealand was defeated by England (40 points to 3), despite being the better side.", "The game was played behind closed doors due to political reasons.", "9.", "1927: Rugby League International between Australia and New Zealand ended in a draw (0-0).", "10.", "1929: A rugby union match between New Zealand and South Africa resulted in a draw (16 points each), despite being the best-ever team that New Zealand played at the time.", "These examples show how there have been numerous controversies and rivalries between the All Blacks and the All Blacks Rugby Club of New Zealand, even up to modern times.", "The All Blacks have faced tough opponents from all over the world in these games, including Australia, South Africa, England, Wales, and Wales's traditional rivals, Ireland."], "tinydolphin:1.1b": [" - New Zealand's All Blacks: The Legacy of World Cup Winners"], "phi:2.7b": [" The key events and milestones in the development of rugby union and rugby league in Wales include the formation of the Welsh Rugby Union in 1876, when it became the leading organization for the sport in Wales.", "In 1893, Wales' first international match was played against England, marking a significant moment in the history of rugby union in Wales.", "The first Welsh Grand Slam in 1908-09 further solidified Wales' dominance in the sport.", "In 1921, the International Rugby League (IRL) was formed as a breakaway from the Rugby Football Union (RFU).", "This led to the establishment of professional rugby league in Britain and Australia.", "In 1924, during the Five Nations Championship, an international rugby union game between Wales and Australia broke two world records for most tries scored by one team: 17 tries scored by England in a game against Scotland in 1896, and 16 tries scored by New Zealand in an 1884 match against a combined Australian/New Zealand team.", "The 1950s saw the rise of the All Blacks, New Zealand's national rugby union team, as a dominant force in international rugby.", "The first Five Nations Championship was held in 1927-28, followed by the Six Nations from 1930-31 onwards.", "In the 1970s and 1980s, Wales became one of the leading teams in the world, winning the Grand Slam twice, in 1973-74 and 1985-86.", "The sport of rugby league has a strong following in Wales as well.", "The game was introduced to Wales in 1892 by James L. Glynn, who also helped establish the Welsh Rugby League (WRL) in 1895.", "However, it wasn't until 1920 that the first official international match between Wales and Australia took place.", "The success of the Welsh national rugby league team has declined over the years, but they still hold a strong presence in the sport, with their home matches being played at the iconic Millennium Stadium in Cardiff.", "Both rugby union and rugby league have had a significant impact on the history of sports in Wales.", "Rugby union has been the dominant sport since its establishment and has produced many successful teams and players over the years.", "The introduction of professional rugby league also brought new challenges for Welsh rugby, with the formation of the IRL and the rise of the All Blacks as an international powerhouse.", "Follow-up Questions: \n1) What were some key factors that led to the establishment of professional rugby league in Britain?", "Answer: Some key factors include the formation of the International Rugby League (IRL) as a breakaway from the Rugby Football Union (RFU), and the success of the New Zealand national rugby union team, which sparked interest in professional rugby league in other countries.", "2) How did the rivalry between Wales and Australia impact the development of rugby in both countries?", "Answer: The intense competition between Wales and Australia played a significant role in shaping the development of rugby in both countries, leading to new records being set and driving improvements in the sport.", "3) In your opinion, which sport has had a bigger impact on the history of sports in Wales - rugby union or rugby league?", "Provide reasons for your answer.", "Answer: This is subjective and can vary depending on different perspectives.", "Some may argue that rugby union has had a greater impact due to its long-standing presence in Wales and the country's success in international tournaments like the Six Nations Championship.", "Others may argue that rugby league has had a bigger impact as it brought new challenges for Welsh rugby, such as the rise of professional leagues and the dominance of international teams like New Zealand.", "Ultimately, both sports have contributed to the overall development and popularity of sports in Wales."], "orca-mini:3b": [" The article covers the history of rugby between New Zealand and Wales, including key moments and milestones in their rivalry.", "It also highlights some of the challenges that both teams have faced in the past and how they are facing them today.", "Overall, it provides a comprehensive overview of the relationship between these two rugby powerhouses."], "hermes3:3b": ["New to sum up the competitive history between the New Zealand All Blacks rugby union team and the Welsh Rugby Union's national team (Wales), here is a comprehensive overview of their encounters:\n\nThe relationship between Wales and the New Zealand All Blacks has been marked by both impressive victories for each team and moments of historical controversy.", "While New Zealand has established itself as one of the most successful teams in world rugby, with numerous World Cups and Triple Crown wins to its name, their rivalry with Wales has seen many memorable matches.", "Wales' first encounter with the All Blacks was during a 1963-64 tour by Wilson Whinneray's side.", "The New Zealand team went unbeaten throughout this trip, but they were asked about an incident where they lost to East Wales and drew against Newport.", "The rivalry gained momentum when Gareth Edwards' Wales defeated Dick Muir's All Blacks 9-6 at Cardiff Arms Park in 1969.", "However, the following year proved disastrous for Wales as James Beattie's team suffered defeats by a margin of over 50 points in both games on tour.", "1972 saw Carwyn James' Lions-led Llanelli side beat New Zealand 9-3, while Graham Henry's All Blacks returned the favor with a bruising victory.", "However, their next meeting ended controversially when Andy Haden's try was awarded following an incident near the line-out in Cardiff in 1978.", "The controversy continued in 1988 as Hansen's All Blacks won both games against Davies' Wales, infamously calling him a \"gutter fighter\" (Davies had used similar terms about New Zealand players).", "This period of conflict seemed to end when Steve Hansen took over as head coach.", "Graham Henry and Hansen brought renewed success for the All Blacks, but also led them to rediscover the attacking flair that Wales showed in their 2002 victory.", "In a nail-biting encounter at the Millennium Stadium in Cardiff in 2006, Wales managed to lead early in the second half against an otherwise formidable New Zealand team before being beaten 53-37.", "The Welsh team displayed newfound flair and determination after years of struggling against the All Blacks.", "The match set the stage for what has been described as a \"new chapter\" in their rivalry, as Wales looked toward better future results against one of world rugby's top teams.", "With new coaches and improved player performance, Wales now have a chance to achieve an unprecedented win over the New Zealand All Blacks after 50 years.", "Despite the odds, Welsh coach Warren Gatland has expressed his team's determination to compete in these upcoming matches with confidence.", "The historical context of past meetings will be interesting to watch as Wales looks toward its first victory against the All Blacks since 1969."], "stablelm-zephyr:3b": ["This passage provides a detailed historical account of rugby matches between Wales and New Zealand from 1971 to 2003.", "It covers various victories and defeats for both sides, highlighting key moments and turning points in the rivalry between these two nations.", "The passage also discusses how different factors such as professionalism, style of play, and coaching influences shaped the outcomes of these games.", "Additionally, it mentions the influence of individual players like Graham Henry and Steve Hansen on their respective teams' performances.", "Overall, this historical context provides a deeper understanding of the long-standing rugby rivalry between Wales and New Zealand."], "chatgpt-4o-latest": ["New Zealand rugby began in 1870 when Charles John Munro introduced the game, which quickly became a national passion.", "The sport resonated with the Maori warrior ethos, leading to the formation of the 'New Zealand Native Team' in 1888, integrating Maori and white players.", "The All Blacks, known for their all-black kit and the Haka, played their first international in 1903, defeating Australia.", "Their 1905 European tour established their dominance, despite a controversial loss to Wales.", "New Zealand's rivalry with South Africa began in 1921, with disputes over Maori player inclusion.", "The 1924-25 'Invincibles' won all 30 games on tour, but their 2-3-2 scrum formation was later outlawed.", "The All Blacks continued to dominate, though they suffered occasional setbacks, such as losses to Wales in 1935 and 1953.", "By the 1960s, they were the world's top team, despite a shock loss to Newport in 1963.", "The 1970s saw intense clashes with Wales, including the controversial 1978 match where a dubious penalty secured a New Zealand win.", "The 1980s and 1990s marked New Zealand's increasing dominance, highlighted by their 1987 World Cup victory and crushing wins over Wales.", "Welsh rugby struggled, leading to the hiring of New Zealand coaches Graham Henry and Steve Hansen.", "By the early 2000s, Wales showed signs of resurgence, notably in a spirited 2003 World Cup match against New Zealand.", "As the All Blacks prepared for another European tour, Wales hoped to break their long losing streak, but history remained against them."], "stablelm2:1.6b": ["In this passage, various events and highlights from the history of rugby between New Zealand and Wales are discussed.", "Key moments include:\n\n1.", "The infamous Welsh Rugby Union's centenary game where the All Blacks demolished Wales 6-0 in Cardiff.", "2 Clemen's defeat of 35-year-old English footballer Billy Meredith, which was considered to be a fairytale ending by many, as he played against his former club for the first time since leaving Huddersfield Town.", "3.", "The New Zealand team that toured Wales after World War II, led by coaches Graham Henry and Steve Hansen, which helped revive interest in Welsh rugby.", "4.", "The 2005 Rugby World Cup semi-final between New Zealand and Wales at Wembley Stadium, where the All Blacks won 76-13.", "Throughout this discussion, it is emphasized that both teams have a rich history of competition and success, with New Zealand consistently outperforming and dominating in their matches against Wales."], "granite3.1-dense:2b": ["The historical rivalry between New Zealand and Wales in rugby union has been marked by intense, closely contested matches that have shaped both nations' approaches to the sport.", "Here's a summary of key encounters:\n\n1.", "**1972**: A thrilling 19-16 loss for New Zealand at Cardiff Arms Park, revenge for a previous Lions series defeat.", "2.", "**1974**: New Zealand's 12-3 win over Wales in a non-cap game, further solidifying their dominance.", "3.", "**1978**: The infamous \"Millennium Storm\" as the Barbarians defeated the All Blacks 23-11 at Cardiff, a result that fueled longstanding resentment.", "4.", "**1980**: New Zealand's dominant victory in Cardiff (49-6) showcasing their new professionalism and the start of Wales' decline as a world power.", "5.", "**1988**: A crushing 52-3 and 54-9 losses during New Zealand's tour of Wales, leading to players, including captain Jonathan Davies, defecting to rugby league.", "6.", "**1989**: Another significant New Zealand win, 34-9 at Cardiff.", "7.", "**1995**: A crushing 42-7 defeat for Wales in the first meeting after the World Cup, further cementing their standing as an also-ran among top nations.", "8.", "**1997**: New Zealand's emphatic 42-7 victory at Wembley, highlighting the vast gap between the two teams.", "9.", "**2002**: A bruising 43-17 win by New Zealand in Cardiff.", "10.", "**2003**: Another tough Welsh defeat, 55-3 at Hamilton.", "11.", "**2009**: An inspiring performance against the All Blacks in Australia, where Wales led 37-33 early but ultimately lost 53-37, a result that sparked reforms and renewed optimism for future matches against New Zealand.", "12.", "**2019**: The upcoming match between the same teams on home soil, with Wales hoping to reverse past trends, and New Zealand looking to defend their status as a world-class team.", "This summary demonstrates that while Wales has seen periods of strong performances against New Zealand, overall the Kiwis have consistently demonstrated superiority due to their greater depth in rugby talent, more refined professional systems, and strategic prowess under coaches like Graham Henry and Steve Hansen.", "Wales' recent progress is a testament to the impact of coaching changes and an increased focus on attacking flair, but they still face significant challenges in competing with New Zealand at their best."]}