{"raw_text": "Ireland v USA (Sat)\n \n Saturday 20 November\n \n Lansdowne Road, Dublin\n \n 1300 GMT\n \n The Irish coach knows a repeat of the record 83-3 victory over the States in 2000 is not on the agenda and expects a real test at Lansdowne Road. \"Their coach Tom Billups will have them very organised,\" said O'Sullivan. \"They ran five tries past the French in the summer, so we will not take them for granted. We have guys coming into the team who are chomping at the bit.\" The Irish line-up shows nine changes from the team which started against South Africa with winger Tommy Bowe and flanker Denis Leamy making their international debuts. The other changes see recalls for backs David Humphreys, Kevin Maggs and Guy Easterby with Eric Miller, Marcus Horan, Donnacha O'Callaghan and Frank Sheehan all returning to the pack.\n \n O'Sullivan said the players coming in had the opportunity to stake claims for inclusion against Argentina on 27 November. Easterby gets a rare start at scrum-half while Humphreys, now effectively Ronan O'Gara's deputy at fly-half, wins his 65th cap. \"We have got to get the focus right on the day,\" said Ulster man Humphreys. \"The US may be classed as weaker opposition, but we will treat them with the respect they deserve.\" The States lost 39-31 against France in their last international and are ranked 16th in world rugby. The Americans have made three changes, plus one positional switch from the game in July against the French. Lock Alec Parker, blind-side flanker Brian Surgener and right wing Al Lakomskis return and captain Kort Schubert of the Cardiff Blues shifts to number eight. Schubert is the only Eagles player remaining from the sides' meeting four years ago.\n \n G Murphy; S Horgan, B O'Driscoll (capt), K Maggs, T Bowe; D Humphreys, G Easterby; M Horan. F Sheahan, J Hayes, D O'Callaghan, P O'Connell, S Easterby, D Leamy, E Miller.\n \n S Byrne, S Best, L Cullen, A Foley, P Stringer, R O'Gara, G Dempsey.\n \n Viljoen; Lakomskis, Emerick, Sika, Fee, Hercus, Timoteo; MacDonald, Wyatt, Waasdorp, Parker, Klerck, Surgener, Petruzzella, Schubert (capt).\n \n Hobson, Osentowski, Gouws, Mo'unga, Williams, Sherman, Tuipulotu.\n", "llama3.2:1b": ["Ireland will face a test of their skills against the US in a rugby match on November 20.", "The Irish team includes nine changes from last week's game against South Africa and has made several key additions to the lineup.", "The back row is expected to be highly organized, with Denis Leamy making his international debut.", "David Humphreys, who now plays as Ronan O'Gara's deputy at fly-half, is eager to make a significant contribution in what promises to be a tough match against the US.", "The team also features several players returning from their last match against France, including captain Kort Schubert and flanker Brian Surgener.", "Ireland's lineup includes notable names such as Johnny Sexton, Stuart Horgan, and James Mitchell."], "llama3.2:3b": ["Ireland coach Joe O'Sullivan expects a real test against the US in their match at Lansdowne Road, with nine changes to the team that started against South Africa.", "The Irish have players chomping at the bit for selection, including Guy Easterby and David Humphreys, who wins his 65th cap.", "The US are ranked 16th in world rugby and lost to France 39-31 in their last international, with captain Kort Schubert returning from a positional switch."], "gemma2:2b": ["Ireland faces the USA in a test match at Lansdowne Road on November 20th.", "The Irish team has nine changes from the last game, with many players looking for opportunities to make the starting line-up against Argentina.", "The US team is ranked 16th and will be tough competition, despite their lower ranking."], "qwen2.5:0.5b": ["- Dublin: Ireland vs.", "US\n- Irish team:\n  - Backline:\n    - Toms Billups (coach)\n    - David Humphreys (back)\n    - Kevin Maggs (back)\n    - Guy Easterby (full-back)\n  - Changes from previous game:\n    - Eric Miller (back)\n    - Marcus Horan (half-back)\n    - Donnacha O'Callaghan (centre/back)\n- US team:\n  - Backline:\n    - David Humphreys (back)\n    - Kevin Maggs (back)\n    - Guy Easterby (full-back)\n  - Changes from previous game:\n    - Eric Miller (back)\n    - Marcus Horan (half-back)\n    - Donnacha O'Callaghan (centre/back)"], "qwen2.5:1.5b": ["Ireland vs USA on Saturday, November 20 at Lansdowne Road in Dublin.", "Ireland has nine changes from the match against South Africa and is expecting a tough test against organized opponents with France as a benchmark for their preparation.", "The US team, ranked 16th in world rugby, made three changes since their last international game.", "Both teams have strong scrum-halves in contention for inclusion."], "qwen2.5:3b": ["Ireland faces the USA at Lansdowne Road on Saturday in a test match following their 2000 victory.", "The Irish team has nine changes from the previous game against South Africa, with players like Tommy Bowe and Denis Leamy making debuts.", "O'Sullivan expects it to be a challenging match as Billups' organized US team threatens any repeat of Ireland's 83-3 win in 2000.", "The USA has made three changes since their last match and is ranked 16th globally.", "Players like David Humphreys and Kevin Maggs aim for caps against Argentina, while captain Kort Schubert returns after missing the 2015 game.", "Ireland's starting XV includes players like S Horgan, G Easterby, D Humphreys, and M Horan."], "opencoder:1.5b": ["Ireland v USA (Sat)\n\nSaturday 20 November\n\nLansdowne Road, Dublin\n\n13:00 GMT\n\nThe Irish coach knows a repeat of the record 83-3 victory over the States in 2,000 is not on the agenda and expects a real test at Lansdowne Road.", "\"Their coach Tom Billups will have them very organised,\" said O'Sullivan.", "\"They ran five tries past the French in the summer, so we will not take them for granted.", "We have guys coming into the team who are chomping at the bit.\"", "The Irish line-up shows nine changes from the team which started against South Africa with winger Tommy Bowe and flanker Denis Leamy making their international debuts.", "The other changes see recalls for backs David Humphreys, Kevin Maggs and Guy Easterby with Eric Miller, Marcus Horan, Donnacha O'Callaghan and Frank Sheehan all returning to the pack.", "O'Sullivan said the players coming in had the opportunity to stake claims for inclusion against Argentina on 27 November.", "Easterby gets a rare start at scrum-half while Humphreys, now effectively Ronan O'Gara's deputy at fly-half, wins his 65th cap.", "\"We have got to get the focus right on the day,\" said Ulster man Humphreys.", "The US may be classed as weaker opposition, but we will treat them with the respect they deserve.", "The States lost 39-31 against France in their last international and are ranked 16th in world rugby.", "The Americans have made three changes, plus one positional switch from the game in July against the French.", "Lock Alec Parker, blind-side flanker Brian Surgener and right wing Al Lakomskis return and captain Kort Schubert of the Cardiff Blues shifts to number eight.", "Schubert is the only Eagles player remaining from the sides' meeting four years ago.", "G Murphy; S Horgan, B O'Driscoll (capt), K Maggs, T Bowe; D Humphreys, G Easterby; M Horan.", "F Sheahan, J Hayes, D O'Callaghan, P O'Connell, S Easterby, D Leamy, E Miller."], "smollm:1.7b": ["The Irish coach knows a repeat of the record 83-3 victory over the States in 2000 is not on the agenda and expects a real test at Lansdowne Road.", "They will have to run five tries past the French in the summer, so they will not take them for granted.", "The Irish line-up shows nine changes from the team which started against South Africa with winger Tommy Billups and flanker Denis Leamy making their international debut.", "The other changes see recalls for backs David Humphreys, Kevin Maggs and Guy Easterby with Eric Miller, Marcus Horan, Donnacha O'Callaghan and Frank Sheehan all returning to the pack."], "deepseek-r1:1.5b": ["Saturday 20 November  \nIreland vs USA (Sat)  \nLansdowne Road, Dublin  \n1300 GMT  \n\nThe Irish coach expects a real test at Lansdowne Road after their 83-3 victory over the States in 2000.", "\"Tom Billups will help organize the match,\" said O'Sullivan.", "They have experienced players and new ones, with four returning.", "US line-up changes include new recruits and three additions.", "US made three changes from their July game against France, including a position switch.", "Schubert, a former Irish player, iscaptaining the Cardiff Blues.", "The US lost 39-31 to France and are ranked 16th in world rugby.", "They will prepare for Argentina on November 27th.", "Key details: Ireland vs USA, coach's expectations, US changes, new players, Schubert, line-ups, US composition."], "tinyllama:1.1b": ["The Irish rugby team plays against the United States in a crucial match at Lansdowne Road on Saturday.", "They have made nine changes from their previous game against South Africa, with wingman Tommy Bowen and backs David Humphrey and Donnacha O'Callaghan returning to the line-up.", "The Irish coach expects a real test of their form as they face off against the strong US side.", "The Americans have made three changes but captain Korot Schubert returns to his usual position at number eight.", "The match kicks off at 1300 GMT."], "tinydolphin:1.1b": [" Irish coach Tom Billups expects a tougher game against the USA than their previous match against South Africa, where they won by an impressive record of 83-3.", "The team is looking for a repeat performance to maintain their momentum in preparation for Argentina, on 27 November.", "Key changes include backs David Humphreys and Kevin Maggs returning to the lineup from the South Africa match."], "phi:2.7b": [" The Irish coach expects a real test at Lansdowne Road against the States, who have made three changes from their last international loss to France.", "The Irish line-up has nine new players making their debut including David Humphreys and Eric Miller."], "orca-mini:3b": [" Ireland vs USA (Sat) \n- Ireland coach Giovanni Trapattoni knows his team will face a real test against the United States in Dublin on Saturday.", "- The American coach Tom Billups will have his team very organized, says Aidan O'Sullivan.", "- The Irish line-up has nine changes from the team which started against South Africa with winger Tommy Bowe and flanker Denis Leamy making their international debuts.", "- Backups David Humphreys, Kevin Maggs and Guy Easterby get rare starts while Marcus Horan, Donnacha O'Callaghan and Frank Sheehan return to the pack.", "- The States lost 39-31 against France in their last international and are ranked 16th in world rugby.", "- The American line-up makes three changes, plus one positional switch from the game in July against the French.", "- Captain Kort Schubert of the Cardiff Blues shifts to number eight.", "- Ireland beat the US by 25 points in their last meeting in 2000."], "hermes3:3b": ["Ireland vs USA rugby match summary\n- Saturday 20th Nov\n- Lansdowne Road, Dublin\n- Irish coach expects tough game against US team\n- US ranked 16th in world rugby, lost last international (39-31 v France)\n- 9 changes for Ireland (9 new players), 1 start for Guy Easterby at scrum-half\n- 3 changes and positional switch for USA (Alec Parker, Brian Surgener, Al Lakomskis return)"], "stablelm-zephyr:3b": ["Ireland will face USA at Lansdowne Road in Dublin on Saturday, 20 November, with a record 83-3 victory in 2000 not being repeated.", "Ireland's coach, Mike O'Sullivan, expects a tough test against the well-organised American side, who have made five tries during the summer.", "Nine changes have been made to the Irish team lineup, including debuts for Tommy Bowe and Denis Leamy.", "The match against Argentina on 27 November will present an opportunity for new players to stake their claims.", "The USA are ranked 16th in world rugby, having lost 39-31 against France in their last international."], "chatgpt-4o-latest": ["Ireland's coach expects a tough match against the USA at Lansdowne Road, acknowledging their strong performance against France.", "Ireland makes nine changes from their last game, with Tommy Bowe and Denis Leamy debuting.", "David Humphreys, Kevin Maggs, and Guy Easterby return, with Easterby starting at scrum-half and Humphreys earning his 65th cap.", "The USA, ranked 16th, lost narrowly to France and make four changes, including captain Kort Schubert shifting to number eight.", "Both teams aim to prove themselves ahead of future matches."], "stablelm2:1.6b": ["Ireland will face the US in a rugby match at Lansdowne Road on Saturday, November 17th.", "The Irish team has made nine changes from their recent game against South Africa and expects a tough test due to the US's record victory over Ireland.", "Coach Joe O'Sullivan acknowledges that they won't take the US lightly despite being ranked lower in the world.", "The US has made three changes, with captain Kort Schubert shifting to number eight and lock Alec Parker, blind-side flanker Brian Surgener, and right wing Al Lakomskis returning.", "Ireland's line-up includes nine new players who aim to stake their claims for inclusion against Argentina on November 25th, which coincides with the US game.", "The Irish team will face the US in a match that could potentially result in another historic victory if the Irish players perform well and adapt quickly to the game conditions."], "granite3.1-dense:2b": ["On Saturday, November 20, the Irish national rugby team faces off against the United States at Lansdowne Road in Dublin, starting at 1300 GMT.", "This match is a test rather than a repeat of Ireland's historic 83-3 victory over the US in 2000.", "Irish coach Paul O'Sullivan anticipates a challenging game, acknowledging the US's improved performance, which saw them score five tries against France in July.", "Nine changes are made to the starting lineup, with wingers Tommy Bowe and flanker Denis Leamy making their debuts alongside recalls for David Humphreys, Kevin Maggs, Guy Easterby, Eric Miller, Marcus Horan, Donnacha O'Callaghan, and Frank Sheehan.", "The US team, ranked 16th globally, has also made three changes, including captain Kort Schubert shifting from blind-side flanker to number eight.", "The Irish squad aims for focus and a strong performance against the American squad, which lost 39-31 to France in their last match.", "O'Sullivan emphasizes that while the US is considered weaker, they will not underestimate them."]}