{"raw_text": "Borders 19-20 Ulster\n \n Ulster clung on for a morale-boosting Celtic League win over bottom club Borders at Netherdale on Friday night.\n \n A late try by Borders substitute Jonny Weston had set up a dramatic finish, but the Scottish side could not complete the fightback. Ulster had led 20-6 with tries from Paul Steinmetz and Bryn Cunningham. But the Irish province failed to add to the tally in the second half and ended up relieved to get the win to lift them to eighth place in the table. Borders had edged ahead with a sixth-minute penalty by Charlie Hore - only to hand the visitors the initiative via a gift try. Calum MacRae surrendered possession before centre Steinmetz sent a chip into the danger zone. Substitute Joe Pattison - who had come on for the injured Gareth Morton - wrongly thought the ball was trickling out of play and eased up on the chase.\n \n The speedy Steinmetz had other ideas and he raced up to get the vital touch in the nick of time, giving Adam Larkin an easy conversion. Ally Warnock clawed back three points for Borders, but they were soon hit by another double-blow. First, Mark Blair was yellow carded for killing the ball on the ground and then full-back Cunningham bagged the second touchdown in the wake of fine work by skipper Andy Ward. Larkin again added the extras. Even worse was to come for Borders when Larkin kicked two more penalties just before the break, the second of which also led to Kelly Brown being sin-binned. The hosts gave themselves a glimmer of hope immediately after the restart, however, when Warnock struck a penalty at the other end. And he repeated the feat to set up the tense finale. Ulster coach mark McCall said he was delighted to get the victory. \"Borders are a tougher proposition this year in spite of the fact that they have not had a victory in some time,\" said McCall. \"In the first 20 minutes we were edgy but in the second 20 minutes we played some of our best rugby this season and scored two good tries.\"\n \n Morton, Moffat, MacRae, Hore, Berthinussen, Warnock, Moore, Thomson, Ford, Douglas, Blair, Stewart, Gray, Brown, McEntee.\n \n Kay, Parr, McGee, Rennick, Weston, Millar, Pattison.\n \n Cunningham, Maxwell, Bell, Steinmetz, Howe, Larkin, Campbell, S. Best, Shields, Moore, Frost, McCullough, Ward, Feather, N. Best.\n \n Brady, McCormick, Longwell, Browne, Doak, S. Young, Bowe.\n \n Phil Fear (WRU)\n", "llama3.2:1b": ["Ulster won 20-19 against Borders at Netherdale on Friday night.", "The game was scoreless until the sixth-minute penalty by Charlie Hore gave Borders an advantage.", "However, Ulster responded with a try from Paul Steinmetz and Bryn Cunningham, and they led 6-0 after two minutes of the second half.", "Steinmetz then scored again for Ulster in the third minute of the second half, and substitute Joe Pattison was yellow carded by Border goalkeeper Mark Blair before scoring his own try to level the scores at 7-7.", "The game went into extra time, where Ulster's Calum MacRae scored a chip to give them the lead.", "However, Borders' Kelly Brown was sin-binned for killing the ball on the ground in the first half and Andy Ward kicked two penalties to seal the victory."], "llama3.2:3b": ["Ulster defeated Borders 20-6 in the Celtic League with tries from Paul Steinmetz and Bryn Cunningham.", "Borders' Charlie Hore scored a penalty in the sixth minute before Ulster took the lead with a chip try by Steinmetz, which was converted by Adam Larkin.", "Borders fought back but were hit with a yellow card for Mark Blair and another sin bin for Kelly Brown, allowing Ulster to score two more tries and kick several penalties, including two from Larkin."], "gemma2:2b": ["Ulster defeated Borders in a dramatic Celtic League game, winning 20-19 despite a late comeback attempt by the latter.", "A late try from Jonny Weston gave Borders hope, but Ulster was ultimately victorious thanks to tries from Paul Steinmetz and Bryn Cunningham and penalties from Adam Larkin."], "qwen2.5:0.5b": ["Ulster secured a vital win over Borders in the Ulster Cup with a scoreline of 20-6.", "The Irish team led by Jamie Steinmetz and Bryn Cunningham after the first half.", "Following a penalty from Charlie Hore, Calum MacRae conceded possession to Grant Shepherd before getting a conversion try for Adam Larkin.", "Borders took control with a penalty by Mark Blair who later converted his own penalty.", "Warnock's side doubled their lead through a penalty from Kelly Brown.", "The Ulster coach was delighted with the win and described it as \"a tougher season compared to this year.\""], "qwen2.5:1.5b": ["Ulster beat Borders in a tense 52-19 win to move to eighth place in the table after leading 20-6 but failing to complete a comeback in a clash at Netherdale between two bottom teams."], "qwen2.5:3b": ["Ulster secured a morale-boosting Celtic League victory over Borders at Netherdale with a 20-6 win.", "Ulster led thanks to tries from Paul Steinmetz and Bryn Cunningham in the first half.", "Borders briefly took the lead through a Charlie Hore penalty but Ulster responded with two tries by Adam Larkin.", "Despite late heroics from substitute Jonny Weston, including a try that almost won the game for Borders, Ulster held on to secure their eighth-place position in the league table.", "Ulster coach Mark McCall praised his team’s improved performance in the second half.", "The match featured players such as Calum MacRae, Adam Larkin, and Kelly Brown from Ulster, while Jonny Weston and Joe Pattison led Borders'’ efforts."], "opencoder:1.5b": ["Borders 19-20 Ulster wins over Borders at Netherdale on Friday night.", "Ulster clung on for a morale-boosting Celtic League win and had led 20-6 with tries from Paul Steinmetz and Bryn Cunningham.", "However, the Irish province failed to add to the tally in the second half and ended up relieved to get the win to lift them to eighth place in the table.", "Borders also had edged ahead with a sixth-minute penalty by Charlie Hore, who had given Adam Larkin an easy conversion.", "Ally Warnock offered back three points for Borders but they were soon hit by another double-blow.", "The hosts gave themselves a glimmer of hope when Warnock struck a penalty at the other end.", "However, they repeated the feat to set up the tense finale.", "Ulster coach Mark McCall was delighted to get the victory.", "\"Borders are a tougher proposition this year in spite of the fact that they have not had a victory in some time,\" he said."], "smollm:1.7b": ["Borders 19-20 Ulster"], "deepseek-r1:1.5b": ["Ulster rugby team secured a 20-14 victory over Borders in the Netherdale game.", "Ulsters led 20-6 after leading from behind with tries by Paul Steinmetz and Bryn Cunningham.", "However, a late attempt failed to secure an upset for the visitors.", "Notable players included Morton (WRLD), Moffat (WRU), MacRae (WRKD), Hore (GRKD), Berthinussen (GDKD), Warnock (GRKD), Moore (SWRD), Thomson (SWKD), Ford (SWKD), Douglas (SWKD), Blair (GRKD), Stewart, Gray, Brown, McEntee, and others.", "The game ended in overtime with Larkin (BRKD) scoring his second penalty to clinch the win for Ulsters."], "tinyllama:1.1b": ["The Ulster Rugby team achieved a morale-boosting victory over their bottom club Borderes in the CeltiC League on Friday evening.", "They were able to add to their point total with tries from two different players, Paul Steinmetz and Bryn Cuinniman, but Borderes refused to give up easily and eventually scored four more tries to win 20-6.", "The Ulster coach praised his team's performance despite the fact that they had not won a game in some time.", "Despite this disappointing result, the Ulstern were able to secure the victory thanks to two converted penalties from Andy Ward and a first-half goal by Mark McCall, who was delighted with their performance."], "tinydolphin:1.1b": [" This text is referring to a rugby match between the Ulster and Borders.", "The summary of this event is that the Borders team managed to edge out their opponents, 20-6, with late tries from substitute Jonny Weston.", "However, they were unable to add to their lead during the second half.", "Despite this setback, coach Mark McCall was delighted with his team's performance."], "phi:2.7b": [" Ulster won against bottom club Borders at Netherdale in the Scottish Inter-District Championship on Friday night with a try from Bryn Cunningham and two penalties by Adam Larkin.", "Despite late attempts by Borders, including a try from substitute Jonny Weston, Ulster secured the win to lift them to eighth place in the table.", "The hosts played some of their best rugby this season, but had trouble converting opportunities into points."], "orca-mini:3b": [" Ulster won against Borders in a close game by 20-6 with two tries scored by Paul Steinmetz and Bryn Cunningham, while Charlie Hore gave Borders the lead penalty and Jonny Weston scored a late try for Borders.", "However, Adam Larkin converted both tries for Ulster.", "In the second half, Ulster's Ally Warnock was yellow carded and Borders' Mark Blair was sin-binned.", "The game ended with Ulster's Kelly Brown scoring another penalty to secure their win."], "hermes3:3b": ["Ulster won a Celtic League match against Borders 20-16 at Netherdale.", "Borders' late try by Jonny Weston nearly led to a comeback but Ulster secured the win with two tries from Steinmetz and Cunningham.", "Border's Charlie Hore scored an early penalty, while Ulster's Larkin converted tries and added 2 penalties before half-time."], "stablelm-zephyr:3b": ["Ulster secured a morale-boosting victory over bottom club Borders in the Celtic League, maintaining their lead at 20-6 with tries from Paul Steinmetz and Bryn Cunningham.", "Borders substitute Jonny Weston's late try set up a dramatic finish, but Ulster held on to secure the win and move to eighth place in the table.", "Borders were dealt a series of blows, including being yellow carded and two additional penalty incidents leading to sin-bins for Kelly Brown.", "Despite their loss, Borders showed hope with a late penalty attempt and set pieces that led to a tense finale."], "chatgpt-4o-latest": ["Ulster secured a morale-boosting 20-19 victory over Borders in the Celtic League at Netherdale.", "Ulster led 20-6 at halftime with tries from Paul Steinmetz and Bryn Cunningham, along with conversions and penalties from Adam Larkin.", "Borders fought back in the second half, with Jonny Weston scoring a late try, but they fell short of completing the comeback.", "Despite a shaky start, Ulster coach Mark McCall praised his team's performance, particularly in the second quarter, which he described as some of their best rugby of the season.", "The win lifted Ulster to eighth place in the table."], "stablelm2:1.6b": ["Ulster secured a crucial Celtic League win against bottom club Borders at Netherdale with a late try from substitute Jonny Weston.", "Despite leading 6-0 after the first half, Irish province failed to score in the second half and finished strong as they climbed to eighth place in the table.", "For Borders, Charlie Hore scored a sixth-minute penalty before their fortunes took another hit when Andy Ward earned two yellow cards for committing tackles on the ground and then full-back Cunningham bagged his team's second try after some impressive teamwork by skipper Andy Ward.", "Ulster's Adam Larkin successfully added four points from the boot, with Ally Warnock adding three more.", "The game's tension reached its peak when Larkin kicked two additional penalties just before halftime, resulting in a misconduct for Kelly Brown.", "A penalty was attempted immediately after the restart but failed to get off the ground.", "This marked the start of an exciting finale that showcased Ulster's best rugby performance this season."], "granite3.1-dense:2b": ["Ulster secured a crucial 27-18 victory over bottom-placed Borders in the Celtic League at Netherdale on Friday night.", "Despite Borders' late try by Jonny Weston, Ulster maintained their lead, thanks to tries from Paul Steinmetz and Bryn Cunningham in the first half.", "Borders briefly took the upper hand with Charlie Hore's sixth-minute penalty, but Ulster capitalized on a turnover when Steinmetz scored a try, converted by Adam Larkin.", "Ally Warnock added three more points for Borders, but Ulster extended their lead with tries from Cunningham and Mark Blair, both following excellent plays.", "Kelly Brown was sin-binned during this period.", "Borders responded with two penalties by Warnock before halftime, but Ulster's defense held firm.", "In the second half, Warnock scored again for Borders, and Ulster's Larkin kicked two more penalties that led to Brown's sin-binning.", "Borders' Kelly attempted a comeback with a penalty just after the break, but it was not enough.", "Ulster coach Mark McCall expressed satisfaction with his team's improved second-half performance and emphasized Borders' resilience despite their poor record.", "The match saw teams featuring players like Paul Morton, Bryn Cunningham, Kelly Brown, and Adam Larkin for both sides."]}