{"raw_text": "D'Arcy injury adds to Ireland woe\n \n Gordon D'Arcy has been ruled out of the Ireland team for Saturday's Six Nations clash against Scotland in Murrayfield.\n \n Like skipper Brian O'Driscoll, D'Arcy failed to recover from a hamstring injury. The side will now be led by Munster lock Paul O'Connell. Shane Horgan switches from wing to centre where he will be joined by Ulster's Kevin Maggs. Girvan Dempsey comes into the team to take the right wing spot while Gavin Duffy is called up to the replacements. ''We gave Gordon a chance but it didn't work out,'' said Ireland coach Eddie O'Sullivan. ''In terms of the risk element, it was a sensible precaution. He should be fine for the next game but we do not want to tempt fate.''\n \n Maggs, who will win his 67th cap, was the obvious replacement at centre while Shane Horgan was always likely to be moved from the wing. The only other change to the Ireland side from last weekend's win in Rome sees Wasps flanker Johnny O'Connor replacing Denis Leamy. O'Connor will be winning his third cap after making his debut in the victory over South Africa last November.\n \n : Murphy, Dempsey, Horgan, Maggs, Hickie, O'Gara, Stringer, Corrigan, Byrne, Hayes, O'Kelly, O'Connell, capt, S Easterby, O'Connor, Foley.\n \n : Sheahan, Horan, O'Callaghan, Miller, G Easterby, Humphreys, Duffy.\n", "llama3.2:1b": ["Gordon D'Arcy ruled out of Ireland's Six Nations clash against Scotland due to a hamstring injury, with Munster lock Paul O'Connell leading the side."], "llama3.2:3b": ["Gordon D'Arcy has been ruled out of Ireland's Six Nations game against Scotland due to a hamstring injury.", "Munster lock Paul O'Connell will lead the team, with Shane Horgan moving from wing to centre and Kevin Maggs replacing him at centre.", "Johnny O'Connor replaces Denis Leamy in midfield."], "gemma2:2b": ["Gordon D'Arcy will not play in the Ireland vs Scotland game due to a hamstring injury.", "Paul O'Connell will captain the team.", "Shane Horgan moves from wing to centre, Kevin Maggs replaces him, and Johnny O'Connor comes on for Denis Leamy at flanker."], "qwen2.5:0.5b": ["Ireland's Six Nations team has been ruled out of the match against Scotland, with Gordon D'Arcy suffering a hamstring injury.", "The side will now be led by Paul O'Connell and will include Munster lock Paul O'Connell as the captain.", "Shane Horgan is being released from his position on wing and will play centre.", "Kevin Maggs replaces Johnny O'Connor for Wasps flanker Denis Leamy, who previously won his third cap."], "qwen2.5:1.5b": ["Gordon D'Arcy ruled out of Ireland's Six Nations match against Scotland due to a hamstring injury; Paul O'Connell leads the team now; changes include replacing Girvan Dempsey with Gavin Duffy in right wing and bringing Kevin Maggs into centre for Shane Horgan.", "Gordon was previously sidelined from recovery."], "qwen2.5:3b": ["D'Arcy injury rules Ireland out of Scotland match.", "O'Connell takes over as captain.", "Horgan moves to centre and Maggs to wing.", "Dempsey shifts from fullback to wing.", "D'Arcy's missed due to hamstring issue.", "Shane Horgan makes his debut at centre.", "Kevin Maggs earns 67th cap.", "Johnny O'Connor replaces Denis Leamy at flanker.", "Ireland lineup changes compared to Rome win."], "opencoder:1.5b": ["D'Arcy injury adds to Ireland woe.", "Gordon D'Arcy has been ruled out of the Ireland team for Saturday's Six Nations clash against Scotland in Murrayfield.", "Like skipper Brian O'Driscoll, D'Arcy failed to recover from a hamstring injury.", "The side will now be led by Munster lock Paul O'Connell.", "Shane Horgan switches from wing to centre where he will be joined by Ulster's Kevin Maggs.", "Girvan Dempsey comes into the team to take the right wing spot while Gavin Duffy is called up to the replacements.", "\"We gave Gordon a chance but it didn't work out,\" said Ireland coach Eddie O'Sullivan.", "\"In terms of the risk element, it was a sensible precaution.", "He should be fine for the next game but we do not want to tempt fate.\"", "The only other change to the Ireland side from last weekend's win in Rome sees Wasps flanker Johnny O'Connor replacing Denis Leamy.", "O'Connor will be winning his third cap after making his debut in the victory over South Africa last November.", ": Murphy, Dempsey, Horgan, Maggs, Hickie, O'Gara, Stringer, Corrigan, Byrne, Hayes, O'Kelly, O'Connell, capt, S Easterby, O'Connor, Foley.", ": Sheahan, Horan, O'Callaghan, Miller, G Easterby, Humphreys, Duffy."], "smollm:1.7b": [], "deepseek-r1:1.5b": ["D'Arcy injury adds to Ireland woe  \nGordon D'Arcy was ruled out of the team lineup for Saturday's Six Nations clash, as he was found to have a hamstring injury.", "The team now leads with Paul O'Connell instead of Brian O'Driscoll.", "Shane Horgan moves from wing to center and will be joined by Kevin Maggs at center.", "Girvan Dempsey takes the right wing spot, while Gavin Duffy is added for substitutions.", "We gave Gordon a chance but it didn't work out:  \nIreland coach Eddie O'Sullivan acknowledged the risk element introduced by D'Arcy's injury.", "He remains healthy for the next match but wants to ensure safety and avoid tempting fate.", "Substitution details:  \n- Maggs, who will win his 67th cap, takes center instead of Shane Horgan.", "- Horgan moves from wing to center.", "- Shane Horgan was likely on the wing but moved back to center.", "- Kevin Maggs returns to center.", "- Girvan Dempsey fills right wing.", "- Gavin Duffy is added for substitutions.", "Lineup changes:  \n- D'Arcy injury adds to Ireland's injury list.", "- Maggs and Horgan are substituted out.", "- Shane Horgan moves back from wing to center.", "- Kevin Maggs returns to center.", "- The team receives substitution players: Paul O'Connell, Shane Horgan, Kevin Maggs, Girvan Dempsey, Gavin Duffy, Johnny O'Connor, and others listed below."], "tinyllama:1.1b": ["After Gordon D'Arcy underwent a hamstring injury during Ireland's game against Scotland in Murrayfield, Eddie O'Sullivan has selected Paul O'Conneill as the skipper for the upcoming match against Scotland.", "Shane Horan and Kevin Maggs will replace injured Ulster lock Paul O'Connor and Denis Leamy respectively.", "The only change from last week's win is that Wasps flanker Johnny O'Connor replaces South African international Jan Hattingh as a substitute in the match."], "tinydolphin:1.1b": [" Ireland will now have to manage without their leading scorer and captain in the upcoming Six Nations clash against Scotland in Murrayfield on Saturday.", "In a surprising development, forward Gordon D'Arcy has been ruled out of the team due to a hamstring injury, with his place taken by Munster lock Paul O'Connell.", "The change will be significant for Ireland, who had already made significant changes to their lineup with the addition of Shane Horgan from Ulster and the removal of Gavin Duffy from the starting lineup.", "This will also have an impact on the match strategy and could result in strategic adjustments to suit the opposing team's matchup."], "phi:2.7b": [" D'Arcy has been ruled out of the Ireland team for Saturday's Six Nations clash against Scotland in Murrayfield due to a hamstring injury.", "The side will be led by Munster lock Paul O'Connell, with Shane Horgan switching from wing to centre and joining Ulster'S Kevin Maggs at right-wing.", "Gavin Duffy is also called up for replacements.", "Ireland coach Eddie O'Sullivan said they gave Gordon a chance but it didn't work out as it was a sensible precaution.", "He should be fine for the next game, but they do not want to take any chances.", "Maggs will play at centre and Horgan has always been expected to move from wing.", "Denis Leamy is replaced by Wasps flanker Johnny O'Connor who won his third cap in last week's win against South Africa."], "orca-mini:3b": [" Ireland's loss of D'Arcy for the Scotland game adds to their woes.", "Brian O'Driscoll and now D'Arcy are out of the team, leaving Paul O'Connell as captain.", "Shane Horgan switches from wing to center, where he is joined by Kevin Maggs.", "Girvan Dempsey comes into the team to take the right wing spot while Gavin Duffy is called up to replace O'Driscoll and Horgan.", "Gordon D'Arcy was ruled out of the Scotland game with a hamstring injury, but should be fine for the next game.", "The only other change to the Ireland side from last weekend's win in Rome sees Wasps flanker Johnny O'Connor replacing Denis Leamy.", ": O'Connor will be winning his third cap after making his debut in the victory over South Africa last November."], "hermes3:3b": ["Ireland rugby team changes:\n* Gordon D'Arcy and Brian O'Driscoll both out due to hamstring injuries\n* Shane Horgan switches from wing to centre\n* Kevin Maggs comes into the team to replace at centre\n* Johnny O'Connor replaces Denis Leamy in the flanker position"], "stablelm-zephyr:3b": ["Gordon D'Arcy is ruled out of Ireland's Six Nations clash against Scotland due to a hamstring injury, joining captain Brian O'Driscoll on the sidelines.", "Paul O'Connell takes over as leader, and Shane Horgan switches from wing to center with Kevin Maggs joining him.", "Girvan Dempsey replaces one position, while Gavin Duffy joins the replacements.", "Eddie O'Sullivan cites risk management as the reason for selecting a slightly different lineup compared to their previous win in Rome."], "chatgpt-4o-latest": ["Gordon D'Arcy has been ruled out of Ireland's Six Nations match against Scotland due to a hamstring injury, joining captain Brian O'Driscoll on the sidelines.", "Munster's Paul O'Connell will lead the team.", "Shane Horgan moves from wing to centre alongside Kevin Maggs, while Girvan Dempsey takes Horgan's wing position.", "Gavin Duffy is added to the replacements.", "Coach Eddie O'Sullivan stated they took a precautionary approach with D'Arcy, expecting him to be fit for the next game.", "The only other change from the previous match sees Johnny O'Connor replacing Denis Leamy at flanker."], "stablelm2:1.6b": ["Gordon D'Arcy injury prevents him from participating in the Ireland vs Scotland game due to a hamstring issue.", "The team will be led by Paul O'Connell, with Shane Horgan and Kevin Maggs making switches.", "Johnny O'Connor replaces Denis Leamy for this match.", "Coach Eddie O'Sullivan decided against risking fate, ensuring D'Arcy's well-being for future games.", "The changes maintain the winning formation from the Rome victory."], "granite3.1-dense:2b": ["Gordon D'Arcy is sidelined due to a hamstring injury for Ireland's Six Nations match against Scotland at Murrayfield on Saturday.", "The team will be captained by Paul O'Connell and feature Shane Horgan as centre, with Kevin Maggs joining him.", "Gavan Dempsey takes over from the right wing, and Gavin Duffy is named among the replacements.", "Ireland coach Eddie O'Sullivan deemed this precautionary, aiming to prevent further harm.", "The only other alteration is Johnny O'Connor replacing Denis Leamy at flanker, marking his third cap after debuting in the win over South Africa.", "The final lineup remains largely unchanged from Ireland's victory in Rome last weekend: Murphy, Dempsey, Horgan, Maggs, Hickie, O'Gara, Stringer, Corrigan, Byrne, Hayes, O'Kelly, O'Connell (capt), S Easterby, and Foley."]}