{"raw_text": "Roddick into San Jose final\n \n Andy Roddick will play Cyril Saulnier in the final of the SAP Open in San Jose on Sunday.\n \n The American top seed and defending champion overcame Germany's Tommy Haas, the third seed, 7-6 (7-3) 6-3. And Saulnier survived an injury scare in his semi-final with seventh-seeded Austrian Jurgen Melzer. The Frenchman twisted his ankle early in the second set but overcame Melzer, who was left fuming over a series of line calls, 6-7 (3-7) 6-3 6-3. \"I was feeling horrible earlier in the week,\" Roddick said. \"I thought tonight was another step in the right direction. \"On my returns, I was standing in more and I'm getting a little more depth, even if I don't hit a perfect return.\"\n \n Roddick won the last four points of the first-set tie-break before being broken at the start of the second set. But he broke straight back and then broke Haas again to lead 4-2. \"It's extremely frustrating when you have chances against a top-five player and don't do anything with them,\" admitted Haas. \"I rushed a few backhands and he took advantage.\" Saulnier will move into the world's top 50 for the first time after his passage through to the final. \"It's taken a lot of work and a lot of fighting in my mind,\" he revealed. \"Sometimes I didn't believe I could get to a final and now I am here. I've stayed mentally strong. \"I'm on the way. I'll keep fighting and work a lot and I'll be up there.\"\n", "llama3.2:1b": ["Andy Roddick played Cyril Saulnier in the SAP Open final in San Jose, defeating Tommy Haas 7-6 (7-3) 6-3 after Haas suffered an injury scare in his semi-final match.", "Roddick broke Haas twice to lead 4-2 in the second set, but was broken again at the start of it.", "He then broke Saulnier to take the first set tie-break and win the final 7-5."], "llama3.2:3b": ["Andy Roddick defeated Tommy Haas 7-6 (7-3) 6-3 in the SAP Open final, while Cyril Saulnier overcame an injury scare to beat Jurgen Melzer 6-7 (3-7) 6-3 6-3."], "gemma2:2b": ["Andy Roddick defeated Tommy Haas in the semi-finals of the SAP Open in San Jose to advance to the final, where he will face Cyril Saulnier.", "Saulnier overcame an injury scare and won his semi-final against Jurgen Melzer.", "Roddick's return game improved, leading him to victory after a tie-breaker in the first set.", "Saulnier will enter the top 50 of the ATP rankings for the first time."], "qwen2.5:0.5b": ["In the SAP Open event in San Jose, Andy Roddick played against Cyril Saulnier.", "Roddick won set 6-4 with 7-6 (7-3) while Saulnier played in a semi-final.", "Both players were injured early in the match.", "Roddick's return was better than his first serve, and he broke Haas again to lead 5-2.", "He then lost set 4 in a tie-break.", "Saulnier was stronger and won in the second round.", "His final ranking is 501."], "qwen2.5:1.5b": ["Andy Roddick advances to the SAP Open quarterfinals against Cyril Saulnier, who overcame injury in his semi-final victory over Jurgen Melzer.", "Roddick beats top-seeded Haas 7-6 (3) 6-3 before Saulnier wins a match-ending comeback over fourth seed Melzer, moving into the world's top 50 with a win at the San Jose tournament."], "qwen2.5:3b": ["Andy Roddick will play Cyril Saulnier in the final of the SAP Open in San Jose on Sunday.", "Roddick, an American top seed and defending champion, defeated Tommy Haas, third seed from Germany, 7-6 (7-3) 6-3.", "Saulnier, after overcoming Jurgen Melzer in a tough semi-final with an ankle injury scare, will play his first final due to advancing.", "Roddick credited better returns for his success against Haas.", "Saulnier expressed determination and mental strength as he prepares for the final."], "opencoder:1.5b": ["Summarizing this text, we can summarize it as follows:\n\nThe American top seed and defending champion overcame Germany's Tommy Haas in a 7-6 match.", "He survived an injury scare in the semi-final with Austrian player Jurgen Melzer who was left fuming over a series of line calls.", "The Frenchman played Saulnier at the SAP Open, which he won last four points of before being broken at the start of the second set.", "He has also managed to lead 4-2 after his arrival and defeat Haas in the final."], "smollm:1.7b": ["Roddick will play Cyril Saulnier in the final of SAP Open in San Jose on Sunday, defeating Germany's Tommy Haas 7-6 (7-3) 6-3.", "The American top seed and defending champion overcame Germany's Tommy Haas, the third seed, 7-6 (7-3) 6-3.", "And Saulnier survived an injury scare in his semi-final with seventh-seeded Austrian Jurgen Melzer.", "The Frenchman twisted his ankle early in the second set but overcame Melzer, who was left fuming over a series of line calls, 6-7 (3-7) 6-3.", "\"I was feeling horrible earlier in the week,\" Roddick said.", "\"I thought tonight was another step in the right direction.\"", "On his returns, he was standing in more and was getting a little more depth, even if he doesn't hit a perfect return.", "\"It's extremely frustrating when you have chances against a top-five player and don't do anything with them,\" admitted Haas.", "\"I rushed a few backhands and he took advantage.\"", "Saulnier will move into the world's top 50 for the first time after his passage through to the final.", "\"It's taken a lot of work and a lot of fighting in my mind,\" said Saulnier.", "\"Sometimes I didn't believe I could get to a final and now I am here.", "I've stayed mentally strong.\"", "Saulnier will keep fighting and he'll be up there eventually.", "He'll stay focused on his game and he'll work hard to overcome any obstacles that come his way."], "deepseek-r1:1.5b": ["Roddick into Saulnier.", "Andy Roddick will face Cyril Saulnier in the SAP Open final on Sunday against Tommy Haas.", "Roddick won their tie-break 4-2 but fell to Haas with his backhands, which gave him an advantage.", "Saulnier advanced to the finals for his first time and is focused on improving mentally."], "tinyllama:1.1b": ["Roddick into San Jose final, American top seed and defending champion overcomes German Tommy Haas with injury-scarred ankle, defeating seventh-seed Austrian Jurgen Melzer in the semi-finals.", "Feeling horrible earlier in the week and getting injured on his returns, Roddick won the last four points of the first set tiebreak before breaking straight back to lead 4-2 in the second set.", "\"I'm extremely frustrated when I have chaos against a top-five player and don't do anything with them,\" admitted Haas after the match.", "Haas will move into the world's top 50 for the first time, while Saulnier upset Germany's Tommy Haas in the semi-finals to reach the final of the SAP Open in San Jose."], "tinydolphin:1.1b": [" Roddick into San Jose final, Andy won against Tommy Haas in SAP Open.", "The American top seed defended his title with a hard-fought victory over Germany's Tommy Haas.", "Despite getting injured during his semi-final match, Saulnier managed to overcame Austria's Jurgen Melzer and reached the final of the tournament."], "phi:2.7b": [" Andy Roddick will play Cyril Saulnier in the final of SAP Open, where he overcame Tommy Haas to reach the final.", "He beat Melzer in his semi-final despite twisting his ankle earlier in the week.", "The American top seed is moving up to the world's top 50 for the first time after a tough journey."], "orca-mini:3b": [" Andy Roddick will face Cyril Saulnier in the final of the SAP Open in San Jose.", "Roddick advanced to the final by defeating Tommy Haas, the third seed, and Saulnier survived an injury scare in his semi-final with Jurgen Melzer.", "The Frenchman twisted his ankle early in the second set but continued to play."], "hermes3:3b": ["Andy Roddick vs Cyril Saulnier (San Jose final)\nRoddick beats Haas 7-6, 6-3\nSaulnier over Melzer despite ankle injury in semi-final"], "stablelm-zephyr:3b": ["Andy Roddick will play Cyril Saulnier in the San Jose SAP Open final, after defeating Germany's Tommy Haas 7-6 (7-3) 6-3 in the semifinals.", "Saulnier survived an injury scare against seventh-seeded Jurgen Melzer, winning 6-7 (3-7) 6-3 6-3.", "Roddick praised his improvement in returning serves and mentioned that he was feeling better after overcoming frustration during his match against Haas.", "Saulnier will make his debut in the top 50 rankings."], "chatgpt-4o-latest": ["Andy Roddick advanced to the final of the SAP Open in San Jose, defeating Germany's Tommy Haas 7-6 (7-3) 6-3.", "Roddick, the top seed and defending champion, showed improvement in his returns and overcame an early break in the second set.", "His opponent in the final, Cyril Saulnier, defeated Jurgen Melzer 6-7 (3-7) 6-3 6-3 despite twisting his ankle.", "Melzer was frustrated by line calls.", "Saulnier, reaching his first final, will enter the world's top 50 and credited his mental strength for his progress."], "stablelm2:1.6b": ["Andy Roddick advances to the final of the SAP Open in San Jose against Cyril Saulnier, defeating Tommy Haas with scores of 7-6, 7-3, 6-3.", "Roddick improves his performance after a challenging week and will compete for the title.", "Saulnier triumphs over Austrian Jurgen Melzer despite twisting his ankle during the semi-final match."], "granite3.1-dense:2b": ["Andy Roddick, the top-seeded American and defending champion at the SAP Open in San Jose, advanced to face Cyril Saulnier in the final.", "Roddick defeated third-seeded Tommy Haas 7-6 (7-3), 6-3.", "In his semi-final, Saulnier faced seventh-seeded Austrian Jurgen Melzer, who had a heated exchange over line calls.", "Despite twisting his ankle early in the second set, Saulnier won 6-7 (3-7), 6-3, 6-3.", "Roddick noted progress in his returns and serving depth.", "Haas expressed frustration about missed opportunities against a top-five player.", "Saulnier, who will enter the world's top 50 for the first time, attributed his success to mental resilience and hard work.", "He remains determined to maintain his position."]}