{"raw_text": "Hewitt falls to Dent\n \n Lleyton Hewitt suffered a shock defeat to Taylor Dent in the quarter-finals of the Australian Hardcourt Championships in Adelaide on Friday.\n \n The top seed was a strong favourite for the title but went down 7-6 (7-4) 6-3 to the American. Dent will face Juan Ignacio Chela next after the fourth seed was too strong for Jurgen Melzer. Olivier Rochus beat third seed Nicolas Kiefer 6-7 (4-7) 7-6 (8-6) 7-5 and will take on second seed Joachim Johansson. The Swede reached the last four by beating compatriot Thomas Enqvist 6-3 4-6 6-1. \"I felt like I was striking the ball much better,\" said Johansson. \"I felt like I had a lot of break chances, I didn't take care of them all, but I broke him four times and he only broke me once. \"I felt that was the key to get up in the set early.\"\n", "llama3.2:1b": ["Lleyton Hewitt lost to Taylor Dent in the quarter-finals at the Australian Hardcourt Championships.", "The top seed went down 7-6 (7-4) 6-3 to Dent, despite being a strong favourite for the title.", "Dent will face Juan Ignacio Chela next after beating third seed Jurgen Melzer and Olivier Rochus beat Nicolas Kiefer, reaching the last four by defeating compatriot Thomas Enqvist."], "llama3.2:3b": ["Lleyton Hewitt lost to Taylor Dent 7-6 (4-7) 6-3 in quarter-finals of Australian Hardcourt Championships.", "Dent faces Juan Ignacio Chela, while Olivier Rochus beat Nicolas Kiefer and will face Joachim Johansson."], "gemma2:2b": ["Lleyton Hewitt lost to Taylor Dent in the Australian Hardcourt Championships quarter-finals.", "Dent will face Juan Ignacio Chela in the semi-finals, while Olivier Rochus advanced past Nicolas Kiefer and will face Joachim Johansson next."], "qwen2.5:0.5b": ["Lleyton Hewitt lost to Taylor Dent in the quarter-finals of the Australian Hardcourt Championships in Adelaide on Friday.", "Dent is expected to face Juan Ignacio Chela after the fourth seed was too strong for Jurgen Melzer.", "Oliver Rochus beat Nicolas Kiefer and will face second seed Joachim Johansson, while Thomas Enqvist beat him 6-3 4-6 6-1.", "Johansson felt he had a lot of break chances but broke the opponent twice early in the match."], "qwen2.5:1.5b": ["Lleyton Hewitt lost to Taylor Dent in the Australian Open quarterfinals, 7-6, 6-3, while Dent faces Juan Ignacio Chela next.", "Olivier Rochus advances to the semifinals by defeating Nicolas Kiefer; Thomas Enqvist reaches the semis with a win over Joachim Johansson."], "qwen2.5:3b": ["Lleyton Hewitt lost to American Taylor Dent in quarter-finals of Australian Hardcourt Championships.", "Top seed Hewitt won 7-6 (7-4), 6-3 despite earlier strong performance.", "Next opponent is Juan Ignacio Chela.", "Joachim Johansson reaches semifinals after defeating Thomas Enqvist, claiming victory with four breaks against one.", "Johansson attributes his win to better shot-striking and more successful break opportunities."], "opencoder:1.5b": ["Hewitt falls to Lleyton\n\nLleyton (5-3) 4-6 (4-8) 7-6 (7-5) 6-1 (10-0) 6-2 (9-1) 7-4 (8-4) 4-7 (7-8) 6-3 (7-6) 7-5 (8-5) 7-6 (9-4) 6-5 (10-5) 7-4 (8-6) 7-5 (8-7) 6-3 (7-8) 7-6 (8-6) 7-5 (8-7) 6-2 (9-2) 6-1 (10-1) 6-0 (11-0).", "\"I felt like I was striking the ball much better,\" said Chela.", "\"I felt like I had a lot of break chances, I didn't take care of them all, but I broke him four times and he only broke me once.\"", "The Australian Hardcourt Championships in Adelaide on Friday.", "The top seed was a strong favourite for the title but went down 7-6 (7-4) 6-3 to the American.", "The Swede reached the last four by beating compatriot Thomas Enqvist 6-3 4-6 6-1.", "The Australian Hardcourt Championships were won by Lleyton Hewitt in the quarter-finals."], "smollm:1.7b": ["Hewitt fell to Dent in the quarter-finals of the Australian Hardcourt Championships in Adelaide on Friday.", "Lleyton Hewitt suffered a shock defeat to Juan Ignacio Chela next after the fourth seed was too strong for Jurgen Melzer.", "Olivier Rochus beat third seed Nicolas Kiefer 6-7 (4-7) 7-6 (8-6) and will take on second seed Joachim Johansson.", "The Swede reached the last four by beating compatriot Thomas Enqvist 6-3 4-6 6-1.", "\"I felt like I was striking the ball much better,\" said Olivier Rochus, who beat Chela in the second round of the semifinals.", "\"I didn't take care of all my chances, but I broke him four times and he only broke me once.", "I felt that was the key to get up in the set early.\""], "deepseek-r1:1.5b": ["Lleyton Hewitt fell short of Taylor Dent in the quarter-finals of the Australian Hardcourt Championships on Friday, losing 7-6 (7-4) 6-3 to the American.", "Dent will face Juan Ignacio Chela next after Kiefer was too strong for Melzer.", "Nicolas Kiefer beat second seed Joachim Johansson 6-7 (4-7) 7-6 (8-6) 7-5, and Olivier Rochus beat third seed Nicolas Kiefer in a close game.", "Johansson reached the last four by beating Thomas Enqvist 6-3 4-6 6-1."], "tinyllama:1.1b": ["Hewiitt falls to DenT"], "tinydolphin:1.1b": [" Australian Hardcourt Championships - Adelaide: Hewitt falls to Dent; Lleyton Hewitt suffered a shock defeat to Taylor Dent, losing 7-6 (7-4) 6-3 to American player Taylor Dent."], "phi:2.7b": [" Lleyton Hewitt lost to Taylor Dent 7-6(7-4) 6-3 in the quarter-finals of the Australian Hardcourt Championships, falling from being the top seed as a strong favourite for the title.", "Dent will play Juan Ignacio Chela next after defeating Jurgen Melzer and Olivier Rochus beat Nicolas Kiefer to reach the last four.", "Second seed Joachim Johansson won against Thomas Enqvist 6-3, 4-6, 6-1 and will face his opponent."], "orca-mini:3b": [" Lleyton Hewitt lost to Taylor Dent in the Australian Hardcourt Championships in Adelaide while being the top seed.", "He will face Juan Ignacio Chela next after Jurgen Melzer was defeated by Nicolas Kiefer.", "Olivier Rochus beat Thomas Enqvist and will take on Joachim Johansson for a spot in the final."], "hermes3:3b": ["LleytonHewitt lost to TaylorDentinquarter-finalsofAustralianHardcourtChampionships."], "stablelm-zephyr:3b": ["Lleyton Hewitt suffered a quarter-finals defeat by Taylor Dent at the Australian Hardcourt Championships in Adelaide.", "Top seed Hewitt lost 7-6 (7-4) 6-3 to the American player.", "Dent advances to face Juan Ignacio Chela, while Olivier Rochus takes on Joachim Johansson in subsequent matches."], "chatgpt-4o-latest": ["Lleyton Hewitt suffered a surprise defeat to Taylor Dent in the quarter-finals of the Australian Hardcourt Championships, losing 7-6 (7-4) 6-3.", "Dent will face Juan Ignacio Chela, who defeated Jurgen Melzer.", "Olivier Rochus overcame Nicolas Kiefer in a tight match and will play Joachim Johansson, who beat Thomas Enqvist.", "Johansson noted his improved performance and key break points as crucial to his victory."], "stablelm2:1.6b": ["Lleyton Hewitt lost to Taylor Dent in the Australian Hardcourt Championships quarter-finals in Adelaide.", "Hewitt fell 7-6, 7-4, 6-3 to Dent.", "Dent will face Juan Ignacio Chela next after American defeated Jurgen Melzer.", "Other matches saw Olivier Rochus beat Nicolas Kiefer and Thomas Enqvist beat a Swedish player.", "Hewitt expressed satisfaction with early breaks in the match against Chela."], "granite3.1-dense:2b": ["Lleyton Hewitt, the top seed, lost to Taylor Dent 7-6 (7-4), 6-3 in the quarter-finals of the Australian Hardcourt Championships in Adelaide.", "Hewitt, a favored contender for the title, faced an unexpected defeat.", "Dent will now play Juan Ignacio Chela, who defeated Jurgen Melzer.", "Meanwhile, Olivier Rochus advanced by outlasting Nicolas Kiefer in a five-set match (6-7, 7-6, 7-5), and he will face second seed Joachim Johansson.", "Johansson praised his better ball striking and four break points conversion as crucial to winning the set early against Thomas Enqvist in a three-set match (6-3, 4-6, 6-1)."]}