{"raw_text": "Serena ends Sania Mirza's dream\n \n Sania Mirza, the first Indian woman to reach the third round of a Grand Slam tennis event, has lost to women's favourite Serena Williams.\n \n The 18-year-old Mirza, who got a wild card entry into the Australian Open in Melbourne, lost to Williams 1-6,4-6 in the third round. Williams took just 56 minutes to defeat Mirza and sail into the fourth round. The only other Indian woman to win a match at a Grand Slam is Nirupama Vaidyanathan. Vaidyanathan made it to the second round of the Australian Open in 1998.\n \n Playing the biggest match of her life, Mirza made little impact on Williams in the early stages of the game. But the teenager showed more confidence in the second set and engaged the seventh-seeded Williams in some well contested rallies. Mirza, a junior Wimbledon doubles title winner, became the first Indian woman to reach the third round of a grand slam tennis event when she beat Hungarian Petra Mandula on Wednesday. \"I'm really excited. I was confident but I didn't think it was going to be that easy,\" Mirza said after her second round win. \"My aim was to win a round here. When I did that I was so relieved, there was no pressure.\" Tennis is not a particularly popular sport in India, but a number of Indians watched the live telecast of the match between Mirza and Williams. Mirza, who lives in the southern Indian city of Hyderabad known for producing a host of top Indian cricketers, turned professional two years ago. She says she was considered too small when she went for her first tennis classes as a six-year-old girl. \"Then finally [the coach] called my parents up and said 'the way she hits the ball, I've never seen a six-year-old hit a ball like that',\" Mirza told the Associated Press.\n", "llama3.2:1b": ["Sania Mirza lost to Serena Williams in the third round of the Australian Open.", "Mirza, 18, became the first Indian woman to reach the third round at a Grand Slam tennis event.", "She played well in the early stages but struggled against Williams.", "Mirza won the second set and expressed relief after beating Mandula earlier in her career."], "llama3.2:3b": ["Sania Mirza lost to Serena Williams in the third round of the Australian Open, ending her dream of becoming the first Indian woman to reach a Grand Slam singles quarterfinals.", "The 18-year-old Mirza had previously reached just the second round in 1998 and made it to the third round after beating Petra Mandula on Wednesday."], "gemma2:2b": ["Serena Williams defeated Sania Mirza in the Australian Open third round.", "Mirza is the first Indian woman to reach the third round of a Grand Slam.", "She lost after playing well in the second set, but her performance was not enough to overcome Williams's strong play."], "qwen2.5:0.5b": ["Sania Mirza lost to Serena Williams in the third round of the Australian Open.", "Mirza is the first Indian woman to reach the third round of a Grand Slam tennis event and made only a minor impact at her early stage in the match."], "qwen2.5:1.5b": ["Indian junior Serena Williams defeats Indian teenager in second round of Australian Open, ending her dream of winning a Grand Slam match."], "qwen2.5:3b": ["Sania Mirza, India's only women to reach third round of Grand Slam tournament, lost 1-6,4-6 against Serena Williams in the third round at Australian Open.", "Mirza, an 18-year-old wild card entry, showed some confidence in second set but was outplayed by seventh-seeded Williams who won in just 56 minutes.", "Vaidyanathan was India's only other women to reach Grand Slam second round in 1998.", "Mirza, a junior Wimbledon doubles winner and now professional tennis player, turned professional two years ago despite being considered small when she started playing at six.", "She credited her coach for recognizing her talent early on."], "opencoder:1.5b": ["The 18-year-old Indian woman ended her dream with the first Grand Slam tennis event as her match, losing to a professional Indian player."], "smollm:1.7b": ["Serena ends Sania Mirza's dream"], "deepseek-r1:1.5b": ["Serena Mirza, the first Indian woman to reach the third round of a Grand Slam tennis event, has lost to women's favorite Serena Williams.", "Serena, an 18-year-old, made only a quick win in her loss against Williams at Melbourne's Australian Open.", "Another Indian woman, Vaidyanathan, reached the second round of that same event.", "Mirza, a junior Wimbledon doubles winner and the first Indian woman to reach the third round, became the first Indian woman to do so.", "She defeated Hungarian Petra Mandula in a well contested set.", "The sport is not popular in India but live telecasts are watched by many.", "Mirza, from Hyderabad, was surprised and happy after winning, feeling confident but not expecting the easy victory.", "She says she was too young for a six-year-old class."], "tinyllama:1.1b": ["Serena Williams, the reigning Australian Open champion, has beaten Sania Mirza in the third round of the Australian Open to set up a fourth-round clash against top seed Naomi Osaka.", "The Indian tennis star, who was born and raised in Hyderabad but moved to Australia at a young age, had lost her previous two Grand Slam matches to Williams.", "Despite playing some well-contested raills, Mirza failed to make an impact on the seven-time Australian Open champion's serve and received little support from the crowd.", "Nonetheless, Mirza managed to pull off a notable win against Williams and become the first Indian woman to reach the third round of a Grand Slam tennis event since Nirupama Vaidyanathan did so in 1998.", "Many Indians watched the match live on television, with tennis being less popular than cricket in India."], "tinydolphin:1.1b": [" Serena Williams of the United States defeated her long-time rival and fellow American player, Venus Williams, to secure her place in the third round of the Australian Open tennis event in Melbourne.", "The match was played on Friday afternoon with the 18-year-old Mirza from India also making a mark on the scene, coming up against the seven-time Wimbledon doubles champion, Williams.", "It was clear that Serena Williams, a five-time Olympic gold medalist and World No.", "1 in singles and women's doubles, was well accustomed to the pressure of a big match against a young and talented player.", "In their early stages of the game, both Mirza and Williams showed signs of an exciting rivalry that could have been the stuff of legendary clashes.", "However, as the match progressed, Serena Williams emerged victorious by winning all 10 sets in the match, including the crucial second set which Mirza eventually won in a closely contested battle.", "Mirza was impressed with her opponent's ability to defend against pressure and continue to play at a high level after being outshined during the early stages of the match.", "In response, Serena Williams expressed her admiration for Mirza's skill and dedication to tennis.", "She acknowledged that she had been unable to break Mirza's serve in the early parts of the match but felt confident in her own abilities to defeat the young Indian woman.", "The loss marks a significant setback for Serena Williams, who had already reached the fourth round of the Australian Open before this latest defeat.", "Her coach, Patrick Mouratagel, has been working hard to turn around his team's fortunes, and he expressed optimism that they could regroup and improve their performance in the future.", "Serena Williams has been known to be a tough opponent to face but Mirza will certainly hold no grudge against her if she decides to retire from tennis after her defeat by Williams.", "In conclusion, this match between Serena Williams and her teenage Indian rival Mirza saw both players play with great passion and determination in an intense and closely contested battle that was ultimately won by the seven-time Wimbledon doubles champion, Serena Williams."], "phi:2.7b": [" Sania Mirza, the first Indian woman to reach the third round of a Grand Slam tennis event, lost to Serena Williams in Melbourne's Australian Open.", "Although she made some impact on Williams in the early stages of the match, she lacked confidence and engagement in some well-contested rallies.", "Tennis is not a popular sport in India, but Mirza was able to win a round at Wimbledon when she beat Hungarian Petra Mandula.", "Mirza turned professional two years ago and began playing tennis after being considered too small by her coach."], "orca-mini:3b": [" Serena Williams defeated Sania Mirza in the third round of the Australian Open by taking just 56 minutes to win the match.", "Mirza, who made it to the third round of a Grand Slam for the first time, lost to Williams due to lack of confidence and experience in the second set."], "hermes3:3b": ["Sania Mirza (1st Indian woman to 3rd round of Grand Slam) lost to Serena Williams in third round of Australian Open."], "stablelm-zephyr:3b": ["Sania Mirza, the first Indian woman to reach the third round of a Grand Slam tennis event, lost to Serena Williams in the Australian Open.", "Mirza, a junior Wimbledon doubles champion, became the first Indian woman to compete in the third round of a major tennis tournament after defeating Hungarian Petra Mandula.", "Despite facing pressure and not being popular in India, several Indians watched her live telecast.", "However, she was unable to make an impact against Williams during their match, which lasted just 56 minutes with Williams securing a 1-6, 4-6 victory, advancing to the fourth round."], "chatgpt-4o-latest": ["Sania Mirza, the first Indian woman to reach the third round of a Grand Slam, lost to Serena Williams 1-6, 4-6 in the Australian Open.", "Williams took just 56 minutes to secure victory.", "Despite a slow start, Mirza showed confidence in the second set, engaging Williams in competitive rallies.", "Mirza, a junior Wimbledon doubles title winner, had earlier defeated Petra Mandula to make history.", "Tennis is not widely popular in India, but many watched the match.", "Mirza, who turned professional two years ago, was initially considered too small for tennis but impressed her coach with her natural talent."], "stablelm2:1.6b": ["Serena defeated Sania in the Australian Open third round, making her the first Indian woman to reach a Grand Slam's third round.", "Williams easily beat Mirza 1-6,4-6 in the third round.", "Mirza lost to Williams in early stages but gained more confidence during second set.", "She became the first Indian woman to reach the third round of a grand slam when she defeated Hungarian Petra Mandula.", "Tennis is not popular in India, and many Indians watched the match between Mirza and Williams, despite her small stature when she joined tennis classes as a six-year-old girl."], "granite3.1-dense:2b": ["Sania Mirza, the first Indian woman to reach the third round of a Grand Slam tennis event, lost to Serena Williams in the third round at the Australian Open 2024.", "The match ended with scores of 1-6 and 4-6, as Williams dominated Mirza within 56 minutes.", "This was Mirza's biggest professional victory, following her second-round win against Hungarian Petra Mandula earlier in the tournament.", "Mirza, an 18-year-old junior Wimbledon doubles champion from Hyderabad, overcame initial struggles and displayed increased confidence in the second set.", "Despite her loss, Mirza expressed relief and excitement about reaching the third round.", "Tennis remains a niche sport in India, but the live telecast of this match drew significant viewership.", "Mirza's journey to professional tennis began at age six, when she was deemed too small for the sport; however, her exceptional hitting skills caught coaches' attention, leading her to turn pro two years later."]}