{"raw_text": "Kuznetsova 'failed a drugs test'\n \n US Open champion Svetlana Kuznetsova has tested positive for a banned drug, according to Belgian authorities.\n \n Belgian sports minister Claude Eerdekens said that the Russian world number five tested positive for the stimulant ephedrine on 19 December. Kuznetsova was playing in an exhibition event in Charleroi at the time. Eerdekens said: \"There is a problem. Ephedrine was discovered. She remains innocent until proved guilty. She can ask for it to be tested again.\" The situation remains unclear as the tournament was not commissioned by the World Anti-Doping Agency (Wada), the International Tennis Federation (ITF) or the Women's Tennis Accosiation (WTA). The test was carried out by regional Belgian authorities and Kuznetsova has not yet been able to have a B sample tested.\n \n Speaking at the Australian Open on Monday, before Eerdekens identified her, Kuznetsova said: \"I'm not worried. I'm not using anything to push myself. \"I have not been notified of any positive test, and I think it is unfair that it's come out the way it did.\" Eerdekens said that confirmation of the findings was sent last Friday to the player's address in Spain, as well as to the Belgian prosecutors' office and the Belgian and Russian tennis federations. He conceded Kuznetsova might have taken a medicine which contained the banned substance. \"We have simply stated a fact,\" he said. \"It is for the federation concerned to impose the disciplinary measures after a procedure that respects the defence.\n \n \"Either the ephedrine was taken to improve her performance or it is because she took some medicine legitimately to cure an infection.\" However, Kuznetsova's naming was condemned by Russian tennis chief Shamil Tarpishchev. \"First of all, this Belgian sports minister has broken every ethical rule in the book by naming a player without any proof of wrongdoing, without any basic evidence,\" Tarpishchev said. \"We all know the basic principle in doping cases. If there is a positive sample, then they should notify the International Tennis Federation (ITF) as well as the national federation within three days,\" he said. \"This is not the case here. As of today we have not received any statement from the doping officials, nor did the ITF. \"Today I called the ITF headquarters and they told me they know nothing about it. \"If WADA (the World Anti-Doping Agency) was behind the testing, then we would also have known something by now. \"Otherwise, all these looks to me as pure fiction and fabrication of the facts.\"\n", "llama3.2:1b": ["Svetlana Kuznetsova tested positive for ephedrine in a Belgian exhibition event on December 19, but she denied taking it and claims the test was unfair.", "Belgian authorities are investigating her, with the US Open champion saying she has not been notified of any positive test results.", "Russian tennis chief Shamil Tarpishchev condemned the Belgian sports minister for naming Kuznetsova without evidence.", "The International Tennis Federation is also being investigated."], "llama3.2:3b": ["Svetlana Kuznetsova tested positive for ephedrine after a Belgian drugs test, according to sports minister Claude Eerdekens; she has not been formally notified or had a B sample tested.", "The test was conducted outside of WADA, ITF, and WTA regulations; Russian tennis chief Shamil Tarpishchev condemned the move as unethical and demanded formal notification to the ITF and national federation."], "gemma2:2b": ["Svetlana Kuznetsova tested positive for ephedrine in a test conducted by Belgian authorities on December 19th while playing in Charleroi.", "The case is unclear as the tournament was not commissioned by Wada or the ITFT, and her B sample has not yet been tested.", "Kuznetsova maintains innocence until proven guilty and denies taking any performance-enhancing drugs.", "Russian tennis chief Shamil Tarpishchev condemns the Belgian minister's naming of Kuznetsova without proof and claims he hasn’t received confirmation from either WADA or the ITF, suggesting the situation is fabricated."], "qwen2.5:0.5b": ["US Open champion Svetlana Kuznetsova tested positive for ephedrine while playing in a Charleroi exhibition event on December 19th.", "Belgian authorities have identified her as having used the banned drug.", "The test was carried out by regional Belgian authorities and she has not yet been able to have a B sample tested.", "The situation remains unclear as the tournament was not commissioned by Wada, ITF or Women's Tennis Association (WTA)."], "qwen2.5:1.5b": ["Russian tennis star Svetlana Kuznetsova tested positive for ephedrine, a banned drug, after testing negative in Belgium.", "Confirmed as innocent until proven guilty, she remains unaware of results.", "Tarpishchev criticizes Belgian sports minister for naming player without proof.", "Kuznetsova says she's not using performance-enhancing drugs and believes it unfair to have test come out the way it did.", "Concerns over confirmation process remain unclear."], "qwen2.5:3b": ["Kuznetsova tested positive for ephedrine during a December exhibition event in Charleroi, Belgium.", "Belgian authorities found her guilty but she remains innocent until proven otherwise.", "The test was not commissioned by WADA, ITF or WTA, leaving the situation unclear.", "Kuznetsova stated she does not use banned substances and denied any wrongdoing.", "Russian tennis chief Tarpishchev criticized Eerdekens for naming Kuznetsova without proof.", "The doping case has raised questions about the credibility of Belgian authorities in identifying the player."], "opencoder:1.5b": ["Kuznetsova 'failed a drugs test' is a summary of the given text."], "smollm:1.7b": ["The summary is:\n\nKuznetsova failed a drugs test at the US Open Championship in tennis.", "The Belgian authorities discovered that she tested positive for ephedrine, a banned drug, on 19 December 2018.", "Kuznetsova was playing in an exhibition event in Charleroi at the time.", "Eerdekens said that there is no evidence to prove that Kuznetsova used any illegal substances during her tennis career.", "He said that she remains innocent until proven guilty and that she can ask for a second test if she wants to be cleared of the drug.", "The situation remains unclear as the US Open Championship was not commissioned by WADA, the International Tennis Federation (ITF) or the Women's Tennis Association (WTA).", "Kuznetsova has not yet been able to have her B sample tested for ephedrine."], "deepseek-r1:1.5b": ["Svetlana Kuznetsova, US Open champion and tennis professional, tested positive for ephedrine, a banned drug according to Belgian authorities.", "She was involved in an exhibition event at the time, but her test status remains unclear as she hasn't been given a B sample.", "The situation is ongoing with concerns over whether she will be questioned further.", "Russian tennis chief Shamil Tarpishchev condemned the naming without evidence and emphasized ethical standards for doping cases."], "tinyllama:1.1b": ["Kuznetsova 'failed a drug test'\n\nUS Open champion Svetlanna Kuznetsova has tested positive for a banned substance, according to Belgian authorities.", "Belgian sports minister Claude Eerdekens said that the Russian world number five tested positive for the stimulant ephedrin on 19 December and the situation remains unclear as the tournament was not commissioned by the World Anti-Doping Agency (Wada), the International Tennis Federation (ITF) or the Women's Tennis Association (WTA).", "The test was carried out by regional Belgian authorities, but Kuznetsova has not yet been able to have a B sample tested.", "Speaking at the Australian Open before Eerdekens identified her, Kuznetsova said she had not taken any drugs and claimed that she was \"not worried\" about the news.", "However, the tennis chief Shamil Tarpishchev condemned Belgian sports minister Claude Eerdekens for naming a player without proof of wrongdoing, stating \"if there is a positive sample, then they should notify the International Tennis Federation (ITF) as well as the national federation within three days.\""], "tinydolphin:1.1b": [" The US Open tennis champion, Svetlana Kuznetsova, has tested positive for a banned substance, ephedrine.", "Belgian authorities announced that they had found evidence that Kuznetsova took the stimulant in her exhibition match in Charleroi on 19th December.", "The matter remains unclear as the tournament was not hosted by WADA or the ITF.", "This situation has raised concerns over the fairness of the process surrounding Kuznetsova's doping allegations and questions about how international authorities can effectively manage this issue."], "phi:2.7b": [" Russian world number five tennis champion Svetlana Kuznetsova tested positive for a banned drug, ephedrine, during an exhibition event in Charleroi, Belgium on 19 December.", "Belgian sports minister, Claude Eerdekens, said that she remained innocent until proven guilty and could request another test.", "However, the situation remains unclear as the tournament was not commissioned by WADA or ITF.", "Kuznetsova denies using any performance-enhancing substances and believes it is unfair that her positive test came out without prior notification or proof of wrongdoing.", "Tarpishchev, Russian tennis chief, condemns Eerdekens for breaking ethical rules and urges all involved to follow proper procedures in doping cases."], "orca-mini:3b": [" The US Open champion Svetlana Kuznetsova tested positive for a banned drug during an exhibition event in Charleroi, Belgium on December 19.", "She was accused by Belgian authorities of taking ephedrine.", "The situation remains unclear as neither Wada, the ITF, nor the WTA were involved in the test.", "Kuznetsova's name was announced without any proof of wrongdoing."], "hermes3:3b": ["Svetlana Kuznetsova tested positive for ephedrine, according to Belgian authorities; she remains innocent until proved guilty."], "stablelm-zephyr:3b": ["US Open champion Svetlana Kuznetsova tested positive for ephedrine, a banned drug, during an exhibition event in Belgium in December.", "The situation is unclear because the tournament was not commissioned by the World Anti-Doping Agency (WADA), International Tennis Federation (ITF), or Women's Tennis Accosation (WTA).", "Kuznetsova has not yet had a chance to have a B sample tested.", "She maintains her innocence and believes it is unfair that her name was released without proof of wrongdoing.", "Russian tennis chief Shamil Tarpishchev criticizes the naming of Kuznetsova without evidence and questions the credibility of the situation."], "chatgpt-4o-latest": ["US Open champion Svetlana Kuznetsova tested positive for the banned stimulant ephedrine during an exhibition event in Belgium, according to Belgian authorities.", "Belgian sports minister Claude Eerdekens stated that she remains innocent until proven guilty and can request a retest.", "However, the test was conducted by regional authorities, not the World Anti-Doping Agency (WADA) or the International Tennis Federation (ITF), and Kuznetsova has not yet had a B sample tested.", "Kuznetsova denied wrongdoing, stating she had not been notified of a positive test.", "Eerdekens acknowledged she might have taken medicine containing ephedrine.", "Russian tennis chief Shamil Tarpishchev criticized Eerdekens for naming Kuznetsova without proper procedure, arguing that neither the ITF nor WADA had been informed, calling the situation a fabrication."], "stablelm2:1.6b": ["Russian tennis player Svetlana Kuznetsova failed a drug test for ephedrine in December during an exhibition event in Charleroi.", "Belgian authorities found her positive test but she remains innocent until proven guilty, as there is no involvement from WADA, ITF, or WTA.", "The situation remains unclear due to the lack of commission by these organizations and Kuznetsova's inability to have a B sample tested.", "Kuznetsova denies using any prohibited substances but may have taken medicine containing ephedrine for legitimate reasons.", "Russian tennis chief Shamil Tarpishchev condemns Kuznetsova's naming in the case without any basic evidence or notification from doping officials."], "granite3.1-dense:2b": ["US Open champion Svetlana Kuznetsova, ranked fifth globally, tested positive for banned stimulant ephedrine during an exhibition event in Charleroi on 19 December.", "Belgian sports minister Claude Eerdekens confirmed the test but noted that Kuznetsova remains innocent until proven guilty and can request a retest.", "The incident occurred due to uncomforted procedures, as the event wasn't sanctioned by WADA, ITF, or WTA.", "The B sample hasn't been tested yet.", "Kuznetsova denied any wrongdoing, stating she doesn't use performance-enhancing drugs and hadn't received a positive test notification.", "Eerdekens sent confirmation to Kuznetsova's Spanish address, Belgian prosecutors, and tennis federations last Friday.", "He suggested the ephedrine could have been taken for either performance enhancement or treating an infection.", "Russian tennis chief Shamil Tarpishchev criticized Eerdekens for breaching ethical guidelines by publicly naming Kuznetsova without concrete evidence.", "Tarpishchev emphasized that, according to basic doping principles, a positive sample should be reported to the ITF within three days, but they hadn't received any such notification.", "He described the situation as fabricated and dismissed it as mere speculation."]}