{"raw_text": "Moya fights back for Indian title\n \n Carlos Moya became the first man to successfully defend the Chennai Open title by beating four-times finalist Paradorn Srichaphan 3-6 6-4 7-6 (7/5).\n \n The Spaniard then donated his £28,000 prize money to relief efforts for the victims of the Asian tsunami. The final was close throughout, with Thai second seed Srichaphan - the 2003 winner - closing out the first set. But Moya took the second set, before bouncing back from 5-2 down in the decider to force and win a tie-break. Moya confirmed afterwards: \"I'm donating my prize money from this tournament for the tsunami victims, hoping it makes some difference to their lives. His contribution follows pledges by four other players to donate their prize money from the tournament, which went ahead after the 26 December disaster which has so far claimed at least 150,000 lives. Scrichapan said he would donate an unspecified amount for relief work in Thailand, where more than 5,000 people were killed. The ATP has announced that it would contribute the US$25,000 tournament fee to Unicef's emergency relief fund in Tamil Nadu. The ATP Tour's sponsor, Mercedes, said it would also contribute, increasing the ATP donation to US$40,000.\n", "llama3.2:1b": ["Carlos Moya defeated Paradorn Srichaphan 3-6 6-4 7-6 (7/5) for his fourth title at Chennai Open and donated £28,000 to tsunami victims."], "llama3.2:3b": ["Carlos Moya defended the Chennai Open title by beating Paradorn Srichaphan 3-6 6-4 7-6 (7/5).", "He donated his £28,000 prize money to tsunami relief efforts.", "Srichaphan said he would donate an unspecified amount for Thailand, and the ATP and Mercedes contributed a total of $40,000 to Unicef's emergency relief fund."], "gemma2:2b": ["Carlos Moya won the Chennai Open title by beating Paradorn Srichaphan, donating his prize money to tsunami relief efforts.", "Four other players also donated their winnings, and the tournament's sponsor, Mercedes, added to the total amount."], "qwen2.5:0.5b": ["Carlos Moya defended his Chennai Open title by defeating Paradorn Srichaphan in three sets while donating £28, 000 to relief efforts for victims of the Asian tsunami.", "The tournament closed with a tie-break and a set winner, but Moya held on throughout the match, eventually winning the decider with a 6-4, 7-6 (7/5) victory.", "He confirmed he had donated his prize money from the tournament for tsunami relief efforts, saying \"I'm donating my prize money from this tournament for the tsunami victims, hoping it makes some difference to their lives.\""], "qwen2.5:1.5b": ["Carlos Moya won the Chennai Open title and donated his prize money for tsunami victims.", "Thailand's Paradorn Srichaphan defeated Moya in a tight final but ultimately lost due to injury.", "The tournament organizers pledged additional donations as well."], "qwen2.5:3b": ["Carlos Moya successfully defended his Chennai Open title by defeating four-time finalist Paradorn Srichaphan 3-6 6-4 7-6 (7/5).", "Throughout the match, Moya bounced back from a set down and a 5-2 deficit in the deciding set to win.", "After winning, he donated £28,000 of his prize money for tsunami relief efforts.", "Other players pledged similar donations, with Srichaphan contributing an unspecified amount for Thai relief work.", "The ATP and Mercedes also announced contributions to Unicef's emergency fund."], "opencoder:1.5b": ["Moya fought back for Indian titles during the Chennai Open title.", "He won the final match and defeated Paradorn Srichaphan 3-6 6-4 7-6 (in third set) which is a win by 2 points and takes into account four other players to donate their prize money.", "The Spaniard donated his money for relief efforts of the victims of the Asian tsunami in the first match, where they faced Thai second seed Srichaphan who closed out the first set with a win."], "smollm:1.7b": ["Moya fought back for Indian title"], "deepseek-r1:1.5b": ["Carlos Moya became the first man to successfully defend the Chennai Open title by beating four-time finalist Paradorn Srichaphan 3-6 6-4 7-6 (7/5), and donated his £28,000 prize money to help with the victims of the Asian tsunami."], "tinyllama:1.1b": ["Paradorn Srichaphan battled four-time finalist Carlos Moya for the Chennai Open title, but the Spanish athlete secured his first championship victory with a close 3-6, 6-4, 7-6 (7/5) win over the Thai second seed.", "The winner donated US$28,000 to relief efforts caused by the Asian tsunami disasters, with ATP players pledging their prize money for charitable causes.", "Four other players also offered up contributions after the tragedy struck India in December, including Scrichapan Vongsa of Thailand who donated US$25,000 to Unicef's emergency relief fund and $40,000 to the ATP Tour."], "tinydolphin:1.1b": [" Carlos Moya, a Spanish tennis player, successfully defended his Chennai Open title by defeating Thai second seed Paradorn Srichaphan in a close match that went down to a tie-break.", "The tension was palpable throughout the final, with both players giving their best efforts.", "However, it was Moya who emerged victorious, claiming the title for the first time.", "Following his win, he donated his prize money to charitable causes in India, where the Asian tsunami had claimed many lives.", "This act of philanthropy is a testament to the sport's spirit and to the resilience of humanity amidst adversity."], "phi:2.7b": [" Carlos Moya became the first man to successfully defend his title at the Chennai Open by defeating four-time finalist Paradorn Srichaphan 7-6(7-5), and he donated his £28,000 prize money for relief efforts in the aftermath of the Asian tsunami.", "Four other players have pledged their prize money to help with disaster relief, with the ATP Tour's sponsor, Mercedes, also making a donation."], "orca-mini:3b": [" Moya became the first man to successfully defend the Chennai Open title by beating four-times finalist Paradorn Srichaphan.", "He donated his prize money to relief efforts for the victims of the Asian tsunami and confirmed afterwards that he would donate his prize money from this tournament for the tsunami victims."], "hermes3:3b": [" Carlos Moya defends Chennai Open title, donates prize money to tsunami victims."], "stablelm-zephyr:3b": ["Carlos Moya defended the Chennai Open title by defeating Paradorn Srichaphan 3-6 6-4 7-6 (7/5).", "He donated his £28,000 prize money to relief efforts for Asian tsunami victims, alongside pledges from four other players.", "The ATP and Mercedes contributed US$40,000 to Unicef's emergency relief fund in Tamil Nadu."], "chatgpt-4o-latest": ["Carlos Moya defended his Chennai Open title by defeating Paradorn Srichaphan in a close final, winning 3-6, 6-4, 7-6.", "Moya donated his £28,000 prize money to Asian tsunami relief efforts, joining other players who pledged their winnings.", "Srichaphan also committed to donating for relief in Thailand.", "The ATP contributed $25,000 to Unicef, with sponsor Mercedes increasing the total donation to $40,000."], "stablelm2:1.6b": ["Spanish tennis player Carlos Moya successfully defended his title at the Chennai Open by defeating Thai second seed Paradorn Srichaphan 3-6 6-4 7-6 (7/5).", "After winning, Moya donated £100,0 T(ournament prize money) to relief efforts for the Asian tsunami victims.", "This is part of a larger effort by four other players in the tournament to donate their prize money.", "The ATP has announced that it will contribute US$100,000 to Unicef's emergency relief fund in Tamil Nadu, with the ATP Tour's sponsor, Mercedes, also contributing towards this cause."], "granite3.1-dense:2b": ["Carlos Moya defended his Chennai Open title by defeating Paradorn Srichaphan 3-6, 6-4, 7-6 (7/5).", "Post-match, Moya donated his £28,000 prize money to tsunami relief efforts.", "This decision mirrors pledges from four other players participating in the tournament, which was held following the devastating 26 December disaster that has claimed over 150,000 lives.", "Srichaphan committed an unspecified sum for Thailand's relief efforts, where more than 5,000 people perished.", "The ATP Tour and Mercedes sponsor, the latter contributing to an increase in the overall donation to US$40,000, will donate their respective tournament fees to Unicef's emergency relief fund in Tamil Nadu."]}