{"raw_text": "Hewitt falls to Dent in Adelaide\n \n Lleyton Hewitt suffered a shock defeat to Taylor Dent in the quarter-finals of the Australian Hardcourt Championships in Adelaide on Friday.\n \n The top seed was a strong favourite for the title but went down 7-6 (7-4) 6-3 to the American. Dent will face Juan Ignacio Chela next after the fourth seed was too strong for Jurgen Melzer. Olivier Rochus beat third seed Nicolas Kiefer 6-7 (4-7) 7-6 (8-6) 7-5 and will take on second seed Joachim Johansson. The Swede reached the last four by beating compatriot Thomas Enqvist 6-3 4-6 6-1. \"I felt like I was striking the ball much better,\" said Johansson.\n \n \"I felt like I had a lot of break chances, I didn't take care of them all, but I broke him four times and he only broke me once. \"I felt that was the key to get up in the set early.\" Hewitt played down his defeat and insisted he is focused solely on the Australian Open, which starts on 17 January. \"When you've been number one in the world for a couple of years and won a couple of slams, you look at the big picture and what motivates you,\" said Hewitt. \"That's the Grand Slams and Melbourne's as big for me as any of the four. Even if I don't win Sydney next week it's no big deal.\"\n", "llama3.2:1b": ["Lleyton Hewitt lost to Taylor Dent in the quarter-finals of the Australian Hardcourt Championships in Adelaide.", "Hewitt was a top seed, but fell 7-6 (7-4) 6-3 to Dent.", "He will face Juan Ignacio Chela next after beating Nicolas Kiefer and Olivier Rochus."], "llama3.2:3b": ["Lleyton Hewitt lost to Taylor Dent in the Australian Hardcourt Championships quarter-finals, while Joachim Johansson reached the semi-finals by beating Thomas Enqvist, and Juan Ignacio Chela will face Dent."], "gemma2:2b": ["Lleyton Hewitt lost to Taylor Dent in the Australian Hardcourt Championships quarter-finals, falling 7-6 (7-4) 6-3.", "Dent will play Juan Ignacio Chela in the semi-finals, and Olivier Rochus defeated Nicolas Kiefer to advance to the semis.", "Joachim Johansson won after defeating Thomas Enqvist in a closely contested match.", "Hewitt emphasized his focus on the upcoming Australian Open, where he hopes to achieve further success."], "qwen2.5:0.5b": ["Lleyton Hewitt defeated Taylor Dent in the Australian Hardcourt Championships in Adelaide, beating him 7-6 (7-4) 6-3 on Friday.", "Dent will face Juan Ignacio Chela and Nicolas Kiefer respectively after the fourth seed had strong performances against Jurgen Melzer, Olivier Rochus, and Thomas Enqvist.", "Hewitt emphasized his focus on the Australian Open which starts on 17 January, but admitted he is a top player in world rankings and doesn't care about matches outside of the tournament."], "qwen2.5:1.5b": ["Lleyton Hewitt lost to Taylor Dent in the quarter-finals of the Australian Open, but Dent will face Juan Ignacio Chela in the next round after Dent outmaneuvered Jurgen Melzer in the semifinals."], "qwen2.5:3b": ["Lleyton Hewitt lost to Taylor Dent in quarter-finals of Australian Hardcourt Championships, suffering a surprise defeat.", "Dent will face Juan Ignacio Chela in semifinals.", "Olivier Rochus defeated Nicolas Kiefer and will play Joachim Johansson.", "Johansson mentioned he broke his opponent four times while only being broken once.", "Despite the loss, Hewitt downplayed it, focusing on upcoming Australian Open starting January 17th."], "opencoder:1.5b": ["Lleyton Hewitt fell to his opponent, Taylors, the Australian Hardcourt Championships in Adelaide on Friday.", "The top seed was a strong favourite, but he went down 7-6 (7-4) 6-3 to the American.", "They faced Juani Ignacio Chela next after the fourth seed was too strong for Jurgen Melzer.", "Olivier Rochus beat the third seed, Nicolas Kiefer, who scored 6-7 (4-7) 7-6 (8-6) and ended up with a win streak of 5.", "It was Joachim Johansson that played after.", "The Swede reached the last four, scoring 6-3 4-6 6-1.", "\"I felt like I was striking the ball much better,\" said Johansson.", "\"I had plenty of break chances, but I didn't take care of them all.", "I broke him four times and he only broke me once.\"", "The reason was that he looked at the set early, which is part of his motivation to get up in the set when they were number one in the world for a couple of years."], "smollm:1.7b": ["Hewitt fell to Taylor Dent in Adelaide, with Lleyton Hewitt suffering a shock defeat to the American at the quarter-finals of the Australian Hardcourt Championships in Adelaide on Friday.", "The top seed was too strong for the title but went down 7-6 (7-4) 6-3 to the American.", "Lleyton Hewitt, who is known for his aggressive playing style and ability to dominate opponents, felt like he was striking the ball much better than Taylor Dent.", "He didn't take care of all his chances, but he broke him four times and only broke him once.", "Hewitt also said that he feels motivated solely by the Australian Open, which starts on 17 January.", "\"When you've been number one in the world for a couple of years and won a couple of slams, you look at the big picture and what motivates you,\" Hewitt said.", "\"That's the Grand Slams and Melbourne's as big for me as any of the four.", "Even if I don't win Sydney next week it's no big deal.\"", "Overall, Hewitt felt like he was under pressure from Dent and his team, but he is confident in his ability to dominate opponents at the Australian Open."], "deepseek-r1:1.5b": ["Hewitt fell short as Lleyton defeated Taylor Dent in the Australian Hardcourt Championships' quarter-finals, securing a spot for the Grand Slams in Melbourne.", "Dent reached the last four by defeating third seed Nicolas Kiefer, and Johansson won his first Grand Slam since winning in 2017, reaching the last four against Thomas Enqvist after beating compatriot."], "tinyllama:1.1b": ["Hewiitt, who fell to American Taylor Dent in the quarter-finals of the Australian Hardcourt Championships in Adelaide on Friday, lost 7-6(7-4) and 6-3 to top seeded Jurgen Melzer.", "Melzer was too strong for Olivier Rochus and will now face second seed Joachim Johansson, while Hewiitt will play Thomas Enqvist in the semifinals.", "However, Hewiitt insisted that he is fully focused on the Australian Open, starting with the upcoming Grand Slam tournament in Melbourne."], "tinydolphin:1.1b": [" Hewitt falls to Dent in Adelaide, with Taylor Dent securing the quarterfinal spot after a notable upset against Lleyton Hewitt.", "Despite being the top seed, Hewitt was defeated by Dent, losing 7-6 (7-4) 6-3 in the quarterfinals of the Australian Hardcourt Championships in Adelaide.", "The victory sends second seed Joachim Johansson into the last four and puts third seed Nicolas Kiefer out.", "Hewitt will face second-seeded Thomas Enqvist in the quarters, while Joachim Johansson faces compatriot Thomas Enqvist in his quarterfinal match."], "phi:2.7b": [" Lleyton Hewitt, a top-ranked tennis player, suffered a surprising defeat to Taylor Dent in Adelaide.", "The American beat Hewitt 7-6 (7-4) 6-3 in the quarter-finals of the Australian Hardcourt Championships.", "Dent will now face Juan Ignacio Chela in the next round, while second seed Joachim Johansson and third seed Nicolas Kiefer have both advanced to the final four.", "Despite his loss, Hewitt is focused on winning the Australian Open, which starts on 17 January."], "orca-mini:3b": [" Lleyton Hewitt suffered a shock defeat to Taylor Dent in the quarter-finals of the Australian Hardcourt Championships in Adelaide on Friday.", "The top seed was a strong favorite for the title but went down 7-6 (7-4) 6-3 to the American."], "hermes3:3b": ["LleytonHewitt lost to TaylorDentinquarter-finalsofAustralianHardcourtChampionshipsinAdelaide."], "stablelm-zephyr:3b": ["Lleyton Hewitt suffered a quarter-finals defeat to Taylor Dent at the Australian Hardcourt Championships in Adelaide.", "Top seed Hewitt lost 7-6 (7-4) 6-3 to the American, with Dent facing Juan Ignacio Chela next.", "Olivier Rochus beat Nicolas Kiefer and will face Joachim Johansson in the next round.", "Despite the loss, Hewitt remained focused on the Australian Open starting on 17 January."], "chatgpt-4o-latest": ["Lleyton Hewitt was unexpectedly defeated by Taylor Dent in the quarter-finals of the Australian Hardcourt Championships in Adelaide, losing 7-6 (7-4) 6-3.", "Dent will face Juan Ignacio Chela, who beat Jurgen Melzer.", "Olivier Rochus overcame Nicolas Kiefer and will play Joachim Johansson, who defeated Thomas Enqvist.", "Johansson felt he played well, capitalizing on break opportunities.", "Hewitt downplayed the loss, emphasizing his focus on the Australian Open, stating that Grand Slams, particularly Melbourne, are his main motivation."], "stablelm2:1.6b": ["Lleyton Hewitt loses to Taylor Dent in Australian Hardcourt Championships quarterfinals, with Dent advancing to face Juan Ignacio Chela.", "Hewitt's American opponent won 7-6, 7-4, 6-3; Dent will face the winner of a match between Olivier Rochus and Joachim Johansson.", "Hewitt plays down his defeat and emphasizes focus on upcoming Australian Open."], "granite3.1-dense:2b": ["Lleyton Hewitt, the top seed, was unexpectedly defeated by American Taylor Dent (7-6, 6-3) in the quarter-finals of the Australian Hardcourt Championships in Adelaide on Friday.", "Dent will face Juan Ignacio Chela next.", "Third seed Nicolas Kiefer was eliminated by Olivier Rochus (6-7, 7-6, 7-5), and second seed Joachim Johansson advanced after defeating third seed Nicolas Kiefer.", "Hewitt, who remains focused on the upcoming Australian Open (starting January 17), downplayed his loss, emphasizing the importance of Grand Slams, particularly Melbourne."]}