{"raw_text": "Classy Henman makes winning start\n \n Tim Henman opened his 2005 campaign with a 6-1 7-5 victory over Argentine David Nalbandian at the Kooyong Classic exhibition tournament on Wednesday.\n \n The British number one will next play Roger Federer at the Australian Open warm-up event on Friday. The world number one beat Gaston Gaudio 5-7 6-1 6-4, before Andre Agassi saw off Chilean Olympic gold medalist Nicolas Massu 6-1 7-6 (7-4). Andy Roddick beat Ivan Ljubicic, who replaced Paradorn Srichaphan, 6-1 6-4. Henman made an impressive start to the year, only faltering against Nalbandian when serving for the match at 5-4. But the Briton regained his composure to win the next two games for only his second win in six matches against the Argentine. \"It's a great start to the year - just what I was looking for,\" Henman told his website. \"Over the years I've found David very difficult to play against.\n \n \"He returns serve very well and he's deceptively effective from the baseline, so sometimes it can be difficult to execute my gameplan well enough against him to get the right result. \"Beating somebody of his stature is always good for the confidence and it bodes well at the beginning of the year.\" Henman also revealed the extent of the back problems he suffered in the off-season. \"I'm not the most flexible and at the end of the year I was pretty exhausted and wanted to have a couple of weeks where I didn't do anything,\" said Henman. \"When I started training again it really, really seized up. As much as I enjoyed the two weeks off I don't think it's so productive.\" Federer dropped a tight first set against 2004 French Open champion Gaudio, but was content with his game. \"It was about getting used to the surface,\" he said.\n \n \"The conditions are much quicker than Doha, my timing was OK, but I could have served better. \"All in all I'm happy with the match, and I won it - that's a good sign. Now I have a day off and hopefully play better the next match.\" Agassi was delighted with victory over Massu in his first match for over two months. \"I felt pretty good,\" said the American. \"I liked the way the match played out and, maybe excluding a few second serve returns, I felt like I was doing most things pretty darn well for the first match.\"\n", "llama3.2:1b": ["Tim Henman opened his 2005 campaign with a 6-1 victory over Argentine David Nalbandian at the Kooyong Classic.", "He followed up by defeating Gaston Gaudio and Andre Agassi, and beat Ivan Ljubicic in the Australian Open warm-up event.", "Henman's start to the year was impressive, but he struggled against Nalbandian, regaining his composure to win the match.", "Henman also revealed that he has been dealing with back problems, which affected his performance over the off-season."], "llama3.2:3b": ["Tim Henman defeated David Nalbandian 6-1 7-5 at the Kooyong Classic exhibition tournament.", "He will play Roger Federer at the Australian Open warm-up event on Friday.", "Henman cited his struggles against Nalbandian, who returns serve well and is effective from the baseline, as a challenge."], "gemma2:2b": ["Tim Henman won his opening exhibition match at the Kooyong Classic against David Nalbandian 6-1 7-5.", "Roger Federer defeated Gaston Gaudio 5-7 6-1 6-4 to advance in the tournament, while Andre Agassi beat Nicolas Massu 6-1 7-6 (7-4)."], "qwen2.5:0.5b": ["Tim Henman made his debut at the 2005 Kooyong Classic exhibition tournament by winning against Argentine David Nalbandian.", "He will compete in the Australian Open warm-up event on Friday against Roger Federer and Andre Agassi beat Nicolas Massu, while Andy Roddick overcame Ivan Ljubicic, who replaced Paradorn Srichaphan.", "Henman's win was impressive for him as he had lost four matches before; however, it came too late after the match at 5-4.", "He indicated that his back problems affected his performance, which he said could have been mitigated by rest and a longer break.", "He is still looking forward to winning his first Australian Open tournament this year, but admits it will be tough due to back issues."], "qwen2.5:1.5b": ["British number one Tim Henman won his opening tournament of 2005 exhibition match against Argentine David Nalbandian with a 6-1, 7-5 victory.", "Next up, he faces Roger Federer at the Australian Open warm-up event on Friday after beating Gaston Gaudio and Andre Agassi.", "The British player expressed confidence in facing his opponent, describing him as \"difficult to play against\" due to his powerful returns and baseline game.", "Additionally, Henman revealed back problems from the off-season and stated that a brief rest period was necessary for recovery."], "qwen2.5:3b": ["Tim Henman won his opening match 6-1 7-5 against David Nalbandian at the Kooyong Classic.", "He will play Roger Federer next in the Australian Open warm-up event.", "Henman acknowledged it was a difficult match against Nalbandian, but regained composure to win.", "He also mentioned he had back problems during the off-season, which affected his flexibility and training efficiency.", "Federer expressed satisfaction with his performance, despite losing the first set to Gaston Gaudio.", "Andre Agassi won his match against Nicolas Massu after an absence of over two months, feeling good about his game."], "opencoder:1.5b": ["\"Classy Henman makes winning start\"\n\nTim Henman opened his 2005 campaign with a 6-1 7-5 victory over Argentine David Nalbandian at the Kooyong Classic exhibition tournament on Wednesday.", "The British number one will next play Roger Federer at the Australian Open warm-up event on Friday.", "The world number one beat Gaston Gaudio 5-7 6-1 6-4, before Andre Agassi saw off Chilean Olympic gold medalist Nicolas Massu 6-1 7-6 (7-4).", "Andy Roddick beat Ivan Ljubicic, who replaced Paradorn Srichaphan, 6-1 6-4.", "Henman made an impressive start to the year, only faltering against Nalbandian when serving for the match at 5-4.", "But the Briton regained his composure to win the next two games for only his second win in six matches against the Argentine.", "\"He's a great start to the year - just what I was looking for,\" Henman told his website.", "\"Over the years I've found David very difficult to play against.", "\"You're not the most flexible and at the end of the year I was pretty exhausted and wanted to have a couple of weeks where I didn't do anything,\" said Henman.", "\"When I started training again it really, really seized up.", "As much as I enjoyed the two weeks off I don't think it's so productive.\"", "Federer dropped a tight first set against 2004 French Open champion Gaudio, but was content with his game.", "\"It was about getting used to the surface,\" he said.", "\"The conditions are much quicker than Doha, my timing was OK, but I could have served better.", "\"All in all I'm happy with the match, and I won it - that's a good sign.", "Now I have a day off and hopefully play better the next match.\"", "Agassi was delighted with victory over Massu in his first match for over two months.", "\"I felt pretty good,\" said the American.\""], "smollm:1.7b": ["Classy Henman makes winning start"], "deepseek-r1:1.5b": ["Tim Henman opened his 2005 campaign with a remarkable victory over Argentine David Nalbandian, beating him 6-1 7-5.", "Next, he'll face Roger Federer at the Australian Open warm-up event on Friday.", "Henman demonstrated versatility by defeating Gaston Gaudio 5-7 6-1 6-4 and Ivan Ljubicic 6-1 6-4.", "He also highlighted his resilience when playing against Nicolas Massu, who beat him 6-1 7-6 (7-4).", "Henman expressed confidence in his play and said back issues from the off-season were a bummer.", "Despite challenges, he showed potential for success.", "After serving well, Henman dominated his next two matches, showcasing confidence going into Friday's match."], "tinyllama:1.1b": ["The article mentions that Tim Henman made an impressive start to his tennis career by beating David Nalbandian in their Koyo Classic exhibition tournament.", "He was only able to win against Nalbandian due to his good gameplan and being effective on serve.", "Despite the back problems he had earlier, he managed to enjoy a comfortable victory.", "The author summarizes Henman's first match of the year, where he made an impressive start to his tennis career with a 6-1 7-5 win over Argentine David Nalbandian, and later won against Andy Roddick who replaced Paradorn Srichaphan in their match."], "tinydolphin:1.1b": [" Summary: Tim Henman began his campaign with a victory against Argentine David Nalbandian at the Kooyong Classic exhibition tournament.", "The British number one will play Roger Federer at the Australian Open warm-up event, while Andy Roddick faced challenging opponents like Gaston Gaudio and Andre Agassi before beating them in straight sets."], "phi:2.7b": [" British tennis player Tim Henman won his 2005 campaign with a 6-1, 7-5 victory over Argentine David Nalbandian at the Kooyong Classic exhibition tournament.", "He will next play Roger Federer at the Australian Open warm-up event on Friday after beating Gaston Gaudio and Andre Agassi.", "The top tennis player Andy Roddick also beat Ivan Ljubicic, who replaced Paradorn Srichaphan.", "Henman had back problems in the off-season but is confident in his game.", "Federer won against David Nalbandian but lost a tight first set to Gaudio.", "Agassi was delighted with his victory over Nicolas Massu."], "orca-mini:3b": [" Tim Henman made an impressive start to the 2005 campaign with a 6-1 7-5 victory over David Nalbandian at the Kooyong Classic exhibition tournament.", "The British number one will next play Roger Federer at the Australian Open warm-up event on Friday."], "hermes3:3b": ["Tim Henman starts 2005 tennis season with win against David Nalbandian."], "stablelm-zephyr:3b": ["Tim Henman began his 2005 campaign with a 6-1, 7-5 win against Argentine David Nalbandian at the Kooyong Classic exhibition tournament.", "He next played Roger Federer at the Australian Open warm-up event, defeating Gaston Gaudio 5-7, 6-1, 6-4.", "Andre Agassi beat Chilean Olympic gold medalist Nicolas Massu 6-1, 7-6, 7-4.", "Andy Roddick secured a victory against Ivan Ljubicic, replacing Paradorn Srichaphan.", "Henman mentioned that playing against Nalbandian was difficult due to the Argentine's serve and baseline play.", "Federer attributed his win in part to getting accustomed to the faster court surface, while Agassi expressed satisfaction with his performance after a two-month break from tennis."], "chatgpt-4o-latest": ["Tim Henman began his 2005 season with a 6-1 7-5 win over David Nalbandian at the Kooyong Classic, setting up a match against Roger Federer.", "Henman, who had struggled against Nalbandian in the past, was pleased with the victory and saw it as a confidence boost.", "He also discussed back problems he faced in the off-season.", "Federer overcame Gaston Gaudio in three sets, adjusting to the faster surface, while Andre Agassi marked his return with a win over Nicolas Massu.", "Andy Roddick also secured a straight-sets victory over Ivan Ljubicic."], "stablelm2:1.6b": ["British number one Tim Henman begins his campaign with a 6-1, 7-5 victory over Argentine David Nalbandian at the Kooyong Classic exhibition tournament.", "He will next play Roger Federer at the Australian Open warm-up event.", "Henman faces difficulty against Nalbandian due to his serve and effectiveness from the baseline but wins the match after serving for it at 5-4.", "The win is a good start to the year, boosting Henman's confidence.", "Federer dropped a tight first set in his match against Gaudio but was content with his game, feeling he adapted well to the surface.", "Agassi won his first match in over two months against Chilean Olympic gold medalist Nicolas Massu."], "granite3.1-dense:2b": ["Tim Henman initiated 2005 with a convincing 6-1, 7-5 victory over David Nalbandian at the Kooyong Classic.", "Despite struggling to serve out the match, Henman regrouped and secured the win, marking his second against Nalbandian in six attempts.", "This performance boosts Henman's confidence ahead of the Australian Open.", "Meanwhile, Federer defeated Gaston Gaudio 5-7, 6-1, 6-4, while Agassi and Roddick also advanced with wins over Nicolas Massu and Ivan Ljubicic, respectively.", "Federer attributed his initial set loss to adapting to the court surface, while Agassi expressed satisfaction with his overall performance in his first match in two months.", "Henman briefly discussed his off-season back issues, which limited his training but improved as he regained full mobility."]}