{"raw_text": "Capriati out of Australian Open\n \n Jennifer Capriati has become the third leading lady to withdraw from the Australian Open because of injury.\n \n The organisers of the first grand slam of 2005, which begins on 17 January, said the American has a problem with her right shoulder. It comes as a blow to the women's draw as last year's champion, Justin Henin-Hardenne, and runner-up, Kim Clijsters, will also be absent. Capriati is a two-time champion in Melbourne with wins in 2001 and 2002. She is believed to have picked up the injury at the Advanta Championships at Philadelphia in November and had to pull out of an exhibition match with Wimbledon champion Maria Sharapova on 17 December. Capriati also decided against competing in the Australian Open warm-up event, the Sydney International.\n", "llama3.2:1b": ["Jennifer Capriati withdraws from the Australian Open due to injury.", "She is one of three leading ladies to miss the tournament for the first time as a result of an issue with her right shoulder."], "llama3.2:3b": ["Jennifer Capriati has withdrawn from the Australian Open due to a right shoulder injury.", "The American is a two-time Melbourne champion and had picked up the injury at the Advanta Championships in Philadelphia in November.", "She will not compete in the Sydney International or any other events leading up to the tournament."], "gemma2:2b": ["Jennifer Capriati has withdrawn from the Australian Open due to a shoulder injury.", "This is the third prominent player to withdraw; last year's champion and runner-up are also absent.", "Capriati was injured at the Philadelphia tournament and withdrew from a match in December."], "qwen2.5:0.5b": ["Capriati withdrew from the Australian Open due to injury, missing three matches and being left out of the grand slam draw.", "She is a two-time champion at the Grand Slam and has picked up an injury at Advanta Championships."], "qwen2.5:1.5b": ["Australian Open cancellations due to injury: Jennifer Capriati withdraws from Grand Slam, while last year's champions and runner-ups opt out."], "qwen2.5:3b": ["Jennifer Capriati has withdrawn from the 2005 Australian Open due to a right shoulder injury.", "At 34 years old, she becomes the third top player to miss this year's tournament.", "A two-time champion (2001, 2002), Capriati last played there in Melbourne.", "Her absence affects the draw; other notable players missing include defending champion Justin Henin-Hardenne and runner-up Kim Clijsters.", "Capriati had been injured since November and pulled out of an exhibition match with Maria Sharapova in December before deciding against playing in a warm-up event, the Sydney International."], "opencoder:1.5b": ["Capriati's decision to withdraw from the Australian Open has been a pivotal moment in her career as a women's sports star.", "After facing injury and a challenge from the Australian Open, she felt compelled to reevaluate her career and reflect on her decision to leave Australia.", "The decision was made due to two main factors- her passion for the sport and her determination to make a significant impact at the sport's peak events."], "smollm:1.7b": ["Capriati out of Australian Open"], "deepseek-r1:1.5b": ["Capriati withdrew from the Australian Open as the third lady due to her right shoulder injury, a significant blow for the women's draw.", "The organizers noted her participation was affected by her absence, with last year’s champion Justin Henin-Hardenne and runner-up Kim Clijsters also missing.", "Capriati had been part of previous tournaments, winning in 2001 and 2002, but faced an injury before the Advanta Championships in November.", "She competed in an exhibition match against Sharapova on December 17, despite her injury.", "Her decision to disengage from the Australian Open warm-up was also noted."], "tinyllama:1.1b": ["Jennifer Capriaati, who was scheduled to participate in the Australian Open, has been forced to withdraw due to injury.", "The American, who is ranked as the third-best female player, has a problem with her right shoulder.", "The tournament organizers have announced that Henin-Harendrene and Clijsters will also miss out on competing.", "Capriaati won two titles at Melbourne in 2001 and 2002.", "She had to pull out of an exhibition match with Sharapova, the Australian Open warm-up event."], "tinydolphin:1.1b": [" Jennifer Capriati has officially withdrawn from the Australian Open due to a shoulder injury.", "She is the third top-ranked lady to withdraw from this prestigious event in recent years, joining Kim Clijsters and Justin Henin-Hardenne.", "This loss for Capriati is a disappointment for the women's draw as she was predicted to be one of the biggest threats at the Australian Open.", "Withdrawing now leaves only two players left in the draw for the first grand slam of 2005, which starts on January 17th, with American Justine Henin-Hardenne and Kim Clijsters being absent due to injuries."], "phi:2.7b": [" Jennifer Capriati has withdrawn from the Australian Open due to a shoulder injury she sustained at the Advanta Championships in Philadelphia in November.", "She is the third leading lady to do so and will not compete in the Sydney International warm-up event."], "orca-mini:3b": [" Jennifer Capriati has withdrawn from the Australian Open due to injury, which is a big blow to the women's draw as she was the third leading lady last year's champion, Justin Henin-Hardenne, and runner-up, Kim Clijsters will also be absent."], "hermes3:3b": ["Jennifer Capriati withdraws from Australian Open due to right shoulder injury."], "stablelm-zephyr:3b": ["Jennifer Capriati is the third top female player to withdraw from the Australian Open due to a right shoulder injury.", "Her absence alongside last year's champion Justin Henin-Hardenne and runner-up Kim Clijsters will cause disruption to the women's draw.", "Capriati had previously competed in Melbourne in 2001 and 2002, winning two championships.", "She sustained the injury during November's Advanta Championships at Philadelphia and withdrew from an exhibition match with Wimbledon champion Maria Sharapova on 17 December.", "Capriati also decided against participating in the Sydney International warm-up event."], "chatgpt-4o-latest": ["Jennifer Capriati has withdrawn from the 2005 Australian Open due to a right shoulder injury, becoming the third top female player to pull out.", "Defending champion Justine Henin-Hardenne and runner-up Kim Clijsters are also absent.", "Capriati, a two-time Australian Open winner, sustained the injury in November and skipped both an exhibition match against Maria Sharapova and the Sydney International warm-up event."], "stablelm2:1.6b": ["Jennifer Capriati withdraws from Australian Open due to injury, joining Justin Henin-Heardmanne and Kim Clijsters as absentees.", "Capriati suffers from a right shoulder problem after previously playing in Philadelphia and against Maria Sharapova in December.", "The text also mentions her two Melbourne victories with wins in 1 and 2."], "granite3.1-dense:2b": ["Jennifer Capriati, a two-time Australian Open champion (2001 and 2002), has withdrawn from the tournament due to a right shoulder injury.", "Her decision follows similar withdrawals by previous year's champion Justin Henin-Hardenne and runner-up Kim Clijsters.", "Capriati sustained the injury at the Advanta Championships in Philadelphia in November, leading her to forgo an exhibition match against Maria Sharapova on 17 December and the Sydney International warm-up event.", "This withdrawal is a significant blow to the women's draw as Capriati continues her recovery from this shoulder issue ahead of the Australian Open, which starts on January 17, 2005."]}