{"raw_text": "Clijsters hope on Aussie Open\n \n Kim Clijsters has denied reports that she has pulled out of January's Australian Open because of her persistent wrist injury.\n \n Open chief Paul McNamee had said: \"Kim's wrist obviously isn't going to be rehabilitated.\" But her spokesman insisted she had simply delayed submitting her entry. \"The doctors are assessing her injury on a weekly basis and if there is no risk she could play. But if there's the least risk she will stay away.\" Despite being absent from the WTA entry list for the tournament, which begins on 17 January, Clijsters would be certain to get a wild card if she requested one. Clijsters is still ranked 22nd in the world despite only playing a handful of matches last season. The Belgian had an operation on her left wrist early in the season but injured it again on her return to the tour. Meanwhile, Jelena Dokic, who used to compete for Australia, has opted out of the first Grand Slam of the season. Dokic has not played in the Australian Open since 2001 when she lost in the first round. But the 21-year-old would have had to rely on a wild card next season because her ranking has tumbled to 127th. Four-time champion Monica Seles, who has not played since last year's French Open, is another absentee because of an injured left foot.\n", "llama3.2:1b": ["Kim Clijsters denied reports she'd leave Australian Open due to wrist injury.", "Her spokesman said she might stay away but would reassess weekly."], "llama3.2:3b": ["Kim Clijsters denies reports she pulled out of the Australian Open due to a persistent wrist injury, stating she delayed submitting her entry for assessment by doctors on a weekly basis."], "gemma2:2b": ["Kim Clijsters will likely miss the Australian Open due to her wrist injury, which was assessed weekly by doctors.", "Jelena Dokic and Monica Seles are also absent from the tournament due to injuries (Dokic's ranking has dropped significantly) or last season's form, respectively.", "Clijsters' absence would likely be filled with a wild card entry if she chooses to play."], "qwen2.5:0.5b": ["Clijsters hopes the Australian Open will be her wildcard for the WTA tournament she had been declining to play due to a wrist injury.", "She can still compete in the first Grand Slam season (Australian Open), where she has not played since 2001 and is ranked 127th overall."], "qwen2.5:1.5b": ["Belgian tennis player Kim Clijsters withdrew from January's Australian Open after reported wrist injury; her request for a wildcard unlikely to be granted as doctors assess risk.", "Dociech opted out due to ranking drop."], "qwen2.5:3b": ["Kim Clijsters denies reports she pulled out of January's Australian Open due to a persistent wrist injury.", "Her spokesman claims she delayed submitting her entry; however, if doctors assess no risk, she could play with a wild card.", "Despite ranking 22nd, Clijsters played few matches last season.", "She underwent an operation early in the season but injured it again when returning to tour.", "Jelena Dokic, who used to compete for Australia, has opted out due to her low ranking (127th) and injury since last season's Australian Open.", "Monica Seles, another absentee with an injured foot, is also absent after not playing since last year's French Open."], "opencoder:1.5b": ["\"Kim Clijsters has denied reports that she has pulled out of January's Australian Open because of her persistent wrist injury.\"", "Despite being absent from the WTA entry list for the tournament, which begins on 17 January, Kim would be certain to get a wild card if she requested one.", "Despite her injuries, she is still ranked 22nd in the world despite only playing a handful of matches last season.", "With no record since 2001 when she lost in the first round, she would have had to rely on a wild card next season because her ranking has tumbled to 127th."], "smollm:1.7b": ["Clijsters hopes on Aussie Open\nKim Clijsters has denied reports that she has pulled out of January's Australian Open because of her persistent wrist injury.", "Open chief Paul McNamee had said: \"Kim's wrist obviously isn't going to be rehabilitated.\"", "But her spokesman insisted she had simply delayed submitting her entry.", "But Kim's spokeswoman said: \"The doctors are assessing her injury on a weekly basis and if there is no risk she could play.", "But if there's the least risk she will stay away.\"", "Despite being absent from the WTA entry list for the tournament, Kim would be certain to get a wild card if she requested one.", "Kim is still ranked 22nd in the world despite only playing a handful of matches last season.", "The Belgian had an operation on her left wrist early in the season but injured it again on her return to the tour.", "Meanwhile, Jelena Dokic, who used to compete for Australia, has opted out of the first Grand Slam of the season.", "Dokic has not played in the Australian Open since 2001 when she lost in the first round.", "But the 21-year-old would have had to rely on a wild card next season because her ranking has tumbled to 127th.", "Four-time champion Monica Seles, who has not played since last year's French Open, is another absentee because of an injured left foot.", "Clijsters hopes on Aussie Open"], "deepseek-r1:1.5b": ["Kim Clijsters denied reporting her wrist injury in the Australian Open, stating she would still receive a wild card despite not participating there.", "The open chief noted potential rehabilitation and doctors assess her weekly.", "Her spokesman delayed submitting her entry, risking participation if healthy.", "Despite low rankings last season, Clijsters is ranked 22nd but missed the WTA tournament.", "She had an injury early and another upon return, while Dokic dropped out since 2001.", "Monica Seles, who hasn't played since last year's French Open due to an injured foot, now ranks 127th."], "tinyllama:1.1b": ["Clijsters aims for Aussié Open despite injury"], "tinydolphin:1.1b": [" Clijsters, the Belgian tennis star who was expected to compete at the Australian Open in January, has been holding up her entry into the tournament due to her ongoing wrist injury.", "Although the Australian Open chief stated that Clijsters's wrist was no longer a concern, her spokesperson has since denied this claim and insists she will play if allowed.", "However, Clijsters remains uncertain about her participation in the tournament, as she is not yet ranked enough to secure a wild card if she were to request one."], "phi:2.7b": [" Kim Clijsters denied reports that she pulled out of the Australian Open due to her wrist injury and said it was just a delay in submitting her entry.", "Open chief Paul McNamee had previously stated that her wrist wouldn't be rehabilitated.", "Despite being absent from the WTA entry list, Clijsters would still receive a wildcard if requested.", "Jelena Dokic also opted out of the tournament due to an injured foot and Monica Seles is another absentee because of an injury."], "orca-mini:3b": [" Kim Clijsters still plans to participate in the Australian Open despite reports that she had pulled out due to her wrist injury.", "Her spokesman claimed that her injury is being assessed weekly and if there is no risk, she could play.", "However, if there is a slight risk, she will stay away.", "Despite not being included in the WTA entry list, Clijsters would receive a wild card if she requested one.", "Jelena Dokic has also opted out of the Australian Open due to her ranking."], "hermes3:3b": ["K. Clijsters not fully withdrawn from Australian Open despite wrist injury reports.", "Entry delayed, not declined."], "stablelm-zephyr:3b": ["Kim Clijsters' denied pulling out from the Australian Open due to a wrist injury, with her spokesman stating she will only play if there's no risk involved.", "Despite being ranked 22nd and having only played a few matches last season, she could still receive a wild card.", "Additionally, Jelena Dokic and four-time champion Monica Seles are also absent from the event due to injuries."], "chatgpt-4o-latest": ["Kim Clijsters has denied withdrawing from the Australian Open due to her wrist injury, despite tournament chief Paul McNamee suggesting otherwise.", "Her spokesman stated that doctors are assessing her condition weekly, and she will only play if there is no risk.", "Although absent from the WTA entry list, she could receive a wild card if needed.", "Clijsters, ranked 22nd despite limited play last season, had wrist surgery but reinjured it upon returning.", "Meanwhile, Jelena Dokic has opted out of the tournament, having not played there since 2001, and would have needed a wild card due to her low ranking of 127.", "Monica Seles is also absent due to a foot injury."], "stablelm2:1.6b": ["Kim Clijsters denies reports that she withdrew from the Australian Open due to a wrist injury; her spokesman says doctors are assessing her injury weekly and she'll compete if there's no risk.", "Despite being absent from WTA entry list, Clijsters will likely receive a wild card for tournament beginning on Jan 1st, despite ranking only slightly lower than last season.", "Meanwhile, Jelena Dokic opted out of the first Grand Slam event; four-time champion Monica Seles is another absentee due to injury."], "granite3.1-dense:2b": ["Kim Clijsters, despite reports suggesting she'd withdraw from the Australian Open due to a wrist injury, maintains her entry.", "Her doctors assess the issue weekly, and she might compete if there's no risk; otherwise, she'll stay away.", "Ranked 22nd globally, Clijsters had surgery on her left wrist early in the season but re-injured it upon returning to play.", "Meanwhile, Jelena Dokic and Monica Seles, both former Australian Open competitors, have opted out of this year's event due to injuries: Dokic has a ranking of 127th, while Seles, the four-time champion, is dealing with an injured left foot."]}