{"raw_text": "Sydney return for Henin-Hardenne\n \n Olympic champion Justine Henin-Hardenne will return to action in January's Sydney International tournament.\n \n The Belgian has not competed since losing her top world ranking at the US Open in September, where she was beaten in the fourth round by Nadia Petrova. She took time out to shake off a virus but will defend her titles in Sydney and at the Australian Open. Women's world number one Lindsay Davenport and French Open champion Anastasia Myskina will also compete.\n \n In the men's event, world number three Lleyton Hewitt returns to defend his title, along with runner-up Carlos Moya. Moya, Spain's Davis Cup final hero in their recent win over the US, had to retire with an ankle injury in the first set of the final.\n \n Tournament director Craig Watson said: \"I had a message relayed to me from him after Spain's Davis Cup victory, saying he was looking forward to trying to make up for his disappointment in the (2004) final. The tournament will take place from 9-15 January.\n", "llama3.2:1b": ["Justine Henin-Hardenne returns to tennis in January's Sydney International tournament.", "She lost her top world ranking at the US Open and took time out to recover, but will compete again.", "Lindsay Davenport and Anastasia Myskina also return for their respective titles.", "Lleyton Hewitt defends his title in the men's event, while Carlos Moya returns after a season-ending injury in the Davis Cup final."], "llama3.2:3b": ["Justine Henin-Hardenne will return to action at Sydney International in January, having taken time out due to a virus.", "Lindsay Davenport and Anastasia Myskina will also compete in women's singles.", "Lleyton Hewitt and Carlos Moya will defend their titles in men's singles."], "gemma2:2b": ["Justine Henin-Hardenne will return to competition at the Sydney International in January.", "Lindsay Davenport and Anastasia Myskina are also expected to compete in women's singles, while Lleyton Hewitt defends his title in men's singles alongside Carlos Moya.", "The tournament takes place from January 9th-15th."], "qwen2.5:0.5b": ["Olympic champion Justine Henin-Hardenne returns to action at the Sydney International tournament this January.", "Women's world number one Lindsay Davenport and French Open champion Anastasia Myskina will also compete.", "Men's title holder Lleyton Hewitt returns to defend his title along with runner-up Carlos Moya."], "qwen2.5:1.5b": ["Olympic champion Justine Henin-Hardenne returns to action in Sydney International tournament in January after missing since US Open due to a virus, defending titles alongside Lindsay Davenport and Anastasia Myskina while Lleyton Hewitt competes for the men's title with Carlos Moya."], "qwen2.5:3b": ["Olympic champion Justine Henin-Hardenne returns to action at Sydney International in January after a break due to a virus.", "She aims to defend her titles there and at the Australian Open.", "Other players include world number one Lindsay Davenport and French Open winner Anastasia Myskina.", "Men's event features Lleyton Hewitt defending his title, alongside Carlos Moya who had to retire with an injury in their final.", "The tournament runs from 9-15 January."], "opencoder:1.5b": ["Sydney return for Henin-Hardenne.", "The Olympic champion Justine Henin-Hardenne will return to action in January's Sydney International tournament.", "BELGIUM has not competed since losing her top world ranking at the US Open in September.", "She was beaten in the fourth round by Nadia Petrova.", "She took time out to shake off a virus but will defend her titles in Sydney and at the Australian Open.", "In the men's event, Lleyton Hewitt returns to defend his title with runner-up Carlos Moya.", "Moya, Spain's recent win over the US, had to retire due to an ankle injury in the first set of the final."], "smollm:1.7b": ["Sydney return for Henin-Hardenne\n\nJustine Henin-Hardenne will return to action in January's Sydney International tournament.", "3rd round: Nadia Petrova beats Lindsay Davenport at the US Open\n\nWomen's world number one Lindsay Davenport and French Open champion Anastasia Myskina will also compete.", "In the men's event, world number three Lleyton Hewitt returns to defend his title, along with runner-up Carlos Moya.", "2nd round: Carlos Moya is injured in the first set of the final at the Australian Open\n\nTournament director Craig Watson said: \"I had a message relayed to me from him after Spain's Davis Cup victory, saying he was looking forward to trying to make up for his disappointment in the (2004) final.", "The tournament will take place from 9-15 January.\""], "deepseek-r1:1.5b": ["Justine Henin-Hardenne will return from her US Open victory to compete in the Sydney International tournament and the Australian Open.", "She took time out to address a virus but defended her wins there and the Australian Open.", "Lleyton Hewitt and Carlos Moya are returning with Lleyton defending his title, while he needed a break due to an injury in the Davis Cup final.", "Lindsay Davenport and Anastasia Myskina also participate in women's singles at the event.", "The tournament will take place from January 9-15."], "tinyllama:1.1b": ["Sydney return for Justin Henin-Hardenne and Anaastasia Myskin, women's world champion Lindsay Daveport, and top seed Lleyton Heitz, among others, to participate in the Australian Open in January.", "The tournament will be held from 9th to 15th of January at the Sydney Olympic Park."], "tinydolphin:1.1b": [" Sydney International is set to bring back a number of top players for its January run, with notable names like Justine Henin-Hardenne and world number one Lindsay Davenport.", "This comes as the Belgian returns to the action after a long break, while Lleyton Hewitt defends his title in the men's event.", "In addition, former world number three Lleyton Hewitt will be joined by other rising stars, including Carlos Moya and Anastasia Myskina."], "phi:2.7b": [" Olympic champion Justine Henin-Hardenne will compete in Sydney International, defending her titles along with Lindsay Davenport and Anastasia Myskina.", "World number three Lleyton Hewitt also returns to defend his title, while Carlos Moya is competing for a chance to make up for his disappointment from the 2004 final."], "orca-mini:3b": [" Sydney International tournament will feature Olympic champion Justine Henin-Hardenne returning to action in January, along with defending titles in women's and men's events for Lindsay Davenport and Anastasia Myskina, respectively.", "The Australian Open is also scheduled to take place during the same time frame."], "hermes3:3b": ["Justine Henin-Hardenne, Olympic champion, returns at Sydney International (January), defending titles; Lleyton Hewitt also defends men's title."], "stablelm-zephyr:3b": ["Olympic champion Justine Henin-Hardenne returns to play in the Sydney International tournament in January, along with women's world number one Lindsay Davenport and French Open champion Anastasia Myskina.", "In the men's event, Lleyton Hewitt defends his title against runner-up Carlos Moya, who retired due to an ankle injury in the final of the recent Davis Cup.", "The tournament takes place from 9-15 January."], "chatgpt-4o-latest": ["Justine Henin-Hardenne will return to competition at the Sydney International in January after a break due to illness.", "She will defend her titles in Sydney and the Australian Open.", "Lindsay Davenport and Anastasia Myskina will also compete.", "In the men's event, Lleyton Hewitt will defend his title, with runner-up Carlos Moya also participating after recovering from an ankle injury.", "Tournament director Craig Watson confirmed Moya's eagerness to compete following Spain's Davis Cup victory.", "The tournament runs from 9-15 January."], "stablelm2:1.6b": ["Belgian tennis star Justine Henin-Hardenne will return to action at the Sydney International tournament in January after losing her top world ranking due to a virus.", "She'll defend titles in Sydney and Australian Open, along with women's world number one Lindsay Davenport and French Open champion Anastasia Myskina.", "Men's event features world number three Lleyton Hewitt and runner-up Carlos Moya, while the tournament director says he received encouragement from Moya after their US Davis Cup final defeat."], "granite3.1-dense:2b": ["Justine Henin-Hardenne, Olympic champion and former top-ranked player, will compete in Sydney International's women's event starting January 9-15.", "She aims to defend her titles after a virus sidelined her since the US Open fourth-round loss to Nadia Petrova in September.", "Henin-Hardenne, along with world number one Lindsay Davenport and French Open champion Anastasia Myskina, will participate.", "In the men's side, defending champion Lleyton Hewitt, ranked third, will return to defend his title, accompanied by runner-up Carlos Moya.", "Moya, who recently helped Spain win the Davis Cup final with a victory over the US, retired due to ankle injury during that match's first set.", "Tournament director Craig Watson mentioned Moya's anticipation of making amends for his 2004 Davis Cup final disappointment."]}