{"raw_text": "Roche 'turns down Federer offer'\n \n Australian tennis coach Tony Roche has turned down an approach from Roger Federer to be the world number one's new full-time coach, say reports.\n \n Melbourne's Herald-Sun said Roche, troubled by a hip complaint, did not want to travel full-time again. However, Roche is happy to work with the Swiss star on a casual basis and is helping him prepare for next month's defence of his Australian Open crown. Federer has been without a coach since splitting with Peter Lundgren in 2003. Roche, a former Davis Cup player for Australia, won the French Open, reached the Wimbledon and US Open finals and won five Wimbledon doubles titles with John Newcombe.\n \n He also coached former number one Ivan Lendl and Pat Rafter to Grand Slam victories and has worked with Australia's Lleyton Hewitt. Some reports claim Federer initially wanted Andre Agassi's Australian coach Darren Cahill, before Agassi confirmed he would play on in 2005. Federer was named Swiss sportsman of the year on Saturday, to add to the BBC overseas sportsman and European Sports Journalists Association awards he has already won.\n", "llama3.2:1b": ["Roche turns down Federer offer due to hip complaint; willing to work casually with Federer on Australian Open defence but does not want full-time travel."], "llama3.2:3b": ["Tony Roche turned down an offer from Roger Federer to be his full-time coach due to a hip complaint, but will work with him on a casual basis for next month's Australian Open defense."], "gemma2:2b": ["Tony Roche declined Roger Federer's offer for a full-time coaching position due to his hip complaint.", "Roche is happy to work with Federer on a casual basis ahead of the Australian Open.", "He previously coached successful athletes including Lendl and Rafter, winning Grand Slams."], "qwen2.5:0.5b": ["Australian tennis coach Tony Roche turned down an offer from Roger Federer to be a full-time coach for Roger Federer's Australian Open tour after Roche was troubled by a hip complaint and wanted to work with Federer on a casual basis instead."], "qwen2.5:1.5b": ["Australian tennis coach Tony Roche has declined to be Federer's full-time coach, citing a hip complaint while expressing interest in casual assistance for his preparations at next month's Australian Open.", "Roche previously worked with several players including Lendl and Rafter to Grand Slam victories.", "Federer was named Swiss sportsman of the year ahead of other awards."], "qwen2.5:3b": ["Australian tennis coach Tony Roche turned down Roger Federer's offer to be his full-time coach due to a hip complaint, preferring casual work and helping with preparation for the Australian Open.", "Roche, who coached Ivan Lendl and Pat Rafter among others, is happy to assist Federer on a part-time basis while Federer has been without a coach since 2003.", "Federer initially considered Andre Agassi's Australian coach Darren Cahill but later decided to play.", "Federer was named Swiss sportsman of the year recently."], "opencoder:1.5b": ["The Australian tennis coach Tony Roche turned down an approach from Roger Federer to become the world number one's new full-time coach.", "He helped prepare Federer for next month's defence of his Australian Open crown with a Swiss tournament win and won five Wimbledon doubles titles with John Newcombe."], "smollm:1.7b": ["Roche turned down Federer's offer to be his full-time coach because of a hip complaint."], "deepseek-r1:1.5b": ["Roche turns down Federer offer after deciding to coach instead.", "Roche, troubled by a hip complaint and unhappy with returning full-time, is willing to coach Fed casually but will travel part-time.", "Fed has had several coaches and won multiple Grand Slam titles.", "Some thought Fed wanted Darren Cahill as coach earlier but chose someone else.", "Fed recently received new sportsman awards for his achievements."], "tinyllama:1.1b": ["A report says Roche turned down an offer from Federer to be his full-time coach, citing his hip complaint as a reason for not wanting to travel the world again.", "Roche is still working with Federer on a casual basis and is helping him prepare for next month's Australian Open title defence.", "He has previously coached former number one Ivan Lendl, Pat Rafter and Lleyton Hewitt."], "tinydolphin:1.1b": [" Roche turns down offer from Federer for coach role"], "phi:2.7b": [" Roche turned down an offer from Roger Federer to be his full-time coach due to a hip complaint, but is still willing to work with him on a casual basis.", "Roche was a former Davis Cup player for Australia and coached Lendl, Rafter, Hewitt, Agassi, and won several major titles."], "orca-mini:3b": [" Australian tennis coach Tony Roche declined Roger Federer's offer to be the world number one's full-time coach due to a hip complaint.", "However, he is willing to work with Federer on a casual basis and has helped him prepare for next month's defense of his Australian Open crown.", "Federer had considered hiring Darren Cahill as his coach but ultimately decided against it."], "hermes3:3b": ["Tony Roche turns down Roger Federer's full-time coach offer but is willing to work with him casually."], "stablelm-zephyr:3b": ["Australian tennis coach Tony Roche declined Roger Federer's request to become his full-time coach.", "Although Roche is happy to work with Federer on a casual basis and help him prepare for the Australian Open, he turned down the offer due to a hip complaint and a desire to avoid full-time travel.", "Federer has been without a coach since splitting with Peter Lundgren in 2003.", "Roche has coached numerous players including Ivan Lendl, Pat Rafter, and Lleyton Hewitt, and also worked with Andre Agassi's Australian coach Darren Cahill before Agassi confirmed he would continue playing in 2005.", "Federer received the Swiss sportsman of the year award on Saturday, among other accolades."], "chatgpt-4o-latest": ["Tony Roche has declined Roger Federer's offer to be his full-time coach due to a hip issue and reluctance to travel extensively.", "However, he is assisting Federer on a casual basis as he prepares to defend his Australian Open title.", "Federer has been without a coach since parting ways with Peter Lundgren in 2003.", "Roche, a former Grand Slam champion and Davis Cup player, has coached top players like Ivan Lendl, Pat Rafter, and Lleyton Hewitt.", "Reports suggest Federer initially sought Darren Cahill, but he remained with Andre Agassi.", "Federer was recently named Swiss sportsman of the year, adding to his other accolades."], "stablelm2:1.6b": ["Australian tennis coach Tony Roche has declined an offer from Roger Federer to be his full-time coach due to health concerns.", "Roche is willing to work with Federer on a casual basis while helping him prepare for the Australian Open.", "Roche has previously coached Ivan Lendl, Pat Rafter, and Australia's Lleyton Hewitt.", "Federer initially considered Andre Agassi's Australian coach Darren Cahill before confirming he would play in the upcoming tournament."], "granite3.1-dense:2b": ["Tony Roche, a renowned Australian tennis coach and former Davis Cup player, declined an offer from Roger Federer to become his full-time coach due to health issues related to a hip condition that prevent him from traveling extensively.", "Despite this rejection, Roche agreed to work with Federer casually, aiding the Swiss tennis star in preparing for his upcoming Australian Open defense.", "This decision comes after Federer's previous coach, Peter Lundgren, parted ways with him in 2003.", "Roche's coaching experience includes mentoring high-profile players like Ivan Lendl and Pat Rafter to Grand Slam triumphs and serving as Hewitt's coach.", "There were initial discussions about Federer hiring Andre Agassi's Australian coach, Darren Cahill, but Agassi confirmed his return to coaching in 2005.", "Federer recently received the Swiss sportsman of the year award, adding to his other accolades from BBC overseas sportsman and European Sports Journalists Association."]}