{"raw_text": "Henman decides to quit Davis Cup\n \n Tim Henman has retired from Great Britain's Davis Cup team.\n \n The 30-year-old, who made his Davis Cup debut in 1994, is now set to fully focus on the ATP Tour and on winning his first Grand Slam event. \"I've made no secret of the fact that representing Great Britain has always been a top priority for me throughout my career,\" Henman told his website. Captain Jeremy Bates has touted Alex Bogdanovic and Andrew Murray as possible replacements for the veteran. Henman added that he was available to help Britain in its bid for Davis Cup success, with the next tie against Israel in March . \"Although I won't be playing, I would still like to make myself available to both Jeremy and the LTA in the future so that I can draw upon my experience in the hope of trying to help the British players develop their full potential,\" he added. \"I've really enjoyed playing in front of the thousands of British fans both home and abroad and would like to thank every one of them for their unwavering support over the years.\" Henman leaves Davis Cup tennis with an impressive record, having won 36 of his 50 matches. Great Britain captain Jeremy Bates paid tribute to Henman's efforts over the years.\n \n \"Tim has quite simply had a phenomenal Davis Cup career and it has been an absolute privilege to have captained the team with him in it,\" said Bates. \"Tim's magnificent record speaks for itself. While it's a great loss I completely understand and respect his decision to retire from Davis Cup and focus on the Grand Slams and Tour. \" \"Looking to the future this decision obviously marks a watershed in British Davis Cup tennis but it is also a huge opportunity for the next generation to make their mark. \"We have a host of talented players coming through and despite losing someone of Tim's calibre, I remain very optimistic about the future.\" Henman made his Davis Cup debut in 1994 against Romania in Manchester. He and partner Bates won their doubles rubber on the middle Saturday of the tie. Britain eventually lost the contest 3-2. Henman and Britain had little luck in Davis Cup matches until 1999 when they qualified for the World Group. Britain drew the USA and lost the tie when Greg Rusedski fell to Jim Courier in the deciding rubber. They made the final stages again, in 2002, but this time lost out to the might of Sweden.\n", "llama3.2:1b": ["Henman retires from Davis Cup team after 50 matches; will focus on ATP Tour and Grand Slam events.", "Retired captain Jeremy Bates names Alex Bogdanovic and Andrew Murray as possible replacements.", "Henman leaves behind an impressive record of 36-50 wins.", "Bates praises Henman's efforts over the years, calling his career \"phenomenal\"."], "llama3.2:3b": ["Tim Henman has retired from Great Britain's Davis Cup team at age 30 to focus on the ATP Tour and winning his first Grand Slam event.", "Captain Jeremy Bates has identified potential replacements, and Henman expressed willingness to help in the future.", "Henman leaves with an impressive record of 36 wins out of 50 matches, a phenomenal Davis Cup career and a legacy for future British players."], "gemma2:2b": ["Tim Henman has retired from Great Britain's Davis Cup team to focus on winning a Grand Slam event and playing the ATP Tour.", "He acknowledges his desire to help develop young British players for future success.", "He leaves with an impressive record of 36 wins in 50 matches.", "Captain Jeremy Bates expresses respect for Henman's decision, highlighting the potential for future generations to succeed."], "qwen2.5:0.5b": ["Henman will retire from Davis Cup after representing Great Britain for more than three decades.", "Key points:\n- Henman retired from Davis Cup in March.", "- He has been captain of the team for many years (30 years).", "- Henman made no secret about his desire to focus on Grand Slam events.", "- Former Davis Cup players Jeremy Bates and Andrew Murray are mentioned as possible replacements."], "qwen2.5:1.5b": ["Tim Henman, Great Britain's Davis Cup captain since 1994, decides to retire from the team effective immediately.", "He will focus on ATP Tour and Grand Slam events while preparing for a match against Israel in March."], "qwen2.5:3b": ["Tim Henman has retired from Great Britain's Davis Cup team.", "He will focus on ATP Tour and winning his first Grand Slam event.", "Henman made his debut in 1994 and won 36 of his 50 matches.", "Captain Jeremy Bates announced Alex Bogdanovic and Andrew Murray as possible replacements.", "Henman expressed willingness to help future British players despite retirement from Davis Cup.", "Great Britain captain Jeremy Bates praised Henman's career, noting it was a privilege to lead him.", "Despite Henman's departure, Bates sees potential for young talent in the team."], "opencoder:1.5b": ["\"Tim has quite simply had a phenomenal Davis Cup career and it has been an absolute privilege to have captained the team with him in it.\"", "\"Looking forward, this decision marks a watershed in British Davis Cup tennis but also presents exciting opportunities for the future.\""], "smollm:1.7b": ["The summary is concise and preserves key ideas and details.", "It captures the main points of the text without providing explanations or justifying them.", "The summary focuses on the main events and facts related to the topic, leaving out any supporting information or analysis."], "deepseek-r1:1.5b": ["Tim Henman retired from the Davis Cup in Great Britain, having made his debut in 1994.", "Focused on the ATP Tour and striving to win his first Grand Slam, he expressed thanks to Jeremy Bates for potential replacements.", "He offered availability for British players' development through future experiences.", "Henman has an impressive 36 wins out of 50 matches, and Jeremy Bates paid homage during a tribute to his past efforts.", "Their 1994 match saw Britain win doubles but lose the final rubber in their first appearance in Davis Cup."], "tinyllama:1.1b": ["Henman decides to quit Davis Cup after representing Great Britain for over two decades and being a vital part of their successes during his career.", "The tennis player announced his decision on his website, stating that he wanted to dedicate more time to the ATP Tour while also working on his Grand Slam campaign in preparation for his first big event.", "He was available to help Britain in their bid for Davis Cup success, with the next tie against Israel being of interest.", "Henman had an impressive record during his Davis Cup career and has been captaining Great Britain's team with distinction over years, with Tim leaving the sport with a fantastic record.", "The loss of one player from Great Britain's tennis team marks a watershed moment in the country's Davis Cup history.", "Despite losing someone of their caliber, there is immense talent coming through, and coaches are optimistic about the future.", "Henman made his debut in 1994 against Romania, winning their doubles rubber on the mid-day of the tie.", "He and partner Tim Batess won their doubles rubber in the match and were eventually knocked out by the USA and lost to Sweden during their World Group campaigns."], "tinydolphin:1.1b": [" [The] Davis Cup is a prestigious men's international tennis tournament that features both singles and doubles matches between national teams from around the world.", "In recent years, Great Britain has struggled to maintain its status as one of the dominant forces in the competition.", "This year marks the first time since 1999 that they have qualified for the World Group, but it remains to be seen whether they can successfully defend their title."], "phi:2.7b": [" Tim Henman has retired from Great Britain's Davis Cup team and plans to focus on his ATP Tour career and winning a Grand Slam event.", "He will still be available to help Britain succeed in future tournaments.", "Henman's record is impressive, with 36 wins out of 50 matches played.", "Great Britain captain Jeremy Bates pays tribute to Henman's efforts and sees the retirement as an opportunity for the next generation of British tennis players."], "orca-mini:3b": [" Tim Henman, a former British Davis Cup player, has decided to retire from the team due to personal reasons."], "hermes3:3b": ["Tim Henman quits Davis Cup team at age 30, focusing on Grand Slams; possible replacements Alex Bogdanovic and Andrew Murray; Bates praises Henman's career, optimistic about future British players despite loss."], "stablelm-zephyr:3b": ["Tim Henman has retired from Great Britain's Davis Cup team at the age of 30, focusing on the ATP Tour and winning his first Grand Slam event.", "Captain Jeremy Bates has suggested Alex Bogdanovic and Andrew Murray as potential replacements.", "Despite retiring from Davis Cup tennis, Henman remains available to help Britain in their future Davis Cup campaigns.", "His impressive record includes 36 wins out of 50 matches."], "chatgpt-4o-latest": ["Tim Henman has retired from Great Britain's Davis Cup team to focus on the ATP Tour and his pursuit of a Grand Slam title.", "Despite stepping away from playing, he remains available to support British tennis.", "Henman, who debuted in 1994, leaves with an impressive Davis Cup record of 36 wins in 50 matches.", "Captain Jeremy Bates praised Henman’s contributions and sees his retirement as an opportunity for younger players like Alex Bogdanovic and Andrew Murray.", "Henman played a key role in Britain's Davis Cup journey, including their 1999 and 2002 World Group appearances, though they fell short against the USA and Sweden."], "stablelm2:1.6b": ["Tim Henman has retired from the Davis Cup team, focusing on his ATP career and potential Grand Slam wins.", "Despite leaving the game, Henman remains available for future help with British players.", "He had an impressive record, having won multiple matches in the Davis Cup.", "Captain Jeremy Bates pays tribute to Henman's efforts, but acknowledges the loss as a great opportunity for the next generation."], "granite3.1-dense:2b": ["Tim Henman, at 30 years old, has announced his retirement from Great Britain's Davis Cup team to concentrate on the ATP Tour and pursuing a first Grand Slam event.", "Despite this, he will continue supporting the team in future ties.", "Henman, who made his debut in 1994, has won 36 out of 50 Davis Cup matches.", "British captain Jeremy Bates praised Henman's exceptional career and expressed optimism for the upcoming generation of players.", "The next Davis Cup tie against Israel is scheduled for March."]}