{"raw_text": "Minister digs in over doping row\n \n The Belgian sports minister at the centre of the Svetlana Kuznetsova doping row says he will not apologise for making allegations against her.\n \n Claude Eerdekens claims the US Open champion tested positive for ephedrine at an exhibition event last month. Criticised for making the announcement, he said: \"I will never apologise. This product is banned and it's up to her to explain why it's there.\" Kuznetsova says the stimulant may have been in a cold remedy she took. The Russian said she did nothing wrong by taking the medicine during the event. The Women's Tennis Association cleared Kuznetsova of any offence because the drug is not banned when taken out of competition.\n \n Eerdekens said he made the statement in order to protect the other three players that took part in the tournament, Belgian Justine Henin-Hardenne, Nathalie Dechy of France and Russia's Elena Dementieva. But Dechy is fuming that she has been implicated in the row. \"How can you be happy when you see your face on the cover page and talking about doping?\" Dechy said. \"I'm really upset about it and I think the Belgian government did a really bad job about this. \"I think we deserve an apology from the guy. You cannot say anything like this - you cannot say some stuff like this, saying it's one of these girls. This is terrible.\" Dementieva is also angry and says that Dechy and herself are the real victims of the scandal. \"You have no idea what I have been through all these days. It's been too hard on me,\" she said. \"The WTA are trying to handle this problem by saying there are three victims, but I see only two victims in this story - me and Nathalie Dechy, who really have nothing to do with this. \"To be honest with you, I don't feel like I want to talk to Sveta at all. I'm just very upset with the way everything has happened.\"\n", "llama3.2:1b": ["Belgian Minister Claude Eerdekens claims US Open champion Svetlana Kuznetsova tested positive for ephedrine at an exhibition event and refuses to apologize, saying it's up to her to explain why.", "Criticized for making the announcement, Eerdekens said he made it to protect other players implicated in a doping scandal.", "However, others are upset, including Justine Henin-Hardenne and Elena Dementieva, who believe they were unfairly targeted by the Belgian government's handling of the situation."], "llama3.2:3b": ["Belgian sports minister Claude Eerdekens refuses to apologize for alleging that US Open champion Svetlana Kuznetsova tested positive for ephedrine at an exhibition event, claiming she must explain why it was present.", "The Women's Tennis Association cleared Kuznetsova of wrongdoing as the drug is not banned when taken out of competition.", "Belgian Justine Henin-Hardenne and Russian Elena Dementieva are also implicated in the row and express outrage, with Dechy calling for an apology from Eerdekens."], "gemma2:2b": ["The Belgian sports minister made allegations that US Open champion Svetlana Kuznetsova tested positive for ephedrine, leading to criticism and a denial of apology by the minister.", "Kuznetsova maintains she took the banned stimulant in a cold remedy and was cleared by the Women's Tennis Association.", "Other players implicated in the row have expressed anger and demand an apology from the minister."], "qwen2.5:0.5b": ["Minister Eerdekens makes allegations against Russian tennis player Svetlana Kuznetsova over a doping-related incident."], "qwen2.5:1.5b": ["The Belgian sports minister denies apologizing for making doping allegations against Svetlana Kuznetsova and accuses her of taking ephedrine illegally.", "He defends three other players involved in a tournament, while his colleague Dechy is furious over involvement in the scandal.", "The WTA clears Kuznetsova but faces backlash from athletes and public opinion."], "qwen2.5:3b": ["Belgian sports minister Claude Eerdekens refuses to apologize for accusing Svetlana Kuznetsova of doping after she tested positive for ephedrine at an exhibition event.", "Eerdekens claims the stimulant may have been in a cold remedy Kuznetsova took.", "He made the announcement to protect other players who participated in the tournament, but they are angered and accuse him of unfairly implicating them.", "Players like Elena Dementieva and Nathalie Dechy feel victimized by Eerdekens' statement and criticize his handling of the situation."], "opencoder:1.5b": ["Minister digs in over doping row.", "The Belgian sports minister at the centre of the Svetlana Kuznetsova doping row says he will not apologise for making allegations against her.", "Claude Eerdekens claims the US Open champion tested positive for ephedrine at an exhibition event last month.", "Criticised for making the announcement, he said: \"I will never apologise.", "This product is banned and it's up to her to explain why it's there.\"", "Kuznetsova says the stimulant may have been in a cold remedy she took.", "The Russian said she did nothing wrong by taking the medicine during the event.", "The Women's Tennis Association cleared Kuznetsova of any offence because the drug is not banned when taken out of competition.", "Eerdekens said he made the statement in order to protect the other three players that took part in the tournament, Belgian Justine Henin-Hardenne, Nathalie Dechy of France and Russia's Elena Dementieva.", "But Dechy is fuming that she has been implicated in the row.", "\"How can you be happy when you see your face on the cover page and talking about doping?\"", "Dechy said.", "\"I'm really upset about it and I think the Belgian government did a really bad job about this.", "\"I think we deserve an apology from the guy.", "You cannot say anything like this - you cannot say some stuff like this, saying it's one of these girls.", "This is terrible.\"", "Dementieva is also angry and says that Dechy and herself are the real victims of the scandal.", "\"You have no idea what I have been through all these days.", "It's been too hard on me,\" she said.", "\"The WTA are trying to handle this problem by saying there are three victims, but I see only two victims in this story - me and Nathalie Dechy, who really have nothing to do with this.", "\"To be honest with you, I don't feel like I want to talk to Sveta at all.", "I'm just very upset with the way everything has happened.\""], "smollm:1.7b": ["The Belgian sports minister at the centre of the doping row is accused by a US Open champion of making allegations against her.", "The minister claims she will not apologize for making these allegations, saying she will never apologize for taking the drug during an exhibition event last month.", "The US Open champion Sveta Kuznetsova said she did nothing wrong by taking the drug when it was out of competition and that she would never apologize for doing so.", "The Belgian sports minister at the centre of the doping row is accused by a US Open champion of making allegations against her.", "The minister claims she will not apologize for making these allegations, saying she will never apologize for taking the drug during an exhibition event last month.", "The US Open champion Sveta Kuznetsova said she did nothing wrong by taking the drug when it was out of competition and that she would never apologize for doing so.", "The Belgian sports minister at the centre of the doping row is accused by a US Open champion of making allegations against her.", "The minister claims she will not apologize for making these allegations, saying she will never apologize for taking the drug during an exhibition event last month.", "The US Open champion Sveta Kuznetsova said she did nothing wrong by taking the drug when it was out of competition and that she would never apologize for doing so.", "The Belgian sports minister at the centre of the doping row is accused by a US Open champion of making allegations against her.", "The minister claims she will not apologize for making these allegations, saying she will never apologize for taking the drug during an exhibition event last month.", "The US Open champion Sveta Kuznetsova said she did nothing wrong by taking the drug when it was out of competition and that she would never apologize for doing so.", "The Belgian sports minister at the centre of the doping row is accused by a US Open champion of making allegations against her.", "The minister claims she will not apologize for making these allegations, saying she will never apologize for taking the drug during an exhibition event last month.", "The US Open champion Sveta Kuznetsova said she did nothing wrong by taking the drug when it was out of competition and that she would never apologize for doing so.", "The Belgian sports minister at the centre of the doping row is accused by a US Open champion of making allegations against her.", "The minister claims she will not apologize for making these allegations, saying she will never apologize for taking the drug during an exhibition event last month.", "The US Open champion Sveta Kuznetsova said she did nothing wrong by taking the drug when it was out of competition and that she would never apologize for doing so.", "The Belgian sports minister at the centre of the doping row is accused by a US Open champion of making allegations against her.", "The minister claims she will not apologize for making these allegations, saying she will never apologize for taking the drug during an exhibition event last month.", "The US Open champion Sveta Kuznetsova said she did nothing wrong by taking the drug when it was out of competition and that she would never apologize for doing so.", "The Belgian sports minister at the centre of the doping row is accused by a US Open champion of making allegations against her.", "The minister claims she will not apologize for making these allegations, saying she will never apologize for taking the drug during an exhibition event last month.", "The US Open champion Sveta Kuznetsova said she did nothing wrong by taking the drug when it was out of competition and that she would never apologize for doing so.", "The Belgian sports minister at the centre of the doping row is accused by a US Open champion of making allegations against her.", "The minister claims she will not apologize for making these allegations, saying she will never apologize for taking the drug during an exhibition event last month.", "The US Open champion Sveta Kuznetsova said she did nothing wrong by taking the drug when it was out of competition and that she would never apologize for doing so.", "The Belgian sports minister at the centre of the doping row is accused by a US Open champion of making allegations against her.", "The minister claims she will not apologize for making these allegations, saying she will never apologize for taking the drug during an exhibition event last month.", "The US Open champion Sveta Kuznetsova said she did nothing wrong by taking the drug when it was out of competition and that she would never apologize for doing so."], "deepseek-r1:1.5b": ["The Belgian sports minister Siegfried Deems is under investigation for allegations against Svetlana Kuznetsova, while Claude Eerdekens criticized her at an US Open event about testing positive for ephedrine.", "The Women's Tennis Association clarified that ephedrine isn't banned in sports settings but should be avoided outside of them."], "tinyllama:1.1b": ["Minister Eerdekens from Belgium made a statement over an allegation that Svetlanna Kuznetsova, who won the US Open in 2013, tested positive for the stimulant ephedrin during an exhibition event.", "This sparked controversy over whether she was guilty of committing doping offence.", "The minister claimed that \"I will never apologize\" and stated that this drug is banned but Kuznetsova took it during a tournament where there were other players taking part.", "Eerdekens said this to protect the other three players involved in the event, including Belgian tennis star Justinine Henin-Hardenne, French player Nathalie Dechy, and Russian tennis player Eleena Dementiev.", "The minister has been criticized for making these claims, with Demetiuvae saying that Eerdekens should issue a public apology to all three victims of the scandal."], "tinydolphin:1.1b": [" The Belgian sports minister, Claude Eerdekens, is facing backlash over his comments about US Open tennis player Svetlana Kuznetsova's use of doping during an exhibition event last month.", "Eerdekens claimed that Kuznetsova tested positive for the banned stimulant ephedrine, but Kuznetsova has denied the allegations.", "The incident has led to a heated debate about the integrity of sports competitions and the use of performance enhancing substances in professional athletes."], "phi:2.7b": [" The Belgian sports minister claims a US Open champion tested positive for a banned substance during an exhibition event last month.", "He made the announcement, saying he will not apologize and that it is up to the athlete to explain why the stimulant was in her system.", "Kuznetsova says she did nothing wrong by taking medication containing ephedrine, which is not banned when taken outside of competition.", "The Women's Tennis Association cleared her of any offence, but Dechy and Dementieva have both expressed their anger and disappointment at being involved in the scandal."], "orca-mini:3b": [" The Belgian sports minister, Claude Eerdekens, made allegations against Russian tennis player Svetlana Kuznetsova, saying she tested positive for ephedrine during an exhibition event.", "Kuznetsova says the stimulant may have been in a cold remedy she took and that she did nothing wrong.", "The Women's Tennis Association cleared Kuznetsova of any offense because the drug is not banned when taken out of competition.", "The row has led to complaints from other players involved in the tournament, with one calling for an apology from Eerdekens."], "hermes3:3b": ["Kuznetsova doping allegations: Belgian sports minister Claude Eerdekens refuses to apologise for accusing tennis player Svetlana Kuznetsova of testing positive for ephedrine, despite WTA clearing her."], "stablelm-zephyr:3b": ["Belgian sports minister Claude Eerdekens refuses to apologize for allegations against Svetlana Kuznetsova over her testing positive for ephedrine at an exhibition event.", "Kuznetsova argues the drug may have been in a cold remedy she took, and the Women's Tennis Association cleared her of any offense as the drug is not banned out of competition.", "Both Kuznetsova and her teammates accused of doping, with Elena Dementieva claiming she and Nathalie Dechy are victims of the scandal.", "The Belgian government faces criticism over its handling of the situation."], "chatgpt-4o-latest": ["Belgian sports minister Claude Eerdekens refuses to apologise for alleging that Svetlana Kuznetsova tested positive for ephedrine at an exhibition event, insisting it is a banned substance and up to her to explain.", "Kuznetsova claims the stimulant was in a cold remedy and was cleared by the Women's Tennis Association since the drug is not banned out of competition.", "Eerdekens says he acted to protect other players, but Nathalie Dechy and Elena Dementieva are outraged, feeling unfairly implicated.", "Dechy demands an apology, while Dementieva insists they are the real victims and expresses anger towards Kuznetsova."], "stablelm2:1.6b": ["Belgian sports minister Claude Eerdekens denies apologizing for allegations of doping against champion Svetlana Kuznetsova, claiming that a banned ephedrine found in her possession may have been part of a cold remedy.", "The Women's Tennis Association cleared Kuznetsova due to the drug not being banned when taken out of competition.", "Belgian players Justine Henin-Handreama and Nathalie Dechy were implicated but are upset about their involvement, while Russia's Elena Dementieva claims they are the real victims in this scandal."], "granite3.1-dense:2b": ["Belgian sports minister Claude Eerdekens maintains his stance on doping allegations against tennis player Svetlana Kuznetsova, who tested positive for ephedrine at an exhibition event.", "Eerdekens argues the banned substance's presence is Kuznetsova's responsibility to explain.", "Kuznetsova claims the drug was in a cold remedy she took during the tournament.", "The Women's Tennis Association cleared her, as ephedrine is not banned for use outside competition.", "Fellow Belgian players Justine Henin-Hardenne and Nathalie Dechy of France, along with Russian Elena Dementieva, feel wronged by the allegations.", "Dechy and Dementieva are particularly upset, asserting they were unfairly implicated in the scandal and calling for an apology from Eerdekens.", "They both claim the incident has caused significant distress due to the public accusation."]}