{"raw_text": "China net cafe culture crackdown\n \n Chinese authorities closed 12,575 net cafes in the closing months of 2004, the country's government said.\n \n According to the official news agency most of the net cafes were closed down because they were operating illegally. Chinese net cafes operate under a set of strict guidelines and many of those most recently closed broke rules that limit how close they can be to schools. The move is the latest in a series of steps the Chinese government has taken to crack down on what it considers to be immoral net use.\n \n The official Xinhua News Agency said the crackdown was carried out to create a \"safer environment for young people in China\". Rules introduced in 2002 demand that net cafes be at least 200 metres away from middle and elementary schools. The hours that children can use net cafes are also tightly regulated. China has long been worried that net cafes are an unhealthy influence on young people. The 12,575 cafes were shut in the three months from October to December. China also tries to dictate the types of computer games people can play to limit the amount of violence people are exposed to.\n \n Net cafes are hugely popular in China because the relatively high cost of computer hardware means that few people have PCs in their homes. This is not the first time that the Chinese government has moved against net cafes that are not operating within its strict guidelines. All the 100,000 or so net cafes in the country are required to use software that controls what websites users can see. Logs of sites people visit are also kept. Laws on net cafe opening hours and who can use them were introduced in 2002 following a fire at one cafe that killed 25 people. During the crackdown following the blaze authorities moved to clean up net cafes and demanded that all of them get permits to operate. In August 2004 Chinese authorities shut down 700 websites and arrested 224 people in a crackdown on net porn. At the same time it introduced new controls to block overseas sex sites. The Reporters Without Borders group said in a report that Chinese government technologies for e-mail interception and net censorship are among the most highly developed in the world.\n", "llama3.2:1b": ["Chinese authorities closed 12,575 net cafes due to operating illegally.", "They were shut down because they broke guidelines on proximity to schools, hours of operation, and computer game content.", "The crackdown aims to create a safer environment for young people in China, where many have limited access to PCs at home."], "llama3.2:3b": ["Chinese authorities closed 12,575 net cafes between October and December 2004 due to operating illegally.", "Most were shut down because they broke rules limiting proximity to schools.", "The crackdown aims to create a \"safer environment for young people\" by regulating computer game content, controlling net cafe hours, and monitoring website access."], "gemma2:2b": ["China shut down 12,575 illegal internet cafes in late 2004 as part of ongoing efforts to curb what it considers \"immoral\" internet use.", "The crackdown, targeting cafes for operating illegally and violating distance regulations from schools, aims to create a safer environment for young people.", "This follows prior actions by the Chinese government, including software controls on websites and restricted access to violent computer games."], "qwen2.5:0.5b": ["China authorities have closed 12,575 net cafes due to operating illegally.", "These establishments operate under strict guidelines and many have broken rules limiting their proximity to schools.", "The move is part of a series of steps by Chinese government officials aimed at promoting a \"safer environment for young people.\"", "China has long been concerned about the negative influence of net cafes, particularly on children's access to violent websites.", "The authorities also imposed regulations requiring all net cafes to obtain permits and comply with specific hours for their usage.", "In August 2004, Chinese authorities shut down several websites and arrested a large number of people in response to a fire at one cafe, which had resulted in the deaths of 25 people."], "qwen2.5:1.5b": ["China closed 12,575 illegal internet cafes over the last three months due to concerns about their influence on young people, following strict guidelines banning them near schools and regulating hours of use.", "The crackdown aims to create a safer environment for youth.", "Additionally, regulations limit computer game types, and laws are enforced on opening hours and who can enter."], "qwen2.5:3b": ["Chinese authorities closed 12,575 net cafes between October and December 2004 due to illegal operations, mainly because they were located too close to schools.", "The move is part of efforts by the Chinese government to create a \"safer environment\" for young people, adhering to strict rules such as being at least 200 meters away from schools and regulating usage hours.", "Net cafes are popular in China due to high computer hardware costs making home PCs uncommon.", "This closure follows previous crackdowns on unlicensed net cafes and censorship of online content, with the government now blocking overseas sex sites."], "opencoder:1.5b": ["China's net cafe culture crackdown has been a significant effort to control illegal activities within the city.", "It involves closing several 12,575 retail businesses, with the goal of creating a safer and more open environment for citizens.", "The crackdown was carried out over the course of three months in October and December, marking the culmination of efforts aimed at building public trust and promoting responsible living and culture within the city."], "smollm:1.7b": ["China's net cafes were closed down because they operated illegally, according to the official news agency Xinhua News Agency.", "The crackdown was carried out by the government to create a safer environment for young people in China.", "Rules introduced in 2002 require that net cafes be at least 200 meters away from middle and elementary schools.", "The hours that children can use net cafes are also tightly regulated.", "China tries to dictate the types of computer games people can play to limit the amount of violence they are exposed to, according to the official news agency Xinhua News Agency.", "All the 100,000 or so net cafes in China are required to use software that controls what websites users can see.", "Logs of sites people visit are also kept by authorities.", "Laws on net cafe opening hours and who can use them were introduced in 2002 following a fire at one cafe that killed 25 people.", "During the crackdown following the blaze authorities moved to clean up net cafes and arrested 224 people in a crackdown on net porn.", "At the same time it introduced new controls to block overseas sex sites.", "The Reporters Without Borders group said in a report that Chinese government technologies for e-mail interception and net censorship are among the most highly developed in the world."], "deepseek-r1:1.5b": ["The Chinese government closed 12,575 net cafes between October and December 2004 due to strict guidelines that many were operating illegally.", "The move aimed to create a safer environment for young people by being far from schools and limiting their use of these cafes.", "Young users argue this harms their education and health.", "The regulations enforced require net cafes to be at least 200 meters away from middle and elementary schools and restrict children's hours of use.", "Many cafes were shut as they didn't follow these guidelines, raising concerns about promoting healthy online content.", "Net cafes are popular in China due to high costs of computer hardware, with few people having PCs at home.", "However, the government enforces strict rules on net cafe operations, including software controls and logging of site visits.", "Laws on opening hours and who can use them were introduced in 2002 following a fire that killed 25 people.", "In 2004, authorities also shut down 700 websites and arrested 224 people for net porn, introducing new control measures against overseas sex sites.", "The Reporters Without Borders group noted China's advanced e-mail interception and net censorship technologies.", "Overall, the crackdown targets non-compliant net cafes to enforce stricter guidelines, focusing on games and online content."], "tinyllama:1.1b": ["Le ministère chinois a fermé 12,575 netz cafés au troisième trimestre 2004, selon le journal officiel de la Chine, Xinhua News Agency.", "Les netzes ont été fermées en raison de leur utilisation illégale, les règles strictes imposées et les netzes qui s'enroulent trop près des écoles moyennes sont également interdites.", "Le ministère a imposé des heures d'arrêt pour les netzes de 200 mètres depuis le 1er octobre à 19 heures, les jours fériés et la plupart des semaines fériées.", "Les netzes ont été fermés pour limiter l'influence immoral des netzes sur les jeunes gens, qui ont commencé à utiliser ces netzes en 2002.", "Le gouvernement chinois a également réprimandé de nouveau la vente d'ordinateurs et de netz cafés à des emplois inférieurs à 250 millions de yuan (environ 46,8 million d’euros) par an.", "En 2002, il était requis de disposer de logiciels contrôlant les sites web qui visaient certaines villes, ainsi qu'au cas où des cafés nettaient leurs logos à l’annonce des offres de netz.", "Le gouvernement a imposé un arrêté de déclaration d’activité pour tous les 100 000 cafés numériques en Chine, et ils sont maintenus dans le contrôle du temps de visite et des sites visités lors de la fermeture, ainsi que la rémunération de l’employeur au cas où une ville a demandé à nettairer ses logos.", "La répression officielle chinoise contre les netzes est un développement très hautement développé dans le monde numérique."], "tinydolphin:1.1b": [" China's crackdown on unlicensed net cafes has been a significant step to protect children from harmful online activities, according to an official news agency report.", "The authorities closed 12,575 net cafes, operating within strict guidelines and many of which had been established recently, as part of the ongoing effort to limit immoral online use in China.", "Many of these most recent closures broke off from schools, while others were found in areas where children have traditionally used such facilities.", "The crackdown is seen by Chinese authorities as a necessary step to create a safer environment for young people in China, who are increasingly exposed to the unhealthy influence of online activities.", "The officials mentioned that these closures would significantly impact the lives of thousands of net cafe owners and employees.", "They also cited the need to protect children from unregulated online content and the significant economic burden imposed on the industry.", "The official Xinhua News Agency described the crackdown as a step towards creating \"a safer environment for young people in China\".", "The authorities aimed to create a \"safe environment\" by restricting access to certain websites, limiting the time children can use the internet, and introducing stricter regulations on what types of computer games are played."], "phi:2.7b": [" China's government closed 12,575 illegal net cafes due to their close proximity to schools.", "The crackdown aimed to create a safer environment for young people and limit immoral internet use.", "China has strict rules on how close cafes can be to schools and what types of computer games are allowed.", "Net cafes are popular in China because they are relatively cheap and many people don't have PCs at home.", "The government also controls websites by requiring the use of software that limits access to certain sites and keeping logs of internet activity.", "Laws were introduced to control opening hours and users after a fire at one cafe killed 25 people in"], "orca-mini:3b": [" China shut down 12,575 net cafes in the closing months of 2004 due to illegal operations.", "The move was part of a crackdown on immoral net use that aims to create a safer environment for young people in China.", "Rules introduced in 2002 demand that net cafes be at least 200 meters away from middle and elementary schools, and the hours that children can use them are tightly regulated.", "The Chinese government also tries to limit the types of computer games people can play to reduce violence they are exposed to.", "All net cafes in China must get permits to operate, and in August 2004, Chinese authorities shut down 700 websites and arrested 224 people in a crackdown on net porn.", "They also introduced new controls to block overseas sex sites."], "hermes3:3b": ["China closed 12,575 net cafes for breaking illegal operating rules, mainly because they were too close to schools to create a safer environment for young people."], "stablelm-zephyr:3b": ["In 2004, Chinese authorities closed 12,575 net cafes due to them operating illegally and violating strict guidelines.", "The crackdown aimed to create a safer environment for young people by limiting their proximity to schools and regulating hours of use.", "China also tries to control the types of computer games and limit exposure to violent content.", "All net cafes are required to use software controlling website access and maintain logs of visited sites.", "This is not the first time the Chinese government has targeted net cafes that do not follow guidelines, as seen in previous crackdowns on net porn and overseas sex sites."], "stablelm2:1.6b": ["Chinese authorities closed over 1,0..", "In late 204, Chinese officials closed more than 1,000 net cafes due to their operations being illegal.", "The majority were shut down because they were too close to schools as per strict guidelines.", "This crackdown follows a series of measures taken by the Chinese government to control internet use.", "Among these rules are requirements that net cafes be at least 2 meters away from middle and elementary schools, and tight regulation on hours children can use the cafes.", "The aim is to create a \"safer environment for young people in China\".", "The closure occurred during October-December when more than 1,000 net cafes were shut down.", "These were among all the or so required by law in China to operate with software that controls what websites users can see.", "Logs of sites people visit are also kept.", "In 2020, laws on net cafe opening hours and who can use them were introduced following a fire at one cafe that killed several people.", "During the crackdown following the blaze, authorities sought to clean up net cafes and demanded all their operations get permits.", "In August 204, Chinese officials shut down websites and arrested some people in a crackdown on net porn, while they also introduced new controls to block overseas sex sites.", "The Reporters Without Borders group noted that Chinese government technologies for email interception and internet censorship are among the most advanced in the world."], "granite3.1-dense:2b": ["In late 2004, China's authorities closed 12,575 internet cafes due to illegal operations, violating rules mandated by 2002 that require them to be at least 200 metres from schools and restrict children's usage hours.", "This crackdown aimed to protect young people from perceived harmful effects of internet cafes.", "The Chinese government maintains strict control over net cafes, mandating software forbidding access to certain websites, logging user visits, and regulating opening times and visitor eligibility following a 2002 fire that killed 25 people.", "This is not the first time China has addressed non-compliant net cafes; previous actions included shutting down 100,000 cafes for permits in 2002 after the fire.", "In August 2004, authorities also shut down 700 pornographic websites and arrested 224 individuals to combat online sexual content.", "The Reporters Without Borders noted that China's internet surveillance and censorship technologies are among the most advanced globally."], "chatgpt-4o-latest": ["Chinese authorities closed 12,575 internet cafes in late 2004, citing illegal operations and violations of strict regulations, such as proximity to schools.", "The crackdown aimed to create a \"safer environment\" for young people, with rules limiting children's access and restricting violent computer games.", "Internet cafes are popular in China due to the high cost of home computers, but all 100,000 cafes must use software to control website access and log user activity.", "Previous crackdowns followed a deadly fire in 2002, leading to stricter regulations.", "In August 2004, authorities shut down 700 websites and arrested 224 people in an anti-pornography campaign.", "Reporters Without Borders noted that China's internet censorship and surveillance technologies are among the most advanced in the world."]}