{"raw_text": "Microsoft seeking spyware trojan\n \n Microsoft is investigating a trojan program that attempts to switch off the firm's anti-spyware software.\n \n The spyware tool was only released by Microsoft in the last few weeks and has been downloaded by six million people. Stephen Toulouse, a security manager at Microsoft, said the malicious program was called Bankash-A Trojan and was being sent as an e-mail attachment. Microsoft said it did not believe the program was widespread and recommended users to use an anti-virus program. The program attempts to disable or delete Microsoft's anti-spyware tool and suppress warning messages given to users.\n \n It may also try to steal online banking passwords or other personal information by tracking users' keystrokes.\n \n Microsoft said in a statement it is investigating what it called a criminal attack on its software. Earlier this week, Microsoft said it would buy anti-virus software maker Sybari Software to improve its security in its Windows and e-mail software. Microsoft has said it plans to offer its own paid-for anti-virus software but it has not yet set a date for its release. The anti-spyware program being targeted is currently only in beta form and aims to help users find and remove spyware - programs which monitor internet use, causes advert pop-ups and slow a PC's performance.\n", "llama3.2:1b": ["Microsoft is investigating a Trojan program called Bankash-A Trojan that attempts to disable or delete its anti-spyware tool and steal personal information by tracking keystrokes.", "The program has been downloaded by 6 million people and may also cause online banking password theft.", "Microsoft plans to offer its own paid-for anti-virus software but has not yet set a date for release."], "llama3.2:3b": ["Microsoft investigating Bankash-A Trojan that disables anti-spyware software, attempts to steal online banking passwords and personal info by tracking keystrokes.", "The program was released in the last few weeks and downloaded by 6 million people, mainly via email attachments."], "gemma2:2b": ["Microsoft is investigating a trojan program called Bankash-A Trojan that disables its anti-spyware software and attempts to steal personal information.", "The program was delivered as an email attachment and downloaded by six million people.", "Microsoft believes it is not widespread, recommending users use anti-virus programs."], "qwen2.5:0.5b": ["Microsoft plans to investigate the Bankash-A Trojan, an e-mail attachment that tries to disable Microsoft's anti-spyware software and attempt to steal online banking passwords or other personal information.", "The company is investigating a criminal attack on its software and plans to offer its own paid-for anti-virus software."], "qwen2.5:1.5b": ["Microsoft investigates Trojan attempting to disable anti-spyware software, potentially stealing personal information; recommends using an anti-virus program instead."], "qwen2.5:3b": ["Microsoft investigating Bankash-A Trojan trojan that disables the company’s anti-spyware software.", "Released recently and downloaded by six million, it sends e-mail attachments aimed at stealing online banking passwords or personal information.", "Microsoft recommends using an anti-virus program; it is believed not widespread but criminal in nature.", "The company plans to offer paid-for anti-virus software for Windows and email, though a release date has not been set.", "Currently in beta, the targeted anti-spyware aims to detect and remove spyware programs."], "opencoder:1.5b": ["Microsoft is investigating a trojan program that attempts to switch off the firm's anti-spyware software.", "The spyware tool was released by Microsoft in the last few weeks and has been downloaded by six million people.", "Stephen Toulouse, a security manager at Microsoft, reported that the malicious program was called Bankash-A Trojan and was sent as an e-mail attachment.", "Microsoft recommended users to use an anti-virus program.", "The program is designed to disable or delete Microsoft's anti-spyware tool and suppress warning messages.", "It may also attempt to steal online banking passwords or other personal information by tracking keystrokes.", "Microsoft has said it is investigating a criminal attack on its software earlier this week, with plans to buy Sybari Software to improve security in its systems."], "smollm:1.7b": ["Microsoft is investigating a trojan program that attempts to switch off the firm's anti-spyware software.", "The malicious software was only released by Microsoft in the last few weeks and has been downloaded by six million people.", "Stephen Toulouse, a security manager at Microsoft, said the program was called Bankash-A Trojan and was being sent as an e-mail attachment.", "Microsoft did not believe the program was widespread and recommended users to use an anti-virus program.", "The program attempts to disable or delete Microsoft's anti-spyware tool and suppress warning messages given to users.", "Microsoft said in a statement it is investigating what it called a criminal attack on its software.", "Earlier this week, Microsoft said it would buy anti-virus software maker Sybari Software to improve its security in its Windows and e-mail software.", "Microsoft has said it plans to offer its own paid-for anti-virus software but it has not yet set a date for its release.", "The anti-spyware program being targeted is currently only in beta form and aims to help users find and remove spyware - programs which monitor internet use, causes advert pop-ups and slow a PC's performance."], "deepseek-r1:1.5b": ["Microsoft is investigating a spyware trojan targeting its anti-spyware software.", "The malicious program, named Bankash-A Trojan, was distributed in the last few weeks by six million users.", "Microsoft claims it's unaware of widespread use and advises users to use an anti-virus tool.", "The tool attempts to disable or delete Microsoft's software and suppress warnings.", "Microsoft plans to purchase Sybari Software and may release their own paid antivirus.", "Currently, it's beta-form, designed to help users manage spyware through monitoring internet use."], "tinyllama:1.1b": ["Microsoft has discovered a trojan program that attempts to disable its anti-spyware tool by switching off the user's software.", "The Bankash Trojan, as Microsoft calls it, is being sent in e-mail attachments and may attempt to steal online banking passwords or other personal information.", "Microsoft said the program is being investigated as a criminal attack on its software.", "Earlier this week, Microsoft announced plans to provide paid-for anti-virus software but has not yet set a release date.", "Meanwhile, the anti-spyware program in beta form aims to help users find and remove spyware programs that monitor internet use and cause advert pop-ups and slow a PC's performance."], "tinydolphin:1.1b": [" Microsoft is investigating a trojan program that attempts to switch off the firm's anti-spyware software.", "The malicious tool was only released last few weeks by Microsoft in an attempt to deceive users who have downloaded it.", "The spyware program, known as Bankash-A, is being sent as an email attachment and has been downloaded by six million individuals.", "Microsoft claimed the program appears to be a criminal attack on its software.", "It could potentially steal online banking passwords or other personal information if users follow inappropriate commands made by the program.", "The company is investigating whether it was intentional or unintentional, and how this malware may have affected users' computer systems or their overall security."], "phi:2.7b": [" Microsoft is investigating a Trojan program called Bankash-A Trojan that has been downloaded by six million people.", "It attempts to disable or delete Microsoft's anti-spyware tool and suppress warning messages given to users.", "The program may also try to steal online banking passwords or other personal information by tracking users' keystrokes."], "orca-mini:3b": [" Microsoft is investigating a trojan program that attempts to switch off its anti-spyware software.", "The program was only released recently and has been downloaded by six million people.", "It tries to disable or delete Microsoft's anti-spyware tool and suppress warning messages given to users.", "The program may also steal online banking passwords or other personal information by tracking users' keystrokes.", "Microsoft is investigating a criminal attack on its software.", "The company plans to release paid-for anti-virus software, but it has not yet set a date.", "The targeted anti-spyware program is currently in beta form and aims to help users find and remove spyware that causes ads and slows down a PC's performance."], "hermes3:3b": ["Microsoft discovering spyware (Bankash-A Trojan) that tries to disable anti-virus/anti-spyware software, potentially stealing banking info & user data."], "stablelm-zephyr:3b": ["Microsoft is investigating a Bankash-A Trojan spyware program that attempts to disable its anti-spyware software and potentially steal online banking passwords or personal information.", "The malicious program was released recently and has been downloaded by six million people; however, Microsoft does not believe it is widespread.", "It recommends users to use an anti-virus program.", "The company is also investing in improving its security by purchasing anti-virus software maker Sybari Software."], "stablelm2:1.6b": ["Microsoft investigates a malware program that targets their anti-spyware software, called Bankash- A Trojan.", "Created by six million downloads, it was sent as an email attachment.", "Despite not being widespread, the malicious code aims to disable or delete Microsoft's anti-spyware tool and suppress warning messages.", "It also tries to steal online banking passwords or other personal information by tracking users' keystrokes.", "The malware is part of a criminal attack on Microsoft software, and Microsoft plans to offer its own paid-for anti-virus software.", "The anti-spyware program aims to assist users in finding and removing spyware programs that monitor internet use, display pop-up ads, and slow down computer performance."], "granite3.1-dense:2b": ["Microsoft is investigating a newly released trojan called Bankash-A Trojan, which targets its anti-spyware software.", "Distributing via email attachments, this malicious program aims to disable Microsoft's anti-spyware tool, suppress warnings, and potentially steal online banking details or personal information by tracking keystrokes.", "Microsoft, which plans to integrate Sybari Software for enhanced security in Windows and e-mail, views this as a criminal attack on its software.", "The targeted anti-spyware program is currently in beta, designed to locate and remove spyware that monitors internet use, generates pop-ups, and degrades PC performance."], "chatgpt-4o-latest": ["Microsoft is investigating the Bankash-A Trojan, a malicious program that attempts to disable or delete its recently released anti-spyware software.", "The trojan, sent as an email attachment, may also steal online banking passwords by tracking keystrokes.", "Microsoft stated the attack is not widespread and advised users to use anti-virus software.", "The company is also acquiring Sybari Software to enhance security in Windows and email software and plans to offer its own paid anti-virus software in the future.", "The targeted anti-spyware tool is still in beta and helps users detect and remove spyware."]}