{"raw_text": "Technology gets the creative bug\n \n The hi-tech and the arts worlds have for some time danced around each other and offered creative and technical help when required.\n \n Often this help has come in the form of corporate art sponsorship or infrastructure provision. But that dance is growing more intimate as hi-tech firms look to the creative industries for inspiration. And vice versa. UK telco BT is serious about the idea and has launched its Connected World initiative. The idea, says BT, is to shape a \"21st Century model\" which will help cement the art, technology, and business worlds together. \"We are hoping to understand the creative industry that has a natural thirst for broadband technology,\" said Frank Stone, head of the BT's business sector programmes. He looks after several \"centres of excellence\" which the telco has set up with other institutions and organisations, one of which is focused on creative industries.\n \n To mark the initiative's launch, a major international art installation is to open on 15 April in Brussels, with a further exhibit in Madrid later in the summer. They have both been created using the telco's technology that it has been incubating at its research and development arm, including a sophisticated graphics rendering program. Using a 3D graphics engine, the type commonly used in gaming, Bafta-winning artists Langlands & Bell have created a virtual, story-based, 3D model of Brussels' Coudenberg Cellars.\n \n They have recently been excavated and are thought to be the remnants of Coudenberg Palace, an historical seat of European power. The 3D world can be navigated using a joystick and offers an immersive experience of a landscape that historically had a river running through it until it was bricked up in the 19th Century. \"The river was integral to the city's survival for hundreds of years and it was equally essential to the city that it disappeared,\" said the artists. \"We hope that by uncovering the river, we can greater understand the connections between the past and the present, and appreciate the flow of modernity, once concealing, but now revealing the River Senne.\" In their previous works they used the Quake game graphics engine. The game engine is the core component of a video game because it handles graphics rendering, game AI, and how objects behave and relate to each other in a game. They are so time-consuming and expensive to create, the engines can be licensed out to handle other graphics-intensive games. BT's own engine, Tara (Total Abstract Rendering Architecture) has been in development since 2001 and has been used to recreate virtual interactive models of buildings for planners. It was also used in 2003 in Encounter, an urban-based, pervasive game that combined both virtual play in conjunction with physical, on-the-street action. Because the artists wanted video and interactive elements in their worlds, new features were added to Tara in order to handle the complex data sets. But collaboration between art and digital technology is by no means new, and many keen coders, designers, games makers and animators argue that what they create is art itself.\n \n As more tools for self-expression are given to the person on the street, enabling people to take photos with a phone and upload them to the web for instance, creativity will become an integral part of technology. The Orange Expressionist exhibition last year, for example, displayed thousands of picture messages from people all over the UK to create an interactive installation.\n \n Technology as a way of unleashing creativity has massive potential, not least because it gives people something to do with their technology. Big businesses know it is good for them to get in on the creative vein too. The art world is \"fantastically rich\", said Mr Stone, with creative people and ideas which means traditional companies like BT want to get in with them. Between 1997 and 2002, the creative industry brought £21 billion to London alone. It is an industry that is growing by 6% a year too. The partnership between artists and technologists is part of trying to understand the creative potential of technologies like broadband net, according to Mr Stone. \"This is not just about putting art galleries and museums online,\" he said. \"It is about how can everyone have the best seat in house and asking if technology has a role in solving that problem.\" With broadband penetration reaching 100% in the UK, businesses with a stake in the technology want to give people reasons to want and use it. The creative drive is not purely altruistic obviously. It is about both industries borrowing strategies and creative ideas together which can result in better business practices for creative industries, or more patent ideas for tech companies. \"What we are trying to do is have outside-in thinking. \"We are creating a future cultural drive for the economy,\" said Mr Stone.\n", "llama3.2:1b": ["Technology and arts worlds collaborate for the first time, with BT launching its Connected World initiative to shape a new 21st-century model that integrates art, technology, and business.", "The initiative includes a major international art installation in Brussels opening on April 15th and Madrid later in the summer, created using BT's technology at its research and development arm.", "Bafta-winning artists Langlands & Bell have created a virtual reality world of Brussels' Coudenberg Cellars, which can be navigated with a joystick and features interactive elements.", "The project is part of an effort to understand the creative potential of technologies like broadband internet, which has reached 100% penetration in the UK, and explore new ways to harness this technology for both artistic expression and business benefit."], "llama3.2:3b": ["BT launches Connected World initiative to shape art and technology worlds together through collaboration and innovation.", "The telco aims to understand creative industry's needs for broadband technology, while providing artists with tools like its sophisticated graphics rendering program, Tara.", "BT has partnered with institutions to create major international art installations using the technology, including a 3D model of Brussels' Coudenberg Cellars."], "gemma2:2b": ["BT's Connected World initiative combines tech and art to develop a 21st-century model for creative industries.", "The initiative features international art installations created using advanced technology, including virtual models of historical sites.", "This collaboration seeks to understand the connection between technology and artistic expression.", "The goal is to foster innovation and improve business practices in both fields.", "BT believes this partnership will lead to new ideas and solutions for both creative and technological sectors."], "qwen2.5:0.5b": ["Technology drives creativity in art, technology in society, and vice versa.", "Tech firms look to creative industries for inspiration while arts organizations seek ways to communicate with them.", "Technology is used to shape digital worlds like Connected World.", "It uses a 3D graphics engine, based on the core Quake engine from 2001."], "qwen2.5:1.5b": ["Technology and the arts worlds are increasingly collaborating, with BT's Connected World initiative aiming to integrate broadband technology into creative industries.", "A major international art installation in Brussels uses BT's graphics rendering program created at its research arm, showcasing immersive 3D landscapes.", "The partnership between artists and digital technology is not new but continues to enhance self-expression through tools like the Quake game engine used for creating virtual interactive models of buildings.", "As more people engage with technology creatively, both industries aim to leverage this collaboration to benefit businesses and the economy."], "qwen2.5:3b": ["Technology and arts worlds have increasingly collaborated.", "UK telco BT's Connected World initiative aims to connect these sectors through broadband technology.", "A recent art installation in Brussels uses BT's 3D graphics engine to create an immersive, virtual model of historical spaces.", "This collaboration is part of understanding how technologies like broadband can enhance creativity.", "The potential benefits include driving economic growth and sharing best practices between tech companies and creative industries."], "opencoder:1.5b": ["Technology is growing at an all-time high and has seen a surge in international attention from creative industries looking to inspire themselves with innovation.", "The initiative, launched by BT and Connected World, aims to demystify the digital age and create a \"21st Century model\" that will help cement art, technology and business worlds together.", "The key is to understand the creative industry that has a natural thirst for broadband technology.", "It has been crucial in creating a bridge between the past and the present through uncorked connections with European power, which has deeply shaped the city's survival.", "The artists are making wonders using Quake game graphics engine and Tara (Total Abstract Rendering Architecture), creating virtual interactive models of buildings and other spaces.", "The creative world is rich with ideas and people who share their creativity.", "The partnership between artists and technologists is a powerful tool to bring new possibilities to businesses, allowing them to leverage technology for better business practices and increasing patent innovations.", "In the UK, the initiative has opened up numerous opportunities for international collaboration.", "Big businesses have been grappling with the creative potential of technologies like broadband net, thus opening a new world of opportunities for tech companies.", "The rise of the Internet also has led to an increase in the usage and accessibility of technology, creating more possibilities for people on the street.", "In terms of business practices, having tools for self-expression could boost creativity as people can take photos with their phones and upload them to the web.", "Orange Expressionist exhibition last year showcased thousands of picture messages from people all over the UK, creating an interactive installation that combines art with digital technology.", "The rapid growth of the creative world means we are seeing increased use of technology in solving problems in various industries.", "Biggest is self-expression – enabling people to take photos and share them on social media.", "With this, businesses can provide a more efficient way for their employees to use their technology.", "In conclusion, Technology continues to be an innovative and captivating field that has the potential to revolutionize many sectors of life.", "The UK's initiative, while not without challenges, is set to become a major player in the global arena.", "With continued advancements in technology and understanding the creative potential of technologies, we can expect to see significant growth in this rapidly evolving world."], "smollm:1.7b": ["The text above summarizes the following information:\n\n* The hi-tech and the arts worlds have for some time danced around each other and offered creative and technical help when required.", "* Often this help has come in the form of corporate art sponsorship or infrastructure provision.", "* UK telco BT is serious about the idea and has launched its Connected World initiative.", "* To mark the initiative's launch, a major international art installation is to open on 15 April in Brussels, with a further exhibit in Madrid later in the summer.", "* They have both been created using the telco's technology that it has been incubating at its research and development arm, including a sophisticated graphics rendering program.", "* Using a 3D graphics engine, the type commonly used in gaming, BAFTA-winning artists Langlands & Bell have created a virtual, story-based, 3D model of Brussels' Coudenberg Cellars.", "* They have recently been excavated and are thought to be the remnants of Coudenberg Palace, an historical seat of European power for hundreds of years.", "* The 3D world can be navigated using a joystick and offers an immersive experience of a landscape that historically had a river running through it until it was bricked up in the 19th Century.", "* To give people reasons to want and use technology, BT has set up its own art installation which is part of its Connected World initiative.", "* The company's own engine, Tara (Total Abstract Rendering Architecture), has been used to recreate virtual interactive models of buildings for planners.", "* As more tools for self-expression are given to the person on the street, enabling people to take photos with a phone and upload them to the web for instance, technology will become an integral part of creativity.", "* Big businesses know it is good for them to get in on the creative vein too.", "The company's partnership between artists and technologists is part of trying to understand the creative potential of technologies like broadband net, according to Mr Stone.", "* With broadband penetration reaching 100% in the UK, businesses with a stake in the technology want to give people reasons to use it.", "The creative drive is not purely altruistic obviously.", "It is about both industries borrowing strategies and creative ideas from each other which can result in better business practices for creative industries or more patent ideas for tech companies.", "* What we are trying to do is have outside-in thinking.", "We are creating a future cultural drive for the economy, according to Mr Stone."], "deepseek-r1:1.5b": ["The art and technology worlds have increasingly collaborated, with both offering creative solutions.", "Companies like BT are now seeking inspiration from the arts for tech applications, aiming to create a 21st-century model that merges creativity with innovation.", "Their Connected World initiative uses tools inspired by virtual reality and graphics engines, such as Quake, to develop immersive experiences, exemplified by a Brussels virtual world.", "Collaborative efforts between artists and technologists enhance creativity, as seen in the £21 billion industry growth in London.", "This collaboration fosters economic practices and patent ideas for tech companies.", "Broadband penetration is leveraged to boost creativity, with initiatives like BT's involving photo apps.", "Creative industries' success underscores the role of technology as a force for creativity, leading to potential economic benefits."], "tinyllama:1.1b": ["The hi-tech and arts worlds are rapidly converging as technology has become an integral part of creative expression, with big businesses and artistic industries coming together to support each other's endeavors.", "Technology as a form of unleashing creativity has massive potential, but its fanatical richness also means traditional companies like BT want to get in on the creative vein too.", "The partnership between artists and technologist is part of trying to understand the creative potential of technologies like broadband net and addressing how technology can solve problems for both businesses and creatives."], "tinydolphin:1.1b": [" The article discusses how technology, driven by the creative industry, is helping to shape and influence our world.", "In this case, the creative industry being in the tech space, and specifically focusing on artistic expression via technology.", "The initiative mentioned - Connected World (CW) - seeks to bring together the creative industries with corporate partnerships to innovate and shape tomorrow's world.", "This collaboration can lead to better solutions for both parties, as well as a more interconnected future where technology is not only utilized but celebrated as an art form in its own right.", "The example presented - a major international art installation being inaugurated on 15 April in Brussels - showcases the importance of this collaborative approach to innovation.", "It not only offers unique experiences for viewers, but also raises awareness of the impact of technology on society and culture."], "phi:2.7b": [" Technology and art worlds collaborate to create immersive experiences.", "Companies like BT see potential in this collaboration as it can bring creativity and inspiration to people using technology, and in turn, help them understand how creative industries can be better served by technological advancements.", "The partnership can also yield benefits for both industries through the exchange of ideas, strategies, and innovations.", "This is not just about making art accessible online, but also asking if technology has a role in solving the problems faced by creative industries.", "With growing broadband penetration, businesses want to leverage the creative drive to make people want and use their technology.", "The collaboration between artists and technologists can lead to better business practices for creative industries or more patent ideas for tech companies."], "orca-mini:3b": [" Technology gets the creative bug as BT launches art installation with Langlands & Bell, using BT's graphics engine to create virtual 3D model of Brussels' Coudenberg Cellars."], "hermes3:3b": ["BT launches initiative to integrate art and technology, aiming to understand creative potential of broadband networks and foster collaboration between artists and technologists."], "stablelm-zephyr:3b": ["Hi-tech and creative industries are becoming increasingly intertwined as hi-tech firms look to creative industries for inspiration, and vice versa.", "UK telco BT launched its Connected World initiative to shape a \"21st Century model\" that will help bring art, technology, and businesses together.", "To mark the launch, a major international art installation will open on 15 April in Brussels and Madrid later in the summer.", "This marks the use of BT's technology for artistic creations, such as a virtual, story-based 3D model of Brussels' Coudenberg Cellars created by Bafta-winning artists Langlands & Bell using a 3D graphics engine commonly used in gaming.", "As more tools for self-expression are given to individuals, creativity will become an integral part of technology, and big businesses want to get involved too, considering the art world's \"fantastically rich\" creative people and ideas.", "The partnership between artists and technologists aims to understand the creative potential of technologies like broadband net, benefiting both industries by borrowing strategies and creative ideas together for better business practices and more patent ideas."], "stablelm2:1.6b": ["Technology and the arts collaborate for a \"Century Model\" by UK telco BT's Connected World initiative.", "Major international art installations use BT's technology, such..\n- A virtual 3D model of historical Brussels' Coudenberg Cellars, created with B&8 winning artists Langlands & Bell using a Quake game graphics engine.", "- BT's own engine Tara used to create interactive models for planners and urban-based games like Encounter.", "The partnership between art and technology is crucial in unlocking creativity.", "As broadband penetration increases, businesses will give people more reasons to use it.", "The goal of BT and the creative industry is to understand each other's potential through collaborations that benefit both industries."], "granite3.1-dense:2b": ["BT, a UK telecommunications company, is fostering collaboration between technology and the creative industries through its Connected World initiative.", "This endeavor aims to establish a unified model that integrates art, technology, and business.", "To mark the launch, BT has created an international art installation in Brussels and plans one in Madrid using advanced 3D graphics rendering technology from its R&D arm, Tara (Total Abstract Rendering Architecture).", "British artists Langlands & Bell have designed a virtual, story-based model of Brussels' Coudenberg Cellars, now bricked up, offering an immersive experience.", "This project demonstrates how creative professionals can leverage advanced technology for self-expression and storytelling.", "The partnership between artists and technologists has significant potential, as it enables people to utilize their technology for creativity.", "The art world is a thriving sector, generating £21 billion for London alone between 1997 and 2002 and growing at 6% annually.", "This collaboration allows both industries to borrow strategies and creative ideas, potentially improving business practices in the creative sectors or fostering patent development for tech companies.", "By bringing these two worlds together, BT seeks to drive a cultural force that benefits the economy as a whole."], "chatgpt-4o-latest": ["The relationship between technology and the arts is becoming more intertwined as tech firms seek inspiration from creative industries and vice versa.", "UK telecom company BT has launched the Connected World initiative to integrate art, technology, and business.", "As part of this effort, BT has collaborated with artists Langlands & Bell to create a 3D virtual model of Brussels' Coudenberg Cellars using its Tara graphics engine.", "This initiative highlights how technology can enhance artistic expression and historical understanding.", "The broader trend sees technology enabling creativity, as seen in interactive exhibitions like the Orange Expressionist.", "Businesses recognize the financial and cultural value of the creative sector, which contributed £21 billion to London between 1997 and 2002 and is growing at 6% annually.", "The partnership between artists and technologists aims to explore the creative potential of broadband and digital tools, benefiting both industries by fostering innovation and new business strategies."]}