{"raw_text": "UK pioneers digital film network\n \n The world's first digital cinema network will be established in the UK over the next 18 months.\n \n The UK Film Council has awarded a contract worth £11.5m to Arts Alliance Digital Cinema (AADC), who will set up the network of up to 250 screens. AADC will oversee the selection of cinemas across the UK which will use the digital equipment. High definition projectors and computer servers will be installed to show mainly British and specialist films. Most cinemas currently have mechanical projectors but the new network will see up to 250 screens in up to 150 cinemas fitted with digital projectors capable of displaying high definition images. The new network will double the world's total of digital screens. Cinemas will be given the film on a portable hard drive and they will then copy the content to a computer server.\n \n Each film is about 100 gigabytes and has been compressed from an original one terabyte-size file. Fiona Deans, associate director of AADC, said the compression was visually lossless so no picture degradation will occur.\n \n The film will all be encrypted to prevent piracy and each cinema will have an individual key which will unlock the movie. \"People will see the picture quality is a bit clearer with no scratches. \"The picture will look exactly the same as when the print was first made - there is no degradation in quality over time.\"\n \n The key benefit of the digital network will be an increase in the distribution and screening of British films, documentaries and foreign language films.\n \n \"Access to specialised film is currently restricted across the UK,\" said Pete Buckingham, head of Distribution and Exhibition at the UK Film Council. \"Although a genuine variety of films is available in central London and a few other metropolitan areas, the choice for many outside these areas remains limited, and the Digital Screen Network will improve access for audiences across the UK,\" Digital prints costs less than a traditional 35mm print - giving distributors more flexibility in how they screen films, said Ms Deans. \"It can cost up to £1,500 to make a copy of a print for specialist films. \"In the digital world you can make prints for considerably less than that. \"Distributors can then send out prints to more cinemas and prints can stay in cinemas for much longer.\" The UK digital network will be the first to employ 2k projectors - which are capable of showing films at resolutions of 2048 * 1080 pixels. A separate competitive process to determine which cinemas will receive the digital screening technology will conclude in May. The sheer cost of traditional prints means that some cinemas need to show them twice a day in order to recoup costs. \"Some films need word of mouth and time to build momentum - they don't need to be shown twice a day,\" explained Ms Deans. \"A cinema will often book a 35mm print in for two weeks - even if the film is a roaring success they cannot hold on to the print because it will have to go to another cinema. \"With digital prints, every cinema will have its own copy.\"\n", "llama3.2:1b": ["UK Film Council awards contract worth £11.5m to establish world's first digital cinema network with 250 screens.", "The network will show mainly British and specialist films on high definition projectors and computer servers.", "Films are compressed from original 1 terabyte files, encrypted for piracy prevention, and each cinema has an individual key for secure access.", "The network aims to increase distribution and screening of British and foreign language films, reducing costs associated with traditional print screenings."], "llama3.2:3b": ["The UK Film Council has awarded £11.5m to Arts Alliance Digital Cinema to set up the world's first digital cinema network, which will install high definition projectors and computer servers in up to 150 cinemas across the UK, featuring mainly British and specialist films.", "The new network, expected within 18 months, will double the global total of digital screens and offer improved distribution and screening options for documentaries, foreign language films, and specialized content, with costs reduced by £1,500 compared to traditional prints."], "gemma2:2b": ["The UK is creating the world's first digital cinema network.", "AADC will install digital equipment in up to 250 screens across 150 cinemas.", "This will double the global number of digital screens and increase access to British, documentary, and foreign language films.", "A key benefit is the reduced cost and increased flexibility for film distribution.", "Digital prints allow for more efficient use of resources and enable longer film runs at each cinema."], "qwen2.5:0.5b": ["UK Film Council launches Digital Cinema Network.", "It will be established by 2018 in 250 cinemas with up to 150 using digital projectors.", "Each film is about 100 gigabytes and has been compressed from an original file of 3 terabytes.", "The compression ensures no picture degradation.", "Cinemas will have their own key for the digital print, not the physical print, which costs less than traditional prints and can be sent to more cinemas with longer retention times."], "qwen2.5:1.5b": ["The UK Film Council has contracted AADC to set up a £11.5m network of 250 screens using high-definition projectors capable of displaying British and specialist films.", "Digital prints cost less than traditional prints, allowing for more flexibility in distribution.", "The new network aims to increase access to British, documentary, and foreign language films across the UK."], "qwen2.5:3b": ["UK pioneers first digital cinema network worth £11.5m awarded to Arts Alliance Digital Cinema (AADC).", "AADC will establish a network of up to 250 screens in over 150 cinemas across UK with high definition projectors displaying mainly British and specialist films.", "Compression reduces file size from terabyte to gigabytes, ensuring lossless picture quality.", "The network aims to increase access to British and foreign language films by eliminating restrictions on specialised film availability outside major cities.", "Digital prints cost less than traditional 35mm prints allowing for more flexibility in distribution and longer print retention periods.", "UK digital cinema network will feature 2k projectors providing 2048 x 1080 resolution images, enabling a single copy per cinema to be used indefinitely without degradation."], "opencoder:1.5b": ["UK pioneers digital film network\n\nThe world's first digital cinema network will be established in the UK over the next 18 months.", "Awarded contract worth £11.5m by Arts Alliance Digital Cinema (AADC), the new network of up to 250 screens will oversee the selection of cinemas across the UK.", "High definition projectors and computer servers will be installed for showing mainly British and specialist films.", "The digital film distribution network will double the world's total of digital screens.", "Cinemas will have a portable hard drive and they will then copy the content to a computer server.", "Each film is about 100 gigabytes, compression from original one terabyte-size file has been achieved without picture degradation.", "Fiona Deans, associate director of AADC, mentioned visually lossless so there is no picture degradation in quality over time.", "The digital network will offer an increase in the distribution and screening of British films, documentaries and foreign language films.", "Access to specialised film is currently restricted across the UK.", "Pate Buckingham, head of Distribution and Exhibition at the UK Film Council stated that although a genuine variety of films is available in central London and a few other metropolitan areas, the choice for many outside these areas remains limited.", "Digital prints cost less than a traditional 35mm print - allowing distributors more flexibility on how they screen films.", "The cost to make a copy of a print for specialist films can be up to £1,500.", "The competitive process to determine which cinemas will receive the digital screening technology will conclude in May.", "The cost of traditional prints means some cinemas need to show it twice a day in order to recoup costs."], "smollm:1.7b": ["The UK pioneers digital film network"], "deepseek-r1:1.5b": ["The UK will establish the first digital cinema network in the next 18 months, involving up to 250 screens across 150 cinemas with high-definition technology.", "AADC will set this up for £11.5 million.", "Films will be uploaded as portable hard drives, copied to servers, and decrypted.", "Filmmakers will use encrypted keys for security.", "The network aims to double digital screens in 150 cinemas, offering clearer images without scratch damage.", "Digital prints cost less than traditional 35mm prints, allowing more flexibility.", "Some films may show twice a day due to distribution costs.", "The UK film council highlighted its benefits and future plans for the digital screen network."], "tinyllama:1.1b": ["The UK Film Council has awarded a contract worth £11.5m to Arts Alliance Digital Cinema (AADC) for setting up a digital cinema network in the UK over the next 18 months.", "The initiative will allow the distribution and screening of British and foreign language films, documentaries, and foreign films, with specialized film being available for many areas outside these designated locations.", "AADC will install up to 250 screens across approximately 150 cinema locations in digital projection systems capable of displaying high definition images.", "The project involves selecting the most suitable cinemas to house the digital screening equipment, installing digital projectors and computer servers to show mainly British and specialized films.", "Each film is about 100 gigabytes and has been compressed from an original one terabyte-size file, with encryption allowing for no picture degradation during playback.", "AADC will provide distribution and exhibition services to cinemas, including access to specialized films and the ability to send prints to more cinema locations for longer.", "The Digital Screen Network is expected to improve accessibility to British films, documentaries, foreign language films, and foreign films."], "tinydolphin:1.1b": [" In response to a question about a digital cinema network in the UK, this statement provides a brief overview: The UK Film Council has awarded a contract worth £11.5m to Arts Alliance Digital Cinema (AADC), which will establish and manage a digital cinema network across the UK, setting up 250 screens using high definition projectors and computer servers.", "This system will allow cinemas to screen British and specialist films with improved image quality and accessibility to foreign language films and documentaries.", "The network is expected to increase distribution and screening of British films, documentaries, and foreign language films in the UK."], "phi:2.7b": [" The UK Film Council has awarded £11.5m contract to Arts Alliance Digital Cinema (AADC) for creating and maintaining the world's first digital cinema network in 18 months.", "The network will have up to 250 screens across 150 cinemas, and each film is 100GB compressed from a 1TB file.", "Encryption and individual keys will prevent piracy.", "AADC will distribute British and foreign language films at reduced costs compared to traditional prints, allowing for more flexibility and better access."], "orca-mini:3b": [" The UK will pioneer the world's first digital cinema network, set to be established over the next 18 months and consisting of up to 250 screens.", "Each film will be compressed from a terabyte-size file and digitally encrypted to prevent piracy.", "The network will double the world's total of digital screens.", "Access to British and specialist films will increase across the UK, and distributors will have more flexibility in how they screen films due to less expensive prints.", "Each cinema will receive digital screenings and keep them for longer."], "hermes3:3b": ["UK to create first digital cinema network ($11.5m project, up to 250 screens, high-def projectors, encrypted films for no piracy)"], "stablelm-zephyr:3b": ["The UK will establish the world's first digital cinema network over the next 18 months, with Arts Alliance Digital Cinema (AADC) receiving a £11.5m contract from the UK Film Council to set up up to 250 screens in 150 cinemas.", "The new digital projectors will display high-definition images and each film is 100 gigabytes, compressed from an original one terabyte file.", "Digital films will prevent piracy as each cinema receives an individual key unlocking the movie.", "This will increase distribution of British, documentary, and foreign language films.", "Traditional prints cost less for distributors to create digital prints, allowing for more flexibility in screening films and reducing costs for cinemas.", "The UK digital network will be the first to employ 2k projectors."], "stablelm2:1.6b": ["The UK Film Council awarded a £1.5m contract to Arts Alliance Digital Cinema (AADC) to establish the world's first digital cinema network in the UK.", "AADC will install high definition projectors and computer servers across up to 20 cinemas to screen mainly British and specialist films, including foreign language films.", "The digital network will increase distribution and screening of British films, documentaries, and foreign language films.", "Cinemas will have an individual key to unlock movies without degradation in quality over time.", "Digital prints cost less than a traditional mm print, giving distributors more flexibility in how they screen films.", "A separate competitive process will determine which cinemas receive the digital screening technology by May."], "granite3.1-dense:2b": ["The UK will launch its first digital cinema network within 18 months, with the UK Film Council contracting Arts Alliance Digital Cinema (AADC) for £11.5m.", "This network aims to upgrade up to 250 cinema screens across approximately 150 locations, transitioning from mechanical projectors to high-definition digital ones.", "The network will primarily display British and specialized films.", "Each film, about 100GB in size after compression, maintains lossless visual quality.", "Films are encrypted for piracy prevention, with individual cinema keys ensuring secure access.", "Key benefits of the digital network include increased distribution and screening of British films, documentaries, and foreign language movies, expanding access to specialty content across the UK.", "Digital prints cost less than traditional 35mm prints, allowing distributors more flexibility in film scheduling and enabling longer cinema hold times.", "The UK will employ 2k projectors (2048x1080 pixels), offering superior picture quality compared to 35mm prints.", "A competitive process will determine which cinemas receive digital screening technology, expected to conclude in May.", "Traditional print duplication costs can exceed £1,500 per film, necessitating frequent showings at multiple locations, whereas digital prints enable each cinema to maintain its own copy."], "chatgpt-4o-latest": ["The UK is establishing the world's first digital cinema network over the next 18 months, with the UK Film Council awarding an £11.5m contract to Arts Alliance Digital Cinema (AADC) to set up up to 250 digital screens in 150 cinemas.", "These cinemas will use high-definition projectors and computer servers to screen mainly British and specialist films.", "Digital films, compressed from one terabyte to 100 gigabytes, will be distributed on encrypted hard drives to prevent piracy.", "The network aims to improve access to British, documentary, and foreign films, particularly outside major metropolitan areas.", "Digital prints are significantly cheaper than traditional 35mm prints, allowing for greater distribution flexibility and longer screening periods.", "The UK network will be the first to use 2k projectors, enhancing picture quality.", "A competitive process to select participating cinemas will conclude in May."]}