{"raw_text": "EU software patent law faces axe\n \n The European Parliament has thrown out a bill that would have allowed software to be patented.\n \n Politicians unanimously rejected the bill and now it must go through another round of consultation if it is to have a chance of becoming law. During consultation the software patents bill could be substantially re-drafted or even scrapped. The bill was backed by some hi-tech firms, saying they needed protections it offered to make research worthwhile.\n \n Hugo Lueders, European director for public policy at CompTIA, an umbrella organization for technology companies, said only when intellectual property was adequately protected would European inventors prosper. He said the benefits of the bill had been obscured by special interest groups which muddied debate over the rights and wrongs of software patents. Other proponents of the bill said it was a good compromise that avoided the excesses of the American system which allows the patenting of business practices as well as software. But opponents of the bill said that it could stifle innovation, be abused by firms keen to protect existing monopolies and could hamper the growth of the open source movement. The proposed law had a troubled passage through the European parliament. Its progress was delayed twice when Polish MEPs rejected plans to adopt it. Also earlier this month the influential European Legal Affairs Committee (JURI) said the law should be re-drafted after it failed to win the support of MEPs. To become law both the European Parliament and a qualified majority of EU states have to approve of the draft wording of the bill. The latest rejection means that now the bill on computer inventions must go back to the EU for re-consideration.\n", "llama3.2:1b": ["The European Parliament has rejected a bill allowing software patents, citing concerns about the protection of intellectual property and potential stifling of innovation.", "The bill was backed by some tech firms, but also criticized for its potential to stifle new ideas and hinder open-source movements."], "llama3.2:3b": ["The European Parliament rejected a bill allowing software patents, sending it back for re-consultation and potentially substantial re-drafting or scrapping.", "Backers say it's needed for research protection, while opponents fear it could stifle innovation and harm open source growth."], "gemma2:2b": ["The European Parliament rejected a bill that would have allowed software patents.", "The bill was opposed by some who believe it could stifle innovation, while others supported it for potential protections."], "qwen2.5:0.5b": ["The European Parliament has rejected a proposed law that would allow software to be patented, requiring it to undergo further consultation and possibly a full overhaul if it becomes law.", "This decision hampers the potential benefits of the legislation, as it risks stifling innovation by protecting business practices over software patents while potentially hindering the growth of open-source movements."], "qwen2.5:1.5b": ["The European Parliament has rejected a software patent bill, requiring another round of consultation before becoming law.", "Proponents argued it would boost innovation and protect intellectual property rights, while opponents feared it could stifle progress and harm open-source projects.", "The rejection means the bill must be revised or scrapped further before reaching approval."], "qwen2.5:3b": ["EU software patent law faces rejection, requiring another consultation round before it can be enacted.", "Initially backed by tech firms needing protections, the bill was later criticized for potential stifling of innovation and risk of abuse.", "Delayed twice due to Polish MEPs' objections and failing to gain JURI's support, the revised version must now pass both European Parliament approval and a qualified majority of EU states."], "opencoder:1.5b": ["The European Software Patents Law faces axe due to its controversial nature.", "It proposes an amendment to present law that allows software patents, but it is unclear how it will resolve disputes and maintain the integrity of the existing system.", "During consultation, a substantial rewrite or rescission of the bill could be brought forward.", "The bill was backed by some high-tech firms, suggesting they needed new protections compared to current ones.", "This agreement has led to heated discussions among European intellectual property owners who argue about whether the benefits are offset by concerns from private sector groups.", "Despite oppositions, it is clear that the proposed law faces criticism for abusing existing monopolies and stifling innovation.", "If approved, it could hamper the growth of open source software and slow down new inventions.", "However, critics perceive its delay in its passage through the European parliament as counterproductive.", "The drafting committee of JURI last month revealed that if it was rejected by the Member States, the bill must be reevaluated again."], "smollm:1.7b": ["EU software patent law faces axe, Politicians unanimously rejected the bill and now it must go through another round of consultation if it is to have a chance of becoming law.", "During consultation the software patents bill could be substantially re-drafted or even scrapped.", "The bill was backed by some hi-tech firms, saying they needed protections it offered to make research worthwhile.", "The bill was supported by some hi-tech companies, saying they needed protections it offered to make research worthwhile.", "Other proponents of the bill said it was a good compromise that avoided the excesses of the American system which allows the patenting of business practices as well as software.", "But opponents of the bill said that it could stifle innovation, be abused by firms keen to protect existing monopolies and could hamper the growth of the open source movement.", "The proposed law had a troubled passage through the European parliament.", "Its progress was delayed twice when Polish MEPs rejected plans to adopt it.", "Also earlier this month the influential European Legal Affairs Committee (JURI) said the law should be re-drafted after it failed to win the support of MEPs.", "To become law both the European Parliament and a qualified majority of EU states have to approve of the draft wording of the bill.", "The latest rejection means that now the bill on computer inventions must go back to the EU for re-consideration."], "deepseek-r1:1.5b": ["The European Parliament has rejected a bill aiming to grant software patents, which would have allowed researchers to protect their inventions.", "This bill was faced with criticism from politicians, but now it faces another round of consultation.", "During this review, the software patent law could be re-drafted or even废止.", "Benefits for inventors were hoped by tech firms, while opponents argued it might stifle innovation and harm open-source movement.", "The bill's passage in parliament was delayed twice in Poland, and JURI re-drew the draft after initial reviews.", "The final rejection means the software patent law on computer inventions must return to the European Parliament for reconsideration."], "tinyllama:1.1b": ["The European Union has rejected a proposal to legalize software patents.", "The political decision came as an unexpected blow to tech firms, who had urged lawmakers to pass the bill in hopes of protecting their intellectual property and making research worthwhile.", "But the opposition was muddled by special interest groups, with some arguing that software patents were necessary to protect inventions that could become business practices as well as software.", "Critics also warned that software patents could stifle innovation, be abused by companies looking to protect existing monopolies, and hamper the growth of the open-source movement.", "The law's passage through EU parliaments had been delayed twice due to Polish MEPS' rejection plans, and earlier this month, legal experts said it should be revised after they didn't support its wording.", "To become law both the European Parliament and a qualified majority of EU states have to approve of the draft bill."], "tinydolphin:1.1b": [" The European Parliament has rejected a proposal to allow software patents in Europe, a move seen as a setback for software developers seeking protection from potential abuse by companies.", "This decision marks the end of a process that began with a debate on February 26 and has seen several rounds of consultation among experts and stakeholders.", "Many technology firms have argued that patents protect their intellectual property and are essential in fostering innovation, while special interest groups have advocated for broad-based protection that does not allow patenting business practices or software.", "Ultimately, the proposed law was met with significant controversy, with some experts arguing that it could stifle innovation and promote abuse of intellectual property rights."], "phi:2.7b": [" The European Parliament has rejected legislation that would have allowed software patents, as it could stifle innovation.", "The bill was supported by some tech companies but opponents argued that it could protect existing monopolies and hamper the growth of open source movements.", "The proposed law faced multiple delays in gaining support from MEPs before finally being rejected.", "It now needs to be re-drafted or scrapped if it is to have a chance of becoming law."], "orca-mini:3b": [" The European Union's software patent law has been axed by the European Parliament due to political and economic concerns.", "The bill would have allowed software to be patented, but it was rejected unanimously by politicians.", "The bill may be revised or scrapped during another round of consultation.", "Supporters of the bill argue that intellectual property rights should be adequately protected for European inventors to prosper, while opponents believe that the law could stifle innovation, abuse monopolies, and hamper the growth of open source movements.", "The proposed law faced multiple delays and was re-drafted by the European Legal Affairs Committee after it failed to win the support of MEPs.", "To become law, both the European Parliament and qualified majority of EU states must approve the draft wording of the bill."], "hermes3:3b": ["European Parliament rejects software patent bill."], "stablelm-zephyr:3b": ["The European Parliament has voted against a software patents bill, which could now be substantially revised or scrapped during further consultation.", "Some hi-tech firms supported the bill, arguing that it would protect their intellectual property and encourage research.", "However, opponents argued that patenting software could stifle innovation, as well as being abused by existing monopolies to hamper the growth of open source movements.", "The proposed law faced delays and failed to win support from MEPs in two separate committees, requiring a re-draft before it can gain approval if both the European Parliament and a qualified majority of EU states back its wording."], "stablelm2:1.6b": ["The European Parliament rejected a bill allowing software patenting, with potential amendments during consultation needed before it could become law.", "Proponents argued it was a good compromise to avoid excesses of the American system; however, opponents claimed it would stifle innovation and be abused by firms seeking existing monopolies.", "The proposed law faced challenges through the European parliament, with Polish MEPs rejecting initial plans and the influential JURI legal affairs committee recommending re-drafting after failing to secure support from MEPs."], "granite3.1-dense:2b": ["The European Parliament has rejected a software patent bill, leaving its future uncertain.", "Backed by some tech firms for research protection, the bill faced criticism from opponents who argue it could hinder innovation, protect monopolies, and stifle open-source growth.", "The bill's progress was delayed due to Polish MEPs' rejections and criticisms from the European Legal Affairs Committee (JURI).", "To proceed, it must now be re-evaluated by the EU Parliament and gain approval from a qualified majority of EU states."], "chatgpt-4o-latest": ["The European Parliament has rejected a bill that would have allowed software patents, requiring further consultation for any chance of becoming law.", "Supporters, including some tech firms, argued it was necessary for protecting intellectual property and fostering innovation, while opponents feared it could stifle innovation, entrench monopolies, and harm the open-source movement.", "The bill had already faced delays and opposition, including from Polish MEPs and the European Legal Affairs Committee.", "To become law, it must be approved by both the European Parliament and a qualified majority of EU states, but the latest rejection sends it back for reconsideration."]}