{"raw_text": "Xbox power cable 'fire fear'\n \n Microsoft has said it will replace more than 14 million power cables for its Xbox consoles due to safety concerns.\n \n The company said the move was a \"preventative step\" after reports of fire hazard problems with the cables. It affects Xboxes made before 23 October 2003 for all regions but mainland Europe - and consoles in that region made before 13 January 2004. Microsoft said it had received 30 reports of minor injury or property damage due to faulty cables. The firm said fewer than one in 10,000 consoles had experienced component failures. The recall affects almost three quarters of all Xboxes sold around the world since its launch in 2001.\n \n In a statement, it added: \"In almost all instances, any damage caused by these failures was contained within the console itself or limited to the tip of the power cord at the back of the console.\" But in seven cases, customers reported sustaining a minor burn to their hand. In 23 cases, customers reported smoke damage, or minor damage to a carpet or entertainment centre. \"This is a preventative step we're choosing to take despite the rarity of these incidents,\" said Robbie Bach, senior vice president, Microsoft home and entertainment division. \"We regret the inconvenience, but believe offering consumers a free replacement cord is the responsible thing to do.\" Consumers can order a new cable from the Xbox website or by telephoning 0800 028 9276 in the UK. Microsoft said customers would get replacement cords within two to four weeks from the time of order. It advised users to turn off their Xboxes when not in use. A follow-up to Xbox is expected to released at the end of this year or the beginning of 2006.\n", "llama3.2:1b": ["Microsoft plans to replace over 14 million power cables for its Xbox consoles due to safety concerns, affecting Xbox models made before October 23, 2003.", "The company received 30 reports of minor injury or property damage and fewer than 1 in 10,000 consoles had experienced component failures.", "Despite this, the recall affects nearly three-quarters of all Xboxes sold worldwide since its launch in 2001."], "llama3.2:3b": ["Microsoft will replace more than 14 million Xbox power cables due to safety concerns, citing reports of fire hazards and component failures affecting almost three quarters of all consoles sold since 2001, resulting in minor injuries and property damage."], "gemma2:2b": ["Microsoft is recalling more than 14 million power cables for its Xbox consoles due to fire hazard concerns.", "The recall affects Xboxes made before a specific date in all regions except mainland Europe, and it resulted in minor injuries or property damage reported by customers.", "Microsoft believes replacing the cables is the responsible thing to do and offers free replacement cords through their website or phone number.", "A new Xbox model is expected to be released later this year or early next year."], "qwen2.5:0.5b": ["Microsoft is recalling more than 14 million power cables for its Xbox consoles due to a potential safety issue, resulting in reports of minor injury or property damage.", "The company claims fewer than one in 10,000 consoles had experienced component failures and that the majority of issues were contained within the console itself or limited to the tip of the power cord at the back of the console.", "Customers can order a new cable from Xbox's website or by contacting Microsoft’s customer service hotline."], "qwen2.5:1.5b": ["Microsoft replaces over 14 million faulty Xbox power cables due to safety concerns, primarily affecting consoles made before October 2003 and January 2004 in mainland Europe.", "The majority of incidents were limited to the console itself or its tip but resulted in minor burns or smoke damage in a few cases.", "Consumers can order replacement cords from the Xbox website or by contacting customer service."], "qwen2.5:3b": ["Microsoft will replace over 14 million faulty power cables for Xbox consoles due to safety concerns, after receiving reports of fire hazard issues.", "The recall affects all regions except mainland Europe where it covers consoles made before January 2004.", "Microsoft received 30 reports of minor injury or property damage, but fewer than one in ten thousand had component failures.", "Users can order a replacement cable from the Xbox website or by phone.", "The firm advises users to turn off their consoles when not in use and is releasing a follow-up Xbox at the end of this year or beginning of 2006."], "opencoder:1.5b": ["Microsoft has said it will replace more than 14 million power cables for its Xbox consoles due to safety concerns.", "The move was a \"preventative step\" after reports of fire hazard problems with the cables, affecting Xboxes made before 23 October 2003 for all regions but mainland Europe - and consoles in that region made before 13 January 2004.", "Microsoft had received 30 reports of minor injury or property damage due to faulty cables.", "In almost all instances, any damage caused by these failures was contained within the console itself or limited to the tip of the power cord at the back of the console.", "In seven cases, customers reported sustaining a minor burn to their hand.", "In 23 cases, customers reported smoke damage, or minor damage to a carpet or entertainment centre."], "smollm:1.7b": ["The summary above should be concise and accurate, preserving key ideas and details from the original text.", "It should also avoid using any explanations, justifications, or reasoning processes that are not part of the original text.", "The goal is to provide a clear and concise overview of the main points in the text without adding any additional information or analysis."], "deepseek-r1:1.5b": ["Microsoft will replace more than 14 million power cables for its Xbox consoles to prevent safety issues.", "This replacement is scheduled from October 23, 2003, in mainland Europe and from January 13, 2004, globally, excluding the UK.", "The affected regions include all sales since the console's launch in 2001.", "Major issues involve minor fires, causing fires with cables or power cords, which are contained within consoles or at their ends.", "Customers report minor burns and damage to hair or carpets but none affecting furniture.", "Seven cases caused smoke damage or carpet damage.", "Robbie Bach from Microsoft noted this as a responsible move offering free replacement cords.", "Users can order new cables on the website or through the UK's toll-free number 0800 028 9276, with replacement expected by the end of 2006."], "tinyllama:1.1b": ["Microsoft has announced a preventative step for safety concerns surrounding its Xbox power cables, which affects console models made before 23 October 2003 and all regions except mainland Europe.", "The company stated that it will replace more than 14 million power cable replacements for the Xbox, including those affected by faulty component failures.", "The recall affects about three-quarters of all Xbox consoles sold worldwide since their launch in 2001.", "According to the company, minor burn injuries, smoke damage, and minor damage to carpets or entertainment centres are some of the reported incidents.", "Consumers can order replacement cables from the Xbox website, including new ones within two to four weeks from the time of order.", "Microsoft advised users to turn off their consoles when not in use to prevent potential fire hazards.", "The recall is expected to be followed by a follow-up release for an updated version of the console."], "tinydolphin:1.1b": [" Xbox Power Cable 'Fire Fear'\n\nMicrosoft has announced plans to replace more than 14 million power cables for its Xbox consoles due to potential fire hazard concerns.", "This comes after a series of reports in 2005 and 2006 of Xbox consoles being affected by faulty power cables, leading to minor injuries and property damage."], "phi:2.7b": [" Microsoft has announced a recall of over 14 million power cables for its Xbox consoles due to fire hazards.", "The move aims to prevent any major safety issues, as there have been reports of minor injuries and property damage caused by faulty cables.", "The recall affects all regions except mainland Europe, and consoles made before October 2003.", "Customers can order new cables from the Xbox website or by calling a phone number in the UK.", "Microsoft advises users to turn off their Xboxes when not in use.", "A follow-up console is expected to be released at the end of this year or early 2006."], "orca-mini:3b": [" Microsoft is replacing more than 14 million power cables for its Xbox consoles due to safety concerns, following reports of fire hazard problems with the cables.", "The recall affects almost three quarters of all Xboxes sold since its launch in 2001 and almost one in seven consoles have experienced component failures, which can cause damage to a customer's hand or property.", "The company has received 30 reports of minor injury or property damage due to faulty cables, and in seven cases, customers reported sustaining a minor burn to their hand, while in 23 cases they reported smoke damage or minor damage to a carpet or entertainment center.", "The recall affects almost three quarters of all Xboxes sold since its launch in 2001, and Microsoft advised customers to turn off their consoles when not in use.", "A follow-up to the Xbox is expected to be released at the end of this year or the beginning of 2006."], "hermes3:3b": ["Xbox power cable recall; over 14m cables replaced due to fire hazard concerns.", "Affects almost 3/4 of all Xbox consoles sold worldwide."], "stablelm-zephyr:3b": ["Microsoft is replacing over 14 million Xbox power cables due to safety concerns, affecting consoles before October 23, 2003 and those made before January 13, 2004 in all regions except mainland Europe.", "The company received 30 reports of minor injury or property damage caused by faulty cables, but fewer than one in 10,000 consoles experienced component failures.", "This recall affects nearly three-quarters of all Xboxes sold worldwide since launch in 2001.", "In instances where damage occurred, it was limited to the console or power cord.", "Consumers can order a free replacement cable on the Xbox website or by phone in the UK, with delivery expected within two to four weeks."], "stablelm2:1.6b": ["Microsoft will replace over a million power cables for its Xbox consoles due to safety concerns, with the move being described as a \"preventative step\" following reports of fire hazard problems.", "The affected consoles are Xboxes made before October 3 for all regions except mainland Europe and Xboxes in that region made before January 4.", "The recall affects almost three-quarters of all Xboxes sold worldwide since launch.", "Microsoft has received reports of minor injury or property damage, with fewer than one in five consoles experiencing component failures.", "Consumers can order a free replacement cable through the Xbox website or UK phone number."], "granite3.1-dense:2b": ["Microsoft plans to replace over 14 million Xbox power cables due to potential fire hazards and component failures.", "This recall affects Xboxes manufactured before specific dates in various regions except Europe, with almost three-quarters of all Xboxes sold since its 2001 launch impacted.", "The company received reports of minor injuries (30 instances), property damage (23 cases) including smoke and carpet/entertainment center harm, and one hand burn in seven cases.", "Despite the rarity of such incidents, Microsoft deems this a preventative measure to ensure consumer safety.", "Consumers can request free replacement cables via Xbox's website or phone support, with delivery expected within two to four weeks.", "Microsoft advises users to turn off their consoles when not in use and hints at an upcoming Xbox update later in 2005 or early 2006."], "chatgpt-4o-latest": ["Microsoft is replacing over 14 million Xbox power cables due to fire hazard concerns.", "The recall affects Xboxes made before 23 October 2003 (except mainland Europe, where it applies to consoles made before 13 January 2004).", "The company received 30 reports of minor injuries or property damage, though fewer than one in 10,000 consoles experienced failures.", "Most damage was contained within the console, but seven users reported minor burns, and 23 reported smoke or minor property damage.", "Microsoft calls this a precautionary measure and is offering free replacement cables, which can be ordered online or by phone.", "Replacements will arrive within two to four weeks, and users are advised to turn off their consoles when not in use.", "A new Xbox is expected by late 2005 or early 2006."]}