{"raw_text": "Global blogger action day called\n \n The global web blog community is being called into action to lend support to two imprisoned Iranian bloggers.\n \n The month-old Committee to Protect Bloggers' is asking those with blogs to dedicate their sites on 22 February to the \"Free Mojtaba and Arash Day\". Arash Sigarchi and Mojtaba Saminejad are both in prison in Iran. Blogs are free sites through which people publish thoughts and opinions. Iranian authorities have been clamping down on prominent sites for some time. \"I hope this day will focus people,\" Curt Hopkins, director of the Committee, told the BBC News website.\n \n The group has a list of actions which it says bloggers can take, including writing to local Iranian embassies. The Committee has deemed Tuesday \"Free Mojtaba and Arash Day\" as part of its first campaign. It is calling on the blogsphere - the name for the worldwide community of bloggers - to do what it can to help raise awareness of the plight of Mojtaba and Arash as well as other \"cyber-dissidents\". \"If you have a blog, the least you could do is put nothing on that blog except 'Free Mojtaba and Arash Day',\" said Mr Hopkins. \"That would mean you could see that phrase 7.1 million times. That alone will shine some light on the situation. \"If you don't have one, find one dedicated to that - it takes about 30 seconds.\" Technorati, a blog search engine, tracks about six million blogs and says that more than 12,000 are added daily. A blog is created every 5.8 seconds, according to a US research think-tank.\n \n The Committee to Protect Bloggers was started by US blogger Curt Hopkins and counts fired flight attendant blogger Ellen Simonetti as a deputy director. She has since started the International Bloggers' Bill of Rights, a global petition to protect bloggers at work. Although not the only website committed to human rights issues by any means, it aims to be the hub or organisation, information and support for bloggers in particular and their rights to freedom of speech.\n \n The Committee, although only a month old, aims to be the focal point for blogger action on similar issues in the future, and will operate as a non-for-profit organisation. \"Blogging is in this weird no man's land. People think of it as being one thing or another depending on their point of view,\" said Mr Hopkins. \"Some think of themselves as pundits, kind of like journalists, and some like me have a private blog which is just a publishing platform. \"But they do not have a constituency and are out there in the cold.\"\n \n It is not just human rights issues in countries which have a track record of restricting what is published in the media that is of concern to bloggers. The question of bloggers and what rights they have to say what they want on their sites is a thorny one and has received much press attention recently. High profile cases in which employees have been sacked for what they have said on their personal, and often anonymous blogs, have highlighted the muddy situation that the blogsphere is currently in.\n \n \"This is a big messy argument,\" explained Mr Hopkins. He added: \"It is just such a new way of doing business, there will be clamp downs.\" But the way these issues get tested is through the courts which, said Mr Hopkins, \"is part of the whole messy conversation.\" \"If you haven't already got bloggers in your company, you will have them tomorrow - and if you don't have a blogger policy now you had better start looking at having one. Mr Hopkins said that the blogsphere - which is doubling every five months - was powerful because it takes so little time and expertise to create a blog. \"Everyone does this - mums, radicals, conservatives,\" he said. Many companies offer easy-to-use services to create a blog and publish it in minutes to a global community. \"That is the essential difference. What I call 'templating software' gives every single person on Earth the chance to have one. \"You don't even have to have your own computer.\"\n", "llama3.2:1b": ["Global bloggers are being called upon to dedicate their blogs on February 22 to support imprisoned Iranian bloggers Arash Sigarchi and Mojtaba Saminejad.", "The Committee to Protect Bloggers is asking readers to write to local embassies, use the hashtag #FreeMojtabaAndArashDay, or create a blog dedicated to the cause.", "The group is urging individuals with blogs to share information about their sites, with the aim of raising awareness about bloggers' rights.", "The Committee estimates that there are over 12,000 daily blogs worldwide and that more than six million blogs exist globally, according to Technorati.", "Prisoners in Iran are not alone in seeking freedom of speech.", "The blogosphere is facing a complex situation where some individuals with private blogs may be silenced by employers or government authorities.", "The Committee aims to promote blogger rights as part of its efforts to create a new platform for blogging and information sharing, which it sees as a way to challenge traditional media outlets and governments that restrict what is published online."], "llama3.2:3b": ["Global blogger action day called for February 22, to support imprisoned Iranian bloggers Mojtaba and Arash, with actions including dedicating blogs to the cause or writing to local embassies, according to Committee to Protect Bloggers, a new organization."], "gemma2:2b": ["The Committee to Protect Bloggers is asking bloggers worldwide to dedicate their sites on February 22nd to a “Free Mojtaba and Arash Day”.", "This aims to raise awareness for imprisoned Iranian bloggers, highlighting the crackdown on freedom of speech online in Iran.", "The committee provides resources and action steps for bloggers to take part in this campaign, encouraging them to spread the message through their blogs.", "The committee emphasizes the growing power of blogging as a medium for voices worldwide and the importance of developing responsible blog policies."], "qwen2.5:0.5b": ["Iranian bloggers are calling for action to free Arash and Mojtaba, imprisoned in Iran.", "The Iranian authorities have been clamping down on prominent sites for some time.", "Bloggers can pledge not to post content on their blogs without the phrase \"Free Mojtaba and Arash Day\" at the top of it.", "The Committee to Protect Bloggers is a non-profit organization aiming to raise awareness of the plight of Mojtaba and Arash as well as other \"cyber-dissidents\"."], "qwen2.5:1.5b": ["The Iranian bloggers Mojtaba Saminejad and Arash Sigarchi are in prison, prompting a global web blog community action day called \"Free Mojtaba and Arash Day\" on February 22nd.", "The Committee to Protect Bloggers calls for dedicated blogs or sites during this time as part of its first campaign to raise awareness and support the prisoners' cause.", "Blogger Ellen Simonetti started the International Bloggers' Bill of Rights, advocating for bloggers' rights globally."], "qwen2.5:3b": ["The Committee to Protect Bloggers (CPB) calls for support from bloggers worldwide by dedicating their sites on February 22nd, focusing on the plight of imprisoned Iranian bloggers Mojtaba Saminejad and Arash Sigarchi.", "CPB launched \"Free Mojtaba and Arash Day\" as part of its first campaign.", "They encourage bloggers to take actions such as writing to Iranian embassies or dedicating their blog posts for just the day's slogan, \"Free Mojtaba and Arash Day.\"", "The group aims to be a focal point for blogger action on various issues in the future.", "With blogging becoming increasingly popular, companies should consider having policies for their employees' blogs."], "opencoder:1.5b": ["The text you provided summarizes the following key points:\n\n1) The global web blog community is being called into action.", "2) A month-old Committee to Protect Bloggers is asking for actions on blogging issues.", "3) Bloggers can take different actions, including writing to local Iranian embassies.", "4) The group has a list of actions which it believes bloggers can take.", "5) Technorati tracks about six million blogs and says that more than 12,000 are added daily.", "6) High profile cases involving employees who have said on personal blogs include those with anonymous content.", "7) Bloggers' rights to freedom of speech are being focused on.", "It summarizes the focus on bloggers' rights as well as its potential impact on the situation facing the world's web.", "The text does not provide specific details or explanations, and it doesn't mention any reasoning process in terms of how the global web blog community is being called into action."], "smollm:1.7b": ["The text summary above is concise, preserving key ideas and details from the original text while omitting unnecessary information.", "The summary focuses on the main points of the text, including:\n\n1.", "The global web blog community is being called into action to lend support to two imprisoned Iranian bloggers.", "2.", "The month-old Committee to Protect Bloggers' is asking those with blogs to dedicate their sites on 22 February to the \"Free Mojtaba and Arash Day\".", "3.", "The group has a list of actions which it says bloggers can take, including writing to local Iranian embassies.", "4.", "Iranian authorities have been clamping down on prominent sites for some time.", "5.", "The group has deemed Tuesday as \"Free Mojtaba and Arash Day\" as part of its first campaign.", "6.", "It is not just human rights issues in countries which have a track record of restricting what is published in the media that is of concern to bloggers, but also high profile cases in which employees have been sacked for what they have said on their personal, and often anonymous blogs.", "7.", "The question of bloggers and what rights they have to say what they want on their sites is a big messy argument.", "8.", "The way these issues get tested is through the courts which, said Mr Hopkins, \"is part of the whole messy conversation\".", "9.", "Many companies offer easy-to-use services to create a blog and publish it in minutes to a global community.", "10.", "You don't even have to have your own computer."], "deepseek-r1:1.5b": ["The global blogosphere community is participating in an action day called \"Free Mojtaba and Arash Day\" on February 22nd, focusing on two imprisoned Iranian bloggers: Mojtaba Saminejad and Arash Sigarchi.", "The Committee to Protect Bloggers aims to support their rights by providing blogs with tools to address these issues.", "They emphasize the phrase \"Free Mojtaba and Arash Day,\" encouraging readers to include it on their sites.", "Other countries face similar challenges where blogging is often restricted, highlighting the unique and isolated nature of blogging.", "Technorati tracks over six million blogs daily, and 12,000 are added each day according to a research thinktank study.", "The Committee has only been around for a month but is expected to grow as the blogosphere expands.", "Bloggers create their sites every five seconds, though."], "tinyllama:1.1b": ["The Global Blogger Action Day, called by the Committee to Protect Bloggers, aims to support two imprisoned Iranian bloggers and raise awareness of their plight in the worldwide community of bloggers.", "The committee has defined actions that can be taken, including writing letters to local Iranian embassies and posting about Free Mojtaba and Arash Day on individual blogs.", "Initiating such actions will focus people's attention on the situation of imprisoned bloggers and help raise awareness of their plight.", "The Committee also aims to be the hub or organization for blogger action in future, with a non-for-profit organization as its information and support base.", "The question of bloggers' rights to speak out is still being debated in various countries, highlighted by high profile cases of employees being silenced for what they have said on their personal blogs."], "tinydolphin:1.1b": [" The Committee to Protect Bloggers (CPB) has called for global bloggers to dedicate their sites on February 22nd to support two Iranian bloggers, Mojtaba and Arash.", "Mojtaba is currently imprisoned, while Arash is in prison.", "Despite Iran's efforts to silence these bloggers, the Committee aims to highlight the importance of freedom of speech and support for their plight.", "The Committee has devised a list of actions for bloggers to take during this campaign, including writing to local Iranian embassies and urging the blogosphere to take part in the day-long tribute."], "phi:2.7b": [" The Committee to Protect Bloggers has launched an online movement called \"Free Mojtaba and Arash Day\", where bloggers are encouraged to dedicate their sites to raise awareness about two imprisoned Iranian bloggers.", "This is part of the group's first campaign, which also includes actions like writing to local embassies and participating in other similar campaigns.", "The blogosphere, or global community of bloggers, has the potential to make a significant impact by shining light on the situation of Mojtaba and Arash.", "It is important for companies to establish blogger policies to address the rights of their employees who may express opinions on personal blogs.", "Blogging software allows everyone to create a blog in minutes, making it accessible to people from all walks of life."], "orca-mini:3b": [" The Committee to Protect Bloggers is calling for bloggers to dedicate their sites on February 22nd to support imprisoned Iranian bloggers Mojtaba Saminejad and Arash Sigarchi.", "The group is hoping that a day of action will raise awareness about their plight and those of other cyber-dissidents.", "Technorati, a blog search engine, tracks about six million blogs, and more than 12,000 are added daily.", "The Committee to Protect Bloggers was started by US blogger Curt Hopkins and counts Ellen Simonetti as a deputy director.", "It aims to be the hub or organization for bloggers' rights to freedom of speech, information, and support.", "Although not the only website committed to human rights issues, it hopes to be the focal point for blogger action on similar issues in the future."], "hermes3:3b": ["Global bloggers called to support imprisoned Iranian bloggers on Feb 22nd for 'Free Mojtaba and Arash Day'."], "stablelm-zephyr:3b": ["A month-old organization, Committee to Protect Bloggers, is asking the global blog community to support two imprisoned Iranian bloggers, Arash Sigarchi and Mojtaba Saminejad, on what it has named \"Free Mojtaba and Arash Day\" on 22 February.", "The group provides a list of actions that bloggers can take, including writing to local Iranian embassies, and aims to be the focal point for blogger action on human rights issues in the future, working as a non-profit organization.", "It also highlights the concern around bloggers' rights to freedom of speech and their status when employees are sacked for what they have said on their personal blogs."], "stablelm2:1.6b": ["The global web blog community is being called to action by the Committee to Protect Bloggers to support imprisoned Iranian bloggers Arash Sigarchi and Mojtaba Saminejad.", "The group has organized a campaign called \"Free Mojtaba and Arash Day\" and asks bloggers to dedicate their sites on February 28th to raise awareness of the plight of these bloggers, as well as others known as \"cyber-dissidents.\"", "Bloggers can take actions such as writing to local Iranian embassies.", "The Committee aims to be a focal point for blogger action on similar issues in the future and will operate as a non-profit organization.", "The question of what rights bloggers have to say is important, but the way these issues are tested is through the courts."], "granite3.1-dense:2b": ["On February 22, the Committee to Protect Bloggers, founded by US blogger Curt Hopkins and deputy director Ellen Simonetti, launched a global action campaign called \"Free Mojtaba and Arash Day\" to raise awareness for two imprisoned Iranian bloggers, Mojtaba Saminejad and Arash Sigarchi.", "The committee encourages bloggers worldwide to dedicate their sites to this cause on that day.", "Actions suggested include writing to local Iranian embassies and posting a simple message promoting the campaign.", "The Committee aims to be a central hub for supporting bloggers' rights, particularly in countries with restrictive media environments.", "As a non-profit organization, it seeks to address bloggers' lack of constituency and advocate for their freedom of speech.", "Hopkins emphasizes that blogging is an emerging platform with significant influence due to its accessibility; anyone can create a global presence within minutes using user-friendly templates.", "The committee also highlights the growing number of bloggers in corporations, urging businesses to develop blogger policies to navigate the evolving landscape and potential legal challenges faced by bloggers discussing contentious issues."], "chatgpt-4o-latest": ["The Committee to Protect Bloggers is calling on the global blogging community to support two imprisoned Iranian bloggers, Arash Sigarchi and Mojtaba Saminejad, by dedicating their blogs on February 22 to \"Free Mojtaba and Arash Day.\"", "The campaign aims to raise awareness and encourage actions such as writing to Iranian embassies.", "Founded by US blogger Curt Hopkins, the Committee seeks to protect bloggers' rights and serve as a hub for advocacy.", "The growing influence of blogs has sparked debates on free speech, with cases of employees being fired for blog content highlighting legal uncertainties.", "Hopkins emphasizes the power of blogging due to its accessibility and rapid expansion, urging companies to develop policies addressing bloggers' rights."]}