{"raw_text": "Sony PSP console hits US in March\n \n US gamers will be able to buy Sony's PlayStation Portable from 24 March, but there is no news of a Europe debut.\n \n The handheld console will go on sale for $250 (£132) and the first million sold will come with Spider-Man 2 on UMD, the disc format for the machine. Sony has billed the machine as the Walkman of the 21st Century and has sold more than 800,000 units in Japan. The console (12cm by 7.4cm) will play games, movies and music and also offers support for wireless gaming. Sony is entering a market which has been dominated by Nintendo for many years.\n \n It launched its DS handheld in Japan and the US last year and has sold 2.8 million units. Sony has said it wanted to launch the PSP in Europe at roughly the same time as the US, but gamers will now fear that the launch has been put back. Nintendo has said it will release the DS in Europe from 11 March. \"It has gaming at its core, but it's not a gaming device. It's an entertainment device,\" said Kaz Hirai, president of Sony Computer Entertainment America.\n", "llama3.2:1b": ["Sony's PlayStation Portable (PSP) console is scheduled to launch in the US on March 24 for $250.", "The first million consoles sold will include Spider-Man 2 on UMD."], "llama3.2:3b": ["US gamers can buy the Sony PSP console starting March 24 for $250, coming with Spider-Man 2 on UMD discs if sold within the first million units.", "The handheld console features games, movies and music, wireless gaming support, and will enter a market dominated by Nintendo's DS."], "gemma2:2b": ["Sony's PlayStation Portable (PSP) is launching in the US on March 24th for $250 and includes a free copy of Spider-Man 2 with first million units sold.", "The console features gaming, movie and music playback, as well as wireless gaming capability.", "Sony aims to challenge Nintendo's dominance in the handheld market which is currently dominated by the DS.", "While initially planned for a simultaneous European release, the timing has shifted.", "Sony is emphasizing the PSP's broader entertainment focus rather than just its gaming capabilities."], "qwen2.5:0.5b": ["Sony plans to debut its PSP console in the US on March 24, but there is no news of a European release.", "The machine will be priced at $250 and features support for movies, music, wireless gaming, games, and movies.", "The PlayStation Portable (PSP) was launched by Sony in Japan last year and has sold approximately 80 million units.", "It aims to launch the PSP in Europe from March 11, but gamers are concerned that this may be delayed due to Nintendo's planned release of the DS handheld console in Europe on March 24."], "qwen2.5:1.5b": ["Sony's PlayStation Portable console, priced at $250 (£132), will debut in the US on March 24th and come with Spider-Man 2 for the first million units sold.", "The PSP competes against Nintendo's DS handheld device launched last year.", "Sony is expanding its market presence to Europe from its Japan base."], "qwen2.5:3b": ["US gamers can purchase Sony's PlayStation Portable starting March 24th for $250 (£132), with the initial million sold featuring Spider-Man 2 on UMD.", "Sony claims it as a modern Walkman and has sold over 800,000 units in Japan.", "The console ($250/$132) plays games, movies, and music while supporting wireless gaming.", "Sony announced its US debut for March 24th but Europe launch is uncertain, with Nintendo's DS set to arrive on March 11th.", "Kaz Hirai, Sony Computer Entertainment America president, describes the PSP as an entertainment device focusing on gaming core features."], "opencoder:1.5b": ["Sony PSP console hits US in March.", "The handheld console for $250 (£132) will go on sale for first million sold with Spider-Man 2 on UMD, the disc format for the machine.", "First million units sold have been from Japan.", "It has announced it is going to launch the DS handheld in Japan from 11 March."], "smollm:1.7b": ["The summary should be:\nSony PSP console hits US in March with no news of Europe debut.", "The handheld console will go on sale for $250 (£132) and the first million sold will come with Spider-Man 2 on UMD, the disc format for the machine.", "Sony has billed the machine as the Walkman of the 21st Century and has sold more than 800,000 units in Japan.", "The console (12cm by 7.4cm) will play games, movies and music and also offers support for wireless gaming.", "Sony is entering a market which has been dominated by Nintendo for many years.", "It launched its DS handheld in Japan and the US last year and has sold 2.8 million units.", "Sony has said it wanted to launch the PSP in Europe at roughly the same time as the US, but gamers will now fear that the launch has been put back.", "Nintendo has said it will release the DS in Europe from 11 March.", "\"It has gaming at its core, but it's not a gaming device.", "It's an entertainment device,\" said Kaz Hirai, president of Sony Computer Entertainment America."], "deepseek-r1:1.5b": ["Sony PSP console will be available in March for $250, with details on European release delayed due to Nintendo's expected launch of the DS handheld from 11 March.", "Sony aims to compete similarly to Nintendo but faces concerns over the latest launch date."], "tinyllama:1.1b": ["Sony's PlayStation Portable will hit US shelves on March 24 for $250 and the first million sold will come with Spider-Man 2 on UMD disc format.", "The console is said to offer entertainment, music, and wireless gaming capabilities through its 12cm x 7.4cm size, as well as support for other formats like DVDs.", "Ninento has also announced it will release the DS in Europe in March.", "Despite a launch delay in the US, gamers can expect to see Sony's PlayStation Portable make an appearance later this year."], "tinydolphin:1.1b": [" The Sony PSP console, previously known as the PlayStation Portable (PS V), will be available for purchase in the US starting on 24 March at a price of $250.", "The first million consoles sold will come with an exclusive game developed by Marvel and available on disc for UMD format.", "The console will support wireless gaming, as well as playing games, movies, and music.", "In contrast to its predecessor, the DS, which was released in March 2004 in the US, the PSP launches in Europe later this year."], "phi:2.7b": [" The Sony PSP console will be available for purchase in the US starting on March 24th.", "It comes with Spider-Man 2 and is marketed as the Walkman of the 21st Century.", "Sony has already sold over 800,000 units in Japan and aims to make it the dominant handheld gaming device market in Europe.", "The DS was launched a year ago in Japan and the US, with 2.8 million units sold.", "Nintendo will release the DS on March 11th."], "orca-mini:3b": [" Sony will launch its PSP console in the US in March and no information is available about its Europe debut.", "The PSP console will be sold for $250 and the first million units will come with Spider-Man 2 on UMD, the disc format for the machine.", "Sony has been successful in selling more than 800,000 units in Japan, making it the Walkman of the 21st Century.", "However, gamers will now fear that the launch has been put back, as Nintendo has said it will release the DS in Europe from 11 March."], "hermes3:3b": ["PSP console (Sony) releases US March, $250; firstmlln w/ Spider-Man 2 UMD; handheld for games, movies, music, wireless gaming & '21st Century Walkman'."], "stablelm-zephyr:3b": ["The Sony PSP console is set to launch in the US on 24 March for $250 (UK £132), with the first million units including Spider-Man 2 on UMD.", "Billed as the 21st century's version of the Walkman, the portable device will play games, movies, and music while offering wireless gaming support.", "While Sony wanted to launch in Europe around the same time as the US, there is no news of a European debut.", "Entering a market dominated by Nintendo, Sony previously launched its DS handheld in Japan and the US last year, with 2.8 million units sold.", "Kaz Hirai, president of Sony Computer Entertainment America, says the PSP is not just a gaming device but an entertainment one."], "stablelm2:1.6b": ["Sony's PSP console launches in the US in March, with first million units receiving Spider-Man 2 on UMD disc.", "The handheld can play games, movies, and music and offers wireless gaming.", "Japan has sold over 1 million units.", "There was no planned Europe launch but Nintendo has stated it will release DS in Europe from March."], "granite3.1-dense:2b": ["Sony's PlayStation Portable (PSP) console is set to launch in the US on 24 March for $250 (£132), initially offering Spider-Man 2 as a bundled game.", "The compact device, measuring 12cm by 7.4cm, supports gaming, movies, and music, along with wireless gaming capabilities.", "Sony aims to reclaim the market previously dominated by Nintendo's DS, which has sold 2.8 million units in Japan and is expected in Europe on 11 March.", "Kaz Hirai, president of Sony Computer Entertainment America, emphasized that the PSP is an entertainment device with gaming as its core feature."], "chatgpt-4o-latest": ["Sony's PlayStation Portable (PSP) will launch in the US on 24 March for $250, with the first million units including Spider-Man 2 on UMD.", "Already selling over 800,000 units in Japan, the PSP supports gaming, movies, music, and wireless play.", "Sony aims to challenge Nintendo, which has long dominated the handheld market and has sold 2.8 million DS units since its launch.", "While Sony initially planned a simultaneous US and European release, the European launch remains uncertain.", "Meanwhile, Nintendo will release the DS in Europe on 11 March.", "Sony describes the PSP as an entertainment device rather than just a gaming console."]}