{"raw_text": "Iran jails blogger for 14 years\n \n An Iranian weblogger has been jailed for 14 years on charges of spying and aiding foreign counter-revolutionaries.\n \n Arash Sigarchi was arrested last month after using his blog to criticise the arrest of other online journalists. Mr Sigarchi, who also edits a newspaper in northern Iran, was sentenced by a revolutionary court in the Gilan area. His sentence, criticised by human rights watchdog Reporters Without Borders, comes a day after an online \"day of action\" to secure his release. Iranian authorities have recently clamped down on the growing popularity of weblogs, restricting access to major blogging sites from within Iran. A second Iranian blogger, Motjaba Saminejad, who also used his website to report on bloggers' arrests, is still being held.\n \n A spokesman for Reporters Without Borders, which tracks press freedom across the globe, described Mr Sigarchi's sentence as \"harsh\" and called on Iranian President Mohammed Khatami to work to secure his immediate release. \"The authorities are trying to make an example of him,\" the organisation said in a statement.\n \n \"By handing down this harsh sentence against a weblogger, their aim is to dissuade journalists and internet-users from expressing themselves online or contacting foreign media.\" In the days before his arrest Mr Sigarchi gave interviews to the BBC Persian Service and the US-funded Radio Farda. Iranian authorities have arrested about 20 online journalists during the current crackdown. They accused Mr Sigarchi of a string of crimes against Iranian state, including espionage, insulting the founder of Iran's Islamic Republic, Ayatollah Ruhollah Khomenei, and current Supreme Leader Ayatollah Ali Khamenei. Mr Sigarchi's lawyer labelled the revolutionary court \"illegal and incompetent\" and called for a retrial in a public court.\n \n Mr Sigarchi was sentenced one day after an online campaign highlighted his case in a day of action in defence of bloggers around the world.\n \n The Committee to Protect Bloggers designated 22 February 2005 as Free Mojtaba and Arash Day. Around 10,000 people visited the campaign's website during the day. About 12% of users were based in Iran, the campaign's director told the BBC News website. Curt Hopkins said Mr Sigarchi's sentence would not dent the resolve of bloggers joining the campaign to help highlight the case. \"The eyes of 8 million bloggers are going to be more focused on Iran since Sigarchi's sentence, not less. \"The mullahs won't be able to make a move without it be spread across the blogosphere.\"\n", "llama3.2:1b": ["Iranian weblogger Arash Sigarchi was sentenced to 14 years in prison for allegedly spying and aiding foreign counter-revolutionaries.", "He is currently being held after using his online blog to criticize the arrest of other journalists.", "An Iranian blogger, Motjaba Saminejad, who also used a website to report on bloggers' arrests, is still being held."], "llama3.2:3b": ["Arash Sigarchi was jailed for 14 years in Iran on charges of spying and aiding foreign counter-revolutionaries after using his blog to criticize other online journalists' arrests, including his own."], "gemma2:2b": ["Arash Sigarchi, an Iranian weblogger, has been sentenced to 14 years in prison for alleged spying and aiding foreign counter-revolutionaries.", "The sentence was issued by a revolutionary court in Gilan, Iran, following his criticism of other journalists' arrests and interviews with international media.", "Human rights groups criticize the harsh sentence as aimed at suppressing online freedom of expression and have called for Mr. Sigarchi's immediate release."], "qwen2.5:0.5b": ["A weblogger in Iran was sentenced to 14 years in prison for spying and aiding foreign counter-revolutionaries following a crackdown on bloggers' freedom of expression online.", "Iranian authorities arrested Arash Sigarchi last month after using his blog to criticise journalists, but he faced harsher sentences than initially expected due to the restrictions on online blogging in Iran.", "A spokesman for Reporters Without Borders called the sentence \"harsh\" and urged President Khatami to secure Mr Sigarchi's immediate release.", "The arrest of 20 Iranian bloggers during a crackdown led to about 10,000 visitors to their campaign website on that day."], "qwen2.5:1.5b": ["Iranian blogger Arash Sigarchi sentenced to 14 years in prison for criticizing online journalists' arrests, sparking international condemnation and opposition to crackdown on weblogs."], "qwen2.5:3b": ["Iran jails Iranian weblogger Arash Sigarchi for 14 years on charges of spying and aiding foreign counter-revolutionaries.", "His sentencing comes after an online campaign demanding his release following arrest for criticizing other jailed journalists and using his blog to report on blogger arrests.", "The sentence was criticized by human rights groups, including Reporters Without Borders, which called for immediate release.", "Sigarchi's lawyer accused the revolutionary court of being illegal and incompetent.", "A day before his sentencing, he gave interviews to BBC Persian Service and Radio Farda.", "Around 20 Iranian online journalists have been recently arrested during this crackdown.", "The Committee to Protect Bloggers designated February 22 as Free Mojtaba and Arash Day, with around 10,000 visitors visiting the campaign's website globally."], "opencoder:1.5b": ["Iran has banned webloggers for over 2 decades as part of their crackdown against online trolls and corruption.", "An Iranian blogger, Arash Sigarchi, was found guilty after using his blog to promote political campaigns against Islamic state leaders including Ruhollah Khomenei and current Supreme Leader Ali Khamenei.", "A new trial will be ordered after being banned for 14 years from publishing on the internet."], "smollm:1.7b": ["Iran jails blogger for 14 years"], "deepseek-r1:1.5b": ["Iran has jailed two individuals for spying: Arash Sigarchi and Motjaba Saminejad.", "Sigarchi was sentenced to 14 years on charges of espionage and aiding foreign counter-revolutionaries after using his blog to criticize journalist arrests.", "The court in Gilan granted his sentence one day after a social media campaign highlighting his case.", "Meanwhile, the Revolutionary Court in Gilan has been monitoring blogs and limiting access to major platforms.", "Human rights organization Reporters Without Borders criticized the sentence as harsh and called for the release of Mr. Sigarchi's President Mohammed Khatami.", "The Committee to Protect Bloggers designated February 2005 as Free Mojtaba Day, with about 10,000 people visiting a campaign website, mostly from Iran.", "Curt Hopkins noted that his sentence would increase the focus of bloggers joining this campaign to highlight the case and avoid similar actions by mullahs."], "tinyllama:1.1b": ["Iranian weblogger Arash Sigarchi has been sentenced to 14 years in prison for spying and aidgiving foreign counter-revolutionaries.", "He was arrested last month after using his blog to criticize other online journalists in Iran.", "Mr. Sigarchi's sentence comes after an outcry following an \"online day of action\" that secured his release by restricting access to major blogging sites from within Iran.", "A spokesperson for the Committee to Protect Bloggers, a global network of internet activists, called on the Iranian government to release Mr. Sigarchi immediately, stating that his sentence was \"harsh,\" and calling on Iranian President Mohammed Khatazi to work towards his immediate release.", "In recent months, reports have highlighted the growing trend of internet censorship in Iran, as authorities attempt to clamp down on the growth of independent voices within the country's information landscape."], "tinydolphin:1.1b": [" The Iranian weblogger Arash Sigarchi, who was arrested and sentenced to 14 years in jail for allegedly aiding foreign counter-revolutionaries, has become an unlikely symbol of resistance against the country's ruling regime.", "He is just one example of many online activists facing harsh sentences for exercising their right to free expression.", "The spike in arrests and crackdowns on bloggers and internet users in Iran underscores the regime's disdain for dissent, and serves as a reminder that democracies have a responsibility to protect such freedoms."], "phi:2.7b": [" The Iranian blogger Arash Sigarchi was sentenced to 14 years in prison for allegedly spying and aiding foreign counter-revolutionaries.", "His sentence comes after an online campaign called Free Mojtaba Day to secure his release.", "Reporters Without Borders has criticized his harsh sentence as a way to dissuade journalists and internet users from expressing themselves online or contacting foreign media.", "This crackdown on weblogs has also resulted in the arrest of about 20 other online journalists, according to Iranian authorities."], "orca-mini:3b": [" An Iranian blogger has been jailed for 14 years on charges of spying and aiding foreign counter-revolutionaries.", "Arash Sigarchi was arrested last month after using his blog to criticize the arrest of other online journalists.", "He was sentenced by a revolutionary court in the Gilan area, and his sentence has been criticized by human rights watchdog Reporters Without Borders.", "Iranian authorities have recently clamped down on the growing popularity of weblogs, restricting access to major blogging sites from within Iran."], "hermes3:3b": ["Iranian blogger Arash Sigarchi jailed for 14 years on spying and aiding foreign counter-revolutionary charges after using blog to criticise arrests of other online journalists."], "stablelm-zephyr:3b": ["An Iranian blogger, Arash Sigarchi, was sentenced to 14 years in prison on charges of spying and aiding foreign counter-revolutionaries.", "He was arrested after criticizing the arrest of other online journalists on his blog.", "This sentence has been heavily criticized by human rights organization Reporters Without Borders, which called on Iranian President Mohammed Khatami to work towards Sigarchi's immediate release.", "This incident comes during a crackdown on internet freedom in Iran, resulting in the arrest of around 20 online journalists.", "Sigarchi's lawyer claims that the revolutionary court is \"illegal and incompetent\" and demands for a retrial in a public court."], "stablelm2:1.6b": ["An Iranian weblogger, Arash Sigarchi, has been jailed for 5 years on charges of spying and aiding foreign counter-revolutionaries after criticizing the arrest of other online journalists.", "His sentence is criticized by human rights watchdog Reporters Without Borders, who demand his immediate release.", "This follows a recent clampdown by Iranian authorities on the growing popularity of weblogs, restricting access to major blogging sites from within Iran.", "A second Iranian blogger, Motjaba Saminejad, who also uses his website to report on bloggers' arrests, remains in custody.", "The Committee to Protect Bloggers designated February 5 as Free Mojtaba and Arash Day to raise awareness about the case.", "Around 80% of users visited the campaign's website during the day with most based in Iran."], "granite3.1-dense:2b": ["Iranian weblogger Arash Sigarchi has been sentenced to 14 years in prison for spying and aiding foreign counter-revolutionaries, following his arrest last month for criticizing the detention of other online journalists.", "His sentence, condemned by human rights organizations, comes amid Iran's intensifying crackdown on blogging, which has restricted access to major sites within the country.", "Sigarchi, who also edits a newspaper, faces charges of espionage, insulting Ayatollah Ruhollah Khomenei and current Supreme Leader Ali Khamenei.", "His lawyer deemed the revolutionary court \"illegal and incompetent,\" calling for a retrial.", "The sentence was issued one day after an international online campaign, Free Mojtaba and Arash Day, which drew approximately 10,000 participants, amplifying the focus on Sigarchi's case despite the harsh punishment.", "Human rights groups, including Reporters Without Borders, urged Iranian President Mohammed Khatami to intervene for his release, emphasizing that such actions aim to discourage online expression and communication with foreign media."], "chatgpt-4o-latest": ["Iranian blogger Arash Sigarchi has been sentenced to 14 years in prison for espionage and aiding foreign counter-revolutionaries after criticizing the arrest of other online journalists.", "Sigarchi, who also edits a newspaper, was arrested following interviews with foreign media.", "His sentence has been condemned by Reporters Without Borders, which sees it as an attempt to silence online dissent.", "Iranian authorities have intensified their crackdown on bloggers, arresting around 20 online journalists.", "Another blogger, Motjaba Saminejad, remains in custody.", "Sigarchi's sentencing came a day after an online campaign advocating for his release.", "The Committee to Protect Bloggers organized a global awareness day, drawing significant attention to the case.", "Despite the crackdown, activists vow to continue highlighting press freedom issues in Iran."]}