{"raw_text": "T-Mobile bets on 'pocket office'\n \n T-Mobile has launched its latest \"pocket office\" third-generation (3G) device which also has built-in wi-fi - high-speed wireless net access.\n \n Unlike other devices where the user has to check which high-speed network is available to transfer data, the device selects the fastest one itself. The MDA IV, released in the summer, is an upgrade to the company's existing smartphone, the 2.5G/wi-fi MDA III. It reflects the push by mobile firms for devices that are like mini laptops. The device has a display that can be swivelled and angled so it can be used like a small computer, or as a conventional clamshell phone. The Microsoft Mobile phone, with two cameras and a Qwerty keyboard, reflects the design of similar all-in-one models released this year, such as Motorola's MPx. \"One in five European workers are already mobile - meaning they spend significant time travelling and out of the office,\" Rene Obermann, T-Mobile's chief executive, told a press conference at the 3GSM trade show in Cannes. He added: \"What they need is their office when they are out of the office.\" T-Mobile said it was seeing increasing take up for what it calls \"Office in a Pocket\" devices, with 100,000 MDAs sold in Europe already.\n \n In response to demand, T-Mobile also said it would be adding the latest phone-shaped Blackberry to its mobile range. Reflecting the growing need to be connected outside the office, it announced it would introduce a flat-fee £20 ($38) a month wi-fi tariff for people in the UK using its wi-fi hotspots. It said it would nearly double the number of its hotspots - places where wi-fi access is available - globally from 12,300 to 20,000.\n \n It also announced it was installing high-speed wi-fi on certain train services, such as the UK's London to Brighton service, to provide commuters a fast net connection too. The service, which has been developed with Southern trains, Nomad Digital (who provide the technology), begins with a free trial on 16 trains on the route from early March to the end of April. A full service is set to follow in the summer. Wi-fi access points will be connected to a Wimax wireless network - faster than wi-fi - running alongside the train tracks. Brian McBride, managing director of T-Mobile in the UK, said: \"We see a growing trend for business users needing to access e-mail securely on the move.\n \n \"We are able to offer this by maintaining a constant data session for the entire journey.\" He said this was something other similar in-train wi-fi services, such as that offered on GNER trains, did not offer yet. Mr Obermann added that the mobile industry in general was still growing, with many more opportunities for more services which would bear fruit for mobile companies in future. Thousands of mobile industry experts are gathered in Cannes, France, for the 3GSM which runs from 14 to 17 February.\n", "llama3.2:1b": ["T-Mobile has released a third-generation \"pocket office\" device that allows users to access high-speed wireless net access without checking availability.", "The device can automatically select the fastest network and has a display that can be swivelled and angled for use as a small computer or conventional phone.", "T-Mobile is also expanding its wi-fi hotspots, adding new locations in the UK and installing high-speed wi-fi on certain train services to provide fast net connections."], "llama3.2:3b": ["T-Mobile launches \"pocket office\" device with built-in Wi-Fi, allowing users to access high-speed wireless net access automatically.", "The company also expands its services to include a flat-fee £20 monthly Wi-Fi tariff and wi-fi on train services, aiming to meet the growing demand for mobile devices that mimic mini laptops."], "gemma2:2b": ["T-Mobile launched a new pocket office device (MDA IV) that automatically connects to the fastest network and offers features like swiveling display and high-speed connectivity.", "The company is seeing significant demand for this type of device, reflected by its sales figures.", "T-Mobile also announced a flat-fee £20 ($38) monthly wi-fi tariff and plans to increase global wi-fi hotspot access from 12,300 to 20,000.", "T-Mobile is expanding wi-fi on train services through partnerships with Southern trains and Nomad Digital.", "This new service aims to provide secure email access during commutes and utilize a faster Wimax network alongside train tracks.", "T-Mobile believes this will be beneficial for business users and the overall mobile industry is expected to grow further."], "qwen2.5:0.5b": ["T-Mobile is launching a new \"pocket office\" device that uses built-in Wi-Fi and has a swiveling display.", "The company also introduced an all-in-one phone called the Blackberry, with two cameras and a Qwerty keyboard.", "This reflects the design of similar smart devices like the Microsoft Mobile phone and Motorola's MPx.", "T-Mobile plans to introduce its new devices as part of their mobile range, offering Wi-Fi access for business users outside the office."], "qwen2.5:1.5b": ["T-Mobile launches \"pocket office\" devices featuring built-in Wi-Fi, targeting mobile workers with high-speed internet access on-the-go, adding support for Microsoft phones and introducing a £20 monthly WiFi plan.", "The company plans to install high-speed Wi-Fi on train services starting in April."], "qwen2.5:3b": ["T-Mobile launches a third-generation \"pocket office\" device combining 3G and Wi-Fi capabilities that automatically selects the fastest network.", "This upgrade builds on their previous MDA III smartphone, designed as a mini laptop with a swiveling display.", "The company emphasizes its commitment to mobile workers by introducing new Office in a Pocket devices like the Microsoft Mobile phone and Blackberry device.", "T-Mobile also announced a flat-fee £20/month Wi-Fi tariff for UK users accessing hotspots.", "It plans to expand Wi-Fi coverage globally from 12,300 to 20,000 spots, including on certain train services equipped with high-speed Wi-Fi using Wimax technology.", "CEO Rene Obermann forecasts continued growth in the mobile industry and opportunities for new services."], "opencoder:1.5b": ["T-Mobile bets on 'pocket office'.", "It has launched its latest \"pocket office\" third-generation (3G) device with built-in wi-fi - high-speed wireless net access.", "The device selects the fastest one itself, reflecting the push by mobile firms for devices that are like mini laptops.", "It is designed to be used as a small computer, or as a conventional clamshell phone, reflecting design of similar all-in-one models released this year.", "T-Mobile has seen increasing take up for \"Office in a Pocket\" devices, with 100,000 MDAs sold in Europe already.", "T-Mobile also said it would add the latest phone-shaped Blackberry to its mobile range.", "It announced it would introduce a flat-fee wi-fi tariff for people in the UK using its wi-fi hotspots.", "The service has been developed with Southern trains, Nomad Digital (who provide the technology), begins with a free trial on 16 trains on the route from early March to the end of April.", "A full service is set to follow in the summer.", "Wi-fi access points will be connected to a Wimax wireless network - faster than wi-fi - running alongside the train tracks.", "Brian McBride, managing director of T-Mobile in the UK, said: \"We see a growing trend for business users needing to access e-mail securely on the move.\""], "smollm:1.7b": ["The summary is:\n\n* T-Mobile has launched its latest \"pocket office\" third-generation (3G) device which also has built-in wi-fi - high-speed wireless net access.", "* Unlike other devices where the user has to check which high-speed network is available to transfer data, the device selects the fastest one itself.", "* The MDA IV, released in the summer, is an upgrade to the company's existing smartphone, the 2.5G/wi-fi MDA III.", "It reflects the push by mobile firms for devices that are like mini laptops.", "* The device has a display that can be swivelled and angled so it can be used like a conventional clamshell phone.", "* The Microsoft Mobile phone, with two cameras and a Qwerty keyboard, reflects the design of similar all-in-one models released this year, such as Motorola's MPx.", "* \"One in five European workers are already mobile - meaning they spend significant time traveling and out of the office,\" Rene Obermann, T-Mobile's chief executive, told a press conference at the 3GSM trade show in Cannes.", "He added: \"What they need is their office when they are out of the office.\"", "* T-Mobile said it would be adding the latest phone-shaped Blackberry to its mobile range.", "Reflecting the growing need to be connected outside the office, it announced it would nearly double the number of its hotspots - places where wi-fi access is available - globally from 12,300 to 20,000.", "* T-Mobile also announced it was installing high-speed wi-fi on certain train services, such as the UK's London to Brighton service, to provide commuters a fast net connection too.", "Wi-fi access points will be connected to a Wimax wireless network - faster than wi-fi - running alongside the train tracks.", "* Brian McBride, managing director of T-Mobile in the UK, said: \"We see a growing trend for business users needing to access e-mail securely on the move.\"", "He added that he was able to offer this by maintaining a constant data session for the entire journey.", "* The mobile industry in general is still growing, with many more opportunities for more services which would bear fruit for mobile companies in future."], "deepseek-r1:1.5b": ["T-Mobile has launched a \"pocket office\" device with a 3G connection and wi-fi, automatically selecting the fastest network when in use.", "It can swivell or angle like a computer or conventional phone.", "T-Mobile is responding by adding their latest Blackberry device and offering a flat fee £20 (US $38) monthly wi-fi plan to UK customers with multiple hotspots, nearly doubling them globally from 12,300 to 20,000.", "They also installed high-speed internet on certain train services, like London to Brighton, offering secure access while traveling.", "A free trial is available for trains from March 14 to April 7, with a full service likely in summer.", "T-Mobile aims to provide secure email access on the go, targeting Europe and the UK."], "tinyllama:1.1b": ["The latest smartphone by T-Mobile called the MDAs (pocket offices) is a high-speed wireless net access device designed specifically for commuters.", "This new product provides users with fast, reliable internet access while out and about in public spaces like train stations or airports, making it an essential tool for businesses and individuals who need to stay connected on the go.", "The MDAs are part of T-Mobile's efforts to offer a comprehensive mobile service portfolio that caters to the needs of their customers in all areas, including office-goers and business travelers.", "Despite growing demand for high-speed wi-fi, the company is investing in expanding its network of hotspots globally and providing commuters with faster access to the web on trains through its partnership with Nomad Digital."], "tinydolphin:1.1b": [" T-Mobile has launched its latest pocket office device with built-in Wi-Fi capabilities and a range of new features that aim to make work on the go more convenient than ever before.", "The MDA IV is an upgrade to the existing T-Mobile MDA III, offering improved performance and connectivity in a compact design that easily fits in your pocket.", "The device has a high-resolution display with an angled swivel feature for easy use on both land and water, while its Qwerty keyboard adds a touch of sophistication to its overall look and feel.", "One of the key features of the MDA IV is its support for high-speed Wi-Fi access, which means users can enjoy fast internet connectivity when they need it most.", "This feature will be particularly useful for commuters who are on the go a lot and want to access the internet quickly while they're out and about.", "In addition to its built-in Wi-Fi capabilities, the MDA IV also offers a range of other features that make it an attractive option for mobile users looking to stay connected while on the move.", "These include a 3G connection, allowing users to access high-speed networks when they're not using their wi-fi hotspot; as well as the ability to connect to various mobile networks worldwide, ensuring that the device can be used where there is no Wi-Fi coverage.", "The MDA IV also offers a range of new features designed to make work easier and more convenient than ever before.", "These include a feature known as \"One in five European workers are already mobile\", which suggests that many people are already using devices like the MDA IV to carry out their work outside of the office.", "This trend is expected to grow in the coming years, with companies investing in devices like these to make it easier for employees to connect when they're not at their desks.", "In addition to its improved connectivity capabilities and new features, the MDA IV also boasts a range of accessories designed to make it even more convenient to use on-the-go.", "These include a flat-fee £20 wi-fi tariff for UK users, as well as high-speed wi-fi options on certain train services that are being developed with Southern Trains and Nomad Digital.", "Overall, the MDA IV is expected to have a significant impact on the way people access information and connect with each other when they're out of the office, making work more productive and enjoyable than ever before."], "phi:2.7b": [" T-Mobile's latest 3G phone has built-in Wi-Fi and selects the fastest network automatically, allowing users to use it as a pocket office on-the-go.", "The company is also launching its first all-in-one phone with built-in cameras and Qwerty keyboard.", "T-Mobile plans to increase its Wi-Fi hotspots globally and offer a flat-fee £20 a month for wi-fi access in the UK.", "It's also installing high-speed Wi-Fi on certain train services, such as the London-Brighton service, with a free trial beginning in March."], "orca-mini:3b": [" T-Mobile has released a new smartphone called MDA IV that has built-in Wi-Fi and can select the fastest network to transfer data.", "Unlike other devices where the user checks which high-speed network is available, the device chooses the fastest one itself.", "T-Mobile also announced it would be adding a new phone-shaped Blackberry to its mobile range.", "The company plans to nearly double the number of wi-fi hotspots globally from 12,300 to 20,000.", "T-Mobile is installing high-speed Wi-Fi on certain train services, such as London to Brighton service, to provide commuters with a fast net connection too.", "The company plans to offer a free trial of the service on 16 trains from early March to the end of April and launch a full service in the summer.", "T-Mobile believes that more than one in five European workers are mobile and need their office when they are out of the office.", "The company also announced that it would be adding Wi-Fi to certain train services, which will provide commuters with a fast net connection."], "hermes3:3b": ["T-Mobile releases 'pocket office' 3G device with built-in Wi-Fi, aiming to provide a mini laptop experience for mobile workers; also plans £20/mo Wi-Fi tariff and wi-fi on train services."], "stablelm-zephyr:3b": ["T-Mobile launched its \"pocket office\" 3G device with built-in Wi-Fi, offering fast wireless net access without requiring a user's attention to identify the fastest network available.", "The MDA IV is an upgrade to the company's existing smartphone, the 2.5G/wi-fi MDA III, and has a swivel display that can be used like a small computer or as a conventional clamshell phone.", "T-Mobile reported increasing demand for \"Office in a Pocket\" devices, with 100,000 MDAs sold in Europe.", "The company announced plans to add the latest Blackberry model to its mobile range and introduce a flat-fee £20 ($38) a month Wi-Fi tariff for UK customers using its hotspots.", "T-Mobile also collaborated with Southern Trains to install high-speed Wi-Fi on select train services, including the London to Brighton route, starting with a free trial in early March."], "stablelm2:1.6b": ["T-Mobile has released its latest \"Pocket Office\" 3G device that automatically selects the fastest network for wireless data transfer.", "The MDA IV is an upgrade to T-Mobile's existing smartphone model, and it is designed as a mini laptop or conventional clamshell phone.", "It features a swiveling and angled display which can be used like a small computer or conventional phone.", "This device reflects the push by mobile companies for devices that are like mini laptops.", "The Microsoft Mobile phone with two cameras and a Qwerty keyboard is also an example of similar all-in-one models released this year, such as Motorola's MPx.", "T-Mobile has seen increasing demand for its \"Office in a Pocket\" devices, selling MDA phones in Europe already.", "To respond to the growing need for connectivity outside the office, T-Mobile will introduce a flat-fee £1 ($1) per month wireless internet tariff for UK users using its Wi-Fi hotspots, nearly doubling their number globally.", "The company is also installing high-speed Wi-Fi on certain train services, such as the UK's London to Brighton service, to provide commuters a fast net connection."], "granite3.1-dense:2b": ["T-Mobile has introduced its latest \"pocket office\" device, the MDA IV, designed to mimic a mini laptop.", "This 3G/wi-fi smartphone features a swivelable and angleable display, enabling users to work like they would on a small computer or as a traditional clamshell phone.", "The device, an upgrade from T-Mobile's existing MDA III, is part of the broader trend towards all-in-one mobile devices.", "Chief Executive Rene Obermann highlighted that one in five European workers frequently work outside offices, emphasizing the need for \"Office in a Pocket\" capabilities.", "As of now, 100,000 MDAs have been sold in Europe.", "In response to growing demand, T-Mobile plans to expand its Blackberry range and launch a £20 ($38) monthly flat-fee wi-fi tariff for UK customers using its hotspots, increasing the total number of hotspots globally from 12,300 to 20,000.", "Additionally, T-Mobile is installing high-speed wi-fi on certain train services, including London to Brighton, powered by a Wimax wireless network running alongside train tracks.", "This free trial will begin in early March and expand to full service later in the summer.", "The company aims to maintain constant data sessions for seamless connectivity during commutes, offering secure email access on the move—a feature currently not available from similar in-train wi-fi services like GNER trains' offerings.", "T-Mobile's Executive Chief, Rene Obermann, expressed confidence in the mobile industry's ongoing growth and anticipates more innovative services for future developments at the 3GSM conference in Cannes, France."], "chatgpt-4o-latest": ["T-Mobile has launched the MDA IV, a 3G \"pocket office\" device with built-in wi-fi that automatically selects the fastest available network.", "The device, an upgrade to the MDA III, features a swivel display, Qwerty keyboard, and two cameras, resembling a mini laptop.", "T-Mobile's CEO highlighted the growing need for mobile office solutions, with 100,000 MDAs already sold in Europe.", "In response to demand, T-Mobile is adding the latest Blackberry to its lineup and introducing a £20 monthly wi-fi tariff in the UK while nearly doubling its global wi-fi hotspots.", "The company is also installing high-speed wi-fi on certain train routes, starting with a free trial on London to Brighton trains, using Wimax technology for continuous connectivity.", "T-Mobile sees increasing demand for secure mobile email access and anticipates further growth in mobile services.", "The announcements were made at the 3GSM trade show in Cannes."]}