{"raw_text": "Apple attacked over sources row\n \n Civil liberties group the Electronic Frontier Foundation (EFF) has joined a legal fight between three US online journalists and Apple.\n \n Apple wants the reporters to reveal 20 sources used for stories which leaked information about forthcoming products, including the Mac Mini. The EFF, representing the reporters, has asked California's Superior court to stop Apple pursuing the sources. It argues that the journalists are protected by the American constitution. The EFF says the case threatens the basic freedoms of the press.\n \n Apple is particularly keen to find the source for information about an unreleased product code-named Asteroid and has asked the journalists' e-mail providers to hand over communications relevant to that. \"Rather than confronting the issue of reporter's privilege head-on, Apple is going to the journalist's ISPs for his e-mails,\" said EFF lawyer Kurt Opsahl. \"This undermines a fundamental First Amendment right that protects all reporters. \"If the court lets Apple get away with this, and exposes the confidences gained by these reporters, potential confidential sources will be deterred from providing information to the media and the public will lose a vital outlet for independent news, analysis and commentary,\" he said. The case began in December 2004 when Apple asked a local Californian court to get the journalists to reveal their sources for articles published on websites AppleInsider.com and PowerPage.org.\n \n Apple also sent requested information from the Nfox.com, the internet service provider of PowerPage's publisher Jason O-Grady. As well as looking at how far corporations can go in preventing information from being published, the case will also examine whether online journalists have the same privileges and protections as those writing for newspapers and magazines. The EFF has gained some powerful allies in its legal battle with Apple, including Professor Tom Goldstein, former dean of the Journalism School at the University of California and Dan Gillmor, a well-known Silicon Valley journalist. Apple was not immediately available for comment.\n", "llama3.2:1b": ["Apple is suing three US online journalists to stop them from revealing 20 sources used in stories about forthcoming products.", "The Electronic Frontier Foundation (EFF) argues that the journalists are protected by the American constitution and that Apple's actions threaten their First Amendment rights."], "llama3.2:3b": ["EFF joins fight between US online journalists and Apple over sources used in stories leaked about upcoming products, arguing that journalists' freedom is under threat."], "gemma2:2b": ["Apple is suing three US online journalists to uncover their sources for leaked information about upcoming products.", "The Electronic Frontier Foundation (EFF), representing the journalists, argues that they are protected by the First Amendment and that this case threatens press freedom.", "The EFF claims Apple's request of email providers for journalist communications goes against journalistic privilege and could deter other potential sources from coming forward.", "The case started in 2004 and focuses on whether online journalists have similar rights as traditional media outlets."], "qwen2.5:0.5b": ["Apple and the Electronic Frontier Foundation (EFF) are involved in a legal row over sources leaked from online journalists.", "The EFF claims that the reporters' sources may be protected by the American constitution while Apple seeks to find their e-mail providers for information about unreleased product codes.", "This action aims to expose potential confidential sources, potentially hindering independent news and commentary."], "qwen2.5:1.5b": ["Civil liberties group EFF joins legal fight between US online journalists and Apple over sources, seeking to protect reporters' privileges under First Amendment.", "Apple wants AppleInsider.com and PowerPage.org journalists to reveal 20 leaked source identities related to upcoming products, including Mac Mini.", "The case threatens basic press freedoms by questioning the constitutionality of requesting journalist's email communications for news purposes.", "This approach undermines reporter confidentiality, potentially discouraging potential sources from providing information.", "Cases may also extend examination of online journalism privileges against traditional media."], "qwen2.5:3b": ["Apple attacked over sources row where civil liberties group EFF is representing three US online journalists in a legal fight with Apple.", "Apple seeks to force reporters to reveal 20 information-leaking sources related to upcoming products like the Mac Mini, including an unreleased product code-named Asteroid.", "The EFF argues this violates American constitution's protection for press and could discourage future source contributions.", "The case started in December 2004 when Apple initially asked a local Californian court for reporters' source information.", "Powerful allies such as former journalism school dean Tom Rosenstiel and Silicon Valley journalist Dan Gillmor support the journalists.", "Apple has not responded to criticism."], "opencoder:1.5b": ["Apple attacked over sources row \n\nCivil liberties group the Electronic Frontier Foundation (EFF) has joined a legal fight between three US online journalists and Apple.", "They argue that the case threatens the basic freedoms of the press.", "Apple is particularly keen to find the source for information about an unreleased product code-named Asteroid, asking the journalists' e-mail providers to hand over communications relevant to that issue.", "\"Rather than confronting the issue of reporter's privilege head-on, Apple is going to the journalist's ISPs for his e-mails,\" said EFF lawyer Kurt Opsahl.", "The case began in December 2004 when Apple asked a local Californian court to get the journalists to reveal their sources for articles published on websites AppleInsider.com and PowerPage.org.", "The case also examines whether online journalists have the same privileges and protections as those writing for newspapers and magazines.", "The EFF has gained some powerful allies in its legal battle with Apple, including Professor Tom Goldstein and Dan Gillmor."], "smollm:1.7b": ["Apple is attacking over sources row because it wants to find the source for information about an unreleased product code-named Asteroid.", "The EFF has joined a legal fight between three US online journalists and Apple, representing the reporters.", "Apple wants the journalists to reveal 20 sources used for stories which leaked information about forthcoming products, including the Mac Mini.", "The EFF argues that the journalists are protected by the American constitution.", "The EFF says the case threatens the basic freedoms of the press.", "Apple is particularly keen to find the source for information about an unreleased product code-named Asteroid and has asked the journalists' e-mail providers to hand over communications relevant to that.", "\"Rather than confronting the issue of reporter's privilege head-on, Apple is going to the journalist's ISPs for his e-mails,\" said EFF lawyer Kurt Opsahl.", "\"This undermines a fundamental First Amendment right that protects all reporters.\"", "If the court lets Apple get away with this, and exposes the confidences gained by these journalists, potential confidential sources will be deterred from providing information to the media and the public will lose a vital outlet for independent news, analysis and commentary.", "The case began in December 2004 when Apple asked a local Californian court to get the journalists to reveal their sources for articles published on websites AppleInsider.com and PowerPage.org."], "deepseek-r1:1.5b": ["Apple seeks to expose online journalists for leaking information about an unreleased product, Asteroid, through their websites.", "The Electronic Frontier Foundation is involved in a legal battle to protect the journalists' Freedom of the First Amendment.", "The case began in 2004 when Apple requested the journalists' e-mails via sites like PowerPage.org and Nfox.com."], "tinyllama:1.1b": ["Apple has filed a legal action against three US online journalists, seeking to reveal the identities of 20 sources used in stories published on websites such as PowerPage.org and AppleInsider.com.", "The Electronic Frontier Foundation (EFF), representing the reporters, is challenging Apple's assertion that they are entitled to protection under the American constitution for information about an unreleased product code-named Asteroid.", "The case threatens a fundamental First Amendment right protecting all reporters, including those writing for newspaper and magazine publishers.", "Additionally, if Apple is successful in obtaining this information, it will potentially stop news outlets from providing information to the media and the public, undermining independent news analysis and commentary.", "The case began in December 2004 when Apple sent requests to Nfox.com for information from three online journalists covering stories published on their websites, including PowerPage.org and AppleInsider.com.", "It also asked California's Superior Court to stop Apple from pursuing the same journalists' e-mail providers for their communication details relevant to Asteroid.", "EFF lawyer Kurt Opsehl is challenging this under the First Amendment right of reportage, citing that such a privilege protects all reporters, including those writing for newspaper and magazine publishers.", "In its legal case against Apple, the Electronic Frontier Foundation has gained some powerful allies in its legal battle, including Professor Tom Goldstein, former dean of the Journalism School at the University of California, and Dan Gillmor, a well-known Silicon Valley journalist."], "tinydolphin:1.1b": [" Summary: In this legal case, three US online journalists are challenging Apple's request to reveal the identities of 20 sources they used in an article on forthcoming products.", "The EFF, representing the journalists, is asking a California court to stop Apple from accessing information from the reporters' e-mail providers.", "This case threatens basic freedoms of the press and raises questions about whether online journalists have the same privacy rights as those writing for newspapers and magazines."], "phi:2.7b": [" A legal fight between three US online journalists and Apple over sources used to publish articles about forthcoming products is ongoing.", "The Electronic Frontier Foundation (EFF) has intervened on behalf of the journalists, arguing that they are protected by the First Amendment and should be allowed to keep their sources confidential.", "Apple wants to know the source for information about an unreleased product code-named Asteroid and has requested e-mails from the journalists' email providers.", "The case is significant because it could set a precedent for online journalism and freedom of the press in the digital age."], "orca-mini:3b": [" Apple is suing three online journalists, demanding they reveal their sources for stories about upcoming products.", "The Electronic Frontier Foundation (EFF) has joined the legal fight, arguing that the journalists have the same protection as those writing for newspapers and magazines.", "Apple wants information from a website provider that provided data to the publishers of two other websites.", "The case could set precedent for online journalists' privileges and protections."], "hermes3:3b": ["Apple seeks journalists' source revelations, says EFF threatens press freedoms"], "stablelm-zephyr:3b": ["The Electronic Frontier Foundation (EFF) has intervened in a legal dispute between three US online journalists and tech giant Apple, arguing that the journalists' First Amendment rights have been violated by the company's demand for them to reveal their sources for stories about unreleased products.", "The EFF is seeking to protect these reporters against Apple’s pressure, stating that this case threatens the basic freedoms of the press.", "It asserts that rather than directly confronting the issue of reporter’s privilege, Apple has asked the journalists' email providers to hand over communications relevant to particular articles published on websites AppleInsider.com and PowerPage.org.", "The EFF believes that if the court allows Apple's request, it could undermine confidential sources providing information to reporters, thereby undermining vital outlets for independent news, analysis, and commentary in the public interest."], "stablelm2:1.6b": ["Apple is involved in a legal dispute with three US online journalists over revealing their sources for stories that leaked information about forthcoming products, including the Mac Mini.", "The Electronic Frontier Foundation (EFF), representing the journalists, has asked California's Superior court to stop Apple from pursuing the sources.", "They argue that the journalists are protected by the American constitution and that this case threatens basic freedoms of the press.", "Apple is particularly keen to find the source for an unreleased product code- named Asteroid and has asked the journalists' email providers to hand over communications relevant to that.", "The case will also examine whether online journalists have the same privileges and protections as those writing for newspapers and magazines.", "The EFF has gained allies in their legal battle with Apple, including a professor and a prominent Silicon Valley journalist."], "granite3.1-dense:2b": ["Apple is embroiled in a legal dispute with three US online journalists and the Electronic Frontier Foundation (EFF), representing the reporters.", "The conflict stems from Apple's request to uncover sources of stories that revealed information about upcoming products, including the Mac Mini and an unnamed product code-named Asteroid.", "The EFF argues that this pursuit infringes upon journalists' First Amendment rights, which protect confidential sources and maintain freedom of the press.", "Apple has sought access to the reporters' emails through their internet service providers (ISPs), a tactic the EFF contends undermines these constitutional protections.", "The case also raises questions about whether online journalists receive the same privileges as traditional media outlets.", "Key allies in this legal battle include Professor Tom Goldstein and Dan Gillmor, well-known Silicon Valley journalists.", "Apple has not provided a comment on the issue yet."], "chatgpt-4o-latest": ["Civil liberties group EFF has joined a legal battle between Apple and three US online journalists, opposing Apple's demand to reveal sources for leaked product information, including the Mac Mini.", "The EFF argues that forcing journalists to disclose sources violates First Amendment protections and threatens press freedom.", "Apple is particularly focused on identifying the source of leaks about an unreleased product, Asteroid, and has sought journalists' emails from their ISPs.", "The case, which began in December 2004, raises questions about corporate control over information and whether online journalists have the same legal protections as traditional media.", "The EFF has gained support from prominent journalism figures, while Apple has not commented."]}