{"raw_text": "'No re-draft' for EU patent law\n \n A proposed European law on software patents will not be re-drafted by the European Commission (EC) despite requests by MEPs.\n \n The law is proving controversial and has been in limbo for a year. Some major tech firms say it is needed to protect inventions, while others fear it will hurt smaller tech firms The EC says the Council of Ministers will adopt a draft version that was agreed upon last May but said it would review \"all aspects of the directive\". The directive is intended to offer patent protection to inventions that use software to achieve their effect, in other words, \"computer implemented invention\".\n \n In a letter, EC President Jos&#233; Manuel Barroso told the President of the European Parliament, Josep Borrell, that the Commission \"did not intend to refer a new proposal to the Parliament and the Council (of ministers)\" as it had supported the agreement reached by ministers in May 2004.\n \n If the European Council agrees on the draft directive it will then return for a second reading at the European Parliament. But that will not guarantee that the directive will become law - instead it will probably mean further delays and controversy over the directive. Most EU legislation now needs the approval of both parliament and the Council of Ministers before it becomes law. French Green MEP Alain Lipietz warned two weeks ago that if the Commission ignored the Parliament's request it would be an \"insult\" to the assembly. He said that the parliament would then reject the Council's version of the legislation as part of the final or conciliation stage of the decision procedure. In the US, the patenting of computer programs and internet business methods is permitted.\n \n This means that the US-based Amazon.com holds a patent for its \"one-click shopping\" service, for example. Critics are concerned that the directive could lead to a similar model happening in Europe. This, they fear, could hurt small software developers because they do not have the legal and financial might of larger companies if they had to fight patent legal action in court. Supporters say current laws are inefficient and it would serve to even up a playing field without bringing EU laws in line with the US.\n", "llama3.2:1b": ["The European Commission is keeping a proposed law on software patents in place despite requests from MEPs.", "The law was agreed upon by ministers in May 2004 but will be reviewed before adoption, with further delays and controversy possible.", "If adopted, it would protect inventions that use software to achieve their effect, but critics fear it could hurt smaller tech firms.", "Most EU legislation requires approval from both parliament and the Council of Ministers for laws to become law, which some argue would be redundant given the proposed directive's scope."], "llama3.2:3b": ["The European Commission will not re-draft the proposed European law on software patents, despite requests from MEPs.", "The Council of Ministers has agreed on a draft version, but may still face controversy and delays as it needs approval from both parliament and council ministers before becoming law.", "Critics fear that EU laws could lead to similar patenting practices in the US, harming small software developers, while supporters argue that this would bring EU laws in line with those in the US and create a more level playing field."], "gemma2:2b": ["The European Commission will not re-draft its proposed software patent law despite requests by MEPs.", "The draft directive, intended to offer patent protection for \"computer implemented inventions,\" is controversial and has been in limbo for a year.", "While the European Council may approve the draft, it still needs approval from the European Parliament, potentially leading to further delays and controversy."], "qwen2.5:0.5b": ["A proposal for EU software patents legislation has not been re-drafted despite efforts from MEPs.", "The EC's Council of Ministers will adopt a draft version but will review \"all aspects\" before returning it for parliament approval, potentially leading to further delays and controversy.", "This would mean that patenting computer programs and internet business methods is permitted in the US, which critics warn could hurt small software developers if they have to fight patent legal action in court.", "Supporters say EU laws should be more efficient and serve as a balancing mechanism between the US and EU standards."], "qwen2.5:1.5b": ["The European Commission is rejecting requests by MEPs for a re-drafting of proposed software patents law, which has been controversial since 2004 but remains stuck due to delays and disagreement among member states."], "qwen2.5:3b": ["A proposed European law on software patents will not be re-drafted by the EC despite requests from MEPs, as the Council of Ministers will adopt a May 2004 draft version.", "The directive aims to provide patent protection for inventions using software but is controversial and has been in limbo for a year.", "Tech firms support it for invention protection, while smaller tech firms fear it could hurt them.", "EC President José Manuel Barroso told the European Parliament president that no new proposal would be referred to both parliament and council as they had agreed upon May 2004 draft version.", "The directive will likely face further delays and controversy in becoming law since most EU legislation requires approval from both parliament and Council of Ministers, which could result in rejection by MEPs during the conciliation stage.", "Critics are concerned it might lead to similar issues as in the US where patenting of computer programs is allowed, potentially harming small software developers.", "Supporters argue current laws are inefficient and aim to level the playing field without aligning EU laws with U.S. ones."], "opencoder:1.5b": ["The proposed European law on software patents will not be re-drafted by the European Commission (EC) despite requests by MEPs.", "The directive is proving controversial and has been in limbo for a year.", "It says that EU members should get patent protection to inventions that use software, but it doesn't cover all aspects of the directive.", "Some tech firms might say that it's needed because they want to protect their inventions, while others fear that it will hurt smaller tech firms.", "The European Commission President Josep Borrell told the President of the European Parliament, \"Did not intend to refer a new proposal to the Parliament and the Council (of ministers)\" as it had supported the agreement reached by ministers in May 2004.", "If the European Council agrees on the draft directive, it will return for a second reading at the European Parliament.", "However, this means that it might involve further delays and controversy over the directive.", "The EU legislation now needs approval from both the parliament and the Council of Ministers before it becomes law.", "The US-based Amazon.com holds a patent for its \"one-click shopping\" service, but critics worry about potential legal issues if they had to fight patent legal action in court.", "Supporters argue that current laws are inefficient without bringing EU rules into line with the US."], "smollm:1.7b": ["The proposed European law on software patents will not be re-drafted by the European Commission (EC) despite requests from MEPs.", "The EC says that the law is proving controversial and has been in limbo for a year, while some major tech firms say it is needed to protect inventions, while others fear it will hurt smaller tech firms.", "The EC says the directive is intended to offer patent protection to inventions that use software to achieve their effect, but this proposal has not yet been approved by the European Parliament (EP).", "The law is proving controversial and has been in limbo for a year.", "Some major tech firms say it is needed to protect inventions, while others fear it will hurt smaller tech firms.", "The EC says the directive is intended to offer patent protection to inventions that use software to achieve their effect, but this proposal has not yet been approved by the European Parliament (EP).", "In a letter, EC President Jos&#233; Manuel Barroso told the President of the European Parliament, Josep Borrell, that the Commission \"did not intend to refer a new proposal to the Parliament and the Council (of ministers)\" as it had supported the agreement reached by ministers in May 2004.", "If the European Council agrees on the draft directive it will then return for a second reading at the European Parliament.", "But that will not guarantee that the directive will become law - instead, further delays and controversy over the directive are likely to occur.", "Most EU legislation now needs the approval of both parliament and the Council of Ministers before it becomes law.", "French Green MEP Alain Lipietz warned two weeks ago that if the Commission ignored the Parliament's request it would be an \"insult\" to the assembly.", "He said that the parliament would then reject the Council's version of the legislation as part of the final or conciliation stage of the decision procedure.", "In the US, the patenting of computer programs and internet business methods is permitted.", "Critics are concerned that the directive could lead to a similar model happening in Europe.", "This, they fear, could hurt small software developers because they do not have the legal and financial might of larger companies if they had to fight patent legal action in court.", "Supporters say current laws are inefficient and it would serve to even up a playing field without bringing EU laws in line with the US."], "deepseek-r1:1.5b": ["The European Commission (EC) has proposed a law on software patents but will not re-draft it as requested by EU Parliament members.", "The proposed law is controversial and pending finality, with major tech firms supporting its creation to protect inventories while fears remain about potential harm to smaller tech companies.", "The EC plans to adopt a draft version approved last May but will require \"all aspects\" of the directive to be reviewed.", "If agreed upon, it will likely undergo a second reading at the European Parliament, potentially leading to delays and further controversy.", "In the US, Amazon.com holds a patent for its \"one-click shopping\" service, which could apply in Europe, risking harm to small tech firms by limiting their ability to address patent legal actions in court.", "This reflects a broader concern about EU software patents possibly behaving similarly to U.S.-based ones, despite having more recognition internationally."], "tinyllama:1.1b": ["The European Commission has rejected proposals for re-drafting the proposed software patent law as they do not \"intend\" to refer it to the Parliament and Council for a second reading, citing concerns about delaying its passage into law.", "While the directive is intended to offer patent protection to inventions that use software to achieve their effect, critics fear that the re-draft would lead to similar models happening in Europe, harming small software developers.", "European Parliament and Council have previously approved this legislation after a series of revisions, but a second reading now requires approval from both parliaments and ministers.", "Critics suggest that further delays and controversy around the directive could hurt smaller businesses while supporters argue current laws are inefficient and need to be improved without bringing EU laws in line with the US."], "tinydolphin:1.1b": [" The proposed European law on software patents has been put on hold as negotiations between the European Parliament, Council of Ministers and the European Commission continue.", "The directive, known as \"The Patent Box\", aimed to protect inventions that used computer-implemented features, such as automatic software updates or automatic accounting.", "However, some major tech companies have expressed concerns about how the proposal would affect their businesses.", "Critics argue that it could lead to similar business models in Europe as seen in the US, where Amazon's \"one-click shopping\" service is protected by a patent for its \"click and collect\" feature."], "phi:2.7b": [" A European law on software patents is controversial, but the EC has decided not to re-draft it despite requests from MEPs.", "The directive is intended to protect inventions that use software to achieve their effect, but some fear it could harm smaller tech firms.", "If the council agrees on the draft, it will go back for a second reading at the parliament, but there's no guarantee it will become law.", "Most EU legislation needs approval from both parliament and the council before becoming law, so if the commission ignores the parliament's request, it may lead to further delays and controversy over the directive."], "orca-mini:3b": [" The European Commission does not plan to re-draft the proposed European law on software patents, despite requests by MEPs.", "The law is controversial and has been in limbo for a year, and some major tech firms support it, while others fear it will hurt smaller tech firms.", "The EC says it will review \"all aspects\" of the directive, but it does not plan to re-draft it.", "The European Council agrees on the draft directive, but it will likely cause further delays and controversy over the legislation.", "The Parliament will also reject the Council's version if it ignores its request.", "In the US, software programs and internet business methods are patentable.", "However, critics worry that this could hurt small software developers if they have to fight patent legal action in court.", "Supporters say current laws are inefficient and even-up a playing field without bringing EU laws in line with the US."], "hermes3:3b": ["European Commission not revising software patent law; will leave draft agreed by Council of Ministers despite MEP requests."], "stablelm-zephyr:3b": ["The European Commission will not re-draft a proposed European law on software patents, despite requests from MEPs.", "The law has been met with controversy and has been in limbo for a year.", "Agreeing on the draft version last May, the Council of Ministers will now review \"all aspects of the directive.\"", "The directive aims to offer patent protection to inventions that use software to achieve their effect, known as \"computer implemented invention.\"", "If the European Council agrees on the draft directive, it will return for a second reading at the European Parliament.", "However, this will not guarantee the directive becomes law and may result in further delays and controversy.", "Critics are concerned the directive could lead to a US-like model where small software developers might be hurt due to lack of legal and financial means to fight patent actions in court.", "Supporters argue current laws are inefficient and would level the playing field without bringing EU laws into alignment with the US."], "stablelm2:1.6b": ["The European Commission will not re-draft a proposed law on software patents, despite requests by MEPs.", "The directive aims to provide patent protection for computer implemented inventions (i.e., software).", "The Council of Ministers will adopt a draft version agreed upon last May, but it will be reviewed across all aspects.", "If the European Council agrees on the final directive, there could be further delays and controversy.", "Currently, US laws permit patenting of computer programs and internet business methods; Amazon.com holds a patent for its one-click shopping service, raising concerns about potential monopolies in Europe.", "Critics argue that allowing software patents could hurt small developers due to the financial power of larger companies when they face legal action.", "Supporters believe current laws are inefficient and the new law would even out the playing field without enforcing EU laws with US ones."], "granite3.1-dense:2b": ["The European Commission (EC) has decided not to re-draft its proposed software patent law, despite demands from MEPs.", "The directive, agreed upon by ministers in May 2004, aims to grant patent protection for computer-implemented inventions.", "The EC will now let the Council of Ministers adopt the draft, and it is expected to undergo review.", "This process may result in further delays and controversy, as the directive must secure approval from both the European Parliament and the Council before becoming law.", "The proposal faces criticism from some MEPs, who fear it will harm smaller tech firms due to their potential inability to defend themselves against patent legal actions.", "Supporters argue that current laws are inefficient and propose this directive would level the playing field without aligning EU laws with those of the US, where software programs and internet business methods can be patented.", "Critics worry that a similar model could emerge in Europe, potentially disadvantaging small software developers against larger corporations' financial and legal capabilities."], "chatgpt-4o-latest": ["The European Commission (EC) will not re-draft a proposed law on software patents despite requests from MEPs.", "The directive, which has been stalled for a year, aims to protect inventions using software but is controversial, with major tech firms supporting it and smaller firms fearing negative impacts.", "The EC insists the Council of Ministers will adopt the draft agreed upon in May 2004, though all aspects will be reviewed.", "If approved by the European Council, it will return to the European Parliament for a second reading, likely causing further delays and debate.", "Critics worry the directive could lead to a US-style patent system, disadvantaging small developers, while supporters argue it would improve inefficiencies without fully aligning with US laws."]}