{"raw_text": "Junk e-mails on relentless rise\n \n Spam traffic is up by 40%, putting the total amount of e-mail that is junk up to an astonishing 90%.\n \n The figures, from e-mail management firm Email Systems, will alarm firms attempting to cope with the amount of spam in their in-boxes. While virus traffic has slowed down, denial of service attacks are on the increase according to the firm. Virus mail accounts for just over 15% of all e-mail traffic analysis by the firm has found.\n \n It is no longer just multi-nationals that are in danger of so-called denial of service attacks, in which websites are bombarded by requests for information and rendered inaccessible. Email Systems refers to a small UK-based engineering firm, which received a staggering 12 million e-mails in January. The type of spam currently being sent has subtlety altered in the last few months, according to Email Systems analysis. Half of spam received since Christmas has been health-related with gambling and porn also on the increase. Scam mails, offering ways to make a quick buck, have declined by 40%. \"January is clearly a month when consumers are less motivated to purchase financial products or put money into dubious financial opportunities,\" said Neil Hammerton, managing director of Email Systems. \"Spammers seem to have adapted their output to reflect this, focussing instead on medically motivated and pornographic offers, presumably intentionally intended to coincide with what is traditionally considered to be the bleakest month in the calendar,\" he said.\n", "llama3.2:1b": ["Junk e-mails are up 40% and total junk emails now at 90%, according to email management firm Email Systems.", "Spam accounts for 15% of all e-mail traffic, and denial-of-service attacks on websites have increased.", "The type of spam sent has shifted to more health-related and scam-related messages, such as gambling and porn offerings."], "llama3.2:3b": ["Spam email traffic has increased by 40% to a total of 90%, with virus mail accounting for 15%.", "A UK-based engineering firm received 12 million spam emails in January, while scam mails have declined.", "Health-related spam, gambling, and porn are on the rise, with spammers adapting their content to coincide with traditionally bleak months like January."], "gemma2:2b": ["Junk email accounts for 90% of all email traffic.", "Spam has increased by 40%.", "Virus mail represents just over 15% of total traffic.", "Denial-of-service attacks are on the rise, and spam includes health-related content, gambling, and pornographic material.", "Scam emails have declined by 40%."], "qwen2.5:0.5b": ["Email systems reports that spam traffic has risen from 90% to 40%, making it difficult for users to filter out junk e-mail.", "Denial of service attacks are also common, with a significant proportion (15%) of all e-mails analyzed by Email Systems having been attacked recently.", "Half of the emails received since Christmas are health-related and gambling scams have declined."], "qwen2.5:1.5b": ["E-mail spam volume rises sharply, totaling 90% of all email traffic, citing increase in denial of service attacks.", "Spam types have changed; health-related and gambling/porn mail have grown while scam offers are down."], "qwen2.5:3b": ["Junk e-mails are rising by 40%, reaching 90% of total emails.", "Virus mail still accounts for about 15%.", "Denial-of-service attacks have increased, affecting smaller firms like a UK-based engineering firm that received over 12 million spam emails in January.", "Spam content has shifted towards health-related and pornographic offers since Christmas.", "Scam mails have decreased by 40%, coinciding with the traditionally less active month for financial transactions."], "opencoder:1.5b": ["The rise of junk e-mails has led to an increase in spam traffic.", "This has spurred a surge in total junk emails as 90% of this increase comes from the rise of denial-of-service attacks, with virus mail accounts for approximately 15% of all email traffic analysis.", "Email systems have identified that there is a significant shift in the types of spam being sent and its frequency since Christmas.", "Half of spam received since Christmas has been health-related with gambling and porn also on the increase.", "Several companies, like Email Systems, have reported declines due to these advancements in the form of scams offering ways to make quick buck and make fraudulent financial deals.", "The company said it expects to see a greater adaptation of its output based on this analysis."], "smollm:1.7b": ["Junk e-mail traffic has risen by 40% over the past year, putting the total amount of spam in people's inboxes at an alarming 90%.", "The figures from email management firm Email Systems indicate that the number of spam emails is increasing and virus traffic is slowing down.", "However, denial of service attacks are on the rise as well according to the firm.", "Virus mail accounts for just over 15% of all e-mail traffic analyzed by the firm has found.", "It is no longer just multi-nationals that are in danger of so-called denial of service attacks, in which websites are bombarded by requests for information and rendered inaccessible.", "Email Systems refers to a small UK-based engineering firm, which received a staggering 12 million e-mails in January.", "The type of spam currently being sent has subtlety altered in the last few months, according to Email Systems analysis.", "Half of spam received since Christmas has been health-related with gambling and porn also on the increase.", "Scam mails, offering ways to make a quick buck, have declined by 40%.", "\"January is clearly a month when consumers are less motivated to purchase financial products or put money into dubious financial opportunities,\" said Neil Hammerton, managing director of Email Systems.", "\"Spammers seem to have adapted their output to reflect this, focussing instead on medically motivated and pornographic offers, presumably intentionally intended to coincide with what is traditionally considered to be the bleakest month in the calendar.\""], "deepseek-r1:1.5b": ["Rising spam traffic has surged by 40%, with the total amount of junk e-mail reaching 90% of overall email.", "Email systems have identified a significant spike in virus load (over 15%) and increasing denial-of-service attacks, according to Email Systems.", "In January, they received 12 million emails, with health-related and gambling content rising.", "Scams declined by 40%, while manager Neil Hammerton notes consumers are less motivated during non-qualifying months, amid spammers adapting their strategies for medical or porn-related offers coinciding with traditionally bleakest months."], "tinyllama:1.1b": ["The rise of spam traffic has reached an astonishing 90%, with multi-nationals being particularly targeted for denial of service attacks, as well as health-related and gambling mail being on the increase.", "The type of spam is also changing, with a shift towards medically motivated and pornographic offers during January, when consumers are less motivated to purchase financial products or put money into dubious opportunities."], "tinydolphin:1.1b": [" Junk e-mails are rapidly increasing due to a spike in spam traffic according to data from email management firm Email Systems.", "These spam messages, which can be as innocuous or malicious as one might imagine, account for nearly half of all the emails received by the company last month.", "The figures from Email Systems suggest that denial-of-service attacks have also been on the rise, with 15% of email traffic viewed by the firm being viewed inaccessible to users."], "phi:2.7b": [" Junk e-mails are increasing at a rate of 40%, and the total amount of spam has reached 90%.", "Email Systems reports that virus traffic has slowed down while denial of service attacks are on the rise.", "The firm's analysis shows that virus mails make up just over 15% of all email traffic, with small UK-based engineering firms like one mentioned in the text receiving a staggering 12 million emails in January.", "Since Christmas, health-related spam and pornography have increased while scam mail offers have decreased by 40%.", "The author believes spammers are adapting their output to reflect consumer behavior during the bleakest month of the year."], "orca-mini:3b": [" E-mail traffic from junk messages has increased by 40% since Christmas, putting the total amount of junk messages at an astonishing 90%.", "virus traffic has slowed down but denial of service attacks are on the increase, and 50% of spam is health-related while gambling and porn have become more popular.", "Scam mails are down by 40%."], "hermes3:3b": ["E-mail spam increasing by 40%, totalling 90%; health-related spam up, financial & scam spam down."], "stablelm-zephyr:3b": ["Spam emails are increasing by 40%, reaching a total of 90% junk email according to Email Systems.", "While virus traffic has slowed down, denial of service attacks are on the rise.", "In January, a small UK-based engineering firm received 12 million emails, with half of the spam health-related, gambling, and porn increased.", "Scam emails offering quick money have declined by 40%.", "Spammers seem to be adapting their output intentionally, focusing on medically motivated and pornographic offers coinciding with traditionally considered the bleakest month in the calendar."], "stablelm2:1.6b": ["Spam traffic has increased by 3%, reaching a total of junk mail amounting to 80%.", "Virus mail accounts for over 15% of e-mail traffic analysis, while denial-of-service attacks have also seen an increase.", "Spammers are adapting their strategies by focusing on medically motivated and pornographic offers, which account for half of the recent spam received.", "The total number of spam emails has surged in January due to consumers being less motivated to purchase financial products or invest money in dubious opportunities during this time."], "granite3.1-dense:2b": ["Spam email traffic has surged by 40%, now constituting 90% of all emails, as reported by Email Systems.", "Despite a decrease in virus mail (15%), denial-of-service attacks are escalating.", "A notable UK engineering firm received 12 million spam emails in January alone.", "Recent trends reveal a shift in spam content: health and gambling-related offers have risen by half since Christmas, while scam mails promising quick profits have decreased by 40%.", "This shift may reflect reduced consumer interest in financial schemes during typically gloomy months, according to Email Systems' managing director Neil Hammerton."], "chatgpt-4o-latest": ["Spam e-mail traffic has risen by 40%, now making up 90% of all e-mails, according to Email Systems.", "While virus-related e-mails have decreased, denial of service attacks are increasing, affecting not just large corporations but also small businesses.", "A UK engineering firm received 12 million e-mails in January alone.", "Recent spam trends show a shift towards health-related, gambling, and pornographic content, while scam e-mails have declined by 40%.", "Spammers appear to be adjusting their tactics based on consumer behavior, targeting medical and adult content during traditionally low financial activity periods."]}