{"raw_text": "BT boosts its broadband packages\n \n British Telecom has said it will double the broadband speeds of most of its home and business customers.\n \n The increased speeds will come at no extra charge and follows a similar move by internet service provider AOL. Many BT customers will now have download speeds of 2Mbps, although there are usage allowances of between one gigabyte and 30 gigabytes a month. The new speeds start to come into effect on 17 February for home customers and 1 April for businesses. \"Britain is now broadband Britain,\" said Duncan Ingram, BT's managing director, broadband and internet services. He added: \"Ninety percent of our customers will see real increases in speed.\n \n \"These speed increases will give people the opportunity to do a lot more with their broadband connections,\" he said. Upload speeds - the speed at which information is sent from a PC via broadband - will remain at the same speed, said Mr Ingram. Despite the increases, BT will continue to have usage allowances for home customers. \"The allowances are extremely generous,\" said Mr Ingram \"For what we are seeing in the market place - they are really not an issue.\" BT will begin enforcing the allowances in the summer. Customers who exceed the amounts will either be able to pay for a bigger allowance or see their download speeds reduced. BT now has a 36% share of the broadband market - down from 39% - which is becoming increasingly competitive. In the last few months, many rival ISPs have begun to offer 2Mbps services, including AOL, Plusnet and UK Online.\n \n But Britain continues to lag behind some countries - especially Japan and South Korea - which offer broadband speeds of up to 40Mbps. But Mr Ingram said it was important to \"separate hype from reality\". He said that a limited number of people with those connections consistently received speeds of 40Mbps. Customers will not see their connections double immediately on 17 February. Mr Ingram said there would be a roll out across the network in order to prevent any problems.\n", "llama3.2:1b": ["British Telecom has doubled broadband speeds for most customers, starting at 2Mbps and increasing to 8Mbps by April 1 for businesses.", "The increased speeds will not affect usage allowances, which are already generous.", "The company plans to enforce these allowances in the summer.", "BT now holds a 36% share of the UK's broadband market but is facing competition from other ISPs offering faster speeds."], "llama3.2:3b": ["British Telecom is increasing broadband speeds for most customers, doubling speeds for many home and business users starting in February and April respectively.", "The increased speeds come at no extra charge but are subject to usage allowances of between 1 gigabyte and 30 gigabytes a month, with customers who exceed these limits facing reduced download speeds or paying for additional allowance."], "gemma2:2b": ["BT is doubling broadband speeds for most customers, at no extra charge, starting in February for home users and April for businesses.", "This follows similar moves by other ISPs.", "While upload speed remains unchanged, usage allowances will be in place (generous) with potential consequences for exceeding limits.", "BT maintains a 36% share of the UK broadband market, facing increasing competition.", "The company emphasizes the reality of speeds available while acknowledging the lag in offerings compared to some other countries."], "qwen2.5:0.5b": ["British Telecom is increasing broadband speeds for most customers, starting at 2 Mbps for home use and up to 30 GB per month for businesses.", "The company aims to provide users with faster internet access than what they currently have.", "While some customers will see an increase in download speed, the company plans to maintain usage allowances for those who exceed them.", "Britain now leads broadband globally but is falling behind compared to other countries such as Japan and South Korea."], "qwen2.5:1.5b": ["British Telecom plans to boost broadband speeds for its customers, increasing download speeds from 2 Mbps to 4 Mbps with no additional cost and extending these improvements until April 1.", "The new service will also allow users to exceed current allowances without penalties or additional fees, but there are still usage limits in place.", "This move follows similar enhancements by other ISPs like AOL, aiming to make Britain \"Bulbity Brits\" while keeping the market competitive."], "qwen2.5:3b": ["BT boosts broadband packages offering speeds up to 2Mbps for most customers without extra cost, starting Feb 17 for homes and Apr 1 for businesses.", "Speed increases will affect nearly all BT users; upload speeds remain unchanged with allowances implemented in summer, potentially reducing/download speed upon exceeding limits.", "BT maintains a 36% market share amid increasing competition from rivals offering similar speeds.", "Despite this, BT claims to provide \"extremely generous\" usage allowances and emphasizes the need for gradual network rollout to avoid technical issues.", "BT lags behind countries like Japan and South Korea in terms of broadband speeds but asserts that these numbers apply to a limited number of users consistently achieving those speeds."], "opencoder:1.5b": ["The summary highlights the key benefits BT boosts broadband services, as it doubles these speeds for home and business customers, while AOL continues to offer similar increased speeds.", "Despite this, BT maintains usage allowances for home customers, reducing costs for those who use more bandwidth than allowed.", "The increasing broadband speeds bring opportunities for a lot more with their connections, while also keeping costs under control.", "The increased speeds are seen by a vast majority of users - yet customers continue to see reduced upload speeds due to the higher rates."], "smollm:1.7b": ["The summary is concise and focuses on key ideas, including:\n\n1.", "British Telecom has increased broadband speeds for most of its customers.", "2.", "The new speeds will come at no extra charge and follow a similar move by internet service provider AOL.", "3.", "Many BT customers will now have download speeds of 2Mbps, although there are usage allowances of between one gigabyte and 30 gigabytes a month.", "4.", "The increased speeds will give people the opportunity to do a lot more with their broadband connections.", "5.", "Upload speeds remain at the same speed, but BT will continue to have usage allowances for home customers.", "6.", "BT will begin enforcing the allowance in the summer.", "Customers who exceed the amounts will either be able to pay for a bigger allowance or see their download speeds reduced.", "7.", "BT now has a 36% share of the broadband market - down from 39% - which is becoming increasingly competitive.", "8.", "In the last few months, many rival ISPs have begun to offer 2Mbps services, including AOL, Plusnet and UK Online.", "9.", "But Britain continues to lag behind some countries - especially Japan and South Korea - which offer broadband speeds of up to 40Mbps.", "10.", "There will not be a simultaneous roll out across the network in order to prevent any problems."], "deepseek-r1:1.5b": ["BT will double its broadband speeds for most customers starting on 17 February at home and 1 April for businesses.", "Customers will have 2Mbps download speeds, while upload speeds remain unchanged.", "This move is part of a strategy to compete with AOL, which offered similar services.", "BT's share of the market drops to 36% from 39%, and it aims to be more competitive in the future by speeding up broadband infrastructure across networks.", "Customers will not see their connections doubled immediately on 17 February due to limited consistent speeds at that point."], "tinyllama:1.1b": ["British Telecom has doubled the broadband speeds of its customers by adding two Mbps per month for their most popular packages, with users able to access downloads at up to 2Mbp and uploads at 1.5Mbp, starting on February 17th for home customers and on April 1st for businesses.", "The company also announced that it will continue enforcing usage allowances for all customers, though the speeds are likely not an issue for most users as usage is still generous.", "While BT's share of the broadband market has decreased in recent months, the company now stands at 36% compared to its rival ISPs, who have started offering services with even higher speeds.", "The company intends to continue to prioritize speed for all customers and separates hype from reality by stating that only a limited number of people consistently receive speed levels of 40Mbp or more.", "The rollout will ensure there are no problems as customers transition from the old service to the new one, which will be rolled out across the network in order to prevent any issues with speeds."], "tinydolphin:1.1b": [" BT has announced plans to boost broadband speed for most customers, increasing speeds by 2Mbps from 2005.", "This decision follows the similar move by internet service provider AOL and will come into effect on February 17th, 2006.", "BT's managing director, Duncan Ingram, emphasizes that Britain is now \"broadband Britain.\"", "The increased speeds will give people the opportunity to do a lot more with their broadband connections and will provide an advantage in comparison to rival ISPs offering 2Mbps or higher speeds.", "Currently, only 9% of homes and businesses have access to speeds of over 1Mbps, compared to 36% for major rivals.", "By increasing the speeds across most customers, BT aims to differentiate itself from competitors and become the leading broadband provider in Britain."], "phi:2.7b": [" British Telecom is increasing the download speed of most of its home and business customers to 2Mbps without charging extra, following AOL's move.", "This will give people more opportunities to use their broadband connections, but upload speeds will remain the same.", "BT has a 36% market share, but Britain lags behind Japan and South Korea in terms of broadband speeds.", "Customers who exceed usage allowances can either pay for a bigger allowance or have their download speeds reduced."], "orca-mini:3b": [" British Telecom will double the broadband speeds of most of its home and business customers, starting from 17 February for home customers and 1 April for businesses.", "The new speeds range from 2Mbps to 30GB per month, depending on usage allowances.", "However, upload speeds remain at the same speed.", "BT will begin enforcing usage allowances in the summer for those who exceed the amounts.", "The company now has a 36% share of the broadband market, down from 39%."], "hermes3:3b": ["BT doubles broadband speeds for most customers; increases to no extra charge, starting Feb 17th for homes and April 1st for businesses."], "stablelm-zephyr:3b": ["British Telecom (BT) announced it will double broadband speeds for most home and business customers, starting on 17 February for homes and 1 April for businesses.", "The increased speeds will be available at no extra cost, with download speeds ranging from 2Mbps to 30GB per month, subject to usage allowances.", "Upload speeds remain unchanged.", "BT now holds a 36% share of the broadband market.", "Despite Britain's lagging comparison to countries like Japan and South Korea offering 40Mbps connections, BT's managing director, Duncan Ingram, emphasized that hype must be separated from reality in evaluating broadband performance."], "stablelm2:1.6b": ["British Telecom (BT) increases broadband speeds for most customers, starting with download speeds of 2Mbps and usage allowances ranging from 1GB to 50GB per month.", "The increased speeds are available at no extra cost and will apply to approximately 90% of BT's customer base.", "Upload speeds remain unchanged.", "Despite the speed boosts, BT will continue offering usage allowances for home customers.", "The company will begin enforcing the allowances in the summer, while rival ISPs such..\nas AOL, Plusnet, and UK Online have already started offering 2Mbps services.", "Despite being one of the market leaders with a 30% share of the broadband market, BT's position is facing increasing competition from other providers."], "granite3.1-dense:2b": ["British Telecom (BT) is enhancing broadband speeds for both home and business customers, doubling them to 2Mbps without additional cost.", "This upgrade will begin on February 17 for residential accounts and April 1 for businesses.", "BT's managing director, Duncan Ingram, stated that 90% of their customers will experience real speed improvements.", "While download speeds will increase, upload speeds will remain unchanged.", "Usage allowances will still apply, though BT considers them generous, enforcing them in the summer for those exceeding limits.", "With this expansion, BT holds a 36% market share, down from 39%.", "Although competitive, Britain lags behind countries like Japan and South Korea offering up to 40Mbps speeds, but Ingram emphasized that consistent high-speed connections of 40Mbps are rare.", "The rollout will be gradual to ensure network stability."], "chatgpt-4o-latest": ["BT will double broadband speeds for most home and business customers at no extra cost, following a similar move by AOL.", "Many customers will now have 2Mbps download speeds with usage allowances between 1GB and 30GB per month.", "The rollout begins on 17 February for home users and 1 April for businesses.", "Upload speeds will remain unchanged, and BT will enforce usage allowances in the summer, offering options to pay for more data or face reduced speeds.", "BT's broadband market share has dropped to 36% amid growing competition.", "While Britain lags behind countries like Japan and South Korea in broadband speeds, BT's Duncan Ingram emphasized that real-world speeds in those countries are often lower than advertised.", "The speed upgrades will be implemented gradually to avoid network issues."]}