{"raw_text": "Yahoo celebrates a decade online\n \n Yahoo, one of the net's most iconic companies, is celebrating its 10th anniversary this week.\n \n The web portal has undergone remarkable change since it was set up by Stanford University students David Filo and Jerry Yang in a campus trailer. The students wanted a way of keeping track of their web-based interests. The categories lists they devised soon became popular to hundreds of people and the two saw business potential in their idea.\n \n Originally dubbed \"Jerry's Guide to the World Wide Web\" the firm adopted the moniker Yahoo because the founders liked the dictionary definition of a yahoo as a rude, unsophisticated, uncouth person. The term was popularised by the 18th Century satirist Jonathan Swift in his classic novel, Gulliver's Travels. \"We were certainly not sophisticated or civilised,\" Mr Yang told reporters ahead of the anniversary, which will be officially recognised on 2 March.\n \n They did have business brains however, and in April 1995 persuaded venture capitalists Sequoia Capital, which also invested in Apple Computer and Cisco Systems, to fund Yahoo to the tune of $2m (£1.04m). A second round of funding followed in the autumn and the company floated in April 1996 with less than 50 employees. Now the firm employs 7,600 workers and insists its dot com culture of \"work hard, play hard\" still remains. It is one of just a handful of survivors of the dot-com crash although it now faces intense rivalry from firms such as Google, MSN and AOL. Jerry Yang, who remains the firm's \"Chief Yahoo\", is proud of what the company has achieved. \"In just one decade, the internet has changed the way consumers do just about everything - and it's been a remarkable and wonderful experience,\" he said. Through it all, we wanted to build products that satisfied our users wants and needs, but it's even more than that - it's to help every one of us to discover, get more done, share and interact.\"\n", "llama3.2:1b": ["Yahoo celebrates its 10th anniversary this week, founded by David Filo and Jerry Yang in a campus trailer at Stanford University.", "The company initially offered lists for tracking web-based interests and gained popularity with the \"Jerry's Guide to the World Wide Web\" name.", "It was later renamed Yahoo and raised $2m from venture capitalists Sequoia Capital.", "The company floated in April 1996, now employs 7,600 workers, and has maintained its dot-com culture of \"work hard, play hard.\""], "llama3.2:3b": ["Yahoo celebrates its 10th anniversary this week after being founded by Stanford University students David Filo and Jerry Yang in a campus trailer.", "The company originally called \"Jerry's Guide to the World Wide Web\" was renamed Yahoo due to its founders' liking for the term \"yahoo,\" popularized by Jonathan Swift.", "With $2m in funding from Sequoia Capital, Yahoo floated in 1996 with less than 50 employees and now employs 7,600 workers."], "gemma2:2b": ["Yahoo celebrates its 10th anniversary.", "Founded in a Stanford University trailer by David Filo and Jerry Yang as a personal web-tracking tool, Yahoo evolved into a popular portal and was funded by Sequoia Capital.", "The company has grown to employ over 7,600 people and remains competitive despite the dot-com crash.", "Jerry Yang believes Yahoo's success lies in creating products that meet user needs and help connect people."], "qwen2.5:0.5b": ["Yahoo celebrated its 10th anniversary last week.", "The company has undergone remarkable changes since its creation in the late 1990s with Stanford students David Filo and Jerry Yang designing a website to keep track of their web-based interests.", "They adopted the term \"Yahoo\" as a business name due to its rude, unsophisticated, uncouth person definition.", "The company has grown to employ over 7,600 workers and now employs 7,600 employees.", "Yahoo is known for its dot-com culture where users can get help with their online needs while it's more than just a website."], "qwen2.5:1.5b": ["Yahoo celebrates its 10th anniversary, founded by Stanford students Filo and Yang as a way to track web interests.", "Adopted Yahoo from original \"Jerry's Guide\" moniker due to Swift's usage in Gulliver's Travels.", "Acquired funding from Sequoia Capital, floated in 1996 with over 50 employees, now employs 7,600 and remains a dot-com pioneer facing competition from Google, MSN, and AOL.", "Yang praises the decade-long success of building products for user needs while emphasizing Yahoo's ability to facilitate discovery, productivity, sharing, and interaction."], "qwen2.5:3b": ["Yahoo celebrates its 10th anniversary online.", "Founded by Stanford students David Filo and Jerry Yang in a campus trailer for tracking web interests, Yahoo was named after Jonathan Swift’s term \"yahoo\" meaning rude people.", "Originally called \"Jerry's Guide to the World Wide Web,\" it was funded by Sequoia Capital in 1995 and went public in 1996 with 49 employees.", "Today, it employs 7,600, competing with Google, MSN, and AOL.", "Jerry Yang, CEO since its inception, is proud of the company's achievements despite dot-com crash challenges, noting how Yahoo has influenced nearly every consumer activity online."], "opencoder:1.5b": ["Yahoo has celebrated its 10th anniversary this week in a format reminiscent of a decade-long celebration.", "The company is renowned for its web-based platform, which has seen significant evolution since the university students set it up.", "A list of categories quickly became popular by hundreds of people, and the two see a significant business opportunity in their idea.", "The term Yahoo initially seemed outlandish as a nickname for the developers who had been bored and didn't want to think about Yahoo's website.", "However, its success sparked interest, making it more likely to gain momentum.", "The success comes from the company's venture capitalists, which has raised funds to support future growth.", "The company still boasts 7,600 workers despite the crash, which signifies that it is a survivor of the internet boom."], "smollm:1.7b": ["Summarizing the text concisely requires identifying the main ideas, key details, and relationships between them.", "Here is a concise summary:\n\nYahoo celebrates 10 years online with 7,600 employees.", "The company was founded by Stanford University students in 1995 to create a web-based directory of interest groups.", "In 2004, Yahoo went public and raised $2m (£1.04m) in venture capital funding.", "It has since become one of the largest internet companies, with products such as AOL, Google, and MSN.", "The company's slogan \"Work hard, play hard\" reflects its business culture.", "In 2006, Yahoo went public again, raising $13b (£7.8bn) in funding.", "Today, it employs over 7,600 people and has become a leader in the internet industry."], "deepseek-r1:1.5b": ["Yahoo celebrates its 10th anniversary this week with a tribute to its founding team of Stanford University students who initially called their idea \"Jerry's Guide to the Web.\"", "The company was founded in a university trailer and later moved to dot.com due to the 20th-century dot-com crash.", "In 1995, Sequoia Capital and Apple Computer provided funding, followed by another round in 1996, resulting in 7,600 employees.", "Despite facing competition from Google, MSN, and AOL, Yahoo has successfully navigated the dot-com era, building a product culture of \"work hard, play hard.\""], "tinyllama:1.1b": ["In 1995, Yahoo became the world's first online search engine after setting up on campus in Stanford University.", "The original name, \"Jeerry's Guide to the World Wide Web,\" was later adapted by Jonathan Swift to \"YaHoo.\"", "In April 1995, Yahoo raised $2m from venture capitalists to expand into the internet industry and launch its own company in 1996.", "Despite the dot-com crash that followed, Yahoo has faced intense rivalry from firms such as Google, MSN, and AOL since it launched, but it still remains one of the most successful internet companies globally.", "The firm employs over 7,600 workers worldwide and enjoys a reputation for producing innovative products that satisfy users' wants and needs."], "tinydolphin:1.1b": [" Yahoo, a dominant internet company, celebrated its tenth anniversary on March 2.", "With over 7,600 employees and a market capitalization of approximately $15 billion, it is considered a significant entity in the global tech industry.", "The company's innovative approach to web navigation and search has made it a go-to source for internet users globally.", "Yahoo's founder David Filo and colleague Jerry Yang started the project as a means to keep track of their own interests.", "The company later adopted the term \"Yahoo\" in 1989, based on the dictionary definition of the word as \"rude, unsophisticated, uncouth.\""], "phi:2.7b": [" Yahoo, an iconic web portal, celebrated its 10th anniversary this week.", "Founded by Stanford University students David Filo and Jerry Yang in a campus trailer, the company has undergone remarkable change since it was established with the goal of tracking their web-based interests.", "The two saw business potential in their idea and successfully attracted funding from venture capitalists Sequoia Capital to finance Yahoo.", "Today, Yahoo employs 7,600 workers and boasts an \"dot com culture\" of hard work and play.", "Jerry Yang, who remains Chief Yahoo, is proud of what the company has achieved.", "In just one decade, the internet has transformed consumer behaviour in numerous ways and Yahoo's mission is to help every user discover, get more done, share, and interact."], "orca-mini:3b": [" Yahoo, the internet's most iconic company, is celebrating its 10th anniversary this week.", "The portal went through significant change since it was set up by Stanford University students David Filo and Jerry Yang in a campus trailer.", "Initially called \"Jerry's Guide to the World Wide Web\", the firm adopted the moniker Yahoo because the founders liked the dictionary definition of a yahoo as a rude, unsophisticated, uncouth person.", "The term was popularized by the 18th Century satirist Jonathan Swift in his classic novel, Gulliver's Travels.", "Despite not being sophisticated or civilised, Yahoo has survived and now employs over 7,600 workers.", "It is one of just a handful of survivors of the dot-com crash, although it now faces intense rivalry from firms such as Google, MSN, and AOL.", "Jerry Yang, who remains the firm's \"Chief Yahoo\", is proud of what the company has achieved in just one decade.", "Through it all, he wants to build products that satisfy users' wants and needs, but it's even more than that - it's to help every one of us to discover, get more done, share, and interact."], "hermes3:3b": ["Yahoo 10y anniversary: Stanford students Filo & Yang created web portal in 1994, initially for personal interest tracking; now employs over 7k workers."], "stablelm-zephyr:3b": ["Yahoo turns 10 and reflects on its iconic status in the internet world.", "Founded by Stanford students David Filo and Jerry Yang in a campus trailer, Yahoo started as \"Jerry's Guide to the World Wide Web\" before adopting the moniker Yahoo.", "The company received initial funding from Sequoia Capital and has since grown to employ 7,600 workers.", "Despite intense competition from Google, MSN, and AOL, Yahoo remains committed to its original mission of building products that satisfy user desires and help them discover, get more done, share, and interact."], "stablelm2:1.6b": ["Yahoo, once founded by Stanford University students as \"Jerry's Guide to the World Wide Web,\" is celebrating its 10-year anniversary.", "The company underwent significant changes since its inception in a campus trailer, eventually becoming Yahoo with a name derived from dictionary definition of \"rude, unsophisticated, uncouth person.\"", "Initially funded by venture capitalists in 1995, Yahoo grew and was listed on the stock market in 2006.", "The company now employs 7 workers and remains amid intense rivalry against Google, MSN, and AOL despite its successes during the dot-com crash."], "granite3.1-dense:2b": ["Yahoo, founded by Stanford students David Filo and Jerry Yang in 1995, is commemorating its 10th anniversary.", "Initially named \"Jerry's Guide to the World Wide Web,\" the company was rebranded as Yahoo due to the dictionary definition of a yahoo as an unsophisticated person, popularized by Jonathan Swift.", "The founders secured early funding from Sequoia Capital and launched in April 1996 with fewer than 50 employees.", "Today, Yahoo employs 7,600 people and maintains its \"work hard, play hard\" culture.", "Surviving the dot-com crash, Yahoo now competes against Google, MSN, and AOL.", "Founder Jerry Yang, still titled \"Chief Yahoo,\" reflects on the transformative impact of the internet over a decade, emphasizing the company's mission to meet user needs for discovery, productivity, sharing, and interaction."], "chatgpt-4o-latest": ["Yahoo is celebrating its 10th anniversary, marking a decade of transformation since its founding by Stanford students David Filo and Jerry Yang.", "Originally called \"Jerry's Guide to the World Wide Web,\" it was later renamed Yahoo, inspired by the dictionary definition of an uncouth person.", "The company secured $2 million in venture capital in 1995 and went public in 1996 with fewer than 50 employees.", "Now employing 7,600 people, Yahoo has survived the dot-com crash but faces competition from Google, MSN, and AOL.", "Co-founder Jerry Yang reflects on the company's impact, emphasizing its role in shaping how people interact and accomplish tasks online."]}