{"raw_text": "Telewest to challenge Sky Plus\n \n Cable firm Telewest is to offer a personal video recorder (PVR) in a set -top box to challenge Sky Plus.\n \n Sky Plus is the market leader in the field of digital video recorders in the UK, with 474,000 subscribers. PVRs record TV programmes to a hard drive, letting viewers pause, and rewind live television and effectively \"time shift\" the viewing experience. A number of PVRs incorporating Freeview digital terrestrial TV are also on the market but their success is limited. Telewest's PVR will offer a 160GB hard drive, which has storage for up to 80 hours of programmes. The box has three tuners, which means viewers can record two channels simultaneously while watching a third channel.\n \n Sky Plus boxes come in two versions - a 20GB version for £99 and a 160GB version for £399. Sky also charges a £10 subscription fee to the service, unless viewers have a subscription to one of its premium packages. Telewest has yet to reveal pricing for the new box or if it will be charging a subscription fee for the service.\n \n Eric Tveter, president and chief operating officer at Telewest Broadband, said: \"We will make our PVR set-top box available later this year, putting a stop to missed soaps, interrupted films and arguments over which programmes to record.\" PVRs and recordable DVD players are set to replace video recorders as the standard method of recording and saving favourite TV programmes. Last year, high street retailer Dixons said it was going to stop selling VHS machines in favour of PVRs and recordable DVD machines. Sky has said it aims to have 25% of its subscribers using Sky Plus by 2010 - it is predicting 10 million total subscribers by that date. It currently has 7.4 million subscribers, while Telewest provides digital cable to 1.7 million customers.\n", "llama3.2:1b": ["Telewest will offer a personal video recorder (PVR) in a set-top box to challenge Sky Plus's market leader status.", "The PVR will record TV programs up to 80 hours and allow viewers to pause, rewind live TV, and \"time shift\" the viewing experience.", "It will have three tuners for simultaneous recording."], "llama3.2:3b": ["Telewest will offer a personal video recorder (PVR) in a set-top box later this year, challenging Sky Plus's market leadership with features including a 160GB hard drive and three tuners for simultaneous recording of multiple channels.", "The PVR service is expected to be priced similarly to the 160GB version of Sky Plus, but pricing has not been confirmed."], "gemma2:2b": ["Telewest will release a PVR set-top box to compete with Sky Plus.", "The box offers 160GB storage and allows recording of two channels simultaneously while watching a third.", "Telewest has not yet revealed pricing or subscription fees, but expects the PVR to become the standard for TV recording."], "qwen2.5:0.5b": ["Telewest plans to offer a PVR set-top box to compete with Sky Plus in the UK market, offering 160GB storage capacity and three tuners for simultaneous recording of two channels while watching third.", "Eric Tveter of Telewest Broadband says this will be available later this year, ending \"missed soaps,\" \"interrupted films\" and TV-watching arguments over which programmes to record.", "Sky Plus has previously stated it plans to offer subscription-based services in the UK, with plans to have 25% of its subscribers using Sky Plus by 2010.", "Telewest will also provide digital cable services, but is not specifying pricing or subscription fees for the PVR box."], "qwen2.5:1.5b": ["Telewest plans to offer a personal video recorder (PVR) set-top box in the UK market, challenging Sky Plus, which is leading in digital video recorders with over 474,000 subscribers.", "The new PVR has a 160GB hard drive and three tuners for simultaneous channel recording.", "It competes against other Freeview-based PVRs but won't release pricing or subscription plans yet.", "Sky Plus offers a basic 20GB version and premium packages at £10 per month, aiming to have 10 million subscribers by 2010."], "qwen2.5:3b": ["Telewest plans to introduce a PVR set-top box with a 160GB hard drive and three tuners to challenge Sky Plus, the UK's leading digital video recorder service with 474,000 subscribers.", "Telewest's offering is expected to debut later this year, aimed at addressing missed TV shows and interruptions.", "Prices are yet to be revealed, unlike Sky Plus which starts from £99 for a 20GB version up to £399 for the 160GB option plus an additional £10 subscription fee.", "PVRs are predicted to replace traditional video recorders as standard recording devices."], "opencoder:1.5b": ["Telewest, offering a personal video recorder set-top box for Sky Plus, challenges the market leader in UK digital video recorders with a 160GB hard drive and three tuners that enables simultaneous recording of two channels.", "The firm's PVR will offer a 20GB version at £99 and a 160GB version at £399.", "It also charges a subscription fee of £10 for premium packages, unlike the Freeview digital terrestrial TV included on the market but limited.", "With SkyPlus, Eric Tveter was said to be in the business of making the PVR set-top box available later this year.", "The new box and its availability are expected to replace VHS recorders as standard methods of recording and saving favourite TV programmes.", "Dixons' high-street retailer, which had previously sold VHS tapes, is now seeing signs of increasing sales with its replacement recordable systems."], "smollm:1.7b": ["Telewest will offer a personal video recorder (PVR) in a set-top box to challenge Sky Plus.", "The new PVR will record TV programmes to a hard drive and allow viewers to pause, rewind live television and effectively \"time shift\" the viewing experience.", "A number of PVRs incorporating Freeview digital terrestrial TV are also on the market but their success is limited.", "Telewest's PVR will offer a 160GB hard drive, which has storage for up to 80 hours of programmes.", "The box has three tuners, which means viewers can record two channels simultaneously while watching a third channel.", "Sky Plus boxes come in two versions - a 20GB version for £99 and a 160GB version for £399.", "Sky also charges a £10 subscription fee to the service, unless viewers have a subscription to one of its premium packages.", "Telewest has yet to reveal pricing for the new box or if it will be charging a subscription fee for the service.", "Eric Tveter, president and chief operating officer at Telewest Broadband, said: \"We will make our PVR set-top box available later this year, putting a stop to missed soaps, interrupted films and arguments over which programmes to record.\"", "PVRs and recordable DVD players are set to replace video recorders as the standard method of recording and saving favourite TV programmes.", "Last year, high street retailer Dixons said it was going to stop selling VHS machines in favour of PVRs and recordable DVD machines.", "Sky has said it aims to have 25% of its subscribers using Sky Plus by 2010 - it is predicting 10 million total subscribers by that date.", "It currently has 7.4 million subscribers, while Telewest provides digital cable to 1.7 million customers."], "deepseek-r1:1.5b": ["Telewest is offering a PVR set-top box to challenge Sky Plus.", "Sky Plus, with over 474,000 subscribers, dominates digital video recorders in the UK.", "The PVR records TV shows on a hard drive, allowing live streaming adjustments.", "Telewest's PVR features a 160GB storage capacity and three tuners for simultaneous viewing of two channels while recording the third.", "Sky Plus subscribers range from £99 to £399, with a £10 subscription fee beyond premium packages.", "Telstar plans to launch its PVR in late 2024.", "Sky aims to reach 25% of its subscribers via PVRs by 2010, targeting up to 10 million subscribers, with 7.4 million already serving them and 1.7 million through digital cable."], "tinyllama:1.1b": ["Telewest plans to launch a personal video recorder (PVR) set-top box in response to Sky Plus, which offers PVRs with up to 80 hours of programmes for £399.", "The box has three tuners and a 160GB hard drive, offering viewers a recording experience equivalent to having two channels simultaneously while watching a third channel.", "Telewest hopes to have 25% of its subscribers using Sky Plus by 2010, and has said it aims to have 7.4 million customers through digital cable.", "The PVR is set to be available later this year, replacing video recorders as the standard method of recording and saving favourite TV programmes."], "tinydolphin:1.1b": [" In a significant challenge to the market leader Sky Plus, Telewest plans to introduce a personal video recorder (PVR) in a set-top box that can be competitive against the existing market leader.", "The new PVR will offer a 160GB hard drive, enabling users to record up to 80 hours of TV programs simultaneously.", "At launch, the box will come with an optional £99 subscription fee for Sky Plus services unless customers already have an active subscription to one of its premium packages.", "Telewest estimates that its PVR will be priced at a lower cost than Sky Plus but will still include a £10 subscription fee to the service unless viewers choose a package with free access to the service.", "The new box will be available later this year and will be competitive against recordable DVD players in terms of storage capacity, while also offering an alternative to VHS technology."], "phi:2.7b": [" Telewest will challenge Sky Plus with a personal video recorder (PVR) in a set-top box offering 160GB of storage for up to 80 hours of programming and three tuners for recording two channels at once while watching another.", "The PVR comes in 20GB and 160GB versions, priced at £99 and £399 respectively, with Sky Plus boxes currently selling for £199 with or without a subscription fee depending on the package.", "Eric Tveter said Telewest aims to put an end to missed soaps, interrupted films, and arguments over what programmes to record by launching its PVR later this year."], "orca-mini:3b": [" Telewest is planning to launch a personal video recorder (PVR) in a set-top box to challenge Sky Plus' market leading position in the field of digital video recorders in the UK.", "The new PVR will offer a 160GB hard drive, which has storage for up to 80 hours of programmes.", "Three tuners allow viewers to record two channels simultaneously while watching a third channel.", "Telewest has not yet revealed pricing for the new box or if it will be charging a subscription fee for the service.", "The PVRs will come in two versions - a 20GB version for £99 and a 160GB version for £399.", "Sky Plus charges a £10 subscription fee to the service, unless viewers have a subscription to one of its premium packages.", "Telewest aims to challenge Sky Plus' market leader position by offering a PVR set-top box available later this year."], "hermes3:3b": ["Telewest PVR challenges Sky Plus, offering 160GB hard drive, 3 tuners, and up to 80h prog storage."], "stablelm-zephyr:3b": ["Cable firm Telewest plans to launch a personal video recorder (PVR) in a set-top box to challenge Sky Plus, the market leader in UK digital video recorders with 474,000 subscribers.", "Telewest's 160GB PVR will store up to 80 hours of programming and offer three tuners for simultaneous recording.", "Sky charges £99 for a 20GB version and £399 for a 160GB version, plus a subscription fee, although pricing and subscription fees for Telewest's offering have not been revealed yet."], "stablelm2:1.6b": ["Cable firm Telewest plans to offer a personal video recorder (PVR) in a set-top box to challenge Sky Plus, aiming to stop missed TV shows and prevent arguments over recorded programs.", "The PVR will feature a 1GB hard drive for up to 8 hours of program storage, with three tuners allowing simultaneous recording of two channels while watching one.", "Telewest has not yet revealed pricing or subscription fees for the new box, but it will be available later this year.", "Sky Plus is currently the market leader in digital video recorders, with millions of subscribers, and aims to capture 90% of its target market by 2005."], "granite3.1-dense:2b": ["Telewest intends to introduce a competitive personal video recorder (PVR) set-top box to challenge Sky Plus' dominance in the UK market.", "Sky Plus, with 474,000 subscribers, records TV programs on hard drives for later viewing, featuring pause, rewind, and time-shifting capabilities.", "Telewest's PVR will offer a 160GB hard drive, enabling up to 80 hours of recordings, and three tuners for simulcast recording and viewing.", "Pricing details are yet to be disclosed, along with any potential subscription fees.", "The company aims to launch the box later this year, emphasizing its ability to eliminate missed shows and arguments over recorded content.", "Telewest's move mirrors industry trends, as high-street retailers like Dixons transition from VHS machines to PVRs and recordable DVD players.", "Sky targets 25% of its subscribers (10 million) using Sky Plus by 2010, anticipating 10 million total subscribers then, while Telewest serves 1.7 million customers via digital cable."], "chatgpt-4o-latest": ["Telewest is launching a personal video recorder (PVR) set-top box to compete with Sky Plus in the UK.", "Sky Plus, the market leader with 474,000 subscribers, offers PVRs that allow users to pause, rewind, and record live TV.", "Telewest's PVR will feature a 160GB hard drive, storing up to 80 hours of content, and three tuners for recording two channels while watching a third.", "Sky Plus offers 20GB and 160GB versions, with a £10 subscription fee unless bundled with premium packages.", "Telewest has not disclosed pricing or subscription details.", "PVRs and recordable DVD players are expected to replace VHS recorders, with Sky aiming for 25% of its projected 10 million subscribers to use Sky Plus by 2010.", "Currently, Sky has 7.4 million subscribers, while Telewest serves 1.7 million digital cable customers."]}