{"raw_text": "Games enter the classroom\n \n Video games could soon be transplanted from their natural habitat to the more academic atmosphere of the classroom.\n \n With violent titles continuing to top the charts, gaming and learning have not always sat well together but the tide could be beginning to turn. Recent research by the London Institute of Education concluded that games have a valid place in the classroom. \"Games teach life skills such as decision making, problem solving,\" said Martin Owen, at Futurelab. Mr Owen said games could also help children make quick assessments of situations and learning by trial and error.\n \n Futurelab is a non-profit organisation looking at ways of using technology for innovative learning. Most game firms are too busy turning a profit in the lucrative commercial market to consider developing games for use in schools but Liverpool-based games firm Lateral Visions saw a gap in the market. \"Learning games were somewhat old-fashioned and we didn't see anyone else doing what we wanted to do,\" said Dr Carl Gavin, managing director of Lateral Visions. The company set out to write something that had all the look and feel of a commercial game but with an educational and learning element. The result is Racing Academy, a massively multiplayer car racing game, which requires not only a thirst for speed but a working knowledge of physics and engineering as well.\n \n It is being used by Futurelab to test the viability of using gaming in the classroom. \"We are keen to find out whether alongside learning a game, we can also learn something that the rest of the world can understand as being educational,\" said Mr Owen. Players will have to understand how a car works in order to win races and the knowledge of physics and engineering that they gather along the way will be done in a way that no text book can teach. The game requires users to build and maintain their vehicles and to monitor and analyse performance using data from a variety of outputs, before and after racing. Teamwork is essential and a chat area allows students to exchange information and data, work collaboratively and review their own performances. This fusion of chatrooms and gaming is of special interest to Futurelab as it is through talking to others that much of the learning can be achieved, thinks Mr Owen.\n \n The game has been trialled in two secondary schools in Bristol and feedback from students has been positive. \"Pupils used the statistics to work out the best way to build their cars and the online message board to share ideas and support each other,\" said Ben Williamson, a researcher at Futurelab charged with testing the game in real schools. Dr Gavin thinks the game satisfies both teachers' need for learning outcomes and the children's desire to rise to a challenge. \"Games in the classroom need to support the teacher. It is not about giving children free rein to play game but recognising that games attract attention and offer a challenge,\" he said. Professor Angela MacFarlane, based at Bristol University, has spent several years researching how games can be incorporated into classrooms.\n \n Use of games in schools has been patchy she found, with Sim City proving the most popular. Traditionally schools have eschewed mainstream games in favour of used so-called edu-tainment software in a belief that such packages help to make learning fun, she found in her research. \"It is perhaps in a compromise between edutainment and mainstream games that the greatest potential for classroom useable games lies,\" she wrote in a paper entitled Games and Learning. 'Lite' versions of existing games could be the way forward and would overcome one of the biggest hurdles - persuading developers to write for the educational market. This would appeal to developers because of the low costs involved in adapting them as well as offering a new opportunity for marketing. Already there are games on the market, such as Civilisation and Age of Empire, that have educational elements said Mr Owen. \"Even in Grand Theft Auto it is not just the violence that engages people,\" he said. It could be some time until that particular game makes it into the classroom though.\n", "llama3.2:1b": ["Games enter the classroom and are being tested by Futurelab to see if they can help with learning skills such as decision making, problem solving, and trial and error.", "A new game called Racing Academy, developed by Lateral Visions, is being used in two secondary schools in Bristol to test its viability.", "The game requires players to build and maintain vehicles, monitor performance data, and work collaboratively with others through chat rooms.", "The game has been well-received by students who use it as a tool for learning statistics and online communication."], "llama3.2:3b": ["Video games are being explored as a tool for learning in classrooms, with recent research suggesting they have a valid place in education.", "Games can teach life skills such as decision making and problem solving, and help children make quick assessments of situations.", "A London-based company developed Racing Academy, a massively multiplayer car racing game that requires knowledge of physics and engineering to win.", "The game is being used by Futurelab to test its viability, with positive feedback from students in Bristol schools."], "gemma2:2b": ["Video games are being considered for use in classrooms due to their potential for teaching life skills, decision-making, and problem solving.", "A new game called \"Racing Academy\" combines educational content with engaging gameplay, requiring players to understand physics and engineering concepts while fostering teamwork.", "The game's positive feedback from students and its ability to meet both teachers' needs and children's desires for a challenge suggests a promising future for incorporating games into the classroom."], "qwen2.5:0.5b": ["Games enter classrooms due to their ability to teach life skills like decision-making and problem-solving, as well as learning through trial and error while providing educational value.", "Gaming firms are now exploring ways to use this technology in education, particularly in schools where traditional learning methods may not be successful.", "Some games specifically cater to the needs of children aged 6-12, such as Racing Academy.", "These games allow students to practice skills like driving a car or building models while learning about physics and engineering.", "They are often used alongside formal lessons, providing a fun alternative for older pupils who are still interested in traditional subjects but not yet ready for college-level coursework."], "qwen2.5:1.5b": ["Games can be used effectively in schools to teach life skills like decision making and problem solving, as evidenced by Futurelab's use of Liverpool-based games firm Lateral Visions' Racing Academy.", "The gaming industry has traditionally avoided educational content but is now focusing on developing suitable games for classrooms.", "Feedback from students indicates positive outcomes such as improved statistical analysis and collaborative teamwork."], "qwen2.5:3b": ["Games enter the classroom with potential to teach life skills such as decision making and problem solving.", "Recent research by the London Institute of Education supports games in education, but firms prioritize commercial success over educational use.", "Lateral Visions created Racing Academy, a physics-based car racing game that integrates learning objectives.", "Futurelab uses it to test using gaming for classroom activities; students must understand vehicle mechanics for competitive racing.", "Feedback from trials has been positive, showing the game supports teacher goals and student engagement.", "Use of games in schools is currently limited, with mainstream games often avoided due to a belief they make learning fun.", "Potential solutions include adapting existing \"lite\" versions or engaging developers through lower costs and marketing opportunities."], "opencoder:1.5b": ["Games enter the classroom\n\nVideo games could soon be transplanted from their natural habitat to the more academic atmosphere of the classroom.", "Recent research by the London Institute of Education concluded that games have a valid place in the classroom.", "\"Games teach life skills such as decision making, problem solving,\" said Martin Owen at Futurelab.", "Mr Owen also mentioned games could help children make quick assessments of situations and learning by trial and error.", "Futurelab is a non-profit organisation looking at ways of using technology for innovative learning.", "Liverpool-based games firm Lateral Visions saw a gap in the market.", "\"Learning games were somewhat old-fashioned and we didn't see anyone else doing what we wanted to do,\" said Dr Carl Gavin, managing director of Lateral Visions.", "The company set out to write something that had all the look and feel of a commercial game but with an educational and learning element.", "The result is Racing Academy, a massively multiplayer car racing game, which requires not only a thirst for speed but a working knowledge of physics and engineering as well.", "Players will have to understand how a car works in order to win races and the knowledge of physics and engineering that they gather along the way will be done in a way that no text book can teach.", "The game requires users to build and maintain their vehicles and to monitor and analyse performance using data from a variety of outputs, before and after racing.", "Teamwork is essential and a chat area allows students to exchange information and data, work collaboratively and review their own performances.", "This fusion of chatrooms and gaming is of special interest to Futurelab as it is through talking to others that much of the learning can be achieved.", "Games in the classroom need to support the teacher.", "It is not about giving children free rein to play game but recognising that games attract attention and offer a challenge.", "Professor Angela MacFarlane, based at Bristol University, has spent several years researching how games can be incorporated into classrooms."], "smollm:1.7b": ["The summary above captures the main ideas and key points from the original text, preserving the tone and style of the original while summarizing the content in a concise manner.", "The summary highlights the benefits of using games in the classroom, including their ability to teach life skills, promote teamwork and collaboration, and provide a fun and engaging learning experience for students.", "It also mentions the potential drawbacks of using games in schools, such as concerns about violence and commercialism, and suggests that developers may be more willing to create educational games if they are given the opportunity."], "deepseek-r1:1.5b": ["Video games have traditionally been played in a non-academic setting, but they're now entering classrooms.", "Futurelab, a non-profit organization, developed Racing Academy to blend racing simulation with physics and engineering learning.", "It emphasizes teamwork, uses a chat system, and requires understanding game mechanics for competition.", "Feedback from Bristol schools like the future lab highlighted positive outcomes and potential for future improvements by adapting educational games at a lower cost, while balancing edutainment tools and maintaining their use in education."], "tinyllama:1.1b": ["A study found that games can be incorporated into classrooms to offer a fun and engaging learning experience for children, while also addressing their life skills such as decision-making and problem solving.", "Games from commercial platforms are not suitable for use in schools due to their commercial nature, but Futurelab, a nonprofit organization focused on using technology for innovative learning, is developing games specifically aimed at the classroom.", "The new game, Racing Academy, requires players to build and maintain their vehicles and analyze performance using data from various outputs such as chat rooms and online message boards.", "The game has been successfully tested in two secondary schools in Bristol, with feedback indicating that teachers' needs for learning outcomes were met while students found the game engaging and appealing.", "The study by researcher Angel MacFaullane found that Sim City was the most popular game in schools, but traditional games can offer a compromise between education and mainstream software, with low costs of adapting them making them an attractive option for classroom use."], "tinydolphin:1.1b": [" A new trend in educational technology is being introduced by a company called Lateral Visions, which has created an innovative learning game called Racing Academy.", "This racing game has been designed to not only entertain and inform students but also to teach them something useful about physics, engineering, and car mechanics.", "The game was developed by a team at Futurelab in Liverpool, who believe that educational games can be much more than mere revenue streams for companies like Electronic Arts (EA).", "They want to use these platforms to promote learning and to make education more interesting for students.", "This approach has been successful with simulated reality gaming, which has been used extensively by educational institutions to create immersive experiences.", "Lateral Visions, however, is taking this approach a step further by creating a massively multiplayer car racing game called Racing Academy.", "The aim of this project is to use the popularity of the racing genre to engage students with an interactive experience that they can learn from and enjoy.", "It's not just about winning, but also about understanding the principles behind the games.", "The key feature of Racing Academy is its interactivity.", "Users will have to build and maintain their cars using data from a variety of sources.", "They can work together with others in chat rooms to help each other learn and improve.", "The chatroom is a place where students can exchange information, discuss performance, and analyze their own stats.", "In turn, this fusion of chat and gameplay will allow teachers to provide more focused learning experiences.", "The success of Racing Academy could have far-reaching implications for the future of educational technology.", "By using gaming as a tool to promote learning, it opens up new opportunities for innovative teaching methods and a range of subjects that students might not otherwise explore.", "This is particularly exciting for students who may be passionate about cars but lack the skills or understanding to make informed decisions in a virtual world.", "In terms of the potential impact on future education systems, this game could pave the way for more immersive and engaging learning experiences that are both fun and educational.", "The development of games like Racing Academy by Lateral Visions suggests that the next generation of education gamers is about to explode onto the scene."], "phi:2.7b": [" Games have long been seen as a source of entertainment and escapism, but recent research suggests that they also have educational potential in the classroom.", "A study conducted by Futurelab, a non-profit organization focused on using technology for innovative learning, found that games can teach life skills such as decision making and problem solving.", "The research concluded that games have a valid place in education.", "Lateral Visions, a Liverpool-based game firm, saw an opportunity to develop learning games that combine the look and feel of commercial games with educational elements.", "Their game, Racing Academy, requires players to understand physics and engineering principles as well as learn by trial and error to become successful.", "The game has been trialed in two secondary schools in Bristol and received positive feedback from students who used it to collaborate on building and maintaining their cars while analyzing performance data.", "Professor Angela MacFarlane, a researcher at Bristol University, believes that games can be incorporated into classrooms if they support the teacher's learning outcomes and challenge the students.", "She recommends using \"lite\" versions of existing games, which are adapted for educational use and have lower costs compared to mainstream games.", "Despite these findings, games in schools have been patchy.", "However, some educational games such as Sim City and Age of Empires have shown potential.", "Dr Carl Gavin believes that developers may be interested in creating games with educational elements if the target audience is low-cost and it offers a new marketing opportunity.", "Games like Civilisation and Grand Theft Auto also have educational components.", "It could take time before mainstream games like Grand Theft Auto make it into classrooms, but the potential for using games to teach valuable skills cannot be ignored.", "In a group of four schools in Bristol, they decided to test Racing Academy as part of their new educational strategy.", "Each school has different teaching styles and resources.", "School A is known for its hands-on approach, School B focuses on theoretical learning, School C uses technology extensively, and School D emphasizes teamwork and collaboration.", "The test was conducted over a period of two months, with students from each school playing the game independently and reporting their experiences and findings to Futurelab.", "At the end of the trial, the following observations were made:\n1.", "The students in School A learned more about Physics and Engineering than those in other schools.", "2.", "Students in School B found teamwork to be a valuable skill while playing Racing Academy.", "3.", "The students from School C focused mainly on understanding gaming technology.", "4.", "While the students of School D had fun playing the game, they didn't learn any new skills.", "The schools did not have similar teaching styles or resources that could explain the observations made.", "Question: Based on these results and the following information about each school's teaching style and resources, which school(s) were likely to be using Gaming as an educational tool in their curriculum?", "Analyze the observation for each school with respect to the teaching methodology: \n- School A has a hands-on approach.", "Hence, it seems like they would benefit from the practical aspects of games.", "Racing Academy, being a game requiring engineering and physics knowledge, will fit well with this teaching style.", "- School B focuses on theoretical learning.", "The teamwork aspect in Racing Academy makes sense for such educational institutions as it allows students to learn through collaboration rather than individual effort.", "- School C uses technology extensively.", "Given the tech-focused nature of Racing Academy, it's possible that they would benefit from this game.", "- School D emphasizes teamwork and collaboration.", "This aligns with Racing Academy where interaction is key.", "Identify which of these schools were using games in their curriculum:\n- Based on step 1, all four schools are potential candidates as the game's teaching methodology overlaps with each school's teaching style.", "- However, since they have different resources and teaching styles, it's possible that each school is adapting the game in a way that suits its educational approach.", "Answer: All four schools (School A, B, C, D) were likely to be using games as an educational tool in their curriculum based on Racing Academy.", "The specific ways in which they incorporated the game into their teaching will vary due to their different resources and teaching styles."], "orca-mini:3b": [" Video games could soon be transplanted from their natural habitat to the more academic atmosphere of the classroom.", "Games and learning have not always sat well together but the tide could be beginning to turn.", "Recent research by the London Institute of Education concluded that games have a valid place in the classroom.", "Martin Owen, at Futurelab, believes that games can help children learn life skills such as decision making, problem solving.", "He also said that games can help children make quick assessments of situations and learning by trial and error.", "Lateral Visions is a Liverpool-based games firm that is looking into developing games for educational purposes.", "The company's goal is to write something that has all the look and feel of a commercial game but with an educational and learning element.", "The result is Racing Academy, a massively multiplayer car racing game, which requires not only a thirst for speed but also a working knowledge of physics and engineering as well.", "The game requires players to build and maintain their vehicles and to monitor and analyze performance using data from a variety of outputs, before and after racing.", "Teamwork is essential and a chat area allows students to exchange information and data, work collaboratively, and review their own performances.", "Dr Carl Gavin, managing director of Lateral Visions, believes that games can satisfy both teachers' need for learning outcomes and the children's desire to rise to a challenge.", "The game has been trialled in two secondary schools in Bristol and feedback from students has been positive.", "Games in the classroom need to support the teacher and it is not about giving children free rein to play games but recognizing that games attract attention and offer a challenge.", "Professor Angela MacFarlane, based at Bristol University, has spent several years researching how games can be incorporated into classrooms.", "The use of games in schools has been patchy, with Sim City proving the most popular.", "However, games like Civilization and Age of Empire have educational elements, making them potentially useful for classroom use.", "It may take some time until that particular game makes it into the classroom"], "hermes3:3b": ["Video games for classroom use and learning; research supports integration; Racing Academy game tests viability of using gaming for educational purposes, requiring physics knowledge, teamwork & chat area collaboration."], "stablelm-zephyr:3b": ["Games might soon be used more in schools, thanks to research by the London Institute of Education showing their value in teaching life skills like decision-making and problem-solving.", "Lateral Visions, a games company, created Racing Academy, a car racing game that teaches physics and engineering.", "It's being tested in two secondary schools in Bristol and has positive feedback from students.", "Using games in schools has been inconsistent, but lighter versions of popular games could be the solution to bring gaming into the classroom while making it educational for both students and developers."], "stablelm2:1.6b": ["Video games are being considered for use in classrooms to teach life skills such as decision-making, problem-solving and quick assessments of situations through trial and error.", "London Institute of Education research found that gaming is a valid educational tool due to its ability to teach these skills.", "Lateral Visions developed Racing Academy, a massively multiplayer car racing game with educational elements, designed for classroom use.", "Futurelab is using the game in two secondary schools in Bristol to test its viability for use in classrooms, along with learning outcomes.", "The game requires players to understand how cars work to win races and uses teamwork, data analysis and collaboration to help students learn.", "The potential of gaming as an educational tool has been acknowledged by Professor Angela MacFarlane, who found that even violent games can teach life skills."], "granite3.1-dense:2b": ["Video games, often dismissed due to their violent content, are increasingly being considered as viable educational tools in classrooms.", "Research by the London Institute of Education, conducted by Futurelab's Martin Owen, highlights the potential of games in teaching life skills like decision-making and problem-solving.", "Lateral Visions, a games firm, has developed Racing Academy, a massively multiplayer car racing game that integrates learning with entertainment.", "The game requires players to understand physics and engineering while building and maintaining virtual vehicles, fostering teamwork through an online chatroom.", "Trialed in two Bristol secondary schools, Racing Academy has shown positive feedback from students.", "They use game statistics to optimize car designs and the message board for collaborative idea sharing.", "Dr. Carl Gavin of Lateral Visions believes this game meets both teachers' learning objectives and children's competitive spirit without allowing unrestricted gaming.", "Professor Angela MacFarlane from Bristol University, researching games in education, found traditional edu-tainment software more prevalent than mainstream games like SimCity or Grand Theft Auto.", "She suggests \"lite\" versions of popular games with educational content could bridge the gap between mainstream gaming and education.", "This approach would encourage developers to create for the educational market due to lower adaptation costs and marketing opportunities.", "While Grand Theft Auto, for instance, is popular among players, its inclusion in classrooms may take time."], "chatgpt-4o-latest": ["Video games are increasingly being considered for classroom use, with research suggesting they teach valuable life skills like decision-making and problem-solving.", "Futurelab, a non-profit exploring technology in education, is testing this idea with Racing Academy, a multiplayer car racing game that incorporates physics and engineering concepts.", "The game encourages teamwork, data analysis, and collaborative learning through chatrooms.", "Trials in schools have shown positive feedback, with students using in-game statistics and message boards to enhance learning.", "Researchers suggest that a balance between mainstream games and educational software could be the best approach, with 'lite' versions of commercial games offering a cost-effective way to integrate gaming into education.", "Some existing games, like Civilization and Age of Empires, already contain educational elements, though violent games like Grand Theft Auto are unlikely to be adopted soon."]}