{"raw_text": "'Evil twin' fear for wireless net\n \n People using wireless high-speed net (wi-fi) are being warned about fake hotspots, or access points.\n \n The latest threat, nicknamed evil twins, pose as real hotspots but are actually unauthorised base stations, say Cranfield University experts. Once logged onto an Evil Twin, sensitive data can be intercepted. Wi-fi is becoming popular as more devices come with wireless capability. London leads the global wi-fi hotspots league, with more than 1,000. The number of hotspots is expected to reach 200,000 by 2008, according to analysts. \"Users need to be wary of using their wi-fi enabled laptops or other portable devices in order to conduct financial transactions or anything that is of a sensitive or personal nature,\" said Professor Brian Collins, head of information systems at Cranfield University.\n \n \"Users can also protect themselves by ensuring that their wi-fi device has its security measures activated,\" he added. BT Openzone, which operates a vast proportion of public hotspots in the UK, told the BBC News website that it made every effort to make its wi-fi secure. \"Naturally, people may have security concerns,\" said Chris Clark, chief executive for BT's wireless broadband.\n \n \"But wi-fi networks are no more or less vulnerable than any other means of accessing the internet, like broadband or dial-up.\" He said BT Openzone, as well as others, have sophisticated encryption from the start of the login process to the service at a hotspot. \"This means that users' personal information and data, logon usernames and passwords are protected and secure,\" said Mr Clark.\n \n In the vast majority of cases, base stations straight out of the box from the manufacturers are automatically set up with the least secure mode possible, said Dr Nobles. Cybercriminals who try to glean personal information using the scam, jam connections to a legitimate base station by sending a stronger signal near to the wireless client. Anyone with the right gear can find a real hotspot and substitute it with an evil twin. \"Cybercriminals don't have to be that clever to carry out such an attack,\" said Dr Phil Nobles, a wireless net and cybercrime expert at Cranfield. \"Because wireless networks are based on radio signals they can be easily detected by unauthorised users tuning into the same frequency.\"\n \n Although wi-fi is increasing in popularity as more people want to use high-speed net on the move, there have been fears over how secure it is. Some companies have been reluctant to use them in large numbers because of fears about security. A wireless network that is not protected can provide a backdoor into a company's computer system. Public wi-fi hotspots offered by companies like BT Openzone and The Cloud, are accessible after users sign up and pay for use. But many home and company wi-fi networks are left unprotected and can be \"sniffed out\" and hi-jacked by anyone with the correct equipment. \"BT advises that customers should change all default settings, make sure that their security settings on all equipment are configured correctly,\" said Mr Clark. \"We also advocate the use of personal firewalls to ensure that only authorised users can have access and that data cannot be intercepted.\" Dr Nobles is due to speak about wireless cybercrime at the Science Museum's Dana Centre in London on Thursday.\n", "llama3.2:1b": ["People using wireless high-speed net (wi-fi) are being warned about fake hotspots, or evil twins, which pose as real but actually unauthorised base stations that can intercept sensitive data and financial transactions.", "Experts from Cranfield University claim that wi-fi networks are vulnerable to these attacks due to a lack of security measures in some cases, including base stations straight out of the box from manufacturers being set up with the least secure mode possible.", "Wi-fi is expected to reach 200,000 hotspots by 2008.", "To protect themselves, users can ensure their device has its security settings activated and use personal firewalls to prevent unauthorized access."], "llama3.2:3b": ["People using wireless high-speed net are being warned about fake hotspots, or \"evil twins,\" which pose as real hotspots but are actually unauthorised base stations that can intercept sensitive data.", "The number of hotspots is expected to reach 200,000 by 2008.", "Users need to be wary and protect themselves by activating security measures on their devices."], "gemma2:2b": ["Evil twins pose a threat as fake wireless hotspots, stealing sensitive information when used by unsuspecting users.", "Despite increasing popularity of Wi-Fi due to its portability, security concerns remain prevalent.", "Experts point out that while legitimate Wi-Fi networks are secure using encryption from the login process, unauthorized individuals can still easily hijack these connections through frequency detection and manipulation.", "To mitigate this risk, it is crucial for users to activate security measures on their devices and change default settings for maximum protection."], "qwen2.5:0.5b": ["People using wireless high-speed net (Wi-Fi) are being warned against fake hotspots or \"evil twins,\" as they pose as real Wi-Fi access points but are actually unauthorised base stations.", "Once logged into an Evil Twin, sensitive data can be intercepted.", "Wi-Fi is becoming popular for devices with wireless capability, such as laptops and smartphones, with more than 100,000 hotspots expected by 2008 in the UK.", "BT Openzone, which operates a large portion of public Wi-Fi networks, has taken steps to make its systems secure.", "Cybercriminals can use unauthorised devices that are set up automatically and can easily access these networks.", "Users should change default settings on their equipment and ensure their security settings are configured correctly to protect themselves from such attacks."], "qwen2.5:1.5b": ["Wireless hotspots called \"evil twins\" pose as real ones but are actually unauthorized stations, allowing sensitive information interception if logged onto.", "Users should ensure their devices have security enabled and prioritize cautious use of wi-fi for financial transactions or personal data protection.", "BT Openzone secures its networks through encryption from login to service provision.", "Cybercriminals can substitute legitimate hotspots with evil twins using unauthorised base stations' frequencies, posing a risk due to wireless networks being susceptible to jamming signals near them.", "Public Wi-Fi is less secure than home networks without proper security measures and can be easily \"sniffed out\" by unauthorized users with the right equipment."], "qwen2.5:3b": ["'Evil twin' fears are growing for wi-fi networks, particularly as more devices use wireless capability.", "Fake hotspots pose as legitimate ones but are unauthorized base stations that can intercept sensitive data.", "Wi-fi is becoming increasingly popular, with 1,000+ public hotspots in London and predictions of over 200,000 by 2008.", "Users should be cautious about using wi-fi for financial transactions or personal information.", "Devices must have security measures activated to protect against 'evil twins.'", "BT Openzone emphasizes its efforts to secure networks but notes that all base stations are set up in the least secure mode initially.", "Cybercriminals can jam legitimate signals and substitute with their own.", "Companies sometimes hesitate due to security concerns, but public hotspots offered by companies like BT have access controls for users.", "Security measures include changing default settings and using personal firewalls to prevent unauthorized access or data interception."], "opencoder:1.5b": ["'Evil twin' fear for wireless net\n\nPeople using wi-fi (wireless high-speed net) are being warned about fake hotspots, or access points.", "The latest threat, named evil twins, pose as real hotspots but are actually unauthorised base stations, say Cranfield University experts.", "Once logged onto an Evil Twin, sensitive data can be intercepted.", "Wi-fi is becoming popular as more devices come with wireless capability.", "London leads the global wi-fi hotspots league, with more than 1,000.", "The number of hotspots is expected to reach 200,000 by 2008, according to analysts.", "\"Users need to be wary of using their wi-fi enabled laptops or other portable devices in order to conduct financial transactions or anything that is of a sensitive or personal nature,\" said Professor Brian Collins, head of information systems at Cranfield University.", "\"Users can also protect themselves by ensuring that their wi-fi device has its security measures activated,\" he added.", "BT Openzone, which operates a vast portion of public hotspots in the UK, told the BBC News website that it made every effort to make its wi-fi secure.", "\"Naturally, people may have security concerns,\" said Chris Clark, chief executive for BT's wireless broadband.", "\"In the vast majority of cases, base stations straight out of the box from the manufacturers are automatically set up with the least secure mode possible, said Dr Nobles.", "Cybercriminals who try to glean personal information using the scam, jam connections to a legitimate base station by sending a stronger signal near to the wireless client.", "Anyone with the right gear can find a real hotspot and substitute it with an evil twin.", "\"Cybercriminals don't have to be that clever to carry out such an attack,\" said Dr Phil Nobles, a wireless net and cybercrime expert at Cranfield.", "\"Because wireless networks are based on radio signals they can be easily detected by unauthorised users tuning into the same frequency.\"", "Although wi-fi is increasing in popularity as more people want to use high-speed net on the move, there have been fears over how secure it is.", "Some companies have been reluctant to use them in large numbers because of fears about security.", "A wireless network that is not protected can provide a backdoor into a company's computer system.", "Public wi-fi hotspots offered by companies like BT Openzone and The Cloud, are accessible after users sign up and pay for use.", "But many home and company wi-fi networks are left unprotected and can be \"sniffed out\" and hi-jacked by anyone with the correct equipment.", "\"BT advises that customers should change all default settings, make sure that their security settings on all equipment are configured correctly,\" said Mr Clark.", "\"We also advocate the use of personal firewalls to ensure that only authorised users can have access and that data cannot be intercepted.\"", "Dr Nobles is due to speak about wireless cybercrime at the Science Museum's Dana Centre in London on Thursday."], "smollm:1.7b": ["The evil twin fear for wireless net is a growing concern, as more people use public Wi-Fi hotspots to conduct online activities.", "The latest threat, dubbed \"Evil Twin,\" poses as real hotspots but are actually unauthorised base stations that can intercept sensitive data.", "Cybercriminals who try to gain access to these networks by sending stronger signals near the wireless client can easily detect and exploit vulnerabilities in the network.", "To mitigate this risk, it is essential for companies to ensure that their public Wi-Fi networks are protected with robust security measures such as encryption and secure authentication protocols.", "Additionally, users should be cautious when using public Wi-Fi hotspots and avoid accessing sensitive information while connected to an unsecured network.", "In the case of BT Openzone, which operates a vast proportion of public hotspots in the UK, it makes every effort to ensure that its wi-fi networks are set up with the least secure mode possible.", "However, cybercriminals who try to gain access to these networks by sending stronger signals near the wireless client can easily detect and exploit vulnerabilities in the network.", "To address this issue, companies should take proactive measures such as implementing robust security protocols and educating users about the risks associated with public Wi-Fi networks.", "It is also essential for governments and regulatory bodies to establish guidelines and regulations that ensure the secure use of public Wi-Fi networks."], "deepseek-r1:1.5b": ["People using wireless high-speed networks (wi-fi) are being warned about fake hotspots called \"evil twins.\"", "These can intercept sensitive data once logged in.", "The number of hotspots is expected to grow, with London leading the global category leader position, aiming for 200,000 by 2008 according to analysts.", "Users should be cautious of using their devices for financial transactions or personal data and protect themselves by securing their networks.", "BT Openzone claims they are working on making their hotspots secure, but users need to take precautions against potential hacking attempts.", "Cranfield University's experts warn about the risks involved, particularly with how Wi-Fi networks use radio signals that may be picked up by others.", "Users should ensure their security is activated and consider using personal firewalls for added protection."], "tinyllama:1.1b": ["In a recent article, Cranfield University expert Professor Brian Collins warns of \"evil twins\" or fake hotspots that pose as real wi-fi access points, posing risks to sensitive personal information and financial transactions, as well as personal security concerns.", "The latest threat, nicknamed evil twins, poses as unauthorized base stations in public hotspot networks, and users need to be warned about using their devices for financial transactions or sensitive data, as BT Openzone warns of the \"security measures\" available to them to protect themselves.", "Despite being offered by companies like BT Openzone, wireless network systems are still considered a backdoor into computers due to fears of security, leaving public wi-fi networks vulnerable.", "The Science Museum in London will host an expert lecture on \"wireless cybercrime,\" where Dr Nobles, a wireless net and cybercrime expert at Cranfield University, advocates the use of personal firewalls to prevent interception."], "tinydolphin:1.1b": [" A wireless network, also known as a Wi-Fi hotspot, is becoming increasingly popular among users, who are using laptops, mobile phones and other electronic devices to connect to high-speed networks via radio waves.", "However, there have been concerns about the security of these networks, particularly with regard to wireless encryption.", "A new study by experts at Cranfield University has found that users should be aware of the risks associated with using wireless networks in public places and should take steps to protect themselves and their data.", "The study examined how vulnerable laptops and other devices were to attacks by cybercriminals who could use them as scams or to replace legitimate base stations with \"evil twins.\"", "It found that most wireless networks come straight out of the box with insecure security settings, which can make them easy targets for hackers.", "Dr Nobles, a wireless net and cybercrime expert at Cranfield, warns that companies like BT Openzone are leaving their networks vulnerable by not making their networks as secure as they should be.", "This means that users can easily become victims of attacks and their personal information and data may be intercepted.", "BT Openzone's head of information systems, Professor Brian Collins, agrees with Dr Nobles's concerns about security and suggests that users need to ensure that their wireless devices have their security measures activated.", "The company also provides security measures for its networks, such as encryption from the start of the login process to the service at a hotspot.", "In addition to this, Chris Clark, chief executive for BT's wireless broadband division, explains that BT Openzone makes every effort to make its networks secure.", "This includes using sophisticated encryption from the start of the login process to the service at a hotspot.", "\"This means that users' personal information and data are protected and secure,\" he said.", "Dr Nobles suggests that cybercriminals don't have to be that clever to carry out such attacks, as they can simply substitute an evil twin with a real base station.", "However, wireless networks are increasing in popularity as more people want to use high-speed internet on the move, and there are fears about how secure they are."], "phi:2.7b": [" 'Evil twin' fear for wireless high-speed net warns people using wi-fi hotspots, which can pose as legitimate base stations but are actually unauthorised and can intercept sensitive data.", "Wi-fi is becoming popular with more devices having wireless capability.", "BT Openzone ensures security by setting up encryption from the start of login to service at a hotspot.", "Cybercriminals use a scam by sending stronger signals near to genuine base stations, making it easy for anyone with the right gear to locate a real hotspot and substitute it with an evil twin.", "Wireless networks can be easily detected by unauthorised users tuning into the same frequency.", "BT and The Cloud recommend changing default settings, using personal firewalls and ensuring security settings are correctly configured to prevent such attacks."], "orca-mini:3b": [" The text discusses the growing concern about fake wireless hotspots or access points posing as real hotspots, which can intercept sensitive data when used for financial transactions or personal information.", "The text quotes experts warning that cybercriminals can easily find a real hotspot and substitute it with an evil twin.", "The text also mentions the popularity of wi-fi networks, but there are concerns over how secure they are.", "Companies like BT Openzone offer public wi-fi hotspots for use after users sign up and pay for access.", "However, home and company wi-fi networks may not be protected and can be easily intercepted by unauthorized users with the right equipment.", "The text also quotes experts advising customers to change all default settings, configure security settings correctly, and use personal firewalls to prevent data interception."], "hermes3:3b": ["'Evil Twins' Wi-Fi Threat: People using wireless networks warned about fake hotspots which can intercept sensitive data, as number of global Wi-Fi hotspots rises."], "stablelm-zephyr:3b": ["Experts from Cranfield University warn people using wireless high-speed internet (wi-fi) about fake hotspots, called evil twins, which are actually unauthorized base stations.", "Once connected, sensitive data can be intercepted.", "To protect themselves, users should activate their wi-fi device's security measures and change default settings on equipment, ensuring only authorized users can access the network and data cannot be intercepted."], "stablelm2:1.6b": ["Cranfield University experts warn people using wireless high-speed net (wi- Fi) about fake or unauthorized base stations known as \"evil twins,\" which can intercept sensitive data from devices like laptops.", "London has the most wi-Fi hotspots, with analysts predicting a 80% increase in number by 2024.", "To protect against such threats, BT Openzone emphasizes setting up security measures for users and devices connected to public Wi-Fi networks.", "Most base stations are set up with least secure mode possible, allowing cybercriminals to jam connections near the wireless client."], "granite3.1-dense:2b": ["Experts from Cranfield University warn of a growing security threat, dubbed \"evil twins,\" targeting Wi-Fi users.", "Evil twins impersonate legitimate hotspots, luring unsuspecting individuals to access them with sensitive data in jeopardy.", "London leads global Wi-Fi hotspot count, expected to reach 200,000 by 2008.", "Users must be cautious when conducting personal or financial transactions via Wi-Fi devices.", "To protect themselves, they should activate security measures on their Wi-Fi-enabled laptops and other portable devices.", "BT Openzone, a significant provider of public hotspots in the UK, emphasizes that its networks are secure from start to finish, with robust encryption safeguarding personal information.", "Cybercriminals can create evil twins by intercepting legitimate base station signals or tuning into the same frequency as real hotspots using specialized equipment.", "The prevalence of Wi-Fi has led some businesses to hesitate due to security concerns, as unprotected networks could serve as entry points for cybercriminals.", "BT Openzone advises customers to modify default settings and ensure proper security configurations on their devices.", "Dr. Phil Nobles, a Cranfield expert, will discuss wireless cybercrime at the Science Museum's Dana Centre in London."], "chatgpt-4o-latest": ["Users of wireless internet (wi-fi) are being warned about \"evil twin\" hotspots, which mimic legitimate access points to intercept sensitive data.", "Experts from Cranfield University highlight the risks, especially as wi-fi becomes more widespread, with London leading in global hotspots.", "Cybercriminals can easily set up fake hotspots by jamming legitimate signals.", "Security measures, such as encryption and personal firewalls, are recommended to protect users.", "While companies like BT Openzone implement security protocols, many home and corporate networks remain vulnerable.", "Users are advised to change default settings and activate security features to prevent cyberattacks.", "Dr. Phil Nobles will discuss wireless cybercrime at an upcoming event in London."]}