{"raw_text": "Google launches TV search service\n \n The net search giant Google has launched a search service that lets people look for TV programmes.\n \n The service, Google Video beta, searches closed caption information that comes with programmes. It only searches US channel content currently. Results list programmes with still images and text from the point where the search phrase was spoken. It should expand over time to include content from more channels, said a Google spokesperson. The first version of the service is part of Google's expanding efforts to be a ubiquitous search engine for people to find what they want on the web and beyond. \"We think TV is a big part of people's lives,\" said Jonathan Rosenberg, Google's vice president of product management. \"Ultimately, we would like to have all TV programming indexed.\"\n \n Google Video has been indexing US-based programmes from PBS, the NBA, Fox News, and C-SPAN since December. But there were few clues from Google about when more global broadcasters would be included. \"Over time, we plan to increase the number of television channels and video content available via Google Video but don't have more product details to share with you today,\" a Google spokesperson told the BBC News website.\n \n The results thrown up by the search will also include programme and episode information like channel, date and time. It also lets people find the next time and channel where a programme will aired locally using a US zip code search function. Rival search engine Yahoo has been developing a similar type of video search for webcasts and TV clips which it promotes from its homepage. It offers direct links to websites with movies or other clips relevant to the search query, but does not pinpoint when the search query occurred. A spokeswoman told the Financial Times on Monday that Yahoo was adding captioning for Bloomberg, BBC and BSkyB broadcasts. A smaller service, blinkx.tv, was launched last month. It searches for and links to TV news, film trailers, and other video and audio clips.\n", "llama3.2:1b": ["Google launches TV search service Google Video beta, which searches closed caption information from US channel content to find TV programmes.", "The service will expand over time to include more channels.", "Initially available in the US, it indexes content from PBS, NBA, Fox News, and C-SPAN.", "Results will also include episode information and a local airtime function."], "llama3.2:3b": ["Google launches Google Video beta, a search service that indexes closed caption information from US channel content, including PBS, NBA, Fox News, and C-SPAN, with results listing programmes, episode info, and airing times.", "The service aims to expand globally, indexing all TV programming."], "gemma2:2b": ["Google launches its beta version of a search service called Google Video that allows users to find television programs based on closed caption information.", "Currently only US channel content is indexed, but the company plans to expand to include content from more broadcasters over time."], "qwen2.5:0.5b": ["Google launches a new TV search service, Google Video beta, that lets users look up TV programmes using closed caption information provided with the channel content.", "The service will include US-based channels like PBS, Fox News, and C-SPAN since December but hasn't disclosed more product details yet.", "The results of searches will include programme and episode information as well as dates and times for shows airing locally."], "qwen2.5:1.5b": ["Google launches a beta service called Google Video that allows people to search for closed captions from TV programs, currently focusing on US channels like PBS, Fox News, and C-SPAN.", "The goal is to eventually index all global television programming.", "Results include still images and text matching the spoken query, alongside program details such as channel name, date, and time.", "Google plans to expand its offerings over time but has not provided specific timelines for other broadcasters."], "qwen2.5:3b": ["Google launches a beta TV search service called Google Video that uses closed captions from US channels to find TV programmes.", "The initial version provides still images and text of results with the search phrase spoken.", "It plans to expand to more global broadcasters over time, offering programme information like channel, date, and airing times.", "Additionally, it allows users to find local airings using a zip code search function.", "Rival Yahoo offers similar video search but without pinpointing when the query occurred.", "A smaller service, blinkx.tv, searches for TV news, film trailers, and other video/audio clips."], "opencoder:1.5b": ["Google launches a search service for TV programs.", "The net search giant Google has indexed closed caption information for programmes.", "It is currently searching US channel content only.", "Results list programmes with still images and text from the point where the search phrase was spoken.", "The first version of the service is part of Google's expanding efforts to be a universal search engine for people to find what they want on the web.", "\"We think TV is a big part of people's lives,\" said Jonathan Rosenberg, Google's vice president of product management.", "Ultimately, we would like to have all TV programming indexed by Google Video.", "PBS, the NBA, Fox News, and C-SPAN since December.", "There were few clues from Google about when more global broadcasters would be included over time, and plans to increase the number of television channels and video content available via Google Video but don't have more product details to share with you today.", "The results thrown up by the search will also include programme and episode information like channel, date and time.", "It lets people find the next time and channel where a programme will aired locally using a US zip code search function.", "Rival search engine Yahoo has been developing a similar type of video search for webcasts and TV clips which it promotes from its homepage.", "A spokeswoman told the Financial Times on Monday that Yahoo was adding captioning for Bloomberg, BBC and BSkyB broadcasts.", "A smaller service, blinkx.tv, was launched last month to promote TV news, film trailers, and other video and audio clips."], "smollm:1.7b": ["Google launches TV search service with closed captions"], "deepseek-r1:1.5b": ["Google has launched a search service called **Google Video Beta** to help users find TV shows by searching for closed captioned information.", "Currently, it indexes US-based TV channels like PBS, NBA, Fox News, and C-SPAN.", "Results display TV shows with still images and text placed where the search term was spoken.", "The service aims to expand to include more channels over time and is similar in scope to a YouTube-like video search offered by Yahoo, which adds captioning but doesn't pinpoint when a search query occurred.", "Another service, Blinkx.tv, was also launched for TV searches last month.", "Google's goal is to make searching everywhere possible for TV and related content."], "tinyllama:1.1b": ["Google has launched a TV search service called Google Video Beta which enables people to search for television programmes using closed caption information and text from the moment when the search phrase was spoken.", "The service is currently available in the US and it will expand to include content from more channels in future.", "It also lets users find out the next time and channel where a programme will be shown locally.", "Google's YouTube, which already indexes thousands of video clips, has been developing a similar video search feature for webcasts and TV clip shows since 2005.", "However, as Google Video Beta is not the first search engine to index television content globally, there were few details about when more global broadcasters will be included."], "tinydolphin:1.1b": [" Google has made a significant step in expanding its search capabilities by launching an online TV search service called Google Video.", "This new service lets users look up TV programs by searching closed-caption information that comes with the programmes.", "Currently, results are limited to US channels but Google plans to expand this to include content from more global broadcasters over time.", "Users can find out the next air date and channel for a particular programme using a zip code search function in the Google Video beta.", "Meanwhile, rival search engine Yahoo has been developing a similar type of video search that includes direct links to websites with movie clips or TV show clips relevant to the search query."], "phi:2.7b": [" Google has introduced a new search service called Google Video beta that lets people find television programs by searching closed caption information.", "The first version of the service only indexes US-based content from popular channels such as PBS, the NBA, Fox News, and C-SPAN.", "In the future, Google plans to expand its services to include more TV programming from around the world.", "Yahoo has also been working on a similar video search that provides links to websites with movies or clips relevant to the search query, but does not specify when the search was made.", "Blinkx.tv is a smaller service that searches for and links to TV news, film trailers, and other videos and audio clips."], "orca-mini:3b": [" Google has launched a search service called Google Video that lets people search for TV programmes.", "The service searches closed caption information that comes with the programmes and only searches US channel content at present.", "Results list programmes with still images and text from the point where the search phrase was spoken, and expand over time to include content from more channels.", "The first version of the service is part of Google's efforts to be a ubiquitous search engine for people to find what they want on the web and beyond."], "hermes3:3b": ["Google launches TV search service, Google Video beta; indexes US-based programs; plans to include more channels over time."], "stablelm-zephyr:3b": ["Google has launched Google Video beta, a TV search service that searches closed caption information of programs.", "It currently searches US channel content and plans to expand over time to include more channels.", "The results include program and episode information like channel, date, and time.", "Google aims to be a ubiquitous search engine for finding what people want on the web and beyond, eventually indexing all TV programming.", "Rival search engines, such as Yahoo and blinkx.tv, also offer video search services but differ in their capabilities and coverage."], "stablelm2:1.6b": ["Google has introduced a search service called Google Video beta which allows users to find TV programs with images and text from spoken phrases.", "The service currently searches US channels and includes closed caption information.", "Expansion plans are underway to add more content from various channels.", "This is part of Google's mission to be a ubiquitous search engine for people searching the web and beyond.", "The results also provide program, channel, date, and time details.", "Competitor Yahoo has been developing similar video search services for TV and webcasts."], "granite3.1-dense:2b": ["Google introduces Google Video beta, a new search service focusing on US television programmes.", "The service utilizes closed captioning data from broadcasts to provide results with images and text corresponding to the point where the search term was spoken.", "Currently indexing content from PBS, the NBA, Fox News, and C-SPAN since December, Google plans to expand to include more global channels over time.", "Results display program details like channel, date, and time, and offer a US zip code search for local air times.", "This initiative aligns with Google's broader goal of becoming an all-encompassing search engine for diverse content discovery."], "chatgpt-4o-latest": ["Google has launched Google Video beta, a TV search service that indexes closed caption information from US channels, allowing users to find programmes based on spoken phrases.", "Currently covering PBS, NBA, Fox News, and C-SPAN, the service provides still images, text, and scheduling details.", "Google aims to expand coverage to more channels and eventually index all TV programming.", "Rival services include Yahoo's video search, which links to webcasts and TV clips, and blinkx.tv, which searches TV news, film trailers, and other media."]}