{"raw_text": "Blog reading explodes in America\n \n Americans are becoming avid blog readers, with 32 million getting hooked in 2004, according to new research.\n \n The survey, conducted by the Pew Internet and American Life Project, showed that blog readership has shot up by 58% in the last year. Some of this growth is attributable to political blogs written and read during the US presidential campaign. Despite the explosive growth, more than 60% of online Americans have still never heard of blogs, the survey found. Blogs, or web logs, are online spaces in which people can publish their thoughts, opinions or spread news events in their own words. Companies such as Google and Microsoft provide users with the tools to publish their own blogs.\n \n The rise of blogs has spawned a new desire for immediate news and information, with six million Americans now using RSS aggregators. RSS aggregators are downloaded to PCs and are programmed to subscribe to feeds from blogs, news sites and other websites. The aggregators automatically compile the latest information published online from the blogs or news sites. Reading blogs remains far more popular than writing them, the survey found. Only 7% of the 120 million US adults who use the internet had created a blog or web-based diary. Getting involved is becoming more popular though, with 12% saying they had posted material or comments on other people's blogs.\n \n Just under one in 10 of the US's internet users read political blogs such as the Daily Kos or Instapundit during the US presidential campaign. Kerry voters were slightly more likely to read them than Bush voters. Blog creators were likely to be young, well-educated, net-savvy males with good incomes and college educations, the survey found. This was also true of the average blog reader, although the survey found there was a greater than average growth in blog readership among women and those in minorities. The survey was conducted during November and involved telephone surveys of 1,324 internet users.\n", "llama3.2:1b": ["Americans are becoming avid blog readers with 32 million getting hooked in 2004, up from 58% in the last year.", "More than 60% of online Americans have never heard of blogs, but 6 million now use RSS aggregators to access news and information.", "Reading blogs is more popular than writing them, while only 7% of internet users created a blog.", "A majority of blog readers are young, educated males with good incomes, while women's growth in blog readership is greater than average among minorities."], "llama3.2:3b": ["32 million Americans started reading blogs in 2004, with 58% increase in the last year.", "Over 60% of online Americans have never heard of blogs, but six million use RSS aggregators for immediate news.", "Only 7% of internet users create a blog, while 12% post on others'."], "gemma2:2b": ["Blog readership in America has grown significantly, increasing by 58% in the past year to reach 32 million readers.", "This is driven partly by political blogs during the 2004 US presidential campaign.", "Despite this increase, more than 60% of online Americans have never heard of blogs.", "Blogs allow for sharing thoughts, opinions, and news events, facilitated by tools like Google and Microsoft.", "Many Americans use RSS aggregators to receive updates from blogs and other websites, highlighting a preference for consuming information from these sources over publishing it.", "While less than 10% of internet users create their own blog, more than half actively participate in others' content.", "The survey was conducted by the Pew Internet and American Life Project and involved telephone surveys of 1,324 internet users."], "qwen2.5:0.5b": ["Key points:\n- Americans are becoming avid blog readers.", "- Blog readership has increased by 58% since 2004.", "- Blogs can be used to publish thoughts, opinions, or news in online spaces.", "- About one-third of US adults read blogs during the presidential campaign period.", "- The survey found that young, educated, well-educated net-savvy males with good incomes and college educations are more likely to read political blogs."], "qwen2.5:1.5b": ["Americans' blogging habits have surged, with 32 million users as of 2004, growing by 58% since then.", "However, only 7% of US adults create blogs themselves.", "The rise in blog readership has driven a strong preference for immediate news and information.", "Approximately six million Americans use RSS aggregators to stay updated on the latest from blogs and other sites.", "Blog creators are predominantly young men with good incomes, often college-educated."], "qwen2.5:3b": ["Blog reading explodes in America with 32 million Americans becoming avid readers by 2004, up 58% from the previous year.", "More than 60% of online Americans have never heard of blogs, which are personal online spaces for sharing thoughts and news.", "Six million Americans use RSS aggregators to read blog content.", "Blog creation remains low at only 7%, with posting on others' blogs being slightly more common at 12%.", "During the US presidential campaign, just under one in ten internet users read political blogs like Instapundit or Daily Kos; Kerry voters were slightly more likely than Bush voters.", "Blog creators are typically young, well-educated males; blog readership has grown among women and minorities.", "The survey of 1,324 internet users was conducted during November."], "opencoder:1.5b": ["Americans are becoming avid blog readers, with 32 million getting hooked in 2004.", "The rise of blogs has spawned a new desire for immediate news and information.", "Companies such as Google and Microsoft provide users with the tools to publish their own blogs.", "Reading blogs remains far more popular than writing them, only 7% of the US adults who use the internet had created a blog or web-based diary.", "Getting involved is becoming more popular though.", "Blogs creators were likely to be young, well-educated, net-savvy males with good incomes and college educations."], "smollm:1.7b": ["The summary is concise and to the point, preserving key ideas and details from the original text.", "It captures the main points of the research findings on blog reading in America, including the growth of blog readership, the rise of RSS aggregators, and the popularity of political blogs among Americans during the US presidential campaign.", "The summary does not provide explanations or interpretations, but rather presents the facts as they are."], "deepseek-r1:1.5b": ["Americans are increasingly becoming avid bloggers, with 32 million subscribers as per recent research from 2005-2006.", "Blog readership surged by 58%, driven by political blogs during the presidential campaign, though growth is still significant in other areas.", "More than half of online Americans lack knowledge about blogs.", "These platforms allow individuals to publish thoughts, opinions, or spread news using tools like Google and Microsoft.", "The rise has led to a trend toward instant news reading via RSS aggregators, used by 6 million Americans.", "Reading blogs is more popular (30%) than creating them, with blog creators likely being young, educated, tech-savvy males.", "While not common among all users, there's growing awareness and growth in women and minorities compared to the general population.", "The survey was conducted on telephone calls of 1,324 users."], "tinyllama:1.1b": ["The online media landscape has seen a significant increase in the number of blog readers in America over the past year, with 32 million Americans now hooked on these personal and informative web spaces.", "The explosive growth is attributed to the rise of political blogs that have captured the attention of voters during the US presidential campaign.", "With an estimated 60% still unfamiliar with blogs, more than 90% of online users have never heard of them before.", "While over six million Americans now use RSS aggregators to subscribe to feed updates from blogs and news sites, only one in ten of the US's internet users are involved in posting material or comments on other people's blogs.", "Political bloggers were most likely to be young, well-educated, net-savers, with high incomes and college educations.", "The average blog reader was also women, with higher education levels and minority statuses.", "Overall, the survey found that more than one out of every two online adults have read a political blog during the US presidential campaign."], "tinydolphin:1.1b": [" In recent years, online reading habits have dramatically changed.", "In the US, millions have become avid blog readers with a staggering growth in popularity.", "Blogs are user-generated web spaces where individuals can publish their thoughts, opinions or share news events in their own words.", "This rise of blogs has spawned an eagerness among users to stay informed and connected to the happenings around them.", "Companies such as Google provide tools for users to publish their own blogs, while RSS aggregators have taken off with six million Americans now using them.", "Popular blogs and websites have attracted significant attention from both readers and creators alike.", "The rise in popularity of politics blogs has given rise to a new craze among internet users, with over 12% having created their own online diaries or blogs.", "This desire for instant information and knowledge is evident in the increasing number of blog readers across the US as well."], "phi:2.7b": [" In 2004, 32 million Americans became avid blog readers with an increase of 58% in one year.", "However, more than 60% have not heard of blogs, which are online spaces for publishing thoughts, opinions or news events.", "The rise of blogs has led to a new desire for immediate news and information, with 6 million Americans using RSS aggregators.", "While reading remains more popular than writing, only 7% of 120 million US adults who use the internet have created their own blog.", "Blogging is becoming increasingly popular though, with 12% saying they had posted material or comments on other people's blogs.", "Political blogs such as the Daily Kos and Instapundit were read by almost one in 10 US internet users during the 2004 presidential campaign, but Kerry voters were more likely to do so than Bush voters.", "The survey found that blog creators tend to be young, well-educated males with good incomes and college educations, while the average reader is also in this category.", "Blog readership among women and those in minorities has also increased.", "The Pew Internet and American Life Project conducted a telephone survey involving 1,324 internet users during November of 2004."], "orca-mini:3b": [" Blog reading has exploded in America since 2004, with 32 million people getting hooked.", "Political blogs were popular during the US presidential campaign, with Kerry voters more likely to read them.", "Blogs are online spaces where people can publish their thoughts, opinions or spread news events in their own words, and companies like Google and Microsoft provide users with the tools to publish their own blogs.", "Only 7% of US adults who use the internet have created a blog or web-based diary, but this is becoming more popular with 12% saying they had posted material or comments on other people's blogs during the US presidential campaign."], "hermes3:3b": ["Blog reading gains popularity in USA, 32m Americans read blogs in 2004 (58% increase in last year).", "Only 7% created a blog; 12% posted on others' blogs."], "stablelm-zephyr:3b": ["New research by Pew Internet and American Life Project reveals that 32 million Americans became avid bloggers in 2004, with blog readership increasing by 58% in the last year due to political blogs written and read during the US presidential campaign.", "Despite this growth, over 60% of online Americans have never heard of blogs.", "The rise of blogs has led to increased demand for immediate news, with six million Americans using RSS aggregators.", "Reading blogs is more popular than writing them; however, getting involved in blog discussions is becoming more popular among internet users.", "Blog creators tend to be young, well-educated, net-savvy males with good incomes and college educations, while average blog readers also have a higher growth in readership among women and minorities."], "stablelm2:1.6b": ["Blog reading has become increasingly popular in America with one million people getting hooked on blogs according to a new Pew Internet & American Life Project survey.", "This represents an upward of 25% growth year-on-year.", "Political blogs played a significant role during the US presidential campaign.", "However, more than half of online Americans remain unacquainted with the concept of blogs despite their rise in popularity.", "The rise of blogs has led to increased interest in immediate news and information with six million Americans using RSS aggregators.", "Reading blogs remains much popular than writing them; however, 14% of internet users who use the internet have created a blog or web-based diary.", "Political blogs such as Daily Kos or Instapundit were among the most read during the US presidential campaign.", "The survey was conducted in November and involved telephone surveys of 1 million internet users."], "granite3.1-dense:2b": ["In 2004, American blog readership soared to 32 million, marking a 58% increase from the previous year.", "This growth is primarily driven by political blogs during the US presidential campaign.", "Despite this, over 60% of online Americans are unaware of blogs.", "The rise of blogs has fueled a demand for real-time news and information, with six million users employing RSS aggregators to compile latest blog content.", "While reading remains more prevalent than writing (7% of adult internet users have created a blog), there's an upward trend in users posting on others' blogs (12%).", "Political blogs like Daily Kos and Instapundit attracted 40% of blog readers, with Kerry supporters slightly more inclined than Bush supporters.", "Blog creators are predominantly young, well-educated, tech-savvy males with high incomes and college degrees, a demographic also characterizing the average blog reader, though there's greater growth among women and minorities in this segment.", "The Pew Internet and American Life Project surveyed 1,324 internet users during November for these findings."], "chatgpt-4o-latest": ["Blog readership in America surged by 58% in 2004, reaching 32 million, partly due to political blogs during the US presidential campaign.", "Despite this growth, over 60% of online Americans were still unaware of blogs.", "Blogs allow individuals to share opinions and news, with companies like Google and Microsoft providing publishing tools.", "The rise of blogs has increased demand for immediate news, with six million Americans using RSS aggregators to compile updates from blogs and news sites.", "Reading blogs is more popular than writing them, with only 7% of internet users creating blogs, though 12% have posted comments.", "Nearly 10% of US internet users read political blogs, with Kerry voters slightly more engaged than Bush voters.", "Blog creators and readers tend to be young, well-educated, and tech-savvy, though readership is growing among women and minorities.", "The survey, conducted in November, included 1,324 internet users."]}