{"raw_text": "Savvy searchers fail to spot ads\n \n Internet search engine users are an odd mix of naive and sophisticated, suggests a report into search habits.\n \n The report by the US Pew Research Center reveals that 87% of searchers usually find what they were looking for when using a search engine. It also shows that few can spot the difference between paid-for results and organic ones. The report reveals that 84% of net users say they regularly use Google, Ask Jeeves, MSN and Yahoo when online.\n \n Almost 50% of those questioned said they would trust search engines much less, if they knew information about who paid for results was being hidden. According to figures gathered by the Pew researchers the average users spends about 43 minutes per month carrying out 34 separate searches and looks at 1.9 webpages for each hunt. A significant chunk of net users, 36%, carry out a search at least weekly and 29% of those asked only look every few weeks. For 44% of those questioned, the information they are looking for is critical to what they are doing and is information they simply have to find.\n \n Search engine users also tend to be very loyal and once they have found a site they feel they can trust tend to stick with it. According to Pew Research 44% of searchers use just a single search engine, 48% use two or three and a small number, 7%, consult more than three sites. Tony Macklin, spokesman for Ask Jeeves, said the results reflected its own research which showed that people use different search engines because the way the sites gather information means they can provide different results for the same query. Despite this liking for search sites half of those questioned said they could get the same information via other routes. A small number, 17%, said they wouldn't really miss search engines if they did not exist. The remaining 33% said they could not live without search sites. More than two-thirds of those questioned, 68%, said they thought that the results they were presented with were a fair and unbiased selection of the information on a topic that can be found on the net. Alongside the growing sophistication of net users is a lack of awareness about paid-for results that many search engines provide alongside lists of websites found by indexing the web. Of those asked, 62% were unaware that someone has paid for some of the results they see when they carry out a search. Only 18% of all searchers say they can tell which results are paid for and which are not. Said the Pew report: \"This finding is ironic, since nearly half of all users say they would stop using search engines if they thought engines were not being clear about how they presented paid results.\" Commenting Mr Macklin said sponsored results must be clearly marked and though they might help with some queries user testing showed that people need to be able to spot the difference.\n", "llama3.2:1b": ["Savvy searchers fail to spot ads, but 87% of users usually find what they were looking for when using a search engine.", "Few can distinguish between paid-for results and organic ones, with 84% saying they regularly use Google, Ask Jeeves, MSN, and Yahoo.", "Almost half (43%) spend over 43 minutes per month searching and look at around 1.9 webpages per search.", "A significant proportion (36%) carry out searches weekly, while others only look every few weeks.", "Search engines are often used as a single site or two, with 7% consulting more than three sites.", "The majority of users (44%) use just one search engine, but also have access to other sites.", "Many feel that search results are unbiased and fair, but only 33% know how paid-for results differ from organic ones."], "llama3.2:3b": ["87% of searchers find what they're looking for; 84% use Google, Ask Jeeves, MSN, and Yahoo regularly; 36% search weekly, 44% rely on a single search engine; most users trust search engines but are unaware of paid results; 62% don't know if results are paid for."], "gemma2:2b": ["87% of search users find what they are looking for, but few understand the difference between paid-for and organic results.", "The average user spends 43 minutes per month searching for information, and often relies on a single or two search engines.", "While most believe search engine results are unbiased, only 18% can identify which paid results appear in search.", "The report highlights the need for greater transparency regarding sponsored results and their impact on user behavior."], "qwen2.5:0.5b": ["Internet searchers often overlook ads, according to a Pew Research Center survey revealing 87% find what they're searching for when using a search engine, while few can identify paid results from organic searches.", "Paid sites are viewed as hidden fees behind other websites' content and information.", "Users spend around 43 minutes per month carrying out multiple searches, looking at about 1.9 pages each hunt.", "Most users regularly use Google, Ask Jeeves, MSN, or Yahoo when online.", "Nearly half of those questioned say they would trust search engines less if they knew who paid for results was being hidden.", "Search engine users are loyal and often stick with sites that provide accurate information.", "However, the report suggests many users still feel some satisfaction from search results but may not realize their ad-hoc nature.", "Pew Research shows half of searchers think search engines present a clear selection of content while only 18% say they can tell which is paid for and what isn't.", "It's ironic that most people would avoid search engines if searches were free, as they'd be able to spot paid results better."], "qwen2.5:1.5b": ["Search engine users often rely on sites for information, but don't notice when ads are included alongside organic results.", "More than half of those surveyed say they can't tell which search engine results come from paid sources, and 62% believe paid-for listings should be clearly marked."], "qwen2.5:3b": ["Savvy searchers fail to spot ads.", "A Pew Research Center report indicates 87% of searchers find what they seek, but few can distinguish between paid-for results and organic ones.", "84% use major search engines like Google.", "Over half would trust them less if hidden payment information was revealed.", "Users spend about 43 minutes a month on searches; 61% rely on one engine, 29% on two to three, and some seven percent on four or more.", "Trust is high for favored search sites but not all users believe results are fair.", "Sixty-two percent are unaware of paid-for results, with only 18% able to identify them accurately.", "Nearly half would stop using search engines if they were clear about hidden payments."], "opencoder:1.5b": ["Savvy searchers fail to spot ads.", "Internet search engine users are an odd mix of naive and sophisticated, suggesting a report into search habits.", "The report by the US Pew Research Center reveals that 87% of searchers usually find what they were looking for when using a search engine.", "It also shows that few can spot the difference between paid-for results and organic ones.", "The information gathered by the researchers suggests that average users spend about 43 minutes per month carrying out 34 separate searches and looks at 1.9 webpages for each hunt.", "A significant chunk of net users, 36%, carry out a search at least weekly and 29% of those questioned only look every few weeks.", "According to the report, 44% of the users asked believe they could get the same information via other routes, while only 17% said they wouldn't have paid attention if they did not exist.", "The lack of awareness about paid-for results is a testament to the growing sophistication of net users and search engine users.", "Search engines provide lists of websites found by indexing the web, but do not explicitly mark which results are paid for.", "Sponsored results, though users might need to be tested, must be clearly marked or they may confuse users.", "While it seems like there's a lack of awareness about paid-for results, it's important to note that search engines strive to provide accurate and reliable information to help users find what they're looking for.", "They also promote organic (not sponsored) results to increase user satisfaction and trust."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details from the original text.", "The main points are:\n\n1.", "Savvy searchers fail to spot ads in search engine results.", "2.", "Internet search engine users are an odd mix of naive and sophisticated.", "3.", "Search engine users tend to be very loyal and once they have found a site, they feel they can trust the information.", "4.", "People use different search engines because the way the sites gather information means they can provide different results for the same query.", "5.", "Despite this liking for search sites, many people would not really miss them if they did not exist.", "6.", "The results that are presented to users are a fair and unbiased selection of the information on a topic that can be found on the net.", "7.", "A small number of searchers say they wouldn't really miss search engines if they didn't exist.", "8.", "The lack of awareness about paid-for results is ironic, since nearly half of all users say they would stop using search engines if they thought engines were not being clear about how they presented paid results."], "deepseek-r1:1.5b": ["Savvy searchers often find information through search engines, but they can still spot paid results hidden within organic ones.", "Searchers mostly rely on multiple engines like Google, Ask Jeeves, etc., while a significant portion (36%) searches weekly.", "They sometimes ignore paywalls or unrelated sites that offer critical info.", "Many users are unaware of paid results, which might hinder them from finding information effectively.", "The Pew Research findings suggest users prefer search engines for clarity and control over their data."], "tinyllama:1.1b": ["The US Pew Research Center reveals that net users are an odd mix of naive and sophisticated sea rchers, with few being aware of the paid-for results they see when using a sea rcch engine.", "According to figures collected by the research institute, 87% of sea rchers usually find what they're looking for using a search engine, while 15% only look at once per month and 29% do so every few weeks.", "Over half (68%) think that results presented by sea rcch engines are fair and unbiased, with the majority (70%) believing the results to be \"very accurate\" or \"fair.\"", "Despite their growing sophistication in using online resources, users still tend to believe that search engines present paid-for results as a fair selection of information on a topic that can be found online.", "According to data collected by Pew Research Center, 44% of sea rchers use only one or two search engines and 19% consult more than three.", "However, half (52%) of users have never tested their assumptions about paid-for results, while those who have tested it find the information presented is not fair and unbiased."], "tinydolphin:1.1b": [" The Pew Research Center report reveals a mixed picture of internet search habits, with users being sophisticated in their use but also not always aware of how paid-for results are presented.", "While users trust search engines much less if they know information about who pays for them, the majority still prefer the convenience and accuracy offered by the major search engines.", "The report suggests that companies should be transparent about their advertising practices to ensure trust in online sources."], "phi:2.7b": [" Internet searchers are a mix of naive and sophisticated, but most users can't tell if search engine results are paid-for or not.", "The Pew Research Center's report revealed that 87% of searchers usually find what they were looking for when using a search engine.", "Users spent an average of 43 minutes per month carrying out 34 separate searches and looked at 1.9 webpages per hunt.", "Most users (44%) stick to one search engine, while 48% use two or three.", "However, many people are not aware that some search engine results are paid-for, and only 18% can tell the difference between sponsored and organic results.", "The report concluded that search engines must be clear about how they present paid results to maintain user trust."], "orca-mini:3b": [" Search engine users are an odd mix of naive and sophisticated, according to a report by the US Pew Research Center.", "The report reveals that 87% of searchers usually find what they were looking for when using a search engine.", "However, few can spot the difference between paid-for results and organic ones.", "Users spend about 43 minutes per month carrying out 34 separate searches and look at 1.9 webpages for each hunt.", "Search engine users also tend to be very loyal and once they have found a site they feel they can trust, they tend to stick with it.", "Despite this, many people cannot tell which results are paid for and which are not, according to the report.", "The report suggests that people use different search engines because the way the sites gather information means they can provide different results for the same query.", "Although search engine users may be sophisticated, only 18% of all searchers say they can tell which results are paid for and which are not.", "Small numbers, 36%, consult more than three sites.", "Many people cannot live without search sites, according to the report.", "The report also reveals that people use different search engines because the way the sites gather information means they can provide different results for the same query."], "hermes3:3b": ["Search users often can't distinguish ads from organic results, according to Pew Research Center report; 87% find what they seek, but 62% are unaware paid results exist.", "18% can identify which is ad-based and which not."], "stablelm-zephyr:3b": ["A report by US Pew Research Center highlights the mixed search habits of internet users, with 87% usually finding what they were looking for, but only 44% aware that information about paid results being hidden.", "Most (36%) conduct a search at least weekly and almost half (48%) use multiple search engines.", "Loyalty to certain search sites is high, with 44% using just one, 48% two or three, and 7% consulting more than three sites.", "While some users could get the same information through alternative routes, many remain reliant on search engines (33%), considering them a fair and unbiased source of information.", "Surprisingly, 62% are unaware that paid results are served alongside organic search results, with only 18% able to identify the distinction between the two."], "stablelm2:1.6b": ["A report by Pew Research Center reveals that internet search engine users have a mix of naive and sophisticated habits.", "Around 50% of users usually find what they were looking for, but fail to distinguish paid results from organic ones.", "Google is the most frequently used search engine among Americans, with 94% claiming to use it at least some time.", "The study also reveals that fewer than half of respondents would trust search engines if they knew about hidden paid results.", "According to the report, internet users spend an average of 30 minutes per month conducting 12-15 searches and looking at 2-3 webpages for each hunt.", "Search engines are highly loyal among users, with most sticking with a single site upon finding it trustworthy.", "However, around 4% of respondents used more than three search engines.", "Approximately half of those questioned believe that the presented results were fair and unbiased.", "A significant number said they couldn..\nTo sum up:\n\nA Pew Research Center report found that internet users have both naive and sophisticated habits regarding search engine usage.", "Around 50% rarely find what they are looking for, with very few being able to distinguish paid from organic results.", "Google is the most frequently used search engine among Americans, followed by Ask Jeeves.", "The report also shows that fewer than half of respondents would trust search engines if they knew about hidden paid results.", "According to the study, internet users spend an average of 30 minutes per month conducting around 12-15 searches and looking at two-to-three webpages for each hunt.", "Most users stick with a single site upon finding it trustworthy, but around 4% use more than three search engines.", "A significant number say they believe the presented results were fair and unbiased."], "granite3.1-dense:2b": ["87% of internet searchers frequently find what they seek, with 50% expressing less trust if paid-for results were hidden.", "Users spend an average of 43 minutes monthly on 34 searches, viewing 1.9 pages per hunt.", "Three-quarters find information critical to their activities.", "Loyalty is high, as 44% use only one search engine, and 7% prefer no more than three.", "Despite this, 62% are unaware that some results are paid for, with only 18% accurately identifying them.", "The Pew Research Center report indicates that 62% would abandon search engines if not transparent about paid results, highlighting the irony of users' continued reliance on these platforms."], "chatgpt-4o-latest": ["A report by the US Pew Research Center reveals that while 87% of internet search engine users usually find what they are looking for, most cannot distinguish between paid and organic results.", "About 84% of users regularly use search engines like Google, Ask Jeeves, MSN, and Yahoo, with 44% relying on a single search engine.", "Nearly half of users would trust search engines less if they knew paid results were hidden, yet 62% are unaware that some results are paid for.", "Only 18% can identify paid listings.", "Despite this, 68% believe search results are fair and unbiased.", "While search engines are widely used, 50% believe they could find the same information elsewhere, and 17% say they wouldn’t miss search engines if they disappeared.", "The report highlights the irony that nearly half of users would stop using search engines if they felt paid results were not clearly marked, emphasizing the need for transparency."]}