{"raw_text": "Games firms 'face tough future'\n \n UK video game firms face a testing time as they prepare for the next round of games consoles, the industry warns.\n \n Fred Hasson, head of Tiga, which represents independent developers, said that more UK firms would go under due to greater risks in making new titles. Three leading UK video game companies also predicted that more firms would close as they struggled to adapt. Microsoft, Sony and Nintendo are expected to release new consoles in the next 18 months. Microsoft has said repeatedly that it wants to be first to the market and some analysts predict that Xbox 2 will be released in the US before the end of 2005.\n \n The new machines will all have much greater processing and graphical power which will have a huge impact on development of next generation games. Mr Hasson said: \"In the last four years we have probably lost a third of independent developers.\" He said there were about 150 independent developers left in the industry and more were likely to close. \"Once the cull has finished its likely to present those still standing with great opportunities,\" he said.\n \n Mr Hasson said the industry was predicting that developments costs and teams were likely to need to double in order to cope with the demands of the new machines. That figure was endorsed by three independent companies contacted by the BBC News website - Codemasters, Climax and Rebellion.\n \n \"As consoles get more powerful, the content gets more detailed and that means more cost,\" said Gary Dunn, development director at Codemasters, which develops games in house and also publishes titles. Jason Kingsley, chief executive of Rebellion, said the transition from the current generation of consoles to the new machines was difficult because \"the production quality expected by consumers will be that much bigger\". He added: \"We have been through five technology transitions and survived so far. \"Each one has involved the death of some people. All companies said they were investing in new tools - called middleware - in order to try and avoid staff numbers spiralling out of control.\n \n Simon Gardner, president of Climax's Action studio, said: \"We are investing in superior tools and editors. We are investing upfront to generate this content without the need for huge teams. \"It's vital we avoid huge teams.\" He said Climax was already directing about 20% of its resources to preparation for next generation titles. Mr Dunn warned that companies could face a short supply of programming, development and artistic talent. \"If companies are hiring bigger and bigger teams, at some point the talent is going to run out.\" Mr Hasson said games developers were beginning to realise that they had to be more \"business-like\". \"There are still some developers who were involved in games from the bedroom coding days. \"Some of them are still making games for peer group approval - that has to stop.\"\n", "llama3.2:1b": ["UK video game firms face a tough future due to increased risks and challenges with new console releases, leading to a predicted decline in independent developer numbers and potential closures.", "Industry experts warn that the transition to more powerful consoles will drive up development costs and require teams to double their size to cope.", "This may lead to shortages of programming, development, and artistic talent.", "The increased processing power and graphical capabilities of new consoles will likely result in higher-quality games, driving developers to invest in improved tools and middleware to manage the demands of the next generation.", "Experts predict that more UK firms will go under as a result, particularly those with smaller teams and lower levels of investment."], "llama3.2:3b": ["UK video game firms face a tough future due to increased risks in developing new titles for upcoming consoles, with more expected to close as they struggle to adapt."], "gemma2:2b": ["UK video game companies face a challenging future as new consoles approach.", "The industry predicts increased development costs and more closures, driven by the need for greater processing power in next-generation games.", "Companies say they are investing in tools and resources to streamline production, but there is concern about talent shortages and potential limitations on teams."], "qwen2.5:0.5b": ["UK video game firms face a testing period as new consoles come on the market, with 150 independent developers remaining and more likely to close.", "Developers are investing in tools to avoid being overwhelmed by demand."], "qwen2.5:1.5b": ["UK video game firms face tough future due to increased risks and challenges posed by new consoles, including greater processing power, graphical capabilities, and rising development costs.", "Companies predict more closures, with Microsoft expected to release Xbox 2 before the end of 2005.", "Developers must adapt, potentially doubling development costs and investing in new tools like middleware to avoid talent shortages."], "qwen2.5:3b": ["UK video game firms face challenges as new consoles like Xbox 2, PlayStation 3 and Wii are expected soon.", "Independent developers could lose a third more by end of transition period; costs will likely double due to increased development demands.", "Developers use middleware to avoid staff numbers increasing excessively, but warn about potential talent shortages.", "Industry sees need for greater business acumen as old ways (e.g., bedroom coding) no longer viable."], "opencoder:1.5b": ["Games firms 'face tough future'  \n\nUK video game firms face a testing time as they prepare for the next round of games consoles, industry warns.", "Fred Hasson, head of Tiga, which represents independent developers, said that more UK firms would go under due to greater risks in making new titles.", "Three leading UK video game companies also predicted that more firms would close as they struggled to adapt.", "Microsoft, Sony and Nintendo are expected to release new consoles in the next 18 months.", "Microsoft has repeatedly expressed confidence that it wants to be first to the market and analysts predict that Xbox 2 will be released in the US before the end of 2005.", "The new machines will all have much greater processing and graphical power which will have a huge impact on development of next generation games.", "Mr Hasson said: \"In the last four years we have probably lost a third of independent developers.\"", "He also pointed out there were about 150 independent developers left in the industry and more likely to close.", "The transition from current generation of consoles to new machines was difficult because \"the production quality expected by consumers will be that much bigger\".", "He added: \"We have been through five technology transitions and survived so far.", "Each one has involved the death of some people.", "All companies said they were investing in new tools - called middleware - in order to try and avoid staff numbers spiralling out of control.", "Simon Gardner, president of Climax's Action studio, warned that companies could face a short supply of programming, development and artistic talent.", "\"If companies are hiring bigger and bigger teams, at some point the talent is going to run out.\"", "Mr Dunn said: \"We are investing in superior tools and editors.", "We are investing upfront to generate this content without the need for huge teams.\"", "Games developers were beginning to realize that they had to be more \"business-like\".", "They say that many of their developers who were involved in games from the bedroom coding days have since left the company, demanding businesses stop thinking in terms of time and money."], "smollm:1.7b": ["The summary is:\n\n* UK video game firms face a tough future as they prepare for the next round of games consoles, with more companies likely to close due to increased costs and decreased demand.", "* The new consoles will have much greater processing power which will lead to more demanding games that require more powerful hardware.", "* Independent developers are already investing in superior tools and editors to prepare for the next generation of titles.", "* Companies may need to hire bigger teams or risk losing talent as they struggle to adapt to the new technology."], "deepseek-r1:1.5b": ["The UK video game industry faces challenges as companies prepare for new consoles.", "Independent developers are expected to lose a third of their staff due to increased risks, with potential closures.", "The transition from older consoles to newer, more powerful ones is making games more detailed and costly.", "Development teams are predicted to double in costs due to the demands of new machines.", "Independent companies like Tiga, Microsoft, Sony, and Nintendo are preparing for the release of new consoles by investing in tools and middleware to manage staff growth without cutting back on talent."], "tinyllama:1.1b": ["Games firms in the UK, including independent developers, face a tumultuous future due to increased risk in producing new games.", "With more powerful next generation consoles on the horizon and an anticipated spike in demand, companies are struggling to adapt and keep up with advancing technology.", "Three leading industry players have warned that more firms will close down as they struggle to keep up.", "Microsoft, Sony, and Nintendo are expected to release new gaming consoles within the next 18 months, bringing forth increased competition and greater pressure on the industry.", "The industry has predicted that development costs and teams will need to double due to demand for new titles.", "With a shortage of programmers, development teams, artists, and talent, companies are increasingly being forced to be more business-like in their approach to game production.", "This presents challenges for independent developers who still rely on peer group approval to create games."], "tinydolphin:1.1b": [" The industry warns UK video game firms will face a tougher future due to greater risks and demands in the next round of consoles.", "Video game companies have predicted more closures and losses as they struggle to adapt to new technology and challenges in making new games, including increased power levels and graphical capabilities.", "As the industry moves towards next-generation machines, developers need to invest in tools such as middleware to try and avoid a surge in staff numbers, which could lead to a shortage of talent.", "Analysts predict that Microsoft's Xbox 2 will be released before Nintendo's and Sony's new consoles are expected to come out in the next 18 months."], "phi:2.7b": [" UK video game firms face a testing time as they prepare for the next round of consoles, with more companies likely to go under due to greater risks and difficulties adapting to new machines' greater processing and graphical power.", "Independent developers may struggle to cope and may need to double their development costs and teams.", "Microsoft is expected to release Xbox 2 in the US before the end of 2005, causing uncertainty for the industry.", "Some independent game firms predict that many will close as a result of this transition."], "orca-mini:3b": [" UK video game firms face tough times as they prepare for new consoles, with Microsoft and Sony expected to release new machines within 18 months.", "Independent developers predict that more firms will close as they struggle to adapt to the demands of the new technology.", "Developers are investing in superior tools and editors to avoid huge teams, but talent may run out.", "The transition from current generation consoles to new machines is difficult, and some companies may face a shortage of programming, development, and artistic talent."], "hermes3:3b": ["UK video game firms face tough future as new consoles prepare to release, with higher costs and risks due to increased processing power and demand."], "stablelm-zephyr:3b": ["UK video game firms face challenges as they prepare for new console releases, with independent developers anticipating more companies will close due to increased risks in creating new titles.", "Microsoft, Sony, and Nintendo are expected to release new consoles within the next 18 months, which will have significantly greater processing and graphical power.", "This advancement is predicted to double development costs and team sizes for next-generation games.", "Industry experts emphasize the need for companies to invest in superior tools and editors to avoid large teams and a potential talent shortfall."], "stablelm2:1.6b": ["UK video game firms face challenges as new consoles are released, with greater processing and graphical power expected to impact development.", "Fred Hasson, head of Tiga, predicts a third of independent developers will close; however, some companies plan to invest in new tools (middleware) to avoid spiraling staff numbers.", "Games developers must become more \"business-like\" and stop prioritizing peer group approval as the industry continues its transition from current generation consoles to next-gen machines."], "granite3.1-dense:2b": ["UK video game firms, including independent developers and major players like Microsoft, Sony, and Nintendo, are anticipating a challenging future as they prepare for the release of next-generation consoles.", "These new machines, expected in the next 18 months, will significantly increase processing and graphical power, driving up development costs and team sizes to potentially double.", "Industry representatives predict that a third of independent developers may close due to these increased risks and demands.", "The transition is already causing difficulties, as companies struggle to maintain high production quality expectations.", "To mitigate talent shortages, firms are investing in advanced tools and middleware.", "Developers are recognizing the need to become more business-focused and reduce reliance on peer group approval for game creation."], "chatgpt-4o-latest": ["UK video game firms face challenges as they prepare for new consoles from Microsoft, Sony, and Nintendo within 18 months.", "Fred Hasson of Tiga warns that more independent developers will close due to rising risks and costs.", "The industry expects development costs and team sizes to double to meet the demands of more powerful consoles.", "Companies like Codemasters, Climax, and Rebellion confirm these concerns, noting that higher production quality will increase expenses.", "Firms are investing in new tools to manage costs and avoid excessive hiring, but a shortage of skilled talent remains a risk.", "Hasson emphasizes that developers must adopt a more business-oriented approach to survive."]}