{"raw_text": "Smart search lets art fans browse\n \n If you don't know art but know what you like, new search technology could prove a useful gateway to painting.\n \n ArtGarden, developed by BT's research unit, is being tested by the Tate as a new way of browsing its online collection of paintings. Rather than search by the name of an artist or painting, users are shown a selection of pictures. Clicking on their favourite will change the gallery in front of them to a selection of similar works.\n \n The technology uses a system dubbed smart serendipity, which is a combination of artificial intelligence and random selection. It 'chooses' a selection of pictures, by scoring paintings based on a selection of keywords associated with them. So, for instance a Whistler painting of a bridge may have the obvious keywords such as bridge and Whistler associated to it but will also widen the search net with terms such as aesthetic movement, 19th century and water. A variety of paintings will then be shown to the user, based partly on the keywords and partly on luck. \"It is much more akin to wandering through the gallery,\" said Jemima Rellie, head of the Tate's digital programme. For Richard Tateson, who worked on the ArtGarden project, the need for a new way to search grew out of personal frustration. \"I went to an online clothes store to find something to buy my wife for Christmas but I didn't have a clue what I wanted,\" he said. The text-based search was restricted to looking either by type of garment or designer, neither of which he found helpful. He ended up doing his present shopping on the high street instead.\n \n He thinks the dominance of text-based searching is not necessarily appealing to the majority of online shoppers. Similarly, with art, browsing is often more important than finding a particular object. \"You don't arrive at Tate Britain and tell people what you want to see. One of the skills of showing off the collection is to introduce people to things they wouldn't have asked for,\" he said. The Tate is committed to making its art more accessible and technology such as ArtGarden can help with that, said Ms Rellie. She hopes the technology can be incorporated on to the website in the near future. BT research is looking at extending the technology to other searching, such as for music and films.\n", "llama3.2:1b": ["Art fans can use a new search technology called Smart Search, which allows users to browse art collections online by selecting pictures rather than typing artist names or titles.", "The technology uses AI-driven \"smart serendipity\" to suggest related paintings based on keywords associated with them.", "It aims to provide a more personalized and user-friendly experience, as opposed to text-based search methods that may restrict browsing to specific categories like type of garment or designer."], "llama3.2:3b": ["A new search technology called Smart Serendipity is being tested by the Tate, allowing users to browse paintings by clicking on favorites, rather than entering keywords or artist names.", "The system combines AI and random selection to show a selection of similar works.", "This approach aims to provide a more intuitive experience for art fans, as browsing is often more important than finding a specific object, and may help make the Tate's collection more accessible."], "gemma2:2b": ["A new search technology called Smart Serendipity developed by BT's research unit uses AI and random selection to suggest artwork based on keywords related to a user's preferences.", "The system works by showing pictures that may not be immediately obvious based on a set of keywords, allowing users to explore art in a more intuitive way similar to browsing a gallery.", "This approach aims to improve accessibility and exploration for online art browsing, as text-based searching often limits the range of options available.", "The Tate Museum is testing this technology and hopes to incorporate it into their website soon."], "qwen2.5:0.5b": ["New search technology allows art fans to browse paintings by clicking on their favorite works rather than using a specific artist or painting name.", "The \"smart serendipity\" algorithm selects a selection of pictures based on keywords associated with each painting.", "Users can click on a favorite picture to see similar paintings and browse the entire collection together.", "Richard Tateson, who worked on the ArtGarden project, found the new method more useful than traditional text-based searches for finding suitable art pieces for Christmas gifts.", "The technology aims to make online shopping easier by introducing people to things they wouldn't have asked for."], "qwen2.5:1.5b": ["The summary is:\n\nArtGarden, developed by BT's research unit, allows users to browse an online collection of paintings using a system combining artificial intelligence with random selection.", "It offers a new way of searching that shows users similar works based on keywords associated with the selected paintings, providing a serendipitous browsing experience akin to wandering through a gallery rather than relying solely on text-based searches for specific items."], "qwen2.5:3b": ["Smart search technology, developed by BT's research unit, is being tested by the Tate for browsing its online painting collection.", "Instead of artist or painting names, users are shown a selection of pictures based on keywords related to them (e.g., bridge, aesthetic movement).", "This \"smart serendipity\" technology shows similar paintings to users who click on their favorites.", "The system aims to mimic wandering through a physical gallery by widening the search with terms like period and style beyond just artist or painting name.", "Created out of personal frustration, this technology is designed to make art more accessible online, following Tate's goal to increase public engagement with its collections.", "BT plans to extend this technology to other fields such as music and films."], "opencoder:1.5b": ["Smart search lets art fans browse through an extensive online library of artwork.", "It uses artificial intelligence and random selection to deliver an array of pictures that a user can click on to get a closer look.", "This method enhances the browsing experience by helping users find similar works based on the content of their favorite artwork.", "The technology is called \"smart serendipity\", which combines elements from artificial intelligence and random selection."], "smollm:1.7b": ["Smart search lets art fans browse by type of painting or artist.", "If you don't know art but know what you like, new search technology could prove a useful gateway to painting.", "ArtGarden, developed by BT's research unit, is being tested by the Tate as a new way of browsing its online collection of paintings.", "Rather than search by the name of an artist or painting, users are shown a selection of pictures.", "Clicking on their favourite will change the gallery in front of them to a selection of similar works.", "The technology uses a system dubbed smart serendipity, which is a combination of artificial intelligence and random selection.", "It 'chooses' a selection of pictures, by scoring paintings based on a selection of keywords associated with them.", "So, for instance a Whistler painting of a bridge may have the obvious keywords such as bridge and Whistler associated to it but will also widen the search net with terms such as aesthetic movement, 19th century and water.", "A variety of paintings will then be shown to the user, based partly on the keywords and partly on luck.", "For Richard Tateson, who worked on the ArtGarden project, the need for a new way to search grew out of personal frustration.", "\"I went to an online clothes store to find something to buy my wife for Christmas but I didn't have a clue what I wanted,\" he said.", "The text-based search was restricted to looking either by type of garment or designer, neither of which he found helpful.", "He thinks the dominance of text-based searching is not necessarily appealing to the majority of online shoppers.", "He thinks the dominance of text-based searching is not necessarily appealing to the majority of online shoppers."], "deepseek-r1:1.5b": ["The smart search technology enables art enthusiasts to browse by choosing from a gallery of paintings based on keywords and randomness.", "ArtGarden, developed by BT's research unit, is being tested at Tate as an alternative browsing method for its online collection.", "Users select pictures based on artist names or keywords, with the selection narrowed down further if they favorite works.", "Richard Tate found this less useful than traditional search options but used it to avoid shopping in a high street.", "The Tate aims to make art more accessible and is exploring integrating similar tech for music and films."], "tinyllama:1.1b": ["A new search technology developed by BT's research unit aims to browse online art collections using combinations of keywords associated with paintings, creating an interactive selection process based on user preferences.", "The technology uses the combination of artificial intelligence (AI) and random selection, allowing users to filter their choices based on relevant search terms.", "Although not appealing to the majority of online shoppers, this technology could help to introduce people to art they might have otherwise ignored or provided a more engaging way for art fans to explore the collection without having to scroll through endless galleries.", "The technology is currently under review by the Taté as part of their broader digital program, and could be incorporated on the website in the near future."], "tinydolphin:1.1b": [" The concept of \"smart search\" is a unique way of accessing an online collection of paintings by using artificial intelligence to match the user's preferences with related works.", "This system was developed by BT's research unit and can be utilized to change the viewer's gallery on Tate Britain to pictures that may not have been initially selected by the user, based on their personal preferences or keywords.", "For instance, if a user visits ArtGarden, they will be presented with a selection of paintings related to certain themes, such as Whistler's famous \"The Blue Rider.\"", "By scoring paintings based on keywords associated with them, the system can narrow down the search results, enabling users to discover hidden gems that may have not been easily discovered using traditional methods.", "The Tate is exploring how ArtGarden could be integrated into its website in the future, further expanding its reach and accessibility for art enthusiasts."], "phi:2.7b": [" The Smart search technology developed by BT's research unit aims to provide an alternative way of browsing an online collection of paintings by Tate Britain.", "It uses a system called smart serendipity that combines artificial intelligence with random selection, scoring paintings based on keywords related to them.", "This allows users to select pictures based on their preferences rather than searching for specific names or pieces.", "The technology is aimed at making art more accessible and has the potential to be applied to other areas of online shopping such as music and films."], "orca-mini:3b": [" New search technology could prove a useful gateway to painting for art fans who don't know much about art but like what they see, a system dubbed smart serendipity, which combines artificial intelligence and random selection, scores paintings based on keywords associated with them, widens the search net with terms such as aesthetic movement, 19th century and water, and shows a variety of paintings to users based partly on the keywords and partly on luck.", "The technology is much more akin to wandering through the gallery."], "hermes3:3b": ["ArtGarden system tests browsing art online\n- Uses smart serendipity AI and random selection\n- Lets users explore paintings based on similar keywords instead of specific artists/paintings"], "stablelm-zephyr:3b": ["ArtGarden, a new browsing system developed by BT's research unit, is being tested by the Tate as a way for art enthusiasts to discover paintings without relying on traditional search methods like artist or painting names.", "Instead, users are shown a selection of images based on a combination of artificial intelligence and random selection, scoring paintings according to associated keywords such as aesthetic movement, 19th century, or water.", "This \"smart serendipity\" approach aims to provide users with a more intuitive browsing experience, reflecting the process of stumbling upon artwork while visiting a physical gallery.", "The technology could be incorporated onto the Tate's website in the near future, and is also being considered for other forms of media search, such as music and films."], "stablelm2:1.6b": ["Art fans can browse paintings using the Smart search developed by BT's research unit, called ArtGarden.", "Instead of searching by artist or painting name, users are shown a gallery with similar pictures.", "The system uses smart serendipity, combining AI and random selection, to find related paintings based on keywords.", "This way, users can discover paintings they may not have known about before, making the Tate's online collection more accessible.", "The technology could potentially be integrated into websites for music and films as well."], "granite3.1-dense:2b": ["ArtGarden, a new search technology developed by BT's research unit, is being tested by the Tate to assist art enthusiasts who know their preferences but lack expertise in specific artists or paintings.", "Unlike traditional text-based searches that limit users to categories like artist or painting name, ArtGarden employs a system called \"smart serendipity,\" combining AI and random selection.", "This approach scores artworks based on relevant keywords and then presents users with a diverse set of similar pieces, resembling the experience of browsing an actual gallery.", "The project's lead developer, Richard Tateson, discovered personal frustration in using text-based search for online shopping.", "He found that restricting options to garment type or designer was unhelpful, so he opted for in-person browsing instead.", "Similarly, Tateson believes many online shoppers value browsing over targeted searches.", "The Tate is keen on making its extensive art collection more accessible through technology like ArtGarden.", "Jemima Rellie, head of the Tate's digital programme, hopes to implement this tool on their website soon and also envisions extending it for other types of media, such as music and films."], "chatgpt-4o-latest": ["ArtGarden, a smart search technology developed by BT's research unit, is being tested by the Tate to help users browse its online painting collection.", "Instead of searching by artist or title, users select a favorite image, prompting the system to display similar works.", "Using \"smart serendipity,\" a mix of AI and random selection, the system scores paintings based on keywords and broader associations, offering a browsing experience akin to wandering through a gallery.", "Richard Tateson, who worked on the project, was inspired by the limitations of text-based searches in online shopping.", "The Tate sees ArtGarden as a way to make art more accessible, and BT is exploring its application for music and film searches."]}