{"raw_text": "Warning over Windows Word files\n \n Writing a Microsoft Word document can be a dangerous business, according to document security firm Workshare.\n \n Up to 75% of all business documents contained sensitive information most firms would not want exposed, a survey by the firm revealed. To make matters worse 90% of those companies questioned had no idea that confidential information was leaking. The report warns firms to do a better job of policing documents as corporate compliance becomes more binding.\n \n Sensitive information inadvertently leaked in documents includes confidential contractual terms, competitive information that rivals would be keen to see and special deals for key customers, said Andrew Pearson, European boss of Workshare which commissioned the research. \"The efficiencies the internet has brought in such as instant access to information have also created security and control issues too,\" he said. The problem is particularly acute with documents prepared using Microsoft Word because of the way it maintains hidden records about editing changes. As documents get passed around, worked on and amended by different staff members the sensitive information finds its way into documents. Poor control over the editing and amending process can mean that information that should be expunged survives final edits. Microsoft, however, does provide an add-on tool for Windows PCs that fixes the problem. \"The Remove Hidden Data add-in is a tool that you can use to remove personal or hidden data that might not be immediately apparent when you view the document in your Microsoft Office application,\" says the instructions on Microsoft's website. Microsoft recommends that the tool is used before people publish any Word document. A tool for Apple machines running Word is not available. Workshare surveyed firms around the world and found that, on average, 31% of documents contained legally sensitive information but in many firms up to three-quarters fell in to the high risk category. Often, said Mr Pearson, this sensitive information was invisible because it got deleted and changed as different drafts were prepared.\n \n However, the way that Windows works means that earlier versions can be recalled and reconstructed by those keen to see how a document has evolved. Few firms have any knowledge of the existence of this so-called metadata about the changes that a document has gone through or that it can be reconstructed. The discovery of this hidden information could prove embarrassing for companies if, for instance, those tendering for contracts found out about the changes to terms of a deal being negotiated. The research revealed that a document's metadata could be substantial as, on average, only 40% of contributors' changes to a document make it to the final draft. Problems with documents could mean trouble for firms as regulatory bodies step up scrutiny and compliance laws start to bite, said Mr Pearson.\n", "llama3.2:1b": ["Warning over Windows Word files can contain sensitive information that is not intended for public release, according to research by Workshare.", "Up to 75% of business documents may contain confidential data and 90% of companies surveyed had no idea this was the case.", "Microsoft's remove hidden data tool can fix the problem, but it must be used before publishing a Word document.", "The research found that documents' metadata, such as changes made by contributors, can also reveal sensitive information."], "llama3.2:3b": ["Up to 75% of business documents contain sensitive information that is leaked through editing changes in Microsoft Word documents, with most companies unaware of this issue, according to Workshare's research.", "The problem is exacerbated by Windows' metadata that can be reconstructed from earlier versions, potentially revealing confidential information that firms had intended to delete or keep hidden."], "gemma2:2b": ["A survey reveals that over 75% of business documents contain sensitive information, often unnoticed by companies.", "This information can be leaked unintentionally and easily accessed by competitors or even during contract negotiations, leading to legal and reputational issues.", "Microsoft Word's metadata feature contributes to this problem, as it allows the reconstruction of previously unseen changes made to a document.", "To address this issue, Microsoft provides a tool that removes hidden data before publication."], "qwen2.5:0.5b": ["Microsoft Word files can contain sensitive information that is potentially exposed in the event of a data breach.", "The report by Workshare notes that 75% of business documents are confidential and may be accidentally leaked into other documents.", "Companies need to better police their documents to prevent this from happening, as they cannot control what happens with the final version of the document once it has been published online.", "Microsoft Word maintains a hidden record about editing changes, making sensitive information invisible until it is recorded as final edits in the final version of the document.", "The remove hidden data add-in for Windows Office can be used to remove personal or hidden data that may not be immediately apparent when viewed in an MS Office application.", "Companies need to take steps to protect their documents from such leaks and comply with regulatory requirements, such as obtaining necessary authorization before publishing a document online."], "qwen2.5:1.5b": ["Microsoft Word documents contain sensitive information that many companies fail to secure properly, leading to leaks and potential legal issues.", "Only 40% of changes made in a document make it into the final version, increasing risk for companies facing increased regulatory scrutiny and compliance demands.", "The add-on tool provided by Microsoft can remove hidden data but is not available on Apple machines."], "qwen2.5:3b": ["Writing Microsoft Word documents can expose sensitive information, according to security firm Workshare.", "A survey found that 75% of business documents contain confidential data which most companies are unaware is leaking.", "Companies lack control over document editing processes leading to inadvertent leaks.", "The Remove Hidden Data add-in from Microsoft helps but is not available for Apple machines.", "On average, 31% of documents have legally sensitive information with many in high risk categories due to invisible changes being made in drafts.", "Workshare warns that companies may face embarrassment or legal troubles if regulatory scrutiny increases and metadata about document revisions becomes known."], "opencoder:1.5b": ["Writing a Microsoft Word document can be dangerous business, according to document security firm Workshare.", "Up to 75% of all business documents contain sensitive information most firms would not want exposed.", "To make matters worse, 90% of those companies questioned had no idea that confidential information was leaking.", "The report warns firms to do a better job of policing documents as corporate compliance becomes more binding.", "Sensitive information inadvertently leaked in documents includes confidential contractual terms and competitive information that rivals would be keen to see and special deals for key customers, said Andrew Pearson, European boss of Workshare which commissioned the research.", "Microsoft, however, does provide an add-on tool for Windows PCs to fix the problem.", "The Remove Hidden Data add-in is a tool designed to remove personal or hidden data that might not be immediately apparent when viewing a document in Microsoft Office applications.", "Microsoft recommends that the tool is used before people publish any Word document.", "Workshare surveyed firms around the world and found that, on average, 31% of documents contain legally sensitive information but in many firms up to three-quarters fell into the high risk category.", "The discovery of this hidden information could provoke ire for companies if, for instance, those negotiating contracts find out about the changes to terms of a deal being negotiated."], "smollm:1.7b": ["The following is a summary of the text:\n\nMicrosoft Word can be a dangerous business, according to document security firm Workshare.", "Up to 75% of all business documents contained sensitive information most firms would not want exposed, a survey by the firm revealed.", "To make matters worse, 90% of those companies questioned had no idea that confidential information was leaking.", "The report warns firms to do a better job of policing documents as corporate compliance becomes more binding.", "Sensitive information inadvertently leaked in documents includes confidential contractual terms, competitive information that rivals would be keen to see and special deals for key customers, said Andrew Pearson, European boss of Workshare which commissioned the research.", "\"The efficiencies the internet has brought in such as instant access to information have also created security and control issues too,\" he said.", "The problem is particularly acute with documents prepared using Microsoft Word because of the way it maintains hidden records about editing changes.", "As documents get passed around, worked on and amended by different staff members the sensitive information finds its way into documents.", "Poor control over the editing and amending process can mean that information that should be expunged survives final edits.", "Microsoft, however, does provide an add-on tool for Windows PCs that fixes the problem.", "\"The Remove Hidden Data add-in is a tool that you can use to remove personal or hidden data that might not be immediately apparent when you view the document in your Microsoft Office application,\" says the instructions on Microsoft's website.", "Microsoft recommends that the tool is used before people publish any Word document.", "A tool for Apple machines running Word is not available.", "Workshare surveyed firms around the world and found that, on average, 31% of documents contained legally sensitive information but in many firms up to three-quarters fell in to the high risk category.", "Often, said Mr Pearson, this sensitive information was invisible because it got deleted and changed as different drafts were prepared.", "Few firms have any knowledge of the existence of this so-called metadata about the changes that a document has gone through or that it can be reconstructed.", "The discovery of this hidden information could prove embarrassing for companies if, for instance, those tendering for contracts found out about the changes to terms of a deal being negotiated.", "The research revealed that a document's metadata could be substantial as, on average, only 40% of contributors' changes to a document make it to the final draft.", "Problems with documents could mean trouble for firms as regulatory bodies step up scrutiny and compliance laws start to bite, said Mr Pearson."], "deepseek-r1:1.5b": ["Word documents pose significant security risks due to their sensitive information, particularly in Microsoft Office, which maintains hidden edits leading to data leakage.", "Workshare highlights that up to 75% of documents contain sensitive info, with 90% of surveyed firms unaware of the issue.", "Microsoft offers tools like Remove Hidden Data, but they aren't available on Apple devices.", "Surveys show that 31% of Word files are legally-sensitive, and many (including 75%) fall into high-risk categories.", "Metadata exposure can cause problems for companies, especially if sensitive information is revealed during negotiations or contract tenders."], "tinyllama:1.1b": ["Concise summary:\nWriting Microsoft Word documents can expose sensitive information most companies would not want exposed due to the risk of confidential contractual terms, competitive information that rival firms may seek to see, and special deals for key customers being disclosed.", "Poor control over editing and amending processes can mean that such sensitive information survives final edits, adding a layer of complication for firms in regulatory and compliance laws.", "The survey by Worksharé revealed that up to 31% of documents contain legally sensitive information but most firms lack knowledge of its existence or ability to recover deleted and changed versions."], "tinydolphin:1.1b": [" Microsoft Word suffers from hidden data that can be found even if an add-on is not installed, according to a report by Workshare.", "Leakage of sensitive information such as contract terms, competitive deals and customer secrets have become increasingly common due to the rise in online usage.", "The report highlights the need for better control over document editing and amending processes to prevent accidental disclosure of confidential information.", "It is advisable to use Microsoft's remove hidden data tool before publishing a Word document, but many firms are not aware of its existence or capabilities.", "The findings suggest that most companies have no knowledge about the presence or nature of their documents' metadata, which can be crucial for compliance and regulations such as those enforced by the US Sarbanes-Oxley (SOX) act.", "This report suggests a need for better corporate security procedures and a greater focus on document control."], "phi:2.7b": [" Microsoft Word can pose security risks for businesses due to its ability to maintain hidden records about editing changes in documents.", "This means that sensitive information may end up in documents without being detected until it's too late.", "To prevent this from happening, the company has provided an add-on tool called \"Remove Hidden Data\" which can be used to remove personal or hidden data before publishing a document.", "The survey conducted by Workshare revealed that on average, 31% of documents contained legally sensitive information, with some firms experiencing up to 75% of business documents containing confidential information.", "This problem is compounded by the fact that many firms have no idea about this issue and lack control over the editing and amending process.", "It's important for businesses to be aware of these issues and take steps to prevent sensitive information from leaking through their documents, especially as corporate compliance becomes more binding."], "orca-mini:3b": [" Microsoft Word files can pose a serious risk to companies due to the possibility of sensitive information being leaked.", "A survey conducted by Workshare found that up to 75% of all business documents contained such information, with no idea of its existence.", "The problem is particularly acute with Microsoft Word documents, as editing and amending changes can lead to hidden data surviving final edits.", "Microsoft recommends the Remove Hidden Data add-in tool for removing such data before publishing Word documents.", "Regulatory bodies and compliance laws are becoming more strict, making it crucial for companies to have better control over their documents."], "hermes3:3b": ["Warning over leaked sensitive info in Word docs\n- Up to 75% business docs contain confidential details\n- 90% companies unaware of data leaks\n- Hidden metadata allows data like contracts & competitive info to leak\n- Microsoft Word's hidden records facilitate leaks\n- Microsoft offers Remove Hidden Data tool for fixing issue"], "stablelm-zephyr:3b": ["A document security firm called Workshare warned that up to 75% of business documents contain sensitive information that should not be exposed.", "They discovered that 90% of the companies surveyed had no idea about confidential information leaking.", "Sensitive information accidentally leaked in documents includes confidential terms, competitive information, and special deals for key customers.", "The problem is particularly acute with Microsoft Word documents due to hidden records about editing changes.", "Workshare recommends using a tool called \"Remove Hidden Data\" before publishing a Word document, as it helps remove personal or hidden data that might not be immediately apparent."], "stablelm2:1.6b": ["A survey by Workshare found that up to 90% of business documents contain sensitive information, exposing companies to potential legal issues.", "The Microsoft Word application is known to maintain hidden records about editing changes which can inadvertently leak confidential information.", "Approximately 40% of questioned firms lacked knowledge that their documents contained sensitive info.", "Poor control over the editing and amending process can result in leaked information; however, Microsoft offers a tool called \"Remove Hidden Data\" to address this issue before publishing any Word document.", "This study reveals that a significant amount of contributions' changes do not make it to the final draft, with only 20% of contributors' changes making it to the final document.", "As corporate compliance increases, firms need to improve their document management practices to prevent legal trouble."], "granite3.1-dense:2b": ["75% of business documents surveyed by Workshare contained sensitive information, often unintentionally leaked due to the editing process in Microsoft Word.", "Ninety percent of companies were unaware of this data leakage.", "The issue arises because Word maintains hidden records of editing changes, which can be passed among staff and amended, potentially exposing confidential details like contract terms, competitive info, or special customer deals.", "Although Microsoft offers a Remove Hidden Data add-in for Windows to address this, no similar tool exists for Apple users.", "Firms' lack of awareness about document metadata (changes made but not saved) can be problematic as regulatory scrutiny increases.", "On average, only 40% of contributors' changes reach the final draft.", "This invisibility of sensitive information, combined with Windows' ability to recall and reconstruct earlier document versions, poses risks for companies."], "chatgpt-4o-latest": ["A survey by document security firm Workshare found that up to 75% of business documents contain sensitive information, with 90% of companies unaware of potential leaks.", "Microsoft Word documents are particularly vulnerable due to hidden metadata that retains editing history, allowing confidential details to be reconstructed.", "This can expose contractual terms, competitive data, and special deals.", "Microsoft offers a \"Remove Hidden Data\" add-on for Windows to mitigate the risk, but no equivalent tool exists for Apple users.", "Workshare warns that poor document control could lead to regulatory issues as compliance laws tighten."]}