{"raw_text": "Net regulation 'still possible'\n \n The blurring of boundaries between TV and the internet raises questions of regulation, watchdog Ofcom has said.\n \n Content on TV and the internet is set to move closer this year as TV-quality video online becomes a norm. At a debate in Westminster, the net industry considered the options. Lord Currie, chairman of super-regulator Ofcom, told the panel that protecting audiences would always have to be a primary concern for the watchdog. Despite having no remit for the regulation of net content, disquiet has increased among internet service providers as speeches made by Ofcom in recent months hinted that regulation might be an option. At the debate, organised by the Internet Service Providers' Association (ISPA), Lord Currie did not rule out the possibility of regulation.\n \n \"The challenge will arise when boundaries between TV and the internet truly blur and then there is a balance to be struck between protecting consumers and allowing them to assess the risks themselves,\" he said. Adopting the rules that currently exist to regulate TV content or self-regulation, which is currently the practice of the net industry, will be up for discussion.\n \n Some studies suggest that as many as eight million households in the UK could have adopted broadband by the end of 2005, and the technology opens the door to TV content delivered over the net. More and more internet service providers and media companies are streaming video content on the web. BT has already set up an entertainment division to create and distribute content that could come from sources such as BSkyB, ITV and the BBC. Head of the division, Andrew Burke, spoke about the possibility of creating content for all platforms. \"How risque can I be in this new age? With celebrity chefs serving up more expletives than hot dinners, surely I can push it to the limit,\" he said.\n \n In fact, he said, if content has been requested by consumers and they have gone to lengths to download it, then maybe it should be entirely regulation free. Internet service providers have long claimed no responsibility for the content they carry on their servers since the Law Commission dubbed them \"mere conduits\" back in 2002. This defence does not apply if they have actual knowledge of illegal content and have failed to remove it. The level of responsibility they have has been tested in several high-profile legal cases. Richard Ayers, portal director at Tiscali, said there was little point trying to regulate the internet because it would be impossible. Huge changes are afoot in 2005, he predicted, as companies such as the BBC offer TV content over the net. The BBC's planned interactive media player which will give surfers the chance to download programmes such as EastEnders and Top Gear will make net TV mainstream and raise a whole new set of questions, he said.\n \n One of these will be about the vast sums of money involved in maintaining the network to supply such a huge quantity of data and could herald a new digital licence fee, said Mr Ayers. As inappropriate net content, most obviously pornography viewed by children, continues to dominate the headlines, internet regulation remains a political issue said MP Richard Allan, Liberal Democrat spokesman on IT. Mr Allan thinks that the answer could lie somewhere between the cries of \"impossible to regulate\" and \"just apply offline laws online\". In fact, instead of seeing regulation brought online, the future could bring an end to regulation as we know it for all TV content. After Lord Currie departed, the panel agreed that this could be a reality and that for the internet people power is likely to reign. \"If content is on-demand, consumers have pulled it up rather than had pushed to them, then it is the consumers' choice to watch it. There is no watershed on the net,\" said Mr Burke.\n", "llama3.2:1b": ["The Internet Service Providers' Association (ISPA) debated regulation in Westminster with Lord Currie, chairman of Ofcom, stating that protecting audiences would always be a primary concern.", "The potential for TV content to move online and blur boundaries raises questions about regulation, according to Lord Currie.", "Some studies suggest that up to 8 million households could adopt broadband by the end of 2005.", "Internet service providers are pushing for more control over their platforms, with some arguing that regulation is necessary due to high levels of illegal content on the internet.", "The potential for a digital licence fee and the dominance of inappropriate net content remain concerns about regulating the internet."], "llama3.2:3b": ["Ofcom chairman Lord Currie says regulation of online content may be possible as TV-quality video becomes more common, and internet service providers have expressed concern about their role in carrying illegal content.", "A debate among industry leaders suggests that adopting TV regulations or self-regulation may be up for discussion, while some argue it's impossible to regulate the internet effectively."], "gemma2:2b": ["The blurring of boundaries between television and the internet raises concerns about regulation.", "Ofcom, a super regulator, has hinted at the possibility of regulating internet content, considering TV-quality video becoming increasingly common online.", "While there will be debate on the best approach to protection and self-regulation, the increasing availability of TV content online necessitates new strategies for monitoring potential risks and challenges posed by new forms of entertainment delivery.", "Internet service providers (ISPs) argue they should not be held responsible for illegal content because they are simply conduits but face a growing pressure to take responsibility for their actions.", "Legal precedent suggests that ISPs must actively remove illegal content if they have knowledge of it.", "As the line between television and internet blurs, new regulations will likely emerge concerning content delivery, data management, and consumer responsibilities.", "Many argue the future of online media regulation lies in a paradigm shift where existing offline laws are applied to online content, paving the way for an end to traditional regulatory models."], "qwen2.5:0.5b": ["The blurring of boundaries between TV and the internet raises questions about regulation.", "Lord Currie at a debate in Westminster thinks that protecting audiences would always be a primary concern for the watchdog, while online content has already moved closer.", "The Internet Service Providers Association (ISPA) is discussing whether regulation might be an option.", "Some studies suggest that up to 8 million UK households could have adopted broadband by 2005 and content can come from sources like BT and BBC.", "Andrew Burke at BT says he will create more TV content for free on the web.", "Richard Ayers, a portal director at Tiscali, predicts that internet regulation becomes a political issue due to internet data used to supply so much data making it possible.", "Online content is likely to be free with online demand driving consumers to watch what they want, and ISPs are expected to change online laws for TV."], "qwen2.5:1.5b": ["The future of TV content delivered over the internet blurs boundaries between TV and the internet, raising questions about regulation.", "Lord Currie suggested that protection of audiences remains a primary concern for watchdog Ofcom despite the lack of remit for regulating net content.", "Internet service providers have shifted to self-regulation due to recent hints from Ofcom, with some arguing that content on-demand should be regulation-free.", "The shift to streaming video over broadband is increasing, and challenges include balancing consumer protection against allowing consumers to assess risks themselves.", "The potential legalization of internet TV in 2005, such as BBC's interactive media player for downloadable programs, raises questions about digital licensing fees and the future of regulation."], "qwen2.5:3b": ["The blurring of boundaries between TV and the internet has raised concerns about regulation, prompting discussions among industry leaders.", "Ofcom suggests that current or self-regulation might be insufficient when TV content moves online, potentially leading to a balance between consumer protection and freedom.", "Increasing adoption of broadband in UK households supports this transition, with some envisioning new forms of media distribution.", "However, debates on internet regulation remain contentious, reflecting both skepticism about enforcement and optimism for consumer autonomy."], "opencoder:1.5b": ["Net regulation 'still possible' \n\nThe blurring of boundaries between TV and the internet raises questions of regulation, watchdog Ofcom has said.", "Content on TV and the internet is set to move closer this year as TV-quality video online becomes a norm.", "The net industry considered the options.", "Lord Currie, chairman of super-regulator Ofcom, told the panel that protecting audiences would always have to be a primary concern for the watchdog.", "Despite having no remit for the regulation of net content, disquiet has increased among internet service providers as speeches made by Ofcom in recent months hinted that regulation might be an option.", "The debate at the debate, organised by the Internet Service Providers' Association (ISPA), Lord Currie did not rule out the possibility of regulation.", "Despite challenges and difficulties, the net industry's options are worth considering.", "Adopting the rules that currently exist to regulate TV content or self-regulation, which is currently the practice of the net industry, will be up for discussion.", "With a focus on providing consumers with a safe environment, a new digital licence fee can be introduced.", "However, it’s not just about legalizing content; it could also mean changing our way of thinking about what's acceptable and unfit to consume online.", "Despite the difficulties and challenges faced by companies such as the BBC, they are likely to continue producing content that is suitable for consumption on the internet."], "smollm:1.7b": ["The key ideas in this summary are:\n\n1.", "The blurring of boundaries between TV and the internet raises questions of regulation.", "2.", "Content on TV and the internet is set to move closer this year as TV-quality video online becomes a norm.", "At a debate in Westminster, the net industry considered the options.", "3.", "The Internet Service Providers' Association (ISPA) told the panel that protecting audiences would always have to be a primary concern for the watchdog.", "4.", "Some studies suggest that as many as eight million households in the UK could have adopted broadband by the end of 2005, and the technology opens the door to TV content delivered over the net.", "5.", "The challenge will arise when boundaries between TV and the internet truly blur and then there is a balance to be struck between protecting consumers and allowing them to assess the risks themselves.", "6.", "Some studies suggest that as many as eight million households in the UK could have adopted broadband by the end of 2005, and the technology opens the door to TV content delivered over the net.", "7.", "The level of responsibility internet service providers (ISPs) have has been tested in several high-profile legal cases.", "Richard Ayers, portal director at Tiscali, said there was little point trying to regulate the internet because it would be impossible.", "Huge changes are afoot in 2005, he predicted, as companies such as the BBC offer TV content over the net.", "The BBC's planned interactive media player which will give surfers the chance to download programmes such as EastEnders and Top Gear will make net TV mainstream and raise a whole new set of questions, he said.", "8.", "One of these will be about the vast sums of money involved in maintaining the network to supply such a huge quantity of data and could herald a new digital license fee, said Mr Ayers.", "As inappropriate net content, most obviously pornography viewed by children, continues to dominate the headlines, internet regulation remains a political issue said MP Richard Allan, Liberal Democrat spokesman on IT.", "Mr Allan thinks that the answer could lie somewhere between the cries of \"impossible to regulate\" and \"just apply offline laws online\".", "In fact, instead of seeing regulation brought online, the future could bring an end to regulation as we know it for all TV content.", "9.", "The key ideas in this summary are:\n\t* The blurring of boundaries between TV and the internet raises questions of regulation.", "* Content on TV and the internet is set to move closer this year as TV-quality video online becomes a norm.", "At a debate in Westminster, the net industry considered the options.", "* The Internet Service Providers' Association (ISPA) told the panel that protecting audiences would always have to be a primary concern for the watchdog.", "* Some studies suggest that as many as eight million households in the UK could have adopted broadband by the end of 2005, and the technology opens the door to TV content delivered over the net.", "* The challenge will arise when boundaries between TV and the internet truly blur and then there is a balance to be struck between protecting consumers and allowing them to assess the risks themselves.", "* Some studies suggest that as many as eight million households in the UK could have adopted broadband by the end of 2005, and the technology opens the door to TV content delivered over the net.", "* The level of responsibility internet service providers (ISPs) have has been tested in several high-profile legal cases.", "Richard Ayers, portal director at Tiscali, said there was little point trying to regulate the internet because it would be impossible.", "Huge changes are afoot in 2005, he predicted, as companies such as the BBC offer TV content over the net.", "The BBC's planned interactive media player which will give surfers the chance to download programmes such as EastEnders and Top Gear will make net TV mainstream and raise a whole new set of questions, he said.", "* One of these will be about the vast sums of money involved in maintaining the network to supply such a huge quantity of data and could herald a new digital license fee, said Mr Ayers.", "As inappropriate net content, most obviously pornography viewed by children, continues to dominate the headlines, internet regulation remains a political issue said MP Richard Allan, Liberal Democrat spokesman on IT.", "Mr Allan thinks that the answer could lie somewhere between the cries of \"impossible to regulate\" and \"just apply offline laws online\".", "In fact, instead of seeing regulation brought online, the future could bring an end to regulation as we know it for all TV content.", "* The key ideas in this summary are:\n\t\t+ The blurring of boundaries between TV and the internet raises questions of regulation.", "+ Content on TV and the internet is set to move closer this year as TV-quality video online becomes a norm.", "At a debate in Westminster, the net industry considered the options.", "+ The Internet Service Providers' Association (ISPA) told the panel that protecting audiences would always have to be a primary concern for the watchdog.", "+ Some studies suggest that as many as eight million households in the UK could have adopted broadband by the end of 2005, and the technology opens the door to TV content delivered over the net.", "+ The challenge will arise when boundaries between TV and the internet truly blur and then there is a balance to be struck between protecting consumers and allowing them to assess the risks themselves.", "+ Some studies suggest that as many as eight million households in the UK could have adopted broadband by the end of 2005, and the technology opens the door to TV content delivered over the net.", "+ The level of responsibility internet service providers (ISPs) have has been tested in several high-profile legal cases.", "+ Richard Ayers, portal director at Tiscali, said there was little point trying to regulate the internet because it would be impossible.", "+ Huge changes are afoot in 2005, he predicted, as companies such as the BBC offer TV content over the net.", "+ One of these will be about the vast sums of money involved in maintaining the network to supply such a huge quantity of data and could herald a new digital license fee, said Mr Ayers.", "* The key ideas in this summary are:\n\t\t+ The blurring of boundaries between TV and the internet raises questions of regulation.", "+ Content on TV and the internet is set to move closer this year as TV-quality video online becomes a norm.", "+ The Internet Service Providers' Association (ISPA) told the panel that protecting audiences would always have to be a primary concern for the watchdog.", "+ Some studies suggest that as many as eight million households in the UK could have adopted broadband by the end of 2005, and the technology opens the door to TV content delivered over the net.", "+ The challenge will arise when boundaries between TV and the internet truly blur and then there is a balance to be struck between protecting consumers and allowing them to assess the risks themselves.", "+ Some studies suggest that as many as eight million households in the UK could have adopted broadband by the end of 2005, and the technology opens the door to TV content delivered over the net.", "+ The level of responsibility internet service providers (ISPs) have has been tested in several high-profile legal cases.", "+ Richard Ayers, portal director at Tiscali, said there was little point trying to regulate the internet because it would be impossible.", "+ Huge changes are afoot in 2005, he predicted, as companies such as the BBC offer TV content over the net.", "+ One of these will be about the vast sums of money involved in maintaining the network to supply such a huge quantity of data and could herald a new digital license fee, said Mr Ayers.", "* The key ideas in this summary are:\n\t\t+ The blurring of boundaries between TV and the internet raises questions of regulation.", "+ Content on TV and the internet is set to move closer this year as TV-quality video online becomes a norm.", "+ The Internet Service Providers' Association (ISPA) told the panel that protecting audiences would always have to be a primary concern for the watchdog.", "+ Some studies suggest that as many as eight million households in the UK could have adopted broadband by the end of 2005, and the technology opens the door to TV content delivered over the net.", "+ The challenge will arise when boundaries between TV and the internet truly blur and then there is a balance to be struck between protecting consumers and allowing them to assess the risks themselves.", "+ Some studies suggest that as many as eight million households in the UK could have adopted broadband by the end of 2005, and the technology opens the door to TV content delivered over the net.", "+ The level of responsibility internet service providers (ISPs) have has been tested in several high-profile legal cases.", "+ Richard Ayers, portal director at Tiscali, said there was little point trying to regulate the internet because it would be impossible.", "+ Huge changes are afoot in 2005, he predicted, as companies such as the BBC offer TV content over the net.", "+ One of these will be about the vast sums of money involved in maintaining the network to supply such a huge quantity of data and could herald a new digital license fee, said Mr Ayers.", "**Note:** This summary is based on the original article and may not reflect the most up-to-date information or changes in the industry."], "deepseek-r1:1.5b": ["The boundaries between TV and internet are blurring, posing questions about regulation.", "Ofcom has called for oversight, fearing audiences' protection might require intervention.", "Content will move closer to blending TV with internet as TV-quality video online dominates.", "A debate in Westminster suggests regulation could be an option, but internet service providers remain unsure, given Ofcom's regulatory efforts.", "Lord Currie from Ofcom indicated balancing audience protection and consumer choice is crucial.", "Some companies claim no responsibility for server content, yet they've faced cases where level of control was tested.", "By 2005, up to eight million households could have broadband, enabling internet delivery of TV content.", "Companies like BT are setting up entertainment divisions.", "Andrew Burke noted content's risqué potential in a new age.", "If requested content is downloaded, it should be regulation-free.", "Some providers claim no responsibility due to unknown illegal content removal.", "Richard Ayers predicted significant changes in 2005, with companies offering TV content over the net and new questions about regulating such content.", "Internet regulation remains political, between impossibility and offline laws online.", "Mr. Allan sees future regulation end, while Mr. Burke suggests consumers decide what to watch.", "The debate is whether regulators can control network content or if it becomes too accessible without users' choice."], "tinyllama:1.1b": ["The blurring of boundaries between TV and the internet raises questions of regulatory options, according to Ofcom chairman Lord Currie.", "The debate in Westminster discussed whether protecting audience concerns would always be a primary concern for the regulator, despite having no authority to enforce net content rules.", "Discussions around self-regulation were also touched upon, with some studies suggesting as many as eight million households could have adopted broadband by 2005.", "Head of the entertainment division at BT Andrew Burke spoke about allowing more explorative content to be distributed on-demand, potentially eliminating regulatory constraints for online broadcasts.", "The future of online regulation could bring an end to existing regulatory structures and focus on user power rather than traditional parameters such as watersheds."], "tinydolphin:1.1b": [" The net regulation debate has raised concerns among internet service providers (ISPs) and consumer advocates alike.", "Discussing whether online television should follow a similar path to TV, Ofcom Chairman Lord Currie suggested that online content could move closer to the standard set by TV.", "However, this could potentially result in a balance between protecting consumers and allowing them to assess their own risks.", "Some studies suggest that as many as eight million households are predicted to adopt broadband by 2005.", "These findings have sparked debate about how best to regulate online content delivery.", "In response, Andrew Burke, Head of the BT Entertainment Division, expressed his interest in creating and distributing entertainment content on the web.", "While some believe that this could be a solution for content, others argue that content may remain offline when viewed by children."], "phi:2.7b": [" The blurring of boundaries between TV and the internet raises questions of regulation by Ofcom.", "However, there are differing opinions on whether or not regulation is necessary.", "Some argue that the current self-regulatory practices of the net industry should be adopted while others believe that regulations may be needed to protect audiences.", "As more and more households adopt broadband and internet service providers offer streaming video content on the web, discussions around regulating online content will continue.", "The possibility of creating content for all platforms also raises questions about how much regulation is appropriate.", "Internet service providers have long claimed no responsibility for the content they carry on their servers, but recent legal cases suggest that they may be liable if they are aware of illegal content and fail to remove it.", "The level of responsibility internet service providers have will be a key issue in discussions around regulating online content.", "Despite the challenges of regulating the internet, some experts believe that as consumers demand more on-demand content, regulations may become less necessary.", "Instead, they suggest that new digital licensing fees could fund maintaining the network to supply such a vast amount of data."], "orca-mini:3b": [" Net regulation remains possible despite no remit for the watchdog Ofcom, with boundaries between TV and the internet becoming more blurred.", "Studies suggest up to eight million UK households could have adopted broadband by the end of 2005, opening the door to TV content delivered over the net."], "hermes3:3b": ["Net regulation possibility discussed as TV and internet blur boundaries."], "stablelm-zephyr:3b": ["Ofcom, the UK watchdog, has raised the possibility of regulating internet content as boundaries between TV and the internet continue to blur.", "Lord Currie, chairman of Ofcom, did not rule out the option of regulation at a debate organized by the Internet Service Providers' Association (ISPA).", "While adopting existing rules for TV content or self-regulation could be discussed, some studies suggest that up to eight million UK households may have adopted broadband by 2005.", "As more internet service providers and media companies stream video content online, discussions around regulating the internet will become increasingly important."], "stablelm2:1.6b": ["The blurring of boundaries between TV and internet content raises questions about regulation under Ofcom.", "Content will move closer online as TV-quality video becomes norm.", "Internet service providers may face regulation, but Ofcom chairman Lord Currie doesn..", "Some studies suggest that up to eight million households in the UK could adopt broadband by the end of 2015.", "The technology allows for streaming TV content over the internet.", "BT has set up an entertainment division to create and distribute content.", "Internet service providers may face responsibility if they have actual knowledge of illegal content, but regulating the internet is difficult due to its nature.", "MP Richard Allan suggests a balance between regulation and allowing consumers to choose their own content on-demand.", "The future could bring an end to traditional offline laws applying online."], "granite3.1-dense:2b": ["The convergence of high-quality TV content with internet streaming poses regulatory challenges for Ofcom, a super-regulator that doesn't currently oversee online media.", "Lord Currie, Ofcom's chairman, indicated at a Westminster debate organized by the Internet Service Providers' Association (ISPA) that while protecting audiences is paramount, he didn't rule out the possibility of internet content regulation.", "This stance arises from increased disquiet among internet service providers due to Ofcom's recent hints about potential regulation.", "Key points include:\n- The UK internet landscape may see up to eight million households adopt broadband by 2005, enabling TV content delivery over the net.", "- Media companies like BT are developing entertainment divisions for online distribution of content from traditional broadcasters such as BSkyB, ITV, and the BBC.", "- Current internet service provider defense as \"mere conduits\" may not apply if they have actual knowledge of illegal content and fail to remove it, as tested in legal cases like Tiscali v. Law Commission.", "- High-profile TV content streaming from major networks, such as the BBC's interactive media player offering programs like EastEnders and Top Gear, could make net TV mainstream.", "- This shift might necessitate a new digital licence fee due to the vast data requirements for maintaining extensive internet networks.", "- Regulation of inappropriate online content, particularly child pornography, remains a political issue despite the potential for self-regulation by the industry.", "- The panel agreed that if consumers actively choose and access on-demand content, it becomes their responsibility to ensure its appropriateness, as there's no watershed on the internet."], "chatgpt-4o-latest": ["The increasing convergence of TV and the internet raises regulatory concerns, according to Ofcom chairman Lord Currie.", "While Ofcom currently has no authority over internet content, growing concerns among internet service providers suggest regulation could be considered.", "The debate centers on balancing consumer protection with self-regulation.", "With broadband adoption rising and media companies streaming more content online, questions emerge about content responsibility and potential new digital licence fees.", "Some argue that internet content should remain unregulated if users actively seek it out, while others believe existing TV regulations could be applied.", "MP Richard Allan suggests a middle ground between full regulation and complete freedom.", "The panel ultimately agreed that consumer choice may dictate the future, as on-demand content shifts control to viewers rather than regulators."]}