{"raw_text": "Voters flock to blog awards site\n \n Voting is under way for the annual Bloggies which recognise the best web blogs - online spaces where people publish their thoughts - of the year.\n \n Nominations were announced on Sunday, but traffic to the official site was so heavy that the website was temporarily closed because of too many visitors. Weblogs have been nominated in 30 categories, from the top regional blog, to the best-kept-secret blog. Blogs had a huge year, with a top US dictionary naming \"blog\" word of 2004. Technorati, a blog search engine, tracks about six million blogs and says that more than 12,000 are added daily. A blog is created every 5.8 seconds, according to US research think-tank Pew Internet and American Life, but less than 40% of the total are updated at least once every two months.\n \n Nikolai Nolan, who has run the Bloggies for the past five years, told the BBC News website he was not too surprised by the amount of voters who crowded the site. \"The awards always get a lot of traffic; this was just my first year on a server with a bandwidth limit, so I had to guess how much I'd need,\" he said. There were many new finalists this year, he added, and a few that had won Bloggies before. Several entries reflected specific news events. \"There are four nominations for the South-East Asia Earthquake and Tsunami Blog, which is a pretty timely one for 2005,\" said Mr Nolan.\n \n The big Bloggies battle will be for the ultimate prize of blog of the year. The nominated blogs are wide-ranging covering what is in the news to quirky sites of interest. Fighting it out for the coveted award are Gawker, This Fish Needs a Bicycle, Wonkette, Boing Boing, and Gothamist. In a sign that blogs are playing an increasingly key part in spreading news and current affairs, The South-East Asia Earthquake and Tsunami Blog is also nominated in the best overall category. GreenFairyDotcom, Londonist, Hicksdesign, PlasticBag and London Underground Tube Blog are the nominees in the best British or Irish weblog.\n \n Included in the other categories is best \"meme\". This is for the top \"replicating idea that spread about weblogs\". Nominations include Flickr, a web photo album which lets people upload, tag, share and publish their images to blogs. Podcasting has also made an appearance in the category. It is an increasingly popular idea that makes use of RSS (really simple syndication) and audio technology to let people easily make their own radio shows, and distribute them automatically onto portable devices.\n \n Many are done by those who already have text-based blogs, so they are almost like audio blogs. Three new categories have been added to the list this year, including best food, best entertainment, and best writing of a weblog. One of the categories that was scrapped though was best music blog. The winners of the fifth annual Bloggies are chosen by the public. Public voting closes on 3 February and the winners will be announced sometime between 13 and 15 March.\n", "llama3.2:1b": ["Voters are flocking to the website for the annual Bloggies awards, with many nominees in 30 categories including regional blogs, best-kept-secret blogs, and online news sites.", "The site was temporarily closed due to heavy traffic but is expected to reopen soon.", "This year's nominations include popular blogs such as Gawker, Wonkette, and Boing Boing, which are vying for the award of blog of the year."], "llama3.2:3b": ["Voters are currently casting ballots for the annual Bloggies, which recognize the best weblogs of the year.", "More than 12,000 new blogs were added daily in 2004, with traffic to the official site being so heavy that it was temporarily closed due to high visitors.", "The awards have over 30 categories and nominees include notable sites such as Gawker, This Fish Needs a Bicycle, and Gothamist.", "Voting closes on February 3 and winners will be announced between March 13-15."], "gemma2:2b": ["The Bloggies awards recognize the best web blogs for 2004, with over six million blogs tracked by Technorati and new entries added daily.", "This year's nominees are wide-ranging in topic and include notable blogs like Gawker, This Fish Needs a Bicycle, and Gothamist for blog of the year.", "The South-East Asia Earthquake and Tsunami Blog is also nominated in the best overall category.", "Several categories highlight emerging trends such as podcasting, meme culture, and online food.", "Public voting closes on February 3rd, with winners announced between March 13th and 15th."], "qwen2.5:0.5b": ["The Blogies, an awards event for web blogs, attract voters from around the world.", "Voting was announced last Sunday but traffic to the official site slowed down due to high numbers of visitors.", "Weblogs have been nominated in multiple categories including tech sites such as Technorati and Twitter.", "Many nominations for 2005's South-East Asia Earthquake and Tsunami Blog were made, with some having won earlier awards.", "Nominations for best meme are included in the overall prize.", "The Blogies battle aims to recognize blogs that have contributed most to news coverage."], "qwen2.5:1.5b": ["Voters flooded the site for the annual Bloggies awards recognizing top web blogs, with traffic overwhelming a limited server bandwidth capacity.", "Many new finalists were nominated in various categories, including \"meme\" for an idea spreading widely on blogs.", "The blog of the year award drew significant interest from Gawker and other popular sites.", "Blogger nominations included photo albums and audio blogging.", "Best music blogs are no longer eligible due to their removal.", "Public voting closes February 3 with winners announced March 13-15."], "qwen2.5:3b": ["Voting is underway for the Bloggies, recognizing the best web blogs annually.", "With nominations in over 30 categories, including regional and secret blogs, weblogs have seen significant growth with more than six million globally and a new blog created every five point eight seconds.", "The website faced traffic issues due to high voter numbers.", "Key battles include the ultimate blog of the year, as well as categories for specific topics like news events and memes (like Flickr and podcasting).", "New categories added this year are best food, entertainment, and writing.", "Winners will be chosen by public voting ending February 3rd, with announcements between March 13th-15th."], "opencoder:1.5b": ["Voters flock to the blog awards site for the annual Bloggies which recognise the best web blogs - online spaces where people publish their thoughts.", "Nominations were announced on Sunday, but traffic was so heavy that the website was temporarily closed because of too many visitors.", "Weblogs have been nominated in 30 categories.", "Top regional blogs had a huge year with a top US dictionary naming \"blog\" word of 2004.", "Technorati, an online search engine, tracks about six million blogs and says that more than 12,000 are added daily.", "Nikolai Nolan told the BBC News website he was not too surprised by the amount of voters who crowded the site.", "There were many new finalists this year, and a few that had won Bloggies before.", "Several entries reflect specific news events.", "The big Battle for the ultimate prize will be for the most coveted award of the year.", "Gawker, This Fish Needs a Bicycle, Wonkette, Boing Boing, and Gothamist are the nominees in the best overall category.", "GreenFairyDotcom, Londonist, Hicksdesign, PlasticBag and London Underground Tube Blog are the nominees in the best British or Irish weblog.", "Included in the other categories is best \"meme\".", "This is for the top \"replicating idea that spread about weblogs\".", "Nominations include Flickr, a web photo album which lets people upload, tag, share and publish their images to blogs.", "Podcasting has also made an appearance in the category.", "Three new categories have been added to the list this year, including best food, best entertainment, and best writing of a weblog.", "The winners of the fifth annual Bloggies are chosen by the public.", "Public voting closes on 3 February and the winners will be announced sometime between 13 and 15 March."], "smollm:1.7b": ["The following summary is concise, preserving key ideas and details:\n\nVoters flock to blog awards site - online spaces where people publish their thoughts - of the year.", "Nominations were announced on Sunday, but traffic to the official site was so heavy that the website was temporarily closed because of too many visitors.", "Weblogs have been nominated in 30 categories, from the top regional blog, to the best-kept secret blog.", "Blogs had a huge year, with a top US dictionary naming \"blog\" word of 2004.", "Technorati, a blog search engine, tracks about six million blogs and says that more than 12,000 are updated daily.", "A blog is created every 5.8 seconds, according to US research think-tank Pew Internet and American Life, but less than 40% of the total are updated at least once every two months.", "Nikolai Nolan, who has run the Bloggies for the past five years, told the BBC News website he was not too surprised by the amount of voters who crowded the site.", "\"The awards always get a lot of traffic; this was just my first year on a server with a bandwidth limit, so I had to guess how much I'd need,\" he said.", "There were many new finalists this year, he added, and a few that had won Bloggies before.", "Several entries reflected specific news events.", "\"There are four nominations for the South-East Asia Earthquake and Tsunami Blog, which is a pretty timely one for 2005,\" said Mr Nolan.", "The big Bloggies battle will be for the ultimate prize of blog of the year.", "The nominated blogs are wide-ranging covering what is in the news to quirky sites of interest.", "Fighting it out for the coveted award is Gawker, This Fish Needs a Bicycle, Wonkette, Boing Boing, and Gothamist.", "In a sign that blogs are playing an increasingly key part in spreading news and current affairs, The South-East Asia Earthquake and Tsunami Blog is also nominated in the best British or Irish weblog.", "Included in the other categories is best \"meme\".", "This is for the top \"replicating idea that spreads about weblogs\".", "Nominations include Flickr, a web photo album which lets people upload, tag, share and publish their images to blogs.", "Podcasting has also made an appearance in the category.", "It is an increasingly popular idea that makes use of RSS (really simple syndication) and audio technology to let people easily make their own radio shows, and distribute them automatically onto portable devices.", "Many are done by those who already have text-based blogs, so they are almost like audio blogs.", "Three new categories have been added to the list this year, including best food, best entertainment, and best writing of a weblog.", "One of the categories that was scrapped though is best music blog.", "The winners of the fifth annual Bloggies are chosen by the public.", "Public voting closes on 3 February and the winners will be announced sometime between 13 and 15 March."], "deepseek-r1:1.5b": ["The Bloggies award ceremony was a high-stakes event with significant voter turnout, as the blog awards site was temporarily closed due to overwhelming traffic.", "The awards spanned 30 categories, from regional blogs to quirky ones, with statistics showing over 12,000 new blogs were added daily but only 40% were updated twice a month.", "Nick Nolan highlighted his surprising attendance, noting server limitations forced him to guess traffic volume.", "New and old finalists included specific news topics, and the awards system leverages public voting, closing by March 13 to recognize the top blogs before a press conference in March."], "tinyllama:1.1b": ["The text mentions that voters flooded the website for the annual Bloggi awards, which recognize the best web blogs of the year.", "The nominations were in 30 categories, with nominees spreading news events to quirky sites and spreading current affairs through \"best overall category.\"", "A British or Irish weblog was nominated as well as memes (replicaating an idea) and food, music, and writing categories added this year.", "The awards had a huge year with millions of blogs created and updates made at least once per two months, making the Bloggi awards an increasingly key part of spreading news and current affairs."], "tinydolphin:1.1b": [" User, please provide a brief summary or explanation of the provided text for better understanding and comprehension.", "Voters flock to blog award site; official Bloggies site temporarily closed due to too many visitors during nominations phase.", "Blogs have been nominated in 30 categories from the top regional blogs, best-kept-secret blogs, and the top US dictionary, with over 12,000 added daily and 40% of total blogs updated at least once every two months.", "Notable finalists include Gawker, This Fish Needs a Bicycle, Wonkette, Boing Boing, and Gothamist.", "Blog of the Year award will be announced on 3 March; the winners will be announced sometime between February 13 and March 15."], "phi:2.7b": [" The Bloggies is an award ceremony for the best online blogs of the year.", "It has 30 categories, from top regional blog to the best-kept-secret blog.", "Voting is open to the public until 3 February 2005, and winners will be announced in March.", "Many new finalists this year include entries that reflect specific news events, such as South-East Asia Earthquake and Tsunami Blog.", "The biggest battle for the ultimate prize of blog of the year is between Gawker, This Fish Needs a Bicycle, Wonkette, Boing Boing, and Gothamist."], "orca-mini:3b": [" Visitors to a website for the annual Bloggies awards, which recognize the best weblogs of the year, were so heavy last Sunday that the site had to temporarily close due to high traffic.", "Nominations included many blogs covering news events, such as the South-East Asia Earthquake and Tsunami Blog, which was nominated in several categories, including best overall blog.", "Other categories included best \"meme\", which recognized the spread of ideas among weblogs, and best audio podcasting.", "Podcasting is an increasingly popular idea that allows people to make their own radio shows and distribute them automatically onto portable devices.", "The winners of the Bloggies are chosen by the public through voting, which closes on February 3rd and the winners will be announced between 13 and 15th March."], "hermes3:3b": ["Blog awards site holds annual voting for best web blogs.", "High traffic leads to website closing due to bandwidth limit.", "Many new finalists in various categories including news, current affairs, quirky sites, memes (e.g., Flickr, podcasting), food, entertainment, writing, etc.", "Voting ends 3 Feb; winners announced between Mar 13-15."], "stablelm-zephyr:3b": ["Voting begins for the annual Bloggies awards, which recognize the best web blogs.", "Nominations were announced on Sunday, but the website faced temporary closure due to heavy traffic.", "There are 30 categories, including regional blogs and secret blogs.", "Popular entries reflect specific news events, such as the South-East Asia Earthquake and Tsunami Blog.", "The Bloggies battle heats up between Gawker, This Fish Needs a Bicycle, Wonkette, Boing Boing, and Gothamist for blog of the year.", "Other categories include best \"meme,\" podcasting, best British or Irish weblog, food, entertainment, and writing of a weblog.", "Public voting closes on February 3rd, with winners to be announced between March 13th and 15th."], "stablelm2:1.6b": ["Voting for the annual Bloggies, which recognizes the best web blogs of the year, is underway due to heavy traffic on the official site.", "Categories include top regional blog, best-kept-secret blog, and blog of the year.", "A large number of new candidates were announced this year, with a few previous winners.", "The South-East Asia Earthquake and Tsunami Blog was nominated for timely content.", "Gawker, This Fish Needs a Bicycle, Wonkette, Boing Boing, and Gothamist are competing for the ultimate prize of blog of the year.", "The nominees cover various topics, including news, quirky sites, and \"memes.\"", "New categories added this year include best food, best entertainment, and best writing of a weblog.", "Public voting closes on February 3rd, with winners to be announced between February and March."], "granite3.1-dense:2b": ["Voting has commenced for the fifth annual Bloggies, an award ceremony recognizing top web blogs of 2004.", "Over six million blogs are tracked by Technorati, with 12,000 new ones added daily.", "Traffic to the official site was so high during nominations that it briefly shut down due to server limitations.", "Categories range from best regional blog to most-updated blog and include specific news events like the South-East Asia Earthquake and Tsunami Blog.", "Notable finalists include Gawker, Wonkette, Boing Boing, Gothamist, and The South-East Asia Earthquake and Tsunami Blog, all nominated for \"blog of the year.\"", "New categories this year are best food, entertainment, and writing of a weblog.", "Podcasting and Flickr have made their debut in the \"meme\" category.", "Public voting concludes on 3 February, with winners announced between 13 and 15 March."], "chatgpt-4o-latest": ["Voting for the annual Bloggies awards, which recognize the best weblogs, is underway.", "Heavy traffic temporarily shut down the official site after nominations were announced.", "Blogs have grown significantly, with \"blog\" named the word of 2004 and millions being tracked by Technorati.", "Organizer Nikolai Nolan noted the high voter turnout and highlighted new and returning finalists, including the South-East Asia Earthquake and Tsunami Blog.", "The top prize, Blog of the Year, features nominees like Gawker, Boing Boing, and Wonkette.", "Other categories include best British or Irish weblog, best \"meme,\" and new additions like best food and best entertainment blog.", "Public voting closes on 3 February, with winners announced in mid-March."]}