{"raw_text": "Web radio takes Spanish rap global\n \n Spin the radio dial in the US and you are likely to find plenty of Spanish-language music. But what you will not find is much Spanish-language hip-hop.\n \n Hip-hop and rap are actually quite popular in the Spanish-speaking world, but local artists are having trouble marketing their work abroad. But now, a US company is bringing rap and hip-hop en espanol to computer users everywhere. Los Caballeros de Plan G are one of Mexico's hottest hip-hop acts. They have a devoted fan base in their native Monterrey. But most Mexican hip-hop fans, not to mention fans in most of the Spanish-speaking world, rarely get a chance to hear the group's tracks on the radio.\n \n \"You can't really just go on the radio and listen to hip-hop in Spanish... it's just not accessible,\" says Manuel Millan, a native of San Diego, California. \"It's really hard for the Spanish hip-hop scene to get into mainstream radio. You usually have a very commercialised sound and the groups are not really known around the country or around the world.\" Millan and two friends set out to change that - they wanted to make groups like Los Caballeros de Plan G accessible to fans globally.\n \n Mainstream radio stations were not going to play this kind of music, and starting their own broadcast station was economically impossible. So, Millan and his friends launched a website called latinohiphopradio.com. The name says it all: it is web-based radio, devoted to the hottest Spanish language rap and hip-hop tracks. The site, which is in both in English and Spanish, is meant to be easy to navigate. All the user has to do is download a media player. There are no DJs. It is just music streamed over the net for free. Suddenly, with the help of the website, Los Caballeros de Plan G are producing \"export quality\" rap.\n \n The web might be just the right medium for Spanish language hip-hop right now. The genre is in what Millan calls its \"infant stage\". But the production values are improving, and artists such as Argentina's Mustafa Yoda are pushing to make it better and better. Mustafa Yoda is currently one of the hottest tracks on latinohiphopradio.com. \"He's considered the Eminem of Argentina, and the Latin American hip-hop scene,\" Millan says. \"He really hasn't had that much exposure as far as anywhere in the world, but he's definitely the one to look out for as far as becoming the next big thing in the Spanish-speaking world.\" Currently, the Chilean group Makisa is also in latinohiphopradio.com's top 10, as is Cuban artist Papo Record. \"Every country's got it's own cultural differences and they try to put those into their own songs,\" Millan says. Latinohiphopradio.com has been up and running for a couple of months now. The site has listeners from across the Spanish speaking world. Right now, Mexico leads the way, accounting for about 50% of listeners. But web surfers in Spain are logging in as well - about 25% of the web station's traffic comes from there. That is not surprising as many consider Spain to be the leader in Spanish-language rap and hip-hop. Millan says that Spain is actually just behind the United States and France in terms of overall rap and hip-hop production. That might be changing, though, as more and more Latin American artists are finding audiences.\n \n But one Spaniard is still firmly in latinohiphopradio.com's top 10. His name is Tote King and Manuel Millan says that he is the hip-hop leader in Spain. On his track Uno Contra Veinte Emcees, or One Against 20 Emcees, Tote King shows he is well aware of that fact. \"It's basically him bragging that he's one of the best emcees in Spain right now,\" Millan says. \"And it's pretty much true. He has the tightest productions, and his rap flow is impeccable, it's amazing.\" Latinohiphopradio.com is hoping to expand in the coming year. Millan says they want to include more music and more news from the world of Spanish language hip-hop and rap.\n \n Clark Boyd is technology correspondent for The World, a BBC World Service and WGBH-Boston co-production.\n", "llama3.2:1b": ["Here is a concise summary of the text:\n\nWeb radio platform Latinohiphopradio.com is bringing Spanish-language hip-hop to the US and worldwide.", "Despite local artists having trouble marketing their work abroad, a US company has launched a website featuring the hottest Spanish language rap and hip-hop tracks.", "The site provides a free stream of music in both English and Spanish, with artists such as Los Caballeros de Plan G and Mustafa Yoda achieving success on it.", "The platform was created by native Californians Manuel Millan and two friends who wanted to make groups like Los Caballeros de Plan G more accessible globally.", "The site has gained popularity among Spanish-speaking listeners worldwide, with Mexico leading the way at 50% of listeners, followed closely by Spain and Chile.", "The platform's success is attributed to its easy-to-use interface and availability on both English and Spanish websites.", "Latinohiphopradio.com also aims to expand its content in the coming year, including more music and news from the world of Spanish language hip-hop and rap."], "llama3.2:3b": ["US company launches website to bring Spanish-language hip-hop globally, providing a platform for Mexican artists like Los Caballeros de Plan G to reach international fans, but faces challenges in making mainstream radio accessible to local scenes, with some artists gaining popularity through the web-based station, including Argentina's Mustafa Yoda and Spain's Tote King."], "gemma2:2b": ["A website called latinohiphopradio.com enables users to access free online Spanish-language rap and hip-hop music from artists such as Los Caballeros de Plan G, Mustafa Yoda, and Papo Record.", "The site's founders realized that mainstream radio is not easily accessible for this genre due to commercialization issues, so they launched a web platform for fans to enjoy the music freely.", "This website has gained global traction with listeners from diverse countries, particularly Spain and Mexico.", "Tote King, a leading figure in Spanish-language hip-hop, is featured prominently on the site, further highlighting its growing influence.", "The website plans to expand its musical content and news coverage to further enhance user experience."], "qwen2.5:0.5b": ["Spanish-language music is popular globally but local artists struggle to reach global audiences due to commercialisation in mainstream radio stations.", "A US company is bringing Spanish-language rap en español to the internet so that more people can listen.", "Mainstream radio stations do not play hip-hop in Spanish, and it is difficult for artists like Los Caballeros de Plan G to get their music into international media.", "Latinohiphopradio.com has started online streaming of Spanish-language rap music from around the world."], "qwen2.5:1.5b": ["Web radio now offers Spanish-language rap and hip-hop worldwide through latinohiphopradio.com.", "This site aims to make mainstream radio stations accessible by streaming free music from artists like Los Caballeros de Plan G, helping them break into the global market.", "The genre is currently in its \"infant stage\" but improving with artists pushing for better production values, such as Argentina's Mustafa Yoda and Cuban artist Papo Record.", "Latinohiphopradio.com has been successful in bringing Spanish-language rap to a wide audience across various countries, including Mexico, Spain, and even the UK."], "qwen2.5:3b": ["Web radio has opened up new opportunities for Spanish-language hip-hop by bringing it to a wider global audience.", "In the US, while there's plenty of Spanish music, much less is heard on mainstream radio stations, particularly in rap/hip-hop formats.", "Companies like Los Caballeros de Plan G face barriers in accessing traditional media but have found success with platforms like latinohiphopradio.com—a web-based radio station that streams popular Spanish-language rap and hip-hop tracks for free.", "This medium helps artists from diverse regions gain exposure worldwide; examples include Mustafa Yoda from Argentina, Makisa from Chile, and Papo Record from Cuba.", "The site also highlights Spanish-speaking countries leading in their respective scenes, such as Spain being the frontrunner for Latin American rap and hip-hop.", "Latinohiphopradio.com aims to grow further by adding more music and news, positioning itself as a key platform for emerging Spanish-language artists in the hip-hop genre."], "opencoder:1.5b": ["This summary preserves key ideas and details in the text:\n\n1.", "Web radio takes Spanish rap global\n2.", "In the US, you will find plenty of Spanish-language music \n3.", "But local artists are having trouble marketing their work abroad.", "4.", "A US company is bringing rap and hip-hop en espanol to computer users everywhere.", "5.", "Los Caballeros de Plan G act in Mexico's hottest hip-hop acts.", "6.", "The Spanish-speaking world, most Mexican hip-hop fans, not to mention fans in most of the Spanish-speaking world, rarely get a chance to hear the group's tracks on the radio.", "7.", "You can't really just go on the radio and listen to hip-hop in Spanish... it's hard for the Spanish hip-hop scene to get into mainstream radio.", "8.", "They wanted to make groups like Los Caballeros de Plan G accessible to fans globally.", "9.", "Mainstream radio stations were not going to play this kind of music, and starting their own broadcast station was economically impossible.", "So, launched a website called latinohiphopradio.com.", "10.", "The web might be just the right medium for Spanish language hip-hop right now.", "11.", "It is in what Millan calls its \"infant stage\".", "12.", "All user have to do is download a media player.", "There are no DJs.", "13.", "It is just music streamed over the net for free.", "14.", "Suddenly, with the help of the website, Los Caballeros de Plan G are producing \"export quality\" rap.", "15.", "The site has listeners from across the Spanish speaking world.", "16.", "Right now, Mexico leads the way, accounting for about 50% of listeners.", "But web surfers in Spain are logging in as well - about 25% of the web station's traffic comes from there.", "17.", "Every country's got it's own cultural differences and they try to put those into their own songs.", "18.", "Latinohiphopradio.com has been up and running for a couple of months now.", "The site has listeners from across the Spanish-speaking world.", "19.", "Right now, Mexico leads the way, accounting for about 50% of listeners.", "But web surfers in Spain are logging in as well - about 25% of the web station's traffic comes from there.", "20.", "That is not surprising as many consider Spain to be the leader in Spanish-language rap and hip-hop production.", "21.", "Millan says that Spain is actually just behind the United States and France in terms of overall rap and hip-hop production.", "22.", "The next year, they are hoping to expand in the coming year.", "23.", "The genre is in what Millan calls its \"infant stage\".", "24.", "Latinohiphopradio.com has been up and running for a couple of months now.", "The site has listeners from across the Spanish-speaking world."], "smollm:1.7b": ["The summary should be concise and objective, preserving key ideas and details while avoiding interpretation or explanation.", "Here's an example:\n\nWeb radio brings Spanish-language hip-hop to computer users worldwide\n\nLos Caballeros de Plan G are one of Mexico's hottest hip-hop acts\n\nUS company is bringing rap and hip-hop en espanol to computer users everywhere\n\nMainstream radio stations were not going to play this kind of music, and starting their own broadcast station was economically impossible.", "So, Millan and his friends launched a website called latinohiphopradio.com\n\nThe name says it all: it is web-based radio, devoted to the hottest Spanish language rap and hip-hop tracks.", "Mustafa Yoda is currently one of the top 10 on the site, as is Papo Record from Cuba.", "Right now, Mexico leads the way in terms of overall rap and hip-hop production, but Spain is catching up quickly.", "Millan says that Tote King's track Uno Contra Veinte Emcees is proof of that fact.", "It's basically him bragging that he's one of the best emcees in Spain right now.", "Millan adds that the site wants to include more music and more news from the world of Spanish language hip-hop and rap, but this summary only needs to summarize the main points."], "deepseek-r1:1.5b": ["The web can be an ideal medium for Spanish-language rap and hip-hop right now, despite a challenge in mainstream media.", "Spanish rap is well-documented but lacks global recognition.", "A US company, Latin City Records, introduces its music to computer users worldwide through the website Latinohiphopradio.com.", "Local artists, including Manuel Millan from San Diego, collaborate with friends to create this platform, aiming to make Spanish hip-hop accessible.", "Despite challenges, the genre is in its infant stage but production values improve with artists like Argentina's Mustafa Yoda and Latin American groups.", "Spanish rap and hip-hop are expanding globally, with notable success despite Spain's lack of world leadership status.", "Tote King has reached top 10, while Clark Boyd serves as a tech contributor."], "tinyllama:1.1b": ["The Web radio \"Latinohiphopradiog\" has become popular in the Spanish-speaking world by bringing hip-hop from Mexico to global audiences through streaming media.", "The site, which was launched by Manuel Millan and his friends with the idea of making groups like Los Caballeros de Plan G accessible to fans globally, is now serving as a platform for accessing hotest Spanish langauge rap and hip-hoppers in both English and Spanish.", "With over 12,000 registered users in the United States alone, Latinohiphopradiog's \"infant stage\" of Spanish langauge hip-hop is currently being pushed by artists like Mustafa Yoda, who holds an impressive ranking on Latinohiphopradiog.com's top 10 list, and Makisa, a Chilean act whose tracks are gaining popularity in the worldwide Spanish-speaking community.", "The site has over 50% of its traffic coming from Spain, with both Mexico and Spain being at the top of the ranking.", "With plans to expand globally, Latinohiphopradiog's goal is to bring more music from the Spanish langauge hip-hop scene and news about it to audiences around the world."], "tinydolphin:1.1b": [" The Web Radio Take Spanish Hip Hop is a simple yet effective way to access local and international music in Spanish, regardless of your location or the language you speak.", "Los Caballeros de Plan G, a popular Mexican rap group, has teamed up with a San Diego company called LatinOHiphopRadio.com to bring their tracks to global listeners.", "The site is powered by both a streaming media player and a website that allows users to download the audio files for free.", "By doing so, listeners can enjoy the same high-quality music as fans in Mexico and beyond.", "The mainstream radio industry has been slow to embrace the Spanish-language hip-hop genre, but it is making significant strides in expanding its reach globally.", "With the help of LatinOHiphopRadio.com, Los Caballeros de Plan G are now making their tracks available to fans across the world.", "Millan, a native of San Diego, believes that this initiative will encourage more Spanish-language hip-hops to be heard on mainstream radio stations, ultimately benefiting both local and international listeners alike."], "phi:2.7b": [" Latinohiphopradio.com is a web radio station that provides easy access to Spanish language hip-hop tracks from popular artists like Los Caballeros de Plan G, Mustafa Yoda, Makisa, and Papo Record.", "The website is free of charge for users and has listeners from across the Spanish speaking world.", "Spain leads in terms of overall rap and hip hop production and Tote King is considered the best emcee in Spain with his impeccable flow and tight productions.", "Latinohiphopradio.com aims to expand its content and news coverage in the coming year."], "orca-mini:3b": [" Web radio takes Spanish rap global, with new platform providing exposure for Latin American artists"], "hermes3:3b": ["Web-based Spanish rap and hip-hop radio; Los Caballeros de Plan G and other artists reaching global audience through latinohiphopradio.com"], "stablelm-zephyr:3b": ["Web radio platform Latinohiphopradio.com is bringing Spanish-language hip-hop to computer users globally, providing a channel for local artists to market their work abroad.", "Due to mainstream radio stations not playing this type of music and economic barriers preventing the establishment of a broadcast station, Manuel Millan and two friends launched the website featuring hip-hop and rap tracks in both English and Spanish.", "The site has attracted listeners from across the Spanish-speaking world with Mexico leading the way.", "As more Latin American artists gain audiences, it's possible that Spain could become a leader in Spanish-language rap and hip-hop production as well."], "stablelm2:1.6b": ["Web radio brings Spanish hip-hop global success: Los Caballeros de Plan G has been unable to reach mainstream radio in their native Monterrey; however, a US company helps make rap and hip-hop songs accessible on their website called Latinohiphopradio.com, which attracts listeners from across the Spanish-speaking world.", "The platform aims for an easy-to-navigate user experience, streaming music for free with no DJs.", "According to Manuel Millan, co-founder of the site, the genre is in its \"infant stage,\" but production values are improving and artists like Mustafa Yoda (Argentina) and Makisa (Chile/Cuba) contribute significantly to their popularity.", "Spain leads the way in Spanish- language rap and hip-hop with around 20% of listeners; the website's traffic from there is about 1/4th of its total web traffic, driven by the country's reputation as a leader in Spanish-language rap and hip-hop."], "granite3.1-dense:2b": ["A US-based company, led by Manuel Millan, has launched latinohiphopradio.com, a web radio station dedicated to Spanish language hip-hop and rap.", "This platform addresses the lack of international exposure for popular Spanish hip-hop acts like Los Caballeros de Plan G, Mustafa Yoda, Makisa, Papo Record, and Tote King.", "The site streams music free over the internet, bypassing traditional radio's limitations in playing this niche genre due to commercialization and national focus.", "Latinohiphopradio.com caters to listeners from Spanish-speaking countries, with Mexico being the largest user group (50%), followed by Spain (25%).", "The site aims to expand its content and news coverage in the future, fostering a global platform for Spanish language hip-hop artists."], "chatgpt-4o-latest": ["Spanish-language hip-hop is popular but struggles to gain mainstream radio play.", "To address this, Manuel Millan and his friends launched latinohiphopradio.com, a web-based station streaming Spanish rap and hip-hop globally.", "The site features artists like Mexico’s Los Caballeros de Plan G, Argentina’s Mustafa Yoda, Chile’s Makisa, and Spain’s Tote King.", "Spain is a major hub for Spanish rap, but Latin American artists are gaining recognition.", "The site has attracted listeners from Mexico, Spain, and beyond.", "Millan hopes to expand the platform with more music and news about the Spanish hip-hop scene."]}