{"raw_text": "Norway upholds 'Napster' ruling\n \n A Norwegian student who ran a website which linked to downloadable MP3 files has been ordered to pay compensation by the country's Supreme Court.\n \n Frank Allan Bruvik was ordered to pay 100,000 kroner (£8,000) to the music industry in Norway. He was a student when he set up his napster.no site, which allowed users to submit and receive links to MP3 files. Bruvik had earlier been cleared on appeal after a lower court had found for the music industry. Music industry bosses in Norway said the ruling would help build confidence in the internet as a distribution medium.\n \n Frank Allan Bruvik set up the napster.no website as part of a school project in 2001 while studying computer engineering in the Norwegian town of Lillehammer. The website was not associated with the napster.com site in the USA, which had been operating since 1999 and was already facing legal action.\n \n Bruvik's site was online between August and November 2001, and while it did not host any music, at its peak it was providing links to more than 170 free files on other servers. As well as providing links, the site allowed those visiting it to submit links that could later be accessed by other visitors. A legal complaint for copyright violation was filed by groups including Norway's performing rights society, Tono, and the Norwegian branches of Sony Music and Universal Music, who saw it as an important test of principle.\n \n A Norwegian court ruled in 2003 that Bruvik would have to pay 100,000 kroner to the music industry, but the country's Court of Appeal cleared him, saying that the copyright violation occurred when others posted the music. However, the Supreme Court stated that the music was clearly published in violation of copyright law It added that the case was decided based on the responsibility for abetting an illegal act, and that Bruvik's actions were premeditated. Norway's music industry said it was satisfied with the ruling, because showed that music piracy would not be accepted.\n \n Meanwhile, in the USA a further 717 lawsuits against people alleged to have traded copyrighted songs were filed this week by the Recording Industry Association of America. The suits, brought on behalf of the major record companies, cite the individuals for illegally distributing music via unauthorized peer-to-peer services such as KaZaa and eDonkey. As with preceding cases, the fresh action was made against so-called \"John Doe\" defendants, who are identified only by the codes given to their computers' internet connections.\n", "llama3.2:1b": ["Norway's Supreme Court has ordered student Frank Allan Bruvik to pay 100,000 kroner (£8,000) in compensation to the music industry for allegedly infringing copyright laws on his website napster.no.", "The court ruled that Brukiv was responsible for abetting an illegal act of distributing copyrighted music."], "llama3.2:3b": ["A Norwegian student's Napster-like website napster.no was ordered to pay 100,000 kroner (£8,000) in compensation to the music industry for copyright infringement.", "The site, created as a school project, provided links to MP3 files and allowed users to submit links between August and November 2001.", "The Supreme Court ruled that Bruvik's actions were premeditated and decided the case based on responsibility for abetting an illegal act."], "gemma2:2b": ["A Norwegian student named Frank Allan Bruvik was ordered to pay compensation for his website that linked to downloadable MP3 files, despite earlier rulings in his favor.", "The Supreme Court ruled that the music piracy on his site violated copyright law and held him responsible for abetting an illegal act.", "This decision reinforces the music industry's stance on combating online infringement while also illustrating ongoing legal action against individuals accused of illegally distributing copyrighted content across various platforms worldwide."], "qwen2.5:0.5b": ["Norway's Supreme Court ordered Frank Allan Bruvik, a student on Napster.no, to pay 100,000 kroner (£8,000) compensation for linking to free MP3 files on his site in 2001.", "The ruling helped build trust in the internet as a distribution medium and was seen as an important test of copyright laws.", "Bruvik set up Napster.no as part of a school project while studying computer engineering in Lillehammer, Norway, back in 2001.", "His site was active between August and November 2001, allowing users to submit links for other visitors to access free files.", "The music industry claimed Bruvik had violated copyright laws by hosting music without permission.", "In 2003, a Norwegian court ruled that Bruvik would have to pay 100,000 kroner to the music industry but the Supreme Court overturned this ruling, stating that it was Bruvik's responsibility for abetting an illegal act and that his actions were premeditated.", "The case involved seven lawsuits against people accused of distributing copyrighted songs via peer-to-peer networks like KaZaa and eDonkey.", "In the USA, a further 717 copyright cases involving major record companies have been filed this week with the Recording Industry Association of America (RIAA) accusing those trading in copyrighted music through unauthorized peer-to-peer services.", "These lawsuits are against individuals known only by their computer codes used to connect to the internet."], "qwen2.5:1.5b": ["A Norwegian student facing legal trouble for linking MP3 downloads to a website he set up has been ordered to pay 100,000 kroner (£8,000) in compensation after the Supreme Court ruled that his actions were premeditated and abetted copyright violation.", "The decision aligns with Norway's stance on internet as a distribution medium but could be seen by music industry as undermining their efforts to fight piracy."], "qwen2.5:3b": ["Norway's Supreme Court ordered Frank Allan Bruvik, a former student, to pay 100,000 kroner (approximately £8,000) in compensation to the music industry for his website that linked to downloadable MP3 files.", "The site was not directly associated with Napster.com but hosted links to free files on other servers.", "Despite earlier legal action by a lower court and subsequent clearance from the Court of Appeal, the Supreme Court upheld the 2003 decision, emphasizing Bruvik's role in aiding illegal activities.", "The case is seen as important for establishing that music piracy will not be tolerated, even if sites themselves are not directly involved in hosting copyrighted material.", "In parallel, the Recording Industry Association of America filed 717 lawsuits in the US against individuals accused of distributing copyrighted songs via unauthorized peer-to-peer services."], "opencoder:1.5b": ["A Norwegian student who ran a website which linked to downloadable MP3 files has been ordered to pay compensation by the country's Supreme Court.", "Frank Allan Bruvik set up the napster.no website as part of a school project in 2001 while studying computer engineering in the Norwegian town of Lillehammer.", "The site was not associated with the napster.com site in the USA, which had been operating since 1999 and was already facing legal action.", "The music industry in Norway confirmed that the ruling would help build confidence in the internet as a distribution medium.", "Bruvik's actions were premeditated, yet the Supreme Court ruled that the music was clearly published and it was decided based on the responsibility for abetting an illegal act.", "The country's Court of Appeal cleared him, saying that the copyright violation occurred when others posted the music."], "smollm:1.7b": ["The summary is concise and clear, preserving key ideas and details from the original text.", "The main points of the text are:\n\n1.", "Norway upholds Napster ruling\n2.", "Student who set up website linked to downloadable MP3 files\n3.", "Order for compensation imposed by Supreme Court\n4.", "Bruvik's case cleared by Court of Appeal\n5.", "Music industry satisfied with ruling\n6.", "Further lawsuits filed in USA against people alleged to have traded copyrighted songs\n7.", "Fresh action brought on behalf of major record companies\n8.", "Identified only by codes given to their internet connections"], "deepseek-r1:1.5b": ["Norway has ruled that Frank Allan Bruvik, the founder of napster.no (a music sharing site), is liable for copyright infringement totaling 100,000 kroner.Bruvik set up his site as part of a school project in 2001 while studying computer engineering, operating online from August to November 2001.", "His site provided links to over 170 free MP3 files and allowed users to submit links for others to access.", "Legal complaints from groups including Tono and Sony argued that the site was a test of copyright law.", "The Supreme Court ruled in favor of Bruvik, but the Court of Appeal later cleared him by stating the violation occurred when others posted music.", "Norway's music industry is satisfied with the ruling.", "Meanwhile, the US filed 717 lawsuits against individuals using peer-to-peer services like KaZaa and eDonkey to distribute copyrighted songs, mirroring previous cases."], "tinyllama:1.1b": ["In a decision rendered by Norway's Supreme Court in 2003, a student named Frank Allan Bruvik was found guilty of copyright violation for running a website that linked MP3 files to other servers.", "The site was designed to allow users to submit and receive links to music, but it also allowed those accessing the site to upload music themselves.", "In response to this, groups including Norway's performing rights society, Tono, and the Norwegian branches of Sony Music and Universal Music filed a legal complaint for copyright violation.", "Bruvik was eventually cleared by the Court of Appeal in 2003, but his website's abettment of illicit music distribution was also ruled out by the Supreme Court, stating that it was premeditated and not based on an intent to break copyright law.", "The US record industry sued over 717 alleged trade-distributors under a new lawsuit filed this week, citing individuals for distributing songs via unauthorized peer-to-peer services such as KaZaa and eDonkey."], "tinydolphin:1.1b": [" The Norwegian Supreme Court has ordered a student to pay millions of dollars in compensation to the music industry for hosting a website that distributed copyrighted files without permission.", "Frank Allan Bruvik, who set up the Napster website in 2001 while studying computer engineering in Lillehammer, Norway, was cleared on appeal after an earlier ruling by a lower court found in favor of the music industry.", "However, with the new ruling, music piracy would not be accepted in Norway and copyright violations would be punished, the country's Supreme Court stated."], "phi:2.7b": [" A Norwegian student who set up a website that linked to downloadable MP3 files has been ordered to pay compensation to the music industry after his case went all the way to the Supreme Court.", "The court ruled in favor of Bruvik's actions, stating that he was not responsible for the copyright violation but rather those who uploaded the music.", "However, the ruling did allow for compensation to be paid to the music industry.", "In the United States, 717 lawsuits were filed against individuals accused of illegally distributing copyrighted music using peer-to-peer services such as KaZaa and eDonkey.", "These cases also involved the use of \"John Doe\" defendants who are identified only by their internet connection codes."], "orca-mini:3b": [" Norway upholds ruling on Napster website linked to music piracy.", "A Norwegian student was ordered to pay 100,000 kroner in damages to the country's music industry after creating and operating a website that provided links to free MP3 files without permission from the copyright holders.", "The ruling showed that piracy would not be accepted, according to Norway's music industry."], "hermes3:3b": ["Norway's Supreme Court orders student Frank Allan Bruvik to pay 8000£ compensation for running website linking MP3 files, aiding music copyright violation."], "stablelm-zephyr:3b": ["A Norwegian student, Frank Allan Bruvik, ran a website called napster.no that linked to downloadable MP3 files.", "In 2003, he was ordered to pay 100,000 kroner (£8,000) to the music industry as compensation for copyright violation.", "Although Bruvik's site did not host any music, he faced legal action because his actions were considered an encouragement of illegal acts.", "This case demonstrated that Norway's music industry viewed piracy as not being accepted and helped build confidence in the internet as a distribution medium."], "stablelm2:1.6b": ["Norway's Supreme Court upheld a ruling that ordered a Norwegian student to pay £8 ($12) in compensation to the music industry for running a Napster-like website while studying computer engineering in Lillehammer.", "The site, napster.no, allowed users to submit and receive links to MP3 files between August and November 2001; it did not host any music but linked to over 50 free files on other servers.", "Groups including Tono and Sony Music Universal sought legal action as a test of principle in case Napster.com faced legal action, with the US court ruling that user Bruvik had to pay compensation for his role in facilitating copyright infringement."], "granite3.1-dense:2b": ["Frank Allan Bruvik, a Norwegian student, was ordered to pay 100,000 kroner (£8,000) to the music industry after running napster.no in 2001.", "The website, created for a school project, facilitated the submission and sharing of MP3 file links.", "Despite an earlier appeal verdict that found Bruvik not responsible due to others posting the music, the Supreme Court ruled otherwise, citing his premeditated actions as abetting copyright violation.", "The ruling bolstered confidence in internet distribution.", "Meanwhile, in the U.S., the Recording Industry Association of America filed 717 lawsuits against \"John Doe\" defendants for allegedly distributing copyrighted songs via unauthorized peer-to-peer services like KaZaa and eDonkey."], "chatgpt-4o-latest": ["Norway's Supreme Court ordered student Frank Allan Bruvik to pay 100,000 kroner (£8,000) for running napster.no, a website linking to downloadable MP3 files.", "Initially created as a school project in 2001, the site allowed users to submit and access links to free music files but did not host any music itself.", "After a lower court ruled against him in 2003, Bruvik was cleared on appeal, but the Supreme Court later found him guilty of abetting copyright violations.", "The ruling was welcomed by Norway's music industry as a stand against piracy.", "Meanwhile, in the U.S., the Recording Industry Association of America filed 717 new lawsuits against individuals accused of illegally distributing copyrighted music via peer-to-peer services like KaZaa and eDonkey."]}