{"raw_text": "Blogs take on the mainstream\n \n Web logs or blogs are everywhere, with at least an estimated five million on the web and that number is set to grow.\n \n These online diaries come in many shapes and styles, ranging from people willing to sharing their views, pictures and links, to companies interested in another way of reaching their customers. But this year the focus has been on blogs which cast a critical eye over news events, often writing about issues ignored by the big media or offering an eye-witness account of events. Most blogs may have only a small readership, but communication experts say they have provided an avenue for people to have a say in the world of politics. The most well-known examples include Iraqi Salam Pax's accounts of the US-led war, former Iranian vice-president Mohammad Ali Abtahi exclusive insight into the Islamic Republic's government, and the highs and lows of the recent US election campaign. There are already websites pulling together these first-hand reporting accounts heralded by blogs, like wikinews.com, launched last November.\n \n The blogging movement has been building up for many years.\n \n Andrew Nachison, Director of the Media Center, a US-based think-tank that studies media, technology and society, highlights the US presidential race as a possible turning point for blogs. \"You could look at that as a moment when audiences exercised a new form of power, to choose among many more sources of information than they have never had before,\" he says. \"And blogs were a key part of that transformation.\" Among them were blogs carrying picture messages, saying \"we are sorry\" for George W Bush's victory and the responses from his supporters. Mr Nachison argues blogs have become independent sources for images and ideas that circumvent traditional sources of news and information such as newspapers, TV and radio. \"We have to acknowledge that in all of these cases, mainstream media actually plays a role in the discussion and the distribution of these ideas,\" he told the BBC News website. \"But they followed the story, they didn't lead it.\"\n \n Some parts of the so-called traditional media have expressed concerns about this emerging competitor, raising questions about the journalistic value of blogs.\n \n Others, like the French newspaper Le Monde, have applied a different strategy, offering blogs as part of its content. \"I don't think the mission and role of journalism is threatened. It is in transition, as society itself is in transition,\" says Mr Nachison. However, he agrees with other experts like the linguist and political analyst Noam Chomsky, that mainstream media has lost the traditional role of news gatekeeper. \"The one-to-many road of traditional journalism, yes, it is threatened. And professional journalists need to acclimate themselves to an environment in which there are many more contributors to the discourse,\" says Mr Nachison. \"The notion of a gatekeeper who filters and decides what's acceptable for public consumption and what isn't, that's gone forever.\" \"With people now walking around with information devices in their pockets, like camera or video phones, we are going to see more instances of ordinary citizens breaking stories.\"\n \n It seems unlikely that we will end up living in a planet where every human is a blogger.\n \n But the current number of blogs is likely to keep on growing, in a web already overloaded with information. Blog analysis firm Technorati estimates the number of blogs in existence, the so-called blogosphere, has already exceeded five million, and is growing at exponential levels. Tools such as Google's Blogger, MovableType and the recently launched beta version of MSN Spaces are making it easier to run a blog. US research think-tank Pew Internet & American Life says a blog is created every 5.8 seconds, although less than 40% of the total are updated at least once every two months. But experts agree that the phenomenon, allowing individuals to publish, share ideas, exchange information, comment on current issues, post images or video on the web easily, is here to stay. \"We are entering one era in which the technological infrastructure is creating a different context for how we tell our stories and how we communicate with each other,\" said Mr Nachison. \"And there's going to be bad that comes with the good.\"\n", "llama3.2:1b": ["Blogs have grown exponentially, reaching over 5 million online, as people seek alternative outlets for news and information.", "Blogs offer a platform for individuals to share their views, experiences, and expertise, often bypassing traditional media sources.", "Experts see blogs as a key part of the transformation in how we consume and disseminate information.", "However, concerns have been raised about the role of mainstream media in this shift.", "Some are applying new strategies, such as partnering with blogs, while others argue that traditional journalism is being disrupted.", "Despite these changes, experts agree that the phenomenon of blogging will continue to grow, offering individuals a unique space for self-expression and information-sharing."], "llama3.2:3b": ["Blogs have become a significant part of online media, estimated at five million and growing exponentially.", "They offer critical views on news events and provide alternative perspectives on issues ignored by mainstream media.", "Blogs have played a key role in shaping public discourse, particularly during high-profile events like the US presidential election campaign.", "Experts argue that blogs have become independent sources for information and ideas, circumventing traditional media outlets.", "While some worry about the journalistic value of blogs, others see them as part of a natural transition in journalism, where professional journalists must adapt to an environment with multiple contributors.", "The phenomenon is likely to continue growing, with new tools making it easier to create and run blogs."], "gemma2:2b": ["Blogs have become widespread, with an estimated five million existing blogs and their numbers continuously growing.", "Their use has evolved from personal diaries to offering commentary on current events, often in opposition to traditional media.", "Blogs provide a platform for citizen journalism and are increasingly used by both individuals and organizations.", "Some traditional media outlets see the rise of blogs as a challenge to journalistic value, while others embrace them as part of their content.", "Despite concerns about the future of news gatekeeping and competition with traditional media, blogs are here to stay, shaping how we share stories and communicate online."], "qwen2.5:0.5b": ["Blogs have become an important part of online communication, casting critical eyes on news events.", "They offer personal perspectives and eye-witness accounts for readers interested in politics.", "Blogs have already created five million blogs worldwide, surpassing traditional media outlets such as newspapers.", "The current number of blogs is estimated to be more than 5 million.", "Tools like Google's Blogger, MovableType, and MSN Spaces make it easy to start a blog.", "Blogging has transformed the way people get news by providing them with personal perspectives on topics they are interested in."], "qwen2.5:1.5b": ["Blogs have become popular online diaries used by individuals or companies, focusing on critical news coverage and alternative viewpoints.", "This trend is expected to continue as blogging grows exponentially.", "The rise of blogs poses challenges for traditional media but opens up new opportunities for independent reporting.", "Expert analysts like Nachison see this as a transformative change in journalism, with ordinary citizens potentially becoming influential sources of breaking news.", "While concerns exist about the impact on mainstream media, it's clear that blogging will play an increasingly important role in shaping public discourse and information dissemination."], "qwen2.5:3b": ["Web logs or blogs have become ubiquitous, estimated at over five million globally, expected to increase further.", "They range from personal diaries to corporate marketing tools, but this year focused on critical analysis of news events and eyewitness accounts of significant occurrences.", "Notable examples include Iraqi Salam Pax’s coverage of the US-led war, Mohammad Ali Abtahi's insights into Iran, and election campaign reporting.", "Blogs have emerged as a new medium for direct citizen journalism, supported by platforms like Wikinews.com.", "The movement has roots in years of development; Andrew Nachison sees the 2004 U.S. presidential race as pivotal, with blogs offering independent images and ideas not controlled by traditional media.", "Concerns exist over the impact on mainstream media roles but also opportunities for broader audience engagement.", "Despite fears of a world overrun by bloggers, blog creation continues to surge exponentially, challenging conventional journalism's role while fostering new communication channels."], "opencoder:1.5b": ["Blogs take on the mainstream\n\nWeb logs or blogs are everywhere, with estimated five million on the web and set to grow.", "These online diaries come in many shapes and styles, ranging from people willing to share their views, pictures and links, to companies interested in another way of reaching their customers.", "But this year the focus has been on blogs which cast a critical eye over news events, often writing about issues ignored by the big media or offering an eye-witness account of events.", "The blogging movement has been building up for many years.", "Andrew Nachison, Director of the Media Center, a US-based think-tank that studies media, technology and society, highlights the US presidential race as a possible turning point for blogs.", "\"You could look at that as a moment when audiences exercised a new form of power, to choose among many more sources of information than they have never had before,\" he says.", "\"And blogs were a key part of that transformation.\"", "Some parts of the traditional media have expressed concerns about this emerging competitor, raising questions about the journalistic value of blogs.", "Others, like the French newspaper Le Monde, have applied a different strategy, offering blogs as part of its content.", "\"I don't think the mission and role of journalism is threatened.", "It is in transition, as society itself is in transition,\" says Mr Nachison.", "However, he agrees with other experts like the linguist and political analyst Noam Chomsky, that mainstream media has lost the traditional role of news gatekeeper.", "\"The notion of a gatekeeper who filters and decides what's acceptable for public consumption and what isn't, that's gone forever.\"", "\"With people now walking around with information devices in their pockets, like camera or video phones, we are going to see more instances of ordinary citizens breaking stories.\"", "It seems unlikely that we will end up living in a planet where every human is a blogger."], "smollm:1.7b": ["The text above summarizes the main ideas of the following article:\n\"Blogs take on mainstream\""], "deepseek-r1:1.5b": ["blogs are everywhere on the web, from people sharing views and pictures to companies reaching customers.", "This year, blogs focus on critical journalism with a lens on news events, often offering firsthand insights or witness accounts.", "While traditional media has smaller readership, blogs offer a platform for individuals to have an say in matters of importance.", "Examples include Iraqi Salam Pax's coverage, Abtahi's insights, and election campaign images.", "Websites like wikinews combine these accounts.", "Andrew Nachison notes that blogs were part of the media transformation during the presidential race, integrating traditional news sources with new information.", "Mainstream media still holds a role as a gatekeeper but in a new context.", "Some traditional media are skeptical about blogs, while others adapt by using them alongside their content.Nachison agrees that traditional media is losing its news gatekeeper role and embracing a different kind of communication.", "Technorati estimates blogs exceed five million in the blogosphere, growing quickly.", "Tools like Google's Blogger, MovableType, and MSN Spaces enable easy blog creation.", "Pew Internet & American Life says blogs are created every 5.8 seconds but updated infrequently.", "Experts agree that blogs offer multiple contributors to discussions without traditional news media.", "The conclusion is that blogs aren't the end but a new era where technology transforms storytelling and communication.", "They will face issues like excessive exploration or data overload as people rely on them globally."], "tinyllama:1.1b": ["The online dialogue platform, blogging, has gained popularity in recent years, with several weblogs or blogs being created every day.", "The rise of blogging has exposed a new form of power - audience's choice for information and ideas over traditional sources of news and information such as newspapers, TV, and radio.", "These online voices have become independent souces of images and ideas that circumvent the mainstream media's role in distributing these ideas.", "The emergence of professional bloggers who can decide what's acceptable for public consumption and what isn't has led to more instances of ordinary citizens breaking stories.", "Blogs are now overloaded with information, with Google's Blogger, MovableType, and MSN Space as tools to run a blog, making it easier to create and share ideas.", "The phenomenon, allowing individuals to publish, share ideas, communicate with each other easily, has led to the emergence of a new era in which technological infrastructure creates different context for how we tell our stories and communicate with each other.", "However, the potential negative impact on traditional journalism and mainstream media is yet to be determined."], "tinydolphin:1.1b": [" A blog, also known as a personal online diary or weblog, is a user-generated, self-contained, text-based platform on the internet where users can share their thoughts and experiences with other people.", "Blogs can provide an avenue for individuals to have a say in the world of politics, express themselves creatively, and interact with others from different backgrounds.", "They offer a unique perspective into specific issues or events that may not be covered extensively by traditional media outlets or news sources.", "The blogging movement has been growing in recent years, as more people are using the internet to connect with each other and share their thoughts and ideas.", "In the United States alone, there are estimated to be around five million blogs, with at least an estimated 25% of these being used by individuals who do not belong to any professional journalism or publishing backgrounds.", "This has led to questions about the role of traditional media in reporting on news events and the value of bloggers themselves.", "Some experts argue that mainstream media should lead the discussion and present information, while others suggest that blogs are simply another platform for sharing ideas and opinions with their readers.", "Some bloggers have found success in expanding their readership by offering exclusive content or insights into certain topics.", "For example, Iraqi Salam Pax's blog has gained a substantial following for its honest and critical perspective on political events.", "Another blogger, former Iranian Vice-President Mohammad Ali Abtahi, has been praised for his unique perspective on the US-led war in Iraq and his willingness to share his thoughts with readers worldwide.", "The blogging movement has also inspired a new generation of journalists and content creators.", "With access to more information than ever before and the ability to publish and distribute their work quickly, many individuals are taking the reins from traditional media in reporting on current events and breaking news stories.", "This shift has led to concerns about the role of mainstream media in reporting the news, but it also raises questions about the value of bloggers themselves.", "Some experts argue that blogs have opened up a new world of independent journalism and contributed to the democratization of information, while others suggest that the traditional gatekeeper function is no longer necessary.", "In conclusion, the blogging movement has grown rapidly in recent years, with an estimated five million users sharing their thoughts, opinions, and experiences on the internet.", "However, it remains unclear whether mainstream media should be leading the discussion or if bloggers themselves have a unique role to play in shaping our understanding of current events."], "phi:2.7b": [" The internet has seen the rise of blogs, where people can share their views, pictures, and links on various topics.", "While most blogs may only have a small readership, they provide an avenue for individuals to express their opinions in areas that traditional media often overlooks or ignores.", "Many well-known examples of blog coverage include accounts from Iraqi Salam Pax during the US-led war and Mohammad Ali Abtahi's insights into the Islamic Republic's government.", "Blogging has been growing steadily over many years, with experts noting its impact on politics as audiences have more sources of information than ever before.", "However, there are concerns about traditional media losing power to blogs, but some newspapers like Le Monde offer blogs in their content.", "While it's uncertain whether every human will become a blogger, the number of blogs is expected to continue growing at an exponential rate due to easier blogging tools and the ability for individuals to communicate with each other easily."], "orca-mini:3b": [" Blogs have become an increasingly popular form of communication, allowing individuals to share their views, pictures, and links, as well as reporting on events.", "This year, the focus has been on blogs which provide critical commentary on news events, often writing about issues ignored by traditional media or offering eyewitness accounts of events.", "While some parts of the traditional media have expressed concerns about this emerging competitor, blogs offer a valuable source of information and ideas for many people.", "Blog analysis firm Technorati estimates the number of blogs in existence exceeds five million, and is growing at exponential levels.", "While only a small percentage of people may be creating blogs, they are creating a significant amount of content.", "The blogosphere has become saturated with information, and tools like Google's Blogger, MovableType, and MSN Spaces make it easy to create and update a blog.", "However, few people update their blogs regularly.", "Despite the popularity of blogs, some experts believe that the phenomenon is here to stay, allowing individuals to communicate in new ways and creating a different context for how we tell our stories and interact with each other."], "hermes3:3b": ["Blogs grow as independent news sources, challenging mainstream media; millions now exist & continue to increase in numbers."], "stablelm-zephyr:3b": ["Blogs, or web logs, have grown in popularity with around 5 million reported on the internet, primarily being used as a platform for personal opinions and first-hand event coverage.", "Blogs have become an important source of information for political discussions, leading to concerns over journalistic value among traditional media.", "Some newspapers, like Le Monde, integrate blogs into their content strategy, acknowledging that journalism is in transition.", "The number of blogs continues to grow exponentially, with Technorati estimating the blogosphere to be over five million.", "Although some individuals may not become bloggers, the trend towards individuals publishing, sharing ideas, and exchanging information online is here to stay."], "stablelm2:1.6b": ["Blogs have become popular, often critiquing news events ignored by traditional media and providing firsthand accounts of major events.", "With five million blogs on the web set to grow, communication experts say they've provided a platform for people to contribute to world politics.", "The most well-known examples include Iraq's Salam Pax' war account, Iranian Vice-President Mohammad Ali Abtahi's insights into Iran's government, and US election campaign highlights.", "Blogs have become independent sources of ideas and images circumventing traditional media outlets such as newspapers, TV, and radio.", "Although less than 1% of blogs updated daily, blogs are a growing phenomenon allowing individuals to publish, share ideas, exchange information, comment on current issues or post images or video online easily."], "granite3.1-dense:2b": ["Blogs, initially popularized by individuals sharing personal experiences and views, have evolved into a significant force in news reporting, particularly during major events like the US presidential race and Iraqi war coverage.", "With an estimated five million active blogs and growing, they offer critical perspectives often overlooked by mainstream media.", "Notable examples include Salam Pax's Iraq war diary and Mohammad Ali Abtahi's insights into the Islamic Republic.", "Websites like wikinews.com gather these first-hand reports.", "Communications experts view blogs as an avenue for public involvement in politics, providing independent sources of images and ideas that bypass traditional news outlets such as newspapers, TV, and radio.", "Andrew Nachison, Director of the Media Center, highlights the 2004 US presidential race as a turning point where audiences exercised choice among numerous information sources, with blogs playing a crucial role in this transformation.", "Some traditional media outlets express concern about bloggers' journalistic value, while others embrace them.", "The French newspaper Le Monde offers blogs as part of its content, acknowledging the transition in journalism's mission and function due to societal changes.", "Noam Chomsky shares this view, stating that mainstream media has lost its traditional gatekeeper role.", "The growth of blogs is expected to continue, with tools like Google's Blogger and MovableType making it easier for individuals to create and maintain blogs.", "Technorati estimates the blogosphere has surpassed five million active sites, and a new blog is generated every 5.8 seconds, though less than 40% are updated frequently.", "Despite this rapid expansion, experts concur that the era of easy web publishing and global communication remains, marking a significant shift in how people tell their stories and interact."], "chatgpt-4o-latest": ["Blogs have become a widespread phenomenon, with over five million in existence and growing rapidly.", "They serve various purposes, from personal expression to corporate communication, but their impact on news and politics has been particularly notable.", "Blogs provide alternative perspectives, often covering issues ignored by mainstream media and offering firsthand accounts of events, such as the Iraq war and the US election.", "Experts argue that blogs have shifted the media landscape, allowing audiences to access diverse sources of information and challenging traditional journalism's gatekeeping role.", "While some in mainstream media view blogs as competition, others, like Le Monde, have integrated them into their content.", "The rise of blogs is facilitated by easy-to-use platforms, and while not everyone will become a blogger, the trend is expected to continue, reshaping how people share and consume information."]}