{"raw_text": "Honour for UK games maker\n \n Leading British computer games maker Peter Molyneux has been made an OBE in the New Year Honours list.\n \n The head of Surrey's Lionhead Studios was granted the honour for services to the computer games industry. Mr Molyneux has been behind many of the ground-breaking games of the last 15 years such as Populous, Theme Park, Dungeon Keeper and Black and White. He is widely credited with helping to create and popularise the so-called god-game genre.\n \n Speaking to the BBC News website Mr Molyneux said receiving the honour was something of a surprise. It's come completely out of the blue,\" he said, \"I never would have guessed that I'd have that kind of honour.\" He said he was surprised as much because, not too long ago, many people thought computer gaming was a fad.\n \n \"It was thought to be like skateboarding,\" he said, \"a craze that everyone thought would go away.\" Now, he said, the gaming world rivals the movie industry for sales and cultural influence. \"Britain plays a big part in it,\" he said. \"It's one of the founding nations that made the industry what it is.\" Mr Molyneux has been a pivotal figure in the computer games industry for almost 20 years. His career started at Bullfrog Studios which in 1987 produced Populous one of the first God-games. The title gave players control over the lives a small population of computerised people. Mr Molyneux said that his involvement with the games industry started almost by accident as back in the early days game making was more a hobby than a career. \"I thought everyone would treat Populous as weird,\" he said, \"but it became a huge international success.\" He left Bullfrog in 1997 to set up Lionhead Studios which was behind the ambitous and widely acclaimed game Black & White. One of the next titles to come from Lionhead puts players in charge of a movie studio and tasks them with producing and directing a hit film. The veteran game maker says he has one problem still to solve. \"Being an absolute geek I've got no idea what I'm going to wear when I go and pick it up,\" he said.\n", "llama3.2:1b": ["Peter Molyneux, the head of Lionhead Studios, was made an OBE (Order of the British Empire) in the New Year Honours list for services to the computer games industry.", "He is credited with creating and popularising the god-game genre.", "The award came out of the blue, as many people thought gaming was a fad but now it rivals the movie industry's sales and cultural influence."], "llama3.2:3b": ["Peter Molyneux, head of Lionhead Studios, was made an OBE for services to the computer games industry.", "He is credited with creating and popularizing the god-game genre with titles such as Populous, Theme Park, Dungeon Keeper, and Black and White.", "The gaming world now rivals the movie industry in sales and cultural influence, with Britain playing a significant role in its development."], "gemma2:2b": ["Peter Molyneux, the head of Lionhead Studios, received an OBE in the New Year Honours list for services to the computer games industry.", "He is recognized for his contributions to the god-game genre and popularizing gaming as a major cultural force.", "Molyneux, who started his career at Bullfrog Studios where he developed Populous, has been a key figure in the industry for over two decades."], "qwen2.5:0.5b": ["Peter Molyneux, founder of the British computer games company Lionhead Studios, was recently made an Order of the British Empire (OBE), receiving the honour for services to the computer games industry.", "He has been involved in creating numerous groundbreaking games such as Populous and Dungeon Keeper.", "Mr. Molyneux views his work with the gaming world favorably, describing it as a \"god-game\" genre that is much more popular than skateboarding.", "He notes that the British gaming industry is a significant player in the global gaming landscape.", "Over 20 years ago, he started his career at Bullfrog Studios, where they produced Populous back in 1987.", "The title became a huge international success and inspired a series of titles such as Black & White.", "Mr. Molyneux faces challenges related to fashion, but is confident that he will find suitable clothing when he visits stores."], "qwen2.5:1.5b": ["Peter Molyneux, head of Lionhead Studios in Surrey, received the Order of the British Empire (OBE) for services to computer games industry.", "He's credited with popularizing god-game genre, co-founded Bullfrog Studio which released Populous, and founded Lionhead Studios behind Black & White game."], "qwen2.5:3b": ["Peter Molyneux, head of Lionhead Studios, was made an OBE in the New Year Honours list for services to the computer games industry.", "He is known for creating groundbreaking titles like Populous, Theme Park, Dungeon Keeper, and Black & White, which popularized the god-game genre.", "Recipient said receiving this honor came as a surprise due to misconceptions about gaming's status at the time.", "Molyneux has worked in the industry since 1987 when he started at Bullfrog Studios with Populous.", "He now runs Lionhead Studios and is developing an ambitious game where players manage a movie studio."], "opencoder:1.5b": ["Honour for UK games maker leading British computer games maker Peter Molyneux has been made an OBE in the New Year Honours list, Leading Mr Molyneux behind many of the ground-breaking games of the last 15 years such as Populous, Theme Park, Dungeon Keeper and Black and White.", "He was widely credited with helping to create and popularise the so-called god-game genre, receiving the honour was something of a surprise.", "It's come completely out of the blue, speaking to the BBC News website Mr Molyneux said.", "He played a crucial role in the computer games industry for almost 20 years."], "smollm:1.7b": ["The summary is concise, preserving the key ideas and details of the original text.", "It captures the main points of the text without adding or changing them.", "The summary does not provide explanations, formatting, or reasoning processes as requested in the instruction."], "deepseek-r1:1.5b": ["Peter Molyneux, former head of Surrey’s Lionhead Studios, was made an OBE in New Year Honours after leading the company behind influential computer games like Populous and Black & White, which popularized the god-game genre."], "tinyllama:1.1b": ["The leading British computer games maker Peter Molyneux was awarded the Order of the British Empire (OBE) in the New Year Honours list, honoring his contributions to the industry.", "He is widely regarded as a pioneer of the god-game genre and has been behind several groundbreaking titles, such as Populous, Theme Park, Dungeon Keepers, and Black & White.", "Molyneux also founded Lionhead Studios in 1997, which was behind one of the most popular and acclaimed games in recent years, Black & White.", "In addition to his professional career, Molyneux has been a significant figure in the video game industry for almost 20 years.", "Despite having no idea what he's going to wear when picking up his award, Molyneux is proud of his contributions and believes that creating popular games such as Black & White was the biggest surprise of his career."], "tinydolphin:1.1b": [" Certainly!", "Here is the summary of the provided text: \n\nThe British computer games maker Peter Molyneux has been made an OBE in the New Year Honours list.", "He has been honored for his services to the computer games industry, particularly for his involvement with the game Populous and Theme Park.", "Molyneux has created several influential titles such as Dungeon Keeper and Black & White, which became popular due to their unique gameplay mechanics.", "He was surprised to receive the honor but credited it with helping him create and popularize the \"god-game\" genre in computer gaming.", "Molyneux acknowledged that he had always been a geek who loved technology and games, and he is grateful for being recognized for his contributions to the industry.", "He said he feels lucky to be part of an exciting field where creativity and innovation are constant factors."], "phi:2.7b": [" Leading British computer games maker Peter Molyneux has been awarded the Order of the British Empire (OBE) for his contributions to the industry, which have helped popularize the god-game genre.", "Mr. Molyneux was a founding figure in the industry and has created many successful titles such as Populous, Theme Park, Dungeon Keeper, and Black & White.", "He started his career at Bullfrog Studios and later set up Lionhead Studios, where he produced critically acclaimed games like Black & White.", "While being a pioneer in game making for almost two decades, Mr. Molyneux is still unsure what he will wear to receive the award."], "orca-mini:3b": [" UK computer games maker Peter Molyneux has been made an OBE in the New Year Honours list for his services to the gaming industry.", "Mr Molyneux is a pioneer of the god-game genre and has created many groundbreaking games such as Populous, Theme Park, Dungeon Keeper and Black and White.", "He has played a significant role in the growth of the gaming industry in Britain."], "hermes3:3b": ["Peter Molyneux, UK games developer (Surrey's Lionhead Studios), received OBE in New Year Honours for services to computer games industry.", "Noted for ground-breaking games like Populous, Theme Park, Dungeon Keeper, Black & White."], "stablelm-zephyr:3b": ["Peter Molyneux, a leading British computer games designer, has been awarded an OBE for his services to the computer games industry.", "Over the last 15 years, he has created numerous groundbreaking games including Populous, Theme Park, Dungeon Keeper and Black and White.", "He is credited with helping to create and popularize the \"god-game\" genre.", "Molyneux believes that the gaming world now rivals the movie industry for sales and cultural influence, having started his career in the industry almost accidentally when Bullfrog Studios released Populous in 1987."], "stablelm2:1.6b": ["British computer games developer Peter Molyneux, the head of Lionhead Studios, was awarded OBE (Order of the British Empire) in New Year Honours list for services to the gaming industry.", "He is credited with creating and popularizing the god-game genre.", "Molyneux started his career at Bullfrog Studios which produced Populous, one of the first God- games.", "He left Bullfrog in 1997 to set up Lionhead Studios, which was behind Black & White and a movie studio game yet to be released."], "granite3.1-dense:2b": ["Peter Molyneux, the founder of Surrey's Lionhead Studios and a prominent figure in Britain's computer games industry for nearly two decades, has been appointed an Officer of the Order of the British Empire (OBE) as part of the New Year Honours list.", "Molyneux is recognized for his significant contributions to the gaming world, having created influential titles like Populous, Theme Park, Dungeon Keeper, and Black & White.", "He's credited with popularizing the god-game genre.", "Molyneux expressed surprise at the honor, stating it came out of nowhere, given his past perceptions that computer gaming was a fleeting trend similar to skateboarding.", "However, he observed a remarkable transformation: the gaming industry now rivals the movie industry in terms of sales and cultural impact.", "He emphasized Britain's role as one of its founding nations.", "Molyneux began his career at Bullfrog Studios in 1987, where he developed Populous—one of the first god-games—which became an international success despite initial skepticism about the game's concept.", "In 1997, he founded Lionhead Studios and led its creation of Black & White.", "His next project will reportedly involve managing a movie studio to produce a hit film.", "Despite his long-standing involvement in gaming, Molyneux admits to lacking suitable attire for the OBE ceremony due to being an \"absolute geek.\""], "chatgpt-4o-latest": ["British computer games maker Peter Molyneux has been awarded an OBE for his contributions to the industry.", "As head of Lionhead Studios and previously Bullfrog Studios, he played a key role in developing the god-game genre with titles like Populous, Theme Park, Dungeon Keeper, and Black & White.", "Molyneux expressed surprise at the honour, recalling how gaming was once seen as a passing fad.", "He highlighted Britain's significant role in the industry's growth, which now rivals the movie industry in sales and influence.", "His next project involves a game where players manage a movie studio."]}