{"raw_text": "Search wars hit desktop PCs\n \n Another front in the on-going battle between Microsoft and Google is about to be opened.\n \n By the end of 2004 Microsoft aims to launch search software to find any kind of file on a PC hard drive. The move is in answer to Google's release of its own search tool that catalogues data on desktop PCs. The desktop search market is becoming increasingly crowded as Google, AOL, Yahoo and many smaller firms tout programs that help people find files.\n \n Microsoft made the announcement about its forthcoming search software during a call to financial analysts to talk about its first quarter results. John Connors, Microsoft's chief financial officer said a test version of its desktop search software should be available for download by the end of the year.\n \n \"We're going to have a heck of a great race in search between Google, Microsoft and Yahoo,\" he said. \"It's going to be really fun to follow.\" Microsoft is coming late to the desktop search arena and its software will have to compare favourably with programs from a large number of rivals, many of which have fiercely dedicated populations of users. The program could be based on the software Microsoft owns as a result of its purchase of Lookout Software in early October. On 14 October Google released desktop search software that catalogues all the files on a PC and lets users use one tool to find e-mail messages, spreadsheets, text files and presentations. The software will also find webpages and messages sent via AOL Instant Messenger.\n \n Many other firms have released desktop search systems recently too. Companies such as Blinkx, Copernic, Enfish X1 Technologies and X-Friend all do the same job of cataloguing the huge amounts of information that people increasingly store on their desktop or home computer.\n \n Apple has also debuted a similar search system for its computers called Spotlight that is due to debut with the release of the Tiger operating system. Due to follow are net giants AOL and Yahoo. The latter recently bought Stata Labs to get its hands on search software that people can use. Microsoft is also reputedly working on a novel search system for the next version of Windows (codenamed Longhorn). However this is not likely to appear until 2006. \"The recent activity in the search industry shows that there is a need to move beyond simple keyword-based web search,\" said Kathy Rittweger, co-founder of Blinkx. \"Finding information of our own computers is becoming as difficult as it is to find the relevant webpage amongst the billions that exist.\"\n \n Desktop search has become important for several reasons. According to research by message analysts the Radicati Group up to 45% of the information critical to keeping many businesses running sits in e-mail messages and attachments. JF Sullivan, spokesman for e-mail software firm Sendmail said many organisations were starting to realise how important messaging was to their organisation and the way the work. \"The key thing is being able to manage all this information,\" he said. Also search is increasingly key to the way that people get around the internet. Many people use a search engine as the first page they go to when getting on the net. Many others use desktop toolbars that let them search for information no matter what other program they are using. Having a tool on a desktop can be a lucrative way to control where people go online. For companies such as Google which relies on revenue from adverts this knowledge about what people are looking for is worth huge amounts of money. But this invasiveness has already led some to ask about the privacy implications of such tools.\n", "llama3.2:1b": ["Microsoft plans to release desktop search software by the end of 2004, following Google's release of its own search tool in 2003.", "Microsoft aims to compare its software favorably with existing programs from Google, AOL, and Yahoo, which already offer similar features.", "The company is working on a novel search system for Windows Longhorn, but this is expected to appear in 2006.", "Desktop search has become important for finding critical information such as e-mail messages, attachments, and webpages, and it is used by many organizations due to its ability to control online access."], "llama3.2:3b": ["Microsoft plans to launch desktop search software by the end of 2004, aiming to compete with Google's released tool and other firms' offerings in cataloging data on PCs and helping users find files.", "The move follows Google's release of its own search software in October, as well as announcements from AOL, Yahoo, Apple, and others.", "Desktop search has become important for businesses due to the growing amount of information stored on computers, with up to 45% of critical business information sitting in email messages and attachments."], "gemma2:2b": ["Microsoft plans to launch desktop search software by year's end to compete with Google and other companies offering similar services.", "This move comes in response to Google's release of its desktop search tool, which catalogues files on PC hard drives.", "The market for desktop search is becoming increasingly crowded as many smaller firms also develop such programs.", "Microsoft acknowledges the competitive nature of the industry and will need to prove its software is comparable to other existing options.", "The success of this new software will depend on how well it competes in a market filled with established players, including Apple's Spotlight system and AOL's recent acquisition of search technology.", "Desktop search has become crucial due to the vast amount of information stored digitally.", "The ease of accessing such information is becoming as important as finding relevant content online.", "The industry is increasingly dependent on desktop tools for web navigation, highlighting the potential profits and challenges these technologies bring.", "Privacy concerns arise with the increasing use of these tools, leading to ethical discussions about user data security."], "qwen2.5:0.5b": ["Microsoft aims to launch its desktop search software to compete with Google, while many rivals and companies release similar products.", "The trend towards a desktop search market is increasing as users search for files on their desktop PCs, making it important for firms like Microsoft and others to develop desktop search software to keep pace.", "Many other software companies also offer desktop search systems, including Blinkx, Copernic, Enfish X1 Technologies, and X-Friend, all of which catalog the information stored on a user's computer.", "This trend is driven by various reasons such as increased email usage, awareness about message criticality, need to manage e-mail effectively, value of a desktop search for keeping businesses running, and increasing control over online locations.", "However, there are privacy concerns regarding this market."], "qwen2.5:1.5b": ["Microsoft plans to release search software similar to Google's, aimed at finding files on desktop PCs by year-end.", "This will compete with existing systems and rivals, including Apple's Spotlight, creating a crowded market.", "Microsoft aims to match or surpass competitors' features for download availability.", "The shift reflects the growing importance of digital information management in daily life and business operations."], "qwen2.5:3b": ["Search wars hit desktop PCs.", "By 2004, Microsoft was gearing up to release its own desktop search software in response to Google's similar tool.", "This move intensified competition among major players including Google, AOL, Yahoo, and smaller firms.", "Microsoft aimed for a competitive edge by potentially using acquired Lookout Software technology or leveraging existing features from acquired companies like Blinkx.", "With Apple’s Spotlight and net giants AOL and Yahoo also entering the market, desktop search tools became crucial due to critical information stored in emails and attachments.", "Additionally, having a search tool on a desktop can control user navigation online for companies aiming to capitalize on advertising revenue related to users' search queries."], "opencoder:1.5b": ["\"Desktop search has become important due to its potential for managing and accessing vast amounts of personal information.\"", "According to research by message analysts, the key thing is being able to manage all this information.", "And companies like Google which relies on revenue from adverts this knowledge about what people are looking for is worth huge amounts of money."], "smollm:1.7b": ["The summary should be:\nSummarize the following text concisely, preserving key ideas and details."], "deepseek-r1:1.5b": ["Microsoft is competing with Google in advancing desktop search software, aiming to offer a comprehensive search feature on PC PCs.", "Microsoft plans to release search tools targeting any file on a PC drive by 2004, while competitors like Blinkx, Copernic, Enfish X1 Technologies, and X-Friend also provide similar solutions for cataloguing information.", "The rise of desktop search has become essential for businesses managing critical data like e-mails, attachments, keywords, and keyword searches, with concerns over privacy implications."], "tinyllama:1.1b": ["The search wars between Microsoft and Google are heating up, with Microsoft launching a seafront desktop tool that catalogues all kinds of files on a PC hard drive by the end of 2004.", "The move comes in response to Google's release of its own seafront program that helps users find data on desktop computers.", "Despite competition from smaller firms, Microsoft has set out to launch a heck of a great race between Google and Microsoft.", "The company is also working on a novel search system for the next version of Windows, but it is yet to debut.", "Desktop searche has become increasingly important for businesses that need control over where people go online, with companies like Google using this knowledge to monetize their websites' content.", "However, some are questioning the privacy implications of such tools."], "tinydolphin:1.1b": [" The upcoming search software by Microsoft is set to make waves in the tech industry, as it could challenge Google and AOL’s dominance over desktop searching.", "This software will be available for download by the end of the year and will offer users a seamless experience of finding files on their computer hard drive.", "Microsoft plans to release its own search software in response to Google’s launch of a similar program, which has attracted much attention from tech analysts and users alike.", "This software could be based on Microsoft’s Lookout Software that they purchased earlier this year as part of their acquisition of Lookout Software.", "In comparison to the other search tools in play, Microsoft is seen as having a strong advantage in terms of market share and financial resources.", "The software will compete with desktop searching options from a large number of rivals, such as Google, AOL, Yahoo, and several smaller firms.", "The release date for the software is still unclear, but it is expected to be in late 2004 or early 2005.", "Microsoft will have to compete effectively with its own search product if they are to maintain a strong presence in the desktop search arena.", "As for AOL’s and Yahoo’s software, it is also anticipated that these companies will release their own desktop searching tools in response to Microsoft’s launch.", "However, this situation may be more complex than initially anticipated, with a number of other firms already offering desktop searching services.", "In conclusion, the upcoming search software by Microsoft is expected to have significant implications for both the tech industry and its users.", "With Google's release of their own search tool just months prior, it is clear that the race to capture this increasingly vital piece of the internet's digital pie has begun."], "phi:2.7b": [" Microsoft plans to launch desktop search software by the end of 2004, competing with Google's existing search tool that catalogues data on PC hard drives.", "The market for desktop searches is becoming crowded as many firms, including Google and Yahoo, offer programs that help people find files and webpages.", "Microsoft will have to compete against these established rivals, some of whom have dedicated populations of users.", "Apple has also launched a desktop search system called Spotlight, due to appear with the Tiger operating system.", "Desktop searches are important because they allow businesses to manage critical information stored in e-mail messages and attachments, and many people use search engines as their first port of call on the internet.", "However, some people have raised concerns about privacy implications of such tools."], "orca-mini:3b": [" Microsoft plans to release a desktop search software by the end of 2004, targeting Google's recent release of its own search tool that catalogs files on PC hard drives.", "The software will have to compete with other firms such as Blinkx, Copernic, Enfish X1 Technologies, and X-Friend that offer similar search tools.", "Microsoft made the announcement during a call to financial analysts, stating that a test version of its search software should be available for download by the end of the year.", "Many companies have released desktop search systems recently, including Google, AOL, Yahoo, and Stata Labs, which was bought by Yahoo.", "Desktop search has become important because many businesses rely on information in e-mail messages and attachments, and search is becoming more important to people getting around the internet.", "Companies such as Google make revenue from adverts based on people's searches, and privacy concerns have emerged over such tools."], "hermes3:3b": ["Microsoft enters desktop search market against Google, other firms; aims to rival programs for finding files and managing info on PCs."], "stablelm-zephyr:3b": ["Microsoft and Google are competing in the desktop search market, with Microsoft set to launch its own search software by the end of 2004 in response to Google's existing tool that catalogs data on desktop PCs.", "Other companies, including AOL, Yahoo, Apple, Blinkx, Copernic, Enfish X1 Technologies, and X-Friend also offer desktop search systems.", "The increasing popularity of desktop search has been driven by the large amounts of information stored on home or work computers, with up to 45% of critical data according to message analysts.", "While desktop search is important for companies like Google which relies on ad revenue, privacy concerns have emerged."], "stablelm2:1.6b": ["Microsoft plans to release search software by the end of 2007 that will find any file on a PC's hard drive, in response to Google's release of its own desktop search tool that catalogs data on desktop PCs.", "This marks the third major player entering an already crowded market, which includes AOL, Yahoo, Blinkx, Copernic, Enfish X1 Technologies, and X- Friend among others.", "Desktop search has become important due to the large amounts of information stored on computers, as well as its increasing role in online navigation and revenue for companies like Google."], "granite3.1-dense:2b": ["Microsoft plans to release a desktop search software by year-end 2004, responding to Google's 2003 launch of a similar tool that catalogs and allows users to find various types of files on desktop PCs.", "This move follows the entry of numerous competitors into the rapidly growing desktop search market, including AOL, Yahoo, Blinkx, Copernic, Enfish X1 Technologies, X-Friend, and Apple's Spotlight for Mac computers.", "The software will compete with existing solutions from these firms, many of which have devoted user bases.", "Microsoft is reportedly basing its new tool on Lookout Software it acquired in October 2004.", "The significance of desktop search lies in the increasing importance of managing personal and organizational data stored on desktops, as up to 45% of crucial business information resides in emails and attachments.", "This feature also enhances users' internet navigation by enabling quick searches within their preferred applications or browser toolbars.", "However, the proliferation of such tools raises privacy concerns due to potential access to user browsing history and content."], "chatgpt-4o-latest": ["Microsoft plans to launch desktop search software by the end of 2004 to compete with Google's recently released tool that catalogs PC files.", "The desktop search market is becoming crowded, with companies like AOL, Yahoo, and Apple also developing similar tools.", "Microsoft's software may be based on technology from its recent acquisition of Lookout Software.", "The growing importance of desktop search is driven by the increasing volume of stored digital information, particularly in emails and attachments.", "Search tools are also valuable for companies like Google, which rely on advertising revenue linked to user search behavior.", "However, concerns about privacy implications have been raised regarding these tools."]}