{"raw_text": "Podcasts mark rise of DIY radio\n \n An Apple iPod or other digital music players can hold anything up to 10,000 songs, which is a lot of space to fill.\n \n But more and more iPod owners are filling that space with audio content created by an unpredictable assortment of producers. It is called \"podcasting\" and its strongest proponent is former MTV host and VJ (video jockey) Adam Curry. Podcasting takes its name from the Apple iPod, although you do not need an iPod to create one or to listen to a podcast. A podcast is basically an internet-based radio show which podcasters create, usually in the comfort of their own home. They need only a microphone, a PC, and some editing software. They then upload their shows to the internet and others can download and listen to them, all for free. Using technology based on XML computer code and RSS - Really Simple Syndication - listeners can subscribe to podcasts collected automatically in a bit of software, which Mr Curry has pioneered. The latest MP3 files of shows can then be picked up by a music playing device automatically.\n \n Mr Curry records, hosts, edits and produce a daily, 40 minute podcast called The Daily Source Code. He wants to make podcasting \"the Next Big Thing\" and says it is an extension of his childhood love of radio gadgetry. \"I was always into technologies and wires,\" he explains. \"My parents gave me the Radio Shack 101 project kit, which allows you to build an AM transmitter and subsequently an FM transmitter. \"I had my mom drive me around the block, see how far it would reach on the car radio.\"\n \n Mr Curry is American, but he grew up in the Netherlands where he hosted illegal, pirate radio shows in the Dutch capital. He tried university in the US, and ended up back in Holland where he hosted a music video show. He spent the next seven years in New York where he worked at MTV hosting the Top 20 Video Countdown, but spent most of his hours tinkering with this new thing called the internet. \"At a certain point in 1995, I was driving in on a Friday afternoon, beautiful blue sky, one of those beautiful days thinking, this is so stupid. \"You know, I'm going do the Top 20 Countdown, take the cheque, go home, and sit on the internet until three in the morning. \"So, after I finished the show, I quit. I said, on air, it's been great, I've been here for seven years at that point, there's something on the internet, I've got to go find it, and I'll see you later.\"\n \n But Mr Curry's technology and broadcast interests started to gel a couple of years ago when computer storage was growing exponentially and high-speed internet connections were becoming more widely available. The MP3 format also meant that people could create and upload audio more cheaply and efficiently than ever before.\n \n Most importantly, Mr Curry says, people across the globe were bored with the radio they were hearing. \"Listen to 99% of the radio that you hear today, it's radio voices, and it's fake, it's just fake.\" He wanted to make it easier for people to find \"real voices\" on the internet. He wanted software that would automatically download new audio content directly onto players like, iPods. Mr Curry is not a computer programmer, so he asked others to create one for him. No one did, so he tried to write one himself. He finished it a few months ago and says it \"totally sucked.\" He put it up on the net as open source software and now dozens of coders and audio junkies are refining it; the result is a work in progress called \"ipodder\". Doug Kaye, a California-based podcaster, praises the former MTV VJ for what he has done. \"Adam created a simple script that solved what we call the last mile problem. Ipodder takes audio from the web and brings it all the way down to the MP3 player,\" he explains. \"People can wake up in the morning, pick up their iPods as they go to work or before they go exercise, and discover that there's all this new content automatically put onto their players.\" It is created an explosion in podcasting content and podcasters are springing up in Australia, Finland, Brazil, even Malaysia. One couple broadcasts theirs, The Dawn and Drew Show, from Wisconsin in the US, sometimes even from the comfort of their own bed. Topics range from the comfort of their bed, to the latest films or music and have thousands of listeners.\n \n Already, websites are springing up that point listeners in the right direction of good podcasts.\n \n Chris McIntyre runs Podcast Alley and says that there are good sites out there but that not everyone has the technological know-how to simply listen. \"If I were to tell my mom, or my mother-in-law to copy an XML or RSS file to their podcast aggregator, they would think I was speaking a foreign language,\" Mr McIntyre says. Along with technical challenges, there may be legal challenges to podcasters who air their favourite, albeit copyrighted, music. Some in podcasting also worry that too much attention may turn what they see as the \"anti-radio\" into something that is more like conventional broadcasting. Already there is interest in podcasting from the corporate world. Heineken is doing its own podcast now, and so is Playboy. For his part, Adam Curry's pressing ahead with his own vision of what podcasting should be. He loves doing The Daily Source Code because it is about introducing good music and cool ideas to new audiences. He has even been called the Ed Sullivan or Johnny Carson of podcasting which, he says, \"is a badge I'll wear with great honour. \"To be the Johnny Carson, or Ed Sullivan of anything is wonderful. And you know what? You don't need a hell of a lot of talent. \"You just have to be nice, have your ears open, and let people shine. And that's good for me.\"\n \n Clark Boyd is technology correspondent for The World, a BBC World Service and WGBH-Boston co-production.\n", "llama3.2:1b": ["Podcasts allow DIY radio to rise with the help of audio content created by producers\nApple iPods can hold up to 10,000 songs, but this space is being filled with free audio content from podcasters\nPodcasting takes its name from Apple's iPod, although no one needs an iPod to create or listen to a podcast\nAdam Curry, a former MTV host and VJ, started podcasting in the Netherlands and later moved to New York\nHe created The Daily Source Code, which is now part of ipodder software that automatically downloads new audio content onto MP3 players\nPodcasting has sparked an explosion in content creation, with listeners discovering new shows through podcasts\nWebsites are also pointing people in the right direction, such as Podcast Alley\nHowever, there may be technical and legal challenges to podcasters who air copyrighted music"], "llama3.2:3b": ["Podcasting has become popular with the rise of digital music players, allowing users to create and download audio content from the internet.", "Adam Curry, former MTV host, pioneered this concept, which he calls \"the Next Big Thing.\"", "Podcasting uses XML computer code and RSS to enable automatic downloads onto devices such as iPods.", "The technology has led to an explosion in podcasting content, with listeners in Australia, Finland, Brazil, and Malaysia tuning in to shows on topics ranging from music and films to everyday life.", "However, technical challenges, legal issues, and the potential for commercialization threaten the growth of this format, with interest already from corporate brands like Heineken and Playboy."], "gemma2:2b": ["Podcast is an internet-based radio show created by producers who upload audio content to the internet, which can be downloaded on devices like iPods.", "This new form of broadcasting, popularized by former MTV host Adam Curry, allows for a more personal and less \"fake\" radio experience.", "Podcasting has become increasingly accessible thanks to advancements in technology (digital music players, high-speed internet) and software tools created to facilitate easy access.", "This accessibility has spurred the growth of podcast content creators across the globe.", "Some podcasters share their shows through websites that offer curated lists of podcasts for listeners with varying levels of technical expertise.", "Meanwhile, major corporations like Heineken and Playboy are jumping on the podcasting bandwagon.", "The format continues to evolve as it attracts attention from diverse audiences, including those seeking more original and authentic content, while also sparking interest from corporate sponsors."], "qwen2.5:0.5b": ["Podcasts are an increasingly popular alternative to traditional radio listening, with more than 250 million people accessing podcasts each month, according to Nielsen.", "Podcasts take the form of online radio shows that can be listened to from any device, making it easier for people to discover new content and connect with their favorite topics.", "Adam Curry is a former MTV host and VJ who has pioneered podcasting and created an open-source software called iPodder, which allows users to automatically download new audio content onto players like iPods.", "Podcasts offer a convenient way to access diverse and often unfamiliar themes such as music, films, science and history.", "They have helped to spark a resurgence in independent media production and have allowed more people to discover niche topics that they might not otherwise hear about.", "However, podcasting is still seen as a niche activity and may struggle with the same technological and legal challenges faced by traditional radio.", "Podcasts are gaining popularity across a range of industries including business, education, technology and entertainment.", "The rise of podcasting has led to an explosion in podcast content and more than 300 podcasts have been released each day on Apple Music alone since its launch last year.", "Podcasters are springing up all over the world with dozens of independent sites and content creators sharing their favorite podcasts.", "Podcasts offer a cost-effective alternative to traditional radio, allowing users to discover new music and stories without the need for expensive equipment.", "They have also allowed more people to experience niche topics that they might not otherwise hear about, making it easier to engage with different communities online."], "qwen2.5:1.5b": ["Podcasts, inspired by Apple iPods, allow users to create, host, edit, and produce their own audio content freely online without needing an expensive player or special software.", "Former MTV VJ Adam Curry's Daily Source Code podcast exemplifies this trend.", "Podcasting has grown due to increased digital storage capacity, improved internet speeds, and the MP3 format's lower cost of production.", "It caters to a growing market tired of radio's artificiality and offers users convenience via devices like iPods that automatically sync new content upon startup.", "The technology has led to an explosion in podcast creation, with thousands of listeners across various topics including music, film, and personal experiences.", "Podcasting also attracts interest from the corporate world and even potential celebrities such as Johnny Carson or Ed Sullivan."], "qwen2.5:3b": ["Podcasting has become popular as more digital music players offer extensive storage space, allowing users to create their own radio shows from home using basic equipment like microphones, computers, and editing software.", "Former MTV host Adam Curry is a leading figure in the movement; he created The Daily Source Code daily podcast for free listening and downloading via RSS feeds.", "Technology improvements such as the MP3 format made audio creation and uploading more accessible.", "Curry’s innovations have led to development of software like \"ipodder\" by Doug Kaye, allowing listeners to automatically download new content onto their devices.", "Podcasting has expanded globally, with various formats and topics attracting thousands of listeners.", "Despite challenges, including legal issues over copyrighted material, podcasters continue to innovate and attract corporate sponsors.", "Curry envisions podcasting as a means to introduce good music and ideas to new audiences, comparing himself favorably to iconic broadcast personalities like Johnny Carson or Ed Sullivan."], "opencoder:1.5b": ["Podcasts mark rise of DIY radio \n\nAn Apple iPod or other digital music players can hold anything up to 10,000 songs, which is a lot of space to fill.", "But more and more iPod owners are filling that space with audio content created by an unpredictable assortment of producers.", "It's called \"podcasting\" and its strongest proponent is former MTV host and VJ (video jockey) Adam Curry.", "Podcasts take its name from the Apple iPod, although you do not need an iPod to create one or to listen to a podcast.", "A podcast is basically an internet-based radio show which podcasters create, usually in the comfort of their own home.", "They need only a microphone, a PC, and some editing software.", "They then upload their shows to the internet and others can download and listen to them, all for free.", "Using technology based on XML computer code and RSS - Really Simple Syndication - listeners can subscribe to podcasts collected automatically in a bit of software, which Mr Curry has pioneered.", "The latest MP3 files of shows can then be picked up by a music playing device automatically.", "Mr Curry records, hosts, edits and produce a daily, 40 minute podcast called The Daily Source Code.", "He wants to make podcasting \"the Next Big Thing\" and says it is an extension of his childhood love of radio gadgetry.", "\"I was always into technologies and wires,\" he explains.", "\"My parents gave me the Radio Shack 101 project kit, which allows you to build an AM transmitter and subsequently an FM transmitter. \"", "Mr Curry is American, but he grew up in the Netherlands where he hosted illegal, pirate radio shows in the Dutch capital.", "He tried university in the US, and ended up back in Holland where he hosted a music video show.", "He spent the next seven years in New York where he worked at MTV hosting the Top 20 Video Countdown, but spent most of his hours tinkering with this new thing called the internet.", "\"At a certain point in 1995, I was driving in on a Friday afternoon, beautiful blue sky, one of those beautiful days thinking, this is so stupid.", "\"You know, I'm going do the Top 20 Countdown, take the cheque, go home, and sit on the internet until three in the morning.", "\"So, after I finished the show, I quit.", "I said, on air, it's been great, I've been here for seven years at that point, there's something on the internet, I've got to go find it, and I'll see you later.\"", "But Mr Curry's technology and broadcast interests started to gel a couple of years ago when computer storage was growing exponentially and high-speed internet connections were becoming more widely available.", "The MP3 format also meant that people could create and upload audio more cheaply and efficiently than ever before.", "Most importantly, Mr Curry says, people across the globe were bored with the radio they were hearing.", "\"Listen to 99% of the radio that you hear today, it's radio voices, and it's fake, it's just fake.\"", "He wanted to make it easier for people to find \"real voices\" on the internet.", "He wanted software that would automatically download new audio content directly onto players like, iPods.", "Mr Curry is not a computer programmer, so he asked others to create one for him.", "No one did, so he tried to write one himself.", "He finished it a few months ago and says it's about introducing good music and cool ideas to new audiences.", "He has even been called the Ed Sullivan or Johnny Carson of podcasting which, he says, \"is a badge I'll wear with great honour.", "\"To be the Johnny Carson, or Ed Sullivan of anything is wonderful.", "And you know what?", "You don't need a hell of a lot of talent. \"", "Chris McIntyre runs Podcast Alley and says that there are good sites out there but that not everyone has the technological know-how to simply listen.", "He likes doing The Daily Source Code because it is about introducing good music and cool ideas to new audiences.", "He has even been called the Ed Sullivan or Johnny Carson of podcasting which, he says, \"is a badge I'll wear with great honour.", "\"To be the Johnny Carson, or Ed Sullivan of anything is wonderful.", "And you know what?", "You don't need a hell of a lot of talent."], "smollm:1.7b": ["The rise of podcasting has been phenomenal in recent years, with millions of listeners tuning into their favorite shows every day.", "But what exactly is podcasting?", "And how does it differ from traditional radio broadcasting?", "Let's dive in and explore the world of podcasting!", "**What is Podcasting?", "**\n\nPodcasting is a digital audio content delivery format that allows creators to upload and distribute audio files on the internet, enabling listeners to access their content at any time and on any device with an internet connection.", "The term \"podcasting\" was coined in 2004 by Adam Curry and Jamie Hyneman, two popular YouTubers who created a podcasting platform called iPodder.", "**How does Podcasting work?", "**\n\nHere's a step-by-step explanation of the podcasting process:\n\n1.", "**Content creation**: A podcaster creates audio content, such as music, talk shows, interviews, or educational programs, and records it using a digital audio workstation (DAW) like Audacity or Adobe Audition.", "2.", "**Audio file preparation**: The podcaster prepares the audio file by editing, mixing, and formatting it for distribution on the internet.", "3.", "**Distribution**: The podcast is uploaded to a podcast hosting platform, such as Anchor, Buzzsprout, or Libsyn, which provides storage, bandwidth, and analytics.", "4.", "**Listener access**: Listeners can access the podcast through various platforms, including Apple Podcasts, Spotify, Google Podcasts, and Stitcher.", "5.", "**Playback**: Listeners can play back their favorite episodes on their devices using an app like Mobile apps or desktop software.", "**Key differences between Podcasting and Traditional Radio Broadcasting:**\n\n1.", "**Distribution**: Podcasting is distributed through the internet, whereas traditional radio broadcasting is limited to a specific geographic area (e.g., a city or region).", "2.", "**Content format**: Podcasts can feature various content formats, such as music, talk shows, interviews, or educational programs, while traditional radio broadcasts are typically music-centric.", "3.", "**Accessibility**: Listeners can access podcasts on-demand from anywhere with an internet connection, whereas traditional radio broadcasting requires a physical presence at a specific time and location.", "4.", "**Monetization**: Podcasters often rely on advertising, sponsorships, or listener support to monetize their content, while traditional radio broadcasters typically generate revenue through subscription fees (e.g., AMPS).", "5.", "**Creative control**: Podcasters have more creative control over their content and production process, as they can experiment with new formats, styles, and topics without needing approval from a traditional media company.", "6.", "**Interactivity**: Podcasts often encourage listener engagement through comments, social media, or live events, whereas traditional radio broadcasting typically features pre-recorded content with little interaction from the audience.", "7.", "**Technical requirements**: Podcasting requires more technical expertise and infrastructure than traditional radio broadcasting, as podcasters need to manage their own audio production, hosting, and distribution processes.", "**Benefits of Podcasting:**\n\n1.", "**Increased reach**: Podcasting allows creators to reach a global audience without the need for expensive advertising or physical media.", "2.", "**Cost-effective**: Podcasting is often more cost-effective than traditional radio broadcasting, as podcasters can produce content on a lower budget and rely on digital distribution channels.", "3.", "**Flexibility**: Podcasting offers greater flexibility in terms of content format, style, and production quality, allowing creators to experiment with new formats and ideas.", "4.", "**Niche targeting**: Podcasting enables creators to target specific niches or communities that may not be well-represented by traditional radio broadcasting.", "5.", "**Community building**: Podcasting can foster a sense of community among listeners, who can engage with each other through social media and online forums.", "In conclusion, podcasting is a unique and powerful medium that offers creators more control over their content and audience than traditional radio broadcasting.", "By understanding the basics of podcasting, you can start creating your own show and reaching a wider audience!"], "deepseek-r1:1.5b": ["Podcasts are gaining popularity as they become more accessible with digital technology.", "Earlier, storage was a limitation, but now with MP3 files being affordable and faster to download, people can create audio content easily.", "Adam Curry, a former radio host, started \"The Daily Source Code,\" an podcast that mixes traditional interviews with his own voice, made possible by the Apple iPod.", "He has become a significant figure in podcasting, influencing tech companies and personal use.", "Podcasters are growing in places like Australia, Finland, Brazil, and Malaysia, while legal challenges remain for copyright issues and avoiding traditional broadcasts.", "Curry's success lies in making it easy to find \"real voices\" through automatic content generation on players like the iPod."], "tinyllama:1.1b": ["The podcasting trend has become the Next Big Thing in the digital world with its strongest propenment, \"former MTV host Adam Curry,\" pioneering it as an extension of childhood love for radio and gadietry.", "The latest MP3 files of shows can be picked up by any music playing device automatically, and podcasts are being created \"totaling a simple script that solved what we call the last mile problem,\" with the advent of a work in progress called iPodder that takes audio from the web and brings it all the way down to MP3 players.", "The recent surge in podcasting content has already sparked interest among corporations, while the challenges surrounding copyrighted music may keep some potential podcasters at bay.", "Clark Boyde is a technology correspondent for The World, BBC and WGBH-Boston co-production."], "tinydolphin:1.1b": [" Summarizing the text: Podcasting has grown exponentially in popularity, thanks to technological advancements and internet connectivity.", "It allows users to listen to audio content created by an unpredictable assortment of producers.", "Adam Curry is a former MTV host and VJ, who started creating podcasts using XML computer code and RSS (Really Simple Syndication).", "He now pioneers the use of technology-based radio shows in his own podcast, \"The Daily Source Code.\""], "phi:2.7b": [" Podcasting is an internet-based radio show created by podcasters who can upload their shows for free on the web.", "Apple iPod users can download podcasts automatically using software like ipodder.", "There are hundreds of podcasters across the globe broadcasting various topics, such as music and films, to thousands of listeners.", "Some corporations have also started creating podcasts, and there may be legal challenges regarding copyrighted material.", "However, podcasting is gaining popularity because it allows good ideas and music to reach new audiences.", "Adam Curry sees himself as a Johnny Carson or Ed Sullivan of podcasting, and believes that anyone can succeed by being nice and allowing people to shine."], "orca-mini:3b": [" Podcasting has emerged as an extension of Adam Curry's childhood love of radio gadgetry.", "He hosts and edits a daily podcast called The Daily Source Code, which has gained popularity among listeners who are looking for alternative content to traditional radio.", "Mr Curry wants to make podcasting \"the Next Big Thing\" and sees it as an extension of his childhood love of radio gadgetry.", "He recorded, hosted, and produced the show manually until recently when he found out that there was a software available which could automate the process.", "Podcasts can be found on various platforms like the internet, mobile devices, or even car radios.", "The technology is still evolving but it has already become an alternative to traditional radio."], "hermes3:3b": ["Podcasting, DIY radio via digital audio content created by home-based producers using computers and internet."], "stablelm-zephyr:3b": ["Podcasting, founded by former MTV host Adam Curry, is gaining popularity as an internet-based radio show that allows creators to produce content using simple tools like microphones, PCs, and editing software.", "Listeners can subscribe to podcasts through XML computer code and RSS, making it easy for content to be downloaded and played on devices like the Apple iPod or any music player with an MP3 file capability.", "The increasing accessibility of high-speed internet connections and affordable audio creation tools has led to a rise in podcasting content, with podcasters emerging from various countries including Australia, Finland, Brazil, and Malaysia.", "Legal challenges may arise regarding copyrighted music used within podcasts, while corporate entities like Heineken and Playboy have also entered the podcasting space.", "Adam Curry continues to be an advocate for podcasting, creating The Daily Source Code as a platform to showcase new music and ideas to audiences."], "stablelm2:1.6b": ["Podcasting has become popular among iPod owners who create audio content in their homes using only a microphone, PC, and editing software.", "Adam Curry is the strongest proponent of podcasting, which takes its name from Apple's iPod.", "Podcasts are internet-based radio shows where producers create content, usually in the comfort of their own home.", "XML computer code and RSS - Really Simple Syndication - allow listeners to subscribe to podcasts automatically.", "The ipodder software, created by others, allows audio content downloaded from the web to be automatically put onto MP3 players.", "The rise of podcasting has led to an explosion in content and podcasters across various countries.", "There are also websites that help listeners discover good podcasts.", "Some legal challenges exist for copyrighted music used in podcasts, but many worry about turning podcasting into conventional broadcasting.", "Corporate interest is growing, with companies like Heineken and Playboy creating their own podcasts."], "granite3.1-dense:2b": ["Podcasting, an internet-based radio format, has emerged as a significant trend driven by individuals like former MTV host Adam Curry.", "Podcasts are created using only a microphone, PC, editing software, and web uploading capabilities, allowing creators to distribute content free of charge.", "Curry pioneered \"ipodder,\" open-source software that automatically downloads new podcast episodes onto digital music players like iPods.", "This technology has popularized podcasts globally, with content ranging from music, news, and personal discussions.", "Podcasting caters to those dissatisfied with mainstream radio by offering \"real voices\" and diverse content.", "Despite potential legal challenges and the need for user-friendly interfaces, podcasting continues to grow, attracting both amateur and corporate creators, including Heineken and Playboy.", "Podcasters like Adam Curry emphasize accessibility, inclusivity, and the power of good content over conventional broadcasting."], "chatgpt-4o-latest": ["Podcasting, a form of internet-based radio, is gaining popularity as individuals create and share their own audio content.", "Former MTV VJ Adam Curry is a key advocate, producing a daily podcast called The Daily Source Code.", "Podcasting allows anyone with a microphone, PC, and editing software to record and distribute shows online for free.", "Using XML and RSS technology, listeners can subscribe to podcasts, which are automatically downloaded to their devices.", "Curry, who has a background in radio and internet technology, developed an open-source software called \"ipodder\" to simplify podcast distribution.", "His efforts have contributed to a global rise in podcasting, with creators emerging from various countries.", "While podcasting faces technical and legal challenges, it is attracting corporate interest from companies like Heineken and Playboy.", "Curry remains committed to his vision of podcasting as a platform for discovering new music and ideas, embracing his role as a key figure in the movement."]}