{"raw_text": "Viewers to be able to shape TV\n \n Imagine editing Titanic down to watch just your favourite bits or cutting out the slushier moments of Star Wars to leave you with a bare bones action-fest.\n \n Manipulating your favourite films to make a more personalised movie is just the beginning of an ambitious new 7.5m euro (£5.1m) project funded by the European Union. New Media for a New Millennium (NM2) will have as its endgame the development of a completely new media genre, which will allow audiences to create their own media worlds based on their specific interests or tastes. Viewers will be able to participate in storylines, manipulate plots and even the sets and props of TV shows. BT is one of 13 partners involved in the project. It will be contributing software that was originally designed to spot anomalies in CCTV pictures. The software uses content recognition algorithms. The three-year project will work on seven productions as it develops a set of software tools that will allow viewers to edit content to their needs.\n \n One of the productions will be a experimental television show where the plot will be driven by text messages from the TV audience.\n \n Participants will text selected words which will impact how the characters in the drama interact. It is being developed in Finland and will be shown to Finnish TV audiences. Another team will work on the BBC's big budget drama of Mervyn Peake's gothic fantasy Gormenghast. It will be re-engineered to allow people to choose a variety of edited versions. \"The BBC is allowing us access to the material so that we can prove the technology and the principles,\" explained Dr Doug Williams of BT, who will be NM2's technical project manager. \"The TV at the moment is a relatively dumb box which receives signals. This project is about teaching the machine to look at content like Lego blocks that can be reassembled to make perfect sense,\" he said. \"At the moment we have interactive gaming and a limited form of interactive TV which usually means allowing audiences to vote on shows. We are hoping to occupy the space in-between,\" he added.\n \n NM2's co-ordinator Peter Stollenmayer explained that the new genre would radically alter the role of the audience.\n \n \"Viewers will be able to interact directly with the medium and influence what they see and hear according to their personal tastes and wishes,\" he said. \"Media users will no longer be passive viewers but become active engagers.\" It will also be important that the tools are sophisticated enough to obey the complex rules of cinematography and editing said John Wyver, from TV producer Illuminations Television Limited, which is also involved in the project. \"It's not just a matter of stringing together the romantic or action portions of a production,\" said Mr Wyver. \"The tool has to know which bits fit together both visually, by observing the time-honoured rules that go in editing, and in terms of the story.\" \"Only then will the personalised version both make sense and be aesthetically pleasing,\" he added. Mr Wyver is planning a production entitled The Golden Age, about Renaissance art. It will allow viewers to create a so-called media world based on their own specific areas of interest such as poetry, music and architecture. Other productions that the NM2 team will make range from news, documentaries to a romantic comedy drama.\n", "llama3.2:1b": ["Viewers will be able to shape TV by editing favourite bits or cutting out slushier moments.", "The European Union is funding a project called New Media for a New Millennium (NM2) with 13 partners, including BT, which contributes software that uses content recognition algorithms to allow viewers to edit content to their needs.", "A production of a experimental television show will be developed using text messages from the audience, and another TV drama will be re-engineered to allow people to choose edited versions.", "Dr Doug Williams, technical project manager for BT, says the technology allows the machine to look at content like Lego blocks to make sense.", "The new genre will change the role of the audience, making them active engagers who can interact directly with the medium and influence what they see and hear according to their personal tastes and wishes.", "The tools must obey complex rules of cinematography and editing, and be able to know which parts fit together both visually and in terms of the story."], "llama3.2:3b": ["The New Media for a New Millennium project aims to develop new software tools allowing audiences to edit and manipulate TV content according to their personal tastes.", "The 7.5m euro project is funded by the European Union and involves seven productions, including an experimental show where text messages from viewers drive the plot.", "Viewers will be able to participate in storylines, manipulate plots and sets, and influence what they see and hear.", "The goal is to create a new media genre that allows audiences to become active engagers rather than passive viewers."], "gemma2:2b": ["The European Union funded project \"New Media for a New Millennium\" (NM2) aims to develop new media genre allowing audiences to create personalized TV experiences.", "The project involves re-engineering existing shows like Gormenghast and creating interactive television programs where viewers can directly influence storylines, settings and edits using text messages or other input methods.", "It's expected this new technology will transform viewers from passive audience members into active creators of their own media world, with tools that understand the complex rules of filmmaking and editing for a personalized viewing experience.", "NM2 includes projects ranging from news to romantic comedies, all demonstrating the potential for viewer-driven content creation in television."], "qwen2.5:0.5b": ["The European Union is funding an ambitious new TV project known as \"7.", "5m euro\" (£5.", "1m) with BT.", "The aim of the project is to develop a new media genre where viewers can edit their own content and stories based on personal preferences, much like editing movies or TV shows.", "The goal is to create a completely new kind of media that allows audiences to shape what they see and hear according to their individual tastes.", "One of the projects will be an experimental television show where the plot is driven by text messages from viewers, and another one is a BBC drama set in a Gothic fantasy world.", "The NM2 project's technical coordinator explains that this new genre would completely change the role of the audience and provide interactive tools for the media to influence content according to individual tastes."], "qwen2.5:1.5b": ["The European Union-funded project New Media for a New Millennium (NM2) aims to develop software tools enabling viewers to create personalized media content based on their interests or tastes, contributing to an entirely new form of interactive entertainment.", "Projects involve creating experimental TV shows and re-engineering existing dramas like Gormenghast.", "The technology uses advanced image recognition algorithms from BT's software originally designed for CCTV anomaly detection.", "The goal is to make the medium more active by allowing users direct engagement with media content, significantly altering the role of audiences in media consumption."], "qwen2.5:3b": ["Viewers can shape TV through an EU-funded project (NM2) aimed at developing a new media genre where audiences create personalized media worlds based on their interests.", "The project involves editing existing films and creating interactive shows like \"The Golden Age,\" which allows viewers to customize a production based on personal areas of interest such as poetry, music, or architecture.", "Partners include BT contributing software for anomaly detection in CCTV data, allowing viewers to manipulate sets and plots.", "Another production will feature a storyline driven by text messages from audiences, changing how characters interact.", "The goal is to transform passive TV viewers into active participants who can influence media content according to their personal preferences."], "opencoder:1.5b": ["Viewers to be able to shape TV.", "Imagine editing Titanic down to watch just your favourite bits or cutting out the slushier moments of Star Wars to leave you with a bare bones action-fest.", "Manipulating your favourite films to make a more personalised movie is just the beginning of an ambitious new 7.5m euro (£5.1m) project funded by the European Union.", "New Media for a New Millennium (NM2) will have as its endgame the development of a completely new media genre, which will allow audiences to create their own media worlds based on their specific interests or tastes.", "One of the productions will be an experimental television show where the plot will be driven by text messages from the TV audience.", "Participants will text selected words which will impact how the characters in the drama interact.", "It is being developed in Finland and will be shown to Finnish TV audiences.", "Another team will work on the BBC's big budget drama of Mervyn Peake's gothic fantasy Gormenghast.", "It will be re-engineered to allow people to choose a variety of edited versions.", "The BBC is allowing us access to the material so that we can prove the technology and the principles, explained Dr Doug Williams of BT, who will be NM2's technical project manager.", "The TV at the moment is a relatively dumb box which receives signals.", "This project is about teaching the machine to look at content like Lego blocks that can be reassembled to make perfect sense.", "We are hoping to occupy the space in-between, \"Viewers will be able to interact directly with the medium and influence what they see and hear according to their personal tastes and wishes,\" he said.", "Media users will no longer be passive viewers but become active engagers.", "The tools are sophisticated enough to obey the complex rules of cinematography and editing said John Wyver, from TV producer Illuminations Television Limited, which is also involved in the project.", "\"It's not just a matter of stringing together the romantic or action portions of a production,\" he said.", "The tool has to know which bits fit together both visually, by observing the time-honoured rules that go in editing, and in terms of the story.", "Only then will the personalised version both make sense and be aesthetically pleasing, \"The Golden Age, about Renaissance art.", "It will allow viewers to create a so-called media world based on their own specific areas of interest such as poetry, music and architecture.\"", "Other productions that the NM2 team will make range from news, documentaries to a romantic comedy drama."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details.", "The main points are:\n\n1.", "A new media genre where viewers can shape TV content to their own preferences or cut out the slushier moments of Star Wars.", "2.", "A project funded by the European Union that will develop software tools for manipulating TV shows to create a new media genre.", "3.", "One of 13 partners involved in the project, which will contribute software developed originally to spot anomalies in CCTV pictures.", "4.", "The production being developed in Finland and shown to Finnish TV audiences.", "5.", "A big budget drama where viewers can choose a variety of edited versions.", "6.", "An interactive game-like experience where viewers can interact with the medium and influence what they see and hear according to their personal tastes and wishes.", "7.", "The tool will be sophisticated enough to obey the complex rules of cinematography and editing, said John Wyver from TV producer Illuminations Television Limited."], "deepseek-r1:1.5b": ["The project, funded by the European Union, aims to develop a new media genre where audiences shape their own worlds.", "It involves 13 partners and a software system from BT.", "The goal is for users to create visual and auditory experiences tailored to their interests.", "A TV show will be based on text messages, influencing character interactions.", "A BBC production will focus on user interaction.", "The project's coordinator explains direct media engagement and sophisticated tools that obey editing rules.", "It plans several productions, including one about Renaissance art."], "tinyllama:1.1b": ["The European Union has funded a project called New Media for a New Millennium (NM2) to develop a new media genre, which allows viewers to create their own media worlds based on specific interests or tastes.", "This is possible through the use of content recognition algorithms developed by BT and their partners in Finland and the UK, allowing participants to text selected words that will impact how characters interact in the TV series Gormenghast.", "BBC's Mervyne Peake's Gothiq fantasy novel Gormenghast will also be re-engineered for NM2's experimental TV show.", "The project aims to teach the machine to look at content like Lego blocks and allow viewers to choose their own versions, while co-ordinator Peter Stollemayer explains that viewers can \"interact directly with the medium\" and influence what they see and hear according to personal tastes and wishes.", "NM2's involvement in the project includes production of a range of TV shows such as The Golden Age and the news, documentaries, and a romantic comedy drama."], "tinydolphin:1.1b": [" The European Union is funding a groundbreaking project aimed at allowing viewers to shape TV shows by manipulating their plots, settings, or even the dialogue.", "This ambitious project is called \"New Media for a New Millennium\" and it has as its endgame creating entirely new media genres that will allow audiences to create their own media worlds based on their specific interests or tastes.", "A partnership of 13 European companies has been established, including BT, the British Telecom group.", "They are working on seven productions, each with its unique storyline and characters.", "These projects will be shown to Finnish TV audiences, who will then have a say in how their favorite show is modified according to their preferences.", "Another project is aimed at the BBC, a prestigious British Broadcasting Company.", "It involves developing an interactive drama called \"Gormgoth\" based on the works of Mervyn Peake.", "The BBC will allow viewers access to the raw materials for this project so that they can choose a variety of edited versions.", "The TV industry is currently limited by the dumb box principle, meaning that it receives signals and relies on audience voting to decide what gets shown on a regular basis.", "This project will challenge these traditional notions of television production, allowing viewers to shape their own media experiences while still retaining access to the content.", "In summary, this ambitious project seeks to develop entirely new media genres that will allow audiences to create their own media worlds based on their preferences and interests.", "The technology used in these new media genres promises a level of personalization never seen before in television."], "phi:2.7b": [" The EU-funded project, New Media for a New Millennium (NM2), aims to develop software that allows viewers to create their own personalized media worlds based on their specific interests or tastes.", "Viewers will be able to manipulate plots, set and props of TV shows with the help of technology that can spot anomalies in CCTV pictures using content recognition algorithms.", "One production under NM2's purview is an experimental television show where text messages from the audience will impact how characters interact.", "Another team will work on re-engineering the BBC's Mervyn Peake's gothic fantasy drama, Gormenghast, to allow people to choose edited versions of the story.", "The new genre will require sophisticated tools that obey complex rules of cinematography and editing so the personalised version both makes sense and is aesthetically pleasing."], "orca-mini:3b": [" Viewers will be able to participate in storylines, manipulate plots, and even edit sets and props of TV shows under the project called New Media for a New Millennium (NM2), which is funded by the European Union.", "The project aims to develop a new genre of media that allows viewers to create their own personalized worlds based on their interests or tastes.", "One of the productions will be a experimental television show where the plot will be driven by text messages from the TV audience, and another will be a BBC drama re-engineered to allow viewers to choose edited versions.", "The project's technical project manager at BT, Dr Doug Williams, said the TV is currently a \"dumb box\" that receives signals, and the project aims to teach it to look like Lego blocks that can be reassembled to make perfect sense.", "NM2's co-ordinator Peter Stollenmayer said viewers will become active engagers, and the project has to follow the complex rules of cinematography and editing.", "Illuminations Television Limited's John Wyver said the project aims to create a personalized version of media that makes both aesthetic and logical sense."], "hermes3:3b": ["New 7.5m euro project (NM2) to develop tools allowing viewers to edit content based on their interests for new media genre, enabling interaction with TV storylines, plots and sets."], "stablelm-zephyr:3b": ["The European Union-funded project New Media for a New Millennium (NM2) aims to develop a new media genre that allows audiences to create their own media worlds based on their interests and tastes, eventually participating in storylines, manipulating plots, and editing content to their needs.", "Funded at €7.5m, 13 partners are involved, including BT, which is contributing software designed for identifying anomalies in CCTV pictures but now being adapted to work with content recognition algorithms.", "NM2 will work on seven productions over three years, refining tools that permit viewers to manipulate edited content according to their preferences and personal interests."], "stablelm2:1.6b": ["A new 7.5 million euro (£5.1m) project funded by the European Union aims to develop a personalized media genre where viewers can create their own media worlds based on their interests.", "The project, called New Media for a New Millennium (NM2), will involve editing TV shows and creating experimental television shows with text messages from the audience impacting character interactions.", "Software originally designed to spot anomalies in CCTV pictures will be used by BT as one of NM2's partners.", "The project aims to occupy space between interactive gaming and traditional TV, allowing viewers to become active media users who influence what they see and hear according to their personal tastes and wishes."], "granite3.1-dense:2b": ["The European Union-funded New Media for a New Millennium (NM2) project aims to develop a new media genre enabling audiences to personalize and actively participate in TV shows.", "With a budget of 7.5 million euros, the three-year initiative involves 13 partners, including BT, which will contribute software for content recognition.", "Key projects include:\n\n1.", "An experimental Finnish television series where audience text messages influence character interactions within a Gormenghast adaptation by the BBC.", "2.", "A variety of edited versions of the Mervyn Peake's gothic fantasy Gormenghast for diverse audiences.", "3.", "\"The Golden Age,\" a production about Renaissance art, allowing viewers to create media worlds based on personal interests like poetry, music, and architecture.", "4.", "Other projects include news, documentaries, and romantic comedy dramas for diverse audiences.", "The goal is to transform TV from a passive viewing experience into an active engagement medium where viewers can manipulate storylines, sets, props, and adhere to cinematography rules.", "This project seeks to bridge the gap between current limited interactive TV options and more dynamic content consumption."], "chatgpt-4o-latest": ["A European Union-funded project, New Media for a New Millennium (NM2), aims to create a new media genre that allows viewers to personalize TV content by manipulating storylines, plots, and settings.", "The three-year, €7.5 million project involves 13 partners, including BT, which is contributing content recognition software.", "One experimental TV show will let audiences influence the plot via text messages, while the BBC’s drama Gormenghast will be adapted for customizable viewing.", "The project seeks to transform passive viewers into active participants by developing tools that ensure personalized content remains coherent and visually appealing.", "Productions will span various genres, including news, documentaries, and drama, with one project focusing on Renaissance art, enabling users to explore themes like poetry, music, and architecture."]}