{"raw_text": "Pompeii gets digital make-over\n \n The old-fashioned audio tour of historical places could soon be replaced with computer-generated images that bring the site to life.\n \n A European Union-funded project is looking at providing tourists with computer-augmented versions of archaeological attractions. It would allow visitors a glimpse of life as it was originally lived in places such as Pompeii. It could pave the way for a new form of cultural tourism.\n \n The technology would allow digital people and other computer-generated elements to be combined with the actual view seen by tourists as they walk around an historical site.\n \n The Lifeplus project is part of the EU's Information Society Technologies initiative aimed at promoting user-friendly technology and enhancing European cultural heritage. Engineers and researchers working in the Europe-wide consortium have come up with a prototype augmented-reality system. It would require the visitor to wear a head-mounted display with a miniature camera and a backpack computer. The camera captures the view and feeds it to software on the computer where the visitor's viewpoint is combined with animated virtual elements. At Pompeii for example, the visitor would not just see the frescos, taverns and villas that have been excavated, but also people going about their daily life. Augmented reality has been used to create special effects in films such as Troy and Lord of the Rings and in computer gaming.\n \n \"This technology can now be used for much more than just computer games,\" said Professor Nadia Magnenat-Thalman of the Swiss research group MiraLab.\n \n \"We are, for the first time, able to run this combination of software processes to create walking, talking people with believable clothing, skin and hair in real-time,\" she said. Unlike virtual reality, which delivers an entirely computer-generated scene to the viewer, the Lifeplus project is about combining digital and real views. Crucial to the technique is the software that interprets the visitor's view and provides an accurate match between the real and virtual elements. The software capable of doing this has been developed by a UK company, 2d3. Andrew Stoddart, chief scientist at 2d3, said that the EU project has been driven by a new desire to bring the past to life. \"The popularity of television documentaries and dramatisations using computer-generated imagery to recreate scenes from ancient history demonstrates the widespread appeal of bringing ancient cultures to life,\" he said.\n", "llama3.2:1b": ["Pompeii is getting a digital makeover through a European Union-funded project called Lifeplus, which provides computer-generated images of historical attractions such as Pompeii, allowing tourists to experience life in those places digitally.", "The technology involves a head-mounted display with a camera and backpack computer that captures the visitor's view and combines it with animated virtual elements.", "The system is designed to bring real and digital elements together seamlessly, creating a more immersive experience than traditional audio tours.", "Experts say the project has the potential to create new forms of cultural tourism by allowing visitors to see the past in a more engaging and interactive way."], "llama3.2:3b": ["A European Union-funded project is developing an augmented reality system that will allow tourists to see historical sites like Pompeii in a new way, combining digital elements with real views to bring daily life back to life.", "The technology would require visitors to wear a head-mounted display and backpack computer to capture their view and feed it into software that combines it with animated virtual elements."], "gemma2:2b": ["A European Union-funded project called Lifeplus is developing augmented reality technology to enhance historical site experiences.", "The technology combines computer-generated images with real-world views, allowing tourists to see digitally animated elements interacting with excavated structures and daily activities at sites like Pompeii."], "qwen2.5:0.5b": ["Pompeii is facing a digital makeover that could provide visitors with lifelike views of its former inhabitants' daily lives, allowing them to experience life as it was in ancient times.", "The Lifeplus project, part of the EU's Information Society Technologies initiative, aims to create an augmented reality system where visitors can see and interact with historical sites alongside their surroundings.", "The technology combines real-time digital elements with a virtual environment, creating a more immersive and engaging experience for viewers."], "qwen2.5:1.5b": ["A European Union-funded initiative aims to create computerized augmented-reality systems for historical sites, allowing visitors to experience life in Pompeii by combining digital elements with real-world views through a head-mounted display and backpack computer.", "This technology could revolutionize cultural tourism by providing immersive historical experiences that blend reality and digital enhancements."], "qwen2.5:3b": ["A European Union-funded project aims to provide tourists with digital versions of historical sites, enhancing cultural tourism through augmented reality.", "Combining actual views with animated virtual elements allows visitors to experience life as it was originally lived at places like Pompeii.", "The Lifeplus system uses head-mounted displays and backpack computers for real-time integration of software-generated people into the environment.", "This technology combines digital and real-world views, offering a more immersive experience than traditional methods.", "Developed by researchers from Switzerland and UK, the goal is to bring ancient cultures back to life in a realistic manner, appealing to those interested in history through modern technology."], "opencoder:1.5b": ["Pompeii gets digital make-over\n\nA European Union-funded project is looking at providing tourists with computer-augmented versions of archaeological attractions that bring the site to life.", "The technology would allow digital people and other computer-generated elements to be combined with the actual view seen by tourists as they walk around an historical site.", "At the example of Pompeii, visitors would not just see the frescos, taverns and villas that have been excavated but also people going about their daily life.", "Augmented reality has been used to create special effects in films such as Troy and Lord of the Rings and in computer gaming."], "smollm:1.7b": ["Summarization: Pompeii gets digital makeover"], "deepseek-r1:1.5b": ["The project aims to transform Pompeiu into a digital experience through augmented reality.", "By combining digital data with real surroundings, visitors can see ancient sites like Pompeii as they did during their visit, blending technology with history."], "tinyllama:1.1b": ["A European Union-funded project aims to provide tourists with an augmented reality experience by combining computer-generated images and real-time walking, talking, and clothed people in historic sites such as Pompeii.", "The Lifeplus system allows for the creation of walking, talking people with believable clothing, skin, and hair, giving visitors a more immersive tour that captures the viewers' experience as they walk around the site.", "The technology is aimed at promoting user-friendly technology and enhancing European cultural heritage, using digital people and other computer-generated elements combined with real views of an historical site.", "This new desire to bring ancient culture alive has driven the project by the EU's Information Society Technologies initiative."], "tinydolphin:1.1b": [" The European Union has funded a project called Lifeplus that aims to create an augmented reality system capable of bringing ancient Roman archaeological sites and experiences directly into the visitor's hands through wearable technology.", "This innovative technology could pave the way for new forms of cultural tourism by allowing visitors to see life as it was lived in Pompeii, for example, while still preserving the historical accuracy of the experience.", "The Lifeplus project is part of a broader initiative called the EU's Information Society Technologies (IST) that aims to promote user-friendly technology and enhance European cultural heritage.", "The team working on the project includes experts from both the European Parliament and the European Commission, as well as scientists from across the UK.", "They have developed a prototype augmented reality system using backpack computers and head-mounted displays (HMDs), where visitors wear the HMD to get an immersive view of the ancient Roman site.", "The software can now be run for much more than just computer games, by combining the best in both virtual reality and real-life experiences.", "This allows for believable walking, talking people with accurate skin and hair, who are connected to a digital version of their surroundings, allowing them to interact with them as they would in the actual Roman era.", "This project is crucial in demonstrating how technology can be used to recreate ancient sites on a much larger scale than before, creating more immersive experiences for visitors and potentially attracting new audiences to these sites."], "phi:2.7b": [" A European Union-funded project aims to provide tourists with an augmented reality system that combines digital elements with actual views at historical sites like Pompeii.", "The technology would allow visitors to see animated virtual people and objects as they walk around, providing a new form of cultural tourism.", "This is made possible by software that accurately matches the real and virtual elements based on the viewer's perspective."], "orca-mini:3b": [" The article discusses a European Union-funded project that aims to provide tourists with computer-augmented versions of archaeological attractions.", "The technology would allow digital people and other computer-generated elements to be combined with the actual view seen by visitors as they walk around an historical site.", "This technology has been used in films such as Troy and Lord of the Rings, and in computer gaming.", "The Lifeplus project is part of the EU's Information Society Technologies initiative, which promotes user-friendly technology and enhances European cultural heritage.", "Engineers and researchers working in the Europe-wide consortium have come up with a prototype augmented-reality system that runs software to create walking, talking people with believable clothing, skin, and hair in real-time.", "The software capable of doing this has been developed by a UK company, 2d3.", "The Lifeplus project aims to bring the past to life, and the popularity of television documentaries and dramatisations using computer-generated imagery to recreate scenes from ancient history demonstrates the widespread appeal of bringing ancient cultures to life."], "hermes3:3b": ["Digital audio tours of historical sites may be replaced by augmented-reality system for Pompeii etc., combining real views with virtual people and elements to bring past life to visitors.", "EU-funded project Lifeplus uses head-mounted display, camera & backpack computer to blend digital & real scenes."], "stablelm-zephyr:3b": ["A European Union-funded project, part of the Information Society Technologies initiative, aims to provide tourists with computer-augmented versions of archaeological attractions, including digital representations of Pompeii that bring historical sites to life.", "The Lifeplus project involves a prototype augmented-reality system requiring visitors to wear head-mounted displays and backpack computers, capturing their view and combining it with animated virtual elements in real-time.", "This technology has potential for a new form of cultural tourism and differs from virtual reality in that it combines digital and real views.", "Software capable of interpreting the visitor's view has been developed by UK company 2d3, driven by a desire to bring ancient cultures to life through television documentaries and dramatizations using computer-generated imagery."], "stablelm2:1.6b": ["A European Union-funded project is developing computer-generated images for archaeological attractions, allowing visitors to see how life was originally lived in Pompeii.", "The augmented reality system would require a head-mounted display and a backpack computer, combining digital elements with real views without fully immersing the visitor in a virtual world.", "This technology has already been used in films like Troy and Lord of the Rings and is expected to enhance cultural tourism by bringing ancient cultures to life."], "granite3.1-dense:2b": ["A European Union-funded project, Lifeplus, aims to transform traditional audio tour experiences by offering computer-augmented historical sites like Pompeii.", "This innovative technology combines actual site views captured by a head-mounted camera with animated virtual elements, such as digital people and recreated structures.", "The system, developed by an EU-wide consortium, uses software from UK company 2d3 to accurately match real and virtual elements in real-time.", "Unlike virtual reality, Lifeplus blends digital and real views, providing a more immersive, believable representation of ancient life.", "The project reflects growing interest in recreating historical cultures for tourism through film special effects and computer gaming."], "chatgpt-4o-latest": ["A European Union-funded project, Lifeplus, aims to enhance cultural tourism by using augmented reality to bring historical sites like Pompeii to life.", "Tourists would wear a head-mounted display and a backpack computer that integrates real-world views with computer-generated elements, allowing them to see digital people and reconstructed scenes from the past.", "Developed as part of the EU's Information Society Technologies initiative, the system uses software from UK company 2d3 to accurately blend real and virtual elements.", "This technology, previously used in films and gaming, is now being applied to historical education, reflecting a growing interest in using digital tools to recreate ancient cultures."]}