{"raw_text": "Argonaut founder rebuilds empire\n \n Jez San, the man behind the Argonaut games group which went into administration a week ago, has bought back most of the company.\n \n The veteran games developer has taken over the Cambridge-based Just Add Monsters studios and the London subsidiary Morpheme. The Argonaut group went into administration due to a severe cash crisis, firing about half of its staff. In August it had warned of annual losses of £6m for the year to 31 July.\n \n Jez San is one of the key figures in the UK's games industry. The developer, who received an OBE in 2002, was estimated to have been worth more than £200m at the peak of the dotcom boom.\n \n He founded Argonaut in 1982 and has been behind titles such as 1993 Starfox game. More recently it was behind the Harry Potter games for the PlayStation. But, like all software developers, Argonaut needed a constant flow of deals with publishers. In August it warned of annual losses of £6m, blaming delays in signing new contracts and tough conditions in the software industry. The group's three subsidiaries were placed in administration a week ago, with Mr Sans resigning as the company's CEO and some 100 staff being fired. After the latest round of cuts, there were 80 workers at Argonaut headquarters in Edgware in north London, with 17 at its Morpheme offices in Kentish Town, London, and 22 at the Just Add Monsters base in Cambridge. Mr San has re-emerged, buying back Morpheme and Just Add Monsters. \"We are pleased to announce the sale of these two businesses as going concerns,\" said David Rubin of administrators David Rubin & Partners. \"This has saved over 40 jobs as well as the substantial employment claims that would have arisen had the sales not been achieved.\" Mr Rubin said the administrators were in talks over the sale of the Argonaut software division in Edgware and were hopeful of finding a buyer. \"This is a very difficult time for all the employees there, but I salute their commitment to the business while we work towards a solution,\" he said. Some former employees are angry at the way cash crisis was handled. One told BBC News Online that the staff who had been fired had been \"financially ruined in the space of a day\".\n", "llama3.2:1b": ["Jez San, founder of Argonaut games group, has bought back most of the company's studios and subsidiaries after it went into administration due to financial difficulties.", "The company, which faced annual losses of £6m, was placed in administration in August with about half of its staff fired."], "llama3.2:3b": ["Jez San, founder of Argonaut games group, buys back company after it went into administration due to severe cash crisis, firing about half of its 300 staff members."], "gemma2:2b": ["Jez San, founder of Argonaut games group, bought back Morpheme and Just Add Monsters studios from administrators after the company went into administration due to a severe cash crisis.", "This saved over 40 jobs.", "The sale included two other subsidiaries, but the fate of the main Argonaut software division is still uncertain as administrators seek a buyer."], "qwen2.5:0.5b": ["Argonaut developer Jez San bought back most of Just Add Monsters and Morpheme studios, which were under management by former Argonaut group CEO David Rubin & Partners.", "The company was downsized as a result due to cash flow issues."], "qwen2.5:1.5b": ["Argonaut founder Jez San buys back most of the company, resuming operations after severe cash crisis led to administration and layoffs earlier this year."], "qwen2.5:3b": ["Argonaut founder Jez San has bought back most of his company after it went into administration due to a severe cash crisis.", "He took over Just Add Monsters and Morpheme studios, which were part of Argonaut's Cambridge- and London-based subsidiaries.", "The group had previously warned about annual losses of £6m and was placed in administration for failing to secure new publisher deals.", "As CEO, San sold off the businesses as going concerns, saving 40 jobs and resolving significant employment claims.", "While some former employees are angry at how they were treated during this period, others welcome the re-emergence of these studios under Jez San's leadership."], "opencoder:1.5b": ["The Argonaut group, founded in 1982, has faced a severe cash crisis and underwent several significant administrative changes to rebuild its empire.", "The group's three subsidiaries were placed in administration with Mr San's decision, who bought back the Cambridge-based Just Add Monsters studios and the London subsidiary Morpheme.", "The company experienced substantial annual losses of £6m, primarily attributed to delays in signing new contracts and tough conditions in the software industry, which has led to a restructuring that has resulted in 80 workers at Argonaut headquarters in Edgware in north London, with 17 at its Morpheme offices in Kentish Town, London, and 22 at the Just Add Monsters base in Cambridge.", "Mr Rubin of administrators David Rubin & Partners has announced the sale of these two businesses as a solution, which has saved over 40 jobs and the substantial employment claims that would have arisen had the sales not been achieved."], "smollm:1.7b": ["The summary should be:\nJez San, the man behind the Argonaut games group which went into administration a week ago, has bought back most of the company.", "The veteran games developer has taken over the Cambridge-based Just Add Monsters studios and the London subsidiary Morpheme.", "The Argonaut group went into administration due to a severe cash crisis, firing about half of its staff.", "In August it had warned of annual losses of £6m for the year to 31 July.", "Jez San is one of the key figures in the UK's games industry.", "The developer, who received an OBE in 2002, was estimated to have been worth more than £200m at the peak of the dotcom boom.", "He founded Argonaut in 1982 and has been behind titles such as 1993 Starfox game.", "More recently it was behind the Harry Potter games for the PlayStation.", "But, like all software developers, Argonaut needed a constant flow of deals with publishers.", "In August it warned of annual losses of £6m, blaming delays in signing new contracts and tough conditions in the software industry.", "The group's three subsidiaries were placed in administration a week ago, with Mr Sans resigning as the company's CEO and some 100 staff being fired.", "After the latest round of cuts, there were 80 workers at Argonaut headquarters in Edgware in north London, with 17 at its Morpheme offices in Kentish Town, London, and 22 at the Just Add Monsters base in Cambridge.", "Mr Rubin of administrators David Rubin & Partners said the sale of the Argonaut software division in Edgware and the Just Add Monsters business was a \"very difficult time for all the employees there\".", "He added that the staff who had been fired had been \"financially ruined in the space of a day\"."], "deepseek-r1:1.5b": ["Jez San rebranded Argonaut Games Group as Argonaut Reins and bought back Just Add Monsters Studios and Morpheme from Cambridge-based company Just Add Monsters, while Morpheme remained operational.", "The group went into administration due to a severe cash crisis, with annual losses of £6m attributed to contract signing delays and software industry challenges.", "Jez San, known for his role in the UK games industry, remains part of Argonaut, reemerging on the market post public rebranding.", "Post-cuts, there are 80 employees at Edgware headquarters and 17 at Morpheme offices, with 22 based in Cambridge.", "The administrators expressed relief over job savings while hopeful for a buyer.", "Former employees criticized the management's handling of the financial crisis."], "tinyllama:1.1b": ["Jez San, the founder and former CEO of Argonaut games group, has re-emerged by buying back three subsidiaries, namely Morpheme Studios and Just Add Monsters.", "He has also sold two businesses, Just Add Monsters and Morpheme Studios, as going concerns to save over 40 jobs and avoiding employment claims.", "Argonaut software division in Edgware is still owned by the administrator David Rubin & Partners.", "Some former employees are angry at how casch crizi s was handled, with some fearing they will be financially ruined."], "tinydolphin:1.1b": [" The Argonaut software group, which went into administration due to severe financial problems, has re-emerged with the acquisition of two of its businesses.", "The company is buying back most of the workforce from both Morpheme and Just Add Monsters, as well as retaining its headquarters in Edgware.", "This move aims to save jobs for some 40 employees while also preventing further claims on their employment rights.", "Jez San has purchased back Morpheme from administrators and will re-establish it as an operating company, while buying back Just Add Monsters from administrators and will operate under its new name: Argonaut Software.", "This move is seen as an attempt to regain some stability in the industry after the collapse of Argonaut's main subsidiary, Just Add Monsters, which warned of annual losses of £6 million for the year to 31 July."], "phi:2.7b": [" Jez San, the founder of Argonaut games group, has bought back most of the company after it went into administration due to a severe cash crisis.", "The veteran games developer took over three subsidiaries - Just Add Monsters studios and Morpheme - which were placed under administration a week ago.", "Mr San is one of the key figures in the UK's games industry and received an OBE in 2002, becoming one of the richest developers at the time of the dotcom boom.", "He founded Argonaut in 1982 and has been behind popular titles such as Starfox game and Harry Potter games for PlayStation.", "However, delays in signing new contracts and tough conditions in the software industry led to annual losses of £6m for the group in August.", "Mr San resigned as CEO after the latest round of cuts but is back in business by buying back Morpheme and Just Add Monsters studios.", "The administrators are hopeful of finding a buyer for Argonaut software division, which employs over 80 workers at their headquarters in Edgware in north London.", "In the world of Argonaut games group's subsidiaries - Just Add Monsters studios and Morpheme - each studio is producing one popular game, among which Starfox, Harry Potter and a third unknown title.", "1.", "The studio that released Starfox did not go into administration.", "2.", "Argonaut software division has only one subsidiary, which isn't Morpheme.", "3.", "Just Add Monsters studios went into administration before the studio producing Harry Potter but after the studio which didn't go bankrupt due to the cash crisis.", "Question: Which game was produced by each studio?", "By property of transitivity and deductive logic, since Argonaut software division has only one subsidiary - it's Not Morpheme - and Morpheme went into administration, then Argonaut software division must be Just Add Monsters studios in Cambridge.", "Using tree of thought reasoning: Let's make a table where '1' means the game is produced by that studio.", "From the rules we know, Morpheme didn't produce Starfox, because it went bankrupt due to cash crisis (inductive logic), so Starfox must have been produced by Just Add Monsters studios and Harry Potter was produced by Argonaut software division in Edgware.", "Answer: The three games were produced as follows - Just Add Monsters studios produced Starfox, Argonaut software division published Harry Potter and Morpheme went into administration due to financial difficulties."], "orca-mini:3b": [" Jez San, founder of Argonaut Games Group, has bought back most of the company after it went into administration due to a cash crisis and firing half of its staff.", "He is one of the key figures in the UK's games industry and founded Argonaut in 1982."], "hermes3:3b": ["Argonaut founder Jez San purchases back Just Add Monsters and Morpheme studios after going into administration due to financial crisis, saving over 40 jobs."], "stablelm-zephyr:3b": ["Argonaut founder Jez San buys back his company's London and Cambridge subsidiaries, Just Add Monsters and Morpheme, after they faced administration due to £6m annual losses.", "Around 100 staff were fired earlier this month, but Jez San's acquisition saves over 40 jobs.", "The administrators are currently talking to potential buyers for the remaining Argonaut software division in Edgware."], "stablelm2:1.6b": ["Argonaut founder Jez San acquired most of the company, including Just Add Monsters studios and Morpheme, after his previous business went into administration due to a severe cash crisis.", "The total number of employees was reduced by about half during this period.", "Argonaut warned of annual losses of £6m for the year ending July 2019.", "Jez San is considered one of the key figures in the UK games industry and has been responsible for several notable titles, such Mordor game.", "His previous company was placed into administration after it faced delays in signing new contracts and tough conditions in the software industry.", "The three Argonaut subsidiaries were put up for sale, but Jez San managed to purchase them back."], "granite3.1-dense:2b": ["Jez San, founder and veteran games developer, has reacquired majority control of the struggling Argonaut group, which went into administration due to severe cash flow issues.", "The company, known for titles like Starfox and Harry Potter games, faced potential job losses of about 100 employees.", "San purchased Just Add Monsters and Morpheme studios, saving over 40 jobs.", "Despite the restructuring, some former employees are dissatisfied with how the cash crisis was managed, stating that those let go were financially devastated in a short period.", "The administrators are now seeking a buyer for Argonaut's software division to resolve the situation further."], "chatgpt-4o-latest": ["Jez San, founder of Argonaut Games, has repurchased two of the company's subsidiaries, Just Add Monsters and Morpheme, after the group went into administration due to a severe cash crisis.", "Argonaut, known for titles like Starfox and Harry Potter games, struggled with delays in securing new contracts and faced £6m in annual losses.", "The collapse led to the firing of about 100 employees, with San resigning as CEO.", "His acquisition of the two studios has saved over 40 jobs, while administrators continue seeking a buyer for Argonaut's software division.", "Some former employees expressed frustration over the handling of the financial crisis."]}