{"raw_text": "Attack prompts Bush site block\n \n The official re-election site of President George W Bush is blocking visits from overseas users for \"security reasons\".\n \n The blocking began early on Monday so those outside the US and trying to view the site got a message saying they are not authorised to view it. But keen net users have shown that the policy is not being very effective. Many have found that the site can still be viewed by overseas browsers via several alternative net addresses.\n \n The policy of trying to stop overseas visitors viewing the site is thought to have been adopted in response to an attack on the georgewbush.com website. Scott Stanzel, a spokesman for the Bush-Cheney campaign said: \"The measure was taken for security reasons.\" He declined to elaborate any further on the blocking policy. The barring of non-US visitors has led to the campaign being inundated with calls and forced it to make a statement about why the blocking was taking place. In early October a so-called \"denial of service\" attack was mounted on the site that bombarded it with data from thousands of PCs. The attack made the site unusable for about five hours.\n \n About the same time the web team of the Bush-Cheney campaign started using the services of a company called Akamai that helps websites deal with the ebbs and flows of visitor traffic. Akamai uses a web-based tool called EdgeScape that lets its customers work out where visitors are based. Typically this tool is used to ensure that webpages, video and images load quickly but it can also be used to block traffic. Geographic blocking works because the numerical addresses that the net uses to organise itself are handed out on a regional basis. Readers of the Boingboing weblog have found that viewers can still get at the site by using alternative forms of the George W Bush domain name. Ironically one of the working alternatives is for a supposedly more secure version of the site. There are now at least three working alternative domains for the Bush-Cheney campaign that let web users outside the US visit the site. The site can also be seen using anonymous proxy services that are based in the US. Some web users in Canada also report that they can browse the site.\n \n The international exclusion zone around georgewbush.com was spotted by net monitoring firm Netcraft which keeps an eye on traffic patterns across many different sites.\n \n Netcraft said that since the early hours of 25 October attempts to view the site through its monitoring stations in London, Amsterdam and Sydney have failed. By contrast Netcraft's four monitoring stations in the US managed to view the site with no problems. Data gathered by Netcraft on the pattern of traffic to the site shows that the blocking is not the result of another denial of service attack. Mike Prettejohn, Netcraft president, speculated that the blocking decision might have been taken to cut costs, and traffic, in the run-up to the election on 2 November. He said the site may see no reason to distribute content to people who will not be voting next week. Managing traffic could also be a good way to ensure that the site stays working in the closing days of the election campaign. However, simply blocking non-US visitors also means that Americans overseas are barred too. Most American soldiers stationed overseas will be able to see the site as they use the US military's own portion of the net. Akamai declined to comment, saying it could not talk about customer websites.\n", "llama3.2:1b": ["The official re-election website for President George W Bush is blocking visits from overseas users due to security reasons.", "Despite this, many have found ways to access the site using alternative addresses and proxy services.", "The blocking policy was adopted in response to an \"attack\" on the georgewbush.com website, but it appears not to be effective in preventing visitors."], "llama3.2:3b": ["The official George W Bush re-election site is blocking visits from overseas users due to security reasons, but many have found alternative addresses that can still view the site.", "The policy was adopted in response to a \"denial of service\" attack on the georgewbush.com website in October.", "The campaign has used Akamai's EdgeScape tool to block traffic, but it has been ineffective.", "Netcraft monitoring firm reported that attempts to view the site from outside the US have failed, suggesting the blocking may be due to cost-cutting measures before the election."], "gemma2:2b": ["President Bush's re-election website is blocking access from users outside the US for security reasons.", "Despite this policy, many overseas visitors are still able to access the site using alternative domain names or proxy services.", "The blocking was reportedly implemented in response to a denial of service attack earlier in October."], "qwen2.5:0.5b": ["An international ban is imposed on access to George W. Bush’s re-election site due to security concerns.", "Blocking occurs in early October and is caused by a denial-of-service attack on georgewbush.com.", "Alternative web addresses are available through Akamai, providing access for non-US visitors.", "Traffic monitoring sites like Netcraft identify the location of the blocked IP address."], "qwen2.5:1.5b": ["The official Bush re-election site blocks international access due to security concerns.", "This policy has been criticized for being ineffective and leading to increased calls from overseas users who can still access the site through alternative means like proxy servers or secure domain names.", "The blocking decision was likely made in response to a denial of service attack earlier that year and aimed at reducing costs during the election campaign period."], "qwen2.5:3b": ["The George W Bush re-election website is blocking overseas visits for \"security reasons\" after a denial-of-service attack in October.", "Despite this, some users can still access the site via alternative domain names or anonymous proxy services based in the US.", "The move is seen as potentially cost-saving and to manage traffic during the upcoming election, although it also means American citizens abroad are blocked."], "opencoder:1.5b": ["The attack prompts Bush site block, The blocking began early on Monday so those outside the US and trying to view the site got a message saying they are not authorised to view it, The policy of trying to stop overseas visitors viewing the site is thought to have been adopted in response to an attack on the georgewbush.com website.", "Scott Stanzel, a spokesman for the Bush-Cheney campaign said: \"The measure was taken for security reasons.\"", "Ironically one of the working alternatives is for a supposedly more secure version of the site.", "There are now at least three working alternative domains for the Bush-Cheney campaign that let web users outside the US visit the site."], "smollm:1.7b": ["The official re-election site of President George W Bush is blocking visits from overseas users for \"security reasons\".", "The blocking began early on Monday so those outside the US and trying to view the site got a message saying they are not authorised to view it.", "But keen net users have shown that the policy is not being very effective.", "Many have found that the site can still be viewed by overseas browsers via several alternative net addresses.", "The blocking of non-US visitors has led to the campaign being inundated with calls and forced it to make a statement about why the blocking was taking place.", "In early October an attack on the georgewbush.com website made the site unusable for about five hours.", "The barring of traffic from overseas users is thought to have been adopted in response to an attack on the George W Bush-Cheney campaign.", "Scott Stanzel, a spokesman for the Bush-Cheney campaign said: \"The measure was taken for security reasons.\"", "He declined to elaborate any further on the blocking policy.", "The barring of non-US visitors has led to the campaign being inundated with calls and forced it to make a statement about why the blocking was taking place.", "In early October an attack on the georgewbush.com website made the site unusable for about five hours.", "The barring of traffic from overseas users is thought to have been adopted in response to an attack on the George W Bush-Cheney campaign.", "Scott Stanzel, a spokesman for the Bush-Cheney campaign said: \"The measure was taken for security reasons.\"", "He declined to elaborate any further on the blocking policy.", "About the same time the web team of the Bush-Cheney campaign started using the services of a company called Akamai that helps websites deal with the ebbs and flows of visitor traffic, readers of the Boingboing weblog have found that viewers can still get at the site by using alternative forms of the George W Bush domain name.", "Readers of the Boingboing weblog have found that viewers can still get at the site by using alternative forms of the George W Bush domain name.", "There are now at least three working alternative domains for the Bush-Cheney campaign that let web users outside the US visit the site.", "The site can also be seen using anonymous proxy services that are based in the US.", "Some web users in Canada also report that they can browse the site.", "The international exclusion zone around georgewbush.com was spotted by net monitoring firm Netcraft which keeps an eye on traffic patterns across many different sites.", "Netcraft said that since the early hours of 25 October attempts to view the site through its monitoring stations in London, Amsterdam and Sydney have failed.", "By contrast Netcraft's four monitoring stations in the US managed to view the site with no problems.", "Data gathered by Netcraft on the pattern of traffic to the site shows that the blocking is not the result of another denial of service attack.", "Mike Prettejohn, Netcraft president, speculated that the blocking decision might have been taken to cut costs, and traffic, in the run-up to the election campaign.", "He said the site may see no reason to distribute content to people who will not be voting next week.", "Managing traffic could also be a good way to ensure that the site stays working in the closing days of the election campaign.", "However, simply blocking non-US visitors would mean that Americans overseas would still be unable to view the site.", "Most American soldiers stationed overseas will be able to see the site as they use the US military's own portion of the net.", "Akamai declined to comment, saying it could not talk about customer websites."], "deepseek-r1:1.5b": ["The official re-election site of George W. Bush has been blocked by overseas users for security reasons, starting early Monday.", "Attempts failed in London, Amsterdam, and Sydney, but US monitoring stations managed traffic, suggesting better solutions may be needed with Akamai and proxy services, while the global exclusion zone was detected.", "The campaign faced blockades despite efforts to improve, though blocking non-US visitors also restricted Americans overseas."], "tinyllama:1.1b": ["In response to a security threat posed by an attack on the George W Bush campaign website, the official re-election site of the President, georgewbush.com, is blocking access to overseas users for \"security reasons\".", "This policy has led to non-US visitors being barred from accessing the site, but some websites and services have reported success in circumventing it.", "The campaign's attempts to block traffic are not attributed to a denial of service attack, but rather to cost-cutting measures prior to the US election on 2 November.", "The blocking decision is being seen as a way to ensure the site remains functioning during the final days of the election campaign.", "Non-US visitors overseas are able to view the site."], "tinydolphin:1.1b": [" In an unexpected security move, President George W. Bush's official website, georgewbush.com, was blocked from external visitors in response to an attack.", "Despite this effort to limit access to the site, some readers have managed to view it through alternative addresses.", "These sites use anonymous proxy services based in the US to hide their identities and location.", "The blocking of non-US visitors has led to the Bush campaign being overwhelmed with calls for answers and questions about why such a move was taken.", "Some experts speculate that this could be a cost-saving measure, but others argue that it may be a way to ensure that the site remains working in the final days of the election campaign."], "phi:2.7b": [" The official re-election site of President George W Bush is blocking visits from overseas users for security reasons.", "This policy started early on Monday and those outside the US and trying to view the site got a message saying they are not authorised to view it.", "However, many eager net users have found that the site can still be viewed by overseas browsers via several alternative addresses.", "The denial of service attack on the official website led to the decision to block non-US visitors.", "Akamai, a web services company, has helped the Bush-Cheney campaign deal with visitor traffic by using its tools to detect where visitors are based.", "There are now at least three working alternatives for visiting the site outside of the US, and some Canadians report being able to view it too.", "Netcraft, a net monitoring firm, reported that the exclusion zone around georgewbush.com has been spotted since the early hours of 25 October.", "However, the blocking is not a result of denial of service attacks.", "Some speculate that the decision was taken to cut costs and manage traffic before the US election on 2 November, but it could also be to prevent people who won't be voting from accessing the site."], "orca-mini:3b": [" The official re-election site of President George W Bush is blocking visits from overseas users for security reasons, due to a denial of service attack early on Monday.", "The policy was implemented in response to the attack and aims to prevent non-US visitors from accessing the site.", "However, keen net users have found that the site can still be viewed by overseas browsers via alternative net addresses.", "Traffic patterns show that attempts to view the site through Netcraft's monitoring stations in London, Amsterdam, and Sydney failed, but those in the US managed to view it without any problems.", "The blocking decision might have been taken to cut costs and traffic during the election campaign, which ends on November 2nd.", "However, Americans stationed overseas will also be barred from accessing the site."], "hermes3:3b": ["Bush re-election website blocks overseas access for security, but workarounds found."], "stablelm-zephyr:3b": ["President George W. Bush's official re-election website, georgewbush.com, began blocking visits from overseas users on October 4th for \"security reasons\".", "However, many alternative addresses still allow access to the site from outside the US.", "The decision may have been made to cut costs and manage traffic during the election period.", "Netcraft monitoring stations in London, Amsterdam, and Sydney were unable to access the site, while those in the US could view it without problems.", "This exclusionary policy also affects American soldiers stationed overseas who use the US military's internet connection."], "chatgpt-4o-latest": ["President George W. Bush's re-election website began blocking overseas visitors for \"security reasons\" following a denial-of-service attack in early October.", "Despite this, users have found ways to access the site through alternative domain names and anonymous proxy services.", "The campaign, using Akamai's EdgeScape tool, implemented geographic blocking, which may also help manage traffic and costs ahead of the November 2 election.", "Net monitoring firm Netcraft confirmed the blocking was not due to another attack.", "The move has also restricted access for Americans abroad, though U.S. military personnel can still view the site.", "Akamai declined to comment on the decision."], "stablelm2:1.6b": ["The official George W. Bush election site blocked visits from overseas users for security reasons after a \"denial of service\" attack on georgewbush.com led to its unavailability for five hours.", "The campaign used a service called Akamai to block traffic and discovered several alternative domains for the site, while anonymous proxy services also allowed web access in Canada and some US locations.", "Netcraft, which tracks website traffic patterns, found that blocking was not due to another attack but might be implemented to cut costs or ensure proper functioning leading up to the election on 2 November.", "This policy restricts access to the site as well as American soldiers overseas who use the same net for their military activities."], "granite3.1-dense:2b": ["The official re-election site of President George W. Bush implemented a policy blocking visits from overseas users for security reasons, starting early on Monday.", "This measure was likely adopted in response to a \"denial of service\" attack that targeted the website in October, causing it to be unusable for about five hours.", "Despite the blockade, users discovered alternative domain names and anonymous proxy services to access the site from abroad.", "These workarounds included using georgewbush.com with variations or geographic blocking tools like Akamai's EdgeScape.", "Netcraft observed that attempts to view the site from international monitoring stations in London, Amsterdam, Sydney failed, while US-based stations could access it without issues.", "The campaign spokesman, Scott Stanzel, confirmed the policy was for security reasons but declined further details.", "Critics speculate the blocking may have been to reduce traffic and potential election tampering costs, rather than a direct defense against cyber threats.", "Notably, this restriction also barred American soldiers stationed overseas from accessing the site through their own military network."]}