{"raw_text": "'Ultimate game' award for Doom 3\n \n Sci-fi shooter Doom 3 has blasted away the competition at a major games ceremony, the Golden Joystick awards.\n \n It was the only title to win twice, winning Ultimate Game of the year and best PC game at the awards, presented by Little Britain star Matt Lucas. The much-anticipated sci-fi horror Doom 3 shot straight to the top of the UK games charts on its release in August. Other winners included Grand Theft Auto: San Andreas which took the Most Wanted for Christmas prize. Only released last week, it was closely followed by Halo 2 and Half-Life 2, which are expected to be big hits when they are unleashed later this month.\n \n But they missed out on the prize for the Most Wanted game of 2005, which went to the Nintendo title, The Legend of Zelda. The original Doom, released in 1994, heralded a new era in computer games and introduced 3D graphics. It helped to establish the concept of the first-person shooter. Doom 3 was developed over four years and is thought to have cost around $15m (£8.3m). The top honour for the best online game of the year went to Battlefield Vietnam. The Chronicles of Riddick: Escape from Butcher Bay was handed the Unsung Hero Game of 2004. Its release was somewhat eclipsed by Doom 3, which was released on the same week. It was, however, very well received by gamers and was praised for its storyline which differed from the film released around the same time. Electronic Arts was named top publisher of the year, taking the crown from Nintendo which won in 2003. The annual awards are voted for by more than 200,000 readers of computer and video games magazines. Games awards like this have grown in importance. Over the last six years, the UK market for games grew by 100% and was worth a record £1,152m in 2003, according to a recent report by analysts Screen Digest.\n", "llama3.2:1b": ["Doom 3 won Ultimate Game of the year and best PC game at the Golden Joystick awards.", "It also won the Most Wanted prize in 2005 for Nintendo's The Legend of Zelda.", "Doom 3 was released last week and shot straight to the top of UK games charts, followed by Halo 2 and Half-Life 2."], "llama3.2:3b": ["Doom 3 won Ultimate Game of the year and best PC game at the Golden Joystick awards.", "It also shot straight to the top of the UK games charts upon release.", "The Legend of Zelda took the Most Wanted for Christmas prize.", "Electronic Arts was named top publisher of the year."], "gemma2:2b": ["Doom 3 won the Golden Joystick awards' \"Ultimate Game of the year\" and \"Best PC game\" titles.", "The Legend of Zelda won \"Most Wanted game of 2005\".", "Other notable winners include Battlefield Vietnam (best online game) and The Chronicles of Riddick: Escape from Butcher Bay (Unsung Hero).", "Electronic Arts was named top publisher."], "qwen2.5:0.5b": ["Doom 3 won the Ultimate Game of the Year award at a major game ceremony in August.", "It is the first video game in history to have two titles win the same prize, having received both the Best PC game and Most Wanted awards.", "The other top prizes are for The Legend of Zelda (2005) and Battlefield Vietnam (2004).", "Electronic Arts won top publisher of the year.", "The UK market for games grew by 100% in six years to £1,152m in 2003."], "qwen2.5:1.5b": ["Doom 3 wins multiple Golden Joystick awards including Ultimate Game of the Year and Best PC game at the awards presented by Matt Lucas.", "Other winners include Grand Theft Auto: San Andreas for Most Wanted Christmas prize, Halo 2 and Half-Life 2 close behind; The Legend of Zelda is named Most Wanted game of 2005; Battlefield Vietnam takes top honour for Best Online Game of the Year; Electronic Arts tops Publisher of the Year award after Nintendo's win in 2003."], "qwen2.5:3b": ["Doom 3 won both Ultimate Game of the Year and Best PC Game at the Golden Joystick awards, becoming the sole double winner.", "Developed over four years for around $15 million, Doom 3 topped UK game charts after its August release.", "Other winners included Grand Theft Auto: San Andreas for Most Wanted for Christmas and Halo 2/Half-Life 2 as expected hits later this month.", "The Legend of Zelda took Most Wanted prize.", "Original Doom launched in 1994, introducing first-person shooter concept and 3D graphics.", "Electronic Arts claimed top publisher honor, replacing Nintendo which won in 2003.", "Over 200,000 gamers voted annually for these awards; UK games market grew by 100% over six years to £1.152 billion in 2003, according to analysts Screen Digest report."], "opencoder:1.5b": ["Ultimate game award for Doom 3, which was the only title to win twice, won for Best PC Game of the year and Ultimate Game of the year.", "The game presented by Matt Lucas, released on the Golden Joystick awards in August, is closely followed by Halo 2 and Half-Life 2 expected to be big hits when they are unleashed later this month.", "The game was missed out on the prize for the Most Wanted game of 2005, which was handed to the Nintendo title, The Legend of Zelda.", "The original Doom was released in 1994, setting a new era for computer games and introducing 3D graphics.", "It established the concept of first-person shooter.", "Doom 3 was developed over four years and is thought to have cost around $15m (£8.3m).", "The top honour for Best Online Game of the year went to Battlefield Vietnam.", "The Chronicles of Riddick: Escape from Butcher Bay was handed the Unsung Hero Game of 2004, which was released on the same week.", "Electronic Arts was named top publisher of the year, taking the crown from Nintendo which won in 2003.", "The annual awards are voted for by more than 200,000 readers of computer and video games magazines.", "The growth and appreciation of games have shown to be crucial."], "smollm:1.7b": ["The Golden Joystick award for Doom 3 was awarded to the game as it won both the Ultimate Game of the year and Best PC game at the awards ceremony.", "The game was also nominated for the Most Wanted game of 2005, but did not win that title."], "deepseek-r1:1.5b": ["Doom 3 won the 'Ultimate Game' award at the Golden Joystick Awards, becoming the only sci-fi shooter game to win two consecutive awards: Best Year and Best PC Game.", "Presented by Matt Lucas, the original Doom introduced a new era in gaming with 3D graphics and first-person shooters, while other entries like Grand Theft Auto: San Andreas and Halo 2 were notable as well.", "The most anticipated game missed out on securing the 2005 Most Wanted prize for Nintendo's title, The Legend of Zelda, but electronic Arts captured Best Publisher by replacing Nintendo in 2003."], "tinyllama:1.1b": ["\"Ultimate game\" award for Doom 3\n\nSci-fi shooter Doom 3 has won the Ultimate Game of the Year award at the Golden Joystick awards, presented by Litttle Britain star Matt Lucas.", "The much-anticipated title was closely followed by Grand Theft Auto: San Andreas, which took the Most Wanted for Christmas prize, and Half-Life 2, which is expected to be a big hit when it is released later this month.", "However, it missed out on the award for the Most Wanted game of 2005, which went to The Legend of Zelda.", "Doom 3 was developed over four years and cost $15m (£8.3m), and was thought to have set a new era in computer games with its introduction of 3D graphics.", "It won the title of Unsung Hero Game of the Year, which went to Battlefield: Vieünnám.", "The Chronicles of Riddick: Escapin from Butcher Bay was voted the Best Online game of the year.", "Electronic Arts was named publisher of the year, beating out Nintendo for the crown.", "The annual awards are voted for by more than 200,000 readers of computer and video games magazine titles.", "Over the last six years, the UK market for games grew by 100%, with a record £1,152m worth in 2003, according to Screen Digest's report."], "tinydolphin:1.1b": [" In addition to being crowned the Ultimate Game of the Year and best PC game with the Doom 3 title, Electronic Arts also received top publisher of the year at the Golden Joystick Awards held in London on December 15th.", "This prestigious recognition is a testament to their successful portfolio of games that have resonated with players worldwide.", "The winners in other categories were: Grand Theft Auto: San Andreas (Most Wanted), Halo 2 (Best Unreleased Game) and Half-Life 2 (Most Wanted Big Hitters).", "The most recent installment of the popular Doom series, Doom 3, has been praised for its innovative storyline that diverges from the film adaptation released earlier this year.", "This title was also recognized as the top publisher, earning EA the accolade once again.", "Overall, these awards reflect Electronic Arts' continued success in producing engaging and immersive game experiences for players across multiple platforms."], "phi:2.7b": [" Doom 3 has won two Golden Joystick Awards at a major games ceremony - Ultimate Game of the Year and Best PC Game.", "It is praised as an important game that helped establish first-person shooter genre with its release in 2004.", "Other winners include Grand Theft Auto: San Andreas, Halo 2, Half-Life 2, The Legend of Zelda, Battlefield Vietnam, and Chronicles of Riddick: Escape from Butcher Bay.", "Electronic Arts was named the top publisher of the year, as the UK games market grew by 100% to a record £1,152m in 2003."], "orca-mini:3b": [" Doom 3 won the Ultimate Game of the Year award at the Golden Joystick awards, which were presented by Little Britain star Matt Lucas.", "It was also the only game to win twice, winning both the Ultimate Game of the Year and Best PC Game categories.", "Other winners included Grand Theft Auto: San Andreas, which took the Most Wanted for Christmas prize.", "Only recently released, it was closely followed by Halo 2 and Half-Life 2, which are expected to be big hits when they are unleashed later this month.", "However, they missed out on the prize for the Most Wanted game of 2005, which went to The Legend of Zelda.", "The original Doom, released in 1994, helped to establish the concept of the first-person shooter and was instrumental in the development of modern shooters."], "hermes3:3b": ["Doom 3 wins 'Ultimate Game' at Golden Joystick awards, beating competitors like Grand Theft Auto: San Andreas and Halo 2."], "stablelm-zephyr:3b": ["Doom 3 won Ultimate Game of the Year and Best PC Game at the Golden Joystick awards, beating competition such as Grand Theft Auto: San Andreas, Halo 2, and Half-Life 2.", "The original Doom introduced 3D graphics and first-person shooter concept.", "Electronic Arts topped as top publisher of the year, while Battlefield Vietnam took best online game and The Chronicles of Riddick: Escape from Butcher Bay won Unsung Hero Game of 2004.", "The UK games market grew by 100% over the last six years, reaching £1,152m in 2003 according to a Screen Digest report."], "chatgpt-4o-latest": ["Doom 3 won the Ultimate Game of the Year and Best PC Game awards at the Golden Joystick Awards, hosted by Matt Lucas.", "The sci-fi horror shooter topped UK charts upon its August release.", "Grand Theft Auto: San Andreas won the Most Wanted for Christmas prize, while The Legend of Zelda was named the Most Wanted game of 2005.", "Battlefield Vietnam won Best Online Game, and The Chronicles of Riddick: Escape from Butcher Bay was recognized as the Unsung Hero Game of 2004.", "Electronic Arts was named top publisher, overtaking Nintendo.", "The awards, voted on by over 200,000 readers, reflect the growing importance of the gaming industry, which doubled in value over six years to £1,152m in 2003."], "stablelm2:1.6b": ["Doom 3 won Ultimate Game of the Year and best PC game at the Golden Joystick awards, beating out Grand Theft Auto: San Andreas, Halo 2, and Half-Life ..", "Despite being just released, Doom 3 established the concept of first-person shooters and introduced 3D graphics.", "Developed over four years for around $8 million (£8.3m), it helped to establish the original Doom as a landmark in computer gaming history.", "Grand Theft Auto: San Andreas won Most Wanted for Christmas, while Battlefield Vietnam was named best online game of the year.", "Electronic Arts was named top publisher of the year.", "The Golden Joystick awards have grown in importance and significance, with the UK gaming market for games increasing by 15% over the last six years and becoming worth £1 billion (£1.3bn) in 2008, according to a recent report by analysts Screen Digest."], "granite3.1-dense:2b": ["Doom 3, a sci-fi horror game developed over four years at an estimated cost of $15 million, triumphed at the Golden Joystick awards as Ultimate Game of the year and best PC game.", "It became the UK's top-selling game upon release in August, surpassing anticipated titles like Grand Theft Auto: San Andreas (Most Wanted for Christmas), Halo 2, and Half-Life 2.", "Other notable winners included Battlefield Vietnam for best online game and The Chronicles of Riddick: Escape from Butcher Bay as Unsung Hero Game of 2004.", "Electronic Arts was named top publisher.", "The awards, voted on by over 200,000 magazine readers, reflect the 100% growth in the UK games market, reaching £1,152m in 2003 according to Screen Digest."]}