{"raw_text": "Broadband in the UK growing fast\n \n High-speed net connections in the UK are proving more popular than ever.\n \n BT reports that more people signed up for broadband in the last three months than in any other quarter. The 600,000 connections take the total number of people in the UK signing up for broadband from BT to almost 3.3 million. Nationally more than 5 million browse the net via broadband. Britain now has among the highest number of broadband connections throughout the whole of Europe.\n \n According to figures gathered by industry watchdog, Ofcom, the growth means that the UK has now surpassed Germany in terms of broadband users per 100 people. The UK total of 5.3 million translates into 7.5 connections per 100 people, compared to 6.7 in Germany and 15.8 in the Netherlands. The numbers of people signing up to broadband include those that get their service direct from BT or via the many companies that re-sell BT lines under their own name. Part of the surge in people signing up was due to BT stretching the reach of ADSL - the UK's most widely used way of getting broadband - beyond 6km.\n \n Asymmetric Digital Subscriber Line technology lets ordinary copper phone lines support high data speeds. The standard speed is 512kbps, though faster connections are available. \"This breakthrough led to a dramatic increase in orders as we were suddenly able to satisfy the pent-up demand that existed in many areas,\" said Paul Reynolds, chief executive of BT Wholesale which provides phone lines that other firms re-sell. BT Retail, which sells net services under its own name, also had a good quarter and provided about 30% of the new broadband customers. This was a slight increase on the previous three months. Despite the good news about growth in broadband, figures from telecommunications regulator Ofcom show that BT faces increasing competition, and dwindling influence, in other sectors. Local Loop Unbundling, (LLU), in which BT rivals install their hardware in exchanges and take over the line to a customer's home or office, is growing steadily. Cable & Wireless and NTL have announced that they are investing millions to start offering LLU services. By the end of September more than 4.2 million phone lines were using so-called Carrier Pre-Section (CPS) services, such as TalkTalk and One.Tel, which route phone calls across non-BT networks from a local exchange. There are now more than 300 different firms offering CPS services and the percentage of people using BT lines for voice calls has shrunk to 55.4%.\n", "llama3.2:1b": ["Here is a concise summary of the text:\n\nThe UK's broadband market is growing rapidly, with over 600,000 new connections added in the last three months, surpassing Germany in terms of users per 100.", "The country now has nearly 3.3 million broadband users, up from around 2.5 million at the start of this year.", "This growth is attributed to BT's expansion of its ADSL service beyond 6km and its efforts to satisfy pent-up demand for faster speeds.", "Additionally, local Loop Unbundling (LLU) and Carrier Pre-Section (CPS) services are growing steadily, with over 4 million phone lines using CPS services."], "llama3.2:3b": ["High-speed broadband connections in the UK increased by 600,000 in the last quarter, taking total connections to almost 3.3 million.", "The UK now has among the highest number of broadband connections in Europe, surpassing Germany and the Netherlands.", "BT's expansion of ADSL technology led to a surge in new customers, while other firms are also investing in Local Loop Unbundling and Carrier Pre-Section services, increasing competition for BT."], "gemma2:2b": ["The UK has seen high growth in broadband subscriptions with over 600,000 new connections added in the last three months.", "This brings the total number of UK broadband users to almost 3.3 million and places Britain among the leaders in Europe for broadband connections per capita.", "Competition from rivals like Cable & Wireless, NTL and others is increasing as they offer alternative options such as Local Loop Unbundling (LLU).", "BT's influence on the telecommunications market is diminishing as more users opt for alternative solutions."], "qwen2.5:0.5b": ["The UK is seeing a rapid growth in broadband connections with an estimated 3.3 million new connections signed up, surpassing Germany's 5.3 million by around 1.7 million.", "More than 50% of users are browsing using broadband via BT or re-selling BT lines to other companies, and the growth has been led by ADSL networks extending beyond their usual speeds.", "The UK now leads Europe in terms of broadband connections per person, with about 7.5 connections for every 100 people compared to Germany's 6.7 connections and Netherlands' 15.8 connections.", "While this shows a rise in broadband usage, Ofcom reports that BT is facing competition from other companies like TalkTalk and One.Tel, and their influence has declined over time."], "qwen2.5:1.5b": ["Broadband usage in the UK is increasing rapidly, with over 15 million users as of last quarter, surpassing Germany's user count per capita.", "The growth was driven by advancements in ADSL technology and increased competition from local loop unbundling services.", "Despite this, BT faces declining influence in other sectors due to growing competition from rivals investing in LLU infrastructure."], "qwen2.5:3b": ["Broadband in the UK is growing rapidly with BT reporting over 600,000 new connections in the last quarter, bringing total broadband users up to almost 3.3 million.", "This places Britain among Europe's leaders with more than 7.5 broadband connections per 100 people.", "The growth is attributed partly to BT extending ADSL technology beyond its usual 6km range and partly due to BT Wholesale providing orders for new services.", "However, BT faces increasing competition from rivals like Local Loop Unbundling (LLU), Cable & Wireless, and NTL who are investing in CPS services that route calls across non-BT networks, reducing the percentage of people using BT lines for voice calls to 55.4%."], "opencoder:1.5b": ["Broadband growth in the UK is on the rise, with high-speed internet becoming increasingly popular.", "According to reports, more than a third of people sign up for broadband in the UK's last three months compared to the average timeframe.", "BT reported that it has surpassed Germany by over 3 million users per year, whereas in Germany, Britain also had an impressive of 5 million broadband connections.", "It further expands the reach of ADSL - another widely used method of getting broadband - beyond 6 kilometers.", "The figures indicate a significant surge in customer base.", "Asymmetric technology allows for faster data speeds compared to traditional copper cable, which has a maximum speed of 512kbps.", "This breakthrough brought about an increase in orders as we were suddenly able to meet the demand that emerged from many areas.", "However, telecom regulator Ofcom also faces increasing competition and influence in other sectors.", "Local Loop Unbundling, another service by BT, is growing at a steady pace.", "Cables & Wireless and NTL have announced significant investments to start offering LLU services.", "Despite the positive news, however, there are still more firms competing for services than we initially thought.", "Despite these competitive developments, the percentage of people using BT lines for voice calls has dropped from 55.4% in September compared to October.", "This suggests that other major firms like LLCs or resellers of phone line hardware are not fully benefiting from this breakthrough.", "Meanwhile, CPS services can route calls across non-BT networks from a local exchange.", "As the data demand continues to grow, more and more companies are looking for ways to boost their broadband sales."], "smollm:1.7b": ["The UK is experiencing rapid growth in broadband usage, driven by high-speed internet connections and increasing demand from households and businesses.", "This trend is being driven by the widespread adoption of broadband technology, which enables fast and reliable internet access via phone lines or fiber optic cables.", "The statistics suggest that more people are signing up for broadband subscriptions than ever before, with BT reporting a significant surge in new customers.", "The growth in broadband usage is largely attributed to the increasing availability of high-speed internet connections, particularly ADSL (Asymmetric Digital Subscriber Line) technology, which enables fast and reliable data transfer over copper phone lines.", "This has made it possible for ordinary households and businesses to access the internet at speeds of up to 100 Mbps, making it an essential service for many people.", "The statistics also highlight the significant increase in orders received by BT Retail, which provides net services under its own name.", "The company reported a substantial growth in new customers during the quarter, with a total of 30% more than the previous three months.", "This is likely to be driven by the increasing demand for broadband internet access, particularly among households and businesses that are looking to upgrade their internet infrastructure.", "The growth in broadband usage has also been driven by the increasing competition from other telecommunications companies, such as Cable & Wireless and NTL (Network Technology Limited).", "These companies have invested heavily in expanding their network coverage and offering a wider range of services, including LLU (Local Loop Unbundling) networks that allow customers to choose their own internet service provider.", "While the statistics suggest that broadband usage is growing rapidly, there are also concerns about the increasing competition from other telecommunications companies and the potential impact on BT's market share.", "However, BT remains a dominant player in the UK's broadband market, with a strong network of exchanges and a wide range of services available to customers."], "deepseek-r1:1.5b": ["Broadband in the UK is experiencing rapid growth, with high-speed internet connecting more users than ever before.BT reports that 600,000 new connections were added in the last three months, bringing the total to almost 3.3 million users signing up.", "Nationally, about 5 million people use net services, surpassing Germany and the Netherlands.", "The UK has among the highest broadband connections globally.", "Using Asymmetric Digital Subscriber Line (ADS-L) technology, BT extended coverage beyond 6km, contributing significantly to the surge.", "British users now outnumber German and Dutch net users by around 1.7 times per 100 people.", "Despite growth in high-speed service adoption, competition remains intense from other sectors like cables and ntl, affecting internet penetration."], "tinyllama:1.1b": ["Le grand nombre de nouveaux abonnés à l'internet dans le Royaume-Uni a confirmé la croissance de l'industrie de la télécommunication britannique, dont BT qui récentement a signalé une forte augmentation des signatures en ligne par abonné, depuis les 600 000 connexions au total.", "Environ 5 millions d'abonnés à l'internet via le réseau de BT ont ajouté leur numéro au compte.", "La croissance de l'industrie a également augmenté la population ayant un accès internet en baisse, à près de 5 milliards d'euros, passant de 62% à 40% depuis la moitié de 1998 à 2008.", "La société britannique de télécommunications a également augmenté son partenariat avec ses clients pour le service d'achat en ligne de l'internet (Webshop) et l'acquisition de sites Web, tout au long des années 1990-2000, ont permis à BT d'assurer sa partenaire."], "tinydolphin:1.1b": [" The UK is experiencing a significant growth in broadband connectivity, according to reports from BT.", "With over 6 million people now signed up for high-speed net connections, the nation now ranks among the highest number of users globally.", "This surge is partly due to the availability of more affordable ADSL technology compared to earlier iterations.", "As a result, more and more people are signing up to access the benefits of broadband internet usage beyond the traditional 6km range.", "BT has been steadily increasing its presence in the UK market, offering a variety of services such as broadband, phone lines, and cable television.", "While previous growth was largely due to BT's own re-selling activities, this surge is indicative of an increasingly competitive landscape.", "Companies such as Cable & Wireless and NTL are investing millions of pounds to offer telecom services using Carrier Pre-Section (CPS) networks, which route calls across non-BT networks from local exchanges to a customer's home or office.", "The UK's growth in broadband connectivity is attributed to the increasing popularity of mobile internet services like 3G and Wi-Fi, as well as improvements in technology such as voice over IP (VoIP) and ADSL.", "With more people connecting to the internet on their mobile devices and through landline phones via VoIP services, there has been an increased demand for high-speed broadband connections.", "This surge is likely to have a significant impact on the market dynamics of the telecommunications industry, as companies such as BT will need to adapt and diversify their offerings in order to remain competitive in the ever-changing landscape of internet connectivity."], "phi:2.7b": [" The UK's broadband usage is increasing rapidly due to the popularity of high-speed net connections, with over 3 million people signing up for broadband from BT in the last quarter.", "More than 5 million people now have access to the internet via broadband in the UK, making it among the highest number of users in Europe.", "BT has surpassed Germany in terms of broadband users per 100 people and is providing more access to their ADSL service by stretching its reach beyond 6 km.", "The growth in broadband use may be attributed to Asymmetric Digital Subscriber Line technology which can support high-speed data transmission on ordinary copper phone lines.", "However, despite the good news about the growth of broadband usage, other sectors such as local loop unbundling are also experiencing competition and BT's influence is diminishing."], "orca-mini:3b": [" The number of broadband connections in the UK is growing rapidly, with more than 5 million people browsing the net via broadband.", "This growth has surpassed Germany's in terms of broadband users per 100 people, and the UK now has almost 7.5 connections per 100 people.", "More people are signing up for broadband from BT, with over 30% of new customers coming from BT Retail.", "However, other companies such as Local Loop Unbundling and cable providers are also increasing their presence in the market.", "By the end of September, over 4.2 million phone lines were using Carrier Pre-Section services, such as TalkTalk and One.Tel, which route phone calls across non-BT networks from a local exchange.", "The percentage of people using BT lines for voice calls has shrunk to 55.4%."], "hermes3:3b": ["UK growing rapidly with high-speed broadband\n- Over 3.3m people signed up in last 3 months (600,000)\n- Total UK broadband users >5m, Europe's highest\n- UK surpasses Germany in broadband users per 100 people\n- Asymmetric Digital Subscriber Line technology used"], "stablelm-zephyr:3b": ["In the UK, broadband connections are becoming increasingly popular, with BT reporting that more people signed up for broadband in the last three months than in any other quarter.", "The growth has led the UK to now surpass Germany in terms of broadband users per 100 people, with 5.3 million connections translating to 7.5 connections per 100 people.", "This increase is due to both direct BT broadband and companies reselling BT lines.", "Part of this surge is also attributed to BT extending the reach of ADSL beyond 6km.", "Asymmetric Digital Subscriber Line technology allows for high data speeds over ordinary copper phone lines, supporting standard speeds of 512kbps with faster connections available.", "This has led to increased orders for BT Wholesale and BT Retail, which provided around 30% of new broadband customers in the last quarter.", "However, competition is increasing in other sectors as local loop unbundling grows, with more than 4.2 million phone lines using Carrier Pre-Section services from providers like TalkTalk and One.Tel.", "This growth has led to a decrease in people using BT lines for voice calls, now at 55.4%."], "chatgpt-4o-latest": ["Broadband adoption in the UK is growing rapidly, with BT reporting a record 600,000 new connections in the last quarter, bringing its total to nearly 3.3 million.", "Nationally, over 5 million people use broadband, making the UK one of Europe's leading countries in broadband connections.", "Ofcom data shows the UK has surpassed Germany in broadband users per 100 people, reaching 7.5 connections per 100 compared to Germany's 6.7.", "The expansion of ADSL coverage beyond 6km contributed to the surge in demand.", "BT Retail accounted for 30% of new broadband customers, but BT faces increasing competition from rivals investing in Local Loop Unbundling (LLU).", "Companies like Cable & Wireless and NTL are expanding LLU services, while over 4.2 million phone lines now use Carrier Pre-Selection (CPS) services, reducing BT's share of voice calls to 55.4%."], "stablelm2:1.6b": ["The UK is experiencing rapid growth in high-speed internet connections with nearly 3.3 million people subscribed to broadband, surpassing Germany.", "According to Ofcom data, the UK now has 5.3 million broadband subscribers and 7.5 connections per 1000 residents.", "This surge in demand led BT to expand ADSL coverage to 6km, resulting in a significant increase in orders.", "Both BT Wholesale and BT Retail had successful quarters.", "However, despite the growth in broadband, competition is increasing for BT in other sectors, such.", "\"Local Loop Unbundling (LLU), in which BT rivals install their hardware in exchanges and take over the line to a customer's home or office, is growing steadily,\" said Paul Reynolds, chief executive of BT Wholesale.", "The number of different firms offering Carrier Pre-Section services has risen from 420,000 to more than 1 million, and the percentage of people using BT lines for voice calls has shrunk to 4%."], "granite3.1-dense:2b": ["The UK's broadband market is thriving, with BT reporting over 600,000 new connections in the last quarter, bringing the total number of UK broadband users near 3.3 million and nationally over 5 million.", "This growth has propelled the UK to one of Europe's highest ranks for broadband penetration, surpassing Germany with 7.5 connections per 100 people compared to Germany's 6.7 and the Netherlands' 15.8.", "BT expanded ADSL coverage beyond 6km, enabling high-speed internet via ordinary copper phone lines (standard speed of 512kbps, with faster options available).", "This expansion led to a significant surge in broadband sign-ups.", "BT Wholesale and retail arm BT Retail contributed significantly to these new customers.", "However, BT's dominance is waning due to increasing competition from Local Loop Unbundling (LLU) providers like Cable & Wireless and NTL, who invest heavily in offering LLU services.", "As of September, over 4.2 million phone lines used Carrier Pre-Section (CPS) services, a marked decrease from BT's traditional line usage at 55.4% of all calls.", "More than 300 firms now provide CPS services, demonstrating the diversifying market."]}