{"raw_text": "Seamen sail into biometric future\n \n The luxury cruise liner Crystal Harmony, currently in the Gulf of Mexico, is the unlikely setting for tests of biometric technology.\n \n As holidaymakers enjoy balmy breezes, their ship's crew is testing prototype versions of the world's first internationally issued biometric ID cards, the seafarer's equivalent of a passport. Along with the owner's picture, name and personal details, the new Seafarers' Identity Document incorporates a barcode representing unique features of its holder's fingerprints. The cards are due to be issued in February next year, in line with the revised UN Convention on Seafarers' Identity Documents of June 2003. Tests currently under way in the Caribbean are designed to ensure that new cards and their machine readers, produced by different companies in different countries, are working to interoperable standards. Results of the current tests, which involve seafarers from a wide range of occupations and nationalities, will be published by the International Labour Organisation (ILO) by the end of November. Crystal Cruises, which operates the Crystal Harmony, is exploring the use of biometrics but has not yet committed to the technology.\n \n Authenti-corp, the US technology consultancy, has been working with the ILO on its technical specifications for the cards.\n \n \"If you're issued a seafarer's ID in your country, you want to be sure that when the ship lands in a port in, say, my country you can validate yourself using whatever equipment we have installed,\" Authenti-corp's CEO, Cynthia Musselman, told the BBC's Go Digital programme. She said French, Jordanian and Nigerian nationals would be the first seafarers to get the new ID cards since their countries have already ratified the convention. It aims to combat international terrorism whilst guaranteeing the welfare the one million seafarers estimated to be at sea. The convention highlights the importance of access to shore facilities and shore leave as vital elements to a sailor's wellbeing and, therefore, it says, to safer shipping and cleaner oceans. \"By increasing security on the seas as well as border control and protection, the cards will hopefully reduce the number of piracy problems around the world,\" said Ms Musselman. \"It should be a safer environment for seafarers to work in, and will allow people protecting their borders to have confidence that the people getting off the ship are, in fact, seafarers.\"\n", "llama3.2:1b": ["Seamen on luxury cruise liner Crystal Harmony test biometric technology for its Seafarer's Identity Document.", "The document incorporates a barcode with unique features of its holder's fingerprints and is intended to increase security and reduce piracy problems around the world.", "Tests involve seafarers from different countries and are being published by the International Labour Organisation (ILO) in November."], "llama3.2:3b": ["The International Labour Organisation is testing biometric ID cards for seafarers due to be issued next year.", "The cards feature a barcode of unique fingerprint features.", "Tests are being conducted to ensure interoperability with different machine readers and companies' equipment.", "The technology aims to combat international terrorism, improve border control, and reduce piracy.", "Seafarers from France, Jordan, and Nigeria will be among the first to receive the new ID cards, which will enhance seafarer welfare and safety at sea."], "gemma2:2b": ["Seafarer's ID cards with fingerprint recognition are being tested on the Crystal Harmony cruise liner.", "The goal is to create a globally interoperable biometric identification system for seafarers.", "The International Labour Organisation (ILO) will publish results of the tests by November.", "If successful, these new cards aim to enhance security on the seas and reduce piracy."], "qwen2.5:0.5b": ["Crystal Harmony crew tests biometric ID cards, which offer unique features of seafarer's fingerprints.", "Results from Caribbean pilot tests are expected by Nov. 12."], "qwen2.5:1.5b": ["The Crystal Harmony luxury cruise liner is testing biometric passports for seafarers as part of the UN Convention on Seafarers' Identity Documents.", "This initiative aims to ensure interoperability between different countries' equipment and validate identities of seafarers during international crossings, promoting safer shipping and cleaner oceans.", "Authenti-corp works with the International Labour Organization (ILO) on developing these specifications."], "qwen2.5:3b": ["The luxury cruise liner Crystal Harmony is testing biometric ID cards for its crew as an international experiment.", "These Seafarers' Identity Documents include fingerprints represented by barcodes and will be issued next year to ensure interoperability with different machines from various countries.", "Authenti-corp, a US technology consultancy working with the ILO, is facilitating these tests involving seafarers from diverse nationalities.", "The initiative aims to combat terrorism while ensuring safe passage for one million seafarers by improving border control and security on ships."], "opencoder:1.5b": ["Seamen sail into biometric future\n\nThe luxury cruise liner Crystal Harmony, currently in the Gulf of Mexico, is the unlikely setting for tests of biometric technology.", "As holidaymakers enjoy balmy breezes, their ship's crew is testing prototype versions of the world's first internationally issued biometric ID cards, the seafarer's equivalent of a passport.", "Along with the owner's picture, name and personal details, the new Seafarers' Identity Document incorporates a barcode representing unique features of its holder's fingerprints.", "The cards are due to be issued in February next year, in line with the revised UN Convention on Seafarers' Identity Documents of June 2003.", "Results currently under way in the Caribbean are designed to ensure that new cards and their machine readers, produced by different companies in different countries, are working to interoperable standards."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details from the original text.", "It provides an overview of the biometric technology being tested on cruise liners, including the testing process, results, and the role of international organizations like the ILO.", "The summary does not provide any explanations or additional information about the technology, its applications, or its potential benefits."], "deepseek-r1:1.5b": ["The cruise line Crystal Harmony is testing biometric ID cards, akin to passports, for seafarers in February 2017, starting their tests and issuing them.", "Tests on the Caribbean involve companies from different countries ensuring compatibility.", "Results will be published by November.", "Crystal Cruises explores biometrics but hasn't committed yet.", "Authenti-corp is collaborating with ILO for specifications.", "French, Jordanian, and Nigerian nationals will first get ID cards since their nations have ratified conventions aimed at safety and reducing piracy."], "tinyllama:1.1b": ["The luxury cruise line Crystal Harmony is testing biometric technology on Seafarers' Identity Documents, which incorporate a barcode representing unique features of their fingerprints.", "The new cards, produced by different companies in different countries, are designed to work interoperably with machine readers and will guarantee the welfare seafarers at sea.", "Crystal Cruises has not yet committed to using these technology-based ID cards, but is exploiting them for authenticating themselves before entering another country's port, as well as ensuring that they can validate themselves when on a ship.", "The convention aims to reduce piracy and make access to shore facilities and shore leave more essential for seafarers.", "The new ID cards aim to increase security on the sea and protect seafarers from piracy problems around the world."], "tinydolphin:1.1b": [" Crystal Cruises is exploring the use of biometric technology on its new internationally issued Seafarer's ID cards.", "The cards incorporate a barcode representing unique features of their holder's fingerprints to ensure accurate identification when needed.", "This innovative technology will help improve seafarers’ safety and reduce piracy, while also helping to protect border security.", "Crystal Cruises is currently testing these new cards in the Caribbean and plans to have them issued by February next year.", "The International Labour Organisation (ILO) is also involved in developing these cards, along with Authenti-corp, a US technology consultancy.", "These new ID cards will be the first of their kind for international seafarers."], "phi:2.7b": [" The luxury cruise liner Crystal Harmony is testing prototype biometric ID cards with unique features of its holders' fingerprints.", "These new Seafarers' Identity Documents will be internationally issued by February 2004.", "Authenti-corp has been working on technical specifications for these cards as part of the revised UN Convention on Seafarers' Identity Documents.", "The convention aims to combat international terrorism and promote seafarer's welfare, access to shore facilities, and protection of maritime borders.", "The new ID cards will make shipping safer and protect ocean cleanliness while also providing a more secure environment for seafarers to work in."], "orca-mini:3b": [" The text reports on tests of biometric identity cards for seafarers, aimed at ensuring interoperable standards and reducing the risk of piracy.", "The test are being conducted in the Caribbean and involve different companies from various countries to ensure the success of the technology.", "The current convention aims to protect seafarers' welfare and ensure safe shipping.", "Biometric technology is being tested as a security measure for international borders and ports, and the first seafarer ID cards will be issued by the ILO.", "Authenti-corp is working with the ILO to develop the specifications for the new ID cards."], "hermes3:3b": ["Crystal Harmony cruise tests biometric seafarers' ID cards\nBiometric IDs aim to ensure interoperability between countries' card systems, combat international terrorism & promote seafarers' welfare, according to UN convention"], "stablelm-zephyr:3b": ["Crystal Harmony cruise liner is testing biometric technology, specifically internationally issued Seafarers' Identity Documents, as a potential means of combating piracy and improving security for sailors.", "The documents include a unique barcode based on an individual's fingerprints and are designed to be interoperable with various machine readers from different countries.", "The first Seafarers' ID cards will be issued in February next year, following the revision of the UN Convention on Seafarers' Identity Documents in 2003.", "French, Jordanian, and Nigerian nationals will be among the first to receive these new IDs, as their respective countries have ratified the convention.", "The goal is to ensure sailors' access to shore facilities and leave while maintaining safety and cleaner oceans for all seafarers and those protecting their borders."], "chatgpt-4o-latest": ["The luxury cruise liner Crystal Harmony is testing biometric ID cards for seafarers, which include personal details and fingerprint-based barcodes.", "These cards, set for issuance in February next year under the revised UN Convention on Seafarers' Identity Documents, aim to enhance security and ensure interoperability across different countries.", "The International Labour Organisation (ILO) is overseeing tests involving seafarers of various nationalities, with results expected by November.", "Authenti-corp, a US consultancy, is assisting with technical specifications.", "The first recipients will be from France, Jordan, and Nigeria, as their countries have ratified the convention.", "The initiative seeks to improve security, combat terrorism and piracy, and ensure seafarers' welfare by facilitating access to shore facilities and leave."], "stablelm2:1.6b": ["Luxury cruise liner Crystal Harmony tests biometric ID cards for seafarers, with plans for issuance in February.", "The Seafarer's Identity Document includes a barcode representing fingerprints and will combat international terrorism while also ensuring welfare of one million seafarers.", "Authenti-corp has developed the technology specifications, with French, Jordanian, and Nigerian nationals first recipients since their countries ratified the convention.", "The ID cards aim to improve security, border control, and protection, ultimately reducing piracy issues worldwide."], "granite3.1-dense:2b": ["Seamen aboard the Crystal Harmony, sailing in the Gulf of Mexico, are participating in tests for biometric Seafarers' Identity Documents (SIDs), an internationally recognized standard set by the UN Convention on June 2003.", "These SIDs, due to be issued in February 2024, will include a barcode representing unique fingerprint features along with personal data.", "The tests, conducted in the Caribbean, aim to ensure interoperability between cards and readers from various countries.", "Results will be published by the International Labour Organisation (ILO) by November.", "Authenti-corp, a US technology consultancy, is collaborating with the ILO on these specifications.", "CEO Cynthia Musselman explains that the new SIDs will enable seafarers from France, Jordan, and Nigeria to validate themselves using local equipment at foreign ports, enhancing security and border control.", "The project aims to reduce piracy by ensuring safer shipping conditions for one million seafarers worldwide and providing confidence in shore leave access for those disembarking from ships."]}