{"raw_text": "US duo in first spam conviction\n \n A brother and sister in the US have been convicted of sending hundreds of thousands of unsolicited e-mail messages to AOL subscribers.\n \n It is the first criminal prosecution of internet spam distributors. Jurors in Virginia recommended that the man, Jeremy Jaynes, serve nine years in prison and that his sister, Jessica DeGroot, be fined $7,500. They were convicted under a state law that bars the sending of bulk e-mails using fake addresses.\n \n They will be formally sentenced next year. A third defendant, Richard Rutkowski, was acquitted. Prosecutors said Jaynes was \"a snake oil salesman in a new format\", using the internet to peddle useless wares, news agency Associated Press reported. A \"Fed-Ex refund processor\" was supposed to allow people to earn $75 an hour working from home. Another item on sale was an \"internet history eraser\". His sister helped him process credit card payments. Jaynes amassed a fortune of $24m from his sales, prosecutors said. \"He's been successful ripping people off all these years,\" AP quoted prosecutor Russell McGuire as saying. Jaynes was also found guilty of breaking a state law which prohibits the sending of more than 100,000 e-mails in 30 days, Virginia State Attorney General Jerry Kilgore reportedly said. Prosecutors had asked for 15 years in jail for Jaynes, and a jail term for his sister. But Jaynes' lawyer David Oblon called the nine-year recommended term \"outrageous\" and said his client believed he was innocent. He pointed out that all three of the accused lived in North Carolina and were unaware of the Virginia state law. Spam messages are estimated to account for at least 60% of all e-mails sent.\n", "llama3.2:1b": ["A US brother and sister, Jeremy Jaynes and Jessica DeGroot, have been convicted of sending hundreds of thousands of unsolicited AOL email messages to subscribers.", "They were found guilty under a Virginia state law that prohibits the sending of bulk emails using fake addresses.", "Prosecutors recommended that Jaynes serve 9 years in prison and his sister be fined $7,500."], "llama3.2:3b": ["A US brother and sister, Jeremy Jaynes and Jessica DeGroot, have been convicted of sending hundreds of thousands of unsolicited emails, with Jaynes receiving a recommended nine-year prison sentence and his sister being fined $7,500, making it the first criminal prosecution of internet spam distributors in the US."], "gemma2:2b": ["A US brother and sister, Jeremy Jaynes and Jessica DeGroot, have been convicted of sending unsolicited email messages to AOL subscribers and sentenced to nine years in prison for Jaynes and a fine for DeGroot under a state law prohibiting bulk emails with fake addresses.", "Their actions are the first criminal prosecution of internet spam distributors.", "A third defendant, Richard Rutkowski, was acquitted.", "The couple is believed to have earned $24 million from their sales of worthless products like \"Fed-Ex refund processor\" and \"internet history eraser\"."], "qwen2.5:0.5b": ["A brother and sister in the US have been convicted of sending hundreds of thousands of unsolicited e-mail messages using a fake address.", "They were found guilty under a state law that bars using fake addresses, while their third defendant was acquitted of the same charge.", "Both accused had amassed wealth through spamming and selling personal information."], "qwen2.5:1.5b": ["A US brother-sister duo has been convicted of spamming over 350,000 recipients with AOL subscribers using a fake address scam, sentencing recommended by jurors and involving fraud for $24 million in earnings from fraudulent products advertised online."], "qwen2.5:3b": ["US duo convicted of spamming; first conviction under new law.", "Jeremy Jaynes and Jessica DeGroot found guilty of sending hundreds of thousands of unsolicited emails using fake addresses, violating Virginia state law.", "They were sentenced to nine years in prison for their brother and sister, while a third defendant was acquitted.", "Prosecutors claimed they used the internet to sell worthless products including an \"internet history eraser\" for $75 per hour from home.", "Jaynes' earnings reached $24 million.", "The judge sentenced them to 15 years but Jaynes' lawyer called this recommendation outrageous.", "All were unaware of Virginia state law, and spam accounts for at least 60% of emails sent."], "opencoder:1.5b": ["The US duo have been convicted of spamming on AOL subscribers, leading to hundreds of thousands of unsolicited messages being sent.", "The first conviction was under a Virginia state law that bars the sending of bulk email messages using fake addresses.", "It was announced next year that three defendants, Richard Rutkowski and the man, Jeremy Jaynes, will be formally sentenced in jail.", "Jaynes' lawyer Jerry Kilgore suggested a nine-year prison sentence for his actions, which is deemed \"outrageous\" and the client believes he is innocent.", "The law prohibits the sending of more than 100,000 e-mails within 30 days, a statement by Virginia State Attorney General says."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details while omitting unnecessary information.", "The main points include:\n\n1.", "The US duo in first spam conviction\n2.", "The verdicts and sentencing recommendations\n3.", "The state laws that were violated\n4.", "The amount of money Jaynes amassed from his sales\n5.", "The sister's role in processing credit card payments\n6.", "The law that was broken by Jaynes\n7.", "The recommended sentence for Jaynes\n8.", "The location where the verdicts and sentencing recommendations were made\n9.", "The state laws that were violated\n10.", "The amount of money Jaynes is expected to pay in jail time\n\nThe summary provides a clear overview of the key points, without including unnecessary information or explanations."], "deepseek-r1:1.5b": ["A brother and sister in the U.S. were convicted of sending hundreds of thousands of unsolicited emails to AOL subscribers, marking the first criminal prosecution of internet spam distributors in the U.S.", "The case involves Jeremy Jaynes, who is currently serving a nine-year prison term, and his sister Jessica DeGroot, who will receive a $7,500 fine.", "The prosecution accused him of peddling useless information, news aggregators, history erasers, and other items on sale.", "Jaynes also appeared to violate state law that restricts bulk email sending within 30 days.", "The text highlights the seriousness of their actions and the potential consequences for his client, while also noting the legal concerns surrounding the Virginia law."], "tinyllama:1.1b": ["A US duo has been convicted of spamming millions of unsuspecting AOL subscribers with fake addresses, according to a Virginia court decision.", "Jurors recommended that Jeremy Jaynes serve nine years in prison and that his sister Jessica DeGroot be fined $7,500 for their roles in the case.", "The prosecution claimed that the duo had used fake e-mail addresses to send spam messages promising \"big savings\" and \"exclusive access.\"", "The victims included thousands of AOL subscribers who became convinced of an innocent sender.", "However, a third man has been acquitted on criminal charges.", "A third defendant, Richard Ruktkowski, was cleared by jurors.", "Spam messages are thought to account for at least 60% of all e-mails sent worldwide."], "tinydolphin:1.1b": [" The US duo who have been convicted of spamming were found guilty of breaking a Virginia state law that prohibits sending more than 100,000 email messages in 30 days.", "This is the first criminal prosecution for internet spam distributors.", "Jurors in Virginia recommended that Jeremy Jaynes serve nine years in prison and his sister Jessica DeGroot be fined $7,500.", "They will formally sentenced next year.", "Richard Rutkowski was acquitted of all charges.", "Prosecutors claimed Jaynes was a snake oil salesman using the internet to peddle useless wares like an \"internet history eraser\".", "The sister, Jessica DeGroot, managed to process credit card payments for her brother who was successful in sending spam."], "phi:2.7b": [" A US brother and sister have been convicted of sending spam emails using fake addresses, making a fortune of $24 million.", "They will be sentenced next year while one of the accused was acquitted.", "Prosecutors have called them \"snake oil salesmen\" who were successful in their fraudulent activities for years."], "orca-mini:3b": [" A brother and sister in the US have been convicted of sending hundreds of thousands of unsolicited email messages to AOL subscribers, with the first criminal prosecution of internet spam distributors.", "The pair was found guilty under a state law that bars the sending of bulk e-mails using fake addresses.", "They will be formally sentenced next year, and their lawyer claims they are innocent."], "hermes3:3b": ["US Brothers Convicted: First Spam Conviction, Brother & sister sending hundredsth of thousands unsolicited emails under state law banning bulk e-mails using fake addresses."], "stablelm-zephyr:3b": ["A US brother and sister have been convicted for sending hundreds of thousands of unsolicited emails, marking the first criminal prosecution of internet spam distributors.", "Jeremy Jaynes and his sister Jessica DeGroot were sentenced next year after being acquitted of charges.", "They were convicted under a state law prohibiting bulk emails using fake addresses.", "The pair made around $24m in sales, peddling items such as an \"internet history eraser.\"", "Prosecutors claimed they were part of a wider trend of spam messages making up at least 60% of all emails sent."], "chatgpt-4o-latest": ["A US brother and sister, Jeremy Jaynes and Jessica DeGroot, were convicted in Virginia for sending hundreds of thousands of spam emails to AOL users, marking the first criminal prosecution of internet spammers.", "Jaynes was sentenced to nine years in prison, while DeGroot was fined $7,500.", "They used fake addresses to send bulk emails promoting fraudulent products, including a \"Fed-Ex refund processor\" and an \"internet history eraser,\" amassing $24 million.", "A third defendant, Richard Rutkowski, was acquitted.", "Prosecutors described Jaynes as a scammer exploiting the internet, while his lawyer argued that the sentence was excessive and that they were unaware of Virginia's anti-spam law.", "Spam emails constitute at least 60% of all emails sent."], "stablelm2:1.6b": ["US duo convicted of internet spam, first US legal case against such activity.", "Jurors recommended nine-year prison sentence and fine for two defendants, while another was acquitted; third defendant awaits sentencing.", "State law prohibiting bulk email using fake addresses applies.", "Spam estimated to account for 15% of all e-mails."], "granite3.1-dense:2b": ["Jeremy Jaynes and his sister, Jessica DeGroot, have been convicted in Virginia as the first spam distributors to face criminal charges.", "They were found guilty under a state law that penalizes sending bulk emails using fake addresses.", "Their third co-defendant, Richard Rutkowski, was acquitted.", "Prosecutors alleged Jaynes used the internet to sell nonexistent products like a Fed-Ex refund processor and an \"internet history eraser,\" amassing a fortune of $24 million.", "Jaynes was also convicted for violating the state's limit on email volume.", "The jury recommended nine years in prison for Jaynes and a $7,500 fine for DeGroot; his defense argued the term excessive due to their ignorance of Virginia's spam law and the high percentage of emails sent being unsolicited."]}