{"raw_text": "BT offers free net phone calls\n \n BT is offering customers free internet telephone calls if they sign up to broadband in December.\n \n The Christmas give-away entitles customers to free telephone calls anywhere in the UK via the internet. Users will need to use BT's internet telephony software, known as BT Communicator, and have a microphone and speakers or headset on their PC. BT has launched the promotion to show off the potential of a broadband connection to customers.\n \n People wanting to take advantage of the offer will need to be a BT Together fixed-line customer and will have to sign up to broadband online. The offer will be limited to the first 50,000 people who sign up and there are limitations - the free calls do not include calls to mobiles, non-geographical numbers such as 0870, premium numbers or international numbers. BT is keen to provide extra services to its broadband customers. \"People already using BT Communicator have found it by far the most convenient way of making a call if they are at their PC,\" said Andrew Burke, director of value-added services at BT Retail. As more homes get high-speed access, providers are increasingly offering add-ons such as cheap net calls. \"Broadband and telephony are attractive to customers and BT wants to make sure it is in the first wave of services,\" said Ian Fogg, an analyst with Jupiter Research. \"BT Communicator had a quiet launch in the summer and now BT is waving the flag a bit more for it,\" he added.\n \n BT has struggled to maintain its market share of broadband subscribers as more competitors enter the market. Reports say that BT has lost around 10% of market share over the last year, down from half of broadband users to less than 40%. BT is hoping its latest offer can persuade more people to jump on the broadband bandwagon. It currently has 1.3 million broadband subscribers.\n", "llama3.2:1b": ["BT offers free internet telephone calls via their software BT Communicator for customers who sign up to broadband in December, with a limit of 50,000 people participating and calls not including mobiles or international numbers.", "The offer is limited to users of BT's internet telephony service and was launched by director Andrew Burke to show the potential of broadband."], "llama3.2:3b": ["BT is offering free internet telephone calls to customers who sign up for broadband in December as part of a Christmas promotion.", "The offer is limited to 50,000 customers and excludes calls to mobiles, premium numbers, or international numbers.", "BT aims to promote its broadband service and retain market share, which has declined from half to less than 40% over the last year."], "gemma2:2b": ["BT offers free internet phone calls for new broadband customers in December, limited to those with existing fixed-line subscriptions and utilizing their BT Communicator software.", "This promotion aims to showcase the potential of high-speed connections and boost market share as competition increases.", "The offer excludes calls to mobiles, non-geographical numbers, premium lines, and international numbers."], "qwen2.5:0.5b": ["BT offers free net phone calls to customers who sign up for broadband in December.", "People with a fixed-line customer and broadband online will be eligible, but there are limitations.", "Additional services are being added to BT's existing value-added service offering as more homes get high-speed internet access."], "qwen2.5:1.5b": ["BT offers free internet phone calls for December sign-ups in the UK via broadband customers using BT Communicator, with limitations and a target of attracting new broadband users."], "qwen2.5:3b": ["BT is offering free internet telephone calls via BT Communicator for the first 50,000 customers signing up for broadband in December, targeting fixed-line BT Together customers who sign up online.", "The offer includes UK calls but excludes mobiles and certain premium numbers.", "BT aims to showcase broadband's potential and boost its market share by providing additional services like internet telephony.", "Analysts suggest that this move can help BT maintain or increase its customer base as more competitors enter the market, with BT currently holding around 40% of broadband subscribers."], "opencoder:1.5b": ["BT offers free internet telephone calls.", "The Christmas give-away entitles customers to free internet telephone calls anywhere in the UK via the internet.", "Users will need to use BT's internet telephony software, known as BT Communicator, and have a microphone and speakers or headset on their PC.", "The promotion to show off the potential of a broadband connection to customers.", "People wanting to take advantage of the offer will need to be a BT Together fixed-line customer and will have to sign up to broadband online.", "The offer is limited to the first 50,000 people who sign up and there are limitations - the free calls do not include calls to mobiles, non-geographical numbers such as 08, premium numbers or international numbers.", "BT is keen to provide extra services to its broadband customers.", "\"People already using BT Communicator have found it by far the most convenient way of making a call if they are at their PC,\" said Andrew Burke, director of value-added services at BT Retail.", "As more homes get high-speed access, providers are increasingly offering add-ons such as cheap net calls.", "\"Broadband and telephony are attractive to customers and BT wants to make sure it is in the first wave of services,\" said Ian Fogg, an analyst with Jupiter Research.", "\"BT Communicator had a quiet launch in the summer and now BT is waving the flag a bit more for it,\" he added.", "BT has struggled to maintain its market share of broadband subscribers as more competitors enter the market.", "Reports say that BT has lost around 10% of market share over the last year, down from half of broadband users to less than 40%.", "BT is hoping its latest offer can persuade more people to jump on the broadband bandwagon.", "It currently has 1.3 million broadband subscribers."], "smollm:1.7b": ["BT offers free internet telephone calls if customers sign up to broadband in December.", "The Christmas give-away entitles customers to free telephone calls anywhere in the UK via the internet.", "Customers will need to use BT's internet telephony software, known as BT Communicator, and have a microphone and speakers or headset on their PC.", "BT has launched the promotion to show off the potential of a broadband connection to customers.", "People wanting to take advantage of the offer will need to be a BT Together fixed-line customer and will have to sign up to broadband online.", "The offer is limited to the first 50,000 people who sign up and there are limitations - the free calls do not include calls to mobiles, non-geographical numbers such as 0870, premium numbers or international numbers.", "BT is keen to provide extra services to its broadband customers.", "\"People already using BT Communicator have found it by far the most convenient way of making a call if they are at their PC,\" said Andrew Burke, director of value-added services at BT Retail.", "As more homes get high-speed access, providers are increasingly offering add-ons such as cheap net calls.", "\"Broadband and telephony are attractive to customers and BT wants to make sure it is in the first wave of services,\" said Ian Fogg, an analyst with Jupiter Research.", "\"BT Communicator had a quiet launch in the summer and now BT is waving the flag a bit more for it,\" he added."], "deepseek-r1:1.5b": ["BT offers free net phone calls via BT Communicator for customers signing up online for broadband in December.", "A limited Giveaway targets UK users who use their PC with BT's software and necessary devices, eligible for free calls excluding mobiles and certain numbers.", "The offer is capped at 50,000 participants, with losses around 10% from last year due to increased competition."], "tinyllama:1.1b": ["BT offers free internet telephone calls as part of a Christmas give-away promotion for customers who sign up to broadband in December.", "The offer entitles those using BT Communicator to make free phone calls anywhere in the UK, and users with a microphone and speaker/headset will be eligible.", "To take advantage of the promotion, customers need to be a BT Together fixed-line customer and sign up to broadband online.", "Callers can also receive free calls to mobile numbers, non-geographic prefixes (0870), top-up phone cards and international numbers.", "The offer is limited to the first 50,000 subscribers who sign up, but BT hopes to provide additional services as more homes get high-speed broadband access.", "As competitors enter the market, BT aims to maintain its market share of broadband users, but reports indicate that it has lost around 10% of market share over the last year."], "tinydolphin:1.1b": [" In summary, BT is offering free internet telephone calls in December as part of its broadband promotion.", "This new service aims to show off the potential of a broadband connection for customers by offering them free calls to a range of locations in the UK via their PCs.", "These calls can be made using BT Communicator, which comes with a microphone and speakers or through any internet-connected device.", "However, this offer is limited to the first 50,000 people who sign up, and does not include calls to mobiles, non-geographical numbers, or international numbers.", "Currently, BT has around 1.3 million broadband subscribers."], "phi:2.7b": [" BT's new Christmas promotion offers customers free internet telephone calls anywhere in the UK using their broadband service.", "Customers must be a BT Together fixed-line customer and sign up for broadband online, with the offer limited to 50,000 people.", "The software, known as BT Communicator, allows for convenient calls from a computer with microphone and speakers."], "orca-mini:3b": [" BT offers free internet telephone calls to its fixed-line customers who sign up to broadband in December.", "The offer entitles customers to free telephone calls anywhere in the UK via the internet, but excludes calls to mobiles, non-geographical numbers such as 0870, premium numbers or international numbers.", "This promotion is aimed at showcasing the potential of a broadband connection to customers and BT's value-added services.", "The first 50,000 people who sign up will be eligible for the offer, which may be limited in scope due to the number of available resources.", "BT hopes that its latest offer can persuade more people to jump on the broadband bandwagon, as it currently has only 1.3 million broadband subscribers and struggles to maintain its market share."], "hermes3:3b": ["BT offers free UK internet calls (limited to first 50K signups) for broadband customers who enroll in December."], "stablelm-zephyr:3b": ["BT is offering free internet telephone calls to customers who sign up for broadband in December.", "The promotion, limited to the first 50,000 recipients, requires users to have BT Communicator software, a microphone, and speakers or headset on their PC.", "The offer aims to showcase the potential of broadband connections and complement BT's efforts to retain its market share amidst increasing competition."], "chatgpt-4o-latest": ["BT is offering free internet phone calls to customers who sign up for broadband in December.", "The promotion allows free UK calls via BT Communicator software, requiring a microphone and speakers or a headset.", "The offer is limited to the first 50,000 sign-ups and excludes calls to mobiles, premium, non-geographical, and international numbers.", "BT aims to showcase broadband's potential and attract more customers as competition increases.", "The company has lost market share, dropping from 50% to under 40% in a year, and hopes this initiative will boost its 1.3 million broadband subscribers."], "stablelm2:1.6b": ["BT offers free internet phone calls to customers signing up for broadband in December.", "Customers will need a microphone and speakers or headset with BT's internet telephony software, BT Communicator.", "This promotion aims to showcase the potential of a broadband connection.", "Limited to the first 1% who sign up, this offer does not include calls to mobiles, non-geographical numbers like \"0,\" premium numbers, or international numbers.", "To attract more customers, BT has offered add-ons such Bt Communicator, which is by far the most convenient way of making a call if they are at their PC.", "The company has struggled to maintain its market share; however, this promotion could help persuade more people to take up broadband.", "It currently has 1.3 million broadband subscribers."], "granite3.1-dense:2b": ["BT is providing free internet phone calls to the first 50,000 customers signing up for broadband in December via their BT Communicator software and a compatible PC setup.", "The promotion aims to highlight the benefits of a broadband connection and targets existing BT Together fixed-line customers.", "Free calls are limited to landlines within the UK, excluding mobiles, certain non-geographical numbers (0870), premium numbers, and international calls.", "This initiative reflects a broader trend among broadband providers offering additional services to their subscribers, as more households gain high-speed internet access.", "Despite losing approximately 10% of market share over the past year, BT aims to boost its subscriber base with this promotion, currently at around 1.3 million."]}