{"raw_text": "Putting a face to 'Big Brother'\n \n Literally putting a face on technology could be one of the keys to improving our interaction with hi-tech gadgets.\n \n Imagine a surveillance system that also presents a virtual embodiment of a person on a screen who can react to your behaviour, and perhaps even alert you to new e-mails. Basic versions of these so-called avatars already exist. Together with speech and voice recognition systems, they could replace the keyboard and mouse in the near future. Some of these ideas have been showcased at the London's Science Museum, as part of its Future Face exhibition.\n \n One such avatar is Jeremiah. It is a virtual man, which you can download for free and install in your computer.\n \n His creator, Richard Bowden, lecturer at the Centre for Vision, Speech and Signal Processing at the University of Surrey, refers to Jeremiah as \"him\", rather than it. \"Jeremiah is a virtual face that attempts to emulate humans in the way it responds to activity. He is very childlike, he likes visual stimulus,\" he told the BBC News website. \"When he sees children running and laughing and waving at him, he smiles at them. If you ignore him, he gets angry. If you leave, he gets sad. And you can also even surprise him.\" Jeremiah is not actually intelligent. It works on vision, reacting in a preset way to the information provided by a surveillance tracker system. It is not able to talk or to hear you, at least not yet. The Surrey team is already working on Jeremiah's next version, that will replace the human face with an underwater and more interactive creature: Finn the fish. \"I am interested in the interaction, providing the ability of a system to watch what's going on and make decisions based on that,\" explained Dr Bowden.\n \n The research comes at a time when people are having to cope with an increasing number of hi-tech gadgets.\n \n Experts say a much more natural way to interact with these devices, such as a virtual human, could make it much easier to make the most of all those new gizmos. \"If you get up at three o'clock in the morning, and you go downstairs, there are probably two things you are going to do: either going to the bathroom, or maybe you are going to make a cup of tea,\" said Dr Bowden. \"Now if the system can watch your behaviour over time, it can learn this, so it would predict what you are going to do, turn on the lights for you, or, before you even get to the kettle, it could have switched it on.\" You might even be able to tell your home surveillance system that you will be going away on holiday, and ask if it could make sure that the house is secure once you have left. This might sound like a scary vision of an Orwellian future. But it might all depend on the face that is watching you. \"When we put the surveillance cameras in our centre, a lot of people were very unhappy about the fact that there was a system watching them,\" said Dr Bowden. \"But when Jeremiah's camera went in, nobody minded, because although it's still watching them, they could see what it was watching.\"\n", "llama3.2:1b": ["Here is a concise summary of the text:\n\nA virtual face named Jeremiah can be downloaded for free to interact with hi-tech gadgets, such as computer screens and voice assistants.", "It reacts to user behavior, including seeing children laughing and waving, and responds accordingly, mimicking human-like emotions like happiness or sadness.", "The system uses surveillance tracking technology to learn users' habits over time, enabling it to predict what actions are likely to be taken based on those habits.", "Researchers aim to create an underwater version of Jeremiah, which could interact with devices more naturally and securely."], "llama3.2:3b": ["A virtual avatar named Jeremiah can be downloaded and installed on computers to monitor and respond to user behavior, potentially replacing keyboards and mice with a more natural interface.", "The avatar is childlike and reacts to visual stimuli, but is not intelligent and lacks the ability to talk or hear.", "Experts believe that such avatars could make interacting with hi-tech gadgets easier and more intuitive, allowing systems to learn users' behaviors and make decisions accordingly."], "gemma2:2b": ["Virtual avatars, like Jeremiah and Finn, use surveillance technology to react to user behavior.", "These avatars can potentially replace keyboards and mice in the near future.", "While these systems aren't intelligent, they respond based on visual information and predict actions of users.", "This technology is being developed to provide a more natural way to interact with high-tech devices."], "qwen2.5:0.5b": ["Putting a face to technology is one way to make interactions easier and more natural, as shown by avatars that can react to human behavior or respond based on certain data.", "These are called virtual humans, which can include avatars like Jeremiah in the story.", "The article discusses how these technologies could help people interact with hi-tech gadgets, making it easier for them to use new devices."], "qwen2.5:1.5b": ["Putting a face to \"Big Brother\" involves creating virtual avatars using technology such as speech and voice recognition systems that can react based on user behavior.", "The avatars aim to enhance interaction with hi-tech gadgets by providing users with real-time feedback and decisions.", "Examples include Jeremiah, a childlike avatar in the London Science Museum's exhibition, which is adaptable and interacts with visual stimuli like children running and laughing.", "Finn the fish could replace human faces in the future versions of the technology.", "This concept aims to make new gadgets more intuitive and personalized by learning user behavior over time."], "qwen2.5:3b": ["Putting a face to technology could enhance interaction with hi-tech gadgets.", "Virtual avatars like Jeremiah can react to user behavior and are used in surveillance systems.", "Initially childlike and interactive, they respond based on visual stimuli rather than intelligence or speech.", "Research aims to create more natural interactions by replacing human faces with underwater creatures.", "While some view this as a potential privacy invasion, others argue it could make home automation easier and secure homes when visible to users."], "opencoder:1.5b": ["Putting a face to 'Big Brother', presenting a virtual embodiment of a person on a screen who can react to your behaviour and perhaps alert you to new e-mails.", "Basic versions of these avatars already exist.", "Together with speech and voice recognition systems, they could replace the keyboard and mouse in the near future.", "One such avatar is Jeremiah.", "It emulates a man's way of responding to activity on hi-tech gadgets.", "The research comes at a time when people are having to cope with more sophisticated technologies."], "smollm:1.7b": ["Putting a face to 'Big Brother'"], "deepseek-r1:1.5b": ["Presenting faces on technology, akin to \"big brother,\" can enhance interaction with smart devices.", "Existing avatars like Jeremiah exist but are childlike, responding to visual cues without speaking.", "Future versions, such as Finn, offer more interactive underwater experiences.", "Experts suggest using a virtual face for easier system navigation and decision-making.", "However, surveillance cameras in central areas may still pose concerns, as they continue to watch without necessarily being sentient or allowing adaptive behavior like predicting actions or initiating actions based on observations."], "tinyllama:1.1b": ["The article discusses an experiment where researchers created a virtual avatar that can react to human behavior and predict future actions.", "The avatar is designed as a virtual man named Jeremiah who has been programmed with visual stimuli and emotions based on survey data.", "This avatar helps individuals improve their interactions with hi-tech gadgets, providing them with natural ways to interact with these devices.", "The article suggests that by watching human behavior over time, Jeremiah can learn and predict future actions, such as going for a walk or turning on the lights.", "The article concludes that these advancements in technology may make it easier for individuals to use hi-tech gadgets more effectively, particularly when it comes to making decisions based on human behavior over time."], "tinydolphin:1.1b": [" In summary, the present text is discussing the concept of avatars in a technological context: the idea of providing a face or form to technology devices.", "Jeremiah, a virtual man that can interact with humans through computer vision systems and speech recognition, exemplifies this concept.", "This technology could provide an improved interaction experience for users by enabling the creation of more natural-looking and intuitive virtual characters.", "Dr. Richard Bowden, lecturer at the University of Surrey, explains how Jeremiah works and how his creator, Richard Bowden, is interested in developing more advanced versions of this virtual character.", "The potential applications of these technologies could be vast, from enhancing home security systems to facilitating better communication between humans and their devices."], "phi:2.7b": [" The text discusses the idea of using avatars to interact with technology more naturally, with examples such as the virtual man Jeremiah and the underwater creature Finn the fish.", "These concepts are showcased at the London Science Museum's Future Face exhibition and have the potential to revolutionize the way we interact with surveillance systems and other hi-tech gadgets.", "The Surrey team is working on developing even more advanced avatars that can predict our actions and adjust accordingly, which could make using technology much easier.", "Consider a scenario where you are designing an artificial intelligence system for a smart home.", "This AI system has the ability to learn from user's behavior, just like Dr. Richard Bowden’s Jeremiah avatar.", "The system must be able to monitor different tasks a person may do at 3:00 am and 7:00 pm when he/she is alone in the house.", "The tasks are as follows: \n1.", "Going to the bathroom (B)\n2.", "Making coffee (C)\n3.", "Checking email (E)\n4.", "Watching TV (T)\n5.", "Making tea (M)\n6.", "Exercising (X)\n7.", "Reading a book (R)\n8.", "Taking a shower (S)\n9.", "Sleeping (P)\n10.", "Any other task\n\nThe AI system has to predict the sequence of tasks for each time slot, but it should not consider 'making coffee' and 'watching TV' as two consecutive actions in a single day because both require a hot beverage.", "Rules:\n1.", "The system must learn from user's behavior over time; hence, it can remember previous actions and predict the future ones.", "2.", "It cannot make any assumptions about the user's routine unless explicitly told by the user.", "3.", "If two tasks are similar (like making coffee, making tea), they should always be in different places on the house's floor plan (like separate rooms) to avoid confusion.", "4.", "The system must not predict actions that directly contradict with a person’s preferences or lifestyle (for example, if the user dislikes exercise, it shouldn't suggest an active activity like exercising).", "Question: Given this information and considering that the house layout is fixed and can only accommodate a limited number of rooms for different tasks.", "How would you design the AI system to predict what task each user will do at 3:00 am and 7:00 pm?", "Firstly, we need to identify which actions are 'hot' and can be combined in one location based on user's preference.", "Actions like making coffee or tea, reading a book, and taking a shower are considered as hot because they require a specific type of environment (e.g., the kitchen for making coffee, bedroom for reading).", "Next, consider the house layout.", "If there is only one room in the house that meets user's needs (for example, bathroom), then predict any activity that requires this room can be done at 3:00 am and 7:00 pm.", "For tasks like exercising or making tea which do not require a hot environment, but need space for movement, these can be predicted to happen anywhere in the house.", "Now, we have to consider user's habits over time and learn from previous days' actions to make predictions.", "If a person usually makes coffee at 7:00 pm then predict that he/she will do it on 3:00 am as well.", "If the AI system is taught about the lifestyle of users, it can avoid predicting tasks like exercising if it knows a user has other commitments or preferences (like reading in bed).", "Remember to respect the rule that these predictions should not contradict with user's preferences.", "For example, if a person likes to exercise but hates waking up early, don't predict any task related to it at 3:00 am.", "Finally, use proof by exhaustion approach by considering all possible sequences of tasks for each time slot and choose the one which satisfies all the rules.", "Answer: The AI system can be designed as a behavior prediction model that learns from user's habits over time using a fixed house layout with different rooms representing different tasks.", "These predictions will not directly contradict with user’s preferences or lifestyle, unless explicitly mentioned otherwise by the user."], "orca-mini:3b": [" The text describes a project to create a virtual human face that can interact with technology, such as surveillance systems.", "The face would react to the user's behavior and even alert them to new emails.", "The creator of the project, Richard Bowden, refers to the virtual man as \"him\".", "The face is not actually intelligent but works on vision, reacting in a preset way to information provided by a surveillance tracker system.", "The research comes at a time when people are using more technology, and experts suggest that a more natural way of interacting with these devices could make it easier to use them efficiently.", "The virtual human face could also provide security and be used to turn on lights or make a cup of tea before the user leaves home."], "hermes3:3b": ["Summary:\nPutting faces to tech surveillance systems could improve user interaction and make gadgets more intuitive, as shown by avatars like 'Jeremiah' which react to behavior and can potentially become more interactive creatures (e.g.", "'Finn the fish')."], "stablelm-zephyr:3b": ["A new technology called \"avatar\" can make our interactions with high-tech gadgets better.", "These avatars are like virtual people that can react to how we behave and even alert us to new emails.", "Jeremiah is a free avatar that can be downloaded for computers.", "It has emotions, like being happy when children laugh or getting angry if ignored.", "This technology can help us use many gadgets more easily because it learns our habits over time.", "For example, it could turn on the lights before we come home or make sure our house is secure while we're away.", "People might not mind having a camera watching them as long as they can see what it's watching."], "chatgpt-4o-latest": ["Putting a face on technology could improve human interaction with gadgets.", "Avatars like Jeremiah, a virtual man created by Richard Bowden at the University of Surrey, react to human behavior using a surveillance tracker system.", "Jeremiah can display emotions but lacks intelligence, speech, or hearing.", "Future versions, like Finn the fish, aim to enhance interactivity.", "This research aligns with the growing need for intuitive technology interaction, potentially allowing systems to predict user behavior and automate tasks.", "While such surveillance may raise privacy concerns, a human-like interface could make it more acceptable."], "stablelm2:1.6b": ["A future exhibition at London's Science Museum showcased ideas for integrating avatars into technology to enhance interaction with gadgets.", "Examples include the virtual face Jeremiah and his upcoming successor Finn the fish, who will react to visual stimuli.", "Dr Richard Bowden explains that a more natural way of interacting allows devices to learn user behavior and predict actions.", "This could improve security features in home surveillance systems, such as anticipating when someone leaves on holiday.", "The concept challenges privacy concerns, but experts believe it could make technology use safer and more enjoyable."], "granite3.1-dense:2b": ["The text discusses the potential of integrating virtual human-like avatars, or 'faces', into technology to enhance user interaction with hi-tech gadgets.", "These avatars, such as Jeremiah and the upcoming Finn the fish, are designed to react to users' behaviors in a childlike manner, displaying emotions like happiness or sadness based on observed actions.", "Currently, they primarily serve as visual stimuli and do not possess conversational capabilities.", "However, researchers at the University of Surrey are developing their next versions to incorporate more interactive features, potentially even underwater environments.", "The goal is to create a more intuitive, human-like interface for managing smart home devices or surveillance systems.", "For instance, an avatar could anticipate user actions—turning on lights before you reach the kitchen or locking doors as you depart for vacation.", "Although some people initially found the idea of constant surveillance unsettling, reactions changed when they were introduced to virtual faces observing their activities instead of cameras.", "This concept aims to bridge the gap between technology and human interaction, making smart devices more accessible and user-friendly."]}