{"raw_text": "New Year's texting breaks record\n \n A mobile phone was as essential to the recent New Year's festivities as a party mood and Auld Lang Syne, if the number of text messages sent is anything to go by.\n \n Between midnight on 31 December and midnight on 1 January, 133m text messages were sent in the UK. It is the highest ever daily total recorded by the Mobile Data Association (MDA). It represents an increase of 20% on last year's figures.\n \n Wishing a Happy New Year to friends and family via text message has become a staple ingredient of the year's largest party. While texting has not quite overtaken the old-fashioned phone call, it is heading that way, said Mike Short, chairman of the MDA. \"In the case of a New Years Eve party, texting is useful if you are unable to speak or hear because of a noisy background,\" he said. There were also lots of messages sent internationally, where different time zones made traditional calls unfeasible, he said. The British love affair with texting shows no signs of abating and the annual total for 2004 is set to exceed 25bn, according to MDA. The MDA predicts that 2005 could see more than 30bn text messages sent in the UK. \"We thought texting might slow down as MMS took off but we have seen no sign of that,\" said Mr Short. More and more firms are seeing the value in mobile marketing. Restaurants are using text messages to tell customers about special offers and promotions.\n \n Anyone in need of a bit of January cheer now the party season is over, can use a service set up by Jongleurs comedy club, which will text them a joke a day. For those still wanting to drink and be merry as the long days of winter draw in, the Good Pub Guide offers a service giving the location and address of their nearest recommended pub. Users need to text the word GOODPUB to 85130. If they want to turn the evening into a pub crawl, they simply text the word NEXT. And for those still standing at the end of the night, a taxi service in London is available via text, which will locate the nearest available black cab.\n", "llama3.2:1b": ["New Year's texting breaks record with 133m messages sent in UK between December 31 and January 1.", "The Mobile Data Association predicts it could exceed 25bn in 2004.", "This increase reflects a shift towards mobile messaging as a staple of New Year's Eve parties, particularly for those unable to speak or hear due to background noise."], "llama3.2:3b": ["A record 133m text messages were sent in the UK between December 31st and January 1st.", "This represents a 20% increase from last year's figures, making it the highest ever daily total recorded by the Mobile Data Association.", "Texting has become increasingly popular as a way to celebrate New Year's Eve parties and stay connected internationally due to time zone differences."], "gemma2:2b": ["Over 133 million text messages were sent in the UK between New Year's Eve and New Year's Day, marking a record high for daily text usage.", "This trend reflects increased use of texting for personal communication and international connections.", "Text message popularity is predicted to continue rising with more than 25 billion expected in 2004 and potentially exceeding 30 billion in 2005.", "Some companies are capitalizing on the trend by using text messages for marketing purposes, while others offer services like jokes and pub recommendations.", "A taxi service also offers a convenient way to get around after New Year's celebrations."], "qwen2.5:0.5b": ["A high number of text messages was sent daily around New Year's Eve 2019 in the UK.", "The MDA predicted that more than 30bn texts would be sent in the UK in 2005.", "Text messaging has become a popular way to stay connected during special occasions like New Year's parties, as it allows for quicker and easier communication over long distances.", "There are also other applications and services available online or through mobile phones to stay updated on current events around the world."], "qwen2.5:1.5b": ["Text messages topped 133 million during New Year's Eve in the UK, marking the highest daily total ever recorded by the Mobile Data Association (MDA) and suggesting texting could surpass traditional phone calls as a favored communication method for celebrations.", "This trend is attributed to the convenience of text messaging when other methods like traditional phone calls are impractical due to time zone differences or noise issues.", "The forecast indicates that 2005 may see even higher text message numbers, with an expected total exceeding 25 billion by 2004.", "Companies like Jongleurs and Good Pub Guide utilize text messages for marketing purposes, offering promotions and guides to pubs during the festive season as well as transportation services for those still searching for joy at year's end."], "qwen2.5:3b": ["A mobile phone was integral to recent New Year's festivities, with 133 million text messages sent in the UK between midnight on December 31 and midnight on January 1, breaking a record.", "This number represents a 20% increase from the previous year.", "Texting has become an essential part of wishing friends and family Happy New Year, especially when phone calls are not feasible due to noisy backgrounds or international time zones.", "The Mobile Data Association (MDA) predicts that text message usage in the UK could exceed 30 billion in 2005, driven by mobile marketing efforts from companies like restaurants and comedy clubs offering daily jokes via texts.", "Other services include a pub crawl service where users can request directions to their nearest recommended pubs and a taxi service for those needing transportation home after parties."], "opencoder:1.5b": ["New Year's texting breaks records\n \n A mobile phone was crucial to recent New Year's festivities as a party mood and Auld Lang Syne, if the number of text messages sent is anything to go by.", "Between midnight on 31 December and midnight on 1 January, 133 million text messages were sent in the UK.", "It represents an increase of 20% on last year's figures.", "Wishing a Happy New Year to friends and family via text message has become a staple ingredient of the years largest party.", "Texting has not overtaken the old-fashioned phone call, said Mike Short.", "In the case of a New Years Eve party, texting is useful if you are unable to speak or hear because of a noisy background.", "There were also lots of messages sent internationally, where different time zones made traditional calls unfeasible.", "The British love affair with texting shows no signs of abating and the annual total for 2004 is set to exceed 25 billion.", "According to MDA, 2005 could see more than 30bn text messages sent in the UK.", "The MDA predicts that further development in mobile marketing will allow businesses to send a vast number of messages per day.", "Restaurants are using text messages to tell customers about special offers and promotions.", "Anyone looking for a bit of January cheer is now able to enjoy the season's long night with the party season over.", "Jingle all the way, Jongleurs comedy club provides texting services daily, encouraging users to engage in laughter."], "smollm:1.7b": ["The summary should be:\nNew Year's texting breaks record\nA mobile phone was as essential to the recent New Year's festivities as a party mood and Auld Lang Syne, if the number of text messages sent is anything to go by.", "Between midnight on 31 December and midnight on 1 January, 133m text messages were sent in the UK.", "It is the highest ever daily total recorded by the Mobile Data Association (MDA).", "It represents an increase of 20% on last year's figures.", "Wishing a Happy New Year to friends and family via text message has become a staple ingredient of the year's largest party.", "While texting has not quite overtaken the old-fashioned phone call, it is heading that way, said Mike Short, chairman of the MDA.", "\"In the case of a New Years Eve party, texting is useful if you are unable to speak or hear because of a noisy background,\" he said.", "There were also lots of messages sent internationally, where different time zones made traditional calls unfeasible, he said.", "The British love affair with texting shows no signs of abating and the annual total for 2004 is set to exceed 25bn, according to MDA.", "The MDA predicts that 2005 could see more than 30bn text messages sent in the UK.", "\"We thought texting might slow down as MMS took off but we have seen no sign of that,\" said Mr Short.", "More and more firms are seeing the value in mobile marketing.", "Restaurants are using text messages to tell customers about special offers and promotions.", "For those still wanting to drink and be merry as the long days of winter draw in, the Good Pub Guide offers a service giving the location and address of their nearest recommended pub.", "Users need to text the word GOODPUB to 85130.", "If they want to turn the evening into a pub crawl, they simply text the word NEXT.", "And for those still standing at the end of the night, a taxi service in London is available via text, which will locate the nearest available black cab."], "deepseek-r1:1.5b": ["The UK saw a record-breaking 133 million texts between December 31 and January 1, up by 20% compared to last year.", "Texting is popular as a mobile marketing tool, especially with friends and family, enhancing New Year celebrations while traditional calls struggle due to volume.", "International usage also increased because of time zone differences and noise.", "The MDA projected 2004 texts at over 25 billion, expecting even more in 2005.", "Restaurants use text messages for promotions, Joliet's comedy club offers joke texts daily, and the Good Pub Guide provides location services via texting, while \"NEXT\" requests turn the night into a pub crawl if needed."], "tinyllama:1.1b": ["A new year's texting record has been broken, with 133m messages sent by mobile phone users in the UK during New Year's Eve weekend.", "This is a rise of over 20% on last year's figures and is expected to continue growing as more people take advantage of the ease and convenience of sending messages.", "Texting has also become an important part of the traditional New Years Evite, with many people sending messages not only to friends and family but also to international contacts.", "The British love affair with texting shows no signs of abating and experts predict that 2005 could see over 30bn text messages sent in the UK.", "Restaurants are using mobile marketing services to promote special offers and promotions, while anyone looking for a bit of January cheer can use a service provided by Jongleurs comedy club and receive daily jokes via text message.", "Mobile taxi services are available for those still standing at midnight."], "tinydolphin:1.1b": [" In summary, the record-breaking New Year's texting numbers demonstrate that mobile phones have become an essential part of festive celebrations, with more and more businesses using them to communicate promotions and special offers.", "The trend towards sending text messages over MMS has also grown in popularity among consumers, highlighting the versatility and convenience of this medium for communication during occasions such as New Year's Eve parties."], "phi:2.7b": [" This article discusses how texting has become an essential part of New Year's celebrations and has set a new record for the most texts sent in one day in the UK.", "The MDA predicts that more than 25 billion messages will be sent by the end of 2005.", "Texting is not only used to communicate with friends and family but also for businesses to promote their services, such as restaurants using it to offer special deals or a comedy club texting jokes to its customers.", "Additionally, there are services available via text messaging for finding pubs and hiring black cabs."], "orca-mini:3b": [" The article reports that a record number of text messages were sent in the UK during New Year's celebrations, with 133 million messages being sent between midnight on December 31 and midnight on January 1.", "This represents an increase of 20% on last year's figures.", "Wishing a Happy New Year to friends and family via text message is becoming a staple ingredient of the year's largest party, with many firms seeing the value in mobile marketing through text messages.", "A service set up by Jongleurs comedy club will text users a joke a day, while the Good Pub Guide offers a location and address service for nearby recommended pubs.", "If users want to continue drinking and merrymaking into the long days of winter, they can use a service that will locate their nearest recommended pub.", "A taxi service in London is also available via text, which will locate the nearest available black cab."], "hermes3:3b": ["(  ( New Year's texting breaks record\n  UK sent 133m texts between NYE and New Year\n  Texting now staple part of New Year celebrations\n  Increasing yearly totals expected to exceed 25bn\n)"], "stablelm-zephyr:3b": ["A record-breaking 133 million text messages were sent in the UK during New Year's celebrations, marking the highest daily total ever recorded by the Mobile Data Association (MDA).", "Texting has become an essential part of New Year's festivities, especially for wishing Happy New Year to friends and family.", "The British love for texting shows no signs of slowing down, with predictions for 2004 reaching 25 billion messages and over 30 billion in 2005.", "More businesses are utilizing mobile marketing, such as restaurants sending special offers and promotions via text.", "Jongleurs comedy club provides a service to text someone a joke daily, while the Good Pub Guide allows users to find their nearest recommended pub by texting the word \"GOODPUB\" or \"NEXT\" for a pub crawl.", "A taxi service in London is also available through text, locating the nearest available black cab."], "chatgpt-4o-latest": ["A record 133 million text messages were sent in the UK between midnight on New Year's Eve and midnight on New Year's Day, a 20% increase from the previous year, according to the Mobile Data Association (MDA).", "Texting has become a key part of New Year celebrations, offering a convenient alternative to phone calls, especially in noisy environments or across time zones.", "The UK's enthusiasm for texting continues to grow, with over 25 billion messages expected in 2004 and projections of more than 30 billion in 2005.", "Businesses are increasingly using text messaging for marketing, and various services, such as daily jokes, pub recommendations, and taxi bookings, are available via text."], "stablelm2:1.6b": ["A record-breaking number of text messages were sent during New Year festivities, with an increase of 10% compared to last year's figures.", "Wishing friends and family on this occasion has become increasingly popular via texting while phone calls become less conventional due to time zone differences.", "Text messaging is expected to surpass MMS in terms of volume as businesses shift towards mobile marketing.", "Jongleurs comedy club offers daily text-based jokes, while users can find recommended pubs by texting \"GOODPUB\" or \"NEXT.\"", "Additionally, the Good Pub Guide provides a taxi service via text for those needing transportation after consuming."], "granite3.1-dense:2b": ["The recent New Year's Eve celebrations saw an unprecedented 133 million text messages sent in the UK between midnight on December 31 and January 1, marking a 20% increase from the previous year's record.", "This surge in texting underscores its growing importance as a means to communicate during the festivities, particularly when voice calls are impractical due to noise or other reasons.", "Mike Short, chairman of the Mobile Data Association (MDA), noted that while texting has not yet replaced phone calls, it is rapidly approaching that milestone.", "The annual UK text message volume for 2004 was around 13 billion and is projected to exceed 25 billion by 2005, potentially surpassing 30 billion in 2005.", "The MDA observes no slowdown in the trend despite the rise of Multimedia Messaging Service (MMS).", "More businesses are recognizing text messaging's value for marketing purposes, with restaurants using it to share special offers and promotions.", "Post-party, services like Jongleurs' joke-of-the-day texts and the Good Pub Guide's location recommendations via text encourage continued social engagement.", "In London, a taxi service is available through text, connecting users with nearby black cabs for a post-nightcap ride home."]}