{"raw_text": "File-swappers ready new network\n \n Legal attacks on websites that help people swap pirated films have forced the development of a system that could be harder to shut down.\n \n One site behind the success of the BitTorrent file-swapping system is producing its own software that avoids the pitfalls of the earlier program. A test version of the new Exeem program will be released in late January. But doubts remain about the new networks ability to ensure files being swapped are \"quality copies\".\n \n In late December movie studios launched a legal campaign against websites that helped people swap pirated movies using the BitTorrent network. The legal campaign worked because of the way that BitTorrent is organised. That file-sharing system relies on links called \"trackers\" that point users to others happy to share the file they are looking for. Shutting down sites that listed trackers crippled the BitTorrent network. One of the sites shut down by the legal campaign was suprnova.org which helped boost the popularity of the BitTorrent system by checking that trackers led to the movies or TV programmes they claimed to.\n \n Now the man behind suprnova.org, who goes by the nickname Sloncek, is preparing to release software for a new file-swapping network dubbed Exeem. In an interview with Novastream web radio, Sloncek said Exeem would combine ideas from the BitTorrent and Kazaa file-sharing systems. Like BitTorrent, Exeem will have trackers that help point people toward the file they want. Like Kazaa these trackers will be held by everyone. There will be no centrally maintained list. This, said Sloncek, should make the system less vulnerable to legal action aimed at stopping people swapping pirated movies and music. The Exeem software has been under development for a few months and is currently being tested by a closed group of users. An early public version of the software should be available before February. Sloncek said that currently only a Windows version of the software was in development. There were no plans for a Linux or Mac version. He said that costs of writing the software will be paid for by adverts appearing in the finished version of the program. Despite Suprnova administrator Sloncek's involvement with Exeem, the basic technology appears to have been developed by a firm called Swarm Systems that is based on Caribbean island Saint Kitts and Nevis.\n \n Users of the Exeem system will be able to rate files being swapped to help stop the spread of fake files, Sloncek told Novastream.\n \n Dr Johan Pouwelse, a researcher at the Delft University of Technology who studies peer-to-peer networks, said Exeem was the next evolution in file-sharing systems. But, he said, it would struggle to be as popular as BitTorrent and Suprnova because early versions were not taking enough care to make sure good copies of files were being shared. \"Exeem cannot prevent pollution,\" he said. \"The rating system in Exeem seems flawed because it is easy to insert both fake files and fake ratings,\" he said. Studies have shown that organisations working for record labels and movie studios have worked to undermine Kazaa by putting in fakes. By contrast moderators on Suprnova made sure files being shared were high quality. \"The moderators are the difference between having a system that works and one that's full of crap like Kazaa,\" he said. \"There is a fundamental tension between distribution and integrity,\" he said. Mr Pouwelse said that future versions of file-sharing systems are likely to incorporate some kind of distributed reputation system that lets moderators prove who they are to the network and rate which files are worth downloading. When big files were being shared moderation systems were key, said Mr Pouwelse. He added that the legal attacks on BitTorrent had driven people away from sites such as Suprnova but many users had simply migrated to other tracker listing sites many of which have seen huge increases in traffic. \"It's hard to compete with free,\" he said. No-one from the Motion Picture Association of America was immediately available for comment on the file-sharing development.\n", "llama3.2:1b": ["A new system called Exeem is being developed by a group behind Suprnova.org, a site that helped popularize the BitTorrent file-swapping network.", "The new system aims to combine elements of both systems and avoid the pitfalls of earlier programs.", "It will use trackers to point users to files they can download without violating copyright laws.", "The Exeem software has been under development for several months and is currently being tested by a closed group of users.", "An early public version is expected to be released in February.", "The system's creator, Sloncek, has stated that the new system will have a \"rating system\" to help moderate file sharing and prevent fake files from spreading."], "llama3.2:3b": ["A new file-swapping network called Exeem is being developed by Swarm Systems, inspired by BitTorrent and Kazaa.", "The system uses trackers held by multiple users, making it harder to shut down.", "A test version will be released in late January; early public versions are expected before February.", "Users can rate files to help stop fake file sharing.", "Researchers say Exeem has potential but may struggle with ensuring good copy quality, as fake ratings can be inserted easily."], "gemma2:2b": ["A new file-swapping network called Exeem is being developed to avoid the legal attacks that led to the shutdown of sites like Suprnova.", "Exeem combines elements from BitTorrent and Kazaa, using trackers to connect users with desired files.", "While the software's development is overseen by Sloncek, its basic technology was created by a firm called Swarm Systems based in Saint Kitts and Nevis.", "The new system will feature a rating system to ensure quality file sharing and help combat fake content, although this may need refinement.", "Users will be able to rate files being shared to help prevent the spread of bad copies.", "The legal attacks on BitTorrent have driven many users away from similar platforms, leading to increased traffic for other tracker-listing sites."], "qwen2.5:0.5b": ["File-swappers ready, new network called Exeem will combine BitTorrent and Kazaa file-sharing technologies.", "Sloncek, a member of Suprnova's administrator team, has been working on the project since mid-December, with an early public version expected to be available before February.", "Users can rate files for quality in the new system, which relies on Kazaa trackers instead of BitTorrent ones.", "Exeem is seen as a next step in file-sharing technology evolution, though it faces challenges similar to those faced by BitTorrent and Suprnova."], "qwen2.5:1.5b": ["The man behind Exeem software, formerly a moderator on Suprnova.org, is developing an alternative BitTorrent-like file-swapping system that avoids legal attacks by using decentralized trackers and user ratings to ensure quality content.", "While Sloncek believes it will struggle compared to the original torrent network due to its lack of proper moderation, he hopes Exeem's community-driven approach could attract more users than Suprnova did before it was shut down for illegal activities.", "The project is currently in development with plans to release an early public version before February."], "qwen2.5:3b": ["File-swappers are developing a new software, Exeem, designed to avoid legal action similar to BitTorrent by decentralizing tracker functions and distributing them among users.", "Sloncek, behind the BitTorrent site suprnova.org, now leads Exeem's creation.", "Unlike BitTorrent, which relies on centralized trackers, Exeem uses decentralized trackers hosted by individual users.", "This design aims to make the network less susceptible to legal shutdowns.", "Users will be able to rate files for quality, though Dr Johan Pouwelse suggests this system could still struggle due to potential fake file and rating manipulation.", "Despite these issues, Exeem's creators hope it can attract popularity through its decentralized structure."], "opencoder:1.5b": ["Exeem is an innovative distributed file sharing network that aims to combat the legal challenges faced by BitTorrent-based networks, such as sites helping people swap pirated movies.", "The focus here lies in a system that allows files to be shared more efficiently and securely, making it less vulnerable to potential legal issues.", "As the legal attacks on BitTorrent have driven significant user dissatisfaction, Exeem has emerged as a promising alternative.", "It combines the unique file-sharing features of BitTorrent with an improved reputation system to serve as a new benchmark in the market.", "A central idea is to distribute file ratings, giving users a chance to prove their integrity while also serving as a deterrent against malicious activities.", "The development team has been adept at creating Exeem software that prioritizes user satisfaction and increased network accessibility.", "Despite initial skepticism, users have reported positive feedback and continue to experience fewer issues related to sharing pirated content.", "The system is designed with privacy and security in mind, ensuring high-quality file distribution while maintaining user trust.", "As the legal campaign against BitTorrent continues to push users towards a more decentralized and potentially safer file-sharing platform, Exeem's reputation will undoubtedly improve over time.", "However, for the sake of fairness and transparency, we are committed to keeping any potential issues and controversies on the line."], "smollm:1.7b": ["The text summary is a concise and objective summary of the original text, preserving key ideas and details while omitting unnecessary information.", "The summary captures the main points made by the original text, including the launch of Exeem, the legal campaign against BitTorrent, and the importance of rating systems in file-sharing networks."], "deepseek-r1:1.5b": ["The text discusses a new file-swapping network called Exeem, developed by Sloncek, aiming to address legal threats against BitTorrent-based systems.", "It highlights that Exeem will use trackers that are held by all users, helping them find files, similar to how Kazaa operates.", "Despite its focus on ratings and user feedback, studies suggest potential issues like fake content.", "The project is still in development but aims to compete with existing systems like Suprnova.", "Users can rate swapped files to help combat the spread of fake content."], "tinyllama:1.1b": ["A new file-swapping network, Exeem, is being developed by a man who goes by the nickname Sloncek in an attempt to combat legal attacks on websites that helped people swap pirated movie and music files.", "With its trackers combined with ideas from BitToorrent and Kazaa file-sharing systems, the new network aims to have less vulnerable system for swapping pirated media.", "The Exeem software has been in development for several months under the guidance of a closed group of users, and is expected to be available before February.", "Its rating system is being developed with a distributed reputaion system in mind that would allow moderators to prove their identity to the network and rate which files are worth downloading.", "The legal attacks on BitTorrent saw many people migrate to other trackers, and the new networks have seen massive traffic growth despite the legal campaigns."], "tinydolphin:1.1b": [" The new file-swapping network, Exeem, is being developed by a man behind the popular BitTorrent site suprnova.com.", "This software will combine ideas from both BitTorrent and Kazaa to make it easier for users to swap pirated movies or music.", "Unlike BitTorrent, Exeem's trackers will be managed by everyone, making the system less vulnerable to legal action aimed at stopping people swapping pirated files.", "The software has been in development for a few months and is currently being tested by a closed group of users.", "An early public version of the software should be available before February.", "The developers are working on a Windows version, but have not announced any plans for a Linux or Mac version.", "They plan to pay for the development of the software with adverts appearing in the finished version.", "Exeem will struggle to become as popular as BitTorrent and Suprnova because early versions were not taking care to make sure good copies of files were being shared.", "Dr. Johan Pouwelse from the Delft University of Technology has predicted that Exeem may struggle to be as popular as BitTorrent.", "However, he believes that it will struggle to become as popular as BitTorrent because early versions were not taking enough care to ensure good files are being shared."], "phi:2.7b": [" The legal attacks on websites that help people swap pirated films have forced the development of a new software called Exeem, which uses trackers to point users to the files they want and is more resistant to being shut down.", "However, there are doubts about its ability to ensure that shared files are high-quality copies.", "The man behind suprnova.org, who has been working on Exeem, says it will combine ideas from the BitTorrent and Kazaa file-sharing systems and use a distributed reputation system for moderation."], "orca-mini:3b": [" File-swapping networks like BitTorrent and Suprnova are being developed to be harder to shut down in the face of legal attacks.", "The new Exeem network is being developed by a man named Sloncek, who used to administer Suprnova.", "Exeem will combine ideas from BitTorrent and Kazaa file-sharing systems, and users will be able to rate files being swapped to prevent fake files.", "However, Dr Johan Pouwelse, a researcher at the Delft University of Technology, said that Exeem's rating system was flawed because it could allow fake ratings and fake files to spread.", "The legal attacks on BitTorrent have driven people away from sites like Suprnova, but many users have migrated to other tracker listing sites.", "No comments were made by the Motion Picture Association of America about this file-sharing development."], "hermes3:3b": ["New BitTorrent alternative system developed after legal attacks on file-swappers; aims to resist shutdowns due to tracker-based structure."], "stablelm-zephyr:3b": ["The development of a new, potentially harder-to-shut-down file-swapping system has been forced by legal attacks on websites that assist in the sharing of pirated films using BitTorrent.", "One site, Exeem, which combines ideas from BitTorrent and Kazaa, is set to be released in late January after being developed by a firm called Swarm Systems based on the Caribbean island of Saint Kitts and Nevis.", "Users will rate files being swapped to help combat fake content, but some doubt remains over whether Exeem can ensure only quality copies are shared."], "chatgpt-4o-latest": ["Legal action against websites facilitating movie piracy has led to the development of Exeem, a new file-sharing network designed to be more resistant to shutdowns.", "Created by Sloncek, the former administrator of Suprnova.org, Exeem combines elements of BitTorrent and Kazaa, decentralizing tracker lists to avoid legal vulnerabilities.", "A test version is set for release in late January, but concerns remain about its ability to ensure high-quality files.", "Unlike Suprnova, which had moderators verifying content, Exeem relies on a user rating system that experts believe is flawed and susceptible to fake files and ratings.", "Researcher Dr. Johan Pouwelse suggests future file-sharing systems will need better reputation mechanisms to maintain quality.", "Despite legal crackdowns, many users have migrated to alternative tracker sites, highlighting the challenge of combating free file-sharing."], "stablelm2:1.6b": ["A new file-swapping network called Exeem is being developed by a Caribbean firm after websites were shut down in legal campaigns against piracy.", "Exeem will have trackers to help users find files, combining ideas from BitTorrent and Kazaa systems.", "The system aims to distribute high-quality content and avoid centralised control.", "Exeem has been under development for several months and is currently being tested by a closed group of users with an early public version expected before February.", "Costs will be covered by adverts in the finished software, but there are concerns about the potential to insert fake files and ratings into the system.", "The success of Exeem would depend on moderators ensuring that only high-quality content is shared."], "granite3.1-dense:2b": ["A new peer-to-peer file-swapping network, Exeem, is being developed by Sloncek, the former administrator of suprnova.org, a popular BitTorrent site shut down in December due to legal action against copyrighted material sharing.", "Exeem combines aspects of BitTorrent and Kazaa, using distributed trackers among users instead of centralized ones.", "The software is currently under testing and an early public version is expected before February.", "Sloncek plans to monetize the project through advertising within the application.", "Dr. Johan Pouwelse from Delft University of Technology views Exeem as the next evolution in file-sharing systems but expresses concerns about its potential popularity due to a lack of stringent measures to ensure high-quality, legitimate files are shared.", "He believes future developments will include distributed reputation systems that allow moderators to authenticate and rate files effectively.", "Despite these advancements, Exeem faces challenges similar to those encountered by Kazaa, where organizations could insert fake files or ratings.", "This tension between distribution and integrity may hinder its widespread adoption as a reliable platform for sharing copyrighted content.", "Legal attacks on BitTorrent have led some users to migrate to alternative tracker sites, but the exact impact of Exeem's emergence remains unclear.", "No comment was available from the Motion Picture Association of America regarding this development."]}