{"raw_text": "Online games play with politics\n \n After bubbling under for some time, online games broke through onto the political arena in 2004.\n \n The US presidential election provided a showcase for many, aimed at talking directly to a generation that has grown up with joysticks and gamepads. Experts say this reflects how video games are becoming a mainstream part of culture and society. The first official political campaign game was technically launched during the last week of 2003: the Iowa Game, commissioned by the Democrat hopeful Howard Dean. More than 20 followed suit, including Frontrunner, eLections, President Forever and The Political Machine, which allowed players to run an entire presidential campaign, including having to cope with the media. Others helped raise the stakes during the Bush/Kerry contest by highlighting a candidate's virtues or his vices.\n \n The phenomenon has astonished the forefathers of political games, a handful of multi-discipline games enthusiasts keen to push frontiers.\n \n \"When I started researching political games at the university, about five years ago, I thought it was going to be something that would take decades to happen,\" said Gonzalo Frasca, computer games specialist at the Information Technology University of Copenhagen. \"I must admit that I was the first person to be surprised at seeing how fast they have evolved,\" added the Uruguayan-born researcher, who has so far created games for two political campaigns. Many artists and designers are experimenting with this form of gaming with an agenda in projects such as newsgaming.com. The aim is to comment on international news events via games.\n \n The ability of games to simulate reality makes them a powerful modelling tool to interact with actual situations in an original way.\n \n \"Video games generate strong reactions mainly because they are new, but also because our culture needs to learn how to deal with simulation,\" Mr Frasca told the BBC News website. This was the case with the one he created for a political party in Uruguay, Cambiemos, an online puzzle game that offered a view on how the country's problems could be solved by working together. \"It's up to us to explore what we can learn from ourselves through play and video games.\" Ultimately, Dr Frasca sees games as a small laboratory where we can play with our hopes, fears and beliefs. \"Children learn a lot about the world through play. There is no reason why we adults should stop doing it as we grow up.\"\n \n But experts estimate it will still take at least about a decade until this new breed of video gaming communication become a common tool for political campaigns.\n \n This is hardly surprising, compared to other forms of mass media like the worldwide web. Only a few years ago, most politicians did not have a webpage, while now it is almost a must-have. Dr Frasca said: \"Political campaigns will continue to experiment with video games. They represent a new tool of communication that can reach a younger audience in a language that can clearly speak to them.\" \"It will not replace other forms of political propaganda, but it will integrate itself on to the media ecology of political campaigns.\"\n", "llama3.2:1b": ["Online games play with politics by simulating real-world situations and allowing players to make decisions and interact with candidates.", "The first official political campaign game was launched in 2003, aiming to engage a younger generation.", "Experts predict that online games will become more prominent in political campaigns within the next decade.", "Games can simulate reality, making them an effective tool for interacting with actual situations and exploring new perspectives.", "Researchers are experimenting with using games to comment on international news events."], "llama3.2:3b": ["Online games entered the political arena in 2004 with the US presidential election, allowing players to run campaigns and interact with media.", "The phenomenon has surprised game enthusiasts and experts, who see games as a powerful tool for interactive modeling and simulation.", "However, it will take at least a decade for video gaming communication to become a common tool for political campaigns."], "gemma2:2b": ["Online games are increasingly being used in political campaigns, with games like The Political Machine allowing players to simulate an entire presidential campaign.", "These games reflect how video games are becoming a mainstream part of culture and society.", "The use of games offers a unique opportunity for interaction with real-world situations through simulation.", "As this form of communication evolves, it may become common in political campaigns, especially among younger audiences."], "qwen2.5:0.5b": ["Online games have become part of politics; they are used by politicians and artists to simulate reality.", "Games make new languages for people to understand each other better, which can help them communicate more effectively.", "These games are also a way for young people to connect with their parents or older siblings, making them even more important as communication tools."], "qwen2.5:1.5b": ["Online games are increasingly being used for political purposes, with the Iowa Game and Frontrunner becoming prominent examples.", "Games allow players to run a presidential campaign, highlighting candidates' strengths or weaknesses, while also offering commentary on current events through newsgaming.", "This trend reflects how video games have become more mainstream as they simulate reality, allowing adults to learn from childhood play techniques in engaging with political campaigns.", "While experts predict it will take about 10 years for this method of communication to reach common use among politicians and campaigns, it is likely to be a significant addition to the media ecology of political discourse."], "qwen2.5:3b": ["Online games have increasingly entered the political arena since 2004, exemplified by the US presidential election.", "The Iowa Game, launched in 2003 for Howard Dean’s campaign, was followed by over 20 other official and unofficial games designed to simulate running a presidential campaign.", "These games aimed at engaging younger voters who grew up with video games as part of their culture.", "Experts like Gonzalo Frasca were initially skeptical about the speed of political game development but are now surprised by its rapid advancement.", "Frasca, a researcher at Copenhagen University, created games for two political campaigns and founded newsgaming.com to comment on international news via gaming projects.", "He argues that video games’ ability to simulate reality makes them powerful tools for interacting with actual situations in innovative ways.", "Frasca sees this form of gaming as a small laboratory where individuals can explore their hopes, fears, and beliefs through play.", "Despite the potential impact, experts estimate it may take about a decade for video game communication to become a common tool for political campaigns.", "However, Frasca believes that these games will complement rather than replace traditional propaganda methods used by politicians."], "opencoder:1.5b": ["Online gaming is a means for people to interact with reality as they would with an everyday object.", "From creating puzzles and games to simulating complex political scenarios, online gaming offers an exciting alternative to traditional methods of communication.", "In 2004, the development of the Iowa Game allowed fans of the US presidential election campaign to run an entire campaign, expanding from a single game to multiple ones.", "This was done by breaking up the campaign into smaller games that could be played together or individually as needed.", "The ability of these games to simulate reality provides them with a unique way of interacting with actual situations in an original way.", "The phenomenon of \"video gaming generate strong reactions mainly because they are new, but also because our culture needs to learn how to deal with simulation\" is well-stated by the BBC News website.", "This is the case with the game developed for a political party in Uruguay, Cambiemos, where it offers an interactive way of understanding and dealing with problems within a country.", "In conclusion, the creation of new breed of video gaming communication, such as the Iowa Game, will continue to evolve and adapt with more and more people moving into the online age.", "This is not just about finding new methods of communication but also about ensuring that these new tools are integrated seamlessly into existing political strategies."], "smollm:1.7b": ["Summarizing the text:\nThe article discusses online games playing with politics.", "The first part explains how online games broke through onto the political arena in 2004 and how they became a mainstream part of culture and society.", "The second part highlights how video games are becoming a mainstream part of culture and society, and how they can be used as a tool for political campaigns.", "The third part mentions that experts say this reflects how online games are becoming a mainstream part of culture and society."], "deepseek-r1:1.5b": ["The rise of online games in political contexts began around 2004 with the Iowa Game, launched by Howard Dean.", "This game allowed political campaign participants to run full presidential campaigns, including running opponents or focusing on a candidate's virtues versus vices.", "Video games were seen as a simulation tool for learning and exploration, though not direct interaction.", "Experts estimate that this might take at least a decade to become mainstream, replacing traditional media but integrating into the media ecology of political campaigns.", "The rise of younger players is aiding the shift towards gaming platforms like newsgaming.com, aiming to connect with younger audiences through these tools."], "tinyllama:1.1b": ["The rise of online games has played a significant role in the evolution of political communication, and experts are predicting that it will take at least a decade before this new breed becomes common.", "With video games offering a way to simulate reality, politicians can now reach younger audiences in a language that is easily understood, making them a powerful tool for interactivity and debate.", "Dr. Gonzalo Fracca, a computer games specialist and expert in political games, believes that these games offer the opportunity to explore ideas and beliefs through play, and has already created newsgaaming.com, a platform where people can comment on actual events by playing online puzzle games.", "Though it may take time for this new form of communication to replace other forms of propaganda, experts anticipate that political campaigns will continue to experiment with video games, as they offer a way to reach younger audiences and integrate themselves into the media ecology of political campaigns."], "tinydolphin:1.1b": [" In summary, online games have become an essential part of modern politics and society.", "They provide a unique way for players to engage with the issues and candidates.", "Examples include presidential elections and political campaigns.", "The first official political campaign game was launched in 2004, while other examples have emerged since then.", "This trend is expected to continue for years to come."], "phi:2.7b": [" The use of online games has become increasingly popular and mainstream in society.", "These games were initially created as simulations and have since been used for various purposes such as political campaigns.", "Experts believe that video games are a powerful tool for communication, allowing people to interact with real-life situations in an original way.", "One example is a game created by Gonzalo Frasca for a Uruguayan political party, which offered a view on how the country's problems could be solved by working together.", "However, it is estimated that it will take at least a decade before this new form of communication becomes commonplace in political campaigns."], "orca-mini:3b": [" Online games have broken through onto the political arena since 2004.", "The phenomenon has astonished experts and few multi-discipline games enthusiasts who push frontiers.", "Many artists and designers are experimenting with this form of gaming by commenting on international news events via games.", "Video games generate strong reactions mainly because they are new, but also because our culture needs to learn how to deal with simulation.", "Children learn a lot about the world through play, and there is no reason why adults should stop doing it as we grow up.", "Political campaigns will continue to experiment with video games and integrate them onto the media ecology of political campaigns."], "hermes3:3b": ["Online games entered politics, with several video game-based presidential election simulations emerging after Howard Dean's Iowa Game in 2004.", "These games aim to reach younger audiences and simulate reality for original situations, but still face a decade-long growth period."], "stablelm-zephyr:3b": ["Online games started becoming involved with politics around 2004, especially during presidential elections.", "Many video game campaigns were created for candidates, allowing players to run a campaign and even deal with media.", "These games help show how video games are becoming part of culture and society.", "Researchers have found that political games can be used as powerful tools to understand real-life situations.", "Though it might still take about a decade for this new form of video gaming communication to become common in politics, experts believe it has the potential to reach a younger audience and integrate into other forms of political propaganda."], "chatgpt-4o-latest": ["Online games entered the political arena in 2004, particularly during the U.S. presidential election, as a way to engage younger voters.", "The first official political campaign game, the Iowa Game, was launched in late 2003 for Howard Dean, followed by over 20 others, including The Political Machine and President Forever, which allowed players to simulate running a campaign.", "Experts, including researcher Gonzalo Frasca, were surprised by the rapid evolution of political gaming.", "Many artists and designers are using games to comment on current events, leveraging their ability to simulate reality.", "Frasca sees games as a tool for exploring societal issues and believes they can serve as a \"laboratory\" for hopes and beliefs.", "While political gaming is still emerging, experts predict it will take about a decade to become a common campaign tool, much like websites did in earlier years.", "Video games will not replace traditional political media but will integrate into campaign strategies to engage younger audiences."], "stablelm2:1.6b": ["Online games entered the political arena during the US presidential election and became mainstream as video games are becoming part of culture and society.", "The first official political campaign game was launched around this time.", "Experts say that these games reflect how video games are increasingly being integrated into everyday life.", "Games like The Political Machine allowed players to run an entire presidential campaign, managing the media and dealing..", "The phenomenon astonished the forefathers of political games; it evolved faster than expected.", "Games offer a powerful modelling tool for interacting with actual situations in a unique way.", "\"Video games generate strong reactions mainly because they are new but also because our culture needs to learn how to deal with simulation,\" said Gonzalo Frasca, computer games specialist at the Information Technology University of Copenhagen.", "However, it will still take at least about a decade until this new breed of video gaming communication becomes a common tool for political campaigns.", "It remains to be seen how this new breed of video gaming communication will integrate itself into the media ecology of political campaigns."], "granite3.1-dense:2b": ["In 2004, online games began to intersect with politics, serving as a novel platform for engaging younger generations in political discourse.", "This shift was initially observed during the US presidential elections, starting with Howard Dean's Iowa Game in late 2003.", "Over 20 subsequent games followed, such as Frontrunner, eLections, President Forever, and The Political Machine, allowing players to simulate entire presidential campaigns, complete with media management.", "These games highlighted candidates' strengths or weaknesses, demonstrating their potential in shaping political narratives.", "Gonzalo Frasca, a computer games specialist, expressed surprise at the rapid development of this genre.", "He began researching political games five years prior and initially anticipated it would take decades to emerge.", "Now, he acknowledges the rapid evolution and its implications for political communication.", "Artists and designers are also experimenting with this medium in newsgaming projects like newsgaming.com, using games to comment on international news events.", "The unique ability of video games to simulate reality makes them an effective tool for exploring real-world issues and fostering engagement among players.", "Frasca emphasizes that adults should continue learning from play and video games as they grow older.", "While experts predict it will take at least a decade before this form of political communication becomes standard, the potential remains high for integrating games into mainstream political campaigns, reaching younger audiences in an engaging manner that complements existing forms of political propaganda."]}