{"raw_text": "Broadband challenges TV viewing\n \n The number of Europeans with broadband has exploded over the past 12 months, with the web eating into TV viewing habits, research suggests.\n \n Just over 54 million people are hooked up to the net via broadband, up from 34 million a year ago, according to market analysts Nielsen/NetRatings. The total number of people online in Europe has broken the 100 million mark. The popularity of the net has meant that many are turning away from TV, say analysts Jupiter Research. It found that a quarter of web users said they spent less time watching TV in favour of the net\n \n The report by Nielsen/NetRatings found that the number of people with fast internet access had risen by 60% over the past year.\n \n The biggest jump was in Italy, where it rose by 120%. Britain was close behind, with broadband users almost doubling in a year. The growth has been fuelled by lower prices and a wider choice of always-on, fast-net subscription plans. \"Twelve months ago high speed internet users made up just over one third of the audience in Europe; now they are more than 50% and we expect this number to keep growing,\" said Gabrielle Prior, Nielsen/NetRatings analyst. \"As the number of high-speed surfers grows, websites will need to adapt, update and enhance their content to retain their visitors and encourage new ones.\" The total number of Europeans online rose by 12% to 100 million over the past year, the report showed, with the biggest rise in France, Italy, Britain and Germany.\n \n The ability to browse web pages at high speed, download files such as music or films and play online games is changing what people do in their spare time.\n \n A study by analysts Jupiter Research suggested that broadband was challenging television viewing habits. In homes with broadband, 40% said they were spending less time watching TV. The threat to TV was greatest in countries where broadband was on the up, in particular the UK, France and Spain, said the report. It said TV companies faced a major long-term threat over the next five years, with broadband predicted to grow from 19% to 37% of households by 2009. \"Year-on-year we are continuing to see a seismic shift in where, when and how Europe's population consume media for information and entertainment and this has big implications for TV, newspaper and radio,\" said Jupiter Research analyst Olivier Beauvillian.\n", "llama3.2:1b": ["The number of Europeans with broadband internet has increased over the past year, leading to a decrease in TV viewing habits.", "A report by Nielsen/NetRatings found that 54 million people are now online in Europe, up from 34 million last year.", "The growth is driven by higher speeds and more choice in subscription plans.", "This shift will require websites to adapt their content to retain viewers.", "Broadband users account for over half of the European population online, with significant increases seen in Italy (120% rise) and Britain (almost doubling)."], "llama3.2:3b": ["Europeans with broadband have increased to 54 million, up from 34 million last year, with the web now eating into TV viewing habits, according to Nielsen/NetRatings and Jupiter Research.", "The number of people online has broken the 100 million mark, with France seeing a 12% increase.", "Broadband users are spending less time watching TV, with a quarter saying they prefer the net."], "gemma2:2b": ["Broadband usage has significantly increased in Europe over the past year, with many people substituting traditional television viewing time for online activities.", "The growth is fueled by lower prices and diverse fast-net subscription plans.", "This shift is impacting TV viewing habits as a quarter of internet users report reduced TV consumption.", "Jupiter Research predicts that broadband's share of households will increase from 19% to 37% in the next five years, posing a long-term threat to traditional television viewing."], "qwen2.5:0.5b": ["### Summary\n\nThe number of Europeans with broadband internet has increased dramatically over the past year, with Nielsen/NetRatings estimating that almost 54 million people are connected to the web via broadband.", "This growth is attributed to a decline in TV viewing habits and an increase in online content access.", "The study found that British users spent more time on the internet than they did watching traditional TV shows or movies.", "### Key Points\n\n- **Broadband Growth**: Nearly 54 million people are connected to broadband, up from 34 million a year ago.", "- **TV Usage Decline**: Nielsen/NetRatings estimates that almost 50% of adults in Europe watch TV daily.", "For many, the shift towards online content has made it harder to consume traditional TV shows or movies.", "- **Growing Internet Adoption**: The ability to access high-speed internet is transforming how people spend their time.", "- **TV Company Challenges**: As broadband usage grows, TV companies face an increasingly difficult challenge as viewers shift from watching traditional media to consuming the internet at high speed and downloading content online."], "qwen2.5:1.5b": ["Broadband usage among Europeans has increased significantly over the past year, with broadband penetration rising from 34 million to 54 million users, nearly doubling in some countries like Italy, Britain, France, and Germany.", "This growth is attributed to lower prices and a wider selection of always-on internet plans.", "As more people access the internet faster, websites need to adapt their content to attract and retain visitors.", "The report from Nielsen/NetRatings suggests that 40% of broadband users spend less time watching TV, with particularly significant impacts in countries where broadband adoption is growing rapidly, such as the UK, France, and Spain."], "qwen2.5:3b": ["The number of Europeans with broadband internet access has surged by 60% over the past year, reaching just over 54 million users (up from 34 million).", "This trend is altering viewing habits; 25% of web users spend less time watching TV due to online activities.", "High-speed internet use increased from one third to more than half of Europe’s audience in a single year, driven by lower costs and greater choice.", "The growth is most pronounced in Italy (120%), Britain (almost doubling), France, Germany, Spain, and the UK, where broadband has grown significantly.", "This shift challenges TV viewing habits; 40% of broadband users with TV at home spend less time watching it.", "Jupiter Research predicts that by 2009, broadband will account for up to 37% of households, posing a major threat to traditional television viewing over the next five years."], "opencoder:1.5b": ["Broadband challenges TV viewing\n\nThe number of European households with broadband has risen significantly over the past 12 months, with web users dominating.", "According to market analysts Nielsen/NetRatings, the total number of people online in Europe is projected to reach 100 million by 2025.", "The popularity of the net as a medium has led many to turn away from TV.", "Research suggests that a quarter of internet users view content more than once per day, compared to 12 times per week on TV.", "Fast internet access had an increased percentage point in Italy, with growth peaking in December, followed by growth in France and Spain.", "The rise in Britain was slower but doubled in comparison to Australia, which also experienced a surge in web usage.", "The rapid increase was fueled by lower prices and plans for always-on, fast-net subscriptions.", "Fast internet users have grown more than 50% since the last year, with an average age of about 32 years old.", "This figure is projected to keep growing in Europe over the next several years, with the growth expected to continue even further.", "The ability to browse web pages at high speed, download files such as music or films and play online games has transformed what people do in their spare time.", "The report suggests that this increased capability could lead to a rethinking of entertainment options for both households and businesses alike.", "According to Jupiter Research, the threat posed by broadband has not been felt in some countries like Japan where it was less common due to concerns over digital disruption caused by internet slowdowns.", "The growth predicted from 19% to 37% of households by 2009 is expected to continue."], "smollm:1.7b": ["The summary is concise and clear, preserving the key ideas and details of the original text.", "It provides a brief overview of the main points made in the text, including the number of Europeans with broadband, the rise of online TV viewing habits, and the impact of broadband on traditional TV viewing habits.", "The summary does not provide any explanations or reasoning processes, but rather presents the information as it is."], "deepseek-r1:1.5b": ["Broadband challenges TV viewing  \nMarket analysts from Nielsen/NetRatings reported that the number of Europeans connected to the internet via broadband increased by 60% over a year.", "Approximately 54 million people were online in Europe, up from 34 million a year earlier, surpassing 100 million in total usage.", "Analysts from Jupiter Research highlighted that net use is driving viewers away from TV, noting that a quarter of web users spent less time watching TV than playing games or streaming videos.", "Speedier internet access has made it difficult for traditional TV companies to retain viewers, with growth particularly significant in the UK, France, and Spain.", "High-speed users now make up over half the European audience, with websites requiring updated content to maintain user engagement."], "tinyllama:1.1b": ["Based on the data provided by Nielsen/NetRatings in their report titled \"Broadband Chaullenges TV Viewing Habits\", it can be summarized that:\n\n- The number of people with broadband has increased dramatically, with 100 million people now online in Europe, up from the previous year's figure of 34 million.", "- In Italy, for example, fast internet access users almost doubled in a year, while in Britain the figure was nearly doubling over the same period.", "- The ability to browse web pages at high speed, download files such as music or films, and play online games has changed what people do in their spare time, according to Jupiter Research.", "In countries where broadband is on the up, there is a significant threat to TV but also the potential for major long-term growth.", "As more people have access to high-speed broadband, the consumption of media for information and entertainment has seen a \"seismic shift\", with TV, newspapers, and radio all facing significant implications."], "tinydolphin:1.1b": [" The European broadband market has undergone a dramatic transformation over the past year.", "According to Nielsen/NetRatings report, there were approximately 54 million people in Europe with broadband connections at the end of 2008 compared to approximately 34 million in 2007.", "This growth can be attributed to an explosion of online activities such as watching TV shows via web browsers and downloading files.", "The study found that the majority of broadband users spend less time watching television in favor of the net, with a quarter saying they spend less time watching TV than before.", "This trend is expected to continue over the next five years, as broadband usage increases and becomes more attractive to households across Europe.", "As the number of high-speed internet users continues to grow, websites will need to adapt their content to retain their visitors and encourage new ones."], "phi:2.7b": [" The number of Europeans using broadband internet has risen significantly over the past year, with many turning away from traditional forms of media like television.", "According to Nielsen/NetRatings, 54 million people are now online via broadband, up 60% on a year ago.", "This growth is being driven by lower prices and wider subscription plans, and it's predicted that more than 37% of households in Europe will be using the internet by 2009.", "Jupiter Research found that as a result, many people are spending less time watching TV.", "The report suggests that TV companies face a long-term threat from broadband, but also predicts that this trend will continue to impact other forms of media like newspapers and radio."], "orca-mini:3b": [" The number of Europeans with broadband has increased dramatically over the past year, with the internet eating into TV viewing habits.", "This growth has been fueled by lower prices and a wider choice of always-on, fast-net subscription plans.", "The popularity of the web has meant that many are turning away from TV, according to analysts Jupiter Research.", "A quarter of web users said they spent less time watching TV in favor of the net, while the total number of Europeans online rose by 12% to 100 million over the past year.", "The study by analysts Jupiter Research suggested that broadband was challenging television viewing habits, with 40% of households with broadband saying they were spending less time watching TV.", "The threat to TV was greatest in countries where broadband was on the up, in particular the UK, France and Spain.", "TV companies faced a major long-term threat over the next five years, with broadband predicted to grow from 19% to 37% of households by 2009."], "hermes3:3b": ["Broadband growth in Europe doubles TV viewing loss over year, with 25% of web users spending less time watching TV due to increased internet usage, according to Nielsen/NetRatings research (100m Europeans online)."], "stablelm-zephyr:3b": ["Broadband adoption in Europe has increased significantly over the past year, with just under 54 million people now connected to the internet via broadband, a figure that has risen from 34 million a year ago, according to market analysts Nielsen/NetRatings.", "This growth can be attributed to lower prices and an increase in the variety of fast-net subscription plans available.", "As a result, many are turning away from TV in favor of the web.", "The total number of Europeans online rose by 12% to 100 million over the past year, with France, Italy, Britain, and Germany experiencing the largest increases.", "Jupiter Research found that broadband was challenging traditional television viewing habits, particularly among households with broadband access, which reported spending less time watching TV."], "chatgpt-4o-latest": ["Broadband usage in Europe has surged, with 54 million people now connected, up from 34 million a year ago.", "This growth, driven by lower prices and more subscription options, has led to a decline in TV viewing, as a quarter of web users report watching less TV.", "The biggest broadband increases were in Italy and the UK.", "Analysts predict broadband will expand from 19% to 37% of households by 2009, posing a long-term threat to TV.", "The shift in media consumption is significant, affecting TV, newspapers, and radio, as people increasingly use the internet for entertainment and information."], "stablelm2:1.6b": ["Broadband adoption is leading to a decline in traditional TV viewing among Europeans, with the web replacing TV as primary source of entertainment.", "Over 2 million people now have broadband access, up from 1 million a year ago, while the total number of online users has reached 150 million.", "Analysts Jupiter Research found that a quarter of web users claim to spend less time watching TV in favor of the internet.", "Italy and Britain experienced significant growth in broadband usage.", "The shift is changing people's spare-time activities, particularly among those with high-speed internet access.", "This trend presents a long-term threat to traditional media like television and radio."], "granite3.1-dense:2b": ["Europe's broadband penetration has surged by 60% over the past year, reaching 54 million people with high-speed internet access, according to Nielsen/NetRatings and Jupiter Research.", "This growth is most pronounced in Italy (up 120%) and Britain (almost doubling).", "The total number of online Europeans has increased by 12% to 100 million.", "The rise of broadband is leading users to prefer internet activities over traditional TV viewing, with a quarter of web users reporting decreased TV time in favor of the net.", "Jupiter Research predicts that broadband usage will increase from 19% to 37% of households by 2009, particularly in the UK, France, and Spain.", "The convenience of high-speed internet for browsing, downloading content (like music or films), and online gaming is transforming leisure time activities.", "This shift poses a significant long-term threat to television, necessitating that TV companies adapt their content and offerings to retain viewers and attract new audiences."]}