{"raw_text": "When technology gets personal\n \n In 2020, whipping out your mobile phone to make a call will be quaintly pass&#233;. By then phones will be printed directly on to wrists, or other parts of the body, says Ian Pearson, BT's resident futurologist.\n \n It's all part of what's known as a \"pervasive ambient world\", where \"chips are everywhere\". Mr Pearson does not have a crystal ball. His job is to formulate ideas based on what science and technology are doing now, to guide industries into the future. Inanimate objects will start to interact with us: we will be surrounded - on streets, in homes, in appliances, on our bodies and possibly in our heads - by things that \"think\". Forget local area networks - these will be body area networks. Ideas about just how smart, small, or even invisible, technology will get are always floating around. Images of devices clumsily bolted on to heads or wrists have pervaded thinking about future technology. But now a new vision is surfacing, where smart fabrics and textiles will be exploited to enhance functionality, form, or aesthetics. Such materials are already starting to change how gadgets and electronics are used and designed.\n \n So MP3 players - the mass gadget of the moment - will disappear and instead become integrated into one's clothing, says Mr Pearson. \"So the gadgets that fill up your handbag, when we integrate those into fabric, we can actually get rid of all that stuff. You won't necessarily see the electronics.\" Wearable technology could exploit body heat to charge it up, while \"video tattoos\", or intelligent electronic contact lenses, might function as TV screens for those on the move. However, this future of highly personal devices, where technology is worn, or even fuses with the body itself, raises ethical questions. If technology is going to be increasingly part of clothing, jewellery, and skin, there needs to be some serious thinking about what it means for us as humans, says Baroness Susan Greenfield. At a recent conference for technology, engineering, academic and fashion industry experts, at the Royal Society in London, neuroscientist Baroness Greenfield cautioned we \"can't just sleepwalk into the future\".\n \n Yet this technology is already upon us. Researchers have developed computers and sensors worn in clothing. MP3 jackets, based on the idea that electrically conductive fabric can connect to keyboard sewn into sleeves, have already appeared in shops.\n \n These \"smart fabrics\" have come about through advances in nano- and micro-engineering - the ability to manipulate and exploit materials at micro or molecular scale. At the nanoscale, materials can be \"tuned\" to display unusual properties that can be exploited to build faster, lighter, stronger and more efficient devices and systems. The textile and clothing industry has been one of the first to exploit nanotechnology in quite straightforward ways. Many developments are appearing in real products in the fields of medicine, defence, healthcare, sports, and communications. Professional swimming suits reduce drag by incorporating tiny structures similar to shark skin. Nanoscale titanium dioxide (TiO2) coatings give fabrics antibacterial and anti-odour properties. These have special properties which can be activated in contact with the air or UV light. Such coatings have already been used to stop socks smelling for instance, to turn airline seats into super stain-resistant surfaces, and applied to windows so they clean themselves. Dressings for wounds can now incorporate nanoparticles with biocidal properties and smart patches are being developed to deliver drugs through the skin. But Baroness Greenfield is concerned about how far this more personal contact with technology might affect our very being. If our clothing, skin, and \"personal body networks\" do the talking and the monitoring, everywhere we go, we have to think about what that means for our concept of privacy. Mr Pearson picks up the theme, pointing out there are a lot of issues humans have to iron out before we become \"cyborgian\". His main concern is \"privacy\". \"We are looking at electronics which are really in deep contact with your body and a lot of that information you really don't want every passer-by to know. \"So we have to make sure we build security in this. If you are wearing smart make-up, where electronics are controlling the appearance, you don't want people hacking in and writing messages on your forehead.\" As technology infiltrates our biology, how will our brains function differently? \"We cannot arrogantly assume that the human brain will not change with this,\" warns Baroness Greenfield. There have already been successful experiments to grow human nerve cells on circuit boards. This paves the way for brain implants to help paralysed people interface directly with computers. Clearly, the organic, carbon of our bodies and silicon is increasingly merging. The cyborg - a very familiar part-human, part-inorganic science fiction and academic idea - is on its way.\n", "llama3.2:1b": ["Here is a concise summary of the text in plain text:\n\nIan Pearson says technology will soon be printed directly onto wrists or other parts of the body, with smart fabrics being explored for use in clothing, homes, and appliances.", "This \"pervasive ambient world\" where chips are everywhere could lead to wearable devices that interact with us and our bodies.", "Researchers have already developed computers and sensors worn on clothing, such as MP3 jackets that connect to a keyboard sewn into sleeves.", "These smart fabrics can display unusual properties at the nanoscale, allowing for faster, lighter, stronger, and more efficient devices and systems.", "Baroness Susan Greenfield warns of ethical concerns around integrating technology into human bodies, citing potential issues with privacy and the blurring of lines between humans and machines."], "llama3.2:3b": ["Here is a summary of the text:\n\nIn 2020, technology will be integrated into wearable forms like wrists and clothing, forming a \"pervasive ambient world\" where devices interact with humans directly.", "Smart fabrics, sensors, and materials are being developed to enhance functionality, form, or aesthetics.", "Examples include MP3 jackets, smart swimsuits, and antibacterial textiles.", "However, this technology raises ethical questions about privacy, as personal data will be collected and stored in the body.", "Baroness Susan Greenfield warns that humans must consider the implications of merging organic and silicon components."], "gemma2:2b": ["Future technology will be deeply integrated into everyday objects.", "Wearable devices will become commonplace, with smart fabrics enhancing functionality and form.", "These innovations raise concerns about privacy, ethics, and the potential impact on human brains.", "Existing technologies like MP3 jackets showcase the direction of development, while nanotechnology is being employed in a wide range of fields for practical applications like medical treatment and self-cleaning materials.", "The merging of organic and inorganic components raises questions about the future of cyborgianism."], "qwen2.5:0.5b": ["When technology becomes more personal, smartphones will be replaced by wearable devices that can integrate into clothing, giving them enhanced functionality and aesthetics.", "Smart fabrics, for example, could control electronic devices inside the human body or even extend to touch our skin.", "There are already examples of smart garments being developed, such as MP3 jackets that connect to keyboards sewn into sleeves.", "These types of technology raise ethical questions about how we interact with this new form of personalization.", "Additionally, there is a concern about privacy in an increasingly connected world where everything from our clothes to our bodies can be monitored and controlled by devices embedded in our surroundings.", "Baroness Greenfield warns that as technology becomes more deeply integrated into human biology, it could lead to a new form of \"cyborgian\" thinking, with machines becoming part of our daily lives."], "qwen2.5:1.5b": ["In 2020, mobile phones will be replaced by printed devices on wrists or other parts of the body.", "This pervasive ambient world involves objects interacting with humans, enhancing functionality, form, aesthetics, and even becoming invisible to users.", "Smart fabrics that integrate technology into clothing for charging and monitoring health are already in development.", "Ethical questions about privacy and personal data security arise as technology becomes more intimate with human bodies.", "The future of wearable tech will involve integrated devices connected directly to the skin or body parts such as tattoos and smart clothing, but raises significant concerns about privacy and human identity."], "qwen2.5:3b": ["When technology becomes personal, phones might be printed onto wrists or other body parts by 2020.", "This will lead to a \"pervasive ambient world\" where chips are embedded in everyday objects, enhancing functionality and aesthetics.", "Wearable tech like MP3 players could integrate into clothing, charging through body heat and even acting as TV screens for mobile use.", "However, this raises ethical questions about privacy and the personal nature of technology integration, including implants for people with disabilities.", "Researchers have developed smart fabrics using nanotechnology to create more efficient devices and systems.", "Concerns include issues around privacy and potential changes in human-brain interactions brought on by deeper technological penetration into our biology."], "opencoder:1.5b": ["When technology gets personal, in 20th-century times, we see a leap towards the future where technology is being integrated into everyday life as well as into the design of clothing and other gadgets.", "In this context, Mr Pearson's remark is a reflection of what's currently happening with technology.", "By integrating electronics like smart fabrics and textiles, they are becoming an essential part of our daily lives, enhancing functionality, form, or aesthetics.", "This future of highly personal devices could revolutionize how we use technology and potentially change the way we live, work, and interact."], "smollm:1.7b": ["The article highlights the rapid progress in wearable technology, particularly in the field of clothing and textiles.", "It emphasizes that these advancements will lead to more personal interactions with technology, blurring the lines between humans and machines.", "The text focuses on the potential benefits of such technologies, including enhanced functionality, increased convenience, and improved health monitoring.", "However, it also raises important ethical concerns about privacy, security, and the impact on human relationships.", "The article's central argument is that as technology becomes increasingly integrated into our bodies and environments, we will need to reevaluate our understanding of what it means to be human.", "It suggests that the future of technology will require us to confront fundamental questions about consciousness, identity, and the nature of humanity.", "The text concludes by emphasizing the importance of responsible innovation in this area, with a focus on ensuring that these technologies are developed and used in ways that benefit society as a whole."], "deepseek-r1:1.5b": ["When technology gets personal  \nIn 2020, your mobile phone to make a call is nothing special—by then it'll be stuck directly on your wrist.", "The \"pervasive ambient world\" means chips are everywhere: from clothes to devices on your body (heads or bodies) and even heads themselves.", "Mr. Pearson, BT's Futurist, sees this as science moving beyond current gadgets like MP3 players into integrated clothing.", "Wearables could use heat for charging, while contact lenses might mimic screens.", "However, ethical questions arise if we become a blend of human brains and silicon.", "Devices are already appearing in medical, defense, healthcare, sports, and communications products.", "The textile industry is ahead with nanotechnology, creating fabrics that can be tunneled to enhance or form devices.", "Bar篮 for instance uses tiny sharkskin patterns.", "Nanoscale materials like TiO2 absorb air or UV light to protect surfaces.", "These are used in socks to make them smellless and windowpanes for self-cleaning windows.", "The idea of \"personal body networks\" affects privacy, especially if your brain is integrated with tech.", "Baroness Greenfield warns about this future, pointing toward cyborgs—bodies fused with silicon—and mentions experiments growing human cells on circuit boards for brain implants.", "As technology deeply embeds into our bodies, the mind must adapt to this blend of nature and science."], "tinyllama:1.1b": ["In the year 2020, \"pervasive ambient world\" technology will have pervaded everything around us, and smart fabrics and textiles will have become integrated into our bodies.", "Such devices are already emerging, as imagined by futurist Ian Pearson, who sees \"smart clothing\" becoming a reality.", "However, this future of highly personal devices raises ethical questions about the privacy we may have to deal with when we wear electronic tags or integrate smart make-up into our skin.", "While nanotechnology is making advancements in fashion and other industries, Baroness Greenfield warns that it will have a profound impact on how we interact with technology in the future, highlighting concerns about security and personal data collection."], "tinydolphin:1.1b": [" AI text summarizer for this article: \"When technology becomes personal, we may wear smart fabrics, body-altering textiles, or even fuse with our clothing to enhance functionality, form, or aesthetics.\"", "The author suggests that this new era of technology integration will require careful thought about how it affects us as individuals and the concept of privacy."], "phi:2.7b": [" In 2020, technology will become so advanced that phones will be integrated into our clothing or even our body.", "This will lead to the development of smart fabrics that can charge devices using body heat.", "However, there are ethical concerns about privacy when these personal devices are worn and used in intimate places like homes and bodies.", "Researchers have already developed computers and sensors in clothing.", "Nanotechnology has also been used to create materials with unique properties such as antibacterial and self-cleaning abilities.", "While this technology is exciting, it raises questions about our concept of privacy and how our brains will adapt to these new interfaces.", "Baroness Susan Greenfield warns that humans cannot take for granted the protection of their privacy in this new world."], "orca-mini:3b": [" When technology gets personal, wearable devices will be integrated into clothing, according to Ian Pearson.", "This vision raises ethical questions about how technology should be integrated into our bodies.", "The textile and clothing industry has already exploited nanotechnology in products such as medical equipment, defense systems, healthcare, sports equipment, and communication devices.", "However, the use of smart fabrics with electronics has not yet appeared in real products.", "Professional swimming suits reduce drag by incorporating tiny structures similar to shark skin, while nanoscale titanium dioxide coatings give fabrics antibacterial and anti-odour properties.", "Dressings for wounds can now incorporate nanoparticles with biocidal properties, and smart patches are being developed to deliver drugs through the skin."], "hermes3:3b": ["Personal technology integration, future where devices are worn or embedded into body; ethical considerations about privacy when wearable tech interacts with humans deeply."], "stablelm-zephyr:3b": ["By 2030, mobile phones will be obsolete as technology becomes pervasive and integrated into our body parts, leading to a \"pervasive ambient world\" where objects think and interact with us.", "Smart fabrics and textiles will enhance functionality, form, and aesthetics, replacing gadgets like MP3 players in clothing.", "Wearable technology raises ethical questions about privacy, as personal devices merge with the body, potentially allowing unauthorized access to sensitive information.", "As we become more cyborgian, brain implants could help paralysed people interface directly with computers, and organic bodies and silicon are increasingly merging."], "chatgpt-4o-latest": ["By 2020, technology will become deeply integrated into daily life, with devices embedded in clothing, accessories, and even the body.", "Futurist Ian Pearson predicts that mobile phones will be printed onto skin, and MP3 players will be woven into fabrics.", "Advances in nanotechnology and micro-engineering are enabling smart textiles with antibacterial, self-cleaning, and even drug-delivery properties.", "However, this increasing fusion of technology with the human body raises ethical concerns, particularly regarding privacy and the potential impact on human identity.", "Baroness Susan Greenfield warns that society must carefully consider these implications before embracing such advancements.", "The merging of organic and inorganic materials is already happening, with experiments growing human nerve cells on circuit boards, paving the way for brain-computer interfaces.", "The concept of cyborgs is no longer just science fiction but an emerging reality."], "stablelm2:1.6b": ["Future technology will include wearable devices integrated into clothing and textiles, such as MP3 jackets and smart fabrics with antibacterial properties.", "However, this personal technology raises ethical concerns about privacy and the potential impact on our biology.", "Nanotechnology has enabled advances in textile and apparel design, leading to products like professional swimming suits that incorporate tiny structures similar to shark skin.", "Baroness Greenfield warns about how far personal contact with technology may affect our concept of privacy and the human brain's function as electronics become more integrated into our biology."], "granite3.1-dense:2b": ["By 2020, personal technology will permeate daily life through body area networks, integrating chips into clothing, wearable devices, and even our bodies.", "Futurologist Ian Pearson envisions smart fabrics and textiles enhancing functionality, form, or aesthetics, with electronics becoming embedded in garments like MP3 players.", "This future also includes video tattoos and intelligent electronic contact lenses.", "However, this trend raises ethical concerns about privacy, as constant monitoring could infringe on individuals' personal space.", "Baroness Susan Greenfield warns that we must consider the implications of such deep integration with technology for human identity and autonomy.", "The merging of organic and inorganic components, akin to cyborgism, is already underway.", "Existing applications of nanotechnology in clothing, medicine, defense, healthcare, sports, and communications demonstrate the potential for improved performance through nano-engineered materials with unique properties.", "Key concerns include privacy and the possible impact on human brain function.", "While there are successful experiments involving human nerve cells on circuit boards, facilitating brain implants for paralyzed individuals to interface directly with computers, the long-term effects of this integration on cognitive processes remain uncertain.", "As technology infiltrates biology, humans must navigate the complexities of maintaining privacy and understanding how their brains will adapt to these profound changes."]}