{"raw_text": "'Brainwave' cap controls computer\n \n A team of US researchers has shown that controlling devices with the brain is a step closer.\n \n Four people, two of them partly paralysed wheelchair users, successfully moved a computer cursor while wearing a cap with 64 electrodes. Previous research has shown that monkeys can control a computer with electrodes implanted into their brain. The New York team reported their findings in the Proceedings of the National Academy of Sciences. \"The results show that people can learn to use scalp-recorded electroencephalogram rhythms to control rapid and accurate movement of a cursor in two directions,\" said Jonathan Wolpaw and Dennis McFarlane. The research team, from New York State Department of Health and State University of New York in Albany, said the research was another step towards people controlling wheelchairs or other electronic devices by thought.\n \n The four people faced a large video screen wearing a special cap which, meant no surgery or implantation was needed.\n \n Brain activity produces electrical signals that can be read by electrodes. Complex algorithms then translate those signals into instructions to direct the computer. Such brain activity does not require the use of any nerves of muscles, so people with stroke or spinal cord injuries could use the cap effectively. \"The impressive non-invasive multidimensional control achieved in the present study suggests that a non-invasive brain control interface could support clinically useful operation of a robotic arm, a motorised wheelchair or a neuroprosthesis,\" said the researchers. The four volunteers also showed that they could get better at controlling the cursor the more times they tried. Although the two partially-paralysed people performed better overall, the researchers said this could be because their brains were more used to adapting or that they were simply more motivated. It is not the first time researchers have had this sort of success in brain-control experiments. Some teams have used eye motion and other recording techniques. Earlier this year, a team at the MIT Media Labs Europe demonstrated a wireless cap which read brain waves to control a computer character.\n", "llama3.2:1b": ["A US research team has shown that people can control devices with their brains using electroencephalogram (EEG) signals.", "The study involved four people wearing EEG caps while controlling a computer cursor, and the researchers found that they could learn to use the cap to move the cursor in two directions accurately."], "llama3.2:3b": ["US researchers successfully controlled a computer cursor with 64-electrode caps on four people, including two with partial paralysis, showing potential for non-invasive brain control for devices like wheelchairs and neuroprosthetics."], "gemma2:2b": ["Researchers have developed a non-invasive brainwave-controlled device that allows people to move a cursor on a screen.", "The device used scalp electrodes to read electrical signals from the brain and translate them into cursor movements.", "This technology shows potential for controlling wheelchairs, robotic arms, and other devices by thought.", "The study demonstrated progress towards brain-computer interface technology with promising results."], "qwen2.5:0.5b": ["A team of US researchers has shown that controlling devices with the brain is a step closer.", "The four people were able to move a computer cursor by wearing a cap with 64 electrodes implanted into their brains.", "Previous research has shown that monkeys can control a computer with electrodes implanted in their brain, while the New York team reported their findings in the Proceedings of the National Academy of Sciences."], "qwen2.5:1.5b": ["US researchers have successfully controlled a cursor using electroencephalogram (EEG) signals recorded from electrodes on a cap worn by four people with varying degrees of paralysis or stroke-related disabilities, demonstrating that it's possible to operate electronic devices like wheelchairs and robotic arms with brainwaves without needing surgery or implanted electrodes."], "qwen2.5:3b": ["A team of US researchers has successfully shown that people can control devices with their minds using a cap equipped with 64 electrodes.", "Four participants, including two partially paralysed wheelchair users, moved a computer cursor in two directions by controlling scalp-recorded electroencephalogram rhythms.", "The research appeared in the Proceedings of the National Academy of Sciences and demonstrated another step towards people controlling wheelchairs or other electronic devices through thought.", "The study indicated that such brain activity does not require nerves or muscles and is potentially useful for individuals with stroke or spinal cord injuries.", "Participants showed improvement with repeated practice, though it was unclear if this was due to familiarity or motivation.", "While not the first in brain-control experiments, this research suggests potential for non-invasive brain control interfaces."], "opencoder:1.5b": ["'Brainwave' cap controls computer: A team of US researchers showed how to control devices with the brain.", "They found that monkeys could learn to use scalp-recorded electroencephalogram (EEG) rhythms to move a cursor in two directions.", "Their findings are another step towards people controlling wheelchairs or other electronic devices by thought.", "The four people faced a large video screen wearing a special cap which, as no surgery or implantation was needed.", "The brain activity translates electrical signals into instructions for the computer.", "This allows for non-invasive control without using any nerves of muscles, allowing stroke or spinal cord injuries to be managed effectively.", "\"The impressive non-invasive multidimensional control achieved in this study indicates that a non-invasive brain control interface could support operable devices such as a robotic arm, motorized wheelchair, or neuroprosthesis.", "\", the researchers said."], "smollm:1.7b": ["Brainwave control technology has made significant progress in recent years, with researchers successfully demonstrating the ability to control devices using only one's brain signals.", "The four individuals involved in this study were able to move a cursor on a screen while wearing a special cap that monitored their brain activity.", "This cap is designed to be non-invasive and does not require surgery or implantation of electrodes into the brain.", "The researchers used complex algorithms to translate the brain waves into instructions for controlling the computer cursor, which was displayed on a screen in front of the participants.", "The four individuals demonstrated an impressive ability to improve their control over time as they repeated the experiment multiple times.", "This suggests that with practice and repetition, it is possible to develop greater control over one's brain signals.", "The study's findings are significant because they demonstrate that non-invasive brain control technology can be used to support clinically useful operation of a robotic arm, motorised wheelchair or other neuroprosthetic devices.", "The researchers also noted that the two participants who were partially paralyzed had better overall performance than the fully paralyzed individual.", "This could be due to the fact that their brains were more accustomed to adapting to new situations and being motivated by external stimuli.", "While this study demonstrates significant progress in brain-control technology, there are still many challenges to overcome before such technology can be widely used in real-world applications.", "For example, the complexity of the algorithms required to translate brain signals into instructions for controlling devices is a significant technical hurdle that needs to be addressed.", "Additionally, the study's results were only obtained with the use of a special cap and do not necessarily apply to other types of brain control technology or non-invasive methods."], "deepseek-r1:1.5b": ["A team from the United States demonstrated that people can control devices using electroencephalogram (EEG) electrodes placed on a specially designed device with a brain-cap.", "Two volunteers, partly paralysised, successfully controlled a computer cursor.", "Their research was published in *Proceedings of the National Academy of Sciences*, highlighting progress toward non-invasive control methods for various devices like robotic arms or motor-controlled wheelchairs.", "The study's findings suggest that improved adaptability among brain-function patterns may explain their success and could pave the way for future advancements without surgery or implantation."], "tinyllama:1.1b": ["The article reports that scientists from New York State Department of Health and the State University of New York in Albany have demonstrated an unconventional method for controlling electronic devices using electrical signals from patients' brains, as they wear special caps capable of recording brain waves.", "The research team said that the result is a step towards individuals who are paralyzed or suffer from stroke or spinal cord injuries having control over electronic devices with no surgery or implantation needed.", "The researchers aim to explore this concept further and possibly develop a non-invasive interface for clinically useful operation of robotic arms, motorized wheelchairs or neuroprostheses.", "However, the article states that four participants managed to move a computer cursor while wearing a cap with 64 electrodes during the experiment.", "The experiment was conducted on patients who showed no improvement in their mobility following electrode implantation.", "Despite the impressive non-invasive multidimensional control achieved in the present study, the researchers said that further studies are necessary to investigate if this technique can be useful for clinical applications and could potentially help individuals with paralysis or spinal cord injuries."], "tinydolphin:1.1b": [" The research team from New York State Department of Health and State University of New York in Albany successfully completed a task that many scientific experts had considered impossible—it was able to move a computer cursor using electroencephalogram (EEG) recordings, or brain waves, without any physical connection between the two.", "This breakthrough could revolutionize the way people control computers and other devices by thinking about their movements through thought alone.", "The researchers used monkeys with implanted electrodes, but anyone with a large screen TV or specialized cap could use this technology in their own homes, if they had enough neural adaptations.", "By translating brain signals into commands for the computer, people with paralysis could use their minds to control devices like computers, wheelchairs, and prosthetic arms.", "However, while this experiment is impressive, there's still a long way to go before we can fully control the world with our thoughts alone."], "phi:2.7b": [" Researchers from New York State Department of Health and State University of New York in Albany have successfully controlled a computer cursor using 64 electrodes recorded from a video screen with an electrode-free helmet that measures electrical activity produced by the brain.", "This breakthrough in brain-control technology is another step towards enabling people to control wheelchairs or other electronic devices by thought, without requiring surgery or implantation."], "orca-mini:3b": [" A team of US researchers has shown that controlling devices with the brain is a step closer.", "Four people wearing a cap with 64 electrodes successfully moved a computer cursor while controlling it with their thoughts.", "The research is another step towards people controlling wheelchairs or other electronic devices by thought, without any surgery or implantation.", "Brain activity produces electrical signals that can be read by the electrodes.", "Complex algorithms then translate those signals into instructions to direct the computer.", "This non-invasive brain control interface could support clinically useful operation of a robotic arm, a motorised wheelchair or a neuroprosthesis, said the researchers.", "The four volunteers showed that they could get better at controlling the cursor the more times they tried."], "hermes3:3b": ["Brainwave-cap controls computers, allows paralysed people to move cursor non-invasively via scalp electroencephalogram rhythms."], "stablelm-zephyr:3b": ["US researchers have shown that people can control a computer using a cap with 64 electrodes placed on their scalp.", "Four volunteers, including two partly paralysed wheelchair users, moved a computer cursor while wearing the cap, which translates brain activity into electrical signals without requiring nerves or muscles.", "The non-invasive brain control interface has potential for operating robotic arms, wheelchairs, and neuroprostheses, with improvements seen as people practiced controlling the cursor more."], "chatgpt-4o-latest": ["US researchers have demonstrated progress in brain-controlled devices, as four individuals, including two partially paralyzed wheelchair users, successfully moved a computer cursor using a cap with 64 electrodes.", "Unlike previous studies that required brain implants, this non-invasive method reads brain activity through electrodes and translates signals into computer commands.", "The study, published in the Proceedings of the National Academy of Sciences, suggests potential applications for controlling wheelchairs, robotic arms, or neuroprostheses.", "The volunteers improved with practice, and the paralyzed participants performed better, possibly due to greater brain adaptability or motivation.", "Other research teams have explored similar brain-control methods, including eye motion tracking and wireless brainwave-reading caps."], "stablelm2:1.6b": ["US researchers successfully tested controlling a computer with electrodes implanted in a braincap worn by four people, including two partially paralyzed wheelchair users.", "The research showed that people can learn to use scalp-recorded electroencephalogram rhythms for controlling rapid and accurate movement of a cursor in both directions.", "No surgery or implantation was needed; the study suggests potential non-invasive brain control interfaces for devices like robotic arms or motorized wheelchairs, particularly useful for people with stroke or spinal cord injuries."], "granite3.1-dense:2b": ["US researchers from New York State Department of Health and State University of New York in Albany have successfully demonstrated that four individuals, including two partially paralyzed wheelchair users, can control a computer cursor using a non-invasive cap with 64 electrodes.", "This cap reads brain activity, translating it into electrical signals that direct the cursor's movement in both directions on a large video screen.", "The researchers reported their findings in the Proceedings of the National Academy of Sciences, highlighting this as an advancement towards enabling people with stroke or spinal cord injuries to control electronic devices by thought alone.", "Participants showed improved performance after repeated attempts, with partially paralyzed individuals performing better overall.", "This achievement is a significant step in developing clinically useful brain-controlled interfaces for robotic arms, motorized wheelchairs, or neuroprostheses.", "Previous research has also shown similar success using eye motion and other recording techniques, including a wireless cap demonstrated by MIT Media Labs Europe earlier this year."]}