{"raw_text": "2D Metal Slug offers retro fun\n \n Like some drill sergeant from the past, Metal Slug 3 is a wake-up call to today's gamers molly-coddled with slick visuals and fancy trimmings.\n \n With its hand-animated sprites and 2D side-scrolling, this was even considered retro when released in arcades four years ago. But a more frantic shooter you will not find at the end of your joypad this year. And yes, that includes Halo 2. Simply choose your grunt and wade through five 2D side-scrolling levels of the most hectic video game blasting you will ever encounter. It is also the toughest game you are likely to play, as hordes of enemies and few lives pile the pressure on.\n \n Players must battle soldiers, snowmen, zombies, giant crabs and aliens, not to mention the huge, screen-filling bosses that guard each of the five levels.\n \n The shoot-anything-that-moves gameplay is peppered with moments of old-school genius. Fans of robotic gastropods should note the title refers, instead, to the vast array of vehicles on offer in a game stuffed with bizarre hardware. Tanks, jets and submarines can be commandeered, as well as cannon-toting camels, elephants and ostriches - more weaponry on offer than in an acre of Iraq. Doling out justice is a joy thanks to ultra responsive controls, and while this is a tough nut to crack, it is addictive enough to have you gagging for that one last go. And at a mere £20, Metal Slug 3 is as cheap as sliced, fried spuds, as the man says. Of course, most of you will ignore this, lacking as it does the visual fireworks of modern blasters. But at a time when blockbuster titles offer only a fresh lick of paint in favour of real innovation, Metal Slug 3 is a fresh gasp of air from an era when the Xbox was not even a twinkle in Bill Gates' eye.\n", "llama3.2:1b": ["Metal Slug 3 offers retro-style gameplay with hand-animated sprites and 2D side-scrolling.", "The game features frantic shooter gameplay, where players battle hordes of enemies and bosses in five levels.", "Players can choose from various vehicles such as tanks, jets, submarines, cannons, and more.", "The game has ultra-responsive controls that make for addictive gameplay.", "The game is cheap at £20."], "llama3.2:3b": ["Metal Slug 3 offers retro fun with its hand-animated sprites and 2D side-scrolling gameplay, featuring frantic shooters, tough levels, and ultra-responsive controls.", "The game features a wide variety of vehicles and weaponry, making it addictive despite its difficulty.", "At £20, it is an affordable option for those looking for classic gaming experience without the visual flair of modern titles."], "gemma2:2b": ["Metal Slug 3 is a challenging, retro side-scrolling shooter with hand-animated sprites and classic 2D gameplay.", "It offers frantic action, diverse weaponry, iconic bosses, and addictive gameplay despite its simplistic graphics.", "The game is cheap, provides hours of fun, and appeals to players looking for authentic arcade experiences, unlike modern games that focus on flashy visuals."], "qwen2.5:0.5b": ["Metal Slug 3 combines action shooter and horror elements with retro aesthetic.", "Players control a soldier on a side-scrolling map battling enemies, zombies, snowmen, aliens, and bosses while dodging bullets at various stages.", "The game features vehicles with unique capabilities such as tanks, jets, submarines, camels, elephants, ostriches, cannons, and more.", "Controls are designed to be fast-paced yet immersive, requiring quick reflexes and precise movement.", "The game offers moments of nostalgia for its sci-fi genre, including a \"shoot anything that moves\" gameplay style."], "qwen2.5:1.5b": ["Metal Slug 3 offers nostalgic side-scrolling gameplay with intense, chaotic battles against various enemies and bosses across five levels, praised for its hand-drawn sprites and ultra-responsive controls but criticized by modern shooters as overly difficult despite its relatively low price."], "qwen2.5:3b": ["2D Metal Slug offers retro fun with hand-animated sprites and frantic 2D side-scrolling gameplay.", "Players must battle various enemies including soldiers, snowmen, zombies, crabs, and aliens.", "The game features diverse vehicles like tanks, jets, submarines, and unusual ones like camels and elephants.", "Gameplay is challenging but addictive.", "Despite its dated visuals, it's considered a masterpiece for its innovative controls and old-school genius moments.", "At £20, it offers value despite not having modern graphics."], "opencoder:1.5b": ["\"Metal Slug offers retro fun.", "Like some drill sergeant from the past, it is a wake-up call to today's gamers with slick visuals and fancy trimmings.", "With its hand-animated sprites and 2D side-scrolling, it was considered retro when released in arcades four years ago.", "But a more frantic shooter you will not find at the end of your joypad this year.", "And yes, that includes Halo 2.", "Simply choose your grunt and wade through five 2D side-scrolling levels of the most hectic video game blasting you will ever encounter.", "It is also the toughest game you are likely to play because of hordes of enemies and few lives pile the pressure on.", "Players must battle soldiers, snowmen, zombies, giant crabs and aliens, not to mention the huge, screen-filling bosses that guard each of the five levels.", "The shoot-anything-that-moves gameplay is peppered with moments of old-school genius.", "Fans of robotic gastropods should note the title refers to the vast array of vehicles on offer in a game stuffed with bizarre hardware such as tanks, jets and submarines can be commandeered, as well as cannon-toting camels, elephants and ostriches - more weaponry on offer than in an acre of Iraq.", "Doling out justice is a joy thanks to ultra responsive controls, and while this is a tough nut to crack, it is addicted enough to have you gagging for that one last go.", "And at a mere £20, Metal Slug 3 is as cheap as sliced, fried spuds, as the man says.", "Of course, most of you will ignore this, lacking as it does the visual fireworks of modern blasters.", "But at a time when blockbuster titles offer only a fresh lick of paint in favour of real innovation, Metal Slug 3 is a fresh gasp of air from an era where the Xbox was not even a twinkle in Bill Gates' eye.\""], "smollm:1.7b": ["The summary should be concise and to the point, focusing on the main ideas and key details.", "The text should be written in plain language, without any explanations or technical jargon.", "The summary should preserve the original meaning and tone of the text, while omitting unnecessary information."], "deepseek-r1:1.5b": ["Metal Slug 3 is a 2D platformer that captures the essence of an old-school射击游戏, blending retro aesthetics with a challenging yet rewarding experience.", "It features a variety of monsters like snowmen, zombies, crabs, and aliens, each level presenting its own set of obstacles.", "The game's ultra-responsive controls make it addictive while still maintaining difficulty.", "With a price tag of just £20, Metal Slug 3 is a refreshing offering from an era where the Xbox didn't promise much.", "It stands as a remnant of an older generation's gaming experience, offering both nostalgia and fresh gameplay."], "tinyllama:1.1b": ["Première sortie du jeu à l'occasion de son réédition sur Xbox One, \"Metal Slug 3\" est un shooter à deux dimensions qui offre une étoile de tir à la manière des années 1990, bien que cette version puisse être difficile pour les nouveaux joueurs car il y a beaucoup de chances d'encaisser des ennemis et de perdre quelques points de vie.", "L'objectif est simple : récupérer tous les cartouches qui se trouvent derrière chaque tour, alors que les ennemis tirent sur vos chaussures et lance-pierres pour vous frapper.", "Avec un gameplay étonnamment légèrement extraordinaire, il faut commander un grand nombre de machines mobiles pour réussir, mais cela peut également être une source d'encombrements, ce qui peut les rendre inexpérimentés au combat.", "L'ambiance est très populaire, grâce à des textures en 2D et à des animations de personnages, qui peuvent faire que les joueurs se sentissent comme en tant qu'éléphant qui ait vu ses parents mourir à l'aide d'un pincé.", "Bien que la plupart des jeux de stratégie-shooter ne soient pas un bon exemple de réédition, il est probable que \"Metal Slug 3\" ait été décidé pour rééditer avec le but d'être relativement populaire pour les joueurs qui ont lu les avis et sont enchantés de la visibilité de ce jeu."], "tinydolphin:1.1b": [" The game \"Metal Slug\" offers classic platform action with a focus on shooting enemies in 2D environments.", "This particular version, Metal Slug 3, is set in the world of Halo and features some highly impressive visuals and animations.", "It is a challenging shooter that demands quick reflexes and strategic planning to survive through each level.", "The gameplay revolves around shooting enemies and taking them out using various weapons such as rockets, missiles and grenades.", "Players can also pilot vehicles like tanks, jets, submarines and camels which provide a unique perspective on combat.", "The controls are simple yet responsive, making the game enjoyable for both beginners and experienced gamers alike.", "Additionally, the addition of boss battles is a distinct advantage as players must outwit and outmaneuver their opponents in this thrilling part of the game.", "Metal Slug 3 has an affordable price of just £20, making it an attractive purchase for anyone looking to enjoy an engaging shooter that is both challenging and fun."], "phi:2.7b": [" Metal Slug 3 is a 2D side-scrolling shooter game with retro gameplay and unique vehicles.", "It features a variety of enemies and bosses that must be defeated to progress through five levels.", "The game's controls are easy to use, and at a low price of £20, it is accessible to gamers of all ages."], "orca-mini:3b": [" Metal Slug 3 offers retro fun with its hand-animated sprites and 2D side-scrolling gameplay, considered retro when released in arcades four years ago.", "It is tougher than most modern shooters and features an array of bizarre hardware to commandeer, including robotic gastropods and vehicles like tanks, jets, and submarines.", "The game's addictive gameplay, responsive controls, and cheap price tag make it a must-play for retro fans."], "hermes3:3b": ["Metal Slug 3: 2D side-scrolling shooter with retro style, frantic gameplay, tough challenges, diverse vehicles, cheap price, older gamers may find nostalgic fun and addictive blasting."], "stablelm-zephyr:3b": ["2D Metal Slug is a retro, frantic shooter with hand-animated sprites and 2D side-scrolling gameplay.", "Featuring five levels with various enemies and bosses, players command vehicles such as tanks, jets, submarines, and more unusual options like camels and elephants.", "With responsive controls and an affordable price of £20, Metal Slug 3 offers a unique gaming experience different from modern blockbuster titles."], "chatgpt-4o-latest": ["Metal Slug 3 delivers intense, old-school 2D side-scrolling action with hand-animated sprites and relentless gameplay.", "Despite its retro style, it offers one of the most frantic and challenging shooting experiences, surpassing even modern titles like Halo 2.", "Players battle a variety of enemies, including soldiers, zombies, and giant bosses, while commandeering an array of vehicles, from tanks to cannon-equipped animals.", "The game’s ultra-responsive controls and addictive difficulty make it a rewarding experience.", "Though lacking modern visual polish, its originality and engaging gameplay stand out, offering a refreshing alternative to today's blockbuster titles—all for an affordable price."], "stablelm2:1.6b": ["\"2D Metal Slug offers retro fun with hectic shooter gameplay, featuring hand-animated sprites and five 2D side-scrolling levels filled with enemies and few lives.", "Players battle various vehicles and bosses, while enjoying ultra-responsive controls and addictive gameplay despite its difficulty.", "Available for only £6, Metal Slug ..\n…\"is a fresh gasp of air from an era when the Xbox was not even a twinkle in Bill Gates' eye.\""], "granite3.1-dense:2b": ["Metal Slug 3, initially released four years ago as a retro arcade game, delivers intense, fast-paced 2D side-scrolling action.", "Players control characters and navigate through five levels filled with diverse enemies like soldiers, snowmen, zombies, crabs, aliens, and colossal bosses.", "The game's charm lies in its extensive vehicle roster, including tanks, jets, submarines, camels, elephants, ostriches, and more.", "Despite the challenge posed by limited lives and relentless enemy hordes, Metal Slug 3 offers responsive controls that make combat enjoyable.", "Priced at £20, it stands out as a throwback to an era before modern consoles like the Xbox, providing a fresh, arcade-style experience in contrast to today's visually enhanced yet less innovative blockbusters."]}