{"raw_text": "'Ultimate game' award for Doom 3\n \n Sci-fi shooter Doom 3 has blasted away the competition at a major games ceremony, the Golden Joystick awards.\n \n It was the only title to win twice, winning Ultimate Game of the year and best PC game at the awards, presented by Little Britain star Matt Lucas. The much-anticipated sci-fi horror Doom 3 shot straight to the top of the UK games charts on its release in August. Other winners included Grand Theft Auto: San Andreas which took the Most Wanted for Christmas prize. Only released last week, it was closely followed by Halo 2 and Half-Life 2, which are expected to be big hits when they are unleashed later this month.\n \n But they missed out on the prize for the Most Wanted game of 2005, which went to the Nintendo title, The Legend of Zelda. The original Doom, released in 1994, heralded a new era in computer games and introduced 3D graphics. It helped to establish the concept of the first-person shooter. Doom 3 was developed over four years and is thought to have cost around $15m (£8.3m). The top honour for the best online game of the year went to Battlefield Vietnam. The Chronicles of Riddick: Escape from Butcher Bay was handed the Unsung Hero Game of 2004. Its release was somewhat eclipsed by Doom 3, which was released on the same week. It was, however, very well received by gamers and was praised for its storyline which differed from the film released around the same time. Electronic Arts was named top publisher of the year, taking the crown from Nintendo which won in 2003. The annual awards are voted for by more than 200,000 readers of computer and video games magazines. Games awards like this have grown in importance. Over the last six years, the UK market for games grew by 100% and was worth a record £1,152m in 2003, according to a recent report by analysts Screen Digest.\n", "llama3.2:1b": ["Doom 3 wins Ultimate Game award at Golden Joystick awards.", "Doom 3 won twice: Ultimate Game of the year and best PC game."], "llama3.2:3b": ["Doom 3 won Ultimate Game of the year and best PC game at the Golden Joystick awards, beating Grand Theft Auto: San Andreas and Halo 2.", "The Legend of Zelda took the Most Wanted for Christmas prize.", "Battlefield Vietnam was named top online game, while Electronic Arts was named top publisher."], "gemma2:2b": ["Doom 3 won both the Ultimate Game of the Year and Best PC Game awards at the Golden Joystick Awards.", "Other notable winners included Grand Theft Auto: San Andreas for Most Wanted Christmas prize, Halo 2 and Half-Life 2 were close contenders.", "The Legend of Zelda won Most Wanted game of 2005.", "Electronic Arts was named top publisher of the year."], "qwen2.5:0.5b": ["The ultimate game award went to Doom 3 at the Golden Joystick awards ceremony.", "The game won Best PC game, Best Game of the Year for games and Ultimate Game of the year.", "The game was released in August and has become the top-selling game on the UK charts, while its predecessor Grand Theft Auto: San Andreas received Best Game of the Year award.", "Doom 3 had a short run compared to other games at the time as it was one of four titles that shot straight to the top of the UK games chart.", "It also had a shorter release date and was initially not considered a best-selling game by critics but gained popularity among gamers, particularly for its story-driven gameplay.", "The awards ceremony, known as the Golden Joystick awards, is an annual event organized by Little Britain to recognize and award outstanding gaming achievements.", "The judges' votes were based on various factors including games' sales, market share, and overall popularity in the UK gaming scene."], "qwen2.5:1.5b": ["Doom 3 wins two Golden Joystick awards at the games ceremony, while The Legend of Zelda remains top game for Most Wanted titles; the console version of Battlefield Vietnam takes best online game prize; and Electronic Arts is crowned top publisher."], "qwen2.5:3b": ["Doom 3 won both Ultimate Game of the Year and Best PC Game at the Golden Joystick Awards, marking its success in the UK market where it topped charts on release.", "Other notable winners included Grand Theft Auto: San Andreas for Most Wanted game of Christmas, Halo 2/Half-Life 2 expected to be big hits later this month, The Legend of Zelda as Most Wanted game of 2005, and Battlefield Vietnam for Best Online Game of the Year.", "Doom 3 was developed over four years at a cost around $15m (£8.3m).", "Unsung Hero Game of 2004 went to The Chronicles of Riddick: Escape from Butcher Bay, which received positive feedback despite overshadowing by Doom 3.", "Electronic Arts topped the publisher awards for the year.", "The annual Golden Joystick Awards are voted on by over 200,000 readers, reflecting growing importance and market growth in UK games sector valued at £1,152m in 2003."], "opencoder:1.5b": ["Ultimate game award for Doom 3 is the title of the year for the best PC game.", "It was released as a part of the Golden Joystick awards at the Games' Ceremony in Little Britain.", "The game won numerous awards including the Best PC Game of the Year and the Most Wanted game of 2005, which was also won by the Nintendo title The Legend of Zelda.", "The game introduced 3D graphics and set the stage for a new era in computer games.", "It paved the way for first-person shooters like Doom 3, released in 1994, and established the concept of the game.", "Electronic Arts was named top publisher of the year.", "The annual awards are voted positively by several magazines and have earned thousands of viewership from gaming magazines."], "smollm:1.7b": ["Ultimate game award for Doom 3"], "deepseek-r1:1.5b": ["Doom 3 won the 'Ultimate Game' award at a ceremony, becoming the only title to win both Best PC Game and Ultimate Game.", "It was presented by Matt Lucas, with other winners including Grand Theft Auto: San Andreas and Halo 2.", "The original Doom, released in 1994, introduced 3D graphics and established the first-person shooter concept.", "Doom 3's release in August saw it achieve top rankings on UK gaming charts.", "Notable competitors included The Legend of Zelda for the Most Wanted prize, while Electronic Arts claimed Readers' Choice voting at a readership survey by Screen Digest.", "Over six years, the market grew significantly, reflecting Doom 3's success."], "tinyllama:1.1b": ["The annual awards recognizing the most awaited and highly-anticipated video games of the year were presented at an event, attracting numerous guests from various sectors of the gaming industry.", "The top prize for the Most Wanted Game of the Year went to Doom 3, which was developed over four years and cost around $15m (£8.3m).", "The award also included other titles that took the lead in the UK games charts, including Grand Theft Auto: San Andreas, Halo 2, and Half-Life 2, all of which are expected to hit shelves later this month.", "Doom 3 was praised for its storyline, which differed from the film on which it was based, but received criticism for being too similar to the movie.", "Electronic Arts was named publisher of the year, taking over from Nintoo, who had won in 2003.", "These awards have become increasingly important in recognizing and rewarding the most anticipated games of the year, with a record £1,152m worth of video game sales being recorded for the UK market in 2003 according to Screen Digest's analysis."], "tinydolphin:1.1b": [" Doom 3 has been honored with the prestigious 'Ultimate Game of the Year' award at the Golden Joystick Awards, where it took top prize over Grand Theft Auto: San Andreas and Halo 2.", "The title, which was released in August, also won Best PC Game for its innovative gameplay, as well as Most Wanted on Christmas Day.", "This marks the first time a game from an American company has been awarded the Most Wanted title.", "The previous winners included Grand Theft Auto: San Andreas, Halo 2, and Half-Life 2, which are expected to be major hits when they are released later this month."], "phi:2.7b": [" Doom 3, a sci-fi shooter game, won two Golden Joystick awards - Ultimate Game of the Year and Best PC Game - at the ceremony presented by Little Britain's Matt Lucas.", "It was followed closely by Grand Theft Auto: San Andreas, Halo 2, and Half-Life 2.", "The Legend of Zelda, released in 2005, took home the prize for Most Wanted game.", "Doom 3 is an expensive game developed over four years with a cost of around $15m (£8.3m).", "The top honour for the best online game of the year was awarded to Battlefield Vietnam.", "Electronic Arts won the title of top publisher of the year."], "orca-mini:3b": [" Doom 3 won the Ultimate Game of the Year award at the Golden Joystick awards, along with the Best PC Game award.", "It was the only game to win twice and was also closely followed by Grand Theft Auto: San Andreas in the Most Wanted category.", "However, it missed out on the prize for the Most Wanted game of 2005, which went to The Legend of Zelda.", "Doom was the first-person shooter genre's pioneer and was created over four years with a cost of around $15m.", "The Chronicles of Riddick: Escape from Butcher Bay won Unsung Hero Game of 2004, while Battlefield Vietnam took the Best Online Game of 2004 award.", "Electronic Arts was named top publisher of the year, having previously been voted as such in 2003.", "The UK games market grew by 100% and was worth a record £1,152m in 2003 according to a report by analysts Screen Digest."], "hermes3:3b": ["Doom 3 wins 'Ultimate Game' at Golden Joystick awards, beating competitors like Grand Theft Auto: San Andreas and Halo 2."], "stablelm-zephyr:3b": ["Doom 3 won Ultimate Game of the Year and Best PC Game at the Golden Joystick awards, beating competition including Grand Theft Auto: San Andreas, Halo 2, and Half-Life 2.", "The original Doom introduced 3D graphics and established the first-person shooter concept.", "Battlefield Vietnam won Best Online Game, and The Chronicles of Riddick: Escape from Butcher Bay was named Unsung Hero Game of 2004.", "Electronic Arts took the top publisher award, surpassing Nintendo which had won in 2003.", "Over 200,000 readers of computer and video games magazines voted for the annual awards, which recognize a 100% growth in the UK games market over the past six years, reaching £1,152m in 2003."], "chatgpt-4o-latest": ["Doom 3 won Ultimate Game of the Year and Best PC Game at the Golden Joystick Awards, hosted by Matt Lucas.", "The sci-fi horror shooter topped UK charts upon its August release.", "Grand Theft Auto: San Andreas won the Most Wanted for Christmas award, while The Legend of Zelda was named Most Wanted Game of 2005.", "Battlefield Vietnam won Best Online Game, and The Chronicles of Riddick: Escape from Butcher Bay was recognized as the Unsung Hero Game of 2004.", "Electronic Arts was named top publisher, overtaking Nintendo.", "The awards, voted on by over 200,000 readers, reflect the growing importance of the gaming industry, which doubled in value over six years to £1,152m in 2003."], "stablelm2:1.6b": ["Doom 3 won Ultimate Game of the Year and Best PC game at the Golden Joystick Awards, while Grand Theft Auto: San Andreas won Most Wanted for Christmas.", "The much-anticipated sci-fi horror Doom 3 was the top-selling game in the UK charts upon release.", "Little Britain star Matt Lucas presented the awards.", "Battlefield Vietnam took the top honor for best online game of the year, and Electronic Arts won top publisher of the year."], "granite3.1-dense:2b": ["Doom 3 clinched the \"Ultimate Game\" title at the Golden Joystick awards, winning twice: as Ultimate Game of the year and best PC game.", "Presented by Matt Lucas, this much-anticipated sci-fi horror became the UK's top-charting game upon its August release.", "Other notable titles included Grand Theft Auto: San Andreas (Most Wanted for Christmas) and upcoming games like Halo 2 and Half-Life 2.", "However, The Legend of Zelda took home the Most Wanted for 2005 award.", "Doom 3's development spanned four years and cost approximately $15m.", "Battlefield Vietnam claimed the best online game honor, while The Chronicles of Riddick: Escape from Butcher Bay received Unsung Hero Game of 2004.", "Electronic Arts emerged as top publisher for 2004, surpassing Nintendo.", "These awards, voted by over 200,000 magazine readers, reflect a 100% market growth in the UK over six years, reaching £1,152m in 2003 according to Screen Digest analysts."]}