{"raw_text": "Broadband in the UK growing fast\n \n High-speed net connections in the UK are proving more popular than ever.\n \n BT reports that more people signed up for broadband in the last three months than in any other quarter. The 600,000 connections take the total number of people in the UK signing up for broadband from BT to almost 3.3 million. Nationally more than 5 million browse the net via broadband. Britain now has among the highest number of broadband connections throughout the whole of Europe.\n \n According to figures gathered by industry watchdog, Ofcom, the growth means that the UK has now surpassed Germany in terms of broadband users per 100 people. The UK total of 5.3 million translates into 7.5 connections per 100 people, compared to 6.7 in Germany and 15.8 in the Netherlands. The numbers of people signing up to broadband include those that get their service direct from BT or via the many companies that re-sell BT lines under their own name. Part of the surge in people signing up was due to BT stretching the reach of ADSL - the UK's most widely used way of getting broadband - beyond 6km.\n \n Asymmetric Digital Subscriber Line technology lets ordinary copper phone lines support high data speeds. The standard speed is 512kbps, though faster connections are available. \"This breakthrough led to a dramatic increase in orders as we were suddenly able to satisfy the pent-up demand that existed in many areas,\" said Paul Reynolds, chief executive of BT Wholesale which provides phone lines that other firms re-sell. BT Retail, which sells net services under its own name, also had a good quarter and provided about 30% of the new broadband customers. This was a slight increase on the previous three months. Despite the good news about growth in broadband, figures from telecommunications regulator Ofcom show that BT faces increasing competition, and dwindling influence, in other sectors. Local Loop Unbundling, (LLU), in which BT rivals install their hardware in exchanges and take over the line to a customer's home or office, is growing steadily. Cable & Wireless and NTL have announced that they are investing millions to start offering LLU services. By the end of September more than 4.2 million phone lines were using so-called Carrier Pre-Section (CPS) services, such as TalkTalk and One.Tel, which route phone calls across non-BT networks from a local exchange. There are now more than 300 different firms offering CPS services and the percentage of people using BT lines for voice calls has shrunk to 55.4%.\n", "llama3.2:1b": ["UK broadband growth continues rapidly with over 600,000 connections in the last three months, bringing the total number almost to 3.3 million.", "The UK now surpasses Germany in terms of broadband users per 100 people, with a total of 5.3 million.", "The UK has surpassed Germany and Netherlands in broadband usage per 100 people, while also having the highest number of broadband connections throughout Europe."], "llama3.2:3b": ["High-speed broadband connections in the UK are growing fast, with 600,000 new connections added in the last quarter, taking total broadband users to almost 3.3 million, or over 5 million nationally.", "The UK now has among the highest numbers of broadband connections in Europe, surpassing Germany and the Netherlands."], "gemma2:2b": ["Broadband adoption in the UK is surging.", "More people signed up for broadband in the last quarter than ever before, leading to almost 3.3 million subscribers for BT alone.", "This makes the UK one of the European leaders in broadband connections per capita.", "Competition from other providers like Cable & Wireless and NTL is growing while local loop unbundling services are gaining popularity.", "BT's influence in voice communications is declining as more people use alternative carrier services."], "qwen2.5:0.5b": ["UK broadband growth is increasing rapidly as more customers opt for high-speed internet connections, according to BT.", "According to industry data from Ofcom, the UK now has the highest number of broadband users per 100 people of any EU country.", "The trend shows that Germany and Netherlands are trailing behind in terms of broadband penetration.", "In June this year, more than 5 million customers signed up for broadband via BT or re-sold lines from other companies under their own names.", "More than 4 million phones were using CPS services."], "qwen2.5:1.5b": ["Broadband connections in the UK are growing rapidly, surpassing Germany as the country with the highest number of broadband users per capita.", "The growth is attributed to increased demand from consumers signing up directly or via re-sellers of BT services, particularly from the ADSL technology that has expanded beyond its traditional 6km reach.", "Despite this positive trend, BT faces competition and declining influence in other sectors due to local loop unbundling (LLU) investments by rivals like Cable & Wireless and NTL, leading to a decline in BT's share of phone lines for voice calls."], "qwen2.5:3b": ["Broadband in the UK is rapidly growing with BT reporting a significant increase in subscribers over the last three months, reaching almost 3.3 million total sign-ups and over 5 million using broadband.", "This places the UK ahead of Germany in terms of broadband users per capita (7.5 vs. 6.7).", "BT's expansion of ADSL technology beyond 6km contributed to this surge.", "While BT faces increasing competition from rivals like Cable & Wireless, who are investing in LLU services, BT still maintains a strong presence with over 4 million lines using Carrier Pre-Section (CPS) services, though its share for voice calls is decreasing."], "opencoder:1.5b": ["The text summarizes the growing trend in broadband usage in the UK, with significant growth occurring from March to September, highlighting a surge in users who sign up via Direct-Connecting partners like BT.", "The numbers indicate an increase in connections per 100 people, further supporting the overall growth of broadband service in Europe.", "However, there are also noticeable fluctuations, with fluctuations in the share of users who opt for CPS services.", "Despite significant competition and dwindling influence from telecom giants like BT, these figures remain consistent."], "smollm:1.7b": ["Broadband in the UK growing fast"], "deepseek-r1:1.5b": ["Broadband in the UK is growing rapidly, with high-speed connections becoming more popular than ever.", "BT reports that over three months, 600,000 people signed up for broadband, increasing the total to nearly 3.3 million users in the UK.", "Nationally, there are about 5 million users browsing via broadband.", "According to Ofcom, the UK is leading by more than Germany in terms of users per 100 people (7.5 vs. 6.7), with a slight increase over previous quarters.", "The figures include BT and others providing services directly or through re-sold lines.", "BT's Asymmetric Digital Subscriber Line (ADSL) technology allows coverage beyond 6km, contributing to the surge.", "Additionally, local Loop Unbundling (LLU) is growing, enabling many firms to offer their hardware in exchanges for customers via non-BT networks.", "Companies like BT and cable companies are investing in LLU services.", "In summary, the UK's broadband growth has been strong, with significant user numbers and intense competition among providers."], "tinyllama:1.1b": ["En rapport avec : Broadband in the UK is growing fast, as high-speed net connections are increasingly popular among consumers and providers alike.", "The UK now has one of the highest numbers of broadband connections, with more than 3.3 million people signed up for BT's service.", "However, this growth has not gone unnoticed by other companies offering similar services, as Ofcom's statistics reveal a growing competition and dwindling influence in telecommunications.", "Asymmetric Digital Subscriber Line (ADSL) technology allows for high-speed connectivity beyond the 6km reach of traditional copper phone lines, with an average speed of 512kbps.", "BT's success in offering this service to the public has led to increased competition, and dwindling influence, among other telecommunications providers.", "Local Loop Unbundling (LLU) services have grown in popularity, as more companies invest in these infrastructures to offer their hardware and services to consumers' homes or offices, while Carrier Pre-Section (CPS) service routes phone calls across non-BT networks from local exchanges.", "The percentage of people using BT lines for voice calls has declined to 55.4%, as telecommunications providers strive for dominance in an increasingly crowded market."], "tinydolphin:1.1b": [" The UK is becoming known as a leader in high-speed internet, with more people signing up for broadband connections compared to ever before.", "This growth has been fueled by a rise in the number of households signed up for service, according to BT's latest figures.", "In the past three months alone, the company reported that 600,000 new broadband users joined the ranks, an increase of almost 5 million from the previous quarter.", "This is particularly important in terms of rankings in Europe, where Britain now has among the highest numbers of broadband connections in comparison to Germany and other European countries.", "In addition to this growth, the UK has surpassed Germany and reached 7.5 connections per 100 people compared to the previous estimate from Ofcom.", "This highlights how rapidly the country's internet infrastructure is being developed and expanded."], "phi:2.7b": [" The UK is experiencing rapid growth in high-speed broadband connections, with more people signing up than ever before.", "Britain now boasts among the highest number of broadband users per 100 people in Europe, surpassing Germany.", "This surge is due in part to BT's expansion of ADSL connectivity to 6km, making it easier for people to access high-speed internet services.", "Despite this growth, competition from alternative providers like Local Loop Unbundling (LLU) and Carrier Pre-Section (CPS) services is increasing, causing a decline in the popularity of phone lines used by BT."], "orca-mini:3b": [" Broadband connections in the UK are rapidly growing, with more than 7 million people signing up for broadband from BT since the last quarter.", "This is a significant increase from the previous three months and makes Britain one of the highest numbers of broadband users throughout Europe.", "The growth has led to an increase in demand for Asymmetric Digital Subscriber Line (ADSL) technology, which allows ordinary copper phone lines to support high data speeds.", "Despite the growing competition in other sectors, such as local loop unbundling and cable and wireless services, BT remains a major player in the broadband industry."], "hermes3:3b": ["UK broadband growth accelerating\nBT reports record quarterly broadband sign-ups\nUK now surpasses Germany in broadband users per 100 people"], "stablelm-zephyr:3b": ["In the UK, broadband connections are becoming increasingly popular with more than 5 million people browsing the internet via broadband, a figure which puts the country among the highest in Europe.", "According to Ofcom, this growth has led the UK to surpass Germany in terms of broadband users per 100 people; at 5.3 million connections, it equates to 7.5 connections per 100 people compared to 6.7 in Germany and 15.8 in the Netherlands.", "This surge in sign-ups includes those receiving service directly from BT or through companies that resell BT lines under their own names.", "Part of this increase is attributed to BT expanding the reach of ADSL, the UK's most widely used broadband method, beyond six kilometres.", "The Asymmetric Digital Subscriber Line technology enables ordinary copper phone lines to support high data speeds with the standard speed being 512kbps and faster connections available.", "Despite the growth in broadband usage, Ofcom shows that BT faces increasing competition and a diminishing influence in other sectors, particularly as local loop unbundling grows."], "chatgpt-4o-latest": ["Broadband adoption in the UK is growing rapidly, with BT reporting a record 600,000 new connections in the last quarter, bringing its total to nearly 3.3 million.", "Nationally, over 5 million people use broadband, making the UK one of Europe's leading countries in broadband connections.", "Ofcom data shows the UK has surpassed Germany in broadband users per 100 people, reaching 7.5 compared to Germany’s 6.7.", "The expansion of ADSL coverage beyond 6km contributed to the surge in demand.", "BT Retail accounted for 30% of new broadband customers, but BT faces increasing competition from Local Loop Unbundling (LLU) providers like Cable & Wireless and NTL.", "Additionally, over 4.2 million phone lines now use Carrier Pre-Selection (CPS) services, reducing BT’s share of voice calls to 55.4%."], "stablelm2:1.6b": ["Britain's high-speed internet usage is rapidly increasing with over 5 million people browsing the web through broadband, surpassing Germany in terms of users per capita.", "According to Ofcom data, the UK now has 3.3 million broadband subscribers, including those provided by BT or resold by other companies.", "Asymmetric Digital Subscriber Line technology allows support for high data speeds and is commonly used (kbps), though faster connections are available.", "BT's expansion of ADSL beyond 6km helped satisfy the demand for internet access, leading to an increase in orders from both BT Retail and BT Wholesale.", "However, competition and dwindling influence in other sectors, such\nas Local Loop Unbundling (LLU), pose challenges for BT as rivals invest millions into LLU services."], "granite3.1-dense:2b": ["The UK is experiencing rapid expansion in high-speed broadband connections, with over 600,000 new sign-ups reported by BT in the last quarter, bringing the total to nearly 3.3 million and more than 5 million nationally.", "This growth has surpassed Germany, with 7.5 connections per 100 people, compared to 6.7 in Germany and 15.8 in the Netherlands, according to Ofcom data.", "Asymmetric Digital Subscriber Line (ADSL) technology enables ordinary phone lines to support high-speed internet, expanding BT's reach to over 6km from base.", "Both BT Wholesale and BT Retail contributed significantly to these new customers, with a slight increase in orders for BT services.", "However, competitors like Cable & Wireless and NTL are investing heavily in Local Loop Unbundling (LLU), which allows rivals to install hardware in exchanges and manage connections directly to consumers' homes or offices.", "As of September, over 4.2 million phone lines were using Carrier Pre-Section (CPS) services from non-BT networks like TalkTalk and One.Tel, with more than 300 firms now offering such services.", "Consequently, the percentage of people using BT for voice calls has dropped to 55.4%.", "Despite the growth in broadband, BT faces diminishing influence in other sectors due to increasing competition from LLU providers."]}