{"raw_text": "US duo in first spam conviction\n \n A brother and sister in the US have been convicted of sending hundreds of thousands of unsolicited e-mail messages to AOL subscribers.\n \n It is the first criminal prosecution of internet spam distributors. Jurors in Virginia recommended that the man, Jeremy Jaynes, serve nine years in prison and that his sister, Jessica DeGroot, be fined $7,500. They were convicted under a state law that bars the sending of bulk e-mails using fake addresses.\n \n They will be formally sentenced next year. A third defendant, Richard Rutkowski, was acquitted. Prosecutors said Jaynes was \"a snake oil salesman in a new format\", using the internet to peddle useless wares, news agency Associated Press reported. A \"Fed-Ex refund processor\" was supposed to allow people to earn $75 an hour working from home. Another item on sale was an \"internet history eraser\". His sister helped him process credit card payments. Jaynes amassed a fortune of $24m from his sales, prosecutors said. \"He's been successful ripping people off all these years,\" AP quoted prosecutor Russell McGuire as saying. Jaynes was also found guilty of breaking a state law which prohibits the sending of more than 100,000 e-mails in 30 days, Virginia State Attorney General Jerry Kilgore reportedly said. Prosecutors had asked for 15 years in jail for Jaynes, and a jail term for his sister. But Jaynes' lawyer David Oblon called the nine-year recommended term \"outrageous\" and said his client believed he was innocent. He pointed out that all three of the accused lived in North Carolina and were unaware of the Virginia state law. Spam messages are estimated to account for at least 60% of all e-mails sent.\n", "llama3.2:1b": ["A US brother and sister, Jeremy Jaynes and Jessica DeGroot, have been convicted of sending hundreds of thousands of unsolicited e-mail messages to AOL subscribers.", "They were found guilty under a Virginia state law that prohibits the sending of bulk e-mails using fake addresses.", "The jury recommended that Jaynes serve nine years in prison and his sister be fined $7,500."], "llama3.2:3b": ["A US brother and sister, Jeremy Jaynes and Jessica DeGroot, have been convicted of sending hundreds of thousands of unsolicited emails to AOL subscribers in a criminal prosecution under a state law that bars bulk spam messages using fake addresses."], "gemma2:2b": ["A US brother and sister were convicted of sending unsolicited emails to AOL subscribers, marking the first criminal prosecution for internet spam distributors.", "They were sentenced to nine years in prison and fines of $7,500 respectively.", "A third defendant was acquitted.", "Prosecutors said they made millions from selling useless products and services via these emails and broke state laws regarding email volume."], "qwen2.5:0.5b": ["US internet spam distributors, a brother and sister, were convicted of sending hundreds of thousands of unsolicited e-mail messages to AOL subscribers.", "They received a nine-year sentence with fines for their criminal prosecution.", "Jeremy Jaynes was found guilty of using a state law that bars the sending of more than 100,000 e-mails in 30 days.", "His sister Jessica DeGroot was convicted under a different law that forbids spam sending, while Richard Rutkowski was acquitted and his sister helped him process credit card payments."], "qwen2.5:1.5b": ["Two US siblings have been convicted of sending millions of spam emails, becoming the first people prosecuted for distributing unsolicited electronic mail.", "Jaynes received a nine-year sentence and his sister $7,500 fine; another defendant was acquitted.", "The case highlights the prevalence of email scams and raises concerns about their impact on internet users."], "qwen2.5:3b": ["US duo convicted of spamming AOL subscribers; first such criminal prosecution.", "Jeremy Jaynes and Jessica DeGroot received nine years in prison and a $7,500 fine respectively under a state law banning fake addresses.", "They used internet to sell fraudulent schemes like an \"internet history eraser\" and falsely claimed it allowed people to work from home earning up to $75 per hour.", "Prosecutors alleged they made over $24 million through fraud.", "The trio were acquitted of sending more than 100,000 emails in a month as required by another state law.", "Spam messages account for at least 60% of all emails sent."], "opencoder:1.5b": ["US duo in first spam conviction\n\nA brother and sister have been convicted of sending hundreds of thousands of unsolicited e-mail messages to AOL subscribers.", "The first criminal prosecution of internet spam distributors.", "The plaintiffs recommended that the man, Jeremy Jaynes, serve nine years in prison and that his sister, Jessica DeGroot, be fined $7,500.", "They are formally sentenced next year.", "A third defendant, Richard Rutkowski, was acquitted.", "Prosecutors said Jaynes was \"a snake oil salesman in a new format\", using the internet to peddle useless wares, an Associated Press report from the Associated Press quoted.", "A \"Fed-Ex refund processor\" was supposed to allow people to earn $75 an hour working from home.", "There is also another item on sale which he helped process credit card payments.", "Jaynes has been successful ripping people off all these years and spent a fortune of $24 million.", "They have been successful ripping people off all these years, the Associated Press quoted the prosecutor's case.", "Jaynes was found guilty of breaking a state law that prohibits the sending of more than 100,000 e-mails in 30 days, Virginia State Attorney General Jerry Kilgore reportedly said.", "A jail term for his sister and three years in prison were requested.", "The jury's outguess is that he served a \"outrageous\" length of time and that his client believed he was innocent."], "smollm:1.7b": ["The summary is as follows:\n\n1.", "US duo in first spam conviction: The brothers and sister in the US have been convicted of sending hundreds of thousands of unsolicited e-mail messages to AOL subscribers, which is the first criminal prosecution of internet spam distributors.", "2.", "Jurors recommended that the man be sentenced nine years in prison and that his sister be fined $7,500 for serving nine years in prison.", "3.", "They will be formally sentenced next year.", "4.", "A third defendant, Richard Rutkowski, was acquitted.", "Prosecutors said Jaynes was \"a snake oil salesman in a new format\", using the internet to peddle useless wares, news agency Associated Press reported.", "5.", "Prosecutors also pointed out that his sister helped him process credit card payments and that he had amassed a fortune of $24 million from his sales.", "6.", "Jaynes was also found guilty of breaking a state law which prohibits the sending of more than 100,000 e-mail messages in 30 days, Virginia State Attorney General Jerry Kilgore reportedly said.", "7.", "Prosecutors had asked for 15 years in jail for Jaynes, and a jail term for his sister.", "But Jaynes' lawyer David Oblon called the nine-year recommended term \"outrageous\" and said his client believed he was innocent.", "He pointed out that all three of the accused lived in North Carolina and were unaware of the Virginia state law.", "The summary captures the key ideas and details from the original text, including:\n\n* The first criminal prosecution of internet spam distributors\n* The recommended sentence for Jaynes, with a focus on the number of years he would be sentenced to serve (nine years)\n* The sister's role in the case, highlighting her involvement in processing credit card payments and helping Jaynes send unsolicited emails\n* The fact that all three defendants lived in North Carolina and were unaware of the Virginia state law\n* The lack of evidence against Jaynes, with no mention of his alleged crimes or wrongdoing\n* The fact that the sisters' involvement was not mentioned in the summary"], "deepseek-r1:1.5b": ["The US duo consisting of a brother and sister were convicted in the first criminal prosecution of internet spam distributors, facing charges under a state law that prohibits sending bulk emails using fake addresses.", "They will be sentenced next year.", "One defendant was acquitted.", "The main charges involved fraudulent marketing via email to AOL subscribers, including peddling useless content, refund processors, and an internet history eraser.", "Jeremy Jaynes made $24 million and helped process credit card payments.", "He was found guilty of violating state law for 100,000 emails in 30 days, and his sister played a key role in this fraud.", "The charges account for at least 60% of all emails sent.", "Jeremy Jaynes is to serve nine years in prison, while his sister will be fined $7,500."], "tinyllama:1.1b": ["In their first conviction, a brother and sister in the US have been found guilty of sending hundreds of thousands of unsuspecting AOL subscribers unsolicited e-mail messages.", "The siblings were jailed for nine years each after jurors recommended that they serve 9 years in prison and be fined $7,500 for violating a state law forbidding the sending of bulk e-mails using fake addresses.", "Spam messages, which are estimated to account for at least 60% of all e-mails sent, have become increasingly prevalent over the past decade due to their easy accessibility and unsolicited nature."], "tinydolphin:1.1b": [" In a recent court conviction, two brothers from the US have been found guilty of sending hundreds of thousands of unsolicited emails to AOL subscribers.", "Jurors in Virginia recommended that the man, Jeremy Jaynes, serve nine years in prison and that his sister, Jessica DeGroot, be fined $7,500.", "Both brothers will be formally sentenced next year.", "The three are accused of using fake addresses and selling unwanted wares, including a \"Fed-Ex refund processor\" and an \"internet history eraser.\"", "Their conviction is a first for internet spamming distributors in the US."], "phi:2.7b": [" The US duo, Jeremy Jaynes and Jessica DeGroot, have been convicted of sending unsolicited emails to AOL subscribers using fake addresses.", "They are believed to be the first people to face criminal prosecution under a state law that bars bulk email distribution.", "Prosecutors say they were selling useless products such as an \"internet history eraser\" and earning a fortune of $24 million.", "Jaynes' lawyer argues for his client's innocence, but he will likely serve 9 years in prison and pay a fine.", "The case highlights the issue of spam emails, which are estimated to make up 60% of all e-mails sent."], "orca-mini:3b": [" A brother and sister from the US have been convicted of sending hundreds of thousands of unsolicited email messages to AOL subscribers, using fake addresses.", "They will be sentenced next year after being found guilty by a jury under a state law that bars the sending of bulk e-mails using fake addresses.", "The man was \"a snake oil salesman in a new format\", while his sister helped process credit card payments for their sales, prosecutors said.", "Jaynes amassed a fortune of $24 million from his sales and was found guilty of breaking a state law which prohibits the sending of more than 100,000 e-mails in 30 days.", "The lawyer for the accused argued that the nine-year recommended term for his client was \"outrageous\" and pointed out that all three were unaware of the Virginia state law.", "Spam messages are estimated to account for at least 60% of all email sent."], "hermes3:3b": ["US Brother-Sister Convicted for Spam, 1st Case"], "stablelm-zephyr:3b": ["A US brother and sister have been convicted for sending hundreds of thousands of unsolicited emails, marking the first criminal prosecution of internet spam distributors.", "They were sentenced under a state law prohibiting bulk emails using fake addresses.", "The man, Jeremy Jaynes, was recommended to serve nine years in prison and his sister, Jessica DeGroot, was fined $7,500.", "A third defendant, Richard Rutkowski, was acquitted.", "Prosecutors claimed Jaynes was involved in selling useless products through the internet, earning him a fortune of $24m."], "chatgpt-4o-latest": ["A US brother and sister, Jeremy Jaynes and Jessica DeGroot, were convicted in Virginia for sending hundreds of thousands of spam emails to AOL users, marking the first criminal prosecution of internet spammers.", "Jaynes was sentenced to nine years in prison, while DeGroot was fined $7,500.", "They used fake addresses to send bulk emails promoting fraudulent products, including a \"Fed-Ex refund processor\" and an \"internet history eraser,\" amassing $24 million.", "A third defendant, Richard Rutkowski, was acquitted.", "Prosecutors sought a 15-year sentence for Jaynes, but his lawyer called the punishment excessive, arguing they were unaware of Virginia's law.", "Spam emails constitute at least 60% of all emails sent."], "stablelm2:1.6b": ["A brother and sister in the US were convicted for sending unsolicited email messages to AOL subscribers, making it the first criminal prosecution of internet spam distributors.", "They received nine-year prison sentences and a $7 fine each under Virginia's state law against sending bulk emails using fake addresses.", "A third defendant was acquitted.", "Prosecutors alleged that they were \"a snake oil salesman in a new format\" who sold various useless items via internet.", "The total earnings from their sales were estimated to be over $1 million, with spam messages accounting for at least 20% of all e-mails sent."], "granite3.1-dense:2b": ["A US brother-sister duo, Jeremy Jaynes and Jessica DeGroot, have been convicted in Virginia as the first spam distributors under criminal law.", "They were found guilty of sending hundreds of thousands of unsolicited emails to AOL subscribers using fake addresses, a violation of a state law that prohibits bulk emailing.", "Jaynes, described by prosecutors as a \"snake oil salesman,\" amassed an estimated $24 million from his fraudulent sales, including products like a Fed-Ex refund processor and an internet history eraser.", "Prosecutors sought 15 years in jail for Jaynes and a fine for DeGroot, but the jury recommended nine years for Jaynes and $7,500 in fines for his sister.", "The third defendant, Richard Rutkowski, was acquitted.", "The conviction is significant as it marks the first criminal prosecution of internet spam distributors.", "Spam emails are believed to constitute around 60% of all emails sent."]}