{"raw_text": "US blogger fired by her airline\n \n A US airline attendant suspended over \"inappropriate images\" on her blog - web diary - says she has been fired.\n \n Ellen Simonetti, known as Queen of the Sky, wrote an anonymous semi-fictional account of her life in the sky. She was suspended by Delta in September. In a statement, she said she was initiating legal action against the airline for \"wrongful termination\". A Delta spokesperson confirmed on Wednesday that Ms Simonetti was no longer an employee. Delta has repeatedly declined to elaborate on what it calls \"internal employee matters\". A spokesperson reiterated this position on Wednesday, confirming only that Ms Simonetti was no longer with the company. The spokesperson also confirmed that there were \"very clear rules\" attached to the unauthorised use of Delta branding, including uniforms. Ms Simonetti announced on her blog she had been fired on 1 November.\n \n She said in an official statement: \"As a result of my suspension and subsequent termination without cause by Delta Airlines I am moving forward with filing a discrimination complaint with the Federal Government EEOC [US Equal Employment Opportunity Commission].\" She added she had also hired a Texas-based law firm to initiate legal action for \"wrongful termination, defamation of character and lost future wages.\" Ms Simonetti told the BBC News website she had received no warning or further explanation when she was suspended on 25 September. Queen of the Sky has received a lot of support and advice from the global blogging community since news of her suspension was brought to light on the BBC News website and others.\n \n Her story has highlighted concerns amongst the growing blogging community about conflicts of interest, employment law and free speech on personal websites. The blog, which she started in January as a way of getting over her mother's death, contains a mix of fictional and non-fictional accounts. Queen of the Sky developed over the months as a character in her own right, according to Ms Simonetti. In the postings, she made up fictional names for cities and other companies she mentioned to protect anonymity. But some postings contained images of herself in uniform. Of the 10 or so images only one showed Ms Simonetti's flight \"wings\". She removed them as soon as she was informed of her suspension. \"I never meant it as something to harm my company and don't understand how they think it did harm them,\" Ms Simonetti said. A legal expert in the US speculated that Delta might be concerned that the fictional content on the blog may be linked back to the airline after the images were posted.\n \n Delta has been hit recently by pressures of rising fuel costs and fierce competition. It has said it needs to cut between 6,000 and 7,000 jobs and reduce costs by $5bn (£2.7bn) a year. Analysts had warned recently that the airline might have to seek Chapter 11 bankruptcy prevention. Last week, it struck a $1bn cost-cutting deal with its pilots which could save it from bankruptcy. The deal would see pilots accept a 32% pay cut in return for the right to buy 30 million Delta shares, unions said. And on Monday, it negotiated a deal to defer about $135m in debt which was due next year, until 2007. The airline also said it had agreed the terms of a $600m loan from American Express.\n", "llama3.2:1b": ["US blogger Ellen Simonetti has been fired by Delta Airlines after being suspended over \"inappropriate images\" on her blog.", "She claims she was terminated without cause and is filing discrimination complaints with the US Equal Employment Opportunity Commission.", "The airline has denied any wrongdoing, citing \"clear rules\" about unauthorized use of branding.", "Simonetti is seeking wrongful termination, defamation of character, and lost future wages.", "Her story has highlighted concerns in the blogging community about conflicts of interest, employment law, and free speech online."], "llama3.2:3b": ["US blogger Ellen Simonetti, known as Queen of the Sky, has been fired by Delta Airlines after being suspended over \"inappropriate images\" on her blog.", "She claims to have been terminated without cause and is initiating legal action against the airline for \"wrongful termination\".", "Ms Simonetti had used fictional accounts to protect anonymity but inadvertently posted images of herself in uniform, which may have raised concerns about conflicts of interest with Delta."], "gemma2:2b": ["Ellen Simonetti, a US airline attendant known as \"Queen of the Sky,\" was fired by Delta Airlines for allegedly inappropriate images on her blog.", "She is taking legal action against the company alleging wrongful termination and defamation.", "The blog contained fictionalized accounts of her life in the sky, but some featured images of herself in uniform that led to her suspension and subsequent firing.", "Simonetti claims she had no warning or explanation from Delta before being fired.", "This incident highlights concerns about conflicts of interest, employment law, and free speech for bloggers."], "qwen2.5:0.5b": ["Queen of the Sky, an US blogger suspended by her airline Delta for \"inappropriate images,\" has filed a discrimination complaint with the Federal Government EEOC.", "She hired a Texas-based law firm to pursue legal action against Delta and defend herself.", "Her story highlights concerns about employment laws, free speech on personal websites, and conflicts of interest in personal blogging.", "Queen of the Sky started her blog as a way to deal with the emotional distress caused by the death of her mother."], "qwen2.5:1.5b": ["A blogger who wrote an anonymous semi-fictional account of her life as a Delta Airlines attendant has been fired and is suing for wrongful termination.", "The incident highlights concerns about conflicts of interest, employment law, and free speech on personal websites."], "qwen2.5:3b": ["A US airline attendant, Ellen Simonetti (known as Queen of the Sky), wrote an anonymous semi-fictional account on her blog about her life in the sky.", "She was suspended by Delta Airlines for \"inappropriate images\" and later terminated without cause.", "Her termination led to discussions about conflicts of interest, employment law, and free speech on personal websites.", "The blog contains a mix of fictional and non-fictional accounts, with some images removed after being informed of her suspension.", "Analysts suggested that Delta might be concerned about potential negative implications for the airline if linked to the fictitious content."], "opencoder:1.5b": ["The US airline attendant fired her on a web diary stating she has been fired for inappropriate images.", "Her story highlighted concerns among the blogging community about conflicts of interests and employment law, as well as free speech on personal websites.", "The blog was started in January with a purpose to get over her mother's death.", "In the postings, she made up fictional names for cities and other companies mentioned to protect anonymity.", "But some postings contained images of her in uniform.", "Delta has recently been hit by rising fuel costs and intense competition.", "It has called on the airline to cut between 6000 and 7000 jobs, which could save it from bankruptcy.", "The legal expert speculated that Delta might be concerned about linking back to the airline after the images were posted.", "The deal negotiated with American Express had a pay-cut agreement, allowing the right to buy 30 million Delta shares and a 32% pay cut for a loan.", "The blog owner also agreed to a $600m loan from American Express which could save her from bankruptcy if not allotted."], "smollm:1.7b": ["The summary is concise and objective, preserving key ideas and details while omitting unnecessary information.", "The text focuses on the main points:\n\n1.", "A US airline attendant suspended over \"inappropriate images\" on her blog - web diary - says she has been fired.", "2.", "Ellen Simonetti, known as Queen of the Sky, wrote an anonymous semi-fictional account of her life in the sky.", "She was suspended by Delta in September.", "In a statement, she said she was initiating legal action against the airline for \"wrongful termination\".", "A Delta spokesperson confirmed on Wednesday that Ms Simonetti was no longer with the company.", "3.", "The US blogger fired by her employer - Delta Airlines - wrote an anonymous semi-fictional account of her life in the sky.", "She was suspended by Delta in September.", "In a statement, she said she had been initiating legal action against the airline for \"wrongful termination\".", "A Delta spokesperson confirmed on Wednesday that Ms Simonetti was no longer with the company.", "4.", "The summary does not provide any information about the context or background of the story, such as the reason for the suspension, the nature of the blog, or the specific details of the semi-fictional account."], "deepseek-r1:1.5b": ["Ellen Simonetti was suspended for inappropriate images on her skieskimming blog, after writing a semi-factual account of her life in the sky.", "She started writing an unmodded account and was later suspended by Delta Airlines in September 2014, stating she initiated legal action against their handling of the situation.", "The suit includes claims of wrongful termination, defamation, and lost wages.", "Delta issued clear rules for using their branding on personal sites, including uniforms.", "Simonetti hired a law firm to handle the lawsuits.", "She mentioned receiving no warning and removed images linked to her flight post-suspension.", "Despite posts containing fictional content about her airline, her blog had both fiction and non-fictional accounts.", "The blog sparked concerns among the blogging community regarding conflicts of interest, employment law, and free speech.", "Delta's recent deals for cost-cutting and bankruptcy prevention highlight their strategic approach in adapting to rising costs."], "tinyllama:1.1b": ["A US airline attendance has been fired for \"inappropriate images\" on her blog.", "According to Queen of the Sky, she was suspended in September under \"wrongful terminations\", defamation of character and lost future waages.", "The blog's fictional content featured images of uniforms, but Ms Simonetti removed them after being informed of her suspension.", "Delta Airlines has faced pressure to reduce costs due to rising fuel prices and fierce competition.", "Analysts have warned the airline might have to seek Chapter 11 bankruptcy prevention, while negotiating a $135m loan with American Express.", "The airline also secured a deal to buy pilot's pay back in return for the right to sell shares worth $200m, until 2007."], "tinydolphin:1.1b": [" A US blogger who went viral with her airline farewell posts has reportedly been fired by her airline for posting fictional images on her blog as part of her work.", "Queen of the Sky was suspended over \"inappropriate images\" on her web diary and was terminated without cause, according to an official statement from Delta Airlines.", "The airline is facing increasing competition due to its costly fuel costs and intense pressure from the market for job cuts."], "phi:2.7b": [" A US blogger, Ellen Simonetti, known as Queen of the Sky, was suspended and fired by Delta Airlines after being found to have posted \"inappropriate images\" on her blog without permission.", "She has initiated legal action against Delta for wrongful termination and is seeking compensation for defamation of character and lost wages.", "The incident highlights concerns about employment law and free speech on personal websites.", "Delta says it was concerned that the images could be linked back to the airline, but Simonetti maintains she never meant any harm.", "The airline is facing financial difficulties and has already cut costs by"], "orca-mini:3b": [" An anonymous semi-fictional account written by a Delta Airlines attendant known as Queen of the Sky was suspended over \"inappropriate images\" on her blog, which contained fictional and non-fictional accounts.", "Ellen Simonetti was fired by Delta Airlines after being suspended in September.", "The blog contained images of herself in uniform, but only one showed her flight \"wings\".", "The airline is concerned that the fictional content on the blog may be linked back to the company.", "In October, Delta struck a $1bn cost-cutting deal with its pilots, and last week, it deferred about $135m in debt until 2007."], "hermes3:3b": ["US blogger Ellen Simonetti fired by airline Delta over blog suspension following \"internal employee matters\" regarding unauthorised use of Delta branding and uniforms."], "stablelm-zephyr:3b": ["US blogger Ellen Simonetti, known as \"Queen of the Sky\" and author of an anonymous semi-fictional blog about her life as an airline attendant, was fired by Delta after being suspended over \"inappropriate images\" on her blog.", "She announced her termination on November 1st and initiated legal action against the airline for wrongful termination, discrimination, defamation of character, and lost future wages.", "Delta declined to elaborate on the internal employee matters, but Simonetti claimed that some posts contained images of herself in uniform, leading the airline to potentially view the fictional content as linked back to them.", "The incident raised concerns among the blogging community about conflicts of interest, employment law, and free speech on personal websites."], "chatgpt-4o-latest": ["US airline attendant Ellen Simonetti, known as \"Queen of the Sky,\" was fired by Delta Airlines after being suspended in September for posting \"inappropriate images\" on her blog.", "Simonetti, who wrote a semi-fictional account of her life as a flight attendant, announced she would take legal action against Delta for wrongful termination, defamation, and lost wages.", "She also filed a discrimination complaint with the US Equal Employment Opportunity Commission.", "Delta declined to comment on the specifics but cited strict rules on unauthorized use of branding, including uniforms.", "Simonetti's case has sparked debate about employment law, free speech, and blogging.", "She removed the images after her suspension and insisted she never intended harm to the company.", "Delta, facing financial struggles, has been cutting costs and jobs to avoid bankruptcy, recently negotiating deals with pilots and creditors."], "stablelm2:1.6b": ["US blogger Ellen Simonetti, known as Queen of the Sky, was fired by Delta for posting \"inappropriate images\" on her blog.", "She is initiating legal action against the airline and has received support from the global blogging community regarding conflicts of interest, employment law, and free speech on personal websites.", "Her story highlights concerns about these issues among bloggers.", "One of the blog posts contained images of herself in uniform, and Delta might be concerned that the fictional content may link back to the airline after being posted.", "The airline has been hit by rising fuel costs and fierce competition; it needs to cut between 6-7 jobs and reduce costs by $5bn a year, potentially leading to bankruptcy prevention or avoidance."], "granite3.1-dense:2b": ["Delta Airlines fired Ellen Simonetti, known as Queen of the Sky, after she was initially suspended for posting \"inappropriate images\" on her anonymous blog, web diary.", "The airline confirmed her termination without providing further details due to internal matters.", "Simonetti initiated a discrimination complaint with the EEOC and hired a law firm to pursue legal action against Delta for wrongful termination, defamation of character, and lost future wages.", "Her blog, started in January as a coping mechanism after her mother's death, featured both fictional and non-fictional accounts, with some images of her in uniform that she subsequently removed upon learning of her suspension.", "Simonetti expressed confusion over how the airline perceived harm from her fictional content.", "This incident has sparked discussions within the blogging community about employment law, free speech, and conflicts of interest regarding personal websites.", "Delta, facing financial pressures including rising fuel costs and intense competition, had previously announced plans to cut jobs and reduce costs by $5bn annually, potentially leading to bankruptcy.", "The airline recently secured a $1bn cost-cutting deal with pilots and deferred $135m in debt, while also negotiating a $600m loan from American Express."]}