{"raw_text": "Mobile gig aims to rock 3G\n \n Forget about going to a crowded bar to enjoy a gig by the latest darlings of the music press.\n \n Now you could also be at a live gig on your mobile, via the latest third generation (3G) video phones. Rock outfit Rooster are playing what has been billed as the first ever concert broadcast by phone on Tuesday evening from a London venue. The 45-minute gig is due to be \"phone cast\" by the 3G mobile phone operator, 3. 3G technology lets people take, watch and send video clips on their phones, as well as swap data much faster than with 2G networks like GSM. People with 3G phones in the UK can already download football and music clips on their handsets.\n \n Some 1,000 fans of the London-based band will have to pay five pounds for a ticket and need a 3G handset.\n \n \"Once you have paid, you can come and go as much as you like, because we expect the customers to be mobile,\" said 3 spokesperson Belinda Henderson. \"It's like going to a concert hall, except that you are virtually there.\" The company behind the trial hopes to learn more about how people use their video phones. \"We are looking on how long people will stay on average on the streams. Some people may stay the whole time, some may dip in and out,\" said Ms Henderson. \"We actually expect people to dip in and out because they are mobile and they will be doing other things.\" 3 is looking to music as a way of persuading more people to take up the latest video phones. It is already planning regular gigs throughout 2005. And during the intermission, of course, you would still be able to make a phone call.\n", "llama3.2:1b": ["Rooster's concert broadcast via mobile 3G video phones will be available for 45 minutes on Tuesday evening from a London venue.", "The live gig is part of a trial with 1,000 fans who must pay £5 per ticket and have a 3G handset.", "The concert hall-like experience allows users to watch and send video clips while being mobile, with the company hoping to learn how long people stay on average streams."], "llama3.2:3b": ["Rooster rock gig will be broadcast via 3G mobile phones in London with 1,000 fans paying £5 for ticket access.", "The 45-minute concert will let viewers come and go as they please, with the goal of understanding how people use their video phones during the event."], "gemma2:2b": ["A live music gig by the band Rooster will be broadcast via 3G mobile phone technology for the first time, with audience members paying £5 and attending virtually in their homes.", "The trial aims to gather data about how people use video phones and further encourage adoption of these devices through planned regular gigs throughout 2005."], "qwen2.5:0.5b": ["1.", "Mobile gig aims to rock 3G\n\n  2.", "London-based band Rooster performs live by phone with latest third-generation (3G) video phones.", "3.", "Some 1,000 fans have to pay five pounds for tickets and need 3G devices to watch the concert.", "4.", "The company behind the trial hopes to learn more about how people use their video phones.", "5.", "3 is looking to persuade more people to take up 3G by offering regular gigs throughout 2005."], "qwen2.5:1.5b": ["Rooster's mobile gig on 3G technology will broadcast a 45-minute concert from London for 1, 000 paying customers who need a 3G handset.", "Users can watch and send video clips via their phones, exchanging data faster than with GSM networks.", "The company hopes to study customer behavior while using 3G devices, which it plans to expand into regular concerts in 2005."], "qwen2.5:3b": ["Mobile gig aims to rock 3G.", "Rooster's live concert from London will be broadcast via 3G mobile phones for £5 entry fee.", "The 45-minute show uses 3G technology allowing users to watch and send video clips, faster than on 2G networks.", "Around 1,000 fans with compatible 3G handsets can attend; some may use it as a mobile concert venue where they can come and go.", "3 aims to learn about usage patterns and is planning regular gigs for 2005."], "opencoder:1.5b": ["The output text summarizes the following key ideas and details:\n\n1.", "Mobile gig aims to rock 3G\n2.", "The gig will be conducted online via mobile devices.", "3.", "Rock outfit Rooster are playing a first-ever concert broadcast on Tuesday evening from a London venue.", "4.", "The gig lasts approximately 45 minutes, \"phone cast\" through the 3G mobile phone operator.", "5.", "People in the UK can download football and music clips onto their handsets.", "6.", "A ticket is required to enter the concert hall, allowing unlimited parties by the company for those who have paid.", "7.", "After the party, users will be able to make calls during the same time."], "smollm:1.7b": ["Mobile gig aims to rock 3G"], "deepseek-r1:1.5b": ["Mobile gig aims to rock 3G  \nForget about going to a crowded bar to enjoy a gig by the latest darlings of the music press.", "Now you could be at a live gig on your mobile, via the latest third generation (3G) video phones.", "Rock outfit Rooster are playing what has been billed as the first ever concert broadcast by phone on Tue evening from a London venue.", "The 45-minute gig is \"phone-casted\" by the 3G mobile operator, 3.", "3G technology allows people to take, watch, and send video clips on their phones, with faster data compared to 2G networks like GSM.", "People with 3G phones in the UK can download football and music clips on handsets.", "1,000 fans will pay five pounds for a ticket and need a 3G handset.", "\"Once you have paid, you can come and go as much as you like, because we expect customers to be mobile,\" said spokesperson Belinda Henderson.", "\"It's like a concert hall but virtually there.\"", "The company aims to learn about phone usage, noting people stay on streams for some time or dip in and out, hoping they'll use it more.", "They're planning live gigs throughout 2005 and can make phone calls during intermission."], "tinyllama:1.1b": ["A gig by top rock band Rooster is set to be broadcast via mobile phone on Tueday evening from a London venue.", "The \"phone cast\" will see fans download football and music clip content on their phones, as well as sending data much faster than with existing 2G networks like GSM.", "Over 1,000 fans of the band are expected to attend, but they must pay five pounds for a ticket and need a mobile phone with 3G capabilities.", "The trial aims to learn more about how people use their video phones in order to persuade more people to take up the latest technologies.", "Rooster is also planning regular gigs throughout 2005."], "tinydolphin:1.1b": [" The text provides a brief overview of a live music performance from a band called Rooster using a mobile phone for broadcasting.", "The performance is scheduled to take place on Tuesday and will feature a duration of 45 minutes, with the audience having to pay five pounds per ticket to enter.", "These details are presented in an informative and concise manner, without providing any additional details or analysis, as the content appears to be centered around the unique nature of the music experience provided by these mobile phone concerts."], "phi:2.7b": [" A rock outfit called Rooster will have a live concert broadcast by 3G video phone on Tuesday evening from a London venue, with 1,000 fans paying five pounds for a ticket and using mobile handsets.", "The experiment aims to learn about how people use their video phones and is part of 3's strategy to increase the take-up of the technology through music events.", "3 is also planning regular gigs throughout 2005 and expects people to listen to the concert while making phone calls during the intermission."], "orca-mini:3b": [" A trial gig on mobile phone by 3G technology is planned in London with a band called Rooster.", "Fans can buy tickets online for five pounds and watch the concert on their 3G phones.", "The company behind the trial aims to learn more about how people use their video phones and how long they stay on average on the streams.", "It expects people to dip in and out because they are mobile."], "hermes3:3b": ["1st mobile gig via 3G video phones, featuring band Rooster; 1000 fans can attend paid event in London, using 3G handsets for faster video clips, data exchange and potential audience engagement analysis"], "stablelm-zephyr:3b": ["Mobile gig company allowed 1,000 fans to watch London-based band Rooster perform live via 3G mobile phones.", "For £5, attendees with compatible 3G phones could stream the 45-minute concert by UK's 3 network.", "The trial aimed to understand how people used their video phones and was planning more regular music events in 2005 to promote newer video phones."], "chatgpt-4o-latest": ["Rock band Rooster is set to perform the first-ever concert broadcast via 3G mobile phones, allowing fans to watch live on their devices.", "The 45-minute gig, hosted by 3G operator 3, will be streamed from a London venue, with 1,000 fans paying £5 and requiring a 3G handset.", "The event aims to explore user engagement with video streaming, expecting viewers to dip in and out due to mobility.", "3 sees music as a way to promote 3G adoption and plans more mobile gigs in 2005.", "Users can still make calls during the intermission."], "stablelm2:1.6b": ["Rooster, a rock band, will perform the first concert broadcast via phone, using third-generation (3G) technology from London.", "The gig, billed as the first-ever concert broadcast by phone, is set for Tuesday evening and will be \"phone cast\" by 3G mobile phone operator, 3.", "Fans must pay £5 for a ticket with a 3G handset.", "The trial aims to learn about how people use their video phones, with longer average stays expected due to the mobile environment.", "3 hopes to attract more customers using music as an argument for adopting video phones.", "Regular gigs are planned throughout 2015."], "granite3.1-dense:2b": ["Mobile concerts via 3G technology are set to debut in London on Tuesday, featuring a 45-minute gig by Rooster, a popular UK band.", "This event is the first live concert broadcast over mobile phones using 3G networks.", "A select group of 1,000 fans can attend for five pounds each, armed with compatible 3G devices.", "The trial aims to gauge user engagement with video phone features, such as duration spent watching streams and frequency of interruptions while mobile.", "3G operator 3 plans regular concerts throughout 2005 to promote adoption of their advanced video phones, allowing fans to make calls during intermissions."]}