{"raw_text": "Consumers 'snub portable video'\n \n Consumers want music rather than movies while on the move, says a report.\n \n Produced by Jupiter Research the analysis of the portable media player market found only 13% of Europeans want to watch video while out and about. By contrast, almost a third are interested in listening to music on a portable player such as an iPod. The firm said gadget makers should avoid hybrid devices and instead make sure music reproduction was as good as possible.\n \n The report concluded that the driving force behind the growth of Europe's portable player market was likely to be music, rather than films or any combination of the two. Barely 5% of those questioned said they wanted a player that could play back both music and movies. Only 7% wanted a player that could handle games and video.\n \n \"Dedicated music players are the only established digital media players in Europe today despite their high prices,\" said Ian Fogg, Jupiter analyst. Mr Fogg said although video players and smartphones were trying to cash in on this success they faced a tough job because of the compromises that had to be made when creating a dual-purpose device. \"Europeans care most about music playback,\" he said. The report showed that 27% of consumers asked are interested in portable music players. The research revealed that French, 39%, and British, 31%, consumers were most interested in music players. Mr Fogg said portable video players were likely to remain a niche product that would not be able to compete with devices dedicated to music playback.\n \n A separate report by Jupiter forecasts that the European digital music market will grow to 836m euros (£581m) by 2009. At the end of 2003, the market was worth 10.6m euros (£7.36m). Digital music players will be behind this market growth said Jupiter . Apple's iPod was launched in October 2001, but the portable music player market has been growing steadily since the launch of the Creative Nomad Jukebox in mid-2000. Now consumers face an almost overwhelming choice of high-capacity portable music players that let them store every track on every CD that they own.\n", "llama3.2:1b": ["Consumers want to listen to music rather than watch movies when using a portable media player, with only 13% wanting to watch video while out and about.", "However, nearly a third (33%) are interested in listening to music on a portable player such as an iPod.", "The report found that the driving force behind the growth of Europe's portable player market was likely music, with few consumers interested in playing back both music and movies."], "llama3.2:3b": ["Consumers in Europe are more interested in listening to music than watching video on portable devices, with 13% wanting to watch video and 27% wanting a portable music player.", "Dedicated music players are the dominant digital media players due to Europeans' strong preference for music playback.", "Portable video players are expected to remain a niche product that cannot compete with dedicated music players.", "The European digital music market is forecasted to grow to €836m by 2009, driven by increasing demand and availability of high-capacity portable music players."], "gemma2:2b": ["Consumers in Europe are more interested in listening to music on their portable devices than watching video.", "Only 13% want to watch video while mobile, but nearly a third prefer music playback.", "Dedicated music players are the most popular format and likely to remain so despite competition from hybrid devices that prioritize both functions.", "This is driving the growth of Europe's digital music market to 836 million euros by 2009.", "The report highlights the success of iPod as an example."], "qwen2.5:0.5b": ["The report states that while 13% of Europeans want to watch video while out and about, only three percentage points of people in Europe prefer listening to music rather than watching movies.", "The report suggests gadget makers should focus on making music more accessible by reducing the number of devices available for both audio and video playback.", "Only 7% of those questioned wanted a portable player that could handle both games and video content.", "Portable music players are predicted to account for 836 million euros (£581m) in Europe's digital music market by 2009, according to Jupiter Research."], "qwen2.5:1.5b": ["Consumer preference for music over video is driving Europe's portable media player market growth, with 13% preferring to listen to music rather than watch videos while on the move, according to a Jupiter Research report.", "The analysis suggests that audio playback should be prioritized in hybrid devices instead of focusing on dual-purpose formats like games and video."], "qwen2.5:3b": ["Consumers prefer music over movies for portable devices, with only 13% interested in watching videos while out and about.", "A Jupiter Research report concluded that the main driving force behind Europe's portable media player market is music rather than films or their combination.", "The analysis showed almost half of consumers are interested in music players, with French and British consumers being most interested.", "Only a small percentage wants hybrid devices for games and video.", "Europeans care most about music playback despite the rise in digital music players forecast to reach 836m euros by 2009."], "opencoder:1.5b": ["Consumers 'snub' a 'portable video' product, as they often wish for a device that can play any media without needing to physically switch between devices.", "They want music instead of movies; the report indicates that this is a growing trend, with some consumers finding it more appealing than other forms of digital entertainment.", "The analysis of the market showed that only 13% of European users were interested in video while out and about.", "This disparity compared to games and movie enthusiasts, which accounted for nearly a third (57%).", "The firm argues that this product caters better to an increasingly mobile consumer base who finds music more appealing than films.", "The report concluded that the driving factor behind Europe's portable media market was likely to be music.", "Only 5% of those who were questioned were interested in a device that could play back both music and video.", "Only 7% wanted a device that could handle games and video.", "Ian Fogg, an expert in electronics, commented on the report that \"Europeans care most about music playback.\"", "Mr Fogg noted the high price tag, especially for devices dedicated to music.", "Despite the compromises made when creating a dual-purpose device, it remains an established digital media player in Europe today.", "The report furthered this by highlighting that 27% of consumers are interested in portable music players.", "Jupiter Research's forecast indicated that the European digital music market will grow to around €8.6 billion in 2009, and has grown steadily since its launch in mid-2003.", "At present, it is worth around €7.4 billion.", "Consumer demand continues to rise for a device dedicated solely to music playback.", "Despite Apple's iPod launched in October 2001, it continues to serve as one of the most popular portable media players in Europe today.", "The report furthered this with an impressive figure at the end of 2003, which stands at €10 billion."], "smollm:1.7b": ["The summary should include:\n\n1.", "Consumers want music rather than movies while on the move, says a report.", "2.", "Produced by Jupiter Research the analysis of the portable media player market found only 13% of Europeans want to watch video while out and about.", "By contrast, almost a third are interested in listening to music on a portable player such as an iPod.", "The firm said gadget makers should avoid hybrid devices and instead make sure music reproduction was as good as possible.", "3.", "The report concluded that the driving force behind the growth of Europe's portable player market was likely to be music, rather than films or any combination of the two.", "Barely 5% of those questioned said they wanted a player that could play back both music and movies.", "Only 7% wanted a player that could handle games and video.", "4.", "The report showed that 27% of consumers asked are interested in portable music players.", "The research revealed that French, 39%, and British, 31%, consumers were most interested in music players.", "Mr Fogg said portable video players were likely to remain a niche product that would not be able to compete with devices dedicated to music playback.", "5.", "A separate report by Jupiter forecasts that the European digital music market will grow to 836m euros (£581m) by 2009.", "At the end of 2003, the market was worth 10.6m euros (£7.36m).", "Digital music players will be behind this market growth said Jupiter .", "Apple's iPod was launched in October 2001, but the portable music player market has been growing steadily since the launch of the Creative Nomad Jukebox in mid-2000.", "Now consumers face an almost overwhelming choice of high-capacity portable music players that let them store every track on every CD that they own."], "deepseek-r1:1.5b": ["The report highlights that consumers prefer listening to music rather than watching videos while on the move, with 13% wanting video playback and a third wanting music.", "This shift is attributed to the growing demand for European digital media players, driven more by music consumption.", "Mobile video and smartphone manufacturers face competition in creating hybrid devices, which complicates their efforts.", "Only 5% of consumers want dual functionalities like music and video playback.", "The European digital music market is projected to grow to €836 million by 2009, surpassing other technologies like smartphones and MP3 players."], "tinyllama:1.1b": ["Consumer groups are increasingly seeking portable media players for their outdoor and adventure activities, with almost a third wanting to watch movies while traveling or listening to audio instead of videos.", "However, this drive towards multimedia entertainment is being frustrated by the limited capabilities of the current market: only 13% of European consumers want to consume music while moving, with gamers and smartphone users coming in second at 27%.", "Despite this, video players are still considered essential by 5%, with music and audio playing back leading by overwhelming popularity.", "Although dedicated music players have been available for some time, a digital music market valued at £581m (£53m) by Jupiter is predicted to increase by over £700m by 2009.", "The report found that the iPod was launched in mid-2001, but competitors like Creative and Apple have been launching high-capacity portable music players since mid-2000."], "tinydolphin:1.1b": [" The text provided discusses a report by Jupiter Research, which suggests that Europeans are increasingly interested in using portable media players for both listening to music and watching movies while out and about.", "According to the study, only 13% of Europeans want to watch video content on their gadgets, while more than a third prefer to listen to music.", "The firm's findings suggest that the growth of the portable media player market is mainly driven by people who enjoy listening to music rather than watching films or any combination of both."], "phi:2.7b": [" According to a report by Jupiter Research, only 13% of Europeans want to watch video while out and about, while nearly a third are interested in listening to music on a portable player such as an iPod.", "The report recommends gadget makers make sure music reproduction is as good as possible rather than creating hybrid devices that can play back both music and movies.", "Jupiter's research shows that 27% of consumers are interested in portable music players, with French and British consumers being the most interested.", "However, Jupiter predicts that digital music players will continue to remain a niche product due to the compromises needed when creating dual-purpose devices.", "The report by Jupiter also forecasts that the European digital music market will grow to 836 million euros (approximately $1.2 billion) by 2009, with digital music players being behind this growth."], "orca-mini:3b": [" Jupiter Research found that only 13% of Europeans want to watch video while out and about, while almost a third are interested in listening to music on a portable player such as an iPod.", "This means that consumers prefer dedicated music players over hybrid devices that can play both music and movies.", "Music players are the most popular type of digital media players in Europe, according to the report.", "Jupiter also forecasts that the European digital music market will grow to 836m euros by 2009, with portable music players being behind this market growth.", "The report said Apple's iPod was launched in October 2001 and has since grown the portable music player market."], "hermes3:3b": ["Consumers prefer music over videos for portable devices, according to Jupiter Research report.", "Only 13% of Europeans want video while moving, much lower than interest in music (27%)."], "stablelm-zephyr:3b": ["A Jupiter Research report revealed that Europeans prefer listening to music on portable players like iPods, rather than watching videos, with only 13% interested in video and 27% interested in music players.", "The driving force behind the growth of Europe's portable player market is likely to be music, according to the analysis.", "Consumers were found to care most about music playback; thus, dedicated music players remain the only established digital media players in Europe, despite high prices.", "Portable video players are expected to remain a niche product and will not compete with devices dedicated to music playback.", "The European digital music market is forecasted to grow from €10.6m ($12.56m) in 2003 to €836m by 2009."], "chatgpt-4o-latest": ["Consumers prefer music over video on portable media players, with only 13% of Europeans interested in watching videos while on the move, compared to nearly a third who favor music.", "A Jupiter Research report advises gadget makers to focus on high-quality music playback rather than hybrid devices.", "Only 5% of respondents wanted a player for both music and movies, and just 7% desired one for games and video.", "Analyst Ian Fogg noted that dedicated music players dominate the European market, while video players and smartphones struggle due to design compromises.", "Interest in portable music players is highest in France (39%) and the UK (31%).", "The European digital music market is projected to grow to 836 million euros by 2009, driven by digital music players like Apple's iPod and Creative's Nomad Jukebox."], "stablelm2:1.6b": ["Consumers prefer listening to music over movies while on the move, with only 1% interested in watching video on portable media players like iPods.", "The driving force behind Europe's portable player market is music rather than films or a combination of both.", "Dedicated music players are the only established digital media players in Europe today, despite their high prices.", "French and British consumers were most interested in music players, with Apple iPod launching in 2011 leading the market.", "Portable video players are likely to remain niche products as there is no need for dual-purpose devices due to Europeans' prioritization of music playback.", "The European digital music market is forecasted to grow by €9m or £8m, with digital music players playing a significant role in this growth."], "granite3.1-dense:2b": ["According to a Jupiter Research analysis, European consumers primarily prefer portable music players over video or game-playing devices while mobile.", "Only 13% of Europeans want to watch videos on their portable devices, whereas nearly a third are interested in listening to music.", "Music is the primary driving force behind the growth of Europe's portable media player market, with 27% of consumers expressing interest in such players.", "French and British consumers exhibit the highest interest at 39% and 31%, respectively.", "Jupiter predicts that the European digital music market will reach €836 million by 2009, driven largely by Apple's iPod and other high-capacity portable music devices launched since mid-2000.", "Portable video players are expected to remain a niche product due to the challenges of creating dual-purpose devices without compromising on either feature."]}