{"raw_text": "Computer grid to help the world\n \n Your computer can now help solve the world's most difficult health and social problems.\n \n Launched this week, the World Community Grid will use idle computer time to test solutions to these problems. The donated processor cycles will help the WCG create virtual supercomputers via the net. The idea follows the success of other similar projects that have used the untapped processing power of millions of desktop PCs. One of the most successful collaboration projects was Seti@home, run by the Search for Extra Terrestrial Life project, which sorted through radio signals looking for signs of alien communication.\n \n Anyone can volunteer to donate the spare time of their computers by downloading a special screensaver from the WGC website. Once installed, the virtual terminal gets a chunk of the computational task to process, and reports back after completing that task. The first WCG problem being tackled will be the Human Proteome Folding Project, which hopes to identify the ways that the proteins in our body fold.\n \n The subjects of study are being selected by an international advisory board of experts specializing in health sciences, and technology. The body will evaluate proposals from leading research, public and not-for-profit organizations, and is expected to oversee up to six projects a year. Organisations also represented on the board include the United Nations Development Programme and the World Health Organisation.\n \n \"The World Community Grid will enable researchers around the globe to gather and analyze unprecedented quantities of data to help address important global issues,\" said Elain Gallin, program director for medical research at the Doris Duke Charitable Foundation. \"[It] will inspire us to look beyond the technological limitations that have historically restricted us from addressing some of our most intractable problems\", she added. IBM has donated the hardware, software, technical services and expertise to build the basic infrastructure for the grid. The computer company, working with United Devices, previously developed the Smallpox Research Grid, which linked together more than two million volunteers from 226 countries to speed the analysis of some 35 million drug molecules in the search for a treatment for Smallpox.\n", "llama3.2:1b": ["Computer grid to help solve world's health and social problems.", "Launched this week, World Community Grid uses idle computer time to create virtual supercomputers via the net.", "Donated processor cycles will be used by WCG to test solutions.", "Anyone can volunteer by downloading a special screensaver from website.", "Virtual terminal gets assigned task after download, reports back after completing.", "First problem tackled is Human Proteome Folding Project."], "llama3.2:3b": ["The World Community Grid uses idle computer time to help solve world's most difficult health and social problems through the donation of processor cycles by volunteers.", "The project, launched this week, will tackle its first problem, the Human Proteome Folding Project, with an international advisory board overseeing it.", "IBM donated hardware and expertise to build the grid infrastructure, while organizations such as the UN Development Programme and World Health Organisation are represented on the board."], "gemma2:2b": ["The World Community Grid (WCG) uses idle computer time to solve complex health and social problems by creating virtual supercomputers.", "People can donate their computers' processing power through a special screensaver, with results being used for various research projects selected by an advisory board.", "The WCG aims to address global issues like protein folding in the human body and is supported by IBM, which contributed hardware, software, expertise, and infrastructure to build the project."], "qwen2.5:0.5b": ["The World Community Grid is an initiative launched by Alibaba Cloud using idle computer time to solve world's most complex health and social problems.", "The company will use donated processor cycles to create virtual supercomputers via the internet, thereby reducing reliance on traditional computing infrastructure.", "It aims to enable researchers around the globe to analyze vast amounts of data for global issues, inspired by previous successes in technology-based medical research projects like Smallpox Research Grid."], "qwen2.5:1.5b": ["The World Community Grid, launched this week, harnesses idle computer time via the internet to solve global health and social problems by creating virtual supercomputers.", "The project aims to identify protein folding patterns using donated processor cycles from millions of computers worldwide, addressing issues like the Human Proteome Folding Project.", "It is inspired by previous projects that have used volunteers' spare computing power, including SETI@home, demonstrating its potential for collaborative research solutions."], "qwen2.5:3b": ["Computer grid to help solve world's health and social problems launched this week.", "It uses idle computer time to test solutions via net-connected virtual supercomputers, inspired by successful projects like Seti@home.", "Anyone can volunteer by downloading screensaver from World Community Grid website.", "First problem tackled will be Human Proteome Folding Project.", "Projects are selected by an international advisory board of experts in health sciences and technology representing organizations such as UNDP and WHO.", "Elain Gallin from Doris Duke Charitable Foundation calls it enabling global researchers to analyze unprecedented data, inspiring to address previously intractable problems.", "IBM provided hardware/software/technical services/expertise for basic grid infrastructure."], "opencoder:1.5b": ["The World Community Grid is designed to facilitate collaboration across various global issues by providing a platform for researchers and technologists alike to share, analyze, and contribute to multidimensional research projects.", "The computer component has been developed to enable rapid processing of complex computations, thereby enabling the faster resolution of some problems that are currently out of reach with traditional computers.", "It is expected that more than 26 million volunteers worldwide will be able to participate in the grid's scientific activities through regular donations and cooperative collaboration, further reinforcing its mission of advancing global health sciences.", "The hardware and software have been developed by IBM, a pioneer in the technology industry, to build an efficient computer system capable of handling computational tasks efficiently.", "The technical services provided include technical expertise, knowledge sharing platforms, and funding opportunities for research projects.", "The innovation has resulted in a more efficient and effective solution for managing large datasets, thereby ensuring that scientists around the world can achieve their scientific goals on time and cost-effectively."], "smollm:1.7b": ["The World Community Grid is a collaborative effort that leverages the processing power of idle computers to tackle complex health and social problems.", "The project aims to provide access to advanced computing resources, enabling researchers to analyze large datasets and develop innovative solutions to some of the world's most pressing challenges."], "deepseek-r1:1.5b": ["The World Community Grid (WCG), developed by IBM, uses idle computer power from millions of computers worldwide via networked tasks to create virtual supercomputers.", "Volunteers download screensavers for each task completed, and the results are reported after processing.", "The first project is Human Proteome Folding, aiming to understand protein folding in the body.", "WCG will enable global research beyond technological limitations by collaborating across diverse platforms."], "tinyllama:1.1b": ["La nouvelle prochaine de la communauté de calcul gratuitement accessible, l'écosystème \"World Community Grid\", propose le donation d'un cycle de processus de puces au donateur pour apprendre les problèmes du monde aux plus grands espoirs scientifiques.", "La première problématique étudiée sera la Proteome Folding Project de l'humanité, proposé par des experts spécialisés en sciences de la vie, et d'organismes internationaux représentant l'administration mondiale de développement et les WHO.", "Les organisations de l'assistant sont répertoriées parmi les participants à cette évolution, représentant notamment le programme médical de l'ONU et les organismes des Développements du monde.", "Le programme \"World Community Grid\" est en fait un projet d'infrastructure informatique qui permet de mettre aux prises les meilleurs chercheurs du monde entier pour analyser des problèmes importants à travers la communauté scientifique mondiale, avec l'intention de trouver des solutions au plus rapidement possible."], "tinydolphin:1.1b": [" The World Community Grid project, jointly developed by a team at the University of Toronto and IBM, aims to help solve some of the most difficult health and social problems on a global scale using the untapped computational resources provided by idle computer cycles.", "Initiated this week, the WCG aims to create virtual supercomputers using the donated processor cycles of millions of desktop PCs worldwide, providing assistance in solving a range of complex problems, from studying proteins and identifying new strains of human influenza to researching global health issues.", "The project aims to benefit both scientists and the general public by allowing them to access advanced computational resources that were previously inaccessible due to unforeseen limitations."], "phi:2.7b": [" A new project called World Community Grid is using donated computer time to test solutions to health and social problems.", "The grid will create virtual supercomputers and tackle problems like protein folding, which can help with research into diseases.", "An international advisory board of experts will oversee projects that address global issues like poverty and disease."], "orca-mini:3b": [" The World Community Grid is a computer grid that uses idle computer time to solve health and social problems.", "It was launched this week and aims to use virtual supercomputers via the net to create solutions to these problems.", "Anyone can donate their spare computer time by installing a special screensaver from the WGC website.", "The first project will be the Human Proteome Folding Project, which aims to identify how proteins in our body fold.", "The grid is being supervised by an international advisory board of experts specializing in health sciences and technology, and organizations like the United Nations Development Programme and the World Health Organization are represented on it."], "hermes3:3b": ["World Community Grid launched for health & social problems solving, using idle computer time to create virtual supercomputers via net, initially focusing on Human Proteome Folding Project."], "stablelm-zephyr:3b": ["The World Community Grid (WCG) is a project launched this week that utilizes idle computer processing power to contribute to solving health and social challenges worldwide.", "WCG was inspired by successful similar projects, such as Seti@home, which utilized untapped processing power from millions of desktop PCs for tasks like sorting radio signals for signs of alien communication.", "To participate in the initiative, volunteers can download a special screensaver that allocates spare processing time to the virtual terminal installed on their computer.", "The first WCG problem focuses on identifying protein folding in the human body.", "The subjects of study are selected by an international advisory board consisting of experts in health sciences and technology.", "Proposals for research projects are evaluated by leading organizations, such as the United Nations Development Programme and the World Health Organisation.", "IBM provided hardware, software, technical services, and expertise to build the basic infrastructure for WCG.", "The company previously developed the Smallpox Research Grid, which connected over two million volunteers from 226 countries to analyze large volumes of drug molecules in search of a treatment for Smallpox."], "chatgpt-4o-latest": ["The World Community Grid (WCG) is a new initiative that uses idle computer time from volunteers to solve global health and social problems.", "By downloading a special screensaver, users can donate their computer's processing power to create a virtual supercomputer.", "The first project, the Human Proteome Folding Project, aims to understand protein folding in the human body.", "An international advisory board selects research topics, with up to six projects expected annually.", "IBM has provided the necessary infrastructure, building on its experience with the Smallpox Research Grid.", "The WCG enables researchers to analyze vast amounts of data to address critical global challenges."], "stablelm2:1.6b": ["The World Community Grid will utilize idle computer time to test solutions to global health and social issues.", "Launched this week, it creates virtual supercomputers via the internet by processing idle processor cycles from millions of desktop PCs.", "Anyone can contribute their spare time by downloading a special screensaver from the WGC website.", "The first WCG problem being tackled is the Human Proteome Folding Project aiming to identify ways proteins fold in our bodies.", "Experts' advisory boards select subjects of study from health sciences and technology, evaluating proposals from organizations like the UNDP and WHO for potential six projects annually.", "IBM, with hardware, software, technical services, and expertise, has built the basic infrastructure for this collaborative project."], "granite3.1-dense:2b": ["The World Community Grid (WCG), launched this week, harnesses idle computer processing power to tackle global health and social issues.", "By downloading a special screensaver from its website, users can donate their computers' spare time, contributing to virtual supercomputers via the internet.", "The inaugural project is the Human Proteome Folding Project, aiming to understand protein folding within human bodies.", "This initiative, overseen by an international advisory board including experts from the United Nations and World Health Organisation, will evaluate research proposals for up to six projects annually.", "IBM has provided the necessary hardware, software, and expertise to support this grid, building on their previous success with the Smallpox Research Grid, which engaged two million volunteers from 226 countries to expedite smallpox drug molecule analysis."]}