{"raw_text": "Toxic web links help virus spread\n \n Virus writers have begun using the power of the web to spread their malicious wares.\n \n A Windows virus called Bofra is turning infected machines into distributors of its malicious code. Those clicking on the poisoned links in e-mail messages sent out by infected machines may fall victim to the virus. The trick is being used to prevent the progam being caught by anti-virus software that combs through code contained in e-mail attachments.\n \n The virus that uses this trick is called Bofra and the first member of the family of worms appeared on 10 November. They exploit a Windows vulnerability that was discovered only a few days earlier.\n \n Like many other recent viruses, Bofra plunders the address book in Microsoft Outlook for e-mail addresses and scours other files on an infected machine for fresh target addresses. The virus uses its own mail sending software to despatch e-mail messages to potential victims but, unlike many other recent viruses, does not itself travel via mail. Instead the body of the mail messages sent out contain fake weblinks that, when clicked on, connect back to the machine that distributed that e-mail. Essentially, Bofra turns infected machines into small web servers that happily dole out copies of the virus. The messages try to trick people into clicking on the links by promising pornographic videos and images or by posing as payment confirmation for a Paypal transaction.\n \n Copies of the messages seen by the BBC News website had bright yellow and green backgrounds. Those clicking on the links will inadvertently download the Bofra virus which will then start searching for new addresses to send itself to. Filtering firm Clearswift said this tactic of creating thousands of mini web servers was designed to help the virus spread quickly and avoid attempts to shut it down. In the past other malicious programs have relied on a single web server that downloads viral code to target machines. Shutting down this central server usually stops the virus spreading.\n \n Clearswift said that fact that no viral code travels in the e-mail messages sent out by machines infected by Bofra could hamper effects to limit its spread. Finnish anti-virus firm F-Secure said that, so far, it had not seen many copies of the Bofra virus and its variants in circulation.\n \n Tim Warner, spokesman for anti-virus firm Finjan, said: \"You have people getting very creative now to deliver the virus and get it propagating.\" Mr Warner said organisations needed to prepare deep defences to keep out the modern form of malicious mobile code. \"Most firms have secured their e-mail gateway,\" said Mr Warner, \"but the irony is that most of them let malicious content through the web gateways.\" He said behavioural systems that monitor what users do can help to spot when viruses have penetrated organisations and have started hunting for other victims. The Bofra family of viruses, which were originally thought to be offshoots of the MyDoom bug, can infect machines running Windows 2000, 95, 98, Me, NT, XP and Server 2003. Users running Windows XP that have applied the SP2 update are not vulnerable to the loophole that Bofra exploits.\n", "llama3.2:1b": ["Toxic web links help spread virus by tricking users into clicking on poisoned links in e-mail messages sent by infected machines.", "The toxin allows the virus to distribute itself across multiple infected computers, turning them into \"web servers\" that spread the malware and download new copies from unknown sources.", "This tactic relies on exploiting a vulnerability in Windows software, with no viral code being transmitted through traditional email attachments."], "llama3.2:3b": ["Virus writers are using toxic web links to spread their malicious code.", "The virus, called Bofra, turns infected machines into mini web servers that send out fake e-mail messages with links that download the virus when clicked.", "This tactic allows the virus to spread quickly and avoid detection by anti-virus software."], "gemma2:2b": ["A new virus called Bofra spreads by creating fake weblinks in emails.", "When users click on these links, they download the virus, which then starts searching for more victims to infect.", "This approach leverages a Windows vulnerability and avoids being detected by anti-virus software, as the virus doesn't travel via email but instead creates its own mini web servers."], "qwen2.5:0.5b": ["Virus writers use web links to distribute their viruses, with Bofra becoming a worm when infected machines click on it.", "Clearswift has found another method of distributing the virus through e-mail attachments.", "The Bofra family includes other variants, including the MyDoom bug, that are offshoots of the MyDoom bug.", "Bofra uses web pages containing fake links to distribute the virus and trick users into clicking on them.", "Users need to prepare deep defences to keep out modern forms of malicious mobile code."], "qwen2.5:1.5b": ["Virus writers are using web links for malicious programs like Bofra, which spreads through infected machines disguised as e-mail attachments.", "The trick involves creating fake web links leading to the virus instead of opening the actual email attachment.", "This allows the program to avoid detection by anti-virus software scanning code in emails.", "Bofra relies on a Windows vulnerability and uses its own mail sending system for distribution, but doesn't travel through regular mail.", "It creates thousands of mini web servers to spread quickly without relying on a single central server that could be shut down.", "Clearswift warns the tactic helps the virus spread easily by tricking people into clicking fake links promising porn or PayPal confirmation."], "qwen2.5:3b": ["Toxic web links help spread a virus.", "The Windows-based Bofra virus turns infected machines into distributors by sending out email messages with fake weblinks, tricking recipients into downloading it.", "This tactic bypasses anti-virus software checking attachments.", "Bofra exploits a known vulnerability and uses Microsoft Outlook's address book for spreading.", "Unlike typical viruses, Bofra does not rely on mail transmission; instead, it spreads via infected machines acting as web servers sending out malicious emails.", "The virus employs deceptive content like porn links to lure clicks.", "Clearswift noted this strategy helps spread the virus quickly by creating numerous small web server points.", "F-Secure reported few copies of Bofra and its variants have been seen yet.", "Tim Warner from Finjan said modern viruses are becoming more creative in delivery methods, necessitating strong, layered security defenses.", "The Bofra family can infect various Windows versions but not those with SP2 update on XP."], "opencoder:1.5b": ["A new type of virus has emerged, one that is capable of spreading through web links and other cyber threats.", "The first member of a family of worms, known as Bofra, appeared on 10 November in a group of malware that have since spread far beyond the known to date.", "These viruses exploit a vulnerability within Windows operating systems that is easily discovered when using certain antivirus software.", "Bofra uses its own web-based interface to distribute and deliver malicious software, rather than infecting machines with the virus itself.", "This means that Bofra's virus does not have the chance to infect files or websites containing the virus before it is used on them.", "Instead, it sends out email messages to potential victims, which can then be opened by the victim to obtain further information.", "The Bofra family of viruses also employs a technique known as URL spoofing, where maliciously designed web links appear to go to a different destination when clicked on.", "This allows them to spread rapidly through large amounts of traffic and avoid detection by current antivirus software.", "However, like many other modern viruses, Bofra has been reported to have been seen in malware since the 95s.", "Its presence is often associated with cybercriminals' efforts to block or terminate web-based security measures, which has led to widespread online threats.", "The virus's popularity continues to grow as it has become a powerful tool for spreading through social networks and other public spaces.", "As for F-Secure, its stance on the Bofra family of viruses is that it treats multiple copies as an indication of malicious activity rather than a single instance.", "This can be seen in its analysis of the virus's known variants in its report on antivirus software.", "However, it has not yet confirmed whether Bofra was indeed spread through web links or other means.", "In conclusion, while Bofra and its other members have had several reports since introduction into the world, they are still relatively unknown and largely theoretical at this point.", "It's still an emerging threat that requires constant vigilance to detect and neutralise."], "smollm:1.7b": ["The summary is concise, focusing on the main points of the text:\n\n1.", "A new type of virus called Bofra has been spreading rapidly through e-mail messages sent out by infected machines.", "2.", "The virus uses a technique called \"exploiting a Windows vulnerability\" to spread itself.", "3.", "The virus is designed to trick people into clicking on links in the emails, which will then download the virus and start sending it out to other machines.", "4.", "Unlike many other recent viruses, Bofra does not travel through infected machines themselves; instead, it uses a central server that downloads viral code from other machines.", "5.", "Clearswift, a Finnish anti-virus firm, has seen few copies of the Bofra virus and its variants in circulation so far.", "6.", "The fact that no viral code travels in the e-mail messages sent out by infected machines could hamper efforts to limit the spread of the virus.", "7.", "Most organizations need to prepare for the modern form of malicious mobile code, which can be difficult to detect.", "8.", "Behavioral systems that monitor what users do can help to spot when a virus has infiltrated an organization and is hunting for other victims.", "9.", "The Bofra family of viruses, which were originally thought to be offshoots of the MyDoom bug, can infect machines running Windows 2000, 95, 98, Me, NT, XP, and Server 2003.", "Users running Windows XP that have applied the SP2 update are not vulnerable to the loophole that Bofra exploits."], "deepseek-r1:1.5b": ["A computer virus called Bofra infects Windows machines by turning them into web servers.", "Users click on links from these infected machines to download the virus or fake e-mails.", "The virus uses fake emails with bright colors, tricking users into clicking the links for downloads.", "These downloads help spread the virus without using email routes.", "Clearswift says this method makes it easy for virus authorities to track and prevent Bofra's spread.", "F-Secure hasn't seen many copies yet.", "Tim Warner notes that even though some abuse the web, most firms rely on email gateways, needing defenses against modern web-based malicious code.", "Bofra infects machines from older Windows versions like 95, 98, Me, NT, XP, and Server 2003, with exceptions for newer systems running SP2 update."], "tinyllama:1.1b": ["The most recent virus used in Bofra attacks is capable of spreading malicious code to infected machines by using a trick to turn them into web servers that deliver virus links, enabling them to quickly spread to thousands of new victims.", "The virus's aim is to avoid shutting down once it downloads the malicious code and instead uses fake web pages containing offers for pornographic videos or PayPal payments, which people clicking on will launch Bofra's mini-viruses.", "Despite this, there have been no reports of wide spread infections so far.", "Clearfire's Finnish anti-virus firm F-Secure has not seen any copies of the virus, while organisations need to prepare deep defenses against modern forms of malicious mobile code.", "The Bofra family of viruses has a history of infecting machines running Windows 2000, 95, 98, Me, NT, XP and Server 2003, but users running Windows XP with SP2 update are not affected."], "tinydolphin:1.1b": [" The spread of malicious software via e-mail attachments has become increasingly prevalent, with various techniques being used by virus writers.", "In this particular case, a Windows worm called Bofra is doing its part by exploiting a vulnerability in Microsoft Outlook to distribute malicious code.", "The virus uses the address book in Microsoft Outlook to search for potential victims and despatch e-mail messages to infected machines.", "It does this by creating fake links that lead to websites containing the source of the malware.", "Once clicked, these links redirect users to a server that hosts the Bofra virus.", "The messages also contain fake mail headers promising something like \"free porn,\" \"new Paypal account\" or \"improved search engine results.\""], "phi:2.7b": [" The text is about a new type of virus that spreads through fake links in email messages.", "The virus uses infected machines as web servers to send out more copies of itself.", "It also avoids anti-virus software by hiding its true destination.", "The text gives some examples and statistics about the virus, such as when it was discovered, how it works, and how it can be prevented."], "orca-mini:3b": [" The text discusses how virus writers use the power of the web to spread their malicious wares and how they turn infected machines into distributors of their code.", "They use a trick called \"mail sending software\" to despatch e-mail messages to potential victims, but unlike other recent viruses, do not travel via mail.", "Instead, the body of the messages contains fake weblinks that connect back to the machine that distributed that e-mail and the virus creates mini web servers to help spread quickly.", "The BBC News website saw bright yellow and green backgrounds in the messages, and F-Secure says it has not seen many copies of the Bofra virus.", "Tim Warner from Finjan said that organizations need to prepare deep defences to keep out the modern form of malicious mobile code.", "The Bofra family of viruses can infect machines running Windows 2000, 95, 98, Me, NT, XP, and Server 2003, and users with Windows XP that have applied the SP2 update are not vulnerable to the loophole that Bofra exploits."], "hermes3:3b": ["Bofra virus spreads by turning infected PCs into distributers of its malicious code through fake web links in emails, avoiding detection by anti-virus software."], "stablelm-zephyr:3b": ["A new virus called Bofra is using infected machines as distributors of its malicious code by exploiting a Windows vulnerability and turning them into small web servers.", "It disguises itself as legitimate email messages containing fake links that, when clicked, infect the recipient's machine and spread the virus.", "Unlike previous viruses, Bofra does not rely on a single web server to distribute its payload; instead, it creates thousands of these mini-servers.", "Anti-virus firms have reported limited instances of Bofra and its variants so far, highlighting the growing creativity among virus writers in their attempt to propagate the malware."], "chatgpt-4o-latest": ["A Windows virus called Bofra is spreading by turning infected machines into web servers that distribute malicious code.", "Instead of traveling via email attachments, Bofra sends emails with fake links that, when clicked, download the virus from the infected machine.", "The virus exploits a recently discovered Windows vulnerability and harvests email addresses from infected systems to find new targets.", "It tricks users by posing as links to pornographic content or PayPal confirmations.", "Security firms warn that this decentralized method makes it harder to stop, as there is no central server to shut down.", "While Bofra has not yet spread widely, experts emphasize the need for stronger web security measures, as many organizations focus only on email protection.", "Windows XP users with the SP2 update are not vulnerable to the exploit."], "stablelm2:1.6b": ["Toxic web links contribute to the spread of a virus called Bofra, which infects machines and turns them into small web servers distributing the malware.", "The virus uses fake weblinks in e-mail messages sent by infected machines to trick recipients into clicking on links leading to infected websites.", "When clicked, it downloads Bofra, searching for new addresses to send itself to.", "This tactic of creating thousands\nof mini web servers is designed to help the virus spread quickly and avoid attempts to shut down the central server that distributes the malware.", "Clearswift says this approach limits the impact of anti-virus software on reducing the virus's spread.", "F-Secure, a Finnish antivirus firm, has not yet seen many copies of Bofra in circulation.", "The Bofra family of viruses can infect machines running Windows 95, 98, ME, NT, XP, and Server 2003.", "However, users running Windows XP after applying the SP2 update are not vulnerable to the vulnerability exploited by Bofra."], "granite3.1-dense:2b": ["A new Windows virus called Bofra is spreading through infected machines via email messages containing malicious links.", "Discovered on November 10, this worm exploits a Windows vulnerability to access address books in Microsoft Outlook and other files for additional targets.", "Unlike many previous viruses, Bofra does not travel through email; instead, it uses fake weblinks embedded in emails sent by infected machines.", "When users click these links, they inadvertently download the Bofra virus, which then searches for new addresses to infect.", "Bofra's creators aim to quickly propagate the virus by turning infected machines into decentralized web servers.", "This tactic bypasses traditional methods of stopping malicious code spread by targeting a single central server.", "Clearswift and F-Secure have not observed widespread circulation of Bofra, but Finjan warns that organizations must strengthen defenses against sophisticated mobile code delivery methods, including monitoring web gateways for malicious content.", "Users running Windows XP with Service Pack 2 are safe from the vulnerability Bofra exploits.", "The virus can affect Windows 2000, 95, 98, Me, NT, and Server 2003 systems."]}