{"raw_text": "Anti-spam screensaver scrapped\n \n A contentious campaign to bump up the bandwidth bills of spammers by flooding their sites with data has been dropped.\n \n Lycos Europe's Make Love, Not Spam campaign began in late November but its tactics proved controversial. Lycos has shut down the campaign saying it had been started to stimulate debate about anti-spam measures and had now achieved this aim. The anti-spammer screensaver came under fire for encouraging vigilante activity and skirting the edge of the law.\n \n Through the Make Love, Not Spam website, users could download a screensaver that would endlessly request data from the net sites mentioned in many junk mail messages. More than 100,000 people are thought to have downloaded the screensaver that Lycos Europe offered.\n \n The company wanted to keep the spam sites running at near total capacity to make it much less financially attractive to spammers to operate the sites. But the campaign was controversial from the moment it kicked off and many net veterans criticised it for using spamming-type tactics against the senders of junk mail. Some net service firms began blocking access to the Lycos Europe site in protest at the action. Monitoring firm Netcraft found that the anti-spam campaign was proving a little too successful. According to response-time figures gathered by Netcraft, some of the sites that the screensaver targeted were being knocked offline by the constant data requests. In a statement from Lycos Europe announcing the scrapping of the scheme, the company denied that this was its fault. \"There is nothing to suggest that Make Love, Not Spam has brought down any of the sites that it has targeted,\" it said. \"At the time that Netcraft measured the sites it claims may have been brought down, they were not in fact part of the Make Love, Not Spam attack cycle,\" it added. The statement issued by Lycos also said that the centralised database it used ensured that traffic to the target sites left them with 5% spare capacity. \"The idea was simply to slow spammers' sites and this was achieved by the campaign,\" the company said. Many security organisations said users should not participate in the Lycos Europe campaign. The closure comes only days after the campaign was suspended following the outbreak of criticism.\n", "llama3.2:1b": ["A contentious anti-spam screensaver campaign called \"Make Love, Not Spam\" began in November and aimed to slow down spammers by flooding their sites with data requests.", "Users downloaded a screensaver that requested data from over 100,000 sites, but the campaign was criticized for encouraging vigilante activity and skirting the law.", "Lycos Europe shut down the campaign, citing its effectiveness in reducing spam site revenue."], "llama3.2:3b": ["Lycos Europe scrapped its Make Love, Not Spam anti-spam campaign after it sparked controversy for using vigilante tactics and skirting the edge of the law.", "The campaign, which flooded spam sites with data to make them less financially attractive, brought down some sites and was criticized by net service firms and security organizations."], "gemma2:2b": ["Lycos Europe scrapped its anti-spam campaign called \"Make Love, Not Spam\" which involved a screensaver that requested data from spammer websites.", "This campaign was controversial for encouraging vigilante activity and skirting legal boundaries, leading to criticism from net veterans and blocking of the Lycos Europe site by some firms.", "Despite this success in slowing down spam sites, Lycos Europe ended the campaign claiming it had not brought any sites offline."], "qwen2.5:0.5b": ["Lycos Europe's Make Love, Not Spam campaign to flood spam sites with data has been dropped due to controversy and controversy from net service firms.", "Lycos Europe denies causing harm to those sites by using spamming-type tactics, while many security organizations say users should not participate in the campaign."], "qwen2.5:1.5b": ["A spam-deterrence campaign that flooded spammer websites with traffic has been scrapped because it went too far and caused some sites to be down."], "qwen2.5:3b": ["A controversial spam prevention campaign initiated by Lycos Europe, dubbed \"Make Love, Not Spam,\" has been discontinued.", "Launched through a screensaver that continuously requested data from spammed sites to increase their bandwidth usage, this initiative aimed to discourage spamming but faced significant backlash for being perceived as vigilante activity and potentially illegal.", "The campaign, which saw over 100,000 downloads of the anti-spam screensaver, encountered criticism due to its use of spam techniques against spammers and led to net service firms blocking access to the Lycos Europe site in protest.", "Monitoring firm Netcraft reported that some targeted sites were being knocked offline by constant data requests.", "Despite these issues, Lycos Europe claimed the campaign was successful in achieving its aim of stimulating debate on anti-spam measures and denied any responsibility for site failures.", "However, experts advised users not to participate in such campaigns, and the closure came shortly after the campaign's suspension amid criticism."], "opencoder:1.5b": ["Anti-spam screensaver scrapped is an anti-spam tactic that has since been dropped, arguing against the use of spam sites.", "It highlights the constant data requests from spammers and urges them to take proactive measures to stay within the law."], "smollm:1.7b": ["Anti-spam screensavers scrapped"], "deepseek-r1:1.5b": ["The anti-spam screensaver was dropped due to a contentious campaign aimed at spam sites, initiated by Lycos Europe's Make Love Not Spam.", "The user had downloaded an endless request-based screensaver targeting junk mail, with over 100,000 downloads.", "However, the campaign faced criticism for spamming and skirting the anti-spam laws.", "The company denied using its screensaver to harm sites but claimed it slowed spam sites down by targeting their traffic.", "Security groups against net veterans advised users not participate.", "Lycos Europe suspended the campaign after criticism, ending the \"spam killer\" screensaver."], "tinyllama:1.1b": ["A contentious campaign to flood spammer sites with data that has been dropped by Lycos Europe, following backlash and accusations of using anti-spam tactics against sender sites.", "The campaign began in late November but was seen as contributing to the rise in anti-spam measures.", "It resulted in a screensaver designed to encourage vigilante activity and skip law enforcement that had already sparked concern and criticism from net service providers and security groups alike."], "tinydolphin:1.1b": [" It seems that Lycos Europe has decided to shut down its Make Love, Not Spam campaign because it had the potential to encourage vigilante activity and skirt the edge of the law.", "The campaign aimed to flood spammer sites with data but instead caused controversy by encouraging vigilant behavior and potentially violating the privacy rights of those affected by spam.", "This was in line with the Make Love, Not Spam campaign's intention, as it sought to create a sense of awareness about spamming practices and encourage open dialogue on how they can be curbed.", "The move comes as users are questioning whether the campaign's tactics were appropriate, particularly given its potential impact on the targeted sites."], "phi:2.7b": [" A controversial plan by Lycos Europe to flood spam sites with data has been dropped.", "The Make Love, Not Spam campaign aimed to slow down spammers' sites but faced backlash for its tactics and potential to skirt the law.", "Users were encouraged to download a screensaver that would request data from targeted websites, but this led to some sites being knocked offline.", "Lycos Europe apologized for any negative consequences of the campaign and said it had been started to stimulate debate about anti-spam measures."], "orca-mini:3b": [" Anti-spam screensaver scrapped due to controversy, controversial campaign to bump up bandwidth bills of spammers by flooding their sites with data has been shut down."], "hermes3:3b": ["Lycos Europe's anti-spam screensaver (Make Love, Not Spam) scrapped\n\nControversial campaign aimed to increase spam sites' bandwidth costs by overloading them\n\nCampaign faced criticism and opposition, some net service firms blocked access to Lycos site\n\nScreensaver overloaded target spam sites but not intended to take them down, according to Lycos"], "stablelm-zephyr:3b": ["Lycos Europe's Make Love, Not Spam campaign, which aimed to increase bandwidth costs for spammers by flooding their sites with data, has been discontinued.", "Controversial from the start, the anti-spammer screensaver encouraged vigilante activity and some net service firms blocked access to the Lycos Europe site.", "The campaign was deemed too successful, causing some targeted sites to be knocked offline.", "Despite this, Lycos claimed the campaign achieved its goal of slowing spammers' sites and denied any direct impact on the sites being targeted."], "chatgpt-4o-latest": ["Lycos Europe has scrapped its controversial \"Make Love, Not Spam\" campaign, which aimed to increase spammers' bandwidth costs by flooding their sites with data.", "Launched in late November, the campaign allowed users to download a screensaver that repeatedly requested data from spam-related websites.", "Over 100,000 people participated, but the initiative faced criticism for encouraging vigilante tactics and potentially violating legal boundaries.", "Some internet service providers blocked access to Lycos' site, and monitoring firm Netcraft reported that some targeted sites were being knocked offline, though Lycos denied responsibility.", "Security experts advised against participation, and following widespread criticism, the campaign was suspended and ultimately shut down.", "Lycos stated that its goal was to spark debate on anti-spam measures, which it claimed had been achieved."], "stablelm2:1.6b": ["A successful anti-spam campaign known as \"Make Love, Not Spam\" was abandoned due to its tactics being criticized and deemed too successful by flooding spammers' sites with data.", "The screensaver encouraged vigilante activity and potentially violated laws.", "Lycos Europe initially launched the campaign in November but shut it down, stating that it aimed to stimulate debate about anti-spam measures rather than actually tackle spam.", "Many internet veterans criticized the campaign for using similar spamming tactics against legitimate senders of junk mail emails.", "The operation was successful as some targeted sites were being brought offline by the constant data requests.", "However, Lycos acknowledged that the main objective of the campaign was to slow spammers' sites and not bring them down directly.", "This led to many security organizations advising users against participating in the campaign."], "granite3.1-dense:2b": ["Lycos Europe's Make Love, Not Spam campaign, launched in late November to combat spam by overloading spammer sites with data requests via a screensaver, has been discontinued.", "Over 100,000 users downloaded the screensaver, but the initiative faced significant controversy and backlash.", "Critics argued it encouraged vigilante activity and borderline illegal behavior, as well as potentially causing sites to crash due to excessive data requests.", "Monitoring firm Netcraft reported some targeted sites were experiencing issues.", "Lycos denied its campaign caused these problems, stating the database allocated 5% extra capacity for each site.", "Security organizations warned against participation in the campaign.", "The decision to halt Make Love, Not Spam comes shortly after it was temporarily suspended amid growing criticism."]}