{"raw_text": "Cyber criminals step up the pace\n \n So-called phishing attacks that try to trick people into handing over confidential details have boomed in 2004, say security experts.\n \n The number of phishing e-mail messages stopped by security firm MessageLabs has risen more than tenfold in less than 12 months. In 2004 it detected more than 18 million phishing e-mail messages. Other statistics show that in 2004 73% of all e-mail was spam and one in 16 messages were infected with a virus.\n \n In its end-of-year report, MessageLabs said that phishing had become the top security threat and most popular form of attack among cyber criminals. In September 2003, MessageLabs caught only 273 phishing e-mails that tried to make people visit fake versions of the websites run by real banks and financial organisations. But by September 2004 it was stopping more than two million phishing related e-mail messages per month. Worryingly, said the firm, phishing gangs were using increasingly sophisticated techniques to harvest useful information such as login details or personal data.\n \n Older attacks relied on users not spotting the fact that the site they were visiting was fake, but more recent phishing e-mails simply try to steal details as soon as a message is opened. Other phishing scams try to recruit innocent people into acting as middlemen for laundering money or goods bought with stolen credit cards. \"E-mail security attacks remain unabated in their persistence and ferocity,\" said Mark Sunner, chief technology officer at MessageLabs. \"In just 12 months phishing has firmly established itself as a threat to any organisation or individual conducting business online,\" he said. Mr Sunner said MessageLabs was starting to see some phishing attacks become very focused on one company or organisation. \"Already particular businesses are threatened and blackmailed, indicating a shift from the random, scattergun approach, to customised attacks designed to take advantage of the perceived weaknesses of some businesses,\" he said. Although phishing attacks grew substantially throughout 2004, viruses and spam remain popular with cyber-criminals and vandals. One of the biggest outbreaks took place in January when the MyDoom virus started circulating. To date the company has caught more than 60 million copies of the virus. Also up this year was the amount of spam in circulation. In 2003 only 40% of messages were spam. But by the end of 2004, almost three-quarters of messages were junk.\n", "llama3.2:1b": ["Cyber criminals have increased their attacks on individuals and businesses online, with phishing being a top security threat.", "MessageLabs detected over 2 million phishing-related emails per month in September 2004, up from just 273 that year.", "The number of phishing e-mail messages has risen by more than tenfold since then.", "Phishing gangs have become increasingly sophisticated, stealing login details and personal data with their tactics."], "llama3.2:3b": ["Phishing attacks have increased significantly in 2004, with over 18 million phishing e-mail messages detected by MessageLabs.", "The number of phishing attacks has risen tenfold in less than a year, with phishing gangs using sophisticated techniques to harvest information such as login details and personal data.", "Phishing attacks are becoming more focused on specific companies or organisations, and cybercriminals are also turning to viruses and spam to continue their malicious activities."], "gemma2:2b": ["Phishing attacks increased significantly in 2004, becoming the most popular cybercriminal tactic and posing a major threat to online businesses and individuals.", "The number of phishing emails detected by security firm MessageLabs has surged more than tenfold, and these attacks employ increasingly sophisticated techniques to steal sensitive information like login details.", "While virus and spam remain prevalent threats, phishing attacks have shown a clear trend towards targeted attacks on specific companies or organizations."], "qwen2.5:0.5b": ["Cyber criminals are using more sophisticated phishing techniques to trick users into handing over their personal details and information, especially online banking accounts.", "The number of phishing e-mail messages detected by MessageLabs increased tenfold in less than a year, but the security situation is still not entirely clear as the threat remains constant."], "qwen2.5:1.5b": ["Phishing attacks on e-mail have increased significantly over 12 months, involving more than two million phishing-related emails per month in September 2004 compared to just 273 in September 2003, becoming the top security threat and most popular form of attack for cyber criminals.", "Phishers are using increasingly sophisticated techniques, including stealing login details or personal data as soon as a message is opened.", "Cybercriminals continue to use viruses and spam despite phishing attacks growing substantially throughout 2004."], "qwen2.5:3b": ["Cyber criminals have intensified phishing attacks significantly since 2003.", "MessageLabs detected over 18 million phishing emails in 2004, marking a tenfold increase from previous years.", "These attacks are now the primary security threat, targeting both individuals and organizations.", "Phishing tactics have evolved, with attackers focusing on quickly stealing login details or personal information once messages are opened.", "The number of spam emails also surged dramatically, nearly reaching three-quarters of all messages in 2004 compared to only half in 2003.", "While phishing has established itself as a dominant threat, other forms of cyber attacks like viruses and spam still persist."], "opencoder:1.5b": ["Cyber criminals have started to ramp up the pace in recent years.", "So-called phishing attacks try to trick people into handing over confidential details and are increasingly common.", "MessageLabs, a leading cybersecurity firm, has detected more than 18 million phishing e-mail messages since 2004.", "The company reported that it was stopping more than two million phishing related e-mail messages per month in September 2003.", "The phishing attacks have become the top security threat and are among the most common forms of cyber-crimes.", "The phishing gangs have begun to exploit these techniques for gaining valuable information, such as login details or personal data.", "Viral attacks like MyDoom, viruses and spam remain popular with cyber-criminals and vandals.", "Despite this, they continue to grow significantly since MessageLabs caught more than 60 million copies of the virus in 2003.", "The company's spam reports indicate that almost three-quarters of messages were junk since 2003."], "smollm:1.7b": ["Cyber criminals step up the pace and phishing attacks have become more frequent and sophisticated.", "The number of phishing e-mail messages has increased significantly in 2004 compared to 2003.", "In fact, phishing attacks have become so common that they are now considered one of the most popular forms of cybercrime.", "The statistics show that in 2004 more than 73% of all e-mail was spam and phishing attacks were responsible for more than 18 million of these messages.", "This is a significant increase from 2003, when phishing attacks accounted for only about 27% of all email.", "The most popular form of phishing attack in 2004 was the use of fake websites that looked like those run by real banks and financial organizations.", "However, as time went on, cybercriminals began to use more sophisticated techniques to harvest useful information such as login details or personal data.", "This is a significant shift from the older phishing attacks which relied on users not spotting the fact that the site they were visiting was fake.", "The report also highlights the increasing sophistication of phishing gangs and their ability to recruit innocent people into acting as middlemen for laundering money or goods bought with stolen credit cards.", "This is a clear indication that cybercriminals are becoming more targeted in their attacks, using social engineering techniques to trick victims into providing sensitive information."], "deepseek-r1:1.5b": ["In 2004, phishing attacks became increasingly common among security experts, with MessageLabs stopping over tenfold more phishing e-mails than in 12 months.", "They stopped nearly 18 million phishing messages, compared to only 273 in September 2003, and detected over two million monthly e-mails in September 2004.", "Phishing had become the top threat, with 73% of all emails being spam and one in every sixteen messages infected with a virus.", "Older attacks relied on users not spotting fake sites, while newer phishing e-mails targeted specific businesses to steal details.", "Phishing gangs used sophisticated techniques to gather data like login details or personal information.", "Mark Sunner noted that phishing has persisted strongly over 12 months and is now becoming specialized, targeting specific companies.", "Viruses and spam remain popular despite claims of their decline in recent years, with almost three-quarters of messages considered junk by genuine users."], "tinyllama:1.1b": ["During a period marked by increasing numbers of phishing e-mails and more sophisticated techniques used to harvest personal data, cyber criminal groups have stepped up their pace in attacking organizations and individuals online.", "According to security expert Mark Sunner, the number of phishing attacks rose more than tenfold in 2004, and some businesses are now being targeted by customized attacks designed to take advantage of perceived weaknesses.", "These attacks have become popular with cyber-criminals and vanalists alike, with virus and spam campaigns accounting for the majority of messages being caugh in 2004."], "tinydolphin:1.1b": [" Cyber criminals have stepped up the pace of phishing attacks since 2004, when MessageLabs reported a tenfold increase in the number of messages they detected.", "In that time, these malicious e-mails have become the most popular form of attack among cyber criminals.", "Phishing is the practice of tricking victims into handing over confidential information, often by pretending to be an official organization or website.", "This has led to increasingly sophisticated techniques being used to harvest useful data like login details and personal information.", "As phishing attacks continue to evolve and become more targeted, MessageLabs is expecting the number of phishing messages detected in 2005 to rise even further."], "phi:2.7b": [" In 2004, cyber criminals increased their phishing attacks by more than tenfold, according to security firm MessageLabs.", "The number of detected phishing e-mails rose from about 18 million in 20014 to over two million per month in 20015.", "Phishing gangs are becoming more sophisticated in their techniques to obtain confidential details such as login information or personal data.", "Older attacks relied on users not recognizing fake websites, while new phishing scams try to steal details the moment a message is opened.", "Viruses and spam remain popular with cyber-criminals and vandals, with MyDoom virus alone infecting over 60 million copies in 20015.", "As of 20013, about 40% of all e-mails were spam, but by 2004, it had reached 73%."], "orca-mini:3b": [" Cyber criminals have increased their pace in phishing attacks in 2004, with more than tenfold rise in the number of phishing email messages stopped by security firm MessageLabs.", "In less than 12 months, the number of phishing e-mail messages detected by the firm increased from 273 to over two million.", "Phishing gangs have also become more sophisticated in their techniques to steal useful information such as login details or personal data from innocent users.", "These attacks are a significant threat to any organization or individual conducting business online, according to Mark Sunner, MessageLabs' chief technology officer.", "Phishing attacks have firmly established themselves as a threat to any company or individual conducting business online.", "While viruses and spam remain popular with cyber-criminals, phishing attacks grew significantly in 2004."], "hermes3:3b": ["Phishing attacks significantly increased in 2004, with phishing emails detected over 18m, surpassing other security threats like spam and viruses."], "stablelm-zephyr:3b": ["Phishing attacks increased significantly in 2004, with over 18 million detected by security firm MessageLabs, becoming the top security threat and most popular form of attack among cyber criminals.", "Phishing gangs used increasingly sophisticated techniques to harvest useful information such as login details or personal data.", "Security experts warned that phishing attacks would continue unabated and become more focused on individual companies.", "Viruses and spam remained popular with cyber-criminals and vandals, with the MyDoom virus starting circulation in January and spam reaching almost three-quarters of messages by the end of 2004."], "chatgpt-4o-latest": ["Phishing attacks surged in 2004, with security firm MessageLabs detecting over 18 million phishing emails, a tenfold increase in less than a year.", "By September 2004, the firm was blocking over two million phishing emails per month, compared to just 273 in September 2003.", "Cyber criminals used increasingly sophisticated techniques to steal login details and personal data, sometimes even as soon as an email was opened.", "Some scams also recruited individuals to launder money or goods.", "Targeted phishing attacks against specific businesses emerged, shifting from broad, random attacks to more customized threats.", "Meanwhile, spam and viruses remained prevalent, with spam making up 73% of all emails by the end of 2004, up from 40% in 2003.", "The MyDoom virus was one of the year's biggest outbreaks, with over 60 million copies detected."], "stablelm2:1.6b": ["Phishing attacks have significantly increased in frequency and effectiveness according to security experts.", "The number of phishing email messages intercepted by MessageLabs, a security firm, has more than doubled within just three months, with over million phishing emails detected in 2014% (million) of all e-mails were spam and one in every messages were infected with a virus.", "In the end-of-year report published by MessageLabs, they found that phishing had become the top security threat among cybercriminals and was the most popular form of attack.", "The firm noted that recent phishing emails attempt to steal personal data from victims as soon as their message is opened.", "They also recruit innocent people into acting as middlemen for money laundering or goods bought with stolen credit cards."], "granite3.1-dense:2b": ["Cybercriminals have significantly intensified their phishing attacks in 2004, according to security firm MessageLabs.", "The number of detected phishing e-mail messages increased tenfold from September 2003 to September 2004, reaching over two million per month.", "Phishing had surpassed other attack types as the top security concern and most prevalent method used by cyber criminals.", "These attacks now employ more sophisticated techniques to steal sensitive information like login details or personal data at the moment of message opening.", "Phishing gangs also began targeting specific businesses for tailored, customized attacks.", "Despite this focus on phishing, viruses and spam remained popular among cybercriminals.", "The MyDoom virus was one of the most prominent in 2004, with over 60 million copies detected, while spam increased to nearly three-quarters of all e-mail messages."]}