{"raw_text": "Media gadgets get moving\n \n Pocket-sized devices that let people carry around video and images are set to have a big year in 2005, according to industry experts.\n \n Last year saw the emergence of portable media players, such as the Windows-based Creative Zen portable media player, the Samsung Yepp, the iRiver PMC-100, and the Archos AV400 series among others. But this year, they are set to get smarter and more connected, to allow people to find more video to watch on them. Archos launched its latest range of its Linux-based portable media devices at the Consumer Electronics Show in Las Vegas on Friday. Dubbed the Pocket Media Assistant PMA430, it crucially has wi-fi capability built-in for the first time. \"Consumers are showing a great thirst for devices that store all their media in one place for anywhere access,\" said Henri Crohas, chief of Archos. \"And now those consumers can stay connected and productive at the same time.\" Archos said the focus for the device is to be the second gadget in people's pockets, after the mobile.\n \n Unlike Windows-based players, the Archos AV400 series devices have always been able to record from any video source, such as TVs, as well as playback. The content put onto the devices is copy protected so cannot then be swapped to another device.\n \n Recording is perhaps a crucial functionality for those who have not seen the point of portable video if there is not a lot of video to watch on it. And wi-fi connectivity opens up the possibility of content delivery via a high-speed wireless link. Archos also announced that it would open up the software development kit to Linux developers so that more applications could be created for the device. Microsoft also made some announcements in the portable media arena at CES, primarily for US consumers though. It has agreed a content deal with personal video recorder company TiVo, which Bill Gates also showcased in his keynote speech at CES. The TiVo To Go service means that US consumers will be able to take any programmes they record on their TiVos and transfer it for free to watch on any of the Windows-based portable media players or smartphones. It also said it had launched a service with MTV to let people watch Comedy Central, VH1 and Country Music TV on its devices. And a service is launching with MSN to provide people with shortened versions of news, entertainment and other video on a subscription basis for download via the PC onto the portable devices. But the ability to record directly from TV, VCR, and digital cable and satellite boxes, which Windows-based devices do not offer, certainly gives people more content to watch on the go too.\n \n The increased capability of these devices, and the content deals that are being done, may go some way to persuading people to use them. Recent research by Jupiter suggested that people would prefer a device that was dedicated to music. Only 13% of Europeans wanted to watch video while on the move. More seemed interested in spending their cash on music-only devices.\n \n \"This year, we are ready for an explosion of portable media,\" Microsoft's Mike Coleman told the BBC News website. \"We are very bullish about it. The fact that I can put photos on here too and share them is super-cool to the consumer,\" he added. The fact that Europeans are far larger public transport users than Americans is one reason why portable media will take off in the coming year too. There is a burgeoning market there for commuters to watch news and other programmes on their way to work. Although Microsoft's content distribution deals are for the US market at the moment, talks were \"always on-going\" with European content suppliers to offer similar services. Various rights management issues have to be ironed out first however. But that does not prevent people from finding ways to create their own content to share online and swap on portable devices, particularly via those which are wi-fi enabled. The possibility is open for non-professional makers of video and audio to take advantage of the growing portable media market to distribute their work. CES, which runs from 6 to 9 January, showcases more than 50,000 new gadgets that will be hitting the shelves in 2005.\n", "llama3.2:1b": ["Archos launched its latest range of Linux-based portable media devices at the Consumer Electronics Show in Las Vegas on Friday.", "The Pocket Media Assistant PMA430 has wi-fi capability for the first time and is focused as the second gadget in people's pockets after the mobile.", "The device allows consumers to store all their media in one place, stay connected and productive, and can record from any video source.", "It also has copy protected content that cannot be swapped to another device.", "Archos announced that it will open up its software development kit to Linux developers, allowing more applications to be created for the device.", "Microsoft made similar announcements at CES, including a content deal with TiVo and plans to offer a service with MTV and MSN to provide short video clips on portable devices.", "The increased capability of these devices may persuade people to use them, and research suggests that 13% of Europeans prefer music-only devices over video.", "The market for portable media is expected to grow, particularly in Europe where there are more public transport users than Americans."], "llama3.2:3b": ["Portable media players are set to get smarter and more connected in 2005, with built-in wi-fi capability and improved recording capabilities.", "Archos launched a new range of Linux-based portable media devices with wi-fi capability, while Microsoft announced content deals with TiVo and MTV for US consumers.", "Despite European research suggesting that people prefer music-only devices, experts believe that portable media will take off in Europe due to public transport usage.", "The market is expected to grow as more content becomes available, and non-professional creators can distribute their work online."], "gemma2:2b": ["Portable media players are expected to become even smarter and connected in 2005.", "Devices like the Archos AV400 series offer wireless connectivity and recording capabilities, while Microsoft is partnering with TiVo for content distribution and MSN for short video clips.", "Recent research suggests a preference for music-focused devices over video players.", "The potential for sharing and distributing user-created content online via portable media is high."], "qwen2.5:0.5b": ["Pocket-sized devices with video and image capabilities are set to have a big year in 2005, according to industry experts.", "These devices include portable media players such as Windows-based Creative Zen, Samsung Yepp, iRiver PMC-100, Archos AV400 series, and Linux-based portable media devices launched at the Consumer Electronics Show in Las Vegas on Friday.", "The focus is to be the second gadget in people's pockets after mobile phones.", "Microsoft made a content deal with TiVo, which allows European commuters to watch news, entertainment, and music online via PC devices and smartphones.", "Non-professional makers of video and audio can take advantage of this growing portable media market by distributing their work on portable devices."], "qwen2.5:1.5b": ["Portable media devices are expected to grow significantly this year with improvements in features and connectivity capabilities.", "Key points include:\n- Archos launches the PMA430 portable media assistant featuring built-in Wi-Fi for better content sharing.", "- Windows-based players record from various sources but don't offer video streaming, whereas Linux-based devices do both recording and playback.", "- Microsoft announces a deal with TiVo for US consumers to access recorded TV programs on portable media players or smartphones.", "Additionally, services are launched with MTV and MSN offering free download of Comedy Central, VH1, Country Music TV content.", "- Recent research suggests that people prefer music-focused gadgets over video players when on the move, indicating increased demand for dedicated music devices among Europeans.", "- Portable media will flourish in markets like Europe where commuters are looking to watch news and other programs while commuting."], "qwen2.5:3b": ["Media gadgets are set for a significant year with increased functionality and connectivity expected in 2005, driven by devices like Archos' PMA430 with built-in Wi-Fi.", "This marks a move beyond basic playback towards providing more content storage solutions.", "Devices can now record from various sources and offer apps for media consumption via subscription services or downloads.", "While some prefer music-only devices, video players still have potential due to European commuters' public transport usage habits.", "Microsoft's announcements include deals with TiVo for recording TV shows and with MTV for additional content offers.", "However, legal issues need resolution before such services can be widely available across Europe."], "opencoder:1.5b": ["Media gadgets get moving \n\nPocket-sized devices that let people carry around video and images are set to have a big year in 2005, according to industry experts.", "Last year saw the emergence of portable media players, such as the Windows-based Creative Zen portable media player, the Samsung Yepp, the iRiver PMC-100, and the Archos AV400 series among others.", "However, they are set to get smarter and more connected, to allow people to find more video to watch on them.", "Archos launched its latest range of its Linux-based portable media devices at the Consumer Electronics Show in Las Vegas on Friday.", "Dubbed the Pocket Media Assistant PMA430, it crucially has wi-fi capability built-in for the first time.", "Consumers are showing a great thirst for devices that store all their media in one place for anywhere access, said Henri Crohas, chief of Archos.", "\"Now those consumers can stay connected and productive at the same time.\"", "Archos said the focus for the device is to be the second gadget in people's pockets, after the mobile phone.", "Unlike Windows-based players, the Archos AV400 series devices have always been able to record from any video source, such as TVs, as well as playback.", "The content put onto the devices is copy protected so cannot then be swapped to another device.", "Recording is perhaps a crucial functionality for those who have not seen the point of portable video if there is not a lot of video to watch on it.", "And wi-fi connectivity opens up the possibility of content delivery via a high-speed wireless link.", "The TiVo To Go service means that US consumers will be able to take any programmes they record on their TiVos and transfer it for free to watch on any of the Windows-based portable media players or smartphones.", "It also said it had launched a service with MTV to let people watch Comedy Central, VH1 and Country Music TV on its devices.", "And a service is launching with MSN to provide people with shortened versions of news, entertainment and other video on a subscription basis for download via the PC onto the portable devices.", "But the ability to record directly from TV, VCR, and digital cable and satellite boxes, which Windows-based devices do not offer, certainly gives people more content to watch on the go too.", "The increased capability of these devices, and the content deals that are being done, may go some way to persuading people to use them.", "Recent research by Jupiter suggested that people would prefer a device that was dedicated to music.", "Only 13% of Europeans wanted to watch video while on the move.", "More seemed interested in spending their cash on music-only devices.", "\"We are ready for an explosion of portable media,\" Microsoft's Mike Coleman told the BBC News website.", "\"We are very bullish about it.", "The fact that I can put photos on here too and share them is super-cool to the consumer,\" he added.", "The fact that Europe is far larger public transport users than Americans is one reason why portable media will take off in the coming year too.", "There is a burgeoning market there for commuters to watch news and other programmes on their way to work.", "Although Microsoft's content distribution deals are for the US market at the moment, talks were \"always on-going\" with European content suppliers to offer similar services.", "Various rights management issues have to be ironed out first however.", "But that does not prevent people from finding ways to create their own content to share online and swap on portable devices, particularly via those which are wi-fi enabled.", "The possibility is open for non-professional makers of video and audio to take advantage of the growing portable media market to distribute their work.", "CES, which runs from 6 to 9 January, showcases more than 50,000 new gadgets that will be hitting the shelves in 2005."], "smollm:1.7b": ["The following summary is concise and accurate:\n\nIn 2005, media devices set to get smarter and more connected are expected to have a big year.", "The release of portable media players with wi-fi capabilities has been announced by Archos, while Microsoft has agreed content deals with personal video recorder companies (TiVo) and country music TV providers (MTV).", "Additionally, Microsoft is launching a service that allows people to download shortened versions of news, entertainment and other video on a subscription basis for playback via the PC onto portable devices.", "The increased capability of these devices and the content deals being done are likely to persuade more people to use them.", "However, there are still some key differences between the two markets that need to be ironed out before they can become mainstream in 2005."], "deepseek-r1:1.5b": ["Portable video devices set to dominate 2005, with smart connectivity focusing on wi-fi and software development.", "Archos launch PMA430 (Pocket Media Assistant) with wi-fi for recording, offering new content delivery via wireless.", "Devices will allow more media viewing, with services like music transfer from TiVo and new video sharing options.", "Europeans prefer dedicated music-only devices, driving market growth.", "Microsoft is optimistic about the trend, though there's work to do with European partners.", "The growing portable media market in Europe is expected to attract professionals and create content on devices for others.", "CES 2005 showcases over 50,000 gadgets, including these smart devices."], "tinyllama:1.1b": ["The media gaaggts get moving at CES 2005 are expected to have a big year in 2005, as they offer access to more video content than ever before.", "Archos is set to launch portable devices with wi-fi capabilities, which will allow people to store all their media in one place for anywhere access.", "The devices come equipped with portability, connectivity, and the ability to record directly from TVs, VCRs, digital cable boxes, and other sources.", "Companies like TiVo, MTV, and Microsoft are set to launch content distribution services through their portable media players, with the possibility of creating original content for the devices.", "As consumers show a great thirst for media in the pocket, more applications are being developed for the devices.", "The burgeoning market for European public transport users is one reason why media gaaggts get moving at CES 2005 will take off.", "Despite rights management issues to be ironed out with European content suppliers, people can still create their own content on the move by taking advantage of the growing market for portable media.", "The showcase at CES, featuring over 50,000 new gadgets set to hit the shelves in 2005, promises to be a highlight of the year."], "tinydolphin:1.1b": [" Summary: Portable media devices are set to have a big year in 2005 as developers create applications for users' convenience and innovative technologies such as wi-fi connectivity make it possible to stream content directly from TVs, VCRs, and digital cable and satellite boxes.", "Additionally, Microsoft is aiming for a more dedicated music-only device market."], "phi:2.7b": [" Portable devices such as video players are set to become even smarter and more connected in 2005, allowing users to watch more video on them.", "The Archos Pocket Media Assistant PMA430 has wi-fi capability for the first time, making it easy for users to stay connected and productive at the same time.", "Microsoft also announced new content deals with TiVo and MTV, as well as a service with MSN to provide news and other videos for download onto portable devices.", "More people are likely to use these devices because of the increased capabilities and content deals."], "orca-mini:3b": [" Portable media gadgets are expected to have a big year in 2005, according to industry experts.", "Last year saw the emergence of pocket-sized devices such as the Creative Zen portable media player, the Samsung Yepp, the iRiver PMC-100, and the Archos AV400 series.", "This year, they are set to get smarter and more connected to allow people to find more video to watch on them.", "Archos launched its latest range of Linux-based portable media devices at the Consumer Electronics Show in Las Vegas on Friday.", "Dubbed the Pocket Media Assistant PMA430, it has wi-fi capability built-in for the first time, allowing people to connect and be productive while on the move.", "The device also records from any video source, such as TVs, and allows content to be swapped to another device.", "The focus for the device is to be the second gadget in people's pockets, after their mobile phones.", "Microsoft has also made some announcements in the portable media arena at CES, primarily for US consumers though.", "It has agreed a content deal with personal video recorder company TiVo, and launched a service with MTV to let people watch Comedy Central, VH1, and Country Music TV on its devices.", "The ability to record directly from TV, VCR, and digital cable and satellite boxes makes them more content-rich for people to watch on the go."], "hermes3:3b": ["Portable media players set to gain wi-fi capabilities, smart features & more video content access in 2005, according to industry predictions.", "Archos devices among the innovators."], "stablelm-zephyr:3b": ["In 2005, industry experts predicted a significant rise in popularity for pocket-sized devices that enable users to carry around video and images.", "Portable media players improved that year, becoming smarter and more connected.", "Archos launched its Linux-based Pocket Media Assistant (PMA430) with built-in Wi-Fi, positioning it as the second gadget people carried, following their mobile phones.", "The PMA430 could access content from any video source—TVs included—and offered copy protection for that content.", "Recording directly from TV, VCR, digital cable and satellite boxes was a unique feature that attracted consumers.", "Microsoft announced partnerships with TiVo and various entertainment providers to offer content for portable devices, including Windows-based players and smartphones.", "Jupiter Research suggested Europeans preferred music-only devices over video ones; however, the growing popularity of portable media, fueled by smart features and increased connectivity, would expand into the European market as well."], "chatgpt-4o-latest": ["Portable media players are expected to grow in popularity in 2005, becoming smarter and more connected.", "Archos introduced the PMA430, its first Linux-based device with built-in Wi-Fi, allowing users to stay connected while accessing media.", "Unlike Windows-based players, Archos devices can record directly from video sources, providing more content options.", "Microsoft announced content deals, including TiVo To Go, which lets US users transfer recorded TV shows to portable devices, and partnerships with MTV and MSN for video content.", "Despite these advancements, research suggests most Europeans prefer music-only devices, though portable media may gain traction among commuters.", "The rise of Wi-Fi-enabled devices also opens opportunities for independent content creators.", "CES 2005 highlights the growing market for portable media technology."], "stablelm2:1.6b": ["Portable media devices, especially those with built-in WiFi capabilities, are set for a big year according to industry experts.", "Last year saw the emergence of portable media players like Creative Zen and Archos; however, this year's gadgets are expected to get smarter and more connected to offer users access to their stored video content.", "The latest range of Archos devices, dubbed the Pocket Media Assistant, offers Wi-Fi connectivity for the first time among other features.", "Recording functionality has always been available in Archos AV-Series devices, but it is now possible with the added WiFi feature.", "Microsoft has also made significant announcements at CES, primarily for US consumers, including content deals with TiVo and MTV.", "Portable media will likely take off in the coming year due to the burgeoning market for commuters watching news on their way to work in Europe."], "granite3.1-dense:2b": ["In 2005, portable media players are expected to gain significant traction due to enhanced features and content deals.", "Key developments include Archos' PMA430, a Linux-based device with built-in wi-fi for wireless content access.", "Unlike previous Windows-based players, the Archos AV400 series can record video from various sources and copy it for secure playback only on their devices.", "Microsoft also made strides at the Consumer Electronics Show (CES) by partnering with TiVo for a free content transfer service called TiVo To Go, enabling US consumers to watch recorded TV shows on Windows-based players or smartphones.", "Additionally, Microsoft collaborated with MTV and MSN to offer shortened video content subscriptions via PC downloads onto portable devices.", "Europeans' greater public transport usage suggests a stronger potential market for these devices compared to the US.", "While recent research indicates that 13% of Europeans prefer music over video on portable media, this year's advancements aim to change consumer preferences.", "The increased capability and content deals may persuade users to adopt portable media players more widely.", "Furthermore, the growing trend is not limited to content consumption; it also encourages content creation by non-professional makers who can share their video and audio on these devices via wi-fi networks.", "Over 50,000 new gadgets are expected to launch in 2005 at CES, fueling the anticipated explosion of portable media use."]}