{"raw_text": "Disney backs Sony DVD technology\n \n A next generation DVD technology backed by Sony has received a major boost.\n \n Film giant Disney says it will produce its future DVDs using Sony's Blu-ray Disc technology, but has not ruled out a rival format developed by Toshiba. The two competing DVD formats, Blu-ray developed by Sony and others, and Toshiba's HD-DVD, have been courting top film studios for several months. The next generation of DVDs promises very high quality pictures and sound, as well as a lot of data. Both technologies use a blue laser to write information. It has a shorter wavelength so more data can be stored. Disney is the latest studio to announce which technology it is backing in a format battle which mirrors the 1980s Betamax versus VHS war. Sony lost out to JVC in that fight.\n \n The current battle for Hollywood's hearts and minds is a crucial one because high-definition films will bring in billions of revenue and the studios would prefer to use one standard. Last month, Paramount, Universal and Warner Brothers said they were opting for the Toshiba and NEC-backed format, HD-DVD high-definition discs.\n \n Those studios currently produce about 45% of DVD content. Sony Pictures Entertainment and MGM Studios have already staked their allegiance with the Blu-ray Disc Association, whose members also include technology companies Dell, Samsung and Matsushita. Twentieth Century Fox is still to announce which technology it will be supporting. If Fox decided to go with Blu-ray too, it would mean the format would have a 47% share of DVD content. Disney said its films would be available on the Blu-ray format when DVD players for the standard went on sale on North America and Japan, expected in 2006. Universal is to start producing films on the HD-DVD format in 2005, and Paramount will start releasing titles using the standard in 2006. Toshiba expects sales of HD-DVDs to reach 300bn yen ($2.9bn, £1.5bn) by 2010.\n", "llama3.2:1b": ["Disney has announced it will produce its future DVDs using Sony's Blu-ray Disc technology, but has not ruled out a rival format developed by Toshiba.", "The two competing formats are Blu-ray and HD-DVD, both of which use blue lasers to write information.", "Disney is one of several studios backing the Blu-ray format, including Paramount, Universal, Warner Brothers, Dell, Samsung, and Matsushita."], "llama3.2:3b": ["Disney backs Sony's Blu-ray Disc technology for future DVDs, while considering Toshiba's HD-DVD as an alternative, amid a battle between the two formats which could impact revenue and industry standards."], "gemma2:2b": ["Disney has chosen Sony's Blu-ray Disc technology for future DVDs.", "This decision follows a trend with other major studios favoring Toshiba's HD-DVD format.", "Both technologies promise high quality and data storage capabilities.", "This competition mirrors the Betamax versus VHS battle from the 1980s, where Sony lost out.", "The outcome will have significant financial implications for the film industry."], "qwen2.5:0.5b": ["Disney is backing Sony's Blu-ray Disc technology for its future DVDs.", "It has not ruled out a rival format developed by Toshiba.", "Both Sony and Toshiba use blue laser to write information.", "The next generation of DVDs promises high quality pictures and sound, as well as large amounts of data.", "They both use a shorter wavelength than the current formats.", "DVD players are expected to become widely available in North America and Japan starting in 2006."], "qwen2.5:1.5b": ["Disney backs Sony's Blu-ray Disc technology for future DVDs after major boost from Sony and other studios.", "Both formats face Hollywood war over high-definition standards with backing of Paramount, Universal, Warner Bros., and Toshiba.", "Blu-ray format set to dominate DVD market in North America and Japan by 2006 as it gains support from major studios including Disney."], "qwen2.5:3b": ["Disney backs Sony's Blu-ray Disc technology for future DVDs despite also considering Toshiba's HD-DVD format.", "Both technologies use blue lasers to write data with Blu-ray having a shorter wavelength and storing more data.", "The film industry is choosing between Blu-ray and HD-DVD, with top studios backing Toshiba's HD-DVD so far.", "Disney will produce its films on the Blu-ray standard available in 2006, while Universal and Paramount plan to use HD-DVD starting in 2005 and 2006 respectively.", "Toshiba expects $2.9 billion sales of HD-DVDs by 2010."], "opencoder:1.5b": ["Disney backs Sony DVD technology and has announced a new format for its future DVDs, which will use Sony's Blu-ray Disc technology.", "The current battle between the two technologies is crucial because high-definition films will bring in billions of revenue and the studios would prefer to use one standard.", "Paramount, Universal, and Warner Brothers have indicated they are opting for the Toshiba format, HD-DVD discs.", "The two competing formats, Blu-ray developed by Sony and others, and Toshiba's HD-DVD, have been attracted by top film studios for several months.", "The next generation of DVDs promises very high quality pictures and sound, and a lot of data.", "The blue laser technology uses a short wavelength to store information effectively."], "smollm:1.7b": ["The summary is concise and preserves key ideas and details from the original text.", "It does not include explanations or reasoning processes.", "The main points are:\n\n1.", "Disney backs Sony DVD technology: Disney has announced that it will produce its future DVDs using Sony's Blu-ray Disc technology, but has not ruled out a rival format developed by Toshiba.", "2.", "Film giant Disney has received a major boost: Disney has received a major boost in the film industry due to its decision to support Sony's Blu-ray Disc technology for producing high-definition films.", "3.", "The next generation of DVDs promises very high quality pictures and sound: The next generation of DVDs is expected to offer very high quality pictures and sound, as well as a lot of data.", "4.", "Both technologies use a blue laser to write information: Both technologies use a blue laser to write information on the disc.", "5.", "Disney is the latest studio to announce which technology it is backing in a format battle: The current format battle for Hollywood's hearts and minds is a crucial one because high-definition films will bring in billions of revenue and the studios would prefer to use one standard.", "6.", "Paramount, Universal and Warner Brothers have already staked their allegiance with Sony: Paramount, Universal and Warner Brothers have already staked their allegiance with the Blu-ray Disc Association, which also includes technology companies Dell, Samsung and Matsushita.", "7.", "Fox has not announced which technology it will be supporting: Fox has not announced which technology it will be supporting in a format battle that mirrors the 1980s Betamax vs VHS war."], "deepseek-r1:1.5b": ["Disney is investing heavily in Sony's Blu-ray Disc technology, a next-generation DVD format known for its high data storage and shorter laser wavelength.", "The competition also includes Toshiba's HD-DVD, which aims to rival the blu-ray market.", "Currently, 45% of movie content is used by Sony under the blu-ray association, supported by companies like Dell, Samsung, and Matsushita.", "Other studios like Twentieth Century Fox haven't decided yet, expecting a potential shift if they adopt one format.", "If they choose the standard, films will become widely available in 2006 for Sony's players.", "Universal plans to release HD-DVD content starting in 2005, with Toshiba targeting $2.9 billion sales by 2010."], "tinyllama:1.1b": ["Sony backs Blu-ray Disc technology as Disney prepares for HD-DVD release, with approximately 45% of DVD content already produced on standard Blu-ray.", "Fox is yet to announce its decision for supporting any format, and Disney's films will be available on the Blu-ray format when DVD players go on sale in North America and Japan.", "Universal is expected to start producing titles on the HD-DVD format by 2005, and Paramount is also planning to release films on both formats.", "Sony's current lead of 47% share of DVD content suggests that the Blu-ray Disc Association is likely to attract a majority of studios' support as the next generation of DVD technology seeks to replace Betamax in the marketplace."], "tinydolphin:1.1b": [" Disney is considering backing Sony's Blu-ray Disc technology for future DVD releases.", "This marks a significant shift in the industry's standard, which has been dominated by Toshiba's HD-DVD format.", "If they choose to use Blu-ray, it will increase their share of DVD content, from 45% to 50%, according to industry analysts.", "However, other studios may choose the other technology, and this could ultimately lead to an even more competitive market for high-definition movies."], "phi:2.7b": [" Disney announces it will use Sony's Blu-ray Disc technology for its future DVDs, but has not ruled out a rival format developed by Toshiba.", "The two competing DVD formats promise high-quality pictures and sound with more data storage capacity.", "Paramount, Universal, and Warner Brothers have already opted for the Toshiba and NEC-backed HD-DVD format, while Sony Pictures Entertainment and MGM Studios are backing Blu-ray Disc.", "Twentieth Century Fox is still undecided, but if they also switch to Blu-ray, it would give the format 47% market share.", "Disney plans to release films on Blu-ray in 2006, while Universal will start using HD-DVD in 2005 and Paramount will begin releasing titles on the standard in 201"], "orca-mini:3b": [" Disney backs Sony's Blu-ray Disc technology for next generation DVDs.", "The battle for Hollywood's hearts and minds is crucial as high-definition films will bring in billions of revenue.", "Studios currently produce about 45% of DVD content and have staked allegiance with the Blu-ray Disc Association, whose members include Sony Pictures Entertainment, MGM Studios, Dell, Samsung and Matsushita.", "Twentieth Century Fox has yet to announce which technology it will support.", "If Fox went with Blu-ray too, it would mean a 47% share of DVD content.", "Disney is expected to release its films on the Blu-ray format when DVD players for the standard go on sale in North America and Japan in 2006.", "Universal is to start producing films on the HD-DVD format in 2005, and Paramount will release titles using the standard in 2006.", "Toshiba expects sales of HD-DVDs to reach $2.9 billion by 2010."], "hermes3:3b": ["Disney supports Sony's Blu-ray DVD technology over competing Toshiba's HD-DVD format."], "stablelm-zephyr:3b": ["Disney will use Sony's Blu-ray Disc technology for its future DVDs, backing the next generation format which promises high quality pictures and sound with lots of data storage capacity due to a blue laser's shorter wavelength.", "This decision comes after major Hollywood studios like Paramount, Universal, and Warner Brothers announced their support for the Toshiba and NEC-backed HD-DVD format.", "The choice of technology is crucial as high-definition films will bring in billions of revenue, and the studios prefer using one standard format."], "chatgpt-4o-latest": ["Disney has announced its support for Sony's Blu-ray Disc technology for future DVDs but has not ruled out Toshiba's rival HD-DVD format.", "The two competing formats, both using blue laser technology for higher data storage, have been vying for major film studio backing.", "Disney's decision adds to the ongoing format battle, reminiscent of the Betamax vs. VHS war.", "Paramount, Universal, and Warner Brothers have chosen HD-DVD, while Sony Pictures and MGM support Blu-ray.", "Twentieth Century Fox has yet to decide, but if it backs Blu-ray, the format would control 47% of DVD content.", "Disney plans to release Blu-ray films when compatible players launch in North America and Japan in 2006.", "Universal and Paramount will begin releasing HD-DVD titles in 2005 and 2006, respectively, with Toshiba projecting HD-DVD sales to reach 300 billion yen by 2010."], "stablelm2:1.6b": ["Disney has announced that they will produce future DVDs on Sony's Blu-ray Disc technology, but have not ruled out supporting a rival format from Toshiba.", "This battle mirrors the rivalry between VHS and Betamax in previous format wars.", "Both competing DVD formats use blue lasers to write information, with Blu-ray offering higher quality pictures and sound while HD-DVD stores more data.", "The studios, which currently produce about 20% of DVD content, are choosing between the Toshiba-backed format (HD-DVD) or the Sony-backed format (Blu-ray).", "Disney's films will be available on the Blu-ray format when standard DVD players become available in North America and Japan.", "Universal plans to start producing HD DVDs, while Paramount will release titles using the standard in 2006.", "Toshiba expects sales of HD-DVDs to reach $3 billion by 2007."], "granite3.1-dense:2b": ["Disney has announced it will produce future DVDs using Sony's Blu-ray Disc technology, joining studios like Paramount, Universal, and Warner Brothers in supporting the Toshiba-backed HD-DVD format.", "This move reflects the film industry's quest for a single high-definition standard to capitalize on potential billions from future high-def content.", "Blu-ray Disc Association members include Dell, Samsung, and Matsushita, while HD-DVD backers consist of Toshiba, NEC, Paramount, Universal, and Warner Brothers.", "Twentieth Century Fox remains undecided.", "Blu-ray adoption by major studios could give the format a 47% market share if Fox chooses it.", "Disney plans to release its films on Blu-ray when players are available in North America and Japan in 2006, with Universal starting HD-DVD production in 2005 and Paramount in 2006.", "Toshiba forecasts 300 billion yen ($2.9bn, £1.5bn) in sales by 2010 for its format."]}