{"raw_text": "Millions to miss out on the net\n \n By 2025, 40% of the UK's population will still be without internet access at home, says a study.\n \n Around 23 million Britons will miss out on a wide range of essential services such as education and medical information, predicts the report by telecoms giant BT. It compares to 27 million, or 50%, of the UK, who are not currently online. The idea that the digital divide will evaporate with time is \"wishful thinking\", the report concludes.\n \n The study calls on the government and telecoms industry to come up with new ways to lure those that have been bypassed by the digital revolution. Although the percentage of Britons without home access will have fallen slightly, those that remain digital refuseniks will miss out on more, the report suggests. As more and more everyday tasks move online and offline services become less comprehensive, the divide will become more obvious and more burdensome for those that have not got net access, it predicts.\n \n The gap between \"have-nets\" and \"have-nots\" has been much talked about, but predictions about how such a divide will affect future generations has been less discussed. BT set out to predict future patterns based on current information and taking account of the way technology is changing. Optimists who predict that convergence and the emergence of more user-friendly technology will bridge the digital divide could be way off mark, the report suggests. \"Internet access on other devices tends to be something taken up by those who already have it,\" said Adrian Hosford, director of corporate responsibility at BT. Costs of internet access have fallen dramatically and coverage in remote areas have vastly improved over the last year but the real barrier remains psychological. \"There is a hard rump of have-nots who are not engaging with the net. They don't have the motivation or skills or perceive the benefits,\" said Mr Hosford.\n \n As now, the most disadvantaged groups are likely to remain among low income families, the older generation and the disabled.\n \n Those on low incomes will account for a quarter of the digital have-nots, the disabled will make up 16% and the elderly nearly a third by 2025, the report forecasts. Organisations such as BT have a responsibility to help tackle the problem, said Mr Hosford. The telco has seen positive results with its Everybody Online project which offers internet access to people in eight deprived communities around Britain. In one area of Cornwall with high levels of unemployment, online training helped people rewrite CVs and learn skills to get new jobs, explained Mr Hosford. Such grassroot activity addressing the specific needs of individual communities is essential is the problem of the digital divide is to be overcome, he said. \"If we don't address this problem now, it will get a lot worse and people will find it more difficult to find jobs, education opportunities will be limited and they'll simply not be able to keep up with society,\" he said. The Alliance for Digital Inclusion, an independent body with members drawn from government, industry and the voluntary sector has recently been set up to tackle some of the issues faced by the digital refuseniks.\n", "llama3.2:1b": ["Millions in the UK will still have limited or no internet access at home by 2025, according to a study by BT.", "Around 23 million Britons will miss out on education and medical information, with 50% of the population not being online, predicted by the report.", "The study suggests that those who remain digital refuse to use their internet will continue to be excluded from essential services, exacerbating the divide.", "BT's director of corporate responsibility warns that costs of internet access have fallen, but the real barrier is psychological motivation and skills, with disadvantaged groups such as low-income families, the older generation, and disabled people being more likely to remain digital refuseniks."], "llama3.2:3b": ["By 2025, 40% of the UK's population will be without internet access at home, predicts a study by BT.", "Around 23 million Britons will miss out on essential services like education and medical information.", "The report concludes that addressing the psychological barrier to accessing the internet is key, rather than relying on technological advancements alone."], "gemma2:2b": ["40% of UK population will remain without internet access at home by 2025.", "The report by BT predicts this gap will widen as more tasks move online, causing further disadvantage for those who lack internet access.", "While costs and coverage have improved, psychological barriers like a lack of motivation or skills are still significant hurdles to overcome.", "The most disadvantaged groups (low-income families, disabled individuals, elderly) will continue to be disproportionately affected.", "To address this challenge, organizations like BT are implementing programs like the Everybody Online project while the Alliance for Digital Inclusion aims to tackle issues faced by digital refuseniks and create a more inclusive digital society."], "qwen2.5:0.5b": ["The study predicted that the UK's 40% population without internet access will remain in the digital gap until around 2025.", "Despite technological advancements, more Britons are left behind due to the digital divide, which is likely to become even deeper with ongoing technological changes and increased competition for jobs.", "Organizations like BT have a responsibility to address the issue, offering opportunities such as \"Everybody Online\" training programs in deprived communities."], "qwen2.5:1.5b": ["The UK will see 40% of its population without internet access at home in 2025, leaving millions behind on essential services.", "The BT report predicts that while this percentage may decrease slightly, those remaining offline will miss out more and face greater difficulties as technology evolves, with low-income families, the elderly, and disabled people being most affected.", "Grassroots initiatives like BT's Everybody Online project are crucial in addressing this issue."], "qwen2.5:3b": ["By 2025, nearly one-third of UK residents will lack home internet access despite a slight decline in overall figures, according to BT's study.", "The report predicts this trend will exacerbate due to increasing digitization and narrowed service options for those without internet.", "BT highlights that psychological barriers are the primary obstacle, with disadvantaged groups like low-income families, the elderly, and disabled most affected.", "Despite recent improvements, BT emphasizes the need for ongoing grassroots initiatives and public-private partnerships to bridge the digital divide."], "opencoder:1.5b": ["The study highlights a significant shift in people's online access.", "Despite its initial impression as \"wishful thinking,\" it calls for greater integration within society and predicts an overall reduction in internet-related burdens, which is aiding those with limited connectivity.", "It calls on the government and telecom industry to provide innovative ways to lure and empower those who have been affected by the digital revolution.", "The report conclusively proposes that the digital divide will likely fade over time, prompting businesses, governments, and social organizations to focus more on maintaining regular internet connection, which is the main goal of the study."], "smollm:1.7b": ["The summary above is concise and clear, preserving key ideas and details while omitting unnecessary information.", "The main points are:\n\n1.", "Millions to miss out on the net (23 million Britons)\n2.", "Around 23 million (50%) of the UK population have internet access at home.", "3.", "The report predicts that by 2025, around 40% of the UK's population will still be without internet access at home.", "4.", "The gap between \"have-nets\" and \"have-nots\" has been much talked about, but predictions about how such a divide will affect future generations have been less discussed.", "5.", "Optimists who predict that convergence and the emergence of more user-friendly technology will bridge the digital divide could be way off mark.", "6.", "The most disadvantaged groups are likely to remain among low income families, the elderly and the disabled by 2025.", "7.", "Organisations such as BT have a responsibility to help tackle the problem, said Mr Hosford."], "deepseek-r1:1.5b": ["By 2025, **approximately 40%** of the UK's population will still lack internet access at home.", "According to a study conducted by BT, around **23 million Britons** won't have access to essential services like education or medical information.", "This compared to **27 million**, who currently are online.", "The digital divide is not eroding on its own; people are increasingly using online tools and services.", "The report highlights that the gap between those with net access (40%) and those without (63%) remains significant, though trends in coverage suggest a growing issue as tasks shift to digital platforms.", "Key groups affected by this include:\n- **Low-income families**: Make up a quarter of digital have-nots.", "- **Older generations**: Contribute 16% of those without net access.", "- **Elderly**: A third or more by 2025.\n\n bt has implemented the \"fill in\" model, connecting people in deprived areas with internet.", "This includes tools and training, such as providing CV rewriting services to help individuals find new jobs in Cornwall.", "These efforts address specific needs of communities rather than a blanket fix.", "Mr Hosford emphasized that targeted solutions are crucial.", "He believes that addressing these issues now will lead to more problems for those without net access, likely worsening their circumstances as tasks move online and offline services become less comprehensive."], "tinyllama:1.1b": ["The study conducted by telecoms giant BT predicts that in 2025, around 40% of the UK population will still be without internet access at home.", "As many as 23 million Britons may miss out on essential services such as education and medical information.", "The digital divide is believed to become more obvious and more burdensome for those who have not received online access, with a significant proportion of have-nots remaining in the digital refusenik category.", "Those in low income families, the elderly, and disabled individuals will be among the most disadvantageed groups, according to the study.", "To help address this issue, BT has launched an initiative called Everybody Online to offer internet access to people living in poverty and has set up grassroots projects aimed at tackling the digital divide."], "tinydolphin:1.1b": [" A digital divide refers to a gap between people who have access to technology or internet services and those who do not.", "This can lead to significant disparities in terms of education, healthcare, job opportunities, and overall well-being among different groups of people.", "In the UK, there is currently no definitive figure for how many homes lack internet access at home, but it's estimated that around 27 million people do not have it, which accounts for around 50% of the total population.", "The study by telecoms giant BT suggests that this digital divide will likely evaporate over time as more and more technologies become available to those who lack access.", "The government and industry should take steps to bridge this gap, such as providing affordable internet access for all and investing in initiatives to improve education and job opportunities for people without internet access at home."], "phi:2.7b": [" BT's report predicts that 40% of UK residents will lack home internet access by 2025, resulting in 23 million Britons missing out on essential services such as education and medical information.", "The report cautions against optimistic predictions about bridging the \"have-nets\" versus \"have-nots\" digital divide, suggesting costs, skills, and motivation remain significant barriers.", "BT's Everybody Online project has provided success stories of disadvantaged groups benefiting from online training to improve job prospects, highlighting the need for grassroots community initiatives."], "orca-mini:3b": [" By 2025, around 23 million Britons will be without internet access at home, which is around 40% of the UK's population.", "This gap between \"have-nets\" and \"have-nots\" has been much talked about, but predictions about how such a divide will affect future generations has been less discussed.", "BT set out to predict future patterns based on current information and taking account of the way technology is changing.", "The report concludes that the digital divide will become more obvious and more burdensome for those that have not got net access, and that the gap between \"have-nets\" and \"have-nots\" has been much talked about but predictions about how convergence and the emergence of more user-friendly technology will bridge the digital divide could be way off mark.", "The report suggests that the Alliance for Digital Inclusion, an independent body with members drawn from government, industry, and the voluntary sector, has recently been set up to tackle some of the issues faced by the digital refuseniks."], "hermes3:3b": ["By 2025, 40% of UK population may still not have internet access at home, according to a BT report.", "It forecasts that around 23 million Britons will be without essential services like education and medical information due to digital divide."], "stablelm-zephyr:3b": ["A study by telecoms giant BT predicts that by 2025, 40% of the UK's population will still be without internet access at home, with around 23 million Britons missing out on essential services like education and medical information.", "The report calls for new solutions from the government and telecoms industry to bridge the digital divide, as more everyday tasks move online and offline services become less comprehensive.", "The most disadvantaged groups are likely to remain among low-income families, the elderly, and disabled individuals.", "BT's Everybody Online project has shown positive results in offering internet access to people in deprived communities."], "chatgpt-4o-latest": ["By 2025, 40% of the UK population, or 23 million people, will still lack home internet access, limiting their access to essential services like education and healthcare, according to a BT report.", "The study warns that the digital divide will not disappear naturally and urges the government and telecoms industry to find new ways to engage those left behind.", "While internet costs have dropped and coverage has improved, psychological barriers such as lack of motivation and skills remain significant obstacles.", "The most affected groups will be low-income families, the elderly, and the disabled.", "BT's Everybody Online project has shown success in helping disadvantaged communities gain digital skills, and broader grassroots efforts are needed to prevent worsening social and economic exclusion.", "The newly formed Alliance for Digital Inclusion aims to address these challenges."], "stablelm2:1.6b": ["A study reveals that 5 million Britons will be without internet access at home by 2021, compared to 1 million or 2% currently not online.", "The digital divide is expected to become more obvious and burdensome for those without access as technology advances.", "Disadvantaged groups are likely to remain low-income families, older generations, and disabled individuals, with these groups accounting for a quarter of the digital have-nots.", "Organizations like BT offer internet access in deprived communities, but addressing this issue is essential to overcome the challenges faced by society's digital refuseniks."], "granite3.1-dense:2b": ["By 2025, nearly 40% of the UK's population—approximately 23 million people—will still lack home internet access, according to a BT study.", "This digital divide will impact essential services like education and medical information for these individuals.", "The report, which forecasts that this figure could slightly decrease from current 50%, warns that the gap between \"haves\" and \"have-nots\" is likely to widen as more tasks migrate online and offline services become less extensive.", "The digital divide disproportionately affects low-income families, the elderly, and people with disabilities.", "Low-income individuals will make up about a quarter of the unconnected population; disabled people, 16%; and those aged 65 or older, nearly one-third.", "BT's director of corporate responsibility, Adrian Hosford, emphasizes that the primary barrier to internet access remains psychological rather than cost or coverage issues.", "To address this challenge, organizations like BT are implementing programs such as Everybody Online, which aims to provide internet access in deprived communities, including those with high unemployment rates.", "Such initiatives focus on tailored digital literacy training and skills development to improve employment prospects and overall quality of life for the digitally excluded.", "The Alliance for Digital Inclusion, recently established by various sectors, will also play a role in tackling this issue.", "Failure to address the digital divide could exacerbate existing social challenges, making it increasingly difficult for these individuals to access essential services and opportunities."]}