{"raw_text": "Spam e-mails tempt net shoppers\n \n Computer users across the world continue to ignore security warnings about spam e-mails and are being lured into buying goods, a report suggests.\n \n More than a quarter have bought software through spam e-mails and 24% have bought clothes or jewellery. As well as profiting from selling goods or services and driving advertising traffic, organised crime rings can use spam to glean personal information. The Business Software Alliance (BSA) warned that people should \"stay alert\". \"Many online consumers don't consider the true motives of spammers,\" said Mike Newton, a spokesperson for the BSA which commissioned the survey.\n \n \"By selling software that appears to be legitimate in genuine looking packaging or through sophisticated websites, spammers are hiding spyware without consumers' knowledge. \"Once the software is installed on PCs and networks, information that is given over the internet can be obtained and abused.\"\n \n The results also showed that the proportion of people reading - or admitting to reading - and taking advantage of adult entertainment spam e-mails is low, at one in 10. The research, which covered 6,000 people in six countries and their attitudes towards junk e-mails, revealed that Brazilians were the most likely to read spam. A third of them read unsolicited junk e-mail and 66% buy goods or services after receiving spam.\n \n The French were the second most likely to buy something (48%), with 44% of Britons taking advantage of products and services. This was despite 38% of people in all countries being worried about their net security because of the amount of spam they get. More than a third of respondents said they were concerned that spam e-mails contained viruses or programs that attempted to collect personal information. \"Both industry and the media have helped to raise awareness of the issues that surround illegitimate e-mail, helping to reduce the potential financial damage and nuisance from phishing attacks and spoof websites,\" said William Plante, director of corporate security and fraud protection at security firm Symantec. \"At the same time, consumers need to continue exercising caution and protect themselves from harm with a mixture of spam filters, spyware detection software and sound judgement.\"\n", "llama3.2:1b": ["Computer users across the world ignore security warnings about spam e-mails, buying goods and services despite being lured into them.", "A survey showed that over 25% of respondents bought software and clothes or jewelry through spam, and most read adult entertainment spam but are not taking advantage.", "The proportion of people reading junk e-mails is low, with Brazilians being the most likely to read unsolicited spam at one in 10, while French and British respondents were more likely to buy goods or services."], "llama3.2:3b": ["Computer users are being lured into buying goods through spam e-mails despite security warnings.", "Over 25% have bought software, 24% clothes or jewelry, while only 1 in 10 read adult entertainment spam e-mails.", "Brazilians were the most likely to read unsolicited junk e-mail, while French and Britons also took advantage of products and services after receiving spam.", "Despite being worried about net security, many people lack caution when dealing with spam e-mails."], "gemma2:2b": ["Despite warnings about security risks, many internet users buy products through unsolicited emails.", "This is facilitated by organized crime rings and scammers who use fake websites and disguised email contents to deceive consumers.", "The survey indicates that Brazilians are most likely to read spam, followed by the French, while a majority of respondents express concern about viruses and information theft."], "qwen2.5:0.5b": ["Spam e-mails lure shoppers and businesses, while the Business Software Alliance warns that people should stay alert by avoiding them.", "More than half of online consumers do not consider spammers' motives and their packaging is often seen as legitimate.", "Adults and children are most likely to read spam, with Brazilians reading it most often.", "Spam contains spyware on PCs and networks, potentially stealing personal information.", "The media has helped raise awareness about the issue by helping people avoid phishing attacks and spoof websites."], "qwen2.5:1.5b": ["A survey suggests that many users are ignoring security warnings about spam emails, leading them to buy goods or services through spam, exposing their personal information.", "The report also indicates that Brazilians read the most spam while 48% of French respondents bought something after receiving spam.", "Users in all countries worry about spam containing viruses or personal information and should use caution when reading spam."], "qwen2.5:3b": ["Computer users across the world ignore spam email warnings, frequently buying goods through them.", "More than 24% have bought software or clothes/jewelry via spam.", "Spammers profit from selling goods/services and can steal personal information.", "The BSA warns consumers to stay alert.", "Spyware is hidden in legitimate-looking software packages sold by spammers, potentially collecting user data.", "Only about one-tenth read adult entertainment spam.", "Brazilians are most likely to engage with spam (33% read, 66% buy), followed by French and Britons.", "Concerns about net security due to spam vary, but many worry about viruses or personal information theft.", "Industry and media have raised awareness, reducing potential damage from phishing attacks and spoof websites.", "Consumers should use spam filters, spyware detection software, and maintain caution for protection."], "opencoder:1.5b": ["Spam e-mails are often used as a deterrent against online shopping cart schemes, encouraging users to explore unfamiliar websites without purchasing products or services.", "As companies such as the Business Software Alliance (BSA) have indicated, \"many online consumers don't consider the true motives of spammers,\" they suggest keeping their customers' email alerts off.", "This practice can lead to large purchases and malicious downloads of software, cyber criminals accessing personal information, and illegal merchandise.", "The report further highlights that many consumers are wary about the potential for unwanted emails as a deterrent to online scams or phishing attempts, prompting them to stay alert and be cautious during any suspicious e-mail communications."], "smollm:1.7b": ["The text above is concise because it:\n\n1.", "Preserves key ideas: The main points are that computer users across the world continue to ignore security warnings about spam e-mails and are being lured into buying goods or services through spam.", "2.", "Does not include explanations, reasoning processes, or additional information.", "3.", "Is written in plain text format without any formatting, such as headings, subheadings, or bullet points."], "deepseek-r1:1.5b": ["Spam emails are often used by computer users who ignore warnings, attracting net shoppers.", "A survey found over 25% of people bought software through these emails and 24% spent on clothing or jewelry.", "Spammers hide spyware to avoid detection.", "Results showed low reading rates for spam, with Brazilians most likely to read it.", "A third read unsolicited junk e-mail, while 66% purchased goods after receiving spam.", "France is second in buying, with a 48% rate compared to 44% of Britons.", "Media help raise awareness against illegitimate emails, highlighting security risks from high spam volume (38%) and potential phishing or spoof issues.", "Consumers should use filters, detect spyware, and monitor for suspicious activities."], "tinyllama:1.1b": ["L'attaque d'espionnage sur le net poussait toujours plus fortement les consommateurs à accepter des offres de vente ou de services en payant par l'adresse d'enregistrement, une étude menée par l'association Business Software Alliance (BSA) montre que 24% des consommateurs ont acheté des produits ou des articles.", "D'autre part, l'internet fait partie d'une cible qui n'est pas délaissée pour les organised crime rings parce que les organisations s'amuseient à trouver des informations sur les consommateurs afin de gagner leur confiance et leur clientèle.", "La consommation d'advertisements et d'e-mails se révèlent être les moyens privilégiés par ces organised crime rings, ainsi que le rapport entre 1% des consommateurs qui ont lu un e-mail spam et l'achat d'un produit ou de services après le bénéfice de cet e-mail.", "La cible principale est généralement les consommateurs âgés et écoliers, suivis par les adolescents et les adultes, tous deux ayant réussi à trouver une solution efficace pour gérer leurs risques de net surpassant leur niveau d'éducation, le taux d'abonnement à la protection spécifique des consommateurs est très bas, passant entre 10% et 24%, les consommateurs sont réputés sévères en termes de cyber-hygiene, et plus d'un tiers des consommateurs adhèrent aux outils d'e-mails pour net."], "tinydolphin:1.1b": [" Summary: Spam emails are increasingly targeted towards net shoppers as they lure people into buying goods or jewellery by hiding their true motives.", "Spammers use fake looking packaging to trick consumers, with many buying products without knowing the spyware behind them.", "The proportion of people reading or admitting to reading spam e-mails is low, particularly for adult entertainment spam e-mails."], "phi:2.7b": [" The text discusses how people are falling victim to spam e-mails that lure them into buying goods or services.", "It also mentions that spammers can use these emails to obtain personal information and profit from selling software, clothes, or jewellery.", "The Business Software Alliance warns that consumers should stay alert as they may not be aware of the true motives of spammers.", "The text also reports on a survey that shows Brazilians are the most likely to buy things after receiving spam e-mails, followed by Britons.", "However, almost all countries surveyed expressed concern about the amount of spam they receive and the potential harm it can cause.", "The text suggests using filters, spyware detection software, and good judgement as ways to protect oneself from spam emails."], "orca-mini:3b": [" Spam e-mails tempt net shoppers by enticing them into buying goods and services or even driving traffic for online ads.", "Despite warnings about security risks, more than a quarter have bought software through spam emails and 24% have bought clothes or jewelry.", "Organized crime rings can use spam to gather personal information, which they use to profit from selling software or services or drive traffic for ads.", "However, people are hesitant to acknowledge the potential threats and worry about viruses or programs that steal personal information.", "Industry and media efforts have reduced potential financial damage and nuisance from phishing attacks and spoof websites.", "Consumers need to continue being cautious and protect themselves with mix of spam filters, spyware detection software, and sound judgment."], "hermes3:3b": ["Spam emails lure net shoppers, many buying goods like software & clothes via them, despite security warnings."], "stablelm-zephyr:3b": ["Spam emails are tempting computer users to buy goods, with over 25% buying software and 24% clothes or jewelry through them.", "Organised crime rings can profit from selling products and gaining personal information.", "Spammers hide spyware without consumers knowing, and the French were found to be most likely to make a purchase (48%) despite concerns about net security due to high spam volumes.", "To protect against harm, consumers should use a combination of spam filters, spyware detection software, and sound judgement."], "chatgpt-4o-latest": ["A report suggests that many computer users ignore security warnings and purchase goods through spam e-mails, with over a quarter buying software and 24% purchasing clothes or jewellery.", "Spammers not only profit from sales but also use spam to collect personal information.", "The Business Software Alliance warns that some spam-sold software may contain hidden spyware, compromising users' data.", "A survey of 6,000 people across six countries found that Brazilians were the most likely to read and buy from spam, followed by the French and Britons.", "Despite concerns about security risks, including viruses and data theft, many still engage with spam.", "Experts emphasize the need for awareness, spam filters, spyware detection, and cautious online behavior to mitigate risks."], "stablelm2:1.6b": ["Spam email lures internet shoppers: Over 25% have bought goods through spam emails, revealing potential for organized crime in personal information.", "Spammers hide spyware without consumers' knowledge to deceive online buyers into purchasing legitimate software via deceptive packaging or websites.", "French and British respondents are most likely to purchase goods after receiving spam mail; however, significant numbers of people worldwide express concern about their net security due to the amount of spam they receive."], "granite3.1-dense:2b": ["Spam emails remain a significant issue, despite warnings about potential dangers.", "A survey involving 6,000 people across six countries revealed that over one-quarter have purchased goods (software or clothing/jewelry) through spam, with Brazilians being the most susceptible (33%).", "Organized crime rings exploit these emails to gather personal information and sell legitimate-looking products containing spyware.", "While 10% of adult entertainment spam recipients admit reading it, the actual number is likely lower.", "Despite 38% of respondents being worried about net security due to spam, 48% French and 44% Britons still made purchases after receiving spam.", "Industry awareness campaigns have reduced the impact of phishing attacks and spoof websites, but consumers must maintain vigilance with spam filters, spyware detection software, and cautious browsing practices."]}