{"raw_text": "Mobile multimedia slow to catch on\n \n There is no doubt that mobile phones sporting cameras and colour screens are hugely popular. Consumers swapping old phones for slinkier, dinkier versions are thought to be responsible for a 26% increase in the number of phones sold during the third quarter of 2004, according to analysts Gartner More than 167 million handsets were sold between July and September 2004, a period that, according to Gartner analyst Carolina Milanesi is \"seldom strong\". But although consumers have mobiles that can take and send snaps, sounds and video clips few, so far, are taking the chance to do so.\n \n In fact, the numbers of people not taking and sending pictures, audio and video is growing. Figures gathered by Continental Research shows that 36% of British camera phone users have never sent a multimedia message (MMS), up from 7% in 2003. This is despite the fact that, during the same period, the numbers of camera phones in the UK more than doubled to 7.5 million. Getting mobile phone users to send multimedia messages is really important for operators keen to squeeze more cash out of their customers and offset the cost of subsidising the handsets people are buying. The problem they face, said Shailendra Jain, head of MMS firm Adamind, is educating people in how to send the multimedia messages using their funky handsets.\n \n \"Also,\" he said, \"they have to simplify the interface so its not rocket science in terms of someone understanding it.\" Research bears out the suspicion that people are not sending multimedia messages because they do not know how to. According to Continental Research, 29% of the people it questioned said they were technophobes that tended to shy away from innovation. Only 11% regarded themselves as technically savvy enough to send a picture or video message. The fact that multimedia services are not interoperable across networks and phones only adds to people's reluctance to start sending them, said Mr Jain. \"They ask themselves: 'If I'm streaming video from one handset to another will it work?'\" he said. \"There's a lot of user apprehension about that.\"\n \n There are other deeper technical reasons why multimedia messages are not being pushed as strongly as they might. Andrew Bud, executive chairman of messaging firm Mblox, said mobile phone operators cap the number of messages that can be circulating at any one time for fear of overwhelming the system. \"The rate we can send MMS into the mobile network is fairly constant,\" he said. The reason for this is that there are finite capacities for data traffic on the second generation networks that currently have the most users.\n \n No-one wants to take the risk of swamping these relatively narrow channels so the number of MMS messages is capped, said Mr Bud. This has led to operators finding other technologies, particularly one known as Wap-push, to get multimedia to their customers. But when networks do find a good way to get multimedia to their customers, the results can be dramatic. Israeli technology firm Celltick has found a way to broadcast data across phone networks in a way that does not overwhelm existing bandwidth. One of the first firms to use the Celltick service is Hutch India, the largest mobile firm in the country. The broadcast system gets multimedia to customers via a rolling menu far faster than would be possible with other systems. While not multimedia messaging, such a system gets people used to seeing their phones as a device that can handle all different types of content. As a result 40% of the subscribers to the Hutch Alive, which uses Celltick's broadcast technology, regularly click for more pictures, sounds and images from the operator. \"Operators really need to start utilising this tool to reach their customers,\" said Yaron Toren, spokesman for Celltick. Until then, multimedia will be a message that is not getting through.\n", "llama3.2:1b": ["Mobile phone cameras and colour screens are popular but people do not use them to send multimedia messages such as pictures, sounds, and video clips.", "The numbers of camera phones in the UK have doubled during this period, despite an increase in sales between July and September 2004.", "More than half of British camera phone users have never sent a multimedia message, despite having access to the service.", "People are not sending multimedia messages due to lack of understanding or knowledge, with 29% of those questioned being technophobes who do not want to use new technology.", "Operators cap the number of MMS messages on their networks to prevent overwhelming systems and risk causing swamping."], "llama3.2:3b": ["Mobile phones with cameras and color screens are popular, but few consumers use them to send multimedia messages such as pictures, audio, and video clips.", "According to analysts, 36% of British camera phone users have never sent an MMS, despite the growth in camera phones.", "The problem is educating people on how to send these messages using their handsets, with many feeling technophobic or unsure about interoperability issues.", "Operators are limited by data traffic capacities and cap the number of messages that can be circulated at any one time, but some firms have found alternative technologies such as Wap-push to broadcast multimedia content more efficiently."], "gemma2:2b": ["Mobile phone cameras are popular but users are hesitant to send multimedia messages like photos, sounds, and video.", "This is partly due to complexity of interface, lack of interoperability across networks, and technical constraints.", "Some operators limit the number of MMS messages to avoid network overload, leading them to explore alternative technologies like Wap-push.", "However, these alternatives need improvement to offer a smoother user experience and cater to diverse content delivery needs.", "A promising technology, Celltick's broadcast system, allows for efficient multimedia delivery with minimal bandwidth consumption, increasing customer engagement with multimedia content."], "qwen2.5:0.5b": ["Mobile phones are becoming popular among consumers, with 167 million handsets sold between July and September 2004.", "However, fewer than half take and send multimedia messages (MMS).", "The problem is educational, requiring simplified interfaces for users to understand how to send multimedia messages using their phone cameras.", "Mobile network users are not knowledgeable enough about MMS technology, leading them to avoid it out of fear of swamping the system with too many messages.", "To address this issue, operators have found other ways to get multimedia services into customers' phones, such as Wap-push or broadcast technology.", "While not a traditional mobile messaging service, it's gaining popularity among cell phone users and is expected to play an increasing role in the future."], "qwen2.5:1.5b": ["Mobile multimedia adoption slow despite increased phone sales; many users unfamiliar with sending MMS messages due to lack of knowledge and technical barriers such as interoperability issues and operator restrictions on message volume."], "qwen2.5:3b": ["Mobile phones with cameras and color screens are widely popular, leading to a significant increase in phone sales in Q3 2004.", "Despite this, users are slow to adopt multimedia services like sending pictures, audio, and video clips.", "Only 36% of British camera phone users have sent MMS messages, up from 7% in 2003.", "Operators struggle with educating customers on how to use these features effectively and simplifying interfaces for non-technical users.", "Technical limitations such as limited data traffic capacity on second-generation networks also hinder the adoption of multimedia services.", "Companies like Celltick address this by using broadcast systems that do not overload existing bandwidth, making multimedia content more accessible and thus increasing user engagement."], "opencoder:1.5b": ["Mobile multimedia slow to catch on\n\nThere is no doubt that mobile phones sporting cameras and colour screens are hugely popular.", "Consumers swapping old phones for slinkier, dinkier versions are thought to be responsible for a 26% increase in the number of phones sold during the third quarter of 2004, according to analysts Gartner More than 167 million handsets were sold between July and September 2004, a period that, according to Gartner analyst Carolina Milanesi is \"seldom strong\".", "But although consumers have mobiles that can take and send snaps, sounds and video clips few, so far, are taking the chance to do so.", "In fact, the numbers of people not taking and sending pictures, audio and video is growing.", "Figures gathered by Continental Research shows that 36% of British camera phone users have never sent a multimedia message (MMS), up from 7% in 2003.", "This is despite the fact that, during the same period, the numbers of camera phones in the UK more than doubled to 7.5 million.", "Getting mobile phone users to send multimedia messages is really important for operators keen to squeeze more cash out of their customers and offset the cost of subsidising the handsets people are buying.", "The problem they face, said Shailendra Jain, head of MMS firm Adamind, is educating people in how to send the multimedia messages using their funky handsets.", "\"Also,\" he said, \"they have to simplify the interface so its not rocket science in terms of someone understanding it.\"", "Research bears out the suspicion that people are not sending multimedia messages because they do not know how to.", "According to Continental Research, 29% of the people it questioned said they were technophobes that tended to shy away from innovation.", "Only 11% regarded themselves as technically savvy enough to send a picture or video message.", "The fact that multimedia services are not interoperable across networks and phones only adds to people's reluctance to start sending them, he said.", "\"They ask themselves: 'If I'm streaming video from one handset to another will it work?'\"", "he said.", "\"There's a lot of user apprehension about that.\"", "There are other deeper technical reasons why multimedia messages are not being pushed as strongly as they might.", "Andrew Bud, executive chairman of messaging firm Mblox, said mobile phone operators cap the number of messages that can be circulating at any one time for fear of overwhelming the system.", "\"The rate we can send MMS into the mobile network is fairly constant,\" he said.", "The reason for this is that there are finite capacities for data traffic on the second generation networks that currently have the most users.", "No-one wants to take the risk of swamping these relatively narrow channels so the number of MMS messages is capped, he said.", "This has led to operators finding other technologies, particularly one known as Wap-push, to get multimedia to their customers.", "But when networks do find a good way to get multimedia to their customers, the results can be dramatic.", "Israeli technology firm Celltick has found a way to broadcast data across phone networks in a way that does not overwhelm existing bandwidth.", "One of the first firms to use the Celltick service is Hutch India, the largest mobile firm in the country.", "The broadcast system gets multimedia to customers via a rolling menu far faster than would be possible with other systems.", "While not multimedia messaging, such a system gets people used to seeing their phones as a device that can handle all different types of content.", "As a result 40% of the subscribers to the Hutch Alive, which uses Celltick's broadcast technology, regularly click for more pictures, sounds and images from the operator.", "\"Operators really need to start utilising this tool to reach their customers,\" said Yaron Toren, spokesman for Celltick.", "Until then, multimedia will be a message that is not getting through."], "smollm:1.7b": ["The summary above captures the main ideas of the original text:\n\n1.", "Mobile phones with cameras and color screens are popular among consumers.", "2.", "There is no doubt that mobile phones sporting cameras and colour screens are hugely popular.", "3.", "Consumers swapping old phones for slimmer, dinkier versions are thought to be responsible for a 26% increase in the number of phones sold during the third quarter of 2004.", "4.", "However, despite this growth, there is no evidence that consumers have taken and sent pictures, audio and video clips using their mobile phones.", "5.", "The numbers of people not taking and sending pictures, audio and video messages are growing.", "6.", "There are other deeper technical reasons why multimedia messages are not being pushed as strongly as they might be.", "7.", "Operators are finding other technologies to get multimedia to their customers.", "8.", "One of the first firms to use Celltick's broadcast technology is Hutch India, the largest mobile firm in the country.", "9.", "The rolling menu gets multimedia to customers via a faster way than would be possible with other systems.", "10.", "Until then, multimedia will be a message that is not getting through."], "deepseek-r1:1.5b": ["Mobile phones with cameras and color screens are widely popular among consumers due to their features, but they haven’t been as effective in enabling the use of multimedia messaging like images, sounds, or videos.", "Despite a 26% increase in sold mobile phones during Q3 2004, users remain hesitant to engage with these capabilities.", "However, despite this, only 36% of British users have never sent a MMS (MultiMedia Message System), up from 7% last year.", "Despite increased mobile phone usage by 167 million in the same period, people are still resistant to initiating or sending multimedia messages.", "The technical challenges include network limitations and interoperability issues, which prevent seamless transmission of multimedia content across different networks.", "Operators face the risk of overwhelmed systems when handling multiple MMS messages simultaneously.", "Additionally, users are often deterred by fear of overloading their devices with tasks, leading to a lack of engagement with these features.", "To overcome these barriers, companies like Adamind (MMS firm) and Celltick have introduced innovative solutions, such as Wap-push, which allows broadcasting multimedia content without network congestion.", "Operators like Hutch India are transitioning to Celltick's broadcasting technology, enabling faster access to multimedia features via rolling menus.", "This shift is helping subscribers like their customers view photos and more frequently, even though traditional applications like Instagram aren’t fully embracing these advanced methods yet.", "Operators must start leveraging these technologies to capture traffic and deliver higher-quality multimedia content, as the current system remains ineffective for most users."], "tinyllama:1.1b": ["The article discusses the slow adoption of mobile phone cameras and color screens compared to consumers' desire for multimedia messages.", "The author concludes that consumer demand for multimedia messaging is growing, with 36% of people in the UK having never sent a message or video clip, despite a doubling of camera phone ownership between 2003 and 2004.", "Despite this, operators struggle to send multimedia messages due to technical reasons such as limited bandwidth and operator capability.", "Meanwhile, Celltick's broadcasting system is gaining popularity among mobile phone users in India."], "tinydolphin:1.1b": [" The article discusses the slow adoption of mobile multimedia services by users, citing various reasons for this phenomenon, such as users' technophobia and concerns about sending multimedia messages over networks with limited bandwidth.", "According to Continental Research, only 11% of people surveyed understood how to send multimedia messages using their funky handsets.", "Shailendra Jain, CEO of Adamind MMS Services, highlights that it is not just the complexity of sending multimedia messages but also the reluctance of users to start doing so due to technophobia.", "He explains that technological advancements in mobile phones have been limited and have only added incremental improvements over existing systems.", "Continental Research indicates that only 29% of people surveyed considered themselves as technically savvy, which might contribute to the delay in adopting multimedia services by users.", "The author questions why it is taking longer than expected for mobile phone users to send multimedia messages due to their reluctance to get used to these new features.", "The author raises concerns about user apprehension regarding sending multimedia messages over networks with limited bandwidth and emphasizes the need for operators to utilize innovative technologies such as Wap-push to break through this communication barrier.", "The author highlights CelloTick's Broadcast Service, developed by Israeli technology firm Celltick, as an example of a solution that could potentially speed up multimedia messaging delivery by eliminating the overwhelming effect of broadcasting multiple pieces of content to subscribers."], "phi:2.7b": [" Mobile phones with cameras and screens are popular but people have not been taking advantage of the multimedia capabilities to take and send pictures, sounds or video clips yet.", "In fact, according to Continental Research, 36% of British camera phone users have never sent an MMS, up from 7% in 2003.", "This is despite a significant increase in the number of cameras on mobile phones.", "Mobile operators need people to use multimedia services to make more money from customers and offset the cost of subsidizing handsets.", "The problem they face is that people do not know how to send these messages or there are technical issues with interoperability between networks and phones.", "Additionally, mobile phone operators often cap the number of MMS messages in their systems to prevent overloads.", "While some companies have found ways to get multimedia on phones more effectively using Wap-push technology, they still face difficulties with bandwidth limitations and user apprehension about sending multimedia messages.", "Celltick has developed a broadcast system that can push data across phone networks without overwhelming them.", "This technology is being used by Hutch India, the largest mobile firm in the country, which has seen a 40% increase in subscribers using its service when they have access to multimedia content."], "orca-mini:3b": [" Mobile phones with cameras and color screens are popular among consumers, but few take advantage of the ability to send multimedia messages.", "Despite increased usage, many people remain technophobic or lack technical expertise to send MMS.", "Operators face challenges in making MMS services interoperable across networks and phones, as MBLX's Mr.", "Bud explains.", "The rolling menu system used by Hutch India and other operators, via Celltick's broadcast technology, is an alternative way to distribute multimedia content to customers.", "However, it remains only a niche solution and can be expensive for operators to implement."], "hermes3:3b": ["People not sending mobile multimedia messages, despite having camera phones; main reasons include user apprehension due to technical limitations (interoperability and data traffic capacity), and lack of education on how to send MMS."], "stablelm-zephyr:3b": ["Mobile phones with cameras and color screens are popular, but people aren't using mobile multimedia as much.", "Only 36% of British camera phone users send multimedia messages (MMS), which is important for mobile operators because it helps them make money from customers.", "The main reason people don't send multimedia messages is that they don't know how to do it, and some people are technophobic.", "There are also limitations in the number of messages that can be sent at once due to data traffic on second generation networks.", "Mobile operators have found alternative ways to deliver multimedia content, like Wap-push or using technology like Celltick's broadcast system."], "chatgpt-4o-latest": ["Mobile phones with cameras and color screens are popular, driving a 26% increase in handset sales in Q3 2004.", "However, few users send multimedia messages (MMS), with 36% of British camera phone owners never having sent one, up from 7% in 2003.", "Operators struggle to encourage MMS use due to user confusion, complex interfaces, and lack of interoperability across networks.", "Many users are technophobic or unsure if messages will work.", "Additionally, mobile networks cap MMS traffic to avoid overwhelming their systems, limiting its growth.", "Some operators are turning to alternative technologies like Wap-push and broadcast systems, such as Celltick’s service used by Hutch India, which successfully engages users with multimedia content.", "Until operators improve accessibility and usability, MMS adoption will remain slow."], "stablelm2:1.6b": ["Mobile multimedia is not yet widely adopted due to users' lack of familiarity with sending multimedia messages and operators' concern about overwhelming the system's capacity.", "While over 1 million mobile phones were sold in Q4 2003, a significant percentage of camera phone users have never sent a multimedia message (MMS) despite camera phone sales growing by double in the UK during this period.", "Operators cap the number of messages circulating at any one time due to finite capacities for data traffic on second-generation networks.", "A successful technology to broadcast multimedia across phone networks is Wap-push, pioneered by Israeli firm Celltick with a service adopted by Hutch India.", "This system enables subscribers to regularly click for more pictures, sounds, and images from the operator, making their phones handle all kinds of content effectively."], "granite3.1-dense:2b": ["Despite the growing popularity of mobile phones with cameras and color screens, consumers are slow to adopt mobile multimedia features such as sending pictures, audio, and video.", "According to Gartner, 167 million handsets were sold in Q3 2004, a figure that, while significant, indicates stagnant growth compared to previous periods.", "Continental Research found that 36% of British camera phone users had never sent an MMS, up from 7% in 2003.", "This reluctance is attributed to several factors:\n\n1.", "Lack of awareness and ease-of-use: Many people are technophobes or lack technical knowledge, making it difficult for them to send multimedia messages.", "2.", "Interoperability concerns: Users worry about the compatibility between different networks and phones when transmitting MMS.", "3.", "Operator limitations: To prevent network overload, operators cap the number of active MMS, which restricts their distribution.", "This has led companies like Celltick to develop innovative broadcast systems that efficiently deliver content without overwhelming existing bandwidth.", "4.", "Demonstration impact: Operators need to encourage customers to see their phones as versatile devices capable of handling various types of content, which could boost MMS usage.", "The potential for mobile multimedia to engage users and generate revenue remains untapped due to these challenges.", "However, when operators successfully implement broadcast technologies like Celltick's service, they can significantly improve customer engagement with their networks."]}