{"raw_text": "Microsoft takes on desktop search\n \n Microsoft has entered the desktop search fray, releasing a test version of its tool to find documents, e-mails and other files on a PC hard drive.\n \n The beta program only works on PCs running Windows XP or Windows 2000. The desktop search market is becoming increasingly crowded with firms touting programs that help people find files. Search giant Google launched its desktop search tool in October, while Yahoo is planning to release similar software in January.\n \n \"Our ambition for search is to provide the ultimate information tool that can find anything you're looking for,\" said Yusuf Mehdi, corporate vice president at Microsoft's MSN internet division. Microsoft's program can be used as a toolbar on the Windows desktop, the Internet Explorer browser and within the Outlook e-mail program. The software giant is coming late to the desktop search arena, competing with a large number of rivals. Google has already released a desktop tool. Yahoo is planning to get into the game in January and AOL is expected to offer desktop searching early next year. Small firms such as Blinkx, Copernic, Enfish X1 Technologies and X-Friend offer tools that catalogue the huge amounts of information that people increasingly store on their desktop or home computer. Apple will release a similar search system for its computers called Spotlight that is due to be released with the Tiger operating system.\n", "llama3.2:1b": ["Microsoft releases test version of desktop search tool, which only works on PCs running Windows XP or 2000.", "The software aims to provide \"the ultimate information tool\" and can be used as a toolbar, browser extension, or integrated into email program Outlook.", "Microsoft enters the market late, competing with Google's already released desktop search tool and other rival programs such as Yahoo's and AOL's plans for similar products."], "llama3.2:3b": ["Microsoft has released a beta version of its desktop search tool, which allows users to find documents and files on their PC hard drive.", "The software can be used as a toolbar or within popular programs like Outlook and Internet Explorer.", "Microsoft's entry into the market competes with Google, Yahoo, AOL, Blinkx, Copernic, Enfish X1 Technologies, and Apple's upcoming Spotlight system."], "gemma2:2b": ["Microsoft has launched a beta version of its desktop search tool, aiming to become the ultimate information tool.", "The software competes with existing programs like Google and Yahoo's upcoming releases."], "qwen2.5:0.5b": ["Microsoft releases a desktop search tool to help users find documents, e-mails and other files on PCs running Windows XP or Windows 2000.", "While some competitors have already launched desktop search programs, Google's beta program is still in test mode for PC Windows systems.", "Yahoo, meanwhile, has announced its desktop search tool for January.", "The market for desktop search tools is growing rapidly, with large firms like Google and Yahoo competing with smaller players like AOL.", "Some small businesses are creating their own tools to catalogue information on their computers, such as Blinkx, Copernic, X-Friend, X-View and X-Vision."], "qwen2.5:1.5b": ["Microsoft enters the desktop search market with an XP/2000-compatible beta version of its tool, competing against rivals including Google and Yahoo.", "Microsoft aims for a comprehensive information tool across Windows, Internet Explorer, Outlook, toolbar, browser, and e-mail programs.", "Competitors include Blinkx, Copernic, Enfish X1 Technologies, X-Friend, Apple's Spotlight feature with Tiger OS, and small firms offering search tools."], "qwen2.5:3b": ["Microsoft releases a test version of its desktop search tool, designed to find documents, emails, and other files stored on PC hard drives.", "This comes in response to an increasingly crowded market dominated by firms like Google and Yahoo offering similar programs.", "Microsoft's tool can be accessed as a toolbar on Windows desktop, Internet Explorer browser, and Outlook email program.", "Despite being late to the market, competitors include search giants such as Google with its desktop search tool and planned software from Yahoo and AOL.", "Smaller companies also offer desktop searching tools, while Apple is set to release Spotlight, a similar feature for its operating system Tiger."], "opencoder:1.5b": ["Microsoft takes on desktop search.", "The beta program only works on PCs running Windows XP or Windows 2k.", "The desktop search market is becoming increasingly crowded with firms touting programs that help people find files.", "Search giant Google launched its desktop search tool in October, while Yahoo is planning to release similar software in January.", "\"Our ambition for search is to provide the ultimate information tool that can find anything you're looking for,\" said Yusuf Mehdi, corporate vice president at Microsoft's MSN internet division.", "The software giant is coming late to the desktop search arena, competing with a large number of rivals.", "Google has already released a desktop tool.", "Yahoo is planning to get into the game in January and AOL is expected to offer desktop searching early next year.", "Small firms such as Blinkx, Copernic, Enfish X1 Technologies and X-Friend offer tools that catalogue the huge amounts of information that people increasingly store on their desktop or home computer.", "Apple will release a similar search system for its computers called Spotlight that is due to be released with the Tiger operating system."], "smollm:1.7b": ["Microsoft has entered the desktop search fray, releasing a test version of its tool to find documents, e-mails and other files on a PC hard drive.", "The beta program only works on PCs running Windows XP or Windows 2000.", "The desktop search market is becoming increasingly crowded with firms touting programs that help people find files.", "Search giant Google launched its desktop search tool in October, while Yahoo is planning to release similar software in January.", "Microsoft's ambition for search is to provide the ultimate information tool that can find anything you're looking for.", "Our ambition for search is to provide the ultimate information tool that can find anything you're looking for.", "The company has already released a desktop tool, but it only works on PCs running Windows XP or Windows 2000.", "Google has already released similar software in October, while Yahoo is planning to release its own desktop search tool in January.", "Small firms such as Blinkx, Copernic, Enfish X1 Technologies and X-Friend offer tools that catalogue the huge amounts of information that people increasingly store on their desktop or home computer.", "Apple will release a similar search system for its computers called Spotlight that is due to be released with the Tiger operating system."], "deepseek-r1:1.5b": ["Microsoft has released a beta version of its desktop search tool targeting PCs running Windows XP or 2000.", "The program allows users to find documents, emails, and other files on PC hard drives.", "Competitors like Google and Yahoo are also in the race for desktop search, with Google starting early in October and Yahoo planning it for January.", "Microsoft aims to offer an ultimate information tool that can locate anything, using its software as a toolbar or within Outlook.", "They're competing late, alongside firms like Blinkx, Copernic, Enfish X1 Technologies, and X-Friend, which provide desktop cataloguing services.", "Apple is set to release Spotlight on the Tiger OS in response."], "tinyllama:1.1b": ["Microsoft has entered the desktop seaocrh arena by releasing a test version of their tool to search for documents, e-mails, and other files on PC hard drives.", "The beta program is limited to running Windows XP or Windows 2000 machines but the desktop seaosr market is becoming increasingly competitive with firms such as Google, Yahoo, Blinkx, Coperniq, Enfish X1 Technologies, and X-Friend offering similar tools.", "Apple's Spootlight system for computers is expected to launch with the new operating system next year."], "tinydolphin:1.1b": [" Microsoft has entered the desk search fray by releasing a test version of their software, allowing users to find documents, emails, and other files on their PC hard drive.", "This new product will only work for Windows XP or Windows 2000 systems.", "The beta program offers desktop search functionality through a toolbar that can be placed within the Microsoft Internet Explorer browser, the Outlook e-mail program, and as a Microsoft Office add-in for Word and Excel.", "The software's ambition is to provide an ultimate information tool by searching across all files on a user's desktop, including files stored in third-party applications or repositories like Dropbox and Google Drive.", "Microsoft's entry into the desk search arena comes late to a crowded field of rival products such as Google's Chrome browser, Yahoo's Zune search tool, and AOL's desktop searching capabilities.", "However, with a large number of rivals in this space, it is expected that both small and large software companies will offer solutions to meet the growing demand for efficient file management."], "phi:2.7b": [" Microsoft has entered the desktop search market by releasing a beta program in January that can find documents, emails and files on Windows XP or 2000-based PCs.", "The company aims to provide the ultimate information tool for users while competing against Google, Yahoo, AOL, and other small firms offering similar tools.", "Apple is also set to release its own desktop searching system with the Tiger operating system."], "orca-mini:3b": [" Microsoft has launched a beta program for its desktop search tool, which can find files on a PC hard drive.", "The tool can be used as a toolbar, Internet Explorer browser, and Outlook e-mail program.", "Google and Yahoo are also planning to release similar software.", "There are many competitors in the desktop search market, including AOL, Blinkx, Copernic, Enfish X1 Technologies, and X-Friend."], "hermes3:3b": ["Microsoft enters desktop search market, competing with Google, Yahoo, AOL etc."], "stablelm-zephyr:3b": ["Microsoft released a beta version of its tool for finding documents, emails, and files on PCs running Windows XP or Windows 2000, entering the crowded desktop search market.", "Competitors include Google, Yahoo, AOL, Blinkx, Copernic, Enfish X1 Technologies, and X-Friend.", "Microsoft's program can be used as a toolbar, browser extension, or within Outlook, and Apple's Spotlight search system will be released with the Tiger operating system."], "chatgpt-4o-latest": ["Microsoft has launched a beta version of its desktop search tool for Windows XP and 2000, entering a competitive market where Google, Yahoo, and AOL are also developing similar software.", "The tool integrates with Windows, Internet Explorer, and Outlook to help users find documents, emails, and files.", "Google has already released its desktop search, Yahoo plans to launch one in January, and Apple is introducing Spotlight with its Tiger OS.", "Smaller firms like Blinkx, Copernic, and X1 Technologies also offer similar tools."], "stablelm2:1.6b": ["Microsoft entered the crowded desktop search market, releasing a beta tool to find documents, e-mails, and files on a PC hard drive.", "The beta program requires Windows XP or Windows 10; Google launched its desktop search tool in October, while Yahoo plans for release in January.", "Microsoft aims to provide the ultimate information tool that can find anything you're looking for.", "Competing with rivals like Google, Yahoo, AOL, Blinkx, Copernic, Enfish X1 Technologies, and X- Friend, Microsoft's program is available as a toolbar on Windows, Internet Explorer, and Outlook.", "Apple's upcoming Spotlight system for its Tiger operating system also aims to offer similar search capabilities for Mac users."], "granite3.1-dense:2b": ["Microsoft has introduced a beta version of its desktop search tool, targeting PCs running Windows XP or 2000.", "This entrance into the growing desktop search market follows competitors like Google, Yahoo, and several smaller firms, such as Blinkx, Copernic, Enfish X1 Technologies, X-Friend, and Apple (with Spotlight).", "Microsoft's tool can function as a desktop toolbar, within Internet Explorer, and in Outlook for file searches.", "The company aims to provide an all-encompassing information tool capable of locating any desired content on a user's device."]}