{"raw_text": "Hollywood to sue net film pirates\n \n The US movie industry has launched legal action to sue people who facilitate illegal film downloading.\n \n The Motion Picture Association of America wants to stop people using the program BitTorrent to swap movies. The industry is targeting people who run websites which provide information and internet links to movies which have been copied or filmed in cinemas. More than 100 server operators have been targeted in the actions launched in the US and UK, the MPAA added. The suits were filed against users of the file-sharing programs BitTorrent, eDonkey and DirectConnect in the United States, United Kingdom, France, Finland and the Netherlands, the MPAA said.\n \n BitTorrent users can download movies by following a link to files which are found on websites called trackers. Unlike most peer-to-peer programs BitTorrent works by sharing a file, which could be anything from a legitimate digital photo to a copied movie, among multiple users at the same time. The movie industry hopes that suing the people who run the trackers will cut BitTorrent users off from illegal movies at source. Last month major film studios started legal action against 200 individuals who were swapping films online. The growth in broadband has made it quicker for people to download movies and the industry fears that if it does not take action now, it could suffer the same downturn as the music industry.\n", "llama3.2:1b": ["The US movie industry is suing those who facilitate illegal film downloading through BitTorrent and other file-sharing programs.", "Over 100 server operators in several countries (US, UK, France, Finland, Netherlands) have been targeted due to their websites providing information and links to copied or filmed movies in cinemas.", "The motion picture association hopes the lawsuit will stop people from swapping movies at source."], "llama3.2:3b": ["The US movie industry, represented by the Motion Picture Association of America, is suing over 100 server operators who facilitate illegal film downloading through programs such as BitTorrent.", "The suits target users of file-sharing programs in the US and UK, with the aim of cutting off BitTorrent users from illegal movies at source."], "gemma2:2b": ["The Motion Picture Association of America is suing website operators who facilitate illegal movie downloads on BitTorrent.", "This lawsuit targets over 100 server operators in the US and UK, hoping to cut off access to pirated films by targeting those providing links to illegally shared movies."], "qwen2.5:0.5b": ["Hollywood plans a lawsuit against users of BitTorrent file-sharing software.", "They want to make sure users can't access free movies online illegally.", "The MPAA, Hollywood's movie industry association, has filed suits against 200 people who are copying and distributing movies.", "These people were involved in running BitTorrent trackers that made it easier for illegal downloaders to access the movies they wanted."], "qwen2.5:1.5b": ["The Motion Picture Association of America (MPAA) is suing BitTorrent users to stop them from sharing illegally downloaded movies on websites they run or promote.", "This follows a legal campaign launched against 200 individuals who were previously found guilty of swapping films online.", "The MPAA hopes the suit will prevent access to illegal movies at their source, as well as address recent advancements in broadband technology that allow faster movie downloads."], "qwen2.5:3b": ["Hollywood sues net film pirates; targets BitTorrent users and their trackers sites across US, UK, France, Finland, and Netherlands.", "The Motion Picture Association of America (MPAA) aims to stop illegal movie downloading facilitated by BitTorrent and related programs like eDonkey and DirectConnect.", "Suits are filed against over 100 server operators and focus on users of file-sharing networks for movies copied from cinemas or illegally filmed.", "The move follows earlier legal actions against individuals swapping films online, with the industry fearing a similar downturn to the music industry if it fails to address illegal downloads now."], "opencoder:1.5b": ["\"Hollywood is being sued by net film pirates.\"", "The US movie industry has launched legal actions to pursue lawsuits against individuals who use illegal torrenting platforms.", "The Motion Picture Association of America wants to stop users from downloading copyrighted movies using BitTorrent.", "The industry's goal is to stop people from using websites providing information and internet links for movies that have been copied or made in cinemas.", "More than 100 servers are targeted, the MPAA added.", "The lawsuits were filed against users who use BitTorrent, eDonkey and DirectConnect for downloading movies.", "In the United States, Britain, France, Finland, and the Netherlands, the lawsuits were filed against individuals who were torrenting films.", "Despite the industry's growing popularity, it fears that if no action is taken now, it could suffer an event similar to a music store which aims to sell illegal copies of movies."], "smollm:1.7b": ["The US movie industry is launching legal actions against people who facilitate illegal film downloading through BitTorrent file-sharing programs.", "The lawsuits aim to stop users from providing information about movies which have been copied or filmed in cinemas and are available online, making it easier for people to download them illegally.", "More than 100 server operators have been targeted by the industry in the US and UK, the MPAA added.", "The suits were filed against users of BitTorrent, eDonkey and DirectConnect file-sharing programs in the United States, United Kingdom, Finland, France and the Netherlands.", "The lawsuits hope that suing the people who run the trackers will cut BitTorrent users off from illegal movies at source.", "Last month major film studios started legal action against 200 individuals who were swapping films online.", "The growth in broadband has made it quicker for people to download movies and the industry fears that if it does not take action now, it could suffer the same downturn as the music industry."], "deepseek-r1:1.5b": ["The US motion picture association seeks legal action to block individuals who facilitate illegal movie downloading via BitTorrent.", "Targets include eDonkey, DirectConnect, and BitTorrent users in the U.S., UK, France, Finland, and Netherlands.", "MPAA aims to stop these users from sharing files on trackers, potentially stopping access to illegal movies.", "Last month, major film studios started legal action against 200 individuals swapping films online, citing broader internet growth as a cause for concern similar to the music industry's struggles."], "tinyllama:1.1b": ["Hollywood aims to sue internet users who facilitate film piracy by using BitTorrent, which allows users to download movies from websites containing links to files.", "The MPAA has launched legal actions against 130 server operators in the US and UK, as well as France, Finland, and the Netherlands.", "BitTorrent users can download movie files through a link shared among multiple users simultaneously, making it difficult for the film industry to cut these users off from pirated movies.", "However, if Hollywood takes action now, it could suffer the same fate as the music industry due to its growth in broadband connectivity."], "tinydolphin:1.1b": [" Hollywood is suing net film pirates.", "This action comes after the movie industry discovered that users were sharing movies on file-sharing programs such as BitTorrent.", "The MPAA (Motion Picture Association of America) launched legal actions against a total of 100 server operators in the US and UK, targeting those who host information or links to movies being copied or filmed in cinemas.", "The suits were filed against users of the file-sharing programs BitTorrent, eDonkey, and DirectConnect, and are aimed at stopping them from facilitating illegal downloading."], "phi:2.7b": [" The US movie industry is suing people who facilitate illegal film downloading through BitTorrent, a program used by users to swap movies.", "The Motion Picture Association of America has targeted website operators and more than 100 server operators in the US, UK, France, Finland and the Netherlands for the actions launched last month.", "The movie industry hopes that by suing those who run the trackers, they can cut off BitTorrent users from illegal movies at source before suffering a similar downturn as the music industry."], "orca-mini:3b": [" Hollywood is suing net film pirates by targeting those who run websites providing information and internet links to movies which have been copied or filmed in cinemas.", "More than 100 server operators are being sued in the US, UK, France, Finland, and the Netherlands.", "The suits were filed against users of file-sharing programs BitTorrent, eDonkey, and DirectConnect.", "BitTorrent users can download movies by following a link to files found on websites called trackers.", "This method of sharing files works by sharing a single file, which could be anything from a legitimate digital photo to a copied movie among multiple users at the same time.", "The MPAA hopes that suing the people who run the trackers will cut BitTorrent users off from illegal movies at source.", "Last month, major film studios started legal action against 200 individuals swapping films online.", "The growth in broadband has made it quicker for people to download movies, and the industry fears that if it does not take action now, it could suffer the same downturn as the music industry."], "hermes3:3b": ["US movie industry suing net film pirates, targeting BitTorrent users & website operators for illegal downloads."], "stablelm-zephyr:3b": ["The US movie industry is suing over 100 server operators in the US, UK, France, Finland, and Netherlands for facilitating illegal film downloading using BitTorrent and other file-sharing programs.", "The Motion Picture Association of America (MPAA) aims to stop people from using websites that provide information and internet links to movies copied or filmed in cinemas.", "This action comes after major film studios started legal action against 200 individuals swapping films online, as the growth in broadband has made it quicker for people to download movies.", "The industry fears a similar downfall as the music industry if it does not take action now."], "chatgpt-4o-latest": ["The US movie industry, through the Motion Picture Association of America (MPAA), has launched legal action against individuals facilitating illegal film downloads via file-sharing programs like BitTorrent, eDonkey, and DirectConnect.", "The lawsuits target operators of websites that provide links to pirated movies, with actions filed in the US, UK, France, Finland, and the Netherlands.", "BitTorrent allows users to download files from multiple sources simultaneously, and the MPAA aims to disrupt piracy by shutting down these tracker websites.", "The industry fears that the rise of broadband could lead to losses similar to those experienced by the music industry and has already taken legal action against 200 individuals for online film swapping."], "stablelm2:1.6b": ["US movie industry sues internet pirates to stop film downloads using BitTorrent, targeting website operators and file-sharing program users worldwide.", "The goal is to cut off access to illicit movies from their source.", "This follows legal actions taken by major studios against online file-sharers last month.", "The industry fears losing revenue like the music industry did due to rapid growth in internet usage and faster downloads."], "granite3.1-dense:2b": ["The Motion Picture Association of America (MPAA) is taking legal action against individuals who operate websites facilitating unauthorized movie downloads via BitTorrent, eDonkey, and DirectConnect file-sharing programs in the US, UK, France, Finland, and the Netherlands.", "Over 100 server operators have been targeted.", "The MPAA aims to disrupt these operations to prevent users from accessing illegal cinema copies through websites called trackers.", "This move follows a recent lawsuit against 200 online film swappers by major film studios, driven by concerns over potential market impact similar to the music industry's downturn due to piracy."]}