{"raw_text": "Microsoft sets sights on spyware\n \n Windows users could soon be paying Microsoft to keep PCs free of spyware.\n \n Following the takeover of anti-spyware firm Giant, Microsoft said it would soon release a toolkit that strips machines of the irritating programs. Although initially free, Microsoft has not ruled out charging people who want to keep this toolkit up to date. Surveys show that almost every Windows PC is infested with spyware programs that do everything from bombard users with adverts to steal login data. Microsoft said that a beta version of the toolkit to clean up Windows machines should be available within 30 days.\n \n Designed for PCs running Windows 2000 and XP, the utility will clean out spyware programs, constantly monitor what happens on a PC and will be regularly updated to catch the latest variants. Before now many of Microsoft's other security boosting programs, such as the firewall in Windows XP, have been given away free. But Mike Nash, vice president in Microsoft's security business unit, said it was still working out pricing and licensing issues. Charging for future versions has not been discounted, he said. \"We'll come up with a plan and roll that out,\" he said. The plan could turn out to be a lucrative one for Microsoft. A recent survey by Earthlink and Webroot found that 90% of PCs are infested with the surreptitious software and that, on average, each one is harbouring 28 separate spyware programs. Currently users wanting protection from spyware have turned to free programs such as Spybot and Ad-Aware. Spyware comes in many forms and at its most benign exploits lazy browsing habits to install itself and subject users to unwanted adverts. Other forms hijack net browser settings to force people to view pages they would otherwise never visit. At its most malign, spyware watches everything that people do with their PC and steals login information and other personal data. Microsoft's announcement about spyware comes after it bought small New York software firm Giant Company Software. Terms of the acquisition were not disclosed.\n", "llama3.2:1b": ["Microsoft is developing a tool to clean up spyware from Windows machines, which will be available for free or purchase later with updated versions, depending on pricing and licensing issues.", "The tool aims to remove various forms of spyware, including benign software that uses lazy browsing habits, hijacked browser settings, and malicious programs that steal login information.", "Microsoft's vice president said the plan could generate significant revenue, but no final decision has been made regarding pricing and licensing."], "llama3.2:3b": ["Microsoft plans to release a toolkit to clean spyware from Windows PCs, potentially charging users for future updates.", "A beta version is expected within 30 days, and surveys show that nearly every Windows PC has spyware programs."], "gemma2:2b": ["Microsoft plans to offer a toolkit for removing spyware from Windows PCs.", "The toolkit, initially free, could become subscription-based in the future.", "Surveys show almost every PC is infected with spyware that can cause unwanted ads, data theft, and browser hijacks.", "The company has acquired anti-spyware firm Giant Company Software to develop this toolkit."], "qwen2.5:0.5b": ["Microsoft plans to offer a utility for free that will clean out Spyware programs from Windows PCs.", "This utility will constantly monitor the PC, check what happens on the computer and update itself with new versions to catch the latest variants of spyware.", "It is still working out pricing and licensing issues, but Microsoft has said it can roll out a version soon."], "qwen2.5:1.5b": ["Microsoft plans to release a toolkit for Windows PCs to remove spyware, initially free but potentially charging for updates, following its acquisition of anti-spyware company Giant.", "The utility will clean out and monitor for spyware programs and regularly update to catch new variants.", "Surveys show 90% of PCs are infested with spyware, often targeting personal information.", "Microsoft previously offered security tools without charge, but is exploring pricing options."], "qwen2.5:3b": ["Microsoft aims to charge for a toolkit that removes spyware from Windows PCs, following its purchase of anti-spyware firm Giant.", "The free beta version of the utility cleans up and monitors PC activity, updating frequently.", "Spyware infests almost every Windows PC with programs causing unwanted adverts or stealing login data.", "Microsoft estimates 90% of users have at least 28 spyware programs on their PCs.", "Current solutions like Spybot and Ad-Aware are free.", "The move to charge for the tool could be lucrative given that nearly all Windows PCs host such software."], "opencoder:1.5b": ["Microsoft sets sights on spyware in the wake of the Windows user takeover by anti-spyware firm Giant.", "Windows users could soon be paying Microsoft to keep PCs free of spyware, with the promise of an up-to-date cleaning toolkit from Microsoft that can clean away this irritating program without ever charging for it."], "smollm:1.7b": ["Microsoft sets sights on spyware \nWindows users could soon be paying Microsoft to keep PCs free of spyware.", "Following the takeover of anti-spyware firm Giant, Microsoft said it would soon release a toolkit that strips machines of the irritating programs.", "Although initially free, Microsoft has not ruled out charging people who want to keep this toolkit up to date.", "Surveys show that almost every Windows PC is infested with spyware programs that do everything from bombard users with adverts to steal login data.", "Microsoft said that a beta version of the toolkit to clean up Windows machines should be available within 30 days.", "Designed for PCs running Windows 2000 and XP, the utility will clean out spyware programs, constantly monitor what happens on a PC and will be regularly updated to catch the latest variants.", "Before now many of Microsoft's other security boosting programs, such as the firewall in Windows XP, have been given away free.", "But Mike Nash, vice president in Microsoft's security business unit, said it was still working out pricing and licensing issues.", "Charging for future versions has not been discounted, he said.", "\"We'll come up with a plan and roll that out,\" he said.", "The plan could turn out to be lucrative for Microsoft.", "A recent survey by Earthlink and Webroot found that 90% of PCs are infested with the surreptitious software and that, on average, each one is harbouring 28 separate spyware programs.", "Currently users wanting protection from spyware have turned to free programs such as Spybot and Ad-Aware.", "Spybot comes in many forms and at its most benign, hijacks net browser settings to force people to view pages they would otherwise never visit.", "Microsoft's announcement about spyware comes after it bought small New York software firm Giant Company Software.", "Terms of the acquisition were not disclosed."], "deepseek-r1:1.5b": ["Microsoft aims to disrupt the Windows operating system by releasing a tool called the Spyware Removal Tool (SRT) to remove malicious spyware programs from PCs.", "Initially free, Microsoft has not ruled out requiring users to pay for updates.", "A beta version of SRT is expected within 30 days and will monitor and update any changes in spyware on a PC.", "Others want free tools like Spybot and Ad-Aware but have concerns about pricing and licensing.", "Surveys indicate that almost every Windows PC is infected with spyware, which could make Microsoft's plan profitable.", "A recent survey found that 90% of PCs are overrun with the surreptitious software, averaging 28 separate spyware programs per PC."], "tinyllama:1.1b": ["After taking over anti-spyware company Giant, Microsoft has announced the release of a new toolkit for cleaning up Windows machines from spyware programs that bombard users with advertisements and steal login data.", "The utility will automatically monitor what happens on PCs to find and remove these malicious software programs, constantly updating itself with the latest spyware variants.", "Microsoft has not yet ruled out charging users who want updates to keep this toolkit up-to-date.", "The plan for future versions of the toolkit could turn out to be a lucrative one, as a recent survey found that 90% of PCs are infested with spyware programs, while most people have turned to free programs like Spybot and Ad-Aware."], "tinydolphin:1.1b": [" In order to maintain the security of Windows machines, Microsoft is set to release a toolkit containing spyware-fighting tools for free.", "The new toolkit will be available within 30 days and will automatically remove spyware programs that run on computers running Windows 2000 or XP.", "This move could prove advantageous for Microsoft as it seeks to capitalize on the rising spyware problem by charging for security enhancements."], "phi:2.7b": [" Microsoft will soon release a toolkit to strip computers of spyware programs, which can be paid for in the future but are currently free.", "Surveys show that nearly every Windows PC is infested with these programs that hijack browser settings and steal personal data.", "Microsoft's anti-spyware program will constantly monitor PCs and regularly update to catch new variants.", "The company has not yet disclosed pricing or licensing issues, but may charge for future versions.", "Users can currently turn to free programs like Spybot and Ad-Aware for protection from spyware."], "orca-mini:3b": [" Microsoft plans to release a toolkit that cleans up Windows machines of spyware programs, but the company has not ruled out charging people who want to keep the toolkit updated.", "The toolkit will be free in the beginning, but Microsoft may charge for future versions.", "Surveys show that almost every Windows PC is infected with spyware programs that do everything from bombard users with ads to steal login data.", "Microsoft plans to release a toolkit to clean up spyware programs and monitor what happens on a PC.", "The toolkit will be regularly updated to catch new variants of spyware.", "Microsoft's previous security boosting programs have been given away free, but the company is still working out pricing and licensing issues for future versions.", "Users can currently protect themselves from spyware by using free programs such as Spybot and Ad-Aware."], "hermes3:3b": ["Microsoft aims spyware removal toolkit, potentially charging for updates."], "stablelm-zephyr:3b": ["Microsoft acquires anti-spyware firm Giant Company Software, announcing plans to release a toolkit that removes spyware from Windows machines.", "Initially free, the toolkit may be updated with a charge in the future.", "Surveys show almost all Windows PCs have spyware programs that steal login data and display ads.", "A beta version of the toolkit will be available within 30 days for Windows 2000 and XP.", "Microsoft's announcement comes after its vice president in the security business unit, Mike Nash, said they are working on pricing and licensing issues."], "chatgpt-4o-latest": ["Microsoft plans to release an anti-spyware toolkit following its acquisition of Giant Company Software.", "Initially free, the toolkit will remove spyware, monitor PC activity, and receive regular updates, though Microsoft has not ruled out charging for future versions.", "Designed for Windows 2000 and XP, the tool aims to combat widespread spyware infections, which affect 90% of PCs.", "Spyware ranges from displaying ads to stealing personal data.", "Microsoft is still determining pricing and licensing details, and its move could be lucrative given the high prevalence of spyware."], "stablelm2:1.6b": ["Microsoft plans to release a toolkit that removes spyware from PCs, initially free but potentially charging for updates.", "The toolkit will monitor Windows machines and be regularly updated to detect new variants, targeting PCs running Windows 7 and XP.", "This could be profitable for Microsoft since approximately 50% of PCs have spyware, often causing ads or stealing login data.", "Before this announcement, many Microsoft's other security programs were given away free."], "granite3.1-dense:2b": ["Microsoft plans to charge users for a toolkit to protect Windows PCs from spyware, following its acquisition of anti-spyware firm Giant.", "Initially free, this utility will clean infected machines (Windows 2000 and XP) of various spyware programs that display ads or steal login data.", "Microsoft aims to release the beta version within 30 days.", "A recent Earthlink and Webroot survey revealed that 90% of PCs are infested with an average of 28 spyware programs each.", "Currently, users rely on free alternatives like Spybot and Ad-Aware.", "Microsoft is still determining pricing and licensing for future updates to this toolkit, which could generate significant revenue."]}