{"raw_text": "Video phone help for deaf people\n \n Deaf people who prefer to communicate using British Sign Language (BSL) could soon be having their phone conversations relayed using webcams or videophones and an interpreter.\n \n The Video Relay Service is being piloted by the Royal National Institute for Deaf People (RNID), but the organisation says unless the service is provided at the same rate as voice calls it will be beyond most people's pockets. The RNID is urging telecoms regulator, Ofcom, to reduce the cost of the service from the current £7.00 per minute and make it the same as ordinary phone calls. The service works by putting a deaf person in visual contact with a BSL interpreter via a webcam or video phone, and the interpreter then relays the deaf person's conversation using a telephone and translates the other person's response into sign language.\n \n For many deaf people, especially those born deaf, BSL is a first and preferred means of communication.\n \n Until now, the only alternative has been to use textphones which means having to type a message and have it relayed via an operator. \"In the past, I've used textphones but they have problems,\" said Robert Currington who is taking part in the pilot. \"I communicate in BSL; my written English is not very good and it takes me longer to think in English and type my message.\" \"I sometimes find it difficult to understand the reply.\" The RNID says the UK is lagging behind other countries which are already making relay services available at the cost of an ordinary phone call. \"There are no technical or economic reasons for not providing equivalent access to services for deaf people,\" said RNID technology director, Guido Gybels. \"In the US and Australia, sign language relay services have already been made universally available at the same cost as a voice call. \"By failing to provide and fund the video relay service for sign language users, the telecommunications sector is effectively discriminating against an already disenfranchised group.\"\n \n Ofcom says it has plans to review the services that telecoms companies are obliged to provide early next year. And new technology, including the Video Relay Service, will be discussed with interested parties in the near future. But a spokesman said its powers were limited by legislation. \"Any proposals to extend existing arrangements to cover new services would be for government to consider,\" he said. Mr Currington, like many of the UK's 70,000 BSL users, will be hoping that a way can be found to make a cost-effective service available. \"The relay service makes phone conversations a pleasure,\" he said. \"I can show my emotions more easily in BSL in the same way hearing people express emotions through voice calls.\"\n", "llama3.2:1b": ["Video phone help for deaf people is being piloted by the Royal National Institute for Deaf People (RNID) to relieve costs associated with providing relay services, including webcams and videophones.", "The service would use a webcam or video phone to connect deaf individuals with BSL interpreters, who then translate conversations into sign language."], "llama3.2:3b": ["Deaf individuals who prefer British Sign Language may have their phone conversations relayed using webcams or videophones and an interpreter, with RNID urging Ofcom to reduce cost from £7.00 per minute to match ordinary calls.", "The service aims to provide equal access for deaf people in the UK, currently lagging behind countries offering similar services at a lower cost."], "gemma2:2b": ["A new video relay service using webcams or video phones, with an interpreter for British Sign Language (BSL) users, is being piloted by the RNID to help deaf people communicate.", "The cost of £7 per minute is high, and the RNID wants Ofcom to reduce it to match the cost of ordinary phone calls.", "Other countries offer similar services at no extra cost, so UK's lack of support for BSL users is argued as discriminatory."], "qwen2.5:0.5b": ["Deaf people who prefer British Sign Language (BSL) could soon have their video phone calls relayed using webcams or videophones and an interpreter, as a pilot service is being tested by the Royal National Institute for Deaf People.", "The Video Relay Service has not yet been made available at the same cost as voice calls and will be beyond most people's pockets until its service rate is reduced from £7.00 per minute to that of ordinary phone calls.", "While BSL is currently used in some parts of the UK, many deaf people prefer to communicate using written English rather than BSL.", "The Video Relay Service makes phone conversations a pleasure by allowing deaf people to show their emotions more easily through BSL, which could be useful for those who are visually impaired.", "The service works by putting a deaf person in visual contact with a BSL interpreter via webcam or video phone and the interpreter then relays the conversation using a telephone and translates the other person's response into sign language.", "For many deaf people, especially those born deaf, BSL is their preferred means of communication, which makes it an important tool for social interaction and education."], "qwen2.5:1.5b": ["Video Relay Services for deaf users using BSL will soon be provided at the same rate as voice calls, but at present the cost is £7 per minute and must be funded by charities.", "The RNID wants to reduce this from £7 to match regular phone calls.", "This service uses a webcam or video phone to connect deaf people with interpreters who translate their conversations into sign language via a telephone."], "qwen2.5:3b": ["Video phone help for deaf people is being piloted by the Royal National Institute for Deaf People (RNID) to provide communication via webcams or videophones and interpreters.", "The Video Relay Service works by putting a deaf person in visual contact with an interpreter, who then relays conversations over a telephone.", "This service is preferred by many deaf individuals, especially those born deaf, as it uses British Sign Language (BSL), unlike textphones which are slow and difficult to understand.", "The RNID advocates for reduced costs from £7.00 per minute to the same rate as regular calls, while arguing there are no technical or economic reasons not to provide this service.", "Currently, UK telecoms are lagging behind countries like the US and Australia in providing sign language relay services at no extra cost.", "Ofcom plans to review existing arrangements early next year but has limited powers to extend them."], "opencoder:1.5b": ["Video phone help for deaf people\n\nDeaf people who prefer to communicate using British Sign Language (BSL) could soon be having their phone conversations relayed using webcams or videophones and an interpreter.", "The Video Relay Service is being piloted by the Royal National Institute for Deaf People (RNID), but the organisation says unless the service is provided at the same rate as voice calls it will be beyond most people's pockets.", "RNID urges telecoms regulator, Ofcom, to reduce the cost of the service from the current £7.00 per minute and make it the same as ordinary phone calls.", "The service works by putting a deaf person in visual contact with a BSL interpreter via a webcam or video phone, and the interpreter then relays the deaf person's conversation using a telephone and translates the other person's response into sign language.", "For many deaf people, especially those born deaf, BSL is a first and preferred means of communication.", "Until now, the only alternative has been to use textphones which means having to type a message and have it relayed via an operator.", "\"In the past, I've used textphones but they have problems,\" said Robert Currington who is taking part in the pilot.", "\"I communicate in BSL; my written English is not very good and it takes me longer to think in English and type my message.\"", "\"I sometimes find it difficult to understand the reply.\"", "Ofcom says it has plans to review the services that telecoms companies are obliged to provide early next year.", "And new technology, including the Video Relay Service, will be discussed with interested parties in the near future.", "But a spokesman said its powers were limited by legislation.", "\"Any proposals to extend existing arrangements to cover new services would be for government to consider,\" he said."], "smollm:1.7b": ["The summary is concise and objective, capturing the main points of the original text while omitting any supporting details or explanations.", "The key ideas are preserved, including the importance of providing a relay service for deaf people who prefer to communicate using British Sign Language (BSL).", "The summary also highlights the need for equal access to communication services for all individuals, regardless of their language or ability."], "deepseek-r1:1.5b": ["The UK is introducing a video phone relay system for deaf individuals using British Sign Language (BSL), designed to make their conversations more accessible and enjoyable.", "The Video Relay Service, currently costing £7 per minute, will be piloted by the Royal National Institute for Deaf People.", "The service aims to match the cost of regular voice calls while providing a seamless communication experience.", "However, the RNID argues that this pricing is unfair for many users due to limited access and infrastructure in some areas.", "They urge Ofcom to review regulations ensuring similar costs.", "Meanwhile, the UK faces challenges in funding this service and is considering future tech innovations.", "Currington hopes the new system will enhance accessibility, allowing more people to engage with BSL effectively."], "tinyllama:1.1b": ["In a video call, users with British Sign Language (BSL) preferring to communicate via textphone would be able to relay their message using webcam and an interpreter, without the need for textphone service.", "The pilot project offers deaf people who have not been able to use traditional phone services a means of communication that is more accessible and cost-effective than voice calls.", "However, until Ofcom reviews existing arrangements, new technology such as video relay services will be discussed with interested parties in the near future."], "tinydolphin:1.1b": [" Video Relay Service (VRS) for deaf users in the UK is being piloted by the Royal National Institute for Deaf People (RNID).", "VRS uses webcams or video phones and interpreters to provide real-time communication between a BSL user and a hearing person, similar to voice calls.", "The service costs around £7 per minute, but the RNID is urging Ofcom, telecoms regulator, to reduce its cost to £5 per minute.", "The pilot program started in September 2019, aimed at providing an equal communication experience for deaf people who prefer using British Sign Language (BSL)."], "phi:2.7b": [" The Royal National Institute for Deaf People (RNID) is testing a new Video Relay Service that allows deaf people to have their phone conversations relayed using webcams or videophones and an interpreter.", "However, unless the service is provided at the same rate as ordinary phone calls, it will be too expensive for most people.", "The RNID is urging telecoms regulator Ofcom to reduce the cost of the service and make it available at the same rate as ordinary phone calls.", "The service works by putting a deaf person in visual contact with an interpreter through a webcam or video phone, and the interpreter relays the conversation using a telephone and translates the other person's response into sign language.", "Deaf people prefer to use British Sign Language (BSL) as their first means of communication, but until now, textphone services have been available instead.", "The RNID says the UK is lagging behind other countries that are already making relay services available at the same cost as ordinary phone calls.", "A spokesman for Ofcom said it has plans to review services provided by telecoms companies early next year and new technology will be discussed with interested parties in the near future.", "However, its powers are limited by legislation.", "The RNID is urging government to consider extending existing arrangements to cover new services like the Video Relay Service."], "orca-mini:3b": [" Video phone help for deaf people is being piloted, providing a sign language interpreter via a webcam or video phone to relay deaf people's phone conversations.", "The service could be made available at the same cost as ordinary phone calls, but is currently being petitioned by the Royal National Institute for Deaf People (RNID) for a reduced cost."], "hermes3:3b": ["Video phone service for deaf people using BSL, urges lower cost to match regular phone calls; currently £7/min, aiming for equal access as voice calls."], "stablelm-zephyr:3b": ["Deaf individuals in the UK may soon be able to have their phone conversations relayed using webcams or videophones and an interpreter, thanks to the Video Relay Service being piloted by the Royal National Institute for Deaf People (RNID).", "The RNID is urging Ofcom to reduce the cost of the service, currently £7.00 per minute, and make it the same as ordinary phone calls.", "The service works by allowing a deaf person to be in visual contact with a British Sign Language (BSL) interpreter via a webcam or video phone, with the interpreter relaying their conversation using a telephone and translating the other party's response into sign language.", "Currently, the only alternative for deaf people is textphones, which can be slower and more challenging to understand.", "The UK lags behind countries like the US and Australia that have already made relay services universally available at the cost of an ordinary phone call."], "chatgpt-4o-latest": ["Deaf people who use British Sign Language (BSL) may soon have phone conversations relayed via webcams or videophones with an interpreter through the Video Relay Service, piloted by the Royal National Institute for Deaf People (RNID).", "However, the service currently costs £7.00 per minute, making it unaffordable for many.", "The RNID is urging Ofcom to reduce the cost to match standard phone calls, as is already the case in the US and Australia.", "Currently, deaf people rely on textphones, which can be difficult for those who struggle with written English.", "The RNID argues that failing to provide affordable video relay services is discriminatory.", "Ofcom plans to review telecom services next year but says legislative changes would be needed for new services.", "Many of the UK's 70,000 BSL users hope for a cost-effective solution, as video relay allows them to communicate naturally and express emotions more easily."], "stablelm2:1.6b": ["Video phone help for deaf people using British Sign Language (BSL) is being piloted by RNID, but unless the cost of the service is reduced to match ordinary phone calls it may become unaffordable.", "The current rate of £7 per minute is urged by RNID to be lowered and made equal to voice call costs.", "This service allows deaf people to have their conversations relayed using webcams or video phones with an interpreter, converting verbal responses into sign language interpretation through a telephone.", "UK faces being behind other countries in providing this type of service as the RNID claims that no technical or economic reasons hinder it from being universally available at the same cost as voice calls."], "granite3.1-dense:2b": ["The Royal National Institute for Deaf People (RNID) is piloting the Video Relay Service, which enables deaf individuals using British Sign Language (BSL) to have video phone conversations with an interpreter.", "The service translates the deaf person's BSL into spoken English and vice versa via a telephone.", "However, due to its current cost of £7 per minute, it remains unaffordable for most deaf people, who prefer BSL as their primary means of communication.", "The RNID is advocating for Ofcom, the UK's telecoms regulator, to reduce this cost to match ordinary phone rates.", "Currently, other countries offer sign language relay services at the same price as voice calls.", "Despite Ofcom's plans to review existing obligations next year and discuss new technologies, its power is limited by legislation, requiring government consideration for any extension of these arrangements.", "Participants in the pilot, like Robert Currington, hope for a cost-effective solution to enhance their ability to express emotions through phone conversations."]}