{"raw_text": "Poles play with GameBoy 'blip-pop'\n \n A group of artists in Poland has taken the cacophony of blips, boops and beeps created as players bash buttons on Nintendo's handheld GameBoy console to a new level.\n \n The Gameboyzz Orchestra Project has taken the game sounds to put together music tunes they have dubbed \"blip-pop.\" Think of it as Donkey Kong meets Norman Cook, or maybe Tetris takes on Kraftwerk. Any way you slice it, the sound is distinct. All the sounds are made by six Nintendo GameBoys, with a mixture of older models and newer Advance SP handhelds. The Gameboyzz Orchestra Project tweaks the software a bit, and then connects the units through a mixing board.\n \n Jarek Kujda, one of the project's founding members has been into electronic music and video games, for a while now.\n \n \"I was playing some experimental music and three, four years ago when I first used a GameBoy in my band as a drum machine,\" said Kujda. He realised that the console could be used as a rudimentary synthesizer. He wondered, if one GameBoy can make music, what would happen if he put six of them together? Kujda found five other people who were interested and the Gameboyzz Orchestra Project was born. \"Gameboyzz Orchestra Project is more of an improvisational project,\" said Kudja. \"We prepare some patterns before a concert, and then improvise during the concert.\" The group plays maybe four or five shows a year. Malgorzata Kujda, Jarek's younger sister and a fellow band member, describes a Gameboyzz Orchestra Project concert as a lot of noise. \"For example, I make music with more hard beats and noises,\" she said. \"But each of us makes another music, a different sound. And then in the concert we just improvise, and that I think is more fun for us.\"\n \n The Gameboyzz Orchestra Project admits they get mixed reactions from audiences. Some love the group's music, and others are not quite sure what to make of it.\n \n In the world of electronic music, these purveyors of blip-pop are not unique. But Jarek Kujda says they try to be unique. \"We have lots of people making music on old school stuff, electronic old school stuff like Commodore, Atari, Spectrum,\" he said. \"We want to play only experimental music, not cover songs. We're something like an electronic jam session.\" The Gameboyzz Orchestra Project's tracks are available online and the group hopes to make a CD next year. And they have sponsorship, courtesy of the Polish distributor of Nintendo products. The members of the Gameboyzz Orchestra Project do not expect serious competition anytime soon. A GameBoy Advance costs about US $200 in Poland these days, which is still way beyond the reach of most Polish gamers, or musicians.\n \n Clark Boyd is technology correspondent for The World, a BBC World Service and WGBH-Boston co-production\n", "llama3.2:1b": ["Poles create music from Gameboy console sounds.", "Gameboys are mixed with software to produce \"blip-pop\" soundtracks.", "This project combines six different GameBoys to create distinct sounds.", "The project is an improvisational electronic music group that uses the Gameboy as a synthesizer.", "Members of the group improvise during concerts, often using different instruments and sounds."], "llama3.2:3b": ["A group of Polish artists has created music by manipulating GameBoy sounds, dubbed \"blip-pop,\" using six Nintendo GameBoys.", "The project, led by Jarek Kujda, combines elements of electronic and experimental music, with a focus on improvisation.", "The sound is distinct and often met with mixed reactions from audiences.", "The group releases their tracks online and aims to release a CD next year, sponsored by the Polish distributor of Nintendo products."], "gemma2:2b": ["In Poland, the Gameboyzz Orchestra Project creates \"blip-pop\" music by manipulating sounds from six Nintendo GameBoys.", "This experimental musical group uses these consoles to create unique electronic compositions.", "While some audiences appreciate their unconventional sound, others remain unsure.", "The group hopes to release a CD and further develop its unique blend of experimental electronic music."], "qwen2.5:0.5b": ["Poles are working on a new generation of blip-pop music inspired by the GameBoy.", "They've created an orchestra project that uses six Nintendo GameBoys to create electronic beats.", "The group plays concerts as part of their \"Gameboyzz Orchestra Project,\" which they believe is unique and experimental.", "Some people like it, while others are unsure about the quality or uniqueness of their music."], "qwen2.5:1.5b": ["A group of artists in Poland creates \"blip-pop\" by combining six GameBoy consoles to create music using only the sounds produced when players bang on buttons.", "They have been called electronic jam sessions and are viewed with mixed reactions from audiences, as some love their music while others aren't sure what it is.", "The group plans to release tracks online soon and hopes for sponsorship from Nintendo."], "qwen2.5:3b": ["A group of artists in Poland, the Gameboyzz Orchestra Project, have created music from Nintendo's GameBoy handheld by connecting multiple units to produce sounds reminiscent of electronic music pioneers like Kraftwerk.", "Founded by Jarek Kujda after discovering GameBoys could function as rudimentary synthesizers, the group uses six consoles connected through a mixing board.", "While their work is not unique in the world of electronic music, they differentiate themselves by playing experimental compositions rather than cover songs.", "The project has gained some mixed reactions from audiences but benefits financially from Nintendo's Polish distributor and hopes to release an album next year."], "opencoder:1.5b": ["The summary of the text:\n\nA group of artists in Poland has taken the cacophony of blips, boops and beeps created as players bash buttons on Nintendo's handheld GameBoy console to a new level.", "The Gameboyzz Orchestra Project aims to create unique \"blip-pop\" music tunes that combine the gameplay sounds of Donkey Kong with more experimental elements.", "They have collaborated with six GameBoys, mixed them together, and have made music available online for fans to enjoy.", "Their aim is to have fun while making something new."], "smollm:1.7b": ["The Gameboyzz Orchestra Project has taken the cacophony of blips, boops and beeps created as players bash buttons on Nintendo's handheld GameBoy console to a new level by combining them with electronic music.", "The result is a unique sound that blends the nostalgia of retro gaming with modern electronic production techniques.", "The project was founded by Jarek Kujda, who has been playing guitar and singing since he was 10 years old.", "He was inspired by his older brother's love of electronic music and began experimenting with using GameBoy sounds as a makeshift synthesizer.", "Over time, the two brothers developed their own style of music, which they call \"GameBoyzz.\"", "The members of the Gameboyzz Orchestra Project are all experienced musicians who have been playing in various bands for years.", "They come from different backgrounds and bring their own unique perspectives to the project.", "Malgorzata Kujda, Jarek's sister, is a skilled drummer who has worked with several other artists on electronic projects.", "The group plays music that is both nostalgic and modern, drawing inspiration from classic video games like Pac-Man and Donkey Kong as well as newer titles like Mario Kart and The Legend of Zelda.", "They use the GameBoy's built-in speakers to create a unique sound that is both retro and futuristic at the same time.", "The members of the Gameboyzz Orchestra Project are not afraid to push the boundaries of what is possible with electronic music.", "They have been known to incorporate elements of spoken word, karaoke, and even live instrumentation into their performances.", "Their music is a reflection of their love of gaming and their desire to create something new and exciting.", "The project has received some positive reviews from critics and fans alike.", "Many people are drawn to the unique sound and energy that comes with playing music on an old-school console like the GameBoy.", "The members of the Gameboyzz Orchestra Project have been praised for their creativity, skill, and passion for music.", "As the project continues to grow and evolve, it is clear that the members are committed to creating something truly special.", "They are not afraid to take risks and try new things, which has helped them to stay ahead of the curve in terms of electronic music trends.", "Overall, the Gameboyzz Orchestra Project is a testament to the power of creativity and innovation when combined with passion and dedication.", "Their music is a reflection of their love of gaming and their desire to create something new and exciting.", "As they continue to push the boundaries of what is possible, it will be interesting to see where this project takes them in the future."], "deepseek-r1:1.5b": ["The Gameboyzz Orchestra Project in Poland has created a new electronic sound blending old-school arcade elements with modern hardware, referred to as \"blip-pop.\"", "Composed of six Nintendo handhelds connected via a mixing board, they aim to offer a fresh experience.", "Some appreciate the unique twist on electronic music, while others find it confusing or unsure if it's original.", "They prepare performances and have tracks online, targeting Electronic Music Enthusiasts who may be drawn to this mix but could be concerned about uniqueness in their audience."], "tinyllama:1.1b": ["The following text, as provided by the source, conveys an overview of a group of artists in Poland who have taken game sounds and synthesized them into \"bllip-pop\" music.", "The project's members play with various models of Nintendo GameBoy devices to create unique compositions that feature both blasts and beeps made by six units connected through a mixing board.", "While the group has received mixed reactions from audiences, they are not seen as competing with traditional electronic music producers but instead aim to create a new style of experimental music using the classic GameBoy devices.", "The project is supported by sponsors and available online for download or streaming."], "tinydolphin:1.1b": [" The Gameboyzz Orchestra Project is a group of artists in Poland who take the GameBoy sounds to blip-pop territories.", "They use six Nintendo handheld GameBoys, mixing them with older Advance SP models and newer Advance SPs for a unique sound that is both quirky and entertaining.", "The project's members Jarek Kujda and Malgorzata Kujda, along with their sister, Germaine Kujda, form the core group.", "The project was inspired by experimentation with electronic music but remains an improvisational project."], "phi:2.7b": [" The Gameboyzz Orchestra Project is an experimental music project that uses six Nintendo GameBoys to create unique electronic sounds called \"blip-pop.\"", "The group's performances are improvised and aim to be different from traditional electronic music.", "Their tracks are available online and they hope to make a CD next year with the help of a Polish distributor."], "orca-mini:3b": [" Summary:\n\nA group of artists in Poland created a music project called Gameboyzz Orchestra Project that uses Nintendo's GameBoy console to make unique sounds that they call \"blip-pop\".", "They connect six GameBoys through a mixing board and prepare patterns for concerts, then improvise during the concert.", "The project gets mixed reactions from audiences, but it tries to be unique by making experimental music using old school electronic equipment.", "Their tracks can be found online, and they plan to release a CD next year."], "hermes3:3b": ["Gameboyz Orchestra Project: Polish artists use old GameBoy consoles as synthesizers to create \"blip-pop\" music."], "stablelm-zephyr:3b": ["A group of artists in Poland called the Gameboyzz Orchestra Project have turned Nintendo's GameBoy console into a unique musical instrument, creating a distinct sound called \"blip-pop.\"", "They use six GameBoys, including older models and newer Advance SP handhelds, tweaking their software to mix the sounds together.", "The project is an improvisational one, where they prepare some patterns before shows and then play different music during their concerts.", "They have received mixed reactions from audiences but try to be unique in their experimental music style, not focusing on cover songs.", "With tracks available online and plans for a CD next year, the group's future looks promising."], "chatgpt-4o-latest": ["A group of Polish artists, the Gameboyzz Orchestra Project, creates experimental electronic music using six Nintendo GameBoys, blending game sounds into a genre they call \"blip-pop.\"", "Founded by Jarek Kujda, who first used a GameBoy as a drum machine, the group improvises during performances, preparing patterns beforehand.", "They play a few shows a year, receiving mixed audience reactions.", "While not unique in electronic music, they aim to stand out by focusing on experimental sounds rather than covers.", "Their tracks are available online, and they plan to release a CD.", "Sponsored by Nintendo's Polish distributor, they face little competition due to the high cost of GameBoy consoles in Poland."], "stablelm2:1.6b": ["A group of artists in Poland creates \"blip-POP\" music using Nintendo GameBoys to perform experimental soundscapes.", "The Gameboyzz Orchestra Project uses six Nintendo GameBoys, connecting them through a mixing board for their performances, which typically involve four or five concerts per year.", "Audiences receive mixed reactions; however, they try to be unique in the electronic music world.", "Their tracks are available online and they hope to create an album soon with support from a Polish distributor of Nintendo products.", "The group does not expect serious competition immediately due to high costs for the GameBoy Advance and its availability only in Poland."], "granite3.1-dense:2b": ["The Gameboyzz Orchestra Project, a Polish collective led by Jarek Kujda, transforms the distinctive bleeps, bloops, and beeps generated by Nintendo GameBoy consoles into an improvisational music genre called \"blip-pop.\"", "Utilizing six GameBoys—a mix of older models and newer Advance SP handhelds—the group connects them via a mixing board.", "Jarek Kujda, the project's founder, discovered the potential for rudimentary synthesization in GameBoy drumming during his experiments with electronic music.", "The band, which consists of five members, prepares patterns before performances and improvises during shows.", "They play about four to five concerts annually.", "While reactions from audiences are mixed, with some embracing their unique sound and others unsure, the group aims to differentiate themselves in the electronic music scene by focusing on experimental compositions rather than cover songs.", "Their tracks are available online, and they seek CD production next year.", "Although GameBoy Advances cost around US $200 in Poland, making the technology accessible for most musicians is challenging due to its high price."]}