{"raw_text": "EU software patent law delayed\n \n Controversial new EU rules for the patenting of computer-based inventions have been put on hold due to a last minute intervention from Poland.\n \n Poland - a large and therefore crucial EU member - has requested more time to consider the issue, especially as it relates to the patenting of software. Critics say the law would favour large companies over small, innovative ones. They say it could have massive ramifications for developments such as open source software.\n \n Polish ministers want to see the phrasing of the text of the Directive on the Patentability of Computer-Implemented Inventions changed so that it excludes the patenting of software. The planned law has ignited angry debate about whether the EU should allow the patenting of computer programs and internet business methods as currently happens in the US. So, for instance, US-based Amazon.com holds a patent on 'one-click shopping'. Critics claim the law, which the EU says is needed to harmonise with the US, is little more than a law on ideas. \"Patent rights, it is claimed, protect inventors but in this case it is exclusively the interests of the big companies that are protected,\" Eva Lichtenberg, a Austrian Green member of the European Parliament said in a statement. \"Smaller, innovative firms cannot afford the patenting and legal costs that the directive would inflict on them,\" she added. The European Parliament has already clashed with the European Union on the issue and there have been accusations that the process to decide the issue has been undemocratic. The directive has been subject to several previous delays.\n", "llama3.2:1b": ["The EU's rules for patenting computer-based inventions have been put on hold due to Poland requesting more time to consider them, particularly with regards to software patents.", "Polish ministers want changes made to the language of the directive to exclude software patents.", "Critics claim the law would favor large companies over small innovative firms and potentially harm open source software development.", "The EU has clashed with the European Parliament over the issue, and there have been accusations of undemocratic decision-making processes."], "llama3.2:3b": ["EU software patent law implementation delayed due to Poland's request for more time, amid concerns it would favor large companies over small innovative ones and affect open source software development."], "gemma2:2b": ["Poland has delayed new EU software patent rules, demanding changes to exclude software patenting.", "This delay stems from concerns over potentially favoring large companies over smaller ones and its impact on open source software development.", "Critics argue that the proposed law harmonizes with US practices but primarily benefits big companies like Amazon.", "This issue has generated debate within the European Parliament, where accusations of an undemocratic process have been levied."], "qwen2.5:0.5b": ["EU software patent law is delayed, due to Poland's request for time extension.", "Critics say it would favor large companies over small innovators, citing concerns about open-source software and US company Amazon's patent on one-click shopping.", "European Parliament has clashed with EU on the matter and has accused processes of undemocratic nature."], "qwen2.5:1.5b": ["The controversial EU software patent law, aimed at patenting computer-based inventions, was temporarily halted by Poland due to concerns about its impact on small companies and open-source software.", "Critics argue it favors large corporations over innovators and could affect patents like Amazon's 'one-click shopping' in the US.", "The directive has sparked debate about whether the EU should allow patenting of computer programs and internet business methods, which critics claim prioritizes big companies over innovation.", "The European Parliament has already had disagreements with EU officials on this issue, suggesting an undemocratic process for making decisions."], "qwen2.5:3b": ["EU software patent law delayed due to Poland's request for more time.", "Critics argue it would favor large companies over small innovators, potentially affecting open source software.", "Polish ministers want wording changed to exclude software patents.", "EU says this is needed to align with US laws but critics view it as protecting big business interests.", "The European Parliament has already clashed with the EU on this issue and there have been accusations of undemocratic decision-making processes."], "opencoder:1.5b": ["The EU software patent law delayed the controversy surrounding computer-based inventions in the EU's rules for the patenting of software.", "Poland has requested more time to consider this matter, particularly as it relates to the patenting of software.", "Critics say the law would favour large companies over small, innovative ones.", "This is likely due to the massive ramifications that such an initiative could have on future developments in open source software.", "The Polish counterparts want to see the phrasing of the text of the Directive on the Patentability of Computer-Implemented Inventions changed so that it excludes the patenting of software.", "The proposed law has ignited angry debate about whether the EU should allow the patenting of computer programs and internet business methods as they happen in the US.", "The decision may have implications for European companies, but as a result, it is unlikely that many smaller, innovative firms would be willing to pay the associated costs.", "Eva Lichtenberg, an Austrian Green member of the European Parliament, added that \"Patent rights, it is claimed, protect inventors but in this case they are exclusively the interests of the big companies that are protected.\"", "Critics claim the law, which the EU's rules say is little more than a law on ideas.", "The European Union has already clashed with the United States on this issue and have previously argued that the process to decide the issue has been undemocratic.", "Many companies, including Amazon.com, hold patents on 'one-click shopping', so it appears like the main argument of the dispute is about protecting inventors."], "smollm:1.7b": ["The EU software patent law delayed due to a last minute intervention from Poland, which requested more time to consider the issue, especially as it relates to the patenting of computer-based inventions.", "Critics say the law would favor large companies over small, innovative ones and exclude the patenting of software.", "They claim that the law would have massive ramifications for developments such as open source software."], "deepseek-r1:1.5b": ["EU software patent law was delayed due to a last-minute intervention from Poland, sparking criticism that it favors large companies over small, innovative ones.", "Critics argue the law could harm open-source software development by excluding software patents.", "Poland requested more time for considerations related to software patenting.", "The directive has ignited debate about allowing patenting of computer programs and internet business methods in contrast to US practices.", "This issue has drawn criticism from the European Parliament and political process concerns."], "tinyllama:1.1b": ["Following a last minute intervenion from Poland, EU members have put on hold new rules for patenting computer-based inventions.", "Critics say that this law will benefit large companies over small, innovative ones and could have significant ramifications for the development of open-source software.", "The planned Directive on Patentability of Computer-Implemented Inventions was set to take effect in January but has been put on hold until a new version can be formulated with more flexibility for smaller firms.", "However, Polish ministers have requested that the phrasing of the law be revised to exclude patenting software as currently happens in the US.", "The planned legislation is needed to harmonize EU patent laws with US practices and protect ideas but it has been criticized as a law on ideas rather than patents."], "tinydolphin:1.1b": [" EU software patent law was put on hold amidst controversy over whether it should allow patenting of computer programs and business methods.", "Poland, a significant member of the European Union, expressed concerns about the new rules affecting small innovative companies and pushed for modifications to the text of the directive.", "The plans were met with skepticism by critics who argue that the law would benefit large corporations over smaller inventors."], "phi:2.7b": [" Due to a last-minute intervention from Poland, controversial EU rules for the patenting of computer-based inventions have been put on hold.", "Critics say this law would favor large companies over small innovative ones and could have massive ramifications for developments such as open source software.", "Polish ministers want to see the text of the Directive changed so that it excludes the patenting of software, sparking debate about whether the EU should allow the patenting of computer programs and internet business methods."], "orca-mini:3b": [" The EU software patent law has been delayed due to a request from Poland for more time to consider the issue, as it relates to the patenting of software and fears that it would favor large companies over small innovative ones."], "hermes3:3b": ["EU delays software patent law\nPoland holds off on approving software patenting rules due to concerns over large companies' advantage, potential impact on small innovators."], "stablelm-zephyr:3b": ["The EU's new software patent rules, causing controversy as they would allow patenting of internet business methods and computer programs, have been delayed due to Poland requesting additional time to consider the issue.", "Critics argue that this favoritism towards large companies over small innovators could have detrimental effects on open source software developments and innovation.", "Polish ministers want the phrasing of the Directive on the Patentability of Computer-Implemented Inventions changed to exclude software patenting, igniting debate on whether or not the EU should allow similar rights as in the US.", "The European Parliament has already clashed with the European Union over this issue, and accusations of an undemocratic process have been made."], "chatgpt-4o-latest": ["The EU's proposed software patent law has been delayed due to Poland's last-minute request for more time to review its implications, particularly regarding software patenting.", "Critics argue the law favors large corporations over smaller innovators and could negatively impact open-source development.", "Polish ministers seek changes to exclude software from patentability.", "The law has sparked debate over whether the EU should adopt US-style software patents, such as Amazon's 'one-click shopping' patent.", "Opponents claim it primarily benefits big companies, making patenting and legal costs prohibitive for smaller firms.", "The European Parliament has clashed with the EU over the issue, with accusations of an undemocratic decision-making process.", "The directive has faced multiple delays."], "stablelm2:1.6b": ["The EU software patent law faced a delay due to Poland's request for more time to consider its impact, especially on open source software.", "Critics argue that the proposed law would favor large companies over small innovative ones.", "Polish ministers want to modify the text of the Directive on Patentability of Computer-Implemented Inventions so it does not apply to software patenting, sparking debate about whether computer programs and internet business methods should be patented like in the US.", "The EU says the law is needed for harmonization with the US but critics argue that it is mainly a big company protection measure."], "granite3.1-dense:2b": ["The EU's proposed software patent law, aimed at aligning it with US regulations, has faced significant delay due to Poland's intervention.", "Critics argue this legislation favors large corporations over small innovators and could impact open-source software development.", "Polish ministers propose amending the Directive on Patentability of Computer-Implemented Inventions to exclude software from patents, expressing concerns about its potential to become a law on ideas rather than protecting tangible inventories.", "Opponents, including Eva Lichtenberg, a European Parliament member, claim the directive would disproportionately burden smaller firms with high patent and legal costs.", "The European Parliament has previously criticized the process for deciding this issue as undemocratic, and the directive has already experienced multiple delays."]}