{"raw_text": "Speech takes on search engines\n \n A Scottish firm is looking to attract web surfers with a search engine that reads out results.\n \n Called Speegle, it has the look and feel of a normal search engine, with the added feature of being able to read out the results. Scottish speech technology firm CEC Systems launched the site in November. But experts have questioned whether talking search engines are of any real benefit to people with visual impairments.\n \n The Edinburgh-based firm CEC has married speech technology with ever-popular internet search. The ability to search is becoming increasingly crucial to surfers baffled by the huge amount of information available on the web.\n \n According to search engine Ask Jeeves, around 80% of surfers visit search engines as their first port of call on the net. People visiting Speegle can select one of three voices to read the results of a query or summarise news stories from sources such as the BBC and Reuters. \"It is still a bit robotic and can make a few mistakes but we are never going to have completely natural sounding voices and it is not bad,\" said Speegle founder Gordon Renton. \"The system is ideal for people with blurred vision or for those that just want to search for something in the background while they do something else. \"We are not saying that it will be suitable for totally blind people, although the Royal National Institute of the Blind (RNIB) is looking at the technology,\" he added. But Julie Howell, digital policy manager at the RNIB, expressed doubts over whether Speegle and similar sites added anything to blind people's experience of the web. \"There are a whole lot of options like this springing up on the web and one has to think carefully about what the market is going to be,\" she said. \"Blind people have specialised screen readers available to them which will do the job these technologies do in a more sophisticated way,\" she added.\n \n The site uses a technology dubbed PanaVox, which takes web text and converts it into synthesised speech. In the past speech technology has only been compatible with broadband because of the huge files it downloads but CEC says its compression technology means it will also work on slower dial-up connections. Visitors to Speegle may notice that the look and feel of the site bears more than a passing resemblance to the better known, if silent, search engine Google. Google has no connection with Speegle and the use of bright colours is simply to make the site more visible for those with visual impairments, said Mr Renton. \"It is not a rip-off. We are doing something that Google does not do and is not planning to do and there is truth in the saying that imitation is the sincerest form of flattery,\" he said. Speegle is proving popular with those learning English in countries such as Japan and China. \"The site is bombarded by people just listening to the words. The repetition could be useful although they may all end up talking like robots,\" said Mr Renton.\n", "llama3.2:1b": ["A Scottish search engine firm, CEC Systems, has launched a website called Speegle that reads out search results aloud for users with visual impairments.", "The site is designed to work on slow internet connections and uses technology dubbed PanaVox, which converts web text into synthesised speech.", "Experts have questioned whether talking search engines are beneficial for visually impaired people who prefer to browse the web silently."], "llama3.2:3b": ["A Scottish firm launched a search engine that reads out results, called Speegle, which uses speech technology dubbed PanaVox.", "Experts question its usefulness for visually impaired people, but it has been popular among non-native English speakers learning the language online.", "The site is ideal for those who need to search while doing something else and can be used on slower dial-up connections due to compression technology."], "gemma2:2b": ["A Scottish company, CEC Systems, launched a search engine called Speegle that reads out results for users with visual impairments or those who prefer hands-free searching.", "While Speegle offers convenience and accessibility, experts question its efficacy compared to existing screen readers and the technology's potential in improving the web experience for blind people.", "Despite being inspired by Google’s interface, Speegle employs a proprietary voice synthesis technology that works with dial-up connections.", "The site has gained traction among learners of English in Asia."], "qwen2.5:0.5b": ["Speegle, a search engine that reads out results while allowing users to read them aloud or for summaries, has gained popularity among those with visual impairments and blind people.", "It uses speech technology called PanaVox that converts web text into synthesised speech.", "The site uses compressed data to make it compatible with slower connections.", "Despite some technical challenges, Speegle is seen as a useful tool by users who struggle with natural language processing.", "Speegle has gained popularity in countries like Japan and China where English is spoken, but there are also learning programs for those with limited English skills.", "The site's use of bright colors and its ability to mimic Google is sometimes criticized for not being an original invention."], "qwen2.5:1.5b": ["A Scottish speech technology firm, CEC Systems, launched a search engine called Speegle that reads out results similar to Google but with errors and limited naturalness, targeting visually impaired users.", "While popular among English learners abroad, it faces skepticism from the Royal National Institute of the Blind over practical applications for total blindness."], "qwen2.5:3b": ["A Scottish firm, CEC Systems, launched Speegle, a search engine that reads out results using voices or summarises news stories from BBC and Reuters.", "Despite concerns about its robotic nature, it is ideal for people with blurred vision or those who want to search while doing other activities.", "Experts question whether it benefits blind users, noting specialized screen readers are more sophisticated.", "The site uses PanaVox technology to convert text into synthetic speech, compatible on both broadband and dial-up connections.", "Popular among English learners in Japan and China, Speegle aims to mimic Google's design but with brighter colors for visibility."], "opencoder:1.5b": ["\"Speech takes on search engines, a Scottish firm is looking to attract web surfers with a search engine that reads out results.", "A feature of the system is its ability to read out the results, considering people with visual impairments.", "The ability to search is becoming increasingly crucial for surfers baffled by the huge amount of information available on the web.", "According to search engine Ask Jeeves, around 80% of surfers visit search engines as their first port of call on the net.", "The users visiting Speegle can select one of three voices to read the results of a query or summarise news stories from sources such as BBC and Reuters.", "It is still a bit robotic and can make a few mistakes but we are never going to have completely natural sounding voices and it is not bad, the system is ideal for people with blurred vision or for those that just want to search for something in the background while they do something else.", "The system is ideal for people with blindness.", "Visitors to Speegle may notice a resemblance between the look and feel of the site and Google.\""], "smollm:1.7b": ["Summarize the following text concisely, preserving key ideas and details:\nSpeech takes on search engines"], "deepseek-r1:1.5b": ["Speegle, a search engine that reads results aloud, created by CEC Systems, has gained popularity for blending speech with web searches.", "It uses PanaVox technology to convert text into synthetic speech suitable on both devices.", "Similar to Google but using spoken words instead of images, Speegle is gaining traction among English learners in Japan and China due to its engaging features."], "tinyllama:1.1b": ["The Scottish firm CEC has launched a sea-based searching engine called Speegle that allows visually impaired people to read out search results, summarize news articles from various sources, and even perform basic web searches.", "The engine also uses a technology called Panavox to convert text into synthetic speech, making it compatible with slower connections and available on a variety of devices.", "Despite being similar in look and feel to Google's sea-based searching engine, Speegle has been praised for its accessibility features by those learning English in Japan and China who are interested in English learning apps."], "tinydolphin:1.1b": [" The Scottish company CEC Systems has created a unique search engine that can understand text from websites and read out the results in a spoken voice for visually impaired people.", "It combines the popular Google search engine with speech technology to make their product more accessible to those who cannot see.", "This new technology, called Speegle, is expected to greatly improve the experience of internet users."], "phi:2.7b": [" Speegle is an artificial intelligence search engine that reads out results instead of displaying them on a screen.", "It was launched by Scottish speech technology firm CEC Systems in November and allows users to select one of three voices to read the results of their queries or summarise news stories from sources such as the BBC and Reuters.", "While it may be useful for those with visual impairments or who want to search while doing something else, experts question its benefit.", "The site uses PanaVox technology to convert web text into synthesised speech and is compatible with both broadband and dial-up connections.", "It bears some resemblance to Google but has no connection with the search engine.", "CEC Systems claims that imitation is the sincerest form of flattery."], "orca-mini:3b": [" A Scottish firm has launched a search engine that reads out results, called Speegle.", "It can be used by people with visual impairments and allows them to search for information on the web.", "The site uses technology from CEC Systems, which is based in Edinburgh.", "However, some experts have questioned whether talking search engines are of any real benefit to people with visual impairments."], "hermes3:3b": ["Speegle speech-enabled search engine, developed by Scottish firm CEC, aims to help visually impaired users read web results aloud.", "However, experts doubt if it adds significant benefit compared to specialized screen readers for blind people."], "stablelm-zephyr:3b": ["CEC Systems, a Scottish speech technology firm, has launched Speegle, a search engine that reads out results for users.", "While experts question whether talking search engines are beneficial for visually impaired people, the company says its technology is ideal for those with blurred vision or who want to search while doing something else.", "The site uses PanaVox, a speech synthesis technology compatible with slower dial-up connections, and has gained popularity among non-native English speakers in Japan and China."], "chatgpt-4o-latest": ["A Scottish firm, CEC Systems, has launched Speegle, a search engine that reads out results using speech technology.", "Users can choose from three voices to hear search results or news summaries.", "While the technology aims to assist those with blurred vision or multitasking users, experts question its usefulness for blind individuals, who already have advanced screen readers.", "Speegle uses PanaVox technology to convert web text into synthesised speech and works on both broadband and dial-up connections.", "Despite its resemblance to Google, Speegle claims originality.", "The site has gained popularity among English learners in countries like Japan and China."], "stablelm2:1.6b": ["A Scottish company has developed a search engine called Speegle that reads out results, combining speech technology with internet searches.", "However, experts have questioned whether talking search engines benefit people with visual impairments.", "The system allows users to select voices for reading or summarizing news stories from sources such SBS and BBC.", "It uses technology called PanaVox, which converts web text into synthesized speech.", "CEC Systems launched the site in November and claims it will work on slower dial-up connections.", "Google is not connected with Speegle; bright colors are used to make the site more visible for those with visual impairments."], "granite3.1-dense:2b": ["Speegle, a new search engine launched by Scottish firm CEC Systems, integrates speech technology to read out web results.", "Launched in November, Speegle mimics the appearance and functionality of popular search engines like Google, using a feature called PanaVox for text-to-speech conversion.", "Users can choose from three voices to read or summarize news from sources such as BBC and Reuters.", "Despite its limitations—currently considered \"robotic\" and prone to errors—Speegle caters to individuals with blurred vision who require visual assistance while browsing the web, as well as those seeking background information while doing other tasks.", "Experts from the Royal National Institute of the Blind (RNIB) remain skeptical about Speegle's value for totally blind users, suggesting specialized screen readers offer more advanced functionality.", "The RNIB's digital policy manager, Julie Howell, notes that numerous similar voice-enabled search sites are emerging, raising questions about market demand and user needs.", "Speegle has gained traction in countries like Japan and China for learners of the English language, who appreciate its repetitive nature as an educational tool.", "Although critics argue that users may adopt a robotic speech pattern, CEC Systems maintains Speegle offers unique features not provided by existing search engines, such as text-to-speech capabilities on dial-up connections due to improved compression technology."]}