{"raw_text": "Napster offers rented music to go\n \n Music downloading, for those that have rejected the free peer to peer services, can be a costly business.\n \n The cost of paying even as little as 70p per track can add up, particularly for those people who own one of the new generation of players that can store thousands of songs. Paying per track for music is becoming as outmoded as paying per minute for internet access and alternative monthly or yearly subscription models are springing up as a more convenient, and ultimately cheaper way of owning music.\n \n \"Music fans are moving away from buying the traditional bundled package of a dozen or more songs that we used to call an album to newer ways that fit their lifestyle; either single tracks or subscriptions services,\" said Paul Myers, chief executive of Wippit, a UK-based music download service. While iTunes is doing good business with its sales of individual tracks to iPod owners, others are questioning whether the concept of owning music is even valid in the digital age. Napster is due to launch a new rental subscription service - dubbed Napster to Go in the UK in the next few months. The service can be used on players that support Microsoft Windows latest Digital Rights Management technology known as Janus. This includes players made by Samsung, Rio and Creative.\n \n Currently on offer in beta-version in the US, the service costs $15 per month for unlimited downloads. The technology ensures that music downloaded to the player only remains playable while the user subscribes to the service. Users need to update their license on a monthly basis or the tunes will no longer play.\n \n This has outraged some digital music lovers, especially as Napster already offers a cheaper service for downloading music to the PC. Napster claims the higher price is a result of record labels charging more for the to-go service and says it also offers \"greater value\" for customers. Mr Myers is not convinced a rental model will work for consumers. \"We've been offering our unlimited music subscription service for more than three years now and our customers know what they want. Format interoperability, excellent value and the reassurance that music purchased from Wippit is theirs to keep and enjoy on whatever device they choose,\" he said. \"Who wants to download a track that won't play next month if you decide to unsubscribe to the service or change portable player for an iPod or the latest mobile phone?\" Wippit offers a download subscription service for £4.99 per month or £50 per year. It has a catalogue of around 60,000 songs.\n", "llama3.2:1b": ["Napster is launching a rental subscription service called \"Napster to Go\" in the UK, allowing users to rent music for $15 per month, with the option to update their license monthly or risk losing access to their downloaded music.", "The US version of Napster offers an unlimited downloads service for $15 per month, but has outraged some digital music lovers who feel it is too expensive compared to its competitors."], "llama3.2:3b": ["Napster is launching a new rental subscription service called Napster to Go in the UK, which allows users to download music on players that support Microsoft's Janus DRM technology for $15/month in the US.", "The service is seen as an alternative to buying individual tracks or using subscription services like Wippit, which offers a cheaper option with greater format interoperability and ownership."], "gemma2:2b": ["Napster is launching a new rental subscription service called \"Napster to Go\" in the UK.", "This service allows users unlimited downloads of music through devices that support Microsoft Windows' Digital Rights Management technology.", "The monthly cost is $15, with the downloaded music only playable while subscribed.", "Napster claims higher pricing results from record label demands and offers greater value.", "Critics question whether a rental model will succeed compared to existing download services, like Wippit's subscription service, which offers unlimited downloads for £4.99 per month or £50 per year."], "qwen2.5:0.5b": ["Napster's rental music service is becoming more popular, as players like Samsung and Creative support Janus technology to offer Napster-to-Go subscription services for $15/month for unlimited downloads.", "The service charges for music only while subscribed, requiring users to renew their subscriptions monthly.", "Some digital music lovers are concerned about the higher price, with Napster claiming it's a result of record labels charging more and offering \"greater value.\"", "Wippit offers a £4.99 per month or £50/year subscription package, which has over 60, 000 songs in its catalogue."], "qwen2.5:1.5b": ["Napster plans to launch a rental music subscription service in the UK called Napster to Go, offering unlimited downloads at $15/month with updated licenses needed monthly for compatibility and value retention across different devices.", "This contrasts with iTunes's individual track sales model while raising concerns about whether traditional album ownership remains relevant in an age of digital music sharing."], "qwen2.5:3b": ["Napster is launching a rental subscription music service called Napster to Go in the UK, which can be used on players supporting Microsoft Windows' Janus DRM technology.", "This service costs $15 per month for unlimited downloads and automatically updates licenses monthly or users lose access to downloaded tracks.", "While it offers lower prices than traditional digital services like iTunes, some argue that it is more expensive due to record labels charging more for the 'to-go' service.", "Critics also point out issues with format interoperability and the risk of being unable to play purchased music if subscriptions end or devices are replaced.", "In contrast, Wippit provides a subscription service for £4.99 per month or £50 annually, claiming superior value and device compatibility."], "opencoder:1.5b": ["Napster offers rented music to go Music downloading, for those that have rejected the free peer-to-peer services, can be a costly business.", "The cost of paying even as little as 70p per track can add up particularly for those people who own one or more new generation of players capable of storing thousands of songs.", "Paying per track for music is becoming increasingly outmoded as it offers convenience and affordability.", "\"Music fans are moving away from buying the traditional bundled package of a dozen or more songs that we've been calling an album to newer ways that fit their lifestyle; either single tracks or subscriptions services,\" Paul Myers, head of Wippit has said.", "While iTunes is doing good business with its sales of individual tracks to iPod owners, others are questioning whether owning music is even valid in the digital age.", "The new rental subscription service - dubbed Napster for Go in the UK is expected to launch in the next few months.", "The service can be used on players that support Microsoft Windows latest Digital Rights Management technology known as Janus.", "This includes Samsung, Rio and Creative.", "While currently on offer in beta-version in the US, the cost of downloading unlimited songs per month or year up to £15 is available."], "smollm:1.7b": ["Music downloading, for those that have rejected the free peer to peer services, can be costly.", "Music downloading is becoming as outmoded as paying per minute for internet access and alternative monthly or yearly subscription models are springing up as a more convenient, and ultimately cheaper way of owning music.", "Napster offers rented music to go on its beta-version in the US, but it's not clear what kind of pricing model they're using.", "Currently on offer in beta-version in the US is the service for unlimited downloads, but this may be too expensive for some consumers.", "The cost of paying even as little as 70p per track can add up, particularly for those people who own one of the new generation of players that can store thousands of songs.", "Paying per track for music is becoming as outmoded as paying per minute for internet access and alternative monthly or yearly subscription models are springing up as a more convenient, and ultimately cheaper way of owning music.", "Napster offers a rental subscription service for $15 per month or $100 per year, but this may not be enough to keep consumers happy.", "Currently on offer in beta-version in the US is the service for unlimited downloads, but this may be too expensive for some consumers."], "deepseek-r1:1.5b": ["Napster introduces rented music to go as an alternative to traditional albums, highlighting the growing preference for subscription-based models like per-track downloads.", "Paying even a small amount per track can be costly for those with multiple songs, especially newer players.", "Music fans are shifting from album bundles to single tracks or subscriptions.", "Napster in the UK launches its new rental service targeting Windows players, using Janus technology.", "It costs $15 per month and requires monthly updates.", "Wippit offers cheaper alternatives like £4.99/month or £50/year with around 60,000 songs.", "Myers doubts the rental model's effectiveness for consumers, emphasizing the importance of lifelong ownership."], "tinyllama:1.1b": ["A new rental music service, Napster to Go, is set to launch in the UK in early 2007 with subscription prices starting at $15 per month for unlimited downloads.", "This service offers unlimited downloads while users pay a monthly fee, and the technology ensures that music downloaded to the player only remains playable while subscribers update their license on a monthly basis or lose access permanently.", "Napster has outraged some digital music lovers with its higher price and the fact that it offers \"greater value\" for customers as it also offers unlimited music streaming.", "However, Napster's chief executive Paul Myers believes consumers want to own music but enjoy it on whatever devices they choose, and therefore a rental model is not the way forward."], "tinydolphin:1.1b": [" Napster, the music rental service, is offering a new rental subscription service - dubbed Napster to Go in the UK - that costs $15 per month for unlimited downloads.", "The technology ensures that music downloaded to the player only remains playable while the user subscribes to the service.", "Users need to update their license on a monthly basis or the tunes will no longer play.", "This has outraged some digital music lovers, especially as Napster already offers a cheaper service for downloading music to the PC.", "Napster claims the higher price is a result of record labels charging more for the to-go service and says it also offers \"greater value\" for customers."], "phi:2.7b": [" Napster is launching a new rental subscription service called Napster to Go that can be used on players that support Microsoft Windows' Digital Rights Management technology.", "The service costs $15 per month for unlimited downloads and the music downloaded will remain playable only while subscribed to the service.", "Napster also offers an unlimited download subscription service that has been available for over three years at a cheaper price point, but customers need to be careful about the format interoperability of the songs they purchase as it can affect their ability to play them on different devices.", "Wippit is another UK-based music download service that offers single tracks or subscriptions services at a monthly subscription rate and has a catalogue of around 60,000 songs."], "orca-mini:3b": [" Napster offers rented music to go, with monthly fees ranging from $15 to $50 per user, depending on the player model supported.", "The service allows users to download up to 25 tracks at a time and can only be used on players that support Microsoft's Janus digital rights management technology.", "Some consumers are outraged by the higher price for the to-go service, while others see it as an opportunity to try music they may not have otherwise had access to due to the convenience of a subscription model.", "Napster claims that its \"greater value\" service offers customers a wider range of music and more flexibility in choosing which devices they want to use.", "Others believe that owning music is becoming outdated, and newer subscription models offer a more convenient and cost-effective way of accessing music."], "hermes3:3b": ["Napster to launch paid music rental subs service, replacing traditional track purchases & bundled packages.", "Alternatives like Wippit offer subscriptions for cheaper access to large song catalogs."], "stablelm-zephyr:3b": ["Napster is launching a rental subscription service called Napster to Go in the UK, offering alternative monthly or yearly subscription models to music ownership.", "The new service costs $15 per month and requires users to update their license monthly for continued playback.", "Critics argue that the higher price results from record labels charging more for the to-go service and question whether the rental model will be convenient and cost-effective for consumers in the digital age.", "Napster claims that the rental service offers greater value for customers, while Wippit offers an unlimited subscription service for £4.99 per month or £50 per year with a catalog of around 60,000 songs."], "chatgpt-4o-latest": ["Napster is launching a new rental subscription service, Napster to Go, in the UK, allowing unlimited music downloads for $15 per month on compatible devices using Microsoft's Janus DRM technology.", "The service requires users to maintain their subscription, or the downloaded music becomes unplayable.", "While some see this as a cost-effective alternative to purchasing individual tracks, critics argue that the inability to keep the music permanently makes it less appealing.", "Wippit, a UK-based music download service, offers a competing subscription model for £4.99 per month or £50 per year, allowing users to keep their purchased music.", "The debate continues over whether renting music is a viable model for consumers."], "stablelm2:1.6b": ["Napster introduces a new rental subscription service called Napster to Go, which allows users to stream music on compatible devices using Microsoft's Digital Rights Management technology known as Janus.", "The UK-based service offers $0.99 per month for unlimited downloads and supports players made by Samsung, Rio, and Creative.", "Currently available in beta version in the US, Napster claims its higher price is due to record labels charging more for the to-go service while offering \"greater value.\"", "Some digital music lovers are outraged, as Napster already offers a cheaper service for downloading to PCs.", "Wippit's unlimited music subscription service costs £4 per month or £4 per year with a catalog of around 250,0..\n  \nNapster introduces a new rental subscription service called Napster to Go, which allows users to stream music on compatible devices using Microsoft's Digital Rights Management technology known as Janus.", "The UK-based service offers $0.99 per month for unlimited downloads and supports players made by Samsung, Rio, and Creative.", "Currently available in beta version in the US, Napster claims its higher price is due to record labels charging more for the to-go service while offering \"greater value.\"", "Some digital music lovers are outraged, as Napster already offers a cheaper service for downloading to PCs.", "Wippit's unlimited music subscription service costs £4 per month or £4 per year with a catalog of around 250,000 songs."], "granite3.1-dense:2b": ["Napster is set to launch Napster to Go, a rental music subscription service priced at $15 per month for unlimited downloads on compatible players like Samsung, Rio, and Creative devices, which support Microsoft's Janus technology.", "This model allows users to access their downloaded tracks as long as they maintain the subscription, with music becoming inaccessible if the license is not updated monthly.", "While some digital music enthusiasts find this outrageous, given Napster's existing lower-priced PC downloads, Napster defends the higher cost due to increased charges from record labels and emphasizes greater value for customers.", "In contrast, Wippit, a UK-based competitor, offers a download subscription service for £4.99 per month or £50 annually, with a catalog of approximately 60,000 songs."]}