{"raw_text": "Half of UK's mobiles 'go online'\n \n Multimedia mobile phones are finally showing signs of taking off, with more Britons using them to go online.\n \n Figures from industry monitor, the Mobile Data Association (MDA), show the number of phones with GPRS and MMS technology has doubled since last year. GPRS lets people browse the web, access news services, mobile music and other applications like mobile chat. By the end of 2005, the MDA predicts that 75% of all mobiles in the UK will be able to access the net via GPRS. The MDA say the figures for the three months up to 30 September are a \"rapid increase\" on the figure for the same time the previous year. About 53 million people own a mobile in the UK, so the figures mean that half of those phones use GPRS. GPRS is often described as 2.5G technology - 2.5 generation - sitting between 2G and 3G technology, which is like a fast, high-quality broadband internet for phones.\n \n With more services being offered by mobile operators, people are finding more reasons to go online via their mobile. Downloadable ringtones are still proving highly popular, but so is mobile chat. BandAid was the fastest ever-selling ringtone this year, according to the MDA, and chat was given some publicity when Prime Minister Tony Blair answered questions through mobile text chat. Multimedia messaging services also looked brighter with 32% of all mobiles in the UK able to send or receive picture messages. This is a 14% rise from last September's figures. But a recent report from Continental Research reflects the continuing battle mobile companies have to actually persuade people to go online and to use MMS. It said that 36% of UK camera phone users had never sent a multimedia message, or MMS. That was 7% more than in 2003. Mobile companies are keen for people to use multimedia functions their phones, like sending MMS and going online, as this generates more money for them. But critics say that MMS is confusing and some mobiles are too difficult to use. There have also been some issues over interoperability, and being able to send MMS form a mobile using one network to a different one.\n", "llama3.2:1b": ["Half of UK's mobile phones now have GPRS technology, which allows them to access the internet via a 2.5G connection, compared to 75% in 2005.", "This is up from 53 million people owning a mobile phone.", "More services are being offered by mobile operators, such as downloadable ringtones and multimedia messaging (MMS), with 32% of UK mobiles now able to send or receive picture messages."], "llama3.2:3b": ["Half of UK's mobile phones now go online, with 53 million people owning a mobile in the UK, and GPRS technology expected to reach 75% by the end of 2005.", "Mobile chat and downloadable ringtones remain popular, but MMS usage has increased by 14%, reaching 32% of all mobiles.", "Despite this, many users still struggle with using MMS, with 36% of camera phone users never sending a multimedia message."], "gemma2:2b": ["Mobile phones with GPRS technology are increasing in the UK, with half of all mobile phone users now able to access the internet via this technology.", "Downloadable ringtones remain popular, as do mobile chat services which saw increased use following PM Blair's text-based question and answer session.", "While multimedia messaging (MMS) is becoming more common, a significant portion of camera phone users haven't yet used it.", "Companies are encouraging mobile usage for revenue generation but face challenges such as MMS complexity, interoperability issues, and user confusion."], "qwen2.5:0.5b": ["UK's mobiles are becoming increasingly popular for online use, with 53 million people owning them.", "Multimedia phones allow users to browse the web, access news services, chat, and more.", "GPRS technology offers faster internet connectivity, similar to 2G and 3G.", "Mobile operators offer a mix of free and paid services, including ringtone downloads and picture messages.", "However, there is still resistance from mobile companies for people to use multimedia functions like sending MMS."], "qwen2.5:1.5b": ["In the UK, half of all mobile phones now support GPRS technology for internet access.", "Figures show rapid growth in usage across three months ending September 30th, with more than 75% of UK phones expected online via GPRS by 2005.", "This trend is driven by increased multimedia applications like chat and ringtone downloads becoming more popular on mobiles.", "However, critics argue that MMS (Multimedia Messaging Service) remains confusing to many users and has issues related to interoperability across different networks."], "qwen2.5:3b": ["Half of UK's mobile phones can go online via GPRS, with usage doubling since last year according to the Mobile Data Association (MDA).", "By 2005, they predict 75% of all UK mobiles will be able to access the internet through this technology.", "The MDA cites a rapid increase in GPRS use from the previous year; currently, about half of UK mobile phones use GPRS for web browsing and other applications like music downloads, chat, and downloadable ringtones.", "While popular, mobile chat gained attention when Prime Minister Tony Blair participated via text messages, and multimedia messaging services saw growth but remained less widespread due to lack of usage among some users.", "Mobile companies encourage online access and MMS use as it generates revenue, although there are challenges such as confusing features and interoperability issues."], "opencoder:1.5b": ["Half of UK's mobiles 'go online' as more people are moving online on their mobile devices."], "smollm:1.7b": ["The summary should be:\nHalf of UK's mobiles 'go online' with more Britons using them to go online.", "Figures from industry monitor show the number of phones with GPRS and MMS technology has doubled since last year, and 75% of all mobiles in the UK will be able to access the net via GPRS by the end of 2005.", "About 53 million people own a mobile in the UK, so the figures mean that half of those phones use GPRS.", "GPRS is often described as 2.5G technology - 2.5 generation - sitting between 2G and 3G technology, which is like a fast, high-quality broadband internet for phones.", "Multimedia messaging services also looked brighter with 32% of all mobiles in the UK able to send or receive picture messages this year, and 74% of mobile phone users aged 18-34 have sent or received MMS."], "deepseek-r1:1.5b": ["Half of UK's mobiles are going online, with figures showing GPRS usage has doubled since last year, reaching 75% access to the net via GPRS.", "GPRS is described as 2.5G technology.", "More services like ringtones, chat, and MMS messages are gaining popularity among mobile operators.", "Issues include higher MMS usage by camera phone users and interoperability problems."], "tinyllama:1.1b": ["A report from Continental Research has shown that 36% of UK camera phones do not use multimedia messages (MMs), or MMS, which is an important feature for accessing the internet via mobile phones.", "The figures show that about half of all mobile phones are able to send or receive MMs, up from last year's 53 million phones that use this technology.", "However, more people still need to be convinced to go online and use MMs, as only 32% can send or receive pictures.", "Meanwhile, multimedia messaging services have been growing rapidly, with 75% of all mobile phones able to access the internet via GPRS (GPRS stands for 2.5G, which provides high-quality broadband internet for phone calls).", "MMs are becoming more popular too, with downloadable ringtone and chat services taking the lead this year.", "Despite these positive figures, critics suggest that MMs can be confusing and some phones may be difficult to use."], "tinydolphin:1.1b": [" The UK's mobile phones are rapidly adopting multimedia features such as GPRS, which allows people to access the internet via their phone.", "Mobile phone users in the UK have doubled since last year and more than half of them now use GPRS.", "A report by Continental Research shows that 36% of camera phone users have never used a multimedia message (MMS), while 7% of mobile users don't even know how to send one.", "Mobile companies are keen for people to take advantage of these new features, but critics argue that MMS can be confusing and some mobiles are too difficult to use."], "phi:2.7b": [" The text summarizes the increasing popularity of multimedia mobile phones in the UK, with more people accessing the internet through GPRS technology, downloading ringtones, chatting, and sending picture messages.", "However, it also mentions that not all users take advantage of these features, as some find them confusing or difficult to use."], "orca-mini:3b": [" The text reports that more than half of all mobile phones in the UK can access the internet via GPRS, which is considered a fast and high-quality broadband internet for phones.", "Multimedia messaging services are also becoming more popular.", "However, some people still struggle to use multimedia functions on their mobile phones, and there have been issues over interoperability and being able to send MMS from one network to another.", "Despite these challenges, mobile companies continue to promote the use of multimedia features on their phones to generate more revenue."], "hermes3:3b": ["Half of UK mobile users now have GPRS-capable phones for online access.", "GPRS technology allows browsing web, accessing news & other applications via multimedia mobiles.", "By 2005 end, 75% of UK mobiles expected to use GPRS."], "stablelm-zephyr:3b": ["Multimedia mobile phones are gaining popularity in the UK, with GPRS and MMS technology doubling since last year.", "By 2005, it is predicted that 75% of all mobiles will be able to access the internet through GPRS.", "Around 53 million people own a mobile in the UK, which means half of them use GPRS.", "Popular uses include downloadable ringtones, mobile chat, and multimedia messaging services (MMS), with 32% of all mobiles able to send or receive picture messages.", "However, 36% of UK camera phone users have never sent an MMS, indicating some confusion surrounding the feature and difficulty using certain phones.", "Mobile companies are eager for people to use these functions as they generate more money, but critics argue that MMS is confusing and some phones are too difficult to use due to interoperability issues between networks."], "chatgpt-4o-latest": ["Half of UK mobile phones now use GPRS technology, allowing users to browse the web, access news, and use mobile chat.", "The number of GPRS and MMS-enabled phones has doubled since last year, with 75% of UK mobiles expected to have internet access by the end of 2005.", "Mobile services like downloadable ringtones and mobile chat are growing in popularity, with BandAid becoming the fastest-selling ringtone and Prime Minister Tony Blair engaging in mobile text chat.", "Multimedia messaging (MMS) adoption has risen, with 32% of UK mobiles able to send or receive picture messages, but 36% of camera phone users have never sent an MMS.", "Mobile companies are pushing for greater use of these features to increase revenue, but challenges remain, including user confusion, difficult interfaces, and interoperability issues between networks."], "stablelm2:1.6b": ["Half of the UK's mobile phones now go online through GPRS technology, with double the number since last year.", "The Mobile Data Association predicts that 50% of all mobiles will be able to access the net via GPRS by the end of this year.", "Reasons for going online include downloadable ringtones and mobile chat.", "Multimedia messaging services also increased in popularity.", "However, some UK camera phone users have never sent a multimedia message, highlighting challenges in persuading people to use MMS."], "granite3.1-dense:2b": ["British mobile phone users' online activities are surging, with half (53 million) of the 106 million phones in the UK now capable of GPRS internet access by year-end 2005, according to the Mobile Data Association (MDA).", "This rapid increase reflects a growing trend towards using mobile devices for web browsing, news, music, and applications like chat.", "Popular services include downloadable ringtones and MMS, though 36% of UK camera phone users have yet to send an MMS, up from 7% in 2003.", "Mobile operators emphasize the importance of these features for revenue generation.", "However, critics argue that MMS is complex, some phones are hard to use, and there are interoperability issues when sending MMS across different networks."]}