{"raw_text": "Yahoo moves into desktop search\n \n Internet giant Yahoo has launched software to allow people to search e-mail and other files on their PCs.\n \n The firm is following in the footsteps of Microsoft, Google and Ask Jeeves, which have offered similar services. Search has become a lucrative and hotly-contested area of expansion for net firms, looking to extend loyalty beyond the web. With hard drives providing bigger storage, users could need more help to locate important files, such as photos.\n \n The desktop search technology has been licensed from a US-based firm X1 Technologies. It is designed to work alongside Microsoft's Outlook and Outlook Express e-mail programs. Searching e-mail effectively is becoming increasingly important, especially as the amount of spam increases. According to research from message analysts the Radicati Group, up to 45% of businesses' critical information is stored in e-mail and attachments. Yahoo's software can also work separately on the desktop, searching for music, photos and other files. Users can search under a variety of criteria, including file name, size, date and time. It doesn't yet incorporate web searching, although Yahoo has promised that future versions will allow users to search both web-based and desktop data. \"We are all getting more and more files on our desktop but the real commercial opportunity lies with linking this through to web content,\" said Julian Smith, an analyst with research firm Jupiter. \"It is all about extending the idea of search and getting a closer relationship with consumers by organising not just how they search on the internet but the files on your computer as well,\" he said. Search engines are often the first port of call for users when they go onto the web. The new foray into desktop search has rung alarm bells for human rights groups, concerned about the implications to privacy. And not everyone is impressed with the functionality of such services. Alexander Linden, vice president of emerging technologies at analyst firm Gartner,downloaded the Google product but has since removed it. \"It was just not very interesting,\" he said. He believes the rush to enter the desktop business is just a way of keeping up with rivals. \"Desktop search is just one of many features people would like but I'm suspicious of its usefulness,\" he said. More useful would be tools that can combine internet, intranet and desktop search alongside improvements to key word searching, he said.\n", "llama3.2:1b": ["Yahoo launches software for desktop search on PCs.", "The service uses Microsoft's Outlook and Outlook Express e-mail programs as a base.", "It allows users to search email effectively, especially with increasing spam and critical information stored in emails and attachments.", "The technology can also search for music, photos, and other files.", "Future versions will allow searching of web-based data as well.", "Yahoo has licensed the technology from X1 Technologies."], "llama3.2:3b": ["Yahoo launches software allowing users to search e-mail and files on PCs, licensed from X1 Technologies, working with Outlook and Express e-mail programs, offering search by file name, size, date and time.", "The service aims to extend Yahoo's loyalty beyond the web, but has raised concerns over privacy and usefulness."], "gemma2:2b": ["Yahoo launched software for desktop search, allowing users to find files on their PCs.", "This follows the trend of other internet companies like Microsoft, Google, and Ask Jeeves, who are looking to expand beyond web searches.", "The software integrates with Outlook and Outlook Express email programs and offers features like searching by file name, size, date, and time.", "Yahoo intends to incorporate web search in future versions, focusing on linking desktop files to web content.", "This move has sparked concerns about privacy from human rights groups.", "Some experts view the focus on desktop search as a way of keeping up with rivals rather than a significant innovation, and believe more comprehensive search tools are needed."], "qwen2.5:0.5b": ["Yahoo has launched a software solution for e-mail and file searches on desktop computers.", "This new feature allows users to quickly access important files such as photos through an online interface.", "Yahoo's technology is designed to complement Microsoft's Outlook and Outlook Express programs, which offer similar features.", "The desktop search technology integrates with the company's existing email services and allows users to search for music, photos, and other documents without losing their web-based content.", "It also works independently on a computer's desktop, offering flexibility in how it searches and what files are included.", "Some human rights organizations criticize this move as potentially infringing on privacy rights, while others are concerned about the functionality of such services."], "qwen2.5:1.5b": ["Yahoo launches software for desktop search, following Microsoft, Google, and Ask Jeeves, offering e-mail, music, photos searches, but not web-based search capabilities yet.", "It's part of a growing trend in expanding loyalty beyond the web."], "qwen2.5:3b": ["Yahoo launches software for desktop search allowing users to find email and other files.", "This follows Microsoft, Google, and Ask Jeeves in offering similar services.", "Yahoo's technology integrates with Outlook/Outlook Express and can also search music, photos, and other files.", "Search is important due to increased spam and critical business information stored in emails.", "Analysts predict desktop search will extend beyond web content to files on users' PCs.", "Concerns about privacy have been raised by human rights groups.", "Some critics view the service as a mere competitive move rather than a useful feature, suggesting more comprehensive integration of internet, intranet, and desktop searches would be more valuable."], "opencoder:1.5b": ["Yahoo moves into desktop search.", "Internet giant Yahoo has launched software to allow users to search e-mail and other files on their PCs.", "The firm is following in the footsteps of Microsoft, Google and Ask Jeeves, which have offered similar services.", "Search has become a lucrative area of expansion for tech companies, looking to extend loyalty beyond the web.", "With hard drives providing bigger storage, users could need more help to locate important files, such as photos or videos.", "The desktop search technology is designed to work alongside Microsoft's Outlook and Outlook Express e-mail programs.", "Searching effectively is becoming increasingly important due to the amount of spam increases.", "According to research from analysts, up to 45% of businesses' critical information is stored in e-mail and attachments.", "Yahoo's software can also work separately on the desktop, searching for music, photos or other files.", "Users can search under a variety of criteria like file name, size, date and time, and it doesn't yet incorporate web searching.", "Yahoo’s promise to extend loyalty beyond the web has sparked concern about privacy issues.", "\"We are all getting more and more files on our desktop but the real commercial opportunity lies with linking this through to web content,\" said a research analyst.", "However, these concerns might not be as significant if users find their needs met by other services.", "It’s all about extending the idea of search and building a closer relationship with consumers, organising not just how they search on the internet but the files on their computer as well.", "Search engines are often the first port of call for users when they go onto the web.", "The new desktop search has rung alarm bells for human rights groups, concerned about the implications to privacy.", "More useful would be tools that can integrate all three (internet, intranet and desktop search) alongside improvements in key word searching.", "To conclude, while the introduction of Yahoo's desktop search could present a unique opportunity to extend the idea of search, it also brings with it concerns about privacy and user needs.", "Users might be more inclined to other services if they have satisfied their needs with web searching."], "smollm:1.7b": ["The summary accurately captures the main points of the text:\n\n1.", "Yahoo has launched software to allow people to search e-mail and other files on their PCs.", "2.", "The firm is following in the footsteps of Microsoft, Google, and Ask Jeeves, which have offered similar services.", "3.", "Search has become a lucrative and hotly-contested area of expansion for net firms, looking to extend loyalty beyond the web.", "4.", "With hard drives providing bigger storage, users could need more help to locate important files such as photos.", "5.", "The desktop search technology has been licensed from a US-based firm X1 Technologies.", "6.", "It is designed to work alongside Microsoft's Outlook and Outlook Express e-mail programs.", "7.", "Searching e-mail effectively is becoming increasingly important, especially as the amount of spam increases.", "8.", "According to research from message analysts the Radicati Group, up to 45% of businesses' critical information is stored in e-mail and attachments.", "9.", "Yahoo's software can also work separately on the desktop, searching for music, photos and other files.", "10.", "Users can search under a variety of criteria, including file name, size, date and time.", "11.", "It doesn't yet incorporate web searching, although Yahoo has promised that future versions will allow users to search both web-based and desktop data.", "12.", "\"We are all getting more and more files on our desktop but the real commercial opportunity lies with linking this through to web content,\" said Julian Smith, an analyst with research firm Jupiter.", "13.", "Search engines are often the first port of call for users when they go onto the web.", "14.", "The new foray into desktop search has rung alarm bells for human rights groups, concerned about the implications to privacy.", "15.", "Alexander Linden, vice president of emerging technologies at analyst firm Gartner, removed the Google product but has since removed it.", "16.", "He believes the rush to enter the desktop business is just a way of keeping up with rivals.", "17.", "More useful would be tools that can combine internet, intranet and desktop search alongside improvements to key word searching, he said."], "deepseek-r1:1.5b": ["Yahoo has launched desktop search to cater to users looking for efficient file management on their computers, extending its search capabilities beyond the web.", "Following Microsoft and Google's moves, Yahoo works with X1 Technologies to offer a service designed alongside Outlook.", "This feature allows users to search files like emails and attachments in Outlook Express, which also includes music, photos, and other data types.", "With 45% of businesses storing critical information in emails and attachments, this technology is seen as crucial for data management.", "The service promises future integration with web searches but faces concerns about privacy issues when used improperly, particularly by human rights groups.", "While products like Google's are being tested, many users may find them uninteresting or disruptive."], "tinyllama:1.1b": ["Despite launching software to enable users to search files on their PCs as well as e-mail and attachments, Yahoo has entered the market for desktop seaRCSH.", "The technology is designed to work alongside Microsoft's Outlook and Outlook Express programs.", "SeaRChing files, music, photos, and other data is becoming increasingly important, according to a study by analysts at Jupiter.", "The new launch represents a bid to extend the idea of seaRChing on the internet to desktop content as well.", "The move has rung alarm bells for human rights groups, concerned about the implicaation to privacy.", "Yahoo's latest product, called SeaRCh, is designed to complement Google's search tool and improve its usefulness.", "However, some analysts have expressed doubt that such a combination of desktop seaRChing tools would offer a meaningful improvement in search quality."], "tinydolphin:1.1b": [" Yahoo has expanded its search capabilities with the launch of software designed to allow users to search their email files on their desktops.", "This is a significant development in the area of online and desktop search, as it expands upon Microsoft's Outlook and Express e-mail client offerings.", "The new product will work alongside Microsoft's suite of e-mail applications, allowing users to find important documents, such as photos and documents, even when they are not on their desktops.", "The software is being offered by a US-based company, X1 Technologies, which has previously licensed its technology for integration with Outlook and other Microsoft programs.", "The new desktop search feature will allow users to search under various criteria, including file name, size, date and time, and even the presence of web links.", "Users can search within their desktops or perform a web-based search by entering the necessary criteria in the software.", "The software will be released for download as a standalone application, alongside Microsoft's Outlook and Express applications.", "The launch of Yahoo's desktop search product does not yet incorporate web searching, but it promises future updates that would allow users to search both web-based and desktop data.", "Julian Smith, an analyst with Jupiter, believes that the new software has the potential to expand the idea of search and connect more elements of consumers' online and offline lives through a single platform.", "However, some critics argue that the functionality of such services can be overwhelming and potentially intrusive.", "Alexander Linden, who removed Google's product from his desktop, believes that the rush to enter the desktop business is justified but feels that more advanced tools are needed for users to truly benefit from the potential convenience offered by desktop search."], "phi:2.7b": [" Yahoo has introduced software for desktop searches on PCs.", "The firm's new technology is aimed at helping users locate files on their hard drives.", "This service follows Microsoft, Google, and Ask Jeeves, who have already offered similar services.", "Searching e-mail effectively is becoming increasingly important as spam increases.", "Yahoo's software can also work separately on the desktop to search for music and photos.", "The technology has rung alarm bells for human rights groups.", "Some users like Alexander Linden, vice president of emerging technologies at Gartner, have downloaded the Google product but found it uninteresting.", "He believes there is no need for desktop search as internet search engines are sufficient."], "orca-mini:3b": [" Yahoo has introduced software to allow users to search their computers for e-mail and other files.", "The product is designed to work with Microsoft's Outlook and Outlook Express email programs and can search under different criteria such as file name, size, date and time.", "However, it does not yet incorporate web searching, but future versions of the desktop software will allow users to search both web-based and desktop data.", "The new service has rung alarm bells for privacy concerns, and some users have criticized the functionality of similar services.", "However, others believe that extending loyalty beyond the web is a lucrative and hotly contested area of expansion for net firms, and desktop search is just one of many features people would like.", "Improvements to key word searching are also necessary."], "hermes3:3b": [" Yahoo introduces desktop search technology, allowing users to find e-mails, photos etc on PCs.", "It licenses from X1 Technologies & designed to work with Microsoft Outlook/Outlook Express, but not web searches yet."], "stablelm-zephyr:3b": ["Yahoo launched desktop search software allowing users to search email and files on their PCs, following competitors like Microsoft, Google, and Ask Jeeves.", "The technology, licensed from X1 Technologies, works with Microsoft's Outlook programs and can also search for music, photos, and other files on the desktop.", "It enables users to search under various criteria, including file name, size, date, and time.", "Although not incorporating web searching yet, future versions will allow users to search both web-based and desktop data.", "The move into desktop search raised concerns over privacy implications from human rights groups, while some criticized the usefulness of the feature compared to other tools aiming to combine internet, intranet, and desktop search alongside improvements to key word searching."], "chatgpt-4o-latest": ["Yahoo has launched desktop search software to help users find emails and files on their PCs, following similar moves by Microsoft, Google, and Ask Jeeves.", "The technology, licensed from X1 Technologies, integrates with Microsoft's Outlook and Outlook Express and allows searches based on various criteria.", "Yahoo aims to expand search beyond the web, enhancing user loyalty.", "Future versions will integrate web and desktop search.", "Analysts see this as a strategy to deepen consumer relationships, though some question its usefulness.", "Privacy concerns have also been raised by human rights groups."], "stablelm2:1.6b": ["Yahoo has launched a software for PC users to search their emails and files effectively with the help of X1 Technologies.", "The technology is compatible with Microsoft's Outlook and Outlook Express email programs and allows users to search under various criteria like file name, size, date, and time.", "However, it does not yet incorporate web searching.", "This expansion into desktop search follows the footsteps of rivals such as Microsoft, Google, and Ask Jeeves.", "While search has become a lucrative area for net firms looking to extend their services beyond the internet, there are concerns about privacy implications for users, and some analysts believe that the usefulness of such services might not be high due to competition from other features like improved keyword searching."], "granite3.1-dense:2b": ["Yahoo has introduced desktop search software for PC users, enabling them to find files within email, documents, music, and photos using various criteria like name, size, date, and time.", "This move follows industry giants Microsoft, Google, and Ask Jeeves, which have already entered the market.", "The technology, licensed from X1 Technologies, integrates with Outlook and Outlook Express for e-mail management, addressing the growing need to locate critical information stored in emails as spam increases.", "Up to 45% of businesses' essential data is believed to reside in email attachments, according to Radicati Group research.", "Yahoo's desktop search service can operate independently or alongside web searching, with plans for future integration of both.", "Analysts view this development as a strategic move by internet companies to extend their influence beyond the web and enhance user experience by consolidating file management with online searches.", "However, privacy advocates are concerned about potential privacy implications due to the broad data access offered by these services.", "Critics like Alexander Linden from Gartner find the functionality underwhelming, suggesting that combining internet, intranet, and desktop search, along with improved keyword searching tools, would be more beneficial for users."]}