{"raw_text": "US state acts to stop 'spammers'\n \n US state Texas has filed a lawsuit against two men believed to be among the world's top five spammers.\n \n It is seeking millions of dollars in damages in a civil lawsuit filed earlier this week. The Texas attorney general said it started the legal action as messages sent by the alleged spammers broke three laws governing e-mail marketing. The company named in the lawsuit denied any wrongdoing and said it complied with all relevant laws.\n \n The Texas lawsuit was filed against Ryan Samuel Pitylak, a University ofTexas student, and Mark Stephen Trotter of California. Both are thought to be the top executives in three companies - PayPerAction LLC., Leadplex LLC. and Leadplex Inc - that are suspected of sending out many millions of unwanted e-mail messages. \"Illegal spam must be stopped,\" said Greg Abbott, Texas attorney general announcing the legal action. \"Spam is one of the most aggravating and pervasive problems facing consumers today.\" The attorney general alleges that messages sent by Mr Pitylak and Mr Trotter's companies broke the 2003 Controlling the Assault of Non-Solicited Pornography and Marketing Act (Can-Spam) as well as the Texas Electronic Mail and Solicitation Act and Texas Deceptive Trade Practices Act. All three acts confer cash penalties for each violation of their terms. If the men are found guilty and all penalties are applied, the two men could face a damages bill running into millions. Mr Abbott said the messages sent by the pair broke laws by using misleading subject lines, not identifying themselves as adverts and offering services for which they had no licence to do so in Texas. Lawyers for the alleged spammers said the lawsuit was groundless and the two men would defend themselves strongly against the accusations. \"Leadplex and PayPerAction are legitimate internet marketing companies that are in complete compliance with the federal Can-Spam Act,\" said Lin Hughes, speaking on behalf of Mr Pitylak and Mr Trotter. In a similar move the US Federal Trade Commission (FTC) has won a court order that stops an international group of spammers sending sexually explicit e-mail. The FTC took the action because the messages being sent violated several parts of the CAN-Spam Act. In particular, the pornographic messages did not identify themselves as being sexually explicit, had deceptive subject headings, did not have working opt-out mechanisms, failed to mention they were adverts and did not give the sender's real world address. The court order stops the spammers sending e-mail and freezes assets prior to a hearing on a permanent injunction.\n", "llama3.2:1b": ["US state Texas files lawsuit against two men suspected of being among the world's top five spammers for allegedly breaking laws governing e-mail marketing with messages sent from companies PayPerAction LLC, Leadplex LLC, and Leadplex Inc in millions of dollars in damages.", "The lawsuits allege that the companies broke laws by sending misleading subject lines, not identifying themselves as adverts, and offering services without a license."], "llama3.2:3b": ["US state Texas filed a lawsuit against two men believed to be among the world's top five spammers, seeking millions of dollars in damages for breaking three laws governing e-mail marketing, including the Can-Spam Act.", "The company denied any wrongdoing and said it complied with all relevant laws.", "The case is similar to another ongoing action by the US Federal Trade Commission against an international group of spammers who sent sexually explicit e-mail violating several parts of the CAN-Spam Act."], "gemma2:2b": ["Texas has filed a lawsuit against two men, Ryan Samuel Pitylak and Mark Stephen Trotter, accused of being among the top five spammers globally.", "The lawsuit alleges that their companies violated three laws concerning email marketing, seeking millions of dollars in damages.", "The defendants deny any wrongdoing and claim to comply with all applicable laws.", "The case follows a similar action by the FTC which obtained an order stopping international spammers sending sexually explicit emails that violated CAN-Spam Act regulations."], "qwen2.5:0.5b": ["The US state of Texas has filed a lawsuit against two men suspected of creating spam by sending out millions of unwanted messages.", "They claim that the messages violated three federal laws, including the Can-Spam Act, which imposes a $20,000 monetary penalty for each violation.", "The company named in the lawsuit denied any wrongdoing and said it complied with all relevant laws."], "qwen2.5:1.5b": ["Texas sues two alleged Texas-based spammers for millions in damages following allegations that their companies send unwanted spam, violating multiple state laws.", "The lawsuit seeks penalties under federal CAN-Spam Act provisions.", "Spammer's lawyers deny wrongdoing but agree with FTC overclassification of their activities as pornographic spam."], "qwen2.5:3b": ["US state Texas files lawsuit against two men suspected of being among the top five spammers, seeking millions in damages.", "They are alleged to operate three companies that sent many millions of unwanted emails.", "The lawsuit claims their messages violated Can-Spam Act and other Texas laws, including misleading subject lines, no self-identification as adverts, offering unlicensed services, deceptive opt-out mechanisms, lack of real-world sender address.", "Attorneys for the defendants dispute the allegations, claiming they are legitimate internet marketing companies compliant with federal CAN-Spam Act.", "The US Federal Trade Commission has also banned an international group of spammers using similar grounds violating CAN-Spam Act, leading to a court order stopping their email sending and asset freezing pending hearing on permanent injunction."], "opencoder:1.5b": ["The US state of Texas has filed a lawsuit against two men believed to be among the top five spammers seeking damages in a civil action filed earlier this week.", "The lawsuit alleges that messages sent by these alleged spammers broke three laws governing e-mail marketing, which includes the 2003 Controlling the Assault of Non-Solicited Pornography and Marketing Act (Can-Spam) and the Texas Electronic Mail and Solicitation Act and Texas Deceptive Trade Practices Act.", "These violations violate the law and could result in penalties that include a damages bill running into millions.", "The attackers used misleading subject lines, not identifying themselves as advertisers, offered services for which they had no permission to do so in Texas, and failed to provide their real-world address or opt-out mechanisms.", "If found guilty and all penalties are imposed, the men would face damages."], "smollm:1.7b": ["The US state Texas has filed a lawsuit against two men believed to be among the world's top five spammers.", "It is seeking millions of dollars in damages in a civil lawsuit filed earlier this week.", "The company named in the lawsuit denied any wrongdoing and said it complied with all relevant laws.", "The Attorney General of Texas, Greg Abbott, announced the legal action on Friday morning.", "Both men are thought to be the top executives in three companies - PayPerAction LLC., Leadplex LLC.", "and Leadplex Inc. - that are suspected of sending out many millions of unwanted e-mail messages.", "\"Illegal spam must be stopped,\" said Greg Abbott, Attorney General of Texas.", "\"Spam is one of the most aggravating and pervasive problems facing consumers today.\"", "The Attorney General alleges that messages sent by Mr Pitylak and Mr Trotter's companies broke laws by using misleading subject lines, not identifying themselves as adverts and offering services for which they had no license to do so in Texas.", "Lawyers for the alleged spammers said the lawsuit was groundless and the two men would defend themselves strongly against the accusations.", "\"Leadplex and PayPerAction are legitimate internet marketing companies that are in complete compliance with the federal CAN-Spam Act,\" said Lin Hughes, speaking on behalf of Mr Pitylak and Mr Trotter.", "In a similar move the US Federal Trade Commission (FTC) has won a court order that stops an international group of spammers sending sexually explicit e-mail.", "The FTC took the action because the messages being sent violate several parts of the CAN-Spam Act.", "In particular, the pornographic messages did not identify themselves as being sexually explicit, had deceptive subject headings, did not have working opt-out mechanisms, failed to mention they were adverts and did not give the sender's real world address.", "The court order stops the spammers sending e-mail and freezes assets prior to a hearing on a permanent injunction."], "deepseek-r1:1.5b": ["Texas filed a lawsuit against Ryan Samuel Pitylak and Mark Stephen Trotter, the top executives of three spam companies.", "They claim their messages broke laws like CTSPAM and the federal CTPTA for explicit emails.", "The state seeks millions in damages."], "tinyllama:1.1b": ["Première partie :\n\nUS state acts to stop 'spammer' et il y a un rapport entre le CAN-SPAM et les lois anti-spam du Texe en tant que deux lois concernant l’email marketing.", "Le texte de la loi CAN-SPAM a été étendu à toutes sortes d’entreprises dans le texte des lois anti-spam du Texas, qui vise à empêcher ou réduire les messages spam.", "Cette première partie est basée sur la lettre de mail adressée au directeur général de PayPerAction, LLP, et à Mark Stephen Trottier, étudiant du Texas University, qui sont accusés d’utiliser le moineau commercial pour diffuser des e-mails indemnisé par les lois anti-spam.", "Bien que la deuxième partie n’est pas disponible dans les sources textuelles, elle a été extraite à partir du texte de l’article initial.", "Texas acte de litige contre deux personnnes pour des droits sur le marché des e-mails.", "Le texte est étendu aux trois sociétés mentionnées.", "L’attorney general d’État du Texas a porté plainte contre les deux hommes accusés d’utiliser les lois anti-spam de texas contre des entreprises pour diffuser des e-mails indemnisés par ces lois, en appliquant les contrats de contrat à un autre niveau, c’est-à-dire que l’accord entre les deux sociétés n’est pas valide.", "La Texas doit recevoir 2003 Loi sur le contrôle des messages non soumise aux usagers du marché électronique et lois anti-spam de texas et la Texas doit recevoir la 1ere version du texte de la loi anti-spam de texas.", "L’une des contraintes d’application impose à tous les e-mails de diffuser des messages spam, ce qui implique que certaines e-mails soient identifiables comme telles, que leur sujet ne fasse pas partie du contrat de diffusion et que leurs adresses de réception sont forfaitaires.", "Les deux hommes accusés d’utiliser les lois anti-spam de texas contre des entreprises pour diffuser des e-mails indemnisés par ces lois ont été jugés par la Cour suprême du Texas et découvrent que leur message n’était pas en accord avec les contraintes de la loi anti-spam de texas.", "Les deux hommes peuvent être condamnées à des pilles pour chaque violation de la contrainte de diffusion de messageries électroniques de texas, et ils pourront récupérer une pille pour avoir été jugés par la Cour suprême du Texas."], "tinydolphin:1.1b": [" US state Texas has filed a lawsuit against two men believed to be among the top five spammers, seeking millions of dollars in damages.", "The suit was filed earlier this week and is against Ryan Pitylak and Mark Stephen Trotter.", "Both are believed to be the top executives in three companies - PayPerAction LLC., Leadplex LLC, and Leadplex Inc. - that are suspected of sending out many millions of unwanted e-mail messages.", "Texas attorney general Greg Abbott announced this action as part of efforts to stop spamming.", "The lawsuit alleges that the messages sent by Mr Pitylak and Mr Trotter's companies broke the 2003 Controlling the Assault of Non-Solicited Pornography and Marketing Act, the Texas Electronic Mail and Solicitation Act, and the Texas Deceptive Trade Practices Act.", "If found guilty and all penalties are applied, the two men could face millions of dollars in damages."], "phi:2.7b": [" Texas has filed a lawsuit against two suspected top five spammers over messages that broke three laws governing e-mail marketing.", "If found guilty, they could face damages of millions of dollars under these acts.", "The alleged spammers deny any wrongdoing but are being defended by their lawyers.", "The US Federal Trade Commission (FTC) has also taken legal action to stop an international group of spammers sending sexually explicit messages that violate the CAN-Spam Act."], "orca-mini:3b": [" Texas has sued two men, Ryan Samuel Pitylak and Mark Stephen Trotter, who are believed to be among the top five spammers in the world.", "The lawsuit seeks millions of dollars in damages for violating three laws governing e-mail marketing.", "Texas Attorney General accused them of breaking the Can-Spam Act by using misleading subject lines, not identifying themselves as ads and offering services without a license in Texas.", "The two men have denied any wrongdoing and claim they are legitimate internet marketers in compliance with the federal Can-Spam Act."], "hermes3:3b": ["US \n Texas files lawsuit against top spammer executives\n Pitylak & Trotter (alleged top 5 spammers)\n Aims to seek millions in damages\n Breached Can-Spam, Texas Electronic Mail and Solicitation Act, Texas Deceptive Trade Practices Act\n Alleges misleading subject lines, no identification as adverts, unlicensed services."], "stablelm-zephyr:3b": ["Texas has filed a lawsuit against two men, believed to be top spammers, seeking millions of dollars in damages for breaking laws governing email marketing.", "The alleged spam messages broke the 2003 Controlling the Assault of Non-Solicited Pornography and Marketing Act (Can-Spam), the Texas Electronic Mail and Solicitation Act, and the Texas Deceptive Trade Practices Act.", "Lawyers for the spammers deny the allegations, stating their clients are compliant with federal laws.", "This lawsuit follows a similar move by the US Federal Trade Commission, which obtained a court order to stop an international group of spammers sending sexually explicit emails violating several parts of the CAN-Spam act."], "chatgpt-4o-latest": ["Texas has filed a lawsuit against Ryan Samuel Pitylak and Mark Stephen Trotter, accusing them of being among the world's top spammers.", "The lawsuit seeks millions in damages, alleging violations of the federal CAN-Spam Act, the Texas Electronic Mail and Solicitation Act, and the Texas Deceptive Trade Practices Act.", "The accused allegedly sent misleading emails, failed to identify them as advertisements, and offered unlicensed services.", "The defendants deny wrongdoing, claiming compliance with the law.", "Meanwhile, the US Federal Trade Commission has secured a court order against an international spam group for violating the CAN-Spam Act by sending deceptive, sexually explicit emails.", "The order halts their activities and freezes assets pending further legal action."], "stablelm2:1.6b": ["Texas files lawsuit against two alleged spammers, including Ryan Samuel Pitylak and Mark Stephen Trotter, who are executives in three companies suspected of sending millions of unwanted email messages.", "The lawsuit alleges that the accused broke three laws governing e-mail marketing by using misleading subject lines, not identifying themselves as ads, and offering services without a license to do so in Texas.", "Both men deny any wrongdoing and claim to comply with all relevant laws.", "If found guilty, they could face a damages bill of millions."], "granite3.1-dense:2b": ["Texas' attorney general, Greg Abbott, has initiated a lawsuit against two men—Ryan Samuel Pitylak, a University of Texas student, and Mark Stephen Trotter from California—alleging they are among the world's top five spammers.", "The state is seeking millions in damages for alleged violations of the 2003 Controlling the Assault of Non-Solicited Pornography and Marketing Act (Can-Spam), Texas Electronic Mail and Solicitation Act, and Texas Deceptive Trade Practices Act.", "Abbott claims the men's companies, PayPerAction LLC., Leadplex LLC., and Leadplex Inc., sent unwanted emails breaking these laws by using misleading subject lines, not identifying ads, and offering services without proper licences in Texas.", "The accused internet marketing companies maintain their innocence, asserting compliance with Can-Spam and other regulations.", "In a related development, the US Federal Trade Commission (FTC) secured a court order to halt an international spamming group's sexually explicit email campaign due to violations of multiple CAN-Spam Act provisions, including lack of explicit identification, deceptive subject lines, absence of opt-out mechanisms, and failure to disclose advertiser status.", "The FTC also froze the spammers' assets pending a hearing for a permanent injunction."]}