{"raw_text": "Souped-up wi-fi is on the horizon\n \n Super high-speed wireless data networks could soon be in use in the UK.\n \n The government's wireless watchdog is seeking help on the best way to regulate the technology behind such networks called Ultra Wideband (UWB). Ofcom wants to ensure that the arrival of UWB-using devices does not cause problems for those that already use the same part of the radio spectrum. UWB makes it possible to stream huge amounts of data through the air over short distances. One of the more likely uses of UWB is to make it possible to send DVD quality video images wirelessly to TV screens or to let people beam music to media players around their home. The technology has the potential to transmit hundreds of megabits of data per second. UWB could also be used to create so-called Personal Area Networks that let a person's gadgets quickly and easily swap data amongst themselves. The technology works over a range up to 10 metres and uses billions of short radio pulses every second to carry data. At the recent Consumer Electronics Show in Las Vegas products with UWB chips built-in got their first public airing.\n \n Currently, use of UWB is only allowed in the UK under a strict licencing scheme. \"We're seeking opinion from industry to find out whether or not we should allow UWB on a licence-exempt basis,\" said a spokesman for Ofcom.\n \n Companies have until 24 March to respond. In April the EC is due to start its own consultation on Europe-wide adoption of UWB. The cross-Europe body for radio regulators, known as the European Conference of Postal and Telecommunications Administrations (CEPT), is carrying out research for this harmonisation programme. Early sight of the CEPT work has caused controversy as some think it over-emphasises UWB's potential to interfere with existing users. By contrast a preliminary Ofcom report found that it would be quite straight-forward to deploy UWB without causing problems for those that already use it. The Ofcom spokesman said it was considering imposing a \"mask\" or set of technical restrictions on UWB-using devices. \"We would want these devices to have very strict controls on power levels so they can not transmit a long way or over a wide area,\" he said. Despite the current restrictions the technology is already being used. Cambridge-based Ubisense has about 40 customers around the world using the short-range radio technology, said David Theriault, standards and regulatory liaison for Ubisense. He said that UWB was driving novel ways to interact with computers. \"It's like having a 3D mouse all the time,\" he said. He said that European decisions on what to do with UWB allied with IEEE decisions on the exact specifications for it would help drive adoption. Prior to its adoption as a way for gadgets and computers to communicate, UWB was used as a sensing technology. It is used to spot such things as cracks under the surface of runways or to help firemen detect people through walls.\n", "llama3.2:1b": ["Super high-speed wireless data networks could soon be available in the UK.", "The government's Ofcom wants to regulate how these networks use the radio spectrum, which are known as Ultra Wideband (UWB).", "UWB allows for streaming huge amounts of data over short distances, and it has potential uses such as transmitting video images wirelessly or creating Personal Area Networks for devices.", "Companies must respond to a request for opinion by 24 March on whether to allow UWB on a licence-exempt basis."], "llama3.2:3b": ["The UK government's wireless watchdog, Ofcom, is seeking industry opinion on regulating Ultra Wideband (UWB) technology, which could soon be available in high-speed wireless data networks in the country.", "UWB has the potential to transmit hundreds of megabits of data per second and is expected to be used for applications such as streaming video and music wirelessly.", "Currently, use of UWB is only allowed under a strict licensing scheme, but Ofcom considers allowing it on a license-exempt basis.", "The European Conference of Postal and Telecommunications Administrations (CEPT) has also launched research on harmonization of UWB adoption across Europe, sparking controversy over its potential to interfere with existing users."], "gemma2:2b": ["Ultra Wideband (UWB) is a high-speed wireless data network technology with potential applications in sending video, music, and enabling peer-to-peer communication.", "Ofcom is seeking public opinion on whether to allow UWB on a license-exempt basis.", "The European Conference of Postal and Telecommunications Administrations (CEPT) is researching UWB regulation, while early research suggests limited interference with existing users.", "Ubisense, a company using UWB, cites its use in novel computer interfaces."], "qwen2.5:0.5b": ["UK will soon allow ultra wideband (UWB) technology which could revolutionise wireless technology, and make it possible to stream huge amounts of data wirelessly over short distances.", "UWB can be used in video streaming, Personal Area Networks for gadgets, and 3D mouse usage.", "The cross-Europe CEPT research is underway."], "qwen2.5:1.5b": ["The UK government's wireless watchdog seeks input on regulating Ultra Wideband (UWB) technology that could soon be licensed for use without restrictions, enabling faster data transfer and potentially creating Personal Area Networks.", "UWB allows short-range, low-power transmission of hundreds of megabits per second, with applications like wirelessly streaming high-quality video or sharing music via devices around a home.", "However, concerns exist about potential interference with existing radio spectrum users.", "The government is considering implementing technical restrictions on UWB devices to minimize risks."], "qwen2.5:3b": ["Super high-speed wi-fi networks could soon be available in the UK via Ultra Wideband (UWB) technology.", "The government’s wireless watchdog, Ofcom, is seeking advice on how to regulate UWB devices without causing interference for existing users.", "Likely uses include streaming video and sending music wirelessly within homes, with potential data transmission speeds of hundreds of megabits per second.", "Currently, UWB usage in the UK requires strict licensing; Ofcom aims to allow it on an unlicensed basis by April 2007 when the European Commission will begin a consultation.", "Research suggests UWB poses minimal risk to current users if properly controlled.", "Companies already using UWB technology include Ubisense, which utilizes it for short-range communication applications such as detecting cracks in runways and identifying people behind walls."], "opencoder:1.5b": ["Souped-up wi-fi is on the horizon.", "Super high-speed wireless data networks could soon be in use in the UK.", "The government's wireless watchdog is seeking help on the best way to regulate the technology behind such networks called Ultra Wideband (UWB).", "Ofcom wants to ensure that the arrival of UWB-using devices does not cause problems for those that already use the same part of the radio spectrum.", "UWB makes it possible to stream huge amounts of data through the air over short distances.", "One of the more likely uses of UWB is to make it possible to send DVD quality video images wirelessly to TV screens or to let people beam music to media players around their home.", "The technology has the potential to transmit hundreds of megabits of data per second.", "UWB could also be used to create so-called Personal Area Networks that let a person's gadgets quickly and easily swap data amongst themselves.", "Currently, use of UWB is only allowed in the UK under a strict licencing scheme.", "\"We're seeking opinion from industry to find out whether or not we should allow UWB on a licence-exempt basis,\" said a spokesman for Ofcom.", "Companies have until 24 March to respond.", "In April the EC is due to start its own consultation on Europe-wide adoption of UWB.", "The cross-Europe body for radio regulators, known as the European Conference of Postal and Telecommunications Administrations (CEPT), is carrying out research for this harmonisation programme.", "Early sight of the CEPT work has caused controversy as some think it over-emphasises UWB's potential to interfere with existing users.", "By contrast a preliminary Ofcom report found that it would be quite straight-forward to deploy UWB without causing problems for those that already use it.", "The Ofcomspeaker said it was considering imposing a \"mask\" or set of technical restrictions on UWB-using devices.", "\"We would want these devices to have very strict controls on power levels so they can not transmit a long way or over a wide area,\" he said."], "smollm:1.7b": ["The summary above captures the main ideas from the original text:\n\n1.", "Super-fast wireless data networks are being developed in the UK, with the government seeking guidance on how to regulate them.", "2.", "The technology behind these networks is called Ultra Wideband (UWB), which allows for high-speed data transmission over short distances.", "3.", "The government wants to ensure that the arrival of UWB-using devices does not cause problems for those already using the same part of the radio spectrum.", "4.", "The UK's wireless watchdog, Ofcom, is seeking input from industry on how to allow UWB on a license-exempt basis and what technical restrictions should be placed on UWB-using devices to prevent interference with existing users.", "5.", "Companies are already using UWB technology in various applications, such as the Ubisense 3D mouse.", "6.", "The European Conference of Postal and Telecommunications Administrations (CEPT) is conducting research for harmonization of UWB across Europe, which could lead to early adoption by other countries.", "7.", "Early sight of the CEPT work has caused controversy due to concerns about potential interference with existing users.", "However, Ofcom is considering imposing a \"mask\" or set of technical restrictions on UWB-using devices to prevent interference."], "deepseek-r1:1.5b": ["In the near future, Ultra Wideband (UWB) networks may emerge as high-speed data transmission technology in the UK.", "The government seeks guidance on regulating UWB devices to prevent unintended interference with existing radio spectrum users.", "Current licensing is strict, but cross-contamination risks are significant.", "Industry opinions call for clarity on UWB licensing and development.", "A EU-regulated harmonisation process (CEPT) is under way but faces scrutiny as it emphasizes UWB's potential overlap with existing networks.", "Companies like Ubisense are integrating UWB into devices, despite its initial use in sensing applications, which may shift towards communication in the future."], "tinyllama:1.1b": ["Another way in which Ultra Wi-Fi networks could be used is for sending high-quality video and music images wirelessly to TV screens or streaming them to media players around a person's home.", "The technology, called Ultra Wi-Band (UWB), can transmit data up to 10 meters per second and use billion-millisecond radio pulse periods to transfer data quickly.", "However, the proposed introduction of UWB in the UK is only allowed under a strict licencing scheme, with companies having until April to respond to a cross-European body for radio regulators' research.", "Early sight of Ofcom's work suggests that it will not cause problems for those who currently use such networks, while one expert is considering imposing strict controls on UWB-using devices to avoid potential interference.", "With the technology already being used in various fields, including computer sensing and firefighting, UWB could become an indispensable communication tool in many applications."], "tinydolphin:1.1b": [" The introduction talks about a new wireless technology called Ultra Wideband (UWB) that could revolutionize how we communicate and interact with our devices in the future.", "It is expected to enable faster data transfers, improved streaming capabilities, and the ability to send high-resolution images wirelessly over short distances.", "The author explains that Ofcom, the UK's wireless regulator, is currently exploring ways to allow UWB-using devices without causing problems for those who already use the same part of the radio spectrum.", "The ultimate goal is to make these wireless networks more accessible and convenient for consumers.", "The author mentions that a preliminary Ofcom report found that deploying UWB without issue would be quite straightforward, with a mask being considered by the regulator.", "However, there are concerns about potential interference issues if too many devices use this technology simultaneously.", "The author suggests that a more advanced approach might involve setting strict controls on power levels to prevent overexposure to users who may not need it.", "The author also quotes David Theriault from Ubisense, an American company developing ultra-wideband technology, who explains that the new wireless system is driving innovative ways for computers to interact with objects around us and enhance our lives in various ways.", "He mentions specific examples of how UWB is being used to create a more intuitive way for users to control their devices by using gestures or voice commands.", "The author concludes by saying that these new wireless technologies will revolutionize the way we connect, interact, and access information in the future."], "phi:2.7b": [" The government' wireless watchdog seeks feedback on regulating Ultra Wideband (UWB) technology in the UK to prevent problems with existing users who use the same radio spectrum.", "UWB has the potential to transmit large amounts of data over short distances and is used for creating Personal Area Networks, streaming high-quality video and music wirelessly through a 10-meter range using billions of short radio pulses.", "Currently, its use in the UK requires licensing under strict regulations.", "In April, the European Conference of Postal and Telecommunications Administrations (CEPT) will start a consultation on implementing UWB throughout Europe.", "A preliminary Ofcom report shows that it would be straightforward to deploy UWB without interference with existing users, but further restrictions may be necessary for devices' power levels.", "Despite current restrictions, Ubisense has 40 customers worldwide using UWB as a way to interact with computers, which could drive adoption if EU and IEEE decisions are aligned.", "UWB was initially used as a sensing technology and is being adopted in new ways, such as creating a \"3D mouse\" for interacting with machines."], "orca-mini:3b": [" The UK is planning to allow super high-speed wireless data networks known as Ultra Wideband (UWB) to be used in the future.", "The government's wireless watchdog, Ofcom, wants to ensure that the arrival of UWB-using devices does not cause problems for those that already use the same part of the radio spectrum.", "Ofcom is seeking help on how to regulate the technology behind such networks.", "Companies have until 24 March to respond to a consultation on UWB's use in Europe, which could lead to widespread adoption across the continent.", "Some worry that UWB could interfere with existing users, but a preliminary report from Ofcom found that it would be straightforward to deploy UWB without causing problems.", "UWB is already being used by Cambridge-based Ubisense and has potential applications for streaming huge amounts of data through the air over short distances."], "hermes3:3b": ["UWB super-high speed wireless networks may soon be regulated in UK, potentially for streaming video, music, and data sharing over short distances without licencing restrictions.", "Ofcom seeks opinions on technical controls for UWB devices to avoid interference with existing users."], "stablelm-zephyr:3b": ["Super high-speed wireless data networks, called Ultra Wideband (UWB), might be allowed soon in the UK.", "The government wants to make sure UWB doesn't cause problems for other devices using the same part of radio spectrum.", "UWB can send lots of information quickly and it could be used to send DVD quality videos or music wirelessly.", "Some people think UWB could interfere with other devices, but a recent report said it would be easy to use without issues.", "Companies have until March 24th to share their thoughts on the matter."], "chatgpt-4o-latest": ["Super high-speed wireless networks using Ultra Wideband (UWB) technology could soon be deployed in the UK.", "Ofcom is consulting on how to regulate UWB to prevent interference with existing radio spectrum users.", "UWB enables high-speed data transfer over short distances, allowing wireless streaming of DVD-quality video and music, as well as creating Personal Area Networks for device communication.", "The technology, showcased at the Consumer Electronics Show, operates within a 10-metre range using billions of short radio pulses.", "Currently, UWB use in the UK requires a license, but Ofcom is considering making it license-exempt with strict power controls.", "The European Commission and CEPT are also reviewing UWB regulation, though concerns exist about potential interference.", "Despite restrictions, companies like Ubisense are already using UWB for applications such as 3D interaction and sensing technologies, including detecting structural cracks and locating people through walls."], "stablelm2:1.6b": ["Super high-speed wireless data networks may become widespread in the UK soon with ultra-wideband (UWB) technology potentially enabling DVD-quality video streaming and transmitting hundreds of megabits of data per second.", "UWB allows for Personal Area Networks, allowing devices to exchange data up to 1 meter away.", "The UK currently permits UWB use under a licensing scheme but Ofcom is seeking industry input on whether to allow UWB on a license-exempt basis.", "Companies have until March to respond.", "Europe-wide adoption of UWB is due in April and the European Conference of Postal and Telecommunications Administrations (CEPT) is carrying out research for the harmonization program.", "The current restrictions already exist, with Ubisense using UWB technology for short-range radio sensing applications."], "granite3.1-dense:2b": ["The UK government's wireless regulator, Ofcom, is exploring the possibility of licensing super-fast, short-range wireless data networks called Ultra Wideband (UWB) without strict restrictions.", "These networks, capable of transmitting hundreds of megabits per second over distances up to 10 meters, could enable high-quality video streaming, seamless data transfer between gadgets, and the creation of Personal Area Networks.", "Currently, UWB operation in the UK is limited under a strict licensing scheme.", "In response to this, Ofcom has sought industry input on whether it should allow UWB on a license-exempt basis.", "Companies have until March 24 to provide their views, and Ofcom will make a decision in April.", "The European Conference of Postal and Telecommunications Administrations (CEPT) is conducting research for potential EU-wide adoption, but preliminary findings emphasize potential interference with existing users.", "UWB has already been employed by Cambridge-based Ubisense for various applications, including 3D interaction with computers.", "Despite current restrictions, the technology is in use and driving innovative methods of computer interaction.", "IEEE's specifications for UWB will also play a role in its future adoption, alongside European decisions on regulation.", "Before its wireless data use, UWB served as a sensing technology, helping detect cracks or people through walls."]}