{"raw_text": "EA to take on film and TV giants\n \n Video game giant Electronic Arts (EA) says it wants to become the biggest entertainment firm in the world.\n \n The US firm says it wants to compete with companies such as Disney and will only achieve this by making games appeal to mainstream audiences. EA publishes blockbuster titles such as Fifa and John Madden, as well as video game versions of movies such as Harry Potter and the James Bond films. Its revenues were $3bn (£1.65bn) in 2004, which EA hoped to double by 2009. EA is the biggest games publisher in the world and in 2004 had 27 titles which sold in excess of one million copies each. Nine of the 20 biggest-selling games in the UK last year were published by EA.\n \n Gerhard Florin, EA's managing director for European publishing, said: \"Doubling our industry in five years is not rocket science.\" He said it would take many years before EA could challenge Disney - which in 2004 reported revenues of $30bn (£16bn) - but it remained a goal for the company. \"We will be able to bring more people into gaming because games will be more emotional.\" Mr Florin predicted that the next round of games console would give developers enough power to create real emotion.\n \n \"It's the subtleties, the eyes, the mouth - 5,000 polygons doesn't really sell the emotion.\n \n \"With PS3 and Xbox 2, we can go on the main character with 30,000 to 50,000 polygons,\" he said. \"With that increased firepower, the Finding Nemo video game looks just like the movie, but it will be interactive.\" Mr Florin said that more than 50% of all EA's games were sold to adults and played by adults, but the perception remained that the video game industry was for children. \"Our goal is to bring games to the masses which bring out emotions.\" EA said the video game industry was now bigger than the music industry. \"Nobody queues for music anymore.\"\n \n \"You can't ignore an industry when people queue to buy a game at midnight because they are so desperate to play it,\" he said, referring to demand for titles for such as Grand Theft Auto: San Andreas and Halo 2.\n \n Jan Bolz, EA's vice president of sales and marketing in Europe, said the firm was working to give video games a more central role in popular culture. He said the company was in advanced stages of discussions over a reality TV show in which viewers could control the actions of the characters as in its popular game The Sims. \"One idea could be that you're controlling a family, telling them when to go to the kitchen and when to go to the bedroom, and with this mechanism you have gamers all over the world 'playing the show',\" said Mr Bolz.\n \n He also said EA was planning an international awards show \"similar to the Oscars and the Grammys\" which would combine video games, music and movies. Mr Bolz said video games firm had to work more closely with celebrities. \"People will want to play video games if their heroes like Robbie Williams or Christina Aguilera are in them.\" Mr Florin said the challenge was to keep people playing in their 30s, 40s and 50s. \"There's an indication that a 30 year old comes home from work and still wants to play games. \"If that's true, that's a big challenge for TV broadcasters - because watching TV is the biggest pastime at present.\"\n", "llama3.2:1b": ["Electronic Arts (EA) aims to become the world's largest entertainment firm by making its games appealing to mainstream audiences.", "The company publishes titles like FIFA and John Madden, as well as video game versions of popular movies such as Harry Potter and James Bond.", "EA has already achieved success with 27 top-selling games in the UK in 2004 and plans to double revenues over five years.", "The company's managing director expects it will be able to challenge Disney within that timeframe but emphasizes the need for more emotional storytelling in its games."], "llama3.2:3b": ["EA plans to compete with Disney by making games appeal to mainstream audiences, aiming to double its industry in five years and become the biggest entertainment firm in the world.", "EA's managing director believes that more sophisticated graphics will bring emotion to games, citing examples like Finding Nemo and Grand Theft Auto: San Andreas.", "The company is working on a reality TV show where viewers can control characters, and planning an international awards show combining video games, music, and movies."], "gemma2:2b": ["Electronic Arts (EA) aims to become the largest entertainment company globally by focusing on mainstream audiences.", "The company publishes popular video game titles like FIFA and John Madden and has strong ties to film franchises like Harry Potter and James Bond.", "EA believes its games will be more emotionally engaging with the advancements in game console technology, specifically targeting adults.", "EA sees the gaming industry as bigger than the music industry with a high demand for release titles such as Grand Theft Auto: San Andreas and Halo 2.", "They plan to increase video game's role in popular culture by creating reality TV shows and an international awards show featuring video games, music, and movies.", "They believe that celebrities playing in their video games will be attractive to audiences."], "qwen2.5:0.5b": ["EA aims to become the world’s biggest entertainment firm by competing with Disney in video game titles and expanding its appeal to mainstream audiences.", "The company has produced numerous blockbuster games like Fifa and Harry Potter, while also publishing movies and making video adaptations of them.", "EA's revenues were $3 billion in 2004, which was expected to double within five years.", "Despite the success of its games, it remains a small player compared to other gaming companies.", "The company aims to bring more people into gaming by creating a new industry where games are more emotional and interactive.", "Jan Bolz, EA's vice president of sales and marketing in Europe, said that video game shows could be a way for gamers to connect with each other and share their experiences online.", "Bolz described it as an idea where players control their characters as if they were playing a video game, using technology like 3D graphics and voice controls.", "He also mentioned that EA is planning a \"Reality TV show\" in which viewers can influence the actions of their favorite characters through a computer program.", "This could be a way for gamers to have more control over their gaming experience.", "The challenge for EA's TV broadcast partners is to keep their audience watching for an extended period, as they are often more established and experienced than video game viewers.", "Bolz emphasized that there is a need for gaming companies like EA to work more closely with celebrities in order to attract younger audiences.", "He also mentioned that if gamers want to play video games after 30 years old, it will be a significant challenge for TV broadcasters.", "The goal of EA's company is not just to dominate the video game industry but also to bring people into gaming culture and make gaming an integral part of popular culture."], "qwen2.5:1.5b": ["Electronic Arts aims to become the world's largest entertainment company by doubling its game revenues in five years through mainstream appeal, creating more emotional gaming experiences on high-definition consoles, and expanding into reality shows and awards events."], "qwen2.5:3b": ["EA aims to become world's largest entertainment firm by competing with companies like Disney.", "Currently publishes blockbuster titles such as FIFA and John Madden, including video game versions of movies.", "Revenue in 2004 was $3bn; EA plans to double it by 2009.", "Managing director Gerhard Florin predicts success within five years through creating more emotional games using next-gen consoles' advanced graphics capabilities.", "He believes the industry is now bigger than music and that game fans queue for new releases eagerly.", "Vice President Jan Bolz discusses working on reality TV show where viewers control characters, as well as planning an international awards show combining video games, music, and movies.", "EA plans to partner with celebrities to attract older audiences.", "Challenges include maintaining engagement in their 30s, 40s, and 50s."], "opencoder:1.5b": ["\"Take on film and TV giants - we are looking for ways to make gaming more accessible.\"", "\"Electronic Arts (EA) is interested in becoming the world’s largest entertainment firm.", "It wishes to double its revenue in 2009, which was $3bn (£1.65bn) in 2004.", "The company boasts a vast number of titles, including Fifa and John Madden, video game versions of movies like Harry Potter and the James Bond films.\"", "\"The management director insists on making games more appealing to mainstream audiences.", "We anticipate that with the increasing popularity of console gaming, developers will be able to create real emotions.\"", "\"With PS3 and Xbox 2, we can now bring more people into gaming; an interactive experience that challenges players to control a character and complete tasks as in its popular game, The Finding Nemo.\"", "\"The company plans for a longer-term, not-so-long period for games console.", "We foresee that it will take many years before the video game industry can challenge Disney - which reported revenues of $30bn (£16bn) last year.\""], "smollm:1.7b": ["The summary above captures the main ideas of the text:\n\n1.", "EA (Electronic Arts) aims to become the biggest entertainment firm in the world by making games appeal to mainstream audiences.", "2.", "EA publishes blockbuster titles such as Fifa and John Madden, as well as video game versions of movies such as Harry Potter and the James Bond films.", "3.", "Its revenues were $3bn (£1.65bn) in 2004, which EA hoped to double by 2009.", "4.", "EA is the biggest games publisher in the world and in 2004 had 27 titles which sold in excess of one million copies each.", "Nine of the 20 biggest-selling games in the UK last year were published by EA.", "5.", "Gerhard Florin, EA's managing director for European publishing, said: \"Doubling our industry in five years is not rocket science.\"", "He predicted that the next round of games console would give developers enough power to create real emotion.", "6.", "With PS3 and Xbox 2, EA can now bring games to the masses which bring out emotions.", "Nobody queues for music anymore.", "7.", "One idea could be that you're controlling a family, telling them when to go to the kitchen and when to go to the bedroom, and with this mechanism you have gamers all over the world 'playing the show', according to Mr Florin.", "8.", "EA is planning an international awards show \"similar to the Oscars and the Grammys\" which would combine video games, music and movies.", "9.", "Video games firm has to work more closely with celebrities.", "People will want to play games if their heroes like Robbie Williams or Christina Aguilera are in them.", "The summary captures the main ideas of the text:\n\n1.", "EA aims to become the biggest entertainment firm in the world by making games appeal to mainstream audiences.", "2.", "EA publishes blockbuster titles such as Fifa and John Madden, as well as video game versions of movies such as Harry Potter and the James Bond films.", "3.", "Its revenues were $3bn (£1.65bn) in 2004, which EA hoped to double by 2009.", "4.", "EA is the biggest games publisher in the world and in 2004 had 27 titles which sold in excess of one million copies each.", "Nine of the 20 biggest-selling games in the UK last year were published by EA.", "5.", "Gerhard Florin, EA's managing director for European publishing, said: \"Doubling our industry in five years is not rocket science.\"", "He predicted that the next round of games console would give developers enough power to create real emotion.", "6.", "With PS3 and Xbox 2, EA can now bring games to the masses which bring out emotions.", "Nobody queues for music anymore.", "7.", "One idea could be that you're controlling a family, telling them when to go to the kitchen and when to go to the bedroom, and with this mechanism you have gamers all over the world 'playing the show', according to Mr Florin.", "8.", "EA is planning an international awards show \"similar to the Oscars and the Grammys\" which would combine video games, music and movies."], "deepseek-r1:1.5b": ["EA aims to become the biggest entertainment firm, focusing on creating games that appeal to mainstream audiences.", "Their portfolio includes games like Fifa and John Madden, with revenues of $3bn in 2004, aiming to double by 2009.", "Gerhard Florin sees doubling in five years, comparing the game industry to the music industry.", "Emphasizes emotional content and high sales, highlighting real-time character dynamics.", "Compared to Disney, they target mainstream audiences while competitive with video games.", "Jan Bolz suggests using real-time character actions for popular culture, similar to The Sims.", "Challenges include targeting mainstream audiences and maintaining audience persistence."], "tinyllama:1.1b": ["EA, the largest video game publisher in the world with revenues of $3 billion (£1.65 billion) in 2004, aims to become the biggest entertainment company by competing with movie and TV giants such as Disney.", "The company plans to achieve this by making games appeal to mainstream audiences.", "EA publishes blockbuster titles such as FIFA and John Madden video game versions of movies such as Harry Potter, which are expected to double their sales in the next five years.", "A major goal for the firm is to bring more people into gaming by giving developers enough power to create real emotions through interactive graphics.", "To achieve this, EA plans to work with pop celebrities and international awards shows.", "The company aims to keep adults playing video games at their 30th birthdays while also targeting teenagers."], "tinydolphin:1.1b": [" Electronic Arts, a leading video game publisher in the world, has made plans to dominate the entertainment industry by taking on giants such as Disney and becoming the largest games publisher in the world.", "To achieve this ambitious goal, EA must compete with companies that have a strong market presence.", "One of the key strategies EA plans to use is to make its games appeal more to mainstream audiences.", "By focusing on popular characters and themes, EA hopes to create games that will appeal to both adults and children, fulfilling the perception that video games are for children.", "With its unique blend of entertainment, technology, and interactive storytelling, Electronic Arts has a clear path to achieve this ambitious goal, leading the industry into uncharted territory."], "phi:2.7b": [" Electronic Arts (EA) aims to become the largest entertainment firm in the world by creating games that appeal to mainstream audiences.", "EA's revenue has been growing rapidly and it plans to double its industry share in five years.", "The company's managing director, Gerhard Florin, believes that video games can evoke emotions better than movies because of the power of advanced game technology.", "He also envisions an international awards show that combines gaming, music, and movies.", "EA wants to bring more people into gaming by creating more emotional experiences with games like The Sims.", "Jan Bolz, EA's vice president of sales and marketing in Europe, suggests collaborating with celebrities to make video games more appealing to older gamers who still enjoy playing them."], "orca-mini:3b": [" Video game giant Electronic Arts (EA) aims to become the biggest entertainment firm in the world by competing with companies such as Disney and achieving this by making games appeal to mainstream audiences.", "EA publishes blockbuster titles such as Fifa and John Madden, as well as video game versions of movies such as Harry Potter and the James Bond films.", "Its revenues were $3bn in 2004 and it aimed to double this by 2009.", "It remains a goal for the company to challenge Disney, which had revenues of $30bn in 2004.", "EA's managing director for European publishing, Gerhard Florin, predicted that the next round of games console would give developers enough power to create real emotion.", "The video game industry is now bigger than the music industry, and EA said the industry was now bigger than the movie industry.", "It plans an international awards show \"similar to the Oscars and the Grammys\" which will combine video games, music and movies."], "hermes3:3b": ["Electronic Arts aims to become world's top entertainment company by doubling revenues to $6bn in 5yrs, competing with film giants like Disney & making games appeal to mainstream audiences."], "stablelm-zephyr:3b": ["Electronic Arts (EA) aims to compete with entertainment giants like Disney by making games appealing to mainstream audiences and aiming to double its $3bn revenue by 2009.", "EA publishes popular titles such as Fifa, John Madden, and movie-based video games like Harry Potter and the James Bond films.", "The company wants to bring more people into gaming due to a greater focus on emotional storytelling in future console releases.", "EA is working towards giving video games a central role in popular culture, discussing collaborations with reality TV shows and international award events combining video games, music, and movies.", "The company also plans to work closer with celebrities to promote their products among gamers."], "chatgpt-4o-latest": ["Electronic Arts (EA) aims to become the world's largest entertainment company, competing with giants like Disney by making video games more appealing to mainstream audiences.", "In 2004, EA generated $3 billion in revenue and hoped to double that by 2009.", "The company, which publishes blockbuster titles like FIFA and Madden, believes that advancements in gaming technology will allow for more emotional and immersive experiences.", "EA executives argue that video games are now bigger than the music industry and are working to integrate gaming into popular culture through initiatives like a reality TV show based on The Sims and an international awards show similar to the Oscars.", "They also plan to collaborate with celebrities to attract more players.", "EA sees a growing trend of adults playing games and views this as a challenge to traditional TV broadcasters."], "stablelm2:1.6b": ["Video game giant Electronic Arts (EA) aims to become the world's largest entertainment firm by making video games appeal to mainstream audiences and appealing more deeply to viewers.", "EA wants to double its $3bn revenue target by 209, with Gerhard Florin noting that achieving this goal would take several years but remains a company mission.", "The company hopes to challenge Disney, with revenues of $17bn reported in 204.", "EA's vice president of sales and marketing in Europe, Jan Bolz, said the video game firm needed to work more closely with celebrities and plan an international awards show combining games, music, and movies."], "granite3.1-dense:2b": ["Electronic Arts (EA), a leading video game publisher, aims to transform into the world's largest entertainment company by expanding its appeal to mainstream audiences.", "With 2004 revenues of $3 billion and 27 titles selling over one million copies each, EA is currently the biggest games publisher globally.", "The company plans to double its earnings by 2009, targeting a market share that competes with industry giants like Disney, which reported 2004 revenues of $30 billion.", "EA's strategy involves enhancing game quality and interactivity through advanced console technology, such as PlayStation 3 (PS3) and Xbox 2.", "This will allow for more realistic character animations with up to 50,000 polygons, bringing video games closer to the emotional depth of movies like Finding Nemo.", "EA's goal is to establish gaming as a significant part of popular culture, moving beyond its perception as an industry for children.", "More than half of EA's games are already purchased by adults who play them passionately, as evidenced by long lines at game midnight releases like Grand Theft Auto: San Andreas and Halo 2.", "To further solidify its position, EA is pursuing ambitious projects, including a reality TV show where viewers control characters' actions, similar to The Sims, and an international awards ceremony merging video games, music, and movies.", "Additionally, the company plans to collaborate more closely with celebrities, like Robbie Williams and Christina Aguilera, to attract older audiences.", "The challenge for EA lies in maintaining player engagement among adults, as gaming is currently a major pastime.", "If successful, this shift could significantly impact traditional TV viewing habits."]}