{"raw_text": "Speak easy plan for media players\n \n Music and film fans will be able to control their digital media players just by speaking to them, under plans in development by two US firms.\n \n ScanSoft and Gracenote are developing technology to give people access to their film and music libraries simply by voice control. They want to give people hands-free access to digital music and films in the car, or at home or on the move. Huge media libraries on some players can make finding single songs hard. \"Voice command-and-control unlocks the potential of devices that can store large digital music collections,\" said Ross Blanchard, vice president of business development for Gracenote. \"These applications will radically change the car entertainment experience, allowing drivers to enjoy their entire music collections without ever taking their hands off the steering wheel,\" he added.\n \n Gracenote provides music library information for millions of different albums for jukeboxes such as Apple's iTunes. The new technology will be designed so that people can play any individual song or movie out of a collection, just by saying its name. Users will also be able to request music that fits a mood or an occasion, or a film just by saying the actor's name. \"Speech is a natural fit for today's consumer devices, particularly in mobile environments,\" said Alan Schwartz, vice president of SpeechWorks, a division of ScanSoft. \"Pairing our voice technologies with Gracenote's vast music database will bring the benefits of speech technologies to a host of consumer devices and enable people to access their media in ways they've never imagined.\" The two firms did not say if they were developing the technology for languages other than English. Users will also be able to get more information on a favourite song they have been listening to by asking: \"What is this?\" Portable players are becoming popular in cars and a number of auto firms are working with Apple to device interfaces to control the firm's iPod music player. But with tens of thousands of songs able to be stored on one player, voice control would make finding that elusive track by Elvis Presley much easier. The firms gave no indication about whether the iPod, or any other media player, were in mind for the use of the voice control technology. The companies estimate that the technology will be available in the fourth quarter of 2005.\n", "llama3.2:1b": ["US firms ScanSoft and Gracenote are developing technology to allow people to access their digital music libraries using voice commands.", "This will enable hands-free control over devices such as cars, home entertainment systems, and portable players.", "The technology will use a database of music library information to play individual songs or movies by name, and users can also request specific content, such as a film starring an actor."], "llama3.2:3b": ["US firms ScanSoft and Gracenote are developing a voice control system to allow users to access their digital music and film libraries by speaking to media players, promising hands-free control and access to vast databases of information, including albums, songs, actors, and movies.", "The technology will be available in the fourth quarter of 2005."], "gemma2:2b": ["Two US companies, ScanSoft and Gracenote, are developing voice-activated technology for digital media players.", "This technology allows users to control their music and film libraries using spoken commands, making it possible to play specific songs or movies without needing to use the interface.", "The system will be able to recognize movie titles, track names, and moods, enabling more intuitive access to media content."], "qwen2.5:0.5b": ["Voice command-and-control technology will give people access to their digital media libraries by using speech recognition and natural language processing.", "Two firms, ScanSoft and Gracenote, are developing this technology for voice control.", "They want it to make cars and mobile devices more convenient.", "The application will help users find music or movies out of a collection at any time.", "Users can also request specific songs or films based on mood or occasion.", "The two companies did not specify the languages they plan to work in, but they estimate availability for voice control technology by 2005."], "qwen2.5:1.5b": ["Two US firms are developing a speech-based technology to allow music and film fans to control their digital media players by speaking commands.", "This feature would enable hands-free access to large music libraries, enhancing car entertainment experiences.", "The technology is based on Gracenote's vast database of music information for popular albums from companies like Apple's iTunes.", "It allows users to play individual songs or request music fitting specific moods or occasions.", "Voice control is expected in the fourth quarter of 2005 and could be applied to iPods and other media players.", "The firms are not disclosing whether their technology will work with languages other than English."], "qwen2.5:3b": ["Music and film fans can control their digital media players with voice commands via a joint development by ScanSoft and Gracenote.", "This allows hands-free access to large music collections, enabling users to play any song or request one fitting a mood or occasion simply by speaking its name.", "The technology integrates Gracenote's vast music database with ScanSoft's speech recognition software, promising revolutionary changes in car entertainment experiences like playing entire music collections without taking hands off the wheel.", "Currently targeting English speakers, the voice control is intended for portable players, including Apple's iPod, facilitating easier song and film retrieval from large media libraries.", "Expected availability by Q4 2005."], "opencoder:1.5b": ["Speak easy plan for media players.", "Music and film fans will be able to control their digital media players just by speaking to them, under plans in development by two US firms.", "These companies are developing technology to give people access to their film and music libraries simply by voice command-and-control unlocking the potential of devices that can store large digital music collections."], "smollm:1.7b": ["The summary is concise and to the point, preserving key ideas and details from the original text.", "It captures the main points about the development of speech-enabled media players by two US firms, including the potential for voice control to unlock the potential of digital media libraries in the car or at home or on the move.", "The summary does not provide any additional information or explanations about the technology or its applications."], "deepseek-r1:1.5b": ["Voice commands can now unlock music and film libraries, allowing users to access their collections in cars or at home without holding hands.", "ScanSoft and Gracenote are developing technology for voice-controlled media playback based on name, mood, or actor's name.", "This could revolutionize entertainment experiences, especially in mobile environments.", "Voice technology fits consumer devices well, enhancing accessibility.", "The new app is for the iPod but may be developed further for other platforms.", "They aim to launch by Q4 2005 with specific music libraries and no mention of Android."], "tinyllama:1.1b": ["Four US firms, ScanSoft and GraceNote, are developing a technology to give people access to digital media files through spoken commands on digital media players.", "This technology will allow people to play any individual song or movie out of a collection just by saying its name, with the option to request music that fits a mood or occasion or a film just by saying the actor's name.", "The new system will be designed for millions of different albums, making it \"radically changing the car entertainment experience,\" according to both firms.", "With voice control capabilities, users will also be able to access information on their favourite songs and find more details about a particular track in just one request.", "These technologies are expected to come out in the fourth quarter of 2005."], "tinydolphin:1.1b": [" The \"ScanSoft and Gracenote are developing technology to give people hands-free access to digital music and films in the car, or at home or on the move.\"", "is an interesting detail that highlights their interest in developing technology for a specific application, which could potentially enhance the user experience of media players.", "The companies are also planning to use voice control technology to control media playback in different environments, such as on-the-go and in vehicles.", "This technology would be particularly useful for users who enjoy listening to movies or music while driving, as they can now easily access specific songs or films just by saying their names."], "phi:2.7b": [" Two US firms are developing voice-controlled media players that would allow users to control their digital media collections just by speaking to them.", "The technology aims to provide hands-free access to digital music and films, making it easier for people to find specific songs or movies.", "The companies say this will be a game changer for the car entertainment experience, as well as being beneficial in other contexts like at home or on the move."], "orca-mini:3b": [" Music and film lovers will soon be able to control their digital media players simply by speaking to them, thanks to plans developed by ScanSoft and Gracenote.", "The firms are working on technology that will give people hands-free access to their music and film libraries in the car, at home or on the move.", "By using voice commands, users will be able to play any individual song or movie out of a collection, just by saying its name.", "They will also be able to request music that fits a mood or an occasion, or a film just by saying the actor's name.", "The technology is expected to be available in the fourth quarter of 2005."], "hermes3:3b": ["Speak-control media players dev.", "by ScanSoft & Gracenote\n- Control digital music/film libraries via voice\n- Hands-free access in cars, home, or on move\n- Find individual songs/movies just by saying names\n- Request music based on mood/occasion, films based on actor's name\n- Aimed for mobile environments, not limited to English"], "stablelm-zephyr:3b": ["Two US firms, ScanSoft and Gracenote, are developing technology to allow voice control of digital media players, enabling hands-free access to music and films.", "The new system will enable users to play individual songs or movies by naming them, request music based on mood or occasion, and access information about favourite songs.", "The technology is expected to be available in the fourth quarter of 2005."], "chatgpt-4o-latest": ["Two US firms, ScanSoft and Gracenote, are developing voice control technology for digital media players, allowing users to access music and films hands-free in cars, at home, or on the move.", "The technology will enable users to play specific songs or movies by name, request media based on mood or occasion, and obtain information about a song by asking, \"What is this?\"", "Gracenote, which provides music library data for platforms like iTunes, and ScanSoft's SpeechWorks division believe voice control will enhance the user experience, especially in mobile environments.", "The companies did not specify if the technology would support languages other than English or which media players it would be compatible with.", "The technology is expected to be available in late 2005."], "stablelm2:1.6b": ["Two US firms are developing technology to allow people to control digital music and film libraries simply by speaking to their devices, with plans to provide hands-_free access to media on-the-go.", "Gracenote is providing music library information for millions of albums, enabling users to play individual songs or movies just by saying their name.", "They can also request specific content or identify actors in films.", "The technology aims to be available in Q4 2015 for portable devices such..\n  \n(Justification: Keeping the original text's ideas and details intact while summarizing concisely.)"], "granite3.1-dense:2b": ["US-based tech companies ScanSoft and Gracenote are collaborating to develop voice control technology for digital media players, enabling users to manage their film and music libraries verbally, both at home and on the go.", "This feature aims to simplify navigation through extensive collections, allowing hands-free operation in cars or while driving.", "Users can request specific songs or movies by name, including mood-related preferences, and will also be able to query details about a currently playing track with \"What is this?\"", "The technology is expected to debut in the fourth quarter of 2005, enhancing car entertainment experiences by keeping drivers' hands on the wheel.", "This innovation aligns with growing trends in automotive integration for popular media players like Apple's iPod."]}