{"raw_text": "Cable offers video-on-demand\n \n Cable firms NTL and Telewest have both launched video-on-demand services as the battle between satellite and cable TV heats up.\n \n Movies from Sony Pictures, Walt Disney, Touchstone, Miramax, Columbia and Buena Vista will be among those on offer. The service is similar to Sky Plus, as users can pause, fast forward and rewind content, but they cannot store programmes on their set top box - yet. It could sound the death knell for some TV channels, Telewest predicts. \"It allows us to demonstrate a clear competitive advantage over Sky for the first time in many years,\" said Telewest chief executive Eric Tveter.\n \n \"Video-on-demand will offer a deeper range of content than currently exists on TV. There will be less compromising around the TV schedule and some of the less popular channels may go by the wayside,\" said Philip Snalune, director of products at Telewest. Telewest customers in Bristol and NTL viewers in Glasgow will be the first to test the new service, which sees a raft of movies on offer for 24 hour rental. During the year, the service will be extended to all cable regions. Films will range in price from £1 or £2 for archived movies to £3.50 for current releases. New releases initially on offer will include 50 First dates, Kill Bill: Volume 2, Gothika and The Station Agent. In addition, NTL is offering children's programmes, adult content, music video and concerts. Telewest will launch similar services later in the year. NTL is also offering viewers the chance to catch up with programmes they have missed. Its pick of the week service will offer a selection of BBC programmes from the previous seven days such as Eastenders, Casualty, Top Gear and Antiques Roadshow. The BBC is trialling a similar service, offering broadband users the chance to watch programmes already broadcast on their PC. For Telewest it is the beginning of a £20m investment in TV-on-demand which will also see the launch of a personal video recorder (PVR). PVR has been a big success for Sky because it gives customers control over programmes. Satellite customers without PVR cannot pause, rewind or fast forward their programmes.\n \n With both services on offer from Telewest, Mr Tveter is confident the cable firm can dent not just the viewing figures for terrestrial TV but also gain a huge competitive advantage over Sky.\n \n \"We offer the best of both worlds and most households have an interest in having both video-on-demand and PVR,\" he said. Video rental stores may also have to watch their back. \"Video-on-demand is better than having a video-store in your living room and is more convenient,\" he said. NTL said it had not ruled out the possibility of offering a PVR but for the moment is concentrating on video-on-demand. \"PVR is a recording mechanism whereas what we are offering is truly on demand,\" said a spokesman for the company. Video-on-demand has the added advantage of not requiring a separate set-top box or extra remote controls, he added. Adam Thomas, an analyst at research firm Informa Media believes the time is ripe for video-on-demand to flourish. \"While Sky will remain the dominant force in UK pay TV for some time to come, NTL and Telewest seem well placed to successfully ride this second wave of VOD enthusiasm and, if marketed correctly, this could help them eat into Sky's lead,\" he said.\n", "llama3.2:1b": ["Cable firms NTL and Telewest have launched video-on-demand services offering a range of movies, including those from Sony Pictures, Disney, and Warner Bros.", "The service allows users to pause, fast forward, and rewind content but cannot store programs on their set-top box.", "It will be available in Bristol and Glasgow for customers in the first phase, with plans to expand to all cable regions by year's end.", "The service offers a deeper range of content than current TV schedules can accommodate and may benefit lesser-known channels.", "Both firms plan to launch similar services later this year, and NTL is offering additional features such as a personal video recorder (PVR) for those without one."], "llama3.2:3b": ["Cable firms NTL and Telewest have launched video-on-demand services with a range of movies available for 24-hour rental, including films like \"50 First Dates\" and \"Kill Bill: Volume 2\".", "The service will be extended to all cable regions later in the year, with pricing ranging from £1 to £3.50 per film.", "NTL is also offering children's programs, adult content, music videos, and a pick of the week service featuring BBC shows.", "Telewest will launch similar services later, backed by a £20m investment in TV-on-demand technology, including personal video recorders (PVRs)."], "gemma2:2b": ["NTL and Telewest are launching video-on-demand (VOD) services, offering on-demand movies and catch-up content.", "The services offer pause, rewind, and fast forward capabilities but lack recording options.", "The launch of these services could affect the popularity of traditional TV channels and lead to a decline in viewership for terrestrial channels.", "Both companies are investing heavily in VOD to gain competitive advantage against Sky and increase customer engagement."], "qwen2.5:0.5b": ["Cable firms NTL and Telewest are launching video-on-demand services as the battle between satellite and cable TV heats up.", "The service allows users to pause, fast forward, rewind, and store content on their set-top boxes, but it cannot store videos on a set-top box yet.", "Film titles from Sony Pictures, Walt Disney, Touchstone, Miramax, Columbia, and Buena Vista will be available for viewing.", "Customers in Bristol and NTL viewers in Glasgow can test the new service during the year and have access to 24-hour rentals of films ranging in price from £1 or £2 for archived movies to £3.50 for current releases.", "In addition, Telewest is offering children's programs, adult content, music video, concerts, and other services.", "NTL is also offering catch-up options for错过的作品，以及一个家庭娱乐中心。竞争对手Satellite TV still has a significant lead in the market."], "qwen2.5:1.5b": ["NTL and Telewest launch video-on-demand services, offering similar capabilities to Sky Plus but with no program storage feature, as part of a £20m investment in the service to compete with satellite provider Sky.", "The initial launches include films from major studios, 50 First Dates, Kill Bill: Volume 2, Gothika, and The Station Agent, with additional children's programs, adult content, music videos, and concerts for NTL users."], "qwen2.5:3b": ["Cable firms NTL and Telewest have launched video-on-demand services featuring movies from major studios such as Sony Pictures, Disney, Touchstone, Miramax, Columbia, and Buena Vista.", "Users can pause, fast forward, and rewind content but cannot store programs on their set-top box.", "This service could reduce the viewership of some TV channels.", "Telewest predicts it will offer a broader range of content compared to Sky Plus, potentially leading to less popular channels disappearing from terrestrial TV schedules.", "Initially, movies are available for 24-hour rental at prices ranging from £1 or £2 for archived films to £3.50 for current releases.", "Services include catch-up television and adult content.", "NTL is also offering a pick-of-the-week service for BBC programs, while Telewest will launch similar services later in the year.", "Both companies emphasize that their video-on-demand services complement PVR (personal video recorder) functionality, which they claim offers better control over programming compared to Sky.", "Analysts believe this could help NTL and Telewest gain market share from Sky, potentially disrupting traditional television viewing habits."], "opencoder:1.5b": ["Cable firms have offered video-on-demand services as the competitive advantage between satellite and cable TV has been turned upside down by NTL and Telewest.", "This new offering promises a deeper range of content than current TV offerings, allowing users to demonstrate a clear competitive advantage over Sky for many years.", "It will offer a more personalized viewing experience compared to Sky Plus, enabling users to control their TV programmes from any place with an internet connection."], "smollm:1.7b": ["The summary should be: Cable firms NTL and Telewest have both launched video-on-demand services as the battle between satellite and cable TV heats up.", "Movies from Sony Pictures, Walt Disney, Touchstone, Miramax, Columbia and Buena Vista will be among those on offer.", "The service is similar to Sky Plus, as users can pause, fast forward and rewind content, but they cannot store programmes on their set top box - yet.", "It could sound the death knell for some TV channels, Telewest predicts.", "\"It allows us to demonstrate a clear competitive advantage over Sky for the first time in many years,\" said Telewest chief executive Eric Tveter.", "The summary should be concise and focused on the main ideas: Cable firms NTL and Telewest have both launched video-on-demand services as the battle between satellite and cable TV heats up.", "Movies from Sony Pictures, Walt Disney, Touchstone, Miramax, Columbia and Buena Vista will be among those on offer.", "The service is similar to Sky Plus, but users cannot store programmes on their set top box - yet.", "It could sound the death knell for some TV channels, Telewest predicts.", "\"It allows us to demonstrate a clear competitive advantage over Sky for the first time in many years,\" said Telewest chief executive Eric Tveter."], "deepseek-r1:1.5b": ["Video-on-demand services from NTL and Telewest are launched to compete with Sky Plus, offering a clear competitive advantage by providing a wider range of content at a more accessible format.", "Users can pause, fast forward, and rewind content without storing it on their TV sets, which may alienate some viewers who prefer watching on the go.", "The service includes new releases priced from £1 for archived movies to £3.50 for current releases.", "It also offers PVR access through a weekly selection of BBC episodes and aims to expand coverage across all cable regions.", "NTL plans to launch similar services later, offering a focus on VOD while refining the PVR option, which Sky isn't currently providing.", "The rollout includes £20m investment in TV-on-demand with a long-term plan for additional PVR features."], "tinyllama:1.1b": ["The following text is a summary of the article \"Cable Offers Video-on-demand\" by Telewest and NTL:\n\n1.", "The article introduces two video-on-demand services, one from Telewest's cable TV service in the UK, and one from their rival cable service provider, NTL.", "These services are similar to those offered by satellite and cable TV providers, offering users the ability to rent or purchase selected programs for on-demand viewing at any time.", "2.", "The article states that movies will be available for rental on both services with prices varying depending on the length of the rental.", "The services offer different content from Sony Pictures Entertainment, Walta Disney, Touchstone, Mira Max, Columbia and Buena Vista.", "3.", "The article claims that video-on-demand will allow users to have a wider range of content than currently available on TV, offering less compromising around the TV schedule.", "The services are expected to provide customers with more content than currently available for purchase or rental.", "4.", "The article suggests that both services could pose a threat to Sky's lead in UK pay TV.", "While Sky will remain the dominant force in UK pay TV for some time to come, Telewest and NTL seem well placed to successfully ride this second wave of VOD enthusiasm.", "5.", "The article further notes that while the services are similar to those offered by satellite and cable TV providers, they offer users control over their programming.", "Overall, the article suggests that video-on-demand has the potential to disrupt traditional television viewing habits in the UK market."], "tinydolphin:1.1b": [" Cable firms NTL and Telewest have both launched video-on-demand services as the battle between satellite and cable TV heats up.", "Both offer a similar range of content with exclusive titles for subscribers, offering a deeper range of programming compared to existing services.", "The service launches in Bristol and Glasgow this month, followed by all cable regions later in 2011.", "NTL plans to launch similar services in the UK while Telewest is planning similar services for Germany, Austria, Belgium, Portugal, Hungary, Russia, Iran and India.", "Both companies aim to gain a competitive advantage over Sky as users can pause, fast forward, and rewind content."], "phi:2.7b": [" Cable firms NTL and Telewest have launched video-on-demand services that offer a deeper range of content than current TV schedules, allowing viewers to pause, fast forward, and rewind content.", "The service is similar to Sky Plus and will initially be tested by customers in Bristol and Glasgow before being extended to all cable regions.", "Both services offer movies for rent or viewing on demand, with prices ranging from £1 to £3.50 per movie.", "Telewest also offers a pick of the week service featuring BBC programmes from the previous seven days.", "NTL is offering a similar service and plans to launch a personal video recorder (PVR) in the future.", "Video-on-demand has the advantage of not requiring a separate set-top box, unlike Sky's VOD service which requires a separate remote control."], "orca-mini:3b": [" Cable firms NTL and Telewest have launched video-on-demand services, offering a range of movies from Sony Pictures, Walt Disney, Touchstone, Miramax, Columbia and Buena Vista.", "The service is similar to Sky Plus, allowing users to pause, fast forward and rewind content, but they cannot store programmes on their set top box.", "It could sound the death knell for some TV channels, Telewest predicts.", "NTL and Telewest are offering viewers the chance to catch up with programmes they have missed."], "hermes3:3b": ["Cable companies NTL, Telewest launch video-on-demand services; offer movies for 24hr rental, similar to Sky Plus pausing/fast forwarding but with no recording capability."], "stablelm-zephyr:3b": ["Cable companies NTL and Telewest have launched video-on-demand services, offering movies from Sony Pictures, Walt Disney, Touchstone, Miramax, Columbia, and Buena Vista.", "Users can pause, fast forward, and rewind content but cannot store programs on their set-top box yet.", "The service will be extended to all cable regions during the year, with films ranging in price from £1 to £3.50 for current releases.", "Both companies offer pick of the week services, where viewers can catch up on missed programs.", "Telewest is investing £20m in TV-on-demand and launching a personal video recorder (PVR), which will give customers control over their programming.", "Analysts believe NTL and Telewest are well placed to gain a competitive advantage over Sky due to the convenience of their video-on-demand services."], "chatgpt-4o-latest": ["Cable companies NTL and Telewest have launched video-on-demand (VOD) services, intensifying competition with satellite TV.", "The service allows users to pause, rewind, and fast forward content but does not yet support program storage.", "Telewest sees this as a major advantage over Sky, predicting that less popular TV channels may disappear.", "Initially available in Bristol and Glasgow, the service will expand nationwide, offering movies from major studios at prices ranging from £1 to £3.50.", "NTL also provides children's content, adult programming, music videos, and a \"pick of the week\" feature for BBC shows.", "Telewest is investing £20m in TV-on-demand, including plans for a personal video recorder (PVR), which has been a key feature for Sky.", "NTL is focusing solely on VOD for now.", "Analysts believe the timing is right for VOD to grow, and if marketed well, it could help cable companies gain ground on Sky.", "Video rental stores may also face challenges as VOD offers greater convenience."], "stablelm2:1.6b": ["NTL and Telewest have launched video-on-demand services as the battle between satellite and cable TV intensifies.", "Sony Pictures, Walt Disney, Touchstone, Miramax, Columbia, and Buena Vista will offer movies via these services, similar to Sky Plus.", "Users can pause, fast forward, or rewind content but cannot store programs on their set-top box yet.", "NTL is offering movies for hourly rental, while Telewest plans to extend the service to all cable regions.", "The launch of similar services later in the year by Telewest will cement their position as leaders in TV-ON-demand.", "Meanwhile, NTL is offering viewers the chance to catch up with missed programs and children's content."], "granite3.1-dense:2b": ["Cable companies NTL and Telewest have introduced video-on-demand (VoD) services in response to intensifying competition with satellite TV providers.", "These services, similar to Sky Plus, enable users to pause, rewind, and fast-forward content but lack storage capabilities.", "Key movie studios including Sony Pictures, Walt Disney, Touchstone, Miramax, Columbia, and Buena Vista are among the content providers.", "NTL and Telewest customers in Bristol (Telewest) and Glasgow (NTL) will initially test the VoD service, which includes a wide range of films for 24-hour rental, priced from £1 to £3.50.", "NTL also offers catch-up programming on previous BBC shows like Eastenders and Casualty.", "Both firms are investing in TV-on-demand, with Telewest committing £20 million for a personal video recorder (PVR) and PVR trials with broadband users.", "NTL's chief executive, Eric Tveter, foresees this service diminishing the popularity of certain TV channels, potentially giving cable an edge over Sky.", "Telewest believes VoD will provide a more convenient alternative to video rental stores and offer the best of both video-on-demand and PVR.", "An analyst from Informa Media predicts NTL and Telewest are well-positioned to capitalize on this growing trend, potentially reducing Sky's market dominance."]}