{"raw_text": "Dublin hi-tech labs to shut down\n \n Dublin's hi-tech research laboratory, Media Labs Europe, is to shut down.\n \n The research centre, which was started by the Irish government and the Massachusetts Institute of Technology, was a hotbed for technology concepts. Since its opening in 2000, the centre has developed ideas, such as implants for teeth, and also aimed to be a digital hub for start-ups in the area. The centre was supposed to be self-funded, but has failed to attract the private cash injection it needs. In a statement, Media Labs Europe said the decision to close was taken because neither the Irish Government nor the prestigious US-based Massachusetts Institute of Technology (MIT) was willing to fund it. Prime Minister Bertie Ahern had wanted to the centre to become a big draw for smaller hi-tech companies, in an attempt to regenerate the area.\n \n About three dozen small firms were attracted to the area, but it is thought the effects of the dot.com recession damaged the Labs' long-term survival. The Labs needed about 10 million euros (US$13 million) a year from corporate sponsors to survive. \"In the end, it was too deep and too long a recession,\" said Simon Jones, the Labs' managing director. Ian Pearson, BT's futurologist, told the BBC News website that the closure was a \"real shame\". BT was just one of the companies that had worked with the Labs, looking at RFID tag developments and video conferencing. \"There were a lot of very talented, creative people there and they came up with some great ideas that were helping to ensure greater benefits of technology for society. \"I have no doubt that the individuals will be quickly snapped up by other research labs, but the synergies from them working as a team will be lost.\"\n \n Noel Dempsey, the government's communications minister, said Mr Ahern had been \"very committed\" to the project. \"He is, I know, very disappointed it has come to this. At the time it seemed to be the right thing to do,\" he said. \"Unfortunately the model is not a sustainable one in the current climate.\"\n \n During its five years, innovative and some unusual ideas for technologies were developed. In recent months, 14 patent applications had been filed by the Labs. Many concepts fed into science, engineering, and psychology as well as technology, but it is thought too few of the ideas were commercially viable in the near-term. Several research teams explored how which humans could react with technologies in ways which were entirely different. The Human Connectedness group, for example, developed the iBand, a bracelet which stored and exchanged information about you and your relationships. This information could be beamed to another wearer when two people shook hands. Other projects looked at using other human senses, like touch, to interact with devoices which could be embedded in the environment, or on the body itself. One project examined how brainwaves could directly control a computer game. The Labs, set up in an old Guinness brewery, housed around 100 people, made up of staff, researchers, students, collaborators and part-time undergraduate students. It is thought more than 50 people will lose their jobs when the Labs close on 1 February. According to its latest accounts, Media Lab Europe said it spent 8.16 million euros (about US$10.6 million) in 2003 and raised just 2.56 million euros (US$3.3 million).\n", "llama3.2:1b": ["Dublin hi-tech research laboratory Media Labs Europe will shut down due to funding issues from the Irish government and Massachusetts Institute of Technology.", "The centre, which was started by the Irish government and MIT, has attracted over three dozen small firms but struggled to attract enough corporate sponsors to survive.", "Its staff consisted mainly of scientists and researchers working on various projects in areas such as technology, engineering, psychology, and human interaction.", "Many innovative ideas developed at Media Labs Europe were filed for patent, including a bracelet called the iBand that allows users to share information with each other through handshakes or touch.", "The centre's closure is expected to affect around 50 people who will lose their jobs on February 1."], "llama3.2:3b": ["Dublin's Media Labs Europe will close due to lack of funding.", "The lab, which was set up by the Irish government and MIT, aimed to be a digital hub for start-ups but failed to attract private investment.", "Despite developing innovative ideas, including implants for teeth and brainwave-controlled games, it couldn't secure funding from either the Irish or US governments."], "gemma2:2b": ["Media Labs Europe, a Dublin-based hi-tech research center co-founded by the Irish government and MIT, will close due to lack of private funding.", "The centre was aimed at attracting startups and developing innovative ideas like implants and RFID technology, but failed to secure necessary investment.", "It attracted 30 companies but was impacted by the dot.com recession and needed yearly funding of €10 million.", "Several promising research projects were developed but not all became commercially viable.", "The closure will affect over 50 researchers."], "qwen2.5:0.5b": ["Dublin's hi-tech research lab, Media Labs Europe, has shut down due to financial difficulties.", "The center was started by the Irish government and MIT with a focus on technology concepts and digital hubs.", "Prime Minister Bertie Ahern wanted the center to become a draw for smaller firms in Dublin.", "It needed about 10 million euros a year from corporate sponsors to survive.", "However, the center faced problems like too deep a recession which damaged its long-term survival.", "Some innovative ideas were developed during its five-year lifespan but only a few were commercially viable right now.", "Media Lab Europe spent 8.16 million euros in 2003 and only raised 2.56 million euros in 2004."], "qwen2.5:1.5b": ["Media Labs Europe, a Dublin hi-tech research center started by Ireland and MIT, closed due to lack of funding following the dot.com recession, leading to job losses for about 3 dozen firms.", "The €10.6m loss in revenue was attributed to poor corporate sponsorship over five years focusing on developing technologies like implants, RFID tags, video conferencing, and brain-controlled computers."], "qwen2.5:3b": ["Dublin's hi-tech research lab, Media Labs Europe, is shutting down due to failure to attract private funding despite initial support from Irish government and MIT.", "The center aimed at becoming a digital hub for startups but faced challenges including the dot-com recession and unsustainable model in current climate.", "It developed various innovative ideas across multiple fields but struggled with commercial viability of many concepts.", "Over 100 people worked there, with around 50 losing their jobs when the lab closes on February 1st.", "Media Labs Europe spent €8.16 million in 2003 and raised only €2.56 million that year."], "opencoder:1.5b": ["Dublin hi-tech labs shutting down\n\nThe research center, which was started by Irish government and Massachusetts Institute of Technology, has developed innovative ideas for technology concepts.", "The decision to close was taken due to the loss of funds needed from corporate sponsors.", "The closure had a significant impact on society but it did not restore the area's long-term survival.", "During its five years, various projects in technology and human connectedness were being pursued by researchers and innovative individuals.", "Many of these ideas are commercially viable within the near-term, and with 14 patent applications filed, it provides greater benefits to society."], "smollm:1.7b": ["The summary is concise and objective, preserving the key ideas and details of the original text while omitting unnecessary information.", "The main points are:\n\n1.", "Dublin hi-tech labs to shut down: Media Labs Europe was a hotbed for technology concepts, but it failed to attract private funding.", "2.", "Three dozen small firms attracted to area: The Labs needed about 10 million euros (US$13 million) a year from corporate sponsors to survive.", "3.", "Synergies lost: The individuals will be quickly snapped up by other research labs, but the synergies from them working as a team will be lost.", "4.", "Noel Dempsey disappointed: Mr Ahern was \"very committed\" to the project.", "Unfortunately, the model is not a sustainable one in the current climate.", "5.", "14 patent applications filed: Many concepts fed into science, engineering, and psychology as well as technology, but it is thought too few of the ideas were commercially viable in the near-term.", "6.", "Human connectedness group developed iBand: The iBand was a bracelet which stored and exchanged information about you and your relationships.", "7.", "Other research teams explored ways to use other human senses: The Human Connectedness group examined how brainwaves could directly control a computer game.", "8.", "Media Lab Europe set up in old Guinness brewery: The Labs housed around 100 people, made up of staff, researchers, students, collaborators and part-time undergraduate students.", "9.", "It spent 8.16 million euros (US$10.6 million) in 2003 and raised just 2.56 million euros (US$3.3 million): Media Lab Europe said it spent 8.16 million euros (US$10.6 million) in 2003 and raised just 2.56 million euros (US$3.3 million).", "10.", "The summary is concise and objective, preserving the key ideas and details of the original text while omitting unnecessary information."], "deepseek-r1:1.5b": ["Dublin's media labs Europe is to shut down due to insufficient funding and private investment.", "The labs aim to become a tech hub but were not sustainable.", "The Irish government and MIT opposed the move, calling it a bad fit for smaller companies.", "Small firms joined, but the dot.com recession affected survival.", "14 patent applications were filed in five years, exploring ideas like RFID tags, video conferencing, and human connection projects.", "The labs needed around $10 million annually, lacking funding.", "Simon Jones noted the deep and long recession, while Ian Pearson described the closure as \"real shame.\"", "The labs spent $8.16 million in 2003 but only raised $2.56 million after funding.", "Job losses estimate over 50 people due to closure."], "tinyllama:1.1b": ["The Dublin hi-tech research lab, Media Lab Europe, is to shut down as the Irish government and Massachusetts Institute of Technology (MIT) have stopped funding it.", "The center was founded in 2000 by the Irish Government and MIT with the aim of becoming a digital hub for startups in the area.", "It had three dozen small firms attracted to its area, but corporate sponsorship was no longer enough to sustain its long-term survival.", "The center's research focused on developing technology concepts such as implants for teeth and the iBand, a bracelet that stored and transferred information about humans to other wearers.", "It employed around 100 people, including staff, researchers, students, collaborators, and part-time undergraduate students.", "The closure of Media Lab Europe is a \"real shame\" for corporate sponsors, as the center helped promote innovative ideas for technology, but it will result in the loss of over 50 jobs."], "tinydolphin:1.1b": [" The Dublin Hi-Tech Research Laboratories, commonly known as Media Labs Europe, is shutting down due to financial difficulties.", "The center's success was primarily based on its work in exploring innovative technologies for the betterment of society and had been a hotbed for ideas such as implants for teeth and virtual reality systems.", "The center has also aimed to be a digital hub for start-ups in the area, but its funding struggles have made it difficult to attract investors.", "Prime Minister Bertie Ahern was expected to make an announcement regarding Media Labs Europe's future."], "phi:2.7b": [" Dublin's hi-tech research laboratory, Media Labs Europe, started by the Irish government and MIT, is shutting down due to a lack of funding from both governments.", "The center was founded to develop innovative technology concepts like implants for teeth but failed to attract private investment during the dot-com recession.", "The closure comes just months after BT's futurologist called it \"a real shame\" as many small hi-tech firms were attracted to the area, including a project on using brainwaves to control computer games.", "Media Labs Europe spent 8.16 million euros in 2003 but raised only 2.56 million euros from private investors and is expected to close on February 1st with many losing their jobs."], "orca-mini:3b": [" Dublin's hi-tech research laboratory, Media Labs Europe, is to shut down.", "The center, which was started by the Irish government and the Massachusetts Institute of Technology, was a hotbed for technology concepts.", "Since its opening in 2000, the center has developed ideas such as implants for teeth and aimed to be a digital hub for start-ups in the area.", "However, the center needed about 10 million euros from corporate sponsors to survive.", "The labs were supposed to become self-funded but failed to attract the private cash injection they needed.", "The closure was announced due to a dot.com recession and the need to close its doors on February 1st, affecting more than 50 people.", "The center had been very supportive of research teams exploring how humans could react with technologies in ways that were entirely different.", "The Human Connectedness group developed the iBand, a bracelet that stored and exchanged information about relationships.", "Other projects looked at using other human senses to interact with devoices that could be embedded in the environment or on the body itself.", "One project examined how brainwaves could directly control a computer game.", "The Labs were set up in an old Guinness brewery, housing around 100 people and attracting more than 50 people to lose their jobs when it shuts down."], "hermes3:3b": ["Dublin's hi-tech research lab, Media Labs Europe, set to close due to funding issues; developed innovative technologies like tooth implants but lacked sustained commercial viability."], "stablelm-zephyr:3b": ["Dublin's hi-tech research laboratory, Media Labs Europe, will shut down due to a lack of private funding.", "The center, founded by the Irish government and MIT, aimed to be a digital hub for start-ups and attract smaller hi-tech companies to regenerate the area.", "However, the dot.com recession damaged its long-term survival.", "Media Lab Europe needed about 10 million euros per year from corporate sponsors to survive.", "During its five years, it developed innovative and unique technology concepts, but only 14 patent applications were filed.", "More than 50 people will lose their jobs when the labs close on February 1st."], "chatgpt-4o-latest": ["Dublin's hi-tech research centre, Media Labs Europe, is shutting down due to a lack of funding.", "Established in 2000 by the Irish government and MIT, the lab aimed to foster technology innovation and attract start-ups but failed to secure sufficient private investment.", "The dot-com recession further hindered its sustainability, requiring €10 million annually from corporate sponsors.", "Despite developing innovative concepts like the iBand and brainwave-controlled gaming, many ideas lacked near-term commercial viability.", "The closure will result in over 50 job losses, with the lab having spent €8.16 million in 2003 while raising only €2.56 million."], "stablelm2:1.6b": ["Dublin-based hi-tech research laboratory Media Labs Europe is shutting down due to a lack of funding from the Irish government or prestigious Massachusetts Institute of Technology (MIT).", "The center, which aimed to be a digital hub for start-ups and develop technologies such as implants for teeth, will lose around 30 small firms working in the area.", "During its five years, the lab developed innovative concepts for technology like iBand bracelet that used human touch to interact with devoices embedded in the environment or on the body itself.", "The Labs' managing director said they needed about €1 million ($1.6 million) a year from corporate sponsors to survive."], "granite3.1-dense:2b": ["Media Labs Europe, a joint venture between the Irish government and Massachusetts Institute of Technology, is shutting down due to insufficient private funding.", "Established in 2000, this hi-tech research center focused on developing technologies like dental implants and serving as a digital hub for start-ups.", "Despite initial ambitions of becoming a major attraction for smaller tech companies to revitalize the area, the Labs struggled with corporate sponsorship, failing to raise the required 10 million euros annually.", "The dot.com recession is believed to have significantly impacted its long-term viability.", "The center housed about 100 individuals and had filed 14 patent applications in recent months.", "Upon closure on February 1, more than 50 people are expected to lose their jobs.", "Government communications minister Noel Dempsey expressed disappointment but acknowledged the unsustainable nature of the project model in the current economic climate."]}