{"raw_text": "Format wars could 'confuse users'\n \n Technology firms Sony, Philips, Matsushita and Samsung are developing a common way to stop people pirating digital music and video.\n \n The firms want to make a system that ensures files play on the hardware they make but also thwarts illegal copying. The move could mean more confusion for consumers already faced by many different, and conflicting, content control systems, experts warned. They say there are no guarantees the system will even prevent piracy.\n \n Currently many online stores wrap up downloadable files in an own-brand control system that means they can only be played on a small number of media players. Systems that limit what people can do with the files they download are known as Digital Rights Management systems. By setting up the alliance to work on a common control system, the firms said they hope to end this current fragmentation of file formats. In a joint statement the firms said they wanted to let consumers enjoy \"appropriately licensed video and music on any device, independent of how they originally obtained that content\". The firms hope that it will also make it harder for consumers to make illegal copies of the music, movies and other digital content they have bought. Called the Marlin Joint Development Association, the alliance will define basic specifications that every device made by the electronics firms will conform to. Marlin will be built on technology from rights management firm Intertrust as well as an earlier DRM system developed by a group known as the Coral Consortium.\n \n The move is widely seen as a way for the four firms to decide their own destiny on content control systems instead of having to sign up for those being pushed by Apple and Microsoft. Confusingly for consumers, the technology that comes out of the alliance will sit alongside the content control systems of rival firms such as Microsoft and Apple. \"In many ways the different DRM systems are akin to the different physical formats, such as Betamax and VHS, that consumers have seen in the past,\" said Ian Fogg, personal technology and broadband analyst at Jupiter Research. \"The difference is that it is very fragmented,\" he said. \"It's not a two-horse race, it's a five, six, seven or even eight-horse race\" Mr Fogg said consumers had to be very careful when buying digital content to ensure that it would play on the devices they own. He said currently there were even incompatibilities within DRM families. Although initiatives such as Microsoft's \"Plays for Sure\" program could help remove some of the uncertainty, he said, life was likely to be confusing for consumers for some time to come.\n \n Shelley Taylor, analyst and author of a report about online music services, said the locks and limits on digital files were done to maximise the cash that firms can make from consumers. Apple's iTunes service was a perfect example of this, she said. \"Although iTunes has been hugely successful, Apple could not justify its existence if it did not help sell all those iPods,\" she said.\n \n She said rampant competition between online music services, of which there are now 230 according to recent figures, could drive more openness and freer file formats. \"It always works out that consumer needs win out in the long run,\" she said, \"and the services that win in the long run are the ones that listen to consumers earliest.\" Ms Taylor said the limits legal download services place on files could help explain the continuing popularity of file-sharing systems that let people get hold of pirated pop. \"People want portability,\" she said, \"and with peer-to-peer they have 100% portability.\" Cory Doctorow, European co-ordinator for the Electronic Frontier Foundation which campaigns for consumers on many cyber-rights issues, expressed doubts that the Marlin system would achieve its aims. \"Not one of these systems has ever prevented piracy or illegal copying,\" he said. He said many firms readily admit that their DRM systems are little protection against skilled attackers such as the organised crime gangs that are responsible for most piracy. Instead, said Mr Doctorow, DRM systems were intended to control the group that electronics firms have most hold over - consumers. \"The studios and labels perceive an opportunity to sell you your media again and again - the iPod version, the auto version, the American and UK version, the ringtone version, and so on.\"\n", "llama3.2:1b": ["Sony, Philips, Matsushita, and Samsung are developing a common system to stop piracy of digital music and video.", "The system will ensure files play on their hardware but also limit users' ability to copy the content.", "The firms aim to end fragmentation in file formats by allowing consumers to use approved devices.", "The Marlin Joint Development Association aims to define basic specifications for devices made by these electronics firms, potentially limiting what people can do with downloaded files.", "However, experts question whether the system will prevent piracy or just control consumer behavior.", "The move is seen as a way for electronics firms to decide their own content control systems instead of being pushed by Apple and Microsoft.", "The system will sit alongside content control systems from rival firms like Microsoft and Apple, potentially confusing consumers."], "llama3.2:3b": ["Firms Sony, Philips, Matsushita and Samsung are developing a common Digital Rights Management (DRM) system to prevent piracy of digital music and video.", "The Marlin Joint Development Association aims to create a unified control system that will be implemented across their devices, but experts warn it may confuse consumers who currently face conflicting systems from other firms like Apple and Microsoft.", "Experts also argue that DRM systems are primarily designed to maximize profits for the studios and labels, rather than genuinely preventing piracy."], "gemma2:2b": ["Sony, Philips, Matsushita, and Samsung are forming a consortium to create a common system for controlling digital files to prevent piracy.", "This will involve defining basic specifications for all devices within the alliance to ensure that content is playable across various platforms.", "However, experts warn this might lead to more confusion among consumers as different DRM systems are likely to remain in use alongside each other, leading to continued challenges in using downloaded content on desired devices.", "The system's effectiveness in preventing piracy remains uncertain, and it is believed the move reflects a desire for greater control over content rather than directly improving user experience."], "qwen2.5:0.5b": ["Key points:\n- Sony, Philips, Matsushita, and Samsung develop a common technology for preventing digital music and video piracy.", "- The firms aim to create a common control system for files that play on various media players but also prevent illegal copying.", "- There are no guarantees the system will even prevent piracy.", "- Current online stores have their own DRM systems.", "- Marlin Joint Development Association defines basic specifications that every device should conform to."], "qwen2.5:1.5b": ["Four tech giants Sony, Philips, Matsushita, and Samsung are developing a joint system to prevent file piracy.", "The alliance aims to standardize digital rights management systems that ensure files play only on hardware they manufacture but also thwart illegal copying.", "The move could lead to more confusion for consumers used to multiple conflicting content control systems."], "qwen2.5:3b": ["Format wars could 'confuse users'\nSony, Philips, Matsushita, Samsung are developing a common system to prevent digital music/video piracy.", "This could lead to more confusion for consumers with existing conflicting DRM systems.", "The move aims to unify file formats but may not prevent piracy.", "Currently, each firm has its own DRM system.", "A Marlin Joint Development Association will define basic specifications for electronics firms.", "Analysts warn this new technology will sit alongside other incompatible control systems and may confuse consumers, especially given ongoing competition among online music services.", "Critics doubt the system's effectiveness in stopping piracy.", "Some view DRM as a means to maximize profits for tech companies, while others argue it controls consumer access to media."], "opencoder:1.5b": ["This summarization preserves the key ideas and details in the text while omitting unnecessary explanations and details.", "It focuses on making a single point of view with the goal to simplify and improve understanding."], "smollm:1.7b": ["Summarize the following text concisely, preserving key ideas and details:\nTechnology firms Sony, Philips, Matsushita and Samsung are developing a common way to stop people pirating digital music and video.", "The firms want to make a system that ensures files play on the hardware they make but also thwarts illegal copying.", "The move could mean more confusion for consumers already faced by many different, and conflicting, content control systems, experts warned.", "They say there are no guarantees the system will even prevent piracy.", "The four firms have formed a joint venture to develop a common DRM system that would ensure files play on the hardware they make but also thwarts illegal copying.", "The firms hope this move will help consumers enjoy their digital media more securely and without worrying about pirates.", "However, many online music services already use DRM systems to control how users can access their content.", "The Marlin Joint Development Association is a group of companies that have worked together on the development of DRM systems for years.", "The alliance has defined basic specifications that all devices made by the four firms will conform to.", "This means consumers who buy digital media from these firms will be able to use it without worrying about pirates or illegal copying.", "The move to develop a common DRM system is likely to help reduce the confusion and uncertainty that many online music services create for consumers.", "However, not all DRM systems are created equal, and some may even make piracy easier than others.", "The four firms have already demonstrated their willingness to work together on this issue, but it will take time to see if they can achieve their goals."], "deepseek-r1:1.5b": ["The four tech firms Sony, Philips, Matsushita, and Samsung are developing a common system to prevent piracy of digital music and video.", "They aim to create a unified file format that ensures files play on all their devices but also stops illegal copying.", "This could lead to confusion for consumers already dealing with fragmented content control systems.", "The Marlin Joint Development Association plans to use technology from Intertrust (rights management) and Coral Consortium (earlier DRM system).", "Their goal is to let consumers enjoy legally licensed video and music across devices, free from copyright issues.", "However, this move risks confusing users, as rival companies like Microsoft and Apple offer their own systems with incompatibilities.", "Experts warn that the current fragmented systems may still allow piracy, while the Marlin system aims to prevent it but could fail due to less protection against skilled attackers."], "tinyllama:1.1b": ["A technology firm, Sony, Philips, Matsushita and Samsung are coming together to develop a common system for controlling digital content, which will ensure that files can be played on the devices they were originally produced.", "While there is no guarantee that the system will prevent piracy, the aim of the all-inclusive Marlin Joint Development Association (JDAA) is to make it harder for consumers to make illicit copies of digital content they have bought.", "The move is seen as an attempt by electronic firms to gain a foothold in a fragmented market of DRM systems, and as a way for the four companies to work towards consensus-building on content control systems.", "However, many experts doubt that the Marlin system will prevent piracy or illicit copies of digital content, with Mr Doctorow arguing instead that DRM systems are designed to protect the group that electronic firms control over consumer purchase habits."], "tinydolphin:1.1b": [" Summarize: The electronics firms are coming together to develop a standard for controlling digital content playback.", "This is an attempt to end fragmentation of file formats and make it harder for consumers to make illegal copies of their purchased content.", "The alliance will define basic specifications that every device made by the electronics firms will conform to, with Marlin being built on technology from rights management firm Intertrust and the Coral Consortium's earlier DRM system.", "This initiative could help reduce confusion for consumers while simultaneously maximizing the profits of digital music services such as Apple's iTunes and Microsoft's Plays for Sure."], "phi:2.7b": [" Sony, Philips, Matsushita and Samsung are developing a common file control system to prevent piracy.", "They hope this will make it easier for consumers to enjoy legally licensed content on different devices.", "However, experts warn that there is no guarantee that this system will work, and existing DRM systems may still pose problems for consumers.", "The four firms forming the Marlin Joint Development Association say they want to end fragmentation of file formats by defining basic specifications that every device must meet.", "This initiative could also create confusion for consumers as it sits alongside rival content control systems from other companies.", "Some experts argue that DRM is primarily intended to make more money for electronic firms, and piracy will continue despite efforts to prevent it."], "orca-mini:3b": [" Format wars could 'confuse users' as technology firms Sony, Philips, Matsushita and Samsung develop a common way to stop people pirating digital music and video.", "The firms want to make a system that ensures files play on the hardware they make but also thwarts illegal copying.", "This move could mean more confusion for consumers already faced by many different, and conflicting, content control systems, experts warned.", "They say there are no guarantees the system will even prevent piracy.", "Currently many online stores wrap up downloadable files in an own-brand control system that means they can only be played on a small number of media players.", "Systems that limit what people can do with the files they download are known as Digital Rights Management systems.", "The Marlin Joint Development Association, the alliance will define basic specifications that every device made by the electronics firms will conform to.", "Marlin will be built on technology from rights management firm Intertrust as well as an earlier DRM system developed by a group known as the Coral Consortium.", "The move is widely seen as a way for the four firms to decide their own destiny on content control systems instead of having to sign up for those being pushed by Apple and Microsoft.", "Confusingly for consumers, the different DRM systems are akin to the different physical formats, such as Betamax and VHS, that consumers have seen in the past.", "It's not a two-horse race, it's a"], "hermes3:3b": ["Format wars may cause confusion; firms developing common DRM system for digital content protection."], "stablelm-zephyr:3b": ["Four technology companies (Sony, Philips, Matsushita, and Samsung) are working together to create a common system for controlling digital music and videos to stop piracy.", "This new system would ensure that only licensed content can be played on their devices, making it harder for people to make illegal copies.", "However, this joint venture might cause confusion for consumers because the technology they develop will still need to coexist with different control systems offered by rival firms like Microsoft and Apple.", "The ultimate goal is to create a unified system so that consumers can enjoy legally purchased content on any device they own, without worrying about compatibility issues.", "Critics argue that no previous DRM system has ever prevented piracy and believe the new system is more focused on controlling consumers rather than protecting intellectual property rights."], "chatgpt-4o-latest": ["Sony, Philips, Matsushita, and Samsung are developing a unified Digital Rights Management (DRM) system to prevent digital piracy while ensuring compatibility across their devices.", "However, experts warn this could further confuse consumers already dealing with multiple, conflicting DRM systems.", "The Marlin Joint Development Association aims to standardize content control, but it will coexist with rival systems from Apple and Microsoft, adding to the complexity.", "Analysts argue that DRM primarily serves corporate interests by restricting consumer usage and maximizing profits, as seen with Apple's iTunes.", "Some believe competition may eventually lead to more open formats, while critics doubt DRM's effectiveness in stopping piracy, suggesting it mainly controls consumers rather than deterring organized crime."], "stablelm2:1.6b": ["Technology firms are developing a common system to prevent piracy of digital music and video by ensuring that files play on their hardware but also discourage illegitimate copying.", "This could lead to more content control systems confusion for consumers already faced with numerous conflicting formats.", "Many online stores wrap up downloadable files in an own-brand control system, making it difficult for users to manage file formats.", "Sony, Philips, Matsushita, and Samsung are working together on the Marlin Joint Development Association, which will define basic specifications that every device must conform to.", "The alliance is being built on technology from rights management firm Intertrust as well as an earlier DRM system developed by the Coral Consortium.", "Despite concerns about potential incompatibilities between different DRM systems, experts argue that this development could lead to more openness and freer file formats."], "granite3.1-dense:2b": ["Technology giants Sony, Philips, Matsushita (Panasonic), and Samsung are forming the Marlin Joint Development Association to create a unified digital rights management (DRM) system for protecting copyrighted music and video content from piracy.", "The alliance aims to ensure that licensed files can be played on any device made by these firms, eliminating current fragmentation and incompatibilities among various DRM systems.", "These systems limit the actions users can take with their legally acquired digital content.", "Experts caution that this move may confuse consumers further due to the coexistence of multiple DRM systems alongside each other, reminiscent of past physical format wars like Betamax and VHS.", "They point out that even within individual DRM families, there are incompatibilities, making it crucial for consumers to ensure their purchased content works on their devices.", "Critics, such as Cory Doctorow from the Electronic Frontier Foundation, doubt the Marlin system will effectively prevent piracy.", "They argue that existing DRM systems have failed to stop organized crime groups responsible for most digital file sharing, which is primarily motivated by consumer needs like portability and accessibility across various devices.", "The primary goal of these DRM measures appears to be controlling consumer behavior rather than truly protecting intellectual property from piracy."]}