{"raw_text": "Games win for Blu-ray DVD format\n \n The next-generation DVD format Blu-ray is winning more supporters than its rival, according to its backers.\n \n Blu-ray, backed by 100 firms including Sony, is competing against Toshiba and NEC-backed HD-DVD to be the format of choice for future films and games. The Blu-Ray Association said on Thursday that games giants Electronic Arts and Vivendi would both support its DVD format. The next generation of DVDs will hold high-definition video and sound. This offers incredible 3D-like quality of pictures which major Hollywood studios and games publishers are extremely keen to exploit in the coming year. In a separate press conference at the Consumer Electronics Show in Las Vegas, Toshiba announced that DVD players for its technology would be on the market by the end of 2005.\n \n \"As we move from standard definition video images to high-definition images, we have a much greater need for storage,\" Richard Doherty, from Panasonic's Hollywood Laboratories, one of the pioneers of Blu-ray, told the BBC news website. \"So by utilising blue laser-based technology we can make an optical laser disc that can hold six times as much as today's DVD.\" A Blu-ray disc will be able to store 50GB of high-quality data, while Toshiba's HD-DVD will hold 30GB. Mr Doherty added that it was making sure the discs could satisfy all high-definition needs, including the ability to record onto the DVDs and smaller discs to fit into camcorders. Both Toshiba and Blu-ray are hopeful that the emerging DVD format war, akin to the Betamax and VHS fight in the 1980s, can be resolved over the next year when next-generation DVD players start to come out. When players do come out, they will be able to play standard DVDs too, which is good news for those who have huge libraries of current DVDs.\n \n But the support from Vivendi and Electronics Arts is a big boost to Blu-ray in the battle for supremacy.\n \n Gaming is a $20 billion industry worldwide, so is as crucial as the film industry in terms of money to be made. \"The technical requirement for game development today demands more advanced optical-disc technologies,\" said Michael Heilmann, chief technology officer for Vivendi Universal. \"Blu-ray offers the capacity, performance and high-speed internet connectivity to take us into the future of gaming.\" EA, a leading games developer and publisher, added that the delivery of high-definition games of the future was vital and Blu-ray had the capacity, functionality and interactivity needed for the kinds of projects it was planning. Sony recently announced it would be using the technology in its next generation of PlayStations. Mr Doherty said gamers were \"ravenous\" for high-quality graphics and technology for the next generation of titles. \"Gamers, especially those working on PCs, are always focused on more capacity to deliver textures, deeper levels, for delivering higher-resolution playback.\"\n \n He added: \"The focus for games moving forward is on increased immersion.\n \n \"Gaming companies really like to focus on creating a world which involves creating complicated 3D models and textures and increasing the resolution, increasing the frame rate - all of these are part of getting a more immersive experience.\" Fitting these models on current DVD technologies means compressing the graphics so much that much of this quality is lost. As games move to more photo-real capability, the current technology is limiting. \"They are thrilled at the advanced capacity to start to build these immersive environments,\" said Mr Doherty. Currently, graphics-intensive PC games also require multiple discs for installation. High-definition DVDs will cut down on that need. Likewise, consoles rely on single discs, so DVDs that can hold six times more data mean much better, high-resolution games. Blu-ray has already won backing from major Hollywood studios, such as MGM Studios, Disney, and Buena Vista, as well as top technology firms like Dell, LG, Samsung and Phillips amongst others. While Toshiba's HD-DVD technology has won backing from Paramount, Universal and Warner Bros. \"The real world benefits (of HD-DVD) are apparent and obvious,\" said Jim Cardwell, president of Warner Home Video. Mr Cardwell added that rapid time to market and dependability were significant factors in choosing to go with HD-DVD. Both formats are courting Microsoft to be the format of choice for the next generation Xbox, but discussions are still on-going. Next generation DVDs will also be able to store images and other data. CES is the largest consumer electronics show in the world, and runs from 6 to 9 January.\n", "llama3.2:1b": ["The Blu-ray DVD format is winning support over its rival HD-DVD due to its ability to hold high-definition video and sound, offering \"incredible 3D-like quality\" of pictures.", "Games giants Electronic Arts and Vivendi will both support the Blu-ray format, citing its capacity for delivering higher-resolution gameplay.", "The Blu-ray Association says games companies are focused on creating immersive environments with increased resolution and frame rates, which can be achieved through compressed graphics but is limited by current technology.", "Toshiba has announced plans to release DVD players by the end of 2005, while Sony is planning to use the technology in its next generation PlayStations.", "Major Hollywood studios such as MGM Studios and Disney are backing Blu-ray, while top technology firms like Dell, LG, Samsung, and Phillips have also chosen to support it."], "llama3.2:3b": ["Blu-ray DVD format wins more supporters than its rival HD-DVD with backing from game giants Electronic Arts and Vivendi.", "High-definition video and sound offer incredible 3D-like quality of pictures, making it a crucial technology for future films and games.", "Blu-ray discs will store 50GB of high-quality data, while Toshiba's HD-DVD holds 30GB.", "The format is seen as essential for the gaming industry, which is a $20 billion market worldwide, with gamers demanding more advanced optical-disc technologies.", "Major Hollywood studios, technology firms, and game developers back Blu-ray, citing its capacity, performance, and high-speed internet connectivity.", "Toshiba's HD-DVD also won backing from major studios, but rapid time to market and dependability were key factors in choosing the format."], "gemma2:2b": ["Blu-ray's high-definition capabilities are gaining traction as a preferred format for future films and games.", "Sony, Electronic Arts, and Vivendi support Blu-ray, offering advantages like larger storage capacity (50GB) compared to HD-DVD (30GB).", "This is crucial for games demanding more advanced graphics and immersion features.", "The move promises higher-resolution games and immersive experiences with less reliance on compression.", "Blu-ray faces competition from HD-DVD championed by studios like Paramount, Universal, and Warner Bros., who see it as a quicker solution to market and reliable technology.", "The next generation of DVDs will also hold images and other data for wider functionality."], "qwen2.5:0.5b": ["Gaming giants Electronic Arts, Vivendi, Sony and Toshiba support Blu-ray for high-definition video and audio formats.", "Gaming industry leaders are eager to move towards Blu-ray's advanced capabilities in 3D quality."], "qwen2.5:1.5b": ["Blu-ray wins support from major games companies including EA and Vivendi, as it competes with Toshiba's HD-DVD for DVD format supremacy in gaming.", "Blu-ray will hold more data than HD-DVD, offering better graphics and higher-quality video and sound capabilities, making it an attractive option for the high-definition future of movies and games."], "qwen2.5:3b": ["Games win for Blu-ray DVD format\n\nThe Blu-ray format, backed by over a hundred firms including Sony, has gained more supporters compared to its rival HD-DVD, according to its backers.", "Support includes game giants Electronic Arts and Vivendi Universal backing the Blu-ray format, which offers high-definition video and sound, appealing to major Hollywood studios and publishers.", "Blu-ray will store six times as much data as current DVDs and supports 3D-like pictures quality.", "Panasonic's Richard Doherty from Hollywood Labs claims this new technology can satisfy all future HD needs including recording functions for camcorders.", "Support has grown with the backing of Vivendi Universal and Electronic Arts, who see Blu-ray’s potential to deliver higher-quality games as crucial in gaming industry worth $20 billion.", "Moreover, Toshiba backed by Paramount also supports HD-DVD.", "Warner Home Video's Jim Cardwell believes HD-DVD benefits include rapid time-to-market and dependability issues.", "Discussions with Microsoft on Xbox are ongoing.", "Both technologies support storing images and other data."], "opencoder:1.5b": ["Games win for Blu-ray DVD format\n\nBlu-ray, backed by 100 firms including Sony, is competing against Toshiba and NEC-backed HD-DVD to be the format of choice for future films and games.", "The next generation of DVDs will hold high-definition video and sound.", "This offers incredible 3D-like quality of pictures which major Hollywood studios and games publishers are extremely keen to exploit in the coming year.", "In a separate press conference at the Consumer Electronics Show in Las Vegas, Toshiba announced that DVD players for its technology would be on the market by the end of 2005.", "\"As we move from standard definition video images to high-definition images, we have a much greater need for storage,\" Richard Doherty, said.", "The emerging DVD format war, akin to the Betamax and VHS fight in the 19xxs, can be resolved over the next year when next-generation DVD players start to come out.", "The support from Vivendi and Electronics Arts is a big boost to Blu-ray in the battle for supremacy.", "Gaming is a $20 billion industry worldwide, so is as crucial as the film industry in terms of money to be made.", "As technology continues to advance, gamers are focused on more capacity to deliver textures, deeper levels, for delivering higher-resolution playback.", "Fitting these models on current DVD technologies means compressing the graphics so much that much of this quality is lost.", "As games move to more photo-real capability, the current technology is limiting.", "The focus for games moving forward is on increased immersion.", "\"Gaming companies really like to focus on creating a world which involves creating complicated 3D models and textures,\" said Mr Doherty.", "Currently, graphics-intensive PC games also require multiple discs for installation.", "High-definition DVDs will cut down on that need.", "With the rise of Blu-ray technology, both Toshiba's HD-DVD technology has won backing from major Hollywood studios, as well as top technology firms like Dell, LG, Samsung and Phillips amongst others.", "While Toshiba's HD-DVD technology has won backing from Paramount, Universal and Warner Bros., \"The real world benefits (of HD-DVD) are apparent and obvious,\" said Jim Cardwell, president of Warner Home Video.", "Mr Cardwell added that rapid time to market and dependability were significant factors in choosing to go with HD-DVD.", "Both formats are courting Microsoft to be the format of choice for the next generation Xbox, but discussions are still on-going."], "smollm:1.7b": [], "deepseek-r1:1.5b": ["Blu-ray DVD format gains significant support with backing from 100 firms including Sony and NEC, making it a dominant industry competitor against HD-DVD.", "Utilizing blue laser technology, discs can hold six times the data compared to standard formats, essential for high-quality video and audio.", "Both Blu-ray and Toshiba are supported, while electronics companies like Electronic Arts and Vivendi show commitment with major studios backing it up.", "Gaming enthusiasts demand advanced graphics, necessitating blue-ray's superior capabilities.", "The industry benefits from 50GB storage per disc, crucial for immersive gaming experiences.", "While high-definition formats (HD-DVD) have a strong backing from studios, Blu-ray leads in innovation and technical support.", "Both formats aim to compete with Xbox next-gen offerings at CES in Las Vegas this year."], "tinyllama:1.1b": ["The next-generation DVD format has emerged as the favorite format for games after major Hollywood studio Blu-ray backers announced their support for the format.", "Supporting this format are major technology firms including Sony, Panasonic's Hollywood Laboratories and EA, while Tošiba's HD-DVD technology already won backing from Paramount, Universal and Warner Brother.", "The next generation of DVD players will be able to store 50GB of high-quality data, which is four times more than standard definition video images, while the standard DVD can hold six times as much.", "Blu-ray has also gained support from major Hollywood studio MGM Studios, Disney and Buenavista.", "In addition, the next generation Xbox will be powered by HD-DVD and feature a faster time to market with dependable and rapid image capabilities for Microsoft, allowing them to win a significant position in this market.", "The emerging DVD format war between Tošiba's HD-DVD technology and Blu-ray has been described as the biggest battle of all time."], "tinydolphin:1.1b": [" Blu-ray is winning over its rivals for the next-generation DVD format.", "With backing from major Hollywood studios like MGM Studios and Disney, as well as top technology firms like Dell, LG, Samsung, and Phillips, Blu-ray is positioning itself to dominate the high-definition DVD market.", "As game publishers such as Electronic Arts and Vivendi look to enter the next generation of DVD gaming, Blu-ray has the capacity, functionality, and interactivity needed for the kinds of projects they are planning.", "With the potential to provide players with a significantly improved immersive experience compared to current DVD technology, Blu-ray looks set to become the format of choice for future films and games."], "phi:2.7b": [" Blu-ray DVD, backed by 100 firms including Sony, has gained more supporters than Toshiba's HD-DVD format for future films and games.", "The next-generation DVDs will hold high-definition video and sound.", "Blu-ray discs can store six times the amount of data as today's DVDs due to blue laser-based technology.", "Both formats are competing to be chosen by Microsoft for the Xbox's next generation, but discussions are still ongoing.", "Next generation DVDs will also be able to record onto them and smaller discs to fit into camcorders.", "The support from Vivendi and Electronics Arts is a significant boost to Blu-ray in the DVD format war.", "Gaming is crucial to making money and Blu-ray offers high-quality graphics and internet connectivity needed for future games.", "Sony recently announced it would use the technology in its PlayStations, and gamers are eager for immersive experiences with better resolution and texture delivery."], "orca-mini:3b": [" Blu-ray wins more supporters than HD-DVD in the next-generation DVD format war, according to its backers.", "Games giants Electronic Arts and Vivendi have backed Blu-ray, while Toshiba's HD-DVD technology has support from Hollywood studios and technology firms.", "Both formats are courting Microsoft to be the format of choice for the next generation Xbox but discussions are still on-going.", "Next-generation DVDs will also be able to store images and other data.", "CES is the largest consumer electronics show in the world, and runs from 6 to 9 January."], "hermes3:3b": ["Blu-ray DVD format wins support from games companies EA and Vivendi."], "stablelm-zephyr:3b": ["Blu-ray is gaining more supporters than its rival, HD-DVD, backed by 100 companies including Sony.", "Blu-ray offers incredible 3D-like quality for games and films and will hold high-definition video and sound.", "Major Hollywood studios and game publishers are keen to exploit this in the coming year.", "Both Toshiba and Blu-ray hope that the format war between the two can be resolved within a year once next-generation DVD players come out, playing both standard DVDs as well.", "The support from gaming industry giants like Vivendi and Electronics Arts is significant for Blu-ray, which is crucial in the $20 billion global gaming market."], "chatgpt-4o-latest": ["Blu-ray, backed by Sony and 100 other firms, is gaining more support than its rival HD-DVD, backed by Toshiba and NEC, in the battle for the next-generation DVD format.", "Blu-ray received a major boost with support from gaming giants Electronic Arts and Vivendi, as gaming is a $20 billion industry and demands high-capacity storage for advanced graphics and immersive experiences.", "Blu-ray discs can store 50GB, compared to HD-DVD’s 30GB, making them more suitable for high-definition video, games, and recording.", "Sony plans to use Blu-ray in its next PlayStation, and major Hollywood studios like MGM, Disney, and Buena Vista have backed the format.", "Meanwhile, HD-DVD has support from Paramount, Universal, and Warner Bros., citing reliability and faster market entry.", "Both formats are competing for Microsoft’s next Xbox, and the industry hopes the format war will be resolved as next-generation DVD players emerge."], "stablelm2:1.6b": ["Blu-ray DVD format is gaining more supporters than HD-DVD, backed by major tech companies like Sony and EA.", "The next generation of DVDs will hold high-definition video and sound, offering better quality for games and Hollywood studios.", "Blu-Ray Association has announced that gaming giants Electronic Arts and Vivendi will both support its DVD format.", "High-Definition DVDs cut down on installation needs, allowing for much higher resolution games and better film distribution.", "Both Toshiba's HD-DVD and Blu-ray have received backing from Hollywood studios and technology firms.", "Microsoft is still considering whether to choose Blu-ray or HD-DVD as the format for next generation Xbox."], "granite3.1-dense:2b": ["Blu-ray, a next-generation DVD format backed by 100 companies including Sony, is gaining prominence over Toshiba's HD-DVD in the race for future films and games.", "Major game publishers Electronic Arts and Vivendi have announced their support for Blu-ray, which promises high-definition video and sound with 3D-like quality.", "The format uses blue laser technology to store up to 50GB of data per disc, compared to HD-DVD's 30GB capacity.", "This increased storage capacity enables game developers to create more advanced, immersive gaming experiences without the need for multiple discs or rapid data compression.", "Blu-ray has already secured backing from major Hollywood studios like MGM Studios, Disney, and Buena Vista, as well as technology giants Dell, LG, Samsung, and Phillips.", "The Consumer Electronics Show in Las Vegas marked the announcement that Toshiba aims to release Blu-ray DVD players by the end of 2005.", "The emerging format war is seen as akin to the Betamax versus VHS battle of the 1980s, with both formats hoping for resolution in the coming year as next-generation DVD players become available.", "These players will play not only high-definition Blu-ray discs but also standard DVDs, benefiting consumers who have extensive existing DVD collections."]}