{"raw_text": "Napster offers rented music to go\n \n Music downloading, for those that have rejected the free peer to peer services, can be a costly business.\n \n The cost of paying even as little as 70p per track can add up, particularly for those people who own one of the new generation of players that can store thousands of songs. Paying per track for music is becoming as outmoded as paying per minute for internet access and alternative monthly or yearly subscription models are springing up as a more convenient, and ultimately cheaper way of owning music.\n \n \"Music fans are moving away from buying the traditional bundled package of a dozen or more songs that we used to call an album to newer ways that fit their lifestyle; either single tracks or subscriptions services,\" said Paul Myers, chief executive of Wippit, a UK-based music download service. While iTunes is doing good business with its sales of individual tracks to iPod owners, others are questioning whether the concept of owning music is even valid in the digital age. Napster is due to launch a new rental subscription service - dubbed Napster to Go in the UK in the next few months. The service can be used on players that support Microsoft Windows latest Digital Rights Management technology known as Janus. This includes players made by Samsung, Rio and Creative.\n \n Currently on offer in beta-version in the US, the service costs $15 per month for unlimited downloads. The technology ensures that music downloaded to the player only remains playable while the user subscribes to the service. Users need to update their license on a monthly basis or the tunes will no longer play.\n \n This has outraged some digital music lovers, especially as Napster already offers a cheaper service for downloading music to the PC. Napster claims the higher price is a result of record labels charging more for the to-go service and says it also offers \"greater value\" for customers. Mr Myers is not convinced a rental model will work for consumers. \"We've been offering our unlimited music subscription service for more than three years now and our customers know what they want. Format interoperability, excellent value and the reassurance that music purchased from Wippit is theirs to keep and enjoy on whatever device they choose,\" he said. \"Who wants to download a track that won't play next month if you decide to unsubscribe to the service or change portable player for an iPod or the latest mobile phone?\" Wippit offers a download subscription service for £4.99 per month or £50 per year. It has a catalogue of around 60,000 songs.\n", "llama3.2:1b": ["Napster is offering a rental subscription service called Napster to Go, which allows users to access music on players that support Microsoft Windows' Digital Rights Management technology known as Janus.", "The service costs $15 per month and can be used on devices made by Samsung, Rio, and Creative.", "It also offers a download subscription service for £4.99 per month or £50 per year."], "llama3.2:3b": ["Napster plans to launch \"Napster to Go\" - a rental music subscription service costing $15/month in the US and £4.99/month in the UK, offering unlimited downloads with DRM technology ensuring tracks can only be played while subscribed.", "Alternative services like Wippit offer cheaper per-month options, questioning whether owning music is valid in the digital age."], "gemma2:2b": ["Napster is launching a new rental music subscription service called \"Napster to Go\" in the UK.", "The service allows users to rent individual tracks and it costs $15 per month for unlimited downloads.", "This method is similar to other subscription services such as Wippit, which offers unlimited downloads for £4.99 per month or £50 per year."], "qwen2.5:0.5b": ["Napster plans to launch a new rental subscription service called Napster to Go in the UK soon, offering free music downloads on players with Janus technology.", "Napster claims its higher price is due to record labels charging more for the \"to-go\" service.", "It also offers format interoperability, good value, and assurance that purchased songs are yours to keep and enjoy, even if they're not available when you change your portable player or mobile device.", "However, some digital music lovers still prefer the free peer-to-peer service offered by Napster."], "qwen2.5:1.5b": ["Napster introduces a music rental service called Napster to Go in the UK, offering monthly downloads at $15 for unlimited tracks on compatible devices like Windows and Janus players, including Samsung, Rio, and Creative's models.", "Critics argue this is too expensive compared to buying individual tracks or annual subscriptions offered by iTunes.", "Wippit provides alternative downloads for £4.99 per month or £50 annually with a 60,000 song catalogue."], "qwen2.5:3b": ["Napster is launching a new rental subscription music service called Napster to Go in the UK.", "This service allows users to rent tracks on players supporting Microsoft Windows' Digital Rights Management technology like those made by Samsung, Rio, and Creative.", "The monthly cost is $15 for unlimited downloads; however, this has raised concerns among digital music enthusiasts who prefer a subscription model rather than paying per track or album.", "Napster argues that the higher price is due to record labels charging more and that their service offers better value with features like format interoperability and reassurance of ownership across devices.", "In contrast, Wippit offers an unlimited download service for £4.99/month or £50/year, attracting customers who prefer subscription models."], "opencoder:1.5b": ["Napster offers rented music to go\n\nMusic downloading, for those that have rejected the free peer-to-peer services, can be a costly business.", "The cost of paying even as little as 70p per track can add up particularly for people who own one of the new generation of players capable of storing thousands of songs.", "Pay-per-track models have become increasingly popular due to internet access becoming more convenient and easier to manage.", "Music fans are moving away from buying a traditional bundled package of a dozen or more songs known as an album, embracing newer ways that fit their lifestyle; either single tracks or subscription services, Paul Myers, chief executive of Wippit, has raised doubts about the concept of owning music in the digital age.", "Currently on offer in beta-version in the US, the service costs $15 per month for unlimited downloads.", "The technology ensures that downloaded music stays playable while the user subscribes to the service.", "Users need to update their license on a monthly basis or the tunes will no longer play."], "smollm:1.7b": ["Music downloading, for those that have rejected the free peer to peer services, can be a costly business.", "Music downloading is becoming as outmoded as paying per minute for internet access and alternative monthly or yearly subscription models are springing up as a more convenient, and ultimately cheaper way of owning music.", "Napster offers rented music to go in beta-version in the US, but it also charges higher prices than Wippit's current service.", "Music fans are moving away from buying the traditional bundled package of a dozen or more songs that we used to call an album to newer ways that fit their lifestyle; either single tracks or subscriptions services.", "Napster is due to launch a new rental subscription service - dubbed Napster to Go in the UK in the next few months.", "The service can be used on players that support Microsoft Windows latest Digital Rights Management technology known as Janus.", "This includes players made by Samsung, Rio and Creative.", "Currently on offer in beta-version in the US, the service costs $15 per month for unlimited downloads.", "The technology ensures that music downloaded to the player only remains playable while the user subscribes to the service.", "Users need to update their license on a monthly basis or the tunes will no longer play.", "Mr Myers is not convinced a rental model will work for consumers.", "\"We've been offering our unlimited music subscription service for more than three years now and our customers know what they want,\" he said.", "\"Format interoperability, excellent value and the reassurance that music purchased from Wippit is theirs to keep and enjoy on whatever device they choose\" are all reasons why users will continue to subscribe to Napster's service.", "Wippit offers a download subscription service for £4.99 per month or £50 per year.", "It has a catalogue of around 60,000 songs."], "deepseek-r1:1.5b": ["Napster offers rented music to go, competing with free peer-to-peer services.", "Paying per track can be expensive, especially for those storing many songs.", "Paul Myers from Wippit argues that traditional albums are outdated, suggesting a new single-track or subscription-based approach.", "Napster introduces a rental model in the UK and US, offering $15/month on players supporting Windows' Janus technology and£4.99/month in the UK.", "Wippit offers 60k tracks at £50/year, providing value through easy access to music via devices."], "tinyllama:1.1b": ["The popularity of renting music to own has led some digital music lovers to question the viability of paying for individual tracks on players.", "In response, WippiT, an online music service, launched a new subscription-based rental service in the UK with the help of Windows Digital Rights Management technology called Napster To Go.", "The service is available in beta version and costs $15 per month, while users must update their license on a monthly basis or pay another $50 per year to continue using the music rental service.", "While there's been pushback from some consumers who prefer paying for individual tracks, WippiT offers great value for customers with an extensive catalogue and subscription-based service options available on various players."], "tinydolphin:1.1b": [" Napster's new rental music service, Napster to Go, offers users the option to rent individual tracks from their collection on players that support Microsoft Windows' latest Digital Rights Management technology known as Janus.", "The service costs $15 per month for unlimited downloads and requires users to update their license on a monthly basis or risk losing access to their music.", "This has outraged some digital music lovers, especially those who already pay for Napster's paid downloads through the PC.", "Wippit claims that its existing unlimited music subscription service offers greater value than Napster's rental model."], "phi:2.7b": [" Napster is planning to launch a rental subscription service called Napster to Go in the UK, which will allow users to rent music from their players for $15 per month.", "The service can be used on Samsung, Rio and Creative players that support Janus technology.", "However, some consumers are skeptical about paying per-track for music when alternative monthly or yearly subscriptions are more affordable.", "Wippit offers an unlimited music subscription service in the UK for £4.99 per month or £50 per year with a catalogue of around 60,000 songs."], "orca-mini:3b": [" Napster offers rented music to go, with a new rental subscription service launching in the UK soon.", "The service costs $15 per month for unlimited downloads and requires a monthly license update or the tunes will no longer play.", "Some digital music lovers are outraged by the higher price, arguing that it is not a rental model that works for consumers.", "Napster claims that its higher price is a result of record labels charging more for the to-go service and promises \"greater value\" for customers.", "Wippit offers a download subscription service for £4.99 per month or £50 per year, with a catalogue of around 60,000 songs."], "hermes3:3b": ["Napster to introduce paid music rental subs service, replacing traditional track purchases & bundled albums, competing with subscription models like Wippit's."], "stablelm-zephyr:3b": ["Napster is launching a rental subscription service called Napster to Go in the UK, offering alternative monthly or yearly subscription models to music ownership.", "This new service costs $15 per month and requires users to update their license monthly for continued playback.", "Critics argue that this pricing model provides little value compared to Wippit's unlimited download subscription service offered at £4.99 per month or £50 per year, with a catalog of around 60,000 songs.", "Napster asserts that the higher price is due to record labels charging more for the rental service and offers greater customer value."], "chatgpt-4o-latest": ["Napster is launching a new rental subscription service, Napster to Go, in the UK, allowing users to download unlimited music for $15 per month.", "The service works on players supporting Microsoft's Janus DRM technology, ensuring that downloaded tracks remain playable only while the subscription is active.", "Some music fans criticize the model, arguing that it lacks long-term value compared to services like Wippit, which offers permanent downloads for a lower price.", "While iTunes thrives on individual track sales, the industry is shifting towards subscription-based access rather than traditional music ownership."], "stablelm2:1.6b": ["Napster is launching a rental music subscription service called Napster to Go, available on devices like Samsung, Rio, and Creative with Microsoft's Digital Rights Management technology known as Janus.", "The service costs $0.99 per month for unlimited downloads and offers format interoperability, excellent value, and the assurance that users own the music.", "Wippit offers an unlimited music subscription service for £4.99 per month or £4.99 per year with a catalog of around 100,0..", "The text discusses how individual track purchasing is becoming obsolete in favor of alternative methods like rental subscriptions and monthly/yearly subscriptions, as well as the controversies surrounding Napster's new service offering.", "The service, Napster to Go, aims to provide music downloads through devices that support Microsoft's Digital Rights Management technology, and has sparked debates regarding its validity."], "granite3.1-dense:2b": ["Napster is launching a new rental music subscription service called Napster to Go, priced at $15 per month for unlimited downloads, targeting players compatible with Microsoft's Janus technology (e.g., Samsung, Rio, Creative).", "This service ensures that downloaded tracks remain playable only while subscribers are enrolled, requiring monthly license updates.", "Critics argue the high cost and potential loss of playability upon subscription cancellation or device change.", "In contrast, Wippit offers an unlimited music download subscription for £4.99 per month (equivalent to about $10) or £50 annually, with a catalog of approximately 60,000 songs.", "Wippit's chief executive, Paul Myers, questions the viability of owning individual tracks in the digital age and emphasizes customers' preference for format interoperability, excellent value, and device-agnostic music ownership."]}