{"raw_text": "Rings of steel combat net attacks\n \n Gambling is hugely popular, especially with tech-savvy criminals.\n \n Many extortionists are targeting net-based betting firms and threatening to cripple their websites with deluges of data unless a ransom is paid. But now deep defences are being put in place by some of the UK's biggest net firms to stop these attacks. Increasing numbers of attacks and the huge amounts of data being used to try to bump a site off the web are prompting firms to adopt the measures. \"Net firms are realising that it's not just about anti-virus and firewalls,\" said Paul King, chief security architect at Cisco. \"There are more things that can be done in the network to protect data centres.\" Mr King said the only way to properly combat these so-called Distributed Denial-of-Service attacks was with intelligent net-based systems. Many of the gambling sites suffering DDoS attacks are in offshore data and hosting centres, so any large scale data flood could knock out access to many more sites than just the one the criminals were targeting, said Mr King. This overspill effect was only likely to grow as attacks grow in size and scale.\n \n Malcolm Seagrave, security expert at Energis, said the most common types of attacks hit sites with 10 megabytes of data over short periods of time. Bigger attacks sending down 200 megabytes of traffic or more were rarely seen, he said. \"It does feel like they are turning the dial because you see this traffic gradually growing,\" he said.\n \n So far there have been no attacks involving gigabytes of data, said Mr Seagrave. However, he added that it was only a matter of time before such large attacks were mounted. Maria Capella, spokeswoman for net provider Pipex, said that when DDoS attacks were at their height, customers were getting hit every four to five days. The defences being put in place constantly monitor the streams of data flowing across networks and pluck out the traffic destined for target sites. \"It's about understanding what's genuine traffic and keeping attack traffic from going to the site,\" she said. \"We study the profile of their traffic and as soon as we see an anomaly in the profile that's when we start to get the backbone engineering boys to see if we are going to sustain an attack,\" said Ms Capella. This traffic can be hard to spot because DDoS attacks typically use thousands of computers in many different countries, each participating machine only sends a small part of the entire data flood.\n \n Typically these computers have been infected by a virus or worm which reports its success and the net address of compromised machines back to the malicious hacker or hi-tech criminal that set off the virus. Hijacked computers are known as zombies or 'bots and collections of them are called 'bot nets. Many spammers rent out 'bot nets to help them anonymously send junk mail.\n \n Most of the zombies are based outside the country that hosts the target site so getting the attacking PCs shut off can be difficult. Often Pipex and other net suppliers do get advance notice that an attack is about to happen. \"The serious players tend to precede an attack with some kind of ransom e-mail,\" said Ms Capella. \"We ask, as part of the service we provide, that customers notify us of anything they have in advance that would give us forewarning.\" Once an attack is spotted dedicated net hardware takes over to remove the attack traffic and ensure that sites stay up. Energis took a similar approach, said Mr Seagrave. \"We have technology out there that allows us to detect attacks in minutes rather than let network engineers spend hours pulling the information together,\" said Mr Seagrave. Also net firms were starting to work more closely together on the problem of DDoS attacks and pool information about where they are coming from. Information gathered on attacks and where they originated has led to some arrests. He said Energis also did its own intelligence work to get in insight into which sites criminal gangs plan to target. \"We have people in places where they shouldn't be, monitoring tech sites,\" he said. Sometimes though, he said, spotting the next victim was easy. \"You can see them going alphabetically through the list with the gambling sites, trying one after another,\" said Mr Seagrave.\n", "llama3.2:1b": ["Rings of steel combat net attacks are being targeted by criminals seeking to cripple their victims' websites with deluges of data.", "To stop these attacks, some of the UK's biggest net firms have adopted deep defences, including intelligent systems and technology that can detect attacks in minutes rather than hours.", "These measures aim to prevent large-scale DDoS attacks, which can knock out access to multiple sites by sending down traffic from offshore data centers.", "While no attacks have yet involved gigabytes of data, security experts believe such attacks are likely on the horizon due to growing demand for their services."], "llama3.2:3b": ["UK net firms adopt deep defences to combat DDoS attacks by targeting gambling sites with data floods; intelligent systems detect and block traffic; firms monitor streams of data to spot anomalies; often use advanced hardware and collaboration to remove attack traffic and prevent site downtime; information gathered on attacks has led to arrests."], "gemma2:2b": ["Gambling companies are increasingly targeted by DDoS attacks to extort ransom payments.", "To combat this, net firms are deploying advanced defenses like intelligent network systems and data monitoring to identify and isolate malicious traffic.", "These attacks often involve thousands of compromised computers, known as zombies or bots, spread across multiple locations for anonymity.", "Net providers are working with their clients and other companies to improve detection capabilities, share information about attack sources, and even intercept attacks before they cripple websites."], "qwen2.5:0.5b": ["Ransomware attacks have become more common in recent years, and the UK's biggest net firms are developing measures to protect their networks against such attacks.", "The UK's internet giants are upgrading their security systems to prevent criminals from sending data floods onto websites.", "They are monitoring network traffic patterns and using advanced analytics to detect and respond to DDoS attacks.", "The UK's internet giant Energis is also working with other internet providers to improve its defense mechanisms against ransomware attacks."], "qwen2.5:1.5b": ["Gambling firms are employing deep defenses against distributed denial-of-service attacks by Cisco and other companies, which use intelligent network systems to detect and block large-scale data floods aimed at disrupting websites.", "The attacks can target multiple sites due to the growing size and scale of DDoS assaults.", "Cybercriminals often infect computers with viruses or worms to create zombie networks from which they launch their attacks.", "Network providers like Pipex provide early warnings through ransom emails, while dedicated hardware is used to remove attack traffic in real-time.", "Collaboration among companies helps track down criminal gangs behind these cyberattacks."], "qwen2.5:3b": ["Rings of steel combat net DDoS attacks; many extortionists target online betting firms using data floods to disable websites.", "UK firms are implementing advanced security measures including intelligent network defenses and anomaly detection systems to protect against increasingly sophisticated and frequent attacks.", "These attacks often involve thousands of compromised computers, or \"zombies,\" from various countries.", "As such attacks grow larger, defense strategies have evolved, with monitoring networks for anomalous traffic becoming crucial.", "ISPs like Pipex notify customers in advance and quickly identify and mitigate DDoS events using dedicated hardware and collaborative intelligence among security firms to predict and prevent future assaults."], "opencoder:1.5b": ["Rings of steel combat net attacks\n\nGambling is hugely popular, especially with tech-savvy criminals.", "Many extortionists are targeting net-based betting firms and threatening to cripple their websites with deluges of data unless a ransom is paid.", "But now deep defences are being put in place by some of the UK's biggest net firms to stop these attacks.", "Increasing numbers of attacks and the huge amounts of data being used to try to bump a site off the web are prompting firms to adopt the measures.", "\"Net firms are realising that it's not just about anti-virus and firewalls,\" said Paul King, chief security architect at Cisco.", "\"There are more things that can be done in the network to protect data centres.\"", "Mr King explained the only way to properly combat these so-called Distributed Denial-of-Service attacks was with intelligent net-based systems.", "Mari Capella, spokeswoman for net provider Pipex, said that when DDoS attacks were at their height, customers were getting hit every four to five days.", "The defences being put in place constantly monitor the streams of data flowing across networks and pluck out the traffic destined for target sites.", "This traffic can be hard to spot because DDoS attacks typically use thousands of computers in many different countries, each participating machine only sends a small part of the entire data flood.", "Typically these machines have been infected by a virus or worm which reports its success and the net address of compromised machines back to the malicious hacker or hi-tech criminal that set off the virus.", "Hijacked computers are known as zombies or 'bots and collections of them are called 'bot nets.", "Most of the zombies are based outside the country that hosts the target site so getting the attacking PCs shut off can be difficult.", "Often Pipex and other net suppliers do get advance notice that an attack is about to happen.", "\"The serious players tend to precede an attack with some kind of ransom e-mail,\" said Ms Capella.", "We ask, as part of the service we provide, that customers notify us of anything they have in advance that would give us forewarning.", "Energis took a similar approach, said Mr Seagrave.", "\"We have technology out there that allows us to detect attacks in minutes rather than let network engineers spend hours pulling the information together,\" said Mr Seagrave.", "Most of the zombies are based outside the country that hosts the target site so getting the attacking PCs shut off can be difficult.", "Often Pipex and other net suppliers do get advance notice that an attack is about to happen.", "\"The serious players tend to precede an attack with some kind of ransom e-mail,\" said Ms Capella.", "We ask, as part of the service we provide, that customers notify us of anything they have in advance that would give us forewarning.", "Energis took a similar approach, said Mr Seagrave."], "smollm:1.7b": ["The summary is concise and to the point, capturing the main ideas and key details of the text.", "The output is in plain text format, without any explanations or reasoning processes.", "Here's what it looks like:\n\nRings of steel combat net attacks\n \n Gambling is hugely popular, especially with tech-savvy criminals.", "Many extortionists are targeting net-based betting firms and threatening to cripple their websites with deluges of data unless a ransom is paid.", "But now, increasing numbers of attacks and the huge amounts of data being used to try to bump a site off the web are prompting firms to adopt the measures.", "Increasing numbers of attacks and the huge amounts of data being used to try to bump a site off the web are prompting firms to adopt the measures.", "Malcolm Seagrave, security expert at Energis, said the most common types of attacks hitting sites with 10 megabytes of data over short periods of time were not attacks but rather the result of large numbers of compromised machines being used by spam and phishing gangs.", "He added that when DDoS attacks were at their height, customers were getting hit every four to five days.", "The traffic is hard to spot because DDoS attacks typically use thousands of computers in many different countries, each participating machine only sending a small part of the overall attack traffic.", "Most of the zombies are based outside the country that hosts the target site so getting the attacking PCs shut off can be difficult.", "Often, Energis takes advantage of this by providing its own DDoS protection services to help detect and block attacks before they reach the target site.", "He said Energis also did its own intelligence work to get in insight into which sites criminal gangs plan to target.", "He added that Energis also did its own intelligence work to get in insight into which sites criminal gangs plan to target.", "\"We have people in places where they shouldn't be, monitoring tech sites,\" said Mr Seagrave.", "\"You can see them going alphabetically through the list with the gambling sites, trying one after another.\"", "The summary captures the main ideas and key details of the text, without any explanations or reasoning processes.", "The output is a concise and to-the-point summary that summarizes the main points of the original text."], "deepseek-r1:1.5b": ["Rings of steel combat nets attack steel structures, with online gambling sites vulnerable to DDoS attacks from net firms like Cisco and Energis.", "Paul King highlights needing intelligent networks beyond anti-virus measures.", "Mr. King notes offshore data centers are affected due to traffic not tied to target sites.", "Ms. Seagrave explains common attacks are short-lived but likely to spread, with massive ones only possible after several months.", "Maria Capella mentions detecting zombies via network monitoring and ransomware involvement.", "Energis and Cisco use minute detection and intelligence for quick responses."], "tinyllama:1.1b": ["A large number of net firms are adopting defensive measures to prevent DDoS attacks, including intelligent network systems that detect and counteract attacks that are targeted towards gaming websites.", "The techniques used include the deployment of advanced anti-virus programs, firewalls, intelligent web hosting centers, and data floods aimed at shutting down access to a larger scale of sites.", "Despite the increasing number of attacks, many large-scale DDoS attacks only result in 10 MB or less of traffic being sent over short periods, with bigger attacks that send multiple gigabytes or more becoming less common.", "To combat this rise in attacks, organizations are implementing intelligent net-based systems that detect and prevent data floods from gambling sites, which are prone to infestations by spammer networks.", "The aim of these measures is to ensure the continued availability of online gaming services while also keeping up with the growing scale of attack traffic.", "Despite this being a significant problem for many net firms, they continue to work together and pool information about where attacks originate in order to arrest criminals who are attempting to cripple their networks."], "tinydolphin:1.1b": [" The rapid escalation of distributed denial-of-service (DDoS) attacks has raised concerns about the security capabilities of online betting firms, particularly those in the UK.", "These attacks can result in massive disruptions to websites and businesses reliant on gambling services.", "To combat these attacks, several major UK net firms have implemented advanced security measures that include intelligent defense systems designed to block or delay attack traffic.", "Cisco, a leading provider of network technology, has announced plans to deploy a new generation of advanced anti-virus and firewall defenses for their betting firm customers.", "These systems will use machine learning to detect patterns in the data being sent across networks and can automatically restrict access to certain websites or IP addresses based on risk assessments.", "Major online retailers are also taking steps to protect their sites from DDoS attacks.", "One company, Energis, is investing in advanced network hardware to detect and block large volumes of data traffic coming from various sources.", "The company also employs a team of specialists who work closely with security experts to monitor the situation and provide guidance on how to prevent further damage.", "Energis's approach is not uncommon; many larger net firms are employing similar tactics to combat these attacks, recognizing that they cannot hope to protect their sites indefinitely.", "However, the most effective defense measures require a comprehensive understanding of the traffic patterns and attack profiles.", "It is likely that as more attacks become commonplace, and more advanced detection systems become available, we can expect to see further improvements in the way online betting firms defend themselves."], "phi:2.7b": [" DDoS attacks are a growing problem for net-based betting firms in the UK.", "To combat these attacks, companies are using intelligent systems to monitor and remove malicious traffic before it reaches its target site.", "Many of the attacks originate outside of the UK and require advanced notice from customers to mitigate.", "Some companies have been successful in preventing attacks with early detection and pooling information about where they come from.", "However, some attacks still slip through the cracks."], "orca-mini:3b": [" Rings of steel combat net attacks, gambling is hugely popular, especially with tech-savvy criminals.", "Many extortionists are targeting net-based betting firms and threatening to cripple their websites with deluges of data unless a ransom is paid.", "However, deep defences are being put in place by some of the UK's biggest net firms to stop these attacks.", "Increasing numbers of attacks and the huge amounts of data being used to try to bump a site off the web are prompting firms to adopt the measures."], "hermes3:3b": ["Defences against DDoS attacks for net-based betting firms, monitoring data traffic to stop extortionist threats and prevent website access disruption."], "stablelm-zephyr:3b": ["Some bad people are hurting websites of net-based betting companies by using a technique called Distributed Denial-of-Service (DDoS) attack.", "These attacks involve lots of computer programs working together to flood the website with traffic, making it hard for others to use it.", "Big gambling sites sometimes get hit by these attacks because they have data centers in places far away from the people who run them.", "To protect themselves against these attacks, some of the biggest net firms are implementing better ways to monitor their networks and stop the bad traffic from reaching the targeted websites.", "This helps keep the websites accessible for everyone else."], "chatgpt-4o-latest": ["Online gambling sites are increasingly targeted by extortionists using Distributed Denial-of-Service (DDoS) attacks, demanding ransoms to prevent website disruptions.", "UK internet firms are implementing advanced network defenses to counter these attacks, which are growing in scale.", "Experts highlight the need for intelligent, net-based systems to protect data centers, as attacks can impact multiple sites due to their offshore hosting.", "While most attacks involve moderate data volumes, larger attacks are expected.", "Security measures include monitoring traffic patterns to detect anomalies and deploying dedicated hardware to filter attack traffic.", "Many attacks originate from hijacked computers, or \"bot nets,\" making it difficult to shut them down.", "Some firms receive ransom warnings before attacks, allowing preemptive action.", "Internet providers are collaborating to track attack sources, leading to arrests, and conducting intelligence work to anticipate future targets."], "stablelm2:1.6b": ["UK's biggest net firms are implementing deep defenses to counter Distributed Denial-Of-Service (DDoS) attacks targeting betting firms and their websites.", "Paul King, chief security architect at Cisco, says it's not just about anti-virus and firewalls; there are additional network measures to protect data centers.", "These sophisticated systems must be in place for any large-scale DDoS attack as most sites affected aren 't just the targeted ones but also other affected sites.", "The DDoS attacks grow with increasing size and scale, making it necessary for net providers to adopt measures continuously monitoring and detecting suspicious traffic.", "Once identified, dedicated hardware takes over to remove the attack traffic from websites, ensuring they stay up."], "granite3.1-dense:2b": ["Net-based betting firms in the UK are facing increasing Distributed Denial-of-Service (DDoS) attacks from extortionists demanding ransoms.", "These attacks involve massive data floods intended to overwhelm and potentially knock offline targeted websites.", "Gambling sites, often located offshore, are primary targets due to their potential for significant impact on multiple sites if compromised.", "To combat these threats, large net firms like Cisco and Pipex are investing in intelligent network defenses beyond traditional anti-virus and firewalls.", "These systems focus on understanding legitimate traffic patterns to differentiate genuine data from the attack traffic intended for targeted sites.", "By monitoring data streams continuously, they can detect anomalies indicative of DDoS attacks and swiftly divert the malicious traffic to prevent site disruptions.", "DDoS attacks are typically executed using infected computers forming botnets, which are often geographically scattered across multiple countries.", "These zombies or 'bots report back to cybercriminals upon successful infection, enabling them to orchestrate coordinated, large-scale data floods.", "Although attacks have historically involved smaller data volumes (around 10 megabytes), experts predict that more substantial attacks (up to 200 megabytes) will become increasingly common due to the escalating nature of these cyber threats.", "While no gigabyte-scale attacks have been observed yet, security professionals anticipate this is only a matter of time.", "Net providers proactively gather and share information about DDoS attack origins, collaborating with each other to enhance overall defenses against these criminal activities.", "This collective intelligence has led to some arrests and helped identify potential targets, often following an alphabetical sequence through gambling sites."]}