{"raw_text": "Speak easy plan for media players\n \n Music and film fans will be able to control their digital media players just by speaking to them, under plans in development by two US firms.\n \n ScanSoft and Gracenote are developing technology to give people access to their film and music libraries simply by voice control. They want to give people hands-free access to digital music and films in the car, or at home or on the move. Huge media libraries on some players can make finding single songs hard. \"Voice command-and-control unlocks the potential of devices that can store large digital music collections,\" said Ross Blanchard, vice president of business development for Gracenote. \"These applications will radically change the car entertainment experience, allowing drivers to enjoy their entire music collections without ever taking their hands off the steering wheel,\" he added.\n \n Gracenote provides music library information for millions of different albums for jukeboxes such as Apple's iTunes. The new technology will be designed so that people can play any individual song or movie out of a collection, just by saying its name. Users will also be able to request music that fits a mood or an occasion, or a film just by saying the actor's name. \"Speech is a natural fit for today's consumer devices, particularly in mobile environments,\" said Alan Schwartz, vice president of SpeechWorks, a division of ScanSoft. \"Pairing our voice technologies with Gracenote's vast music database will bring the benefits of speech technologies to a host of consumer devices and enable people to access their media in ways they've never imagined.\" The two firms did not say if they were developing the technology for languages other than English. Users will also be able to get more information on a favourite song they have been listening to by asking: \"What is this?\" Portable players are becoming popular in cars and a number of auto firms are working with Apple to device interfaces to control the firm's iPod music player. But with tens of thousands of songs able to be stored on one player, voice control would make finding that elusive track by Elvis Presley much easier. The firms gave no indication about whether the iPod, or any other media player, were in mind for the use of the voice control technology. The companies estimate that the technology will be available in the fourth quarter of 2005.\n", "llama3.2:1b": ["Two US firms, ScanSoft and Gracenote, are developing a technology that allows users to control their digital media players using voice commands.", "This technology will allow people to access their music libraries and films without having to touch the player.", "The technology can play individual songs or movies out of a collection by saying its name.", "It also includes features such as requesting music for a mood or occasion, or a film just by mentioning an actor's name.", "The firm estimates that the technology will be available in the fourth quarter of 2005."], "llama3.2:3b": ["Two US firms ScanSoft and Gracenote are developing technology to allow users to control digital media players using voice commands, enabling hands-free access to music libraries and film collections.", "The system will allow users to play individual songs or movies by name, request music based on mood or occasion, and access information about favorite songs.", "The technology is expected to be available in the fourth quarter of 2005 for use with portable media players and other devices."], "gemma2:2b": ["Two US firms, ScanSoft and Gracenote, are developing voice-controlled technology for digital media players.", "This technology allows users to access their music and film libraries just by speaking commands.", "Features include playing specific songs, movies, or finding audio based on mood or occasion by name.", "The technology will be available in the fourth quarter of 2005."], "qwen2.5:0.5b": ["Two US firms are developing a technology to allow users to control their digital media players simply by speaking to them.", "ScannedSoft and Gracenote want to give people access to large music and film libraries without ever taking their hands off the steering wheel.", "These applications can play any song or movie out of a collection, just by saying its name.", "Users will also be able to request specific songs by their names.", "ScannedSoft estimates the technology will be available in the fourth quarter of 2005."], "qwen2.5:1.5b": ["ScanSoft and Gracenote are developing a speech-based system to allow digital music and film players to be controlled by voice commands, improving access to large libraries and making use of natural speech as an interface for media devices.", "The technology will enable playing any individual song or movie just by name, requesting songs matching a mood or occasion, and getting information on favorite tracks.", "This development is expected in the fourth quarter of 2005, potentially enhancing entertainment experiences in cars and other mobile environments."], "qwen2.5:3b": ["Music and film fans can control their digital media players via voice commands by two US firms, ScanSoft and Gracenote.", "They aim to provide hands-free access to large music collections stored on players, making it easier to find songs or request specific genres/moods.", "Gracenote supplies information for millions of albums in jukeboxes like Apple's iTunes, while ScanSoft’s SpeechWorks technology will pair with Gracenote’s vast music database.", "The feature is intended for use with various consumer devices and is expected available by the fourth quarter of 2005.", "The firms have not specified if their tech supports non-English languages or specific media players like the iPod."], "opencoder:1.5b": ["Speak easy plans for media players – Music and film fans will have access to a music library just by saying the song's name or actor's name, making finding them accessible without ever taking their hands off the steering wheel.", "The new technology will revolutionize car entertainment experience allowing drivers to enjoy entire music collections in one gesture, regardless of whether they are driving in a car or at home or on the move."], "smollm:1.7b": ["The summary is concise and to the point, preserving key ideas and details from the original text.", "It provides a brief overview of the two US firms' plans for developing speech-enabled media players, including their vision for giving people hands-free access to digital music and films in various environments.", "The summary does not provide additional information or explanations about the technology itself, but rather focuses on the key points mentioned in the original text."], "deepseek-r1:1.5b": ["Two tech firms, ScanSoft and Gracenote, are developing voice control technology for media players.", "Their goal is to allow users to access music and films without hands by speaking, revolutionizing devices like cars where mobile use is common.", "The technology aims to make searches and requests natural with speech, enhancing accessibility in various environments."], "tinyllama:1.1b": ["A US-based company, ScanSoft, and GraceNote are working on technologies to allow easy access to digital media and movies via voice commands.", "Users can command their digital media players just by speaking to them, allowing hands-free access to large digital music collections in cars or at home or on the move.", "The two companies have plans to develop technology that would allow users to control their film and music libriaries simply by speaking, giving people hands-free access to a vast music collection.", "These apps will radically change car entertainment experiences and allow users to request music tailored to their mood or occasion, as well as play any individual song or movie out of a collection.", "The two companies, ScanSoft and GraceNote, have not announced whether voice control would be available for specific media players.", "However, they expect the technology to be available in the fourth quarter of 2005."], "tinydolphin:1.1b": [" This text provides information on a new project by two American computer software companies: ScanSoft and Gracenote, which is aimed at simplifying access to media libraries using voice control technology.", "The proposed solution would allow users to enjoy their entire music collections on digital devices such as car entertainment systems or homes, without needing to take their hands off the steering wheel.", "Voice command-and-control unlocks the potential of digital music and films in cars, while also enhancing the user experience at home or on the move.", "The companies propose designing speech technologies for mobile devices, particularly those used in smartphones, to enable users to access media simply by saying their favorite actors' names."], "phi:2.7b": [" Two US companies are developing technology to give people access to their digital music and film libraries by speaking to their media players.", "This will allow users to play any individual song or movie out of a collection, as well as request music that fits a mood or occasion.", "The technology is set to be available in the fourth quarter of 2005 and would make finding a particular track much easier on devices such as iPods."], "orca-mini:3b": [" Music and film fans will soon be able to control their digital media players simply by speaking to them, under plans developed by ScanSoft and Gracenote.", "The technology will give people hands-free access to their music and film libraries in the car, or at home or on the move.", "With vast media libraries on some players, finding single songs can be hard.", "Voice command-and-control will unlock the potential of devices that can store large digital music collections, according to the firms.", "The technology will be designed so that users can play any individual song or movie out of a collection just by saying its name.", "Additionally, users will be able to request music that fits a mood or an occasion, or a film just by saying the actor's name.", "The two firms did not say if they were developing the technology for languages other than English.", "Portable players are becoming popular in cars and a number of auto firms are working with Apple to device interfaces to control the firm's iPod music player.", "With tens of thousands of songs able to be stored on one player, voice control would make finding that elusive track by Elvis Presley much easier.", "The firms gave no indication about whether the iPod or any other media player were in mind for the use of the voice control technology.", "The companies estimate that the technology will be available in the fourth quarter of 2005."], "hermes3:3b": ["Speak control for digital media players (ScanSoft, Gracenote).", "Allow hands-free access to music & films.", "Voice commands for large collections, mood/music requests, actor names for films.", "Estimated availability: Q4 2005."], "stablelm-zephyr:3b": ["US firms ScanSoft and Gracenote are developing technology that will allow users to control their digital media players via voice commands, providing hands-free access to music and films.", "The new system will enable drivers to enjoy their entire music collections without taking their hands off the steering wheel.", "Gracenote already provides music library information for millions of different albums for jukeboxes like Apple's iTunes, and the new technology will allow users to play any individual song or movie out of a collection by simply saying its name.", "The companies estimate that the technology will be available in Q4 2005."], "chatgpt-4o-latest": ["Two US firms, ScanSoft and Gracenote, are developing voice control technology for digital media players, allowing users to access music and films hands-free in cars, at home, or on the move.", "The technology will enable users to play specific songs or movies by name, request media based on mood or occasion, and obtain information about a song by asking, \"What is this?\"", "Gracenote, which provides music library data for platforms like iTunes, and ScanSoft's SpeechWorks division believe voice control will enhance the user experience, especially in mobile environments.", "The companies did not specify if the technology would support languages other than English or which media players it would be compatible with.", "The technology is expected to be available in late 2005."], "stablelm2:1.6b": ["Two US firms are developing technology to allow people to access their music and film libraries using voice control, aiming for hands-free access across various devices including cars.", "The plans include allowing users to play any song or movie simply by saying its name, request music based on mood or occasion, or identify actors within films.", "This collaboration between ScanSoft and Gracenote aims to bring speech technologies to a range of consumer devices, making media accessibility easier for millions of different albums.", "Available in the fourth quarter of 2015, this technology will revolutionize car entertainment experiences, enabling drivers to enjoy their entire music collections without ever touching the steering wheel."], "granite3.1-dense:2b": ["US-based firms ScanSoft and Gracenote are collaborating on a voice control technology for digital media players, enabling users to manage their film and music libraries hands-free.", "This feature aims to enhance car entertainment by allowing drivers to access entire collections without removing their hands from the steering wheel.", "Users will be able to request specific songs or films by name, mood, occasion, or even actor's names.", "The technology is expected to support English and could potentially extend to other languages.", "Additionally, users can inquire about a song they're currently listening to with a question like \"What is this?\"", "The companies anticipate launching the feature in the fourth quarter of 2005."]}