{"raw_text": "US peer-to-peer pirates convicted\n \n The first convictions for piracy over peer-to-peer networks have been handed down in the US.\n \n New Yorker William Trowbridge and Texan Michael Chicoine have pleaded guilty to charges that they infringed copyright by illegally sharing music, movies and software. The two men faced charges following raids in August on suspected pirates by the FBI. The pair face jail terms of up to five years and a $250,000 (£130,000) fine.\n \n In a statement the US Department of Justice said the two men operated the central hubs in a piracy community organised across the Direct Connect peer-to-peer network. The piracy group called itself the Underground Network and membership of it demanded that users share between one and 100 gigabytes of files. Direct Connect allows users to set themselves up as central servers that act as co-ordinating spots for sharers. Users would swap files, such as films and music, by exchanging data over the network. During its investigation FBI agents reportedly downloaded 84 movies, 40 software programs, 13 games and 178 \"sound recordings\" from the five hubs that made up the larger piracy group. The raids were organised under the umbrella of Operation Digital Gridlock which was aimed at fighting \"criminal copyright theft on peer-to-peer networks\". In total, six raids were carried out in August. Five were on the homes of suspected copyright thieves and one on a net service firm. The Department of Justice said that both men pleaded guilty to one count of conspiracy to commit felony copyright infringement. They also pleaded guilty to acting for commercial advantage. The two men are due to be sentenced on 29 April.\n", "llama3.2:1b": ["US peer-to-peer pirates William Trowbridge and Michael Chicoine have pleaded guilty to charges of piracy over peer-to-peer networks, infringing copyright by sharing music, movies, and software.", "They face up to five years in jail and a £130,000 fine.", "The US Department of Justice conducted raids on suspected pirates operating the Central Hubs of the Underground Network, a piracy community that allowed users to share files between 1-100 gigabytes via Direct Connect peer-to-peer networks."], "llama3.2:3b": ["Two US individuals, William Trowbridge and Michael Chicoine, have pleaded guilty to piracy charges related to sharing music, movies, and software on peer-to-peer networks, with jail terms of up to five years and a $250,000 fine pending."], "gemma2:2b": ["William Trowbridge and Michael Chicoine were convicted in the US for their role in a peer-to-peer network piracy group called the Underground Network.", "The group infringed copyright by illegally sharing music, movies, and software via Direct Connect.", "The men face up to five years in prison and a $250,000 fine.", "FBI raids targeting the group's hubs resulted in the download of numerous copyrighted works.", "They are due for sentencing on April 29th."], "qwen2.5:0.5b": ["Key points from the text:\n\n- US authorities have convicted William Trowbridge and Michael Chicoine for piracy over peer-to-peer networks.", "- New Yorker William Trowbridge and Texan Michael Chicoine pleaded guilty to charges of infringing copyright by sharing music, movies, and software via direct connections.", "- The two men were involved in a larger organization called the Underground Network that operated through central hubs across the Direct Connect peer-to-peer network.", "They demanded users share between 100 GB files.", "- FBI agents downloaded 84 movies, 40 software programs, 13 games, and 178 sound recordings from these five hubs.", "- The raids were organized under Operation Digital Gridlock, aimed at fighting criminal copyright theft on peer-to-peer networks."], "qwen2.5:1.5b": ["Two US men, William Trowbridge and Michael Chicoine, have been convicted in federal court of violating copyright laws by sharing copyrighted music, movies, software, and games through peer-to-peer networks, with the government claiming they were part of a larger criminal organization known as the Underground Network.", "They face up to five years in prison and fines totaling $250, 000.", "The raid was part of Operation Digital Gridlock aimed at combating \"criminal copyright theft on peer-to-peer networks.\""], "qwen2.5:3b": ["US court convicts peer-to-peer pirates: William Trowbridge and Michael Chicoine were found guilty for illegally sharing music, movies, and software via Direct Connect networks in August.", "They faced up to five years in prison and a $250,000 fine.", "The US Department of Justice stated that the two operated central hubs in an Underground Network piracy group on Direct Connect, which FBI investigated with Operation Digital Gridlock.", "During raids, FBI downloaded numerous copyrighted files.", "Both pleaded guilty to conspiracy to commit felony copyright infringement and acting for commercial advantage; they are due to be sentenced April 29."], "opencoder:1.5b": ["The US peer-to-peer pirates convicted have firstly convicts committed in August, following the raid involving William Trowbridge and Texan Michael Chicoine.", "They face jail terms of up to five years and a $250,000 fine.", "The pair are then due to be sentenced on 29 April."], "smollm:1.7b": ["The first convictions for piracy over peer-to-peer networks have been handed down in the US.", "New Yorker William Trowbridge and Texan Michael Chicoine have pleaded guilty to charges that they infringed copyright by illegally sharing music, movies and software.", "The two men face jail terms of up to five years and a $250,000 (£130,000) fine.", "In a statement the US Department of Justice said the two men operated the central hubs in a piracy community organized across the Direct Connect peer-to-peer network.", "The piracy group called itself the Underground Network and membership of it demanded that users share between one and 100 gigabytes of files.", "Direct Connect allows users to set themselves up as central servers that act as co-ordinating spots for sharers.", "Users would swap files, such as films and software, by exchanging data over the network.", "During its investigation FBI agents reportedly downloaded 84 movies, 40 software programs, 13 games and 178 \"sound recordings\" from the five hubs that made up the larger piracy group.", "The raids were organized under the umbrella of Operation Digital Gridlock which was aimed at fighting \"criminal copyright theft on peer-to-peer networks\".", "In total, six raids were carried out in August.", "Five were on the homes of suspected copyright thieves and one on a net service firm.", "The Department of Justice said that both men pleaded guilty to one count of conspiracy to commit felony copyright infringement.", "They also pleaded guilty to acting for commercial advantage.", "The two men are due to be sentenced on 29 April."], "deepseek-r1:1.5b": ["William Trowbridge and Michael Chicoine are convicted of copyright infringement through peer-to-peer networks in the US.", "They operated as central hubs in Direct Connect, sharing files for movies, music, and software.", "They were part of the Underground Network, facing up to five years jail time and $250k fine for conspiring to commit felony copyright infringement.", "They were part of Operation Digital Gridlock raids conducted by FBI agents, which included six raids targeting suspected pirates in August 2023."], "tinyllama:1.1b": ["A US peer-to-peer pirates have been convicted, following a raid on suspected piracy community organised across Direct Connect peer-to-peer network hubs.", "The two men involved in the case pleaded guilty to charges of infring copyright, following raids carried out in August by US Department of Justice.", "They were accused of operating a piracy group called the Underground Network and demanding that users share between one and 100 gigabytes of files.", "During the investigation, agents downloaded 84 movie files, 40 software programs, 13 games, and 178 sound recording files from five hubs on Direct Connect networks.", "The six raids were carried out in August, resulting in six people being charged with conspiracy to commit felony copyright infringement, while one person was charged with the same offence on a net service firm's premises.", "Both men will face sentencing on 29 April."], "tinydolphin:1.1b": [" US peer-to-peer pirates convicted, Trowbridge and Chicoine, New Yorker William and Texan, face jail terms of up to five years and a $250,000 (£130,000) fine."], "phi:2.7b": [" Two individuals have been convicted in the US for piracy over peer-to-peer networks, including illegally sharing music, movies and software.", "The pair operated as central hubs in a piracy community known as the Underground Network, demanding that users share between one and 100 gigabytes of files.", "Six raids were carried out during Operation Digital Gridlock to fight \"criminal copyright theft on peer-to-peer networks.\""], "orca-mini:3b": [" In the US, two men have been convicted of piracy over peer-to-peer networks.", "William Trowbridge and Michael Chicoine pleaded guilty to charges of infringing copyright by illegally sharing music, movies, and software.", "They operated as central hubs in a piracy community called the Underground Network, which had over 50 members.", "During the investigation, FBI agents downloaded over 84 movies, 40 software programs, 13 games, and 178 \"sound recordings\" from the network's five hubs.", "The raids were part of Operation Digital Gridlock, aimed at stopping criminal copyright theft on peer-to-peer networks.", "Trowbridge and Chicoine were sentenced to jail terms of up to five years and a $250,000 fine, respectively."], "hermes3:3b": ["US peers convicted for peer-to-peer piracy"], "stablelm-zephyr:3b": ["Two US citizens have been convicted for piracy over peer-to-peer networks, facing jail terms of up to five years and a $250,000 fine.", "William Trowbridge and Michael Chicoine pleaded guilty to infringing copyright by sharing music, movies, and software through the Underground Network, a piracy group that demanded users share between one and 100 gigabytes of files.", "The men operated central hubs for the network, which included five Direct Connect hubs used for file-sharing.", "They are due to be sentenced on April 29."], "chatgpt-4o-latest": ["The first US convictions for piracy over peer-to-peer networks have been handed down.", "William Trowbridge and Michael Chicoine pleaded guilty to copyright infringement for illegally sharing music, movies, and software.", "They operated central hubs in the Underground Network, a piracy group using the Direct Connect network, where users shared large amounts of files.", "FBI agents downloaded extensive pirated content during their investigation.", "The convictions resulted from Operation Digital Gridlock, which targeted copyright theft.", "The two men face up to five years in prison and a $250,000 fine, with sentencing set for April 29."], "stablelm2:1.6b": ["US authorities convicted two individuals, including New Yorker William Trowbridge and Texan Michael Chicoine, for piracy activities over peer-to-peer networks by infringing copyrights.", "Both men were found guilty of conspiring to commit felony copyright infringement and acting for commercial advantage.", "They face up to five-year jail terms and a fine of $500 (£385) or €345 respectively.", "The US Department of Justice alleges that the pair operated central hubs in the piracy community organized across Direct Connect peer-to-peer network, where users shared between 1-5GB files.", "Six raids were conducted under Operation Digital Gridlock, aiming to combat \"criminal copyright theft on peer-to-peer networks.\""], "granite3.1-dense:2b": ["US residents William Trowbridge and Michael Chicoine have been convicted of piracy via peer-to-peer networks, specifically the Direct Connect network.", "They pleaded guilty to conspiring to commit felony copyright infringement and acting for commercial gain.", "The pair operated central hubs for the Underground Network, a piracy group that demanded members share between one and 100 gigabytes of files.", "FBI agents, during Operation Digital Gridlock, seized evidence from five of their homes and one net service firm, finding 84 movies, 40 software programs, 13 games, and 178 sound recordings.", "They face up to five years in prison and a $250,000 fine; sentencing is scheduled for April 29."]}