{"raw_text": "Warning over tsunami aid website\n \n Net users are being told to avoid a scam website that claims to collect cash on behalf of tsunami victims.\n \n The site looks plausible because it uses an old version of the official Disasters Emergency Committee webpage. However, DEC has no connection with the fake site and says it has contacted the police about it. The site is just the latest in a long list of scams that try to cash in on the goodwill generated by the tsunami disaster.\n \n The link to the website is contained in a spam e-mail that is currently circulating. The message's subject line reads \"Urgent Tsunami Earthquake Appeal\" and its text bears all the poor grammar and bad spelling that characterises many other phishing attempts. The web address of the fake site is decuk.org which could be close enough to the official www.dec.org.uk address to confuse some people keen to donate. Patricia Sanders, spokeswoman for the Disaster Emergency Committee said it was aware of the site and had contacted the Computer Crime Unit at Scotland Yard to help get it shut down. She said the spam e-mails directing people to the site started circulating two days ago shortly after the domain name of the site was registered. It is thought that the fake site is being run from Romania. Ms Sanders said DEC had contacted US net registrars who handle domain ownership and the net hosting firm that is keeping the site on the web.\n \n DEC was going to push for all cash donated via the site to be handed over to the official organisation. BT and DEC's hosting company were also making efforts to get the site shut down, she said.\n \n Ms Sanders said sending out spam e-mail to solicit donations was not DEC's style and that it would never canvass support in this way. She said that DEC hoped to get the fake site shut down as soon as possible. All attempts by the BBC News website to contact the people behind the site have failed. None of the e-mail addresses supplied on the site work and the real owner of the domain is obscured in publicly available net records. This is not the first attempt to cash in on the outpouring of goodwill that has accompanied appeals for tsunami aid. One e-mail sent out in early January came from someone who claimed that he had lost his parents in the disaster and was asking for help moving an inheritance from a bank account in the Netherlands. The con was very similar to the familiar Nigerian forward fee fraud e-mails that milk money out of people by promising them a cut of a much larger cash pile. Other scam e-mails included a link to a website that supposedly let people donate money but instead loaded spyware on their computers that grabbed confidential information. In a monthly report anti-virus firm Sophos said that two e-mail messages about the tsunami made it to the top 10 hoax list during January. Another tsunami-related e-mail is also circulating that carries the Zar worm which tries to spread via the familiar route of Microsoft's Outlook e-mail program. Anyone opening the attachment of the mail will have their contact list plundered by the worm keen to find new addresses to send itself to.\n", "llama3.2:1b": ["A website claiming to collect donations on behalf of tsunami victims has been linked to a scam, with some users receiving phishing emails stating they must pay for aid via the site.", "The site uses an old version of the official Disasters Emergency Committee webpage and is thought to be operated from Romania.", "A spokeswoman for DEC said it was aware of the site and had contacted law enforcement agencies to help shut it down.", "Attempts by the BBC News website to contact the site's owner have failed, with no working email addresses provided."], "llama3.2:3b": ["Scammers are using a fake website decuk.org claiming to collect cash for tsunami victims, which looks similar to an old DEC webpage.", "The site was registered two days ago and is believed to be run from Romania.", "DEC has contacted authorities and online registrars to shut down the site, while BT and its hosting company also made efforts."], "gemma2:2b": ["A fake website claiming to collect donations for tsunami victims is spreading through spam emails and has been flagged as a scam.", "The site uses an old version of the official Disasters Emergency Committee webpage but is unconnected with DEC.", "The link, decuk.org, is very close to the official website's address, www.dec.org.uk.", "DEC has contacted police, internet registrars, and hosting companies to shut down the site.", "It is suspected the site is being run from Romania.", "This is not an isolated incident; scams have been targeting donations in various forms since the disaster.", "The fake emails are designed to solicit donations using poor grammar and spelling, often exploiting people's generosity during a time of need.", "Sophos lists this type of scam among its top 10 hoax list for January."], "qwen2.5:0.5b": ["The text discusses a phishing scam on the DEC website aimed at collecting donations for tsunami aid.", "DEC had previously promised cash donated would be handed over to the official organization.", "The email claims that a fake site was registered with DEC's domain, but it is actually a Romanian web address.", "The e-mail uses poor grammar and spelling, and its content is similar to scam emails about lost parents or money in an inheritance.", "DEC has already contacted the Computer Crime Unit at Scotland Yard for help shutting down the fake site."], "qwen2.5:1.5b": ["Warning over scam website using Disasters Emergency Committee (DEC) name for tsunami donations, prompting DEC to contact authorities and urge donors not to click on links in spam emails containing \"Urgent Tsunami Earthquake Appeal\" subject lines.", "The site is part of a series of scams exploiting sympathy for the disaster; efforts are underway to shut it down."], "qwen2.5:3b": ["Warning over a scam website claiming to collect cash for tsunami victims has emerged.", "The site uses an old official Disasters Emergency Committee (DEC) webpage version and could confuse users due to its address similarity to the genuine page (decuk.org vs www.dec.org.uk).", "DEC claims no connection with the fake site, has contacted police, and is working with BT and hosting company to shut it down.", "The spam e-mails directing people to the site started circulating two days after the domain name was registered in Romania.", "Other scams mimicking tsunami aid include phishing attempts, Nigerian scam emails, and a spyware-infected website linked via Outlook email.", "DEC does not solicit support through such means."], "opencoder:1.5b": ["The text provided contains a lot of context and technical jargon, making it difficult for me to summarize comprehensibly.", "However, I can give an overall summary:\n\n\"Warning over tsunami aid website...", "The site uses an old version of the official Disasters Emergency Committee webpage and is hosted by DEC but has been identified as a scam.", "It is run from Romania and the owner's email addresses are not working or confidential information have been leaked.\""], "smollm:1.7b": ["The text summary should be:\nWarning over tsunami aid website\nNet users are being told to avoid a scam website that claims to collect cash on behalf of tsunami victims.", "The site looks plausible because it uses an old version of the official Disasters Emergency Committee webpage.", "However, DEC has no connection with the fake site and says it has contacted the police about it.", "The site is just the latest in a long list of scams that try to cash in on the goodwill generated by the tsunami disaster.", "The link to the website is contained in a spam e-mail that is currently circulating.", "The message's subject line reads \"Urgent Tsunami Earthquake Appeal\" and its text bears all the poor grammar and bad spelling that characterises many other phishing attempts.", "The web address of the fake site is decuk.org which could be close enough to the official www.dec.org.uk address to confuse some people keen to donate.", "Patricia Sanders, spokeswoman for the Disaster Emergency Committee said it was aware of the site and had contacted the Computer Crime Unit at Scotland Yard to help get it shut down.", "She said the spam e-mail directing people to the site started circulating two days ago shortly after the domain name of the site was registered.", "It is thought that the fake site is being run from Romania.", "Ms Sanders said DEC had contacted US net registrars who handle domain ownership and the net hosting firm that is keeping the site on the web.", "The DEC was going to push for all cash donated via the site to be handed over to the official organisation.", "BT and DEC's hosting company were also making efforts to get the site shut down, she said.", "All attempts by the BBC News website to contact the people behind the site have failed.", "None of the e-mail addresses supplied on the site work and the real owner of the domain name is obscured in publicly available net records.", "This is not the first attempt to cash in on the outpouring of goodwill that has accompanied appeals for tsunami aid.", "One e-mail sent out in early January came from someone who claimed that he had lost his parents in the disaster and was asking for help moving an inheritance from a bank account in the Netherlands.", "The con was very similar to the familiar Nigerian forward fee fraud e-mails that milk money out of people by promising them a cut of a much larger cash pile.", "Other scam e-mail messages included a link to a website that supposedly let people donate money but instead loaded spyware on their computers that grabbed confidential information.", "In a monthly report anti-virus firm Sophos said that two e-mail messages about the tsunami made it to the top 10 hoax list during January.", "Another tsunami-related e-mail is also circulating that carries the Zar worm which tries to spread via the familiar route of Microsoft's Outlook e-mail program.", "Anyone opening the attachment of the mail will have their contact list plundered by the worm keen to find new addresses to send itself to."], "deepseek-r1:1.5b": ["The text describes a scam website claiming to collect cash for tsunami aid.", "The fake site, decuk.org, is close to official DEC websites but has been targeted by two days of spam emails before its registration.", "These emails contact the Computer Crime Unit at Scotland Yard to shut down the site.", "DEC aims to shut it down but avoid sending spam that canvascends support.", "Other phishing attempts include offering money for inheritance transfers and spyware-related scams.", "Sophos reported two January e-mails on the top hoax list."], "tinyllama:1.1b": ["The scam website appearing on email networks promising assistance with cash collected from the tsunaimi disaster has been shut down, as reported by DEC (Disaster Emergency Committee) and cybersecurity firm Sophos.", "The fake website contains poor grammar and spelling errors that mimic those of the official Disasters Emergency Committee webpage.", "Scammers are using a similar technique to Nigerian forward fee fraud e-mails, making false promises for donations and installing spyware on computers to gather personal information.", "Sophos' monthly anti-virus report highlighted two other Tsunaimi-related hoaxes in January, one of which was spread through Microsoft Outlook emails."], "tinydolphin:1.1b": [" The warning from Net users is about a scam website that claims to collect money on behalf of tsunami victims.", "This site is not associated with the official Disasters Emergency Committee (DEC) webpage and may look similar, but it's actually just another in a long list of phishing attempts.", "The warning is about a spam e-mail circulating that contains an old version of the DEC website, giving people a false sense of trust.", "The site's spam email includes links to donate money to a fake organization, which appears to be set up by someone from Romania.", "It's important for people to report any suspicious emails or websites to their local police authorities."], "phi:2.7b": [" A fake website claiming to collect cash on behalf of tsunami victims is being warned against, and efforts are being made to shut it down by contacting US registrars and hosting firms.", "The fake site is thought to be run from Romania, and DEC has contacted the police about the scam.", "It comes as a similar phishing attempt was spotted in January.", "Scammers have also tried to cash in on the outpouring of goodwill by posing as people who lost their parents in the disaster and asking for help with moving an inheritance.", "Other fraudulent emails were sent out, including one that carries spyware that steals confidential information from computer users."], "orca-mini:3b": [" There is a warning over a scam website that claims to collect cash on behalf of tsunami victims.", "The site looks plausible because it uses an old version of the official Disasters Emergency Committee webpage.", "However, DEC has no connection with the fake site and says it has contacted the police about it.", "The fake site is just the latest in a long list of scams that try to cash in on the goodwill generated by the tsunami disaster.", "The link to the website is contained in a spam e-mail that is currently circulating.", "The message's subject line reads \"Urgent Tsunami Earthquake Appeal\" and its text bears all the poor grammar and bad spelling that characterizes many other phishing attempts.", "The web address of the fake site is decuk.org which could be close enough to the official www.dec.org.uk address to confuse some people keen to donate.", "Patricia Sanders, spokeswoman for the Disaster Emergency Committee said it was aware of the site and had contacted the Computer Crime Unit at Scotland Yard to help get it shut down.", "She said the spam e-mails directing people to the site started circulating two days ago shortly after the domain name of the site was registered.", "It is thought that the fake site is being run from Romania.", "Ms Sanders said DEC had contacted US net registrars who handle domain ownership and the net hosting firm that is keeping the site"], "hermes3:3b": ["Warning over fake tsunami aid website; avoid scam site claiming to collect funds, similar to official DEC page but with misleading domain."], "stablelm-zephyr:3b": ["A scam website imitating the Disasters Emergency Committee (DEC) in collecting tsunami aid funds is currently circulating among net users, using an old version of the official DEC webpage for its design.", "The site has been reported by DEC who are working with authorities and hosting companies to get it shut down.", "Decuk.org, the address of the fake site, is similar to the official www.dec.org.uk address causing confusion for some.", "This is not the first tsunami-related scam; earlier in January, another attempt was made with a phishing email asking for financial help moving an inheritance from a bank account in the Netherlands."], "chatgpt-4o-latest": ["A scam website posing as a tsunami aid donation page has been identified, using an old version of the official Disasters Emergency Committee (DEC) webpage.", "The fraudulent site, promoted through spam emails with poor grammar and spelling, closely resembles the real DEC site, potentially misleading donors.", "DEC has reported the scam to Scotland Yard’s Computer Crime Unit and is working with US domain registrars and hosting firms to shut it down.", "The fake site is believed to be operated from Romania.", "DEC clarified that it does not solicit donations via spam emails.", "This scam is part of a broader trend of fraudulent schemes exploiting the goodwill generated by the tsunami disaster, including phishing emails, spyware-laden donation sites, and hoax messages.", "Some scams mimic Nigerian fraud schemes, while others spread computer viruses like the Zar worm."], "stablelm2:1.6b": ["A warning has been issued over a website claiming to collect cash on behalf of tsunami victims, after it was discovered that the Disaster Emergency Committee (DEC) has no connection with the fake site.", "The scam uses an old version of the official DEC webpage and is likely being run from Romania.", "Attempts are being made by various parties, including BT, DEC's hosting company, and US net registrars, to shut down the site, which is directing people to decuk.org.", "The aim was for all donations collected on behalf of tsunami victims to be handed over to the official organisation.", "However, it has been reported that sending out spam e-mails soliciting donations is not DEC's style, and it would never ask for support in this way.", "Attempts by the BBC News website to contact those behind the site have failed, with all e-mail addresses supplied on the site not working.", "This is not the first attempt to cash in on the goodwill generated by the tsunami disaster."], "granite3.1-dense:2b": ["A warning has been issued for a scam website pretending to collect tsunami aid, resembling an outdated version of the official Disasters Emergency Committee (DEC) webpage.", "The fake site, decuk.org, is being circulated via spam emails with poor grammar and spelling.", "DEC has confirmed its non-association with this fraudulent site and has reported it to Scotland Yard's Computer Crime Unit for takedown.", "The domain was registered recently, and the site appears to be based in Romania.", "DEC emphasizes that legitimate donations will not be redirected to this illegal operation.", "This is part of a series of tsunami-related scams exploiting goodwill, including phishing attempts, Nigerian forward fee frauds, spyware-laden donation sites, and the Zar worm, which spreads through Microsoft Outlook attachments.", "All attempts to contact the site's operators have been unsuccessful due to non-functioning email addresses."]}