{"raw_text": "More women turn to net security\n \n Older people and women are increasingly taking charge of protecting home computers against malicious net attacks, according to a two-year study.\n \n The number of women buying programs to protect PCs from virus, spam and spyware attacks rose by 11.2% each year between 2002 and 2004. The study, for net security firm Preventon, shows that security messages are reaching a diversity of surfers. It is thought that 40% of those buying home net security programs are retired. For the last three years, that has gone up by an average of 13.2%. But more retired women (53%) were buying security software than retired men. The research reflects the changing stereotype and demographics of web users, as well as growing awareness of the greater risks that high-speed broadband net connections can pose to surfers.\n \n The study predicts that 40% of all home PC net security buyers will be women in 2005. They could even overtake men as the main buyers by 2007, if current rates persist, according to the research. \"I think older people have become more vigilant about protecting their PCs as we tend to be more cautious and want an insurance policy in case something does go wrong\", said one over-60 woman who took part in the research.\n \n \"You started off with young male stereotype computer users for last 10 years,\" Paul Goosens, head of Preventon told the BBC News website. \"Now we are seeing real people - both sexes and very often it is women who have more access at home.\" But net service providers still need to take more responsibility in making sure people are educated about net threats before they go online, particuarly if they are new to broadband, he said.\n \n Programs also need to be tailored so that they can be installed by dial-up users with a slower connection too, said Mr Goosens. Security software should be easy to use, with simple interfaces and instructions written in non-technical language, he added. The nature of the security threats are also becoming more than just about e-mail viruses. High-profile complaints about rogue diallers, and spyware or other programs that surreptitiously install themselves on computers, have also raised awareness about the need to have a combination of anti-virus, firewall and spyware-removal programs too. Without protection, these kinds of programs can be picked up just through surfing the web normally.\n \n More than 30,000 PCs a day globally are being recruited into networks that spread spam and viruses, a study from security from Symantec showed last year. Viruses written to make headlines by infecting millions are also getting rarer, according to net security experts. Programs are being unleashed to directly profit criminal gangs, many based in Eastern Europe, over those which are designed to show off technical skills or cause nuisance. The research shows that more people are taking these criminal net threats more seriously because, said Mr Goosens, they are reported in the press much more. \"You are seeing older users being educated by the media and are seeing them picking up on this threat. They are asking the right questions,\" he explained. \"It is more likely the younger users who naively assume that because they are using a reputable service provider, that they are safe to connect to the net.\" An unprotected computer on a broadband connection can be breached and infected with viruses or spyware within minutes. By the end of the year it is thought that more than 30% of UK homes will have broadband net access. In July last year, the number of UK households accessing the net via broadband surpassed those using dial-up for the first time, according to the Office of National Statistics.\n", "llama3.2:1b": ["More women are taking charge of protecting home computers against malicious net attacks, with a 11.2% increase in purchases each year between 2002 and 2004.", "The number of women buying home net security programs has risen from 40% to 53%, mainly due to concerns about retirement.", "By 2005, the study predicts that 40% of all home PC net security buyers will be women, potentially overtaking men by 2007.", "More than 30,000 PCs are being recruited into networks that spread spam and viruses daily."], "llama3.2:3b": ["Women are increasingly taking charge of home computer security, with a 11.2% increase in buying protective programs between 2002 and 2004.", "40% of home security buyers are now retired women, who are more likely than men to buy security software.", "The study predicts that by 2007, 40% of all home PC security buyers will be women.", "Experts say that older users are becoming more vigilant about online safety due to growing awareness of risks and media coverage."], "gemma2:2b": ["Women are increasingly purchasing home security software programs.", "The number of women buying these programs rose by 11.2% each year between 2002 and 2004, representing a significant demographic shift from previous years.", "Security software purchase rates are predicted to continue rising, with women potentially overtaking men as the main buyers by 2007 if current trends persist.", "Security programs need to be user-friendly and accessible for all users, not just those comfortable with high-speed broadband connections.", "Growing awareness of online threats like rogue diallers and spyware has led to increased demand for comprehensive security measures."], "qwen2.5:0.5b": ["More women are buying computer security programs and installing them on their own PC's, with 10% more retired women (53%) buying security software than retired men.", "The number of older people is increasing among home users as they become more cautious about personal information.", "Programs need to be updated for better functionality and usability."], "qwen2.5:1.5b": ["More women are buying security software to protect home computers against malicious internet threats, reflecting a shift in demographics and awareness among older users and women."], "qwen2.5:3b": ["More women are turning to home computer security programs against malicious internet attacks, with a rise of 11.2% annually between 2002 and 2004.", "The study by Preventon suggests that 40% of all home PC security buyers in 2005 will be women, potentially overtaking men by 2007 if current trends continue.", "Older people, particularly retired individuals (with more women than men buying), are showing increased interest and vigilance in protecting their computers from attacks like viruses, spam, and spyware.", "The research indicates that as internet usage diversifies, security messages are reaching a wider audience of users.", "Internet service providers need to educate new broadband users about potential threats, while software must be accessible for dial-up connections.", "Security threats have evolved beyond just email viruses; high-profile incidents involving rogue diallers and spyware have heightened public awareness of the need for comprehensive protection that includes anti-virus, firewall, and spyware-removal programs.", "According to a Symantec study, more than 30,000 PCs are being infected daily with spam and viruses.", "The Office of National Statistics reported in July last year that broadband usage surpassed dial-up for the first time in UK households."], "opencoder:1.5b": ["The summary text below preserves key details from the provided text:\n\n1.", "More women are turning to net security.", "2.", "Older people and women are increasingly taking charge of protecting home computers against malicious net attacks.", "3.", "The number of women buying programs to protect PCs from virus, spam and spyware attacks rose by 11.2% each year between 2002 and 2004.", "4.", "The study predicts that 40% of all home PC net security buyers will be women in 2005.", "They could even overtake men as the main buyers by 2007, if current rates persist.", "5.", "Programs also need to be tailored so that they can be installed by dial-up users with a slower connection too.", "6.", "The nature of the security threats are being dealt with more by high-profile complaints about rogue diallers, and spyware or other programs that surreptitiously install themselves on computers.", "7.", "More than 30,000 PCs a day globally are being recruited into networks that spread spam and viruses."], "smollm:1.7b": ["The text above summarizes the following key ideas:\n\n1.", "More women are buying security programs to protect their home computers from malicious attacks.", "2.", "The number of women buying security programs has risen by 11.2% each year between 2002 and 2004.", "3.", "Older people and women are increasingly taking charge of protecting their home computers against malicious net attacks.", "4.", "More retired women (53%) were buying security programs than retired men (40%).", "5.", "The study shows that more older people are becoming aware of the greater risks that high-speed broadband net connections pose to surfers.", "6.", "Net service providers need to take more responsibility in making sure their customers have a simple, easy-to-use interface and instructions written in non-technical language.", "7.", "The nature of the security threats is becoming more than just about e-mail viruses.", "High-profile complaints about rogue diallers, and spyware or other programs that surreptitiously install themselves on computers are also getting reported.", "8.", "More people are taking these criminal net threats more seriously because they are being reported in the media much more frequently.", "9.", "Older users are being educated by the media and are seeing them as a safe way to connect to the net.", "10.", "The text above is concise, preserving key ideas and details while omitting unnecessary information."], "deepseek-r1:1.5b": ["More women are increasingly taking on net security roles, particularly protecting home computers from malicious attacks.", "A 2004 study by Preventon found a 11.2% annual increase in female PC buyers for virus, spam, and spyware protection programs between 2002-2004.", "Retired women accounted for the largest share of purchases, with 40% buying home net security software.", "Non-retired females (53%) were more likely to purchase software than men.", "The study predicts that in 2005, 40% of home PC buyers will be women, potentially overtaking men as the main users by 2007 if rates persist.", "Older people have become more vigilant about net security, and while net service providers need better education on threats, especially with high-speed broadband, they must also provide safe tools for new users."], "tinyllama:1.1b": ["In a two-year study, older people and women are increasingly taking charge of protecting home computers against malicious net attacks.", "According to the report, security messages are reaching a variety of surfers, with women buying more high-speed broadband net protection software than men.", "The survey also predicts that 40% of all home PC net security buyers will be women in 2005, surpassing men as the main buyers by 2007 if current rates persist.", "While older people were the main buyers for 10 years, newer users are becoming more vigilant about protecting their computers due to an increased awareness of security threats.", "Net service providers need to make sure programs can be installed by dialed-up users with slower connections and be easy to use, written in non-technical language, and include anti-virus, firewall, and spyware removal programs.", "Over 30% of UK homes now have broadband net access, with the Office of National Statistics estimating that this will surpass those using diaal-up connections in just one year."], "tinydolphin:1.1b": [" More women are taking charge of protecting their homes against malicious net attacks by buying security software from Preventon, a two-year study reveals.", "The number of older people and women in particular are increasingly turning to net security for protection.", "The research predicts that 40% of all home PC net security buyers will be women in 2005.", "Older women are also buying security software at higher rates than their male counterparts, according to the study.", "This shift in demographics reflects changing stereotypes and the increasing risk of high-speed broadband connections posing significant threats to users.", "As PC users become more cautious and demand a comprehensive security package in response to these threats, the overall number of female home net security buyers is expected to increase even further by 2007.", "Preventon predicts that around 40% of all home PC net security buyers will be women in 2005."], "phi:2.7b": [" The text reports on a two-year study that shows that older people and women are increasingly taking charge of protecting their home computers against malicious attacks from the internet.", "It also predicts that more women will be the main buyers of security software in the future, as well as more awareness about the risks and threats posed by high-speed broadband connections.", "The text cites a survey that reveals the changing demographics and stereotypes of web users, and emphasizes the need for net service providers to educate and inform their customers about these issues."], "orca-mini:3b": [" More women are turning to home net security due to increased awareness of risks and changing stereotype demographics, along with growing responsiveness to education by service providers, a study shows.", "Women are buying more net security software than men and older people are also becoming more vigilant about protecting their PCs as broadband connections become more widespread.", "The research predicts that 40% of all home PC net security buyers will be women in 2005, with the number of women buying security software even outstripping men by 2007 if current rates persist.", "Net service providers still need to take more responsibility for educating users about net threats before they go online, particularly if they are new to broadband.", "Programs should also be tailored for dial-up users with slower connections.", "Security software should be easy to use with simple interfaces and instructions written in non-technical language, according to net security experts."], "hermes3:3b": ["Women increasing in home PC security use, predicts 40% women buyers by 2005; older people and women more cautious about internet threats."], "stablelm-zephyr:3b": ["A two-year study by net security firm Preventon shows that older people and women are increasingly taking charge of protecting home computers against maliciousnet attacks.", "Between 2002 and 2004, the number of women buying programs to protect PCs from virus, spam, and spyware attacks rose by 11.2% each year.", "The research reflects the changing stereotype and demographics of web users, as well as growing awareness of the greater risks that high-speed broadband net connections can pose to surfers.", "The study predicts that 40% of all home PC net security buyers will be women in 2005, and they could even overtake men as the main buyers by 2007 if current rates persist."], "chatgpt-4o-latest": ["Older people and women are increasingly taking responsibility for home computer security, with women’s purchases of antivirus and spyware protection rising by 11.2% annually between 2002 and 2004.", "Retired individuals make up 40% of buyers, with retired women outpacing men.", "By 2005, women are expected to account for 40% of home security software purchases and could surpass men by 2007.", "The study highlights changing demographics in internet use and growing awareness of online threats, particularly with broadband adoption.", "Security experts stress the need for user-friendly software and better education from internet providers.", "Cyber threats are evolving from attention-seeking viruses to financially motivated attacks by criminal gangs, increasing awareness among older users.", "Reports indicate that over 30,000 PCs daily are being hijacked for spam and virus distribution, emphasizing the importance of protection, especially as broadband use continues to rise in the UK."], "stablelm2:1.6b": ["A two-year study reveals that more women are protecting their home computers against malicious internet attacks, with the number of women purchasing security software increasing by 2% each year between 2008 and 2011.", "Retired women were found to be buying more security software than retired men.", "The trend reflects changing demographics and growing awareness of the risks posed by high-speed broadband connections.", "By 2050, it's predicted that 57% of all home PC net security buyers will be women."], "granite3.1-dense:2b": ["The two-year study by Preventon reveals a significant shift in home computer protection: women are increasingly purchasing and implementing net security measures against viruses, spam, and spyware.", "From 2002 to 2004, women's annual buying rate of such software increased by 11.2%, with 53% of retired women making these purchases compared to only 47% of retired men.", "This trend is expected to continue, with predictions that women will become the primary home PC security buyers in 2005 and potentially surpass men by 2007.", "The study highlights a growing awareness among older web users about the risks associated with high-speed broadband connections.", "Paul Goosens, Preventon's head, notes that this demographic is becoming more cautious and sees security software as an insurance policy against potential issues.", "The research emphasizes the need for user-friendly security programs tailored to dial-up users and those with slower connections, as well as integration of anti-virus, firewall, and spyware-removal capabilities in a single package.", "Recent data from Symantec shows that over 30,000 PCs daily are being recruited into spam and virus networks, indicating the severity of these cyber threats.", "Criminal gangs exploit vulnerable systems for financial gain, with press coverage increasing public awareness of these dangers.", "With more than 30% of UK homes projected to have broadband by the end of the year, and dial-up usage surpassed in July 2018, the need for robust security measures is paramount."]}