{"raw_text": "Sony PSP console hits US in March\n \n US gamers will be able to buy Sony's PlayStation Portable from 24 March, but there is no news of a Europe debut.\n \n The handheld console will go on sale for $250 (£132) and the first million sold will come with Spider-Man 2 on UMD, the disc format for the machine. Sony has billed the machine as the Walkman of the 21st Century and has sold more than 800,000 units in Japan. The console (12cm by 7.4cm) will play games, movies and music and also offers support for wireless gaming. Sony is entering a market which has been dominated by Nintendo for many years.\n \n It launched its DS handheld in Japan and the US last year and has sold 2.8 million units. Sony has said it wanted to launch the PSP in Europe at roughly the same time as the US, but gamers will now fear that the launch has been put back. Nintendo has said it will release the DS in Europe from 11 March. \"It has gaming at its core, but it's not a gaming device. It's an entertainment device,\" said Kaz Hirai, president of Sony Computer Entertainment America.\n", "llama3.2:1b": ["Sony's PlayStation Portable (PSP) console will be available in the US on March 24 for $250.", "The first million units sold will come with Spider-Man 2 on UMD.", "The PSP has been successful in Japan and has sold over 800,000 units.", "It is entering a market dominated by Nintendo and was initially planned to launch in Europe around the same time as the US."], "llama3.2:3b": ["Sony PSP console to be sold in US on March 24 for $250, with first million units coming with Spider-Man 2 UMD game; Europe debut unclear due to Nintendo DS launch on March 11."], "gemma2:2b": ["The Sony PlayStation Portable (PSP) launches in the US on March 24th for $250 and will come with Spider-Man 2 for the first million units sold.", "Sony describes the PSP as a modern Walkman.", "The console will play games, movies, and music and offer wireless gaming capabilities.", "While Sony planned to launch in Europe at the same time, a delay has been announced.", "Nintendo's DS is launching in Europe on March 11th."], "qwen2.5:0.5b": ["Sony PSP console hits US in March: The handheld console Sony plans to launch in March will be available from 24 March and first million sold with Spider-Man 2 on UMD format; it will play games, movies and music, and offer wireless gaming support.", "Sony has been developing the PlayStation Portable handheld since its introduction in Japan a few years ago and has sold over 800,000 units in Japan.", "The PSP is expected to be launched in Europe in March after Nintendo's DS device launches in Europe from 11 March.", "\"It has gaming at its core, but it's not a gaming device,\" said Kaz Hirai, president of Sony Computer Entertainment America."], "qwen2.5:1.5b": ["Sony's PSP console launches in the US on March 24th, priced at $250 with Spider-Man 2 included for the first million units; Europe will follow Nintendo's DS release date on March 11th."], "qwen2.5:3b": ["US gamers can buy Sony's PlayStation Portable (PSP) for $250 (£132) on 24 March; the first million sold will come with Spider-Man 2 on UMD.", "Sony markets it as a 'Walkman of the 21st Century' and claims over 800,000 units in Japan.", "PSP plays games, movies, and music with wireless gaming support.", "Nintendo's DS handheld has been successful in both regions; Sony delayed its European launch to avoid competition from Nintendo's planned March release."], "opencoder:1.5b": ["\"Sony PSP console hits US in March.", "US gamers will be able to buy Sony's PlayStation Portable from 24 March, but there is no news of a Europe debut.", "The handheld console will go on sale for $250 (£132) and the first million sold will come with Spider-Man 2 on UMD, the disc format for the machine.", "The console (12cm by 7.4cm) will play games, movies and music and also offers support for wireless gaming.", "Sony is entering a market which has been dominated by Nintendo for many years.", "It launched its DS handheld in Japan and the US last year and has sold 2.8 million units.", "Sony has said it wanted to launch the PSP in Europe at roughly the same time as the US, but gamers will now fear that the launch has been put back.", "Nintendo has said it will release the DS in Europe from 11 March.\""], "smollm:1.7b": ["The summary is concise and to the point, capturing the main points of the text:\n\n1.", "Sony PSP console hits US in March (24 March)\n2.", "There is no news of a Europe debut for the PSP\n3.", "The handheld console will go on sale for $250 (£132) and the first million sold will come with Spider-Man 2 on UMD, the disc format for the machine\n4.", "Sony has billed the machine as the Walkman of the 21st Century and has sold more than 800,000 units in Japan\n5.", "The console (12cm by 7.4cm) will play games, movies and music and also offers support for wireless gaming\n6.", "Sony is entering a market which has been dominated by Nintendo for many years\n7.", "It launched its DS handheld in Japan and the US last year and has sold 2.8 million units\n8.", "Sony has said it wanted to launch the PSP in Europe at roughly the same time as the US, but gamers will now fear that the launch has been put back\n9.", "Nintendo has said it will release the DS in Europe from 11 March\n\nThe summary captures the main points of the text and provides a brief overview of the key ideas and details."], "deepseek-r1:1.5b": ["Sony's PlayStation Portable (SPP) console is expected to launch in March in the US and Europe.", "It will be available for $250, with UMD discs for Spider-Man 2.", "The console has sold over 800,000 units in Japan and the US, targeting a gaming market led by Nintendo.", "Sony's target for Europe is around the same time as the US launch but may delay due to rumors about potential delays."], "tinyllama:1.1b": ["Sony has announced that the PlayStation Portable will go on sale in the US from 24 March and there is no news of an Europe-debut.", "The handheld console is billed as the \"Walkman of the 21st Century\" and features support for wireless gaming, movie playback, and music streaming.", "It has been successful in Japan, but gamers in Europe are now waiting for its launch to find out if Sony will release it there alongside the DS.", "However, Nintendo has announced a similar launch date for its handheld console in Europe from 11 March."], "tinydolphin:1.1b": [" The PSP is set to hit US shores on 24 March, but there is no news regarding a European debut.", "The handheld console from Sony will retail for $250 and the first million sold will come with Spider-Man 2 on UMD (unified disc format).", "With over 800,000 units sold in Japan, the PSP has already surpassed its rival, Nintendo's DS.", "The launch in Europe will likely be delayed, as it competes with Nintendo's next-gen handheld device: the DS."], "phi:2.7b": [" The Sony PSP console is set to launch in the US on 24th March with prices starting at $250.", "It will be able to play games, movies, and music and support wireless gaming.", "The first million sold will come with Spider-Man 2 on UMD.", "Sony has entered a market that Nintendo dominates."], "orca-mini:3b": [" Sony's PlayStation Portable (PSP) handheld console will hit the US on 24 March, with some models coming with Spider-Man 2 on UMD.", "The company has sold more than 800,000 units in Japan and plans to enter the market dominated by Nintendo with the device.", "However, the launch has been delayed in Europe and Nintendo has said it will release the DS in Europe from 11 March.", "Sony's Kaz Hirai said the PSP is not just a gaming device but an entertainment device."], "hermes3:3b": ["PSP console (Sony) releases US Mar, $250; firstmlln w/ Spider-Man 2 UMD; handheld for games, movies, music; wireless gaming support; competes w/ Nintendo DS."], "stablelm-zephyr:3b": ["Sony's PlayStation Portable becomes available for US gamers starting 24 March, with a price of $250.", "The first million units will come with Spider-Man 2 on UMD.", "Billed as the \"Walkman of the 21st Century,\" it can play games, movies, and music, and supports wireless gaming.", "Although Sony wanted to launch in Europe at the same time as the US, there's no news of a European debut.", "Nintendo is launching its DS in Europe starting 11 March, emphasizing that it's an entertainment device rather than a gaming one."], "chatgpt-4o-latest": ["Sony's PlayStation Portable (PSP) will launch in the US on 24 March for $250, with the first million units including Spider-Man 2 on UMD.", "Already selling over 800,000 units in Japan, the PSP supports gaming, movies, music, and wireless play.", "Sony aims to challenge Nintendo, which has long dominated the handheld market and has sold 2.8 million DS units since its launch.", "While Sony initially planned a simultaneous US and European release, no European launch date has been announced.", "Meanwhile, Nintendo will release the DS in Europe on 11 March.", "Sony describes the PSP as an entertainment device rather than just a gaming console."], "stablelm2:1.6b": ["Sony's PSP console will launch in the US in March without an European release.", "Its price is $(-£) and comes with Spider-Man 2 on UMD.", "The handheld can play games, movies, and music and has wireless gaming support.", "This marks Sony's entry into a market dominated by Nintendo for many years.", "The company launched its DS handhelds last year and sold 2.8 million units.", "It wanted to launch the PSP in Europe around the same time as the US; however, no official confirmation on that has been made yet."], "granite3.1-dense:2b": ["Sony's PlayStation Portable (PSP) is set to launch in the US on March 24, 2004, priced at $250 (£132).", "The initial million units sold will include Spider-Man 2 as a bundled game.", "Sony markets PSP as a versatile \"Walkman of the 21st Century,\" having sold over 800,000 units in Japan.", "It supports gaming, movies, music, and wireless gaming.", "PSP enters a market previously dominated by Nintendo's DS, which launched in Japan and the US last year, selling 2.8 million units.", "Initially, Sony planned to launch PSP simultaneously with the DS in Europe on March 11, but due to the PSP's late release in the US, European gamers may now face a delay in its availability.", "Kaz Hirai, president of Sony Computer Entertainment America, emphasized that while gaming is central to PSP, it also offers entertainment features."]}