{"raw_text": "Consumer concern over RFID tags\n \n Consumers are very concerned about the use of radio frequency ID (RFID) tags in shops, a survey says.\n \n More than half of 2,000 people surveyed said they had privacy worries about the tags, which can be used to monitor stock on shelves or in warehouses. Some consumer groups have expressed concern that the tags could be used to monitor shoppers once they had left shops with their purchases. The survey showed that awareness of tags among consumers in Europe was low. The survey of consumers in the UK, France, Germany and the Netherlands was carried out by consultancy group Capgemini. The firm works on behalf of more than 30 firms who are seeking to promote the growth of RFID technology. The tags are a combination of computer chip and antenna which can be read by a scanner - each item contains a unique identification number.\n \n More than half (55%) of the respondents said they were either concerned or very concerned that RFID tags would allow businesses to track consumers via product purchases. Fifty nine percent of people said they were worried that RFID tags would allow data to be used more freely by third parties. Ard Jan Vetham, Capgemini's principal consultant on RFID, said the survey showed that retailers needed to inform and educate people about RFID before it would become accepted technology. \"Acceptance of new technologies always has a tipping point at which consumers believe that benefits outweigh concerns. \"With the right RFID approach and ongoing communication with consumers, the industry can reach this point.\" He said that the survey also showed people would accept RFID if they felt that the technology could mean a reduction in car theft or faster recovery of stolen items. The tags are currently being used at one Tesco distribution centre in the UK - the tags allow the rapid inventory of bulk items. They are also in use as a passcard for the M6 Toll in the Midlands, in the UK. Mr Vetham said the majority of people surveyed (52%) believed that RFID tags could be read from a distance. He said that was a misconception based on a lack of awareness of the technology. At least once consumer group - Consumers Against Supermarket Privacy Invasion and Numbering (Caspian) - has claimed that RFID chips could be used to secretly identify people and the things they are carrying or wearing. All kinds of personal belongings, including clothes, could constantly broadcast messages about their whereabouts and their owners, it warned.\n", "llama3.2:1b": ["Consumers are concerned about radio frequency ID tags being used in shops to track stock and monitor shoppers once they leave.", "A survey found that 55% of respondents were either concerned or very concerned about RFID tags allowing businesses to track consumers.", "However, the majority (52%) believed RFID tags could be read from a distance, despite some warning about potential misuse."], "llama3.2:3b": ["More than half of consumers surveyed in the UK, France, Germany, and the Netherlands were concerned about the use of RFID tags due to privacy worries, with 55% worried that businesses would track them via product purchases and 59% concerned about data being shared with third parties."], "gemma2:2b": ["A survey reveals consumer concern over the use of RFID tags in shops due to potential tracking of shoppers' purchases and data misuse by third parties.", "The survey highlights low awareness of RFID technology among consumers in Europe.", "Despite concerns, some see benefits in reducing car theft and improving recovery of stolen items."], "qwen2.5:0.5b": ["**Summary:**\n\nConsumer awareness regarding radio frequency identification (RFID) tags is low in many countries; 55% of consumers surveyed said they were concerned or very concerned about RFID, while only half have privacy worries.", "Some consumer groups warn that RFID could be used to track shoppers and monitor products after leaving shops.", "The tags are made by Capgemini for companies seeking to promote RFID technology.", "They can read items with a computer chip and antenna, allowing data analysis.", "Consumers may accept RFID if they feel it reduces car theft or faster recovery of stolen items."], "qwen2.5:1.5b": ["Consumer concern over RFID tags increased due to privacy worries, tracking concerns, lack of awareness in Europe, and potential misuse by third parties for data collection, despite some positive uses like inventory management and theft prevention."], "qwen2.5:3b": ["Consumer concern over RFID tags is high with 55% expressing either concern or strong concern that businesses can track consumers via product purchases and data can be used by third parties freely.", "Awareness is low in Europe, especially among UK, France, Germany, and Netherlands.", "Some fear privacy violations, including monitoring shoppers post-purchase.", "However, respondents are more willing if RFID could reduce car theft or speed up lost item recovery.", "Only 52% believe tags can be read from a distance, while at least one consumer group fears they could secretly identify individuals based on their belongings."], "opencoder:1.5b": ["Consumer concern over RFID tags\n\nThe survey showed that awareness of tags among consumers in Europe was low.", "The survey of consumers in the UK, France, Germany and the Netherlands was carried out by consultancy group Capgemini.", "The firm works on behalf of more than 30 firms who are seeking to promote the growth of RFID technology.", "The tags are a combination of computer chip and antenna which can be read by a scanner - each item contains a unique identification number.", "A large majority (55%) of the respondents said they were either concerned or very concerned that RFID tags would allow businesses to track consumers via product purchases.", "59 percent of people said they were worried that RFID tags would allow data to be used more freely by third parties."], "smollm:1.7b": ["Consumer concern over RFID tags is a significant issue in today's market.", "The survey shows that more than half of 2,000 people surveyed have privacy worries about the use of RFID tags in shops.", "This raises concerns among consumers who are worried about the potential misuse of such technology.", "The survey also reveals that awareness of RFID tags among consumers in Europe is low.", "The main concern among consumers is the potential for RFID tags to be used to monitor shoppers once they have left shops with their purchases.", "This has raised serious privacy concerns among consumers, as it could allow businesses to track individuals more freely by reading their identification numbers.", "The survey shows that 55% of respondents are either concerned or very concerned about this issue.", "To address these concerns, retailers need to inform and educate consumers about the benefits and risks associated with RFID technology.", "This can be achieved through effective communication and education campaigns that explain how RFID tags work and what they can do.", "Additionally, retailers should ensure that their RFID systems are designed in a way that respects consumer privacy and security.", "The survey also shows that people would accept RFID tags if they believed that the technology could mean a reduction in car theft or faster recovery of stolen items.", "This is a misconception based on a lack of awareness of the technology.", "In reality, RFID tags can be used to quickly identify lost or stolen items, which can help prevent further damage and loss.", "In conclusion, consumer concern over RFID tags is a significant issue that needs to be addressed by retailers and policymakers.", "The survey highlights the need for effective communication and education campaigns to raise awareness about the benefits and risks associated with RFID technology.", "Additionally, retailers should ensure that their RFID systems are designed in a way that respects consumer privacy and security."], "deepseek-r1:1.5b": ["Consumers are concerned about RFID tags, raising worries about consumer data freedom and potential privacy breaches.", "More than half of 2000 people surveyed expressed these concerns, noting that tags could track customers after shopping.", "Awareness is low in Europe, particularly for companies integrating RFID technology.", "The survey revealed a desire to use RFID for business tracking but noted limited acceptance due to lack of awareness.", "Caspian group warns about broader privacy issues, suggesting potential for even more data misuse beyond basic shop use."], "tinyllama:1.1b": ["Consumer concern over RFID tags has been highlighted in a survey carried out by consultancy firm Capgemini.", "The survey of 2,000 people showed that more than half (55%) were either concerned or very concerned about the technology, with concerns primarily related to tracking consumer data via product purchase history.", "A significant majority of respondents also expressed worries over how data could be used by third parties, particularly concerning car theft and faster recovery of stolen items.", "The survey reveals that consumers may have a misconception based on limited awareness of RFID technology, with 52% believing that tags could be read from a distance.", "Caospian has warned that RFID chip technology could be used to secretly identify people and their possessions, including clothes and personal belongings.", "The survey also highlighted that consumers would accept RFID if they felt that the technology could mean faster recovery of stolen items or reduce car theft."], "tinydolphin:1.1b": [" The European Union is planning to regulate the use of radio frequency identification (RFID) tags in shops and warehouses.", "This technology allows for an unobtrusive way to monitor items as they move through stores without revealing personal information.", "However, consumer concerns about privacy have grown in recent years.", "The survey conducted by consultancy group Capgemini found that nearly half of the respondents were concerned about RFID tags being used to track their movements once they had left shops with their purchases.", "The technology could also be used to identify individuals and reveal their personal details, which has raised concerns among consumer groups.", "The use of RFID tags in Tesco's distribution center in the UK is one example where these concerns have been addressed.", "Tag readers can quickly inventory bulk items, but not all consumers appreciate the technology.", "According to Mr. Vetham from Capgemini, the misconception about RFID tag readability comes from a lack of awareness about the technology.", "Caspian is another consumer group that claims RFID tags can be used for nefarious purposes, such as secretly identifying people and wearing them on their bodies to monitor their movements.", "The group suggests that all types of personal belongings could constantly broadcast messages about their owners."], "phi:2.7b": [" The survey shows that consumers in Europe have privacy concerns over the use of radio frequency ID (RFID) tags in shops.", "More than half of 2,000 people surveyed expressed worries about being tracked by these tags while making purchases.", "Awareness of RFID technology is low among consumers in the UK, France, Germany, and the Netherlands.", "The use of RFID chips in Tesco's distribution centers and as a passcard for the M6 Toll shows that the technology can have benefits such as faster inventory management and stolen goods recovery.", "However, consumer groups are concerned about RFID being used to track shoppers after they leave shops with their purchases.", "To promote the acceptance of RFID technology, retailers need to educate consumers about its uses and benefits while addressing privacy concerns.", "The majority of people surveyed did not realize that RFID chips could be read from a distance."], "orca-mini:3b": [" A survey showed that consumers were concerned about radio frequency ID (RFID) tags in shops due to privacy worries and the potential for data to be used more freely by third parties.", "The majority of people believed that RFID tags could be read from a distance.", "Retailers needed to inform and educate people about RFID before it would become accepted technology, according to a consultant with Capgemini.", "The survey also showed that people would accept RFID if they felt that the technology could mean a reduction in car theft or faster recovery of stolen items.", "However, a misconception existed that RFID chips could be used to secretly identify people and their belongings."], "hermes3:3b": ["Consumers worried about privacy over RFID tags, concerned about tracking via product purchases (over 50%), according to Capgemini survey (UK, France, Germany, Netherlands)."], "stablelm-zephyr:3b": ["A survey by Capgemini showed that consumers have concerns about radio frequency ID (RFID) tags used in shops, with over half expressing privacy worries.", "Consumers were particularly worried that the tags could be used to monitor shoppers after they left stores with their purchases.", "Low awareness of RFID among Europeans was noted, and although some consumer groups raised concerns about potential secret identification using RFID chips, the majority (52%) believed misconceptions about the technology's range.", "Retailers are encouraged to inform and educate consumers before RFID becomes accepted technology."], "chatgpt-4o-latest": ["Consumers are concerned about RFID tags in shops, with over half of 2,000 surveyed expressing privacy worries.", "These tags, used for stock monitoring, could potentially track shoppers after purchases, raising fears about data misuse by third parties.", "Awareness of RFID technology is low in Europe, and experts suggest retailers must educate consumers for wider acceptance.", "The survey indicated that people might accept RFID if it helped reduce car theft or recover stolen items.", "Currently, RFID is used in UK Tesco distribution centers and as a passcard for the M6 Toll.", "Some consumer groups, like Caspian, warn that RFID chips could secretly track individuals and their belongings."], "stablelm2:1.6b": ["Consumers in Europe express privacy concerns over RFID tags, with more than half surveyed worried about tracking by businesses and data being used freely by third parties.", "The technology uses a combination of chip and antenna to identify items and monitor consumers through product purchases.", "Retailers must inform and educate people about the benefits before it becomes accepted technology.", "Misconceptions include believing RFID tags can be read from a distance."], "granite3.1-dense:2b": ["A Capgemini survey of 2,000 consumers in the UK, France, Germany, and Netherlands reveals significant privacy concerns regarding RFID tags.", "Over half (55%) are worried that these tags could track them post-purchase, with 59% fearing data misuse by third parties.", "Despite low awareness, 60% of respondents believe RFID tags can be read remotely, likely due to a lack of understanding about the technology.", "Retailers must educate consumers about RFID's benefits, such as reduced car theft and faster stolen item recovery, to gain acceptance.", "Consumer groups like Consumers Against Supermarket Privacy Invasion and Numbering (Caspian) have raised fears that RFID could identify individuals and their belongings, broadcasting constant location data.", "Currently, RFID is used in Tesco's UK distribution center for inventory management and as a passcard on the M6 Toll in England."]}