{"raw_text": "Apple attacked over sources row\n \n Civil liberties group the Electronic Frontier Foundation (EFF) has joined a legal fight between three US online journalists and Apple.\n \n Apple wants the reporters to reveal 20 sources used for stories which leaked information about forthcoming products, including the Mac Mini. The EFF, representing the reporters, has asked California's Superior court to stop Apple pursuing the sources. It argues that the journalists are protected by the American constitution. The EFF says the case threatens the basic freedoms of the press.\n \n Apple is particularly keen to find the source for information about an unreleased product code-named Asteroid and has asked the journalists' e-mail providers to hand over communications relevant to that. \"Rather than confronting the issue of reporter's privilege head-on, Apple is going to the journalist's ISPs for his e-mails,\" said EFF lawyer Kurt Opsahl. \"This undermines a fundamental First Amendment right that protects all reporters. \"If the court lets Apple get away with this, and exposes the confidences gained by these reporters, potential confidential sources will be deterred from providing information to the media and the public will lose a vital outlet for independent news, analysis and commentary,\" he said. The case began in December 2004 when Apple asked a local Californian court to get the journalists to reveal their sources for articles published on websites AppleInsider.com and PowerPage.org.\n \n Apple also sent requested information from the Nfox.com, the internet service provider of PowerPage's publisher Jason O-Grady. As well as looking at how far corporations can go in preventing information from being published, the case will also examine whether online journalists have the same privileges and protections as those writing for newspapers and magazines. The EFF has gained some powerful allies in its legal battle with Apple, including Professor Tom Goldstein, former dean of the Journalism School at the University of California and Dan Gillmor, a well-known Silicon Valley journalist. Apple was not immediately available for comment.\n", "llama3.2:1b": ["Apple is suing online journalists for revealing 20 sources used for stories about forthcoming products, citing potential confidentiality breaches.", "The EFF (Electronic Frontier Foundation) represents the journalists, arguing that their sources are protected by the US Constitution's First Amendment right to press freedom.", "Apple wants the journalists to reveal specific sources and communications related to an unreleased product code-named Asteroid.", "The case began in 2004 and will also examine whether online journalists have equal protections as those writing for newspapers and magazines."], "llama3.2:3b": ["The Electronic Frontier Foundation (EFF) is representing three US online journalists in a legal fight against Apple over sources used to leak information about upcoming products, including the Mac Mini.", "Apple wants the reporters to reveal 20 sources and has asked their email providers for communications relevant to an unreleased product code-named Asteroid.", "The EFF argues that the case threatens the basic freedoms of the press and undermines reporter's privilege, which could deter potential confidential sources from providing information to media outlets."], "gemma2:2b": ["The Electronic Frontier Foundation (EFF) is defending three US online journalists who are being sued by Apple for revealing information about upcoming products.", "The EFF argues that journalists have First Amendment protections regarding their sources and that the case poses a threat to press freedom.", "Apple wants to identify the reporters’ sources, including through email providers, and has already obtained some information from the internet service provider of PowerPage publisher Jason O-Grady.", "This action is being challenged as it could discourage confidential source sharing and harm public access to news.", "The case will examine whether online journalists have the same rights as those in traditional media outlets."], "qwen2.5:0.5b": ["Apple sued three US online journalists over leaked information about forthcoming products, including the Mac Mini.", "The EFF is leading a legal battle between Apple and the journalists, which they argue threatens their basic freedoms of the press.", "The case began in December 2004 when Apple asked local California courts to get journalists to reveal their sources for articles on websites AppleInsider.com and PowerPage.org."], "qwen2.5:1.5b": ["The Electronic Frontier Foundation (EFF) is suing Apple over its demand to reveal sources used in leaking information about forthcoming products.", "EFF argues journalists are protected by the Constitution, threatening basic freedoms of the press if sources are revealed.", "This could deter potential confidential sources from providing information to media and limit public access to news.", "The case involves a request for e-mails related to an unreleased product code-named Asteroid and Apple's approach of requesting information from email providers instead of directly confronting journalists' rights."], "qwen2.5:3b": ["Apple attacked over sources row: Civil liberties group EFF represents three US online journalists who are facing pressure from tech giant Apple to reveal 20 sources used in stories about upcoming products like the Mac Mini.", "The case threatens press freedom as Apple seeks court order to find specific source information, including details on a code-named product.", "The EFF argues that reporters have constitutional protection and opposing this would deter confidential information and media outlet independence.", "The lawsuit began in December 2004 when Apple asked for sources from websites like AppleInsider.com and PowerPage.org.", "The case also examines protections for online journalists compared to traditional media, with support from academics and industry figures such as former dean of the Journalism School at UC and Silicon Valley journalist Dan Gillmor.", "Apple has not yet responded publicly to these allegations."], "opencoder:1.5b": ["Apple attacked over sources row\n\nCivil liberties group the Electronic Frontier Foundation (EFF) has joined a legal fight between three US online journalists and Apple.", "Apple wants the reporters to reveal 20 sources used for stories which leaked information about forthcoming products, including the Mac Mini.", "The EFF argues that the reporters are protected by the American constitution.", "The case threatens the basic freedoms of the press.", "It argues that the journalists' privacy is compromised because they can provide communications relevant to the product code-named Asteroid and the court allows Apple to get away with this."], "smollm:1.7b": ["Apple is attacking over sources row by claiming that three US online journalists have joined a legal fight between them and EFF (Electronic Frontier Foundation) to stop them from revealing confidential information about upcoming products.", "The EFF has asked California's Superior Court to stop Apple from pursuing the sources, arguing that they are protected by the American constitution.", "The EFF says the case threatens the basic freedoms of the press.", "Apple is particularly keen to find the source for information about an unreleased product code-named Asteroid and has asked the journalists' ISPs (Internet Service Providers) to hand over communications relevant to that.", "\"Rather than confronting the issue of reporter's privilege head-on, Apple is going to the journalist's ISPs for his e-mails,\" said EFF lawyer Kurt Opsahl.", "\"This undermines a fundamental First Amendment right that protects all reporters.", "If the court lets Apple get away with this, and exposes the confidences gained by these journalists, potential confidential sources will be deterred from providing information to the media and the public will lose a vital outlet for independent news, analysis and commentary,\" he said.", "The case began in December 2004 when Apple asked a local Californian court to get the journalists to reveal their sources for articles published on websites AppleInsider.com and PowerPage.org.", "Apple also sent requested information from the Nfox.com, the internet service provider of PowerPage's publisher Jason O-Grady.", "As well as looking at how far corporations can go in preventing information from being published, the case will also examine whether online journalists have the same privileges and protections as those writing for newspapers and magazines.", "The EFF has gained some powerful allies in its legal battle with Apple, including Professor Tom Goldstein, former dean of the Journalism School at the University of California and Dan Gillmor, a well-known Silicon Valley journalist.", "Apple was not immediately available for comment."], "deepseek-r1:1.5b": ["Apple attacked over sources row  \nThe Electronic Frontier Foundation (EFF) has joined a legal fight between three US online journalists and Apple.", "The EFF claims to represent the reporters and argues that their sources are protected under the U.S. Constitution.", "Apple wants the reporters to reveal specific sources used for their news about upcoming products, including the Mac Mini.", "The EFF has requested California's Superior court to stop Apple pursuing these sources and argued that they're protected by constitutional rights.", "The case began in December 2004 when Apple sought journalists' e-mails from sites like AppleInsider.com.", "The EFF has allies like Tom Goldstein, a professor of Journalism, and Dan Gillmor, a Silicon Valley journalist, aiding their fight."], "tinyllama:1.1b": ["The Electronic Frontier Foundation (EFF) has joined a legal fight between three US online journalists and Apple over the publication of leaked information about forthcoming products.", "The EFF, representing the reporters, is seeking to stop Apple from pursuing the journalists for accessing and sharing confidential information from their sources, including unreleased product codes, as well as communication related to the \"Asteroid\" project code-named by the reporters' e-mail provider.", "This underlies a fundamental First Amendment right that protects all reporters, according to Kurt Opsaahl, an EFF lawyer and legal counsel for the journalists.", "The case began in December 2004 when Apple requested court permission to expose confidential sources, including information published on sites like AppleInsider.com and PowerPage.org.", "In addition, Apple also sent requests from Nfox.com, a local California Internet service provider owned by the same publisher as the websites targeted by the journalists.", "The case will examine whether online journalist have the same privileges and protection as those writing for newspaper or magazine, and how far corporations can go in preventing information being published."], "tinydolphin:1.1b": [" In a recent legal battle between three US online journalists and Apple, an Electronic Frontier Foundation (EFF) campaign seeks to protect their sources from revealing.", "The case threatens the basic freedoms of press, with Apple seeking to access information about an unreleased product code-named Asteroid and asking the journalists' email providers for communications relevant to that topic.", "This undermines a fundamental First Amendment right, protecting all reporters from disclosure of their confidential sources.", "If the court allows Apple to go after these reporters' sources, potential confidential sources will be deterred from providing information to the media and the public will lose a vital outlet for independent news, analysis, and commentary.", "This raises serious concerns about the future of online journalism and the fundamental role it plays in our democratic society."], "phi:2.7b": [" Apple is fighting with three journalists over 20 sources used to report on upcoming products.", "The Electronic Frontier Foundation (EFF) has asked a court in California to stop Apple from suing the reporters for their e-mails.", "EFF argues that revealing the sources would threaten press freedom, and if allowed, could deter confidential sources.", "The case also addresses whether online journalists have the same protections as print journalists."], "orca-mini:3b": [" Apple is suing three online journalists for their sources over leaks about unreleased products, seeking to reveal the identities of confidential informants.", "The Electronic Frontier Foundation (EFF) is representing the journalists in the case, which could have implications for the confidentiality of sources for news and information."], "hermes3:3b": ["Apple targeting journalists over source revelation"], "stablelm-zephyr:3b": ["The Electronic Frontier Foundation (EFF) has intervened in a legal dispute between US online journalists and tech giant Apple, arguing that the journalists' First Amendment rights have been violated.", "In 2004, Apple requested the three websites – AppleInsider.com and PowerPage.org – reveal their sources for articles.", "EFF has now asked California's Superior Court to halt Apple's pursuit of these sources, stating that it threatens the basic freedoms of the press.", "The case will also examine whether online journalists have the same privileges and protections as traditional print media."], "chatgpt-4o-latest": ["Civil liberties group EFF has joined a legal battle between Apple and three US online journalists whom Apple wants to reveal 20 sources for leaked product information, including the Mac Mini.", "The EFF argues that the journalists are protected by the First Amendment and that Apple's actions threaten press freedom.", "Apple is particularly focused on finding the source of an unreleased product, Asteroid, and has sought journalists' emails from their ISPs.", "The case, which began in December 2004, will also determine whether online journalists have the same legal protections as traditional media.", "The EFF has gained support from prominent journalism figures, while Apple has not commented."], "stablelm2:1.6b": ["Apple is involved in a legal dispute with three US online journalists over revealing their sources to disclose information about forthcoming products, including the Mac Mini.", "The Electronic Frontier Foundation (EFF) has joined the fight and asked California's Superior court to halt Apple from pursuing the sources.", "The EFF argues that journalists are protected by the American constitution and that this case threatens basic press freedoms.", "Apple seeks records related to an unreleased product code-named \"Asteroid\" and asks journalists' ISPs for their emails, undermining a fundamental First Amendment right.", "This case will examine if online journalists have the same privileges and protections as those writing for newspapers and magazines.", "The EFF has gained allies in its legal battle with Apple, including well-known Silicon Valley journalist Dan Gillmor."], "granite3.1-dense:2b": ["Apple is embroiled in a legal dispute with three US online journalists and their representatives from the Electronic Frontier Foundation (EFF).", "The conflict revolves around Apple's demand that the reporters reveal 20 sources used in stories about forthcoming products, including an unreleased Mac Mini code-named Asteroid.", "The EFF is challenging this request in California's Superior court, arguing that journalists are shielded by the First Amendment and should not be forced to disclose confidential sources.", "The EFF contends that Apple's strategy of obtaining data from the journalists' internet service providers (ISPs) undermines reporter's privilege and threatens press freedom.", "They warn that if Apple prevails, potential sources will be deterred from sharing information with the media, consequently impacting independent news outlets and public access to crucial analysis and commentary.", "The case, initiated in December 2004, began when Apple sought the journalists' sources for articles published on websites like AppleInsider.com and PowerPage.org.", "The dispute extends beyond corporate restrictions on publishing information; it questions whether online journalists maintain the same protections as traditional print media.", "Notably, the EFF has garnered support from influential figures such as Professor Tom Goldstein and Silicon Valley journalist Dan Gillmor in this legal battle against Apple.", "The tech giant has not provided a comment on the matter at the time of writing."]}