{"raw_text": "Mobile audio enters new dimension\n \n As mobile phones move closer to being a ubiquitous, all-in-one media player, audio is becoming ever more important. But how good can that sound be from such a small device?\n \n The sound of a buzzing bee jumps from left to right before disappearing around the back of my head. The surround sound demo is unremarkable when heard on a multi-speaker home cinema system but startling when emerging from a small mobile phone. British firm Sonaptic is one of a number of companies to have developed 3D audio technology that emerges from stereo speakers. Firms AM3D and SRS both offer stereo-widening technology for mobile phones. But Sonaptic's managing director David Monteith says his firm is the only company to offer positional 3D audio on a mobile.\n \n \"There are quite a few basic technologies out there, making the sound seem a bit bigger, headphones a bit nicer.\n \n \"No-one has really tried before to make proper 3D positional audio - where an individual channel can be moved around.\" Sonaptic has been working with Japanese mobile network NTT DoCoMo to set standards for 3D audio on mobile phones. In the last few months handsets from NEC, Fujitsu and Mitsubishi have been released on to the Japanese marker which have chips produced by Yamaha and Rohm with Sonaptic's technology. \"The technology has been around on PCs and games consoles for some time but what we are doing is making it more efficient so it can go on a small consumer device like a mobile phone,\" said Mr Monteith.\n \n The technology works through applying the science of psychoacoustics and grew out of medical research done by the company's research director Dr Alastair Sibbald. \"We are basically trying to fool your ears into thinking sound is coming from areas it actually isn't. \"Your brain uses certain bits of information which we are effectively synthesising on a mobile phone handset.\" The structure of the ear works as a 3D encoder for sound - helping the brain understand from where sound is emanating. Sonaptic's audio processing algorithms mimic that 3D encoding, giving the impression that sound is coming from the left, right, and behind a listener when in fact it is coming from a single source. Mr Montieth says: \"If the sound is off to one side it will get to one ear before the other - if it is on the right it has to bend around your head to get to your left ear.\n \n \"The shape of your ear causes differences in sound from one ear to the other. We are synthesising those differences.\" Sonaptic hopes the technology will have a big impact in the growing market of mobile gaming and music downloading. \"Handhelds often have limitations - screens will be small by definition. \"If you want to get impact from media you are running - either a movie, a game or watching TV - if you want it to be more immersive then our technology can help.\" A fishing game is the first title to use the technology, creating a 3D sound field while the gamer plays. Driving games and shoot 'em ups using the technology are in development. The technology can also be used for music - giving songs a much more expansive and immersive feel. Sonaptic offers its technology on a chip or in software and is about to release a new version which significantly improves the efficiency of the audio processing. \"It's important we only use 10 or 15% of the processor otherwise you won't be able to play a game on the handset,\" explained Mr Montieth. The company is now looking to the US and European markets, where it has been working with network Vodafone. \"We have focused first on Japan because it has a very advanced mobile phone market. \"We knew Japan would be the first place to have the handsets that could use our technology. \"There should be handsets out in the UK in the next six months.\"\n", "llama3.2:1b": ["Here is a concise summary of the text:\n\nSonaptic, a British firm, has developed 3D audio technology for mobile phones.", "The company's managing director says their technology offers positional 3D audio, where an individual channel can be moved around to create a more immersive experience.", "Sonaptic works by applying psychoacoustics and medical research techniques to mimic the way our brains process sound.", "They have partnered with NTT DoCoMo in Japan to release handsets that use their technology, and are working on releasing a new version of their software for mobile gaming and music downloading.", "The company plans to release chips with improved audio processing efficiency, allowing for more immersive experiences on handsets."], "llama3.2:3b": ["Mobile phones are becoming more media players, with audio playing an increasingly important role.", "British firm Sonaptic has developed 3D audio technology that uses stereo speakers, offering positional sound on mobiles.", "The company's managing director says his firm is the only one to offer real 3D positioning, rather than just making sounds seem bigger or nicer.", "Sonasonic works with Japanese network NTT DoCoMo and has released technology in handsets from NEC, Fujitsu, and Mitsubishi.", "Their technology mimics human hearing using psychoacoustics, creating an immersive experience for gaming, music, and other media."], "gemma2:2b": ["Sonaptic is developing 3D audio technology for mobile phones, aiming to create a more immersive listening experience by simulating sound directionality from a single source using psychoacoustic principles.", "The company's technology mimics the way the ear encodes 3D sound information, allowing users to perceive sounds as coming from various directions even when they originate from a limited space, like a small mobile phone screen.", "This technology is particularly beneficial for gaming and music consumption on handheld devices.", "While initial implementations are found in fishing games and Japanese market handsets, Sonaptic plans to expand into the US and European markets in the near future."], "qwen2.5:0.5b": ["Mobile audio is becoming increasingly important due to its ubiquitous nature and improved capabilities of small devices like mobile phones, but the quality of sound from such a device remains variable.", "British firm Sonaptic has developed 3D audio technology that can appear stereo on a mobile phone system.", "However, it requires headphones or speakers for better quality.", "The company's managing director David Monteith says it is only one of several firms working with position-based 3D audio (e.g., AM3D and SRS).", "Positional 3D audio uses sensors in the ear to help the brain interpret sound from a single source, but it has limitations for smaller handsets.", "The technology is now being tested on mobile phones from NEC, Fujitsu, and Mitsubishi, with Yamaha and Rohm producing chips."], "qwen2.5:1.5b": ["Mobile audio enters new dimension: Sonaptic, a company developing 3D audio for mobile phones, is creating positional sound on smaller devices like smartphones.", "The technology uses psychoacoustic principles to make sound appear to come from multiple directions and positions within a listener's environment.", "It has been tested on Japanese network DoCoMo and will be used in handheld games and music applications to enhance media experiences on small screens.", "Sonaptic aims to expand its market presence globally, particularly targeting the US and Europe markets."], "qwen2.5:3b": ["Mobile audio enters new dimension as phones evolve into all-in-one media players, with improved sound quality becoming crucial.", "Sonaptic, a British company, offers 3D positional audio from stereo speakers that is notably different on mobiles compared to home systems due to its efficiency and effectiveness.", "The technology leverages psychoacoustics and mimics the ear's encoding of sound directionality for immersive experiences in gaming, music downloading, and streaming media.", "Sonaptic collaborates with Japanese networks like NTT DoCoMo to establish standards for 3D audio on mobiles, which has already been implemented in devices from NEC, Fujitsu, and Mitsubishi using Yamaha and Rohm chips.", "The technology is expected to grow within the mobile gaming and music sectors by enhancing immersion and providing a more impactful user experience.", "Sonaptic plans to launch its new version of this technology, optimized for processor efficiency, with potential market expansion towards US and European regions."], "opencoder:1.5b": ["The text you've provided provides an extensive discussion on the sound of mobile phones, highlighting the benefits and challenges associated with 3D audio technology.", "However, it's also quite detailed and doesn't provide a summary that preserves all key ideas or details.", "A simplified version of this text could be: \"While mobile audio has become increasingly important in modern media players, there are limitations to its effectiveness on small devices like mobile phones.\"", "This brief summary should give you an idea of the scope and importance of 3D audio technology on mobile phones."], "smollm:1.7b": ["The text summarization is as follows:\n\nMobile audio enters new dimension with 3D audio emerging from stereo speakers, but how good can it be from such a small device?", "The sound of a buzzing bee jumps from left to right before disappearing around the back of my head.", "The surround sound demo is unremarkable when heard on a multi-speaker home cinema system but startling when emerging from a small mobile phone.", "British firm Sonaptic is one of a number of companies to have developed 3D audio technology that emerges from stereo speakers, but it is positional 3D audio that is the most innovative and promising.", "Positional 3D audio uses the science of psychoacoustics to mimic the way our brains process sound in real life.", "It works by applying the same principles as how we hear sound in the real world - using differences in sound from one ear to the other, for example.", "This technology is being used on mobile phones and gaming devices to create a more immersive experience.", "The technology can also be used for music - giving songs a much more expansive and immersive feel.", "Sonaptic offers its technology on a chip or in software and is about to release a new version which significantly improves the efficiency of the audio processing."], "deepseek-r1:1.5b": ["Mobile audio enters new dimensions as mobile devices become more ubiquitous, offering increasingly important listening experiences.", "Sound quality from small, compact devices remains a challenge, particularly in achieving positional 3D audio effects where sound originates from different locations simultaneously.", "British firm Sonaptic has developed stereo-widening technologies for mobile phones that aim to enhance immersive sound on these devices.", "While Sonaptic's positioning is notable, it faces competition from AM3D and SRS, which offer advanced stereo-wide features.", "The company, led by director David Monteith, asserts its dominance in 3D audio technology with a position akin to 'no-frills' mobile audio, emphasizing that the effects are effective but not necessarily for all audiences.", "Sonaptic's 3D audio technology leverages psychoacoustics and psycho-phenomenology, using sound processing algorithms similar to those found in medical research.", "This approach enables sound to appear as if emanating from different angles when played on mobile phones.", "The ear system inherently encodes 3D information, which Sonaptic aims to simulate on mobile devices.", "By shifting frequency channels into multiple ' ears,' each channel can be moved to adjust the perceived source of sound, creating a more immersive listening experience.", "The technology is being tested with Japanese mobile networks and chips from companies like Yamaha and Rohm, aiming for a competitive edge over existing 3D audio solutions.", "Sonaptic plans to release a software version or an efficiency-enhancing chip in subsequent releases, targeting expansion into broader market segments like tablets and smartphones.", "The company anticipates significant impact in the evolving landscape of mobile gaming and music downloads, where immersive sound experiences are crucial for enhancing user engagement."], "tinyllama:1.1b": ["The new dimension of audio: MoBILE audio enters new uni-dimensionality\n\nAs mobile phones move closer to becoming a ubiquitous, all-in-one media player, audio is becoming ever more important.", "But how good can this sound be from such a small device?", "The audio in the demo is impressive when heard on home cinema systems, but it's shocking when emerging from a smaller mobile phone.", "British firm Sonaptic has developed 3D audio technology that emerges from stereo speakers to offer a new dimension of audio experience.", "But it's only been offered by the company as an option for mobile phones with AM3D and SRS both offering 3D audio on mobile devices.", "However, Sonaptic's managing director David Monteith says the technology has already been developed to be used in handsets that can handle a bigger, hi-fi sound experience.", "There are no simple technologies available yet for mobile phones, but the latest version of their 3D audio technology should provide an immersive sound field when used with video games and music downloads.", "The company has just finished working on an upgrade in software that will take its technology even further, improving efficiency and making it more widely accessible."], "tinydolphin:1.1b": [" Introducing Sonaptic, the company that has invented and refined positional 3D audio for mobile phones.", "Their expertise lies in creating advanced technologies that make sound seem larger, more immersive, and more personal.", "At present, their technology is being used in fishing games, driving games, shoot 'em up games, and music apps on NTT DoCoMO's J-series handsets.", "In the next few months, they will also be releasing a new version of their technology that improves its efficiency, enabling it to process audio signals more effectively.", "Their primary target market is the growing market for mobile gaming and music downloading, where immersive sound experiences can greatly enhance the enjoyment of these popular genres."], "phi:2.7b": [" Sonaptic is a company that has developed 3D audio technology for mobile phones, allowing users to experience sound from various directions on their device.", "The technology works by synthesizing differences in sound perception caused by the shape of the ear.", "This will have an impact on mobile gaming and music downloading, creating a more immersive experience for users.", "Sonaptic's technology is already being used in a fishing game and it is looking to expand into other markets like the US and Europe.", "The company is also working with network Vodafone to release 3D audio on their handsets."], "orca-mini:3b": [" Mobile audio enters new dimension as small devices become more powerful, but sound quality is limited by screen size and processing power.", "Companies are developing 3D audio technology to overcome these limitations.", "British firm Sonaptic is one of a few companies that offer 3D audio on mobile phones, using science from medical research to create an immersive sound field.", "Its technology applies psychoacoustics to fool the brain into thinking sound is coming from specific areas it actually isn't, creating a more immersive experience.", "Sonaptic's audio processing algorithms mimic this 3D encoding, giving the impression that sound is coming from one side or behind the listener when it actually comes from a single source.", "The company's new version improves efficiency, making it suitable for small devices like mobile phones.", "It's now looking to the US and European markets, working with network Vodafone to set standards for 3D audio on mobile phones."], "hermes3:3b": ["Sonaptic developing 3D positional audio tech for mobile phones, improving surround sound experience on small devices using psychoacoustics and medical research."], "stablelm-zephyr:3b": ["Mobile audio is advancing with 3D audio technology from companies like Sonaptic, AM3D, and SRS.", "Sonaptic's positional 3D audio is unique in its application on mobile phones.", "They have collaborated with Japanese mobile network NTT DoCoMo to set standards for 3D audio on handsets from brands like NEC, Fujitsu, and Mitsubishi.", "The technology uses psychoacoustics and mimics the ear's 3D encoding structure to create a more immersive sound experience, especially in mobile gaming and music downloads.", "Sonaptic aims to expand to US and European markets after focusing on Japan initially."], "chatgpt-4o-latest": ["As mobile phones evolve into all-in-one media players, audio quality is becoming increasingly important.", "British firm Sonaptic has developed 3D positional audio technology for mobile phones, distinguishing itself from competitors AM3D and SRS, which focus on stereo-widening.", "Sonaptic's technology, based on psychoacoustics, tricks the brain into perceiving sound from different directions using audio processing algorithms.", "The company has partnered with Japanese mobile network NTT DoCoMo, leading to the release of handsets from NEC, Fujitsu, and Mitsubishi incorporating its technology.", "Initially developed for PCs and gaming consoles, Sonaptic has optimized the technology for mobile devices, ensuring minimal processor usage.", "The technology enhances mobile gaming and music experiences, with a fishing game already utilizing it and driving and shooting games in development.", "Sonaptic offers its technology as a chip or software and is expanding into the US and European markets, collaborating with Vodafone.", "Handsets featuring the technology are expected in the UK within six months."], "stablelm2:1.6b": ["Japanese mobile networks are starting to adopt Sonaptic's 3D audio technology, which allows positional sound on a small device like a mobile phone, according to managing director David Monteith.", "The technology uses psychoacoustic principles and was developed by the company's research team.", "It is expected to have significant impact in gaming and music industries, providing an immersive experience for handheld devices.", "Sonaptic offers its technology in hardware or software format and is working on improving efficiency of audio processing."], "granite3.1-dense:2b": ["Mobile phones are evolving into all-in-one media players, emphasizing audio's role.", "Companies like Sonaptic, AM3D, and SRS have developed 3D audio technology for mobiles, enabling surround sound from stereo speakers.", "Sonaptic claims to be the only firm offering positional 3D audio on mobiles, where individual channels can be moved around.", "Their technology, based on psychoacoustics and medical research by Dr Alastair Sibbald, mimics the 3D encoding of the human ear to create a sensation of sound originating from different directions.", "This enhances mobile gaming, music playback, and movies for more immersive experiences.", "Sonaptic is working with Japanese network NTT DoCoMo and Vodafone in the US and Europe to integrate this technology into handsets, aiming to release devices in these markets within six months."]}