{"raw_text": "DVD copy protection strengthened\n \n DVDs will be harder to copy thanks to new anti-piracy measures devised by copy protection firm Macrovision.\n \n The pirated DVD market is enormous because current copy protection was hacked more than five years ago. Macrovision says its new RipGuard technology will thwart most, but not all, of the current DVD ripping (copying) programs used to pirate DVDs. \"RipGuard is designed to... reduce DVD ripping and the resulting supply of illegal peer to peer,\" said the firm. Macrovision said the new technology will work in \"nearly all\" current DVD players when applied to the discs, but it did not specify how many machines could have a problem with RipGuard. Some BBC News website users have expressed concerns that the new technology will mean that DVDs will not work on PCs running the operating system Linux. The new technology will be welcomed by Hollywood film studios which are increasingly relying on revenue from DVD sales.\n \n The film industry has stepped up efforts to fight DVD piracy in the last 12 months, taking legal action against websites which offer pirated copies of DVD movies for download.\n \n \"Ultimately, we see RipGuard DVD... evolving beyond anti-piracy, and towards enablement of legitimate online transactions, interoperability in tomorrow's digital home, and the upcoming high-definition formats,\" said Steve Weinstein, executive vice president and general manager of Macrovision's Entertainment Technologies Group. Macrovision said RipGuard would also prevent against \"rent, rip and return\" - where people would rent a DVD, copy it and then return the original. RipGuard is expected to be rolled out on DVDs from the middle of 2005, the company said. The new system works specifically to block most ripping programs - if used, those programs will now most likely crash, the company said. Macrovision has said that Rip Guard can be updated if hackers find a way around the new anti-copying measures.\n", "llama3.2:1b": ["DVD copy protection strengthened with new anti-piracy measure RipGuard.", "This technology blocks most DVD ripping programs and is designed to reduce piracy on DVDs.", "It will work in nearly all current players but may not apply to PCs running Linux or some Hollywood film studios' computers.", "The goal of RipGuard is to enable legitimate online transactions, interoperability, and high-definition formats while preventing \"rent, rip and return\" tactics."], "llama3.2:3b": ["Macrovision's new \"RipGuard\" technology strengthens DVD copy protection by thwarting most but not all current DVD ripping programs used to pirate DVDs.", "The technology will work in nearly all current DVD players, but its impact on Linux operating systems and specific machines is unclear.", "Hollywood film studios welcome the move as they increasingly rely on DVD sales revenue."], "gemma2:2b": ["Macrovision's RipGuard technology adds new copy protection measures to DVDs.", "This is designed to reduce DVD piracy by preventing many popular ripping programs and may also address issues related to \"rent, rip, and return\".", "The technology aims to be more resistant than previous efforts and will likely be rolled out in the middle of 2005."], "qwen2.5:0.5b": ["DVD copy protection is being strengthened by new anti-piracy measures developed by Macrovision.", "The firm's new technology, known as RipGuard, will work on nearly all current DVD players when applied to the discs.", "Some people are concerned that the new technology may cause DVDs not to work on PCs running Linux operating systems.", "The company is enthusiastic about the potential of RipGuard for enabling legitimate online transactions, improving interoperability in tomorrow's digital home, and launching high-definition formats."], "qwen2.5:1.5b": ["DVDs are becoming harder to copy thanks to new anti-piracy technology called RipGuard developed by Macrovision, which is designed to prevent or reduce piracy of DVDs using rip-protected discs and has some compatibility issues with certain Linux-based PCs.", "The new technology was created to address the issue of current DVD ripping programs being able to pirate DVDs without detection, as well as preventing \"rent, rip and return\" schemes where people would rent a movie, copy it, then return the original disc.", "Macrovision expects RipGuard to be rolled out on DVDs starting in mid-2005."], "qwen2.5:3b": ["DVD copy protection strengthened thanks to new Anti-Piracy measure RipGuard technology by Macrovision.", "Designed to reduce DVD ripping for illegal use and peer-to-peer sharing, it aims to work in nearly all current DVD players.", "While welcomed by Hollywood studios, concerns remain about potential Linux compatibility issues.", "The firm predicts RipGuard will evolve beyond anti-piracy measures towards online transactions, digital home interoperability, and future high-definition formats.", "Initially planned for rollout from mid-2005, the technology blocks most ripping programs or causes them to crash.", "Macrovision stated it could update the software if hackers find a workaround."], "opencoder:1.5b": ["DVD copy protection strengthened, reducing the risk of piracy and enhancing the legitimacy of DVD content.", "The firm's Anti-Piracy technology now plays a crucial role in protecting DVDs from pirating by reducing copying.", "It will not only hinder ripping programs but also enhance online transactions, compatibility with future operating systems, and enablement of legitimate online transactions."], "smollm:1.7b": ["DVD copy protection strengthened by new anti-piracy measures devised by macrovision, which aims to reduce DVD ripping and supply of illegal peer to peer.", "The pirated DVD market is enormous due to current copy protection was hacked more than five years ago.", "Macrovision's new RipGuard technology will thwart most current DVD ripping (copying) programs used to pirate DVDs but not all.", "BBC News website users have expressed concerns that the new technology will mean that DVDs will not work on PCs running Linux.", "The new technology will be welcomed by Hollywood film studios which are increasingly relying on revenue from DVD sales."], "deepseek-r1:1.5b": ["DVD copies are harder to pirate now due to new anti-piracy measures from Macrovision.", "Some companies like Microgaming have stopped selling pirated games.", "RipGuard technology reduces piracy but leaves some programs risky, with machines possibly still working on Linux.", "The film industry is stepping up to combat piracy and focus on digital content.", "Macrovision plans to enhance copy protection by 2005, using RipGuard."], "tinyllama:1.1b": ["As part of ongoing efforts to prevent piracy of DVDs, new anti-piracy measures from Macrovision have been designed specifically to block most rippping programs and will work in \"nearly all\" current DVD players when applied to discs.", "The firm has also said that the new technology will enable legal online transactions, interoperability in high-definition formats, and support for the upcoming 480p and 720p standard video resolutions, among other benefits.", "Despite concerns from some users about the technology's effectiveness on DVD players running Linux operating systems, Macrovision says that DVDs will continue to work in most cases.", "The new system is expected to be rolled out on DVDs by mid-2005."], "tinydolphin:1.1b": [" The content is about the recent enhancement in DVD copy protection technology called RipGuard.", "This technology is designed to make it harder for pirates to copy DVDs and thus reduce the demand for illegal peer-to-peer distribution of digital media.", "Macrovision, a leading DVD protection firm, has introduced this new system with the hope that its use will increase the value of purchased DVDs.", "The company claims that RipGuard will also enhance the convenience of home viewing and allow for easier integration of advanced high-definition formats into digital devices."], "phi:2.7b": [" The film industry is fighting DVD piracy by releasing new anti-piracy measures called RipGuard from Macrovision.", "This technology will make it harder to copy DVDs and prevent illegal downloading or renting of movies.", "While some users have concerns about compatibility with Linux, Hollywood studios are generally in favor of the new system.", "Overall, RipGuard is expected to be used on DVDs starting in 2005 and can be updated if hackers find a way around it."], "orca-mini:3b": [" New anti-piracy measures devised by copy protection firm Macrovision will make DVDs harder to copy thanks to RipGuard technology, which is designed to block most ripping programs used to pirate DVDs.", "The new technology will work in \"nearly all\" current DVD players when applied to the discs, but some machines may have problems with it.", "Hollywood film studios are increasingly relying on revenue from DVD sales, and the new technology will help fight DVD piracy.", "Rent-rip-and-return is also prevented by the new system.", "The new technology can be updated if hackers find a way around it."], "hermes3:3b": ["Macrovision develops RipGuard tech for DVD copy protection, making DVDs harder to rip and pirate, aiming to reduce illegitimate P2P supply."], "stablelm-zephyr:3b": ["Macrovision, a copy protection firm, introduces RipGuard technology to strengthen DVD copy protection against piracy.", "The new technology is designed to reduce DVD ripping and illegal peer-to-peer sharing.", "While it will work in nearly all current DVD players, some concerns have been raised that Linux-operating system users may face issues.", "Macrovision's Steve Weinstein sees RipGuard evolving beyond anti-piracy towards enabling legitimate online transactions, interoperability in digital homes, and high-definition formats.", "The new system is expected to be rolled out on DVDs from mid-2005 and will most likely crash any ripping programs when used."], "chatgpt-4o-latest": ["DVDs will be harder to copy due to Macrovision's new RipGuard technology, designed to thwart most DVD ripping programs and reduce illegal file sharing.", "While it will work on nearly all DVD players, concerns exist about compatibility with Linux PCs.", "Hollywood studios welcome the move as they rely on DVD sales.", "The film industry has intensified anti-piracy efforts, including legal action against piracy websites.", "Macrovision envisions RipGuard evolving beyond anti-piracy to support legitimate online transactions and future high-definition formats.", "The technology also aims to prevent \"rent, rip and return\" piracy.", "Expected to launch in mid-2005, RipGuard will cause most ripping programs to crash and can be updated if hackers bypass it."], "stablelm2:1.6b": ["Macrovision's new RipGuard technology makes it harder for pirates to copy DVDs due to its strong anti-piracy measures.", "RipGuard reduces DVD ripping and limits the supply of illegal peer-to-peer programs, making it more difficult for pirates to obtain copyrighted material.", "The technology should work in nearly all current DVD players, but some concerns have been raised about compatibility with Linux operating systems.", "Hollywood film studios will benefit from this new technology as they increasingly rely on revenue from DVD sales.", "RipGuard is expected to be rolled out on DVDs by the middle of 2015 and has been designed to prevent against \"rent, rip and return\" scenarios.", "It can also be updated if hackers find a way around the anti-copying measures."], "granite3.1-dense:2b": ["Macrovision introduces RipGuard technology for DVD copy protection, aimed at significantly reducing unauthorized copying and piracy.", "This innovation is expected to affect nearly all current DVD players but may cause issues with some Linux-running PCs.", "The technology targets most existing DVD ripping software, causing it to malfunction upon encountering RipGuard.", "Hollywood film studios support this move due to its potential for boosting DVD sales revenue.", "Macrovision plans to expand RipGuard beyond anti-piracy, eventually enabling legitimate online transactions and interoperability in digital homes.", "The system is anticipated to be implemented on DVDs by mid-2005 and can be updated if hackers discover new methods to bypass the protection."]}