{"raw_text": "Britons fed up with net service\n \n A survey conducted by PC Pro Magazine has revealed that many Britons are unhappy with their internet service.\n \n They are fed up with slow speeds, high prices and the level of customer service they receive. 17% of readers have switched suppliers and a further 16% are considering changing in the near future. It is particularly bad news for BT, the UK's biggest internet supplier, with almost three times as many people trying to leave as joining.\n \n A third of the 2,000 broadband users interviewed were fed up with their current providers but this could be just the tip of the iceberg thinks Tim Danton, editor of PC Pro Magazine. \"We expect these figures to leap in 2005. Every month the prices drop, and more and more people are trying to switch,\" he said. The survey found that BT and Tiscali have been actively dissuading customers from leaving by offering them a lower price when they phone up to cancel their subscription. Some readers were offered a price drop just 25p more expensive than that offered by an alternative operator, making it hardly worth while swapping.\n \n Other found themselves tied into 12-month contracts. Broadband has become hugely competitive and providers are desperate to hold on to customers. 12% of those surveyed found themselves unable to swap at all. \"We discovered a huge variety of problems, but one of the biggest issues is the current supplier withholding the information that people need to give to their new supplier,\" said Tim Danton, editor of PC Pro. \"This breaks the code of practice, but because that code is voluntary there's nothing we or Ofcom can do to help,\" he said. There is a vast choice of internet service providers in the UK now and an often bewildering array of broadband packages. With prices set to drop even further in coming months Mr Danton advises everyone to shop around carefully. \"If you just stick with your current connection then there's every chance you're being ripped off,\" he warned.\n", "llama3.2:1b": ["Britons are unhappy with their internet service, with 17% and 16% of readers considering switching or leaving their providers in the near future due to slow speeds, high prices, and poor customer service.", "The survey found that BT has the highest number of customers trying to leave (almost three times as many) compared to joining."], "llama3.2:3b": ["Many Britons are unhappy with their internet service, citing slow speeds and high prices as major issues.", "17% have switched suppliers and 16% consider changing soon.", "BT is particularly affected, with almost three times more people trying to leave than join.", "The survey found that providers often dissuade customers from leaving by offering lower prices, but some are trapped in 12-month contracts due to lack of information being shared.", "Experts warn that the situation will worsen as prices drop further and recommend shopping around carefully to avoid being \"ripped off\"."], "gemma2:2b": ["A survey by PC Pro Magazine found that many Britons are dissatisfied with their internet service, citing slow speeds, high prices, and poor customer service.", "17% have switched suppliers and 16% are considering it, significantly outpacing new subscriptions to BT.", "This trend suggests a growing discontentment with the current market as prices continue to drop and competition intensifies.", "Some providers actively discourage switching through price offers that barely offset the potential savings for customers.", "Lack of information on leaving also hampers the process.", "The survey highlights the competitive landscape in UK broadband, encouraging readers to shop around carefully to avoid being overcharged by their current provider."], "qwen2.5:0.5b": ["Key ideas:\n\n- Britons are fed up with their internet service.", "- Many readers switched suppliers and considered changing in the near future.", "- 17% of readers have switched broadband providers, but this could be just the tip of the iceberg.", "- BT and Tiscali are actively offering lower prices to customers.", "- Broadband has become highly competitive, with many providers trying to hold onto their customers.", "- Many customers are unable to switch to a different service provider in a year's time."], "qwen2.5:1.5b": ["A survey by PC Pro Magazine found that 17% of British internet users are switching suppliers or considering doing so due to poor service, high prices, and low customer satisfaction levels, particularly affecting the UK's biggest internet provider, BT.", "Price drops and forced cancellation clauses from existing providers deter many customers from leaving.", "The survey highlighted issues with withholding essential information for new connections and limited options in broadband packages, leading to a competitive yet difficult-to-switch market."], "qwen2.5:3b": ["A survey by PC Pro Magazine shows that many Britons are dissatisfied with their internet service, citing slow speeds and high prices along with poor customer service.", "17% of readers have already switched providers, while another 16% plan to do so soon.", "The situation is particularly concerning for BT, with almost three times as many trying to leave as join.", "Tim Danton from PC Pro predicts a surge in switchers due to dropping prices and increased competition.", "Providers like BT discourage customers by offering lower rates upon cancellation.", "Around one-third of users find themselves locked into long-term contracts, preventing them from switching.", "Danton suggests Britons should shop around for better deals as current service often lacks transparency and breaks codes of practice.", "He advises carefully considering their internet connections to avoid being \"ripped off.\""], "opencoder:1.5b": ["The survey revealed that many Britons are unhappy with their internet service.", "They are fed up with slow speeds, high prices and the level of customer service they receive.", "Nearly three times as many people try to leave as join, BT is facing difficulties in replacing these customers while Tiscali has made their customers leave by offering a lower price when they call for cancellation.", "Broadband has become massively competitive and customers are struggling to retain."], "smollm:1.7b": ["The text summarizes the key points from the original text, preserving the main ideas and details while omitting unnecessary information.", "The summary is concise, clear, and easy to understand."], "deepseek-r1:1.5b": ["Britons are dissatisfied with their internet service due to rising costs, high prices, poor customer service, and the increasing number of people trying to switch suppliers.", "According to a survey, 17% of readers have already switched, and an additional 16% plan to do so soon.", "The UK's largest provider, BT, is particularly struggling with nearly three times more readers wanting to leave than join, as it offers lower pricing when users cancel their subscriptions.", "Other participants are in 12-month contracts due to competition from providers trying to hold on to customers, but some couldn't switch at all because suppliers didn’t inform new users.", "Tim Danton foresees a surge in dissatisfaction by 2005, with prices dropping each month and more people switching.", "He warns that while there is plenty of choice now, the array of broadband packages can be confusing, urging cautious shopping for potential switches."], "tinyllama:1.1b": ["The majority of British internet users are dissatisfied with their service, according to a survey conducted by PC Pro Magazine.", "The report revealed that almost half (46%) of the people surveyed had switched broadband suppliers and another 16% were considering changing in the near future.", "Many respondents said they were unhappy with slow speeds, high prices, and the level of customer service received.", "The study found that BT was particularly bad at providing services, with almost three times as many people who tried to leave their current provider as joining.", "The price drop seen by some broadband providers is little compensation for a seemingly poor service.", "Mr Danton recommended shoppers to check prices and read reviews before deciding on their internet connection."], "tinydolphin:1.1b": [" The recent PC Pro Magazine survey found that nearly a third of people had switched their internet service providers due to poor service and high costs, while the UK's biggest internet supplier BT was hit by a massive drop in its customer base.", "A third of users were fed up with their current providers but this could be just the tip of the iceberg, as more people are likely to switch due to reduced prices and competitive offers from alternative suppliers.", "Some customers were offered discounts ranging from 25p per month down to nothing when they called to cancel their subscription.", "The survey found that the average customer switched their provider once a year, with those who were unhappy staying longer than two years on average."], "phi:2.7b": [" A survey found that many Britons are unhappy with their internet service, particularly BT, due to slow speeds, high prices, and poor customer service.", "Some readers have switched suppliers, while others are considering it.", "However, some providers offer lower prices to dissuade customers from leaving.", "Others may be tied into long-term contracts or unable to switch at all.", "The code of practice for internet service providers is voluntary, and there's little the authorities can do to help those in need.", "Shoppers should carefully shop around for the best deals."], "orca-mini:3b": [" A survey conducted by PC Pro Magazine revealed that many Britons are unhappy with their internet service, with slow speeds, high prices and poor customer service being the main issues.", "Some readers were offered a price drop just 25p more expensive than an alternative operator, making it hardly worth while swapping.", "Additionally, many people found themselves unable to switch due to contractual agreements.", "The survey found that BT and Tiscali have been actively discouraging customers from leaving by offering them a lower price when they cancel their subscription.", "Some readers were offered a price drop just 25p more expensive than an alternative operator, making it barely worth while switching.", "With prices set to drop even further in coming months, Mr. Danton advises everyone to shop around carefully and warns that there's every chance people are being ripped off."], "hermes3:3b": ["Britons dissatisfied with internet service, largely due to slow speeds, high prices, poor customer service, and difficulty switching suppliers (17% have switched, 16% planning to)."], "stablelm-zephyr:3b": ["A PC Pro Magazine survey found that many Britons are unhappy with their internet service, citing slow speeds, high prices, and poor customer service.", "17% of respondents have switched suppliers, and 16% are considering changing in the near future.", "BT, the UK's biggest internet supplier, has been particularly affected, with nearly three times as many people trying to leave as join.", "The editor of PC Pro Magazine expects these figures to increase as prices drop and more people try to switch.", "Some readers have found themselves tied into 12-month contracts, making it difficult to switch providers.", "As broadband competition intensifies, Tim Danton advises shoppers to carefully shop around for the best deals."], "chatgpt-4o-latest": ["A survey by PC Pro Magazine found that many Britons are dissatisfied with their internet service due to slow speeds, high prices, and poor customer service.", "17% have switched providers, and 16% are considering it.", "BT, the UK's largest provider, is losing more customers than it gains.", "A third of the 2,000 broadband users surveyed were unhappy, and the trend is expected to grow as prices drop.", "Some providers, like BT and Tiscali, try to retain customers by offering lower prices when they attempt to cancel, while others lock users into 12-month contracts.", "12% of respondents were unable to switch due to providers withholding necessary information, violating a voluntary code of practice.", "With increasing competition and falling prices, PC Pro's editor advises consumers to shop around to avoid being overcharged."], "stablelm2:1.6b": ["A survey by PC Pro Magazine reveals that many Britons are unhappy with their internet service due to slow speeds, high prices, and poor customer service.", "The majority have switched or consider switching suppliers, with almost three times as many people trying to leave as joining BT as the UK's biggest internet supplier.", "A third of surveyed broadband users were fed up with their current providers; however, it is speculated that these issues will rise in the coming months as prices drop and competition increases.", "The survey found that BT and Tiscali are actively dissuading customers from leaving by offering lower prices upon cancellation.", "Some readers have been offered a price reduction just 5 pounds more expensive than that offered by an alternative operator, making it nearly impossible to leave.", "Furthermore, some people are tied into monthly contracts, resulting in their inability to switch entirely.", "The editor of PC Pro Magazine warns that if customers stick with their current connection, they run the risk of being ripped off as prices are set to drop further.", "There is now a vast choice of internet service providers and an array of broadband packages, making it crucial for everyone to shop around carefully."], "granite3.1-dense:2b": ["A survey by PC Pro Magazine indicates widespread dissatisfaction among British internet users, primarily due to slow speeds, high prices, and poor customer service.", "Nearly 17% of respondents have already switched providers, with nearly three times as many trying to leave BT compared to joining it.", "Another third are considering a switch in the near future.", "The survey found that both BT and Tiscali employ tactics to deter customers from leaving by offering competitive yet marginally higher prices when they call to cancel.", "Some users were also trapped in 12-month contracts, unable to switch.", "Key issues include providers withholding necessary information for customers switching, a violation of the code of practice that cannot be enforced.", "With prices expected to decrease further, Tim Danton, editor of PC Pro Magazine, advises consumers to thoroughly compare broadband options to avoid being overcharged."]}