{"raw_text": "IBM puts cash behind Linux push\n \n IBM is spending $100m (£52m) over the next three years beefing up its commitment to Linux software.\n \n The cash injection will be used to help its customers use Linux on every type of device from handheld computers and phones right up to powerful servers. IBM said the money will fund a variety of technical, research and marketing initiatives to boost Linux use. IBM said it had taken the step in response to greater customer demand for the open source software.\n \n In 2004 IBM said it had seen double digit growth in the number of customers using Linux to help staff work together more closely. The money will be used to help this push towards greater collaboration and will add Linux-based elements to IBM's Workplace software. Workplace is a suite of programs and tools that allow workers to get at core business applications no matter what device they use to connect to corporate networks. One of the main focuses of the initiative will be to make it easier to use Linux-based desktop computers and mobile devices with Workplace. Even before IBM announced this latest spending boost it was one of the biggest advocates of the open source way of working. In 2001 it put $300m into a three-year Linux program and has produced Linux versions of many of its programs. Linux and the open source software movement are based on the premise that developers should be free to tinker with the core components of software programs. They reason that more open scrutiny of software produces better programs and fuels innovation.\n", "llama3.2:1b": ["IBM is investing £52m over three years to support the use of Linux on various devices, including smartphones and servers.", "The funding will cover technical, research, and marketing initiatives aimed at increasing collaboration between employees using different devices.", "This effort builds on IBM's existing investment in Linux from 2001, when it allocated £300m for a three-year program."], "llama3.2:3b": ["IBM is spending $100m over three years to boost its commitment to Linux software, citing customer demand for the open source platform.", "The investment will fund technical, research, and marketing initiatives to increase Linux use on devices from handheld computers to servers.", "This follows IBM's previous 2001 and 2004 investments in Linux programs."], "gemma2:2b": ["IBM is investing $100 million over three years to increase support for Linux software.", "This investment will fund technical, research, and marketing initiatives aimed at boosting Linux adoption across various devices and platforms.", "IBM sees increasing demand from customers for open-source software and aims to integrate Linux into its Workplace suite of programs, enabling seamless access to business applications on diverse devices."], "qwen2.5:0.5b": ["IBM is investing $100 million over three years to help customers use Linux across a wide range of devices, from handheld computers to powerful servers.", "The company aims to boost its commitment to Linux by funding various technical, research, and marketing initiatives.", "IBM has taken this step in response to greater customer demand for the open source software.", "In 2004 IBM saw double-digit growth in the number of customers using Linux as a tool for teamwork.", "This spending will be used to help with Workplace software development, which features Linux-based desktop computers and mobile devices integrated with workplace applications."], "qwen2.5:1.5b": ["ERROR: llama runner process has terminated: exit status 1 (status code: 500)"], "qwen2.5:3b": ["IBM commits $100m over three years to bolster Linux software use, including for devices from handhelds to servers.", "The funds will support technical, research, and marketing initiatives aimed at promoting Linux in collaboration with IBM's Workplace suite, which aims to enable access to business applications across various devices.", "This move aligns with IBM's growing customer demand for open source solutions since 2004 when it saw double-digit growth in Linux users.", "Prior investments include a $300m three-year Linux program and producing Linux versions of its software.", "Linux is based on the principle that developers should have freedom to modify core programs, leading to improved quality and fostering innovation."], "opencoder:1.5b": ["IBM puts cash behind Linux push\n\nThe $100m (£52m) payment plan provided by IBM is aimed at bolstering its commitment towards Linux-based software in response to increased customer demands.", "It will finance a range of technical, research, and marketing initiatives aimed at enhancing the use of Linux on diverse devices.", "The cash payments will help in accelerating collaboration and expanding the reach of IBM's Linux support to businesses.", "In addition, the money will add to the development efforts of IBM's Workplace software suite which aims to streamline business operations."], "smollm:1.7b": ["IBM is investing $100 million (£52 million) over three years in a Linux-based initiative aimed at boosting its customers' use of the open source software.", "The money will be used to support various technical, research and marketing initiatives that will help IBM increase its customers' adoption of Linux.", "IBM said it has taken the step in response to growing customer demand for the open source software.", "In 2004, IBM reported double-digit growth in the number of customers using Linux to help employees work together more closely.", "The money will be used to support this push towards greater collaboration and add Linux-based elements to IBM's Workplace software.", "One of the main focuses of the initiative will be to make it easier for users to use Linux-based desktop computers and mobile devices with IBM's Workplace software.", "IBM has been one of the biggest advocates of the open source way of working, investing $300 million in a three-year Linux program and producing Linux versions of many of its programs.", "IBM is also investing $100 million (£52 million) over three years to support various technical, research and marketing initiatives that will help IBM increase its customers' adoption of Linux.", "The money will be used to fund a variety of technical, research and marketing initiatives that will help IBM boost its customers' use of the open source software.", "IBM said it has taken the step in response to growing customer demand for the open source software.", "In 2004, IBM reported double-digit growth in the number of customers using Linux to help employees work together more closely.", "The money will be used to support this push towards greater collaboration and add Linux-based elements to IBM's Workplace software.", "One of the main focuses of the initiative will be to make it easier for users to use Linux-based desktop computers and mobile devices with IBM's Workplace software.", "IBM has been one of the biggest advocates of the open source way of working, investing $300 million in a three-year Linux program and producing Linux versions of many of its programs."], "deepseek-r1:1.5b": ["IBM is investing $100 million over three years in expanding its commitment to Linux software, injecting cash into customers' devices from handhelds up to servers.", "This will help attract more users and foster better collaboration.", "IBM saw significant Linux adoption in 2004, leading to initiatives for making Linux software easier to use on various devices and systems.", "Additionally, workplace tools like Workplace now utilize Linux.", "IBM has been a strong advocate for open-source software since 2001, offering $300 million in a three-year program.", "They aim to boost their Linux usage across all tech devices and systems."], "tinyllama:1.1b": ["IBM invests $100m (£52m) over the next three years in its commitment to Linux software, with the goal of supporting and promoting the open source movement.", "The company believes that the more customers use Linux for work, the greater collaboration and the wider variety of devices can be used in a corporate setting.", "In response to customer demand, IBM will increase its investment in Linux initiatives, such as adding Linux-based elements to its Workplace software.", "This focuses on making it easier to access desktop computers and mobile devices with Workplace, and even earlier efforts to create Linux versions of popular applications.", "IBM's $300m investment in a three-year program to promote the open source movement is one of the largest to date in the tech industry.", "The company has produced Linux versions of many of its programs, including those used for workplace software and other critical software such as Java."], "tinydolphin:1.1b": [" IBM is making a significant investment in promoting the use of Linux, their flagship open-source operating system, by funding initiatives aimed at enhancing its integration with various devices and applications.", "This move follows increased demand from customers to adopt Linux across a wider range of industries and use cases.", "IBM's decision reflects its commitment to supporting the continued growth of this technology, which has seen double-digit increases in customer adoption over the past four years.", "The company is putting $100 million (£52 million) towards this initiative between 2017 and 2020.", "This cash injection will be allocated to several key areas, including enhancing collaboration capabilities within Workplace, which is IBM's suite of applications and tools that employees use to work together in a variety of scenarios.", "One of the most significant initiatives will be to integrate Linux-based desktops and mobile devices with Workplace.", "This will make it easier for employees to access and use the software regardless of what device they are using.", "IBM has long been an advocate of the open source approach to working, having put $300 million into a three-year Linux program in 2001.", "This funding has produced numerous Linux versions of many of its core programs.", "In addition to this investment in user integration, IBM is also focusing on promoting innovation within the open source software movement.", "It will be supporting development initiatives aimed at improving the reliability and functionality of Linux-based devices and applications.", "By enhancing these areas of focus, IBM aims to create even more value for its customers and drive innovation in the technology industry."], "phi:2.7b": [" IBM will invest $100 million over three years in a push for greater use of Linux software, which is an open source option that allows users to modify its core components.", "The investment will help customers integrate Linux into their devices from handheld computers to powerful servers, making it easier to collaborate using Workplace software.", "This initiative follows IBM's support for the open source movement and its investment in the technology since 2001."], "orca-mini:3b": [" IBM invests $100 million over three years to promote Linux use across devices, including desktop and mobile computers and servers.", "The initiative aims to improve collaboration among workers using Workplace software, which supports core business applications on any device connected to a corporate network.", "Linux-based elements are added to Workplace to make it easier for employees to use.", "IBM has long been an advocate of open source software and in 2001 invested $300 million in a three-year Linux program."], "hermes3:3b": ["IBM spends $100m on Linux support and development."], "stablelm-zephyr:3b": ["IBM will invest $100m over three years to enhance its commitment to Linux software, with plans to help customers use the operating system on various devices, including handheld computers, phones, and servers.", "The funding will support technical, research, and marketing initiatives aimed at boosting Linux adoption, in response to increasing customer demand for open source software.", "This initiative aims to increase collaboration by integrating Linux-based elements into IBM's Workplace software, making it easier to use Linux-based desktop and mobile devices with the software suite.", "As an advocate of the open source way of working, IBM has previously invested $300m in a three-year Linux program and produced Linux versions of several of its programs."], "chatgpt-4o-latest": ["IBM is investing $100 million over three years to expand its commitment to Linux, funding technical, research, and marketing initiatives to support its customers in using Linux across various devices, from handhelds to servers.", "This move responds to growing customer demand and aims to enhance collaboration by integrating Linux-based elements into IBM's Workplace software, which provides access to business applications across different devices.", "A key focus is improving Linux-based desktop and mobile device compatibility with Workplace.", "IBM has been a strong advocate of open source, previously investing $300 million in Linux and developing Linux versions of its software.", "The open source model promotes innovation by allowing developers to modify and improve software through open scrutiny."], "stablelm2:1.6b": ["IBM is investing $£€ over three years in its commitment to Linux, boosting customer demand for open-source software.", "The funds will fund various initiatives to increase Linux usage, including technical, research, and marketing efforts.", "As a result, IBM has seen double-digit growth in Linux customers using the software to collaborate more closely.", "To integrate Linux-based desktops and mobile devices into Workplace software, IBM plans to make it easier for users to access these tools regardless of their device type.", "Open-source principles based on freedom, innovation, and scrutiny underpin both IBM's commitment to Linux and its long-standing support for open-source software."], "granite3.1-dense:2b": ["IBM is investing $100 million over three years to expand its support for Linux, an open-source software.", "This funding will fund technical, research, and marketing efforts to enhance Linux's usage across various devices, from handheld computers to servers.", "The company aims to bolster collaboration tools like IBM Workplace by integrating more Linux-based desktop and mobile features.", "IBM initiated this commitment in 2004 due to growing customer demand for Linux, reporting double-digit growth in Linux adoption for improved teamwork.", "This investment follows IBM's previous $300 million three-year Linux program launched in 2001, during which it developed numerous Linux versions of its software.", "The open-source philosophy underlying Linux encourages developers to modify core software components, believing that increased scrutiny leads to superior software and fosters innovation."]}