{"raw_text": "Hotspot users gain free net calls\n \n People using wireless net hotspots will soon be able to make free phone calls as well as surf the net.\n \n Wireless provider Broadreach and net telephony firm Skype are rolling out a service at 350 hotspots around the UK this week. Users will need a Skype account - downloadable for free - and they will then be able to make net calls via wi-fi without paying for net access. Skype allows people to make free PC-based calls to other Skype users.\n \n Users of the system can also make calls to landlines and mobiles for a fee. The system is gaining in popularity and now has 28 million users around the world. Its paid service - dubbed Skype Out - has so far attracted 940,000 users. It plans to add more paid services with forthcoming launches of video conferencing, voice mail and Skype In, a service which would allow users to receive phone calls from landlines and mobiles. London-based software developer Connectotel has unveiled software that will expand the SMS functions of Skype, allowing users to send text messages to mobile phones from the service. Broadreach Networks has around two million users and hotspots in places such as Virgin Megastores, the Travelodge chain of hotels and all London's major rail terminals. The company is due to launch wi-fi on Virgin Trains later in the year. \"Skype's success at spreading the world about internet telephony is well-known and we are delighted to be offering free access to Skype users in our hotspots,\" commented Broadreach chief executive Magnus McEwen-King.\n", "llama3.2:1b": ["People using wireless net hotspots will gain free phone calls and net surfing through a service provided by Broadreach and Skype at 350 UK hotspots this week, with the need for a paid Skype account to make additional calls.", "The system has around 28 million users worldwide and plans to expand its offerings with paid services including video conferencing, voice mail, and voice calls from landlines and mobiles in upcoming launches."], "llama3.2:3b": ["Wireless provider Broadreach and net telephony firm Skype are rolling out a service that allows hotspot users to make free phone calls via wi-fi, using their existing Skype accounts, with options for paid landline and mobile calls."], "gemma2:2b": ["Wireless providers, Broadreach and Skype, are launching a service offering free phone calls through wi-fi hotspots for Skype users.", "The service will expand to 350 UK hotspots this week, requiring a free Skype account and allowing access to net calls without additional charges.", "Users can also make calls to landlines and mobiles for a fee.", "The system has over 28 million users globally and is expanding with new services like video conferencing and voice mail."], "qwen2.5:0.5b": ["Hotspot users can make free phone calls and use Skype as a web browser by downloading an account and making net calls via wi-fi without paying for internet access.", "Users can also contact landlines or mobiles for a fee, but additional services such as video conferencing and SMS functions are planned soon.", "Skype is currently the world's largest free-to-use internet telephony service, with over two million users in 28 countries."], "qwen2.5:1.5b": ["Wireless hotspot providers and net telephony firm will soon allow users to make free phone calls using Wi-Fi, similar to making PC-based calls on the Skype platform.", "The service is available at 350 UK hotspots with a paid-for Skype account required for additional features like landline and mobile calls as well as video conferencing and voice mail services.", "The system has gained widespread popularity with over 28 million users worldwide, including Broadreach's two million users in London locations like Virgin Megastores, Travelodge hotels, and major rail terminals."], "qwen2.5:3b": ["Hotspot users will soon have the ability to make free phone calls along with browsing the net through wireless networks, thanks to a service by Broadreach and Skype rolled out at 350 UK hotspots this week.", "Users require a Skype account available for free download, enabling them to place free voice calls to other Skype users via wi-fi.", "They can also pay to make calls to landlines and mobiles.", "With 28 million worldwide users and 940,000 paying users of Skype Out, the service is expected to include paid features like video conferencing, voice mail, and a reception system for incoming calls.", "Connectotel's software expands SMS capabilities on the platform, while Broadreach Networks will launch wi-fi on Virgin Trains later this year.", "Magnus McEwen-King, CEO of Broadreach, highlights their offering free Skype access at hotspots to capitalize on Skype’s internet telephony success."], "opencoder:1.5b": ["Hotspot users gain free network calls \n\nPeople using wireless net hotspots will soon be able to make free phone calls as well as surf the net.", "Users of the system can also make calls to landlines and mobiles for a fee.", "The system is gaining in popularity and now has 28 million users around the world.", "Its paid service - dubbed Skype Out - has so far attracted 940,000 users.", "London-based software developer Connectotel has unveiled software that will expand the SMS functions of Skype, allowing users to send text messages to mobile phones from the service.", "Broadreach Networks has around two million users and hotspots in places such as Virgin Megastores, the Travelodge chain of hotels and all London's major rail terminals.", "The company is due to launch wi-fi on Virgin Trains later in the year."], "smollm:1.7b": ["The text summary should preserve key ideas and details, including:\n\n1.", "The main idea: Hotspot users will gain free net calls by using wireless net hotspots.", "2.", "Key points: Users can make free net calls to other Skype users via wi-fi without paying for net access.", "3.", "Additional information: Skype allows people to make free PC-based calls to other Skype users, and there are 28 million users around the world.", "The service is gaining popularity and has already attracted 940,000 users.", "It plans to add more paid services with forthcoming launches of video conferencing, voice mail, and Skype In.", "4.", "Key details: Users can also make calls to landlines and mobiles for a fee.", "The system is gaining in popularity and now has 28 million users around the world.", "Its paid service - dubbed Skype Out - has so far attracted 940,000 users.", "It plans to add more paid services with forthcoming launches of video conferencing, voice mail, and Skype In.", "5.", "The main idea: Connectotel is offering software that will expand the SMS functions of Skype, allowing users to send text messages to mobile phones from the service."], "deepseek-r1:1.5b": ["Hotspot users will gain free phone calls and internet access at 350 locations around the UK this week.", "Users need a free Skype account to make net calls via Wi-Fi without additional costs.", "They can also pay for landline and mobile calls, with the service growing in popularity globally.", "The service has attracted 940,000 paid users and is set to expand features like video conferencing, voice mail, and a 'skype In' service for landlines.", "Broadreach, with 2 million hotspots, is working on Wi-Fi integration with Virgin Trains.", "Magnus McEwen-King is pleased about the free trial offer for his users."], "tinyllama:1.1b": ["Following the launch of a new wireless net hotspot network, Hotspot users can now also enjoy free phone calls on their connected devices.", "The wireless provider, Broadreach, has announced the launch of a paid service called Skype Out, offering users the option to use PC-based calls and mobile/landline services for a fee.", "This service is gaining in popularity with over 28 million users worldwide, making it the third most popular network after Skype and Viber.", "Broadreach's new video conferencing service Skype In will also be added to the service later this year, expanding its range of SM services.", "A software expansion by Connectoteq is set to make Skype even more convenient for mobile phone users, allowing them to send text messages to their mobile phones from within the wireless hotspot network.", "The company plans to roll out video conferencing, voice mail, and Skype In later this year.", "Broadreach Networks has 2 million users and has recently announced that Virgin Megastores and train stations will be offering Wi-Fi access as part of its expansion plans."], "tinydolphin:1.1b": [" Hotspot users gain free net calls as part of a new service from wireless provider Broadreach and telephony company Skype, which aims to expand their use of wireless internet technology.", "Currently, around two million hotspot users across the UK are eligible to make free phone calls to other Skype users via Wi-Fi without needing to purchase access to landlines or mobile phones.", "The service is popular and has attracted more than 940,000 users, with plans for future growth through video conferencing, voice mail, and Skype In services.", "London-based Connectotel will expand the SMS capabilities of Skype, allowing users to send text messages to mobile phones from the service.", "Broadreach Networks is planning a range of expansion projects into other parts of the UK and in countries such as Germany, Spain, and Italy, where Virgin Megastores, Travelodge hotels, and other London landmarks have Wi-Fi hotspots.", "The company anticipates that Skype's success at introducing the internet telephony concept to users is well-known, and they are eager to offer free access to users in their hotspots."], "phi:2.7b": [" The text discusses a new service offered by wireless provider Broadreach and net telephony firm Skype.", "Users of their wi-fi hotspots will be able to make free phone calls as well as surf the internet.", "They need to have a Skype account, which is free to download.", "The system allows people to make free PC-based calls to other Skype users, but also enables them to make calls to landlines and mobile phones for a fee.", "With 28 million users worldwide, the service has gained popularity, with Skype Out already having attracted nearly one million users.", "Broadreach plans to add more paid services, such as video conferencing, voice mail, and Skype In, which allows users to receive phone calls from landlines and mobiles.", "The company's success is well-known and they are excited to be offering free access to their service on a network of hotspots."], "orca-mini:3b": [" Wireless providers Broadreach and Skype are launching a service that allows users of their UK hotspots to make free phone calls via wi-fi.", "Users will need a Skype account, downloadable for free, and can then make net calls to other Skype users.", "Skype also has 28 million users around the world, with paid services such as video conferencing and voice mail on the way.", "A software developer Connectotel has created software that expands the SMS functions of Skype, allowing users to send text messages to mobile phones from the service.", "The company's UK hotspots include Virgin Megastores, Travelodge hotels, and London rail terminals.", "Later this year, wi-fi will be available on Virgin Trains."], "hermes3:3b": ["Free net calls via Wi-Fi for Hotspot users; Broadreach and Skype launching service at 350 UK hotspots, allowing net calls without additional cost."], "stablelm-zephyr:3b": ["Wireless provider Broadreach and net telephony firm Skype are launching a service at 350 hotspots in the UK, allowing wireless net hotspot users to make free phone calls without paying for net access.", "Users need a free Skype account, and the system also allows making landline and mobile calls for a fee.", "The service expands Skype's SMS capabilities through software from London-based Connectotel.", "Broadreach has partnerships with Virgin Megastores, Travelodge hotels, and London rail terminals, and plans to launch wi-fi on Virgin Trains later this year."], "chatgpt-4o-latest": ["Hotspot users in the UK will soon be able to make free internet calls via Wi-Fi, thanks to a partnership between wireless provider Broadreach and net telephony firm Skype.", "The service, available at 350 hotspots, requires a free Skype account and allows users to make free PC-based calls to other Skype users without paying for internet access.", "Users can also call landlines and mobiles for a fee through Skype Out, which has 940,000 users.", "Skype plans to introduce additional paid services, including video conferencing, voicemail, and Skype In, which enables receiving calls from landlines and mobiles.", "Connectotel has developed software to expand Skype’s SMS functions, allowing text messaging to mobile phones.", "Broadreach, with two million users and hotspots in locations like Virgin Megastores and major rail terminals, plans to launch Wi-Fi on Virgin Trains later in the year.", "Broadreach CEO Magnus McEwen-King praised Skype’s role in promoting internet telephony."], "stablelm2:1.6b": ["Wireless provider Broadreach and net telephony firm Skype are partnering to offer free net calls via Wi-Fi at UK hotspot locations starting this week.", "Users with a Skype account can make net calls, as well as PC-based calls to other Skype users for a fee.", "The system attracts millions of users worldwide, with over 1 million paid subscribers.", "They plan to add more paid services like video conferencing and voice mail.", "London-based software developer Connectotel has developed software that expands SMS functions to Skype, allowing users to send text messages to mobile phones from the service.", "Broadreach Networks serves locations such as Virgin Megastores, Travelodge chain of hotels, and major rail terminals with around two million Wi-Fi users."], "granite3.1-dense:2b": ["Wireless provider Broadreach, in collaboration with net telephony firm Skype, will soon enable free internet calls for users of its 350 UK hotspots.", "To access this service, users must have a Skype account, which can be downloaded for free.", "Skype currently supports free PC-to-PC calling, and the new initiative extends this capability to wireless net hotspots via Wi-Fi.", "Additionally, users can make calls to landlines and mobile phones at a fee through Skype Out, with 940,000 paid subscribers worldwide.", "The partnership aims to introduce more paid services like video conferencing, voice mail, and Skype In (a feature allowing call reception from landlines and mobiles).", "London-based software developer Connectotel has developed enhanced SMS functionality for Skype users within these hotspots.", "Broadreach Networks manages approximately two million users across various locations, including Virgin Megastores, Travelodge hotels, and major London rail terminals.", "The company plans to extend Wi-Fi coverage to Virgin Trains in the future.", "Broadreach's chief executive expressed enthusiasm for the partnership, highlighting Skype's global influence in promoting internet telephony."]}