{"raw_text": "Domain system opens door to scams\n \n A system to make it easier to create website addresses using alphabets like Cyrillic could open a back door for scammers, a trade body has warned.\n \n The Internationalised Domain Names system has been a work in progress for years and has recently been approved by the Internet Engineering Task Force. But the UK Internet Forum (UKIF) is concerned that the system will let scammers create fake sites more easily. The problem lies in the computer codes used to represent language.\n \n Registering names that look like that of legitimate companies but lead users to fake sites designed to steal passwords and credit card details could become a whole lot easier for determined scammers, says Stephen Dyer, director of UKIF. Domain names are the \"real language\" addresses of websites, rather than their internet protocol address, which is a series of numbers. They are used so people can more easily navigate the web. So-called ASCII codes are used to represent European languages but for other languages a hybrid of a system called Unicode is used. So, for example, website PayPal could now be coded using a mixture of the Latin alphabet and the Russian alphabet. The resulting domain as displayed to the users would look identical to the real site as a Russian 'a' look just like an English 'a'. But the computer code would be different, and the site it would lead users to could be a fake. This is more than just a theory. A fake Paypal.com has already been registered with net domain giant Verisign by someone who has followed the debate around the Internationalised Domain Name (IDN) system, said Mr Dyer. As the idea was to prove a point rather than be malicious the fake domain has now been handed back to Paypal but it sets a worrying precedent, Mr Dyer said. \"Although the IDN problem is well known in technical circles, the commercial world is totally unaware how easily their websites can be faked,\" said Mr Dyer.\n \n \"It is important to alert users that there is a new and invisible and almost undetectable way of diverting them to what looks like a perfectly genuine site,\" he added. There are solutions. For instance, browsers could spot domains that use mixed characters and display them in different colours as a warning to users. Mr Dyer acknowledged that it would be a huge undertaking to update all the world's browsers. Another solution, to introduce IDN-disabled browsers could be a case of \"throwing out the baby with the bath water,\" he said. CENTR, the Council of European National Top Level Domain Registries, agrees. \"A rush to introduce IDN-disabled browsers into the marketplace is an overly-zealous step that will harm public confidence in IDNs - a technology that is desperately needed in the non-English speaking world,\" the organisation said in a statement.\n", "llama3.2:1b": ["The Internationalised Domain Names (IDN) system allows for website addresses with alphabets like Cyrillic to be created, which could potentially open a back door for scammers to create fake sites.", "The UK Internet Forum warns that this could make it easier for scammers to steal passwords and credit card details.", "IDN-coded websites may look identical on the surface but have different computer codes that users cannot detect.", "The issue is not just theoretical; a fake PayPal.com domain has been registered, which was previously created as a proof of concept.", "Users should be warned about this new technology and solutions can include displaying mixed characters in different colors or introducing IDN-disabled browsers."], "llama3.2:3b": ["The Internationalised Domain Names system could make it easier for scammers to create fake websites by using Unicode codes, which can represent languages like Cyrillic.", "This could lead to registering names that look like legitimate companies but are actually fake sites designed to steal passwords and credit card details.", "A fake PayPal domain has already been registered, raising concerns among experts, who suggest solutions such as displaying mixed-character domains in different colors or introducing IDN-disabled browsers."], "gemma2:2b": ["The Internationalised Domain Names system (IDN), which allows website addresses to use alphabets like Cyrillic, could be exploited by scammers to create fake websites disguised as legitimate ones.", "These fake sites can steal users' credentials and credit card information.", "A recent example of this is a registered domain resembling PayPal.com that was subsequently handed back to the company but serves as a worrying precedent.", "Experts suggest solutions include browser warnings for suspicious domains or introducing IDN-disabled browsers, though these options face challenges in implementation."], "qwen2.5:0.5b": ["Domain name confusion can open up scams, according to a trade body warning.", "A recently approved system for international domain names could make it easier for scammers to create fake sites.", "Cybersecurity experts warn that computer codes used for languages like Cyrillic are also vulnerable to attacks from scammers.", "An example is PayPal being registered as 'PayPal.com' with Verisign, which has already been backdated by someone who follows the discussion around IDN system.", "Users should be aware of a new and invisible way websites can be faked, highlighting the importance of browsers displaying mixed characters differently."], "qwen2.5:1.5b": ["A domain system allowing Cyrillic and other non-Latin character encoding could make it easier for scammers to create fake websites, potentially leading to password theft and credit card fraud.", "This issue has been raised by UK Internet Forum (UKIF), which suggests updating browsers or introducing IDN-disabled browsers might be solutions but warns against hastily implementing such changes as they could harm public confidence in the technology."], "qwen2.5:3b": ["Domain system using alphabets like Cyrillic could allow scammers to create fake sites, leading users to steal passwords and credit card details.", "The UK Internet Forum warns of potential problems with Internationalised Domain Names (IDNs), as they use Unicode for non-Latin languages, potentially creating misleading domain names.", "This has already happened with a fake PayPal.com registered by someone following the debate about IDNs.", "Solutions include warning browsers or disabling IDNs entirely, though both have drawbacks."], "opencoder:1.5b": ["The system to make it easier to create website addresses using alphabets like Cyrillic opens a back door for scammers, a trade body has warned.", "The problem lies in the computer codes used to represent language.", "The UK Internet Forum (UKIF) is concerned that the system will let scammers create fake sites more easily.", "The idea lies in proving a point rather than being malicious."], "smollm:1.7b": ["The summary should be:\n\nDomain system opens door to scams\nA system to make it easier to create website addresses using alphabets like Cyrillic could open a back door for scammers, a trade body has warned.", "The Internationalised Domain Names (IDN) system has been approved by the Internet Engineering Task Force (IETF), but the UK Internet Forum (UKIF) is concerned that the system will let scammers create fake sites more easily.", "The problem lies in the computer codes used to represent language, and for other languages a hybrid of a system called Unicode is used.", "So-called ASCII codes are used to represent European languages but for other languages a hybrid of a system called Unicode is used.", "For example, website PayPal could now be coded using a mixture of the Latin alphabet and the Russian alphabet.", "The resulting domain as displayed to users would look identical to the real site as a Russian 'a' look just like an English 'a'.", "But the computer code would be different, and the site it would lead users to could be a fake.", "This is more than just a theory.", "A fake PayPal.com has already been registered with Verisign by someone who has followed the debate around the Internationalised Domain Name (IDN) system, said Mr Dyer.", "The IDN problem is well known in technical circles but the commercial world is totally unaware how easily their websites can be faked, said Mr Dyer.", "\"It is important to alert users that there is a new and invisible and almost undetectable way of diverting them to what looks like a perfectly genuine site,\" he added.", "There are solutions.", "For instance, browsers could spot domains that use mixed characters and display them in different colours as a warning to users.", "Mr Dyer acknowledged that it would be a huge undertaking to update all the world's browsers.", "Another solution, to introduce IDN-disabled browsers into the marketplace is an overly-zealous step that will harm public confidence in IDNs - a technology that is desperately needed in the non-English speaking world, the UK Internet Forum (UKIF) said in a statement."], "deepseek-r1:1.5b": ["The Internationalised Domain Names (IDN) system could bypass detection of scammers, allowing them to create fake websites using code mixtures like Russian or Latin alphabets instead of being flagged as malicious.", "Real domains remain readable but users might be directed to false sites.", "Fake domains already exist with Verisign, creating a security hazard and confusion.", "This suggests moving away from IDN risks by avoiding browser detection mechanisms.", "The council recommends not rushing into changes to prevent further misuse."], "tinyllama:1.1b": ["The Internationalised Domain Name (IDN) system has been criticized by a trade body for being vulnerable to scammers' attempts to create fake sites using mixed language characters, which would look like real websites but have a hybrid system of Latin and Russian alphabets.", "This has led the UK Internet Forum to warn about the backdoor effect of IDNs on the workings of the Internet, as well as their security risks.", "The proposed solution is for browsers to display warning messages to users, but CENTR, a council of European national top level domain registries, criticizes introducing IDN-disabled browsers into the marketplace."], "tinydolphin:1.1b": [" The Internationalized Domain Name (IDN) system aims to make websites more accessible for people with different languages and characters.", "However, some experts argue that it could also be easier for scammers to create fake sites by using code that looks similar to legitimate ones.", "UK Internet Forum (UKIF) is concerned that the IDN system may let users navigate to fake sites with ease.", "They suggest that browsers should warn users about mixed-character domains and display them in different colors, similar to how certain websites show their names in different languages on a mobile app."], "phi:2.7b": [" The Internationalised Domain Names system (IDN) could make it easier for scammers to create fake websites, which can steal passwords and credit card details.", "This is because different languages use different computer codes, so a domain name that looks like PayPal.com could lead users to a fake site disguised as real.", "A similar fake Paypal has already been created by someone following the IDN debate.", "Although there are solutions such as using mixed-language colors in browsers or creating IDN-disabled browsers, they can also harm public confidence in IDNs.", "CENTR agrees that a rush to introduce IDN-disabled browsers is an overly-zealous step."], "orca-mini:3b": [" A system that allows website addresses to be made using alphabets like Cyrillic could potentially open a back door for scammers, a trade body has warned.", "The Internationalised Domain Names system has been approved by the Internet Engineering Task Force, but there are concerns that it could let scammers create fake sites more easily.", "The problem lies in the computer codes used to represent language.", "Registering names that look like those of legitimate companies but lead users to fake sites designed to steal passwords and credit card details could become easier for determined scammers.", "The resulting domain as displayed to the users would look identical to the real site, but the computer code would be different.", "This is more than just a theory - a fake PayPal website has been registered with net domain giant Verisign by someone who has followed the debate around the IDN system.", "It sets a worrying precedent, said Mr Dyer.", "Although the IDN problem is well known in technical circles, the commercial world is unaware of how easily their websites can be faked.", "There are solutions, such as browser warnings, but it would be a huge undertaking to update all the world's browsers.", "Another solution could be IDN-disabled browsers, which would be a case of \"throwing out the baby with the bath water,\" said Mr Dyer.", "CENTR agrees that a rush to introduce IDN-disabled browsers into the marketplace is an overly"], "hermes3:3b": ["IDN system risky for scams, warns trade body; potential for fake domains using mixed languages codes, easier password theft and credit card details extraction."], "stablelm-zephyr:3b": ["The UK Internet Forum (UKIF) has warned that the Internationalised Domain Names system, which aims to make it easier to create website addresses using alphabets like Cyrillic, could open a back door for scammers.", "The problem lies in the computer codes used to represent language, allowing scammers to create fake sites more easily.", "A fake Paypal.com was already registered with net domain giant Verisign by someone who followed the debate around the Internationalised Domain Name (IDN) system.", "Solutions include updating browsers or introducing IDN-disabled browsers, which could harm public confidence in IDNs according to CENTR, the Council of European National Top Level Domain Registries."], "chatgpt-4o-latest": ["A new system allowing website addresses in non-Latin alphabets, recently approved by the Internet Engineering Task Force, could make it easier for scammers to create fake sites, warns the UK Internet Forum (UKIF).", "The issue arises from the use of Unicode, which allows domain names to appear identical to legitimate sites while leading users to fraudulent ones.", "A fake PayPal site has already been registered to demonstrate this risk.", "UKIF director Stephen Dyer stresses that businesses are largely unaware of this vulnerability.", "Potential solutions include browser updates to detect mixed-character domains, but implementing such measures would be challenging.", "The Council of European National Top Level Domain Registries (CENTR) opposes disabling IDN support, arguing it would undermine a valuable tool for non-English speakers."], "stablelm2:1.6b": ["The Internationalised Domain Names system, which allows for easier creation of website addresses using Cyrillic alphabets, could potentially allow scammers to create fake sites easily.", "This arises from concerns over how computer codes are used to represent language across various European languages.", "The IDN system is designed to make this easier by allowing mixed characters in domain names.", "However, experts warn that scammers may use this to register fake domains leading users to phishing sites designed to steal personal information.", "A potential solution involves browser settings to detect mixed characters and display warning messages to users.", "Critics argue against introducing IDN-disabled browsers as such a move would be overly-zealous and could harm public confidence in IDNs, which are crucial in the non-English speaking world."], "granite3.1-dense:2b": ["The Internationalised Domain Names (IDN) system, recently approved by the Internet Engineering Task Force, could facilitate scamming due to its ability to represent various languages using computer codes like Unicode.", "This feature allows scammers to create domain names that mimic legitimate sites (e.g., PayPal) but direct users to fraudulent pages designed for stealing sensitive information.", "A fake PayPal.com was already registered, demonstrating the potential vulnerability.", "Despite widespread awareness of this issue in technical circles, the commercial world remains oblivious.", "Solutions include browser warnings for mixed-character domains or introducing IDN-disabled browsers, though these would be costly and potentially detrimental to user confidence in a technology crucial for non-English speakers.", "The Council of European National Top Level Domain Registries warns against rushing into such measures, emphasizing the need to maintain public trust in IDNs."]}