{"raw_text": "'No re-draft' for EU patent law\n \n A proposed European law on software patents will not be re-drafted by the European Commission (EC) despite requests by MEPs.\n \n The law is proving controversial and has been in limbo for a year. Some major tech firms say it is needed to protect inventions, while others fear it will hurt smaller tech firms. The EC says the Council of Ministers will adopt a draft version that was agreed upon last May but said it would review \"all aspects of the directive\". The directive is intended to offer patent protection to inventions that use software to achieve their effect, in other words, \"computer implemented invention\".\n \n In a letter, EC President Jos&#233; Manuel Barroso told the President of the European Parliament, Josep Borrell, that the Commission \"did not intend to refer a new proposal to the Parliament and the Council (of ministers)\" as it had supported the agreement reached by ministers in May 2004.\n \n If the European Council agrees on the draft directive it will then return for a second reading at the European Parliament. But that will not guarantee that the directive will become law - instead it will probably mean further delays and controversy over the directive. Most EU legislation now needs the approval of both parliament and the Council of Ministers before it becomes law. French Green MEP Alain Lipietz warned two weeks ago that if the Commission ignored the Parliament's request it would be an \"insult\" to the assembly. He said that the parliament would then reject the Council's version of the legislation as part of the final or conciliation stage of the decision procedure. In the US, the patenting of computer programs and internet business methods is permitted.\n \n This means that the US-based Amazon.com holds a patent for its \"one-click shopping\" service, for example. Critics are concerned that the directive could lead to a similar model happening in Europe. This, they fear, could hurt small software developers because they do not have the legal and financial might of larger companies if they had to fight patent legal action in court. Supporters say current laws are inefficient and it would serve to even up a playing field without bringing EU laws in line with the US.\n", "llama3.2:1b": ["A proposed European law on software patents will not be re-drafted by the European Commission (EC) despite requests by MEPs due to concerns from major tech firms about potential harm to smaller companies, and a letter from EC President Jos&#233; Manuel Barroso stating that the directive was agreed upon last May but would be reviewed."], "llama3.2:3b": ["European Commission will not re-draft proposed software patent law, despite MEP requests, as agreed upon last May by Council of Ministers, draft will return for second reading at European Parliament but may lead to further delays and controversy."], "gemma2:2b": ["The European Commission will not re-draft its proposed software patent directive.", "The directive, intended to grant patent protection for computer-implemented inventions, has been controversial and stalled for over a year.", "Despite requests from Members of Parliament (MEPs), the Commission intends to adopt the May 2004 agreed draft and will proceed with a second reading in parliament before it becomes law.", "This could lead to further delays and controversy if the Council of Ministers does not agree on the proposed version of the directive.", "Some MEPs believe that ignoring the parliament's request is an \"insult\" and may result in rejection, while others hope the directive will create a more balanced playing field for software developers in Europe."], "qwen2.5:0.5b": ["Key ideas and details from the text:\n\n- EU patent law proposal will not be re-drafted by European Commission despite requests from MEPs.", "- Proposed law has been on hold for a year due to controversy.", "- Some major tech firms support the directive, while others fear it may hurt smaller firms.", "- EC President Manolo Benito told European Parliament President Josep Borrell that he \"did not intend to refer a new proposal to the Parliament and the Council (of ministers)\" as they had already supported the May 2004 agreement.", "- If the European Council agrees, the directive will then be returned for further scrutiny at the European Parliament.", "However, it may lead to delays or controversies rather than legal acceptance.", "- This means that Amazon.com has a patent on its \"one-click shopping\" service, which critics fear could impact EU software developers due to potential patent litigation in court.", "Summary:\n\nThe European Union is considering revising its patent law proposal after the EC's May 2004 directive was agreed upon.", "The EC President, Manolo Benito, told parliament leaders that he \"did not intend to refer a new proposal to the Parliament and the Council\" as they had already approved it in 2004.", "If the European Council agrees on the draft version, the law will then return for further scrutiny at the European Parliament.", "However, critics fear this could lead to similar issues in EU software development due to the possibility of patent litigation in court.", "You are an AI assistant, not a staff member of Alibaba Cloud.", "To ensure accuracy and detail, please verify facts or consult reliable sources before sharing any information."], "qwen2.5:1.5b": ["The European Commission (EC) will not re-draft an EU law on software patents despite MEPs' requests, as they plan to review \"all aspects of the directive\" instead.", "This controversial measure has been stalled for a year and faces opposition from tech firms regarding its potential to benefit larger companies while harming smaller ones.", "The directive aims to protect inventions using computer software, but critics fear it could lead to Amazon's \"one-click shopping\" service being patented in Europe.", "MEPs will still have the opportunity to re-examine the legislation through the final or conciliation stage."], "qwen2.5:3b": ["A proposed European law on software patents will not be re-drafted by the EC despite MEPs' requests, making the directive controversial and in limbo for a year.", "Major tech firms support its need for invention protection, while others fear it harms smaller firms.", "The EC says Council of Ministers will adopt a draft version agreed last May but will review all aspects.", "If EU Council agrees, directive returns to Parliament for second reading, likely leading to further delays and controversy.", "Critics worry this could hurt small software developers due to legal and financial disadvantages compared to larger companies in the US where similar laws permit patenting of computer programs and internet business methods.", "Supporters argue current laws are inefficient and suggest bringing European rules in line with US practices."], "opencoder:1.5b": ["The European law on software patents is likely intended to provide protection against computer-implemented inventions, similar to how existing patents protect inventions used in the production of goods or services.", "However, the proposed draft will not be re-drafted by the European Commission (EC) despite requests by MEPs.", "The focus of the draft was initially on a clear-cut commitment from the EU's member states and with support from the European Union's central government, it stands to benefit from significant legislation.", "The directive is likely intended to provide protection for inventions that use software technologies like computers and programming languages, similar to existing patents.", "It aims to reduce patentability risks by preventing other countries from infringing on the invention's technology without having to wait in a queue or pay for an additional patent license.", "However, despite its potential benefits, it would be an exceedingly complex and costly process.", "EC President Jos&#233; Manuel Barroso in a letter recommended that the European Commission \"did not intend to refer a new proposal to the Parliament and the Council of Ministers (of ministers)\" as it had supported the agreed-upon agreement reached by them in May 2004.", "The directive was approved by both the European Union's central government and the European Parliament, but the draft has yet to be formally adopted.", "As such, there are concerns about drafting a \"real\" directive that will be widely accepted and used in practice.", "In contrast, the US-based Amazon.com is likely being licensed for its \"one-click shopping\" service, which may not face significant legal scrutiny or risk if presented with EU law.", "However, critics argue that it would be unfair to expect all businesses of all sizes to abide by the same set of laws and protections unless they have a strong case for doing so.", "In summary, while this draft is not yet in full effect, it presents potential benefits that could save time and money on large-scale patent applications.", "However, it also raises significant legal and regulatory challenges and concerns about its implementation."], "smollm:1.7b": ["The proposed European law on software patents will not be re-drafted by the European Commission (EC) despite requests from MEPs.", "The law is proving controversial and has been in limbo for a year, with some major tech firms saying it is needed to protect inventions, while others fear it will hurt smaller tech firms.", "The EC says the directive is intended to offer patent protection to inventions that use software to achieve their effect, but critics say this could lead to similar models happening in Europe.", "The law is currently being reviewed by the European Parliament and the Council of Ministers, with a final decision expected in the coming weeks.", "If the EC agrees on the draft directive it will then return for a second reading at the European Parliament.", "But if the EC ignores the Parliament's request it would mean further delays and controversy over the directive.", "Most EU legislation now needs the approval of both parliament and the Council of Ministers before it becomes law.", "In the US, the patenting of computer programs and internet business methods is permitted.", "This means that companies like Amazon.com hold patents for their \"one-click shopping\" service, for example.", "Critics are concerned that the directive could lead to a similar model happening in Europe.", "They fear this, they say, would hurt small software developers because they do not have the legal and financial might of larger companies if they had to fight patent legal action in court.", "Supporters of the current laws argue that they are inefficient and it would serve to even up a playing field without bringing EU laws in line with the US."], "deepseek-r1:1.5b": ["The proposed European law on software patents will not be re-drafted by the EC despite requests by MEPs.", "The draft has been in limbo for a year.", "Major tech firms support it to protect inventions, while others fear smaller firms may face competition.", "The ECB expects a second reading at the European Parliament but will likely delay its adoption due to political concerns.", "EU legislation needs Assembly approval before becoming law.", "The US has rules for computer software patents, so this isn't a direct competition.", "Amazon.com holds a patent for \"one-click shopping,\" which critics warn could lead to similar practices in Europe, affecting smaller developers.", "Supporters argue the current system is inefficient and could evenize the market without aligning with the US model."], "tinyllama:1.1b": ["EU law on software patents has been criticized for its proposed re-drawing, despite requests by MEPs, but EC President José Manuel Barroso said that \"the Commission did not intend to refer a new proposal to the Parliament and Council\" as it had supported the agreement reached by ministers in May 2004.", "The European Union is expected to review all aspects of the directive and could face further delay and controversy over whether to pass legislation that allows for patents on computer programs and internet business methods.", "Critics argue that this could harm small software developers, while supporters say it would level a playing field without bringing EU laws in line with the US."], "tinydolphin:1.1b": [" The European Commission has announced that they will not re-draft the EU's patent law for the 'computer implemented invention' directive.", "This decision was made after numerous requests by MEPs, who argue that this new provision offers protection to inventions created using software.", "However, critics have accused the EC of ignoring the Parliament's request and having an agenda of their own.", "If the Council of Ministers agrees on the draft directive it will then return for a second reading at the European Parliament.", "This could lead to further delays in bringing this crucial piece of legislation into effect, potentially causing harm to small software developers or even undermining the US-based Amazon's ability to protect its \"one-click shopping\" service."], "phi:2.7b": [" The European Commission has decided against re-drafting proposed European law on software patents, despite requests by MEPs.", "The law is controversial but was agreed upon by ministers last May.", "The Council of Ministers will adopt a draft version, which the commission says it will review all aspects of the directive.", "If approved, the legislation would require both parliament and the council to give their approval before becoming law."], "orca-mini:3b": [" The European Union's proposed software patents law will not be re-drafted by the European Commission despite requests from MEPs.", "The law is controversial and has been in limbo for a year, with major tech firms supporting it and smaller tech firms fearing harm.", "The EC says it will review all aspects of the directive but does not intend to refer a new proposal to the Parliament and Council of Ministers.", "The European Parliament warned two weeks ago that if the Commission ignored their request, it would be an \"insult\" to the assembly.", "If the Council's version of the legislation is approved by both the Parliament and the EC, it will then return for a second reading at the European Parliament.", "However, this will not guarantee that the directive will become law - instead, it will probably mean further delays and controversy over the directive.", "Most EU legislation requires the approval of both the Parliament and the Council of Ministers before it becomes law.", "French Green MEP Alain Lipietz warned two weeks ago that if the Commission ignored the Parliament's request, it would be an \"insult\" to the assembly.", "He said that the parliament would then reject the Council's version of the legislation as part of the final or conciliation stage of the decision procedure.", "In the US, patenting computer programs and internet business methods is permitted, which critics fear could hurt small software developers.", "However, supporters say current laws are inefficient and it would serve to even up a playing"], "hermes3:3b": ["European Commission not redrafting software patent law; will let Council adopt May's agreed draft despite MEP requests."], "stablelm-zephyr:3b": ["The European Commission will not re-draft a proposed European law on software patents, despite requests from MEPs.", "Controversial, the law has been in limbo for a year, with major tech firms advocating it as necessary to protect inventions and smaller firms fearing potential harm.", "EC President José Manuel Barroso stated that the Council of Ministers will adopt an agreed-upon draft version last May but will review all aspects of the directive.", "If the European Council agrees on the draft directive, it will return for a second reading at the European Parliament; however, this does not guarantee its passage into law.", "Critics are concerned about small software developers being negatively affected by the directive due to their lack of legal and financial might compared to larger companies."], "chatgpt-4o-latest": ["The European Commission (EC) will not re-draft a proposed law on software patents despite requests from MEPs.", "The directive, which has been stalled for a year, aims to protect inventions using software but is controversial, with major tech firms supporting it and smaller firms fearing negative impacts.", "EC President José Manuel Barroso confirmed the Commission's support for the draft agreed upon in May 2004.", "If the European Council approves it, the directive will return to the European Parliament for a second reading, but further delays and controversy are expected.", "Critics worry it could lead to a US-style patent system, disadvantaging small developers, while supporters argue it would improve current laws without fully aligning with US regulations."], "stablelm2:1.6b": ["The European Commission will not re-draft a proposed law on software patents, despite requests by MEPs.", "The directive aims to provide patent protection for inventions using software to achieve their effect, such as computer implemented inventions.", "It has been in limbo for a year and is currently under review.", "If the European Council agrees, the draft directive may proceed through the second reading at the European Parliament but will not guarantee law passage due to EU legislation requiring both parliament and the Council's approval.", "Critics worry about the directive impacting small software developers with weaker legal resources compared to larger companies; supporters argue that current laws are inefficient and this new law would balance the playing field without harmonizing EU laws with US ones."], "granite3.1-dense:2b": ["The European Commission (EC) has decided not to re-draft its proposed software patent law, despite requests from MEPs.", "The controversial directive aims to grant patent protection for computer-implemented inventions.", "This proposal supports major tech firms but is criticized by others who fear it may harm smaller companies.", "Last May's agreed-upon draft will be reviewed by the Council of Ministers, and if approved, will return to the European Parliament for a second reading.", "However, this process is unlikely to expedite the law's enactment due to ongoing EU legislation requirements for parliamentary approval.", "Critics worry that the directive could mimic US patent laws, potentially disadvantaging small software developers against larger companies in legal battles.", "Supporters argue that current regulations are inefficient and the directive would level the playing field without bringing EU laws out of line with the US."]}