{"raw_text": "More movies head to Sony's PSP\n \n Movies Open Water and Saw are among those to be made available for Sony's PSP games console.\n \n Film studio Lions Gate entertainment has announced an initial list of 12 movies that will be on the UMD format used by the handheld. \"The typical buyer of the machine [is] the core demographic to whom our films generally appeal,\" said Steve Beeks, president of Lions Gate. Already available in Japan, the PSP is released in the US on 24 March. Spider-Man 2 on UMD will be given to the first million customers in the US.\n \n The Punisher and House of the Dead along with older titles such as Total Recall and Rambo: First Blood, will be in the UMD format, with disks costing between $20 (£10.40) to $30 (£15.60) for new titles and $10 (£5.20) to $20 for older films.\n \n \"When we first saw the machine and started talking to Sony, we immediately decided it was going to be a winner, both from the gaming perspective and from the perspective of people watching movies on the go,\" Mr Beeks said. The disks, which are smaller than DVDs, only work in Sony's PSP and can hold up to 1.8GB of data. \"We actually believe people who buy the UMD would not have bought it on DVD,\" he said. \"There are people who will want UMD because of the portability. Maybe they're already taking the games with them out of the house, and they're bigger gamers than they are movie watchers.\" Four movies have already been announced for PSP. They are: XXX, Hellboy, Resident Evil: Apocalypse and Once Upon a Time in Mexico.\n", "llama3.2:1b": ["Lions Gate entertainment has announced 12 movies will be available on Sony's UMD format console, including \"The Punisher\", \"House of the Dead\" and older titles such as \"Total Recall\" and \"Rambo: First Blood\".", "The disks are smaller than DVDs and cost between £10.40 to £15.60 for new titles and £5.20 to £20 for older films."], "llama3.2:3b": ["Movies Open Water and Saw will be made available for Sony's PSP games console.", "Lions Gate Entertainment has released an initial list of 12 movies, including The Punisher and House of the Dead, with Spider-Man 2 being given to the first million US customers.", "UMD disks cost between $10-$30 for new titles and $5-$20 for older films."], "gemma2:2b": ["Lions Gate Entertainment is releasing 12 movies on Sony's PSP using UMD format.", "The films include popular titles like The Punisher, House of the Dead, and others, with prices ranging from $10-$30 for new releases, and $5-$20 for older films.", "These UMD discs are smaller than DVDs and offer up to 1.8GB of data, making them portable and appealing to a broader audience.", "The first million US customers will receive Spider-Man 2 on UMD.", "Four additional movies have been announced: XXX, Hellboy, Resident Evil: Apocalypse, and Once Upon a Time in Mexico."], "qwen2.5:0.5b": ["Sony's UMD format will introduce more films to PSP users, including \"More movies head to Sony's PSP\" among those with an initial list of 12 movies available."], "qwen2.5:1.5b": ["The list includes several films such as Open Water and Saw that will be available on Sony's PlayStation Portable (PSP) games console through UMD format disks priced between $10 and $30 for new titles and $5 to $20 for older movies, targeting avid gamers who prefer the portability of their devices."], "qwen2.5:3b": ["More movies like Open Water and Saw will be available on Sony's PSP games console.", "Lions Gate Entertainment has an initial list of 12 films in the UMD format for the handheld, including older titles like Total Recall and Rambo: First Blood at $20 to $30 for new releases and $10 to $20 for older titles.", "The PSP is released in the US on March 24th.", "Mr Beeks of Lions Gate believes it will appeal to both gamers and movie viewers, citing its portability over DVDs.", "Currently four movies have been announced: XXX, Hellboy, Resident Evil: Apocalypse and Once Upon a Time in Mexico."], "opencoder:1.5b": ["The text above is quite comprehensive and presents multiple entities with their respective details.", "Here's a concise summary:\n\n\"More movies head to Sony's PSP: The announcement of the first 12 movies on the UMD format will be announced by the film studio Lions Gate.\"", "This summarizes the key message that more movies are being released on the Sony PSP, and what format these films will take when released."], "smollm:1.7b": ["The summary is concise and to the point, capturing the main ideas of the original text while omitting unnecessary details.", "It provides a brief overview of the movies that will be available on Sony's PSP console, including those that are already available for sale and those that will be released in the US on 24 March.", "The summary does not provide any additional information or explanations about the games or their release dates."], "deepseek-r1:1.5b": ["More movies like *Movie Open Water* and *Saw* will be available on Sony's PSP.", "Lions Gate entertainment has introduced 12 initial UMD movie titles for the machine, with Spider-Man 2 to the first million customers in the US.", "Films such as *Spider-Man 2*, *Total Recall*, and *Rambo: First Blood* are included, priced between $20–$30 and $10–$20 for older titles.", "Four PSP films—*XXX*, *Hellboy*, *Resident Evil: Apocalypse*, and *Once Upon a Time in Mexico*—have already been announced."], "tinyllama:1.1b": ["Sony has announced that it will release four movies on the PlayStation Portable (PSP) gaming console, including popular titles such as \"Total Recall\" and \"House of the Dead.\"", "The PSP is slated for release in the US on March 24, with a price tag ranging from $20 to $30 per movie.", "This format allows for smaller disk sizes than DVDs, making it more portable for gaming and watching movies at the same time.", "Some of the titles available for PSP include \"Spider-Man 2,\" \"Total Recall,\" and \"House of the Dead.\"", "Sony hopes to capitalize on the growing popularity of movie gaming by offering a unique experience to its customers."], "tinydolphin:1.1b": [" The Sony PlayStation Portable (PSP) is set to house a vast library of movies from various film studios.", "It is slated for release on March 24th in the US, with 12 movies already available for purchase.", "In addition to these box office hits like \"Open Water\" and \"Saw,\" the PSP will also offer exclusive content for its buyer - a core demographic that often watches films primarily.", "This decision was made by Lions Gate Entertainment, who plans to release their movie titles in the PSP format at first million sales.", "This new platform is expected to be popular among gamers as well, with the addition of smaller gaming data which can hold up to 1.8GB of content."], "phi:2.7b": [" Sony's PSP will feature 12 movies including More Movies Open Water and Saw, while film studio Lions Gate entertainment has announced that Spider-Man 2 on UMD will be given to the first million customers in the US.", "DVDs cost between $20 -$30 for new titles, with older films costing"], "orca-mini:3b": [" More movies will be made available for Sony's PSP including Open Water, Saw, The Punisher, House of the Dead, Total Recall, and Rambo: First Blood.", "Older titles such as Total Recall and Rambo: First Blood are also expected to be released on UMD format.", "The cost of disks will range from $20 to $30 depending on the title.", "Sony's PSP is released in the US on March 24th, and customers can purchase older titles for $10 to $20.", "The PSP's portability makes it a popular choice for movie watchers who want to take their favorite films with them while on-the-go."], "hermes3:3b": ["PSP movies: Open Water, Saw (by Lions Gate), Spider-Man 2 first US million buyers; older titles like Punisher, House of the Dead on UMD format."], "stablelm-zephyr:3b": ["Lions Gate Entertainment has announced that 12 movies will be available on Sony's PSP games console in the UMD format.", "Movies including Open Water, Saw, The Punisher, House of the Dead, Total Recall, and Rambo: First Blood will be available at prices between $10 and $30.", "The announcement comes after Lions Gate and Sony believed that the combination of gaming and movie experience on the go would be successful.", "Four movies have been announced for the PSP so far: XXX, Hellboy, Resident Evil: Apocalypse, and Once Upon a Time in Mexico."], "chatgpt-4o-latest": ["Lions Gate Entertainment announced 12 movies, including Open Water and Saw, for Sony's PSP in the UMD format.", "The PSP, already available in Japan, launches in the US on March 24, with Spider-Man 2 given to the first million buyers.", "Titles like The Punisher, House of the Dead, Total Recall, and Rambo: First Blood will be available, with prices ranging from $10 to $30.", "Lions Gate sees the PSP as a strong platform for gaming and portable movie watching.", "UMDs, smaller than DVDs, hold up to 1.8GB and work only on PSP.", "Four previously announced PSP movies include XXX, Hellboy, Resident Evil: Apocalypse, and Once Upon a Time in Mexico."], "stablelm2:1.6b": ["Movies like Open Water and Saw will be available for Sony's PSP games console with an initial list of 8 films to be on the UMD format.", "Already released in Japan, the PSP is set to release in the US in March.", "Older titles such..\n  \nCosts for new titles range from $5-$10 (approx £3-£6) and disks cost between $10-20 ($5-8 depending on title).", "Four movies have already been announced for the PSP, including Spider-Man 2 which will be given to the first million customers in the US.", "The UMD format allows for portability, as seen in some users who prefer it over DVD for gaming purposes."], "granite3.1-dense:2b": ["Lions Gate Entertainment has revealed an initial list of 12 films to be released on UMDs (Universal Media Discs), compatible with Sony's PSP handheld game console.", "These movies include Open Water, Saw, Spider-Man 2, The Punisher, House of the Dead, Total Recall, Rambo: First Blood, and older titles like Hellboy, Resident Evil: Apocalypse, and Once Upon a Time in Mexico.", "UMD disks cost between $10 to $30.", "Lions Gate's president, Steve Beeks, expressed confidence in the PSP's potential for both gaming and movie consumption, emphasizing the appeal of its portability to existing PSP users who also enjoy games.", "Four films (XXX, Hellboy, Resident Evil: Apocalypse, and Once Upon a Time in Mexico) were previously announced as part of this collection."]}