{"raw_text": "Nintendo DS makes its Euro debut\n \n Nintendo's DS handheld game console has officially gone on sale in Europe.\n \n Many stores around the UK opened at midnight to let keen gamers get their hands on the device. The two-screen clamshell gadget costs £99 (149 euros) and 15 games are available for it at launch, some featuring well-known characters such as Super Mario and Rayman. The DS spearheads Nintendo's attempt to continue its dominance of the handheld gaming market.\n \n Since going on sale in Japan and the US at the end of 2004, Nintendo has sold almost 4m DS consoles.\n \n Part of this popularity may be due to the fact that the DS can run any of the catalogue of 700 games produced for Nintendo's GameBoy Advance handheld. Games for the DS are expected to cost between £19 and £29. About 130 games for the DS are in development.\n \n As well as having two screens, one of which is controlled by touch, the DS also lets players take on up to 16 other people via wireless. A \"download play\" option means DS owners can take each other on even if only one of them owns a copy of a particular game. Other DS owners can also be sent text messages and drawings. Nintendo is also planning to release a media adapter for the handheld so it can play music and video. Five Virgin megastores and 150 Game shops were expected to open early on Friday morning to let people buy a DS. \"We know that customers want it as soon as it's released - and that means the minute, not the day,\" said Robert Quinn, Game's UK sales director.\n \n But Nintendo will only have sole control of Europe's handheld gaming market for a few weeks because soon Sony is expected to release its PSP console. Although Nintendo is aiming for younger players and the PSP is more for older gamers, it is likely that the two firms will be competing for many of the same customers. Sony's PSP represents a real threat to Nintendo because of the huge number of PlayStation owners around the world and the greater flexibility of the sleek black gadget. The PSP uses small discs for games, can play music and movies without the need for add-ons and also supports short-range wireless play. When it goes on sale the PSP is likely to cost between £130 and £200.\n", "llama3.2:1b": ["Nintendo's DS handheld game console has gone on sale in Europe, with prices starting at £99 (approximately €149) and 15 games available.", "The device can run up to 700 Game Boy Advance games and offers features such as touch control and wireless multiplayer.", "It also allows for text messaging and drawing capabilities among players.", "Nintendo is planning to release a media adapter for the handheld and has set up stores in several UK locations to allow customers to buy the console immediately, with some expecting a limited window of time before Sony's PSP console releases."], "llama3.2:3b": ["Nintendo's DS handheld game console has officially launched in Europe, priced at €149, with 15 launch games available.", "Over 4 million DS consoles have been sold worldwide since its release in Japan and the US in 2004.", "The DS offers two screens, touch control, wireless multiplayer, and a media adapter planned for future release.", "Sony's PSP console is expected to be released soon, likely competing with Nintendo for customers, particularly due to PlayStation owners and its flexibility and features."], "gemma2:2b": ["The Nintendo DS handheld game console has launched in Europe, with many stores opening early to meet demand.", "The device costs £99 and features 15 games at launch, compatible with existing GameBoy Advance games.", "It allows touch screen control and wireless multiplayer via the internet.", "Nintendo aims to maintain its dominance in the portable gaming market, but faces competition from Sony's upcoming PSP console."], "qwen2.5:0.5b": ["Nintendo DS launches in Europe, selling 4m units by end of 2006, has two screens control by touch and allows up to 16 others via wireless download play.", "Game ads for Nintendo's previous handheld games are available for the DS too.", "PlayStation is expected to release before PSP."], "qwen2.5:1.5b": ["Nintendo's DS handheld game console has launched in Europe with UK stores opening at midnight, featuring 15 games including Super Mario and Rayman; it costs £99 (149 euros) and can run up to 700 GameBoy Advance games; Nintendo plans to release a media adapter for music and video on the DS.", "Sony is expected to release its PSP console soon, posing a threat to Nintendo's dominance of Europe's handheld gaming market."], "qwen2.5:3b": ["Nintendo's DS handheld game console has launched in Europe at a price of £99 (€149), allowing gamers to purchase from 15 available games, including popular characters like Mario and Rayman.", "Since its release in Japan and US in late 2004, Nintendo has sold almost 4 million DS consoles.", "The device's popularity may be due to compatibility with over 700 GameBoy Advance titles at a cost of £19-£29 for DS games.", "Approximately 130 DS games are currently under development.", "Five megastores and 150 Game shops opened early on Friday to sell the console.", "Nintendo aims to maintain dominance in the European handheld gaming market, but is expected to face competition from Sony's PlayStation Portable (PSP), which uses smaller discs for games, supports music and video playback without additional equipment, and offers short-range wireless play."], "opencoder:1.5b": ["Nintendo's DS handheld gaming console has officially gone on sale in Europe.", "It offers two-screen clamshell gadgets that range from £99 (149 euros) and a variety of games available for them.", "The platform spearheads Nintendo's effort to redefine its dominance in the handheld gaming market, with several stores opening around the UK at midnight.", "Nintendo has sold almost 4 million DS consoles, marking a significant growth in consumer gaming habits since going on sale in Japan and the US at the end of 2004.", "It is notable that due to the popularity of the GameBoy Advance handheld and its catalogue, many consumers are willing to pay for games that they might not have had otherwise.", "Nintendo plans to expand Europe's handheld gaming market with additional DS consoles by the end of this year, with a focus on upcoming titles such as Super Mario and Rayman.", "The DS also offers players the flexibility to take up to 16 other people via wireless playing with each other or sending them text messages or drawings.", "As for future partnerships, Nintendo could potentially make use of media adapters to play music and video from handheld devices, and may have multiple megastores and stores open at any time to let customers purchase a DS.", "The DS's \"download play\" option allows owners to take on friends even if they don't own one of the games."], "smollm:1.7b": ["The Nintendo DS makes its Euro debut in Europe by launching at several stores across the UK, selling 15 games for the console that can run on both screens.", "The console also allows players to take on up to 16 other people via wireless, which is a unique feature of handheld gaming consoles.", "Nintendo is planning to release a media adapter for the DS so it can play music and video, and five Virgin megastores and 150 Game shops are expected to open early Friday morning to let customers buy the console.", "The console will be available in several countries around the world, including Japan, the US, and Europe, but Nintendo is likely to have a significant advantage over Sony in the handheld gaming market due to its smaller size and more flexible console design."], "deepseek-r1:1.5b": ["The Nintendo DS was officially launched in Europe with a two-screen clamshell gadget priced at £99 (149 euros), featuring 15 games including Super Mario and Rayman.", "It dominated the handheld gaming market by selling over four million units since Japan and the US, featuring touch controls for one screen, wireless compatibility allowing multiple players, downloads that can be sent via text or drawings, and a media adapter.", "Expected to be released on Friday morning at five Virgin megastores and 150 Game Shops.", "Sony's PSP is anticipated to compete with the DS in Europe due to its features like wireless play and smaller packaging."], "tinyllama:1.1b": ["Nintendo DS makes its Euro debut, with many stores in the UK opening at midnight to let eager gamers access the console.", "The company's flagship product, the DS handheld game console, is also expected to appeal to younger players and has already been sold out in Japan and the US.", "In Europe, Sony's PSP represents a serious threat, offering flexibility and convenience beyond what Nintendo offers with its GameBoy Advance-based console.", "The Sony PSP comes at a much higher price point, but will allow for more freedom in gameplay.", "As such, there is no indication that either company will have complete dominance of the handheld gamers market, and players can look forward to fierce competition from both brands."], "tinydolphin:1.1b": [" In 2004, Nintendo introduced a highly anticipated gaming console called the Nintendo DS.", "The device features two screens and allows users to control games with touches of their fingers or styluses.", "Some popular games available for the DS include Super Mario Bros., Rayman, and The Legend of Zelda.", "With a price tag of £99 (149 euros), Nintendo's DS gadget has been a hit in Europe and has been praised for its innovative features and accessibility.", "The device has made the company even more competitive in the handheld gaming market, as Sony is expected to release their own PSP console later this year."], "phi:2.7b": [" Nintendo DS handheld game console has debuted in Europe, selling out quickly with many stores opening at midnight for eager gamers.", "The two-screen clamshell gadget costs £99 and offers a wide selection of games, including popular characters like Super Mario and Rayman.", "It's easy to play with other people via wireless and can also send text messages and drawings.", "There are about 130 games in development and the console is expected to be able to play music and videos.", "Sony is releasing its own handheld game console called PSP soon, which could pose a threat to Nintendo as it appeals to older gamers."], "orca-mini:3b": [" Nintendo's DS handheld game console has gone on sale in Europe at midnight stores across the UK.", "The two-screen gadget costs £99 and 15 games are available at launch, some featuring well-known characters such as Super Mario and Rayman.", "The device can also let players take on up to 16 other people via wireless and has a download play option for multiplayer.", "A media adapter is planned to allow the handheld to play music and video.", "Sony's PSP console is expected to compete with Nintendo in the European handheld gaming market, but both firms are targeting younger players."], "hermes3:3b": [" Nintendo DS launches in Europe, following Japan & US sales; 2-screen handheld console with touch control, up to 16-player wireless gaming, costing £99 (149 euros)."], "stablelm-zephyr:3b": ["Nintendo DS made its European debut, with stores opening at midnight for gamers to purchase the device.", "It costs £99 (149 euros) and launched with 15 games, including Super Mario and Rayman.", "The DS allows players to run any of the 700 GameBoy Advance games and features two screens, one touch-controlled.", "It also enables wireless gameplay with up to 16 other people and includes a \"download play\" option.", "While Nintendo aims for younger players, Sony's PSP targets older gamers and is expected to compete with the DS in the handheld gaming market.", "The PSP uses small discs for games, has music and movie playback capabilities, and supports short-range wireless play.", "It is likely to cost between £130 and £200 when launched."], "chatgpt-4o-latest": ["Nintendo's DS handheld console has launched in Europe, with many UK stores opening at midnight for eager buyers.", "Priced at £99 (149 euros), it debuts with 15 games, including titles featuring Super Mario and Rayman.", "The DS, which has already sold nearly 4 million units in Japan and the US, supports GameBoy Advance games and features dual screens, one with touch control, as well as wireless multiplayer for up to 16 players.", "A media adapter is planned for music and video playback.", "Retailers anticipated high demand, with early openings at Virgin megastores and Game shops.", "However, Nintendo's dominance may be short-lived as Sony prepares to release its PSP, a more versatile device aimed at older gamers, priced between £130 and £200.", "The PSP, with its ability to play music, movies, and games without add-ons, poses a strong challenge to Nintendo's market position."], "stablelm2:1.6b": ["Nintendo's DS handheld game console made its European debut with sales starting in several UK stores at midnight.", "With a retail price of £(€) and games available for launch, it features well-known characters like Super Mario and Rayman.", "The DS continues Nintendo's dominance of the handheld gaming market, offering compatibility with GameBoy Advance catalogued games.", "DS games are expected to cost between £ and £.", "Other games in development include download play options.", "It also allows players to communicate wirelessly and includes a media adapter for music and video playback.", "Sony's PSP is set to compete with Nintendo for customers after its release, aiming for younger audiences but potentially offering more flexibility to older gamers.", "The PSP can use small discs for games, plays music and movies without add-ons, supports short-range wireless play, and may cost £ or €."], "granite3.1-dense:2b": ["Nintendo's DS handheld gaming console has launched in Europe, with 50 UK stores opening at midnight for eager customers.", "Priced at £99 (149 euros), the two-screen device includes popular games like Super Mario and Rayman.", "The DS can run all 700+ GameBoy Advance titles, and Nintendo plans to release about 130 more for it.", "Key features include touch-sensitive screens, multiplayer wireless capabilities, \"download play,\" text messaging, and drawing.", "A media adapter is planned for video and music playback.", "Nintendo's market dominance may be challenged by Sony's PSP, set to release around the same time, priced between £130 and £200, targeting older gamers with its disc-based games, music, movie capabilities, and wireless play."]}