{"raw_text": "Slow start to speedy net services\n \n Faster broadband in the UK is becoming a reality as more internet providers offer super-fast services.\n \n Some lucky Britons can already take advantage of UK Online's 8 megabits per second service, which was launched in November 2004. BT Retail has announced that it will trial the same speed service, with a national rollout by year end. Other service providers are expected to follow suit and a glut of new voice and video services will follow.\n \n \"If the bandwidth is there then ISPs will buy it,\" said Jill Finger, a research director at analyst firm IDC. Others will be watching BT Retail's trials, which is initially for employees and later in the summer for customers, with interest. For BT Retail, she said, the super-fast service could be a way of differentiating it from other players. \"It has been losing market share and this could be one way of gaining some of that back,\" said Ms Finger. Wanadoo is set to trial an 8Mbps service in the summer and also plans to roll out unbundled services - which means it takes over the network from BT - which will provide speeds of up to 15Mbps. There is no timetable for this at the moment. Cable firms ntl and Telewest are also bound to increase bandwidth at some time in the future and, according to an ntl spokesman, are in a better position than BT in the long term. \"BT's network is limited compared to that of cable. With all the other services coming on stream such as video on demand, the question is will 8Mbps be enough?\" he asked.\n", "llama3.2:1b": ["Faster broadband availability in the UK, with some service providers offering speeds of up to 15Mbps.", "BT Retail and Wanadoo are among those that have announced trials or plans for faster services.", "Analysts say the rollout could help differentiate companies from competitors.", "Other cable firms, such as ntl and Telewest, may also increase bandwidth in the future."], "llama3.2:3b": ["UK internet provider BT Retail plans to launch an 8 megabits per second service, with a national rollout by year's end.", "Other ISPs are expected to follow suit, including Wanadoo and cable firms ntl and Telewest, which also plan to increase bandwidth in the future.", "The move is seen as a way for BT Retail to differentiate itself and gain market share after losing some of it."], "gemma2:2b": ["Super-fast broadband internet service is becoming available in the UK.", "Providers like BT Retail and Wanadoo are offering high speeds up to 8 Mbps and planning nationwide rollout.", "Other companies like ntl and Telewest are expected to increase bandwidth in the future.", "The question remains whether 8 Mbps will be enough for growing services such as video on demand."], "qwen2.5:0.5b": ["The UK has seen an increase in broadband speeds due to more internet providers offering faster service options.", "Some providers have already rolled out services with super-fast speeds, while others are expected to follow suit and offer new voice and video services.", "Companies like BT Retail are set to trial the same super-fast speed service for employees as well as customers, with interest from other ISPs and a glut of new voice and video services.", "Cable firms ntl and Telewest also plan to increase bandwidth in the future, with ntl stating that is better than BT in the long term.", "However, it's unclear when this will happen, with some estimates predicting 8Mbps speeds by year end."], "qwen2.5:1.5b": ["Faster broadband options become available, including trials by major providers like BT Retail and Wanadoo, potentially leading to increased competition and faster speeds in UK internet service.", "Providers plan to offer super-fast services with speeds up to 15Mbps once ntl and Telewest increase bandwidth.", "IDC's Jill Finger suggests that ISPs can benefit from offering super-fast services for differentiation purposes."], "qwen2.5:3b": ["Faster broadband services, including UK Online's 8 Mbps service launched in November 2004 and BT Retail's planned rollout by year end, are becoming available in the UK.", "Other providers like Wanadoo and Cable firms ntl and Telewest are expected to follow suit with increased bandwidth.", "Jill Finger of IDC suggests this could help ISPs differentiate from competitors and regain market share.", "Wanadoo plans to offer 15 Mbps services via unbundled networks.", "BT Retail's service is initially for employees but will be available for customers later in the summer, potentially gaining back some lost market share."], "opencoder:1.5b": ["\"Slow start to speedy net services,\" according to a reporter, \"Faster broadband in the UK is becoming a reality as more internet providers offer super-fast services for its users.\"", "The introduction of this 8Mbps service by BT Retail has been seen as a step up from traditional slow speeds.", "Some users may already be able to take advantage and can see it as an upgrade to their existing services, whereas others might be watching the trials suggested by BT Retail.", "As to \"what happens next\" in future, according to IDC, it is anticipated that more businesses will join with the service offering this speed.\""], "smollm:1.7b": ["Summarize the text:\n\n1.", "Faster broadband in the UK is becoming a reality as more internet providers offer super-fast services.", "2.", "Some lucky Britons can already take advantage of UK Online's 8 megabits per second service, which was launched in November 2004.", "BT Retail has announced that it will trial the same speed service, with a national rollout by year end.", "Other service providers are expected to follow suit and a glut of new voice and video services will follow.", "3.", "If the bandwidth is there then ISPs will buy it.", "If the bandwidth is there then ISPs will buy it.", "For BT Retail, she said, the super-fast service could be a way of differentiating it from other players.", "For BT Retail, the super-fast service could be one way of gaining some of that back.", "For BT Retail, the super-fast service could be one way of gaining some of that back.", "4.", "Wanadoo is set to trial an 8Mbps service in the summer and also plans to roll out unbundled services - which means it takes over the network from BT - which will provide speeds of up to 15Mbps.", "There is no timetable for this at the moment.", "Cable firms ntl and Telewest are also bound to increase bandwidth at some time in the future and, according to an ntl spokesman, are in a better position than BT in the long term.", "5.", "The question is will 8Mbps be enough?"], "deepseek-r1:1.5b": ["Slow start to fast broadband in the UK has seen faster internet services emerge.", "Starting in November 2004, BT Online launched an 8 Mbps service, which is set to gain traction nationwide with a national rollout by end-of-year.", "Other providers are expected to follow suit, and future services will include voice and video capabilities.", "According to IDC, if the bandwidth is available, ISPs like BT Retail may use it as a differentiation strategy.", "Services like Wanadoo are also on trial, offering up to 15 Mbps, planned for summer, potentially unbundled to enhance network control.", "While cable providers ntl and Telewest are expected to expand their networks, BT's limited service will require more bandwidth."], "tinyllama:1.1b": ["The UK has become a global leader in super-fast internet services with more ISPs offering speeds of up to 8 megabits per second (Mbps) as part of their expansion plans.", "While some customers already benefit from such services, others are set to follow suit by the end of the year as voice and video services roll out.", "New entrants in the market, including ntl and Telewest, are expected to gain ground on BT Retail, which is losing market share.", "Meanwhile, there is no fixed timetable for unbundled services, but announced plans by cablers including ntl and Telewest suggest they are investing in future growth.", "The UK's network may be limited compared to cable's, but new entrants are poised to increase bandwidth at a later stage."], "tinydolphin:1.1b": [" The UK broadband market is set for rapid expansion, with new internet providers launching super-fast services and others planning to follow suit.", "One of the most anticipated new voice and video services will follow, providing a glut of competitive options to consumers who demand faster speeds.", "Analysts expect ISPs to buy bandwidth from the current network infrastructure as they seek to differentiate themselves from rivals.", "Wanadoo is set to trial unbundled services to provide faster speeds, while other players in the market are also considering the possibility of offering 8Mbps services in addition to their existing broadband offerings.", "Ultimately, the success of these new services will depend on whether they can maintain a competitive edge against established ISPs."], "phi:2.7b": [" The UK's internet providers offer super-fast services, with some already offering 8 megabits per second (MPS) speed.", "BT Retail has announced a trial of this service and expects to have it available for customers by year end.", "Other providers are expected to follow suit and there will be more voice and video services available.", "Wanadoo is set to offer an 8Mbps service in the summer, while Cable firms ntl and Telewest plan to increase bandwidth at some time in the future.", "BT's network is limited compared to cable networks, but with more services coming online, will 8Mbps be enough?"], "orca-mini:3b": [" The text describes how faster broadband internet services are becoming available in the UK through various providers, following the trials of a 8Mbps service by BT Retail.", "Other service providers are expected to follow suit and launch similar services, which could lead to a glut of new voice and video services.", "It also mentions Jill Finger's comments about how other providers will be watching BT Retail's trials of the super-fast service, with interest."], "hermes3:3b": ["Faster UK broadband services increase; providers like UK Online, BT Retail, Wanadoo, ntl, Telewest expected to offer higher speeds."], "stablelm-zephyr:3b": ["Faster broadband is becoming available in the UK as internet providers offer super-fast services.", "Some providers, like UK Online and BT Retail, already provide 8 megabits per second (Mbps) service.", "BT Retail plans to trial this speed for employees and later for customers by year end.", "Other providers, such as Wanadoo, Cable firms ntl and Telewest are also expected to increase bandwidth at some point in the future.", "The question is whether 8Mbps will be enough for video on demand services that are yet to come."], "chatgpt-4o-latest": ["Faster broadband is becoming a reality in the UK as more providers offer high-speed services.", "UK Online launched an 8Mbps service in 2004, and BT Retail plans to trial and roll out a similar service nationwide.", "Other providers, including Wanadoo, are also planning trials and unbundled services with speeds up to 15Mbps.", "Cable firms ntl and Telewest are expected to increase bandwidth, with ntl suggesting that BT's network may be limited in the long term.", "The expansion of high-speed internet is expected to drive new voice and video services."], "stablelm2:1.6b": ["UK internet providers offer faster broadband speeds, with companies like BT Retail and UK Online offering 8 Mbps services.", "Lucky Britons have already access these services, while others are expected to follow suit.", "Analysts predict that if bandwidth is available, ISPs will buy it, as demonstrated by BT Retail's trial for employees followed by a rollout for customers.", "Wanadoo also plans to roll out unbundled services and other cable firms like ntl and Telewest may increase bandwidth in the future.", "The question remains whether 8 Mbps will be enough to meet growing demands for video on demand services."], "granite3.1-dense:2b": ["The UK is rapidly transitioning to faster broadband, with several internet service providers (ISPs) offering or planning super-fast services of up to 15 megabits per second.", "BT Retail is currently testing an 8Mbps service and aims for a nationwide rollout by year's end.", "This move could help BT regain market share.", "Wanadoo plans to trial an 8Mbps service in summer, along with unbundled services promised to deliver up to 15Mbps.", "Cable firms ntl and Telewest are also expected to boost their bandwidth, though they currently have more capacity than BT due to their infrastructure.", "The increased speeds will likely support new voice and video services, signaling a significant improvement in UK internet access."]}