{"raw_text": "The pirates with no profit motive\n \n Two men who were part of a huge network of internet software pirates, known as Drink Or Die, have been convicted at the Old Bailey. BBC News investigates how the network worked and what motivated those involved.\n \n They called themselves Drink Or Die (DOD). They were a network of computer buffs who derived pleasure from cracking codes protecting copyrighted software such as Windows 95. They would then share it with each other. There is no suggestion any of them profited financially. But the authorities in both Britain and the United States considered it software piracy and took a dim view of networks such as DOD, one of a number of so-called warez organisations operating on the internet. In October 2000 the US Customs Service began an investigation into DOD and other networks, such as Razor 1911, Risciso, Myth and Popz.\n \n Fourteen months later US Customs co-ordinated a series of raids across the globe as part of Operation Buccaneer. Seventy search warrants were executed in the US, Britain, Australia, Norway, Sweden and Finland. At least 60 people were arrested worldwide - 45 of them in the US. Among the leaders of the network were Americans John Sankus - known by his internet nickname Eriflleh (Hellfire spelt backwards) - Richard Berry, Kent Kartadinata and Christopher Tresco, who used a server based at the prestigious Massachusetts Institute of Technology (MIT).\n \n The longest jail sentence - 46 months - was handed down to Sankus, a 28-year-old from Philadelphia. US Attorney Paul McNulty said at the time: \"John Sankus and his techno-gang operated in the faceless world of the internet and thought they would never be caught. \"They were wrong. These sentences, and those to follow, should send a message to others entertaining similar beliefs of invincibility.\" But one man still in legal limbo is British-born Australian Hew Raymond Griffiths, who is still fighting against extradition to the US.\n \n US Customs claimed Mr Griffiths was one of DOD's leaders but his lawyer, Antony Townsden, told the BBC News website it was a laughable suggestion and added: \"He was living on welfare and had such an old computer that he couldn't even download software. \"The allegation that he was the group's co-leader is illusory. He had the least technical skills of anyone, he couldn't crack any codes and he has only been called a leader because he was a loudmouth who wrote a lot on their messageboard.\" Mr Townsden said if he had committed any crimes he should be prosecuted in Australia, not the US. He claimed the Australian government's decision to accept the extradition request was typical of their current \"acquiescent\" attitude to the US.\n \n Mr Griffiths is expecting to hear this week the outcome of his appeal against the decision to extradite him. Those involved would give themselves internet aliases which would act in the same way as tags used by graffiti artists. They could then brag about their code-cracking abilities without giving away their real identities. Alex Bell, whose trial at the Old Bailey ended on Friday, was known as Mr 2940 - after a computer device - while his co-defendant Steven Dowd's nickname, curiously, was Tim.\n \n A spokesman for US Immigration, Customs and Enforcement, Dean Boyd, said DOD did not appear to be motivated by money. Their motivation was the kudos which surrounded being able to crack sophisticated software. He told the BBC News website: \"Primarily they were just interested in how fast they could crack the code. It was all about underground notoriety.\" But Mr Boyd pointed out that once the software had been distributed on the internet it fell into the hands of organised criminals who were able to mass produce pirated software at zero cost.\n \n \"It cost US industries a lot of money, billions of dollars,\" he said. Mr Boyd said: \"It was truly global in scope. We raided a number of universities, including Duke (in North Carolina) and MIT, and found that several of the people involved were employed by major computer corporations. \"They would go home from work in the evenings and get involved in this warez culture.\" Warez groups, which began to surface in the early 1990s, operate according to a strict code of honour.\n \n For example if one group cracked the software first its rivals would respect that achievement and not seek to claim it themselves. Mr Boyd said the destruction of DOD was a great coup but he added: \"I'm not going to sit here and say we have sorted the problem. There are still hackers and people who do this for fun. \"Internet piracy of computer software remains a gigantic problem.\" A spokesman for the Business Software Alliance said: \"DOD members claim they did not profit at all. But they did profit by getting access to very expensive servers.\" He said DOD and other warez groups were fostering a \"culture of piracy\" on the internet. He said 29% of computer software in Britain was believed to have been pirated and this cost £1bn in revenue for software companies, their suppliers and distributors. \"It may seem like a victimless crime but it touches more people than you might care to believe.\"\n", "llama3.2:1b": ["The pirates with no profit motive who were part of the internet software piracy network known as Drink Or Die (DOD) were convicted at the Old Bailey for cracking copyrighted software such as Windows 95.", "The US Customs Service and Australian authorities investigated DOD, arresting over 60 people worldwide in raids across 6 countries.", "Fourteen months later, a series of raids in the US and other countries resulted in the arrest of 45 people, including American leaders John Sankus and Richard Berry.", "A judge handed down a 46-month jail sentence to Sankus, while others were still fighting extradition to the US."], "llama3.2:3b": ["Two men from the internet network Drink Or Die (DOD) were convicted at the Old Bailey.", "DOD was a group of computer buffs who derived pleasure from cracking codes protecting copyrighted software, sharing them with each other without financial profit.", "The investigation led to Operation Buccaneer, resulting in 60 arrests worldwide, including 45 in the US.", "John Sankus received a 46-month sentence, while Hew Raymond Griffiths remains fighting extradition to the US, despite being accused of being a DOD leader by authorities."], "gemma2:2b": ["Two men were convicted for software piracy under the name Drink Or Die (DOD).", "The network of computer buffs shared copyrighted software without financial motivation, but faced prosecution due to its illegal activity.", "Operation Buccaneer resulted in the arrest of 60 individuals worldwide and long jail sentences for some leaders.", "One man's extradition to the US is still contested, while DOD led a global operation using internet aliases and bragging about code-cracking skills.", "Their motives were primarily the notoriety and challenge of breaking codes, but their actions contributed to software piracy, costing billions to businesses.", "The group faced disruption in its operations, though the problem of software piracy remains substantial."], "qwen2.5:0.5b": ["Two men with no profit motive, named John Sankus and Richard Berry, from the internet hacking group known as Drink Or Die (DOD) were convicted at the Old Bailey for their role in organizing a massive network of software pirates.", "They called themselves DOD and would exchange copies of copyrighted software like Windows 95 to share with each other.", "They believed they could make money off cracking codes, but authorities considered them software piracy and took an interest in similar organizations operating on the internet.", "Operation Buccaneer involved US Customs agencies seizing a number of search warrants across the globe for DOD and other warez groups."], "qwen2.5:1.5b": ["Two men from a warez network called Drink Or Die were convicted of copyright infringement at the Old Bailey after being investigated by US Customs Service.", "The group consisted of 45 arrests worldwide, including four in Britain and one extradition appeal against extradition to the US remained pending.", "The network's motivation was primarily for underground notoriety rather than financial gain; however, once distributed on the internet, it led to organized crime profiting from pirated software."], "qwen2.5:3b": ["Two men from Drink Or Die (DOD) were convicted at the Old Bailey for operating a network of internet software pirates.", "DOD consisted of computer buffs who cracked copyrighted software codes and shared them without financial gain, leading law enforcement investigations in Britain and the US.", "The authorities viewed their activities as piracy despite no monetary motives.", "Key figures like John Sankus from Drink Or Die were sentenced to 46 months in prison.", "While they focused on gaining notoriety for code-cracking skills, they inadvertently allowed criminals to mass-produce pirated software at negligible cost to industries.", "Despite this global operation being dismantled through raids by Operation Buccaneer, internet piracy remains a significant issue costing US industries billions annually.", "The Business Software Alliance estimates 29% of computer software in Britain was pirated, with substantial economic losses for the sector."], "opencoder:1.5b": ["The pirates with no profit motive is a case of intellectual property theft.", "Two men who were part of a network of computer buffs who derived pleasure from cracking codes protect copyrighted software such as Windows 95.", "They would then share it with each other.", "The men are charged with hacking, and in October 2002, the US Customs Service began an investigation into DOD and other networks, one of a number of so-called warez organisations operating on the internet.", "Fourteen months later, US Customs coordinated a series of raids across the globe, from Operation Buccaneer.", "The network included Razor 19-11, Risciso, Myth and Popz, amongst others.", "In addition to being a group of cybercriminals, it also represents a community with valuable information about software piracy and other intellectual property theft.", "As more information is gathered, the BBC News website will provide insights into how these groups operate and the reasons behind their actions."], "smollm:1.7b": [], "deepseek-r1:1.5b": ["The pirates with no profit motive  \nTwo men involved in a huge software piracy network called Drink Or Die (DOD) were convicted by the UK courts.", "The US Customs Service later investigated them during Operation Buccaneer, which targeted several countries.", "The longest sentence for one of them was 46 months, and their legal status remains unresolved in the US despite being fugitives.", "Their activities included cracking codes to access powerful servers, sharing with others, and operating without profit.", "The rest of the crew, including John Sankus (now known as Eriflleh), Richard Berry, Kent Kartadinata, and Christopher Tresco, were arrested worldwide, with most being British.", "A British-born Australian individual, Hew Raymond Griffiths, was still fighting extradition to the US but is expected to have a trial outcome this week.", "His lawyer, Antony Townsden, dismissed the allegations of him being a co-leader as illogical.", "The network's motivation was primarily profit from software piracy, with their activities being under the guise of not profiting financially.", "Despite the widespread SUCCESS of DOD, internet piracy remains a significant problem globally."], "tinyllama:1.1b": ["The two men who were part of the Drink Or Die network of internet software pirates, called themselves \"Drink Or Die,\" and worked to crack codes protecting copyrighted software such as Windows 95.", "They dubbed themselves a network of computer buffs who derived pleasure from cracking codes in order to share it with each other.", "The US authorities began an investigation into Drink Or Die and other networks in October 2000, with raids across the globe carried out by the US Computer Crime Service, with assistance from the Massachusetts Institute of Technology (MIT).", "Over 60 people were arrested worldwide for their involvement in Drink Or Die.", "Fourteen months after the arrests, a sentence was handed down to one of the network's leaders, John Sankus, who had been accused of invincibilty.", "He remained free, however, due to his legal limbo as he awaited extradition to the US.", "The leader of Drink Or Die and his technopreneurs were believed to have profited financially by obtaining access to expensive servers and gaining access to valuable software.", "The culture of piracy of computer software remains a major problem, with £1bn in revenues for software companies, their suppliers, and distributors estimated to be lost due to Drink Or Die's actions."], "tinydolphin:1.1b": [" The article discusses the conviction of two men who were part of a network called Drink Or Die, which was responsible for cracking computer software.", "They were known as Drink Or Die and their activities included sharing these programs with other internet users, often without receiving any compensation.", "The investigation took place in both the United States and Britain, with the conclusion that they were warez groups operating on the internet.", "The group provided valuable information for copyright holders and it is estimated that as many as 60 people were involved worldwide.", "The two main suspects in this case were John Sankus from Philadelphia, who was known by his internet nickname Eriflleh, and Richard Berry, who used the username \"Hellfire spelt backwards\" on the MIT server.", "The US Customs Service arrested them but at least 60 people were also arrested worldwide.", "In operation Buccaneer, search warrants were executed across various locations, including the US and Britain.", "During raids, dozens of computers were seized and the confiscated software was identified as copyrighted software.", "The fourteen-month investigation led to arrests in multiple countries, particularly in the United States and Britain.", "The lengthy sentences given to the four men involved in Operation Buccaneer highlights the importance of cracking down on such organizations operating on the internet.", "The US Attorney Paul McNulty stated that these operations should be seen as \"the darkest corners of the internet\".", "In particular, he criticized the American people for not understanding how pirated software could have a negative impact on them.", "British-born Australian Hew Raymond Griffiths is still fighting against extradition to the US after his legal representation was denied in the UK.", "Mr. Townsden, one of Mr. Griffiths' attorneys, said that if he were extradited, Mr. Griffiths would have to give up any publicity in order to avoid being charged with a crime.", "He argued that Mr. Griffiths was not involved in the piracy that he claims was motivated by."], "phi:2.7b": [" The text is about two men who were part of an internet piracy network called Drink Or Die (DOD) that cracked software codes without intending to make money from it.", "They were convicted in court and extradited to the US, where they faced jail time for their crimes.", "However, one man, Hew Raymond Griffiths, still faces extradition but has appealed against it.", "The text also explains how DOD worked, how long sentences were given out, and why some people engaged in piracy on the internet."], "orca-mini:3b": [" The text reports on the conviction of two men who were part of a network of internet software pirates known as Drink Or Die.", "They were leaders of the network, which was involved in stealing copyrighted software and distributing it freely.", "The network's leader, John Sankus, was given a 46-month sentence, while his lawyer claimed he had no technical skills and was only a loudmouth who wrote about their activities online.", "The Australian government's decision to accept the extradition request for Griffiths is typical of their current \"acquiescent\" attitude to the US.", "Griffiths is expected to hear this week the outcome of his appeal against the decision to extradite him."], "hermes3:3b": ["Internet software pirates called Drink Or Die convicted, no financial gain motive."], "stablelm-zephyr:3b": ["Two members of the Drink Or Die network, which cracked codes protecting copyrighted software, were convicted at the Old Bailey.", "Though there was no financial gain for the participants, both Britain and the United States considered it software piracy and targeted the networks accordingly.", "In October 2000, US Customs Service began investigating various networks including DOD and Razor 191 1.", "Fourteen months later, a series of global raids called Operation Buccaneer led to 70 search warrants and the arrests of at least 60 people across six countries.", "John Sankus, a member with the longest jail sentence of 46 months, was one of the network's leaders who operated under an internet alias.", "US Customs claimed Hew Raymond Griffiths was also a leader but his lawyer argued that he had no technical skills and should be prosecuted in Australia instead.", "The spokesman for US Immigration, Customs and Enforcement stated that DOD was motivated by the kudos surrounding being able to crack sophisticated software rather than monetary gain.", "Although the destruction of DOD was seen as a great success, internet piracy of computer software remains a significant problem."], "chatgpt-4o-latest": ["A global network of internet software pirates, Drink Or Die (DOD), was targeted in Operation Buccaneer, leading to arrests and convictions.", "DOD members, motivated by prestige rather than profit, cracked and shared copyrighted software.", "Authorities viewed their actions as piracy, arguing that their work enabled organized crime to mass-produce pirated software, causing significant financial losses.", "Key figures, including John Sankus, received prison sentences, while Australian Hew Raymond Griffiths fought extradition to the US.", "Warez groups like DOD followed a strict code of honor, but officials warned that internet piracy remains a major issue, fostering a culture of software theft that costs industries billions."], "stablelm2:1.6b": ["Drink or Die (DOD) is a network of computer enthusiasts who shared and cracked software protecting copyrighted content such BETA versions of Windows.", "There is no evidence suggesting any of them gained financial profit.", "DOD was considered a warez organization in various countries, including the US.", "In October 2005, Operation Buccaneer led to the coordinated raiding of several locations worldwide by US Customs and other organizations, leading to at least 70 arrests and numerous jail sentences for its leaders.", "The group's primary motivation seemed to be obtaining recognition for their abilities in cracking sophisticated software rather than financial gain."], "granite3.1-dense:2b": ["A group of self-proclaimed hackers known as Drink Or Die (DOD) was convicted after being involved in a massive global network that cracked and shared copyrighted software, primarily Windows 95.", "This network, part of the larger warez culture, operated for enjoyment rather than financial gain.", "The US Customs Service, along with authorities from Britain, Australia, Norway, Sweden, and Finland, launched Operation Buccaneer in October 2001, resulting in 60 arrests worldwide, including DOD leaders like John Sankus (Eriflleh), Richard Berry, Kent Kartadinata, and Christopher Tresco.", "The longest sentence handed down was 46 months to Sankus.", "US Attorney Paul McNulty emphasized that these actions would serve as a warning to others believing they could act with impunity online.", "However, British-born Australian Hew Raymond Griffiths is still fighting extradition to the US for his alleged role in DOD.", "His lawyer claims he lacked technical skills and was merely a loudmouth with no actual involvement in code-cracking or leadership.", "DOD members adopted internet aliases, mirroring graffiti artists' tags, to maintain anonymity while boasting about their achievements.", "Their motivation was the prestige of cracking sophisticated software quickly and sharing it within the community, not financial gain.", "Once the software was distributed online, organized criminals could mass-produce pirated versions at no cost.", "US Immigration, Customs and Enforcement's Dean Boyd noted that DOD members did not profit from this activity but derived satisfaction from their accomplishments.", "He highlighted that the distribution of these software pirates significantly impacted US industries, costing billions in damages.", "Despite claims by DOD members that they did not profit, a spokesperson for the Business Software Alliance argued that participation in such networks provided access to expensive servers and fostered a culture of software piracy, causing substantial financial losses for software companies, suppliers, and distributors.", "It is estimated that 29% of Britain's computer software is believed to be pirated, resulting in £1 billion in lost revenue annually."]}