{"raw_text": "Apple makes blogs reveal sources\n \n Apple has won its legal fight to make three bloggers reveal who told them about unreleased products.\n \n The bid to unmask the employees leaking information was launched in December 2004 following online articles about Apple's Asteroid product. Now Apple has won the right to see e-mail records from the three bloggers to root out the culprit. A lawyer for the three bloggers said the ruling set a dangerous precedent that could harm all news reporters.\n \n Apple's lawsuit accused anonymous people of stealing trade secrets about the Asteroid music product and leaking them to the PowerPage, Apple Insider and Think Secret websites. All three are Apple fan sites that obsessively watch the iconic firm for information about future products. Apple is notoriously secretive about upcoming products which gives any snippets of information about what it is working on all the more value. The lawsuit to reveal the names of the leakers was filed against the Power Page and Apple Insider sites.\n \n The separate legal fight with Think Secret has yet to be resolved. In the ruling handed down this week by Santa Clara County Superior Court Judge James Kleinberg, Apple can now get its hands on e-mail records from the bloggers' net providers. In making his ruling, Judge Kleinberg said that laws covering the divulging of trade secrets outweighed considerations of public interest. California has so-called \"shield\" laws which protect journalists from prosecution if what they are writing about can be shown to be in the public interest. The Judge wrote: \"...it is not surprising that hundreds of thousands of 'hits' on a website about Apple have and will happen. But an interested public is not the same as the public interest\". Judge Kleinberg said the question of whether the bloggers were journalists or not did not apply because laws governing the right to keep trade secrets confidential covered journalists, too. The Electronic Frontier Foundation, which is acting as legal counsel for Power Page and Apple Insider, said the ruling had potentially wide implications. \"Anyone who reports on companies or the trade press should be concerned about this ruling,\" said EFF lawyer Kurt Opsahl. Mr Opsahl said the EFF was planning to appeal against the ruling because the bloggers were journalists and US federal laws stop net firms handing over copies of e-mail messages if the owner of that account does not give their consent.\n", "llama3.2:1b": ["Apple has won a court case to uncover email records from three anonymous bloggers who leaked trade secrets about its Asteroid product, with the judge ruling that laws protecting journalists outweigh considerations of public interest.", "The ruling allows Apple to see the bloggers' email providers and potentially identify the source of the leaks, although it does not rule out the possibility of the bloggers being journalists or not."], "llama3.2:3b": ["Apple wins legal fight to make three bloggers reveal sources, allowing company to see email records from sites which shared information about unreleased products Asteroid and other upcoming items."], "gemma2:2b": ["Apple won a lawsuit seeking to identify sources for unreleased product leaks from three bloggers.", "The court ruled that trade secret laws supersede concerns about public interest in protecting journalist anonymity.", "The Electronic Frontier Foundation plans to appeal, arguing the ruling sets a dangerous precedent for press freedom."], "qwen2.5:0.5b": ["Apple obtained the right to examine blogs' emails detailing who leaked product information."], "qwen2.5:1.5b": ["Apple wins legal battle against three bloggers for revealing information about unreleased products.", "The case stems from Apple's lawsuit accusing anonymous individuals of stealing trade secrets about Asteroid, an upcoming music product, and leaking them to PowerPage, Apple Insider, and Think Secret websites.", "The judge ruled that the right to keep trade secrets confidential outweighs public interest considerations.", "Apple can now obtain e-mail records from the bloggers' net providers.", "This ruling has implications for reporters covering companies or trade press."], "qwen2.5:3b": ["Apple has won a legal fight to reveal who leaked information about its unreleased Asteroid product to three anonymous bloggers running fan sites focused on Apple's products.", "The lawsuit accused them of stealing trade secrets and harming Apple’s secrecy over future products, valuable due to its notorious penchant for being secretive.", "Judge Kleinberg ruled in favor of Apple allowing access to the bloggers' email records, stating that laws protecting trade secrets outweighed public interest concerns.", "California \"shield\" laws protect journalists from prosecution regarding leaks deemed beneficial to the public yet do not apply if confidentiality is required by law.", "The Electronic Frontier Foundation (EFF) has indicated plans for an appeal against this ruling on behalf of Power Page and Apple Insider, arguing that it could have significant implications for any media outlet reporting on companies or trade secrets."], "opencoder:1.5b": ["Apple makes blogs reveal sources\n\nApple has won its legal fight to make three bloggers reveal who told them about unreleased products.", "The bid to unmask the employees leaking information was launched in December 2004 following online articles about Apple's Asteroid product.", "Now, Apple has won the right to see e-mail records from the three bloggers to root out the culprit.", "A lawyer for the three bloggers said the ruling set a dangerous precedent that could harm all news reporters.", "Apple's lawsuit accused anonymous people of stealing trade secrets about the Asteroid music product and leaking them to the PowerPage, Apple Insider, and Think Secret websites.", "The separate legal fight with Think Secret has yet to be resolved."], "smollm:1.7b": [], "deepseek-r1:1.5b": ["Apple has ongoing legal battles with three bloggers who leaked information about an unreleased product called Asteroid in December 2004.", "Apple now owns the right to see their net providers' e-mail records, which could harm news reporting.", "The suit accuses anonymous individuals of stealing trade secrets and leaking them to PowerPage, Apple Insider, and ThinkSecret websites.", "The case is about fan sites that obsessively watch information.", "Apple is highly secretive about future products but the snippets of info are valuable.", "A lawsuit against PowerPage and an unresolved case with ThinkSecret have been filed.", "Judge Kleinberg ruled in favor of Apple, allowing it to access e-mails from net providers, covering trade secrets.", "The ruling balances legal concerns over confidential disclosure against public interest.", "News media could face repercussions if bloggers' work aligns with the public interest.EFF says the ruling is a potential threat and has implications for news reporting.", "In conclusion, Apple's case hinges on whether net firms can access e-mails of journalists.", "The ruling may harm media and have wide implications."], "tinyllama:1.1b": ["The legal battle between Apple and three bloggers who revealed information about unreleased products has been resolved, with the company winning access to the e-mail records from their web sites.", "In a landmark ruling handed down this week by Santa Clara County Superior Court Judge James Kleinberg, Apple was granted access to emails from the bloggers' internet providers, including data on how often they accessed the Asteroid music product and any links they shared with each other.", "The separate legal fight with Think Secret has yet to be resolved, as the judge gave Apple the right to examine e-mail records from their net provider.", "In making his ruling, Judge Kleinberg ruled that \"hunderds of thousands of 'hit' on a website about Apple have and will happen.\"", "The Electronic Frontier Foundation, which is representing Apple in the case, warned that any journalist or anyone reporting on companies or trade press should be concerned about the possible implications of the ruling."], "tinydolphin:1.1b": [" Apple has won its legal battle with three bloggers who posted stories about unreleased products, revealing their names to prevent leaking trade secrets.", "The victory sets a dangerous precedent for all news reporters as it could threaten the confidentiality of future products from companies like Apple."], "phi:2.7b": [" Apple won its legal fight to uncover who leaked information about its unreleased products.", "The company can now see the email records from three anonymous bloggers who wrote about the Asteroid product.", "A lawyer for the bloggers said this could set a dangerous precedent and harm all news reporters.", "Laws protecting trade secrets in California outweigh the public's right to know, according to Judge Kleinberg's ruling.", "The case will likely be appealed because US federal laws prevent net firms from sharing e-mail messages without the owner's consent."], "orca-mini:3b": [" Apple won a court battle to demand that three blogs reveal the sources who provided them with leaked information about unreleased products.", "The leaks were about the Asteroid music product and the bloggers were fan sites that track Apple's secrets closely.", "The judge ruled that laws protecting trade secrets took precedence over considerations of public interest, and journalists were included in this protection.", "The EFF said the ruling had far-reaching implications for anyone reporting on companies or the trade press.", "The bloggers were considered journalists and the ruling could potentially affect all news reporters."], "hermes3:3b": ["Apple won legal battle to make 3 bloggers reveal sources for unreleased product information, according to Santa Clara County Superior Court judgment.", "The ruling allows Apple access to email records from the bloggers to identify leakers."], "stablelm-zephyr:3b": ["Apple won a legal battle to make three bloggers reveal sources of unreleased products.", "The company accused anonymous employees of stealing trade secrets about the Asteroid music product and leaking them to Apple fan sites.", "A judge ruled that laws covering the divulging of trade secrets outweighed considerations of public interest, stating that California has \"shield\" laws protecting journalists from prosecution if what they are writing about can be shown to be in the public interest.", "The Electronic Frontier Foundation (EFF) planned to appeal against the ruling because bloggers were considered journalists under US federal laws, and net firms should not hand over email messages without the owner's consent."], "chatgpt-4o-latest": ["Apple has won a legal battle to force three bloggers to reveal their sources for leaked information about its unreleased Asteroid product.", "The lawsuit, filed in 2004, aimed to identify employees leaking trade secrets to Apple fan sites PowerPage, Apple Insider, and Think Secret.", "A Santa Clara County judge ruled that trade secret laws outweighed public interest protections, allowing Apple access to the bloggers' email records.", "The ruling raised concerns about press freedom, with the Electronic Frontier Foundation planning to appeal, arguing that bloggers are journalists protected by federal laws against unauthorized disclosure of emails."], "stablelm2:1.6b": ["Apple wins legal fight to reveal names of three bloggers who leaked information about unreleased products, using e-mail records obtained from net providers.", "The lawsuit accuses anonymous individuals of stealing trade secrets and leaking them on fan sites such as PowerPage, Apple Insider, and Think Secret.", "A separate case with Think Secret remains unresolved.", "Judge Kleinberg ruled that laws covering trade secrets outweigh public interest considerations in the ruling.", "This ruling could have wide implications for journalists, as any reporting on companies or trade press should be concerned about this ruling."], "granite3.1-dense:2b": ["Apple has secured a court order, issued by Santa Clara County Superior Court Judge James Kleinberg, compelling three blogging sites—PowerPage, Apple Insider, and Think Secret—to reveal the sources of information about unreleased products, specifically regarding the Asteroid music product.", "This decision allows Apple to access email records from these bloggers' internet service providers.", "The ruling prioritizes trade secrets over public interest, as outlined in California's \"shield\" laws that protect journalists.", "However, the Electronic Frontier Foundation (EFF), representing PowerPage and Apple Insider, argues this sets a harmful precedent for all news reporters, claiming it could undermine their protections.", "The EFF intends to appeal, asserting that US federal laws prevent internet service providers from disclosing email content without the account holder's consent."]}