{"raw_text": "Have hackers recruited your PC?\n \n More than one million computers on the net have been hijacked to attack websites and pump out spam and viruses.\n \n The huge number was revealed by security researchers who have spent months tracking more than 100 networks of remotely-controlled machines. The largest network of so-called zombie networks spied on by the team was made up of 50,000 hijacked home computers. Data was gathered using machines that looked innocent but which logged everything hackers did to them.\n \n The detailed look at zombie or 'bot nets of hijacked computers was done by the Honeynet Project - a group of security researchers that gather information using networks of computers that act as \"honey pots\" to attract hackers and gather information about how they work. While 'bot nets have been known about for some time, estimates of how widespread they are from security firms have varied widely.\n \n To gather its information the German arm of the Honeynet Project created software tools to log what happened to the machines they put on the web. Getting the machines hijacked was worryingly easy. The longest time a Honeynet machine survived without being found by an automatic attack tool was only a few minutes. The shortest compromise time was only a few seconds. The research found that, once compromised machines tend to report in to chat channels on IRC servers and wait instructions from the malicious hacker behind the tools used to recruit the machine. Many well-known vulnerabilities in the Windows operating system were exploited by 'bot net controllers to find and take over target machines. Especially coveted were home PCs sitting on broadband connections that are never turned off.\n \n The months of surveillance revealed that the different 'bot nets - which involve a few hundred to tens of thousands of machines - are used for a variety of purposes. Many are used as relays for spam, to route unwanted adverts to PC users or as launch platforms for viruses. But the research team found that many are put to very different uses. During the monitoring period, the team saw 'bot nets used to launch 226 distributed denial-of-service attacks on 99 separate targets. These attacks bombard websites with data in an attempt to overwhelm the target. Using a 'bot net of machines spread around different networks and nations makes such attacks hard to defend against. One DDoS attack was used by one firm to knock its competitors offline. Other 'bot nets were used to abuse the Google Adsense program that rewards websites for displaying adverts from the search engine. Some networks were used to abuse or manipulate online polls and games. Criminals also seem to be starting to use 'bot nets for mass identity theft, to host websites that look like those of banks so confidential information can be gathered and to peep into online traffic to steal sensitive data. \"Leveraging the power of several thousand bots, it is viable to take down almost any website or network instantly,\" said the researchers. \"Even in unskilled hands, it should be obvious that 'bot nets are a loaded and powerful weapon.\"\n", "llama3.2:1b": ["Hackers have hijacked millions of computers worldwide to attack websites and pump out spam and viruses.", "The Honeynet Project has tracked over 100 networks of remotely-controlled machines, with the largest network consisting of 50,000 hijacked home computers that spied on targets by logging every activity.", "Researchers found that these zombie or 'bot net' systems were used for a variety of purposes, including spreading spam, routing unwanted adverts to users, and launching distributed denial-of-service attacks on targets.", "Some networks were also used for mass identity theft, online poll manipulation, and data theft."], "llama3.2:3b": ["More than one million computers have been hijacked by hackers for malicious purposes such as attacking websites, spreading spam and viruses, and launching distributed denial-of-service attacks.", "A study by the Honeynet Project found that these \"zombie networks\" or \"bot nets\" are used to relays spam, route unwanted adverts, launch viruses, and even host fake websites for identity theft and data stealing."], "gemma2:2b": ["One million computers have been hijacked to attack websites and spread spam and viruses.", "The Honeynet Project, using compromised machines as “honey pots,”  reveals this widespread use of botnets (networks of hijacked computers) for various malicious purposes.", "They found that these networks are used to launch DDoS attacks, abuse Google AdSense programs, manipulate online polls and games, conduct mass identity theft, create phishing websites, and steal sensitive data."], "qwen2.5:0.5b": ["Hacks can turn over 100 million PCs into zombie networks.", "The German Honeynet Project created software to log what happens when these machines are compromised.", "It found that many of these machines are used for spam, advert routes or launching DDoS attacks.", "Many of these sites will use the same set up, so hackers can easily take over target machines."], "qwen2.5:1.5b": ["Hackers have hijacked more than one million computers worldwide for various malicious purposes, including spamming, spreading viruses, and launching distributed denial-of-service attacks on websites.", "The German arm of the Honeynet Project discovered this phenomenon through a detailed surveillance campaign that lasted months, using networks of \"honey pots\" to monitor the activities of these compromised machines."], "qwen2.5:3b": ["More than one million computers have been hijacked into zombie networks used for spamming, launching attacks on websites, and spreading viruses.", "The Honeynet Project found 50,000 home PCs in the largest network.", "Hackers exploit known vulnerabilities in Windows to infect machines.", "Home broadband-connected devices are particularly targeted.", "The research shows 'bot nets can be used for distributed denial-of-service attacks, abuse of Google Adsense, manipulation of online games and polls, and even for identity theft.", "Using a large botnet can swiftly take down websites or networks."], "opencoder:1.5b": ["Have hackers recruited your PC?", "More than one million computers on the net have been hijacked to attack websites and pump out spam and viruses.", "The huge number was revealed by security researchers who have spent months tracking more than 100 networks of remotely-controlled machines.", "The largest network of so-called zombie networks spied on by the team was made up of 50,000 hijacked home computers.", "Data was gathered using machines that looked innocent but which logged everything hackers did to them.", "The detailed look at zombie or 'bot nets of hijacked computers was done by the Honeynet Project - a group of security researchers that gather information using networks of computers that act as \"honey pots\" to attract hackers and gather information about how they work.", "While 'bot nets have been known about for some time, estimates of how widespread they are from security firms have varied widely.", "To gather its information the German arm of the Honeynet Project created software tools to log what happened to the machines they put on the web.", "Getting the machines hijacked was worryingly easy.", "The longest time a Honeynet machine survived without being found by an automatic attack tool was only a few minutes.", "The shortest compromise time was only a few seconds.", "The research found that, once compromised machines tend to report in to chat channels on IRC servers and wait instructions from the malicious hacker behind the tools used to recruit the machine.", "Many well-known vulnerabilities in the Windows operating system were exploited by 'bot net controllers to find and take over target machines.", "Especially coveted were home PCs sitting on broadband connections that are never turned off.", "The months of surveillance revealed that the different 'bot nets - which involve a few hundred to tens of thousands of machines - are used for a variety of purposes.", "Many are used as relays for spam, to route unwanted adverts to PC users or as launch platforms for viruses.", "But the research team found that many are put to very different uses.", "During the monitoring period, the team saw 'bot nets used to launch 226 distributed denial-of-service attacks on 99 separate targets.", "These attacks bombard websites with data in an attempt to overwhelm the target.", "Using a 'bot net of machines spread around different networks and nations makes such attacks hard to defend against.", "One DDoS attack was used by one firm to knock its competitors offline.", "Other 'bot nets were used to abuse the Google Adsense program that rewards websites for displaying adverts from the search engine.", "Some networks were used to abuse or manipulate online polls and games.", "Criminals also seem to be starting to use 'bot nets for mass identity theft, to host websites that look like those of banks so confidential information can be gathered and to peep into online traffic to steal sensitive data.", "\"The leveraging the power of several thousand bots, it is viable to take down almost any website or network instantly,\" said the researchers.", "\"Even in unskilled hands, it should be obvious that 'bot nets are a loaded and powerful weapon.\""], "smollm:1.7b": ["The text above summarizes the following key ideas:\n\n1.", "Hackers have recruited millions of computers on the internet to attack websites and pump out spam and viruses.", "2.", "The biggest network of hijacked home computers was made up of 50,000 machines.", "3.", "Data was gathered using machines that looked innocent but which logged everything hackers did to them.", "4.", "'Bot nets have been known about for some time, but estimates of how widespread they are from security firms vary widely.", "5.", "To gather its information the German arm of the Honeynet Project created software tools to log what happened to the machines they put on the web.", "6.", "Getting the machines hijacked was worryingly easy.", "The longest time a Honeynet machine survived without being found by an automatic attack tool was only a few minutes.", "The shortest compromise time was only a few seconds.", "7.", "Many well-known vulnerabilities in the Windows operating system were exploited by 'bot net controllers to find and take over target machines.", "8.", "But the research team found that many are used to launch DDoS attacks on 99 separate targets.", "These attacks bombard websites with data in an attempt to overwhelm the target.", "Using a 'bot net of machines spread around different networks and nations makes such attacks hard to defend against.", "One DDoS attack was used by one firm to knock its competitors offline.", "Other 'bot nets were used to abuse or manipulate online polls and games.", "Criminals also seem to be starting to use 'bot nets for mass identity theft, to host websites that look like those of banks so confidential information can be gathered and to peep into online traffic to steal sensitive data.", "\"Leveraging the power of several thousand bots, it is viable to take down almost any website or network instantly,\" said the researchers.", "\"Even in unskilled hands, it should be obvious that 'bot nets are a loaded and powerful weapon.\""], "deepseek-r1:1.5b": ["More than one million computers on the net have been hijacked for attacks.", "Security researchers discovered a massive number of remote-controlled machines across hundreds of networks.", "The largest zombie network had 50,000 compromised home keyboards.", "These \"zombie\" networks were tracked by Honeynet, using software to log compromised machines and report via IRC chat.", "Once hacked, they reported instructions from the malicious hacker behind the tool.", "exploit Windows vulnerabilities to take over machines.", "Also, saw various uses: spreading spam through relay networks, routing ads, abuse of Google's AdSense, controlling online polls/games, and targeting identity theft.", "Researchers found one firm launched 226 DDoS attacks on 99 targets, and others manipulated AdSense or controlled online traffic.", "With a few thousand bots, you can take down any network instantly, even with simple hands."], "tinyllama:1.1b": ["A group of security researchers gathered information on remotely-controlled machines known as \"zoombie networks\" by using networks of computers that act as \"honesty pots\" to attract hackers.", "The Honest Net Project, created by researchers in Germany, found that the different 'bot netts - which involve several thousand home computers sitting on broadband connections never turned off - are used for a variety of purposes such as launching distributed denial-of-service attacks, manipulating online poll results, stealing sensitive data, and taking down networks instantly.", "The researchers also found that the \"zoombie\" networks were used for mass identity theft and abuse of online polls and games.", "The Honest Net Project's detailed look at \"zoombie\" networks revealed a worryingly wide-spread range of uses."], "tinydolphin:1.1b": [" The German arm of Honeynet Project discovered numerous \"zombie\" networks made up of hijacked home computers for attacking websites and spreading malicious software.", "The extensive study by security researchers reveals how easy it is for attackers to compromise these devices, often using IRC chat channels or waiting instructions from the perpetrator.", "Honeynet Project estimates that there are approximately 50,000 zombie networks worldwide."], "phi:2.7b": [" The text discusses how more than one million computers on the internet have been hacked to attack websites and send spam.", "A group of security researchers used machines called honeypots to gather information about these hijacked computers.", "They found that hackers use vulnerabilities in Windows operating systems to take over PCs, especially those with broadband connections left on all day.", "The researchers discovered that these networks are used for a variety of purposes, including launching DDoS attacks and stealing sensitive data.", "It is concerning how easy it is for hackers to compromise machines using automated tools."], "orca-mini:3b": [" Hackers have recruited millions of computers on the internet to attack websites and pump out spam and viruses.", "The team behind the Honeynet Project, a group of security researchers, gathered information by creating software tools to log what happened to the machines they put online.", "Once compromised machines tend to report in to chat channels on IRC servers and wait for instructions from malicious hackers who recruited them.", "Many well-known vulnerabilities in the Windows operating system were exploited by 'bot net controllers to find and take over target machines, especially those sitting on broadband connections that are never turned off.", "The research found that 'bot nets are used for a variety of purposes, including launching 226 distributed denial-of-service attacks on 99 separate targets to overwhelm the target.", "They can also be used to abuse online polls and games, steal sensitive data through identity theft, and host websites that look like those of banks to gather confidential information.", "The research revealed that even unskilled hands can leverage the power of several thousand bots to take down almost any website or network instantly.", "Therefore, 'bot nets are a loaded and powerful weapon for criminals to use."], "hermes3:3b": ["Hackers control over 1m hijacked computers for spam, attacks, virus distribution, etc., often targeting Windows home PCs with always-on internet connections."], "stablelm-zephyr:3b": ["Security researchers found over 100 networks of hijacked computers, known as zombie networks or botnets, used for attacking websites, spreading spam and viruses.", "The Honeynet Project, a group that uses networks of computers to attract hackers and gather information about them, discovered the widespread use of these botnets.", "Some were used for DDoS attacks, abusing Google Adsense, manipulating online polls and games, or facilitating identity theft.", "The ease of compromising a machine was shown to be as short as a few seconds."], "chatgpt-4o-latest": ["More than one million computers have been hijacked to attack websites, send spam, and spread viruses, according to security researchers tracking over 100 networks of remotely-controlled machines.", "The Honeynet Project, a group studying hacker tactics, found that compromised computers, often home PCs on broadband, are quickly taken over and report to hackers via IRC channels.", "These 'bot nets, ranging from hundreds to tens of thousands of machines, are used for spam, virus distribution, denial-of-service attacks, online fraud, and identity theft.", "Some are even exploited for corporate sabotage and manipulating online services.", "Researchers warn that 'bot nets are a powerful and dangerous tool, capable of taking down almost any website or network."], "stablelm2:1.6b": ["Hackers have hijacked over one million computers to attack websites and spread spam and viruses.", "Security researchers tracked zombie networks of remotely controlled machines through honey pots, revealing the largest network consisted of hijacked home computers.", "Honeynet Project used software tools to log actions on hacked machines, finding many were exploited to launch DDoS attacks or abuse Google Adsense.", "The team saw potential for criminals to use 'bot nets' for identity theft and mass data gathering activities."], "granite3.1-dense:2b": ["Over one million computers, primarily home PCs on broadband connections, have been hijacked into botnets by security researchers as part of the Honeynet Project.", "The largest network discovered contained 50,000 compromised machines.", "Hackers easily exploited well-known Windows vulnerabilities to recruit these computers, which then reported to IRC chat channels for instructions.", "These botnets serve various malicious purposes:\n\n1.", "Spam relays, sending unwanted advertisements through the compromised network.", "2.", "Launchpads for viruses and other malware.", "3.", "Distributed Denial-of-Service (DDoS) attacks, which overwhelm target websites with data.", "4.", "Abuse of online services like Google Adsense to generate fraudulent revenue.", "5.", "Manipulation of polls, games, and other online platforms for personal gain or disruption.", "6.", "Mass identity theft and data exfiltration from banks' websites.", "7.", "Peeking into sensitive online traffic for information theft.", "The research found that once a machine is compromised, it usually reports back to its attacker within seconds or minutes.", "The extensive nature of these botnets underscores their potential as powerful weapons for criminals seeking to disrupt websites and steal sensitive data."]}