{"raw_text": "Sony PSP handheld console hits US\n \n The latest handheld gaming gadget, Sony's PlayStation Portable, goes on sale in the US on Thursday.\n \n The entertainment device, which also stores images, music and video, is intended to compete with Nintendo's DS, released earlier this month in the UK. Gamers have been queuing outside shops across the US to get their hands on the gadget, which costs $250 (about £132). The first million sold will come with the Spider-Man 2 film on UMD, Sony's own disc format for the device. The PSP can be linked up with others for multiplayer gaming, via a wireless connection. Sony has touted the machine as the Walkman of the 21st Century and has sold more than 800,000 units in Japan since its launch there last year.\n \n But it faces stiff competition from the Nintendo DS, which sold more than the GameCube in its first few days on release in Europe. It too allows for multiplayer gaming over the air. Nintendo dominates the handheld market, with more than a 90% share of the market in the US alone. The Gizmondo combined media player, phone and gaming gadget also went on sale in the UK last week. It hopes to take a share of the handheld gaming market too.\n \n \"The story of the PSP is it's not a gaming device as much as it is a portable entertainment device,\" said Michael Pachter, analyst at Wedbush Morgan Securities. He told the Reuters news agency that he expected Sony to sell about 10 million PSPs in enough time to rival Apple's iPod. There is no date for the PSP's release in Europe yet. Sony has promised to have a million units ready for its US launch, but there are fears demand may not be met. It also said it expected to ship three million PSPs worldwide by the end of its fiscal year ending 31 March.\n \n The machine's European launch was put back \"a few months\" last week in order to make sure enough of the devices were ready for its US launch, as well as satisfying the Japanese market. The PSP has almost as much processing power in it as the PlayStation 2 console. Hundreds of gamers gathered at US shops, some waiting for more than 36 hours, to be the first to get their hands on the gadget. A spokesman for one US shop said it expected the device to sell out on its first day. The 24 games for the mini console include Ape Academy, Formula One, Wipeout Pure and Fired Up. Movie studios, including Lions Gate Entertainment and Disney, have also announced forthcoming film titles that will be made available on the UMD format.\n", "llama3.2:1b": ["Sony's PlayStation Portable (PSP) is a handheld gaming device that was released in the US on Thursday.", "It costs $250 and includes a Spider-Man 2 film on UMD.", "The PSP can connect to others for multiplayer gaming via wireless connection, and it has sold over 800,000 units in Japan since its launch last year.", "Sony expects to sell around 10 million PSPs globally by the end of 2013."], "llama3.2:3b": ["Sony PSP handheld console goes on sale in US on Thursday, competing with Nintendo's DS, for $250.", "The device allows for multiplayer gaming and comes with a few pre-loaded games.", "Sony expects to sell 10 million units worldwide by end of fiscal year, rivaling Apple's iPod sales."], "gemma2:2b": ["Sony's PlayStation Portable (PSP) is being released in the US, competing with Nintendo's DS.", "The PSP offers multimedia features and multiplayer capabilities, priced at $250 and including a Spider-Man 2 film on its UMD disc format.", "While facing strong competition from the Nintendo DS and Gizmondo, Sony expects to sell millions of PSP units globally.", "The US launch saw long lines and anticipated immediate sales.", "Movie studios are also planning releases on the device's UMD platform."], "qwen2.5:0.5b": ["Sony's PSP device, which stores images, music and video, has been released in the US with $250 cost.", "It competes with Nintendo's DS, which allows for multiplayer gaming via wireless connection.", "The device features a wireless connection between PSPs, making it possible to use other devices simultaneously.", "Sony also announced a combined media player, phone and gaming gadget.", "It is hoped that more than 10 million units will be sold in Europe by the end of its fiscal year ending March 31."], "qwen2.5:1.5b": ["Sony's PlayStation Portable (PSP) handheld gaming console debuts in the US, competing with Nintendo's DS for market share in both countries.", "It launches at $250/£132 and features wireless multiplayer capabilities, aiming to attract 800,000+ units sold since its release last year in Japan.", "The PSP is set to face competition from Nintendo's DS and other handheld devices like Gizmondo, with Sony expecting a strong sales performance."], "qwen2.5:3b": ["Sony's PlayStation Portable (PSP) handheld gaming device hits the US market starting Thursday.", "It can store images, music, and video, competing with Nintendo's DS.", "The PSP costs $250 and comes with Spider-Man 2 on its own disc format, UMD.", "Aimed at gamers who often queue outside stores to buy it.", "Sony projects selling over 1 million units by the end of their fiscal year.", "The US launch was delayed a few months due to ensuring availability for European markets.", "Over 300 people waited up to 36 hours to get PSPs, indicating strong demand.", "With almost as much processing power as PlayStation 2, it includes games like Ape Academy and Formula One.", "Movie studios are also releasing films in the UMD format."], "opencoder:1.5b": ["The latest handheld gaming gadget, which is intended to compete with Nintendo's DS, has gone on sale in the US on Thursday.", "It also allows for multiplayer gaming over the air.", "The PSP can be linked up with others for wireless connection.", "The Gizmondo combined media player, phone and gaming gadget also went on sale in the UK last week.", "The handheld market is expected to face stiff competition from the Nintendo DS, which sold more than the GameCube in its first few days.", "It also promises to take a share of the handheld gaming market too.", "The PSP's European launch was put back \"a few months\" for enough devices to get ready for its US launch."], "smollm:1.7b": ["The Sony PSP handheld console hits US market in the US on Thursday, with a price tag of $250 (about £132).", "The device is designed to compete with Nintendo's DS and offers multiplayer gaming capabilities via wireless connection.", "Sony has touted the machine as the \"Walkman of the 21st Century\" and has sold more than 800,000 units in Japan since its launch there last year.", "However, it faces stiff competition from Nintendo's DS, which sold more than the GameCube in its first few days on release in Europe.", "The PSP is designed to be a portable entertainment device that can also store images, music and video.", "It has a 24-hour battery life and supports Wi-Fi connectivity for online gaming.", "The story of the PSP is it's not a gaming device as much as it is a portable entertainment device.", "The PSP is designed to be more than just a handheld console that allows gamers to play games on the go, but rather a device that can store media and provide access to music and video content.", "Sony has promised to sell about 10 million units in enough time to rival Apple's iPod, which has sold over 250 million units worldwide since its launch in 2006.", "There is no date for the PSP's release in Europe yet, but Sony has said it expects to ship three million units worldwide by the end of its fiscal year ending 31 March."], "deepseek-r1:1.5b": ["The Sony PSP handheld console is set to be sold in the U.S. on Thursday.", "The device, which combines storage for images, music, and video, aims to compete with Nintendo's DS, launched earlier in the UK.", "The SP offers portable entertainment, similar to the PlayStation 2, with features like multiplayer gaming via wireless connection.", "It costs $250 (£132) and is expected to sell around $10 million, competing with Apple's iPod.", "The European launch was delayed due to stock issues, though initial sales are expected to be high on the first day.", "The device supports several movies, including Ape Academy, Formula One, Wipeout Pure, and Fired Up."], "tinyllama:1.1b": ["As Sony's PlayStation Portable nears its US launch, the entertainment device has become a significant competitor to Nintendo's DS in terms of gamers and content availability.", "The first million units sold will come with the Spider-Man 2 film on UMD, but the machine also allows for multiplayer gaming, which is a unique selling point compared to other handheld consoles.", "Sony expects to sell over 10 million PSPs in time for its European launch, and hopes to compete with Apple's iPod for a share of the global portable entertainment market.", "In Japan, Sony has already sold more than 800,000 units in one month since their launch, and will likely continue to dominate the handheld console market as they have done in the past.", "The PlayStation Portable's European launch was delayed by almost two months due to ensuring enough devices were ready for its US launch."], "tinydolphin:1.1b": [" Sony's PlayStation Portable (PSP) handheld gaming console is set to hit shelves in the US this weekend.", "It features high-quality graphics and a range of games including popular titles such as Ape Academy, Formula One and Wipeout Pure.", "With the release of its 24 games for the compact device, developers are excited about the prospects of attracting a new generation of gaming enthusiasts."], "phi:2.7b": [" Sony's PSP handheld console hits US markets with $250 price tag, can store images, music and video, is intended to compete with Nintendo DS, which dominates the market, with over a 90% share of the US market alone.", "The machine has almost as much processing power in it as PlayStation 2, with three million expected worldwide by March 31, but fears about demand may not be met.", "There are no sales figures for Europe yet."], "orca-mini:3b": [" Sony's PlayStation Portable goes on sale in the US on Thursday, competing with Nintendo's DS.", "The entertainment device allows for multiplayer gaming over the air and has more than a 90% share of the handheld gaming market in the US alone.", "Sony hopes to rival Apple's iPod with the PSP, but there are concerns about supply.", "The device has almost as much processing power as the PlayStation 2 console and includes hundreds of games.", "The first million sold will come with the Spider-Man 2 film on UMD."], "hermes3:3b": ["Sony PSP handheld console releases in US, competing with Nintendo DS & Gizmondo; sold over 800k units in Japan.", "Aimed to rival iPods (10m units expected by Pachter)."], "stablelm-zephyr:3b": ["Sony's PlayStation Portable (PSP) went on sale in the US, targeting competition with Nintendo DS.", "The device offers entertainment, image, music, and video storage, with a price of $250 ($132 approx.).", "First shipments include Spider-Man 2 film.", "It enables multiplayer gaming via wireless connection and can be connected with others.", "Analyst Michael Pachter predicts Sony selling 10 million PSPs to rival Apple's iPod.", "The PSP faces competition from Nintendo DS dominating the handheld market with over 90% share in the US alone."], "chatgpt-4o-latest": ["Sony's PlayStation Portable (PSP) launches in the US, priced at $250, following its successful debut in Japan.", "The device, which supports gaming, music, video, and images, competes with Nintendo's DS in the handheld market.", "The first million units include Spider-Man 2 on Sony's UMD format.", "The PSP supports wireless multiplayer gaming and has been marketed as a 21st-century Walkman.", "Despite Nintendo's dominance in handheld gaming, Sony aims to sell 10 million PSPs, potentially rivaling Apple's iPod.", "The European release has been delayed to meet US and Japanese demand.", "The PSP, nearly as powerful as the PlayStation 2, has 24 launch games, and movie studios plan to release films on UMD.", "High demand has led to long queues, with some US stores expecting sellouts on launch day."], "stablelm2:1.6b": ["Sony's PSP handheld gaming device has been released in the US, with a price of $300 (around £200).", "It competes against Nintendo's DS for market share, and allows for wireless multiplayer gaming.", "The first million units sold will include Spider-Man 2 on UMD format.", "Sony has sold over 1 million PSPs in Japan since its launch, aiming to sell a million in the US within a year to rival Apple's iPod."], "granite3.1-dense:2b": ["Sony's PlayStation Portable (PSP), a versatile handheld gaming console, debuts in the US on Thursday at $250 per unit.", "The PSP, marketed as a \"Walkman of the 21st Century,\" competes with Nintendo's DS, which has already made significant strides in Europe.", "While Sony aims to sell about 10 million units globally, including one million during its US launch, it faces strong competition from Nintendo, which dominates the handheld market with over a 90% share in the US.", "The PSP supports various media formats, such as games, images, music, and video, and can be linked for multiplayer gaming.", "With nearly PlayStation 2's processing power, it features 24 launch titles, including Ape Academy, Formula One, Wipeout Pure, and Fired Up.", "Movie studios like Lions Gate Entertainment and Disney have also pledged forthcoming film releases on the UMD format.", "Despite pre-orders and eager crowds at US stores, there are concerns about meeting demand due to delayed European shipments."]}