{"raw_text": "Local net TV takes off in Austria\n \n An Austrian village is testing technology that could represent the future of television.\n \n The people of Engerwitzdorf are filming, editing and producing their own regional news channel. The channel covers local politics, sports, events and anything that residents want to film and are prepared to upload for others to watch on PCs. The pilot has been so successful that Telekom Austria is now considering setting up other projects elsewhere.\n \n \"It's growing unbelievably fast,\" said Rudolf Fischer, head of Telekom Austria's fixed line division. The trial of Buntes Fernsehen (Multi-Coloured TV) was started in late 2004 and creates a net-based TV station run by the 8,000 residents of Engerwitzdorf. The hardware and software to turn video footage into edited programmes has been provided by Telekom Austria but this equipment, following training, has been turned over to the villagers. Any video programme created by the villagers is uploaded to a Buntes Fernsehen portal that lets people browse and download what they want to watch. Most people watch the TV on their home PC and a broadband connection is needed to get broadcast quality programmes. In the first four months of the project villagers have created 60 films and put together regular reports on local news items. \"They have adopted it very quickly,\" said Mr Fischer. \"They like the possibility to create their own content and see what's going on in the area.\" \"It's kind of the democratisation of local TV,\" he said, \"because none of the bigger broadcasters would ever do anything like this for that region.\" The Buntes Fernsehen project has been such a success that Telekom Austria is now considering setting up other schemes in similarly rural areas. Mr Fischer said it was taking the roll-out to other areas slowly because of the work involved in setting up the scheme, getting backers from local government and educating people how to make programmes. The Engerwitzdorf scheme is an outgrowth of Telekom Austria's online TV channel Aon which lets people watch programmes on their PC. Aon streams a couple of live channels, plus sports, news and music programmes on to the net and has a pay-for-download section that lets people watch what they want when they want to watch it. In October a larger TV-on-demand project is due to launch in Vienna that will let people download many programmes from the net.\n", "llama3.2:1b": ["Austrian village Engerwitzdorf is producing its own regional news channel, Buntes Fernsehen (Multi-Coloured TV), using equipment provided by Telekom Austria and trained villagers who upload videos for others to watch online.", "The pilot has been successful enough for Telekom Austria to consider setting up similar projects in other rural areas."], "llama3.2:3b": ["Austrian village Engerwitzdorf tests technology for local, user-generated regional news channel with over 8,000 residents producing and uploading content to PCs, resulting in fast growth; Telekom Austria considers expanding similar projects elsewhere."], "gemma2:2b": ["A pilot program called Buntes Fernsehen (Multi-Coloured TV) enables residents of Engerwitzdorf, Austria to produce and upload their own regional news channel.", "Utilizing internet technology, video footage is edited and made available for local viewing on PCs via a dedicated portal.", "The project has been successful with 60 films produced in the first four months, showcasing its potential as a model for democratizing local TV broadcasting.", "Telekom Austria intends to replicate this initiative in other rural areas after careful planning and training."], "qwen2.5:0.5b": ["Austrian villagers are creating their own local television channel to produce news and other programming on PCs, using a new system called Buntes Fernsehen, which allows them to create their content and see what's happening in their area.", "The project is seen as a way to democratize local TV and has been successful enough that Telekom Austria is considering setting up more projects elsewhere in similar areas."], "qwen2.5:1.5b": ["Local TV pilot by residents of Engerwitzdorf, Austria, using telecommunication equipment turns videos into news reports uploaded online for others to watch.", "It's growing rapidly and could be a model for rural areas.", "Telekom Austria is considering expanding project in other regions due to its success."], "qwen2.5:3b": ["Local net TV takes off in Austria.", "Engerwitzdorf village tests technology for regional news channel, managed by 8,000 residents and funded by Telekom Austria.", "Successful pilot with over 60 films created; villagers quickly adapt to creating their own content.", "Project successful enough that Telekom Austria plans similar projects in rural areas.", "Engerwitzdorf scheme stems from online TV channel Aon.", "Larger TV-on-demand project slated for Vienna launch in October."], "opencoder:1.5b": ["The Austrian village is testing technology to represent the future of television.", "The residents of Engerwitzdorf are filming, editing and producing their own regional news channel.", "The pilot has been successful by Telekom Austria.", "The villagers have adopted it quickly as they created 60 films and put together regular reports on local news items.", "They like the possibility to create their own content and see what's going on in the area."], "smollm:1.7b": ["The Austrian village of Engerwitzdorf is testing technology that could represent the future of television, with local residents producing their own regional news channel and uploading their footage for others to watch on PCs.", "The pilot project has been so successful that Telekom Austria is now considering setting up other projects in similarly rural areas."], "deepseek-r1:1.5b": ["The Austrian village of Engerwitzdorf is testing a new TV technology through their local channel, Multi-Coloured TV.", "They create regional news content and have achieved success with their pilot project.", "Telekom Austria is expanding this approach to other rural areas due to the successful success of their trial in Engerwitzdorf."], "tinyllama:1.1b": ["Local net TV takes off in Austria, with the village of Engerwitzdorf piloting a project for producing and distributing their own regional news channel on PCs.", "The pilot has been so successful that Telekom Austria is considering setting up other projects in similar rural areas.", "The Buntes Fernsehen project offers local residents the chance to create their own content and see what's going on in their area, with no need for a broadband connection required to access the TV content.", "Telekom Austria is also exploring the potential of online TV channels, Aon, which streams live programmes on PCs and offers paid-for downloading options.", "A larger TV-on-demand project is set to launch in Vienna, with downloadable programmes for €2 per episode."], "tinydolphin:1.1b": [" Local Net TV Takes Off in Austria - A unique regional news channel is being launched, providing an innovative way for villagers to watch local news and events.", "The pilot has been so successful that Telekom Austria plans to launch similar projects in neighboring regions.", "This project follows a series of successful local initiatives in Engerwitzdorf and showcases the possibilities that technology can offer for democratizing local TV."], "phi:2.7b": [" An Austrian village is testing technology that could represent the future of television by filming, editing and producing their own regional news channel.", "The pilot has been so successful that Telekom Austria is considering setting up similar projects in other rural areas.", "Villagers have quickly adopted the scheme because they enjoy creating their own content and seeing what's happening in the area.", "The Buntes Fernsehen project involves uploading video programmes to a portal, where people can browse and download them.", "A larger TV-on-demand project is due to launch in Vienna in October."], "orca-mini:3b": [" An Austrian village is testing technology that could represent the future of television.", "The Engerwitzdorf project involves creating a net-based TV station run by the 8,000 residents of the village.", "The hardware and software to turn video footage into edited programmes has been provided by Telekom Austria but villagers have taken it upon themselves to create content and upload it to a portal for people to browse and download what they want to watch.", "The project has been successful with villagers creating 60 films in the first four months and Telekom Austria considering setting up other projects in similarly rural areas."], "hermes3:3b": ["Austrian village Engerwitzdorf tests local net TV, resulting successful pilot by Telekom Austria, considering similar projects elsewhere."], "stablelm-zephyr:3b": ["A village in Austria called Engerwitzdorf tested a future television system where 8,000 residents created their own regional news channel using video footage and editing equipment provided by Telekom Austria.", "The project, called Buntes Fernsehen (Multi-Coloured TV), allowed villagers to produce and upload their programs for others to view on PCs.", "In just four months, they made 60 films and regular news reports.", "Telekom Austria is now considering setting up similar projects in other rural areas."], "chatgpt-4o-latest": ["An Austrian village, Engerwitzdorf, is pioneering a community-run internet TV channel, Buntes Fernsehen, where residents film, edit, and upload local news, politics, sports, and events.", "Launched in late 2004 with support from Telekom Austria, the project has grown rapidly, with villagers producing 60 films in four months.", "The initiative allows residents to create and access content via a broadband connection, fostering local engagement.", "Telekom Austria sees it as a model for rural areas and is considering expansion, though cautiously due to setup challenges.", "The project stems from Telekom Austria’s Aon online TV service, which offers live streaming and on-demand content, with a larger TV-on-demand service set to launch in Vienna."], "stablelm2:1.6b": ["A small village in Austria, Engerwitzdorf, is testing technology to create their own regional news channel.", "They film, edit, and produce content for local politics, sports, events, and community interest.", "The project has been successful, prompting Telekom Austria to consider setting up similar projects in other rural areas.", "The hardware and software to transform video footage into edited programs was provided by Telekom Austria but has since been turned over to the villagers for production.", "In its first four months, villagers created 10 films and produced regular local news reports."], "granite3.1-dense:2b": ["Engerwitzdorf, an Austrian village of 8,000 residents, has launched a successful local news channel called Buntes Fernsehen (Multi-Coloured TV) using technology provided by Telekom Austria.", "Since its inception in late 2004, villagers have created and uploaded 60 films, covering local politics, sports, events, and other topics.", "This initiative has been well-received, as it empowers residents to create their own content and stay informed about area news.", "Telekom Austria, impressed by the project's rapid success, is now exploring expansion into other rural areas due to its potential for democratizing local television.", "The company aims to roll out similar schemes cautiously, focusing on initial setup, securing local support, and educating participants.", "This project is an extension of Telekom Austria's existing online TV service, Aon, which offers live channels, sports, news, and music via PCs.", "A larger TV-on-demand service in Vienna is set to launch in October, enabling extensive program downloads from the network."]}