{"raw_text": "Long life promised for laptop PCs\n \n Scientists are working on ways to ensure laptops can stay powered for an entire working day.\n \n Building batteries from new chemical mixes could boost power significantly, say industry experts. The changes include everything from the way chips for laptops are made, to tricks that reduce the power consumption of displays. Ever since laptops appeared the amount of time they last between recharges has been a frustration for users.\n \n A survey carried out in 2000 by Forrester Research found that the shortness of battery life was the most complained about feature of laptops. \"The focus back then was more on performance and features,\" said Mike Trainor, chief mobile technology evangelist for chip giant Intel.\n \n \"For most of the 90s battery life was stuck on two to 2.5 hours.\" But now, he said, laptops can last much longer. It was not just a case of improving battery life by squeezing more out of the lithium ion power packs, he explained. Other changes are needed to get to the holy grail of a laptop running for about eight hours before needing a recharge. \"Lithium ion is never going to get there by itself,\" he said. \"The industry has done a great job of wringing all possible energy storage out of that technology that they can.\" Some new battery chemistries promise to cram more power into the same space, said Mr Trainor, though work still needed to be done to get them successfully from the lab to manufacturing. He was sceptical that fuel cells would develop quick enough to take over from solid batteries even though they have the potential to produce several times more energy than lithium ion power packs. \"In fuel cells you need to have pumps and separators and evaporation chambers,\" he said. \"It's a mini energy plant that needs to be shrunk and shrunk and shrunk.\"\n \n Intel has been working with component makers to test energy consumption on all the parts inside a laptop and find ways to make them less power hungry.\n \n This work has led to the creation of the Mobile PC Extended Battery Life (EBL) Working Group that shares information about building notebooks that are more parsimonious with power. Some of the improvements in power use come simply because components on chips are shrinking, said Mr Trainor. Intel has also changed the way it creates transistors on silicon to reduce the power they need. On a larger scale, said Mr Trainor, improvements in the way that voltage regulators are made can reduce the amount of power lost as heat and make a notebook more energy efficient. Also, said Mr Trainor, research is being done on ways to cut energy consumption on displays - currently the biggest power guzzler on a laptop. Many laptop makers have committed to creating 14 and 15 inch screens that draw only three watts of power. This is far below the power consumption levels of screens in current notebooks. \"If we can get close to eight hours that's a place that people see as extraordinarily valuable that's what the industry has to deliver,\" Mr Trainor said.\n", "llama3.2:1b": ["Scientists are working on improving laptop battery life, with methods including using new chemical mixes and reducing power consumption of displays.", "The changes aim to boost power from 2-2.5 hours to around 8 hours before a recharge is needed.", "Industry experts point out that lithium ion batteries will never reach this level due to technical limitations, but other energy storage chemistries may be able to cram more power into the same space.", "Intel and component makers are working together to test and improve energy consumption on laptop parts, with some improvements coming from shrinking chip components and reducing transistor power needs."], "llama3.2:3b": ["Scientists are working on ways to extend laptop battery life to an entire working day by developing new chemical mixes, improving chip manufacturing and display power consumption reduction.", "Current lithium ion technology is not enough to achieve this goal alone, but other technologies like fuel cells have potential.", "Industry experts are testing energy consumption on all parts of laptops, making components more efficient, and researching ways to reduce power loss in displays."], "gemma2:2b": ["Scientists are working on ways to increase laptop battery life, aiming for an entire workday.", "New chemical mixes could boost power significantly, along with tricks reducing display energy consumption and optimizing chip designs.", "While lithium-ion batteries have limitations, new chemistries promise more power density.", "Fuel cells, despite potential, face challenges in miniaturizing.", "Intel's group (EBL) is sharing best practices to make laptops more power efficient.", "Efforts involve smaller components, improved transistor design, voltage regulators, and energy-efficient displays.", "Focus on reaching 8 hours of battery life is key for industry success."], "qwen2.5:0.5b": ["Laptops are expected to remain powered for an entire working day due to advances in battery technology and display improvements.", "Chips for laptops are currently being changed, while other factors including efficiency of transistors and changes in how batteries work are also being studied."], "qwen2.5:1.5b": ["Scientists aim to extend laptop battery life by enhancing chemical batteries, chip-making processes, and display power reduction techniques.", "Prior to 1990s, laptops could last only 2-2.5 hours between recharges; now they can run for up to eight hours.", "New chemistries promise more power in the same space, but manufacturing issues remain.", "Intel collaborates with component makers to optimize energy consumption across components.", "Research focuses on reducing voltage regulators' heat loss and cutting display power usage."], "qwen2.5:3b": ["Scientists are developing new battery chemistries and optimizing chip performance to extend laptop PC battery life significantly, aiming for at least 8 hours of continuous use.", "This follows initial limitations from lithium-ion batteries, which have reached their energy storage limits.", "Intel works with component makers on reducing power consumption across all parts inside a laptop.", "Improvements include shrinking components, altering transistor creation processes, and reducing display power consumption to under three watts—a reduction compared to current notebooks.", "These advancements aim to solve the persistent issue of short battery life in laptops from users."], "opencoder:1.5b": ["The text provided summarizes the following key points:\n\n1.", "Long life promised for laptop PCs.", "2.", "Scientists are working on ways to ensure laptops can stay powered for an entire working day.", "3.", "Building batteries from new chemical mixes could boost power significantly, say industry experts.", "4.", "A survey carried out in 2,000 by Forrester Research found that the shortness of battery life was the most complained about feature of laptops.", "5.", "\"The focus back then was more on performance and features,\" said Mike Trainor, chief mobile technology evangelist for chip giant Intel.", "6.", "He explained other changes to get to the holy grail of a laptop running for about eight hours before needing a recharge.", "7.", "Intel has been working with component makers to test energy consumption on all the parts inside a laptop and find ways to make them less power hungry.", "8.", "The Mobile PC Extended Battery Life (EBL) Working Group shares information about building notebooks that are more parsimonious with power.", "9.", "Improvements in power use come simply because components on chips are shrinking, said Mr Trainor.", "10.", "Energy consumption on displays - currently the biggest power guzzler on a laptop.", "\"If we can get close to eight hours that's a place that people see as extraordinarily valuable that's what the industry has to deliver,\" Mr Trainor said."], "smollm:1.7b": ["The following summary captures the main ideas and key details:\n\n1.", "A survey conducted in 2000 by Forrester Research found that the shortness of battery life was one of the most complained about features of laptops.", "2.", "The focus back then was on improving performance, but as time went on, other aspects were also being addressed to improve laptop battery life.", "3.", "Improvements made in battery technology have led to better power management and more efficient designs.", "4.", "New chemical mixes used in batteries can increase the amount of energy that can be stored per unit of weight.", "5.", "Other changes are needed to get from current battery technology to one that lasts for about 8 hours without needing a recharge.", "6.", "The work done by Intel with component makers has led to the creation of the Mobile PC Extended Battery Life (EBL) Working Group, which shares information about building notebooks that last longer.", "7.", "Improvements in power consumption come from reducing the amount of energy lost as heat and making more efficient designs for displays.", "8.", "Research is being done on ways to cut energy consumption on displays, but it's a complex task due to the many factors involved.", "9.", "If we can get close to 14-inch screens that draw only three watts of power, people will be impressed with the industry's progress towards creating more energy-efficient laptops."], "deepseek-r1:1.5b": ["Long-term laptop battery life is crucial for user satisfaction.", "Experts focus on extending this beyond two to 2.5 hours, aiming for at least eight hours through innovative solutions.", "New batteries and energy-efficient components are essential, with developments targeting 14-inch screens consuming only three watts of power.", "Intel contributes by optimizing chip performance and using advanced display technologies."], "tinyllama:1.1b": ["Scientists are working on ways to prolong laptop battery life by reducing energy consumption in various parts, including components and power usage in laptops.", "The focus of this research is improving energy efficiency through changes to how chipmakers create transistors, voltage regulators, and displays.", "This work has led to the creation of a group called the Mobile PC Extended Battery Life (EBL) Working Group that shares information on building battery-friendly laptops.", "The group has been working on reducing power consumption in laptop batteries by shrinking components and making voltage regulators more efficient, as well as developing displays that consume less power.", "Other changes being investigated are fuel cells that can take over from solid battery technology and using new battery chemistries with greater energy storage capacity.", "These efforts will help extend laptop battery life while increasing their efficiency, ultimately leading to longer lasting devices that users can use for an entire working day."], "tinydolphin:1.1b": [" Summarized: Scientists have been working on ways to make laptop batteries more powerful, by changing how chips are made and by using new battery chemistries.", "By shrinking components and reducing power loss, they can create notebooks that last longer between recharges.", "Intel has formed a group called the Mobile PC Extended Battery Life (EBL) Working Group to share ideas about improving power usage in laptops.", "This will help in creating more energy-efficient computers."], "phi:2.7b": [" Scientists are working on ways to extend laptop battery life, such as creating new chemical mixtures and developing more efficient chips.", "Industry experts believe these improvements will help make laptops last longer between recharges.", "A survey conducted in 2000 found that many users were frustrated by the short battery life of their laptops.", "While lithium ion technology has improved, it is not enough on its own to meet the goal of eight hours of continuous use.", "New battery chemistries and components with lower power consumption are being developed to increase laptop battery life.", "Intel, a chip giant, has been working with other companies to test energy usage and find ways to make laptops more efficient.", "This work has led to the creation of the Mobile PC EBL Working Group, which shares information about creating energy-efficient laptops."], "orca-mini:3b": [" Scientists are working on ways to increase the battery life of laptops by at least eight hours.", "New chemical mixes used in building batteries can significantly boost power, according to industry experts.", "Battery life was previously stuck at two to 2.5 hours, but now laptops can last much longer.", "Other changes are needed to get to the goal of a laptop running for about eight hours before needing a recharge.", "The industry has made significant improvements in lithium ion batteries, but there is still room for improvement.", "Some new battery chemistries promise more power and can be shrunken to fit into the same space.", "Intel has been working on reducing energy consumption on all components inside laptops, including reducing power use on displays and improving voltage regulators.", "The industry must also work on cutting energy consumption on displays.", "If they can get close to eight hours, it would be a valuable feature for laptop users."], "hermes3:3b": ["Laptops aiming for full working day battery life; scientists working on improved chemical mixes, chip & display power reduction."], "stablelm-zephyr:3b": ["Scientists are working on improving laptop battery life by building batteries with new chemical mixes and reducing power consumption of displays, both through smaller chip components and more efficient voltage regulation.", "The goal is to eventually achieve eight hours of continuous use without needing a recharge.", "Intel has created the Mobile PC Extended Battery Life Working Group to share information about making laptops more energy-efficient."], "chatgpt-4o-latest": ["Scientists and industry experts are working on ways to extend laptop battery life to last an entire workday.", "Improvements include new battery chemistries, more efficient chips, and reduced power consumption in displays.", "While lithium-ion batteries have been optimized as much as possible, new chemical mixes and alternative technologies like fuel cells are being explored, though challenges remain.", "Intel and other companies are collaborating to make laptop components more energy-efficient, including shrinking chip components, improving voltage regulators, and developing low-power displays.", "The goal is to achieve around eight hours of battery life, which is seen as highly valuable to users."], "stablelm2:1.6b": ["Scientists are working on increasing laptop battery life by up to eight hours, thanks to improvements in chip-making and reducing power consumption from displays.", "The issue of battery life has been frustrating users for years, with surveys showing it as the most complained-about feature.", "Industry experts suggest changes such..", "The text discusses efforts to improve laptop battery life through advancements in technology, including making chips to reduce power consumption and changing the way transistors are created on silicon.", "Research is being conducted on cutting energy use on displays, as well as exploring ways to make laptops more efficient by reducing heat generated by voltage regulators.", "Intel has been working with component makers to test energy consumption across laptop parts and create a Mobile PC Extended Battery Life (EBL) Working Group to collaborate on building more power-efficient notebooks."], "granite3.1-dense:2b": ["Scientists and industry experts are focusing on extending laptop battery life from the typical 2-2.5 hours to about eight hours, addressing users' primary frustration since laptops' inception.", "This improvement relies on several strategies:\n\n1.", "New chemical battery mixes for greater power density.", "2.", "Enhanced chip manufacturing processes to reduce power consumption.", "3.", "Techniques to lower display power usage, currently the most significant drain.", "4.", "Ongoing collaboration between Intel and component makers to test and minimize energy-intensive components within laptops.", "5.", "Development of smaller, more efficient voltage regulators to reduce heat-related power loss.", "6.", "Investment in research for highly efficient display technology.", "7.", "Industry commitments to produce 14 and 15-inch screens consuming only three watts, substantially lower than current power-hungry displays.", "The shift from lithium ion batteries alone is necessary due to their limited energy storage capabilities.", "Fuel cells, despite potential for higher energy production, face challenges in scaling down into practical laptop components."]}