{"raw_text": "Net fingerprints combat attacks\n \n Eighty large net service firms have switched on software to spot and stop net attacks automatically.\n \n The system creates digital fingerprints of ongoing incidents that are sent to every network affected. Firms involved in the smart sensing system believe it will help trace attacks back to their source. Data gathered will be passed to police to help build up intelligence about who is behind worm outbreaks and denial of service attacks.\n \n Firms signing up for the sensing system include MCI, BT, Deutsche Telekom, Energis, NTT, Bell Canada and many others. The creation of the fingerprinting system has been brokered by US firm Arbor Networks and signatures of attacks will be passed to anyone suffering under the weight of an attack. Increasingly computer criminals are using swarms of remotely controlled computers to carry out denial of service attacks on websites, launch worms and relay spam around the net. \"We have seen attacks involving five and ten gigabytes of traffic,\" said Rob Pollard, sales director for Arbor Networks which is behind the fingerprinting system. \"Attacks of that size cause collateral damage as they cross the internet before they get to their destination,\" he said. Once an attack is spotted and its signature defined the information will be passed back down the chain of networks affected to help every unwitting player tackle the problem.\n \n Mr Pollard said Arbor was not charging for the service and it would pass on fingerprint data to every network affected. \"What we want to do is help net service firms communicate with each other and then push the attacks further and further back around the world to their source,\" said Mr Pollard. Arbor Network's technology works by building up a detailed history of traffic on a network. It spots which computers or groups of users regularly talk to each other and what types of traffic passes between machines or workgroups. Any anomaly to this usual pattern is spotted and flagged to network administrators who can take action if the traffic is due to a net-based attack of some kind. This type of close analysis has become very useful as net attacks are increasingly launched using several hundred or thousand different machines. Anyone looking at the traffic on a machine by machine basis would be unlikely to spot that they were all part of a concerted attack. \"Attacks are getting more diffuse and more sophisticated,\" said Malcolm Seagrave, security expert at Energis. \"In the last 12 months it started getting noticeable that criminals were taking to it and we've seen massive growth.\" He said that although informal systems exist to pass on information about attacks, often commercial confidentiality got in the way of sharing enough information to properly combat attacks.\n", "llama3.2:1b": ["Here is a concise summary of the text:\n\nNet fingerprints software has been deployed by 80 large net service firms to detect and stop net-based attacks automatically.", "The system creates digital fingerprints of ongoing incidents that are sent to every network affected, helping police build intelligence about attackers.", "Companies involved in the system include MCI, BT, Deutsche Telekom, Energis, and NTT.", "The software is not charging for its services, but will pass on fingerprint data to all networks affected, allowing administrators to track down the source of attacks."], "llama3.2:3b": ["Eighty large net service firms have switched to a software system that automatically detects and stops network attacks by creating digital fingerprints of ongoing incidents sent to affected networks to help trace the source of attacks.", "The system is being brokered by US firm Arbor Networks and will pass attack signatures to all affected networks, including law enforcement."], "gemma2:2b": ["Eighty large network service firms are using software to automatically detect and stop cyberattacks.", "The system creates digital fingerprints of attacks, which are shared with affected networks, helping identify attack sources.", "Data will be passed to law enforcement for further investigation.", "Arbor Networks, a US firm behind the system, is not charging fees, and data sharing is facilitated across networks.", "This close analysis helps combat increasingly sophisticated denial-of-service, worm, and spam attacks."], "qwen2.5:0.5b": ["Net service firms can now have \"digital fingerprints\" of ongoing incidents automatically detected and stopped by sensors.", "These will be passed down to police if they are traced back to their source.", "Firms involved include MCI, BT, Energis, NTT, Bell Canada, Deutsche Telekom, and many others.", "Arbor Networks is developing a system that uses this technology."], "qwen2.5:1.5b": ["Eighty large internet service providers have implemented a new system that creates digital fingerprints of ongoing incidents to automatically stop cyberattacks and gather intelligence against worm outbreaks and denial-of-service attacks.", "The fingerprinting technology is provided by Arbor Networks, which will share signatures with victims for use in tracing back the source of these attacks."], "qwen2.5:3b": ["Eighty large net service firms have switched on software to detect and stop automatic attacks.", "A fingerprinting system created by Arbor Networks helps trace attacks back to their source, aiding police intelligence gathering.", "The system includes MCI, BT, Deutsche Telekom, NTT, Bell Canada among others.", "Attacks involve swarms of remotely controlled computers causing denial-of-service and spam attacks, with some reaching up to 5-10 GB traffic.", "Arbor's fingerprinting service collects data from every network affected, helping in combating these attacks.", "The technology builds a detailed history of traffic patterns; any anomaly is flagged for further investigation by network administrators.", "This type of close analysis is crucial as more sophisticated and diffuse attacks are becoming common, often hindered by confidentiality issues in informal information-sharing systems."], "opencoder:1.5b": ["The key ideas and details from the given text are:\n\n1.", "The system creates digital fingerprints of ongoing incidents.", "2.", "Firms including MCI, BT, Deutsche Telekom, Energis, NTT, Bell Canada and many others.", "3.", "US firm Arbor Networks is the broker for the creation of the fingerprinting system.", "4.", "Signatures of attacks are passed to anyone suffering under the weight of an attack.", "5.", "Computer criminals are using swarms of remotely controlled computers to carry out denial-of-service (DoS) attacks.", "6.", "Attack signatures cause information back to be passed down the chain of networks affected.", "7.", "The information about an attack is used by network administrators to take action.", "8.", "Regular analysis of network traffic helps spot unusual patterns that indicate a potential DoS attack.", "9.", "The use of fingerprint data helps net service firms communicate with each other and push the attacks further back around the world.", "10.", "The technology works by building up a detailed history of traffic on a network.", "11.", "Any anomaly to this usual pattern is spotted and flagged for action.", "12.", "Attacks are getting more diffuse and more sophisticated as net attacks become increasingly popular."], "smollm:1.7b": ["The summary should contain only the most important points from the original text:\n\n1.", "The article discusses the development and implementation of a smart sensing system by Arbor Networks that aims to detect and prevent net attacks.", "2.", "The system creates digital fingerprints of ongoing incidents, which are sent to every network affected.", "3.", "Firms involved in the smart sensing system believe it will help trace attacks back to their source.", "4.", "Data gathered from the fingerprinting system is passed on to police for further analysis and investigation.", "5.", "The article highlights the increasing complexity of net attacks and the need for more advanced systems to combat them effectively."], "deepseek-r1:1.5b": ["Eighty large net service firms have switched on software to automatically spot and stop net attacks by creating digital fingerprints.", "These fingerprints are sent to affected networks, helping trace attacks back to their sources and protecting against worm and denial-of-service (DoS) attacks.", "Arbor Networks, a US firm, brokered this system with clients like MCI, BT, Deutsche Telekom, and Energis.", "The system monitors traffic between machines, spotting anomalies indicating an attack.", "Once spotted, data is passed through networks to help every affected player tackle the problem.", "Arbor's fingerprinting helps combat increasingly sophisticated DoS and worm attacks by creating detailed traffic history.", "Rob Pollard from Arbor noted growing sophistication in attacks, with DoS attempts rising.", "Malcolm Seagrave at Energis highlights the need for continuous monitoring against advanced attacks due to confidentiality barriers."], "tinyllama:1.1b": ["Net-fingerprinting system aims to automatically spot and mitigate internet attacks by creating digital fingerprints from ongoing incident data that is sent to all network affected.", "The system, known as Arbor Networks' \"smart sensing\", involves creating detailed history of traffic on a network and flagging any anomaly as a potential net-based attack signal.", "Any close analysis of the traffic by network administrators can reveal more subtle attacks or anomalies, while commercial confidentiality may hinder sharing enough information for proper combat against such attacks."], "tinydolphin:1.1b": [" The eight large net service firms have switched on a new system that automatically detects and stops net attacks.", "This fingerprinting system uses advanced technology developed by Arbor Networks to create digital fingerprints of the ongoing incidents and pass them on to affected networks for further investigation.", "As attacks become more sophisticated, this system becomes increasingly useful in tracing back the origin of a worm outbreak or denial-of-service attack.", "The fingerprinting system has been brokered by US firm Arbor Networks and includes signatures of attacks on networks such as MCI, BT, Deutsche Telekom, Energis, NTT, Bell Canada and many others."], "phi:2.7b": [" More than 80 large net service firms have switched on software to automatically detect and stop net attacks by creating digital fingerprints of ongoing incidents.", "This system will help trace attacks back to their source and provide data for police investigations.", "Arbor Networks is developing the fingerprinting system, which will be used by various firms worldwide to track down cyber criminals using swarms of remotely controlled computers."], "orca-mini:3b": [" The text reports that 80 large net service firms have switched on software to spot and stop net attacks automatically.", "This system creates digital fingerprints of ongoing incidents and sends them to every network affected.", "Data gathered will be passed to police to help build up intelligence about who is behind worm outbreaks and denial of service attacks.", "Arbor Networks is behind the fingerprinting system, which works by building up a detailed history of traffic on a network.", "It spots which computers or groups of users regularly talk to each other and what types of traffic passes between machines or workgroups.", "Any anomaly in this usual pattern is spotted and flagged to network administrators who can take action if the traffic is due to a net-based attack of some kind.", "The system has been broached by US firm Arbor Networks and fingerprint data will be passed back down the chain of networks affected.", "It is reported that Arbor Network's technology works by building up a detailed history of traffic on a network."], "hermes3:3b": ["Net fingerprinting system for automatic detection and stopping of network attacks, used by 80+ firms like MCI, BT etc.", "; helps trace attacks back to their source; passed to police for intel on attackers."], "stablelm-zephyr:3b": ["Eighty large net service firms have implemented software to identify and stop automated net attacks automatically.", "This system creates digital fingerprints of ongoing incidents and shares them with all affected networks.", "The data will be given to police to help identify the sources of worm outbreaks and denial of service attacks.", "Arbor Networks, a US firm, is behind this fingerprinting system and provides the service for free.", "By analyzing traffic patterns on networks, they can recognize when traffic is part of a coordinated attack.", "This has become essential as attacks have grown more widespread and sophisticated."], "chatgpt-4o-latest": ["Eighty major internet service firms have implemented a system to detect and stop cyberattacks automatically by creating digital fingerprints of incidents and sharing them with affected networks.", "Developed by Arbor Networks, the system helps trace attacks to their source and provides data to law enforcement.", "Companies like MCI, BT, and Deutsche Telekom are participating.", "The system identifies unusual traffic patterns to detect attacks, which are increasingly launched using large networks of compromised computers.", "Arbor Networks offers the service for free to improve communication among firms and push attacks back to their origin.", "Experts note that cyberattacks are becoming more sophisticated, and while informal information-sharing exists, commercial confidentiality often hinders effective collaboration."], "stablelm2:1.6b": ["80 large net service firms have implemented a software system to detect and stop internet attacks automatically.", "The smart sensing system creates digital fingerprints of ongoing incidents sent to all affected networks.", "Firms will pass data to police for building intelligence about attackers, including denial-of-service attacks.", "Net criminals use remotely controlled computers to launch attacks on websites, distribute worms, and relay spam.", "Arbor Networks is responsible for the fingerprinting system that identifies attack signatures, providing network administrators with actionable information.", "The service is not charged by Arbor Networks, and they will pass data to every affected network."], "granite3.1-dense:2b": ["80 major net service companies have adopted a software system by US firm Arbor Networks to automatically detect and thwart cyber attacks.", "This system generates digital fingerprints of ongoing incidents, which are then disseminated among affected networks.", "The data collected will be shared with law enforcement to aid in identifying the perpetrators behind worm outbreaks, denial-of-service attacks, and spam relaying.", "Participating firms include MCI, BT, Deutsche Telekom, Energis, NTT, and Bell Canada.", "The system's effectiveness lies in its ability to track attacks involving multiple computers, often remotely controlled by criminals.", "Notably, Arbor Networks is not charging for this service and will provide fingerprint data to every affected network.", "This technology builds upon a detailed traffic history analysis, identifying abnormal patterns indicative of cyberattacks.", "As attacks become more distributed and sophisticated, this system aims to help net service providers trace them back to their sources, enhancing overall security in the digital landscape."]}