{"raw_text": "Microsoft plans 'safer ID' system\n \n Microsoft is planning to make Windows and Internet Explorer more secure by including software to give people more control over personal information.\n \n \"Info cards\" will help people manage personal details on their PCs to make online services safer, said Microsoft. Microsoft's two previous programs, Passport and Hailstorm, aimed to protect users but were criticised. ID fraud is one of the UK's fastest-growing crimes, with criminals netting an estimated £1.3bn last year. A quarter of UK adults has either had their ID stolen, via hi-tech or other means, or knows someone who has, a recent report by Which? magazine found.\n \n Microsoft is developing a new version of Internet Explorer browser and its operating system, Windows, which has been code-named Longhorn. Michael Stephenson, director in Microsoft's Windows Server division, would not confirm however whether the new info cards ID system will be built into the current Windows XP version or Longhorn.\n \n \"We're trying to make the end-user experience as simple as possible,\" Mr Stephenson said. The system would differ from its previous attempts to make online transactions more secure, said Microsoft. While Passport and Hailstorm stored user information centrally on the net, the latest system will store data on a user's PC. \"It's going to put control of digital IDs into the hands of an end-user, the end-user will be in full control,\" said Mr Stephenson.\n \n Hailstorm was criticised by privacy campaigners for putting too much sensitive information into the hands of a single company. Passport provides a single log-in for more than one website and stores basic personal information. But its popularity suffered after security scares. Up to 200 million Passport accounts were left vulnerable to online theft and malicious hackers after a flaw in the system was exploited in 2003. Online auction site, eBay, stopped supporting it in January 2005. Although the flaw was fixed, Microsoft has come under regular criticism for the number of security loopholes in Internet Explorer. Last year, it released a major security update for Windows, Service Pack 2, to combat some of the security concerns. Longhorn is due to be released commercially in late 2006, but an updated version of Internet Explorer is due for release later this year.\n", "llama3.2:1b": ["Microsoft plans to develop software to help people control their personal information on their PCs and make online services safer by creating \"info cards\" that allow users to manage their details.", "The system will differ from its previous attempts at making online transactions more secure, storing data on the user's PC rather than a centralized location."], "llama3.2:3b": ["Microsoft plans to include software that gives users more control over their personal information on PCs with a new \"Info cards\" system as part of Windows and Internet Explorer updates.", "The system aims to make online services safer by storing data on the user's PC, rather than centrally on the net.", "Microsoft is developing Longhorn, an updated version of Windows XP and Internet Explorer, which will have a simpler end-user experience and be designed with security in mind."], "gemma2:2b": ["Microsoft plans to implement a new system called \"info cards\" in Windows and Internet Explorer to enhance online security by giving users more control over their personal information.", "This system will store data on user PCs instead of centrally on the net, like previous systems.", "Microsoft aims to simplify the end-user experience while improving security and addressing past criticisms regarding privacy.", "Past attempts to improve online security (Passport and Hailstorm) were criticized for centralized storage of sensitive information and vulnerabilities, leading to issues such as security breaches and the discontinuation of Passport support.", "Longhorn, Microsoft's next operating system release, is expected to include this new ID system in later 2006.", "An updated Internet Explorer version will also be released later this year."], "qwen2.5:0.5b": ["Microsoft plans to add software that allows users to more easily manage their personal information on Windows and Internet Explorer.", "This system includes \"info cards\" that help people keep track of sensitive details online.", "The ID fraud problem in the UK has grown significantly, with 40% of adult Britons having lost or stolen their identity since last year's data breach.", "Microsoft is developing a new version of Internet Explorer called Longhorn that includes this new system and will be released later this year."], "qwen2.5:1.5b": ["Microsoft plans a safer ID system using \"info cards\" that will store personal details on users' PCs instead of storing them centrally and making online services more secure by giving end-users control over their IDs."], "qwen2.5:3b": ["Microsoft plans to introduce safer ID system with \"info cards\" in its upcoming Windows and Internet Explorer software to give users more control over personal information on their PCs.", "The move aims to improve security for online services after previous programs like Passport and Hailstorm faced criticism, including fraud cases costing the UK £1.3bn last year.", "Microsoft claims the new system will be simpler than its previous attempts as it stores data locally instead of centrally.", "Previous systems like Passport stored sensitive information on a single company's server, leading to privacy concerns and security issues such as an exploit in 2003 that exposed over 200 million accounts.", "Longhorn is due for release commercially in late 2006 with an updated version of Internet Explorer expected later this year."], "opencoder:1.5b": ["Microsoft plans 'safer ID' system.", "Microsoft is planning to make Windows and Internet Explorer more secure by including software that gives people more control over personal information.", "The new system will help users manage their personal details on their PCs to make online services safer, Microsoft's two previous programs, Passport and Hailstorm, were criticised.", "ID fraud is one of the UK's fastest-growing crimes, with criminals netting an estimated £1.3bn last year.", "A quarter of UK adults have either had their ID stolen via hi-tech or other means, or knows someone who has, a recent report by Which?", "magazine found.", "Microsoft is developing a new version of Internet Explorer browser and its operating system, Windows, which has been code-named Longhorn.", "The director of Microsoft's Windows Server division, Michael Stephenson said the new info cards ID system will be built into the current Windows XP version or Longhorn.", "\"We're trying to make the end-user experience as simple as possible,\" Mr Stephenson said.", "The system would differ from its previous attempts to make online transactions more secure.", "Passport and Hailstorm stored user information centrally on the net, but the latest system will store data on a user's PC.", "\"It's going to put control of digital IDs into the hands of an end-user, the end-user will be in full control,\" said Mr Stephenson.", "Hailstorm was criticized by privacy campaigners for putting too much sensitive information into the hands of a single company.", "Passport provides a single log-in for more than one website and stores basic personal information.", "But its popularity suffered after security scares.", "Up to 200 million Passport accounts were left vulnerable to online theft and malicious hackers after a flaw in the system was exploited in 2003. eBay stopped supporting it in January 2005, although the flaw was fixed but Microsoft has been under regular criticism for the number of security loopholes in Internet Explorer this year.", "Last year, it released a major security update for Windows, Service Pack 2 to combat some of the security concerns.", "Longhorn is due to be released commercially in late 2006, but an updated version of Internet Explorer is due for release later this year."], "smollm:1.7b": ["Microsoft plans safer ID system by including software to give people more control over personal information.", "The company is developing a new version of Internet Explorer browser and its operating system, Windows, which has been code-named Longhorn.", "Microsoft will not confirm whether the new info cards ID system will be built into the current Windows XP version or Longhorn."], "deepseek-r1:1.5b": ["Microsoft is planning to introduce a 'safer ID' system that will enhance users' control over their digital information.", "The new system, which will replace the previous passport and longhorn systems, will store user data on their personal computers, giving end-users full control.", "This change aims to address security concerns by ensuring better protection of personal details.", "The introduction of this system is part of Microsoft's efforts to combat ID fraud, particularly in the UK, where it is estimated that a significant portion of criminals are involved."], "tinyllama:1.1b": ["Microsoft is developing a new \"safer ID\" system that will give people more control over personal information on their computers to make online services safer.", "The company's previous programs, Passport and Hailstorm, aimed to protect users but were criticized for being too complex and vulnerable to attacks.", "A new version of Internet Explorer, known as Longhorn, is also planned for later this year.", "The \"safer ID\" system will differ from its previous attempts to make online transactions more secure by putting control of digital IDs into the hands of an end-user, the company has said.", "Despite criticism, Microsoft has stated that it plans to fix security holes in Internet Explorer and update Windows, Service Pack 2, later this year."], "tinydolphin:1.1b": [" Microsoft plans to develop a new ID system for personal information management on their Windows and Internet Explorer platforms, with options for controlling user data on their PCs.", "This move comes amid concerns about the security of online transactions and accounts.", "The new system would differ from previous efforts in that it will store data on a user's personal computer.", "Microsoft's plans to create this ID system are being led by Michael Stephenson, director of Microsoft's Windows Server division.", "The system is aimed at making online transactions more secure and user-friendly.", "Adoption of this new system would put control back into the hands of the end-user, who will be able to store data on their personal computers, storing it in a way that is secure and controlled by them.", "This move comes after the popularity of Passport, which stores user information for multiple online services.", "However, criticism has been leveled against Microsoft's security measures with regards to Passport, as its vulnerabilities have exposed personal information to attackers.", "Longhorn, the new version of Windows XP and Internet Explorer, is expected to be released in late 2006 and will introduce a new way for users to manage their online accounts, while also addressing some of the security concerns faced by previous Microsoft products."], "phi:2.7b": [" Microsoft is developing a new system called \"Info cards\" that will allow users to manage their personal information on PCs and make online services safer.", "The company plans to include the system in its two upcoming products, Windows Vista and Internet Explorer 7.", "While earlier attempts by Microsoft to enhance security were criticised for storing user data centrally on the internet, Info Cards will store information on a PC.", "This will give users more control over their digital IDs while making transactions online safer.", "The new system is expected to be released in late 2006."], "orca-mini:3b": [" Microsoft plans to introduce a new system called Info Cards that will help people manage their personal details on their computers to make online services safer.", "The system will be built into Windows and Internet Explorer and will give users more control over their personal information.", "However, the company has not confirmed whether it will be included in the current version of Windows XP or Longhorn.", "Microsoft's previous attempts to protect users, including Passport and Hailstorm, were criticized for storing user information centrally on the internet.", "The new system will store data on a user's computer."], "hermes3:3b": ["Microsoft plans 'safer ID' system (Info cards for controlling personal info on PCs); differs from Passport & Hailstorm."], "stablelm-zephyr:3b": ["Microsoft is working on a safer ID system for Windows and Internet Explorer.", "Called \"info cards,\" these software tools will help users manage personal details and make online services more secure.", "Microsoft's previous attempts at protecting users, Passport and Hailstorm, were criticized for storing user information centrally or in the hands of a single company.", "The new system, set to be built into Windows XP and Longhorn, stores data on a user's PC instead of centrally on the internet, giving control back to the end-user."], "chatgpt-4o-latest": ["Microsoft is developing a new \"info cards\" system to enhance security in Windows and Internet Explorer by giving users more control over personal data.", "Unlike previous attempts such as Passport and Hailstorm, which stored user information centrally, the new system will keep data on users' PCs, addressing privacy concerns.", "ID fraud is a growing issue in the UK, with significant financial losses.", "Microsoft is also working on a new version of Internet Explorer and its upcoming operating system, Longhorn, though it is unclear if the new ID system will be integrated into Windows XP or Longhorn.", "Previous security flaws in Passport led to vulnerabilities and criticism, prompting Microsoft to release security updates.", "Longhorn is expected in late 2006, with an updated Internet Explorer arriving earlier."], "stablelm2:1.6b": ["Microsoft plans to introduce 'safer ID' software into its Windows and Internet Explorer products to provide users with more control over personal information.", "This new system called \"Info cards\" will enable people to manage their personal details on PCs, making online services safer.", "Microsoft's previous programs, Passport and Hailstorm, aimed to protect users but faced criticism due to storing user data centrally on the internet.", "The new system differs from previous attempts to make transactions more secure as it stores data locally on a user's PC.", "Microsoft aims for an end-user experience with the \"safer ID\" system being in full control of the digital IDs.", "However, there are concerns about potential security loopholes in Internet Explorer despite efforts made by Microsoft last year to combat these issues through a major security update for Windows, Service Pack.."], "granite3.1-dense:2b": ["Microsoft is developing enhanced security features for its Windows and Internet Explorer operating systems, dubbed \"info cards,\" to empower users with greater control over their personal information.", "This new system aims to address ID fraud concerns, as the UK has seen a £1.3bn annual loss due to identity theft.", "A recent Which?", "magazine report indicates that 25% of UK adults have experienced or know someone with stolen IDs.", "Unlike previous initiatives like Passport and Hailstorm, which centralized user data on the net and faced criticism for potential privacy violations, Microsoft's new info cards will store sensitive information locally on users' devices.", "This approach intends to simplify the end-user experience while maintaining control over digital IDs.", "Michael Stephenson, director in Microsoft's Windows Server division, confirmed that users will have full command over their stored data.", "Microsoft is working on an updated version of Internet Explorer and Longhorn, its upcoming operating system.", "While it remains unclear whether these features will be integrated into current Windows XP or Longhorn, the company aims to improve security and alleviate concerns related to past centralized systems.", "Microsoft has already addressed some security issues with Internet Explorer by releasing Service Pack 2 in 2004, following a significant flaw in 2003 that exposed up to 200 million Passport accounts to theft.", "Longhorn is scheduled for commercial release in late 2006, and an updated Internet Explorer version is expected later this year."]}