{"raw_text": "France starts digital terrestrial\n \n France has become the last big European country to launch a digital terrestrial TV (DTT) service.\n \n Initially, more than a third of the population will be able to receive 14 free-to-air channels. Despite the long wait for a French DTT roll-out, the new platform's backers hope to emulate the success of its UK free-to-air counterpart, Freeview. Recent figures from the UK's regulator Ofcom showed Freeview was more popular than the Sky digital satellite service. In the three months to September 2004, almost five times as many people signed up to the UK's free-to-air DTT service compared with Sky. Almost 60% of UK households have gone digital on at least one television set through cable, satellite or Freeview.\n \n The French DTT platform is known as TNT, which stands for TV numerique terrestre or digital terrestrial television. But it is being branded as Television Numerique pour Tous, or \"digital television for all\". TNT is a joint venture between public broadcaster France Televisions and a handful of cable and satellite operators. Digital terrestrial TV will launch as a free-to-air platform to start with, adding pay-TV channels later. Thirty-five contenders have bid for an additional eight frequencies on top of the 14 already allocated. \"A couple of years ago, DTT had a bad image,\" said Olivier Gerolami, chief operating officer of TNT.\n \n \"But everyone's impressed with DTT in the UK, Italy and Germany, and they realise it is a very good idea. \"France is the poorest market in Europe in terms of free-to-air national channels, so it has the potential to be one of the biggest DTT markets,\" Mr Gerolami added in remarks quoted by the US entertainment industry paper Variety. TNT aims to reach 35% of France's population at launch, from 17 transmission sites. The transmission area will initially include Paris, Lille, Lyon and Toulouse. Eventually there will be 115 sites reaching over 80% of homes. Digital terrestrial set-top boxes are available from as little as 70 euros (£50). A recent survey by Mediametrie found that 70% of people interviewed were aware of DTT, and 25% were planning to buy a digital receiver. Consumer electronics companies such as Nokia, Sagem, Sony and Thomson are gearing up for production. The Conseil Superieur de l'Audiovisuel (CSA), the French broadcasting regulator, said: \"Following the recent success of Freeview in the UK, some manufacturers are optimistic about sales prospects\". Media analysts believe that initially the majority of viewers will buy inexpensive set-top boxes that are unable to support interactive services. The CSA said the current aim of reaching 85% of the population by 2007 was achievable, but the future of the remaining TV viewers required action by the public sector. For the most part, they are people living in mountainous or border areas, which will remain beyond the reach of digital terrestrial TV for years.\n \n Up to 15 pay-TV channels will launch on DTT between September 2005 and March 2006. Leading pay-TV operators Canal Plus and TPS have submitted bids to market bouquets of channels. Free-to-air services will be broadcast in MPEG-2 format. But pay-TV operators will be allowed to broadcast in MPEG-4 - a much better compression technology - which will potentially allow for high-definition (HD) subscription services in the future. TNT expects between 700,000 and one million DTT set-top boxes to be sold in 2005. \"It is difficult to tell how quickly it will take off,\" said Mr Gerolami, \"but we're optimistic that it will revolutionise television in France.\" Other analysts were less optimistic, predicting consumers would now be less likely to sign up for pay-TV subscriptions. \"We think free DTT could put brakes on the underlying growth of pay-TV in France,\" said Henri de Bodinat, vice-president of the Arthur D. Little consultancy.\n", "llama3.2:1b": ["France has launched a digital terrestrial TV (DTT) service called TNT with 14 free-to-air channels, initially targeting more than a third of the population.", "The service is being backed by public broadcaster France Televisions and cable/satellite operators.", "It aims to reach 35% of France's population at launch, starting in Paris, Lille, Lyon, and Toulouse.", "Digital terrestrial set-top boxes are available from €70 (£50).", "A recent survey found 70% of people were aware of DTT and 25% planned to buy a digital receiver.", "Up to 15 pay-TV channels will be launched between September 2005 and March 2006.", "The service is expected to revolutionize television in France, with TNT initially targeting the poorest markets in Europe, which have limited free-to-air national channels."], "llama3.2:3b": ["France launches digital terrestrial TV (DTT) service, known as Television Numerique pour Tous, which will initially offer 14 free-to-air channels to over a third of the population.", "The platform is expected to reach 35% of France's population at launch and eventually 80%, with digital set-top boxes available from €70.", "Pay-TV channels are expected to launch between September 2005 and March 2006, including up to 15 channels from Canal Plus and TPS."], "gemma2:2b": ["France has launched its digital terrestrial TV (DTT) service, TNT.", "The platform is initially free-to-air and will eventually offer 15 pay-TV channels.", "TNT's launch aims to emulate the success of Freeview in the UK, with early adoption expected based on positive consumer response.", "Sales of DTT set-top boxes are anticipated to reach 700,000-1 million units in 2005.", "Consumer reactions and the potential for pay-TV subscriptions remain key factors for the platform's success."], "qwen2.5:0.5b": ["France launches digital terrestrial TV service aimed at challenging Freeview and Sky free-to-air channels.", "TNT will be a joint venture between France Televisions and operators like ETSI/CTV, providing 14 free-to-air channels, plus pay-TV channels in eight frequencies.", "It aims to reach 35% of the population in September 2005, with initial locations including Paris, Lille, Lyon and Toulouse.", "TNT is expected to sell between 700,000 and one million boxes.", "Freeview has been the dominant free-to-air TV service in France since it launched in 1996, with Sky being its biggest competitor.", "The CSA says TNT has a good chance of reaching its goal, but suggests more action by the public sector is required to boost sales.", "Critics say free DTT could slow down growth in pay-TV industry."], "qwen2.5:1.5b": ["France launches a digital terrestrial TV service called TNT (Television Numerique pour Tous), targeting 35% of its population with free-to-air channels initially and adding pay-TV options later.", "With strong backing from cable and satellite operators, it aims to become Europe's largest DTT market by reaching most households through 17 transmission sites in Paris, Lille, Lyon, and Toulouse.", "Free-view format will be used for initial broadcasting of MPEG-2 content, with future services potentially adopting more advanced technologies like MPEG-4.", "Initial sales of set-top boxes are anticipated at a low cost of €50, reaching up to 1 million by 2005."], "qwen2.5:3b": ["France has launched a digital terrestrial TV (DTT) service known as TNT, aiming to offer 14 free-to-air channels and eventually include pay-TV channels.", "The launch is expected to reach 35% of France's population at launch from 17 transmission sites in Paris, Lille, Lyon, and Toulouse.", "Initially, digital terrestrial TV will be a free-to-air platform with set-top boxes available for as little as €70.", "As many as 25% of respondents were planning to buy a digital receiver, with consumer electronics companies such as Nokia, Sagem, Sony, Thomson gearing up for production.", "TNT aims to reach over 80% of homes by the end of the transmission area and expects between 700,000 and one million DTT set-top boxes to be sold in 2005.", "However, analysts predict that pay-TV subscriptions might decline due to the availability of free digital terrestrial TV."], "opencoder:1.5b": ["France has become the last big European country to launch a digital terrestrial TV (DTT) service.", "The platform has been successful and has seen a significant surge in user base following the U.K.'s announcement of Freeview's popularity over Sky in 2004.", "TNT, a joint venture between public broadcaster France Televisions and cable and satellite operators, aims to reach 35% of France's population at launch.", "It will initially include Paris, Lille, Lyon, and Toulouse.", "The initial focus is on reaching 85% of the population by 2007 but other leading pay-TV operators such as Canal Plus and TPS have submitted bids to market bouquets of channels.", "The DTT service has been launched with MPEG-2 format broadcasting which will allow for high definition subscription services in the future.", "With an expected sale volume of between 700,000 and one million set-top boxes in 2005, it is difficult to tell how quickly it will take off."], "smollm:1.7b": ["France has become the last big European country to launch a digital terrestrial TV (DTT) service.", "The initial rollout will be limited to 14 free-to-air channels, but it is expected that more channels will be added later in the year.", "The UK's free-to-air DTT service was launched on September 20th 2005 and has been very successful, with over 60% of households subscribing to pay-TV services.", "In the three months to September 2004, more than a third of the population in the UK had signed up for free-to-air DTT channels.", "Despite the long wait for a French DTT roll-out, the new platform's backers hope to emulate the success of its UK free-to-air counterpart, Freeview.", "The initial launch will be limited to 14 free-to-air channels, but it is expected that more channels will be added later in the year.", "The French DTT service will broadcast in MPEG-2 format, which is a much better compression technology than MPEG-4.", "This should allow for high-definition (HD) subscription services to become available in the future.", "TNT expects between 700,000 and one million DTT set-top boxes to be sold in 2005.", "Other analysts were less optimistic about the success of the French DTT service, predicting that consumers would now be less likely to sign up for pay-TV subscriptions.", "The initial rollout will be limited to 14 free-to-air channels, but it is expected that more channels will be added later in the year.", "The UK's free-to-air DTT service was launched on September 20th 2005 and has been very successful, with over 60% of households subscribing to pay-TV services.", "In the three months to September 2004, more than a third of the population in the UK had signed up for free-to-air DTT channels.", "Despite the long wait for a French DTT roll-out, the new platform's backers hope to emulate the success of its UK free-to-air counterpart, Freeview.", "The initial launch will be limited to 14 free-to-air channels, but it is expected that more channels will be added later in the year.", "The French DTT service will broadcast in MPEG-2 format, which is a much better compression technology than MPEG-4.", "This should allow for high-definition (HD) subscription services to become available in the future.", "TNT expects between 700,000 and one million DTT set-top boxes to be sold in 2005.", "Other analysts were less optimistic about the success of the French DTT service, predicting that consumers would now be less likely to sign up for pay-TV subscriptions.", "The initial rollout will be limited to 14 free-to-air channels, but it is expected that more channels will be added later in the year."], "deepseek-r1:1.5b": ["France has started launching digital terrestrial TV (DTT), the last major European country to do so.", "More than a third of its population will receive 14 free channels.", "Despite the long wait for promotion, backed by British successes like Freeview, which was popular there.", "In the UK, almost five times more people signed up compared with Sky's digital satellite service.", "Almost 60% of households have digital TV through cable, satellite or TTT.", "TNT, France's DTT platform, aims to reach 35% of France's population and has set-top boxes starting at 70 euros.", "It will launch in Paris, Lille, Lyon, and Toulouse initially.", "Competitors like Freeview are successful in the UK and Germany but faces regional issues with other viewers, primarily mountainous areas.", "The French regulator is optimistic about DTT's success, especially for free-to-air services.", "Pay TV operators like Canal Plus and TPS are also on board, with potential for HD services.", "TNT aims to sell around 700,000 to one million set-top boxes in 2005."], "tinyllama:1.1b": ["Following a long wait for a digital terrestrial TV (DTT) rollout, France has finally launched its new platform called TNT, which stands for Television Numérique pour Tous (digitally terrestrial television).", "The platform aims to launch as free-to-air chaiss of 14 channels later in 2005.", "Although the long wait may have slowed down the overall growth of pay-TV subscriptions, TNT expects between 700,000 and one million DTT set-top boxes to be sold within 2005.", "The launch also brings an opportunity for consumers to access interactive services, but will require a further push from public broadcaster France Television to reach the remaining TV viewers.", "TNT aims to sign up between 700,000 and one million DTT set-top boxes by March 2006, with plans to launch pay-TV chaiss of MPEG-4 in MPEG-2 format for high-definition (HD) subscription services in the future."], "tinydolphin:1.1b": [" A French broadcaster has launched a digital terrestrial TV (DTT) service, hoping to emulate the success of its UK counterpart Freeview and attract around a third of the population as viewers.", "The new platform will launch in France next year and will initially include Paris, Lille, Lyon and Toulouse.", "Eventually, there will be 115 sites reaching over 80% of homes.", "The transmission area will initially include Paris, Lille, Lyon and Toulouse.", "A recent survey by Mediametrie found that 70% of people interviewed were aware of DTT, and 25% were planning to buy a digital receiver.", "Consumer electronics companies such as Nokia, Sagem, Sony and Thomson are gearing up for production.", "The Conseil Superieur de l'Audiovisuel (CSA), the French broadcasting regulator, has said that it is optimistic about sales prospects, but has expressed concerns over initial market reach and consumer awareness."], "phi:2.7b": [" The summary is:\n\nFrance has launched a digital terrestrial TV service called TNT, which will provide 14 free-to-air channels initially and up to 15 paid-for ones later.", "The service aims to reach 85% of the population in three years, but faces challenges from mountainous or border regions that are hard to cover by DTT.", "The service is also competing with pay-TV operators who want to broadcast in a better compression technology called MPEG-4, which could lead to high-definition subscription services in the future.", "Some analysts think free DTT could slow down the growth of pay-TV in France."], "orca-mini:3b": [" France has launched its digital terrestrial TV (DTT) service, becoming the last major European country to do so.", "The platform is being branded as Television Numerique pour Tous or \"digital television for all\".", "Initial signals will cover 35% of the population, with pay-TV channels expected to launch later.", "TNT aims to reach 85% of the population by 2007 and expects up to 1 million DTT set-top boxes to be sold in 2005.", "Consumer electronics companies are gearing up for production, but analysts predict that initially, most viewers will buy inexpensive set-top boxes unable to support interactive services.", "Pay-TV operators have submitted bids to market bouquets of channels and the service is expected to revolutionize television in France.", "However, consumer attitudes towards DTT may limit its potential for growth."], "hermes3:3b": ["France launches digital terrestrial TV system, known as TNT (Digital Terrestrial Television), becoming last major European country to do so.", "It plans to reach 35% population at launch with 14 free-to-air channels, aiming for 85% coverage by 2007; eventually 115 sites will cover over 80%.", "Pay-TV up to 15 channels to launch between Sep 2005 and Mar 2006; DTT set-top boxes available from €70."], "stablelm-zephyr:3b": ["France has launched digital terrestrial TV (DTT) service, with over a third of the population initially able to receive 14 free-to-air channels.", "TNT, the French DTT platform, is a joint venture between public broadcaster France Televisions and several cable and satellite operators.", "The aim is to reach 35% of France's population at launch, expanding to 115 sites reaching over 80% of homes eventually.", "Digital terrestrial TV will begin as a free-to-air platform before adding pay-TV channels later.", "Up to 15 pay-TV channels are set to launch between September 2005 and March 2006, with leading operators Canal Plus and TPS submitting bids for market bouquets of channels."], "chatgpt-4o-latest": ["France has launched its digital terrestrial TV (DTT) service, becoming the last major European country to do so.", "Initially, 14 free-to-air channels will be available to over a third of the population, with plans to expand coverage to 85% by 2007.", "The platform, known as TNT, is a joint venture between public broadcaster France Televisions and cable and satellite operators.", "It aims to replicate the success of the UK's Freeview, which has outperformed Sky's satellite service.", "Set-top boxes are available from €70, and 25% of surveyed consumers plan to buy one.", "Pay-TV channels will be introduced between September 2005 and March 2006, with operators like Canal Plus and TPS bidding for channel packages.", "Free-to-air services will use MPEG-2, while pay-TV will adopt MPEG-4, allowing for potential HD services.", "Analysts are divided on the impact, with some predicting strong adoption while others believe free DTT could slow pay-TV growth."], "stablelm2:1.6b": ["France becomes the last major European country to launch a digital terrestrial TV (DTT) service with over a third of the population able to receive free-to-air channels.", "The UK's regulator Ofcom showed that Freeview was more popular than Sky, and almost 50% of UK households have gone digital on at least one television set through cable or Freeview.", "France's DTT platform will launch as a free-to-air service initially, adding pay-TV channels later.", "Digital terrestrial TV aims to reach 10% of the population at launch, with plans to extend coverage by 2020.", "Pay-TV operators Canal Plus and TPS have submitted bids for channel marketings."], "granite3.1-dense:2b": ["France has launched its digital terrestrial television (DTT) service, known as TNT or \"digital television for all.\"", "This initiative follows a significant delay and aims to provide free-to-air access to 14 channels initially, expanding to cover about 35% of the population.", "The French DTT platform is a joint venture between France Televisions and several cable and satellite operators.", "TNT's backers hope to replicate the success of the UK's Freeview service, which has gained popularity over Sky digital satellite.", "The launch will start with 17 transmission sites covering major cities like Paris, Lille, Lyon, and Toulouse, expanding to 115 sites reaching 80% of households by 2007.", "Digital set-top boxes are available for under £50, and awareness of DTT is high among potential consumers, with a survey indicating that 25% plan to purchase digital receivers.", "Initially, the majority of viewers will likely buy inexpensive set-top boxes unable to support interactive services.", "However, by 2007, the goal is to reach 85% of the population.", "Up to 15 pay-TV channels are expected to launch between September 2005 and March 2006, catering to viewers in urban areas.", "Canal Plus and TPS have submitted bids for market bouquets.", "Pay-TV operators will broadcast in MPEG-4, a more advanced compression technology potentially enabling high-definition (HD) subscription services.", "Analysts predict between 700,000 to one million set-top box sales in 2005.", "While optimistic about the service's potential, some analysts believe free DTT could hinder pay-TV growth in France."]}