{"raw_text": "Mobile TV tipped as one to watch\n \n Scandinavians and Koreans, two of the most adventurous groups of mobile users, are betting on mobile TV.\n \n Anders Igels, chief executive of Nordic operator Teliasonera, tipped it as the next big thing in mobile in a speech at the 3GSM World Congress, a mobile trade fair, in Cannes this week. Nokia, the Finnish handset maker, is planning a party in Singapore this spring to launch its TV to mobile activities in the region. Consultancy Strategy Analytics of Boston estimates that mobile broadcast networks will have acquired around 51 million users worldwide by 2009, producing around $6.6bn (£3.5bn) in revenue.\n \n SK Telecom of South Korea, which is launching a TV to mobile service (via satellite) in May plans to charge a flat fee of $12 a month for its 12 channels of video and 12 channels of audio. It will be able to offer an additional two pay TV channels using conditional access technology. Mr Shin-Bae Kim, chief executive of SK Telecom, also at 3GSM, said: \"We have plans to integrate TV with mobile internet services.\n \n \"This will enable viewers to access the mobile internet to get more information on adverts they see on TV.\" There will be 12 handsets available for the launch of the Korean service. LG Electronics of South Korea was demonstrating one at 3GSM that could display video at 30 frames a second. Footage shown on the handset was clear and watchable. A speech on mobile TV by Angel Gambino of the BBC also drew a large crowd, suggesting that even those mobile operators and equipment vendors which are not particularly active in mobile TV yet are starting to look into it.\n \n But all is not simple and straightforward in the mobile TV arena. There is a battle for supremacy between two competing standards: DVB-H for Digital Video Broadcasting for Handsets and DMB for Digital Multimedia Broadcasting. Dr Chan Yeob Yeun, vice president and research fellow in charge of mobile TV at LG Electronics, said: \"DMB offers twice the number of frames a minute as DVB-H and does not drain mobile batteries as quickly.\" The Japanese, Koreans and Ericsson of Sweden are backing DMB.\n \n Samsung of South Korea has a DMB phone too that will be one of those offered to users of the TU Media satellite mobile TV service to be launched in Korea in May. Nokia, by contrast, is backing DVB-H, and is involved in mobile TV trials that use its art-deco style media phone, which has a larger than usual screen for TV or visual radio (a way of accompanying a radio programme with related text and pictures). Mobile operators O2 and Vodafone are among the operators trialling mobile TV. But even if the standards battle is resolved, there is the thorny issue of broadcasting rights. Ms Gambino says the BBC now negotiates mobile rights when it is negotiating content.\n \n For those not convinced mobile users will want to watch TV on their handsets, Digital Audio Broadcasting may provide a good compromise and better sound quality than conventional radio. Developments in this area are continuing. At a DAB conference in Cannes, several makers of DAB chips for mobiles announced smaller, lower- cost chips which consume less power. Among the chip companies present were Frontier Silicon and Radioscape. The jury is still out on whether TV and digital radio on mobiles will make much money for anyone. But with many new services going live soon, it won't be long before the industry finds out.\n", "llama3.2:1b": ["Mobile TV is becoming a major player in the market, with Scandinavians and Koreans betting on it as the next big thing.", "Nokia plans to launch its TV service in Singapore in spring and estimates that around 51 million users worldwide will have mobile broadcast networks by 2009.", "SK Telecom of South Korea has also launched a TV-to-mobile service, which will offer additional channels and access to mobile internet.", "Mobile operators such as O2 and Vodafone are trialing mobile TV services, but the standards battle between DVB-H and DMB is ongoing.", "Despite this, mobile audio broadcasting may provide a viable alternative for those who prefer digital sound quality over conventional radio."], "llama3.2:3b": ["Scandinavians and Koreans are betting on mobile TV, citing its potential revenue of $6.6bn by 2009.", "Nokia is launching a party in Singapore to launch its TV to mobile activities, while SK Telecom plans a flat fee service via satellite with 24 channels for $12/month.", "However, there is a battle between DVB-H and DMB standards, with Samsung supporting DMB and LG Electronics backing it due to better performance on battery life.", "Mobile operators are trialling mobile TV, including O2 and Vodafone, while Digital Audio Broadcasting may offer a compromise with better sound quality."], "gemma2:2b": ["Mobile TV is gaining traction with operators like Teliasonera, Nokia, and SK Telecom betting on its future.", "Key players are vying to establish dominance through standards like DVB-H and DMB, with Samsung also introducing DMB phones.", "The battle for supremacy extends beyond technology as broadcasters and mobile operators navigate broadcasting rights issues.", "While the economic viability of this technology is yet to be proven, several new services will launch soon allowing users to experience its potential."], "qwen2.5:0.5b": ["Mobile TV has become a popular option among mobile users in Scandinavia and Korea due to its potential to offer high-quality video streaming and interactive content.", "The technology aims to combine digital video broadcasting (DVB) with multimedia broadcasting using satellite technology to provide seamless online viewing of television shows on mobile devices.", "Despite the challenges of establishing clear-cut competition between DVB-H and DMB, several key players have indicated interest in supporting mobile TV initiatives:\n\n1.", "**Nokia** plans to use a satellite-based system for its mobile TV service.", "2.", "**SK Telecom** from South Korea is preparing a similar service using satellite technology.", "3.", "LG Electronics from South Korea is developing devices with larger screens suitable for video content on smartphones.", "4.", "O2 and Vodafone are actively testing mobile TV services, but the industry faces challenges related to broadcasting rights.", "5.", "Digital Audio Broadcasting could offer good alternatives to conventional radio for users of handsets.", "While there's no simple solution, the integration of digital video broadcasting (DVB) with multimedia streaming (DMB) has shown promise and offers a compromise between DVB-H and DMB.", "However, the industry faces significant challenges in establishing clear-cut competition, including issues related to broadcasting rights and technological advancements.", "Overall, mobile TV represents an exciting opportunity for users seeking both high-quality video content and interactive experiences on their mobile devices."], "qwen2.5:1.5b": ["Mobile TV, backed by Scandinavians and Koreans, could become one of the next big things in mobile, gaining around 51 million users worldwide by 2009, generating $6.6 billion in revenue.", "Skilled handsets from SK Telecom are expected to be launched soon for a flat monthly fee.", "While DMB offers better frames per minute and less battery drain compared to DVB-H, standards battle continues with Japanese, Koreans, and Swedish supporting DMB over DVB-H.", "Mobile operators O2 and Vodafone are trialling mobile TV services."], "qwen2.5:3b": ["Mobile TV is gaining traction among Scandinavian and Korean users; Teliasonera’s Anders Igels predicts its future success at 3GSM World Congress.", "Nokia plans a launch party in Singapore for its mobile TV activities.", "SK Telecom's service, charging $12 per month, uses satellite broadcasting and will integrate with mobile internet services.", "LG Electronics showcased a handset capable of displaying video at 30 frames per second.", "However, DVB-H (Digital Video Broadcasting for Handsets) and DMB (Digital Multimedia Broadcasting) compete for dominance; DMB offers higher frame rates without draining batteries faster.", "Samsung supports DMB alongside Ericsson's Japanese allies in Sweden.", "Despite ongoing standards battle, mobile operators like O2 and Vodafone are piloting mobile TV services.", "The text also mentions Digital Audio Broadcasting (DAB), which could serve as a compromise offering improved sound quality over conventional radio.", "While some remain unconvinced of mobile TV’s widespread appeal, with new services set to debut soon, the industry will quickly learn its prospects for financial success."], "opencoder:1.5b": ["The text summarizes the following:\n\n1.", "Mobile TV has gained prominence due to its potential for users to enjoy TV content on their mobile devices.", "2.", "Scandinavians and Koreans, two of the most adventurous groups of mobile users, are betting on a future where mobile TV will be the norm.", "3.", "Anders Igels is the chief executive of Nordic operator Teliasonera who has said it is the next big thing in mobile market.", "4.", "Nokia, the Finnish handset maker, plans to launch a TV party in Singapore during the summer season.", "5.", "SK Telecom of South Korea, which plans to charge users with a flat fee of $12 per month for its 12 channels of video and 12 channels of audio, is also aiming to add two more pay TV channels using conditional access technology.", "6.", "Mr Shin-Bae Kim, the CEO of SK Telecom, also works at 3GSM, commenting that integrating TV with mobile internet services could revolutionize mobile consumers' experience in the future.", "7.", "LG Electronics has demonstrated one of its devices showcasing video at 30 frames a second.", "8.", "The BBC is negotiating rights when it's negotiating content for mobile TV service.", "9.", "For those who aren't convinced, Digital Audio Broadcasting may provide a good compromise with higher sound quality.", "10.", "With many new services going live soon, there's a long and exciting time to be part of the industry."], "smollm:1.7b": ["Mobile TV has been a topic of discussion in recent years, with several mobile operators offering TV content to their users.", "The main idea behind Mobile TV is to provide users with access to a wide range of TV channels and programs on their mobile devices, allowing them to watch TV shows and movies on-the-go.", "However, there are still some challenges that need to be addressed before Mobile TV can become a mainstream phenomenon.", "One of the main challenges facing Mobile TV is the issue of content availability.", "Currently, there are limited options available for users who want to access TV channels and programs on their mobile devices.", "This is because most mobile operators do not offer TV content as part of their standard services, and even when they do, it may be limited or expensive.", "Additionally, many popular TV shows and movies require a subscription fee, which can be a barrier for some users.", "Another challenge facing Mobile TV is the issue of compatibility with different devices and operating systems.", "Different mobile devices have varying screen sizes, resolutions, and capabilities, which can make it difficult to provide a seamless viewing experience.", "Furthermore, many mobile apps are not optimized for mobile devices, which can lead to poor video quality and other issues.", "Despite these challenges, there are several developments that suggest Mobile TV is on the right track.", "For example, some mobile operators have started offering TV content as part of their standard services, such as Nokia's DAB service in Finland.", "Additionally, new technologies such as 4G LTE and 5G networks are expected to provide faster and more reliable internet connectivity, which will be essential for Mobile TV to become a mainstream phenomenon.", "In terms of content availability, there are several initiatives underway that aim to increase the number of TV channels and programs available on mobile devices.", "For example, the BBC has launched its own mobile app, which offers access to a range of TV shows and movies.", "Similarly, other broadcasters such as ITV and Channel 4 have also launched their own mobile apps.", "In conclusion, while there are still challenges that need to be addressed before Mobile TV can become a mainstream phenomenon, the developments in this area suggest that it is on the right track.", "With more content becoming available and improved compatibility with different devices and operating systems, Mobile TV has the potential to revolutionize the way people consume TV content on-the-go."], "deepseek-r1:1.5b": ["Mobile TV trends dominate the scene among Scandinavians and Koreans.", "Nordic operators are leading initiatives, while LG Electronics and others offer specific services.", "Samsung offers a DMB-based phone for mobile viewers, and O2/Vodafone are trialing mobile TV.", "The broadcasting rights battle between DVB-H and DMB is crucial, with mobile operators competing in features like art-deco style media phones.", "There's a mix of high-profile companies vs. more budget-focused ones, all aiming to enhance viewer experience."], "tinyllama:1.1b": ["The Moble TV tipped as one to watch by popular mobile users, with Scandinavians and Koreans betting on mobile TV.", "Mobile operators are tipped to offer up to 12 chaNNELS of video and 12 chaNNELs of audio, offering the world's largest mobile network coverage through satellite, as well as conditional access technology.", "The launch of services in May will be accompanied by plans for two pay TV channels, using \"conditional access\" technology to allow users to access more information on advertisements they see on TV.", "There are also concerns about broadcasting rights and a potential compromise with Digital Audio Broadcast (DAB), but the sector is still unsure of what mobile-TV services will bring in terms of revenue."], "tinydolphin:1.1b": [" The article introduces that mobile TV or mobile broadcasting has gained significant traction among several groups of users across different continents in various countries.", "The article explains the two key players involved in this technology development - the Scandinavians and Koreans, who are tipping towards one-to-watch mobile TV.", "The primary concern discussed by the author is the battle between DVB-H (DVB-Handset) and DMB (Digital Multimedia Broadcasting), which offer double the number of frames per second compared to each other.", "The choice between these two standards will likely determine who wins the dominance in this rapidly growing market.", "The article also mentions that Nokia, one of the world's largest mobile phone companies, is planning a launch for its TV to Mobile service in Singapore using a satellite connection.", "This would provide an additional benefit to users across Asia as well as boosting the company's financial prospects.", "Telisa, a Finnish telecommunications company, has also announced its entry into the mobile TV market with a platform called Teliasonera which will launch in Q1 of 2009.", "This would be another step towards expanding the market for mobile TV users across Scandinavia and other regions.", "Lastly, there's a mention of a BBC television service that uses DAB technology to deliver radio programming on mobile devices.", "This has made it possible for users to access high-quality audio content while also enjoying their favorite television shows.", "In summary, the article discusses the growing interest in mobile TV and its potential role in expanding markets for users across different continents.", "However, the choice between DVB-H and DMB is still a significant concern, as it may determine which technology can gain the most traction among these users."], "phi:2.7b": [" Scandinavians and Koreans are betting on mobile TV, according to Teliasonera's Anders Igels at the 3GSM World Congress in Cannes this week.", "Nokia is launching a party in Singapore later this year for its TV to mobile activities.", "Strategy Analytics predicts that mobile broadcast networks will have 51 million users worldwide by 2009, producing $6.6 billion in revenue.", "SK Telecom of South Korea plans to charge a flat fee of $12 per month for its TV to mobile service with 12 channels of video and audio and additional two pay TV channels using conditional access technology.", "LG Electronics is demonstrating one handset at 3GSM that can display video at 30 frames a second.", "Dr Chan Yeob Yeun, vice president and research fellow in charge of mobile TV at LG Electronics, says DMB offers twice the number of frames per minute as DVB-H without draining batteries quickly.", "Samsung of South Korea has a DMB phone for its TU Media satellite service, while Nokia is backing DVB-H.", "Mobile operators like O2 and Vodafone are trialling mobile TV.", "The BBC now negotiates mobile rights when negotiating content, while developments in digital audio broadcasting for mobiles offer a compromise with better sound quality than conventional radio.", "While money might not be made yet, the industry will soon find out."], "orca-mini:3b": [" Scandinavians and Koreans are betting on mobile TV.", "Mobile TV is expected to become one of the biggest trends in mobile technology.", "Two competing standards are DVB-H for Digital Video Broadcasting for Handsets and DMB for Digital Multimedia Broadcasting.", "The Japanese, Koreans, and Ericsson of Sweden are backing DMB.", "Samsung has a DMB phone that will be used in the TU Media satellite mobile TV service to be launched in Korea in May.", "Mobile operators O2 and Vodafone are among those trialling mobile TV.", "However, even if the standards battle is resolved, there is the issue of broadcasting rights.", "The BBC now negotiates mobile rights when it is negotiating content."], "hermes3:3b": ["Mobile TV adoption predicted by Scandinavians & Koreans, with SK Telecom preparing $12/month service in May.", "Competing DVB-H & DMB standards discussed, as well as broadcasting rights and lower-cost mobile audio alternatives."], "stablelm-zephyr:3b": ["Scandinavian and Korean mobile users are embracing mobile TV, with Nordic operator Teliasonera's CEO tipping it as the next big thing in mobile.", "Nokia is launching its TV to mobile activities in the region this spring, and Strategy Analytics estimates that by 2009, mobile broadcast networks will have acquired around 51 million users worldwide, generating approximately $6.6 billion in revenue.", "SK Telecom of South Korea plans to charge a flat fee of $12 a month for its 12 channels of video and 12 channels of audio when it launches its TV to mobile service via satellite in May.", "However, there is competition between DVB-H and DMB standards, with the latter backed by Japanese, Korean, and Ericsson companies.", "While the battle for supremacy rages on, digital audio broadcasting may provide a good compromise for those not convinced of watching TV on their handsets."], "chatgpt-4o-latest": ["Scandinavian and Korean mobile users are embracing mobile TV, with industry leaders predicting it as the next big trend.", "Nordic operator Teliasonera and Finnish handset maker Nokia are investing in mobile TV, while SK Telecom of South Korea is launching a satellite-based service with a $12 monthly fee.", "The service will integrate TV with mobile internet for interactive advertising.", "Competing standards, DVB-H and DMB, are vying for dominance, with DMB offering better frame rates and battery efficiency, backed by Japanese, Korean, and Swedish companies, while Nokia supports DVB-H.", "Mobile operators like O2 and Vodafone are trialing mobile TV, but challenges remain, including broadcasting rights.", "Digital Audio Broadcasting (DAB) is also emerging as an alternative, with advancements in smaller, more efficient chips.", "The financial viability of mobile TV and digital radio remains uncertain, but upcoming launches will soon reveal their potential."], "stablelm2:1.6b": ["Scandinavians and Koreans are leading the way in mobile TV usage, with Nordic operator Teliasonera and South Korean SK Telecom set to launch TV-to-mobile services in 2007.", "Strategy Analytics predicts around one million global users by 2009, generating $6.6bn revenue.", "Consultancy Strategy Analytics estimates 50% of pay-TV subscribers worldwide will be using mobile devices.", "Samsung has a DMB phone for the Korean service and Nokia is supporting DVB-H (Digital Video Broadcasting for Handsets), backed by Japanese, South Korean and Swedish firms.", "However, there are ongoing disputes between DVB-H and DMB standards, with Japanese, Korean and Swedish companies backing DMB, while Samsung backs DMB.", "The broadcasting rights issue remains a challenge for the industry."], "granite3.1-dense:2b": ["Scandinavians and Koreans, known for their mobile innovation, are embracing mobile television (TV).", "Anders Igels, CEO of Nordic operator Teliasonera, sees it as the next major trend in mobile technology.", "Consultancy Strategy Analytics predicts that mobile broadcast networks will have 51 million users worldwide by 2009, generating $6.6 billion in revenue.", "South Korean telecom company SK Telecom plans to launch a TV-to-mobile service via satellite in May, charging $12 monthly for 12 video and audio channels, with potential access to additional two pay TV channels using conditional access technology.", "They aim to integrate this with mobile internet services, enabling viewers to explore advertisements on TV more thoroughly through the web.", "SK Telecom will offer 12 handsets with video display capabilities at 30 frames per second.", "Nokia, a Finnish handset manufacturer, is also involved in mobile TV trials using its art-deco style media phone for visual radio.", "Mobile operators O2 and Vodafone are among those trialling mobile TV.", "However, there's a rivalry between two competing standards: DVB-H (Digital Video Broadcasting for Handsets) and DMB (Digital Multimedia Broadcasting).", "DMB offers twice the frames per minute as DVB-H and consumes less battery power, with Japanese, Koreans, and Ericsson of Sweden backing DMB.", "Nokia supports DVB-H.", "The BBC negotiates mobile TV rights alongside content deals.", "Even if standardization is resolved, broadcasting rights remain a challenge.", "For those skeptical about watching TV on handsets, Digital Audio Broadcasting (DAB) offers improved sound quality over conventional radio and may serve as a compromise for better audio experience.", "Recently, DAB chip manufacturers unveiled more compact, cost-effective chips that consume less power, including Frontier Silicon and Radioscape.", "Despite these advancements, the financial viability of mobile TV and digital radio on handsets remains uncertain.", "New services are imminent, and it won't be long before the industry determines their profit potential."]}