{"raw_text": "Sun offers processing by the hour\n \n Sun Microsystems has launched a pay-as-you-go service which will allow customers requiring huge computing power to rent it by the hour.\n \n Sun Grid costs users $1 (53p) for an hour's worth of processing and storage power on systems maintained by Sun. So-called grid computing is the latest buzz phrase in a company which believes that computing capacity is as important a commodity as hardware and software. Sun likened grid computing to the development of electricity.\n \n The system could mature in the same way utilities such as electricity and water have developed, said Sun's chief operating officer Jonathan Schwartz. \"Why build your own grid when you can use ours for a buck an hour?\" he asked in a webcast launching Sun's quarterly Network Computing event in California. The company will have to persuade data centre managers to adopt a new model but it said it already had interest from customers in the oil, gas and financial services industries.\n \n Some of them want to book computing capacity of more than 5,000 processors each, Sun said. Mr Schwartz ran a demonstration of the service, showing how data could be processed in a protein folding experiment. Hundreds of servers were used simultaneously, working on the problem for a few seconds each.\n \n Although it only took a few seconds, the experiment cost $12 (£6.30) because it had used up 12 hours' worth of computing power. The Sun Grid relies on Solaris, the operating system owned by Sun. Initially it will house the grid in existing premises and will use idle servers to test software before shipping it to customers. It has not said how much the system will cost to develop but it already has a rival in IBM, which argues that its capacity on-demand service is cheaper than that offered by Sun.\n", "llama3.2:1b": ["Sun Microsystems offers pay-as-you-go computing services, known as grid computing, allowing users to rent processing power for an hour's worth of use.", "The system costs $1 per hour, with the ability to increase usage up to 5,000 processors at a time.", "Users can access the service through existing Sun data centers and test software on idle servers before renting it out."], "llama3.2:3b": ["Sun Microsystems launched a pay-as-you-go service called Sun Grid, charging $1 (53p) per hour for processing and storage power on systems maintained by the company.", "The system, akin to electricity, aims to mature like utilities, with interest from industries such as oil, gas, and finance.", "Sun demonstrated the service through a protein folding experiment using hundreds of servers, and it relies on Solaris operating system, initially housed in existing premises."], "gemma2:2b": ["Sun Microsystems launched a pay-as-you-go service called Sun Grid, allowing users to rent computing power for an hourly rate of $1.", "The company compares grid computing to the development of electricity and expects it to become a mainstream utility like utilities.", "Interest in Sun Grid has been shown by customers from industries such as oil, gas and finance, who wish to book capacity exceeding 5000 processors.", "Initial testing and implementation will be done within existing premises and using idle servers before delivery.", "A competitor, IBM, offers a similar on-demand service at potentially lower costs."], "qwen2.5:0.5b": ["Sun Grid offers hourly computing power for massive projects.", "The company charges $1 per hour and uses Solaris operating system.", "Some customers want up to 5,000 processors each.", "The service costs $12 (£6.30) due to the long time of storage needed in a protein folding experiment."], "qwen2.5:1.5b": ["Sun Microsystems has launched a pay-as-you-go grid computing service for $1 per hour of processing power and storage space managed by Sun.", "It aims to mature like electricity utility systems.", "The new offering could appeal to large enterprises interested in leasing compute capacity, with some wanting access to more than 5,000 processors."], "qwen2.5:3b": ["Sun Microsystems launched a pay-as-you-go computing service where users can rent processing and storage power for $1 (53p) per hour.", "Known as the Sun Grid, this grid computing service allows customers to use Sun's maintained systems rather than building their own infrastructure.", "CEO Jonathan Schwartz compared it to utilities like electricity, suggesting that renting from Sun could be cheaper in the long run.", "The system can process more than 5,000 processors and has attracted interest from companies in industries such as oil, gas, and finance.", "A demonstration showed how a protein folding experiment cost $12 ($6.30) due to using up 12 hours of computing power.", "Sun's Grid relies on its Solaris operating system and plans to initially host it in existing premises before expanding.", "Competing with IBM, which also offers capacity-on-demand services at potentially cheaper rates."], "opencoder:1.5b": ["Sun offers processing by the hour\n\nSun Microsystems has launched a pay-as-you-go service which will allow customers requiring huge computing power to rent it by the hour.", "The system could mature in the same way utilities such as electricity and water have developed, said Sun's chief operating officer Jonathan Schwartz.", "\"Why build your own grid when you can use ours for a buck an hour?\"", "he asked in a webcast launching Sun's quarterly Network Computing event in California.", "The company will have to persuade data centre managers to adopt a new model but it said it already had interest from customers in the oil, gas and financial services industries.", "Some of them want to book computing capacity of more than 5,000 processors each, Sun said.", "Mr Schwartz ran a demonstration of the service, showing how data could be processed in a protein folding experiment.", "Hundreds of servers were used simultaneously, working on the problem for a few seconds each."], "smollm:1.7b": ["The summary of this text should be:\nSun Microsystems offers processing power and storage capacity for hire, allowing customers to rent them by the hour.", "This model is similar to traditional utilities such as electricity and water where companies provide access to these services on a pay-as-you-go basis.", "The Sun Grid is designed to make computing power more accessible to individuals and businesses who need it but cannot afford to build their own infrastructure."], "deepseek-r1:1.5b": ["Sun has launched a pay-as-you-go grid computing service offering processing power on Sun Grid systems at $1 per hour for an hour's worth of capacity.", "This service is described as an alternative to hardware and software, drawing comparisons to electricity and water.", "Customers can rent computing resources to solve problems collaboratively by sharing servers.", "A demonstration used protein folding in seconds with solaris operating system.", "The company will gradually transition Sun Grid systems to existing premises with idle servers first before shipping to customers.", "Currently, the cost is not set but they have a competitor, IBM.", "The service caters to industries like oil, gas, and finance where users may want higher capacity."], "tinyllama:1.1b": ["Sun MicroSystems has launched a pay-as-you-go service known as Sun Grid, which allows customers to rent computing and storage power on systems maintained by the company.", "The system could potentially benefit industries such as oil, gas, and financial services, with interest shown from data centre managers already.", "The demonstration seen by Net Computing showed how data could be processed in a protein folding experiment for a few seconds each.", "However, it only took a few seconds to cost $12 (£6.30) because it used up 12 hours' worth of computing power.", "Sun Grid is expected to launch soon, offering compute capacity on servers managed by the company."], "tinydolphin:1.1b": [" Sun Microsystems launched a pay-as-you-go service that lets customers rent processing and storage power on demand from their systems using the grid concept.", "The system could potentially mature in a similar way to utilities such as electricity and water, with companies such as Sun offering this service for a buck per hour.", "Customers can now choose how much computing capacity they need, while Sun Grid services will use idle servers to test their software before selling the processed data to customers."], "phi:2.7b": [" \"Sun Microsystems' pay-as-you-go service allows customers to rent computing power for an hourly fee of $1 (53p).\""], "orca-mini:3b": [" Sun Microsystems offers computing power by the hour through its pay-as-you-go service called Sun Grid.", "Customers can rent computing power for $1 per hour on systems maintained by Sun.", "This grid computing model is similar to utility services like electricity and water, and Sun believes that computing capacity is just as important as hardware and software.", "The system has already received interest from customers in the oil, gas, and financial services industries.", "A demonstration of the service showed how a protein folding experiment was processed in just a few seconds, with a cost of $12 per hour because it used up 12 hours' worth of computing power.", "Sun Grid plans to test software before shipping it to customers, and it has not yet announced the cost of developing the system.", "However, IBM argues that its on-demand service is cheaper than Sun's offering."], "hermes3:3b": ["Sun Grid: Pay-per-hour computing service launched by Sun Microsystems.", "$1/hour for processing and storage power via grid computing system."], "stablelm-zephyr:3b": ["Sun Microsystems launched a pay-as-you-go service, Sun Grid, allowing customers to rent massive computing power by the hour for $1 (53p) per hour.", "This grid computing service aims to provide an alternative model to building one's own infrastructure, similar to the development of electricity and water utilities.", "Sun already has interest from clients in industries like oil, gas, and finance.", "The company plans to adopt a new model with data center managers but faces competition from IBM's on-demand capacity service."], "chatgpt-4o-latest": ["Sun Microsystems has introduced a pay-as-you-go service called Sun Grid, allowing customers to rent computing power for $1 per hour.", "The company compares grid computing to utilities like electricity, aiming to make computing capacity a commodity.", "Sun's COO, Jonathan Schwartz, highlighted the benefits of using Sun's infrastructure instead of building private grids.", "The service has attracted interest from industries like oil, gas, and finance, with some customers requesting over 5,000 processors.", "A demonstration showed a protein folding experiment using hundreds of servers, costing $12 for 12 hours of computing power.", "Sun Grid runs on Solaris and initially uses idle servers for testing.", "Sun faces competition from IBM, which claims its on-demand service is more cost-effective."], "stablelm2:1.6b": ["Sun Microsystems offers hourly processing via their Sun Grid pay-as-you-go service, allowing users to rent computing power based on hour's worth of processing and storage.", "This follows the concept of grid computing, similar to electricity utilities.", "The system is expected to mature like utilities such as electricity and water, with interest from customers in various industries.", "It currently uses idle servers and costs $1 for an hour's worth of processing, but Sun has not disclosed the cost of developing the system or its rival IBM's pricing."], "granite3.1-dense:2b": ["Sun Microsystems has introduced a pay-as-you-go service called Sun Grid, enabling customers to rent massive computing power hourly.", "For $1 (53p), users gain an hour's worth of processing and storage capacity on Sun's systems.", "This initiative, likened by the company to the development of electricity, aims to transform how data center managers procure computational resources.", "Chief Operating Officer Jonathan Schwartz emphasized the cost-effectiveness, stating, \"Why build your own grid when you can use ours for a buck an hour?\"", "The service has already garnered interest from industries like oil, gas, and finance, with some clients requiring over 5,000 processors.", "During a demonstration, Schwartz showcased how data could be processed in protein folding experiments using hundreds of servers working together for brief periods.", "Despite the experiment's brevity, it cost $12 (£6.30) due to utilizing 12 hours of computing power.", "Sun Grid initially operates within existing premises, leveraging idle servers for software testing before deployment to customers.", "Although the company hasn't disclosed development costs, it competes with IBM's on-demand capacity service, which claims lower pricing."]}