{"raw_text": "Kenyan school turns to handhelds\n \n At the Mbita Point primary school in western Kenya students click away at a handheld computer with a stylus.\n \n They are doing exercises in their school textbooks which have been digitised. It is a pilot project run by EduVision, which is looking at ways to use low cost computer systems to get up-to-date information to students who are currently stuck with ancient textbooks. Matthew Herren from EduVision told the BBC programme Go Digital how the non-governmental organisation uses a combination of satellite radio and handheld computers called E-slates. \"The E-slates connect via a wireless connection to a base station in the school. This in turn is connected to a satellite radio receiver. The data is transmitted alongside audio signals.\" The base station processes the information from the satellite transmission and turns it into a form that can be read by the handheld E-slates. \"It downloads from the satellite and every day processes the stream, sorts through content for the material destined for the users connected to it. It also stores this on its hard disc.\"\n \n The system is cheaper than installing and maintaining an internet connection and conventional computer network. But Mr Herren says there are both pros and cons to the project. \"It's very simple to set up, just a satellite antenna on the roof of the school, but it's also a one-way connection, so getting feedback or specific requests from end users is difficult.\"\n \n The project is still at the pilot stage and EduVision staff are on the ground to attend to teething problems with the Linux-based system. \"The content is divided into visual information, textual information and questions. Users can scroll through these sections independently of each other.\" EduVision is planning to include audio and video files as the system develops and add more content. Mr Herren says this would vastly increase the opportunities available to the students. He is currently in negotiations to take advantage of a project being organised by search site Google to digitise some of the world's largest university libraries. \"All books in the public domain, something like 15 million, could be put on the base stations as we manufacture them. Then every rural school in Africa would have access to the same libraries as the students in Oxford and Harvard\" Currently the project is operating in an area where there is mains electricity. But Mr Herren says EduVision already has plans to extend it to more remote regions. \"We plan to put a solar panel at the school with the base station, have the E-slates charge during the day when the children are in school, then they can take them home at night and continue working.\" Maciej Sundra, who designed the user interface for the E-slates, says the project's ultimate goal is levelling access to knowledge around the world. \"Why in this age when most people do most research using the internet are students still using textbooks? The fact that we are doing this in a rural developing country is very exciting - as they need it most.\"\n", "llama3.2:1b": ["Kenyan school uses handheld computers with satellite radio for digital textbooks, pilot project by EduVision.", "Students access exercises from digitised textbooks via E-slates connected to base stations via satellite and internet.", "The system is cheaper than internet connections but has both pros and cons.", "It can increase student opportunities through audio and video content, but requires users to navigate independently."], "llama3.2:3b": ["Mbita Point primary school in western Kenya is testing a handheld computer system to provide updated information to students with old textbooks.", "The system uses satellite radio and E-slates, which download data from a base station connected to the internet via a one-way connection.", "EduVision plans to expand the project to more remote areas and add content such as audio and video files.", "Google is also being considered for digitizing university libraries, potentially providing access to knowledge for students in rural Africa."], "gemma2:2b": ["EduVision uses satellite radio and handheld computers (E-slates) to deliver digitized schoolbooks to students in Kenya.", "The system, which connects via a base station, transmits information wirelessly to the E-slates for offline access.", "While cheaper than traditional internet connections, the system is limited by a one-way data flow and faces technical challenges.", "EduVision plans to include audio, video, and additional content as the project evolves, ultimately providing students with more learning opportunities.", "The organization aims to extend the project to remote regions using solar power for off-grid access."], "qwen2.5:0.5b": ["In western Kenya, a school's primary school has adopted handheld computers for digitizing their old textbooks.", "These handheld computers allow students to read and take notes on the textbooks without needing an internet connection or expensive equipment.", "EduVision, a non-governmental organization that uses satellite radio and handheld computers called E-slates, is developing the system with its base station in the school's roof.", "The data from the satellites is then processed by the E-slates and downloaded to their internal hard drives.", "This system is cheaper than installing an internet connection but has some drawbacks such as one-way communication and difficulty in receiving specific requests.", "EduVision has plans to extend the project to more remote areas using solar panels on the school's roof and charging the E-slates during daylight hours while students are in class."], "qwen2.5:1.5b": ["Kenyan school tests handheld computer system for digitizing outdated textbooks, connecting to base station via satellite radio and wireless connection.", "EduVision aims to provide up-to-date educational resources to African students through low-cost systems without internet access.", "The project has potential to reach public domain university libraries worldwide.", "It uses Linux-based technology, integrates visual, textual, and question content, and plans future expansion using solar-powered charging stations for E-slates at schools."], "qwen2.5:3b": ["At Mbita Point primary school in western Kenya, students use digitised textbooks on handheld computers called E-slates.", "This pilot project by EduVision uses low-cost computer systems with satellite radio connections to deliver updated information to students who have outdated traditional textbooks.", "The system is cheaper than an internet connection but has a one-way data transmission limitation.", "Content includes visual and textual information and questions, with plans for audio and video files.", "EduVision collaborates with Google to digitize university libraries for rural African schools.", "The ultimate goal is equal access to knowledge worldwide."], "opencoder:1.5b": ["Kenyan school turns to handheld computers\n\nAt the Mbita Point primary school in western Kenya, students click away at a handheld computer with a stylus.", "They are doing exercises in their school textbooks which have been digitised.", "It's a pilot project run by EduVision, which is looking at ways to use low cost computer systems to get up-to-date information for students who are currently stuck with ancient textbooks.", "The non-governmental organisation uses a combination of satellite radio and handheld computers called E-slates.", "Matthew Herren from EduVision has explained how the non-governmental organisation works using a wireless connection, where it connects to a base station in the school which further turns the data into a form that can be read by the handheld E-slates.", "The project is still at the pilot stage and EduVision staff are on the ground trying to address the teething problems with the Linux-based system.", "The content is divided into visual information, textual information and questions.", "Users can scroll through these sections independently of each other.", "EduVision plans to include audio and video files as the system develops and adds more content.", "Mr Herren says this would vastly increase the opportunities available to the students.", "He is currently negotiating with Mr Herren to take advantage of a project being organised by search site Google to digitise some of the world's largest university libraries.", "The project operates in an area where there is mains electricity, but EduVision already has plans to extend it to more remote regions.", "The user interface for E-slates was designed by Maciej Sundra who is also involved in this project."], "smollm:1.7b": ["The summary should be:\nAt the Mbita Point primary school in western Kenya, students click away at a handheld computer with a stylus.", "They are doing exercises in their school textbooks which have been digitised.", "It is a pilot project run by EduVision, which is looking at ways to use low cost computer systems to get up-to-date information to students who are currently stuck with ancient textbooks.", "The E-slates connect via a wireless connection to a base station in the school.", "This in turn is connected to a satellite radio receiver.", "The data is transmitted alongside audio signals.", "The base station processes the information from the satellite transmission and turns it into a form that can be read by the handheld E-slate.", "The system is cheaper than installing and maintaining an internet connection and conventional computer network.", "But Mr Herren says there are both pros and cons to the project."], "deepseek-r1:1.5b": ["Kenyan primary school students are using handheld computers (E-slates) that connect via satellite audio signals.", "The system is cost-effective compared to installing internet access, offering simplicity in setup.", "However, it's not ideal for direct user interactions.", "To reach more people, the project will expand into remote areas using solar panels and digitizing large libraries."], "tinyllama:1.1b": ["The non-governmental organization EduVision has developed an interactive computer system called Handheld Computer, which provides low cost access to information and education.", "The system connects to a base station in schools using wireless signals, processing data and turning it into a form suitable for users connected to the handheld computers.", "The project is designed to provide equal access to knowledge around the world by leveling the gap between students with access to traditional textbooks and those who need easy-to-use devices like handheld computers.", "EduVision staff are currently on the ground in Kenyan schools, attending to issues with the Linux-based system and planning to extend it to more remote regions.", "The project has already made a significant impact on access to education by providing students from rural areas with digital textbooks that could be accessed at any time, regardless of mains electricity."], "tinydolphin:1.1b": [" Kenyan school uses handheld computers and satellite radio to access low-cost educational materials.", "EduVision, a non-governmental organization (NGO), is using this system to create a pilot project for students in Mbita Point primary school.", "This involves creating an electronic slate that connects to a satellite radio receiver and processes the information from the satellite transmission.", "The E-slates are then connected to a base station in the school, which processes the data and stores it on its hard disc."], "phi:2.7b": [" EduVision uses satellite radio and E-slates to provide low-cost computer systems with up-to-date information for students in western Kenya.", "It downloads information from the satellite, processes it on a base station, and stores it on the E-slates' hard disc.", "The system is cheaper than installing internet and network connections but has limitations.", "EduVision plans to add audio and video files as the system develops.", "They are also in talks with Google to digitise university libraries for students worldwide.", "The project currently operates in areas with mains electricity, but they have plans to expand to remote regions with solar panels and E-slates for charging.", "The ultimate goal is levelling access to knowledge globally."], "orca-mini:3b": [" Kenyan school uses handhelds for digital textbooks.", "The Mbita Point primary school in western Kenya has been piloting a project that involves digitizing their textbooks using low-cost computer systems.", "The system, run by EduVision, uses handheld computers with styluses and connects to satellite radios.", "Users can access the content through a combination of text, audio and video files.", "The project is still in its early stages and EduVision is negotiating with Google to digitize some of the world's largest university libraries."], "hermes3:3b": ["Kenyan school uses handheld computers (E-slates) for digitized exercises, connected via satellite to provide up-to-date information to students with old textbooks."], "stablelm-zephyr:3b": ["At Mbita Point primary school in western Kenya, students use handheld computers called E-slates to access digitized school textbooks.", "This pilot project by non-governmental organization EduVision aims to provide up-to-date information to students with outdated texts.", "The system uses a wireless connection via a satellite radio receiver, downloading content daily for storage on the hard disc of each E- slate.", "Although cheaper than installing and maintaining internet or conventional computer networks, it's a one-way connection with potential feedback challenges.", "EduVision plans to expand the project to more remote regions by utilizing solar panels for charging during the day.", "The ultimate goal is to provide equal access to knowledge worldwide, addressing the fact that students in rural developing countries need it most."], "chatgpt-4o-latest": ["A Kenyan primary school is piloting a project by EduVision that uses handheld computers called E-slates to provide students with digitized textbooks.", "The system connects wirelessly to a base station linked to a satellite radio receiver, delivering up-to-date educational content at a lower cost than traditional internet connections.", "While the setup is simple, it lacks two-way communication for user feedback.", "EduVision plans to enhance the system with audio and video content and is exploring partnerships, such as Google's library digitization project, to expand access to educational resources.", "Future plans include using solar power to extend the initiative to remote areas, aiming to bridge the global knowledge gap."], "stablelm2:1.6b": ["Mbita Point primary school in western Kenya uses handheld computers and E-slates to access digitized information from EduVision.", "This pilot project, run by non-governmental organization EduVision, combines satellite radio with wireless handheld computers called E- slates.", "The base station processes the data transmitted wirelessly and stores it on a hard disc.", "It is cheaper than setting up an internet connection or computer network but has limitations in feedback.", "The project is currently limited to areas with mains electricity; however, EduVision plans to extend it to remote regions powered by solar panels.", "Ultimately, the goal of this project is to provide access to knowledge for all students worldwide, regardless of their location."], "granite3.1-dense:2b": ["The Mbita Point primary school in western Kenya has adopted a pilot project by EduVision, utilizing handheld computers called E-slates and satellite radio to provide students with digitized textbook content.", "This low-cost system transmits data via satellite to a base station within the school, which processes and converts it for the E-slates.", "The project, currently at a pilot stage, simplifies setup but lacks bidirectional communication due to its one-way connection.", "EduVision staff manage teething issues with the Linux-based system, which already offers visual and textual information alongside questions.", "They plan to expand content by incorporating audio and video files, enhancing students' learning opportunities.", "Maciej Sundra, the designer of the E-slates interface, emphasizes the project's goal of globalizing access to knowledge, particularly benefiting students in rural developing countries where internet resources are scarce.", "EduVision is also pursuing a partnership with Google to digitize 15 million public domain university library books for distribution through their base stations at schools across Africa.", "The organization aims to extend this initiative to more remote regions by incorporating solar panels, enabling daily charging during school hours and overnight use at homes."]}