{"raw_text": "Tough rules for ringtone sellers\n \n Firms that flout rules on how ringtones and other mobile extras are sold could be cut off from all UK phone networks.\n \n The rules allow offenders to be cut off if they do not let consumers know exactly what they get for their money and how to turn off the services. The first month under the new rules has seen at least ten firms suspended while they clean up the way they work. The rules have been brought in to ensure that the problems plaguing net users do not spread to mobile phones.\n \n In the last couple of years ringtones, wallpapers, screensavers and lots of other extras for phones have become hugely popular. But fierce competition is making it difficult for firms to get their wares in front of consumers, said Jeremy Flynn, head of third party services at Vodafone.\n \n \"If you are not on the operator's portal you are going to have quite heavy marketing costs because it's a problem of how people discover your services,\" he said. To combat this many ringtone and other mobile content sellers started using a new tactic to squeeze more cash out of customers. This tactic involved signing people up for a subscription to give them, for instance, several ringtones per week or month instead of the single track they thought they were getting. Mr Flynn said that the move to using subscriptions happened over the space of a few weeks at the end of 2004. Websites such as grumbletext.co.uk started getting reports from customers who were racking up large bills for phone content they did not know they had signed up for. \"What made us uncomfortable was that these services were not being marketed transparently,\" said Mr Flynn. \"People did not know they were being offered a subscription service.\" \"We saw potential for substantial consumer harm here,\" he added.\n \n The swift adoption of subscription services led to the creation of a new code of conduct for firms that want to sell content for mobile phones. The drafting of the new rules was led by the Mobile Entertainment Forum and the UK's phone firms. \"Everyone is required to conform to this code of conduct,\" said Andrew Bud, regulatory head of the MEF and executive chairman of messaging firm MBlox.\n \n \"It's all about transparency,\" he said. \"Consumers have to be told what they have got themselves into and how to get out of it.\" \"The consumer has a right to be protected,\" he said. Christian Harris, partnership manager of mobile content firm Zed, said the new system was essential if consumers were to trust companies that sell ringtones and other downloads. \"The groundrules must be applied across the whole industry and if that's done effectively we will see the cowboys driven out,\" he said. The new rules came in to force on 15 January and the first month under the new regime has seen many firms cautioned for not honouring them. Some have been told to revamp websites so customers know what they get for their money and what they are signing up for, said Mr Flynn. Also, said Mr Flynn, Vodafone has briefly cut off between eight and ten content sellers flouting the rules. \"We have quite draconian contracts with firms,\" he said. \"We do not have to say why. We can just cut them off.\" Under the rules consumers must be able to switch off the services by using a universal \"stop\" command sent via text message. He said the system had been designed to limit how much a consumer will pay if they inadvertently signed up for a service. \"The mobile is so personal that people really resent the abuse of what is effectively part of their personality,\" said Mr Flynn.\n", "llama3.2:1b": ["Firms selling ringtones and other mobile extras in the UK are required by law to inform consumers about exactly what they are getting, how to turn off services, and have a clear contract with customers before signing them up.", "At least ten firms were suspended under the new rules after failing to comply.", "The regulations aim to prevent fierce competition from making it difficult for firms to sell their products in a transparent way.", "Consumers must be able to switch off mobile services by using a universal \"stop\" command sent via text message, and firms that fail to comply risk being cut off from customers' phones."], "llama3.2:3b": ["UK phone networks may cut off firms selling ringtones and other mobile extras that don't follow new rules.", "The rules require transparency about services and costs, with consumers able to switch off using a text message.", "At least ten firms have been suspended or cautioned in the first month since the new regime came into force."], "gemma2:2b": ["Firms selling ringtones and other mobile content are facing stricter rules to ensure transparency and protect consumers.", "These rules include mandatory disclosure of services, subscription models, and an easy-to-use \"stop\" command for service cancellation.", "The new code of conduct aims to prevent unfair practices like hidden subscriptions and unexpected costs.", "Firms that violate these rules may face penalties, including suspension from networks or reduced access to phone infrastructure."], "qwen2.5:0.5b": ["• Firms with poor service quality may face severe penalties under UK telecoms rules.", "• Customers should be informed about services and offered multiple options to switch off ringtones.", "• Vodafone has already cut off 10 firms from operating mobile extras, but many others are still in trouble due to unclear rules."], "qwen2.5:1.5b": ["Mobile phone ringtones and other extras must be clearly advertised and easily accessible, or companies could lose access to UK networks.", "The new rules aim to prevent fraud and deception by making it easy for consumers to switch off services they've signed up for.", "Companies like Vodafone have suspended several firms due to non-compliance."], "qwen2.5:3b": ["Tough rules have been implemented for ringtone and other mobile content sellers in the UK, allowing those who do not follow transparency guidelines to be disconnected from all phone networks.", "At least ten firms are currently suspended while they adjust their practices.", "Competition has led some sellers to use subscription services without proper marketing.", "This prompted the creation of a new code of conduct emphasizing transparency for content sellers, aimed at protecting consumers and preventing consumer harm.", "The swift adoption of these rules resulted in many firms being cautioned or disconnected if they did not comply with them.", "Consumers must be able to turn off services using a universal \"stop\" command sent via text message to ensure fair billing."], "opencoder:1.5b": ["Tough rules for ringtone sellers \n\nFirms that flout rules on how ringtones and other mobile extras are sold could be cut off from all UK phone networks.", "The first month under the new rules has seen at least ten firms suspended while they clean up the way they work.", "In the last couple of years ringtones, wallpapers, screensavers and lots of other extras for phones have become hugely popular.", "But fierce competition is making it difficult for firms to get their wares in front of consumers.", "\"If you are not on the operator's portal you are going to have quite heavy marketing costs because it's a problem of how people discover your services,\" he said.", "The swift adoption of subscription services led to the creation of a new code of conduct for firms that want to sell content for mobile phones.", "In the drafting of the new rules, the Mobile Entertainment Forum and the UK's phone firms agreed on \"everyone is required to conform to this code of conduct\".", "The groundrules must be applied across the whole industry and if done effectively we will see the cowboys driven out."], "smollm:1.7b": ["The rules allow offenders to be cut off if they do not let consumers know exactly what they get for their money and how to turn off the services.", "The first month under the new rules has seen at least ten firms suspended while they clean up the way they work.", "The rules have been brought in to ensure that the problems plaguing net users do not spread to mobile phones."], "deepseek-r1:1.5b": ["Tough new rules aim to silence ringtone sellers by forcing them to disclose how they offer mobile content.", "The first month saw several companies suspended under these measures, which also led to increased competition.", "Vodafone, a major mobile provider, switched from paying for multiple ringtones weekly or monthly to subscription services, citing a \"stop\" command in text messaging as their marketing tool.", "This shift was driven by the need for transparency and consumer protection.", "The new rules require consumers to know what they're getting and how to turn it off, which adds personal touches that could abuse users."], "tinyllama:1.1b": ["Ahead of the new year, firms selling mobile content have been slapped with a new set of guidelines to ensure they inform and educate consumers about their services before offering them.", "Under the code of conduct, consumers are required to be told what they get for their money and how they can turn off or cancel subscription services.", "The rules aim to prevent firms from abusing the consumer's trust and causing harm, particularly for people who have already subscribed to content they did not know they were signing up for.", "Some firms have been caught by the new rules, including VoDAfonE, which temporarily suspended ten offending firms in January 2021 after failing to adhere to the code of conduct, citing poor compliance.", "The code has been broached in a new effort to combat consumer harm and protect consumers from companies that offer untruthful content to them without proper transparency."], "tinydolphin:1.1b": [" The UK's mobile phone firms are under pressure to tighten up their marketing practices, following reports that some companies are selling ringtones and other downloadable content without consumers knowing exactly what they get for their money.", "In an effort to address this issue, the Mobile Entertainment Forum (MEF) and the UK's phone firms have come up with a set of new code of conduct for mobile content sellers.", "The drafting of these rules was led by the MEF and the UK's phone companies, including Vodafone.", "According to Andrew Bud, regulatory head of the MEF and executive chairman of MBlox, the new code of conduct requires firms to adhere to strict guidelines for promoting their products and services, ensuring that consumers are informed about exactly what they get for their money and how to stop receiving new ringtones or other downloads.", "Christian Harris, partnership manager of mobile content firm Zed, agrees with Bud that consumer protection is crucial in the digital age, and he believes that the new system is essential if consumers are to trust companies that sell ringtones and other downloadable content.", "The first month under the new rules has seen many firms cautioned for not adhering to the code of conduct, with some being told to revamp their websites or remove certain features that have left customers questioning their value.", "Vodafone has briefly cut off between eight and ten mobile content sellers flouting the rules, while some other firms are said to be using temporary suspensions to test the market.", "The Mobile Entertainment Forum (MEF) and the UK's phone companies, including Vodafone, are working together to tighten up marketing practices and ensure that consumers understand exactly what they get for their money when it comes to mobile content."], "phi:2.7b": [" The UK's phone networks have imposed tough rules on firms selling ringtones and other mobile content, which can lead to suspension from all networks if they do not market transparently and allow customers to easily turn off services.", "These rules were created in response to concerns about the spread of problems plaguing net users to mobile phones.", "Many firms started using subscription services for phone content, leading to potential consumer harm as customers did not know what they were signing up for.", "The new code of conduct requires transparency and a stop command to end subscriptions.", "Vodafone has briefly suspended several companies for flouting the rules, while others have been cautioned and told to revamp their websites."], "orca-mini:3b": [" The article discusses new rules for ringtone sellers and how they could be cut off from all UK phone networks if they do not follow the rules.", "The rules require firms to tell consumers exactly what they get for their money and how to turn off the services, and many firms have been cautioned for not following them.", "Some firms have also been told to revise their websites so that customers know what they are signing up for.", "Consumers must be able to switch off the services by using a \"stop\" command sent via text message.", "The new rules were designed to limit how much consumers will pay if they inadvertently signed up for a service."], "hermes3:3b": ["Ringoate sellers facing rules to prevent misleading, consumer-harming practices; firms flouting transparency must be cut off from UK networks."], "stablelm-zephyr:3b": ["UK phone networks could cut off firms selling ringtones and other mobile extras from all networks if they don't follow rules.", "The rules, created by the Mobile Entertainment Forum and UK phone firms, ensure transparency for consumers.", "At least ten firms have been suspended since the new rules began on 15 January.", "Subscription services led to concerns as customers unknowingly signed up for large costs.", "Firms must now revamp their websites or risk being cut off, and consumers can switch off services using a universal \"stop\" command sent via text message."], "chatgpt-4o-latest": ["New rules in the UK require ringtone and mobile content sellers to clearly inform consumers about costs and subscription terms, with violators facing suspension from all UK phone networks.", "The regulations, introduced to prevent deceptive practices, emerged after firms began enrolling customers in subscription services without clear disclosure.", "The Mobile Entertainment Forum and UK phone firms developed the code of conduct to ensure transparency and consumer protection.", "Since the rules took effect on 15 January, several firms have been warned or temporarily cut off for non-compliance.", "Consumers must also have a simple way to cancel services via a universal \"stop\" command.", "The measures aim to build trust and eliminate unethical sellers from the industry."], "stablelm2:1.6b": ["Firms could be cut off from UK phone networks for flouting rules on selling ringtones and other mobile extras, which require clear disclosure and easy termination.", "At least ten firms have been suspended during the first month under new rules aimed at protecting users.", "Subscription services led to a code of conduct for content sellers, which must now ensure transparency in all dealings.", "UK's phone firms and the Mobile Entertainment Forum drafted these new rules after reports of customers being misled into signing up for subscriptions they didn..", "Fierce competition is making it difficult for firms to get their wares in front of consumers; some ringtone and other mobile content sellers started using a subscription tactic to boost sales, which caused issues with customers unaware of the additional costs.", "Head of third party services at Vodafone said, \"If you are not on the operator's portal, you are going to have quite heavy marketing costs because it's a problem of how people discover your services.\"", "In response, many firms faced suspension for not honoring the rules.", "Under the new system, consumers must know exactly what they get for their money and how to turn off service.", "To ensure compliance, Vodafone briefly cut off between eight and ten content sellers that flouted these rules.", "The universal \"stop\" command through text message limits the consumer's costs if they inadvertently signed up for a service.", "Overall, the rules were brought in to protect users from spreading issues affecting internet users and now have been adapted for mobile phones."], "granite3.1-dense:2b": ["Mobile phone networks, including UK operators like Vodafone, have implemented strict rules to regulate the sale of ringtones and other mobile extras.", "These rules aim to prevent consumer harm from fraudulent practices, such as unauthorized subscriptions that led to unexpected charges.", "Firms found non-compliant face suspension or termination of their services.", "The new guidelines emphasize transparency: consumers must be informed about the content they purchase and how to disable these services easily using a universal \"stop\" command via text message.", "This swift enforcement, enforced since January 15, has already resulted in cautions for ten firms, who are now required to revamp their websites to clearly display what customers receive and sign up for.", "The primary objective is to protect consumers from unforeseen expenses and ensure a positive mobile experience."]}