{"raw_text": "Savvy searchers fail to spot ads\n \n Internet search engine users are an odd mix of naive and sophisticated, suggests a report into search habits.\n \n The report by the US Pew Research Center reveals that 87% of searchers usually find what they were looking for when using a search engine. It also shows that few can spot the difference between paid-for results and organic ones. The report reveals that 84% of net users say they regularly use Google, Ask Jeeves, MSN and Yahoo when online.\n \n Almost 50% of those questioned said they would trust search engines much less, if they knew information about who paid for results was being hidden. According to figures gathered by the Pew researchers the average users spends about 43 minutes per month carrying out 34 separate searches and looks at 1.9 webpages for each hunt. A significant chunk of net users, 36%, carry out a search at least weekly and 29% of those asked only look every few weeks. For 44% of those questioned, the information they are looking for is critical to what they are doing and is information they simply have to find.\n \n Search engine users also tend to be very loyal and once they have found a site they feel they can trust tend to stick with it. According to Pew Research 44% of searchers use just a single search engine, 48% use two or three and a small number, 7%, consult more than three sites. Tony Macklin, spokesman for Ask Jeeves, said the results reflected its own research which showed that people use different search engines because the way the sites gather information means they can provide different results for the same query. Despite this liking for search sites half of those questioned said they could get the same information via other routes. A small number, 17%, said they wouldn't really miss search engines if they did not exist. The remaining 33% said they could not live without search sites. More than two-thirds of those questioned, 68%, said they thought that the results they were presented with were a fair and unbiased selection of the information on a topic that can be found on the net. Alongside the growing sophistication of net users is a lack of awareness about paid-for results that many search engines provide alongside lists of websites found by indexing the web. Of those asked, 62% were unaware that someone has paid for some of the results they see when they carry out a search. Only 18% of all searchers say they can tell which results are paid for and which are not. Said the Pew report: \"This finding is ironic, since nearly half of all users say they would stop using search engines if they thought engines were not being clear about how they presented paid results.\" Commenting Mr Macklin said sponsored results must be clearly marked and though they might help with some queries user testing showed that people need to be able to spot the difference.\n", "llama3.2:1b": ["Savvy searchers fail to spot ads internet search engine users are an odd mix of naive and sophisticated, with 87% finding what they were looking for using a search engine.", "Few can distinguish between paid-for results and organic ones, with 84% using Google, Ask Jeeves, MSN, and Yahoo.", "Almost half (50%) say they would trust search engines less if they knew information about paid results was hidden.", "The average user spends around 43 minutes per month conducting searches, and looks at around 1.9 webpages per search.", "Many users (36%) conduct a search weekly or more often, with critical information being the top priority.", "Users tend to be loyal to their sites of choice, with 44% using just one search engine and 48% using two or three.", "The Pew report notes that while half of users use different search engines for each query, many lack awareness about paid-for results, with only 18% knowing which are sponsored and which aren't.", "Many (62%) cannot tell the difference between paid-for and organic results."], "llama3.2:3b": ["87% of searchers usually find what they're looking for, 84% use major search engines daily, 62% are unaware paid results are ads, 44% trust a single site, 68% believe search results are fair and unbiased, most users stick with trusted sites despite knowing ads exist."], "gemma2:2b": ["- 87% of internet users find what they're searching for using search engines.", "- Many are unaware that paid results exist alongside organic ones.", "- Users rely on specific search engines, showing loyalty and a preference for established platforms.", "- Most believe search engine results are fair and unbiased.", "- The majority would stop using search engines if they weren't transparent about paid results."], "qwen2.5:0.5b": ["Savvy internet users often overlook paid-for search results, while those unaware of these may choose search engines for certain information.", "About 68% reported not knowing they were presented with paid results and only 18% could tell if those found in paid searches are fair or unbiased.", "Most users would stop using search engines if they believed websites provided by payers were not clear about their content."], "qwen2.5:1.5b": ["Internet search engine users often find what they're looking for, but struggle to recognize ads in paid-for results.", "Most users trust search engines despite knowing hidden information about advertisers.", "About 68% believe search sites present a fair selection of internet information.", "Despite being loyal to one or two engines, almost half feel the need to use multiple sources due to differing results from each.", "Users don't fully understand why paid ads are included in their searches and prefer visibility alerts for these placements."], "qwen2.5:3b": ["Savvy searchers fail to spot ads.", "A report by US Pew Research Center highlights 87% of users find what they're looking for through search engines, despite only 26% knowing paid-for and organic results differ.", "Google, Ask Jeeves, MSN, and Yahoo dominate with 84% usage.", "Users spend about 43 minutes per month on average, visiting 1.9 webpages per search.", "About a quarter of users perform searches weekly, while nearly half consider the information critical for their task.", "Users are loyal to single engines (44%), multi-engine users (48%), and few consult more than three sites (7%).", "Tony Macklin from Ask Jeeves notes people use different engines due to varying data gathering.", "62% unaware of paid-for results, with only 18% able to distinguish them.", "Nearly half would discontinue search engine usage if they knew paid results were hidden; 17% said no impact, while 33% claimed essential.", "Awareness about paid results is low, leading many users to distrust the integrity of their searches."], "opencoder:1.5b": ["The report suggests that users are more likely to trust search engines when using them for online searches than if they know which paid result is hidden or not disclosed.", "This finding is driven by the fact that many users have difficulty locating information even when the information is available on other sites.", "However, users also perceive that paid results can often be a valuable resource for seeking specific information, especially in niche fields where traditional web searches are slow and inefficient."], "smollm:1.7b": ["The report suggests that internet search engine users are an odd mix of naive and sophisticated, reveals that few can spot the difference between paid-for results and organic ones, and that many searchers rely on a single search engine.", "The Pew Research Center's findings also indicate that 87% of net users say they usually find what they were looking for when using a search engine."], "deepseek-r1:1.5b": ["A report by the US Pew Research Center reveals that most search engine users (87%) find results easily using standard engines like Google, Ask Jeeves, MSN, and Yahoo, while 84% regularly use these services.", "Users trust search engines less if they know information about paid results was hidden.", "Spend time per month is around 43 minutes for 34 searches, with an average of 1.9 webpages per hunt.", "Searchers spend nearly half their time on one or two engines (44%) and a third weekly/fortnightly (29%).", "Those seeking critical info focus much more (44%), while others find it less important (50-67%).", "Paid results are often used by users who aren't sure about search engine policies, with half not missing benefits if search engines didn't exist."], "tinyllama:1.1b": ["The Pew Research Center report reveals that seafood users are an odd mix of naive and knowledgeable, as only 87% of net users can tell when paid-for results are presented alongside organic search results.", "The average users spend almost 43 minutes per month on the internet, looking at 1.9 webpage views for each hunt.", "The information they seek is critical to what they do, and seafood users are very loyal to their favorite sites, with 44% of them using just a single search engine and 7% using more than three.", "Despite liking seafood-related websites, only 29% of net users say the information provided by these sites is critical and 17% can't live without them.", "A large number of net users, 36%, have paid for results, and only half (68%) think they are a fair selection of information on the topic that can be found on the internet.", "Despite being aware of paid-for results, most seafood users are unsure about their accuracy, with 18% believing that some pay-for-results are not accurate."], "tinydolphin:1.1b": [" The US Pew Research Center report reveals that internet searchers face difficulties when it comes to recognizing paid-for results, according to the study by the Pew Research Center.", "The report examined the habits of net users, with 87% using a particular search engine while only 29% being aware that information about who has paid for results is hidden.", "The majority of online users trust search engines much less if they know about this information, and only 18% think they can tell which results are paid for compared to the others.", "Despite the lack of transparency regarding paid-for results, a significant portion of users still rely on search engines for their internet browsing and looking up information."], "phi:2.7b": [" Internet search engine users are generally satisfied with finding what they want, but many do not know when paid-for search results are being presented alongside organic ones.", "A study by Pew Research Center shows that 87% of searchers usually find what they were looking for and 84% cannot tell the difference between paid-for and organic results.", "The average user spends 43 minutes per month searching the web with 1.9 webpages searched per search, with 44% of users saying information is critical to their tasks.", "Users tend to use only a single search engine but can get the same information from other sources.", "Many people are unaware that some search engines display sponsored results, and if they knew about it, half of them would not use the site.", "Google has stated that sponsored results should be clearly marked."], "orca-mini:3b": [" Search engine users are an odd mix of naive and sophisticated, according to a report by the US Pew Research Center.", "87% of searchers usually find what they were looking for when using a search engine, while only 18% of all searchers can tell which results are paid for and which are not.", "Users spend about 43 minutes per month carrying out 34 separate searches and look at 1.9 webpages for each hunt.", "Search engines are used regularly by almost 50% of net users, with 29% using two or three sites and only 7% consulting more than three sites.", "Most users would not really miss search engines if they did not exist, although half of all users said they could get the same information via other routes.", "Search engines are presented with a fair and unbiased selection of the information on a topic that can be found on the net, according to user testing.", "Sponsored results must be clearly marked, but only 18% of all searchers can tell which results are paid for and which are not."], "hermes3:3b": ["Search users often miss ads; 87% find needed info, but 62% unaware ads are paid-for, 18% can distinguish them."], "stablelm-zephyr:3b": ["A report by US Pew Research Center reveals that although 87% of internet searchers find what they were looking for, many are unaware of paid-for results appearing alongside organic ones.", "Around 50% said they would trust search engines less if they knew information about who paid for results was being hidden.", "Most loyal to specific search engines, 44% use just a single engine and 48% use two or three.", "62% of those questioned were unaware that someone has paid for some of the results they see when carrying out a search.", "Only 18% could tell which results were paid for and which were not."], "chatgpt-4o-latest": ["A report by the US Pew Research Center reveals that while 87% of internet search engine users usually find what they are looking for, most cannot distinguish between paid and organic results.", "About 84% of users regularly use search engines like Google, Ask Jeeves, MSN, and Yahoo, with 44% relying on a single search engine.", "Nearly half of users would trust search engines less if they knew paid results were hidden, yet 62% are unaware that some results are paid for.", "Only 18% can identify paid listings.", "Despite this, 68% believe search results are fair and unbiased.", "While search engines are widely used, 50% believe they could find the same information elsewhere, and 17% say they wouldn’t miss search engines if they disappeared.", "The report highlights the irony that nearly half of users would stop using search engines if they felt paid results were not clearly presented, emphasizing the need for transparency in search result labeling."], "stablelm2:1.6b": ["A report by the US Pew Research Center suggests that 47% of internet search engine users usually find what they were looking for, but few can distinguish between paid-for results and organic ones.", "Around 60% of net users say they regularly use Google, Ask Jeeves, MSN, and Yahoo when online.", "A significant number of users carry out searches weekly or every few weeks.", "Search engine users are loyal, with 47% using just one search engine, 23% two or three, and a small percentage, 7%, consulting more than three sites.", "The report also reveals that a lack of awareness about paid-for results is common among internet users, with 50% being unaware someone has paid for some search engine results."], "granite3.1-dense:2b": ["87% of internet users typically find their desired information through search engines like Google, Ask Jeeves, MSN, or Yahoo.", "Despite this high success rate, 62% are unaware that some search results are paid advertisements.", "Only 18% can discern paid from organic results.", "Users spend an average of 43 minutes monthly on searches, conducting 34 sessions with 1.9 webpage views each.", "Weekly and bi-weekly searchers make up 56% of users, while 44% find the information sought crucial for their activities.", "Users exhibit loyalty to their preferred search engines, with 44% sticking to a single site, 48% using two or three, and 7% preferring more than three.", "A significant minority (33%) cannot live without search sites, while 68% believe results are fairly presented.", "Half of respondents could access information via alternative methods.", "Tony Macklin from Ask Jeeves noted that varying site data gathering methods contribute to diverse search outcomes for the same query.", "Despite this preference, 17% claimed they wouldn't miss search engines if they disappeared.", "The Pew Research Center emphasized the importance of clear presentation of paid results, as nearly half of users would abandon search engines if not assured about how these are displayed."]}