{"raw_text": "TV's future down the phone line\n \n Internet TV has been talked about since the start of the web as we know it now.\n \n But any early attempts to do it - the UK's Home Choice started in 1992 - were thwarted by the lack of a fast network. Now that broadband networks are bedding down, and it is becoming essential for millions, the big telcos are keen to start shooting video down the line. In the face of competition from cable companies offering net voice calls, they are keen to be the top IPTV dogs. Software giant Microsoft thinks IPTV - Internet Protocol TV - is the future of television, and it sits neatly with its vision of the \"connected entertainment experience\". \"Telcos have been wanting to do video for a long time,\" Ed Graczyk, director of marketing for Microsoft IPTV, told the BBC News website. \"The challenge has been the broadband network, and the state of technology up until not so long ago did not add up to a feasible solution. \"Compression technology was not efficient enough, the net was not good enough. A lot of stars have aligned in the last 18 months to make it a reality.\"\n \n Last year, he said, was all about deal making and partnering up; shaping the \"IPTV ecosystem\". This year, those deals will start to play out and more services will come online. \"2006 is where it starts ramping up and expanding to other geographies - over time as broadband becomes more prevalent in South America, and other parts of Asia, it will expand,\" he added. What telcos really want to do is to send the \"triple-play\" of video, voice, and data down one single line, be it cable or DSL (Digital Subscriber Line). Some are talking about \"quadruple play\", too, with mobile services added into the mix. It is an emerging new breed of competition for satellite and cable broadcasters and operators. According to technology analysts, TDG Research, there will be 20 million subscribers to IPTV services in under six years.\n \n Key to the appeal of sending TV programmes down the same line as the web data, whenever a viewer wants it, is that it uses the same technology as the internet. It means there is not just a one-way relationship between the viewer and the \"broadcaster\". This allows for more DVD-like interactivity, limitless storage and broadcast space, bespoke channel \"playlists\", and thousands of hours of programmes or films at a viewer's fingertips. It potentially lets operators target programmes to smaller, niche or localised audiences, sending films to Bollywood fans for instance, as well as individual devices.\n \n Operators could also send high-definition programmes straight to the viewer, bypassing the need for a special broadcast receiver. Perhaps most compelling - yet some might say insignificant - is instantaneous channel flicking. Currently, there is a delay when you try to do this on satellite, cable or Freeview. With IPTV, the speed is 15 milliseconds. \"That gets rounds of applause,\" according to Mr Graczyk. Microsoft is one of the companies that started thinking about IPTV some time ago. \"We believe this will be the way all TV is delivered in the future - but that is several years away,\" said Mr Graczyk. \"As with music, TV has moved to digital formats. \"The things software can do to integrate media into devices means a whole new generation of connected entertainment experiences that cross devices from the TV, to the mobile, to the gaming console and so on.\" The company intends its Microsoft's IPTV Edition software, an end-to-end management and delivery platform, to let telcos to do exactly that, seamlessly. It has netted seven major telcos as customers, representing a potential audience of 25 million existing broadband subscribers. Its deal with US telco SBC was the largest TV software deal to date, said Mr Graczyk.\n \n IPTV is about more than telcos, though. There are several web-based offerings that aim to put control in the hands of the consumer by exploiting the net's power. Jeremy Allaire, chief of Brightcove, told the BBC News website that it would be a flavour of IPTV that was about harnessing the web as a \"channel\".\n \n \"It is not just niches, but about exploiting content not usually viewed,\" he said. \"We are focussed on the owners of video content who have rights to digitally distribute content, and who often see unencumbered distribution. \"For them to do it through cable and so on is price-prohibitive,\" he said. This type of IPTV service might also be a distribution channel for more established publishers who have unique types of content that they cannot offer through cable and satellite operators - history channel archives, for instance. What is a clear sign that IPTV has a future is that Microsoft is not the only player in the field. There are a lot of other \"middleware\" players providing similar management services as Microsoft, like Myrio and C-Cor. But it will up to the viewer to decide if it really is to be successful.\n", "llama3.2:1b": ["TV's future lies down phone lines for internet TV\nThe UK's Home Choice started in 1992 with failed attempts at television through phone lines.", "Now that broadband networks are established, telcos such as Microsoft and SBC want to deliver video content over these lines.", "Microsoft thinks IPTV (Internet Protocol Television) is the future of television, allowing for interactivity and high-definition broadcasts.", "Operators such as SBC have already partnered with Microsoft to use its IPTV Edition software, which allows them to manage and deliver TV services seamlessly.", "IPTV offers a single line for video, voice, and data, reducing competition from cable and satellite operators."], "llama3.2:3b": ["Internet Protocol TV (IPTV) is being launched by big telcos as broadband networks improve, aiming to deliver video, voice, and data over a single line.", "IPTV uses internet technology, allowing for interactive services like DVD-like features, high-definition broadcasts, and instant channel switching.", "Microsoft sees IPTV as the future of television, with plans to integrate it into its \"connected entertainment experience\".", "Telcos aim to offer triple-play or quadruple-play services, competing with satellite and cable broadcasters.", "Analysts predict 20 million IPTV subscribers in under six years, while web-based offerings also emerge, focusing on niche content and unencumbered distribution for video owners."], "gemma2:2b": ["Internet TV (IPTV) is becoming a viable option for delivering television programming over broadband networks.", "IPTV's success is fueled by technological advancements in compression technology and the widespread adoption of broadband internet access.", "Key benefits of IPTV include:\n*  User-friendly interactivity similar to DVD players.", "*  Broadcasting flexibility with limitless storage, targeted channel \"playlists,\" and on-demand content delivery.", "*  Instantaneous channel switching without delay.", "*  Integration of media across various devices like TV, mobile, and gaming consoles.", "Numerous companies are investing in IPTV technology, including Microsoft and Brightcove, which focus on different aspects of the ecosystem.", "While IPTV holds promise as a disruptive force in television delivery, success will depend on viewers embracing its convenience and flexibility."], "qwen2.5:0.5b": ["Internet TV is set to become the future of television through the use of broadband networks, especially in countries with limited bandwidth, such as the UK.", "The telcos are keen to start using IPTV, a technology that allows videos and voice to be sent down one line at once.", "Some telcos want to send videos for a triple-play experience including video, audio and data, while others are focused on sending high-definition programmes straight to the viewer.", "A deal was made between Microsoft and major telco SBC, with the former paying $7 billion for access to 12 million broadband subscribers in the UK, representing potential audience of two billion people.", "Key benefits of IPTV include: seamless video streaming across devices, limitless storage space, ability to offer bespoke channel \"playlists\", unlimited viewership, and the ability to target smaller audiences through mobile and gaming console services.", "Brightcove's Myrio is another company that aims to provide a similar service for video content distribution.", "Internet TV has been talked about since the start of the web as we know it now.", "Many early attempts were thwarted by the lack of broadband networks, competition from cable companies offering net voice calls, and the state of technology up until not so long ago.", "The telcos are keen to become the top IPTV dogs in the market, while Microsoft sees IPTV as a future solution for television.", "The deal between Microsoft and SBC will begin in 2017, with two million subscribers joining the deal within three years.", "This represents about a 35% increase in broadband users since December 2016.", "Brightcove is set to be one of the companies that start delivering IPTV in India, while Myrio will work on expanding in South Africa and the US.", "The potential market for IPTV services could potentially reach hundreds of millions of people in under six years, as well as new competition from OTT services and web-based content distribution."], "qwen2.5:1.5b": ["Internet TV, once considered an internet-only concept, has now moved into traditional television with the advent of broadband networks.", "Major telecom companies are interested in delivering video content over existing cable or DSL lines for faster delivery and cost savings compared to satellite or cable.", "Microsoft believes IPTV will become a standard way of viewing TV content, although it is still several years away due to technological challenges.", "Key points include:\n- The future of television is expected to be delivered via broadband networks.", "- Telcos are exploring the \"triple-play\" model combining video, voice, and data services.", "- Microsoft has been one of the pioneers in thinking about IPTV since 1992, focusing on integration with software for seamless delivery across devices.", "- The potential benefits include more interactive viewing experiences, better storage options, and targeted programming tailored to specific audiences."], "qwen2.5:3b": ["TV's future down the phone line\n\nInternet TV has been discussed since web inception, but early attempts faced challenges due to slow network speeds.", "With broadband networks becoming more widespread, telcos are eager to offer IPTV (Internet Protocol TV), which allows for streaming video alongside internet data.", "Microsoft sees this as the future of television, aligning with its vision for a connected entertainment experience.", "Telcos aim to provide triple-play services—video, voice, and data—on one line, potentially including mobile services.", "Key features include more interactive content like DVDs, unlimited storage, personalized channel options, and instant access, reducing latency compared to satellite or cable.", "Web-based IPTV platforms enable viewers to control their entertainment experiences by accessing unencumbered video content through the internet.", "IPTV's growth is expected with an estimated 20 million subscribers within six years.", "Despite some skepticism about its success, numerous players are investing in IPTV technology and services."], "opencoder:1.5b": ["Microsoft's vision for IPTV has been centered on the idea of delivering an integrated media experience that caters to consumers' needs while exploiting the digital distribution network's capabilities.", "The company has aimed to establish a platform that not only allows operators to target specific audiences but also delivers high-quality content across multiple devices and platforms.", "This alliances promise to revolutionize the way people consume TV services, providing an end-to-end entertainment experience, without compromising on quality or efficiency."], "smollm:1.7b": ["The article provides an overview of the concept of IPTV (Internet Protocol Television) and its potential impact on the television industry.", "It highlights the key ideas and details of the text, including:\n\n1.", "The idea that IPTV will revolutionize the way people consume television content by allowing them to access a vast library of programs from anywhere in the world at any time.", "2.", "The use of the internet as a distribution channel for TV programming, which allows for greater flexibility and interactivity between the viewer and the program.", "3.", "The potential benefits of IPTV, including increased accessibility, lower costs, and more personalized viewing experiences.", "4.", "The role of Microsoft in the development of IPTV technology, and its plans to enter the market with a comprehensive distribution platform.", "5.", "The competitive landscape of IPTV players, including Myrio, C-Cor, and others, which are vying for market share.", "6.", "The importance of content providers in shaping the future of IPTV, as they have significant control over what programs are available to consumers."], "deepseek-r1:1.5b": ["Internet TV is poised for a significant future, driven by advancements in broadband technology and software integration.", "Earlier attempts, like Home Choice in the UK, faced challenges from limited connectivity but are now seeing improvement.", "Microsoft's vision of IPTV as the \"connected entertainment experience\" aims to revolutionize how content is delivered, offering seamless integration of video, voice, and data.", "With 20 million subscribers predicted within six years by TDG Research, telcos like Microsoft have already expanded their reach.", "High-definition content can be streamed directly without a separate receiver, with viewer-adjustable flickers across multiple media types.", "SBC's largest deal in recent history solidifies Microsoft's position as a key player.", "Brightcove introduces web-based IPTV, allowing consumers to control the content through platforms like the web, targeting niche audiences effectively."], "tinyllama:1.1b": ["The text describes TV's future down the phone line, where broadband networks are bedding down, and a vision of the \"connected entertainment experience\" (IPTV).", "The article mentions several major telcos as customers of Microsoft's IPTV Edition software, representing a potential audience of 25 million existing broadband subscribers.", "The article also notes several web-based offering services aimed at exploiting the net's power, including Brightcove and Myrio.", "The author also mentions several companies in the field of managing TV channels and distributing content.", "These companies are providing similar management services to Microsoft, while a possible alternative is a distribution channel for midlvel publishing houses with unique types of content."], "tinydolphin:1.1b": [" The summary provides an overview of the text: TV's future in the digital age is being determined by cloud technology.", "Internet TV offers a seamless way for viewers to access video content, and is about more than just telcos wanting to send TV channels down the phone line.", "It also has potential to be a distribution channel for publishers who have unique types of content that they cannot offer through cable operators.", "The key idea presented in this summary is that Microsoft's Microsoft IPTV Edition software offers management and delivery capabilities for live TV, enabling telcos to integrate media into devices such as smartphones, tablets, and gaming consoles."], "phi:2.7b": [" Internet TV has been discussed since the inception of the web and its development was impeded by the lack of a fast network until broadband networks became available.", "The big telcos are now eager to offer IPTV services, which allow for more personalized viewing experiences and targeted programming, and Microsoft sees it as the future of television.", "Companies like Brightcove aim to give consumers control over their video content by utilizing the web's power and creating new distribution channels for existing publishers.", "With a variety of players in the field, it remains to be seen if IPTV can become widely adopted by viewers."], "orca-mini:3b": [" TV's future down the phone line"], "hermes3:3b": ["Internet TV via broadband networks (IPTV) is the future of television, due to better compression technology and faster internet speeds enabling more interactivity, storage space, personalized content, HD programs, instant channel switching, and integration with devices like mobiles and gaming consoles.", "Telcos are interested in offering this as it complements their triple-play or quadruple-play services."], "stablelm-zephyr:3b": ["Internet TV, or IPTV (Internet Protocol TV), is becoming the future of television according to software giant Microsoft.", "The company sees IPTV as a \"connected entertainment experience\" and believes it is the way all TV will be delivered in the future.", "With the development of broadband networks making it increasingly essential for millions of people, big telcos are keen to start shooting video over this network, competing with cable companies offering net voice calls and mobile services added into the mix as a \"quadruple play\".", "The key appeal of IPTV is that it uses the same technology as the internet, allowing for more interactivity, limitless storage, bespoke channel \"playlists\", and thousands of hours of programmes or films at a viewer's fingertips."], "chatgpt-4o-latest": ["The rise of broadband has made IPTV (Internet Protocol TV) a viable option for delivering television content.", "Major telecom companies, eager to compete with cable providers, are investing in IPTV to offer bundled services of video, voice, and data.", "Microsoft sees IPTV as the future of television, enabling interactive, on-demand content and seamless integration across devices.", "The technology allows for personalized programming, high-definition streaming, and near-instantaneous channel switching.", "While Microsoft has secured major telecom deals, other companies like Brightcove are exploring web-based IPTV models that empower content owners.", "With multiple players entering the market, IPTV's success ultimately depends on consumer adoption."], "stablelm2:1.6b": ["Internet TV (IPTV) has been discussed since the early days of the internet but was hindered by lack of a fast network.", "With broadband networks improving, major telcos are eager to offer video services down one single line (cable or DSL).", "Software giant Microsoft believes IPTV is the future of television and it's connected with their vision of \"connected entertainment experience.\"", "Last year was mainly about deal making and partnerships for developing the IPTV ecosystem; this year deals will start playing out, leading to more services coming online.", "By 2023, there could be one million subscribers in a million subscribers in under six years.", "The main appeal of using the internet as a video delivery system is the same technology used for web data and its ability Lend operators more possibilities such as targeted audiences, personalized content, bespoke channel playlists, instant channel switching, limitless storage & broadcast space, individual devices, high-definition programs, bypassing special satellite receivers, and instantaneous channel switching.", "Microsoft's Microsoft IPTV Edition software is an end-to-end management and delivery platform allowing telcos to offer a seamless experience with netted seven major telco customers representing a potential audience of 1 million existing broadband subscribers.", "Although it’s not just about the telcos anymore - there are various web-based offerings that aim to give users more control over their entertainment by leveraging the internet's power.", "Brightcove, for instance, is a company dedicated to harnessing the web as a distribution channel and exploiting video content not usually viewed due to its price-prohibitive nature when distributed through traditional channels like cable or satellite.", "The success of IPTV will depend on who controls the internet and how people use it; but with technology improving by the day, it's safe to say that we'll see more of this in the future."], "granite3.1-dense:2b": ["Internet Protocol Television (IPTV) is gaining traction as broadband networks improve.", "Initially hindered by insufficient bandwidth and technology, IPTV now aims to transmit video alongside internet data via existing lines like cable or DSL.", "This \"triple-play\" model combines video, voice, and high-speed data into one connection, potentially reaching 20 million subscribers within six years, according to analysts TDG Research.", "Key benefits of IPTV include:\n1.", "Interactive viewing experiences through DVD-like interactivity, limitless storage, and customizable channels.", "2.", "Instantaneous channel switching with minimal delay (15 milliseconds).", "3.", "Targeted content for niche audiences, such as Bollywood fans or local programming.", "4.", "High-definition video delivery without specialized receivers.", "5.", "Seamless integration of television content across devices like TVs, mobiles, and gaming consoles.", "Major players in IPTV include software giants Microsoft and Brightcove, as well as middleware companies Myrio and C-Cor.", "Microsoft's IPTV Edition software manages end-to-end delivery for seven major telcos, potentially reaching 25 million existing broadband subscribers.", "Alternative IPTV offerings focus on harnessing the web as a channel for content distribution, catering to niche audiences and offering unique content not typically provided by traditional cable or satellite operators.", "The success of IPTV will depend on viewer adoption."]}