{"raw_text": "BT program to beat dialler scams\n \n BT is introducing two initiatives to help beat rogue dialler scams, which can cost dial-up net users thousands.\n \n From May, dial-up net users will be able to download free software to stop computers using numbers not on a user's \"pre-approved list\". Inadvertently downloaded by surfers, rogue diallers are programs which hijack modems and dial up a premium rate number when users log on. Thousands of UK dial-up users are believed to have been hit by the scam. Some people have faced phone bills of up to £2,000. BT's Modem Protection program will check numbers that are dialled by a computer and will block them if they have not been pre-approved, such as national and net service provider numbers. Icstis, the UK's premium rate services watchdog, said it had been looking for companies to take the lead in initiatives. \"The initiatives are very welcome,\" a spokesperson from Icstis told the BBC News website. \"We are very pleased to see they are putting into place new measures to protect consumers.\"\n \n The second initiative BT announced is an early warning system which will alert BT customers if there is unusual activity on their phone bills. If a bill rises substantially above its usual daily average, or if a call is made to a suspect number, a text or voice alert will be sent to the user's landline phone. As part of the clamp-down on rogue diallers, companies must now satisfy stringent conditions, including clear terms and conditions, information about how to delete diallers and responsibility for customer refunds. Any firm running a dialler without permission can now be closed down by Icstis. The watchdog brought in the action last October following a decision to license all companies which wanted to operate legitimate premium rate dialler services.\n \n There are legitimate companies who offer services such as adult content, sports results and music downloads by charging a premium rate rather than by credit card BT said it had ploughed an enormous amount of effort into protecting people from the problem. It has already barred more than 1,000 premium rate numbers and has tried to raise public awareness about the scams. \"We now want to ensure there are even stronger safeguards for our customers, who we would urge to make use of these new options to protect themselves,\" said Gavin Patterson, group managing director for consumer the arm of BT. Both schemes have been undergoing trials in Ireland, and will be made available to 20 million BT customers from May.\n", "llama3.2:1b": ["BT is introducing two initiatives to combat rogue dialler scams, including Modem Protection software that blocks dialled numbers not on a user's pre-approved list, and an early warning system that alerts customers if their bills are unusual or if calls are made to suspect numbers.", "The UK's premium rate services watchdog, Icstis, is behind the initiatives and has been looking for companies to take the lead in protecting consumers.", "The watchdog has introduced stringent conditions on diallers, including clear terms and conditions, information about how to delete them, and responsibility for customer refunds.", "BT customers can download Modem Protection software from May to stop rogue diallers, and it will be made available to 20 million BT customers.", "A new early warning system is also being rolled out in Ireland, which will alert customers of unusual activity on their phone bills."], "llama3.2:3b": ["BT is introducing two initiatives to help beat dial-up net scams: \n\n- Free software to block unauthorized numbers \n- An early warning system that alerts users to unusual phone bill activity"], "gemma2:2b": ["BT is introducing two initiatives to combat rogue dialer scams that can lead to high phone bills.", "These include a free software program that blocks unwanted calls from untrusted numbers and an early warning system that alerts users of suspicious activity on their phone bills.", "To ensure compliance, companies must meet specific conditions such as clear terms and conditions and responsibility for customer refunds."], "qwen2.5:0.5b": ["BT is launching two initiatives to help users combat rogue dialler scams that can cost UK net users thousands of pounds each year:\n\n1.", "Free software download: In May, British net users won't have to pay any charges for downloading free software to stop computers using numbers not on a user's \"pre-approved list\".", "2.", "Early warning system: BT will monitor phone bills and alert customers if they suspect rogue dialler activity that has risen substantially or received unusual calls.", "Both measures are being introduced as part of efforts to protect users from the scammer's tactics."], "qwen2.5:1.5b": ["BT is introducing two initiatives: a free software program that blocks rogue dialler scams, helping UK dial-up users avoid high phone bills; an early warning system for unusual phone bill activity.", "Companies must now comply with stricter conditions, including clear terms and information about how to remove illegal diallers, and face closure if found violating regulations.", "BT has already blocked over 1,000 premium rate numbers and is strengthening its protection efforts.", "Both initiatives are currently in trials across Ireland before being rolled out globally to 20 million users starting May."], "qwen2.5:3b": ["BT is introducing two initiatives to combat rogue dialler scams: a free software that prevents computers from using numbers not on a user's \"pre-approved list,\" and an early warning system alerting customers of unusual activity or calls to suspect numbers.", "The Modem Protection program checks numbers dialed by users and blocks unauthorized ones, such as national and service provider numbers.", "Additionally, BT will implement stricter conditions for legitimate premium rate dialler services and enforce penalties against firms operating without permission.", "These measures aim to protect over 20 million BT customers from costly scams."], "opencoder:1.5b": ["BT program to beat dialler scams\n\nIn the wake of rogue dialler scams, BT is introducing two initiatives aimed at combating these threats.", "The first initiative involves a proactive measure to identify and pre-approve numbers that may have been targeted by users attempting to access services through unapproved phone numbers.", "Additionally, a second initiative is an early warning system which will alert BT customers if there is unusual activity on their phone bills, triggering an immediate text or voice alert to the user's landline phone.", "Companies must now meet stringent conditions for legitimate dialler service provision such as clear terms and conditions, information about how to delete diallers, and responsibility for customer refunds.", "Icstis, a UK premium rate services watchdog, expressed optimism that BT could capitalize on its extensive network of legitimate companies to launch more sophisticated measures.", "\"The initiatives are very welcome,\" the watchdog told the BBC News website.", "Companies must ensure clear terms and conditions for all diallers, and have mechanisms in place to quickly revoke such rights once the number has been used without permission.", "Any company that is not willing or able to comply promptly may be taken down by Icstis.", "Finally, a watchdog decision led by Irish companies which operate legitimate premium rate dialler services, has already provided ample support for customers, highlighting the magnitude of the problem.", "It also raised public awareness about the scams, encouraging customers to take necessary precautions."], "smollm:1.7b": ["The summary is concise and objective, preserving key ideas and details while omitting unnecessary information.", "The main points are:\n\n1.", "Two initiatives by BT to help beat rogue dialler scams:\n\t* Modem Protection program to check numbers that are dialled by a computer and block them if they have not been pre-approved (e.g., national and net service provider numbers)\n\t* Early warning system for unusual activity on phone bills, alerting users to potential fraud\n2.", "Initiatives to protect consumers:\n\t* Clear terms and conditions for companies running legitimate premium rate dialler services\n\t* Information about how to delete diallers and responsibility for customer refunds\n3.", "BT's efforts to combat the problem:\n\t* Banned more than 1,000 premium rate numbers\n\t* Tried to raise public awareness about the scams\n4.", "New safeguards for customers:\n\t* Offer services that are not available through credit card\n5.", "Plans to make the schemes available to 20 million BT customers from May (e.g., Ireland)\n\nThe summary is free of unnecessary information, and it does not include any explanations or reasoning processes."], "deepseek-r1:1.5b": ["BT has introduced two strategies to combat rogue dialler scams.", "First, users will download free software in May that blocks numbers not on pre-approved lists, protecting high-cost purchases from surfers.", "Second, an early warning system will alert users if their bill spikes or they call a suspect number, requiring them to delete diallers and responsible for refunds.", "ICSTIS, UK's watchdog, is looking for companies leading new measures but BT is glad to provide these services.", "Both initiatives aim to shield consumers from scams, with over 1,000 numbers blocked and awareness raised in Ireland before full availability."], "tinyllama:1.1b": ["The BT program to combat rogue dialler scams, which costs internet users thousands, includes two initiatives: a free software download for modem protection, and an early warning system for suspicious phone bills.", "The watchdog Icstis has announced these measures in response to the scam, which can lead to thousands of UK internet users facing telephone bill rises.", "As part of the clamp-down on dialler scams, companies must now satisfy strict conditions and be licensed before offering services.", "BT's efforts to protect customers include more than 1,000 banned numbers, but has already tried to raise public awareness about the scam."], "tinydolphin:1.1b": [" The two initiatives introduced by BT aim to help eliminate the costly scams that can harm users.", "The first initiative is a free downloadable software that can protect users from downloading programs that dial up premium rates without permission.", "In addition, BT will require all companies running such services to clear their records, and if necessary close them down.", "This decision follows an action taken by the Icstis Watchdog in October 2014.", "The second initiative is a prepaid early warning system that notifies users when they see unusual activity on their phone bills.", "If it raises concerns about potential fraudulent activity, BT will send alerts to customers' landlines, and if necessary shut down the company involved."], "phi:2.7b": [" BT is introducing two initiatives to help beat rogue dialler scams.", "The Modem Protection program checks numbers that are dialled by a computer and blocks them if they haven't been pre-approved.", "If a bill rises substantially above its usual daily average or there's unusual activity on a phone bill, customers will receive alerts from the company's early warning system.", "BT has also ploughed effort into protecting people from these scams.", "The initiatives are welcomed by Icstis, the UK's premium rate services watchdog.", "BT has already taken action against more than 1,000 rogue dialler numbers and is now offering stronger safeguards for its customers."], "orca-mini:3b": [" BT is introducing two initiatives to help beat rogue dialler scams that can cost dial-up net users thousands.", "In May, BT will make free software available to its customers to stop computers from dialing up numbers not on a user's \"pre-approved list.\"", "Additionally, an early warning system will alert customers if there is unusual activity on their phone bills.", "Companies must now satisfy strict conditions, including clear terms and conditions, information about how to delete diallers and responsibility for customer refunds.", "If a company runs a rogue dialler without permission, it can now be closed down by Icstis.", "BT has already blocked more than 1,000 premium rate numbers and wants to raise public awareness about the scams."], "hermes3:3b": ["BT introducing free software (Modem Protection) to block numbers not on pre-approved list for rogue dialler scams from May.", "Also, an early warning system to alert users of unusual activity on phone bills."], "stablelm-zephyr:3b": ["BT introduces Modem Protection program and an early warning system to combat rogue dialler scams, which can cost dial-up users thousands of dollars.", "From May, dial-up users can download free software to prevent computers from using numbers not on their approved list.", "The Modem Protection program will block non-approved numbers, such as national and net service provider numbers.", "BT also launches an early warning system that alerts customers of unusual phone bill activity.", "Rogue dialler companies must now meet strict conditions and have information about deleting diallers and customer refunds.", "Both initiatives have undergone trials in Ireland and will be available to 20 million BT customers starting from May."], "chatgpt-4o-latest": ["BT is launching two initiatives to combat rogue dialler scams affecting dial-up internet users.", "From May, users can download free software to block unauthorized numbers, preventing rogue diallers from hijacking modems and dialing premium rate numbers.", "BT is also introducing an early warning system to alert customers of unusual phone bill activity.", "Icstis, the UK's premium rate services watchdog, supports these measures and has implemented stricter regulations for dialler services, including licensing and customer refund responsibilities.", "BT has already barred over 1,000 premium rate numbers and aims to enhance consumer protection.", "Both initiatives have been trialed in Ireland and will be available to 20 million BT customers."], "stablelm2:1.6b": ["BT introduces two initiatives to combat rogue dialler scams: (1) free software that alerts users when numbers on their modem aren.", "(2) an early warning system alerting users if unusual activity occurs on their phone bills.", "Both initiatives are in line with stringent conditions, including clear terms and conditions for deleting diallers and responsibility for customer refunds.", "The second initiative is the early warning system, which will be made available to 1 million BT customers from May.", "Companies must now satisfy stringent conditions, such as clear terms and conditions and information on how to delete diallers and responsibility for customer refunds.", "BT has already barred over 1 million premium-rate numbers and tried to raise public awareness about these scams.", "The UK's premium rate services watchdog, Icstis, said it welcomed the initiatives and was happy to see that companies are putting new measures into place to protect consumers."], "granite3.1-dense:2b": ["BT is implementing two initiatives to combat rogue dialler scams affecting dial-up internet users in the UK.", "From May, these customers can download free software called Modem Protection, which checks dialed numbers against a pre-approved list and blocks unknown premium rate numbers, potentially preventing excessive phone bills.", "The second initiative is an early warning system that alerts BT customers to unusual activity on their bills or calls to suspicious numbers via text or voice messages on their landlines.", "Icstis, the UK's premium rate services watchdog, endorsed these measures, praising BT for taking proactive steps to protect consumers.", "In response to Icstis' decision to license all companies offering legitimate premium rate dialler services, any firm running unauthorized diallers can now be shut down by the watchdog.", "BT has already blocked over 1,000 premium rates and spent considerable effort raising awareness about these scams.", "The new safeguards will initially cover 20 million BT customers from May."]}