{"raw_text": "Be careful how you code\n \n A new European directive could put software writers at risk of legal action, warns former programmer and technology analyst Bill Thompson.\n \n If it gets its way, the Dutch government will conclude its presidency of the European Union by pushing through a controversial measure that has been rejected by the European Parliament, lacks majority support from national governments and will leave millions of European citizens in legal limbo and facing the possibility of court cases against them. If the new law was about border controls, defence or even the new constitution, then our TV screens would be full of experts agonising over the impact on our daily lives. Sadly for those who will be directly affected, the controversy concerns the patenting of computer programs, a topic that may excite the bloggers, campaigning groups and technical press but does not obsess Middle Britain. After all, how much fuss can you generate about the Directive on the Patentability of Computer-Implemented Inventions, and the way it amends Article 52 of the 1973 European Patent Convention? Yet if the new directive is nodded through at the next meeting of one of the EU's ministerial councils, as seems likely, it will allow programs to be patented in Europe just as they are in the US. Many observers of the computing scene, including myself, think the results will be disastrous for small companies, innovative programmers and the free and open source software movement. It will let large companies patent all sorts of ideas and give legal force to those who want to limit their competitors' use of really obvious ideas.\n \n In the US you cannot build a system that stores customer credit card details so that they can pay without having to re-enter them unless Amazon lets you, because they hold the patent on \"one-click\" online purchase. It is a small invention, but Amazon made it to the patent office first and now owns it.\n \n We are relatively free from this sort of thing over here, but perhaps not for long. The new proposals go back to 2002, although argument about patentability of software and computer-implemented inventions has been going on since at least the mid-1980s. They have come to a head now after a year in which proposals were made, endorsed by the Council of Ministers, radically modified by the European Parliament and then re-presented in their original form. Some national governments seem to be aware of the problems. Poland has rejected the proposal and Germany's main political parties have opposed it, but there is not enough opposition to guarantee their rejection. Early in December the British government held a consultation meeting with those who had commented on the proposals. Science Minister Lord Sainsbury went along to listen and outline the UK position, but according to those present, it was embarrassing to see how little the minister and his officials actually understood the issues concerned.\n \n The draft Directive is being put through the council as what is called an \"A\" item and can only be approved or rejected. No discussion or amendment is allowed. So why should we be worried? First, there is the abuse of the democratic process involved in disregarding the views of the parliament and abandoning all of their carefully argued amendments. This goes to the heart of the European project, and even those who do not care about software or patents should be worried. If coders are treated like this today, who is to say that it will not be you tomorrow?\n \n More directly, once software patents are granted then any programmer will have to worry that the code they are writing is infringing someone else's patent. This is not about stealing software, as code is already protected by copyright. Patents are not copyright, but something much stronger. A patent gives the owner the right to stop anyone else using their invention, even if the other person invented it separately. I have never, to my shame, managed to read Lord Byron's Childe Harold's Pilgrimage. If it was pointed out that one of my articles contained a substantial chunk of the poem then I could defend myself in court by claiming that I had simply made it up and it was coincidence. The same does not hold for a patent. If I sit down this afternoon and write a brilliant graphics compression routine and it happens to be the same as the LZW algorithm used in GIF files, then I am in trouble under patent law, at least in the US. Coincidence is no defence. The proposed directive is supported by many of the major software companies, but this is hardly surprising since most of them are US-based and they have already had to cope with a legal environment that allows patents. They have legal departments and, more crucially, patents of their own which they can trade or cross-license with other patent holders.\n \n Even this system breaks down, of course, as Microsoft found out last year when they initially lost a case brought by Eolas which claimed that Internet Explorer (and other browsers) infringed an Eolas patent. That one was eventually thrown out, but only after months of uncertainty and millions of dollars. But small companies, and the free and open software movement do not have any patents to trade. Much of the really useful software we use every day, programs like the Apache web server, the GNU/Linux operating system and the fearsomely popular Firefox browser, is developed outside company structures by people who do not have legal departments to check for patent infringements. The damage to software will not happen overnight, of course. If the directive goes through it has to be written into national laws and then there will be a steady stream of legal actions against small companies and open source products. Eventually someone will decide to attack Linux directly, probably with some secret funding from one or two large players. The new directive will limit innovation by forcing programmers to spend time checking for patent infringements or simply avoiding working in potentially competitive areas. And it will damage Europe's computer industry. We can only hope that the Council of Ministers has the integrity and strength to reject this bad law.\n \n Bill Thompson is a regular commentator on the BBC World Service programme Go Digital.\n", "llama3.2:1b": ["Be careful how you code\nA new European directive could put software writers at risk of legal action, warns former programmer and technology analyst Bill Thompson\nThe Dutch government will push through a controversial measure that has been rejected by the European Parliament and lacks majority support from national governments\nThe directive allows programs to be patented in Europe just as they are in the US\nIt would let large companies patent all sorts of ideas and give legal force to those who want to limit their competitors' use of obvious ideas\nThe proposed directive goes back to 2002, but has come to a head after a year of proposals being made and endorsed by the European Parliament\nSome national governments seem to be aware of the problems, but there is not enough opposition to guarantee rejection\nA draft Directive is being put through the council as an \"A\" item, with no discussion or amendment allowed\nThe proposed law would grant patents to software that allows programs to store customer credit card details for one-click online purchases\nIt would also limit innovation by forcing programmers to check for patent infringements and could damage Europe's computer industry"], "llama3.2:3b": ["A new European directive could allow software to be patented in Europe, potentially putting small companies, innovative programmers, and free and open source software movement at risk of legal action.", "The proposal would make it easier for large companies to patent obvious ideas, limiting innovation and forcing programmers to check for patent infringements or avoid working in competitive areas."], "gemma2:2b": ["A new European directive could allow software patents in Europe, like in the US.", "This could have negative consequences for small companies and open source software developers, as it would make them vulnerable to lawsuits over their code.", "The directive has been rejected by the European Parliament but is supported by major software companies.", "There are concerns about its impact on innovation and the potential for legal battles against small businesses."], "qwen2.5:0.5b": ["A new European directive could put software writers at risk, warns former programmer and technology analyst Bill Thompson.", "It would allow computer programs to be patented in Europe and give legal force to those who want to limit their competitors' use of really obvious ideas.", "The proposal goes back to 2002 but has been modified recently by the European Parliament and Council.", "While some companies are already involved, it is unlikely that a major overhaul will happen without opposition from other countries or the EU as a whole."], "qwen2.5:1.5b": ["Bill Thompson warns European software writers could face legal action due to new EU directive allowing patenting of computer programs, sparking controversy over patents vs. copyright in tech development.", "He criticizes government disregard for parliament's amendments and fears future abuse, citing Amazon's example of patent rights for online payment systems.", "The proposal goes back 15 years, with major software companies supporting it despite US restrictions on software patents due to their experience dealing with similar issues.", "Critics argue small firms and open source projects could be stifled by increased scrutiny over code use in patents, while Thompson fears the directive will damage Europe's computer industry in the long run."], "qwen2.5:3b": ["A new European directive could grant software patents, risking legal action for programmers.", "Former programmer and analyst Bill Thompson warns this move from Dutch government, while rejected by EU Parliament, lacks majority support and ignores public concern.", "The US already grants such patents, leading to issues like Amazon's \"one-click\" purchase patent.", "In Europe, Poland and Germany oppose it, but opposition is insufficient.", "If enacted, the directive could allow companies to control innovative software ideas via patents, affecting small businesses and free/open-source software movements.", "Critics argue this would limit innovation and harm Europe’s tech industry."], "opencoder:1.5b": ["As an AI, I'm unable to write or summarize text in real-time, but here's a summary:\n\nThis text discusses a directive that could potentially put software creators at risk of legal action.", "It highlights the concerns about patenting and the potential negative impact on computer industry and national security.", "While some observers might be concerned, many believe it could lead to disastrous consequences for small businesses and innovative programmers.", "As such, it is important to be cautious while reading this directive."], "smollm:1.7b": ["The summary above is concise, but it does not provide enough detail for readers who want to know more about the topic.", "Here's an example of how you could expand on the summary:\n\n\"In the European Union, the Directive on the Patentability of Computer-Implemented Inventions aims to clarify the rules surrounding software patents and ensure that they are granted only in cases where the invention is truly novel and non-obvious.", "The directive also sets out a framework for determining patentability, including the requirement that an invention must be tied to a specific technical application or use case.", "The directive's impact on the European computer industry is significant, as it aims to promote innovation and investment in software development while ensuring that patents are granted only in cases where they have been proven to be truly novel and non-obvious.", "This could lead to increased competition among companies developing software, as well as greater opportunities for small and medium-sized enterprises (SMEs) to enter the market.", "The directive also sets out a framework for determining patentability, including the requirement that an invention must be tied to a specific technical application or use case.", "This means that software patents will need to be carefully evaluated to ensure that they are truly novel and non-obvious, rather than simply being based on existing knowledge or techniques.", "The directive's impact on the European computer industry is significant, as it aims to promote innovation and investment in software development while ensuring that patents are granted only in cases where they have been proven to be truly novel and non-obvious.", "This could lead to increased competition among companies developing software, as well as greater opportunities for small and medium-sized enterprises (SMEs) to enter the market.\""], "deepseek-r1:1.5b": ["The new European directive could put software writers at risk under legal implications regarding patenting computer programs, warns former programmer Bill Thompson.", "If the directive passes, affected individuals might face legal limbo, while large companies could patent innovative ideas.", "However, it would restrict programmers from checking for patent infringements or avoiding competitive areas, potentially stifling innovation and affecting small businesses that lack such protections.", "The directive aims to create a system of software patents supported by major tech companies but could damage other EU countries due to potential resistance from certain groups.", "It might harm smaller companies and open-source projects by preventing them from checking for patent infringement, leading to legal battles and disruptions.", "Overall, the directive risks harming Europe's software industry and innovation, particularly affecting smaller businesses."], "tinyllama:1.1b": ["The proposed European directive concerning the patentinng of computer programs, known as the \"Directive on the Patentabilty of Computer-Implemented Invancements,\" could potentially limit innovation and damage Europe's computer industry.", "The proposal comes from a new European Union presidency headed by Bill Thompson, an analyst and technology researcher.", "As previously mentioned, this directive allows programs to be patented in Europe just as they are in the US, and it has been argued that codecs like LZW, which was used in GIF files, can trigger patent infringements.", "The proposal could potentially lead to legal actions against small companies and open source products.", "Although some national governments have expressed concerns about the draft directive, the proposed legislation is being put through a council as an \"A\" item.", "However, the Council of Ministers has not endorsed the proposal and is allowing debate but no discussion, making it difficult to know exactly how much opposition there is.", "The proposed law would limit innovation by forcing programmers to check for patent infringements or simply avoid working in potentially competitive areas.", "As a result, the European computer industry may suffer, as these new laws could harm Europe's reputation as a leader in innovative technology."], "tinydolphin:1.1b": [" The proposed European directive could put software writers at risk of legal action, leading to national governments refusing to fund or regulate new computer programs.", "This could have a devastating impact on small businesses and open-source projects.", "In an article by Bill Thompson for BBC World Service, he discusses the issues surrounding the proposed European directive and its potential consequences for Europe's computer industry."], "phi:2.7b": [" A new European directive could lead to millions of citizens facing legal action if they are found guilty of infringing on software patents, warns former programmer and technology analyst Bill Thompson.", "The controversial measure has been rejected by the European Parliament, lacks majority support from national governments, and will have disastrous consequences for small companies, innovative programmers, and the free and open-source software movement.", "Software patents would allow large companies to patent all sorts of ideas, leaving competitors with no legal recourse.", "This is not just an issue about software or patents; it threatens the freedom of expression and limits innovation in Europe's computer industry.", "It is important that the proposed directive does not pass through the council as an \"A\" item without discussion or amendment, but this has already happened.", "We must hope that the Council of Ministers will reject this bad law before it's too late."], "orca-mini:3b": [" Summary: The new European directive could potentially limit innovation in the computer industry by requiring programmers to check for patent infringements or avoid working in potentially competitive areas, and could damage Europe's computer industry."], "hermes3:3b": ["New European software patent directive may lead to legal risks for programmers, according to former programmer Bill Thompson; poses issues for small companies, open source projects, and innovation."], "stablelm-zephyr:3b": ["A new European directive could put software writers at risk of legal action, according to former programmer and technology analyst, Bill Thompson.", "If implemented, the Dutch government will push through a measure that has been rejected by the European Parliament, lacks majority support from national governments, and may result in millions of European citizens facing legal actions against them.", "The issue concerns the patenting of computer programs, which could create problems for small companies, innovative programmers, and the free and open source software movement.", "This could lead to a less innovative environment and harm Europe's computer industry."], "chatgpt-4o-latest": ["A proposed European directive on software patents, pushed by the Dutch government, could expose programmers to legal risks and stifle innovation, warns technology analyst Bill Thompson.", "Despite being rejected by the European Parliament and lacking majority support, the directive may still pass, allowing software patents in Europe similar to the U.S. system.", "This could enable large companies to patent obvious ideas, limiting competition and harming small businesses and open-source projects.", "The directive, which cannot be amended or discussed before approval, raises concerns about democratic process violations.", "If enacted, programmers will face legal uncertainty, as patents grant exclusive rights regardless of independent invention.", "Large corporations, already accustomed to U.S. patent laws, support the directive, but smaller developers lack resources to navigate legal challenges.", "The directive could lead to lawsuits against open-source projects and hinder Europe's software industry.", "Thompson urges the Council of Ministers to reject the law to protect innovation and fairness in the tech sector."], "stablelm2:1.6b": ["A new European directive could put software writers at risk of legal action, according to technology analyst Bill Thompson.", "If it becomes law, the Dutch government may push through a measure that has been rejected by the European Parliament and lacks majority support from national governments.", "The proposed law would allow programs to be patented in Europe just as they are in the US, leading to potential issues for small companies, innovative programmers, and the free and open source software movement.", "Patents will now give legal force to those who want to limit competitors' use of really obvious ideas.", "Critics argue that this system breaks down as major software companies benefit from a legal environment that allows patents.", "If this directive goes through, there may be a steady stream of legal actions against small companies and open source products in the future."], "granite3.1-dense:2b": ["A new European directive, advocated by the Dutch government during its EU presidency, risks exposing software developers and innovators to legal action.", "This proposal, which has faced rejection from the European Parliament and lacks majority support among national governments, aims to amend Article 52 of the 1973 European Patent Convention, enabling patenting of computer-implemented inventions.", "Critics, including former programmer Bill Thompson, argue that this could be detrimental to small companies, independent programmers, and the open-source software movement.", "The directive may allow large corporations to patent fundamental ideas and restrict competitors' use of obvious concepts, similar to existing practices in the US.", "The proposal, initially presented in 2002, has gone through various modifications before reaching its current form.", "While Poland and some German political parties have voiced opposition, national governments like Britain's are yet to take a decisive stance.", "In December, the UK government held consultations with experts but appeared uninformed about the implications of software patents.", "The directive is being fast-tracked through the Council of Ministers as an \"A\" item, bypassing discussion and amendment processes, raising concerns about disregarding parliament's views and undermining the European project.", "Software developers will face potential infringement lawsuits once patents are granted, regardless of whether their code is unintentional or coincidentally similar to existing patented work.", "Major US software companies back the proposal due to familiarity with a legal environment that permits patents; however, many small companies and open-source projects lack the resources for patent checking and cross-licensing.", "Should the directive become law, it would gradually lead to legal actions against these entities, stifle innovation, and potentially impact Europe's computer industry.", "The Council of Ministers must show integrity by rejecting this legislation."]}