{"raw_text": "US cyber security chief resigns\n \n The man making sure US computer networks are safe and secure has resigned after only a year in his post.\n \n Amit Yoran was director of the National Cyber Security Division within the US Department of Homeland Security created following the 9/11 attacks. The division was tasked with improving US defences against malicious hackers, viruses and other net-based threats. Reports suggest he left because his division was not given enough clout within the larger organisation.\n \n Mr Yoran took up his post in September 2003 and his first task was to get the Cyber Security Division up and running. The organisation had a staff of about 60 people and a budget of about $80m (£44.54m). The division was charged with thinking up and carrying out action to make US networks more impervious to attack and disruption by the viruses, worms and hack attacks that have become commonplace.\n \n In the last 12 months Mr Yoran oversaw the creation of a cyber alert system that sends out warnings about big hitting viruses and net attacks as they occur. The warnings also contained information about how firms and organisations could protect themselves against these attacks. The Cyber Security Division also audited US government networks to discover exactly what was sitting on which network. The next step was to be the creation of a scanning system to identify vulnerabilities that made federal networks and machines susceptible to attack by malicious hackers and virus writers. Mr Yoran's division was also doing work to identify the networks and machines that had been broken into by cyber criminals. Despite this success Mr Yoran left his post abruptly at the end of last week, reportedly only giving one day's notice to bosses at the Department of Homeland Security. \"Amit Yoran has been a valuable contributor on cyber security issues over the past year, and we appreciate his efforts in starting the department's cybersecurity program,\" said a Department of Homeland Security spokeswoman. Some reports have suggested that Mr Yoran felt frustrated by the lack of prominence given to work to protect against net-based threats in the wider homeland organisation. An attempt by US politicians to pass a law to promote Mr Yoran and raise the profile of his department's work is now mired in Congress.\n", "llama3.2:1b": ["Amit Yoran, US cyber security chief, has resigned after one year in his post due to lack of prominence within the Department of Homeland Security.", "He took up his role in September 2003 and oversaw the creation of a cyber alert system and auditing of US government networks.", "Despite success, he left abruptly at the end of last week, reportedly only giving one day's notice to bosses."], "llama3.2:3b": ["US cyber security chief Amit Yoran resigned after only 12 months, citing lack of clout within the larger organisation.", "He oversaw the creation of a cyber alert system and audited US government networks to identify vulnerabilities.", "Despite this success, he left abruptly, reportedly giving only one day's notice, amid frustration with limited prominence given to his department's work in protecting against net-based threats."], "gemma2:2b": ["Amit Yoran resigned as director of the National Cyber Security Division after one year.", "He left due to perceived lack of clout and influence within the Department of Homeland Security.", "He oversaw significant progress including the creation of a cyber alert system, network audits, and efforts to identify compromised networks.", "Yoran's departure was sudden with little notice given, reportedly fueled by frustration over his department's visibility in the larger organization."], "qwen2.5:0.5b": ["US cybersecurity chief Amit Yoran resigned after only 12 months as director of the National Cyber Security Division within the US Department of Homeland Security following reports he left due to inadequate clout within the larger organization."], "qwen2.5:1.5b": ["US cyber security chief Amit Yoran resigns after one year, citing lack of clout within larger organization.", "Former director oversaw creation of cybersecurity division focusing on defending against viruses, worms, and hacker attacks.", "Cyber alert system and vulnerability scanning project initiated; work was done to identify breached networks.", "Departed abruptly at end of last week without notice."], "qwen2.5:3b": ["US cyber security chief Amit Yoran resigns after one year, citing insufficient clout within larger organization despite overseeing creation of cyber alert system and network audits.", "His division aimed to make US networks more secure against threats but faced criticism over lack of prominence for cybersecurity efforts within the Department of Homeland Security.", "Yoran left with only a day's notice, reportedly frustrated by his department’s reduced role in tackling net-based security issues."], "opencoder:1.5b": ["US cyber security chief resigns.", "The man making sure US computer networks are safe and secure has resigned after only a year in his post.", "Amit Yoran was director of the National Cyber Security Division within the US Department of Homeland Security created following the 9/11 attacks.", "The division was tasked with improving US defences against malicious hackers, viruses and other net-based threats.", "Reports suggest he left because his division was not given enough clout within the larger organisation.", "Mr Yoran took up his post in September 2003 and his first task was to get the Cyber Security Division up and running.", "The organisation had a staff of about 60 people and a budget of about $80m (£44.54m).", "The division was charged with thinking up and carrying out action to make US networks more impervious to attack and disruption by the viruses, worms and hack attacks that have become commonplace.", "In the last 12 months Mr Yoran oversaw the creation of a cyber alert system that sends out warnings about big hitting viruses and net attacks as they occur.", "The warnings also contained information about how firms and organisations could protect themselves against these attacks.", "The Cyber Security Division also audited US government networks to discover exactly what was sitting on which network.", "The next step was to be the creation of a scanning system to identify vulnerabilities that made federal networks and machines susceptible to attack by malicious hackers and virus writers.", "Mr Yoran's division was also doing work to identify the networks and machines that had been broken into by cyber criminals.", "Despite this success Mr Yoran left his post abruptly at the end of last week, reportedly only giving one day's notice to bosses at the Department of Homeland Security.", "\"Amit Yoran has been a valuable contributor on cyber security issues over the past year, and we appreciate his efforts in starting the department's cybersecurity program,\" said a Department of Homeland Security spokeswoman."], "smollm:1.7b": ["The man making sure US computer networks are safe and secure has resigned after only a year in his post.", "Amit Yoran was director of the National Cyber Security Division within the US Department of Homeland Security created following the 9/11 attacks.", "The division was tasked with improving US defences against malicious hackers, viruses and other net-based threats.", "Reports suggest he left because his division was not given enough clout within the larger organisation.", "Mr Yoran took up his post in September 2003 and his first task was to get the Cyber Security Division up and running.", "The organisation had a staff of about 60 people and a budget of about $80m (£44.54m).", "The division was charged with thinking up and carrying out action to make US networks more impervious to attack and disruption by the viruses, worms and hack attacks that have become commonplace.", "In the last 12 months Mr Yoran oversaw the creation of a cyber alert system that sends out warnings about big hitting viruses and net attacks as they occur.", "The warnings also contained information about how firms and organisations can protect themselves against these attacks.", "The Cyber Security Division also audited US government networks to discover exactly what was sitting on which network.", "The next step was to be the creation of a scanning system to identify vulnerabilities that made federal networks and machines susceptible to attack by malicious hackers and virus writers.", "Mr Yoran's division was also doing work to identify the networks and machines that had been broken into by cyber criminals.", "Despite this success, Mr Yoran left his post abruptly at the end of last week, reportedly only giving one day's notice to bosses at the Department of Homeland Security.", "Some reports have suggested that Mr Yoran felt frustrated by the lack of prominence given to work to protect against net-based threats in the wider homeland organisation.", "An attempt by US politicians to pass a law to promote Mr Yoran and raise the profile of his department's work is now mired in Congress."], "deepseek-r1:1.5b": ["Amit Yoran, former director of the National Cyber Security Division within the Department of Homeland Security, resigned after just a year.", "He was tasked with enhancing US cybersecurity against cyber threats like viruses and hackers.", "The division, with about 60 staff and $80 million in budget, focused on creating a cyber alert system and auditing networks.", "Yoran's departure came abruptly, given only one day's notice to security officials at the department.", "Critics noted his contributions but frustration over limited focus on net-based threats.", "Political pressure from politicians aims to promote Yoran's work in Congress."], "tinyllama:1.1b": ["The National Cybersecurity Director, Amit Yorań, resigned after only a year in his role due to a failure to receive enough resources within the larger US Department of Homeland Security (DHS).", "He took up his position in September 2003 and was tasked with improving DHS's defenses against malicious hackers, virus attacks, and other net-based threats.", "In the last 12 months, Mr Yorań oversaw the creation of a cyber alert system to warn about breaches in US government networks, as well as the establishment of a scan system to identify vulnerabilities that made federal systems susceptible to attack by cyber criminals.", "Despite his successes, Mr Yorań left his position abruptly at the end of last week, with one day's notice given to DHS bosses.", "Despite reports suggesting frustration over a lack of promotion and recognition for his department, some reports have suggested Mr Yorań felt frustrated by the lack of resources in DHS.", "The failure to raise Mr Yorań's profile in Congress was reportedly under discussion at the time he resigned."], "tinydolphin:1.1b": [" Amit Yoran, who recently left his position as director of the National Cyber Security Division within the US Department of Homeland Security, resigned after only one year due to lack of visibility for his division’s efforts on protecting American networks from cyber threats.", "His predecessor in this role, Robert Kinnane, had been with the department for over ten years and was considered a key figure in bolstering US cyber security capabilities.", "Despite having made substantial strides in improving network defenses against malicious hackers, viruses, and other net-based threats, Yoran's exit may have been due to lack of prominence within the wider Homeland Security organization.", "Some reports suggest that he felt frustrated by the lack of attention given to his department’s work in protecting against such threats and the consequent marginalization of its efforts in comparison with those of other divisions within the larger homeland security entity.", "Despite these challenges, Yoran has demonstrated his commitment to the cause, and there have been rumors circulating that he may be replaced by another senior figure within the department.", "This would be an indication of a broader restructuring within Homeland Security's cyber security division as well as a reflection on his own contributions to the field."], "phi:2.7b": [" The text summarizes the resignation of US cyber security chief Amit Yoran, who was responsible for improving network defense against malicious hackers and viruses.", "He took over the Cyber Security Division in 2003, which had a staff of about 60 people and a budget of $80m, and developed a cyber alert system, an auditing system, and a scanning system to identify vulnerabilities on government networks.", "He left his post abruptly at the end of last week, reportedly due to frustration with the lack of recognition for his department's work in the wider organization."], "orca-mini:3b": [" Amit Yoran, who was director of the National Cyber Security Division within the US Department of Homeland Security, resigned after only one year in his post.", "His division was not given enough clout within the larger organization, and he felt frustrated by this lack of prominence given to work to protect against net-based threats.", "In his first task, he got the Cyber Security Division up and running with a staff of about 60 people and a budget of about $80m, and audited federal government networks to discover vulnerabilities that made them susceptible to attack by malicious hackers and virus writers.", "He also created a cyber alert system that sent out warnings about big hitting viruses and net attacks as they occurred.", "In the last year, he oversaw the creation of a scanning system to identify vulnerabilities in federal networks.", "Yoran's division also identified the networks and machines that had been broken into by cyber criminals.", "However, his work was not given enough prominence within the wider homeland organization, and some reports suggest he left abruptly after only one day's notice to give to bosses at the Department of Homeland Security.", "An attempt to pass a law to promote his division and raise its profile is now mired in Congress."], "hermes3:3b": ["US Cyber Security Director resigns\nAmit Yoran left post after creating cyber alert system & working on network vulnerability scans within DHS."], "stablelm-zephyr:3b": ["Amit Yoran, who was responsible for ensuring that the US' computer networks were secure, resigned from his position after only a year.", "He previously served as the director of the National Cyber Security Division within the US Department of Homeland Security, which was created following the 9/11 attacks.", "His division aimed to improve defenses against malicious hackers, viruses, and other internet-based threats.", "Yoran's resignation came allegedly due to his division not being given enough recognition within the larger organization.", "In his 12 months as director, he oversaw the creation of a cyber alert system that warned about major viruses and cyber attacks, which contained information on how firms and organizations could protect themselves against such threats.", "Furthermore, his team audited US government networks to identify vulnerabilities and create scanning systems to safeguard federal networks and machines from malicious hackers and virus writers.", "Yoran reportedly gave only one day's notice before leaving the Department of Homeland Security."], "chatgpt-4o-latest": ["Amit Yoran, director of the National Cyber Security Division within the US Department of Homeland Security, resigned after a year in his post, reportedly due to his division's lack of influence within the larger organization.", "Appointed in September 2003, Yoran led efforts to enhance US cyber defenses, including launching a cyber alert system and auditing government networks.", "His division aimed to identify vulnerabilities and compromised systems.", "Despite these achievements, Yoran abruptly left, giving only one day's notice.", "Reports suggest he was frustrated by the low priority given to cybersecurity, and efforts to elevate his division's status remain stalled in Congress."], "stablelm2:1.6b": ["US cyber security chief Amit Yoran resigned after only one year in his position, as his division within the Department of Homeland Security was not given enough authority.", "He oversaw the creation of a cyber alert system, audited government networks, and developed scanning systems to identify vulnerabilities in US networks.", "Despite this progress, he left abruptly, leaving behind plans for raising the department's profile."], "granite3.1-dense:2b": ["Amit Yoran, the director of the National Cyber Security Division within the US Department of Homeland Security since September 2003, has resigned after a year.", "His division, established post-9/11 to enhance US cyber defenses against hackers and viruses, faced budgetary constraints and limited influence within the larger organization.", "Yoran oversaw the creation of a cyber alert system and network audits, but reportedly left without notice, possibly due to frustration with the division's underrepresentation in broader homeland security efforts.", "Despite his achievements, politicians are now stalled in their attempt to pass a law boosting the division's visibility and funding."]}