{"raw_text": "Neeson in bid to revive theatre\n \n Hollywood film star Liam Neeson has held a dinner party in New York to promote Belfast's Lyric Theatre.\n \n The Ballymena-born actor said that the theatre on Ridgeway Street was in a \"very dilapidated condition\". Lyric chairman David Johnston has said that rebuilding the theatre, at a cost of £8m is the only answer. Mr Neeson said that the idea was to get a bunch of \"healthy, wealthy Irish Americans\" in one room and ask them to help with fundraising.\n \n The Oscar-nominated actor, whose films include Schindler's List, Michael Collins and Star Wars: The Phantom Menace, said: \"The Lyric is too important to the cultural and social life of Northern Ireland for this building to crumble and fall apart. \"It gave me a start professionally. Mary O'Malley, the founder of the theatre, gave me my future. \"In those days, in the mid-70s, when I was there, we were doing a play every four weeks. \"Belfast was not a pretty town to be living in. \"There was serious trouble, as you know, but this theatre was like a Belisha beacon of light and hope six nights a week, doing everything from Shakespeare to Yeats to O'Casey with a group of actors and actresses that affected me very deeply and still do.\" The Lyric began 50 years ago but the doors opened at its present site on the Stranmillis embankment overlooking the River Lagan in 1968.\n \n As well as Liam Neeson, it also launched the careers of Adrian Dunbar and Stephen Rea and playwrights such as Martin Lynch and Gary Mitchell. Speaking to BBC Northern Ireland before the event at New York's SoHo House, Mr Neeson said that his spirit belonged to the Glens of Antrim. And he said that there was one figure from his childhood that he would love to portray on the big screen - Ian Paisley. He said that the DUP leader and preacher was a \"very dynamic, extraordinary figure\". Neeson used to listen to his sermons on a Friday night in Ballymena. He said: \"What an orator. He was from that old school of bible-thumping righteousness. But it was so dramatic. I found him very powerful. \"I'd love to get a chance to play him some time.\"\n", "llama3.2:1b": "Liam Neeson hosted a dinner party in New York to promote the Lyric Theatre in Belfast, which has been in a state of disrepair. The theatre was in need of rebuilding at a cost of £8m to be preserved and maintained. Liam Neeson cited the theatre's importance to Northern Ireland's cultural and social life, and its history, including being rebuilt after years of trouble and hardship in the 1960s.\n\nThe Lyric Theatre is owned by David Johnston, who believes that the theatre needs rebuilding due to its dilapidated condition. The theatre has launched the careers of several notable actors and playwrights over the years, including Liam Neeson, Adrian Dunbar, Stephen Rea, Martin Lynch, and Gary Mitchell.\n\nLiam Neeson expressed a personal connection to the Glens of Antrim where the Lyric Theatre is located. He also mentioned his childhood idol, Ian Paisley, who he would love to portray on screen someday.", "llama3.2:3b": "Liam Neeson held a dinner party in New York to promote Belfast's Lyric Theatre, which he said was in a \"very dilapidated condition\". The theatre's chairman believes rebuilding it for £8m is the only answer. Neeson has fond memories of the theatre and credits it with giving him his start professionally.", "gemma2:2b": "Liam Neeson hosted a dinner party in New York to promote the Lyric Theatre in Belfast, which is facing deterioration and needs £8 million for renovation.  He appealed to wealthy Irish Americans to contribute to its rebuilding.  Neeson shared his strong connection with the theatre and how it shaped his career, mentioning its importance during troubled times. He also expressed his interest in portraying Ian Paisley on screen, inspired by his powerful sermons. \n", "qwen2.5:0.5b": "Liam Neeson invites Belfast's Lyric Theatre, one of the largest theatres in Northern Ireland, to become more attractive by building and fundraising for it with £8m. He said that the theatre is too important for its town to collapse. Neeson attended the dinner party in New York on September 15th.", "qwen2.5:1.5b": "Hollywood actor Liam Neeson has hosted a dinner in New York to promote Belfast's Lyric Theatre, which is in poor condition and needs £8 million for rebuilding, citing its cultural significance to Northern Ireland's social life as the reason. The event aimed to gather wealthy Irish Americans to help fund the project. Neeson was previously involved with the theatre, which has 50 years of history since opening on Stranmillis embankment in 1968.", "qwen2.5:3b": "Hollywood actor Liam Neeson hosted a fundraising dinner in New York for Belfast's Lyric Theatre, which he described as in poor condition. He argued that rebuilding the £8m theatre was essential due to its cultural and social importance. The event aimed at wealthy Irish Americans. Neeson highlighted the theatre's role in his career development and mentioned it played a significant positive role during troubled times in Belfast. Notable alumni included Adrian Dunbar, Stephen Rea, Martin Lynch, and Gary Mitchell. Neeson also expressed interest in potentially portraying Ian Paisley on screen due to his powerful preaching style.", "opencoder:1.5b": "The film star Liam Neeson had a dinner party in New York to promote the Lyric Theatre. The Ballymena-born actor said that the theatre on Ridgeway Street was in a \"very dilapidated condition\". Lyric chairman David Johnston suggested rebuilding the theatre, at a cost of £8m. Mr Neeson expressed his enthusiasm for the idea of gathering wealthy Irish Americans and asking them to help fundraise. The Oscar-nominated actor appreciated the importance of the Lyric Theatre, which was crucial in Northern Ireland's cultural and social life. The theatre opened 50 years ago but its doors opened at its current site on the Stranmillis embankment overlooking the River Lagan in 1984. As well as Liam Neeson, it also launched the careers of actors like Martin Lynch and Gary Mitchell who were instrumental in the theatre's development.\n", "smollm:1.7b": "The summary is concise and focuses on the main ideas, key details, and relationships between them. It does not provide explanations or justifications for the events mentioned in the text. The summary only presents the information as it is given in the original text.", "deepseek-r1:1.5b": "<think>\nOkay, so the user wants me to summarize this text concisely while preserving the key ideas and details. Let's see what the original text is about.\n\nHmm, it's about Liam Neeson promoting The Lyric Theatre in Belfast through a dinner party. The text talks about the dilapidated condition of the theatre, the involvement of various actors including Neeson himself, his background from film, and how he connects with local figures like Adrian Dunbar and Ian Paisley.\n\nAlright, I need to capture all that without any extra fluff. First, mention Neeson's initiative in reviving The Lyric, held at a dinner party in New York. Then explain the dilapidation of the theatre and the cost involved for rebuilding. Include some quotes from Neeson about the importance of the theatre, his connection with local people, and his admiration for Ian Paisley.\n\nI should also note that while the doors opened in 1968, it's not the year mentioned but just to show where it is now on the map. Maybe mention how The Lyric started 50 years ago. Keep it all tight so it's easy to read without getting lost.\n</think>\n\nNeeson's initiative to revive The Lyric Theatre in Belfast through a dinner party in New York aimed to revitalize a dilapidated venue, which has since been rebuilt at a significant cost. The theatre is rooted in Belfast's history and has inspired numerous actors and figures, including Neeson himself, Adrian Dunbar, and Stephen Rea. Neeson connects with local communities, particularly through his connection with the Glens of Antrim and his admiration for Ian Paisley, who he saw as a dynamic and extraordinary character. While the doors opened in 1968, The Lyric, now on Ridgeway Street, has become a beloved institution for Northern Ireland.", "tinyllama:1.1b": "In bid to revive Irish theatre, Hollywood star Liam Neesoon has held a dinner party in New York with the aim of raising money for the Lyric Theatre. The Ballymenan actor said that the theatre on Riddlegate Street in Belfast was \"too important\" to the cultural and social life of Northern Ireland for it to fall apart. He also praised Mary O'Malley, who founded the theatre in 1968, as a \"very dynamic and extraordinary figure\". Neesoon added that he would love to play Ian Paillayey in the DUP leader's Sunday sermon on Friday nights in Ballymenan.", "tinydolphin:1.1b": " Liam Neeson, an Oscar-nominated actor, attended a dinner party in New York to raise funds for the Belfast Lyric Theatre, which is currently undergoing restoration work. Mr. Neeson stated that the theatre's current condition was \"very dilapidated,\" and he hoped to bring people together to help it regain its former glory. The actor said he would love to portray Ian Paisley in a film, as the leader of Northern Ireland has been a strong influence in Mr. Neeson's childhood.", "phi:2.7b": " Neeson, an actor from Belfast who started his career at the Lyric Theatre, is holding a dinner party in New York City to promote the theatre and raise funds for its rebuilding. The theatre has been a cultural landmark for Northern Ireland for 50 years and has launched the careers of many notable figures. Mr Neeson hopes to portray DUP leader Ian Paisley in a film someday.\n", "orca-mini:3b": " Liam Neeson held a dinner party in New York to promote Belfast's Lyric Theatre, saying that the theatre was in a \"very dilapidated condition\" and needed £8m to be rebuilt. The theatre on Ridgeway Street gave him his start professionally and affected his career deeply still. It also launched the careers of Adrian Dunbar and Stephen Rea and playwrights such as Martin Lynch and Gary Mitchell. Neeson mentioned Ian Paisley, a DUP leader and preacher, as a \"dynamic\" figure he would love to portray on the big screen.", "hermes3:3b": "Liam Neeson holds dinner for Belfast's dilapidated Lyric Theatre, aiming to raise funding for £8m rebuild.", "stablelm-zephyr:3b": "Hollywood actor Liam Neeson held a dinner party in New York to promote Belfast's Lyric Theatre, which he described as being in a \"very dilapidated condition.\" Neeson, who starred in films such as Schindler's List and Star Wars: The Phantom Menace, expressed that the theatre was essential to the cultural and social life of Northern Ireland. He planned to gather wealthy Irish Americans for fundraising efforts towards rebuilding the historic venue, which launched the careers of several well-known artists. Neeson admired former Belfast resident Ian Paisley, a DUP leader and preacher, and hoped to portray him in a film someday.", "stablelm2:1.6b": "Hollywood actor Liam Neeson hosted a dinner party in New York to promote Belfast's Lyric Theatre, which is currently undergoing £8m refurbishment as theatre chairman David Johnston stated it's the only solution. Neeson aims to gather wealthy Irish Americans for fundraising and stated that Lyric is crucial for Northern Ireland culture and social life. The theatre began decades ago but moved to its present Stranmillis embankment site in 1988. Notable careers were launched during this time, including playwrights Martin Lynch and Gary Mitchell. Neeson expressed admiration for Ian Paisley, a DUP leader from his childhood in Ballymena.", "granite3.1-dense:2b": "Liam Neeson, a renowned Hollywood actor, held a fundraising dinner in New York for Belfast's Lyric Theatre, which he described as crucial to Northern Ireland's cultural and social life. The theatre, founded 50 years ago, has nurtured talents like Neeson, Adrian Dunbar, Stephen Rea, Martin Lynch, and Gary Mitchell. It once operated six nights a week during troubled times in Belfast, serving as a beacon of hope amidst conflict.\n\nThe event aimed to rally support from wealthy Irish Americans for its £8 million reconstruction, following the building's current dilapidation. Neeson expressed his personal connection to Northern Ireland, particularly the Glens of Antrim, and revealed his aspiration to portray Ian Paisley, a dynamic figure from his childhood and the former DUP leader known for powerful oratory.", "chatgpt-4o-latest": "Liam Neeson hosted a dinner in New York to raise funds for Belfast's Lyric Theatre, which he described as being in a dilapidated state. The theatre's chairman, David Johnston, stated that an £8m rebuild is necessary. Neeson, who began his career at the Lyric, emphasized its cultural importance to Northern Ireland and recalled its role as a beacon of hope during the troubled 1970s. The theatre, which opened at its current site in 1968, has launched the careers of actors like Adrian Dunbar and Stephen Rea. Speaking before the event, Neeson also expressed interest in portraying Ian Paisley on screen, admiring his powerful oratory skills.", "reference": "The Ballymena-born actor said that the theatre on Ridgeway Street was in a \"very dilapidated condition\".Mr Neeson said that the idea was to get a bunch of \"healthy, wealthy Irish Americans\" in one room and ask them to help with fundraising.He said that the DUP leader and preacher was a \"very dynamic, extraordinary figure\".But it was so dramatic.And he said that there was one figure from his childhood that he would love to portray on the big screen - Ian Paisley.\"There was serious trouble, as you know, but this theatre was like a Belisha beacon of light and hope six nights a week, doing everything from Shakespeare to Yeats to O'Casey with a group of actors and actresses that affected me very deeply and still do.\"Lyric chairman David Johnston has said that rebuilding the theatre, at a cost of £8m is the only answer.Hollywood film star Liam Neeson has held a dinner party in New York to promote Belfast's Lyric Theatre.He said: \"What an orator."}