{"raw_text": "Arthur Hailey: King of the bestsellers\n \n Novelist Arthur Hailey, who has died at the age of 84, was known for his bestselling page-turners exploring the inner workings of various industries, from the hotels to high finance.\n \n Born in Luton, Bedfordshire, on 5 April 1920, Hailey was the only child of working class parents, They could not afford to keep him in school beyond the age of 14. He served as a pilot with the Royal Air Force during World War II, flying fighter planes to the Middle East. It was an occupation that was later to feature in his authorial debut, the television screenplay Flight into Danger. Hailey emigrated to Canada in 1947, where he eventually became a citizen. He wanted to be a writer from an early age, but did not take it up professionally until his mid-thirties, when he was inspired to write his first screenplay while on a return flight to Toronto.\n \n \"I fell to daydreaming. I visualised the pilots at the controls and wondered what would happen if they both got sick. Could I fly the airplane? I was a rusty wartime pilot who hadn't flown for nine years... \" Hailey later recalled. The Canadian Broadcasting Corporation bought Flight into Danger for $600 (£318) and it was shown on TV in April 1956. It was later memorably spoofed in the 1980 comedy Airplane!, starring Leslie Nielsen. Hailey worked as a screenwriter for a couple of years, before turning to novels. He went on to produce 11 best-selling books, which were published into 38 languages in 40 countries. Flight into Danger was adapted to become Hailey's first novel, Runaway Zero-Eight in 1958. The Final Diagnosis and In High Places followed, both achieving a popular following. But it was not until Hotel, in 1965, that Hollywood came calling. The hit novel took four years to write, and stayed on national best-seller lists for a full year. It was turned into a movie in 1967 and later adapted into a glossy soap in the 1980s, starring James Brolin. Airport (1968) arguably remains Hailey's best-loved work and prompted the disaster movie genre. The thriller follows events in the sky, and on the ground at a snow-logged airport, when a terrorist boards an airplane with a bomb.\n \n The book was adapted into a hit film in 1970, starring Burt Lancaster as the harassed aiport manager and Dean Martin as a womanising pilot, alongside Jean Seberg and Jacqueline Bisset. In a testament to the popularity of the fledgling disaster genre - three sequels followed. The writer was known for his painstaking research into the professions around which each novel was centred, drawing his characters \"from real life\" and taking up to three years to produce each book. \"I have never been able to write quickly or easily. I am too self-critical for that. I am never satisfied,\" he once said. In 1969, he moved to Nassau in the Bahamas, with his wife Sheila. Wheels (1971), The Moneychangers (1975) and Overload (1979) followed. Despite a lukewarm response from critics, and few literary accolades, Hailey was at the height of his fame in the seventies and continued to attract the attention of Hollywood producers. Strong Medicine, Hailey's blockbuster focusing on the pharmaceutical industry, was turned into a film in 1986, starring Sam Neill, Douglas Fairbanks Jr and a panoply of former soap stars. The 1997 novel Detective proved to be Hailey's final book, when at the age of 77 he decided to retire. Hailey's health began to deteriorate in recent years, twice undergoing heart surgery. He suffered a stroke just two months ago. He died in his sleep on Wednesday, after dinner with his wife and two of his six children at his home in New Providence island. \"He had a wonderful life. His greatest ambition was to see his name on a book and he certainly achieved that,\" said his wife, Sheila.\n", "llama3.2:1b": "Arthur Hailey was a novelist known for writing bestselling page-turners about various industries. Born in 1920 in Luton, England, he served in World War II as a pilot before immigrating to Canada. He wrote his first screenplay while on a flight back to Toronto and later turned to novels, publishing 11 best-selling books. Hailey's works include \"Runaway Zero-Eight\", \"The Final Diagnosis\", \"In High Places\", \"Airport\", and \"Detective\". He adapted many of these novels into films and sequels, including \"Flight into Danger\" (TV screenplay), \"Hotel\" (novel), and \"Airplane!\" (comedy film). Hailey's books were published in 38 languages and sold in 40 countries. He retired from writing at the age of 77 due to health issues but died after dinner with his wife and family.", "llama3.2:3b": "Arthur Hailey, born April 5, 1920, was a bestselling novelist who wrote about various industries from hotels to high finance. He served in the Royal Air Force during WWII and later emigrated to Canada. His authorial debut was as a screenwriter for the TV show \"Flight into Danger.\" Hailey produced 11 best-selling books, including \"Hotel,\" which led to a hit film adaptation in 1970, followed by sequels. He also wrote about other industries such as hotels, airports, and pharmaceuticals.", "gemma2:2b": "Arthur Hailey was a bestselling author known for his page-turners exploring various industries. He began writing after serving in WWII as a pilot, emigrated to Canada, and transitioned to novels after penning his first screenplay. He published 11 bestsellers translated into 38 languages across the globe. His novels like \"Hotel,\" \"Airport,\" and \"Strong Medicine\" were adapted into movies and television series, establishing Hailey's legacy in the disaster genre and captivating readers worldwide.  \n", "qwen2.5:0.5b": "Arthur Hailey: A prolific novelist known for his captivating page-turners exploring various industries. Born in Luton, Bedfordshire, he served as a pilot during World War II and became a citizen. He produced 11 best-selling books by the end of his career. Hailey emigrated to Canada where he established himself as a writer before going on to produce several successful novels and screenplays. His work includes \"Flight into Danger\" (TV), \"Runaway Zero-Eight,\" and \"Hotel.\" Hailey is remembered for his meticulous research in character development, often taking up to three years to complete each book. Despite financial setbacks and health issues, he continued to write and produced several successful novels. Hailey's contributions helped establish the fledgling disaster genre in Hollywood.", "qwen2.5:1.5b": "Arthur Hailey, the renowned novelist known for his bestselling novels exploring various industries, died at age 84. Born into a working-class family, Hailey served in the Royal Air Force during WWII before immigrating to Canada where he wrote scripts and eventually penned several bestselling books on aviation, disaster movies, and pharmaceuticals. He was inspired by wartime experiences and took up writing professionally only after his mid-30s, adapting his screenplays into novels. His works include \"Flight into Danger,\" \"Runaway Zero-Eight,\" and the iconic \"Airport\" trilogy, which helped popularize the disaster movie genre.", "qwen2.5:3b": "Novelist Arthur Hailey, known for bestselling page-turners covering various industries, died aged 84. Born into working-class parents in 1920, he served as a Royal Air Force pilot during World War II before emigrating to Canada. He began writing screenplays and novels inspired by his experiences. Hailey's debut novel, \"Runaway Zero-Eight,\" was published in 1958; the film adaptation became a hit. His popular works include \"Hotel\" (1965), \"Airport\" (1968) and \"The Final Diagnosis\" (1972). Hailey meticulously researched his characters from real-life professionals, dedicating up to three years per book. Despite some lukewarm responses from critics, he became a Hollywood star in the 1960s with books like \"Overload.\" His final work was \"Detective,\" published at age 77, whereupon he retired. Hailey's life and career were marked by his self-criticism and dedication to his craft; he passed away peacefully after dinner with family.", "opencoder:1.5b": "Arthur Hailey: King of the bestsellers\n\nNovelist Arthur Hailey, who died at the age of 84, is known for his bestselling page-turners exploring the inner workings of various industries, from the hotels to high finance.\n\nBorn in Luton, Bedfordshire, on 5 April 1992, Hailey was the only child of working class parents, They could not afford to keep him in school beyond the age of 14. He served as a pilot with the Royal Air Force during World War II, flying fighter planes to the Middle East.\n\nIt was an occupation that was later to feature in his authorial debut, the television screenplay Flight into Danger. Hailey emigrated to Canada in 1994, where he eventually became a citizen. He wanted to be a writer from an early age, but did not take it up professionally until his mid-thirties, when he was inspired to write his first screenplay while on a return flight to Toronto.\n\n\"Today, I fell into a dreamy world. I imagined the pilots at the controls and wondered what would happen if they both got sick.\" Hailey recalled. The book was adapted into a hit film in 1996, starring James Brolin as the harassed airport manager and Jean Seberg as a womanising pilot.\n\nIn addition to this, Hailey's novel, Runaway Zero-Eight, was produced for three sequels, and the book was adapted into a movie in 1998. The thriller follows events in the sky, and on the ground at a snow-logged airport. It was turned into a glossy soap in the 2000s.\n\nThe first book of his career, Hailey's blockbuster focusing on the pharmaceutical industry, was produced in 2002. In 2003, he moved to Nassau, in the Bahamas, with his wife Sheila. He also achieved a literary accolade for writing a novel within two years of his death.\n\nHis health deteriorated in recent years, twice undergoing heart surgery. His death sparked a stir, after dinner at his home in New Providence Island.\n", "smollm:1.7b": "The summary should be concise and focus on the main ideas:\n\n1. Arthur Hailey: King of the bestsellers (Output only the summary as plain text—no explanations, no formatting, no reasoning process.)\n2. Novelist Arthur Hailey, who has died at the age of 84, was known for his bestselling page-turners exploring the inner workings of various industries, from hotels to high finance.\n3. Born in Luton, Bedfordshire, on 5 April 1920, Hailey was the only child of working class parents who could not afford to keep him in school beyond the age of 14. He served as a pilot with the Royal Air Force during World War II, flying fighter planes to the Middle East.\n4. Hailey later became a screenwriter and producer for television shows, including the popular soap opera Hotel.\n5. His first novel, Runaway Zero-Eight in 1965, was adapted into a hit film starring James Brolin as the harassed airport manager.\n6. The book was adapted into a sequel, Airport (1970), and another sequel, Overload (1979).\n7. Hailey's writing career spanned several decades, with many bestselling novels exploring themes of aviation, finance, and high society.\n8. He is known for his meticulous research into the professions around which each novel was centered, taking up to three years to produce each book.\n9. Despite a lukewarm response from critics and few literary accolades, Hailey's writing career was highly successful in the 1970s and 1980s.\n10. Hailey suffered a stroke just two months before his death on Wednesday, after dinner with his two children at his home in New Providence island.\n\nThe summary should be concise and focus on the main ideas:\n\n1. Arthur Hailey was a novelist who wrote bestselling books about various industries.\n2. He was born in Luton, Bedfordshire, England, and grew up to work as a pilot during World War II.\n3. Hailey later became a screenwriter and producer for television shows, including the popular soap opera Hotel.\n4. His first novel, Runaway Zero-Eight in 1965, was adapted into a hit film starring James Brolin as the harassed airport manager.\n5. The book was adapted into a sequel, Airport (1970), and another sequel, Overload (1979).\n6. Hailey's writing career spanned several decades, with many bestselling novels exploring themes of aviation, finance, and high society.\n7. He is known for his meticulous research into the professions around which each novel was centered, taking up to three years to produce each book.\n8. Despite a lukewarm response from critics and few literary accolades, Hailey's writing career was highly successful in the 1970s and 1980s.\n9. Hailey suffered a stroke just two months before his death on Wednesday, after dinner with his two children at his home in New Providence island.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Arthur Hailey. Let me read through it carefully first.\n\nAlright, the main points are: Hailey is known as the King of bestselling books, explored various industries like hotels, finance, etc. Born in Luton, he started writing early but didn't publish until mid-thirties. His debut screenplay was on TV, and then he went into novel writing. He wrote 11 bestsellers in 38 languages. One book became a movie and stayed on lists for years. He has some notable sequels. He's known for his self-critical approach. died at 77 after a stroke.\n\nI need to condense all that into a concise summary without any explanations or formatting. So I'll outline the key elements: Hailey's occupation, background, contributions, literary success, notable later works, and his later life issues.\n</think>\n\nArthur Hailey is known as the King of bestselling books, exploring various industries from hotels to high finance. Born in Luton, Bedfordshire, he started writing early but began publishing at mid-thirties. His debut screenplay, \"Flight into Danger,\" was on TV, and later adapted into a novel called \"Runaway Zero-Eight.\" He wrote 11 bestsellers, publishing in 38 languages and reaching 40 countries. Notable works include \"Hotel\" (1965) and \"Wheels\" (1971), and his latest, \"Detective,\" released in 1997. His book \"The Moneychangers\" was adapted into a film in 1986. Hailey passed away at 77 after a stroke, known for his self-critical approach to writing and later facing health issues.", "tinyllama:1.1b": "Arthur Hailey, who died at the age of 84, was an author known for his bestselling page-turners exploiting the inner workings of various industries, including hotels and high finance. Born in Luton, Bedfordshire during World War II, Hailey emigrated to Canada in his mid-thirties and eventually became a citizen. He worked as a screenwriter for Canadian Broadcasting Corporation (CBC) before turning to novels. His first novel, Flight into Danger (1956), was published on TV in 1958, followed by another bestseller, Hotel (1965). The books were adapted into movies, with Hotel becoming a popular thriller movie genre. Hailey's novels explored themes of terrorism and disaster films, but he also wrote about the pharmaceutical industry in Strong Medicine (1986) and Detective (1997), with his health declining soon after his death. He is credited with coining the phrase \"hotel,\" which was later applied to the term \"hotels\" as a whole.", "tinydolphin:1.1b": " Arthur Hailey, one of the most influential authors in modern literature, has passed away at the age of 84. Born in Luton, Bedfordshire, England, on April 5, 1920, Hailey was a prolific author who penned bestselling page-turners exploring the inner workings of various industries, from the hotels to high finance. Despite facing challenges in his personal life, such as a stroke and multiple heart surgeries, Hailey remained an inspiration to many.\n\nHailey's novels include such iconic works as Flight into Danger (1958), Hotel (1965), and Airport (1967). These books have each achieved best-seller status and have been adapted into movies, television shows, and other forms of media. He was also known for his screenwriting work, crediting his vast knowledge of aviation with inspiring the creation of his bestselling novels.\n\n\"I fell to daydreaming,\" Hailey recalled about his initial idea for Flight into Danger. The Canadian Broadcasting Corporation bought his script and it was later shown on TV in April 1956. It remains one of Hailey's most memorable works, which showcased his unique ability to draw from real life experiences.\n\nOver the course of his career, Hailey worked as a screenwriter for three years, before turning to novels. His popularity with readers spanned across multiple genres, including romance, adventure, and mystery. Some of his most well-known works include Runaway Zero-Eight (1958), which remains one of the best-selling books ever written in English, and In High Places (1960), a semi-autobiographical account of his life as an airline pilot.\n\nHailey's work was well-received by both critics and readers alike, with his novels often being compared to James Bond novels for their action and adventure. His popularity also helped to create new career paths for his writers, such as Martin and Brolin, who went on to achieve further success in the film industry.\n\nDespite facing health challenges in recent years, Hailey continued to produce novels until he passed away at the age of 84 in New Providence Island, Bahamas. His legacy will continue to inspire future generations of writers and readers as his work continues to be celebrated for its innovative storytelling and influential role in shaping modern literature.", "phi:2.7b": " Arthur Hailey, a bestselling author known for his page-turners exploring various industries, such as hotels and finance, died at 84 after serving in the Royal Air Force during World War II and emigrating to Canada. His first novel, Flight into Danger, was adapted into a TV screenplay and later a book. He went on to produce 11 bestsellers that were published worldwide and turned into movies and soaps. In his novels, he researched extensively about professions in the real world, and took several years to write each one. Despite not receiving many literary accolades, his popularity peaked in the seventies and he attracted Hollywood producers with his books. He retired at 77 with his wife and six children, but his health began to decline, leading to a stroke just two months ago. He died in his sleep after dinner with his family on New Providence island.\n", "orca-mini:3b": " Arthur Hailey was a Canadian novelist known for his bestselling page-turners that explored the inner workings of various industries such as hotels, high finance, pharmaceuticals, and airlines. He wrote 11 best-selling books, which were published into 38 countries in 40 countries, and his novels were adapted into films, including \"Airport\" and \"Runaway Zero-Eight.\" Hailey worked as a screenwriter for a couple of years and then turned to novels. His first novel, \"Flight into Danger,\" was adapted into the hit film \"Airport\" in 1968, which led to the disaster movie genre. Hailey's research into the professions around which each novel was centred drew his characters from real life, taking up to three years to produce each book, and he received critical acclaim but few literary accolades. Despite lukewarm responses from critics, Hailey continued to attract the attention of Hollywood producers, and his final book, \"Detective,\" was turned into a film in 1986. He died at the age of 84 due to a stroke just two months ago.", "hermes3:3b": "Arthur Hailey bestselling novelist known for industries novels like hotels, finance & disaster movies like Airport, with works adapted into films.", "stablelm-zephyr:3b": "Novelist Arthur Hailey, known for his bestselling page-turners exploring various industries, passed away at 84. Born in Luton, Bedfordshire, Hailey served as a pilot during World War II and emigrated to Canada in 1947 before becoming a citizen. He wrote 11 best-selling books, published into 38 languages in 40 countries. Hailey's novels were adapted into films and soap operas, with his painstaking research drawing characters from real life. He moved to Nassau in the Bahamas and continued to write until his retirement in 1997.", "stablelm2:1.6b": "Arthur Hailey, known for bestselling novels exploring various industries, died at age 82 after serving as a Royal Air Force pilot during WWII and later becoming a Canadian citizen. He began writing novels in the late 1960s and produced hit books adapted into film versions, such Raising Arizona (Airport), Runaway Zero- Eight, and Hotel. Hailey's final book was Detective, published in 2004. Despite lukewarm reviews, he continued to attract Hollywood for potential film adaptations of his novels during the 1970s.", "granite3.1-dense:2b": "Arthur Hailey (1920-2024), an English novelist known for bestselling works exploring various industries, was born in Luton and served as a Royal Air Force pilot during WWII. After emigrating to Canada in 1947, he began his writing career with the television screenplay \"Flight into Danger\" while on a flight back to Toronto, inspired by daydreams of piloting. His first novel, \"Runaway Zero-Eight,\" was published in 1958 after the success of this screenplay.\n\nHailey's prolific career produced 11 best-selling books, translated into 38 languages across 40 countries, including \"Hotel\" (1965), which became a hit movie and launched his disaster genre exploration with \"Airport\" (1970). His meticulous research, taking up to three years per book, resulted in characters derived from real life. Notable works include \"Wheels\" (1971) on the automotive industry, \"The Moneychangers\" (1975), and \"Overload\" (1979).\n\nHailey's career peaked in the 1970s, during which he continued to attract Hollywood attention. His final book, \"Detective,\" was published in 1997, marking his retirement at age 77 due to deteriorating health. He died at home in New Providence island from natural causes on Wednesday, with his wife confirming he had achieved his lifelong ambition of seeing his name on books.", "chatgpt-4o-latest": "Arthur Hailey, the bestselling novelist known for his meticulously researched page-turners about various industries, has died at 84. Born in Luton, England, in 1920, he served as an RAF pilot in World War II before emigrating to Canada in 1947. His writing career began with the 1956 television screenplay *Flight into Danger*, later adapted into his first novel, *Runaway Zero-Eight* (1958). Hailey gained widespread fame with *Hotel* (1965) and *Airport* (1968), the latter inspiring the disaster movie genre. His works, including *Wheels* (1971), *The Moneychangers* (1975), and *Strong Medicine* (1984), were known for their in-depth research and Hollywood adaptations. Despite mixed critical reception, he remained a commercial success. Hailey retired after publishing *Detective* (1997) and spent his later years in the Bahamas. He passed away peacefully at home after dinner with his family.", "reference": "The writer was known for his painstaking research into the professions around which each novel was centred, drawing his characters \"from real life\" and taking up to three years to produce each book.It was an occupation that was later to feature in his authorial debut, the television screenplay Flight into Danger.Flight into Danger was adapted to become Hailey's first novel, Runaway Zero-Eight in 1958.I was a rusty wartime pilot who hadn't flown for nine years... \" Hailey later recalled.His greatest ambition was to see his name on a book and he certainly achieved that,\" said his wife, Sheila.It was later memorably spoofed in the 1980 comedy Airplane!, starring Leslie Nielsen.It was turned into a movie in 1967 and later adapted into a glossy soap in the 1980s, starring James Brolin.Novelist Arthur Hailey, who has died at the age of 84, was known for his bestselling page-turners exploring the inner workings of various industries, from the hotels to high finance.Born in Luton, Bedfordshire, on 5 April 1920, Hailey was the only child of working class parents, They could not afford to keep him in school beyond the age of 14.But it was not until Hotel, in 1965, that Hollywood came calling.He wanted to be a writer from an early age, but did not take it up professionally until his mid-thirties, when he was inspired to write his first screenplay while on a return flight to Toronto.The book was adapted into a hit film in 1970, starring Burt Lancaster as the harassed aiport manager and Dean Martin as a womanising pilot, alongside Jean Seberg and Jacqueline Bisset.The Canadian Broadcasting Corporation bought Flight into Danger for $600 (£318) and it was shown on TV in April 1956.Strong Medicine, Hailey's blockbuster focusing on the pharmaceutical industry, was turned into a film in 1986, starring Sam Neill, Douglas Fairbanks Jr and a panoply of former soap stars.Despite a lukewarm response from critics, and few literary accolades, Hailey was at the height of his fame in the seventies and continued to attract the attention of Hollywood producers."}