{"raw_text": "Public show for Reynolds portrait\n \n Sir Joshua Reynolds' Portrait of Omai will get a public airing following fears it would stay hidden because of an export wrangle.\n \n The Tate Gallery unsuccessfully tried to buy the picture from its anonymous owner after a ban was issued preventing the painting from leaving the UK. The 18th Century painting has remained in storage but the owner has agreed to allow it to be part of an exhibition. The exhibition of Reynolds' work will be shown at Tate Britain from May. Joshua Reynolds: The Creation of Celebrity will feature prints, caricatures, and sculpture by the 18th Century artist, who painted some of the most famous personalities of his day. Portrait of Omai fetched the second highest amount for a British painting when it was sold at auction for £10.3m in 2001. It was bought by a London dealer who sold it on to a collector. The unnamed collector wanted to take it out of the country, but was barred from doing so by the government because of its historical significance.\n \n In March 2004, the Tate managed to raise £12.5m funding to buy the portrait but the owner refused to sell and it has been held in storage since. The portrait is of a young man who was dubbed \"the noble savage\" when he arrived in London from Polynesia. He became a darling of London society and was invited to all the best parties by people who were fascinated by such an exotic character. Sir Joshua painted him after his arrival in 1774, and it became the artist's most famous work after it was first exhibited at the Royal Academy in 1776.\n", "llama3.2:1b": "Sir Joshua Reynolds' Portrait of Omai will be displayed publicly for the first time in over a decade following fears it would remain hidden due to export restrictions. The painting has been stored in the UK for nearly three decades but an agreement is in place allowing it to appear at Tate Britain. The portrait sold for £10.3m in 2001 and features Omai, a young Polynesian man who became \"the noble savage\" in London society.", "llama3.2:3b": "The Tate Gallery will display Sir Joshua Reynolds' Portrait of Omai from May at Tate Britain following a long-standing export ban on the painting. The portrait, valued at £10.3m, has been stored since a previous attempt to buy it failed due to funding issues in 2004. It was sold by an anonymous collector who wanted to take it out of the country but was barred from doing so due to its historical significance.", "gemma2:2b": "Sir Joshua Reynolds' Portrait of Omai will be displayed publicly starting May at Tate Britain as part of an exhibition titled \"Joshua Reynolds: The Creation of Celebrity.\"  The portrait fetched a record price for a British painting in 2001 and was initially banned from export before the owner agreed to its inclusion in the exhibition.  It depicts a young man, dubbed \"the noble savage,\" who became a socialite after his arrival from Polynesia in 1774. \n", "qwen2.5:0.5b": "The portrait of Omai will be shown at Tate Britain from May 2023. It has fetched £10.3m when auctioned in 2001 for the second highest amount for a British painting. The painting was originally held by a London dealer who wanted to sell it out of the country but couldn't do so because the government had barred him from doing so due to its historical significance.", "qwen2.5:1.5b": "The Tate Britain is hosting a public exhibition of the controversial 18th-century portrait by Joshua Reynolds featuring Omai, following an owner's agreement to let it be displayed despite fears over export restrictions. The exhibition will feature prints, caricatures, and sculptures by the artist who painted famous personalities of his day.", "qwen2.5:3b": "Sir Joshua Reynolds' Portrait of Omai will be displayed publicly for the first time following an export ban preventing its departure from the UK. The painting, sold at auction for £10.3m in 2001 and held in storage since 2004, was successfully agreed to be shown at Tate Britain's exhibition \"Joshua Reynolds: The Creation of Celebrity\" featuring other works by the artist. Omai arrived in London from Polynesia in 1774 and became a celebrity due to his exotic nature; the portrait was painted after he visited England in 1776, becoming one of Reynolds' most famous pieces when it was first exhibited at the Royal Academy.", "opencoder:1.5b": "\"Public show for Reynolds portrait\". The owner of the Tate Gallery unsuccessfully tried to buy the painting from an anonymous buyer after a ban issued by the government prevented the painting from leaving the UK. The 18th Century painting has remained in storage but the owner agreed to allow it to be part of an exhibition. The exhibition of Reynolds' work will be shown at Tate Britain from May. Joshua Reynolds: The Creation of Celebrity. Portrait of Omai fetched the second highest amount for a British painting when it was sold at auction for £10.3m in 2001. It was bought by a London dealer who sold it on to a collector. The unnamed collector wanted to take it out of the country, but was blocked from doing so because of its historical significance. In March 2004, the Tate managed to raise funding to buy the portrait but the owner refused to sell and it has been held in storage since.\n", "smollm:1.7b": "The summary should preserve key ideas and details:\n\n1. The public show for Reynolds' portrait will get a public airing following fears it would stay hidden because of an export wrangle.\n2. The Tate Gallery unsuccessfully tried to buy the picture from its anonymous owner after a ban was issued preventing the painting from leaving the UK.\n3. The exhibition of Reynolds' work will be shown at Tate Britain from May. Joshua Reynolds: The Creation of Celebrity will feature prints, caricatures, and sculpture by the 18th Century artist, who painted some of the most famous personalities of his day.\n4. Portrait of Omai fetched the second highest amount for a British painting when it was sold at auction for £10.3m in 2001. It was bought by a London dealer who sold it on to a collector. The unnamed collector wanted to take it out of the country, but was barred from doing so by the government because of its historical significance.\n5. In March 2004, the Tate managed to raise £12.5m funding to buy the portrait but the owner refused to sell and it has been held in storage since. The owner is unnamed and refuses to sell. The buyer wants to take the painting out of the country, but is barred by the government because of its historical significance.\n6. In March 2004, the Tate managed to raise £12.5m funding to buy the portrait but the owner refused to sell and it has been held in storage since. The owner is unnamed and refuses to sell. The buyer wants to take the painting out of the country, but is barred by the government because of its historical significance.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Sir Joshua Reynolds' portrait, \"Portrait of Omai.\" Let me read through it carefully.\n\nFirst, there's a public show scheduled for his painting. It says it gets airings because of an export issue, probably a trade deal that stopped the owner from leaving the UK. The Tate Gallery tried to buy it but faced a ban, so they kept it in storage but agreed to put part of it into an exhibition.\n\nThen, there's some background on the painting itself. It's a 17th-century portrait, maybe around 3 feet tall or something like that. It's famous and had some key characters, including \"the noble savage.\" Joshua Reynolds is known for this style and his work from 1774 onward.\n\nThe painting fetched the second highest price in the UK during auction in 2001 at £10.3 million. It was sold to a London dealer who bought it from an unnamed collector, but that collector wanted to sell it outside the UK because he thought the character was exotic and would attract attention if not removed.\n\nThe Tate tried again in March 2004 with £12.5 million but failed to get the deal, so the owner kept the painting in storage since then.\n\nI need to make a concise summary that includes key points: the planned public show, issues with the acquisition (export restrictions), the painting's details and importance, its auction value, and the collector's concerns about selling it elsewhere.\n</think>\n\nPublic show for Sir Joshua Reynolds' \"Portrait of Omai\" is scheduled. The Tate Gallery had initially attempted to buy the painting from its anonymous owner but faced a government ban on exporting it. However, the owner agreed to allow part of the work in an exhibition, which will be held at Tate Britain starting May 2018. \n\nThe painting is a 17th-century portrait with significant historical value, featuring key figures like \"the noble savage.\" Joshua Reynolds is renowned for this style and his work from 1774 onward. The painting fetched the second highest price in the UK during 2001 at £10.3 million, sold to a London dealer who bought it from an unnamed collector. However, that collector wanted to sell the piece outside the UK, which led to the Tate Gallery's failure to secure the deal and keep the painting. The work remains in storage since March 2004 after the Tate Agency's failed attempt.", "tinyllama:1.1b": "Sir Joshua Reynolds' Portrait of Omai Will Be Publicly Shown Following Export Wrapage Concerns\n\nPublic show for Reynolds portrait is announced following fears that the painting would remain hidden because of an export prohibition. The exhibition will feature prints, caricatures, and sculptures by the 18th Century artist, who painted some of the most famous personalities of his day. Portrait of Omai fetched the second highest amount for a British painting when it was sold at auction in 2001. It was bought by London dealer who wanted to take it out of the country but was barred from doing so because of its historical significance. In March 2004, the Tatet managed to raise £12.5m funding to buy the portrait but the owner refused to sell and it remained in storage since. The portrait is now set to be part of an exhibition at Tatet Britain, which aims to showcase Reynolds' work during his lifetime.", "tinydolphin:1.1b": " Reynolds portrait of Omai is set to be displayed for public viewing as part of a major exhibition at Tate Britain following its long-standing storage ban due to an export wrangle between the UK and the owner's anonymous benefactor. The Tate Gallery initially tried to purchase the painting from the anonymous seller but were unsuccessful, ultimately allowing it to be included in an upcoming showcase featuring works by renowned British artist Sir Joshua Reynolds. The exhibition at Tate Britain will feature a variety of prints, caricatures, and sculptures created by the 18th-century artist, who painted some of the most famous personalities of his day.", "phi:2.7b": " The Tate Gallery planned to exhibit Sir Joshua Reynolds' Portrait of Omai, which had been stored due to a ban on export from the UK. The anonymous owner eventually agreed to allow the painting to be part of an exhibition titled \"Joshua Reynolds: The Creation of Celebrity,\" showing other works by the artist. The portrait fetched £10.3m at auction in 2001 and was bought by a London dealer who sold it to a collector, but this collector could not take it out of the country due to its historical significance. In 2003, the Tate raised funding to buy the portrait but the owner refused to sell, so it remained in storage until 2013 when the owner agreed to let it be part of the exhibition. The portrait is of Omai, a Polynesian man who became a darling of London society and inspired Reynolds' most famous work, which was exhibited at the Royal Academy in 1776.\n", "orca-mini:3b": " The Reynolds portrait of Omai will be displayed publicly following the resolution of an export wrangle. The Tate Gallery unsuccessfully tried to buy the painting from its anonymous owner, and it has remained in storage since 2004. The portrait is of a young man who was a favorite of London society, and it was painted by Sir Joshua Reynolds after his arrival in London in 1774. It became the artist's most famous work after it was first exhibited at the Royal Academy in 1776.", "hermes3:3b": "Omai portrait of Reynolds to be public show", "stablelm-zephyr:3b": "Sir Joshua Reynolds' portrait of Omai, initially banned from leaving the UK due to an export wrangle, will be part of an exhibition at Tate Britain featuring the artist's works starting May. The 18th century painting was the second highest amount for a British painting, selling for £10.3m in 2001, but has remained in storage since its owner refused to sell to the Tate Gallery in 2004. Omai, considered an \"exotic character\" and a darling of London society, was painted by Reynolds after his arrival from Polynesia in 1774 and became the artist's most famous work.", "stablelm2:1.6b": "Sir Joshua Reynolds' portrait of Omai will be displayed publicly after earlier concerns about an export ban. The painting, from the 1st Century, initially prevented leaving the UK due to a ban on art imports; however, the owner has now agreed for it to be part of an exhibition at Tate Britain starting in May. Portrait of Omai sold for £3m at auction and was banned from being exported by the government due to its historical significance. In 2014, the Tate successfully raised £5m funding to acquire the painting but was unsuccessful when trying to sell it. The artwork showcases Reynolds' notable work featuring famous personalities and became his most famous piece after first exhibiting it at the Royal Academy in 1867.", "granite3.1-dense:2b": "The Tate Gallery will display Sir Joshua Reynolds' renowned 18th-century portrait, \"Portrait of Omai,\" in an upcoming exhibition titled \"Joshua Reynolds: The Creation of Celebrity.\" This painting, valued at £10.3m in 2001 when it was last sold, depicted a young man from Polynesia who captivated London society as \"the noble savage\" after his arrival in 1774. Initially intended for the Royal Academy's exhibition, the portrait has been held in storage since 2004 due to an export ban, preventing its departure from the UK. The Tate successfully secured £12.5m in funding to acquire the piece but faced refusal from the anonymous owner. Despite this, the owner has now agreed to allow the portrait's public exhibition at Tate Britain, starting in May 2023.", "chatgpt-4o-latest": "Sir Joshua Reynolds' Portrait of Omai, previously kept in storage due to an export ban, will be publicly displayed as part of an exhibition at Tate Britain from May. The painting, depicting a Polynesian visitor to London in the 18th century, was sold for £10.3m in 2001 but was barred from leaving the UK due to its historical significance. The Tate Gallery attempted to purchase it for £12.5m in 2004, but the owner refused to sell. Now, the owner has agreed to include it in the exhibition, Joshua Reynolds: The Creation of Celebrity, which will showcase the artist's work, including prints, caricatures, and sculptures.", "reference": "It was bought by a London dealer who sold it on to a collector.Portrait of Omai fetched the second highest amount for a British painting when it was sold at auction for £10.3m in 2001.Sir Joshua painted him after his arrival in 1774, and it became the artist's most famous work after it was first exhibited at the Royal Academy in 1776.The portrait is of a young man who was dubbed \"the noble savage\" when he arrived in London from Polynesia.The Tate Gallery unsuccessfully tried to buy the picture from its anonymous owner after a ban was issued preventing the painting from leaving the UK."}