{"raw_text": "Lit Idol begins search for author\n \n The second Pop Idol-style search for literary talent has begun with the help of the brother of Simon Cowell.\n \n Writer Tony Cowell is among the judges who will hear aspiring writers read their work aloud. The winner gets a deal with literary agency Curtis Brown. \"I'm not going to be the Mr Nasty of books,\" said Cowell, 54, in reference to his brother's caustic remarks on TV shows Pop Idol and The X-Factor. The 2004 winner, Paul Cavanagh, went on to sign a deal with Harper Collins.\n \n This year, the competition is specifically looking for a crime writer. Writers must submit up to 10,000 words from the opening chapters of their novels and a synopsis. Professional readers will choose a shortlist of five following the competition closing date on 14 January.\n \n The final five will then have to read their work in front of judging panel. A public vote will also take place, which will account for 25% of the final decision. The winner will be announced at the London Book Fair on 14 March next year and could be screened on TV. \"It's very, very hard to find an agent and extremely difficult, without an agent, to get a publisher to look at your work,\" said Cowell. \"People do fall by the wayside and the more avenues we can provide for aspiring authors, the better,\" he added. Paul Cavanagh, a former university professor and health care consultant from Ontario in Canada, was one of 1,466 aspiring novelists to enter the first contest. He lifted the inaugural Lit Idol prize after reading aloud an excerpt of his work Northwest Passage. Three film studios are said to be interested in buying film rights for the book, even though it is not finished yet.\n", "llama3.2:1b": "Tony Cowell and Curtis Brown Literary Agency begin literary search. Writers submit 10,000 words and synopsis for crime novel opening chapters. Judge Simon Cowell to choose shortlist of five before public vote. Final winners read work in front of panel, with 25% judged by public vote.", "llama3.2:3b": "The second Lit Idol competition has begun, searching for a crime writer with the help of Tony Cowell, Simon's brother. Aspiring writers must submit up to 10,000 words from their opening chapters and a synopsis. A shortlist will be chosen by professional readers, followed by a public vote that will account for 25% of the final decision. The winner will receive a deal with literary agency Curtis Brown and could be screened on TV.", "gemma2:2b": "Lit Idol, a competition for crime writers, has begun with the help of Simon Cowell's brother, Tony Cowell.  The winner will receive representation from Curtis Brown and a public vote will determine the final decision. The contest is open to writers who submit 10,000 words from their novels' opening chapters and a synopsis. The competition aims to provide opportunities for aspiring authors and potentially lead to publishing deals and film rights.  \n", "qwen2.5:0.5b": "Lit Idol seeks literary talent\n\nThe competition is looking for a crime writer who must submit up to 10, 000 words and a synopsis from their novels. The public vote will account for 25% of the final decision, with the winner announced at the London Book Fair on March 14.", "qwen2.5:1.5b": "The second \"Pop Idol\" style search for literary talent has begun with judges including Simon Cowell's brother Tony. The competition aims to find a crime writer and involves submitting 10, 000-word opening chapters and synopses. Shortlisted authors will read their work in front of a judging panel, with public voting contributing 25% of the final decision. The winner could receive representation from Curtis Brown or be screened on TV at London's Book Fair.", "qwen2.5:3b": "Lit Idol begins second search for literary talent with Tony Cowell (Simon Cowell's brother) as judge. Focus on crime writing this year; winners get deal with Curtis Brown. Entrants submit 10,000 words and synopsis by Jan 14. Five finalists read excerpts, public vote accounts for 25%. Winner announced at London Book Fair in March. Aim is to provide more avenues for aspiring authors who often struggle to find an agent or publisher. Past winner Paul Cavanagh's book Northwest Passage sold to three film studios despite being unfinished.", "opencoder:1.5b": "The Lit Idol competition begins with a search for literary talent through the help of the brother of Simon Cowell. Writer Tony Cowell faces judges who will listen to aspiring writers read their work aloud. The winner gets a deal signed with literary agency Curtis Brown, who is not going to be Mr Nasty of books. The 2004 winner Paul Cavanagh made it to signing with Harper Collins in 2016 and had his book published on the London Book Fair on 14 March next year. This competition requires a crime writer to submit up to 10,000 words from the opening chapters of their novels and a synopsis. It is for professional readers who will follow the decision making process until the end of the contest.\n", "smollm:1.7b": "The second Pop Idol-style search for literary talent has begun with the help of the brother of Simon Cowell. Writer Tony Cowell is among the judges who will hear aspiring writers read their work aloud. The winner gets a deal with literary agency Curtis Brown. \"I'm not going to be the Mr Nasty of books,\" said Cowell, 54, in reference to his brother's caustic remarks on TV shows Pop Idol and The X-Factor. The 2004 winner, Paul Cavanagh, went on to sign a deal with Harper Collins. This year, the competition is specifically looking for a crime writer. Writers must submit up to 10,000 words from the opening chapters of their novels and a synopsis. Professional readers will choose a shortlist of five following the competition closing date on 14 January. The final five will then have to read their work in front of judging panel. A public vote will also take place, which will account for 25% of the final decision. The winner will be announced at the London Book Fair on 14 March next year and could be screened on TV. \"It's very, very hard to find an agent and extremely difficult, without an agent, to get a publisher to look at your work,\" said Cowell. \"People do fall by the wayside and the more avenues we can provide for aspiring authors, the better.\" Paul Cavanagh, a former university professor and health care consultant from Ontario in Canada, was one of 1,466 aspiring noveliststo enter the first contest. He lifted the inaugural Lit Idol prize after reading aloud an excerpt of his work Northwest Passage. Three film studios are said to be interested in buying film rights for the book, even though it is not finished yet.", "deepseek-r1:1.5b": "<think>\nAlright, so I've got this query where the user wants me to summarize a given text concisely. Let's break down what they're asking for.\n\nFirst, the text is about a literary competition called Lit Idol. From what I can tell, the writer Tony Cowell is involved and he's 54 years old, which means he's in his mid-50s. He mentioned referencing his brother Simon Cowell, who was known for his TV shows, so that ties into his age.\n\nThe text says that a new judge group is formed with writers submitting up to 10,000 words from the opening chapters of their novels and a synopsis. They have a public vote at 25% of the final decision and the winner is announced at the London Book Fair in March. Plus, there's a TV screening.\n\nPaul Cavanagh, the previous winner, had signed with Harper Collins and was one of many applicants for this year's contest from over 1,466 people. He read aloud an excerpt of his book Northwest Passage and the text mentions that three film studios are interested in buying rights even though the book isn't finished yet.\n\nThe user wants only the summary in plain text without any explanations or formatting. So I need to make sure I capture all the key points: the competition, the judges (including Tony Cowell), the criteria for submission, the public vote, and the announcement details.\n\nI should structure it concisely, including who is involved, the main competitors like Paul Cavanagh, and highlight the importance of having an agent or publisher. Also, mention that while some studios are interested in film rights even if the book isn't done yet.\n</think>\n\nThe Lit Idol literary competition begins this year with a judge group featuring writers submitting up to 10,000 words from their novels' opening chapters and a synopsis. The winner will receive a deal with Harper Collins, has a public vote (25% of final decision), and will be announced at the London Book Fair in March. Paul Cavanagh, a former professor and health care consultant, read aloud an excerpt of his novel Northwest Passage. Three film studios are interested in buying film rights for the book even though it isn't finished yet.", "tinyllama:1.1b": "The British media giant News Corp has acquired Australian tech startup Voxeo for an undisclosed amount as part of its efforts to expand into the Southeast Asian market. The acquisition follows in the footsteps of other multinational tech giants such as Facebook, Amazon, and Google in taking advantage of the growth opportunities in Southeast Asia's burgeoning digital economy. News Corp will use Voxeo's messaging technology to provide personalized customer service to its 50 million subscribers across India, Indonesia, Malaysia, the Philippines, Thailand, and Vietnam. The tech giant acquired Voxeo for an undisclosed amount in 2014 and is now looking to accelerate its expansion into Southeast Asia through this acquisition.\n\nLit Idol begins seaRCh for literary talent has begun with the help of the brother of Simon Cowell. Writer Tony Cowell is among the judgeess who will hear aspiring writers read their work aloud. The winner gets a deal with literary agecy Curtis Brown. \"I'm not going to be the Mr Nasty of books,\" said Cowell, 54, in reference to his brother's remarks on TV shows Pop Idol and The X-Factour. This year, the competition is looking for a crime writer. WriteRs must submit up to 10,000 words from the opening chapter of their novel and a synopsis. Professional readers will then choose a shortlist of five following the competition closing date on January 14. The winner will be announced at the London Book Fair in March, and could be screened on TV. \"It's very difficult to find an agent and extremely difficult to get a publisher to look at your work,\" said Cowell. \"People do fall by the wayside, and the more avunies we can provide for aspiring authors, the better,\" he added. Voxeo will help News Corp expand its messaging technology across Southeast Asia.\n\nThe two Pop Idol-style seaRCh for literary talent has begun with the help of the brother of Simon Cowell. Writer Tony Cowell is among the judgeess who will hear aspiring writers read their work aloud. The winner gets a deal with literary agecy Curtis Brown. \"I'm not going to be the Mr Nasty of books,\" said Cowell, 54, in reference to his brother's remarks on TV shows Pop Idol and The X-Factour. This year, the competition is specifically looking for a crime writer. WriteRs must submit up to 10,000 words from the opening chapter of their novel and a synopsis. Professional readers will then choose a shortlist of five following the competition closing date on January 14. The winner will be announced at the London Book Fair in March, and could be screened on TV. \"It's very difficult to find an agent and extremely difficult to get a publisher to look at your work,\" said Cowell. \"People do fall by the wayside, and the more avunies we can provide for aspiring authors, the better,\" he added. Voxeo will help News Corp expand its messaging technology across Southeast Asia with its acquisition of Australian tech startup Voxeo.", "tinydolphin:1.1b": " Summary: A new search for literary talent has begun under the watchful eye of Simon Cowell and his brother, Tony. Writer Paul Cavanagh won the first Lit Idol contest, which requires entrants to submit their manuscripts in advance of a public vote. The winner could be chosen from a shortlist of five, with a public vote weighing 25% of the final decision.", "phi:2.7b": " The second Pop Idol-style search for literary talent has begun with the help of Tony Cowell, the brother of Simon Cowell. Writers must submit up to 10,000 words from their opening chapters and a synopsis to be chosen by professional readers as part of the competition. The winner will have a deal with Curtis Brown and could even be screened on TV after the London Book Fair. Paul Cavanagh, who entered the first contest, won with his work Northwest Passage.\n", "orca-mini:3b": " The second Pop Idol-style search for literary talent has begun with Simon Cowell's brother as one of the judges, and writers must submit up to 10,000 words from the opening chapters of their novels and a synopsis. The winner gets a deal with literary agency Curtis Brown. A public vote will account for 25% of the final decision. The winner will be announced at the London Book Fair on 14 March next year and could be screened on TV.", "hermes3:3b": "Lit Idol literary competition starts, looking for crime writer; Tony Cowell (Simon Cowell's brother) judges, winner gets deal with Curtis Brown; 5 shortlist candidates read their work, public vote counts for 25% of final decision.", "stablelm-zephyr:3b": "Lit Idol, seeking literary talent with the help of Simon Cowell's brother, Tony Cowell, has begun its search for crime writers. Aspiring authors submit up to 10,000 words from their opening chapters along with a synopsis. Professional readers will shortlist five finalists, and a public vote will contribute to the decision alongside the judging panel. The winner will be announced at the London Book Fair next year and could be screened on TV. A previous winner, Paul Cavanagh, landed a deal with Harper Collins through this same competition.", "stablelm2:1.6b": "The \"Lit Idol\" literary competition, inspired by Pop Idol, includes Simon Cowell's brother Tony as a judge. Aspiring writers submit their opening chapters and synopses for a chance at a deal with Curtis Brown. The contest aims to find a crime writer; last year's winner, Paul Cavanagh, signed with Harper Collins after reading his work. Up to five finalists will read their novels in front of the judging panel, with public votes accounting for 10% of the final decision. Announced at London Book Fair next March, this could be screened on TV.", "granite3.1-dense:2b": "The second Pop Idol-inspired talent search, Lit Idol, has commenced with Tony Cowell, brother of Simon Cowell, serving as a judge alongside other literary experts. The contest aims to discover crime writers, requiring contestants to submit up to 10,000 words from their novel's opening chapters and synopses. Professional readers will narrow the field to five finalists, who will perform live readings for the panel. A public vote will also factor into the decision-making process. The winner, to be announced at the London Book Fair on March 14, 2023, could secure a deal with Curtis Brown agency and potentially attract film rights interest from studios despite the manuscript's incomplete status.", "chatgpt-4o-latest": "The second Lit Idol competition has begun, with Tony Cowell, Simon Cowell's brother, among the judges. The winner will receive a deal with literary agency Curtis Brown. This year, the contest seeks a crime writer, requiring submissions of up to 10,000 words and a synopsis. Five finalists will be chosen after the January 14 deadline, and they will read their work before a judging panel, with a public vote contributing 25% to the final decision. The winner will be announced at the London Book Fair on March 14 and may be featured on TV. The 2004 winner, Paul Cavanagh, secured a Harper Collins deal, and his book Northwest Passage has attracted interest from film studios. Tony Cowell emphasized the competition's role in helping aspiring authors find agents and publishers.", "reference": "Writer Tony Cowell is among the judges who will hear aspiring writers read their work aloud.The final five will then have to read their work in front of judging panel.\"It's very, very hard to find an agent and extremely difficult, without an agent, to get a publisher to look at your work,\" said Cowell.The winner gets a deal with literary agency Curtis Brown.The 2004 winner, Paul Cavanagh, went on to sign a deal with Harper Collins.\"I'm not going to be the Mr Nasty of books,\" said Cowell, 54, in reference to his brother's caustic remarks on TV shows Pop Idol and The X-Factor.The winner will be announced at the London Book Fair on 14 March next year and could be screened on TV."}