{"raw_text": "Dirty Den's demise seen by 14m\n \n More than 14 million people saw \"Dirty\" Den Watts killed off on Friday, marking EastEnders' 20th anniversary, according to unofficial figures.\n \n Den's death came 16 years after he was supposedly shot in 1989. But he came back to the show in September 2003. The audience for BBC One's one-hour special averaged 13.7 million and peaked at 14.2 million in the last 15 minutes, overnight figures showed. Den died after being confronted by Zoe, Chrissie and Sam in the Queen Vic.\n \n If the ratings are confirmed, the episode will have given the soap its highest audience for a year. The overnight figures showed almost 60% of the viewing public tuned into EastEnders between 2000 and 2100 GMT, leaving ITV1 with about 13%. \"We are very pleased with the figures,\" a BBC spokesman said. \"It shows viewers have really enjoyed the story of Den's demise.\" The show's highest audience came at Christmas 1986, when more than 30 million tuned in to see Den, played by Leslie Grantham, hand divorce papers to wife Angie.\n \n Two years later, 24 million saw him apparently shot by a man with a bunch of daffodils by a canal. More than 16 million viewers watched his return in 2003. The show's ratings have since settled down to about 12 million per episode. Grantham hit the headlines in May after a newspaper printed photographs of him apparently exposing himself via a webcam from his dressing room. He also allegedly insulted four co-stars. He apologised for his \"deplorable actions\" and \"a moment's stupidity\".\n", "llama3.2:1b": "EastEnders' 20-year anniversary marked by 14m viewers. Den Watts' death in 2003 averaged 13.7 million, with peak of 14.2 million. Overnight figures showed almost 60% of viewing public tuned in, with ITV1 having 13%. The show's highest audience came at Christmas 1986, when over 30 million watched Den hand divorce papers to Angie. Grantham's return in 2003 had a similar audience of over 16m.", "llama3.2:3b": "More than 14 million people watched EastEnders' special episode marking the show's 20th anniversary, with 13.7 million viewers on average and a peak of 14.2 million in the last 15 minutes. The episode, which saw Den Watts killed off, would give the soap its highest audience for a year if confirmed.", "gemma2:2b": "Over 14 million people watched the death of Den Watts on EastEnders' 20th anniversary special, making it the show's highest audience in a year. Den died after confronting Zoe, Chrissie, and Sam in the Queen Vic.  The episode averaged 13.7 million viewers, with a peak of 14.2 million in the final minutes. This marks a significant increase from the show's average rating of 12 million per episode. Leslie Grantham who played Den, recently made headlines for controversial actions. \n", "qwen2.5:0.5b": "Dirty Den Watts' 20th anniversary has seen over 14 million people watching the show, according to BBC figures released on Friday. The ratings were higher than ever before, with most viewers tuning in between 20:00 GMT and 3 a.m. GMT.", "qwen2.5:1.5b": "EastEnders' 2015 episode featuring Den Watts' death saw more than 14 million viewers, up from over 30 million in 1986, marking a significant increase in audience interest.", "qwen2.5:3b": "More than 14 million people watched Den Watts' death on EastEnders, marking the show's 20th anniversary. The episode saw an average audience of 13.7 million with a peak of 14.2 million. Den was killed by Zoe, Chrissie, and Sam at the Queen Vic. If confirmed, this would be the highest audience for EastEnders in a year. The show's ratings have generally settled around 12 million per episode.", "opencoder:1.5b": "Dirty Den's death marked EastEnders' 20th anniversary in a show that has seen many episodes since its inception, marking a significant milestone in the world of entertainment. The episode was released on Friday, and it saw almost 14 million viewers watching it at the time. It's been confirmed that the ratings have settled down to about 12 million per episode.\n\nFrom the information provided, it is noted that Den died after being confronted by Zoe, Chrissie, and Sam in a Queen Vic episode. They were part of a group known as EastEnders who played various roles in the show's narrative. The episode was aired on BBC One's one-hour special and had an average audience of about 13.7 million, peaking at 14.2 million in the last 15 minutes.\n\nOn the day of its release, more than 16 million viewers watched him return to see Den in 2003. The show's ratings have since settled down to about 12 million per episode, and it was noted that Grantham hit the headlines in May after he allegedly exposed himself through a webcam from his dressing room.\n\nIn retrospect, it is also noted that Grantham insulted four co-stars and apologized for his \"deplorable actions\" and \"a moment's stupidity\". However, this specific incident seems to have occurred before Grantham was shot or portrayed in the episode. Further speculation may be required to fully understand the character's reactions.\n", "smollm:1.7b": "Dirty Den's demise seen by 14 million people in EastEnders' 20th anniversary episode", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about \"Dirty Den's\" demise on EastEnders. Let me read through it carefully.\n\nThe text mentions that over 14 million people saw the episode Friday, which is its 20th anniversary. They killed him in 1989 but he came back in 2003. The BBC One special had a high rating, averaging around 13.7 million viewers in the last hour, peaking at 14.2 million. He died by being confronted by Zoe, Chrissie, and Sam, the Queen Victoria.\n\nThe text also talks about the ratings for EastEnders between 2000-2025, with almost 60% of viewers tuned in that day, leaving ITV1 at around 13%. It says they're very pleased because viewers liked the story. The highest audience was during Christmas 1986 when more than 30 million watched it.\n\nIn the same year, another episode where Den was apparently shot by someone with daffodils over a canal had nearly 24 million viewers. He came back in 2003 and since then ratings have settled at about 12 million per episode. Leslie Grantham is implicated in both incidents—he allegedly did something bad and insulted others.\n\nSo, the key points are: Den's death on EastEnders' 20th anniversary, his return, the high ratings for the BBC special, the shooting scene, the fact that he was shot again in 2003, the confusion about his past, and how it affected viewers. The text also mentions some controversy around his past actions.\n\nI should make sure to include all these elements but keep it concise without any explanations or formatting. Just plain text.\n</think>\n\nDirty Den's demise on EastEnders' 20th anniversary was revealed by over 14 million viewers, marking the show's anniversary. The episode, featuring Leslie Grantham, began with a high rating of around 13 million viewers in the last hour, peaking at 14.2 million. Den died by being confronted by Zoe, Chrissie, and Sam on Queen Victoria. His return was noted for its high ratings on BBC One, averaging 13.7 million viewers between 2000-2025, with nearly 60% of viewers tuned in that day, leaving ITV1 at around 13%. Another episode where he was apparently shot by someone with daffodils over a canal had 24 million viewers. His return in 2003 was noted for confusion about his past actions and his apparently \"deplorable actions.\"", "tinyllama:1.1b": "EastEnders' audience of over 14 million on Friday, marking the soap's 20th anniversary, saw Den's death officially confirmed. Den Watters appeared in September 2003 after being killed off in 1989. The episode averaged more than 13 million viewers, confirming EastEnders' highest audience of the year and giving ITV1 a run for its money with just under 13% of the audience. However, the show has seen a decline since then, with only 60% of the viewing public tuning in between 2000-2001, leaving it with about 13%. The highest audience came at Christmas 1986 when more than 30 million watched Den's demise.", "tinydolphin:1.1b": " The EastEnders storyline featuring Den Watts saw more than 14 million people see him killed off in a one-hour special, with BBC One's one-hour episode averaging 13.7 million and peaking at 14.2 million viewers, according to overnight figures. If the ratings are confirmed, it could be EastEnders' highest audience for a year. The storyline saw Den die after being confronted by Zoe, Chrissie and Sam in the Queen Vic. The overnight figures showed almost 60% of the audience tuned into the episode between 2000 and 2100 GMT. ITV1 reportedly had about 13%, with EastEnders' highest audience came at Christmas 1986, when more than 30 million viewers saw Den's demise.", "phi:2.7b": " EastEnders fans saw over 14 million viewers watch \"Dirty\" Den Watts killed off on Friday, marking the show's 20th anniversary. The episode had its highest audience since Christmas in 1996, with almost 60% of the viewing public tuning in to see Den's demise after being confronted by his former co-stars in the Queen Vic. \n", "orca-mini:3b": " More than 14 million people saw Den Watts die on Friday, marking EastEnders' 20th anniversary according to unofficial figures. The episode peaked at 14.2 million viewers in the last 15 minutes and had an overnight audience of almost 60%.", "hermes3:3b": "Over 14m watched \"Dirty\" Den Watts' death on EastEnders' 20th anniversary, marking highest audience since 1986.", "stablelm-zephyr:3b": "Over 14 million people watched \"Dirty\" Den Watts' death on EastEnders during its 20th anniversary, marking the highest audience in a year according to unofficial figures. The one-hour special averaged 13.7 million viewers and peaked at 14.2 million in the last 15 minutes. This marked a significant increase from two years prior when 24 million watched the seemingly murderous scene with Den played by Leslie Grantham.", "stablelm2:1.6b": "Over one million viewers watched EastEnders' special episode marking the death of \"Dirty\" Den, who was killed after being confronted by Zoe, Chrissie, and Sam in the Queen Vic. If confirmed as highest viewers for a year, it would be the show's highest audience since 2016. The episode peaked at 2 million viewers with almost 1% of the viewing public tuning in during its time slot. Leslie Grantham played Den until his death in May after allegedly insulting co-stars and appearing naked on webcam from his dressing room, leading to a scandal which caused his exit from the show.", "granite3.1-dense:2b": "Over 14 million viewers tuned in to the 20th anniversary EastEnders episode featuring the death of character Den Watts (played by Leslie Grantham). Den, who had been shot in 1989 and returned in 2003, met his end after confronting Zoe, Chrissie, and Sam at the Queen Vic. This episode marked EastEnders' highest-rated program since its inception, surpassing previous highs set during Christmas 1986 (over 30 million) and 1990 (more than 24 million). The overnight ratings showed nearly 60% of the viewing public watched, leaving ITV1 with about 13%. Despite these impressive figures, Grantham faced controversy in May due to allegations of exposing himself via webcam and insulting co-stars. He later apologized for his actions.", "chatgpt-4o-latest": "More than 14 million viewers watched \"Dirty\" Den Watts' death in EastEnders' 20th-anniversary episode, marking the soap's highest audience in a year. Den, originally thought to have been killed in 1989, returned in 2003 before being confronted and killed by Zoe, Chrissie, and Sam in the Queen Vic. The episode peaked at 14.2 million viewers, with nearly 60% of the TV audience tuning in. EastEnders' highest-ever ratings were in 1986, with over 30 million watching Den serve divorce papers to Angie. Actor Leslie Grantham, who played Den, made headlines in 2004 for a webcam scandal and insulting co-stars, later apologizing for his actions.", "reference": "The show's highest audience came at Christmas 1986, when more than 30 million tuned in to see Den, played by Leslie Grantham, hand divorce papers to wife Angie.The audience for BBC One's one-hour special averaged 13.7 million and peaked at 14.2 million in the last 15 minutes, overnight figures showed.Two years later, 24 million saw him apparently shot by a man with a bunch of daffodils by a canal.More than 16 million viewers watched his return in 2003.The show's ratings have since settled down to about 12 million per episode.More than 14 million people saw \"Dirty\" Den Watts killed off on Friday, marking EastEnders' 20th anniversary, according to unofficial figures.Den's death came 16 years after he was supposedly shot in 1989."}