{"raw_text": "Film row over Pirates 'cannibals'\n \n Plans to portray Dominica's Carib Indians as cannibals in the sequel to hit film Pirates of the Caribbean have been criticised by the group's chief.\n \n Carib Chief Charles Williams said talks with Disney's producers revealed there was \"a strong element of cannibalism in the script which cannot be removed\". The Caribbean island's government said Disney planned to film in Dominica. The Caribs have long denied their ancestors practised cannibalism. Disney was unavailable for comment. \"Our ancestors stood up against early European conquerors and because they stood up...we were labelled savages and cannibals up to today,\" said Mr Williams.\n \n \"This cannot be perpetuated in movies.\" Shooting on the sequel is expected to begin in April, with hundreds of Dominicans applying to be extras in the movie.\n \n About 3,000 Caribs live on the island of Dominica, which has a population of 70,000. Many Caribs were killed by disease and war during colonisation up to the 1600s. Mr Williams said he had received support from indigenous groups around the world in his efforts to have cannibalism references removed from the film. But he admitted there were some members of the Carib council who did not support the campaign. He said some did not \"understand our history, they are weak and are not committed to the cause of the Carib people\". The first Pirates of the Caribbean film took $305m (£162m) at the box office in the US alone. The cast and crew are to work on two sequels back-to-back, with the first to be released in 2006.\n", "llama3.2:1b": "Disney's plans to portray Dominica's Carib Indians as cannibals in a sequel to Pirates of the Caribbean have been criticized by the group's chief. The film is set to begin filming in April and hundreds of Dominicans have applied to be extras. The Caribs have long denied their ancestors practised cannibalism, but said \"this cannot be perpetuated in movies.\" They have received support from indigenous groups around the world, but some members of the council opposed the campaign.", "llama3.2:3b": "Dominica's Carib Indians have criticized plans for a sequel to Pirates of the Caribbean due to its portrayal of their ancestors as cannibals, with chief Charles Williams stating that this \"cannot be perpetuated in movies\" and that they were labeled savages and cannibals by early European conquerors.", "gemma2:2b": "Disney's upcoming \"Pirates of the Caribbean\" sequel plans to depict Carib Indians as cannibals, which has been met with criticism by the Carib chief who says it perpetuates negative stereotypes and historical misinformation. The Caribbean government is participating in filming on Dominica, but the Caribs, having long denied their ancestors practiced cannibalism, are fighting against its portrayal in the film.  Supporters have urged Disney to remove this reference, while some council members remain unconvinced.  \n", "qwen2.5:0.5b": "Caribbean filmmaker Dominick Williams has criticized Disney's plans for its sequel Pirates of the Caribbean, which depicts the Carib Indians as cannibalistic. He alleges that Disney plans to film in Dominica and is unavailable for comment. Williams said cannibalism cannot be perpetuated in movies and he hopes filming will begin in April. About 3,000 Caribs live on the island of Dominica, with many killed by disease and war during colonial rule.", "qwen2.5:1.5b": "Dominica's Carib Indians criticized Disney for portraying them as cannibals in Pirates of the Caribbean sequel; while some support their efforts to have references removed; others do not understand history and oppose campaign.", "qwen2.5:3b": "Plans for a sequel to Pirates of the Caribbean that portrays Dominica's Carib Indians as cannibals have been criticized by the group's chief. Carib Chief Charles Williams claims there was a strong element of cannibalism in the script, which cannot be removed. The Caribbean island's government confirmed Disney planned to film there. Williams argues their ancestors did not practice cannibalism and that this portrayal is incorrect. About 3,000 Caribs live on Dominica, many descendants of those who survived colonial diseases and wars up to the 1600s. Some Carib council members oppose the removal of cannibalism references from the film. The first Pirates of the Caribbean film grossed $305m in the US alone; sequels are planned for release back-to-back, with the first set for 2006.", "opencoder:1.5b": "The main idea in the text is about the Cannibalism within Disney and Carib islands. Disney's plan to have cannibalism references removed from the film is critiqued by the Caribians, who have denied their ancestors had practised cannibalism. The Carib Islands, which are known for their extreme diet, have also shown strong reservations about the idea of cannibalism in movies.\n", "smollm:1.7b": "The summary should preserve the key ideas and details of the original text while omitting unnecessary information such as explanations, formatting, or reasoning processes. Here's how you can do it:\n\n1. Read the original text carefully and identify the main ideas and supporting details.\n2. Determine what is essential to understanding the context and meaning of the text.\n3. Use clear and concise language to convey the same information in a different format.\n4. Omit any unnecessary information, such as explanations or formatting.\n5. Ensure that the summary remains faithful to the original tone, style, and content.\n\nHere's an example of how you can summarize the text:\n\nFilm row over Pirates 'cannibals'\n\nThe plans to portray Dominica's Carib Indians as cannibals in the sequel to hit film Pirates of the Caribbean have been criticized by the group's chief.\n\nCarib Chief Charles Williams said talks with Disney's producers revealed there was \"a strong element of cannibalism in the script which cannot be removed\". The Caribbean island's government said Disney planned to film in Dominica. The Caribs have long denied their ancestors practised cannibalism. Disney was unavailable for comment. \"Our ancestors stood up against early European conquerors and because they stood up...we were labelled savages and cannibals up to today,\" said Mr Williams.\n\nAbout 3,000 Caribs live on the island of Dominica, which has a population of 70,000. Many Caribs were killed by disease and war during colonisation up to the 1600s. Mr Williams said he had received support from indigenous groups around the world in his efforts to have cannibalism references removed from the film. But he admitted there were some members of the Carib council who did not support the campaign. He said some did not \"understand our history, they are weak and are not committed to the cause of the Carib people\". The first Pirates of the Caribbean film took $305m (£162m) at the box office in the US alone. The cast and crew are to work on two sequels back-to-back, with the first to be released in 2006.\n\nIn this summary, we preserve the key ideas and details of the original text while omitting unnecessary information such as explanations or formatting. We also ensure that the summary remains faithful to the tone, style, and content of the original text.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about a movie script involving Carib Indians from Dominica. Let me read through it carefully.\n\nThe main point seems to be criticism of a sequel plan for \"Pirates of the Caribbean.\" The film's director is planning to portray Dominicans as cannibals, which has been criticized because it contains elements that shouldn't be there. \n\nMr. Charles Williams from Carib Roots mentioned talks with Disney revealed cannibalism in the script. He also says that the Caribbean government wants to film in Dominica but can't due to historical context. The Caribs have denied cannibalism, and Williams believes they should remove references.\n\nThere's a push for the script to be removed from movies, starting shooting around April with many Dominicans applying as extras. Some indigenous groups support the plan, while others don't. \n\nThe first movie made $305 million in the US alone, and there are plans for two sequels back-to-back. The goal is to preserve independence and identity in future films.\n\nI need to make sure I include all these key points: criticism of cannibalism references, intent behind the plan, support from indigenous groups, lack of funding, etc.\n</think>\n\nFilm row over Pirates 'cannibals'  \nPlans to portray Dominicans as cannibals for a sequel film were criticized for containing cannibalism. Mr. Williams noted that plans aim to show Caribs as cannibals but have been blocked by the Caribbean government and Disney due to historical context.", "tinyllama:1.1b": "Film row over Pirates 'cannibal's'\n\nPlan to portray Dominica's Carib Indians as cannibal in hit film Pirates of the Caribbean has been criticized by Carib Chief Charles Williams, who claims there is a \"strong element of cannibalism\" in the script that cannot be removed. The Carib chief said talks with Disney's producer revealed the filmmakers were planning to film in Dominica, which the Caribs have long denied practicing cannibalism. Disney was unavailable for comment, but a spokesperson for the movie studio confirmed there would be extra Dominicans in the sequel, estimated to begin shooting in April with 3,000 Caribs living on the island of Dominica. A group of indigenous groups around the world have supported Williams' campaign to have cannibalism references removed from the film, but he acknowledged there were some members who did not understand their history or were \"weak and are not committed to the cause of the Carib people\". The first Pirates of the Caribbean movie took $305m in US box office revenue alone, and the cast and crew will work on two sequels back-to-back with the first set for release in 2006.", "tinydolphin:1.1b": " Summary:\nA group of Carib Chiefs is reportedly upset about a new script by Disney's producers for the Pirates of the Caribbean sequel. The film will portray them as cannibals, with the Caribbean island's government stating that Disney planned to film in Dominica. The Caribs have long denounced their ancestors for practicing cannibalism and say the movie's script contains a strong element of this. Disney has not commented on the matter, but Carib Chief Williams says the cannibalism reference is unfortunate and should be removed from the film. The first Pirates of the Caribbean film was successful with $305m in revenue, which made it the 17th highest-grossing movie of all time.", "phi:2.7b": " Disney's plans to portray Dominica' s Carib Indians as cannibals in their Pirates of the Caribbean sequel have been criticized by the Carib Chief Charles Williams who revealed talks with the producers revealed a \"strong element\" of cannibalism in the script which could not be removed. The government of Dominica said Disney planned to film there and that shooting on the sequel was expected to begin in April, with hundreds of Dominicans applying to be extras. Mr Williams criticized that depicting Caribs as cannibals in movies would perpetuate the false history that has been perpetuated against them for centuries.\n", "orca-mini:3b": " Plans to depict Dominica's Carib Indians as cannibals in the sequel to hit film Pirates of the Caribbean have been criticised by the group's chief. The Caribbean island's government said Disney planned to film in Dominica. The Caribs have long denied their ancestors practised cannibalism. Disney was unavailable for comment. \"Our ancestors stood up against early European conquerors and because they stood up...we were labelled savages and cannibals up to today,\" said Mr Williams.", "hermes3:3b": "Pirates sequel criticizes portrayal of Carib Indians as cannibals, despite script containing element; Caribs deny ancestors practiced cannibalism; sequel expected to film in Dominica April, drawing extras from local population.", "stablelm-zephyr:3b": "Disney's plan to depict Dominica's Carib Indians as cannibals in the sequel to Pirates of the Caribbean has been criticized by the group's chief, who claims there is a strong element of cannibalism in the script that cannot be removed. The Caribbean island's government confirms Disney will film in Dominica, and hundreds of Dominicans have applied to be extras in the movie. The Caribs denied their ancestors practiced cannibalism and Mr. Williams received support from indigenous groups worldwide for his campaign to remove the references. However, some members of the Carib council did not support the cause due to a lack of understanding or commitment to the Carib people's history.", "stablelm2:1.6b": "Dominica's Carib Indians will portray cannibalism in the Pirates of the Caribbean sequel due to script elements revealed by Disney producers; however, local leaders object as it perpetuates negative colonial labels. The film is expected to begin shooting in April, while around 3,0 CAribs live on Dominica with many killed during colonization up to the present day. Indigenous groups worldwide have supported efforts to remove cannibalism references but acknowledge challenges from some Carib council members. The first Pirates of the Caribbean made $16 million globally; a second sequel is scheduled for release in 2017.", "granite3.1-dense:2b": "Discussions between Disney producers and Dominica's Carib Indian chief, Charles Williams, regarding the film sequel to Pirates of the Caribbean have sparked controversy due to proposed portrayals of cannibalism in the script. Chief Williams asserts that such depictions cannot be removed, citing historical stereotypes as savages and cannibals. Despite this, about 3,000 Carib people live on Dominica, a nation of 70,000 inhabitants. The first Pirates film earned $305m (£162m) in the US alone. Shooting for the sequel is set to start in April, with many locals applying as extras. Chief Williams reports receiving international support for his campaign against cannibalism references but acknowledges internal resistance within the Carib council who lack understanding of their history or commitment to the cause.", "chatgpt-4o-latest": "Carib Chief Charles Williams has criticized Disney's plans to depict Dominica's Carib Indians as cannibals in the sequel to Pirates of the Caribbean, arguing that this perpetuates a false stereotype rooted in colonial history. Despite discussions with Disney, the references to cannibalism remain in the script. The Caribs have long denied their ancestors practiced cannibalism, and Williams has received support from indigenous groups worldwide in his efforts to have the portrayal removed. However, some members of the Carib council do not support the campaign. Filming is set to begin in April, with many Dominicans applying as extras. Disney has not commented on the controversy.", "reference": "Carib Chief Charles Williams said talks with Disney's producers revealed there was \"a strong element of cannibalism in the script which cannot be removed\".The Caribbean island's government said Disney planned to film in Dominica.Plans to portray Dominica's Carib Indians as cannibals in the sequel to hit film Pirates of the Caribbean have been criticised by the group's chief.Mr Williams said he had received support from indigenous groups around the world in his efforts to have cannibalism references removed from the film.The first Pirates of the Caribbean film took $305m (£162m) at the box office in the US alone.He said some did not \"understand our history, they are weak and are not committed to the cause of the Carib people\"."}