{"raw_text": "Aviator 'creator' in Oscars snub\n \n The man who said he got Oscar-nominated movie The Aviator off the ground and signed up Leonardo DiCaprio has been shut out of the Academy Awards race.\n \n Charles Evans Jr battled over his role with the people who eventually made the film, and won a producer's credit. But he is not on the list of producers who can win a best film Oscar due to a limit on the number of nominees. The Oscars organisers have picked two of The Aviator's four producers to be nominated for best film.\n \n Up to three producers can be named per film but the studios behind The Aviator and Million Dollar Baby failed to trim their credits - so the Academy of Motion Pictures Arts and Sciences (Ampas) has done it for them. The Aviator's nominated producers are Michael Mann and Graham King - with Mr Evans and Sandy Climan, Mr Mann's former deputy, left off. Mr Evans sued Mr Mann in 2001, claiming he came up with the idea, spent years developing it and persuaded DiCaprio to play Hughes - but said he was later excluded from the project. The two sides settled out of court in a deal that has remained secret apart from the fact Mr Evans' name has appeared as a producer when the film's credits roll. At the Golden Globes, Mr Evans - who was named among the winners when the film won best drama film - evaded a security guard to have his photo taken with DiCaprio, director Martin Scorsese, Mr Mann and Mr King.\n \n Ampas decided to limit the number of producers who could be nominated after Shakespeare in Love's victory in 1999 saw five producers collect awards. The eligible names for The Aviator and Million Dollar Baby were decided by Ampas' producers branch executive committee on Wednesday. The decision also saw Clint Eastwood get his third personal nomination for Million Dollar Baby. He is now named in the best film category as well as being nominated for best director and best lead actor. The Academy Awards ceremony will be held in Hollywood on 27 February. Chinese actress Ziyi Zhang, star of Crouching Tiger, Hidden Dragon, Hero and House of Flying Daggers, is the latest name to be added to the list of presenters on the night.\n", "llama3.2:1b": "Charles Evans Jr was nominated for producer of The Aviator but did not receive an Oscar. He sued Michael Mann in 2001 after being excluded from the project.", "llama3.2:3b": "Charles Evans Jr was not nominated for Best Picture due to a limit on producers, with Michael Mann and Graham King being instead chosen along with another producer.", "gemma2:2b": "Charles Evans Jr., who contributed significantly to the production of The Aviator, was not nominated for a best film Oscar despite his producer credit. Two producers from the film (Michael Mann and Graham King) were chosen to be listed as nominees.  The Academy of Motion Pictures Arts and Sciences limited the number of producers eligible for nomination after a previous instance where five producers won awards for the same film. \n", "qwen2.5:0.5b": "The Aviator's producer Michael Mann has been excluded from the best film Oscar race after he sued him over his involvement in The Aviator. The Academy of Motion Picture Arts and Sciences (Ampas) have decided to limit the number of producers who can be nominated for Best Film, having already chosen two producers for the film based on their production credits.\nSome key points:\n- Charles Evans Jr battled with the people who eventually made \"The Aviator\" in a producer's credit dispute.\n- While Michael Mann was one of the nominees in Best Director, he has been excluded from the top three producers who can win the best film Oscar due to the limit on the number of nominees.\n- The Academy of Motion Picture Arts and Sciences (Ampas) made this decision after choosing two producers for the film based on their production credits.\n- Michael Mann was named among the winners at the Golden Globes when \"The Aviator\" won, but he left his name off the films' nominations.\n- The Academy Awards ceremony will be held in Hollywood on February 27th.", "qwen2.5:1.5b": "Charles Evans Jr., who produced The Aviator despite being excluded from nominations for Best Film at the Oscars, was shut out of this year's Academy Awards. The limit of three producers per film applies but did not include his production credit, leading to a lack of nominees from him and Sandy Climan.", "qwen2.5:3b": "Charles Evans Jr., who claimed producer credit for 'The Aviator' but not a nomination due to Academy Awards rules limiting producers to two per film, was shut out despite his claims and legal dispute with director Michael Mann. The nominees for Best Film include Michael Mann and Graham King, while Charles Evans Jr. was left off the list after he sued Mann over credits. The decision stems from Ampas' response to 'Shakespeare in Love's' five producer nominations in 1999.", "opencoder:1.5b": "\"The man who said he got Oscar-nominated movie The Aviator off the ground and signed up Leonardo DiCaprio has been shut out of the Academy Awards race.\" \nThe man who won an Oscar nomination for a movie by signing up with Leonardo DiCaprio.\nThe Oscars organisers have picked two of The Aviator's four producers to be nominated for best film.\nThe two actors chosen for this project are Michael Mann and Graham King. Mr Mann and Sandy Climan, the former and latter, were excluded from the project due to their roles in the development and execution of The Aviator.\nAmpas has decided to limit the number of nominees after Shakespeare's victory, allowing only five producers to be nominated.\nThe Academy Awards ceremony will be held in Hollywood on 27 February. \nZiyi Zhang, the latest name to be added to the list of presenters on the night is now the winner of the Oscar-nominated movie The Aviator by a sum of money, not through any other means than through the nomination process.\n", "smollm:1.7b": "The Aviator 'creator' in Oscars snub", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Charles Evans Jr.'s case with the Oscars. The user wants a concise summary that preserves key ideas and details. Let me read through each section carefully.\n\nFirst, it mentions that Aviator's creator is in Oscar but was snubbed. That means he got the movie made but didn't win an award because of some limits. \n\nThen, it talks about Charles Evans, his role with Leonardo DiCaprio, and how he had to fight for the credits. He also lost out on certain producers' credits because of the limit, so Ampas couldn't go after him.\n\nI should note that Ampas can't win multiple awards due to the same rule. The Aviator's producers were Michael Mann and Graham King, but Evan Evans left in 2001 over ideas and development, which led to a court deal with no press coverage yet. \n\nThe lawsuit was between Mann and Evans, evading security, leading to DiCaprio and Mann going together. The film won Best Drama but got other awards too, like Best Director and Best Lead Actor.\n\nThe ceremony is in Hollywood on February 27. Ziyi Zhang has joined as another nominee, which shows some diversification in the nominations.\n\nI need to make sure all these points are covered succinctly without any extra details. Keep it clear and to the point.\n</think>\n\nCharles Evans Jr., who signed up Leonardo DiCaprio for *The Aviator*, was excluded from a court deal due to a lack of press coverage. The film was made, but Ampas could not win multiple awards because it faced a limit on producers' credits. Michael Mann and Graham King were the original producers, but Mr. Evans left in 2001 over his role. A lawsuit settled out of court with DiCaprio and Mann, earning both Best Drama and Best Director awards. The ceremony is set for Hollywood February 27. Ziyi Zhang has added to the nominations as another nominee.", "tinyllama:1.1b": "In a snub that left Oscar-nominee movie \"The Aviator\" out in the cold, Charles Evans Jr was not included among the producer credits. Despite two producers being named by Academy of Motion Picture Arts and Sciences (Ampas) after it selected two out of their four credits, producer Michael Mann and his former deputy Graham King were left off the list. DiCaprio's co-star in the film, Leonardo DiCaprio, was nominated for a best actor award at the Golden Globes but was not named among the winners for best drama film. Sharing the limelight with DiCaprio and his supporting cast members - Emma Thompson, Antonio Banderas, Angelina Jolie, and Kate Hudson, was the two-time nominee Clint Eastwood, who also received a nomination for best director and best lead actor in Million Dolar Baby. The 82nd Academy Awards ceremony will be held on February 27th in Hollywood, where Zheng Zhongwei from China's \"Crouching Tigers, Hi-Graffiti\" will present along with DiCaprio and his castmates.", "tinydolphin:1.1b": " A producer in a movie like The Aviator has to deal with two main issues: managing the budget, and creating an engaging plot that keeps viewers interested. The film's producers, Michael Mann and Graham King, have been named as part of the nominated list for best film Oscar. However, they have not been involved in any credits for their work on the movie, and it seems there has been a power struggle between Charles Evans Jr and the people behind the film. This has led to The Aviator being snubbed from the prestigious awards race.", "phi:2.7b": " Charles Evans Jr, who co-created and produced The Aviator with Michael Mann and Graham King, was snubbed from being nominated for an Oscar in any category this year due to a limit of three producers per film.\n", "orca-mini:3b": " The Aviator 'creator' in Oscars snub as producer Charles Evans Jr battles for credit but is excluded from best film nominations due to a limit on the number of nominees. Michael Mann and Graham King are nominated for best film, with The Aviator's producers being named as Mr Evans and Sandy Climan. Charles Evans sued Michael Mann in 2001, claiming he came up with the idea, spent years developing it and persuaded Leonardo DiCaprio to play Hughes but was later excluded from the project.", "hermes3:3b": "Aviator creator Charles Evans Jr excluded from Oscars as producers limited to 2 out of film's 4.", "stablelm-zephyr:3b": "Charles Evans Jr., who played a pivotal role in producing the Oscar-nominated movie The Aviator and secured Leonardo DiCaprio's involvement, was not considered for a best film Oscar due to the limitation on the number of nominees from each film. The Oscars organizers picked two producers from The Aviator's four producers for the best film category. Although Evans Jr.'s contribution went beyond just winning a producer credit, he wasn't among the limited pool of up to three producers allowed per film. This decision was made due to the five producers who won awards in 1999 because of Shakespeare in Love. In addition to The Aviator's nominated producers Michael Mann and Graham King, Evans Jr. and Sandy Climan were left out. An undisclosed court settlement between Evans Jr. and Mann ended their legal conflict in 2001, with Evans receiving a producer credit for the film. This year's Academy Awards ceremony will be held on February 27th, and notable presenter, Chinese actress Ziyi Zhang, has been added to the list of attendees.", "stablelm2:1.6b": "Charles Evans Jr, a key figure behind the Oscar-nominated film The Aviator, was excluded from the Academy Awards producers list due to a limit on nominees set by the Academy of Motion Picture Arts and Sciences. Although he secured a producer's credit, two out of four producers were chosen by Ampas for their best film category. Despite being named among winners at the Golden Globes, Mr. Evans avoided the limelight during the Oscars ceremony as his name was not included in the list of eligible producers. However, he managed to secure a personal nomination for Million Dollar Baby, Clint Eastwood's film.", "granite3.1-dense:2b": "Charles Evans Jr., a key figure in The Aviator's development who secured Leonardo DiCaprio for the role, was excluded from the 2002 Oscar nominations due to the Academy's limit on producer nominees (up to three per film). Despite his contributions and legal settlement with Michael Mann, Evans' name was not included among the four producers. Instead, Michael Mann and Graham King were nominated. This decision aimed to prevent an oversaturation of nominations, similar to Shakespeare in Love's 1999 win with five producers. Clint Eastwood received additional nominations for best film, director, and lead actor due to his role in Million Dollar Baby. The Academy Awards ceremony will take place on February 27, featuring presenters including Ziyi Zhang.", "chatgpt-4o-latest": "Charles Evans Jr., who claimed to have initiated The Aviator and secured Leonardo DiCaprio for the lead role, has been excluded from the Academy Awards nominations due to a limit on the number of producers eligible for the Best Film Oscar. Despite winning a producer's credit after a legal battle, only Michael Mann and Graham King were selected as nominees, leaving Evans and Sandy Climan out. The Academy imposed this restriction after past controversies over excessive producer credits. Evans previously sued Mann, alleging he was sidelined from the project, but they settled out of court. The Oscars ceremony will take place on 27 February, with Clint Eastwood receiving multiple nominations for Million Dollar Baby and Ziyi Zhang announced as a presenter.", "reference": "Up to three producers can be named per film but the studios behind The Aviator and Million Dollar Baby failed to trim their credits - so the Academy of Motion Pictures Arts and Sciences (Ampas) has done it for them.At the Golden Globes, Mr Evans - who was named among the winners when the film won best drama film - evaded a security guard to have his photo taken with DiCaprio, director Martin Scorsese, Mr Mann and Mr King.The Oscars organisers have picked two of The Aviator's four producers to be nominated for best film.But he is not on the list of producers who can win a best film Oscar due to a limit on the number of nominees.Ampas decided to limit the number of producers who could be nominated after Shakespeare in Love's victory in 1999 saw five producers collect awards.The Aviator's nominated producers are Michael Mann and Graham King - with Mr Evans and Sandy Climan, Mr Mann's former deputy, left off."}