{"raw_text": "Stars pay tribute to actor Davis\n \n Hollywood stars including Spike Lee, Burt Reynolds and Oscar nominee Alan Alda have paid tribute to actor Ossie Davis at a funeral in New York.\n \n Veteran star Ossie Davis, a well-known civil rights activist, died in Miami at the age of 87 on 4 February 2005. Friends and family, including actress Ruby Dee his wife of 56 years, gathered at the Riverside Church on Saturday. Also present at the service was former US president Bill Clinton and singer Harry Belafonte, who gave the eulogy. \"He would have been a very good president of the United States,\" said Mr Clinton. \"Like most of you here, he gave more to me than I gave to him.\"\n \n The 87-year-old was found dead last weekend in his hotel room in Florida, where he was making a film. Police said that he appeared to have died of natural causes. Davis made his acting debut in 1950 in No Way Out starring Sidney Poiter. He frequently collaborated with director Spike Lee, starring in seven Lee films including Jungle Fever, Do The Right Thing and Malcolm X. Attallah Shabazz, the daughter of activist Malcolm X, recalled the famous eulogy delivered by Davis at her father's funeral. \"Harlem has come to bid farewell to one of its finest hopes,\" she said, quoting the man she knew as Uncle Ossie. \"Ditto.\" \"Ossie was my hero, and he still is,\" said Aviator star Alan Alda, a family friend for over forty years. \"Ossie was a thing of beauty.\"\n \n \"I want so badly someday to have his dignity - a little of it anyway,\" added Burt Reynolds, Davis's co-star in the 90s TV comedy Evening Shade. Before the midday funeral, scores of Harlem residents formed a queue outside the church to pay their respects to Davis. \"It is hard to fathom that we will no longer be able to call on his wisdom, his humour, his loyalty and his moral strength to guide us in the choices that are yet to be made and the battles that are yet to be fought,\" said Belafonte, himself an ardent civil rights activist who had been friends with Davis for over 60 years. \"But how fortunate we were to have him as long as we did.\"\n", "llama3.2:1b": "Stars including Spike Lee, Burt Reynolds, and Oscar nominee Alan Alda pay tribute to actor Ossie Davis at his funeral in New York. He died on February 4, 2005, after being found dead in his hotel room in Florida. Friends and family gave eulogies, praising his acting career, activism, and legacy as a civil rights icon.", "llama3.2:3b": "Ossie Davis, actor and civil rights activist, died at 87 on February 4, 2005, in Miami from natural causes. Stars including Spike Lee, Burt Reynolds, Alan Alda, Ruby Dee, Bill Clinton, and Harry Belafonte paid tribute to him at his funeral in New York.", "gemma2:2b": "Ossie Davis, a civil rights activist and acclaimed actor, died at age 87 on February 4th, 2005.  He was remembered fondly by numerous Hollywood stars, including Spike Lee, Burt Reynolds, and Alan Alda.  Bill Clinton and Harry Belafonte delivered eulogies, praising Davis's contributions to the US and his legacy of influence within the Harlem community. Many attendees gathered at the Riverside Church for the funeral, paying tribute to Davis's impact on both entertainment and social change. \n", "qwen2.5:0.5b": "Ossie Davis, a famous actor from the Civil Rights Movement, died at 87 in Florida on February 4, 2005. Friends and family gathered at the Riverside Church for his funeral service with Ossie's wife Ruby Dee. He was known for making films like No Way Out and Jungle Fever and had a long career as a film actor. Burt Reynolds said he wanted to have \"a little of it\" on his behalf, adding that Ossie was a \"thing of beauty.\" Many people mourned the loss of this talented actor who would have been a good president if he were alive.", "qwen2.5:1.5b": "Hollywood stars paid tribute to Ossie Davis at his funeral in New York, the veteran actor died on February 4th, 2005, making Spike Lee a co-star of seven movies including Jungle Fever. Belafonte gave the eulogy and described him as \"a thing of beauty\". The service was attended by Ruby Dee, Bill Clinton, Harry Belafonte, Alan Alda, Burt Reynolds, Attallah Shabazz, Spike Lee, and other notable figures who appreciated Davis's contributions to civil rights.", "qwen2.5:3b": "Hollywood stars such as Spike Lee, Burt Reynolds, and Oscar nominee Alan Alda paid tribute to actor Ossie Davis at his funeral in New York. At 87, Davis was a well-known civil rights activist who made his debut in 1950. He frequently collaborated with director Spike Lee on films like Jungle Fever, Do The Right Thing, and Malcolm X. Davis's wife Ruby Dee and other family members including Attallah Shabazz, the daughter of civil rights leader Malcolm X, also attended the service. Recalling Davis' influential eulogy at Malcolm X's funeral, former US President Bill Clinton praised him as a potential president and said he gave more to Clinton than Clinton gave back. Davis' close friend and co-star in Evening Shade, Burt Reynolds, expressed his admiration for Davis by calling him a \"thing of beauty.\" Davis is remembered for his wisdom, humor, loyalty, and moral strength, and his contributions to civil rights activism.", "opencoder:1.5b": "Stars pay tribute to actor Ossie Davis at a funeral in New York. Ossie Davis, a well-known civil rights activist, died last weekend in Miami on her father's side. Ruby Dee his wife had gathered at the Riverside Church and she gave the eulogy. She said, \"He would have been a very good president of the United States like most of you here he gave more to me than I gave to him.\" The 87-year-old was found dead in a hotel room where he made a film. The eulogy he received at her father's funeral was an iconic one, and the man she knew as Uncle Ossie also recalls it. It's important to remember that Davis is remembered for his acting debut, which helped him understand the complexities of American culture.\n", "smollm:1.7b": "The following summary captures the key ideas and details of the text:\n\n1. The article highlights the tributes paid to actor Ossie Davis at a funeral in New York, including his legacy as a civil rights activist and his work with Spike Lee.\n2. The article also mentions that Ossie Davis died on 4 February 2005 and was found dead last weekend in his hotel room in Florida.\n3. The text emphasizes the importance of Ossie Davis's contributions to the Civil Rights Movement, including his role as a co-star with Spike Lee in the 1970s TV comedy Evening Shade.\n4. The article quotes several people who were close to Ossie Davis, including actor Alan Alda and civil rights activist Malcolm X.\n5. The text also mentions that Ossie Davis was a beloved figure in Harlem and that his legacy will continue to inspire future generations of activists and artists.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text about Ossie Davis's funeral. First, I'll read through the text carefully.\n\nThe main points are: Ossie Davis died in Miami on February 4, 2005, at 87. He was a civil rights activist and actor. There were guest speakers like Bill Clinton and Harry Belafonte. A lot of people attended the service with actors and friends, including Alan Alda. The tribute mentioned his legacy, especially to a friend named Uncle Ossie Shabazz.\n\nI should include all these details but keep it concise. I'll make sure not to explain anything, just present the key ideas in plain text.\n</think>\n\nOssie Davis, a civil rights activist and actor, passed away at 87 in Miami on February 4, 2005. He was honored during a funeral attended by actor Burt Reynolds, former star Spike Lee, performer Harry Belafonte, and other friends. Davis made his debut in No Way Out in 1950 and appeared in several Lee films. His legacy includes quotes from fans like Belafonte, who recalled a famous eulogy delivered by Davis at Uncle Ossie's funeral.", "tinyllama:1.1b": "The Hollywood community has paid tribute to actor Osie Davis in a funeral service held at the Riverside Church on Saturday, attended by friends and family, including actress Ruby Dee, former US president Bill Clinton and singer Harry Belafonte. The 87-year-old, who made his acting debut in No Way Out in 1950, appeared to have died of natural causes. Many believed that Davis was Uncle Ossei, the great hope of Harlem, and a civil rights activist. Davis' funeral drew thousands of mourners, including actresses Audra McDonald and Tessa Virtue, who paid tribute to him as a person who had made an immense impact on their lives, and activists, including actor Burton Reynolds, who said he wished to have his dignity, even if it meant losing some of it.", "tinydolphin:1.1b": " The text you provided is a brief summary of the information given. It talks about Ossie Davis, an actor and activist, who passed away at age 87. His friends and family gathered for a funeral in New York to pay tribute to him. The eulogy was given by former US President Bill Clinton and singer Harry Belafonte. The text does not mention any significant events or developments from the original passage.", "phi:2.7b": " The text is a tribute to actor Ossie Davis, who passed away at the age of 87. Many notable figures in the entertainment industry paid their respects to him at his funeral, including Spike Lee, Burt Reynolds, Alan Alda, and Harry Belafonte. Davis was a well-known civil rights activist and appeared in several films with director Spike Lee, including Malcolm X and Do The Right Thing. His eulogy at the funeral was delivered by several of his friends, including Aviator star Alan Alda and former US president Bill Clinton. Harlem residents also formed a queue to pay their respects to Davis.\n", "orca-mini:3b": " Hollywood stars including Spike Lee, Burt Reynolds and Oscar nominee Alan Alda paid tribute to Ossie Davis at a funeral in New York. The 87-year-old actor died in Florida after being found dead in his hotel room last weekend. Police said that he appeared to have died of natural causes. Davis made his acting debut in 1950 in No Way Out starring Sidney Poiter and frequently collaborated with director Spike Lee, starring in seven Lee films including Jungle Fever, Do The Right Thing and Malcolm X. Attallah Shabazz, the daughter of activist Malcolm X, recalled the famous eulogy delivered by Davis at her father's funeral. \"It is hard to fathom that we will no longer be able to call on his wisdom, his humour, his loyalty and his moral strength to guide us in the choices that are yet to be made and the battles that are yet to be fought,\" said Belafonte, himself an ardent civil rights activist who had been friends with Davis for over 60 years.", "hermes3:3b": "Hollywood stars tribute actor Ossie Davis at New York funeral after his death at age 87 on 4th Feb 2005.", "stablelm-zephyr:3b": "Hollywood stars like Spike Lee, Burt Reynolds, and Alan Alda attended the funeral of actor Ossie Davis in New York, who passed away at 87 on February 4, 2005. Davis was a well-known civil rights activist and had an illustrious acting career that began in 1950 with the film \"No Way Out.\" He frequently collaborated with director Spike Lee and starred in seven of his films. Family friends like Alan Alda paid tribute to Davis as a hero and a guiding figure in their lives, while former US president Bill Clinton commended him as someone who could have been a great president. The funeral service also welcomed Ruby Dee, Davis's wife for 56 years, and civil rights activist Harry Belafonte, who delivered an emotional eulogy honoring the late actor. Many Harlem residents formed a queue outside the church to pay their respects to Davis before his passing.", "stablelm2:1.6b": "Hollywood stars pay tribute to actor Ossie Davis at a funeral in New York following his death. Ossie, a civil rights activist and well-known star, died on February 4th at the age of 67. His nephew Alan Alda and other friends and family members attended the service at Riverside Church where Bill Clinton spoke about Davis as a \"very good president of the United States.\" Known for his acting debut in No Way Out and frequent collaborations with director Spike Lee, Ossie was found dead last weekend in his hotel room due to natural causes. Harlem residents formed a queue outside the church to pay their respects.", "granite3.1-dense:2b": "Hollywood stars, including Spike Lee, Burt Reynolds, and Oscar nominee Alan Alda, honored the late actor Ossie Davis at his funeral in New York. Davis, a prominent civil rights activist and 87-year-old veteran, died on February 4, 2005, from natural causes while filming in Miami. His wife of 56 years, Ruby Dee, was present at the service along with former US President Bill Clinton and singer Harry Belafonte, who delivered a eulogy highlighting Davis's potential as a president.\n\nDavis began his acting career in 1950 and collaborated frequently with director Spike Lee, appearing in films like Jungle Fever, Do The Right Thing, and Malcolm X. His famous daughter, Attallah Shabazz, recalled a moving eulogy delivered at her father's funeral by Davis. Aviator star Alan Alda expressed his admiration for Davis as \"a thing of beauty\" and aspired to emulate some of his qualities. Burt Reynolds called Davis his hero.\n\nBefore the service, Harlem residents formed a line outside the church to pay their respects. Harry Belafonte, an ardent civil rights activist and friend of Davis for over 60 years, delivered a poignant tribute, acknowledging the profound impact Davis had on his life and lamenting that Harlem would no longer benefit from his wisdom, humor, loyalty, and moral strength.", "chatgpt-4o-latest": "Hollywood stars, politicians, and civil rights activists gathered in New York to pay tribute to actor and activist Ossie Davis, who died at 87 on February 4, 2005. The funeral at Riverside Church was attended by his wife Ruby Dee, former President Bill Clinton, and singer Harry Belafonte, who delivered the eulogy. Davis, known for his civil rights work and collaborations with Spike Lee, was remembered by figures like Alan Alda, Burt Reynolds, and Malcolm X’s daughter, Attallah Shabazz. Clinton praised Davis’s leadership, while Belafonte highlighted his wisdom and moral strength. Harlem residents also lined up to honor him.", "reference": "\"Ossie was my hero, and he still is,\" said Aviator star Alan Alda, a family friend for over forty years.Hollywood stars including Spike Lee, Burt Reynolds and Oscar nominee Alan Alda have paid tribute to actor Ossie Davis at a funeral in New York.Veteran star Ossie Davis, a well-known civil rights activist, died in Miami at the age of 87 on 4 February 2005.\"Ossie was a thing of beauty.\"\"It is hard to fathom that we will no longer be able to call on his wisdom, his humour, his loyalty and his moral strength to guide us in the choices that are yet to be made and the battles that are yet to be fought,\" said Belafonte, himself an ardent civil rights activist who had been friends with Davis for over 60 years.Also present at the service was former US president Bill Clinton and singer Harry Belafonte, who gave the eulogy.He frequently collaborated with director Spike Lee, starring in seven Lee films including Jungle Fever, Do The Right Thing and Malcolm X. Attallah Shabazz, the daughter of activist Malcolm X, recalled the famous eulogy delivered by Davis at her father's funeral.\"Harlem has come to bid farewell to one of its finest hopes,\" she said, quoting the man she knew as Uncle Ossie."}