{"raw_text": "Berlin applauds Hotel Rwanda\n \n Political thriller Hotel Rwanda was given a rousing reception by spectators at the Berlin Film Festival on Saturday.\n \n The movie's star Don Cheadle also received a standing ovation when he stepped onto the stage after the show. The film is the true story of the hotel manager who saved 1,200 Tutsis from death during the Rwandan genocide. The film, showing out of competition in Berlin, is nominated for three Oscars, including best actor for Cheadle. Sophie Okonedo, who plays Cheadle's wife Tatiana, is nominated for best supporting actress. The film is also in the running for best original screenplay. Cheadle, was joined on stage at Berlin by Paul Rusesabagina, the hotel manager he plays in the film, Mr Rusesabagina's wife and his extended family, who fled Rwanda and now live in Belgium. Mr Rusesabagina used his influence as a prominent Hutu businessman to shelter potential victims of the Rwandan genocide, contacting dignitaries including Bill Clinton, the King of Belgium as well as the French foreign ministry. Hotel Rwanda is one of two films addressing the genocide at the 55th Berlin Film Festival, which runs until 20 February. Sometimes in April is a feature by Raoul Peck competing for the festival's coveted Golden and Silver Bear awards. The film was made exclusively in Rwanda whereas Hotel Rwanda was shot mostly in South Africa, with some scenes made in Kigali.\n", "llama3.2:1b": "Berlin Film Festival receives positive response to Hotel Rwanda. Movie received standing ovation from spectators and won several awards including Oscars. Don Cheadle won a standing ovation for his performance as hotel manager who saved 1,200 Tutsis during the Rwandan genocide. The film is also nominated for three Oscars.", "llama3.2:3b": "Hotel Rwanda received a standing ovation at Berlin Film Festival, where star Don Cheadle also got applause. The movie is about a hotel manager who saved 1,200 Tutsis from the Rwandan genocide and is nominated for three Oscars. Paul Rusesabagina, the hotel manager, attended with his family, including his wife and extended family who fled Rwanda.", "gemma2:2b": "Hotel Rwanda received enthusiastic reception at the Berlin Film Festival.  The movie stars Don Cheadle as Paul Rusesabagina, a hotel manager who saved 1,200 Tutsis during the Rwandan genocide. It is nominated for three Oscars and was filmed mostly in South Africa with some scenes shot in Kigali. The film's director attended the festival alongside Paul Rusesabagina (played by Cheadle), whose wife and extended family also joined him. Hotel Rwanda is one of two films addressing the genocide at the 55th Berlin Film Festival, which runs until February 20th.  \n", "qwen2.5:0.5b": "The Berlin Film Festival awarded a film called \"Hotel Rwanda\" an enthusiastic reception during its special evening. In it, one of the main actors, Don Cheadle, received a standing ovation when he came onto the stage after the show. The film is based on a true story, though it is not considered a movie by the usual standards. It was nominated for three Oscars: Best Actor and two best performances including Paul Rusesabagina as his wife Tatiana. The film also has nominations for Best Original Screenplay and Supporting Actress for Sophie Okonedo, who played Cheadle's character.\nThe film explores the events that took place in Rwanda during the 1994-1995 genocide. Some actors had to leave their country due to a conflict with neighboring countries. Cheadle, who is played by Paul Rusesabagina and his wife Tatiana, was one of them.", "qwen2.5:1.5b": "Berlin Film Festival honors \"Hotel Rwanda\" with standing ovation for director Don Cheadle; stars include Tutsi hotel manager Paul Rusesabagina and his wife who fled to Belgium after saving 1,200 Rwandan refugees during the genocide.", "qwen2.5:3b": "Berlin Film Festival applauded \"Hotel Rwanda\", giving it a rousing reception. Don Cheadle received a standing ovation upon his stage appearance after the movie's screening. Based on a true story of a hotel manager saving 1,200 Tutsis during the Rwandan genocide, the film is nominated for three Oscars, including best actor for Cheadle and best supporting actress for Sophie Okonedo. Paul Rusesabagina, the real-life hotel manager portrayed by Cheadle, used his influence to shelter potential victims. Hotel Rwanda was shot in South Africa with some scenes filmed in Kigali. The festival also featured \"Sometimes in April,\" directed by Raoul Peck and competing for Golden and Silver Bear awards.", "opencoder:1.5b": "Berlin applauds Hotel Rwanda, a political thriller movie set at the Berlin Film Festival on Saturday. The hotel manager Don Cheadle receives an ovation when he steps onto the stage during the show. This film chronicles the hotel's story of saving 1,200 Tutsis from the Rwandan genocide. The three Oscars nominations are in line with the acting credits. It is a true story and is running for best original screenplay. The actors and supporting actresses who also feature in the film include Sophie Okonedo and Paul Rusesabagina, together with their family and friends.\n", "smollm:1.7b": "Berlin applauded Hotel Rwanda, a political thriller that tells the story of a hotel manager who saves 1,200 Tutsis from death during the Rwandan genocide. The film is nominated for three Oscars: Best Actor for Don Cheadle (who plays the role of Hotel Manager Cheadle) and Best Original Screenplay. Sophie Okonedo, who plays Cheadle's wife Tatiana, is also nominated for Best Supporting Actress. The film is competing in Berlin at the 55th Berlin Film Festival, which runs until February 28. Sometimes in April is a feature by Raoul Peck that competes for the festival's Golden and Silver Bear Awards. The film was made exclusively in Rwanda whereas Hotel Rwanda was shot mostly in South Africa with some scenes made in Kigali.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely while preserving the key ideas and details. Let me read through the text carefully.\n\nThe text starts by mentioning Berlin applauding Hotel Rwanda, which is a political thriller directed about the Rwandan genocide. Don Cheadle, the star actor, received standing ovation after his performance.\n\nI should capture that the film was well-received at the Berlin Film Festival and it's nominated for several Oscar awards. It also highlights the production details: made in Rwanda, shot in South Africa, and included scenes from Kigali.\n\nSo, I need to make sure all these points are included without any extra information or explanations.\n</think>\n\nBerlin praised Hotel Rwanda, a political thriller about the Rwandan genocide directed by Don Cheadle. The film received standing ovations at the Berlin Film Festival and was nominated for three Oscar awards: best actor for Cheadle, best supporting actress for Sophie Okonedo, and best original screenplay. The film is one of two addressing the genocide at the festival and also in competition for the Golden Bear awards in April.", "tinyllama:1.1b": "Berlin applauds Hotel Rwandá, with notable guests such as Don Cheadle receiving a standing ovation upon the film's premiere. The movie, which is based on true events, has received nominations for three Oscars, including best actor for Don Cheadle and supporting actress for Sophie Okonedo. The film stars Paul Rusesaagina, who played the hotel manager in the film, as well as his wife and family members, who were among the victims of Rwandan genocides. The festival has also announced a feature by Raoul Peck, competing for both Golden Bear and Silver Bear awards, with other notable films at the event including Berlin's exclusive exclusive, \"Sometimes in April.\"", "tinydolphin:1.1b": " Berlin Film Festival Awards: \n1. Don Cheadle receives a standing ovation after his performance as the hotel manager, Tatiana, in Hotel Rwanda.\n2. Sophie Okonedo is nominated for best supporting actress.\n3. The film is nominated for three Oscars, including best actor and best original screenplay.\n4. Paul Rusesabagina is nominated for best original screenplay along with Don Cheadle and Sophie Okonedo, who both receive nominations in their respective categories. \n5. Hotel Rwanda is one of two films addressing the Rwandan genocide that will be part of the Berlin Film Festival's lineup until February 20th.", "phi:2.7b": " The movie \"Hotel Rwanda\" received critical acclaim at the Berlin Film Festival, with star Don Cheadle receiving a standing ovation for his performance as the hotel manager who saved 1,200 Tutsis during the Rwandan genocide. The film is nominated for three Oscars and has also been in the running for best original screenplay. It features out of competition screenings by two other films, including \"Sometimes in April\" by Raoul Peck.\n", "orca-mini:3b": " Hotel Rwanda received a rousing reception at the Berlin Film Festival, with star Don Cheadle receiving a standing ovation after the show. The film is about the true story of a hotel manager who saved 1,200 Tutsis from death during the Rwandan genocide and is nominated for three Oscars, including best actor for Cheadle. Sophie Okonedo, who plays Cheadle's wife Tatiana, is also nominated for best supporting actress. The film is in the running for best original screenplay and was made in Rwanda and South Africa, with some scenes shot in Kigali.", "hermes3:3b": "Berlin welcomed \"Hotel Rwanda\", Don Cheadle's standing ovation film about hotel manager saving 1200 Tutsis during Rwandan genocide, at festival.", "stablelm-zephyr:3b": "Hotel Rwanda premiered at Berlin Film Festival to a standing ovation from spectators and received nominations for three Oscars, including best actor for Don Cheadle and best supporting actress for Sophie Okonedo. The film tells the true story of a hotel manager who saved 1,200 Tutsis during the Rwandan genocide by sheltering potential victims, earning praise as one of two films addressing the genocide at the festival.", "stablelm2:1.6b": "Hotel Rwanda received praise at the Berlin Film Festival for its true story of hotel manager Paul Rusesabagina saving Tutsis during the Rwandan genocide. Don Cheadle and Sophie Okonedo star in the film nominated for three Oscars, including best actor and supporting actress. The movie also aims for best original screenplay. Hotel Rwanda was shown out of competition and is up for best actor, supporting actress, and best original screenplay at this year's Berlin Film Festival.", "granite3.1-dense:2b": "Hotel Rwanda, a political thriller about a hotel manager who saved 1,200 Tutsis during the 1994 Rwandan genocide, received an enthusiastic welcome at the Berlin Film Festival. Don Cheadle, who portrays the hotel manager Paul Rusesabagina, and Paul Rusesabagina himself, along with his wife and extended family, were among those on stage to receive a standing ovation. The film is nominated for three Oscars: best actor for Cheadle, best supporting actress for Sophie Okonedo, and best original screenplay. Hotel Rwanda is one of two films at the festival addressing the genocide; Raoul Peck's Sometimes in April, made exclusively in Rwanda, also competes for Golden and Silver Bear awards.", "chatgpt-4o-latest": "Hotel Rwanda received a rousing reception at the Berlin Film Festival, with star Don Cheadle earning a standing ovation. The film tells the true story of hotel manager Paul Rusesabagina, who saved 1,200 Tutsis during the Rwandan genocide. It is nominated for three Oscars, including best actor for Cheadle, best supporting actress for Sophie Okonedo, and best original screenplay. Rusesabagina, his wife, and extended family, now living in Belgium, joined Cheadle on stage. Rusesabagina used his influence to protect victims, reaching out to global dignitaries. The festival also features Sometimes in April, another film about the genocide, which was shot entirely in Rwanda, while Hotel Rwanda was mostly filmed in South Africa with some scenes in Kigali.", "reference": "Cheadle, was joined on stage at Berlin by Paul Rusesabagina, the hotel manager he plays in the film, Mr Rusesabagina's wife and his extended family, who fled Rwanda and now live in Belgium.Hotel Rwanda is one of two films addressing the genocide at the 55th Berlin Film Festival, which runs until 20 February.Political thriller Hotel Rwanda was given a rousing reception by spectators at the Berlin Film Festival on Saturday.The film, showing out of competition in Berlin, is nominated for three Oscars, including best actor for Cheadle.The film is the true story of the hotel manager who saved 1,200 Tutsis from death during the Rwandan genocide."}