{"raw_text": "Willis sues over movie 'injury'\n \n Actor Bruce Willis is suing Revolution Studios over an injury he said he suffered while making Tears of the Sun.\n \n Willis is seeking medical expenses after he said he was hit in the head by a firework during the filming of the 2002 movie, produced by the firm. The lawsuit said the star has endured mental and physical injuries as a result of the alleged incident. \"We are not able to comment on pending litigation,\" Revolution Studios spokesman Sean Dudas said.\n \n In Tears of the Sun Willis plays a US military commander who disobeys orders to try and help save a doctor and patients trapped in the Nigerian jungle. Directed by Antoine Fuqua, the film was poorly received by critics and did not perform strongly at the box office. According to the lawsuit, the injury was suffered during the firing of explosions as part of a special effect. The explosions, known as squibs, were intended to \"simulate the appearance of bullets striking the ground\". The lawsuit said Willis has endured \"extreme mental, physical and emotional pain and suffering.\" There were no specific details on the injuries. While Willis does not seek specific monetary damages, the lawsuit noted that the star \"was required to and did employ physicians and other medical personnel\". It stated he will incur additional future medical expenses. The lawsuit said Revolution Studios and special effects foreman Joe Pancake \"had a duty to Willis to ensure that the squibs were inspected, set up, placed and detonated in a safe manner, and to employ technicians who were trained and competent in their use\".\n", "llama3.2:1b": "Bruce Willis is suing Revolution Studios over an injury he claims occurred during filming of the 2002 movie Tears of the Sun. He alleges he was hit by a firework that caused physical and mental injuries, including extreme pain and suffering. The lawsuit seeks medical expenses and additional future medical costs.", "llama3.2:3b": "Bruce Willis is suing Revolution Studios over an injury he claimed to have sustained while filming Tears of the Sun. He alleges he was hit in the head by a firework during filming and has endured mental and physical injuries as a result. The lawsuit seeks medical expenses, including future costs, from Revolution Studios and special effects foreman Joe Pancake.", "gemma2:2b": "Bruce Willis is suing Revolution Studios for injuries he suffered while filming \"Tears of the Sun.\" The lawsuit claims he was hit by a firework during filming and that this caused both physical and emotional harm. He is seeking reimbursement for medical expenses and expects to incur further costs. \n", "qwen2.5:0.5b": "Actor Bruce Willis sues Revolution Studios for injuries he suffered during the production of his 2002 film \"Tears of the Sun.\" The lawsuit alleges Willis sustained mental and physical injuries after an alleged explosion during special effects filming, which occurred during the burning of firework displays. The claim asserts Willis is required to employ medical personnel due to the special effects, will incur additional expenses for future medical care, and requested damages in the form of punitive damages against Revolution Studios.", "qwen2.5:1.5b": "Actor Bruce Willis sues Revolution Studios for injury sustained while filming Tears of the Sun. He claims mental and physical injuries from being hit by a firework during special effects. The lawsuit seeks medical expenses and future care costs due to alleged negligence. No specific details are provided on his injuries, but he demands additional funding for ongoing treatment.", "qwen2.5:3b": "Actor Bruce Willis sues Revolution Studios for injuries sustained while filming Tears of the Sun in 2002. Willis claims he was hit by a firework during shooting, resulting in mental and physical trauma. The lawsuit alleges negligence in handling special effects squibs intended to simulate bullet impacts. Willis seeks unspecified medical expenses and additional treatment costs, blaming Revolution Studios and special effects supervisor Joe Pancake for inadequate safety measures.", "opencoder:1.5b": "The lawsuit alleges that Willis has sustained multiple injuries during the shooting of the 2002 movie. The first injury, although minor and fatal, provoked emotional panic and consequent suffering. The second incident, the killing of a patient trapped in a jungle, also involved severe physical trauma. The suiters requested medical expenses, but have nonetheless sought no particular monetary sum. The filmmakers' comments about the film's poor reception and its failure to perform at the box office are equally valid points to raise. While Willis does not comment on pending lawsuits, he also did not seek specific financial damages.\n", "smollm:1.7b": "The following summary preserves key ideas and details:\n\nWillis sues over movie 'injury'\nActor Bruce Willis is suing Revolution Studios over an injury he said he suffered while making Tears of the Sun.\nActors are seeking medical expenses after they say they were hit in the head by a firework during filming of the 2002 movie, produced by Revolution Studios.\nThe lawsuit says Willis has endured mental and physical injuries as a result of the alleged incident.\nWe are not able to comment on pending litigation.\nIn Tears of the Sun Willis plays a US military commander who disobeys orders to try and help save a doctor and patients trapped in the Nigerian jungle. Directed by Antoine Fuqua, the film was poorly received by critics and did not perform strongly at the box office. According to the lawsuit, the injury was suffered during the firing of explosions as part of a special effect. The lawsuits said Willis has endured \"extreme mental, physical and emotional pain and suffering.\" There were no specific details on the injuries. While Willis does not seek specific monetary damages, the lawsuit noted that the star \"was required to and did employ physicians and other medical personnel\". It stated he will incur additional future medical expenses. The lawsuit said Revolution Studios and special effects foreman Joe Pancake had a duty to ensure that the squibs were inspected, set up, placed and detonated in a safe manner, and to employ technicians who were trained and competent in their use.", "deepseek-r1:1.5b": "<think>\nOkay, I'm trying to figure out how to summarize this text. Let me read through it carefully.\n\nThe main subject is Bruce Willis suing Revolution Studios over an injury caused by a firework during the filming of \"Tears of the Sun.\" Willis thinks he suffered from mental and physical injuries after that incident.\n\nHe's seeking medical expenses, but Revolution says they couldn't comment on ongoing litigation. The film was poorly received, directed by Antoine Fuuka, but there were no specific details on the injuries except for the potential extreme pain mentioned.\n\nThe lawsuit mentions that while Willis isn't asking for specific damages, he'll incur more future medical costs because of the special effects work done with Joe Pancake. They need to ensure squibs (the fireworks) are handled safely and properly.\n\nSo I need to condense this into a concise summary without explanations or formatting. Just plain text.\n</think>\n\nWillis sues over an injury caused by a firework during filming, fearing mental and physical pain. Seeking medical expenses but unclear liability details. Review special effects work with Pancake.", "tinyllama:1.1b": "Actress-turned-Actor Bruce Willis is suing Revolution Studios for allegedly injuring him during the filming of Tears of the Sun. The incident reportedly occurred during the production when a firework hit him on his head, leaving him with mental and physical injuries. Willis's attorney is seeking medical expenses as well as monetary damages totaling $10 million. The suit claims that Willis was required to use special effects foreseen for, but failed to receive proper inspection, setup, placement, and detonation of squibs used in the film. The injuries suffered by Willis reportedly occurred during the firing of explosions as part of a special effect. The suit also states that Willis has endured \"extreme mental, physical, and emotional pain and suffering.\"", "tinydolphin:1.1b": " In the movie 'Tears of the Sun', actor Bruce Willis is suing Revolution Studios for causing him physical and mental injuries during filming. The lawsuit alleges that while making the action-adventure film, Willis was hit in the head by a firework, which caused him to suffer a head injury and severe pain. He has also endured numerous medical expenses due to his injuries. The lawsuit states that the studio should have properly inspected and set up the explosives used in the film, ensuring they were securely detonated and safe for Willis's use. If the studio is found responsible for any of the injuries, it may face legal consequences and be held accountable for their actions in the case.", "phi:2.7b": " Actor Bruce Willis has sued Revolution Studios over an alleged injury during filming of the movie Tears of the Sun. He is seeking medical expenses due to mental and physical injuries allegedly sustained while filming a special effect scene involving exploding squibs. The lawsuit does not mention specific details on his injuries, but notes that Willis will incur future medical expenses. Willis is suing for damages related to the alleged injury during the filming of Tears of the Sun.\n", "orca-mini:3b": " Actor Bruce Willis is suing Revolution Studios over an injury he said he suffered while making Tears of the Sun. He is seeking medical expenses after he was hit in the head by a firework during the filming of the 2002 movie. The lawsuit states that Willis has endured mental and physical injuries as a result of the alleged incident.", "hermes3:3b": "Bruce Willis sues Revolution Studios over head injury during filming of 'Tears of the Sun'.", "stablelm-zephyr:3b": "Actor Bruce Willis is suing Revolution Studios over an injury he claims occurred during the filming of Tears of the Sun. He was hit in the head by a firework and is seeking medical expenses for both mental and physical injuries sustained. The injury took place during the firing of explosions, known as squibs, meant to simulate bullets striking the ground. Though Willis does not seek specific monetary damages, he will incur additional future medical expenses. Revolution Studios and special effects foreman Joe Pancake are accused of failing in their duty to ensure safe handling of the squibs and training of competent technicians.", "stablelm2:1.6b": "Actor Bruce Willis sues Revolution Studios for medical expenses incurred from an alleged injury sustained during filming of Tears of the Sun. The suit claims Willis suffered head injuries during a firework explosion during production; he alleges he endured extreme mental, physical, and emotional pain and suffering. No specific details on injuries were provided. Willis does not seek monetary damages but requires future medical expenses. Revolution Studios and special effects foreman Joe Pancake are named in the lawsuit for their alleged failure to ensure safe handling of squibs during filming.", "granite3.1-dense:2b": "Bruce Willis is suing Revolution Studios over an alleged head injury sustained during the 2002 film \"Tears of the Sun,\" where he played a military commander. Willis claims mental and physical pain, including requiring medical attention for the injury, which was likely caused by a firework used as part of a special effect known as a squib, intended to simulate bullet impacts. The lawsuit asserts that Revolution Studios and special effects foreman Joe Pancake had a duty to ensure safe handling of these explosives. Willis seeks compensation for past and future medical expenses due to the injury, which he claims resulted from the defendants' negligence in managing squib usage.", "chatgpt-4o-latest": "Bruce Willis is suing Revolution Studios for medical expenses after allegedly being hit in the head by a firework while filming *Tears of the Sun* in 2002. The lawsuit claims he has suffered mental, physical, and emotional injuries due to the incident, which occurred during a special effects explosion. While Willis does not seek specific monetary damages, he has incurred medical costs and expects future expenses. The lawsuit argues that Revolution Studios and special effects foreman Joe Pancake had a duty to ensure the safe use of the explosives. Revolution Studios declined to comment on the pending litigation.", "reference": "Actor Bruce Willis is suing Revolution Studios over an injury he said he suffered while making Tears of the Sun.The lawsuit said Willis has endured \"extreme mental, physical and emotional pain and suffering.\"The lawsuit said the star has endured mental and physical injuries as a result of the alleged incident.While Willis does not seek specific monetary damages, the lawsuit noted that the star \"was required to and did employ physicians and other medical personnel\".The lawsuit said Revolution Studios and special effects foreman Joe Pancake \"had a duty to Willis to ensure that the squibs were inspected, set up, placed and detonated in a safe manner, and to employ technicians who were trained and competent in their use\".Willis is seeking medical expenses after he said he was hit in the head by a firework during the filming of the 2002 movie, produced by the firm."}