{"raw_text": "Mumbai bombs movie postponed\n \n The release of a film about the Mumbai (Bombay) blasts in 1993 has been postponed following protests by those on trial for the bombings.\n \n Investigating the blasts which killed more than 250 people and wounded 1,000, the film Black Friday had been due to open across India on Friday. But 36 people accused in connection with the blasts said it should not be screened until the trial is over. Mumbai High Court postponed the film's launch until 3 February.\n \n Black Friday is based upon the novel of the same name written by journalist S Hussain Zaidi, which looks at the 15 explosions which rocked Mumbai on 12 March 1993. Director Anurag Kashyap said the film's release should not be delayed as the book has already been on sale for two years. \"If you have not gone against the book, then how can you go against the movie?\" Mr Kashyap's lawyer Mihir Desai said. This is the second time that those accused in connection with the blasts have sought legal intervention regarding the film.\n \n They previously asked that a line from the movie's poster, which claimed the film portrayed \"the true story of the Bombay bomb blasts\", be removed. Their lawyer, Majeed Memon, said: \"We had argued that how can a film say it is telling the true story when the court itself is struggling to find the truth? \"So we said they should remove the line from their promotional posters and they did give us an assurance that they would do so.\" The Mumbai bombings case is one of India's longest-running trials. A special court was set up to hear the case and regular hearings have taken place there for the last nine years, with more than six hundred witnesses questioned.\n", "llama3.2:1b": "The release of a film about the 1993 Mumbai blasts has been postponed due to protests by those on trial for the bombings. The film, Black Friday, is based on the novel by journalist S Hussain Zaidi and directed by Anurag Kashyap. However, 36 people accused in connection with the blasts have asked that the film's release be delayed until their trials are over.", "llama3.2:3b": "The release of film Black Friday, based on the 1993 Mumbai blasts, has been postponed in India following protests by those on trial for the bombings. The film's launch was initially set for Friday but will now open on February 3. Those accused in connection with the blasts previously asked that a line from the movie's poster be removed and this has happened again due to ongoing legal intervention.", "gemma2:2b": "The release of the film \"Black Friday\" about the 1993 Mumbai bombings has been postponed due to protests from those on trial for the attacks.  A line in the film's promotional materials that claims the film is based on \"the true story of the Bombay bomb blasts\" was requested to be removed by the accused, and a court hearing has been set to discuss a new release date. \n", "qwen2.5:0.5b": "A film about Mumbai (Bombay) blasts in 1993 has been postponed due to protests over those charged with them. The movie is based on a novel of the same name by journalist Anurag Kashyap and is already being screened for two years. The protestors are trying to remove a line from the poster, which claims the film is telling \"the true story\" of Mumbai's 1993 blast victims. They have given an assurance that they will remove this line.", "qwen2.5:1.5b": "The release of a film about the 1993 Mumbai blasts has been postponed due to protests by those on trial for the bombings. The film Black Friday was originally scheduled to open in India on Friday, but will now be screened until February 3rd due to concerns from the accused parties over its portrayal of events.", "qwen2.5:3b": "Mumbai bombs movie postponed due to protests by those on trial; initially scheduled to open in Mumbai on Friday, but now postponed until February 3rd by the Mumbai High Court. The film Black Friday is based on S Hussain Zaidi's novel and directed by Anurag Kashyap, who opposes delay claiming it has already been sold for two years. Previous request was made to remove a line from the poster asserting the movie portrays \"the true story of Bombay bomb blasts\" as court struggles with finding truth in the case, one of India’s longest-running trials.", "opencoder:1.5b": "Summarizing the text:\n\nThe release of a film about the Mumbai (Bombay) blasts in 1993 has been postponed due to protests by those on trial for the bombings. Black Friday is based upon the novel of the same name written by journalist S Hussain Zaidi, which looks at the 15 explosions which rocked Mumbai on 12 March 1993.\n \nDirector Anurag Kashyap said the film's release should not be delayed as the book has already been on sale for two years. The movie is a case of India's longest-running trials and regular hearings have taken place there for the last nine years, with more than six hundred witnesses questioned.\n", "smollm:1.7b": "The summary should preserve key ideas and details:\n\n1. Mumbai bombs movie postponed (no explanation)\n2. Mumbai High Court postponed the film's launch until 3 February (no explanation)\n3. Black Friday is based upon the novel of the same name written by journalist S Hussain Zaidi, which looks at the 15 explosions which rocked Mumbai on 12 March 1993 (no explanation)\n4. Director Anurag Kashyap said the film's release should not be delayed as the book has already been on sale for two years (no explanation)\n5. They previously asked that a line from the movie's poster, which claimed the film portrayed \"the true story of the Bombay bomb blasts\", be removed (no explanation)\n6. How can a film say it is telling the true story when the court itself is struggling to find the truth? (no explanation)\n7. We had argued that how can a film say it is telling the true story when the court itself is struggling to find the truth? (no explanation)\n8. So we said they should remove the line from their promotional posters and they did give us an assurance that they would do so. (no explanation)\n9. The Mumbai bombings case is one of India's longest-running trials (no explanation)\n10. A special court was set up to hear the case and regular hearings have taken place there for the last nine years, with more than six hundred witnesses questioned (no explanation)", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely while preserving key ideas and details. The user provided a detailed news article about the Mumbai Bombings movie being postponed after protests. Let me read through the text carefully.\n\nThe original text talks about the film based on S Hussain Zaidi's novel being postponed due to legal issues from those involved in the bombings. It mentions that the book had been sold for two years and that their lawyer argued against including a certain line in the movie poster. There were nine years of hearings, six hundred witnesses questioned, and it's one of India's longest trials.\n\nI should focus on the main points: the postponement due to legal issues, the film's basis on Zaidi's novel, the legal arguments about removing content from posters, the number of years of trial, the high number of witnesses, and that it's the longest trial in India. I'll keep each of these key points as separate sentences in the summary.\n\nI need to make sure not to include any explanations or additional information beyond what's necessary for a concise summary. Also, avoid using any markdown or special formatting, just plain text.\n</think>\n\nThe film about the Mumbai Bombings, based on S Hussain Zaidi's novel, was postponed after legal disputes from those involved in the bombings. The movie, Black Friday, should be released by the trial concluded 36 days ago. Anurag Kashyap directed the film and expressed concerns that it shouldn't be delayed due to a book already sold for two years. His lawyer Mihir Desai argued against including a specific line from the movie poster in promotional materials. The case has been ongoing for nearly nine years, with over six hundred witnesses questioned.", "tinyllama:1.1b": "The Mumbai bombings movie Black Friday has been postponed after a request to screen it in connection with the trial of those accused of being involved in the explosions was denied by investigating authorities. The film, based on a novel by journalist S Hussein Zaidi and set for release on February 1, had been due to open across India but will now be postponed until after the trial has concluded. Those convicted in connection with the bombings have previously sought the removal of a line from Black Friday's poster that allegedly portrayed the film as \"telling the true story\". Despite attempts by those accused to remove the line, authorities have continued to screen the movie in Mumbai, citing its potential impact on the trial proceedings.", "tinydolphin:1.1b": " In summary, a Mumbai bombings movie starring Black Friday director Anurag Kashyap has been postponed after the film was accused of downplaying the actual events that took place during the attack. The case is considered one of India's longest-running trials and involves 36 people accused of being involved in the bombings. Despite this, the film's release remains delayed until a court can finally determine the truth behind the attack.", "phi:2.7b": " After protests by those on trial for the Mumbai blasts, the release of a film based on the bombings has been postponed until March 3rd, 2021. The film had been due to open in India on Friday. It is called Black Friday and is based upon the book of the same name written by journalist S Hussain Zaidi. The book looks at the 15 explosions that rocked Mumbai on 12th March, 1993. The accused have previously asked for the removal of a line from the film's poster, which claimed it portrayed \"the true story of the Bombay bomb blasts\". They claim that the movie cannot be based on true events when the court is still struggling to find the truth.\n", "orca-mini:3b": " The release of a film about the 1993 Mumbai blasts in India has been postponed due to protests by those on trial for the bombings. The film, Black Friday, is based upon the novel of the same name and looks at the 15 explosions which rocked Mumbai on 12 March 1993. Those accused in connection with the blasts have sought legal intervention regarding the film, requesting that a line from the movie's poster be removed. The Mumbai bombings case is one of India's longest-running trials, with a special court hearing the case for nine years and more than six hundred witnesses questioned.", "hermes3:3b": "Mumbai bombs movie release postponed due to protests by those on trial for 1993 blasts; release delayed until 3 Feb.", "stablelm-zephyr:3b": "A film about the 1993 Mumbai blasts, titled \"Black Friday,\" has been postponed in India after 36 people accused of connection with the bombings demanded its delay until their trial is over. The movie, based on a novel by journalist S Hussain Zaidi, was set to open across India on Friday but the Mumbai High Court postponed its launch until February 3. Those involved in the blasts previously asked for a line from the film's poster claiming the film was \"the true story of the Bombay bomb blasts\" to be removed, arguing that the court itself was struggling to find the truth. The Mumbai bombings case is one of India's longest-running trials with over 600 witnesses questioned in nine years by a special court.", "stablelm2:1.6b": "The film \"Black Friday,\" about the Mumbai (Bombay) blasts, has been postponed due to protests from those on trial. Originally scheduled for release in India, it was postponed until February 3 by the Mumbai High Court. The film's director stated that its release should not be delayed as the book it is based on has already been sold for two years. This follows a previous request from those accused of involvement in the bombings to remove a line from the movie's poster that claimed the film accurately portrays \"the true story of the Bombay bomb blasts.\" The Mumbai bombings case remains one of India's longest-running trials, with more than 600 witnesses questioned over nine years.", "granite3.1-dense:2b": "The release of a film titled \"Black Friday,\" based on journalist S Hussain Zaidi's book detailing the 1993 Mumbai bombings, has been postponed due to protests from defendants in the trial. The film, directed by Anurag Kashyap, was scheduled to premiere nationwide on Friday but was ordered by the Mumbai High Court to wait until February 3rd. The accused argue that the movie should not be shown until their trial concludes, claiming the court is still seeking the truth. This is not the first instance of legal intervention; previously, they sought the removal of a film-poster line asserting the movie's factual portrayal of the blasts. The Mumbai bombings case, one of India's longest-running trials, involves over 600 witnesses and has been ongoing for nearly a decade in a special court.", "chatgpt-4o-latest": "The release of the film *Black Friday*, based on the 1993 Mumbai bomb blasts, has been postponed following protests from those on trial for the attacks. The film, originally set to open across India, was delayed by the Mumbai High Court until 3 February after 36 accused individuals argued it should not be screened until the trial concludes. Directed by Anurag Kashyap and based on a book by journalist S Hussain Zaidi, the film examines the 15 explosions that killed over 250 people and injured 1,000. The accused had previously objected to a promotional line claiming the film told \"the true story\" of the blasts, arguing that the court was still determining the truth. The Mumbai bombings trial is one of India's longest-running cases, with a special court hearing testimony from over 600 witnesses over nine years.", "reference": "The release of a film about the Mumbai (Bombay) blasts in 1993 has been postponed following protests by those on trial for the bombings.But 36 people accused in connection with the blasts said it should not be screened until the trial is over.Their lawyer, Majeed Memon, said: \"We had argued that how can a film say it is telling the true story when the court itself is struggling to find the truth?Director Anurag Kashyap said the film's release should not be delayed as the book has already been on sale for two years.Investigating the blasts which killed more than 250 people and wounded 1,000, the film Black Friday had been due to open across India on Friday.This is the second time that those accused in connection with the blasts have sought legal intervention regarding the film."}