{"raw_text": "Brando 'rejected Godfather role'\n \n Late film star Marlon Brando is said to have repeatedly turned down his Oscar-winning role in The Godfather.\n \n The actor's friend Budd Schulberg told Vanity Fair magazine that Brando's assistant suggested he read the novel. The actor repeatedly refused, throwing the book at her and saying: \"For the last time, I won't glorify the mafia\". But Brando, who died last July at the age of 80, eventually took the role of Don Corleone, winning him an Oscar in 1973 which he notoriously refused. The actor sent a young woman dressed in Native American costume to refuse the award on his behalf and to draw attention to the plight of Native Americans.\n \n Schulberg told the magazine that Brando's assistant realised the film star had warmed to the idea of The Godfather role when he sported a drawn-on pencil moustache and asked: \"How do I look?\" His assistant, Alice Marchak, said that he looked like George Raft, an actor famed for playing gangsters on the silver screen. Every time she went to see Brando from then on, she added, he was wearing a different gangster-style moustache. Brando was asked to screen test for the role in The Godfather, as studio executives were said to be reluctant for the actor to play the part following problems on the set of Brando's previous film Mutiny on the Bounty . In fact Brando's Academy Award triumph revived his career. The actor was nominated for an Oscar the following year for his role in Bernardo Bertolucci's Last Tango in Paris. Before his death, Brando granted gaming company Electronic Arts the rights to use his voice and image in a video game based on the Godfather film and book and recorded voice-overs which closely resembled his role as Don Corleone. Brando's co-stars from The Godfather, James Caan and Robert Duvall, will also reprise their roles for the video game, it was confirmed on Wednesday.\n", "llama3.2:1b": "Marlon Brando rejected a role in \"The Godfather\" that he won an Oscar for. His assistant suggested he read the novel but he refused, throwing the book at her. He eventually accepted the role and went on to win an Oscar for it in 1973.\n\nBrando's assistant added that his assistant believed the actor had warmed up to the idea of playing Don Corleone after Brando sported a drawn-on pencil moustache.", "llama3.2:3b": "Marlon Brando repeatedly turned down the role of Don Corleone in The Godfather, but eventually took the part after showing interest in the character's look. He wore different moustaches to screen tests and eventually warmed up to the idea. His Oscar win for the role in 1973 helped revive his career, leading to further opportunities including a video game based on The Godfather film and book.", "gemma2:2b": "Marlon Brando rejected the role of Don Corleone in *The Godfather* despite his friend Budd Schulberg suggesting he read the novel. He eventually accepted the role, winning an Oscar in 1973 and famously refusing the award. His performance revived his career.  After *The Godfather*, Brando recorded voiceovers for a video game based on the film and book.  \n", "qwen2.5:0.5b": "Marlon Brando rejected his Oscar-winning role in \"The Godfather\" after his friend Budd Schulberg suggested he read a novel about Don Corleone. His assistant found him attractive and suggested he dress up in a gangster style moustache to look like George Raft. The actor was offered the role after another film, \"Mutiny on the Bounty,\" had problems with Brando's previous work. After his death, the actor honored his legacy by granting gaming company Electronic Arts exclusive rights to use his voice and image for a video game based on the Godfather movie.", "qwen2.5:1.5b": "Marlon Brando turned down multiple offers for an Oscar-winning role in Francis Ford Coppola's \"The Godfather.\" Despite being tempted by a Native American costume appearance, he finally accepted to play Don Vito Corleone in 1973 and won the Academy Award despite his refusal. After starring in another film, he was relaunched due to success on \"The Godfather,\" which led to him becoming an advocate for Native Americans and collaborating with video game developers on a character role simulation.", "qwen2.5:3b": "Marlon Brando reportedly declined multiple times to play Don Corleone in \"The Godfather,\" citing his opposition to mob themes. Despite initial refusals, he eventually accepted the role and won an Oscar in 1973. He refused the award personally, instead sending a Native American woman dressed as him. Brando began wearing various moustaches resembling those of actor George Raft, who was known for playing gangsters. Before his death, Brando allowed \"The Godfather\" to use his voice and image in a video game adaptation, which also featured co-stars James Caan and Robert De Niro reprising their roles.", "opencoder:1.5b": "Brando 'rejected Godfather role'\nLate film star Marlon Brando is said to have repeatedly turned down his Oscar-winning role in The Godfather.\n\nThe actor's friend Budd Schulberg told Vanity Fair magazine that Brando's assistant suggested he read the novel. The actor repeatedly refused, throwing the book at her and saying: \"For the last time, I won't glorify the mafia\". But Brando, who died last July at the age of 80, eventually took the role of Don Corleone, winning him an Oscar in 1973 which he notoriously refused. The actor sent a young woman dressed in Native American costume to refuse the award on his behalf and to draw attention to the plight of Native Americans.\n\nSchulberg told the magazine that Brando's assistant realised the film star had warmed to the idea of The Godfather role when he sported a drawn-on pencil moustache and asked: \"How do I look?\" His assistant, Alice Marchak, said that she looked like George Raft, an actor famed for playing gangsters on the silver screen. Every time she went to see Brando from then on, she added, he was wearing a different gangster-style moustache. Brando was asked to screen test for the role in The Godfather, as studio executives were said to be reluctant for the actor to play the part following problems on the set of Brando's previous film Mutiny on the Bounty . In fact Brando's Academy Award triumph revived his career. The actor was nominated for an Oscar the following year for his role in Bernardo Bertolucci's Last Tango in Paris. Before his death, Brando granted gaming company Electronic Arts the rights to use his voice and image in a video game based on the Godfather film and book and recorded voice-overs which closely resembled his role as Don Corleone. Brando's co-stars from The Godfather, James Caan and Robert Duvall, will also reprise their roles for the video game, it was confirmed on Wednesday.\n", "smollm:1.7b": "The summary is concise and to the point, capturing the main ideas and key details of the original text. It includes the names of the people involved in the production of The Godfather, including Marlon Brando's assistant and his friend Budd Schulberg. The summary also mentions the Oscar-winning role that Brando played, as well as the reasons why he refused it, including the moustache and the fact that he was asked to screen test for the role. Finally, the summary touches on the details of the production of The Godfather, including the nomination for an Oscar and the use of his voice and image in a video game based on the film.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text into a concise summary preserving key ideas and details. Let me read through each paragraph carefully.\n\nThe first sentence says Marlon Brando 'rejected Godfather role.' That's the main point, so that should be included as the key idea.\n\nNext, it mentions that Brando repeatedly turned down his Oscar-winning role in The Godfather and took The Godfather: The Movie instead. He eventually got an Oscar but he refused it too. This shows his character development over time and how he evolved.\n\nThen there's information about Budd Schulberg from Vanity Fair magazine who told Vanity Fair that Brando's assistant, Alice Marchak, thought he was reading the novel based on his facial features—drawn-on-the-mustache. This suggests he warmed to the role early on before he tried it again.\n\nBrando died at 80, and he used a Native American costume when refusing an award because he felt the situation could be improved. That's a significant detail about his character's personality or the cultural aspect of the job.\n\nAnother key point is that after working on Mutiny on the Bounty, there were problems with Brando in The Godfather—settlers wanted to make money from him by playing the mafia role instead. But despite that, he won an Oscar and sent a woman dressed in Native American costume for an award to highlight the issue.\n\nHe was also granted rights for a video game based on The Godfather and recorded voice-overs similar to his character's speech. His co-stars from The Godfather also reprise their roles.\n\nSo I need to condense all this into a summary without explanations or formatting, just plain text. Let me make sure to include the main points: Brando rejected The Godfather role but took it up and got an Oscar. He was forced to refuse an award because of his character, which he didn't like. Despite Settlers wanting money from him, he won the Oscar. Then he was granted rights for a video game based on The Godfather and has co-stars in the game.\n\nPutting it all together concisely: Brando rejected The Godfather role but switched to The Godfather: The Movie, worked hard without success leading to his Oscar rejection later. He refused an award out of character, despite facing setters. Guessed rights granted for a video game and reprises in that game with co-stars from the original film.\n\nI should check if I included all key points. Yes, the main ideas about his character, his attempts at roles, the forced refusal of an award, and the video game part.\n</think>\n\nBrando rejected The Godfather role but switched to The Godfather: The Movie, where he faced success despite facing problems on set. He refused an award out of character, even though Settlers wanted money from him. Despite earlier struggles in The Godfather, Brando won an Oscar and used a Native American costume for an award refusal. He was granted rights for a video game based on The Godfather and reprises with co-stars from the film.", "tinyllama:1.1b": "Brando 'rejected' Godfather role despite being offered by film star Marlon Brando, who turned down his Oscar-winning role in favour of more challenging parts due to his reservations about the plight of Native Americans. The actor ultimately took the part and won an Oscar for his performance as Don Corleone in The Godfather. Despite rejecting the role, Brando's assistant convinced him to screen test for the film and eventually nominated him for a follow-up role in 1973's Last Tangohin Paris. In the same year, EA acquired the rights to use his image and voice in a video game based on The Godfather.", "tinydolphin:1.1b": " Marlon Brando was a talented actor known for his versatility and dedication to his craft. However, in the film industry, he faced a tough decision when considering the role of Don Corleone in The Godfather. Despite being offered other significant roles, Brando ultimately rejected this part because he did not want to represent the mafia. \n\nThe late actor's assistant, Budd Schulberg, shared his story with Vanity Fair about this rejection. Brando was initially set to play James Caan's father in the film but instead decided on another role. When Schulberg approached Brando, he was wearing a moustache similar to George Raft's famous portrayal of gangster characters. \n\nThe assistant realized that Brando would look more like Raft if he wore a different moustache and asked his assistant, Alice Marchak, to try multiple styles before deciding on the one he liked the most. The result was that every time Marchak went to see Brando from then on, she added a new, different moustache. \n\nBrando finally agreed to play Don Corleone in The Godfather following several screen tests and discussions with studio executives. The actor's decision to represent the mafia was not without its challenges, but it ultimately helped elevate his career and solidified his status as a leading man in cinema.", "phi:2.7b": " Marlon Brando, a film star known for playing gangsters in films, turned down his Oscar-winning role as Don Corleone in The Godfather movie several times. However, he eventually took the role and won an Oscar in 1983. His assistant Alice Marchak observed that he was drawn to the idea of playing the character due to his moustache and asked him how it looked. Every time she saw Brando after that, he would wear a different gangster-style moustache. Brando's Academy Award triumph rejuvenated his career, and he received another nomination for Last Tango in Paris. Before his death, Brando granted Electronic Arts the rights to use his voice and image in a video game based on The Godfather book and movie.\n", "orca-mini:3b": " Marlon Brando turned down his Oscar-winning role in The Godfather because he was not interested in playing a gangster character. However, he eventually took the role of Don Corleone after being prompted by his assistant and wearing a drawn-on pencil moustache.", "hermes3:3b": "Marlon Brando rejected The Godfather role multiple times before accepting, according to Budd Schulberg. Brando turned down the Oscar-winning part of Don Corleone, eventually taking it after sporting a gangster moustache and improving his acting performance, according to his assistant.", "stablelm-zephyr:3b": "Marlon Brando initially rejected the opportunity to play Don Corleone in The Godfather but eventually took the role, winning an Oscar in 1973. His assistant suggested he read the novel and observed Brando warming up to the idea by sporting different gangster-style moustaches. Despite studio reluctance, Brando's performance in The Godfather revived his career, leading to his voice and image being used in a video game based on the film and book.", "stablelm2:1.6b": "Marlon Brando rejected a role in The Godfather due to his dislike of the mafia theme. After seeing the film, he agreed to play Don Corleone and won an Oscar in 1972, famously refusing it later. Brando wore various gangster-style moustaches for the screen test. His Academy Award win boosted his career, and he recorded voice-overs for a video game based on The Godfather. Co-stars James Caan and Robert Duvall also appeared in the game with him.", "granite3.1-dense:2b": "Marlon Brando famously turned down the iconic role of Don Corleone in \"The Godfather\" multiple times due to his reluctance to glorify the mafia, according to friend Budd Schulberg. His assistant noted that Brando wore various gangster-style mustaches during these refusals, resembling actors like George Raft. Eventually, Brando accepted the role, winning an Oscar in 1973 and sending a Native American woman to accept on his behalf to highlight indigenous issues. The Godfather's success revitalized Brando's career, leading to another Academy Award nomination for \"Last Tango in Paris.\" Post-death, Brando granted Electronic Arts the rights to use his voice and image in a Godfather video game, with co-stars James Caan and Robert Duvall also featuring in the project.", "chatgpt-4o-latest": "Marlon Brando initially rejected the role of Don Corleone in *The Godfather*, refusing to glorify the mafia. His assistant, Alice Marchak, noticed his growing interest when he began experimenting with gangster-style moustaches. Despite studio reluctance due to past on-set issues, Brando was asked to screen test and ultimately won the role, earning an Oscar in 1973, which he famously refused by sending a Native American activist in his place. His performance revived his career, leading to another Oscar nomination for *Last Tango in Paris*. Before his death, Brando granted Electronic Arts the rights to use his voice and image for a *Godfather* video game, with co-stars James Caan and Robert Duvall also reprising their roles.", "reference": "Brando was asked to screen test for the role in The Godfather, as studio executives were said to be reluctant for the actor to play the part following problems on the set of Brando's previous film Mutiny on the Bounty .Schulberg told the magazine that Brando's assistant realised the film star had warmed to the idea of The Godfather role when he sported a drawn-on pencil moustache and asked: \"How do I look?\"Late film star Marlon Brando is said to have repeatedly turned down his Oscar-winning role in The Godfather.The actor was nominated for an Oscar the following year for his role in Bernardo Bertolucci's Last Tango in Paris.Brando's co-stars from The Godfather, James Caan and Robert Duvall, will also reprise their roles for the video game, it was confirmed on Wednesday.Before his death, Brando granted gaming company Electronic Arts the rights to use his voice and image in a video game based on the Godfather film and book and recorded voice-overs which closely resembled his role as Don Corleone."}