{"raw_text": "Aviator 'creator' in Oscars snub\n \n The man who said he got Oscar-nominated movie The Aviator off the ground and signed up Leonardo DiCaprio has been shut out of the Academy Awards race.\n \n Charles Evans Jr battled over his role with the people who eventually made the film, and won a producer's credit. But he is not on the list of producers who can win a best film Oscar due to a limit on the number of nominees. The Oscars organisers have picked two of The Aviator's four producers to be nominated for best film.\n \n Up to three producers can be named per film but the studios behind The Aviator and Million Dollar Baby failed to trim their credits - so the Academy of Motion Pictures Arts and Sciences (Ampas) has done it for them. The Aviator's nominated producers are Michael Mann and Graham King - with Mr Evans and Sandy Climan, Mr Mann's former deputy, left off. Mr Evans sued Mr Mann in 2001, claiming he came up with the idea, spent years developing it and persuaded DiCaprio to play Hughes - but said he was later excluded from the project. The two sides settled out of court in a deal that has remained secret apart from the fact Mr Evans' name has appeared as a producer when the film's credits roll. At the Golden Globes, Mr Evans - who was named among the winners when the film won best drama film - evaded a security guard to have his photo taken with DiCaprio, director Martin Scorsese, Mr Mann and Mr King.\n \n Ampas decided to limit the number of producers who could be nominated after Shakespeare in Love's victory in 1999 saw five producers collect awards. The eligible names for The Aviator and Million Dollar Baby were decided by Ampas' producers branch executive committee on Wednesday. The decision also saw Clint Eastwood get his third personal nomination for Million Dollar Baby. He is now named in the best film category as well as being nominated for best director and best lead actor. The Academy Awards ceremony will be held in Hollywood on 27 February. Chinese actress Ziyi Zhang, star of Crouching Tiger, Hidden Dragon, Hero and House of Flying Daggers, is the latest name to be added to the list of presenters on the night.\n", "llama3.2:1b": "The man behind the film The Aviator has been nominated for a best film Oscar despite being excluded from the nominees due to his limited role in the production. Charles Evans Jr was initially credited as a producer but later had him removed. The Academy of Motion Pictures Arts and Sciences decided to limit the number of producers who could be nominated after The Aviator's five producers, including Mann and King, were allowed to receive awards.", "llama3.2:3b": "Charles Evans Jr was snubbed by the Academy Awards due to a limit on producers, with Michael Mann and Graham King nominated instead.", "gemma2:2b": "Charles Evans Jr., a producer who helped create The Aviator with Leonardo DiCaprio, has been excluded from the Oscars race despite being credited as a producer on the film.  Two producers were selected for nomination; Michael Mann and Graham King, while Charles Evans Jr. is not on the list of nominees. This decision came after past controversies surrounding the film's production and a precedent set following the Shakespeare in Love movie awards win. \n", "qwen2.5:0.5b": "The man who said he got Oscar-nominated movie \"The Aviator\" off the ground signed up Leonardo DiCaprio but was not included in the race due to a limitation on the number of nominees. The Academy of Motion Pictures Arts and Sciences (Ampas) narrowed down the list of producers for best film by setting three producers aside before the ceremony.", "qwen2.5:1.5b": "Charles Evans Jr., who oversaw The Aviator's production but was not nominated for directing, won a producer credit despite being excluded from Oscar nominations due to restrictions on producers shortlisted for best film Oscars.", "qwen2.5:3b": "The producer Charles Evans Jr., who helped secure Leonardo DiCaprio's role in 'The Aviator' and was given a producer credit, has been omitted from the best film Oscar nomination for his involvement due to Academy Awards rules limiting the number of producers per film. The nominated producers for best film are Michael Mann and Graham King, with Evans and Sandy Climan left off as they settled out of court in 2001 over their credits. This decision follows a similar one made after 'Shakespeare in Love' won five producer Oscars in 1999. Clint Eastwood has also received multiple nominations for his work on 'Million Dollar Baby'. The Academy Awards ceremony will take place on February 27th, with Chinese actress Ziyi Zhang among the presenters.", "opencoder:1.5b": "The man who said he got Oscar-nominated movie The Aviator off the ground and signed up Leonardo DiCaprio has been shut out of the Academy Awards race.\n\nCharles Evans Jr battled over his role with the people who eventually made the film, and won a producer's credit. But he is not on the list of producers who can win a best film Oscar due to a limit on the number of nominees. The Oscars organisers have picked two of The Aviator's four producers to be nominated for best film.\n\nUp to three producers can be named per film but the studios behind The Aviator and Million Dollar Baby failed to trim their credits - so the Academy of Motion Pictures Arts and Sciences (Ampas) has done it for them. The Aviator's nominated producers are Michael Mann and Graham King - with Mr Evans and Sandy Climan, Mr Mann's former deputy, left off.\n\nThe two sides settled out of court in a deal that has remained secret apart from the fact Mr Evans' name has appeared as a producer when the film's credits roll. At the Golden Globes, Mr Evans evaded a security guard to have his photo taken with DiCaprio, director Martin Scorsese, Mr Mann and Mr King.\n", "smollm:1.7b": "The Aviator was nominated by Charles Evans Jr., who played the role with Leonardo DiCaprio. The nomination was made possible due to a limit on the number of producers who could win an Oscar for Best Film, which is one of the five categories that make up the Academy Awards ceremony. This limitation means that there are only 25 nominees in total, and therefore no more than three producers can be nominated per film.\n\nThe nomination process was handled by the producers' branch executive committee, which decided on the eligible names for The Aviator and Million Dollar Baby. The committee also decided to limit the number of producers who could be nominated after Shakespeare in Love's victory in 1999 saw five producers collect awards. This meant that there were only five eligible names for Best Film at the time.\n\nThe nomination process was handled by the producers' branch executive committee, which made it possible for Ziyi Zhang to become a nominee for Best Actress in a Leading Role. The nomination is also one of the best film categories, and therefore it was decided that she would be nominated as well.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Charles Evans being excluded from the Oscars. Let me read through it again carefully.\n\nThe first sentence mentions that Charles Evans, who signed up Leonardo DiCaprio for The Aviator, has been shut out of the Oscars race. He's a 'creator' in the Oscars sense, which probably means he's considered an Oscar-winner here but isn't selected due to other constraints.\n\nNext, it says that Evans battled over his role and eventually got a producer's credit. But the problem is that the Academy has only picked two producers out of four who can win the best film Oscar because they have limits on the number of nominees each film can have now.\n\nThe text then explains how The Aviator's producers were Michael Mann, Graham King, Mr. Evans (with Mr. Climan stepping down from his deputy role), and Mr. Mann. So, Evans was among four, but Ampas only picked two for the awards this time.\n\nThere's also a legal aspect where Evans sued Mann in 2001 claiming he came up with the idea, spent years developing it, and convinced DiCaprio, but said he left after the project. They had a deal out of court, not publicized yet except when Evans took photos with others at the time.\n\nThe Golden Globes didn't change anyone's nominations; Michael Eastwood got his third nomination for Million Dollar Baby. The ceremony is in Hollywood on February 27. Ziyi Zhang has joined as one of the presenters.\n\nI need to make sure I capture all these points: Charles Evans being excluded due to a producer limit, the situation with Ampas's producer list, the lawsuit Evans filed against Mann, the public reaction at the ceremony, and the new addition from China.\n\nLet me structure this into a concise summary. Start by stating that Charles Evans was out of the race but then explain his role in the project. Mention the process of how the film got nominated despite Ampas's limits. Highlight the legal aspect where he sued and the public's response at the ceremony. Include the addition of Ziyi Zhang as another producer.\n\nI need to make sure it's plain text without any explanations or formatting, just the summary.\n</think>\n\nCharles Evans was excluded from the Oscars race for The Aviator but played a pivotal role in developing the film, with Mr. Mann suing him in 2001 after claiming he came up with the project idea and left after it failed. Ampas had only picked two producers out of four for this film, with Michael Mann stepping down from his role as co-writer. The ceremony was held in Hollywood on February 27, and Ziyi Zhang joined as another producer.", "tinyllama:1.1b": "The Oscar-nominated film The Aviator, which was produced by Charles Evans Jr, did not receive a single nomination in the Best Film category due to a limit on the number of nominations for producers. The Ampas decided to limit the names of producers who could be nominated after the success of Shakespeare in Love's victory in 1999, which saw five producers collect awards. However, Clint Eastwood was named in the Best Film category as well as receiving a third nomination for Million Dolar Baby. The ceremony will take place on February 27th and will see Chinese actress Ziyi Zhong, star of Crouching Tigers, Hidden Dragon, Hero, and House of Flying Daggers, added to the list of presenters.", "tinydolphin:1.1b": " A man who helped create The Aviator, a movie starring Leonardo DiCaprio and directed by Martin Scorsese, has been shut out of the Academy Awards nominations. This marks a significant snub for Charles Evans Jr., who is also involved in another film, Million Dollar Baby, which was nominated for two Oscars, including best picture. Ampas, the group responsible for selecting the nominees, made this decision after considering the available credits and determining that only three producers were eligible to be nominated. The decision is likely to enrage DiCaprio's fans, who have been campaigning for his involvement in both movies for years.", "phi:2.7b": " Aviator's creator Charles Evans Jr was snubbed by the Academy Awards for not being nominated as a producer due to an Oscars limit on the number of nominees per film. The award went to two producers of The Aviator, Michael Mann and Graham King, while Mr.Evans who had played a role in developing the movie is left off. He sued Mr.Mann in 2000 but has since settled out of court.\n", "orca-mini:3b": " Aviator creator Charles Evans Jr. sued producer Michael Mann in 2001, claiming he came up with the idea, spent years developing it and persuaded Leonardo DiCaprio to play Hughes, but later excluded from the project. The two sides settled out of court in a deal that has remained secret apart from the fact Evans' name appeared as a producer when the film's credits rolled at the Golden Globes.", "hermes3:3b": "Aviator creator (Charles Evans Jr) snubbed for Oscars; two of four producers nominated while others like Mann & King included. Organs restricted number of producer nominees after Shakespeare in Love's 5 winners.", "stablelm-zephyr:3b": "Charles Evans Jr., credited as the \"aviator creator\" for launching Leonardo DiCaprio in The Aviator, was shut out of the Academy Awards race due to a limit on the number of nominees for best film producer. Although he fought for recognition and received a producer's credit, his name won't appear among the winners. The Oscars organizers picked two of The Aviator's four producers – Michael Mann and Graham King – for best film nominations. The Academy of Motion Pictures Arts and Sciences (AMPAS) implemented this limitation after five producers collected awards in 1999 during Shakespeare in Love's run. Additionally, Clint Eastwood was nominated for three categories – best film, best director, and best lead actor – for Million Dollar Baby.", "stablelm2:1.6b": "Charles Evans Jr., who co-created the Oscar-nominated film \"The Aviator\" and signed Leonardo DiCaprio for the role, was excluded from the producer's category due to a limit in nominees set by the Academy Awards. Michael Mann and Graham King were chosen as one of four producers nominated for best film, leaving Evans and Sandy Climan off the list. Despite his claims of coming up with the idea and persuading DiCaprio, he sued Mann alleging that he was later excluded from the project. The two sides settled out of court in a deal that has been undisclosed except for Mr. Evans' name appearing as a producer when the film's credits roll. At the Golden Globes, Mr. Evans evaded a security guard to have his photo taken with DiCaprio, director Martin Scorsese, Mann and King. The eligible names for \"The Aviator\" and \"Million Dollar Baby\" were decided by Ampas' producers branch executive committee on Wednesday. The Academy Awards ceremony will be held in Hollywood on February 2nd. Chinese actress Ziyi Zhang is now added to the list of presenters at the event.", "granite3.1-dense:2b": "Charles Evans Jr., a key figure in The Aviator's production who claimed to have conceived the film idea and secured Leonardo DiCaprio for the lead role, was overlooked for an Oscar nomination due to a rule limiting producer nominations. The Academy of Motion Pictures Arts and Sciences (Ampas) selected only two producers – Michael Mann and Graham King – from the film's four, excluding Evans and Sandy Climan. This decision was made to prevent an excessive number of producers, following precedents set by films like Shakespeare in Love. Despite his exclusion, Evans' contributions were acknowledged at the Golden Globes when he was listed as a producer alongside DiCaprio, Martin Scorsese, Mann, and King. Meanwhile, Clint Eastwood's Million Dollar Baby also received three additional nominations, and Ziyi Zhang joined the list of presenters for the 78th Academy Awards, scheduled for February 27 in Hollywood.", "chatgpt-4o-latest": "Charles Evans Jr., who claimed to have initiated and developed *The Aviator* and secured Leonardo DiCaprio for the lead role, has been excluded from the Academy Awards nominations due to a limit on the number of producers eligible for the Best Film category. Despite winning a producer's credit after a legal battle with Michael Mann, only Mann and Graham King were selected as nominees, leaving Evans and Sandy Climan out. The Academy imposed this restriction after *Shakespeare in Love* had five producers win in 1999. Evans previously settled a lawsuit against Mann, ensuring his name appeared in the film’s credits. Meanwhile, Clint Eastwood received his third personal nomination for *Million Dollar Baby*, and Chinese actress Ziyi Zhang was announced as a presenter for the Oscars ceremony on February 27.", "reference": "Up to three producers can be named per film but the studios behind The Aviator and Million Dollar Baby failed to trim their credits - so the Academy of Motion Pictures Arts and Sciences (Ampas) has done it for them.At the Golden Globes, Mr Evans - who was named among the winners when the film won best drama film - evaded a security guard to have his photo taken with DiCaprio, director Martin Scorsese, Mr Mann and Mr King.The Oscars organisers have picked two of The Aviator's four producers to be nominated for best film.But he is not on the list of producers who can win a best film Oscar due to a limit on the number of nominees.Ampas decided to limit the number of producers who could be nominated after Shakespeare in Love's victory in 1999 saw five producers collect awards.The Aviator's nominated producers are Michael Mann and Graham King - with Mr Evans and Sandy Climan, Mr Mann's former deputy, left off."}