{"raw_text": "Church anger over Bollywood film\n \n Roman Catholic organisations in India have demanded the withdrawal of a film that depicts a priest having an affair with a girl half his age.\n \n Indian television channels are now refusing to run the promotional material for the film, Sins, ahead of its release on Friday. The director of the film, Vinod Pande, says the movie is not offensive and has refused to withdraw it. Catholics are planning a protest in Mumbai (Bombay) on Wednesday. The president of one of Mumbai's main Catholic organisations, Dolphy D'Souza, says the portrayal of an ordained priest as a man of loose moral character has hurt the religious sentiments of India's Catholic community.\n \n He called the film \"pornographic and sensational\". Mr D'Souza, who is also the vice-president of the Catholics' national body, has accused the director of the film of portraying a priest in bad light for commercial gains. Catholics have urged Mr Pande to withdraw the film to show respect to the Christian community's hurt sentiments. \"Religion needs to be a personal affair and should not be a subject for entertainment or for commercial use,\" Joseph Dias, general secretary of the Catholic Secular Forum, said in a statement.\n \n But Mr Pande said that if the critics were to see the film they would not protest against it and would not insist on its withdrawal. He says he has no plans to cancel the film ahead of its scheduled screening on Friday.\n \n \"It's about forbidden love. There was no agenda whatsoever to hurt anyone,\" he said. The BBC's Zubair Ahmed in Mumbai says that the controversial film shows a priest in steamy scenes with a girl half his age. She apparently goes to him for help but he falls in love with her. It takes place in the picturesque southern Indian state of Kerala. The film has already been cleared by the Censor Board with an 'A' (adults only) certificate. Mr D'Souza says he is shocked at the Censor Board's decision to clear the film. Our correspondent says that India's TV channels have so far refused to be dragged into the controversy and have not screened the film's promotional material. Most of the Catholic community's anger has come after watching newspaper advertisements and hoardings of the film. Christians make up about two per cent of India's population of more than a billion people.\n", "llama3.2:1b": "Church organizations in India are demanding the withdrawal of a Bollywood film due to its portrayal of an ordained priest as a man of loose moral character, with the Catholic community accusing it of hurting their religious sentiments and calling it \"pornographic and sensational\". The director of the film refuses to withdraw it, despite accusations that it is intended to offend.", "llama3.2:3b": "Roman Catholic organisations in India demand the withdrawal of a Bollywood film that depicts a priest having an affair with a girl half his age, calling it \"pornographic and sensational\". The director refuses to withdraw the film despite protests and TV channels refusing to screen promotional material.", "gemma2:2b": "Roman Catholic organizations in India are protesting the release of a film, \"Sins\", which depicts a priest having an affair with a young woman.  The film has been cleared for adults-only viewing and the production director claims there is no agenda to offend anyone. Catholic leaders say the portrayal of the priest in the film hurts religious sentiments, calling it offensive and sensationalist. TV channels have refused to air promotional material for the film due to the controversy. \n", "qwen2.5:0.5b": "The Catholic community in India is angry about a Bollywood film that depicts a priest having an affair with a girl half his age, causing controversy and criticism from Indian television channels and other religious organizations. The director of the film, Vinod Pande, says the movie is not offensive but refused to withdraw it. Catholics are planning a protest in Mumbai on Wednesday. The film has already been cleared by the Censor Board with an 'A' certificate.", "qwen2.5:1.5b": "Indian Catholics demand withdrawal of Bollywood film depicting a priest having an affair with a young girl, despite director denying it is offensive or commercial in nature. Angered Catholic leaders have planned protests and threatened to cancel the film ahead of its release on Friday. The controversy arises from the portrayal of a priest as morally lax, sparking anger within the community.", "qwen2.5:3b": "Roman Catholic organisations in India demand withdrawal of film depicting a priest having an affair with a minor. Promotional material for Sins is being refused by Indian television channels ahead of its Friday release. Catholics plan a protest in Mumbai; they accuse director Vinod Pande of portraying an ordained priest negatively for commercial reasons. However, Pande denies offensive intent and refuses to withdraw the film. The controversial movie shows a priest having steamy scenes with a minor girl in Kerala. It has already received an 'A' (adults only) certificate from India's Censor Board. Most Catholic community anger stems from newspaper advertisements and hoardings promoting the film, as they believe it violates religious sentiments.", "opencoder:1.5b": "The output of this text summarization task will be:\n\nRoman Catholic organisations in India have demanded the withdrawal of a film that depicts a priest having an affair with a girl half his age.\n\nIndian television channels are now refusing to run the promotional material for the film, Sins, ahead of its release on Friday. The director of the film, Vinod Pande, says the movie is not offensive and has refused to withdraw it. Catholics are planning a protest in Mumbai (Bombay) on Wednesday. The president of one of Mumbai's main Catholic organisations, Dolphy D'Souza, says the portrayal of an ordained priest as a man of loose moral character has hurt the religious sentiments of India's Catholic community.\n\nMr D'Souza, who is also the vice-president of the Catholics' national body, has accused the director of the film of portraying a priest in bad light for commercial gains. Catholics have urged Mr Pande to withdraw the film to show respect to the Christian community's hurt sentiments. \"Religion needs to be a personal affair and should not be a subject for entertainment or for commercial use,\" Joseph Dias, general secretary of the Catholic Secular Forum, said in a statement.\n\nBut Mr Pande said that if the critics were to see the film they would not protest against it and would not insist on its withdrawal. He says he has no plans to cancel the film ahead of its scheduled screening on Friday.\n\nThe BBC's Zubair Ahmed in Mumbai says that the controversial film shows a priest in steamy scenes with a girl half his age. She apparently goes to him for help but he falls in love with her. It takes place in the picturesque southern Indian state of Kerala. The film has already been cleared by the Censor Board with an 'A' (adults only) certificate. Mr D'Souza says he is shocked at the Censor Board's decision to clear the film.\n", "smollm:1.7b": "The Church anger over Bollywood film is due to the depiction of a priest having an affair with a girl half his age in the film Sins, which was released on Friday. The Indian television channels are now refusing to run the promotional material for the film Sins ahead of its release on Friday. The director of the film Vinod Pande has refused to withdraw the film and said that it is not offensive. Catholics are planning a protest in Mumbai on Wednesday against the depiction of an ordained priest as a man of loose moral character in the film Sins. Roman Catholic organisations in India have demanded the withdrawal of the film from circulation ahead of its release on Friday. The president of one of Mumbai's main Catholic organisation, Dolphy D'Souza has called the film \"pornographic and sensational\". Mr D'Souza says that if the critics were to see the film they would not protest against it and would not insist on its withdrawal. He says he has no plans to cancel the film ahead of its scheduled screening on Friday. The BBC's Zubair Ahmed in Mumbai says that the controversial film shows a priest in steamy scenes with a girl half his age. She apparently goes to him for help but he falls in love with her. It takes place in the picturesque southern Indian state of Kerala. The film has already been cleared by the Censor Board with an 'A' (adults only) certificate. Mr D'Souza says that India's TV channels have so far refused to be dragged into the controversy and have not screened the film's promotional material. Most of the Catholic community's anger has come after watching newspaper advertisements and hoardings of the film Sins, which was released on Friday. Christians make up about two per cent of India's population of more than a billion people.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about church anger over Bollywood film \"Sins.\" Let me read through it carefully.\n\nThe first paragraph talks about Roman Catholic organizations in India demanding the withdrawal of the film because it depicts a priest having an affair with someone half his age. This is seen as inappropriate or offensive.\n\nNext, the Indian TV channels are refusing to run the promotional material for Sins before it's released on Friday. The director says he won't withdraw it and that his film isn't offensive. However, some Catholics in Mumbai have a protest planned where they'll show their respect for Christian sentiments by not canceling the film.\n\nI see that Dolphy D'Souza, the vice-president of Mumbai's Catholic organizations, is calling the portrayal hurtful and comparing it to a romantic scene with a girl half his age. He mentions religious sensitivity about this kind of situation.\n\nReligious leaders like Joseph Dias from the Catholic Secular Forum are concerned about the film as it touches on forbidden love in Christian contexts. The director says critics won't protest against the film if they see it, so he's not canceling it just yet.\n\nThe BBC's Ahmed is calling the film's promotion controversial and shows a priest in steamy scenes. Censor Board has cleared it with an 'A' rating for adults only, but that might affect its audience. The Catholic population isn't very large compared to India's size, so their anger hasn't been as widespread yet.\n\nI need to keep just the summary, nothing else. I should make sure all key points are included: the film's topic is forbidden love in a Christian context; some Catholics are protesting against canceling it; religious leaders are concerned about its content; the film's promotion has already drawn attention from TV channels but hasn't been widely screened yet.\n</think>\n\nThe film \"Sins\" depicting a priest having an affair with someone half his age, seen as inappropriate or offensive in a Christian context, has caused church anger among Roman Catholic groups in India. Some have demanded the cancellation of the film to reflect respect for Christian sentiments. The Indian TV channels are refusing to run the promotional material before its release on Friday, despite directing the film not to be offensive. Religious leaders in Mumbai and other areas have criticized the portrayal of a priest as man-of-good moral character, comparing it to a romantic scene with a girl half his age. Censor Board has cleared the film with an 'A' rating for adults only, but this may limit its audience. The controversy is rooted in the depiction of forbidden love within religious contexts.", "tinyllama:1.1b": "The Roman Catholic organization Catolics in India have demanded the immediate withdrawal of a film that portrays a priest having an affair with a girl half his age. The director of the film, Vinod Pande, refuses to withdraw it and has called the depiction of an ordained priest as a man of loose morals \"pornographic\" and \"sensational\". Catolics have requested that the movie be removed from TV channels and shown only in private screenings. Critics say the film shows a priest in steamy scenes with a girl half his age, while many viewers say it takes place in picturesque southern Indian state of Kerala. The controversial film has already been cleared by India's CeNsa Board with an \"A\" certificate, and Catolic organizations have urged the director to withdraw the movie.", "tinydolphin:1.1b": " Indian television channels are now refusing to screen the movie promotional material for its release on Friday, despite facing backlash from Catholics who are planning protests against it. The film is based on a novel by renowned author J.M. Kerry and features an unrequited love story between a priest and a girl half his age. Critics argue that the portrayal of an ordained priest as a sexually active man is offensive to Catholics' religious sentiments, adding to their outrage over the film's content.", "phi:2.7b": " The summary is:\n\n- Church leaders in India are demanding the removal of a Bollywood film that portrays a priest having an affair with a girl half his age.\n- The director of the film has refused to withdraw it and claims it is not offensive or sensational, but a story of forbidden love.\n- Roman Catholic organisations have threatened to stage a protest in Mumbai on Wednesday over the portrayal of an ordained priest in bad light for commercial gains.\n- Indian television channels are also avoiding screening the promotional material for the film ahead of its release on Friday.\n", "orca-mini:3b": " The text reports on tensions between Catholic organizations in India and a Bollywood film titled \"Sins\" which depicts an ordained priest having an affair with a girl half his age. The director of the film has refused to withdraw it, stating that the movie is not offensive and has refused to do so. Catholics are planning a protest in Mumbai (Bombay) on Wednesday, calling for the film's withdrawal due to hurt religious sentiments. The film's controversial scenes showcase a priest in steamy scenes with a girl half his age, who he falls in love with. It is unclear if the Censor Board's decision to clear the film was influenced by the controversy or if it was meant to be a \"personal\" choice. Most of the Catholic community's anger has come after newspaper advertisements and hoardings of the film.", "hermes3:3b": "Church in India demands withdrawal of Bollywood film over priest portrayal as immoral, offends religious sentiments.", "stablelm-zephyr:3b": "Roman Catholic organizations in India have demanded the withdrawal of a Bollywood film, Sins, depicting a priest having an affair with a much younger girl. Indian television channels have refused to run promotional material for the film ahead of its release. The director, Vinod Pande, stands by his movie and refuses to withdraw it. Catholics plan protests in Mumbai and are accusing the director of portraying a priest in bad light for commercial gain. However, Pande believes that if critics see the film, they would not protest against it or demand its withdrawal. The film has already been cleared by India's Censor Board with an 'A' (adults only) certificate.", "stablelm2:1.6b": "Roman Catholic organizations in India are protesting against a Bollywood film called \"Sins\" due to its portrayal of an ordained priest as a man with loose moral character. The film has already been cleared by the Censor Board with an 'A' certificate, but Indian television channels and some Catholic groups are refusing to run promotional material or show interest in airing the film before its release on Friday. Critics argue that the movie is \"pornographic\" and \"sensational,\" while the director claims it is a story of forbidden love without any agenda to hurt anyone.", "granite3.1-dense:2b": "Roman Catholics in India are protesting the release of the Bollywood film \"Sins,\" which depicts a priest engaging in an affair with a young girl. The director, Vinod Pande, maintains that the movie is not offensive and has no plans to withdraw it. Catholic leaders, including Dolphy D'Souza, the president of one major Indian Catholic organisation, have termed the film \"pornographic\" and \"sensational,\" accusing Pande of portraying a priest in a negative light for commercial gain. They urge Pande to respect the hurt sentiments of the Christian community by withdrawing the film. The Censor Board in India has approved the film with an 'A' certificate, allowing only adult viewers, which has further fueled the controversy. Despite this, Indian television channels have refused to broadcast promotional material for \"Sins,\" and a protest is planned in Mumbai on Wednesday. Christians constitute approximately two percent of India's population over 1.3 billion people.", "chatgpt-4o-latest": "Roman Catholic organisations in India are demanding the withdrawal of the Bollywood film *Sins*, which depicts a priest having an affair with a much younger woman. Indian TV channels have refused to air its promotional material, and Catholics plan to protest in Mumbai. Catholic leaders, including Dolphy D'Souza, argue that the film is offensive, pornographic, and commercially exploitative, hurting religious sentiments. Director Vinod Pande insists the film is about \"forbidden love\" and denies any intent to offend, refusing to cancel its release. The film, set in Kerala, has been cleared by the Censor Board with an 'A' certificate. India's Catholic community, which constitutes about two percent of the population, is particularly angered by the film's advertisements rather than the film itself.", "reference": "The director of the film, Vinod Pande, says the movie is not offensive and has refused to withdraw it.He says he has no plans to cancel the film ahead of its scheduled screening on Friday.Mr D'Souza says he is shocked at the Censor Board's decision to clear the film.Catholics have urged Mr Pande to withdraw the film to show respect to the Christian community's hurt sentiments.Mr D'Souza, who is also the vice-president of the Catholics' national body, has accused the director of the film of portraying a priest in bad light for commercial gains.The BBC's Zubair Ahmed in Mumbai says that the controversial film shows a priest in steamy scenes with a girl half his age.Most of the Catholic community's anger has come after watching newspaper advertisements and hoardings of the film.Roman Catholic organisations in India have demanded the withdrawal of a film that depicts a priest having an affair with a girl half his age.But Mr Pande said that if the critics were to see the film they would not protest against it and would not insist on its withdrawal."}