{"raw_text": "Oscar nominee Dan O'Herlihy dies\n \n Irish actor Dan O'Herlihy, who was nominated for best actor at the 1955 Oscars, has died at the age of 85.\n \n O'Herlihy, whose Oscar nomination was for Luis Bunuel's The Adventures of Robinson Crusoe, died at his home in Malibu, California, a spokesman said. The actor began his film career in the 1940s, playing Macduff to Orson Welles' Macbeth in 1948, and was also a regular in on the Dublin stage. He later appeared in Robocop and its sequel and cult TV show Twin Peaks. He played the CEO of Omni Consumer Products in 1987's Robocop and Robocop 2 three years later, and was saw mill owner Andrew Packard in Twin Peaks, also in 1990. Despite his Oscar nomination, he had few other lead roles and became a familiar supporting actor on TV and in film. The year he was nominated, the Academy Award was won by Marlon Brando for On the Waterfront.\n", "llama3.2:1b": "Dan O'Herlihy dies at age 85, nominated for best actor at the 1955 Oscars for Luis Bunuel's The Adventures of Robinson Crusoe, and played supporting roles in Robocop (1987) and Twin Peaks (1990).", "llama3.2:3b": "Dan O'Herlihy, Irish actor nominated for 1955 Oscars, has died at age 85 in Malibu, California, after a career spanning multiple decades with notable roles in Macbeth and Robocop, as well as appearances on stage and TV.", "gemma2:2b": "Dan O'Herlihy, an Irish actor who received an Oscar nomination for his role in the 1955 film *The Adventures of Robinson Crusoe*, has died at age 85.  He began his career in the 1940s and appeared in various films and TV shows including *Robocop* and *Twin Peaks*.  \n", "qwen2.5:0.5b": "Irish actor Dan O'Herlihy died at 85 years old at his home in Malibu, California. He played Macduff to Orson Welles' Macbeth in 1948 and later appeared in Robocop and Twin Peaks. Despite winning an Oscar nomination, he had few other lead roles and was a regular on TV and in film.", "qwen2.5:1.5b": "Irish actor Dan O'Herlihy, 85, dies at his home in Malibu; Oscar nominee known for \"Robocop\" and \"Twin Peaks.\"", "qwen2.5:3b": "Irish actor Dan O'Herlihy, who was nominated for best actor at the 1955 Oscars for Luis Bunuel's \"The Adventures of Robinson Crusoe,\" died at age 85 in Malibu, California. He began his career in the 1940s and appeared in films such as \"Robocop\" and \"Twin Peaks.\" Despite the Oscar nomination, he had few lead roles but became a familiar supporting actor on TV and in film. In 1955, Marlon Brando won the Academy Award for On the Waterfront.", "opencoder:1.5b": "O’Herlihy, a British actor, who was nominated for the 1955 Oscars as a best actor, died at age 85. His Oscar nomination for The Adventures of Robinson Crusoe was also announced in 1962 and the film's director, director Robert Zemeckis, ended it with a Grammy Nomination.\n", "smollm:1.7b": "Oscar nominee Dan O'Herlihy died at the age of 85. Irish actor Dan O'Herlihy, who was nominated for Best Actor at the 1955 Oscars, has passed away at his home in Malibu, California.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Dan O'Herlihy's death. Let me read through it first.\n\nThe text says Oscar-nominated actor Dan O'Herlihy died at 85 in California. He started his film career in the 1940s and was a regular on TV shows and movies, particularly Robocop and Twin Peaks. He had an nomination for Luis Bunuel's The Adventures of Robinson Crusoe but no other big roles. The Academy Award that year was won by Marlon Brando for On the Waterfront.\n\nSo, I need to capture all these key points in a concise summary without any extra info or explanations. Let me list out the important details:\n\n1. Dan O'Herlihy's death: Age 85, died at home in Malibu, CA.\n2. His Oscar nomination for Best Actor, won by Marlon Brando.\n3. His film career started in the 40s and worked on Robocop.\n4. He appeared in Twin Peaks, Robocop II, and as a TV host.\n5. Had an nomination but no big roles beyond The Adventures of Robinson Crusoe.\n6. His legacy is prominent due to his Oscar nod despite few other leads.\n\nI should make sure the summary includes these elements without getting too detailed. I'll structure it by starting with his death details, then his Oscar win and role in the film, followed by his career background, work on Robocop and Twin Peaks, and mention of his legacy.\n</think>\n\nDan O'Herlihy, a prominent Oscar-winning actor who received the Best Actor nomination for *The Adventures of Robinson Crusoe*, passed away at 85 years old in Malibu, California. Known for his film Career starting in the 1940s and regular roles on Robocop and later Twin Peaks, he became synonymous with the show through his TV work.", "tinyllama:1.1b": "Irish actor Dan O'Herlihy, who gained fame for his Oscar-nominated performance as a lead actor in 1955 film Robinson Crusoe, has passed away at the age of 85. He had also appeared in several other notable films over the years, including roles in The Adventures of Robinson Crusoe and Luis Bunuel's Twinspeaks. Despite his nomination for a best actor award, O'Herlihy had few leading roles in film and television, becoming well-known primarily for supporting performances. His death came shortly before the 70th annual Academy Awards ceremony, where he would have been nominated again this year in the category of best actor.", "tinydolphin:1.1b": " Dan O'Herlihy, an Irish actor who made his mark with his role as Macbeth, passed away at the age of 85. He received an Oscar nomination in 1955 for his portrayal of the character, which also gave rise to a famous line – \"There's none so blind, as those who will not see.\"", "phi:2.7b": " Irish actor Dan O'Herlihy, who played Macduff to Orson Welles' Macbeth in \n", "orca-mini:3b": " Irish actor Dan O'Herlihy, known for his role as Macduff in Orson Welles' Macbeth, died at the age of 85. He was nominated for the Best Actor Oscar in 1955 for his performance in Luis Bunuel's The Adventures of Robinson Crusoe.", "hermes3:3b": "Dan O'Herlihy dies at 85, Irish actor nominated for Best Actor at 1955 Oscars, known for roles in Robocop, Twin Peaks etc.", "stablelm-zephyr:3b": "Irish actor Dan O'Herlihy, nominated for best actor at the 1955 Oscars for Luis Bunuel's The Adventures of Robinson Crusoe, has passed away at 85. He began his film career in the 1940s and appeared in numerous well-known productions, including Macbeth with Orson Welles, Robocop and its sequels, Twin Peaks, and RoboCop 2. Despite his Oscar nomination, he was primarily a supporting actor in both TV and film.", "stablelm2:1.6b": "Irish actor Dan O'Herlihy, who appeared in films like The Adventures of Robinson Crusoe and Robocop, passed away at his home in Malibu, California. He was 68 when he died due to undisclosed causes. Known for supporting roles on TV and film, O'Herlihy began his career with appearances in Dublin stage productions.", "granite3.1-dense:2b": "Irish actor Dan O'Herlihy, 85, died at his Malibu home. Nominated for Best Actor at the 1955 Oscars for Luis Bunuel's The Adventures of Robinson Crusoe, he began his film career in the 1940s, notably playing Macduff to Orson Welles' Macbeth. Known as a supporting actor, O'Herlihy appeared in Robocop and its sequel, portraying the CEO of Omni Consumer Products, and in Twin Peaks as Andrew Packard. Despite his Oscar nomination, he had limited leading roles, with most appearances being in TV and film supporting parts. The Academy Award for Best Actor in 1955 went to Marlon Brando for On the Waterfront.", "chatgpt-4o-latest": "Irish actor Dan O'Herlihy, nominated for best actor at the 1955 Oscars for The Adventures of Robinson Crusoe, has died at 85 in Malibu, California. Beginning his career in the 1940s, he played Macduff in Orson Welles' Macbeth and was active in Dublin theatre. He later appeared in Robocop, Robocop 2, and Twin Peaks. Despite his Oscar nomination, he primarily had supporting roles in film and TV. The 1955 Oscar went to Marlon Brando for On the Waterfront.", "reference": "Irish actor Dan O'Herlihy, who was nominated for best actor at the 1955 Oscars, has died at the age of 85.He played the CEO of Omni Consumer Products in 1987's Robocop and Robocop 2 three years later, and was saw mill owner Andrew Packard in Twin Peaks, also in 1990.The year he was nominated, the Academy Award was won by Marlon Brando for On the Waterfront."}