{"raw_text": "God cut from Dark Materials film\n \n The director and screenwriter of the film adaptation of Philip Pullman's His Dark Materials is to remove references to God and the church in the movie.\n \n Chris Weitz, director of About a Boy, said the changes were being made after film studio New Line expressed concern. The books tell of a battle against the church and a fight to overthrow God. \"They have expressed worry about the possibility of perceived anti-religiosity,\" Weitz told a His Dark Materials fans' website. Pullman's trilogy has been attacked by some Christian teachers and by the Catholic press as blasphemy. Weitz, who admitted he would not be many people's first choice to direct the films, said he regarded the film adaptation as \"the most important work of my life\".\n \n \"In part because it is one of the few books to have changed my life,\" he told bridgetothestars.net. The award-winning trilogy - Northern Lights, The Subtle Knife and The Amber Spyglass - tell the story of Oxford school child Lyra Belacqua. She is drawn into an epic struggle against the Church, which has been carrying out experiments on children in an attempt to remove original sin.\n \n As the books progress the struggle turns into a battle to overthrow the Authority, a figure who is God-like in the books. Weitz, who directed American Pie and About A Boy, said New Line feared that any anti-religiosity in the film would make the project \"unviable financially\". He said: \"All my best efforts will be directed towards keeping the film as liberating and iconoclastic an experience as I can. \"But there may be some modification of terms.\"\n \n Weitz said he had visited Pullman, who had told him that the Authority could \"represent any arbitrary establishment that curtails the freedom of the individual, whether it be religious, political, totalitarian, fundamentalist, communist, what have you\". He added: \"I have no desire to change the nature or intentions of the villains of the piece, but they may appear in more subtle guises.\" There are a number of Christian websites which attack the trilogy for their depiction of the church and of God, but Pullman has denied his books are anti-religious. His agent told the Times newspaper that Pullman was happy with the adaptation so far. \"Of course New Line want to make money, but Mr Weitz is a wonderful director and Philip is very supportive. \"You have to recognise that it is a challenge in the climate of Bush's America,\"\n", "llama3.2:1b": "Chris Weitz will remove references to God and the church from the film adaptation of His Dark Materials. The changes are being made due to concerns about perceived anti-religiosity, which has been criticized by some Christian groups and media outlets. Weitz, who directed American Pie and About A Boy, had previously expressed reservations about directing a project that would be seen as anti-religious.", "llama3.2:3b": "The director of the His Dark Materials film adaptation, Chris Weitz, plans to remove references to God and the church from the movie due to concerns expressed by New Line. This decision comes after the books were attacked as blasphemous by some Christian groups. Weitz stated that he aimed to maintain the film's liberating and iconoclastic tone while making modifications to avoid financial viability issues.", "gemma2:2b": "The film adaptation of Philip Pullman's His Dark Materials will remove references to God and the church due to concerns from film studio New Line about potential anti-religious messaging.  Director Chris Weitz, while acknowledging his preference for focusing on \"liberating and iconoclastic\" themes, modified the narrative to avoid any perceived bias against religion. The books describe a struggle against religious figures and institutions, with the characters challenging the authority that is akin to God in power. Despite some potential changes in depiction, Pullman remains supportive of the adaptation. \n", "qwen2.5:0.5b": "The film adaptation of Philip Pullman's His Dark Materials will avoid references to God and the church in its story. Chris Weitz, who directed About A Boy, said New Line expressed concern about this. He added that he would not be his first choice to direct the films. The award-winning trilogy \"His Dark Materials\" tells the story of Lyra Belacqua, an Oxford schoolgirl drawn into a struggle against the Church and its Authority figure, represented by God-like authority figures. The film will have a liberating and iconoclastic experience for viewers.", "qwen2.5:1.5b": "The director of The Godfather trilogy version of His Dark Materials has been instructed by his studio to remove references to God and Christianity from the movie adaptation, citing concerns about perceived anti-religiosity among some viewers.", "qwen2.5:3b": "The film adaptation of Philip Pullman's His Dark Materials will omit references to God and the church due to studio New Line's concern about perceived anti-religiosity. Directed by Chris Weitz, who admits he might not be initially chosen for such projects, the story follows Lyra Belacqua as she becomes entangled in a struggle against the Church. The books detail battles against religious institutions like the Authority, depicted as divine-like figures suppressing freedom. New Line fears any anti-religious elements could make the project financially unviable. Weitz aims to preserve the film's liberation and iconoclasm while possibly altering terms of representation for characters, drawing inspiration from Pullman who sees the Authority as representing arbitrary establishments regardless of their nature.", "opencoder:1.5b": "God cut from Dark Materials film\n\nThe director and screenwriter of the film adaptation of Philip Pullman's His Dark Materials are to remove references to God and the church in the movie.\n\nChris Weitz, director of About a Boy, has made changes after film studio New Line expressed concerns about the possibility of perceived anti-religiosity. The books tell of a battle against the church and a fight to overthrow God. \"They have expressed worry about the possibility of perceived anti-religiosity,\" Weitz told a His Dark Materials fans' website.\n\nPullman's trilogy has been attacked by some Christian teachers and by the Catholic press as blasphemy, who directed American Pie and About A Boy. Weitz, who admitted he would not be many people's first choice to direct the films, said he regarded the film adaptation as \"the most important work of my life\".\n\nIn part because it is one of the few books to have changed my life, he told bridgetothestars.net. The award-winning trilogy - Northern Lights, The Subtle Knife and The Amber Spyglass - tell the story of Oxford school child Lyra Belacqua. She is drawn into an epic struggle against the Church, which has been carrying out experiments on children in an attempt to remove original sin.\n\nAs the books progress, the struggle turns into a battle to overthrow the Authority, a figure who is God-like in the books. Weitz, who directed American Pie and About A Boy, said New Line fears that any anti-religiosity in the film would make the project \"unviable financially\". He said: \"All my best efforts will be directed towards keeping the film as liberating and iconoclastic an experience as I can. But there may be some modification of terms.\"\n\nWeitz added he had visited Pullman, who told him that the Authority could \"represent any arbitrary establishment that curtails the freedom of the individual, whether it be religious, political, totalitarian, fundamentalist, communist, what have you\". He said: \"I have no desire to change the nature or intentions of the villains of the piece, but they may appear in more subtle guises. There are a number of Christian websites which attack the trilogy for their depiction of the church and of God, but Pullman has denied his books are anti-religious. His agent told the Times newspaper that Pullman was happy with the adaptation so far.\"\n", "smollm:1.7b": "The summary should preserve key ideas and details from the original text. The main points are:\n\n1. God cut from Dark Materials film - The director and screenwriter of the film adaptation of Philip Pullman's His Dark Materials is to remove references to God and the church in the movie.\n2. Chris Weitz, director of About a Boy - Chris Weitz, director of About a Boy, said the changes were being made after film studio New Line expressed concern. The books tell of a battle against the church and a fight to overthrow God. \"They have expressed worry about the possibility of perceived anti-religiosity,\" Weitz told a His Dark Materials fans' website. Pullman's trilogy has been attacked by some Christian teachers and by the Catholic press as blasphemy.\n3. In part because it is one of the few books to have changed my life - The award-winning trilogy - Northern Lights, The Subtle Knife and The Amber Spyglass - tell the story of Oxford school child Lyra Belacqua. She is drawn into an epic struggle against the Church, which has been carrying out experiments on children in an attempt to remove original sin.\n4. As the books progress the struggle turns into a battle to overthrow the Authority - In part because it is one of the few books to have changed my life, Weitz said he would not be many people's first choice to direct the films. He regarded the film adaptation as \"the most important work of my life\".\n5. The Authority could represent any arbitrary establishment that curtails the freedom of the individual - Weitz said he has no desire to change the nature or intentions of the villains of the piece, but they may appear in more subtle guises. There are a number of Christian websites which attack the trilogy for their depiction of the church and of God, but Pullman has denied his books are anti-religious.\n6. The trilogy is not about God - Weitz said he would not be many people's first choice to direct the films. He regarded the film adaptation as \"the most important work of my life\".\n7. There may be some modification of terms - Weitz said he had visited Pullman, who had told him that the Authority could represent any arbitrary establishment that curtails the freedom of the individual, whether it be religious, political, totalitarian, fundamentalist, what have you. He added: \"I have no desire to change the nature or intentions of the villains of the piece, but they may appear in more subtle guises.\" There are a number of Christian websites which attack the trilogy for their depiction of the church and of God, but Pullman has denied his books are anti-religious.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help the user by summarizing this text concisely while preserving the key ideas and details. The user has provided a query where they want only the summary as plain text without any explanations or formatting.\n\nFirst, I'll read through the entire text to understand its main points. It's about a film adaptation of Philip Pullman's book series \"His Dark Materials.\" The summary should highlight the film's focus on removing references to God and the church, the director's decision after New Line expressed concerns about perceived anti-religiosity, and the reception of the trilogy by Christian groups.\n\nI'll make sure to include all the important details: the director is Chris Weitz from \"About a Boy,\" his decision against religious content in the film, the book's themes of Church Experiment and God, the criticism from Christian teachers and Catholic press, Pullman's own statement about it being his most important work, and how the trilogy was received by many Christians despite its religious undertones.\n\nI need to ensure the summary is concise, avoiding any markdown or extra information. It should be a straightforward overview of the film adaptation changes regarding religion.\n</think>\n\nThe film adaptation of Philip Pullman's \"His Dark Materials\" removes references to God and the church. Director Chris Weitz from \"About a Boy\" removed religious content after concerns were expressed by New Line about anti-religious themes in the books, which tell of a battle against the church and an attempted overthrow of God. The trilogy, now an award-winning film, has faced criticism from Christian teachers and Catholic press as blasphemy to faith. Weitz, who is also known for directing \"American Pie\" and \"About a Boy,\" described it as his most important work. Christian websites attacked the books for depicting the church and God, but Pullman denied anti-religious views. The film's success in challenging religious narratives has been praised by many Christians.", "tinyllama:1.1b": "The director Chris Weitz has removed references to God and the church from the movie adaptation of Philip Pullmans's His Dark Materials, according to his comments about the films in a His Dark Materials fan website. The change was made after New Line, the studio behind the film, expressed concerns over perceived anti-religiosity. Despite Pullmans's reassurances that his books do not contain any vilification of God or the church, some Christian websites have criticized the triology for their portrayal of the Authority as a fundamentalist institution with power over others. Despite this critique, Pullmans confirmed to bridgetotthestarst.net that the film adaptation remains his preferred version, despite the \"challenges\" it has faced in adapting his books into cinema.", "tinydolphin:1.1b": " In response to new concerns over the portrayal of religion in the film adaptation of His Dark Materials, director Chris Weitz has announced that certain references to God and the church will be removed from the movie. The decision comes after film studio New Line expressed concerns about potential anti-religiosity sentiment and requested changes to the film's script.\n\nThe author of the trilogy, Philip Pullman, has also expressed his support for the changes being made. Pullman's books, which are based on a battle between a group of Oxford students and the Church, have been criticized by some Christian teachers and by the Catholic press as blasphemous. The director, Chris Weitz, stated that he would not be the first choice to direct the film.\n\n\"In part because it is one of the few books to have changed my life,\" Weitz told Bridgetown Stars. \"I am one of the few directors who has never made a movie before, and this opportunity is the most important work of my life.\" \n\n\"In part because it is one of the few books to have changed my life,\" he added. The award-winning trilogy - Northern Lights, The Subtle Knife, and The Amber Spyglass - tells the story of Oxford school child Lyra Belacqua. She is drawn into an epic struggle against the Church, which has been carrying out experiments on children in an attempt to remove original sin. \n\nAs the books progress, the struggle turns into a battle to overthrow the Authority, a figure who is God-like in the books. Weitz said that he had received feedback from New Line suggesting that some modification of terms was needed. \"But there may be some modification of terms,\" he added.", "phi:2.7b": " Chris Weitz has decided to remove references to God and the church from the film adaptation of His Dark Materials due to concerns expressed by New Line, the film studio. The books tell of a struggle against the Church and a fight to overthrow God. Director Chris Weitz believes that any anti-religiosity in the film would make it financially unviable. Weitz will modify terms but has no desire to change the nature or intentions of the villains. There are Christian websites which attack the trilogy for its depiction of the church and God, but Pullman denies his books are anti-religious. His agent is happy with the adaptation so far.\n", "orca-mini:3b": " The director and screenwriter of the film adaptation of Philip Pullman's His Dark Materials are removing references to God and the church in the movie. This decision was made after film studio New Line expressed concern about the perceived anti-religiosity of the books.", "hermes3:3b": "Dark Materials film director removes God references due to studio concern, per New Line's worry about perceived anti-religiosity.", "stablelm-zephyr:3b": "The director of the film adaptation of Philip Pullman's His Dark Materials will remove references to God and the church due to concerns from film studio New Line. Chris Weitz, director of About a Boy, stated that he regards the film adaptation as \"the most important work of my life\" but understands the need for modifications to avoid perceived anti-religiosity. Pullman has denied that his books are anti-religious and is happy with the adaptations made so far.", "stablelm2:1.6b": "Director Chris Weitz will remove references to God and the church from the film adaptation of His Dark Materials due to concerns from film studio New Line, who expressed worry about anti-religious content. The trilogy by Philip Pullman tells the story of an epic struggle against a church carrying out experiments on children. As the story progresses, it becomes a battle to overthrow the Authority, representing God-like in the books. Weitz plans to modify terms while maintaining the film's anti-religiosity and iconoclastic nature.", "granite3.1-dense:2b": "Chris Weitz, director of the film adaptation of Philip Pullman's His Dark Materials trilogy, plans to modify references to God and the church in response to concerns from film studio New Line about potential anti-religious perception. The books depict a struggle against a powerful, church-like organization known as the Authority, which seeks to eliminate original sin through child experiments. Weitz, who regards the project as his most significant work, aims to maintain the films' liberating and iconoclastic essence while subtly altering the portrayal of the villainous forces. Despite some Christian criticism, Pullman is reportedly supportive of the adaptation, acknowledging the commercial challenges in today's climate, particularly under President Bush's administration.", "chatgpt-4o-latest": "The film adaptation of Philip Pullman’s *His Dark Materials*, directed by Chris Weitz, will remove references to God and the church due to concerns from studio New Line about potential backlash and financial viability. The books depict a battle against the church and an effort to overthrow a God-like figure, which has led to criticism from some Christian groups. Weitz, who considers the project highly significant, aims to maintain the film’s liberating and iconoclastic spirit while making some modifications. Pullman has stated that the Authority in his books represents any oppressive establishment, not just religious ones, and he supports the adaptation. His agent acknowledged the challenges of adapting the story in the political climate of the time.", "reference": "Chris Weitz, director of About a Boy, said the changes were being made after film studio New Line expressed concern.There are a number of Christian websites which attack the trilogy for their depiction of the church and of God, but Pullman has denied his books are anti-religious.The director and screenwriter of the film adaptation of Philip Pullman's His Dark Materials is to remove references to God and the church in the movie.Weitz, who directed American Pie and About A Boy, said New Line feared that any anti-religiosity in the film would make the project \"unviable financially\".The books tell of a battle against the church and a fight to overthrow God.Weitz, who admitted he would not be many people's first choice to direct the films, said he regarded the film adaptation as \"the most important work of my life\".\"They have expressed worry about the possibility of perceived anti-religiosity,\" Weitz told a His Dark Materials fans' website.Weitz said he had visited Pullman, who had told him that the Authority could \"represent any arbitrary establishment that curtails the freedom of the individual, whether it be religious, political, totalitarian, fundamentalist, communist, what have you\"."}