{"raw_text": "REM concerts blighted by illness\n \n US rock band REM have been forced to cancel concerts after bass player Mike Mills was taken to hospital suffering from \"severe flu-like symptoms\".\n \n The band were forced to cut short Monday night's show in Sheffield, and have cancelled Tuesday's Glasgow date. Mills could \"hardly stand up, let alone play\", said an REM spokesman, who added he is now \"resting\" in hospital. The remainder of the band played a short acoustic set on Monday. Tuesday's gig has been rescheduled for 15 June. Those who had a ticket for the show in Glasgow are being advised to retain their ticket stub so they can attend the new date. The band's spokesman said that they would review their remaining dates on a \"day-to-day basis\", based on doctors' advice to Mills. \"Obviously we all want Mike to get better, and clearly we all want to play the shows. Rest assured we will do so as soon as possible,\" he said.\n \n The band were still hopeful they would be able to make their Wednesday date, added the spokesman. REM played accoustic versions of their hits Losing My Religion, I've Been High, Leaving New York and The One I Love to the Sheffield Arena audience on Monday. The band had originally been scheduled to play four dates in the UK as part of a world tour. In 1995 former drummer Bill Berry collapsed in Switzerland while the band was on tour, having suffered a ruptured aneurysm. He made a full recovery, only to leave the band two years later.\n", "llama3.2:1b": "US rock band REM have been forced to cancel concerts due to bassist Mike Mills' severe flu-like symptoms and hospitalization. The band's spokesman said Mills is currently \"resting\" in hospital and may not be able to play for some time. Despite this, the remaining shows will go ahead as planned on June 15. Those who attended Monday night's show in Sheffield were advised to retain their ticket stubs.", "llama3.2:3b": "REM has cancelled concerts due to bass player Mike Mills' severe flu-like symptoms, which have left him unable to perform. The remaining shows in Sheffield and Glasgow have been rescheduled for June 15. The band will review their dates on a day-to-day basis based on doctors' advice.", "gemma2:2b": "REM canceled shows in Sheffield and Glasgow due to bass player Mike Mills' severe flu-like symptoms.  Tuesday's rescheduled concert will take place on June 15th. The band is hopeful of playing their Wednesday date as well.  Mills is resting in hospital. \n", "qwen2.5:0.5b": "REM rock band REM, which consisted of Mike Mills and the rest of their band members, have been forced to cancel concerts due to Mike Mills' severe flu-like symptoms that rendered him unable to continue playing. They are rescheduling two future dates for Tuesday and 15 June. The band was still hopeful they could make a third date after Monday's gig in Sheffield.", "qwen2.5:1.5b": "REM cancelled concerts due to bass player Mike Mills' flu-like symptoms; he is now resting at the hospital; plans for June 15 show rescheduled from Glasgow; audience members of previous date should retain ticket stubs for potential reattendance on June 15; original UK tour dates are being reassessed based on doctors' advice.", "qwen2.5:3b": "US rock band REM cancelled concerts after bass player Mike Mills was hospitalized with severe flu-like symptoms. They cut short their show in Sheffield and canceled the following night's gig in Glasgow. Mills is now resting at the hospital. The remainder of the band played an acoustic set on Monday, with Tuesday's gig rescheduled for June 15. The spokesman indicated that they would review remaining dates based on doctors' advice to Mills. REM was initially scheduled to play four UK shows as part of a world tour. In 1995, former drummer Bill Berry had collapsed during the band's tour due to an aneurysm but fully recovered and left the band two years later.", "opencoder:1.5b": "REM concerts blighted by illness\n\nThe US rock band REM have been forced to cancel their concert Mondays and Tuesdays after the bass player Mike Mills was taken to hospital suffering from \"severe flu-like symptoms\". They were forced to shorten the show on Mondays night in Sheffield, and cancelled Tuesdays' date on Tuesday. Mills could hardly stand up, he added. The remainder of the band played a short acoustic set on Monday. On Tuesday, they rescheduled the gig for 15 June. Those who had a ticket in Glasgow are advised to keep their ticket stub so they can attend the new date. The band's spokesman said they would review their remaining dates based on doctors' advice to Mills, obviously we all want Mike to get better and clearly we all want to play the shows. He assured us they will do so as soon as possible.\n", "smollm:1.7b": "The summary is concise and preserves key ideas and details from the original text. The main points are:\n\n* Concerts blighted by illness: US rock band REM have been forced to cancel concerts after bass player Mike Mills was taken to hospital suffering from \"severe flu-like symptoms\".\n* Illness affects entire band: The illness affected the entire band, including guitarist John Deacon and drummer Bill Berry.\n* Concert cancelled: The band cancelled their Monday night show in Sheffield, and have cancelled Tuesday's Glasgow date.\n* Mike Mills' health: Mike Mills was forced to cut short his concert at Sheffield on Monday night due to illness, and has since been \"hardly standing up\", said an REM spokesperson. He is now \"resting\" in hospital with severe flu-like symptoms.\n* Remainder of band plays acoustic set: The remaining members of the band played a short acoustic set on Monday evening, but did not perform live.\n* Concert cancelled for 15 June: The band will review their remaining dates on a \"day-to-day basis\", based on doctors' advice to Mike Mills. They are still hopeful they can make their Wednesday date, added the spokesman.\n* Remainder of band plays acoustic versions: The remaining members of the band played acoustic versions of their hits, including Losing My Religion and I've Been High.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about REM concerts being canceled because of Mike Mills' health issues. Let me read through it again.\n\nThe first paragraph mentions that REM bands have been forced to cancel shows in Sheffield and Glasgow due to Mills' severe flu-like symptoms. They were supposed to play Monday night and Tuesday's date, but now they're cancelling both shows. Mills is probably not going to perform because he's not standing up well. The band's spokesman said Mike can't stand or play, so they cut the sets.\n\nThen it says the rest of the band played a short acoustic set on Monday night, which was canceled for their next performance on June 15th. They're rescheduling this date and keeping ticket stubs for those who got tickets from Glasgow. The spokesman also mentioned that they'll review remaining dates based on doctors' advice.\n\nNext, it says the band is hopeful to make Wednesday's date but still expects them to play. They had a full tour planned in 1995 with Bill Berry, who collapsed while touring and then left after two years. So I can note their history from that time too.\n\nI need to make sure the summary includes all key points: the cancellation reasons (Mills' health), the dates being cut, new rescheduled date, ticket instructions forGLasgow attendees, and the band's hope and previous tour details.\n\nI should keep it concise without any explanations or formatting. Let me piece this together.\n</think>\n\nThe US rock band REM were forced to cancel their performances in Sheffield and Glasgow due to the severe flu-like symptoms of bass player Mike Mills. The Monday night show was rescheduled, with a short acoustic set also cancelled for Tuesday's date. The band has been keeping ticket stubs fromGLasgow attendees to ensure they can attend the rescheduled Tuesday performance on June 15th. They plan to review remaining dates daily, based on medical advice, and are hopeful to perform next Wednesday. Bill Berry, who collapsed during their tour in 1995, later left after two years.", "tinyllama:1.1b": "US rock band REM have been forced to cancel concerts after bassist Mike Millers took ill with severe flu-like symptoms. The band have been told by doctors that he needs rest and \"probably\" won't be able to perform in Glasgow, but they will reschedule the Glasgow date for 15 June so those who purchased tickets can attend. REM's speaksmans advised fans not to attend the cancelled show or hold onto their ticket stubs for later. The band were hoping to make their Wednesday show in Sheffield, but were still hopeful about their remaining UK gigs in June.", "tinydolphin:1.1b": " REM's concerts have been canceled after bass player Mike Mills was taken ill with \"severe flu-like symptoms\". The band is reviewing their remaining dates on a daily basis based on doctors' advice to Mills. REM initially planned to play four UK shows as part of a world tour, which included Glasgow and Sheffield in Sheffield. In 1995, former drummer Bill Berry collapsed during a show in Switzerland, having suffered a ruptured aneurysm; he made a full recovery.", "phi:2.7b": " The US rock band REM had to cancel some of their concerts due to bass player Mike Mills' hospitalization with flu-like symptoms after their Sheffield show was cut short. They also postponed Tuesday's Glasgow date and may reschedule it for 15 June. The band played a short acoustic set on Monday in his absence. They were originally scheduled to play four UK dates as part of a world tour but had been advised to review the rest of the tour based on Mills' recovery.\n", "orca-mini:3b": " US rock band REM cancelled their concerts after bass player Mike Mills was taken ill and hospitalised. He could barely stand up, and is now resting in hospital. The remainder of the band played an acoustic set on Monday. The band's spokesman said they would review their remaining dates on a day-to-day basis based on doctors advice to Mills. Those who had tickets for the Glasgow show are being advised to retain their ticket stubs and attend the new date. REM hopes to be able to play their remaining UK shows by Wednesday.", "hermes3:3b": "REM\n ill\n cancellation of concerts\n Mike Mills hospitalised with severe flu-like symptoms, rescheduled for 15th June.", "stablelm-zephyr:3b": "US rock band REM cancelled consecutive concerts due to bass player Mike Mills' severe flu-like symptoms, forcing them to shorten Monday night's show in Sheffield and cancel Tuesday's Glasgow date. Mills was hospitalized and currently resting. The band reviewed their remaining UK dates based on his condition, hoping to resume playing as soon as possible. They originally planned a four-date UK tour as part of a world tour, but cancelled shows due to health concerns for the bass player.", "chatgpt-4o-latest": "REM were forced to cancel concerts after bassist Mike Mills was hospitalized with severe flu-like symptoms. Monday's Sheffield show was cut short, and Tuesday's Glasgow concert was postponed to 15 June. Mills, who was too ill to perform, is now resting, and the band is reviewing future dates based on medical advice. Despite the setback, the remaining members played a short acoustic set in Sheffield. They remain hopeful about their Wednesday performance. REM had planned four UK dates as part of a world tour. The situation recalls former drummer Bill Berry's 1995 on-tour health scare, though he later recovered and left the band in 1997.", "stablelm2:1.6b": "US rock band REM had to cancel concerts after bass player Mike Mills was hospitalized due to severe flu-like symptoms. The band shortened Monday's show in Sheffield and cancelled Tuesday's Glasgow date, but Mills' condition improved enough for him to rest at the hospital. REM played acoustic versions of their hits during the rescheduled Glasgow concert, with a Wednesday date still possible based on doctors' advice to Mills. This follows the collapse of former drummer Bill Berry while touring Switzerland due to aneurysm and his subsequent recovery.", "granite3.1-dense:2b": "REM, an American rock band, canceled their UK concerts following bassist Mike Mills' hospitalization due to severe flu-like symptoms. The band cut short Monday's show in Sheffield and postponed Tuesday's Glasgow performance. Mills was unable to stand or play, and is now resting in the hospital. A short acoustic set followed by the remaining band members was performed at Sheffield. Tuesday's Glasgow concert has been rescheduled for 15 June, with ticket holders advised to retain their tickets for the new date. The band remains optimistic about Wednesday's performance. In 2015, drummer Bill Berry also collapsed during a tour due to a ruptured aneurysm, recovering and subsequently leaving the band two years later.", "reference": "The band were forced to cut short Monday night's show in Sheffield, and have cancelled Tuesday's Glasgow date.The band were still hopeful they would be able to make their Wednesday date, added the spokesman.The band had originally been scheduled to play four dates in the UK as part of a world tour.The remainder of the band played a short acoustic set on Monday.Mills could \"hardly stand up, let alone play\", said an REM spokesman, who added he is now \"resting\" in hospital.US rock band REM have been forced to cancel concerts after bass player Mike Mills was taken to hospital suffering from \"severe flu-like symptoms\"."}