{"raw_text": "Label withdraws McFadden's video\n \n The new video of former Westlife singer Brian McFadden has been pulled after a Dublin school complained about being associated with his song Irish Son.\n \n St Fintian's High School says it is clearly identified in the video, while McFadden never went there. McFadden makes claims that he was beaten at his own school in the song's lyrics, saying it had \"cell blocks\". The performer's record label Sony BMG has withdrawn the video and issued replacements to television stations. The label believed the school name was fictitious until they received the complaint. They have said the reference to the school was unintentional and coincidental.\n \n The head of Christian Brothers' school St Fintian's, Richard Fogarty, said the video implied that the 24-year-old pop star had attended his school and was abused there. \"The school has always treated its pupils with respect,\" Mr Fogarty said in a statement. McFadden makes specific references to the Christian Brothers in his song, but did not attend St Fintian's. Corporal punishment was outlawed in Irish schools in 1982 when McFadden was two years old.\n \n McFadden, whose debut solo album is released next week, has said that every song is autobiographical and \"a true story\". Alcoholism and domestic violence are among the other topics dealt with in his songs, half of which have been written with Robbie Williams' former collaborator, Guy Chambers. McFadden, who quit chart-topping group Westlife in March, went to number one in September with his first solo single Real To Me. He enjoyed 12 chart-toppers with the boy band before parting company with them.\n", "llama3.2:1b": "A new video of Brian McFadden has been pulled after a Dublin school complained it was associated with him and implied that he had attended the school where he claims to have been beaten as a child in his song Irish Son. The video, which features McFadden playing guitar and singing about his experiences at St Fintian's High School, clearly shows the school but McFadden himself did not attend there.", "llama3.2:3b": "Brian McFadden's video was withdrawn after a Dublin school complained about being associated with his song Irish Son, which he claimed was about him being beaten at his own school, but did not attend St Fintian's High School. The label said the reference was unintentional and coincidental.", "gemma2:2b": "Brian McFadden's new video for his song \"Irish Son\" has been pulled after a Dublin school complained about its reference to their name. The video claims the singer was beaten at his own school, but he did not attend that institution and never went to St Fintian's High School where the school is located. His record label stated they believed the school name was fictitious before receiving the complaint. McFadden’s song references his experiences with alcoholism and domestic violence. The video has been replaced by the label and will be released again at a later date. \n", "qwen2.5:0.5b": "The label of Christian Brothers' High School has withdrawn a video of former Westlife singer Brian McFadden because it was associated with his school name, despite being identified in the video. The school claimed to have attended McFadden's school and beat him there as part of the lyrics. The school believed the reference to their school in the video was accidental. This has led to an appeal against the label withdrawal.", "qwen2.5:1.5b": "Brian McFadden's video of Irish Son has been removed after a Dublin school complaint, claiming he never attended St Fintian's High School where lyrics suggest abuse. McFadden references Christian Brothers' institution in his song and claims to have attended the school, despite it not being mentioned or having any connection with him. Sony BMG has withdrawn the video and replaced it on television stations, acknowledging the fictitious school name was unintentional.", "qwen2.5:3b": "The new video of former Westlife singer Brian McFadden was withdrawn after a Dublin school complained about being associated with his song \"Irish Son.\" St Fintian's High School, where McFadden never attended, claimed they were clearly identified in the video. Sony BMG withdrew the video and replaced it with replacements for television stations, believing the reference to the school was fictitious until receiving a complaint. Head of St Fintian's Richard Fogarty stated that the video implied the pop star had attended their school and been abused there, despite McFadden not attending the school nor mentioning any abuse in his song. McFadden has said every song is autobiographical, with topics including alcoholism and domestic violence. He quit Westlife in March but reached number one with \"Real To Me\" in September.", "opencoder:1.5b": "Label withdraws McFadden's video\n\nThe new video of Brian McFadden has been pulled after a Dublin school complained about being associated with his song Irish Son.\n\nSt Fintian's High School says it is clearly identified in the video, while McFadden never went there. McFadden makes claims that he was beaten at his own school in the song's lyrics, saying it had \"cell blocks\". The performer's record label Sony BMG has withdrawn the video and issued replacements to television stations.\n\nThe head of Christian Brothers' school St Fintian's, Richard Fogarty, said the video implied that the 24-year-old pop star had attended his school and was abused there. The reference to the school was unintentional and coincidental.\n\nMcFadden makes specific references to the Christian Brothers in his song, but did not attend St Fintian's. Corporal punishment was outlawed in Irish schools in 1982 when McFadden was two years old. The album released next week is said to have included several autobiographical songs, including Alcoholism and domestic violence.\n", "smollm:1.7b": "The new video of former Westlife singer Brian McFadden has been pulled after a Dublin school complained about being associated with his song Irish Son. The school said it is clearly identified in the video, while McFadden never went there. McFadden makes claims that he was beaten at his own school in the song's lyrics, saying it had \"cell blocks\". The performer's record label Sony BMG has withdrawn the video and issued replacements to television stations. The label believed the school name was fictitious until they received the complaint. They have said the reference to the school was unintentional and coincidental.\nThe head of Christian Brothers' school St Fintian's, Richard Fogarty, said the video implied that the 24-year-old pop star had attended his school and was abused there. \"The school has always treated its pupils with respect,\" Mr Fogarty said in a statement. McFadden makes specific references to the Christian Brothers in his song, but did not attend St Fintian's. Corporal punishment was outlawed in Irish schools in 1982 when McFadden was two years old.\nMcFadden, whose debut solo album is released next week, has said that every song is autobiographical and \"a true story\". Alcoholism and domestic violence are among the other topics dealt with in his songs, half of which have been written with Robbie Williams' former collaborator, Guy Chambers. McFadden, who quit chart-topping group Westlife in March, went to number one in September with his first solo single Real To Me. He enjoyed 12 chart-toppers with the boy band before parting company with them.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text. Let me read through it carefully.\n\nThe main event is McFadden's video being pulled because of a complaint from a school in Dublin about being associated with his song \"Ireland Son.\" The school was identified in the video, but McFadden didn't go there. He claims he was beaten at his own school by someone named_cell blocks., though that seems like a typo or confusion.\n\nThe record label Sony BMG pulled the video and provided alternatives to TV stations. They think it's a fake because they received the complaint from St Fintian's High School, which claims the school name was fictitious until they got the info. Mr. Fogarty of St Fintian's said the video suggests he attended but didn't.\n\nMcFadden has an album coming out and says every song is his own story. He mentions alcoholism and domestic violence in some songs, especially half written with Robbie Williams' Guy Chambers. He left Westlife in March and had 12 chart-toppers before leaving again in September.\n\nSo the key points are: video pulled due to complaint, school involved, McFadden's claims about past behavior not being true, label's response, Mr. Fogarty's statement about the video, and his musical background.\n</think>\n\nThe new Brian McFadden video was pulled because a Dublin school complained about being linked to his song \"Ireland Son.\" The school was identified in the video but McFadden didn't attend it, though he claimed attendance at his own Christian Brothers' high school (St Fintian's High School) where he was beaten. The label Sony BMG removed the video and provided alternatives. Mr. Richard Fogarty of St Fintian's stated the school name was fictitious until the complaint came in. McFadden denies past behavior as a true story and mentioned his background with \"Ireland Son.\"", "tinyllama:1.1b": "A Dublin school has pulled a video featuring former Westlife singer Brian McFaudden after it was identified as being associated with his song Irish Son, which has been linked to claims that he had been beaten at his own school. McFaudden is identified in the video as \"Irish Son\", but did not attend St Fintians High School. The head of the Christian Brothers' school, Richard Fogarty, expressed concern about the reference to their pupils being abused there and accused McFaudden of exploiting a fictitious story for his music. The label Sony BMG issued replacements to television stations after receiving complaints from St Fintians High School regarding the references to McFaudden's school. McFaudden is believed to have written every song on his debut solo album, including tracks that deal with alcoholism and domestic violence. The musician went on to become a solo artist in 2015, following the end of his Westlife bandmates.", "tinydolphin:1.1b": " Summary: Former Westlife singer Brian McFadden's new video has been pulled after a school in Dublin, Ireland, complained about being associated with one of his songs. The lyrics to the song suggest that McFadden was beaten at his own school and that he attributes his success to his experiences there. The video's label, Sony BMG, has taken action by replacing it with new footage and issuing replacements to television stations. The head of the Christian Brothers school, Richard Fogarty, claims that McFadden implied his attendance at St. Fintian's when he references the abuse he suffered there. McFadden claims that every song is autobiographical and \"a true story.\"", "phi:2.7b": " After a Dublin school complained about being associated with Brian McFadden's song Irish Son, his music video was pulled by Sony BMG and replaced with new versions. The song has explicit references to an undisclosed school in its lyrics, which led to the school expressing their dissatisfaction. Despite never attending the school in question, McFadden made claims that he was beaten there when he was a teenager. However, the head of Christian Brothers' school St Fintian's said that the video implied that McFadden had attended their school and was abused there. McFadden has stated that his music is autobiographical, with topics such as alcoholism and domestic violence being covered in his songs.\n", "orca-mini:3b": " The video of Brian McFadden's new song Irish Son has been pulled after a Dublin school complained about being associated with his record label Sony BMG. The school, St Fintian's High School, claims it is clearly identified in the video, while McFadden never went there. However, he makes specific references to the school in his song, but he did not attend St Fintian's. The reference to the school was unintentional and coincidental, according to the label. The video implied that McFadden had attended the school and was abused there, but he never actually went to St Fintian's. The school has always treated its pupils with respect, according to Mr. Fogarty, the head of the school.", "hermes3:3b": "Brian McFadden's video withdrawn after Dublin school complains about association, claiming it implied student abuse at their school.", "stablelm-zephyr:3b": "A video by former Westlife singer Brian McFadden was removed after St Fintian's High School complained about being associated with his song \"Irish Son.\" The school, which was not actually attended by McFadden, pulled him down for implying they had cell blocks and treated pupils with respect. Sony BMG, McFadden's label, eventually issued replacement videos for television stations after realizing the error. McFadden's debut solo album, half of whose songs were written with Robbie Williams' former collaborator Guy Chambers, addresses topics such as alcoholism, domestic violence, and his own experiences as a chart-topping Westlife member.", "chatgpt-4o-latest": "The video for Brian McFadden's song \"Irish Son\" was withdrawn after St Fintian's High School in Dublin complained about being associated with it. The school, which McFadden never attended, objected to the video's implication that he was abused there. His record label, Sony BMG, initially believed the school name was fictitious but removed the video after receiving the complaint, stating the reference was unintentional. St Fintian's head, Richard Fogarty, emphasized that the school has always treated students with respect. McFadden, whose debut solo album is set for release, claims his songs are autobiographical, addressing themes like alcoholism and domestic violence. He previously had 12 number-one hits with Westlife before going solo.", "stablelm2:1.6b": "A video featuring former Westlife singer Brian McFadden was withdrawn after a Dublin school complained about being associated with his song \"Irish Son\". The school, St Fintian's High School, is clearly identified in the video but McFadden never attended there. He claimed to have been beaten at his own school in the lyrics and suggested that he had cell blocks. His record label withdrew the video and issued replacements for TV stations after Sony BMG realized the school name was fictitious due to a complaint. The label later stated the reference to the school was unintentional and coincidental. McFadden's head, Richard Fogarty, said the video implied the pop star had attended Christian Brothers' School in Galway and was abused there. McFadden made specific references to the Christian Brothers in his song but did not attend St Fintian S High School where corporal punishment was outlawed in 1984 when he was two years old.", "granite3.1-dense:2b": "St Fintian's High School, a Christian Brothers' institution, has objected to its inclusion in Brian McFadden's music video for \"Irish Son,\" alleging that the song implies he attended and was abused there. The school's head, Richard Fogarty, expressed concern over the implication of corporal punishment in the lyrics, which were outlawed in Irish schools before McFadden's supposed attendance. Sony BMG, McFadden's record label, has withdrawn the video and replaced it with alternative footage due to this complaint. McFadden maintains that every song is autobiographical and true, but he did not attend St Fintian's, nor does the school feature in his actual experiences.", "reference": "The head of Christian Brothers' school St Fintian's, Richard Fogarty, said the video implied that the 24-year-old pop star had attended his school and was abused there.McFadden makes claims that he was beaten at his own school in the song's lyrics, saying it had \"cell blocks\".They have said the reference to the school was unintentional and coincidental.The new video of former Westlife singer Brian McFadden has been pulled after a Dublin school complained about being associated with his song Irish Son.Corporal punishment was outlawed in Irish schools in 1982 when McFadden was two years old.St Fintian's High School says it is clearly identified in the video, while McFadden never went there."}