{"raw_text": "Rock band U2 break ticket record\n \n U2 have smashed Irish box office records with ticket sales for their Dublin concerts, after more than 150,000 were sold within 50 minutes.\n \n Tickets for the two concerts at the city's Croke Park stadium were released at 8am on Friday morning. \"Nothing like it has ever been seen in Ireland before,\" said Justin Green, spokesman for organisers MCD Promoters. \"We could have sold a million tickets.\" The Dublin dates on June 24 and 25 form part of the worldwide Vertigo tour. The tour begins in San Diego on 28 March and will cover 13 US cities. The band will also play 24 European gigs, finishing in Lisbon in August.\n \n Mr Green said that ticket outlets had been \"bombarded\" by U2 fans. \"Unfortunately there's thousands and thousands of disappointed fans all over the country which is disappointing, but there's only two dates confirmed,\" he said. Many fans camped on the streets of the Irish capital for three days to ensure they were first in line at Ticketmaster in St Stephen's Green Shopping Centre, where the tickets went on sale on Friday. However the majority of tickets, priced at between 59.50 and 80 euro each, were sold online. Earlier this week, Bono announced that the band would play two shows at the venue, which holds almost 80,000 people, due to the phenomenal demand for tickets.\n", "llama3.2:1b": "U2 have broken Irish box office records with ticket sales for their Dublin concerts. More than 150,000 tickets were sold within 50 minutes, with many fans camping on the streets of Dublin for three days to secure seats.", "llama3.2:3b": "U2 broke Irish box office records with over 150,000 ticket sales within 50 minutes of release for their Dublin concerts at Croke Park stadium, smashing previous records.", "gemma2:2b": "U2 sold over 150,000 tickets for their Dublin concerts within 50 minutes of sale release. The dates were part of the Vertigo tour and are set to take place in June, with additional performances planned across the US and Europe.  A large number of disappointed fans were left unable to obtain tickets despite multiple lines and days-long waiting involved.  \n", "qwen2.5:0.5b": "U2's Dublin concerts have exceeded their ticket sales record, with over 150, 000 tickets sold within 50 minutes. The concerts are part of a worldwide tour that spans Ireland and Europe. Tickets for both dates were released on Friday morning, but more than three days before the shows began in St Stephen's Green Shopping Centre. Many fans have camped on the streets for three days to secure their seats online or by purchasing tickets at Ticketmaster.", "qwen2.5:1.5b": "Rock band U2 broke Irish box office records with nearly a million tickets sold within 50 minutes of concert ticket release on Friday morning in Dublin's Croke Park stadium as part of their Vertigo tour. Tickets were priced at €59.50-$80 each and mostly sold online, while many fans camped outside Ticketmaster for days to secure early access.", "qwen2.5:3b": "Rock band U2 broke Irish box office records by selling over 150,000 tickets in under an hour for their June 24 and 25 concerts at Croke Park stadium. The worldwide Vertigo tour began on March 28 in San Diego and will cover 13 US cities before concluding in Lisbon in August. Organizers reported that thousands of fans camped outside Ticketmaster outlets, mostly online sales were successful with tickets priced between €59.50 and €80 each.", "opencoder:1.5b": "Rock band U2 broke ticket record in Dublin concert.\nU2 have released millions of tickets during 50 minutes for their concerts. The two performances at Croke Park stadium were released at 8am on Friday morning. \"Nothing like it has ever been seen in Ireland before,\" said Justin Green, MCD Promoters' spokesman. The tour dates are part of the worldwide Vertigo tour.\nMr Green said that ticket outlets had been bombarded by U2 fans due to their number. However, many of them were already sold for the tour. In St Stephen's Green Shopping Centre, Bono announced two shows due to extremely high demand for tickets. However, the band played only two concerts as they could not afford more in an auction.\n", "smollm:1.7b": "U2 have smashed Irish box office records with ticket sales for their Dublin concerts after more than 150,000 were sold within 50 minutes. Tickets for the two concerts at the city's Croke Park stadium were released at 8am on Friday morning. \"Nothing like it has ever been seen in Ireland before,\" said Justin Green, spokesman for organisers MCD Promoters. \"We could have sold a million tickets.\" The Dublin dates on June 24 and 25 form part of the worldwide Vertigo tour. The tour begins in San Diego on 28 March and will cover 13 US cities. The band will also play 24 European gigs, finishing in Lisbon in August.\n\nMr Green said that ticket outlets had been \"bombarded\" by U2 fans. \"Unfortunately there's thousands and thousands of disappointed fans all over the country which is disappointing, but there's only two dates confirmed,\" he said. Many fans camped on the streets of the Irish capital for three days to ensure they were first in line at Ticketmaster in St Stephen's Green Shopping Centre, where the tickets went on sale on Friday. However the majority of tickets, priced at between 59.50 and 80 euro each, were sold online. Earlier this week, Bono announced that the band would play two shows at the venue, which holds almost 80,000 people, due to the phenomenal demand for tickets.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about U2's concert ticket sales. Let me read through it carefully.\n\nFirst sentence: \"U2 have smashed Irish box office records with ticket sales...\" That seems like the main point. They've sold over 150,000 tickets in 50 minutes. Got that.\n\nNext part: \"Tickets for the two concerts at the city's Croke Park stadium were released...\" So they're selling tickets online and not in physical stores on Friday morning? That makes sense because often tickets are released online first, especially if it's a major event.\n\nThen there's Justin Green saying, \"Nothing like it has ever been seen in Ireland before,\" and he estimates million tickets. He also mentions the tour starts in San Diego on March 28th, covering 13 US cities and ending in Lisbon in August. That's pretty extensive, so that's key info.\n\nMr. Green said ticket outlets were \"bombarded\" by fans because there are thousands disappointed all over the country. They wanted people first in line at Ticketmaster on St Stephen's Green, which is their shopping center. But most tickets sold online, priced between 59.50 and 80 euros each.\n\nEarlier this week, Bono announced they'll play two shows at Croke Park with record demand. This adds to the excitement since U2 has already been big.\n\nSo I need to make a concise summary that includes these key points: their ticket sales, the dates of their tour, Bono's announcement about playing both shows, and how it stands out because they've sold many tickets quickly.\n\nI should avoid any extra information and focus on the main highlights. Make sure it's plain text without explanations or formatting.\n</think>\n\nU2 has sold over 150,000 tickets for their two concert dates in Ireland within 50 minutes, breaking Irish box office records. They released online tickets starting Friday morning, with fans lining up at Ticketmaster first to get on the sales. Justin Green said it was an unprecedented event, estimating a million tickets could be sold. The tour starts in San Diego on March 28 and covers 13 US cities, ending in Lisbon in August. U2 has also announced playing two shows at Croke Park with record demand.", "tinyllama:1.1b": "U2 have broken Irish box office records with ticket sales for their Dublin concerts, selling over 150,000 tickets within 50 minutes. The band's Vertigo tour will see them play 24 European gigs and finish in Lisbon in August. However, many fans were disappointed when the tickets went on sale, with many camping out for three days on St Stephen's Green Shopping Centre to secure their preferred seats.", "tinydolphin:1.1b": " U2 have become Ireland's best-selling rock band with the release of their new tour ticket sales within 50 minutes. The band will play two shows at Croke Park stadium in Dublin on June 24 and 25, with an additional European tour commencing in San Diego on March 28th and ending in Lisbon in August. The Vertigo tour spans 13 US cities and includes 24 European gigs. Despite the demand for tickets being overwhelmingly high, there are no immediate plans to extend the schedule. Many fans have camped out on streets of Dublin for three days to ensure they are first in line.", "phi:2.7b": " Ticket sales for U2's Dublin concerts set a new record with more than 150,000 tickets being sold within 50 minutes, breaking Irish box office records. Fans camped on the streets of Dublin to be first in line at ticket outlets and the majority of tickets were sold online. The band will also tour Europe, playing 24 gigs in 13 US cities before ending in Lisbon. Bono announced two shows at the venue due to high demand.\n", "orca-mini:3b": " Rock band U2 broke ticket sales records in Ireland by selling more than 150,000 tickets within 50 minutes for their Dublin concerts at Croke Park stadium. The two dates on June 24 and 25 are part of the worldwide Vertigo tour. The band will play 24 European gigs, finishing in Lisbon in August. Ticket outlets were bombarded by fans trying to buy tickets, but many disappointed fans camped on the streets for three days to ensure they got a ticket at the right price. The majority of tickets were sold online, but Bono announced that U2 would play two shows at Croke Park due to overwhelming demand.", "hermes3:3b": "U2 tickets sell over 150k in 50min, breaking Irish box office records.", "stablelm-zephyr:3b": "U2 broke Irish box office records with over 150,000 tickets sold within 50 minutes for their Dublin concerts at Croke Park stadium. The Vertigo tour began in San Diego on 28 March and included 13 US cities, 24 European gigs, and ended in Lisbon in August. Many fans camped overnight to ensure they were first in line at Ticketmaster, with the majority of tickets priced between €59.50 and €80 sold online.", "chatgpt-4o-latest": "U2 set a new Irish box office record by selling over 150,000 tickets for their Dublin concerts in just 50 minutes. The two shows at Croke Park on June 24 and 25 are part of their worldwide Vertigo tour, which starts in San Diego on March 28 and includes 24 European dates. Demand was overwhelming, with ticket outlets bombarded and many fans camping for days to secure tickets, though most were sold online. Despite the venue's 80,000 capacity, thousands of fans were left disappointed.", "stablelm2:1.6b": "U2 broke Irish ticket sales records with over 1 million tickets sold for their concerts in Dublin, including Croke Park stadium shows and European gigs throughout the year, starting in San Diego. Ticket outlets were overwhelmed by fans eager to purchase tickets; however, only two confirmed dates exist. Tickets ranged from €1 to €1,000 each, with the majority sold online after a week of heavy ticket sales.", "granite3.1-dense:2b": "U2 set a new Irish box office record by selling over 150,000 tickets for their Dublin concerts within 50 minutes of release at 8 AM on Friday. The two events, scheduled for June 24 and 25 at Croke Park stadium, were part of the Vertigo tour, starting in San Diego on March 28 and covering 13 US cities before concluding in Lisbon in August with 24 European shows. Fans, including those who camped for three days outside Ticketmaster in St Stephen's Green Shopping Centre, were unable to purchase all tickets due to high demand. Tickets ranged from 59.50 to 80 euro each, primarily sold online. Despite the overwhelming response, only two shows were confirmed at Croke Park, which can accommodate nearly 80,000 people.", "reference": "\"We could have sold a million tickets.\"U2 have smashed Irish box office records with ticket sales for their Dublin concerts, after more than 150,000 were sold within 50 minutes.Mr Green said that ticket outlets had been \"bombarded\" by U2 fans.However the majority of tickets, priced at between 59.50 and 80 euro each, were sold online.Earlier this week, Bono announced that the band would play two shows at the venue, which holds almost 80,000 people, due to the phenomenal demand for tickets."}