{"raw_text": "Beastie Boys win sampling battle\n \n US rappers Beastie Boys have won their long-running battle over the use of a sample in their song Pass the Mic.\n \n The punk-rappers used three notes of music from flautist James Newton's Choir in their track from 1992. Although the group had paid a licence fee for the sample, Mr Newton said his copyright had been infringed. But the US Court of Appeal upheld its original decision that the group did not have to pay an additional fee to license the underlying composition. The Beastie Boys - Michael Diamond, Adam Horowitz, and Adam Yauch - are considered to be one of early pioneers of sampling music.\n \n Sampling, now a standard practice among musicians, involves taking a segment of one track and using it in a different song. A three-judge panel of the court held in 2003 that the band had abided by copyright protections by paying a licence fee for a sample of Mr Newton's recording. That finding upheld a lower-court dismissal of the case in favour of the Beastie Boys. \"We hold that Beastie Boys' use of a brief segment of that composition, consisting of three notes separated by a half-step over a background C note, is not sufficient to sustain a claim for infringement of Newton's copyright,\" Chief Judge Mary Schroeder wrote in her opinion. Mr Newton is a critically acclaimed jazz and classical flutist, composer, performer, and university professor. Mr Newton and the Beastie Boys were not available for comment.\n", "llama3.2:1b": "Beastie Boys win battle over sampling in their 1992 song Pass the Mic. The group used three notes from James Newton's Choir without paying a license fee, but the US Court of Appeal upheld its original decision that they did not have to pay additional fees to use the sample.", "llama3.2:3b": "Beastie Boys win US court battle over sample from James Newton's Choir. The group had used three notes from the flute piece in their 1992 track Pass the Mic without additional licensing fee. A US Court of Appeal upheld a lower-court decision that the band did not infringe on Newton's copyright, citing payment of a licence fee for the sample.", "gemma2:2b": "The Beastie Boys won their legal battle over the use of James Newton's music in their song \"Pass the Mic\". The court found that their use of three notes from the composition did not constitute infringement of Mr. Newton’s copyright. \n", "qwen2.5:0.5b": "The US band Beastie Boys won an argument over samples they used in their 1992 song \"Pass the Mic\" by paying royalties to the music artist who created it. They have argued that using a sample is acceptable when done with permission, but a judge said they didn't need to pay for it to continue making the track.", "qwen2.5:1.5b": "Beastie Boys win sample battle; three-note sample from James Newton's Choir used in \"Pass the Mic\" was found to be fair use under US copyright law, despite initial payment of a fee.", "qwen2.5:3b": "Beastie Boys won their legal battle over sampling a James Newton composition from 1992 used in their song Pass the Mic. Despite claiming copyright infringement, the US Court of Appeal upheld the original decision that the group did not need to pay an additional fee as they had already paid for the sample. The court ruled that using three notes from Newton's recording was insufficient to claim infringement, upholding a 2003 lower-court ruling in favor of the Beastie Boys. Known as early pioneers of sampling music, the band includes Michael Diamond, Adam Horowitz, and Yauch.", "opencoder:1.5b": "The output text only contains key ideas about the song 'Beastie Boys win sampling battle', noting the group's use of a sample to create a song with three notes separated by a half-step over a background C note.\n", "smollm:1.7b": "The Beastie Boys won their long-running battle over the use of a sample in their song Pass the Mic by paying a licensing fee to use James Newton's Choir in their track from 1992. The US Court of Appeal upheld its original decision that the group did not have to pay an additional fee to license the underlying composition, citing the fact that they had paid a licensing fee for the sample and therefore did not infringe on Mr Newton's copyright. The Beastie Boys are considered one of early pioneers of sampling music, and their use of a three-note segment from James Newton's Choir in their song Pass the Mic is seen as an example of this practice.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to figure out how to summarize this text about Beastie Boys winning their battle over using a sample in their song Pass the Mic. The user has given me some specific instructions on what to include and exclude.\n\nFirst, I should read through the provided text carefully. It's all about the Beastie Boys' song \"Pass the Mic\" where they used music from James Newton's choir. They had paid a fee for the sample, but the US Court of Appeals ruled that they didn't have to pay extra because they already complied with copyright laws.\n\nI need to capture the main points: who won the battle, what the song was about, how many notes were used, why the copyright claim was upheld, and who the key players are. I should avoid any explanations or additional information beyond these details.\n\nLooking at the structure, the summary should be concise. Maybe start with \"Beastie Boys successfully\" to mention their victory, then a brief description of the song, followed by the notes used and the court ruling. I'll need to make sure each sentence is clear and stands on its own without any extra fluff.\n\nI also notice that Mr. Newton is mentioned as a musician, but since he's not available for comment, I should focus on his role in the case rather than his personal details. The judges' panel confirmed compliance with copyright, so that's an important detail to include.\n\nPutting it all together, I'll structure it by stating the summary sentence clearly, then provide bullet points or short sentences explaining each key point without getting into too much detail. This should make the summary both concise and informative.\n</think>\n\nBeastie Boys successfully won a long-running battle over using music from their song \"Pass the Mic\" in 1992. They used three notes from James Newton's choir to create it, which they paid a license fee for. The US Court of Appeals upheld their original decision that no additional fees were needed because they adhered to copyright laws despite having paid a fee. Key points include the use of music, their role as early pioneers in sampling, and Mr. Newton's unavailable comment.", "tinyllama:1.1b": "The rap group Beastie Boys have won their long-running battle over the use of a sample in their song \"Pass the Mic.\" The punk rappers paid a licence fee for the sample from jazz musician James Newton's work, but the court held that they did not need to pay an additional fee to license the underlying composition. Sampling, a standard practice among musicians, involves taking a small portion of one song and using it in another. In this case, the group had paid a licence fee for a sample, but the lower court found in their favour in 2003, which uphelde a lower-court dismissal. The Beastie Boys were not available for comment.", "tinydolphin:1.1b": " The Beastie Boys have won their long-running battle over the use of a sample in their song Pass the Mic. This is a high-profile case that has caused much debate over sample usage in popular music. The group used three notes from the Choir's flautist, James Newton, in the track from 1992. However, Mr Newton did not hold out for payment for this use of his copyrighted composition. Instead, he sued the Beastie Boys, who were able to secure a legal victory when a panel of three judges at the US Court of Appeals upheld their rights.", "phi:2.7b": " Beastie Boys win sampling battle over James Newton's \"Pass The Mic\" from their album \"Too Tough to Die\". Although the band paid a licensing fee, Mr Newton claimed that his copyright was infringed. However, the US Court of Appeal upheld its decision in favor of the group, stating that they had not used the sample without permission and therefore did not need to pay an additional fee. Sampling is now a common practice among musicians, but it involves taking a segment of one track and using it in another song. The three-judge panel found that the Beastie Boys' use was within copyright protections because they paid for the license of the sample. James Newton is a well-known jazz and classical flutist who was not available for comment on the case.\n", "orca-mini:3b": " The US Court of Appeal upheld the decision of the lower court that the Beastie Boys did not have to pay an additional fee to license the underlying composition in a sampling case involving their use of three notes of music from James Newton's Choir in their track \"Pass the Mic\" from 1992.", "hermes3:3b": "Beastie Boys win sampling battle: US rap group uses 3 notes of James Newton's music (flautist) in track, court rules no additional fee needed for copyright infringement.", "stablelm-zephyr:3b": "The US Court of Appeal ruled in favor of the Beastie Boys regarding their use of a sample from flautist James Newton's Choir in their 1992 song Pass the Mic. Despite paying a licensing fee, Mr. Newton claimed copyright infringement. The court held that the Beastie Boys had abided by copyright protections by using only three notes from the composition. This decision upheld a previous lower-court dismissal of the case in favor of the Beastie Boys, marking them as early pioneers of sampling music.", "chatgpt-4o-latest": "Beastie Boys won a legal battle over the use of a three-note sample from flautist James Newton's Choir in their 1992 song Pass the Mic. Although they had paid a license fee for the sample, Newton claimed copyright infringement. The US Court of Appeal upheld its original decision that the group did not need to pay an additional fee for the underlying composition. A three-judge panel ruled that the brief segment used was insufficient to support an infringement claim. The case dismissal reaffirmed the Beastie Boys' compliance with copyright protections. Neither Newton nor the band commented on the ruling.", "stablelm2:1.6b": "The Beastie Boys won a legal battle over using a sample in their song \"Pass the Mic,\" with three notes from flautist James Newton's Choir, without needing to pay an additional fee for licensing the underlying composition. This decision upheld a previous court ruling that deemed the band's use of the sample as respecting copyright protections by paying a license fee. The Beastie Boys are considered pioneers in sampling music and this case is significant in affirming its practice.", "granite3.1-dense:2b": "The US Court of Appeal has ruled in favor of the Beastie Boys in a decade-long dispute over their use of three notes from flautist James Newton's Choir in the 1992 hit \"Pass the Mic.\" Despite paying a licence fee for the sample, Mr. Newton claimed copyright infringement. However, the court upheld its initial decision that no additional payment was required, as the Beastie Boys' use of the three notes did not constitute infringement due to their adherence to copyright protections through the licence fee. The Beastie Boys are regarded as early pioneers of music sampling, a practice now common among artists. James Newton is a renowned flutist, composer, and university professor. Both parties were unavailable for comment on the ruling.", "reference": "Mr Newton and the Beastie Boys were not available for comment.Although the group had paid a licence fee for the sample, Mr Newton said his copyright had been infringed.US rappers Beastie Boys have won their long-running battle over the use of a sample in their song Pass the Mic.\"We hold that Beastie Boys' use of a brief segment of that composition, consisting of three notes separated by a half-step over a background C note, is not sufficient to sustain a claim for infringement of Newton's copyright,\" Chief Judge Mary Schroeder wrote in her opinion.A three-judge panel of the court held in 2003 that the band had abided by copyright protections by paying a licence fee for a sample of Mr Newton's recording."}