{"raw_text": "Band Aid 20 single storms to No 1\n \n The new version of the Band Aid song Do They Know It's Christmas? has gone straight in at number one in the UK singles chart.\n \n The charity record is also tipped to be this year's Christmas number one. It features vocals from the likes of Chris Martin, Dido, Robbie Williams and the Sugababes. The original version - which was the Christmas number one in 1984 - sold 750,000 copies in its first week and 3.5 million in total. It was released in the US, and reached number 13 in the singles chart. However, Band Aid 20 is not going to be released in the US, despite being sold in many countries around the world. US record shops are stocking an import version of Do They Know It's Christmas, which is said to be selling very well in Los Angeles and New York.\n \n British stars who appear on the current recording, such as Dido and Coldplay's Chris Martin, are well known to music fans across the Atlantic, along with U2 frontman Bono. Record company Universal is responsible for the global distribution of the single, which will be available across Europe, Asia, South America and Canada. But music fans in the US are still able to access the song and download it on Band Aid 20's official website. In 1985, a group of high-profile American stars known as USA For Africa came together to record their own fund-raising single, We Are The World. The song was written by Lionel Richie and Michael Jackson, with Quincy Jones as producer.\n \n It topped the US charts for three weeks and went on win Grammy awards for best record and song. Dionne Warwick, Diana Ross and Tina Turner were among the line-up of performers. Proceeds from the sales of the Band Aid 20 single will go towards aid relief in Africa, in countries such as Ethiopia and Sudan. The money raised will also be used to help combat HIV and Aids across the continent. The Band Aid Trust which was set up 20 years ago, when the original single was released, handed out $144m (£75m) to famine relief projects across Africa between January 1985 and November 2004.\n", "llama3.2:1b": "The new version of the song \"Do They Know It's Christmas?\" has topped the UK singles chart, becoming the charity record to be this year's Christmas number one. The original 1984 version sold millions worldwide but will not be released in the US due to distribution issues. A revised version is being distributed globally and proceeds from sales will aid relief efforts in Africa.", "llama3.2:3b": "Band Aid 20's new version of Do They Know It's Christmas? reached number one in the UK chart, with vocals from Chris Martin, Dido, Robbie Williams, and the Sugababes. The charity record is expected to be this year's Christmas number one and will support aid relief in Africa and HIV/AIDS efforts.", "gemma2:2b": "Band Aid 20 reached number one in the UK singles chart with their version of \"Do They Know It's Christmas?\" featuring artists like Chris Martin, Dido, Robbie Williams, and the Sugababes. The song is tipped to be this year's Christmas number one in the UK. A US version of the single will be available through import, though it won't be officially released there. Band Aid 20’s single raised funds for aid relief in Africa and combatting HIV/AIDS.  The proceeds from sales benefited the Band Aid Trust which had previously donated $144 million (£75 million) to African famine relief between 1985 and 2004. \n", "qwen2.5:0.5b": "The new version of the Band Aid song \"Do They Know It's Christmas?\" is currently at number one in the UK singles chart, and Universal Music Group plans to release it as the charity record for this year's Christmas season. The original version was a hit that sold 750, 000 copies in its first week and reached number 13 on the US charts. However, Universal Music Group is not planning to release \"Do They Know It's Christmas?\" in the US as it was previously planned due to the sales of a similar song called \"We Are The World.\" This song was released in Japan in 1985 by a group of American stars known as USA For Africa and was performed by Dido and Chris Martin. Proceeds from its sales will be used for charity projects, including aid relief in Africa like Ethiopia and Sudan, fighting HIV/AIDS in those countries, and helping combat Aids across the continent.", "qwen2.5:1.5b": "The new version of \"Do They Know It's Christmas?,\" featuring artists including Dido, Coldplay's Chris Martin, and the Sugababe, topped the UK singles chart in November 2021. The original version by Bono, C. Martin, Robbie Williams, and Dido peaked at number 13 on the US Singles Chart but was not released in the U.S. The charity single sold over 4 million copies globally, with proceeds benefiting aid relief projects in Africa, including HIV/AIDS prevention efforts.", "qwen2.5:3b": "The new version of \"Do They Know It's Christmas?\" by Band Aid 20 has reached number one in the UK singles chart, potentially becoming this year’s Christmas number one. Featuring artists like Chris Martin, Dido, Robbie Williams, and the Sugababes, it is tipped for success in the US despite not being officially released there due to an import version selling well. The original Band Aid 20 single from 1984 was a hit, reaching number one in the UK and achieving significant sales internationally. It helped raise funds for famine relief projects across Africa, with proceeds now going towards HIV/AIDS aid.", "opencoder:1.5b": "The new version of the Band Aid song Do They Know It's Christmas? has gone straight in at number one in the UK singles chart.\n \nThe charity record is also sold this year, which features vocals from the likes of Chris Martin, Dido, Robbie Williams and the Sugababes. The original version - which was the Christmas number one in 1984 - sold 750,000 copies in its first week and 3.5 million in total. It was released in the US, and reached number 13 in the singles chart.\n \nUniversal is responsible for the global distribution of the single, which will be available across Europe, Asia, South America and Canada. But music fans in the US are still able to access the song and download it on Band Aid 20's official website. In 1985, a group of high-profile American stars known as USA For Africa came together to record their own fund-raising single, We Are The World. The song was written by Lionel Richie and Michael Jackson, with Quincy Jones as producer.\n \nDionne Warwick, Diana Ross and Tina Turner were among the line-up of performers. Proceeds from the sales of the Band Aid 20 single will go towards aid relief in Africa, in countries such as Ethiopia and Sudan. The money raised will also be used to help combat HIV and Aids across the continent. The Band Aid Trust which was set up 20 years ago, when the original single was released, handed out $144m (£75m) to famine relief projects across Africa between January 1985 and November 2004.\n", "smollm:1.7b": "The summary is concise and focuses on the main points of the text:\n\n1. The new version of the Band Aid song Do They Know It's Christmas? has gone straight in at number one in the UK singles chart this year.\n2. The charity record is also tipped to be this year's Christmas number one.\n3. The original version - which was the Christmas number one in 1984 - sold 750,000 copies in its first week and 3.5 million in total.\n4. US record shops are stocking an import version of Do They Know It's Christmas, which is said to be selling very well in Los Angeles and New York.\n5. British stars who appear on the current recording, such as Dido and Coldplay's Chris Martin, are well known to music fans across the Atlantic, along with U2 frontman Bono.\n6. Record company Universal is responsible for the global distribution of the single, which will be available across Europe, Asia, South America and Canada.\n7. In 1985, a group of high-profile American stars known as USA For Africa came together to record their own fund-raising single, We Are The World.\n8. The song was written by Lionel Richie and Michael Jackson, with Quincy Jones as producer.\n9. The song topped the US charts for three weeks and went on win Grammy awards for best record and song.\n10. Dionne Warwick, Diana Ross and Tina Turner were among the line-up of performers in the original single.\n11. Proceeds from the sales of the Band Aid 20 single will go towards aid relief in Africa, in countries such as Ethiopia and Sudan.\n12. The Band Aid Trust which was set up 20 years ago, when the original single was released, handed out $144m (£75m) to famine relief projects across Africa between January 1985 and November 2004.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text into a concise summary while preserving key ideas and details. Let me read through the text carefully.\n\nFirst, it mentions that the new version of \"Do They Know It's Christmas?\" by Band Aid has gone straight to number one in the UK singles chart. This is a significant achievement for their charity record. The song features vocals from Chris Martin, Dido, Robbie Williams, and the Sugababes. \n\nThe original version was already a holiday number one but sold 750k copies in its first week and 3.5 million in total worldwide. It came out in the US and reached number 13 there. However, Band Aid's new release isn't available in the US because record shops are stockpiling an import version in LA and NYC, which is selling well.\n\nThere's mention of British stars like Dido and Bono appearing on the current recording. Record company Universal handles global distribution but provides access to the song through their official website.\n\nFrom 1985, a group called USA For Africa recorded \"We Are The World,\" written by Lionel Richie, Michael Jackson, and Quincy Jones. It topped the US charts for three weeks and won Grammy awards. Performers included Dionne Warwick, Diana Ross, and Tina Turner. The proceeds from Band Aid's single go towards aid relief in Africa.\n\nThe trust set up 20 years ago gave $144 million for famine relief across Africa between 1985-2004.\n\nSo I need to include all these points concisely.\n</think>\n\nThe new \"Do They Know It's Christmas?\" by Band Aid has reached number one in the UK singles chart. It features vocals from Chris Martin, Dido, Robbie Williams, and the Sugababes. The original version sold 750k in its first week and 3.5 million globally. However, Band Aid's release isn't available in the US despite sales elsewhere. British stars and Universal record distribution are involved. In 1985, USA For Africa released \"We Are The World,\" topped the charts, won Grammy awards, with proceeds go to aid relief. The trust established 20 years ago awarded $144m for famine relief in Africa between 1985-2004.", "tinyllama:1.1b": "The new version of the Band Aid song Do They Know It's Christmas? has taken Number One in the UK singles chart, despite being a re-release from 1984. The charity record features vocals by Chris Martin, Dido, Robbie Williams, and The Sugababes, among others. It is not going to be relased in the US but an import version with the same name has been imported into many US music shops, selling very well in Los Angeles and New York. The Band Aid Trust received a total of $144m (£75m) from the proceeds of the original single between January 1985 and November 2004, which has been used to support famine relief projects across Africa since its creation in 1984.", "tinydolphin:1.1b": " Band Aid 20 has stormed into the UK singles chart at number one, following its release on November 15th. The charity single features vocals from a diverse range of artists, including Chris Martin (Coldplay), Dido, Robbie Williams and the Sugababes. It has sold over 750,000 copies in its first week, making it the second-biggest selling charity record behind Do They Know It's Christmas? by Band Aid 1984. The original version reached number 13 in the singles chart, and was released in the US. However, this time, Band Aid 20 is not available in the US, despite being sold in many countries around the world. Despite having to compete with other charity records like Just Can't Wait by Eurythmics, Tina Turner's I Want To Wake Up To You and UB40's Untouchable, the new version of Do They Know It's Christmas? has already sold over 3.5 million copies in total. The single will be available across Europe, Asia, South America and Canada from November 18th, with record company Universal responsible for distributing it globally.", "phi:2.7b": " A brief summary of the text is:\n\nBand Aid 20's version of Do They Know It'S Christmas? has become number one in the UK, where it features vocals from various artists such as Chris Martin and Dido. The song was first released in 1984 and sold 3.5 million copies worldwide. A new charity single called We Are The World was created by American stars in 1985 to help Africa. The Band Aid Trust distributes the proceeds of both songs to famine relief projects.\n", "orca-mini:3b": " The new version of the Band Aid song Do They Know It's Christmas? has topped the UK singles chart. It features vocals from Chris Martin, Dido, Robbie Williams and the Sugababes and is tipped to be this year's Christmas number one. The original version, which was the Christmas number one in 1984, sold 750,000 copies in its first week and 3.5 million in total. However, Band Aid 20 is not being released in the US, despite being sold in many countries around the world. The song will be available across Europe, Asia, South America and Canada, and British stars who appear on the current recording, such as Dido and Coldplay's Chris Martin, are well known to music fans across the Atlantic, along with U2 frontman Bono. Proceeds from the sales of the Band Aid 20 single will go towards aid relief in Africa, in countries such as Ethiopia and Sudan. The Band Aid Trust which was set up 20 years ago, when the original single was released, handed out $144m (£75m) to famine relief projects across Africa between January 1985 and November 2004.", "hermes3:3b": "Band Aid 20 singles debut at #1 in UK, Christmas charity single; features international artists, proceeds for African aid.", "stablelm-zephyr:3b": "A new version of the Band Aid song \"Do They Know It's Christmas?\" reached number one in the UK singles chart, featuring vocals from Chris Martin, Dido, Robbie Williams, and the Sugababes. The original 1984 version sold 750,000 copies in its first week and 3.5 million in total. This year's charity record is tipped to be this year's Christmas number one. Proceeds from the sales of Band Aid 20 single will go towards aid relief in Africa, combatting HIV and Aids across the continent, and benefiting projects such as those in Ethiopia and Sudan. The Band Aid Trust, established 20 years ago when the original single was released, has previously handed out $144m to famine relief projects across Africa between January 1985 and November 2004.", "chatgpt-4o-latest": "The new version of Band Aid's *Do They Know It's Christmas?* has debuted at number one in the UK singles chart and is expected to be the Christmas number one. Featuring artists like Chris Martin, Dido, and Robbie Williams, the single follows the success of the 1984 original, which sold 3.5 million copies. Unlike the original, Band Aid 20 will not be officially released in the US, though import versions are selling well. The song is available for download on the Band Aid 20 website, and proceeds will support aid relief in Africa, including efforts to combat HIV and AIDS. The Band Aid Trust, established in 1984, has distributed $144 million to famine relief projects across Africa.", "stablelm2:1.6b": "The charity record \"Do They Know It's Christmas?\" by Band Aid, featuring vocals from famous artists like Chris Martin and Dido, topped the UK singles chart at number one. This version is expected to be this year's Christmas number one as well. The original song sold over 3 million copies in its first week. It was released in the US but not going to be reissued there due to strong sales in Los Angeles and New York. Band Aid, however, will have an import version available across Europe, Asia, South America, and Canada. American stars who appeared on this recording, such..\n...more text removed...", "granite3.1-dense:2b": "Band Aid 20, a remake of the iconic 1984 charity hit \"Do They Know It's Christmas?\" featuring artists like Chris Martin, Dido, Robbie Williams, and the Sugababes, has debuted at number one in the UK singles chart. This version is anticipated to become this year's Christmas number one. The original sold 750,000 copies in its first week and 3.5 million overall, reaching number 13 in the US singles chart. Unlike its predecessor, Band Aid 20 will not be released in the US; instead, US fans can access it through an import version on the Band Aid 20 website and other global distribution channels managed by Universal.\n\nThe funds raised from Band Aid 20 sales support aid relief efforts in African countries, including Ethiopia and Sudan, as well as HIV/AIDS combat initiatives. The Band Aid Trust, established upon the release of the original single in 1984, distributed $144 million (£75 million) for famine relief projects across Africa from January 1985 to November 2004. In comparison, USA For Africa's \"We Are The World,\" released in 1985 with artists like Lionel Richie and Michael Jackson, peaked at number one on the US charts for three weeks, winning Grammy awards for best record and song.", "reference": "It was released in the US, and reached number 13 in the singles chart.The new version of the Band Aid song Do They Know It's Christmas?The Band Aid Trust which was set up 20 years ago, when the original single was released, handed out $144m (£75m) to famine relief projects across Africa between January 1985 and November 2004.Proceeds from the sales of the Band Aid 20 single will go towards aid relief in Africa, in countries such as Ethiopia and Sudan.But music fans in the US are still able to access the song and download it on Band Aid 20's official website.The original version - which was the Christmas number one in 1984 - sold 750,000 copies in its first week and 3.5 million in total.The charity record is also tipped to be this year's Christmas number one.However, Band Aid 20 is not going to be released in the US, despite being sold in many countries around the world."}