{"raw_text": "Parker's saxophone heads auction\n \n A saxophone belonging to legendary jazz musician Charlie Parker is expected to fetch up to $1m (£535,000) at an auction of jazz memorabilia next month.\n \n The sale, at Guernsey's Auction House in New York, will feature instruments from other musicians including John Coltrane and Benny Goodman. Other items will include an evening gown belonging to Ella Fitzgerald. Organisers said the auction was the first in the US to be devoted to items belonging to jazz musicians.\n \n Other items that will be auctioned include unreleased tape recordings of music by Parker as well as handwritten sheet music by jazz composers John Coltrane and Theolonius Monk. Among the instruments in the sale will be a trumpet which belonged to Dizzy Gillespie, which is expected to fetch around $500,000 (£267,000), as well as JJ Johnson's trombone and a vibraphone which beloned to Lionel Hampton. Works of art by musicians including Miles Davis and Bruni Sablan will also be featured. The proceeds from the auction, which will take place on 20 February, will go towards several organisations including the John Coltrane Foundation, a foundation set up in memory of Benny Goodman, and the Red Cross.\n", "llama3.2:1b": "A saxophone belonging to Charlie Parker is expected to fetch $1m (£535,000) at an auction of jazz memorabilia next month. The sale will feature instruments from other musicians including John Coltrane and Benny Goodman, as well as items such as an evening gown by Ella Fitzgerald and unreleased tape recordings of music by Parker.", "llama3.2:3b": "A saxophone belonging to Charlie Parker is expected to fetch $1m at an upcoming jazz memorabilia auction in New York, featuring items from other musicians such as John Coltrane, Benny Goodman, and Ella Fitzgerald. Other notable items include unreleased tape recordings of Parker's music, handwritten sheet music by Coltrane and Monk, a trumpet from Dizzy Gillespie, and works of art by Miles Davis and Bruni Sablan.", "gemma2:2b": "A jazz memorabilia auction featuring items belonging to Charlie Parker, John Coltrane, and others will be held on February 20th at Guernsey's Auction House in New York.  The auction is expected to include instruments, unreleased recordings, sheet music, and artwork from renowned musicians. Proceeds will benefit organizations like the John Coltrane Foundation, a Benny Goodman foundation, and the Red Cross. \n", "qwen2.5:0.5b": "A saxophone belonging to legendary jazz musician Charlie Parker is expected to fetch around $1m (£535, 000) at an auction of jazz memorabilia next month. Other items in the sale include an evening gown belonging to Ella Fitzgerald, unreleased tape recordings by Charlie Parker and The Liberace family, handwritten sheet music from jazz composers John Coltrane and Theolonius Monk, trombones belonging to Dizzy Gillespie, works of art by Miles Davis and Bruni Sablan, among others.", "qwen2.5:1.5b": "The saxophone belonging to legendary jazz musician Charlie Parker is expected to fetch over $1 million at an auction featuring other instruments from musicians like John Coltrane and Ella Fitzgerald, with proceeds benefiting several organizations.", "qwen2.5:3b": "A saxophone belonging to Charlie Parker is expected to fetch up to $1m at an auction of jazz memorabilia featuring instruments from other musicians like John Coltrane and Benny Goodman. Other items include Ella Fitzgerald's gown, unreleased recordings by Parker, and sheet music by jazz composers. Instruments owned by Dizzy Gillespie ($500k), JJ Johnson, and Lionel Hampton are also part of the sale. Works of art by Miles Davis and Bruni Sablan will be featured. Proceeds benefit the John Coltrane Foundation, Benny Goodman's foundation, and the Red Cross. The auction takes place on 20 February.", "opencoder:1.5b": "Parker's saxophone heads auction.\n\nA saxophone belonging to legendary jazz musician Charlie Parker is expected to fetch up to $1m (£535,000) at an auction of jazz memorabilia next month. The sale, at Guernsey's Auction House in New York, will feature instruments from other musicians including John Coltrane and Benny Goodman. Other items will include an evening gown belonging to Ella Fitzgerald. Organisers said the auction was the first in the US to be devoted to items belonging to jazz musicians. Other items that will be auctioned include unreleased tape recordings of music by Parker as well as handwritten sheet music by jazz composers John Coltrane and Theolonius Monk. Among the instruments in the sale will be a trumpet which belonged to Dizzy Gillespie, which is expected to fetch around $500,000 (£267,000), as well as JJ Johnson's trombone and a vibraphone which belongs to Lionel Hampton. Works of art by musicians including Miles Davis and Bruni Sablan will also be featured. The proceeds from the auction, which will take place on 20 February, will go towards several organisations including the John Coltrane Foundation, a foundation set up in memory of Benny Goodman, and the Red Cross.\n", "smollm:1.7b": "The summary should preserve the key ideas and details of the original text:\n\n1. The sale is expected to fetch up to $1 million (£535,000) at an auction of jazz memorabilia next month.\n2. Other items that will be auctioned include instruments belonging to other musicians including John Coltrane and Benny Goodman.\n3. The sale was the first in the US to be devoted to items belonging to jazz musicians.\n4. Other items that will be auctioned include unreleased tape recordings of music by Parker as well as handwritten sheet music by jazz composers John Coltrane and Theolonius Monk.\n5. Among the instruments in the sale will be a trumpet which belonged to Dizzy Gillespie, which is expected to fetch around $500,000 (£267,000).\n6. Works of art by musicians including Miles Davis and Bruni Sablan will also be featured.\n7. The proceeds from the auction, which will take place on 20 February, will go towards several organisations including the John Coltrane Foundation, a foundation set up in memory of Benny Goodman, and the Red Cross.", "deepseek-r1:1.5b": "<think>\nOkay, so I have to summarize this text about a saxophone auction for Charlie Parker. First, I need to understand what the main points are.\n\nParker's saxophone is expected to fetch between $1 million or around £535,000. The auction will take place at Guernsey Auction House in New York and includes other jazz musicians' instruments like John Coltrane, Benny Goodman, Ella Fitzgerald, JJ Johnson's trombone, and a vibraphone that belonged to Lionel Hampton. There's also music from Miles Davis and Bruni Sablan.\n\nThe organizers mentioned it's the first US auction focused on jazz musicians' items. They're donating proceeds to the John Coltrane Foundation, the Benny Goodman foundation, and the Red Cross.\n\nI should make sure to keep only the key ideas and details without adding any explanations or formatting.\n</think>\n\nParker's saxophone, belonging to legendary jazz musician Charlie Parker, is expected to fetch up to $1 million at a sold-out auction next month. The sale will feature instruments from other musicians such as John Coltrane and Benny Goodman, including an evening gown belonging to Ella Fitzgerald. Other items include unreleased recording releases by Parker and handwritten music by John Coltrane and Theolonius Monk. The auction includes a trumpet by Dizzy Gillespie, JJ Johnson's trombone, and a vibraphone from Lionel Hampton. Works of art by Miles Davis and Bruni Sablan are also featured. Proceeds will support the John Coltrane Foundation, the Benny Goodman foundation, and the Red Cross.", "tinyllama:1.1b": "The auction held at Guernsey's Auction House in New York will include instruments and jazz memorabilia belonging to famous musicians such as Charlie Parker, Benny Goodman, John Coltrane, and Ella Fitzgerald. The sale will also feature tapings of music by jazz composers, handwritten sheet music, unreleased recordings, trumpets, trombones, and a vipraphone belonging to Miles Davis, among other items. The proceeds from the auction will be used for various charities.", "tinydolphin:1.1b": " An auction is about to take place at Guernsey's Auction House in New York where Charlie Parker's iconic saxophone heads will go under the hammer. This piece of jazz history is expected to fetch up to $1 million (£535,000) when it comes up for sale next month.", "phi:2.7b": " A saxophone belonging to Charlie Parker is expected to sell for over $1m at an auction featuring other jazz items from musicians like Benny Goodman and John Coltrane. Proceeds will be donated to various charities.\n", "orca-mini:3b": " A saxophone belonging to Charlie Parker is expected to fetch $1m at an auction of jazz memorabilia next month. Other items include unreleased tape recordings, handwritten sheet music, and instruments owned by Dizzy Gillespie and Lionel Hampton. The sale will feature works of art from musicians including Miles Davis and Bruni Sablan. Proceeds from the auction will go towards several organizations including the John Coltrane Foundation, the Benny Goodman Foundation, and the Red Cross.", "hermes3:3b": "Charlie Parker's saxophone expected at $1m auction, with jazz musician memorabilia incl. unreleased recordings, instruments by other artists (e.g. Dizzy Gillespie, John Coltrane).", "stablelm-zephyr:3b": "A saxophone owned by jazz legend Charlie Parker is expected to be sold at an upcoming auction of jazz memorabilia for up to $1 million. The event, hosted by Guernsey's Auction House in New York, will also feature items from other musicians such as John Coltrane and Benny Goodman. It will include unreleased recordings of Parker's music, handwritten sheet music by composers John Coltrane and Theolonius Monk, a trumpet owned by Dizzy Gillespie, and instruments belonging to JJ Johnson and Lionel Hampton. Proceeds from the auction will support organizations such as the John Coltrane Foundation and the Red Cross.", "chatgpt-4o-latest": "A saxophone owned by jazz legend Charlie Parker is expected to sell for up to $1 million at a jazz memorabilia auction in New York. The auction, hosted by Guernsey's Auction House, will feature instruments from musicians like John Coltrane, Benny Goodman, and Dizzy Gillespie, as well as items such as Ella Fitzgerald's evening gown and unreleased recordings of Parker. Other highlights include handwritten sheet music by Coltrane and Thelonious Monk, a trumpet belonging to Gillespie, and artwork by musicians like Miles Davis. Proceeds from the February 20 auction will benefit organizations including the John Coltrane Foundation, a Benny Goodman memorial foundation, and the Red Cross.", "stablelm2:1.6b": "A legendary jazz saxophone belonging to Charlie Parker is set to fetch up to $1 million at an upcoming auction of jazz memorabilia, featuring instruments from other musicians like John Coltrane and Benny Goodman. The event will be the first US-focused auction dedicated to jazz musician items. Other items being sold include unreleased recordings, sheet music, art pieces by musicians, and proceeds will support several organizations including the John Coltrane Foundation and the Red Cross.", "granite3.1-dense:2b": "Charlie Parker's iconic saxophone is among items expected to reach up to $1m at an upcoming auction in New York, held by Guernsey's Auction House on February 20. This inaugural US jazz memorabilia sale will feature instruments from notable musicians like John Coltrane, Benny Goodman, Dizzy Gillespie, JJ Johnson, and Lionel Hampton. Other high-value items include unreleased recordings of Parker's music, handwritten compositions by Coltrane and Theolonius Monk, and artworks by Miles Davis and Bruni Sablan. Proceeds will support the John Coltrane Foundation, Benny Goodman's memory foundation, and the Red Cross.", "reference": "The sale, at Guernsey's Auction House in New York, will feature instruments from other musicians including John Coltrane and Benny Goodman.A saxophone belonging to legendary jazz musician Charlie Parker is expected to fetch up to $1m (£535,000) at an auction of jazz memorabilia next month.Organisers said the auction was the first in the US to be devoted to items belonging to jazz musicians.Other items that will be auctioned include unreleased tape recordings of music by Parker as well as handwritten sheet music by jazz composers John Coltrane and Theolonius Monk."}