{"raw_text": "Comic Morris returns with sitcom\n \n Comedian Chris Morris, who created controversial TV show Brass Eye, is to return to screens with a new sitcom about a spoof London media worker.\n \n Morris will direct and co-write Nathan Barley - a character from cult website TV Go Home - for Channel 4. It is a send-up of the stereotypical \"cool\" metropolitan media scene, with Nicholas Burns in the title role. A Brass Eye satire of the media handling of paedophilia sparked 2,500 complaints in 2001.\n \n Nathan Barley will be \"a character-driven comedy\", according to Charlie Brooker, who created TV Go Home in 1999 and has co-written the series. Barley is described as a \"webmaster, guerrilla film-maker, screenwriter, DJ and in his own words, a 'self-facilitating media node\". The story will also feature Dan Ashcroft, a style magazine columnist, and his sister Claire, a film-maker who hates the \"cool\" scene. As well as Brass Eye, Morris was behind another news show satire, The Day Today, and dark sketch comedy Jam. The new show is expected to begin in February.\n", "llama3.2:1b": "Chris Morris returns with sitcom about London media worker, directing and co-writing it for Channel 4. The show spoofs the \"cool\" metropolitan media scene, which handled a 2001 controversy surrounding paedophilia. It stars Nicholas Burns as Nathan Barley, described as a multifaceted character.", "llama3.2:3b": "Comedian Chris Morris returns with a new sitcom called Nathan Barley, a character-driven comedy about a London media worker spoofing the \"cool\" metropolitan media scene.", "gemma2:2b": "Chris Morris returns with a new sitcom called \"Nathan Barley\". The show will be a satirical take on the London media scene, featuring a character based on Nathan Barley from TV Go Home.  It's directed by and co-written by Morris and Charlie Brooker. \n", "qwen2.5:0.5b": "Comic Morris will return with a new sitcom set in London, parodying the stereotypical media scene. Nathan Barley from TV Go Home is directing and writing for the show, while Charlie Brooker helped create it in 1999. The show features Nicholas Burns as a spoofed media worker, Dan Ashcroft as a style magazine columnist, and Claire Aslett as Claire's sister who dislikes the cool scene.", "qwen2.5:1.5b": "Comic Chris Morris returns with Channel 4 sitcom Nathan Barley, spoofing London media culture. Based on TV Go Home character Nathan Barley, it targets the \"cool\" metropolitan media scene, focusing on a \"webmaster,\" \"guerrilla film-maker,\" and others. Inspired by Brass Eye's satirical handling of paedophilia, it debuted in February with Morris directing and co-writing, featuring actors Nicholas Burns, Dan Ashcroft, Claire Ashcroft (Dan's sister), and style magazine columnist.", "qwen2.5:3b": "Comedian Chris Morris returns to television with a new Channel 4 sitcom about a spoof London media worker named Nathan Barley. Based on the cult website TV Go Home character Nathan Barley, it will feature Nicholas Burns as the title character—a webmaster, guerrilla filmmaker, and other media figures—and Dan Ashcroft (style magazine columnist) and his sister Claire (film-maker). Morris directed and co-wrote for Brass Eye which made 2,500 complaints over its satire of the media handling of paedophilia in 2001. The new series is character-driven and expected to debut in February. Morris has also worked on shows like The Day Today and Jam.", "opencoder:1.5b": "Comedian Chris Morris returns with a new sitcom about a spoof London media worker directed by Nathan Barley, starring Dan Ashcroft, Claire's sister, Nicholas Burns, and 2,500 complaints filed in 2001. A Brass Eye satire sparked controversy, as is the case with the media handling of paedophilia.\n", "smollm:1.7b": "Comedian Chris Morris returns with a new sitcom about a spoof London media worker. \n- Chris Morris will direct and co-write Nathan Barley for the new TV show Brass Eye.\n- Nathan Barley will play a character who is \"a character-driven comedy\", according to Charlie Brooker, who created TV Go Home in 1999.\n- Nathan Barley is described as a \"webmaster, guerrilla film-maker, screenwriter, DJ and in his own words, a 'self-facilitating media node'\".\n- The story will feature Dan Ashcroft, a style magazine columnist, and his sister Claire, a film-maker who hates the \"cool\" scene.\n- As well as Brass Eye, Morris was behind another news show satire, The Day Today, and dark sketch comedy Jam.\n- The new show is expected to begin in February.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about comic Morris returning with a sitcom. Let me read through it carefully.\n\nThe first sentence says that comedian Chris Morris is returning for a new sitcom. He's known as the creator of \"Brass Eye,\" which is a controversial TV show about a mayor who goes crazy and gets into hotels, leading to funny situations. So, Morris is bringing back that series but in a different format—probably a sitcom.\n\nNext, it mentions that he will direct and co-write Nathan Barley, a character from \"Tv Go Home.\" I know that \"Tv Go Home\" is a cult website where people host funny videos. The new sitcom will be a satire of the London media scene, with Nicholas Burns as the title role. It was mentioned that it satirizes the handling of paedophilia issues, which led to 2,500 complaints in 2001.\n\nThen, there's some information about Charlie Brooker, who created \"Tv Go Home\" and co-wrote the series. He described Nathan Barley as a character-driven comedy that blends webmaster, guerrilla film-maker, screenwriter, DJ, and a self-facilitating media node. The show will also feature Dan Ashcroft and Claire, who is a style magazine columnist but has a dislike for \"cool\" scenes and prefers sketch comedy instead.\n\nMorris was behind another satirical news show satire called \"The Day Today,\" and there's also a dark sketch comedy series called \"Jam.\" So the new sitcom is blending these different styles— TV Go Home satire, sketch comedy, and maybe some other elements.\n\nIt also mentions that the new series will start in February. The main goal here seems to be to show how Morris is reimagining the media scene from a comedic perspective, combining internet humor with real-life issues like paedophilia and sketch comedy.\n\nSo putting this all together, I should create a concise summary highlighting the key elements: Morris returns for a sitcom, it's a parody of London media, featuring Nathan Barley as a character, with themes of saturation, sex, and sketch comedy. It's set in February, bringing back \"Brass Eye\" on another medium.\n</think>\n\nComedian Chris Morris is returning to bring a satirical take on the London media scene to TV4. He will direct and co-write Nathan Barley, centered around a character from \"Tv Go Home,\" which blends internet humor with serious issues like paedophilia and sketch comedy. The series will start in February.", "tinyllama:1.1b": "Morris (TV Go Home creator) will return with a new sitcom called Nathan Barley, set in the fictional \"cool\" metropolitan media scene. The character of Nathan Barley will be described as a webmaster, screenwriter, DJ, film-maker, and self-facilitating media node. Dan Ashcroft (opposite Claire) is a style magazine columnist and Claire Ashcroft (opposite), a filmmaker who despises the \"cool\" scene will also feature in Nathan Barley's storyline. The sitcom, which is expected to premiere in February, will be Morris's second TV show after the critically acclaimed Brasse Eye.", "tinydolphin:1.1b": " The sitcom 'Nathan Barley' will return to screens on Channel 4 with a comedic take on the media scene in London. Created by Chris Morris, it is described as a send-up of the stereotypical \"cool\" metropolitan media culture. The show's main character will be a webmaster, guerrilla filmmaker, screenwriter and DJ, who finds himself involved in an increasingly complex web of relationships and personalities, including the self-facilitating media node, Nathan Barley.", "phi:2.7b": " Comic Chris Morris will create a new sitcom about a spoof London media worker named Nathan Barley for Channel 4. It will be a character-driven comedy with a cast including Nicholas Burns, Dan Ashcroft, and Claire Ashcroft. The show's creators want to poke fun at the stereotypical \"cool\" metropolitan media scene, which can lead to controversial situations like the 2,500 complaints about Brass Eye in 2001.\n", "orca-mini:3b": " Comedian Chris Morris is returning to television with a new sitcom called Nathan Barley, which is a send-up of the stereotypical \"cool\" metropolitan media scene. The show features a character named Nicholas Barley, who is a guerrilla film-maker, screenwriter, DJ, and self-facilitating media node. The story also includes other characters such as Dan Ashcroft and Claire Ashcroft. Morris created Brass Eye, which was a controversial satire of the media handling of paedophilia, and The Day Today, a news show satire. Nathan Barley is expected to begin in February.", "hermes3:3b": "Chris Morris [comedian] returns with sitcom about spoof London media worker, featuring Nathan Barley character.", "stablelm-zephyr:3b": "Comedian Chris Morris is creating a new sitcom called Nathan Barley, which will be a humorous look at a fictional London media worker. He will direct and co-write the show for Channel 4, which was inspired by character Nicholas Burns from the cult website TV Go Home. The story will also feature Dan Ashcroft and Claire Ashcroft, with Morris having previously created other satirical shows such as Brass Eye and The Day Today. Nathan Barley is expected to begin airing in February.", "chatgpt-4o-latest": "Comedian Chris Morris, known for Brass Eye, is returning with a new sitcom, Nathan Barley, for Channel 4. Co-written and directed by Morris, the show is based on a character from the cult website TV Go Home, created by Charlie Brooker. It satirizes the \"cool\" metropolitan media scene, with Nicholas Burns in the lead role. The series follows Nathan Barley, a self-proclaimed media figure, alongside style magazine columnist Dan Ashcroft and his sister Claire, a filmmaker who despises the scene. Morris, also known for The Day Today and Jam, will debut the show in February.", "stablelm2:1.6b": "Comedian Chris Morris will return to screens with a new sitcom called Nathan Barley, set in a spoof London media world. The series will be directed by Morris and co-written by Charlie Brooker, who created TV Go Home. It will satirize the stereotypical metropolitan media scene with Nicholas Burns as the title character. A previous Brass Eye satire on the media handling of paedophilia led to 2,153 complaints. Nathan Barley is described as a \"character-driven comedy,\" according to its creator, and will feature webmaster Dan Ashcroft, style magazine columnist Claire, and their sister. The show is expected to begin in February.", "granite3.1-dense:2b": "Comedian Chris Morris, known for his controversial series Brass Eye, returns with a new Channel 4 sitcom titled Nathan Barley. Morris directs and co-writes the character-driven comedy about a London media worker, Nicholas Burns, portrayed as a self-facilitating media node. The show, also written by Charlie Brooker (creator of TV Go Home), satirizes the urban media scene, including elements of being a webmaster, guerrilla filmmaker, screenwriter, and DJ. Nathan Barley's story intertwines with Dan Ashcroft, a style magazine columnist, and his sister Claire, a film-maker critical of the \"cool\" media culture. The series is expected to premiere in February, following Morris' previous works like Brass Eye and The Day Today.", "reference": "Comedian Chris Morris, who created controversial TV show Brass Eye, is to return to screens with a new sitcom about a spoof London media worker.As well as Brass Eye, Morris was behind another news show satire, The Day Today, and dark sketch comedy Jam.A Brass Eye satire of the media handling of paedophilia sparked 2,500 complaints in 2001.Morris will direct and co-write Nathan Barley - a character from cult website TV Go Home - for Channel 4."}