{"raw_text": "Campaigners attack MTV 'sleaze'\n \n MTV has been criticised for \"incessant sleaze\" by television indecency campaigners in the US.\n \n The Parents Television Council (PTC), which monitors violence and sex on TV, said the cable music channel offered the \"cheapest form\" of programming. The group is at the forefront of a vociferous campaign to clean up American television. But a spokeswoman for MTV said it was \"unfair and inaccurate\" to single out MTV for criticism.\n \n The PTC monitored MTV's output for 171 hours from 20 March to 27 March 2004, during the channel's Spring Break coverage. In its report - MTV Smut Peddlers: Targeting Kids with Sex, Drugs and Alcohol - the PTC said it witnessed 3,056 flashes of nudity or sexual situations and 2,881 verbal references to sex. Brent Bozell, PTC president and conservative activist said: \"MTV is blatantly selling raunchy sex to kids. \"Compared to broadcast television programmes aimed at adults, MTV's programming contains substantially more sex, foul language and violence - and MTV's shows are aimed at children as young as 12. \"There's no question that TV influences the attitudes and perceptions of young viewers, and MTV is deliberately marketing its raunch to millions of innocent children.\"\n \n The watchdog decided to look at MTV's programmes after Janet Jackson's infamous \"wardrobe malfunction\" at last year's Super Bowl. The breast-baring incident generated 500,000 complaints and CBS - which is owned by the same parent company as MTV - was quick to apologise. MTV spokeswoman Jeannie Kedas said the network follows the same standards as broadcasters and reflects the culture and what its viewers are interested in. \"It's unfair and inaccurate to paint MTV with that brush of irresponsibility,\" she said. \"We think it's underestimating young people's intellect and level of sophistication.\" Ms Kedas also highlighted the fact MTV won an award in 2004 for the Fight for Your Rights series that focused on issues such as sexual health and tolerance.\n", "llama3.2:1b": "MTV is being targeted by critics who say the cable music channel is indecent due to excessive violence, sex, and language in its programming. The Parents Television Council (PTC) monitored MTV's output from 20 March to 27 March 2004 and found it contained 3,056 flashes of nudity or sexual situations and 2,881 verbal references to sex. The PTC argues that this amounts to \"sleaze\" and that MTV is deliberately marketing its content to young viewers.", "llama3.2:3b": "Campaigners, including the Parents Television Council, have criticized MTV for \"incessant sleaze\" and accused it of targeting children with sex, drugs, and alcohol content, witnessing 3,056 flashes of nudity and 2,881 verbal references to sex during a 171-hour monitoring period in 2004.", "gemma2:2b": "The Parents Television Council (PTC) criticized MTV for its \"incessant sleaze\" based on a study of their Spring Break coverage.  They accused MTV of excessively showing nudity, references to sex, violence, and content aimed at children under 12. The PTC argues that MTV's programming is inappropriate for young viewers due to the influence television has on them.  MTV responded by saying they follow broadcasting standards reflect viewer interests and their network won an award in 2004 for a series focused on sexual health and tolerance. \n", "qwen2.5:0.5b": "MTV is seen as one of the worst offenders when it comes to airing adult content because it aired a huge number of scenes involving nudity, sex, drugs and alcohol. This is not only unfair but also inaccurate, according to the Parents Television Council (PTC) that monitors TV violence and sexuality. MTV's content is more geared towards children under 12 years old, as they are young enough to be vulnerable to sexual situations. The watchdog decided to look into MTV after a breast-baring incident during Super Bowl XLII. It has since been praised for its efforts in cleaning up the network's image of adult programming.", "qwen2.5:1.5b": "MTV has been criticized by television indecency campaigners, who monitored its Spring Break coverage from 20 March to 27 March 2004, finding it contained \"cheapest form\" of programming with substantial sex, foul language, and violence aimed at children as young as 12. Critics called this marketing of \"raunchy sex\" to millions of innocent children. MTV counters the criticism by asserting its broadcasts follow similar standards as other TV programs and that young people are intellectually mature enough to handle such content.", "qwen2.5:3b": "Campaigners criticize MTV for excessive sleaze content, claiming it targets children with sex, drugs, and alcohol references. The Parents Television Council (PTC) monitored MTV's programming from March 20-27, 2004, finding over 3,000 nudity or sexual situation flashes and nearly 3,000 verbal references to sex. PTC president Brent Bozell asserts that MTV is intentionally marketing raunchy content to young viewers, despite the network following standard broadcasting guidelines and winning an award for a series focused on youth issues. MTV's response emphasizes their programming reflects viewer interests and aims at older age groups.", "opencoder:1.5b": "The campaigners attack MTV's sleaze, which has been criticized by television indecency campaigners in the US.\n\nThe Parents Television Council (PTC) has criticized MTV for \"incessant sleaze\". They have criticized it because it offers \"cheapest form\" of programming and makes it easier for advertisers to access a large audience. \n\nThe PTC's report shows 171 hours of TV output from 20 March to 27 March 2004, during the channel's Spring Break coverage. The PTC watched 3,056 nudity or sexual situations and 2,881 verbal references to sex.\n\nFrom an independent watchdog's perspective, MTV is blantantly selling racists to kids. Comparatively similar in content with broadcast television programmes aimed at adults, but it contains significantly more explicit material and a high volume of violent imagery - and shows are aimed at children as young as 12. \n\nThe network follows the same standards as broadcasters and reflects the culture and what its viewers are interested in. Despite being unfair and inaccurate to paint MTV with that brush of irresponsibility, it acknowledges the fact that MTV won an award for the Fight for Your Rights series focused on issues such as sexual health and tolerance.\n", "smollm:1.7b": "The summary should be:\nCampaigners attack MTV 'sleaze' by MTV, which offers cheap programming with a high level of sex, drugs and alcohol content. The Parents Television Council (PTC) monitors MTV's output for 171 hours from March to April 2004 and found that the channel offered 3,056 flashes of nudity or sexual situations and 2,881 verbal references to sex on its programming. The PTC said MTV is \"unfairly\" and \" inaccurately\" blamed for MTV's content as it offers a high level of sex, drugs and alcohol in its programming.\nThe Parents Television Council (PTC) monitors MTV's output from March to April 2004 and found that the channel offered 3,056 flashes of nudity or sexual situations and 2,881 verbal references to sex on its programming. The PTC said MTV is \"blatantly selling raunchy sex\" to kids through its programming and that MTV's shows are aimed at children as young as 12 years old.\nThe watchdog decided to look at MTV's programmes after the incident in which Janet Jackson's breast-baring incident during the Super Bowl was broadcast live on television. The PTC followed the same standards as broadcasters and reflected the culture and what its viewers are interested in. It also highlighted the fact that MTV won an award in 2004 for the Fight for Your Rights series which focused on issues such as sexual health and tolerance.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about MTV's sleaze issue. Let me read through it carefully.\n\nThe main point is that MTV has been criticized for \"incessant sleaze\" by television indecency campaigners in the US. They call it their \"cheapest form\" of programming and are leading a campaign to clean up American TV. But they say MTV's program offering cheapest stuff is unfair compared to other programs with more sex, language, violence.\n\nI also see Brent Bozell from PTC's report mentioning that MTV shows have more sex, foul language, and violence for kids as young as 12, which is contrary to broadcast TV aimed at adults. There were a lot of complaints about the \"wardrobe malfunction\" during last year's Super Bowl, generating over 500k complaints.\n\nMuvvah (MTV) did win an award for their issue series. They also pointed out that MTV is targeting kids but says it's unfair to call them responsible because they're so naive.\n\nSo, the key ideas are: MTV criticized for cheapest programming, leading a cleanup campaign, but being seen as promoting adult issues. There were complaints about the Super Bowl incident and PTC's report on their content's nature.\n</think>\n\nMTV has been criticized for offering \"cheapest form\" programming, called \"incessant sleaze,\" by television indecency campaigners in the US. The Parents Television Council (PTC) advocates to clean up American TV, but MTV says its show offerings are unfair compared to other programs with more sex, foul language, and violence. PTC's report highlighted that MTV's shows aimed at children have substantially more adult content. The network also mentioned complaints about a \"wardrobe malfunction\" in the Super Bowl, leading to over 500,000 complaints. PTC reported that MTV won an award for their issue series but called it unfair to associate it with responsibility because its audience is focused on kids' issues.", "tinyllama:1.1b": "Campaigers attack MTV's \"Sléeze\" (exploitation) by citing their report that watched MTV from March 20 to March 31, 2004. The report witnessed 3,056 flashes of nudity and 2,881 verbal references to sex, while Brent Bozell, president and conservative activist for the Parent's Television Council (PTC), accused MTV of selling \"raunchy sex\" to children under 12. Despite facing a wave of complaints from parents and child safety advocates earlier in 2004, MTV insists that it follows the same standards as broadcast television and reflects the culture among young viewers. The PTC highlighted MTV's \"Fight for Your Rights\" series aimed at promoting tolerance and sexual health.", "tinydolphin:1.1b": " In a report by the Parents Television Council (PTC), it was discovered that MTV is guilty of \"incessant sleaze\" in its programming. The group critiques the cable music channel for having a cheapest form of violence on TV, with 3,056 flashes of nudity and sexual situations during its Spring Break coverage. PTC President Brent Bozell stated that MTV is blatantly selling raunchy sex to children, compared to broadcast television shows aimed at adults. The report also highlighted MTV's shows being aimed at children as young as 12.", "phi:2.7b": " The Parents Television Council criticizes MTV for \"incessant sleaze\" during its Spring Break coverage, accusing it of promoting sex, drugs, and alcohol to kids. MTV's spokeswoman says it is unfair to single out the cable music channel for criticism, but PTC says MTV's programming contains more sexual situations and foul language than other shows aimed at adults. PTC monitored MTV'S output for 171 hours in 2004, and found 3,056 flashes of nudity or sexual situations and 2,881 verbal references to sex. PTC president Brent Bozell calls MTV \"blatantly selling raunchy sex\" to children as young as 12. MTV's Jeannie Kedas says the network follows the same standards as broadcasters and reflects its viewers' interests but also highlights an award-winning series on sexual health and tolerance.\n", "orca-mini:3b": " Television indecency campaigners in the US have criticised MTV's \"cheap\" programming, which they say contains excessive sex, violence, and drug use. The Parents Television Council monitored MTV's output for 171 hours from March to April 2004 during their Spring Break coverage, and counted 3,056 flashes of nudity or sexual situations and 2,881 verbal references to sex. Brent Bozell, PTC president and conservative activist, said that MTV is \"selling raunchy sex to kids\" and that its shows are aimed at children aged 12 and below. However, MTV spokeswoman Jeannie Kedas refuted the claims, saying that MTV follows the same standards as broadcasters and reflects the culture and interests of its viewers.", "hermes3:3b": "MTV criticized for \"sleaze\", constant nudity & sexual situations by TV indecency campaigners PTC during Spring Break coverage. PTC monitored 171 hours, found 3056 flashes of nudity/ssexual situations & 2881 references to sex.", "stablelm-zephyr:3b": "Television indecency campaigners in the US, led by the Parents Television Council (PTC), have criticized MTV for what they deem \"incessant sleaze.\" The PTC monitored MTV's Spring Break coverage for 171 hours in 2004 and found 3,056 flashes of nudity or sexual situations, and 2,881 verbal references to sex. The PTC claims that MTV is deliberately marketing raunchy content to children as young as 12 years old. A MTV spokeswoman responded by calling the criticism \"unfair and inaccurate\" and argued that they reflect the interests and intellect of their viewers.", "chatgpt-4o-latest": "MTV has been criticized by the Parents Television Council (PTC) for promoting \"incessant sleaze\" through its programming, particularly during its Spring Break coverage. The PTC monitored 171 hours of MTV content and reported thousands of instances of nudity, sexual situations, and verbal references to sex, accusing the network of targeting children with explicit content. The criticism follows heightened concerns about television indecency after Janet Jackson's Super Bowl incident. MTV defended itself, stating that it adheres to broadcasting standards and reflects youth culture, arguing that the criticism underestimates young viewers' intelligence. The network also pointed to its award-winning programming on social issues as evidence of its responsible content.", "stablelm2:1.6b": "MTV has faced criticism from the Parents Television Council (PTC) for offering \"the cheapest form\" of programming, with PTC monitoring its Spring Break coverage and noting 3 flashes of nudity or sexual situations and 2 verbal references to sex in just a few hours' worth of programming. Despite this, MTV's spokesperson argued it was unfair and inaccurate to single out the network. The PTC is at the forefront of efforts to clean up American television, which includes monitoring violence and sex on TV. This comes after Janet Jackson's infamous \"wardrobe malfunction\" incident during the Super Bowl that generated numerous complaints.", "granite3.1-dense:2b": "Television watchdogs, particularly the Parents Television Council (PTC), have criticized MTV for promoting \"sleaze\" and excessive sexual content during its Spring Break coverage in 2004. The PTC monitored 171 hours of MTV's programming, identifying 3,056 instances of nudity or sexual situations and 2,881 verbal references to sex. Brent Bozell, PTC president, accused MTV of targeting children as young as 12 with raunchy content, implying that such programming influences their attitudes and perceptions negatively. In response to Janet Jackson's \"wardrobe malfunction\" at the Super Bowl, which received 500,000 complaints, MTV defended its content as reflective of youth culture and aligned with the standards set by broadcasters like CBS (owned by the same parent company). MTV spokesperson Jeannie Kedas refuted the PTC's criticism, asserting that MTV demonstrates respect for young viewers' intellect and sophistication. The network also highlighted an award-winning series, Fight for Your Rights, which addressed serious topics like sexual health and tolerance.", "reference": "But a spokeswoman for MTV said it was \"unfair and inaccurate\" to single out MTV for criticism.Brent Bozell, PTC president and conservative activist said: \"MTV is blatantly selling raunchy sex to kids.\"It's unfair and inaccurate to paint MTV with that brush of irresponsibility,\" she said.In its report - MTV Smut Peddlers: Targeting Kids with Sex, Drugs and Alcohol - the PTC said it witnessed 3,056 flashes of nudity or sexual situations and 2,881 verbal references to sex.The Parents Television Council (PTC), which monitors violence and sex on TV, said the cable music channel offered the \"cheapest form\" of programming.\"Compared to broadcast television programmes aimed at adults, MTV's programming contains substantially more sex, foul language and violence - and MTV's shows are aimed at children as young as 12."}