{"raw_text": "Hillbillies singer Scoggins dies\n \n Country and Western musician Jerry Scoggins has died in Los Angeles at the age of 93, his family has said.\n \n Scoggins was best remembered for singing the theme tune to popular US TV show The Beverly Hillbillies. The Texan-born singer approached the producers of the programme with theme tune The Ballad of Jed Clampett for the pilot which was screened in 1962. The show, which told the story of a poor man striking oil and moving to Beverly Hills, ran until 1971.\n \n Scoggins' daugher Jane Kelly Misel said that her father never tired of the song and would sing it at least once a day. \"He'd sing it at birthdays and anniversaries and variety shows. He never stopped performing it,\" she said. When a film version of The Beverly Hillbillies was made in 1993, Scoggins came out of retirement to perform the theme tune. Scoggins sang the lyrics while bluegrass stars Lester Flatt and Earl Scruggs played guitar and banjo.\n", "llama3.2:1b": "Jerry Scoggins, a country musician who performed on US TV show The Beverly Hillbillies as its opening theme song, has died at 93 in Los Angeles.", "llama3.2:3b": "Country and Western musician Jerry Scoggins died at age 93 in Los Angeles. He was best remembered for singing the theme tune to The Beverly Hillbillies, which he wrote and performed since its pilot episode in 1962. His daughter said he never tired of singing it and continued performing it daily until his death.", "gemma2:2b": "Jerry Scoggins, who sang the theme song for the TV show \"The Beverly Hillbillies,\" died at 93 in Los Angeles.  He was best known for his work on the show, which ran from 1962 to 1971.  His daughter said he continued singing the song every day throughout his life and performed it again in a film version of the show made in 1993. \n", "qwen2.5:0.5b": "A country and Western singer named Jerry Scoggins died at the age of 93 in Los Angeles. He had been best remembered for his song \"The Ballad of Jed Clampett\" that was used to tell the story of a poor man moving to Beverly Hills from Texas. His daughter, Jane Kelly Misel, described her father's dedication to his theme tune and how often he would sing it. When a film version of The Beverly Hillbillies came out in 1993, Scoggins came out of retirement to perform the song.", "qwen2.5:1.5b": "Jerry Scoggins, a country and western singer born in Texas, died at age 93 in Los Angeles after performing \"The Ballad of Jed Clampett\" on American TV show The Beverly Hillbillies for over half a century.", "qwen2.5:3b": "Hillbilly singer Jerry Scoggins, aged 93, has died in Los Angeles. Known for his role as Jed Clampett's sidekick in The Beverly Hillbillies, he sang the theme song which aired from 1962 to 1971. His daughter Jane said he performed it daily, even at celebrations. In 1993, Scoggins returned to perform the tune for a film version alongside bluegrass musicians Flatt and Scruggs.", "opencoder:1.5b": "\"Scoggins' death marked a remarkable turning point in a country music legend's career. His musical vision, directed by Hillbillies, was a journey of discovery with The Beverly Hillbillies.\"\n", "smollm:1.7b": "Scoggins singer Jerry died at age 93", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely while preserving key ideas and details. The user provided a detailed paragraph about Jerry Scoggins's passing.\n\nFirst, I should identify the main points: his death in LA at 93, what he is best known for (the theme tune of Beverly Hillbillies), the production of that show by his parents, his background as a Texan-born artist from Country and Western Music, and a specific moment when he performed during a film adaptation.\n\nI need to make sure all these elements are included in the summary. I should avoid any explanations or formatting. So just plain text with key ideas.\n\nLet me structure it: Start with \"Scoggins dies at 93,\" mention his family's comment, then detail the TV show, the year it ran, and the source of its name (Ballad of Jed Clampett). Then talk about his daughter's note on why he loved singing, and finally where he performed the song in a film version.\n\nI should ensure each sentence is clear and concise. Let me check for any possible details that might be redundant or not essential. Also, make sure it flows well without any confusion.\n</think>\n\nScoggins dies at 93 in Los Angeles. He was best known for his work on the theme tune of Beverly Hillbillies, which he approached with the assistance of his parents, who requested a song named The Ballad of Jed Clampett for a pilot episode of the show that ran from 1962 to 1971. His daughter noted that he always performed the song even on birthdays and anniversaries. In 1993, a film adaptation of Beverly Hillbillies' theme tune saw him return to perform it after retirement, playing guitar with Lester Flatt and banjo with Earl Scruggs.", "tinyllama:1.1b": "Country and Western musician Jerry Scogginns, best remembered for singing the theme tuné for popular US TV show The Bevverly Hillbillies, has passed away in Los Angeles at the age of 93. Scogginns' daughter Jane Misel confirmed that her father never tired of performing the song and would sing it at least once a day, describing him as \"always joyful\" and \"the life and soul of the party\". Despite his advancing years, Scogginns was often seen performing the theme tuné on variety shows and at birthdays. In 1993, when a film version of The Bevverly Hillbillies was made, Scogginns returned to the stage with Bluegrass stars Lester Flatt and Earl Scrughs performing the lyrics while he sang them.", "tinydolphin:1.1b": " Country singer Jerry Scoggins, best known for his theme song for The Beverly Hillbillies television series, has passed away at the age of 93. His family confirmed the news on Tuesday. Scoggins performed the song's lyrics during a screening of the television show in 1962. The Beverly Hillbills theme tune became an iconic part of the Western genre, and its success led to a successful career for Scoggins and his family.", "phi:2.7b": " Jerry Scoggins, a country and western singer known for The Ballad of Jed Clampett, passed away in Los Angeles at 93 years old. He approached the producers of the popular TV show The Beverly Hillbillies with his theme song which became iconic after the pilot screened in \n", "orca-mini:3b": " The Hillbillies singer Jerry Scoggins has passed away at 93 in Los Angeles. He was known for singing the theme tune to the popular US TV show The Beverly Hillbillies, which was approached by him for the pilot in 1962. The show ran until 1971 and his daughter said he never tired of singing it. When a film version was made in 1993, he came out of retirement to perform the theme tune with bluegrass stars Lester Flatt and Earl Scruggs.", "hermes3:3b": "Jerry Scoggins, Country singer known for \"Beverly Hillbillies\" theme, dies at 93.", "stablelm-zephyr:3b": "Country and Western musician Jerry Scoggins, best known for singing The Ballad of Jed Clampett, the theme tune to The Beverly Hillbillies, has died at 93 in Los Angeles. His daughter said he never tired of the song and performed it frequently, even singing it at important events like birthdays and anniversaries. He came out of retirement to perform the theme tune for a film version of The Beverly Hillbillies in 1993 with bluegrass musicians Lester Flatt and Earl Scruggs accompanying him on guitar and banjo.", "chatgpt-4o-latest": "Country and Western musician Jerry Scoggins has died in Los Angeles at 93. He was best known for singing the theme song to The Beverly Hillbillies, which he pitched to producers for the show's 1962 pilot. The series ran until 1971, telling the story of a poor man who struck oil and moved to Beverly Hills. Scoggins' daughter said he never tired of performing the song, singing it frequently at events. He came out of retirement in 1993 to perform it again for the film adaptation. Scoggins sang while bluegrass musicians Lester Flatt and Earl Scruggs played guitar and banjo.", "stablelm2:1.6b": "Country singer Jerry Scoggins has passed away at 75 in Los Angeles. Best known for singing the theme song 'The Ballad of Jed Clampett' for The Beverly Hillbillies, he became a fan favorite. Scoggins continued performing his rendition after returning from retirement. He later performed it in the film adaptation of the show.", "granite3.1-dense:2b": "Country musician Jerry Scoggins, renowned for his rendition of The Beverly Hillbillies theme song, passed away at 93 in Los Angeles. Born in Texas, he pitched the iconic tune to producers of the long-running series (1962-1971), which depicted a poor man's rise from rural poverty to Beverly Hills after discovering oil. Scoggins, never one to stop performing, regularly sang The Ballad of Jed Clampett at family gatherings and even returned for the 1993 film adaptation, accompanied by bluegrass legends Lester Flatt and Earl Scruggs on guitar and banjo.", "reference": "Scoggins was best remembered for singing the theme tune to popular US TV show The Beverly Hillbillies.When a film version of The Beverly Hillbillies was made in 1993, Scoggins came out of retirement to perform the theme tune.Scoggins' daugher Jane Kelly Misel said that her father never tired of the song and would sing it at least once a day.Country and Western musician Jerry Scoggins has died in Los Angeles at the age of 93, his family has said."}