{"raw_text": "McCririck out of Big Brother show\n \n Racing pundit John McCririck has become the latest contestant to be evicted from Celebrity Big Brother.\n \n He was nominated to leave the Channel 4 show by fellow housemates, alongside Happy Mondays dancer Bez. At one time Bez was among the most popular contestants but he has since become withdrawn and argumentative. McCririck was ordered to leave the house on Monday, following Jackie Stallone, the actor Sylvester's mother, who was first to be evicted. Bez reacted badly to the news that he had been nominated by five of his fellow housemates, whilst John received four votes against him. Sylvester Stallone's ex-wife Brigitte Nielsen nominated both John and Bez. She said: \"Bez is a difficult human being. There's something wrong with him. Even though he's making an effort, he's not very happy in here.\" Former Holby City actor Jeremy Edwards said he had nominated Bez after he became agitated on Friday night and talked about escaping over the wall to go clubbing. He said Bez was being \"loopy\" and \"stressed\". According to bookmaker Ladbrokes, John McCririck was 1/3 favourite to be evicted on Monday while Bez was at 9/4 . McCririck faced the public vote on Friday and received 67% of the vote to keep him in the house, whilst Jackie Stallone was evicted.\n", "llama3.2:1b": "John McCririck has been evicted from Celebrity Big Brother after receiving 67% of the vote. He was nominated by fellow housemates including Bez, who received four votes against him, and his reaction led to Jackie Stallone's eviction as her mother.", "llama3.2:3b": "John McCririck has been evicted from Celebrity Big Brother after fellow housemate Bez and others nominated him for eviction alongside Jacky Stallone who had already left.", "gemma2:2b": "John McCririck was evicted from Celebrity Big Brother after being nominated by fellow housemates.  He received four votes against him while Bez received five.  Sylvester Stallone's ex-wife Brigitte Nielsen and former actor Jeremy Edwards nominated Bez. McCririck faced a public vote which saw him keep in the house with 67% of the vote. \n", "qwen2.5:0.5b": "John McCririck became the latest contestant to leave Celebrity Big Brother after being nominated by other contestants including Sylvester Stallone's ex-wife Brigitte Nielsen.", "qwen2.5:1.5b": "John McCririck was voted out of Celebrity Big Brother by a majority among fellow contestants after being nominated alongside Happy Mondays dancer Bez.", "qwen2.5:3b": "Racing pundit John McCrisrick was evicted from Celebrity Big Brother after being nominated by fellow contestants Jackie Stallone (first evicted), Bez (former Happy Mondays dancer) and Brigitte Nielsen (ex-wife of Sylvester Stallone). McCrisick received four votes against him, while Bez faced public vote reaction for his difficult behavior. McCrisick was 1/3 favorite to be evicted based on Ladbrokes odds.", "opencoder:1.5b": "McCririck out of Big Brother show has been a contestant for John McCririck who has since left Celebrity Big Brother. He was nominated by five friends but has been withdrawn due to argumentative behaviour and was ordered to leave the house on Monday following Jack Stallone's mother, who is now inevitable eviction from his previous life. Bez reacted badly to the news that he had been nominated by four contestants including John, Sylvester Stallone, Brigitte Nielsen, and Jeremy Edwards. She said: \"Bez is a difficult human being.\" The former Holby City actor Jeremy Edwards later mentioned that he was evicted after he became agitated on Friday night and discussed escaping over the wall to go clubbing. He expressed confusion and \"loopy\" \"stressed\".\n", "smollm:1.7b": "McCririck out of Big Brother show", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about a contestant named John McCririck from \"Big Brother\" showing being evicted. Let me read through it again.\n\nThe user provided the text and wants only the summary in plain text without explanations or formatting. The example response they gave is: \"John McCririck was evicted from Big Brother due to support for other contestants, with Jackie Stallone and John getting 67% of the vote respectively.\"\n\nHmm, I need to make sure I capture all key points. The main points are that John was nominated by five housemates but received four votes against him, while Jackie got one. Brigitte Nielsen criticized Bez as being difficult and stressed. Jeremy Edwards also mentioned Bez's behavior. According to Ladbrokes, the odds were slightly in favor of John.\n\nI should keep it concise, just the summary without any extra words or explanations. Let me check if I included all important details: John was evicted because he had more votes, Jackie got 1/3 chance, John 2/3, Brigitte's criticism, Jeremy's comments on Bez, and Ladbrokes' odds.\n\nYes, that seems to cover everything from the user's text. So I can structure it with a clear summary line.\n</think>\n\nJohn McCririck was evicted due to his votes against his fellow housemates, including Jackie Stallone who got 1/3 chance. Brigitte Nielsen criticized Bez for being difficult and stressed, while Jeremy Edwards mentioned Bez's behavior. According to Ladbrokes, John had a 2/3 chance of staying.", "tinyllama:1.1b": "McCricippp, also known as Big Brother's latest contestant, has become the latest housemate to be voted out of the Channel 4 show after being nominated by fellow contestants for eviction. John McCririck, who was initially among the most popular candidates, was reportedly the target of votes from actress Sylvestre Stallone and ex-husband Bez, who each received four against him. Despite receiving support from Jackie Staullone, a former beauty queen, on Friday, McCririck faced the public vote on Monday and received 67% of the vote to remain in the house. The bookmaker Ladbrokes had previously listed John McCrirrick as the favourite to be evicted, but according to their latest odds on Monday, he was at 1/3 as a possible winner.", "tinydolphin:1.1b": " The summary: Former celebrity racing pundit John McCririck has been evicted from Big Brother amid a struggle for votes between himself and Sylvester Stallone's mother, Jackie Stallone. Both contestants received four votes each against one another but Bez, who was nominated for eviction with Jackie Stallone, had a negative experience with the process and was eventually voted out of the house on Monday.", "phi:2.7b": " John McCririck became the latest contestant to leave Celebrity Big Brother after being nominated by Sylvester Stallone's ex-wife Brigitte Nielsen for four votes. He faced the public vote on Friday and won 67% of the vote. Bez, another housemate, had been nominated by five fellow contestants including Sylvester's mother Jackie Stallone. He reacted badly to the news that he was being evicted. Jeremy Edwards also voted to evict Bez, saying that he was \"loopy\" and \n\nHe talked about escaping over the wall to go clubbing.\" According to bookmaker Ladbrokes, John McCririck was 1/3 favourite to be evicted on Monday while Bez was at 9/4.\n", "orca-mini:3b": " John McCririck became the latest celebrity to leave Celebrity Big Brother after being nominated by fellow housemates and receiving negative votes from five of them. He was evicted by the public vote on Monday. Bez received four negative votes while John received three positive votes. Despite his popularity at one time, he has since become argumentative and difficult to work with.", "hermes3:3b": "John McCririck removed from Big Brother (Celeb); nominated by other housemates, joined Bez; became latest contestant evicted.", "stablelm-zephyr:3b": "Racing pundit John McCririck was evicted from Celebrity Big Brother, receiving four votes from fellow housemates, including Happy Mondays dancer Bez. McCririck faced the public vote and received 67% of the vote to stay in the house, while Jackie Stallone was evicted first. Bez reacted poorly to being nominated, and Brigitte Nielsen, Sylvester Stallone's ex-wife, nominated both John and Bez, describing Bez as a difficult person. Former Holby City actor Jeremy Edwards also nominated Bez due to his agitated behavior and talk of escaping the house.", "chatgpt-4o-latest": "John McCririck has been evicted from Celebrity Big Brother after being nominated alongside Bez by fellow housemates. Bez, once popular, has become withdrawn and argumentative. McCririck's eviction follows Jackie Stallone's departure. Bez reacted badly to his nomination, receiving five votes, while McCririck got four. Brigitte Nielsen criticized Bez's behavior, and Jeremy Edwards nominated him for acting erratically. Bookmakers favored McCririck's eviction, and he ultimately lost the public vote, receiving 67% to stay while Jackie Stallone was evicted earlier.", "stablelm2:1.6b": "Racing pundit John McCririck has been evicted from Celebrity Big Brother along with Happy Mondays dancer Bez after being nominated by fellow housemates, including Bez himself. This is the second eviction for both contestants. John McCririck received 50% of the vote to stay in the house while Jackie Stallone was evicted. Actor Sylvester Stallone' mother, Jackie Stallone, was the first to be eliminated from the show. The text also mentions that Bez has become withdrawn and argumentative during his time on the show.", "granite3.1-dense:2b": "John McCririck, a racing pundit, has been evicted from Celebrity Big Brother following nominations by fellow contestants. Bez, Happy Mondays dancer, was also nominated alongside McCririck and was the second to be evicted. Their popularity waned; Bez became withdrawn and argumentative, while McCririck received four votes against him from five housemates. Sylvester Stallone's ex-wife Brigitte Nielsen nominated both, citing Bez as a \"difficult human being.\" Jeremy Edwards cited Bez's agitation and talk of escaping to go clubbing as reasons for his nomination. Despite Bez's popularity initially, McCririck won the public vote with 67%, keeping him in the house until Friday when he was evicted.", "reference": "According to bookmaker Ladbrokes, John McCririck was 1/3 favourite to be evicted on Monday while Bez was at 9/4 .He said Bez was being \"loopy\" and \"stressed\".He was nominated to leave the Channel 4 show by fellow housemates, alongside Happy Mondays dancer Bez.McCririck was ordered to leave the house on Monday, following Jackie Stallone, the actor Sylvester's mother, who was first to be evicted.Bez reacted badly to the news that he had been nominated by five of his fellow housemates, whilst John received four votes against him.At one time Bez was among the most popular contestants but he has since become withdrawn and argumentative."}