{"raw_text": "Johnny and Denise lose Passport\n \n Johnny Vaughan and Denise Van Outen's Saturday night entertainment show Passport to Paradise will not return to screens, the BBC has said.\n \n The ex-Big Breakfast presenters were recruited to host the BBC One family variety show last July. \"There are currently no plans for another series,\" a spokeswoman said. She added the pair \"brought a real warmth to Saturday night, but in the end we felt we had done enough with the format of the show\".\n \n Passport to Paradise involved a combination of games and outside broadcasts with a high level of audience participation. The first instalment attracted more than 4.1 million viewers - but that had dropped to fewer than 2.7 million by the time it ended. The BBC spokeswoman said Graham Norton's Strictly Dance Fever would be a priority for 2005. \"That's very much on the cards for next year, and we're concentrating at the moment on Strictly Come Dancing, which is doing phenomenally well,\" she said.\n", "llama3.2:1b": "Johnny Vaughan and Denise Van Outen will not host Passport to Paradise again due to the end of their hosting contract with the BBC.", "llama3.2:3b": "Johnny Vaughan and Denise Van Outen hosted BBC One's Passport to Paradise family variety show until it was announced that no more series would be produced. The first instalment attracted 4.1 million viewers, but numbers dropped to 2.7 million by the end of the season. Graham Norton's Strictly Dance Fever will be a priority for 2005 and Strictly Come Dancing is doing well.", "gemma2:2b": "The BBC has ended its Saturday night family variety show Passport to Paradise hosted by Johnny Vaughan and Denise Van Outen. The show was popular but viewership declined, leading to its cancellation.  Graham Norton's Strictly Dance Fever is planned for 2005. \n", "qwen2.5:0.5b": "Johnny and Denise will not host Passport to Paradise again due to their previous involvement with the show.", "qwen2.5:1.5b": "Johnny Vaughan and Denise Van Outen's Passport to Paradise entertainment show will not be renewed for a second season due to low viewership. The format involved games with audience participation. Although it attracted large audiences initially, the show's ratings dropped significantly by its end. Graham Norton's Strictly Dance Fever is expected to take priority next year instead.", "qwen2.5:3b": "Johnny Vaughan and Denise Van Outen's Passport to Paradise show hosted by BBC One will not return this season. Ex-Big Breakfast presenters were hired last July but decided against a second series due to low viewer numbers (dropping from over 4.1 million to less than 2.7 million). The show involved games and audience participation. BBC spokeswoman stated that Graham Norton's Strictly Dance Fever would be priority for next year, with Strictly Come Dancing performing exceptionally well currently.", "opencoder:1.5b": "Johnny and Denise lose Passport is a summary of the story of two British television entertainers who were faced with the decision to move away from their current shows. The decision was made by the BBC as they hoped to expand their reach into new areas, and to provide more content for viewers. They decided on a format that would allow them to continue their show schedule while also expanding their audience base.\n", "smollm:1.7b": "Passport to Paradise was a popular BBC One family variety show that featured games and outside broadcasts with a high level of audience participation. The show was hosted by Johnny Vaughan and Denise Van Outen, who brought their own unique style and energy to the program. The show's popularity peaked in 2004, attracting more than 4.1 million viewers, but it had declined significantly by the time it ended in 2005.\n\nThe BBC has announced that they will not be hosting another series of Passport to Paradise for next year. Instead, they have announced a new program called Strictly Come Dancing, which is expected to attract a large following and generate significant revenue for the BBC.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about Johnny and Denise losing Passport. Let me read through it carefully.\n\nThe main points are that they were part of a Saturday night entertainment show called Passport, which isn't returning on screens anymore. They were recruited by the BBC last July because they were ex-Big Breakfast presenters. Their performance was praised for bringing warmth to the show but wasn't enough in terms of format and audience engagement.\n\nPassport had a mix of games and broadcasts with high participation. It started with over 4 million viewers but dropped to under 2.7 million by the end. The BBC is planning Strictly Dance Fever for 2005, saying it's on the cards next year, while focusing on Strict Come Dancing now which is doing well.\n\nI need to make a concise summary that includes all these details. Let me structure it clearly without adding any extra information.\n</think>\n\nJohnny and Denise Vaughan were part of a Saturday night entertainment show called Passport, which will not return screens this week. They were former Big Breakfast presenters recruited by the BBC for its family variety show last July. Their performance was noted for warmth but lacking in format over time. Passport had a blend of games and broadcasts with high audience participation, starting with over 4 million viewers but declining to around 2.7 million by the end. The BBC is focusing on Strictly Dance Fever for 2005 while prioritizing Strict Come Dancing, which has been performing well.", "tinyllama:1.1b": "The BBC announced that Johnny Vaughan and Denise Van Outen's popular family variety show Passport to Paradise will not return for a second series. The duo brought \"a warmth\" to Saturday nighth but ultimately failed to appeal to viewers, resulting in its cancellation. The show consisted of games, outside broadcasts, and audience participation, and was well-received by audiences, with more than 4.1 million tuning in for the first episode before dropping to fewer than 2.7 million viewers. Strictly Come Dancing's popularity is a priority for next year, with Graham Norton as the top contender in line for the show.", "tinydolphin:1.1b": " The BBC has announced that Passport to Paradise, a popular Saturday night entertainment show hosted by Johnny Vaughan and Denise Van Outen, will not return for a second season. The reason given for the decision is that there are currently no plans for another series, with the show having been on air since July 2003. Passport to Paradise involved a variety of games and outside broadcasts with a high level of audience participation. Initially, it attracted more than 4.1 million viewers, but saw its number drop below 2.7 million by the time the show concluded in 2003. The BBC's spokeswoman mentioned that Graham Norton's Strictly Dance Fever would be a priority for the network in 2005.", "phi:2.7b": " Johnny Vaughan and Denise Van Outen's Saturday night entertainment show Passport to Paradise will not return due to lack of plans for another series. The first instalment attracted more than 4.1 million viewers but had dropped by the end to fewer than 2.7 million. A BBC spokeswoman confirmed that Graham Norton's Strictly Dance Fever would be a priority in 2005, with Strictly Come Dancing taking precedence as well.\n", "orca-mini:3b": " The BBC has cancelled Passport to Paradise, a family variety show hosted by Johnny Vaughan and Denise Van Outen. No plans for another series have been announced.", "hermes3:3b": "Johnny Vaughan and Denise Van Outen's entertainment show Passport to Paradise not returning, no plans for another series.", "stablelm-zephyr:3b": "BBC announces no plans for another series of Passport to Paradise, hosted by Johnny Vaughan and Denise Van Outen, as they decided \"we had done enough\" with the format. The show's first episode attracted 4.1 million viewers but ended with fewer than 2.7 million. The BBC is focusing on Graham Norton's Strictly Dance Fever for 2005.", "chatgpt-4o-latest": "Johnny Vaughan and Denise Van Outen's BBC One show *Passport to Paradise* will not return, as the BBC decided the format had run its course. The show, which featured games and audience participation, saw its viewership decline from 4.1 million to under 2.7 million. The BBC is prioritizing *Strictly Dance Fever* and *Strictly Come Dancing* instead.", "stablelm2:1.6b": "Johnny and Denise were forced to cancel their TV show Passport to Paradise due to a loss of their passport. The BBC says there are no current plans for another series. They brought warmth to Saturday night but felt they had done enough with the show's format. It started strong with over 4 million viewers, but dropped to less than 2.7 million by its end. Instead of Passport to Paradise, Graham Norton's Strictly Dance Fever is likely for next year while focus is on Strictly Come Dancing which is doing well.", "granite3.1-dense:2b": "Johnny Vaughan and Denise Van Outen, former Big Breakfast hosts, won't be returning to BBC One's Passport to Paradise. The show, launched in July, combined games and audience participation but saw its viewership decline from over 4.1 million to less than 2.7 million by the end of its run. Citing the pair's contribution of warmth to Saturday nights and completion of the format, the BBC announced no plans for another series. Instead, they prioritize Graham Norton's Strictly Dance Fever for 2005, focusing on the successful Strictly Come Dancing.", "reference": "Johnny Vaughan and Denise Van Outen's Saturday night entertainment show Passport to Paradise will not return to screens, the BBC has said.The BBC spokeswoman said Graham Norton's Strictly Dance Fever would be a priority for 2005.\"There are currently no plans for another series,\" a spokeswoman said.\"That's very much on the cards for next year, and we're concentrating at the moment on Strictly Come Dancing, which is doing phenomenally well,\" she said."}