{"raw_text": "Celebrities get their skates on\n \n Former England footballer Paul Gascoigne will join EastEnders' actress Scarlett Johnson on BBC One's Strictly Ice Dancing.\n \n The one-off Christmas special will also star television presenter Carol Smillie and Jessica Taylor from Liberty-X. Each celebrity will be paired with a professional skater to impress a panel of judges and win the audience vote. The BBC is yet to confirm the final two stars who will battle it out to become Ice King or Queen.\n \n Veteran presenter Bruce Forsyth and Tess Daly will host the programme, which follows hot on the heels of the current Saturday night series Strictly Come Dancing. The celebrities will have to practise a stipulated ice dance and perform it at an ice rink with their partner. The judges will have 50% of the vote to decide who wins the contest, with the ice rink audience making up the rest of the vote. The show forms part of the BBC's festive schedule. Ice skating duo Jayne Torvill and Christopher Dean are to front a similar celebrity ice dance show for ITV, titled Stars on Thin Ice. The contestants on Stars on Thin Ice will each be paired up with a professional skater and will learn a new routine every week. At the end of the series, one celebrity will be crowned the winner.\n", "llama3.2:1b": "Paul Gascoigne and Scarlett Johnson are joining EastEnders for Strictly Ice Dancing.\nThe show features celebrities paired with professional skaters to compete against each other in an ice dance competition.\nVeteran presenter Bruce Forsyth and Tess Daly will host the program, which follows after Strictly Come Dancing.", "llama3.2:3b": "Paul Gascoigne to join Scarlett Johnson on BBC One's Strictly Ice Dancing Christmas special, hosted by Bruce Forsyth and Tess Daly, along with other celebrities including Carol Smillie and Jessica Taylor.", "gemma2:2b": "Paul Gascoigne, Scarlett Johnson, Carol Smillie, and Jessica Taylor will compete in BBC One's \"Strictly Ice Dancing\" special for Christmas. Each celebrity will perform an ice dance with a professional skater and judges will choose a winner alongside audience vote. The show follows the popular \"Strictly Come Dancing\" series, and is part of the BBC's festive schedule. ITV's show \"Stars on Thin Ice\" features similar competition, with one celebrity winning each week. \n", "qwen2.5:0.5b": "Former England footballer Paul Gascoigne, Carol Smillie from Liberty-X, and Jessica Taylor from Liberty-X will star in BBC One's Strictly Ice Dancing special featuring veteran presenter Bruce Forsyth and Tess Daly. The show will follow a skating competition with judges and an ice rink audience making up the rest of the vote.", "qwen2.5:1.5b": "Paul Gascoigne joins Scarlett Johnson in BBC One's Strictly Ice Dancing as part of a one-off Christmas special featuring Carol Smillie, Jessica Taylor, Bruce Forsyth, Tess Daly, and Jayne Torvill and Christopher Dean from Stars on Thin Ice. The show includes celebrity ice dancers who will practice and perform routines at an ice rink to win audience votes along with judges' marks for the final championship.", "qwen2.5:3b": "Former England footballer Paul Gascoigne and EastEnders actress Scarlett Johnson are joining Carol Smillie and Jessica Taylor from Liberty-X in BBC One’s Strictly Ice Dancing Christmas special. They will pair with professional skaters to win votes from judges and an ice rink audience. Veteran presenter Bruce Forsyth will host alongside Tess Daly. The show follows Strictly Come Dancing, featuring stints by Jayne Torvill and Christopher Dean on ITV's Stars on Thin Ice, where contestants learn a new routine each week for a finale.", "opencoder:1.5b": "The text talks about the famous pairings between ice skaters and celebrities during an ice skating competition. It explains that the contestants are required to perform a specific dance on a designated ice rink while being paired up with a professional skater. The judges then vote on who wins by a 50/50 split, adding to the show's festive atmosphere.\n", "smollm:1.7b": "Celebrities get their skates on for Strictly Ice Dancing! Former England footballer Paul Gascoigne will join the show as an ice dancer with actress Scarlett Johnson. The special will also feature television presenter Carol Smillie and Jessica Taylor from Liberty-X, each paired up with a professional skater to impress the judges and win the audience vote. The BBC is yet to confirm the final two stars who will battle it out for the title of Ice King or Queen.\n\nThe show follows hot on the heels of the current Saturday night series Strictly Come Dancing, which has already won several awards including the ITV Dance Award for Best Dance Performance and the BBC Dance Award for Best Dance Show. The celebrities will have to practice a stipulated ice dance and perform it at an ice rink with their partner. The judges will have 50% of the vote to decide who wins the contest, with the audience voting in the final round.\n\nThe show forms part of the BBC's festive schedule and is expected to be a hit among young people. Ice skating duo Jayne Torvill and Christopher Dean are to front a similar celebrity ice dance show for ITV, titled Stars on Thin Ice. The contestants on Stars on Thin Ice will each be paired up with a professional skater and will learn a new routine every week. At the end of the series, one celebrity will be crowned the winner.\n\nOverall, the text is concise and to the point, summarizing the key ideas and details of the text without providing any additional information or explanations.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text concisely. Let me read through it carefully.\n\nFirst paragraph talks about former England footballer Paul Gascoigne joining an actress on BBC One's Strictly Ice Dancing. Then they mention that each celebrity pairs with a professional skater for ice dance competition.\n\nNext, there are details about Bruce Forsyth and Tess Daly hosting the show alongside Scarlett Johnson and others. They have to practice ice dancing at an ice rink, get evaluated by 50% of the audience, while the rest vote for them. The show is part of BBC's festive schedule.\n\nThen there's another show on ITV called Stars on Thin Ice with contestants paired with skaters each week, learning new routines. The winner gets to win the series.\n\nI need to make sure I include all key points: Paul Gascoigne and Scarlett Johnson from EastEnders, Bruce Forsyth and others as hosts, the pairing with skaters for competition, the judges split 50-50, the show being part of BBC's schedule. Also mention the ITV show briefly.\n\nI should avoid adding any extra details or explanations, just focus on the main points.\n</think>\n\nPaul Gascoigne and Scarlett Johnson will co-host a new season of *Strictly Ice Dancing* on BBC One, with them paired with professional skaters. The show features Bruce Forsyth and Tess Daly as hosts, who will perform ice dances at an ice rink while 50% of the audience evaluates their performance, with the rest voting for them to win. Additionally, a new series *Stars on Thin Ice* on ITV will be hosted by other celebrities paired with skaters each week, aiming to crown one winner after several rounds.", "tinyllama:1.1b": "Summary: Celebrities Gascoigne, Johnson, Scarlett, Smillié, Taylor, and Daly are set to compete in an upcoming Christmas special of Strictly Ice Dancing. Presenters Bruce Forsyth and Teess Daly will host the programme, which follows the recent Saturn Saturday program. The celebrity contestants will learn a stipulated ice dance routine and perform it at an ice rink with their partner, while judges give 50% of the vote for the performance. The remaining 50% will be decided by the audience in the form of an ice skating duo show called Stars on Thin Ice, hosted by Jayne Torvil and Christopher Dean.", "tinydolphin:1.1b": " In this text, we are provided with information about Paul Gascoigne joining Scarlett Johnson on BBC One's Strictly Ice Dancing. The show is set to air during the Christmas holidays and features skaters from both Britain and America. It will be hosted by veteran presenter Bruce Forsyth and Tess Daly, with veteran television presenter Carol Smillie also joining in as a judge. This season will have two celebrity partnerships: one pairing will be chosen by the audience vote, while the other will be chosen by both the judges and the audience.", "phi:2.7b": " Paul Gascoigne joins Scarlett Johnson in Strictly Ice Dancing, with Carol Smillie and Jessica Taylor also competing. Each celebrity will team up with a professional skater to perform an ice dance for the judges' votes, and the audience vote makes up the rest of the 50%. The show follows after another popular BBC show, Strictly Come Dancing, and is set against the festive season schedule. A similar ITV program called Stars on Thin Ice features competing celebrities learning new routines every week with a professional skater. One contestant will be crowned the winner at the end.\n", "orca-mini:3b": " Paul Gascoigne, Scarlett Johnson, Carol Smillie, Jessica Taylor, Liberty-X, Bruce Forsyth, Tess Daly, and Jayne Torvill will feature in a one-off Christmas special of Strictly Ice Dancing on BBC One. The celebrities will perform an ice dance and compete for the audience vote, with judges having 50% of the vote. The show follows the current Saturday night series Strictly Come Dancing.", "hermes3:3b": "Strictly Ice Dancing special: Paul Gascoigne, Scarlett Johnson, Carol Smillie, Jessica Taylor to compete as celebrities against each other for Ice King/Queen title, hosted by Bruce Forsyth and Tess Daly, with judges deciding 50% of winner, audience rest.", "stablelm-zephyr:3b": "Former England footballer Paul Gascoigne and EastEnders' actress Scarlett Johnson will compete in a special Christmas edition of BBC One's Strictly Ice Dancing. The one-off event will also feature television presenter Carol Smillie and Jessica Taylor from Liberty-X. Each celebrity will be paired with a professional skater to perform an ice dance routine. Hosted by Bruce Forsyth and Tess Daly, the judges will have 50% of the vote to decide the winner, while the audience will make up the rest of the vote. This follows the Saturday night series Strictly Come Dancing. A similar event for ITV, titled Stars on Thin Ice, will feature Jayne Torvill and Christopher Dean as hosts and contestants.", "chatgpt-4o-latest": "Former footballer Paul Gascoigne and actress Scarlett Johnson will compete in BBC One's Strictly Ice Dancing, a one-off Christmas special featuring celebrities paired with professional skaters. Other contestants include Carol Smillie and Jessica Taylor, with two more yet to be confirmed. Hosted by Bruce Forsyth and Tess Daly, the show will have judges and the audience vote for the winner. It is part of the BBC's festive schedule, while ITV will air a similar series, Stars on Thin Ice, hosted by Jayne Torvill and Christopher Dean, where celebrities learn a new routine each week before a final winner is chosen.", "stablelm2:1.6b": "Former footballer Paul Gascoigne, actress Scarlett Johnson, TV presenter Carol Smillie, and Jessica Taylor will star in BBC One's Strictly Ice Dancing for a Christmas special alongside veteran presenter Bruce Forsyth and Tess Daly as judges. Celebrities pair up with professional dancers to impress the panel, aiming for at least two judges' votes and audience votes to win the show. The final two stars are yet to be confirmed, with Stars on Thin Ice featuring celebrity ice dance shows every week with a new routine learned each week.", "granite3.1-dense:2b": "Former England footballer Paul Gascoigne and actress Scarlett Johnson will compete in BBC One's Strictly Ice Dancing, a one-off Christmas special. They'll pair with professional skaters to impress judges Bruce Forsyth and Tess Daly and secure the audience vote. The program follows the current Saturday night series, Strictly Come Dancing. Other celebrities include presenter Carol Smillie and Jessica Taylor from Liberty-X. Meanwhile, Ice skating legends Jayne Torvill and Christopher Dean host a competing show on ITV, titled Stars on Thin Ice. In this series, each celebrity learns a new routine weekly with a professional skater, culminating in a winner being crowned at the end of the season.", "reference": "Ice skating duo Jayne Torvill and Christopher Dean are to front a similar celebrity ice dance show for ITV, titled Stars on Thin Ice.The celebrities will have to practise a stipulated ice dance and perform it at an ice rink with their partner.The judges will have 50% of the vote to decide who wins the contest, with the ice rink audience making up the rest of the vote.Each celebrity will be paired with a professional skater to impress a panel of judges and win the audience vote.The contestants on Stars on Thin Ice will each be paired up with a professional skater and will learn a new routine every week."}