{"raw_text": "&#163;1.8m indecency fine for Viacom\n \n Media giant Viacom has paid out $3.5m (£1.8m) to end investigations into indecency in its US radio and TV shows.\n \n The settlement to the Federal Communications Commission (FCC) ends a long-running saga dating back to 2001. The FCC was looking into 50 shows, including those by \"shock jock\" Howard Stern and two New York DJs. Stern recently announced he was leaving Viacom while the two DJs were sacked after their show featured a couple purporting to have sex in a church. After the church incident two years ago Viacom agreed to install audio delay equipment at its radio stations that broadcast live programming.\n \n It also agreed to train its broadcasters and employees about indecency laws. The agreement cancels investigations into about 50 radio and television shows, said Richard Diamond, FCC deputy secretary of communications. The shows were broadcast by Viacom-owned stations across the United States. Viacom has five days to pay the $3.5m fine, according to the agreement. The payment is not related to the FCC's $550,000 (£293,000) fine levied against Viacom after the exposure of singer Janet Jackson's breast during the CBS Super Bowl halftime show in January. Viacom is contesting that fine. It is not the first time that Viacom has paid out over indecency charges. Infinity Broadcasting, which is owned by Viacom, paid cumulative fines totalling $1.7m (£907,000) in 1995 to settle FCC violations by Stern.\n", "llama3.2:1b": "Viacom agreed to pay a fine of £1.8m to the Federal Communications Commission (FCC) for its indecency cases against US radio and TV shows. The settlement ends an investigation into 50 shows dating back to 2001, including those by Howard Stern and two New York DJs. Viacom will install audio delay equipment at its stations and train staff on indecency laws within five days of payment.", "llama3.2:3b": "Viacom paid $3.5m (£1.8m) to end investigations into indecency in its US radio and TV shows after a long-running saga dating back to 2001. The settlement cancels investigations into about 50 radio and television shows, including those by Howard Stern and two New York DJs, who were previously sacked from their jobs.", "gemma2:2b": "Viacom paid a $3.5 million fine to the FCC to settle investigations into indecency in its US radio and TV shows. The investigation began in 2001 and spanned over 50 shows, including those of Howard Stern and two New York DJs.  The settlement includes the installation of audio delay equipment at radio stations and training on indecency laws. This resolves past investigations but doesn't impact a separate $550,000 fine for Janet Jackson's Super Bowl breast exposure incident. \n", "qwen2.5:0.5b": "Here's a concise summary of the given text:\n\nViacom has settled multiple allegations related to indecency charges against it by paying out $3. 5 million (US$1. 8 million) to the Federal Communications Commission.\n\nKey points:\n- Viacom paid out over $3. 5m (£1. 8m)\n- The settlement ended a long-running saga dating back to 2001\n- The FCC investigated about 50 shows including those by Stern and two New York DJs\n- Viacom agreed to install audio delay equipment at its radio stations\n- Viacom has five days left to pay the $3. 5m fine\n- Infinity Broadcasting, owned by Viacom, paid £907, 000 (£1. 8m) in 1995 to settle FCC violations by Stern", "qwen2.5:1.5b": "Viacom agreed to pay a $3.5 million fine to the Federal Communications Commission (FCC) for indecency investigations spanning multiple shows since 2001, including those of \"shock jock\" Howard Stern and two New York DJs. The settlement ends ongoing FCC inquiries into about 50 radio and television broadcasts by Viacom-owned stations across the United States.", "qwen2.5:3b": "Viacom pays $3.5m fine to end FCC investigations into indecency in US radio and TV shows dating back to 2001. The settlement involves Howard Stern's show and those of two New York DJs, who were suspended after featuring a sex act in church. Viacom agreed to install audio delay equipment and train employees on indecency laws. The FCC had investigated about 50 shows broadcast by Viacom-owned stations across the US. This fine is separate from the $550k (£293k) previously levied against Viacom for Janet Jackson's breast exposure at the Super Bowl. Viacom has paid similar fines before, totaling $1.7m in 1995 due to Stern’s shows violating indecency laws.", "opencoder:1.5b": "The output text summarizes the key details from the given input text:\n\nMedia giant Viacom has agreed to pay out a long-term settlement to end investigations into indecency in its US radio and TV shows. The settlement comes with the agreement that it will pay $3.5m (£1.8m) fine for about 50 shows, including \"shock jock\" Howard Stern's and two New York DJs. Stern recently announced he was leaving Viacom while these DJs were sacked. After the church incident, Viacom agreed to install audio delay equipment at its radio stations that broadcast live programming. It also agrees to train its broadcasters and employees about indecency laws. The agreement cancels investigations into 50 shows, as seen in the explanation by Richard Diamond, the deputy secretary of communications at the FCC. The shows were broadcast on Viacom-owned stations across the United States. Viacom has paid the $3.5m fine for five days, according to the agreement.\n", "smollm:1.7b": "Viacom has paid out $3.5 million (£1.8 million) to end investigations into indecency in its US radio and TV shows. The settlement to the Federal Communications Commission (FCC) ends a long-running saga dating back to 2001, when Viacom was looking into 50 shows, including those by Howard Stern and two New York DJs.\n\nThe agreement cancels investigations into about 50 radio and television shows, said Richard Diamond, FCC deputy secretary of communications. The shows were broadcast by Viacom-owned stations across the United States. Viacom has five days to pay the $3.5 million fine, according to the agreement. The payment is not related to the FCC's $550,000 (£293,000) fine levied against Viacom after the exposure of singer Janet Jackson's breast during the CBS Super Bowl halftime show in January.\n\nViacom is contesting that fine. It is not the first time that Viacom has paid out over indecency charges. Infinity Broadcasting, which is owned by Viacom, paid cumulative fines totalling $1.7 million (£907,000) in 1995 to settle FCC violations by Stern.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the given text about Viacom's indecency fine and settlements. First, I'll read through it carefully to understand all the key points.\n\nThe text starts with a paragraph about the $3.5 million fine for Viacom, explaining how they paid out for investigations into radio and TV shows. It mentions that the settlement was with the FCC from 2001, involving shows like \"Shock Jock\" Howard Stern's and two New York DJs. The show featuring the church incident had their staff laid off after a shocking event in 2020. Viacom agreed to install audio equipment at their stations and train employees about indecency laws. This ended investigations into 50 shows, which is less than what the FCC was looking into.\n\nThen it shifts to Richard Diamond from the FCC, who mentioned that the settlement will cancel investigations into 50 radio and TV shows by Viacom, though there might be more shows in the future. The agreement cancels about 50 shows but not all; some may still need investigation. The fine for this was $3.5 million, due in five days.\n\nViacom has a history with fines: it paid out $1.7 million to settle an FCC violation involving Howard Stern's show, and that's from 1995. It also paid more recently, but the details aren't mentioned here.\n\nViacom is challenging the 2001 FCC fine, arguing it was unfair. They're contesting the $550,000 fine they were supposed to pay. I'm not sure if that's accurate because sometimes settlements can involve multiple parties or the same party for different amounts.\n\nIn conclusion, Viacom is still in breach of their agreement with the FCC and needs to pay more, but there are ongoing investigations.\n</think>\n\nViacom Inc., a major media giant, has paid $3.5 million to settle violations related to indecency issues across its radio and TV shows. The fine was part of a settlement that ended a long-running saga starting in 2001 with the Federal Communications Commission (FCC). The FCC investigated 50 shows, including one featuring Howard Stern, which had its staff laid off after a shocking incident in 2020. Viacom agreed to install audio delay equipment at their stations and train employees about indecency laws, ending investigations into about 50 shows. This fine was due in five days.\n\nViacom has also paid $1.7 million from 1995 for an FCC violation involving Howard Stern's show. They have faced challenges with previous fines; they paid out $3.5 million in total, but there are ongoing investigations according to their agreement with the FCC. Viacom is contesting the 2001 FCC fine of $550,000.", "tinyllama:1.1b": "Viacom has agreed to pay a $3.5m (£1.8m) fine for indecent conduct violations against US radio and TV shows, including Howard Stern's show that featured a couple engaged in sex in a church. The settlement ends a long-running case dating back to 2001, and Viacom agreed to install audio delay equipment at its radio stations, train broadcasters, and employees about indecent conduct laws. The $3.5m fine is not related to the FCC's $550,000 fine against Viacom for exposing singer Jane Jackson's breast during the CBS Super Bowl half-time show in January 2019. As a result of the settlement, Viacom will have to pay the fine within 5 days. The company has also agreed to train its broadcasters and employees about indecent conduct laws.", "tinydolphin:1.1b": " The Federal Communications Commission (FCC) has ended its ongoing investigation into indecency in US radio and TV shows operated by Viacom with a $3.5m (£1.8m) fine. This follows the payment of a $550,000 (£293,000) penalty to the FCC for exposing singer Janet Jackson's breast during the CBS Super Bowl halftime show in January 2004. \n\nViacom had initially agreed to pay out the $3.5m fine after investigations by the FCC began in 2001, but the parties reached a last-minute deal this week. In return for ending the probe, Viacom has installed audio delay equipment at its radio stations and will train employees about the laws on indecency content. The fine cancels investigations into 50 shows broadcast by Viacom-owned radio and TV channels in the US.\n\nViacom is expected to contest the $550,000 (£293,000) fine imposed by the FCC after exposing Jackson's breast during the Super Bowl halftime show in January 2004. The broadcaster has a five-day deadline to pay the $3.5m fine.", "phi:2.7b": " Viacom has settled a long-running saga with the Federal Communications Commission (FCC), paying out $3.5 million (£1.8 million) to end investigations into indecency on its radio and TV shows. The settlement also includes installing audio delay equipment, training broadcasters, and cancelling investigations into about 50 programs, including those by \"shock jock\" Howard Stern and two New York DJs. Viacom has paid out $3.5m (£1.8 million) in the past over indecency charges.\n", "orca-mini:3b": " Media giant Viacom agreed to pay $3.5 million to the Federal Communications Commission (FCC) to end investigations into indecency in its radio and TV shows, including those by shock jock Howard Stern. The settlement also cancelled investigations into about 50 other shows that were broadcast by Viacom-owned stations across the United States. Viacom faces a $3.5 million fine from the FCC for Janet Jackson's Super Bowl halftime show in January, but it is contesting the fine.", "hermes3:3b": "$1.8m Viacom fine for indecent US TV and radio show investigations ending.", "stablelm-zephyr:3b": "Media company Viacom settled with the Federal Communications Commission (FCC) for $3.5 million after ending investigations into indecency in its US radio and TV shows. The settlement canceled investigations into about 50 shows, including those by \"shock jock\" Howard Stern and two New York DJs. Viacom agreed to install audio delay equipment at its radio stations and train broadcasters and employees about indecency laws.", "chatgpt-4o-latest": "Viacom has paid $3.5 million (£1.8 million) to settle FCC investigations into indecency in its US radio and TV shows, ending a probe into 50 programs, including those by Howard Stern and two DJs fired after a controversial church incident. As part of the settlement, Viacom agreed to install audio delay equipment and train employees on indecency laws. The fine must be paid within five days and is separate from a $550,000 fine related to the Janet Jackson Super Bowl incident, which Viacom is contesting. Viacom previously paid $1.7 million in 1995 for similar violations involving Stern.", "stablelm2:1.6b": "Media giant Viacom pays $3.5 million (£1.8 million) to end FCC investigations into indecency in its US radio and TV shows after investigating Howard Stern's shows, including those by New York DJs sacked for allegedly having sex in a church. Viacom agreed to install audio delay equipment at its stations, train employees about indecency laws, and pay the fine of $3.5 million within five days.", "granite3.1-dense:2b": "Media conglomerate Viacom has agreed to pay a $3.5 million fine to the Federal Communications Commission (FCC) to resolve investigations into indecency in its US radio and TV shows, spanning from 2001. The settlement encompasses approximately 50 programs, including those hosted by controversial \"shock jock\" Howard Stern and two New York DJs. These DJs were dismissed following an incident on their show where a couple was depicted having sex in a church. Viacom had previously installed audio delay equipment at its radio stations to prevent live broadcasts of indecent content and provided training for employees regarding indecency laws. This settlement does not address the FCC's earlier $550,000 fine imposed on Viacom due to Janet Jackson's breast exposure during a CBS Super Bowl halftime show in 2004, which Viacom is contesting. Additionally, Viacom had previously paid cumulative fines of $1.7 million (in current value) to settle FCC violations by Stern in 1995 through Infinity Broadcasting.", "reference": "Media giant Viacom has paid out $3.5m (£1.8m) to end investigations into indecency in its US radio and TV shows.Viacom is contesting that fine.Infinity Broadcasting, which is owned by Viacom, paid cumulative fines totalling $1.7m (£907,000) in 1995 to settle FCC violations by Stern.It is not the first time that Viacom has paid out over indecency charges.Viacom has five days to pay the $3.5m fine, according to the agreement.Stern recently announced he was leaving Viacom while the two DJs were sacked after their show featured a couple purporting to have sex in a church."}