{"raw_text": "BBC 'should allow more scrutiny'\n \n MPs have urged the BBC to give watchdogs more freedom to scrutinise how £2bn in licence fee money is spent.\n \n The Public Accounts Committee called for the National Audit Office to be given a \"free hand\" to investigate how the BBC offers value for money. Although six areas are to be opened up to scrutiny the audit office should have more power to choose what it investigated, the MPs said. The call was made in a report into the BBC's Freeview digital service. \"Our aim is not to rewrite the storyline of EastEnders but simply to ensure that the BBC is as accountable to parliament as any other organisation spending public money,\" said the committee chairman, MP Edward Leigh. \"The BBC's spending is not subject to the full independent scrutiny, and accountability to parliament. \"Parliament requires television owners to pay a licence fee and expects the comptroller and auditor general, on behalf of parliament, to be able to scrutinise how that money, over £2 billion a year, is used.\"\n \n A BBC spokeswoman said: \"We share the committee's interest in ensuring the public money we receive is spent well. Though in its infancy, we think the arrangements with the NAO are working well and should be given time to mature.\" The report said the Freeview digital service has had an \"impressive\" take up since its launch but the BBC must still dispel confusion about the service. The committee found the BBC had succeeded in ensuring subscription-free access to digital channels following the collapse of ITV Digital in 2002. But the fact that one in four homes could not access Freeview remained a problem.\n \n The report said that while gaps in the coverage were largely due to landscape issues, there was need for detailed explanations on the Freeview website and on promotional literature as to why it was not available in specific areas. The government has proposed switch off of the analogue television signal, with 2012 the most recently proposed date. The BBC launched Freeview in 2002 as an alternative to satellite subscription services such as Sky, to allow its digital channels such as BBC Three and News 24 to be seen. There have been an estimated five million Freeview set-top boxes sold since the launch and prices have fallen considerably. The corporation plans to spend up to £138m on Freeview before 2014 to ensure people can receive the service throughout the UK, and are aware of it.\n", "llama3.2:1b": "BBC MPs urge BBC to allow more scrutiny of licence fee spending.\n\nMPs want National Audit Office (NAO) to investigate how BBC offers value for money, with the committee chairman suggesting that the NAO should have more power to choose which areas to investigate.\n\nThe report found that BBC's digital service has had good take-up but is still confusing for many households.\n\nThe government proposed switching off analogue TV signal in 2012 but is not yet implementing it.\n\nThe BBC plans to spend £138m on Freeview before 2014.", "llama3.2:3b": "BBC MPs urge more scrutiny over £2bn licence fee spending, calling for National Audit Office to be given \"free hand\" to investigate value for money.", "gemma2:2b": "MPs urge the BBC to give the National Audit Office more freedom to scrutinize how its licence fee money is spent. They believe this will ensure greater accountability to parliament, just like other public-funded organizations. While the Freeview digital service has seen impressive uptake since its launch, there are still issues of coverage and information accessibility. The report emphasizes that detailed explanations about why the service isn't available in certain areas are needed on both the website and promotional materials. \n", "qwen2.5:0.5b": "The BBC has called for more scrutiny from MPs, specifically the National Audit Office to examine how the BBC spends its £2 billion in licence fee money. The committee highlighted issues such as a lack of transparency over digital services and confusion about the Freeview service being free. The BBC aims to ensure that public funds are spent responsibly while also acknowledging gaps in coverage due to landscape issues.", "qwen2.5:1.5b": "The BBC should allow more scrutiny over how £2 billion in licence fees is spent, with the Public Accounts Committee calling for a free hand from the National Audit Office. The committee's report criticized the current accountability mechanisms but praised the service's take-up since its launch. The BBC has struggled to address confusion about coverage and needs improvements on the website and promotional materials regarding areas where it may not be available. The government plans to switch off analogue television signals in 2012, requiring the BBC to invest up to £138 million for Freeview's coverage throughout the UK before that date.", "qwen2.5:3b": "MPs urged BBC to allow more scrutiny over how £2bn licence fee is spent. Public Accounts Committee wants National Audit Office given power to investigate spending. Report also highlights issues with Freeview digital service coverage in some areas. The BBC launched Freeview as a free-to-air alternative to satellite services in 2002, and has sold five million set-top boxes since then. MPs support the corporation's efforts but highlight gaps in coverage need further explanation.", "opencoder:1.5b": "BBC 'should allow more scrutiny' \n\nMPs urged the BBC to give watchdogs more freedom to scrutinise how $2bn in licence fee money is spent. The Public Accounts Committee called for the National Audit Office to be given a \"free hand\" to investigate how the BBC offers value for money. While six areas are to be opened up to scrutiny, the audit office should have more power to choose what it investigated. The call was made in a report into the BBC's Freeview digital service. The aim is not to rewrite the storyline of EastEnders but simply to ensure that the BBC is as accountable to parliament as any other organisation spending public money. The committee chairman, MP Edward Leigh explained the \"BBC's spending is not subject to the full independent scrutiny\" and was asking for accountability to parliament. \"Parliament requires television owners to pay a licence fee and expects the comptroller and auditor general, on behalf of parliament, to be able to scrutinise how that money, over $2 billion a year, is used.\" A BBC spokeswoman said: \"We share the committee's interest in ensuring the public money we receive is spent well. Though in its infancy, we think the arrangements with the NAO are working well and should be given time to mature.\" The report revealed that the Freeview digital service had an impressive take up since its launch but the BBC still faces a problem about the service's coverage.\n", "smollm:1.7b": "The BBC should allow more scrutiny by giving the Public Accounts Committee more power to investigate how £2bn in licence fee money is spent. The Public Accounts Committee has urged the BBC to give watchdogs more freedom to scrutinise how £2bn in licence fee money is spent. Although six areas are to be opened up to scrutiny, the MPs said. The BBC's spending is not subject to the full independent scrutiny, and accountability to parliament requires television owners to pay a licence fee and expect the comptroller and auditor general, on behalf of parliament, to be able to scrutinise how that money, over £2 billion a year, is used.\nThe report said the BBC has succeeded in ensuring subscription-free access to digital channels following the collapse of ITV Digital in 2002. But there was need for detailed explanations on the Freeview website and on promotional literature as to why it was not available in specific areas. The government has proposed switch off of the analogue television signal, with 2012 the most recently proposed date. The BBC launched Freeview in 2002 as an alternative to satellite subscription services such as Sky, to allow its digital channels such as BBC Three and News 24 to be seen. There have been an estimated five million Freeview set-top boxes sold since the launch and prices have fallen considerably. The corporation plans to spend up to £138m on Freeview before 2014 to ensure people can receive the service throughout the UK, and are aware of it.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about the BBC's decision regarding their digital content platform, Freeview. First, I should read through the entire passage carefully to understand all the key points.\n\nThe main argument is that the BBC should have more freedom in reviewing how its licence fee money is spent. The MPs are urging the National Audit Office (NAO) to take on a \"free hand\" when investigating spending. This makes sense because the NAO typically handles financial oversight, so having more autonomy could improve accountability.\n\nThere's also mention of a report into the BBC's operations. It says that while Freeview has had some success since ITV Digital was shut down in 2002, there are still challenges like coverage gaps. The government is considering switching from analogue TV to digital services, which would be beneficial for subscribers.\n\nThe NAO's role here is to monitor how the licence fee money is used. The report highlights that despite initial successes, there might be more need for oversight to ensure transparency and accountability. The BBC plans to invest up to £138 million by 2014 to expand coverage across the UK.\n\nI should make sure to include all these points concisely without adding personal opinions or explanations. I'll focus on the key elements: the call for increased NAO involvement, the success of Freeview despite challenges, and the financial commitment to ensure transparency.\n</think>\n\nThe BBC's decision to allow more scrutiny over how its licence fee money is spent has been called for by MPs, who urge the National Audit Office (NAO) to adopt greater independence in investigating spending. The report indicates that while Freeview digital services have had some success since ITV Digital was shut down, there are still coverage gaps and a need for detailed explanations on their website and promotional materials. The NAO is expected to invest up to £138 million by 2014 to ensure transparency and accountability, ensuring subscribers understand the service.", "tinyllama:1.1b": "BBC should allow the National Audit Office (NAO) greater scrutiny into how £2 billion in licence fee money is spent on its digital services, including Freeview. The report argues that six areas are to be opened up to scrutiñey, which would grant the NAO more power to choose what they investigate. The call was made in a report on the BBC's free TV service, Freeview, which highlighted issues of coverage gaps and need for detailed explanations on the BBC website and promotional literature. Despite this, the government has proposed a switch-off of analogue signals by 2012 with the BBC launching Freeview to ensure that people can receive digital TV despite landscape issues.", "tinydolphin:1.1b": " A BBC spokeswoman said: \"The committee's findings have only confirmed our understanding of the situation with Freeview. We share their interest in ensuring public money is spent well, including by Parliament scrutinizing how the £2bn we receive is used. Since launching Freeview, the BBC has made progress in addressing these concerns and continues to refine its approach. The committee found that Freeview's implementation has been successful, but the service must dispel confusion about the platform. While there have been areas where some homes may not have access to it, the government announced plans to switch off analogue television signals, which would also affect Freeview coverage.\"", "phi:2.7b": " MPs want more scrutiny of BBC's licence fee spending, particularly in six areas where value for money could be examined. The National Audit Office should have more freedom to investigate the corporation's use of public funds. The report also notes the need to clarify confusion about the Freeview digital service and ensure its availability to all households.\n", "orca-mini:3b": " MPs urge BBC to give watchdogs more freedom to scrutinize spending of £2bn in license fee money. The Public Accounts Committee calls for National Audit Office to have more power to investigate how BBC offers value for money. The BBC's Freeview digital service was launched in 2002 to provide subscription-free access to digital channels, but one in four homes could not access it. The government proposes switch off of the analogue television signal by 2012. The BBC plans to spend up to £138m on Freeview before 2014 to ensure coverage throughout the UK.", "hermes3:3b": "BBC calls for more freedom for audit office to scrutinise £2bn in licence fee spending, according to MPs' report.", "stablelm-zephyr:3b": "MPs in the Public Accounts Committee have called for the BBC to allow the National Audit Office (NAO) more freedom to scrutinize the £2bn in licence fee spending. The committee is asking that six areas be opened up to investigation by the NAO, which should also have the ability to choose its own investigations. Currently, the BBC's spending isn't under independent scrutiny and accountability to parliament. The report on the BBC's Freeview digital service highlighted impressive take-up since its launch but found one in four UK homes could not access Freeview due to landscape issues, which required detailed explanations on the Freeview website and promotional literature regarding availability.", "chatgpt-4o-latest": "MPs have urged the BBC to allow greater scrutiny of its £2bn licence fee spending by giving the National Audit Office (NAO) more freedom to investigate value for money. The Public Accounts Committee argued that while six areas are open to scrutiny, the NAO should have more power to choose its investigations. The call came in a report on the BBC's Freeview digital service, which has seen strong uptake but still faces accessibility issues, with one in four homes unable to receive it. The report recommended clearer explanations for coverage gaps. The BBC defended its current arrangements with the NAO, stating they should be allowed to develop. Since launching Freeview in 2002, the BBC has sold five million set-top boxes and plans to invest up to £138m by 2014 to expand access and awareness. The government has proposed switching off the analogue signal by 2012.", "stablelm2:1.6b": "MPs urge BBC to allow more scrutiny for £2bn in spending; National Audit Office seeks \"free hand\" to investigate value for money; committee suggests audit office has more power to choose investigations; Freeview digital service has had impressive take-up but needs clarification on coverage; BBC plans to spend up to £x4 on maintaining service nationwide.", "granite3.1-dense:2b": "The Public Accounts Committee has advised the BBC to grant the National Audit Office (NAO) more autonomy in scrutinizing £2 billion annually spent on licence fees. This request is part of a report focused on the BBC's Freeview digital service, which has seen five million set-top box sales since its 2002 launch. The NAO should have broader discretion to investigate how the BBC values this public money, according to committee chairman Edward Leigh. Despite the service's impressive take-up, one in four homes still lacks access due to landscape issues and insufficient explanations on the Freeview website and promotional materials. The BBC intends to invest up to £138 million by 2014 to extend Freeview coverage nationwide. The corporation supports the NAO's role in ensuring accountability, but believes current arrangements are progressing well and should be given time to mature.", "reference": "The report said the Freeview digital service has had an \"impressive\" take up since its launch but the BBC must still dispel confusion about the service.The BBC launched Freeview in 2002 as an alternative to satellite subscription services such as Sky, to allow its digital channels such as BBC Three and News 24 to be seen.The call was made in a report into the BBC's Freeview digital service.A BBC spokeswoman said: \"We share the committee's interest in ensuring the public money we receive is spent well.\"Our aim is not to rewrite the storyline of EastEnders but simply to ensure that the BBC is as accountable to parliament as any other organisation spending public money,\" said the committee chairman, MP Edward Leigh.The Public Accounts Committee called for the National Audit Office to be given a \"free hand\" to investigate how the BBC offers value for money.The committee found the BBC had succeeded in ensuring subscription-free access to digital channels following the collapse of ITV Digital in 2002."}