{"raw_text": "Wife Swap makers sue US 'copycat'\n \n The British producers of US Wife Swap are taking legal action against a show they claim is \"a blatant and wholescale copycat\" of their programme.\n \n RDF Media, which makes the show for US network ABC, has filed a damages claim for $18 million (£9.25 million) against Fox's Trading Spouses. ABC bought the rights to the British show, which was first aired in 2003 and became a hit on Channel 4. The US network is not part of the claim, but has supported RDF's action. \"We respect our producing partners' right to protect their intellectual property in whatever manner they deem most appropriate,\" said ABC in a statement. A spokesman for Fox said it had not seen the details of the legal action and could not comment.\n \n Their show was first screened in June, and was criticised in the press for its similarities to Wife Swap. ABC originally planned to call their programme Trading Moms, but changed it to avoid confusion with the Fox version. Earlier this year, the NBC network claimed that Fox's boxing show The Next Great Champ had been hurriedly produced to ensure its programme was the first to be screened. NBC alleged that boxing regulations had been violated, but failed in their attempt to have the show pulled. The Fox show proved a ratings flop, while NBC's The Contender is due to begin in February.\n", "llama3.2:1b": "The British producers of US Wife Swap are suing Fox for $18 million, claiming their show is a \"blatant and wholescale copycat\" of their programme. RDF Media bought the rights to the US version from ABC but has supported a court action against Fox's Trading Spouses. A statement from ABC stated they respect intellectual property rights and could not comment on the details.", "llama3.2:3b": "British producers of US Wife Swap sue Fox's Trading Spouses for $18 million over allegations of copying their programme, with ABC supporting their action and changing its own US version to avoid confusion.", "gemma2:2b": "RDF Media is suing Fox for copying their popular \"Wife Swap\" program. They claim Fox’s “Trading Spouses” is a blatant copy and are seeking $18 million in damages.  ABC purchased the rights to the British show, which aired in 2003. NBC previously accused Fox of rushing production on its boxing show \"The Next Great Champ\" to gain an early lead with their program. \n", "qwen2.5:0.5b": "Wife Swap producers sue ABC over copycat status, ABC not supporting RDF Media's action.", "qwen2.5:1.5b": "RDF Media sues Fox for $18 million claiming its US version of Wife Swap is a \"copycat\" and infringes on intellectual property rights. ABC bought rights to British production initially aired since 2003, while NBC attempted to stop Fox's boxing show The Next Great Champ citing regulation violations but failed. Fox has denied legal action against them.", "qwen2.5:3b": "The British producers of US Wife Swap are suing ABC and Fox over their show Trading Spouses, claiming it is a blatant copycat of their programme aired since 2003. RDF Media, which makes the US version for ABC, has filed a $18 million damages claim against Trading Spouses on behalf of its UK rights holder. Although ABC does not join in the lawsuit, it supports RDF's action. The similarities between the shows led to Trading Spouses being renamed from Trading Moms to avoid confusion with the Fox show. While NBC initially claimed that their boxing program was rushed to beat the Fox show, the latter proved unsuccessful in ratings, unlike The Contender on NBC which is set to premiere in February.", "opencoder:1.5b": "Wife Swap makers sue US 'copycat' against British producers of US Wife Swap who are taking legal action against a \"blatant and wholescale copycat\" of their programme. RDF Media filed damages claim for $18 million (£9.25 million) against Fox's Trading Spouses. ABC bought rights to British show, first aired in 2003 becoming a hit on Channel 4. US network respects its producing partners' right to protect intellectual property. Fox said it had not seen the details of legal action and could not comment. Their show was criticized for similarities with Wife Swap but changed it to avoid confusion with Fox version earlier this year. NBC claimed that Boxing regulations were violated, but failed to have the show pulled due to high ratings. The Fox and NBC show proved a Ratings flop.\n", "smollm:1.7b": "The British producers of US Wife Swap are taking legal action against a show they claim is \"a blatant and wholescale copycat\" of their programme. RDF Media, which makes the show for US network ABC, has filed a damages claim for $18 million (£9.25 million) against Fox's Trading Spouses. ABC bought the rights to the British show, which was first aired in 2003 and became a hit on Channel 4. The US network is not part of the claim, but has supported RDF's action. \"We respect our producing partners' right to protect their intellectual property in whatever manner they deem most appropriate,\" said ABC in a statement. A spokesman for Fox said it had not seen the details of the legal action and could not comment.\n\nThe US network claimed that Fox's boxing show The Next Great Champ had been hurriedly produced to ensure its programme was the first to be screened. Later this year, the NBC network is due to begin in February. The Fox show proved a ratings flop, while NBC's The Contender is due to begin in February.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about a legal case between two media companies. Let me read through it carefully.\n\nThe main point seems to be that the British producers of US Wife Swap are suing Fox, their TV network, saying they took a copycat approach on their show. They're suing because they claim their product is in violation of broadcast laws. \n\nThey filed a damages claim for $18 million against Fox, which I think was before Fox's Trading Spouses. The show was first aired in 2003 and hit Channel 4 when ABC bought it. ABC supported the action without any explanations, while Fox didn't know about the legal details.\n\nThe show started as Trading Moms but changed to Trading Mom's, avoiding confusion with the Fox version. NBC had similar issues with another show, The Next Great Champ, which they thought was hurriedly produced because they wanted it first screened, even though there were legal violations in place. Fox's show ended up being a flop, while NBC's show is set to start next month.\n\nSo, the key ideas are: \n1. British producers sue Fox for using a copycat approach.\n2. They have $18 million damages claimed against Fox.\n3. The show was first aired in 2003 and has sold millions of copies.\n4. ABC supported the legal action but didn't provide details, while Fox didn't know about it either.\n\nI need to make sure I capture all these points without adding any extra information that wasn't there before the summary. Also, ensure that the summary is concise, only in plain text with no explanations or formatting. \n\nWait, do I have all the important details? The show's first aired in 2003, sold over a million copies, ABC's stance on supporting it without more info, and Fox's lack of knowledge about the legal action. That seems comprehensive.\n\nSo putting that together into a summary, making sure to mention each key point clearly.\n</think>\n\nThe British producers of US Wife Swap are suing Fox for taking a copycat approach on their show, which was first aired in 2003 and sold over a million copies. They claim $18 million damages against Fox, while ABC supported the action without more details, but FOX did not know about the legal effort. The show was renamed Trading Moms after confusion with Fox's version, and NBC faced similar issues with another show they deemed rushed.", "tinyllama:1.1b": "The British producer RDF Media has filed a damage claim of $18 million (£9.25 million) against US show Tradition Spoises, which was based on the British TV series \"Wife Swap.\" RDF claims that the American version is a copycat of its programme and is \"blatantly copying\" the original's elements, including characters and storylines. The US network Fox had supported RDF's legal action, but has not commented as of this time. Their show Wife Swap was first broadcast in June, and was criticised in the press for being similar to their own series \"Wife Swap.\" Both shows are aimed at different audiences, and it is unclear whether they will continue as a series or face legal challenges from each other.", "tinydolphin:1.1b": " US producers of Wife Swap, RDF Media, are suing Fox's Trading Spouses over similarities between their shows. The British show's creators claim it's a copycat of their work, which raises questions about fair competition and the originality of their intellectual property.", "phi:2.7b": " A British production company has filed a lawsuit against a US network for creating a copycat version of their popular BBC program, Wife Swap. RDF Media claims that Fox's Trading Spouses is \"a blatant and wholescale copycat\" of their show, which was first aired in 2003 and became a hit on Channel 4. The lawsuit seeks $18 million in damages from ABC, the network who bought the rights to produce the show for US audiences. Despite being not part of the claim, ABC has expressed support for RDF's action and noted that they respect the producing partners' right to protect their intellectual property.\n", "orca-mini:3b": " The British producers of US Wife Swap are suing a show they claim is a copycat of their program, which was first aired in 2003 and became popular on Channel 4. RDF Media claims that the US network ABC bought the rights to the show, but did not have permission to use the name or concept of Wife Swap. The spokesman for Fox said they had not seen the details of the legal action and could not comment.", "hermes3:3b": "British Wife Swap makers sue US 'Copycat: Trading Spouses' for $18m over similarity.", "stablelm-zephyr:3b": "RDF Media, the producers of US show Wife Swap, are suing Fox's Trading Spouses, claiming it is a \"blatant and wholescale copycat\" of their programme. RDF has filed a $18m damages claim against the Fox show, which ABC bought the rights to after the original British version aired in 2003. While not part of the legal action, ABC supported RDF's stance on protecting intellectual property. Trading Spouses was first broadcast in June and drew criticism for its similarities to Wife Swap.", "chatgpt-4o-latest": "British production company RDF Media is suing Fox for $18 million, claiming its show Trading Spouses is a blatant copy of Wife Swap, which RDF produces for ABC. ABC, which legally acquired the rights to the British original, supports RDF's lawsuit but is not part of it. Fox has not commented on the legal action. Trading Spouses, which premiered in June, was criticized for its similarities to Wife Swap. ABC had initially planned to name its version Trading Moms but changed it to avoid confusion. The lawsuit follows a similar dispute where NBC accused Fox of rushing The Next Great Champ to air before its own boxing show, The Contender, though NBC failed to have Fox’s show pulled.", "stablelm2:1.6b": "British producers of the US TV show Wife Swap are suing US-based firm Fox for allegedly copying their program in Trading Spouses. RDF Media, which produces the US show for ABC, claims damages of £9 million (£3.5m) against Fox's Trading Spouses. The original plan was to call ABC's proposed show Trading Moms, but this name was changed due to similarities with Fox's hit. A similar show called Trading Moms by Channel 4 faced backlash earlier this year, leading to both NBC and Fox being criticized in the press for their similar content.", "granite3.1-dense:2b": "British Wife Swap producers RDF Media have sued Fox's Trading Spouses for $18 million (£9.25 million), alleging it's a \"blatant and wholescale copycat\" of their 2003 hit show, which was initially aired on Channel 4 in the UK. ABC, the US network that acquired the rights to Wife Swap, is supporting RDF's claim but has not detailed its involvement. The lawsuit follows media criticism of Trading Spouses' similarities to Wife Swap. NBC previously accused Fox's boxing show, The Next Great Champ, of violating regulations and rushing production to air first, but the attempt to halt it failed.", "reference": "The British producers of US Wife Swap are taking legal action against a show they claim is \"a blatant and wholescale copycat\" of their programme.ABC bought the rights to the British show, which was first aired in 2003 and became a hit on Channel 4.Earlier this year, the NBC network claimed that Fox's boxing show The Next Great Champ had been hurriedly produced to ensure its programme was the first to be screened.RDF Media, which makes the show for US network ABC, has filed a damages claim for $18 million (£9.25 million) against Fox's Trading Spouses.Their show was first screened in June, and was criticised in the press for its similarities to Wife Swap."}