{"raw_text": "Show over for MTV's The Osbournes\n \n Rock star Ozzy Osbourne has said his family will not make any more episodes of reality TV show The Osbournes.\n \n \"At the end of it I didn't like having cameras around the house all the time,\" the Black Sabbath singer told reporters at the MTV Europe Awards in Rome. His wife Sharon, who also appears in the popular MTV show based on the Osbournes' family life, agreed. \"Now everybody's doing reality shows. He's done it, he's been there, he's got to do something else,\" she said.\n \n Ozzy Osbourne said he had had enough of the work involved in making the series. \"When you watch a 25-minute episode, I've been filming all day,\" he said. Sharon Osbourne is currently appearing as a judge and mentor in ITV1 talent show The X-Factor alongside Simon Cowell and Louis Walsh.\n \n Earlier this year she topped a poll of the most important people in rock, for her part in guiding the career of husband Ozzy and her family. She was the driving force behind The Osbournes, which ran for three series, earning the family a reported $85m (£46m). The renewed popularity for Ozzy has seen sales of his merchandise hit the $50m (£27.2m) mark, a record for a heavy metal artist. Sales of T-shirts, accessories and action figures have rocketed since The Osbournes hit screens. At its peak, The Osbournes had a regular audience of eight million, with America's TV Guide magazine describing the series as \"a cross between The Simpsons and This Is Spinal Tap\". Osbourne himself was at a loss to explain its popularity: \"I suppose Americans get a kick out of watching a crazy Brit family like us make complete fools of ourselves every week.\"\n", "llama3.2:1b": "Ozzy Osbourne has said he will not continue the reality TV show The Osbournes. Sharon Osbourne, who also appears on the show, agreed with him. Ozzy had enough of filming and feels pressured to create more content. He is currently focusing on his career after appearing as a judge and mentor on ITV1's talent show The X-Factor alongside Simon Cowell and Louis Walsh.", "llama3.2:3b": "Ozzy and Sharon Osbourne say they won't do more episodes of The Osbournes, citing cameras being around the house all the time. Ozzy had enough work involved in making the series. Sharon is currently appearing on ITV1's The X-Factor.", "gemma2:2b": "Ozzy Osbourne has ended filming for *The Osbournes* reality show, citing fatigue.  His wife Sharon Osbourne will continue in other projects and the series' popularity has led to significant earnings for both of them. \n", "qwen2.5:0.5b": "Ozzy Osbourne has left MTV’s The Osbournes due to the series' content, having made up his mind to continue with his career outside reality TV. He agreed with Sharon Osbourne's suggestion that he be a judge and mentor on ITV1's The X-Factor alongside Simon Cowell and Louis Walsh.", "qwen2.5:1.5b": "Ozzy Osbourne's reality TV show The Osbournes is ending, due in part to his growing interest in music. His wife Sharon has also left the show, becoming a judge on ITV1 talent show The X-Factor alongside Simon Cowell and Louis Walsh. Despite being called \"a cross between The Simpsons and This Is Spinal Tap\", sales of Ozzy's merchandise have increased significantly since its launch, with Osbourne admitting that Americans might enjoy watching him and his family \"make complete fools of ourselves\" on the show.", "qwen2.5:3b": "Rock star Ozzy Osbourne has announced that his family will not produce any more episodes of The Osbournes, a reality TV show featuring their family life. Both Ozzy and wife Sharon Osbourne expressed their dissatisfaction with the work involved in making the series. They believe reality TV is becoming overused and suggest it's time for other celebrities to move on from such shows. The Osbournes were popular, earning the family $85 million (£46 million) through three series, and also helped boost Ozzy Osbourne's merchandise sales to a record of $50 million (£27.2 million). Despite its initial popularity, Sharon Osbourne was voted as the most important person in rock for her role in guiding her husband and family.", "opencoder:1.5b": "Rock star Ozzy Osborne has said his family will not make any more episodes of reality TV show The Osbournes. He told reporters at the MTV Europe Awards in Rome that \"At the end of it I didn't like having cameras around the house all the time\". The Black Sabbath singer agreed, who also appeared on a popular MTV show based on the Osbournes' family life. Now everybody's doing reality shows. He's done it, he's been there, he's got to do something else. Ozzy has had enough of the work involved in making the series. \"When you watch a 25-minute episode, I've been filming all day\" he said. Sharon Osborne is currently appearing as a judge and mentor in ITV1 talent show The X-Factor alongside Simon Cowell and Louis Walsh. Earlier this year she topped a poll of the most important people in rock, for her part in guiding the career of husband Ozzy and her family. She was driving behind The Osbournes, which had a peak audience of eight million with America's TV Guide magazine describing it as \"a cross between The Simpsons and This Is Spinal Tap\". Ozzy himself is at a loss to explain its popularity.\n", "smollm:1.7b": "The summary is concise, preserving the key ideas and details from the original text. It captures the main points without providing any additional explanations or analysis. The summary focuses on the essential information about Ozzy Osbourne's decision to stop making episodes for MTV's reality TV show The Osbournes, highlighting his reasons for doing so and the impact it had on his career.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely while preserving key ideas and details. Let me read through it carefully.\n\nFirst paragraph mentions Ozzy Osbourne's family won't make more episodes of \"The Osbournes\" because they took too long with cameras. His wife Sharon also appeared in another show but now is part of \"The X-Factor.\"\n\nNext, Ozzy said he had enough of reality TV work. He mentioned filming a 25-minute episode all day without cameras.\n\nSharon was once part of \"The Osbournes\" which had $85m in revenue for the family and sold over 8 million T-shirts.\n\nShe is now on \"The X-Factor,\" topping polls and selling lots of merchandise, reaching $50m and described as a mix of shows.\n\nOzzy is confused about why it's popular but thinks Americans get excited by the British families. He also mentioned the TV guide describing it as similar to \"This Is Spinal Tap.\"\n\nI need to make sure I include his family's decision, Sharon's recent role in X-Factor, her previous show's success and sales numbers, and how Ozzy feels about its popularity despite being a heavy metal artist.\n\nNow, I'll start structuring the summary with these points. Make it clear and concise without any explanations or formatting.\n</think>\n\nOzzy Osbourne's family will stop making episodes of \"The Osbournes,\" as they took too long with cameras. His wife Sharon also appeared in another show but now is part of \"The X-Factor.\" Ozzy admitted he had enough of reality TV work, stating that a 25-minute episode required filming all day without cameras. Sharon was once part of \"The Osbournes\" which earned the family $85m and sold over 8 million T-shirts. She is now on \"The X-Factor,\" topping polls for her role as a judge and mentor. Sharon describes herself as a driving force behind the show, which has sold $50m in merchandise, describing it as a mix of \"This Is Spinal Tap\" and \"Simpsons.\" Ozzy is confused about its popularity but believes Americans get excited by British families' reality shows.", "tinyllama:1.1b": "Rock star Ozzy Osbourne has revealed that he and his wife Sharon have decided against making any more episodes of MTV's reality TV show The Osbourne. The couple had been filming a third series for six months, but after the recent renewed popularity for Ozzy, they decided to take a break from the project. Earlier this year, the Osbournes topped a poll of the most important people in rock music, while also earning an estimated $85m (£46m) in sales for their merchandise. While it remains unclear why Ozzy and Sharon decided against making any more episodes of The Osbourne, they have expressed gratitude for the success the show has enjoyed since its debut on MTV in 2011.", "tinydolphin:1.1b": " The Osbournes, MTV's hit reality show based on the lives of the Black Sabbath frontman Ozzy and his family, has come to an end after its third season. In a recent interview with reporters at the MTV Europe Awards in Rome, Sharon Osbourne, Ozzy's wife, revealed that they had decided not to make any more episodes of the show. \"At the end of it I didn't like having cameras around the house all the time,\" she said. The popular reality series featured Ozzy Osbourne, his wife Sharon, and their four children—Tila Tequila, Jessica Simpson, Rachel Uchikawa, and Jack Osbourne—as they navigated the challenges of balancing their careers with family life.", "phi:2.7b": " Ozzy Osbourne announced that he will not produce any more episodes of MTV's The Osbournes, which is based on the family's life. He said he did not enjoy having cameras around his house and Sharon agreed. She also judges a TV talent show called The X-Factor with her husband as a mentor. The show was very popular in America and made the Osbornes rich. They sold many merchandise items related to them, such as T-shirts, accessories and action figures.\n", "orca-mini:3b": " Ozzy Osbourne has ruled out any more episodes of reality TV show The Osbournes due to his dislike for cameras following him all the time. His wife Sharon also agrees and has given her opinion that everyone is now doing reality shows, so he has completed something else. They have topped a poll as the most important people in rock, guiding the career of husband Ozzy and their family. The renewed popularity for Ozzy has seen sales of his merchandise hit the $50m (£27.2m) mark, a record for a heavy metal artist.", "hermes3:3b": "Osbourne, Sharon not doing more The Osbournes episodes. They disliked having cameras in house. Ozzy sold $85m series, merchandise reached $50m record for heavy metal artist.", "stablelm-zephyr:3b": "Ozzy Osbourne and his wife Sharon have decided not to make any more episodes of MTV's reality TV show, The Osbournes, due to Ozzy feeling like he had enough of being filmed all the time. The couple attributes the success of their reality TV show, which ran for three series and earned them $85 million, to sales of Ozzy's merchandise reaching a record high of $50 million. Sharon recently appeared as a judge on ITV1 talent show The X-Factor alongside Simon Cowell and Louis Walsh.", "chatgpt-4o-latest": "Ozzy Osbourne announced that his family will not film more episodes of MTV's reality show *The Osbournes*, citing discomfort with constant cameras and the demanding filming schedule. His wife, Sharon Osbourne, agreed, noting that reality TV has become widespread. Sharon, who played a key role in the show's success, is now a judge on *The X-Factor*. *The Osbournes* ran for three seasons, earning the family $85 million and boosting Ozzy's merchandise sales to $50 million. At its peak, the show had eight million viewers and was described as a mix of *The Simpsons* and *This Is Spinal Tap*. Ozzy admitted he was unsure why it was so popular but speculated that Americans enjoyed watching their eccentric British family.", "stablelm2:1.6b": "Ozzy Osbourne and his wife Sharon announced that they won't be making more episodes of the reality TV show The Osbournes. They cited the work involved as their reasons for leaving. Ozzy said filming all day made him exhausted, while Sharon mentioned that she and her family have done enough reality shows already. The Osbournes ran three series and earned them a reported $1 million (approx. £1 million). It also had a high viewership with eight million regular viewers in America.", "granite3.1-dense:2b": "Ozzy Osbourne and his wife Sharon have decided not to continue filming The Osbournes, a reality TV show about their family life. Ozzy expressed dislike for the constant presence of cameras in their home. Sharon, who also appeared on The X-Factor, agreed that it was time for a change. The Osbournes, which aired for three seasons and earned the family $85m (£46m), boosted Ozzy's merchandise sales to $50m (£27.2m), marking his highest record in heavy metal sales. Despite its popularity, Ozzy couldn't understand why Americans found their family's antics entertaining.", "reference": "Rock star Ozzy Osbourne has said his family will not make any more episodes of reality TV show The Osbournes.Ozzy Osbourne said he had had enough of the work involved in making the series.His wife Sharon, who also appears in the popular MTV show based on the Osbournes' family life, agreed.She was the driving force behind The Osbournes, which ran for three series, earning the family a reported $85m (£46m).Osbourne himself was at a loss to explain its popularity: \"I suppose Americans get a kick out of watching a crazy Brit family like us make complete fools of ourselves every week.\"Earlier this year she topped a poll of the most important people in rock, for her part in guiding the career of husband Ozzy and her family."}