{"raw_text": "Muslim group attacks TV drama 24\n \n A British Muslim group has criticised the new series of US drama 24, which is about to be aired on Sky One, claiming it portrays Islam unfairly.\n \n The Muslim Council of Britain has complained to broadcasting watchdog Ofcom. It says the programme breaches editorial guidelines. The group's members met with Sky executives on Tuesday after viewing previews of the first five episodes. The drama, now in its fourth series, begins on Sunday evening. The new series portrays a Muslim family as a sleeper terrorist cell. The Muslim Council of Britain said in a statement: \"We are greatly concerned by the unremittingly hostile and unbalanced portrayal of Muslims in this series of 24 based upon a preview of the first five episodes that we have seen.\" \"There is not a single positive Muslim character in the storyline to date. At a time when negative stereotypes of Muslims are on the increase we feel that Sky - as a major UK broadcaster - has a responsibility to challenge these insidious views, not help to reinforce them.\" But Sky denied the programme breached broadcasting guidelines. A spokesperson said: \"During a useful meeting yesterday, Sky listened to the concerns raised by representatives of the council. Sky does not believe that the episodes that it has reviewed to date breach Ofcom's programme code.\" Fox TV, which shows the series in the US, is broadcasting public service announcements showing Muslims in a positive light after complaints about the series.\n", "llama3.2:1b": "A British Muslim group, the Muslim Council of Britain, criticized a new series of US drama 24 for portraying Islam unfairly and unbalancely. The series begins on Sunday evening and depicts a Muslim family as a sleeper terrorist cell. The council accused Sky One of breaching editorial guidelines after viewing previews, with no positive Muslim characters in the storyline.", "llama3.2:3b": "A British Muslim group criticized the new series of US drama 24 for portraying Islam unfairly, claiming negative stereotypes and no positive Muslim characters. The Muslim Council of Britain complained to Ofcom's broadcasting watchdog, while Sky denied breaching guidelines, stating they did not believe the episodes breached code.", "gemma2:2b": "A British Muslim group has complained that the new season of the US drama \"24\" unfairly portrays Islam and breaches editorial guidelines. The group's concerns were raised with Sky executives after viewing previews, which feature a Muslim family as a sleeper terrorist cell.  Sky maintains that the show does not violate broadcasting regulations. Fox TV is also taking action, airing public service announcements showcasing positive portrayals of Muslims following complaints. \n", "qwen2.5:0.5b": "A British Muslim group criticized the new episode of American drama 24, claiming it portrays Islam unfairly. They met with Sky executives to discuss the program's content and expressed concerns that it portrays a Muslim family as a sleeper terrorist cell. The BBC claimed the programme breaches broadcasting guidelines but denied it violated its code. Fox TV is airing positive public service announcements after receiving complaints about the show.", "qwen2.5:1.5b": "Muslim group criticizes new 24 drama episode as portraying Islam negatively, leading council to complain to OFCOM and Sky denies breach of guidelines. Sky denied airing negative portrayal of Muslims, while Fox has aired positive advertisements following complaints.", "qwen2.5:3b": "A British Muslim group criticized the new series of US drama 24 for unfairly portraying Islam and depicted a Muslim family as a sleeper terrorist cell. The Muslim Council of Britain complained to Ofcom, claiming it breaches editorial guidelines. They argued that there are no positive portrayals of Muslims in the storyline at a time when negative stereotypes are increasing. Sky denied breaching broadcasting guidelines but listened to the council's concerns during a meeting. Fox TV is also showing public service announcements portraying Muslims positively due to complaints about 24.", "opencoder:1.5b": "\"The British Muslim group criticized the drama 24 for portraying the US programme as against its principles. The campaign in the UK is divided by complainant representatives from Sky One executives and broadcasting watchdog Ofcom.\"\n", "smollm:1.7b": "Muslim group attacks TV drama 24", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving key ideas and details. Let me read through it carefully.\n\nThe text starts by mentioning a British Muslim group that criticized a new TV drama on 24 TV show. The drama is set to air on Sky One, which is a UK-based broadcasting service. The group claims the drama portrays Islam unfairly.\n\nThey called the Muslim Council of Britain to complain about the program. The council says the series violates editorial guidelines and has no positive Muslims in its storyline. They're concerned that the pilot episodes show an unbalanced portrayal of Muslims, especially since negative stereotypes are on rise.\n\nSky One is airing the fourth series now, which focuses on a Muslim family as a sleeper terrorist cell. They denied the show breached broadcasting codes, saying Sky doesn't believe it did because they've seen pilot episodes with insidious views but are focused on addressing them.\n\nOther broadcasters like Fox TV, which is based in the US, are showing positive statements to counteract the criticism by public service announcements.\n\nSo, I need to capture all these points: the group's complaint about fairness, the council's response, Sky's denial, and other broadcasters' efforts to show positivity.\n</think>\n\nThe British Muslim group criticized a TV drama on 24 TV, which portrays Muslims as insiduous in an unbalanced manner. They called for complaints from Ofcom and public service announcements by Fox TV, which seek positive portrayals of Muslims. Sky One aired the fourth series focusing on a Muslim family as a terrorist cell, with Sky denying any editorial violations.", "tinyllama:1.1b": "A British Muslim group has criticized the new series of US drama 24, saying it breaches editorial guidelines by portraying Islam unfairly. The Muslim Council of Britain has met with Sky executives on Tuesday after viewing preview clips of the first five episodes of the fourth season. According to their statement, the show's portrayal of a Muslim family as a sleepy terrorist cell is unremittingly negative and unbalanced, while at a time when negative stereotypes of Muslims are on the rise, Sky should challenge these insidious views and help to raise positive images. Despite the meeting, Sky denied that the series breached broadcasting guidelines, stating that the episodes reviewed so far do not violate Ofcom's code. Fox TV, which airs the show in the US, has also produced PSA campaigns promoting Muslims in a positive light after receiving complaints about the series.", "tinydolphin:1.1b": " The Muslim group is upset at the portrayal of Islam in the new TV drama series '24'. They have complained to the broadcasting watchdog Ofcom and claim that it goes too far in criticizing and undermining the values and beliefs of Islam. The show portrays a family as being involved in terrorism. \n\nThe Muslim Council of Britain has met with representatives from Sky, who will air the new episodes on Sunday night. They have expressed their concern over the negative portrayal of Muslim characters and the way they are presented. The group argues that there is not a single positive character representing Islam in the storyline. \n\nHowever, Sky denies these claims, stating that the episodes reviewed so far do not breach Ofcom's programming guidelines for UK broadcasting. A spokesperson explains: \"We had a useful meeting with the council yesterday and discussed the concerns they raised during this meeting. We believe there is nothing in the episodes currently shown that goes against Ofcom's guidelines, so we do not believe the episodes breach them.\" \n\nThe Fox TV show, which shows the series in the US, has also broadcasted public service announcements to highlight the positive image of Muslims. This move is seen by many as a step towards promoting tolerance and understanding among viewers.", "phi:2.7b": " A British Muslim group criticizes the new series of American drama 24 for portraying Islam unfairly and plans to complain to the UK's broadcasting watchdog. The show begins on Sunday evening and depicts a Muslim family as a sleeper terrorist cell, with no positive Muslim character in the storyline. Sky TV denies breaching broadcasting guidelines, but Fox TV will broadcast public service announcements showing Muslims in a positive light.\n", "orca-mini:3b": " A British Muslim group criticized the new series of US drama 24, which will be aired on Sky One. The group complained to broadcasting watchdog Ofcom, claiming that the program breaches editorial guidelines. The series portrays a Muslim family as a sleeper terrorist cell and there are no positive Muslim characters in the storyline. At a time when negative stereotypes of Muslims are on the increase, Sky believes that it has a responsibility to challenge these insidious views, not help to reinforce them. However, Fox TV is broadcasting public service announcements showing Muslims in a positive light after complaints about the series.", "hermes3:3b": "British Muslim group criticizes TV drama 24 for negative portrayal of Islam.", "stablelm-zephyr:3b": "A British Muslim group, the Muslim Council of Britain, has criticized the new series of the US drama 24, airing on Sky One, claiming it portrays Islam unfairly and breaches editorial guidelines set by broadcasting watchdog Ofcom. The group expressed concern over the \"unremittingly hostile and unbalanced portrayal\" of Muslims in the series, especially given the increase in negative stereotypes. Sky denied the program breached broadcasting guidelines, stating that they did not believe the episodes violated Ofcom's program code. Fox TV has also responded by broadcasting public service announcements showing Muslims in a positive light to address previous complaints about the series.", "chatgpt-4o-latest": "A British Muslim group, the Muslim Council of Britain, has criticized the new series of the US drama 24, claiming it unfairly portrays Islam by depicting a Muslim family as a sleeper terrorist cell. The group has complained to Ofcom, arguing the show breaches editorial guidelines and reinforces negative stereotypes. After previewing the first five episodes, they met with Sky executives, urging the broadcaster to challenge such portrayals. Sky, however, denied any breach of guidelines. In response to similar concerns in the US, Fox TV is airing public service announcements showing Muslims in a positive light.", "stablelm2:1.6b": "A British Muslim group has criticized the new US drama series \"Cot\" airing on Sky One, claiming it unfairly represents Islam. The Muslim Council of Britain complained to Ofcom as the program breaches editorial guidelines. The four-series show portrays a Muslim family as a sleeper terrorist cell without positive Muslim characters. However, Sky denies the program breached broadcasting guidelines. Fox TV broadcasts the series in the US with public service announcements supporting Muslims.", "granite3.1-dense:2b": "The British Muslim group, the Muslim Council of Britain, has protested against the upcoming fourth season of U.S. TV drama 24 on Sky One, arguing that it perpetuates harmful stereotypes of Muslims. They claim the series depicts a Muslim family as terrorists without any positive characters, and accuse Sky of failing its responsibility to counteract such negative portrayals. After viewing previews, council members met with Sky executives, expressing concerns that the first five episodes reinforce insidious views during a time when anti-Muslim stereotypes are growing. Sky refuted these claims, asserting that reviewed episodes adhere to Ofcom's program code. Meanwhile, Fox TV, which airs 24 in the U.S., has countered negative portrayals with positive Muslim representations following similar complaints.", "reference": "A British Muslim group has criticised the new series of US drama 24, which is about to be aired on Sky One, claiming it portrays Islam unfairly.But Sky denied the programme breached broadcasting guidelines.The Muslim Council of Britain said in a statement: \"We are greatly concerned by the unremittingly hostile and unbalanced portrayal of Muslims in this series of 24 based upon a preview of the first five episodes that we have seen.\"Sky does not believe that the episodes that it has reviewed to date breach Ofcom's programme code.\"The Muslim Council of Britain has complained to broadcasting watchdog Ofcom.The new series portrays a Muslim family as a sleeper terrorist cell."}