{"raw_text": "Little Britain two top comic list\n \n Little Britain stars Matt Lucas and David Walliams have been named the most powerful people in TV comedy, in a poll by listings magazine Radio Times.\n \n The duo kept Phoenix Nights creator Peter Kay at number two and The Office star Ricky Gervais in third place. A Radio Times panel compiled the list, taking the comedians' critical acclaim and financial success into account. Newcomers to the annual list included Nighty Night star Julia Davis at seven and Black Books' Tamsin Greig at 19.\n \n Lucas and Walliams won numerous awards for Little Britain in 2004, including National Television, Royal Television Society and British Comedy awards. More than 1.8 million people watched the first episode of the latest series of Little Britain on BBC Three in October, giving the digital channel its highest rating ever.\n \n They topped the Radio Times list after rising from 10th position last year. Other big risers over the past year included presenting duo Ant and Dec at five, up from 13 in 2004, Stephen Fry rising nine places to 15 and BBC Three controller Stuart Murphy, who moves to number 18 from 32 last year. Last year's winner, chat show host Graham Norton, fell to number 16 following relatively few television appearances in 2004. Production companies also featured in the top 50, including Steve Coogan's Baby Cow, which created Nighty Night among others, Hat Trick - behind The Kumars at Number 42 - and The Vicar of Dibley production company Tiger Aspect.\n", "llama3.2:1b": "Little Britain stars Matt Lucas and David Walliams are named most powerful people in TV comedy by Radio Times.\n\nThe list includes Phoenix Nights creator Peter Kay (2nd) and Ricky Gervais (3rd). \n\nLucas and Walliams won awards for Little Britain, including National Television award, Royal Television Society award, and British Comedy Award.", "llama3.2:3b": "Little Britain stars Matt Lucas and David Walliams were named the most powerful people in TV comedy by Radio Times, with Peter Kay in second place and Ricky Gervais in third. Newcomers Julia Davis (7) and Tamsin Greig (19) made the list, while Ant and Dec rose to fifth. Graham Norton fell to 16 after a relatively quiet year of appearances.", "gemma2:2b": "Matt Lucas and David Walliams topped Radio Times' list of the most powerful people in TV comedy. Their success, including awards for Little Britain and high ratings for its latest series, contributed to their ranking. Other notable figures on the list include Peter Kay at number two, Ricky Gervais at three, Julia Davis at seven, and Tamsin Greig at 19.  \n", "qwen2.5:0.5b": "Little Britain stars Matt Lucas and David Walliams have been named the most powerful people in TV comedy by Radio Times, with Luke and Walliams staying at number two while Ricky Gervais remains at number three. Newcomers to the annual list include Julia Davis at seven and Tamsin Greig at 19.", "qwen2.5:1.5b": "Radio Times names Matt Lucas and David Walliams as the most powerful TV comedians in a poll, followed by Peter Kay and Ricky Gervais, with Julia Davis and Tamsin Greig rising to new positions. Little Britain is among top comedy producers on Radio Times' list.", "qwen2.5:3b": "Matt Lucas and David Walliams named most powerful people in TV comedy by Radio Times. They were last year’s number ten. Others on list include Peter Kay, Ricky Gervais, Julia Davis, Tamsin Greig, Ant & Dec, Stephen Fry, Stuart Murphy, Steve Coogan's Baby Cow, Hat Trick, and The Vicar of Dibley producer Tiger Aspect. Lucas and Walliams rose to second after winning multiple awards for Little Britain in 2004 and achieving highest BBC Three rating with series premiere.", "opencoder:1.5b": "Little Britain two top comic list\n\nThe duo Matt Lucas and David Walliams have been named the most powerful people in TV comedy in a poll by listings magazine Radio Times, taking their critical acclaim and financial success into account.\n\nNewcomers to the annual list included Nighty Night star Julia Davis at seven and Black Books' Tamsin Greig at 19. Lucas and Walliams won numerous awards for Little Britain in 2004, including National Television, Royal Television Society and British Comedy awards. They topped the Radio Times list after rising from 10th position last year.\n", "smollm:1.7b": "Little Britain stars Matt Lucas and David Walliams have been named the most powerful people in TV comedy by a list compiled by listings magazine Radio Times. The duo kept Phoenix Nights creator Peter Kay at number two and The Office star Ricky Gervais in third place, while a new panel compiled the list taking into account the comedians' critical acclaim and financial success. Newcomers to the annual list included Nighty Night star Julia Davis at seven and Black Books' Tamsin Greig at 19.\n\nThe list was compiled by Radio Times, which has been publishing lists of the most powerful people in TV comedy since 2004. The list takes into account the comedians' critical acclaim and financial success as well as their influence on the industry. Newcomers to the list included presenter duo Ant and Dec at number one, followed by Stephen Fry rising nine places to number 15 from 32 last year.\n\nThe list also features other big risers over the past year, including presenter duo Ant and Dec at number 18 from 32 last year, Stuart Murphy moving up three places to number 42 from 32 last year, and BBC Three controller Steve Coogan who moves up two places to number 16 from 32 last year.\n\nProduction companies also featured in the top 50, including Steve Coogan's Baby Cow, which created Nighty Night among others, Hat Trick behind The Vicar of Dibley production company Tiger Aspect and The Kumars at Number 42 - behind The Vicar of Dibley production company Tiger Aspect.", "deepseek-r1:1.5b": "<think>\nOkay, I'm trying to figure out how to summarize this text. Let me read it carefully first.\n\nThe text is about Little Britain, a TV comedy series, that has won several awards in 2004. It's named the most powerful people in TV comedy by listings magazine Radio Times. They're made up of Matt Lucas and David Walliams. \n\nSo, first, I need to identify the key points: who are they, what award they won, how they were selected, their ratings on different channels, other competitors, and some production info.\n\nI should make sure not to explain anything, just capture the main ideas in plain text without any formatting or extra information. That means keeping it concise but still accurate.\n\nLet me start by mentioning Matt Lucas and David Walliams as the duo. They were selected based on critical acclaim and financial success, so I can highlight that. Their positions are Phoenix Nights and The Office, with Peter Kay second and Ricky Gervais third. \n\nThey won awards like National Television, Royal Television Society, and British Comedy Awards in 2004. The first episode of Little Britain on BBC Three had the highest rating ever at over 1.8 million viewers.\n\nI also need to note that they moved up from last year's position, with Ant and Dec at five, Stephen Fry rising nine places, Stuart Murphy moving up, and others like Baby Cow, Hat Trick, and Tiger Aspect making it into the top 50.\n\nI should make sure each point flows smoothly without losing any crucial details. Maybe start by introducing Little Britain, then talk about their achievements, award winners, ratings, and production companies.\n</think>\n\nMatt Lucas and David Walliams were selected as the most powerful people in TV comedy, with them securing second and third places on lists compiled by Radio Times magazine. They won multiple awards including National Television, Royal Television Society, and British Comedy Awards in 2004. The duo topped the list again this year. Little Britain had its highest rating ever on BBC Three, crossing over 1.8 million viewers.", "tinyllama:1.1b": "Top Comedy Stars in UK: A List from Radio Times Poll\n\nLittl Britain stars Matt Lucas and David Walliams, also known as the top duo in TV comedy for a decade now, are the most powerful people in the industry according to a listing compiled by British Listings magazine Radio Times. The two received 40.9% of the poll's 10,000 votes, taking them from seventh place in 2003 to second place in 2005. The duo also climbed nine places to fifth place last year, following numerous appearances on TV shows such as Little Britain, The Office, and Black Books. Other rising stars included Ant & Dec at five and Stephen Frary's show BBC Three Controller rising nine places from number 32 in 2004. Production companies also made it into the top 50, with production companies like Steve Coogan's Baby Cow and The Vicar of Dibley being ranked behind The Kuarms at number 42.", "tinydolphin:1.1b": " Little Britain stars Matt Lucas and David Walliams have been named the most powerful people in TV comedy, according to a Radio Times poll. The duo kept Phoenix Nights creator Peter Kay at number two and The Office star Ricky Gervais in third place. This follows their success in the last year, where they won numerous awards for Little Britain in 2004, including National Television, Royal Television Society and British Comedy Awards. Their comedic skills have been celebrated by viewers and critics alike, who ranked them as the most powerful people in TV comedy, with Ricky Gervais at number three and Matt Lucas at number two.", "phi:2.7b": " Matt Lucas and David Walliams are named as the most powerful people in TV comedy according to a Radio Times poll. Little Britain stars won numerous awards and topped the chart after rising from 10th position last year, while other big risers included Ant and Dec at 5, Stephen Fry at 15 and Stuart Murphy at 18. Production companies such as Baby Cow, The Kumars at Number 42, and Tiger Aspect also featured in the top 50.\n", "orca-mini:3b": " Little Britain stars Matt Lucas and David Walliams have been named the most powerful people in TV comedy by a panel from listings magazine Radio Times, with Peter Kay at number two and Ricky Gervais at third place. The duo won numerous awards for Little Britain in 2004 and have been rising since 10th position last year. They topped the Radio Times list after their rise. Other risers include Ant and Dec at five, Stephen Fry rising nine places to 15, and BBC Three controller Stuart Murphy moving up to number 18 from 32 last year. Last year's winner, chat show host Graham Norton, fell to number 16 following relatively few television appearances in 2004. Production companies also featured in the top 50, including Steve Coogan's Baby Cow, which created Nighty Night among others, Hat Trick and The Vicar of Dibley production company Tiger Aspect.", "hermes3:3b": " Little Britain stars Matt Lucas, David Walliams named top TV comedy powers in Radio Times poll.", "stablelm-zephyr:3b": "Little Britain's Matt Lucas and David Walliams were named the most powerful people in TV comedy by Radio Times, with Peter Kay coming in second and Ricky Gervais third. Newcomers Julia Davis and Tamsin Greig also made the list. Lucas and Walliams won numerous awards for Little Britain, including National Television and British Comedy awards. They topped the Radio Times list after rising from 10th position last year.", "chatgpt-4o-latest": "Little Britain stars Matt Lucas and David Walliams were named the most powerful people in TV comedy by Radio Times, surpassing Peter Kay and Ricky Gervais. The list, based on critical acclaim and financial success, included newcomers like Julia Davis and Tamsin Greig. Lucas and Walliams won multiple awards in 2004, and their show's latest series set a ratings record for BBC Three. They rose from 10th place last year, while Ant and Dec, Stephen Fry, and Stuart Murphy also climbed the rankings. Last year's winner, Graham Norton, dropped to 16th. Production companies like Baby Cow, Hat Trick, and Tiger Aspect were also recognized.", "stablelm2:1.6b": "Little Britain's Matt Lucas and David Walliams have been named the most powerful people in TV comedy by Radio Times, based on critical acclaim and financial success. They topped the list alongside Peter Kay (creator of Phoenix Nights) and Ricky Gervais (The Office). Little Britain won numerous awards, including National Television and British Comedy Awards. Newcomers Julia Davis at 7th place and Tamsin Greig at 10th place also made it to the annual list. Other notable risers include Ant & Dec, Stephen Fry, Stuart Murphy, and production companies such  as Baby Cow, Hat Trick, and Tiger Aspect.", "granite3.1-dense:2b": "Matt Lucas and David Walliams, the creators of Little Britain, have been ranked as the most influential figures in TV comedy by Radio Times, topping a list that also includes Peter Kay (second), Ricky Gervais (third), Julia Davis (seventh), and Tamsin Greig (19th). This ranking is based on their critical acclaim and financial success. Notably, Lucas and Walliams saw an increase from 10th place last year, with the latest series of Little Britain on BBC Three achieving its highest-rated episode yet, attracting over 1.8 million viewers. Other notable rises in the list are Ant and Dec (fifth), Stephen Fry (nine places to 15), and BBC Three controller Stuart Murphy (18 from 32). Last year's top performer, Graham Norton, dropped to 16 due to reduced television appearances. The list also acknowledges significant production companies like Steve Coogan's Baby Cow, Hat Trick, and Tiger Aspect.", "reference": "Little Britain stars Matt Lucas and David Walliams have been named the most powerful people in TV comedy, in a poll by listings magazine Radio Times.They topped the Radio Times list after rising from 10th position last year.Other big risers over the past year included presenting duo Ant and Dec at five, up from 13 in 2004, Stephen Fry rising nine places to 15 and BBC Three controller Stuart Murphy, who moves to number 18 from 32 last year.Lucas and Walliams won numerous awards for Little Britain in 2004, including National Television, Royal Television Society and British Comedy awards."}