{"raw_text": "TV show unites Angolan families\n \n Angolan families who are attempting to track each other down, after being separated by nearly 30 years of war, are succeeding thanks to a hugely popular TV show.\n \n Meeting Point has become one of TV Angola's most watched programmes, and has reunited hundreds of families. It runs daily, not only on the television but also on the radio. Every Friday, hundreds of people gather in Luanda's Independence Square to record a message in front of the TV cameras, in the hope that a lost relative will see it. Many relatives have been reunited on air. \"At the beginning there was an absolute explosion - huge, huge crowds,\" Sergio Gera, the programme's chief co-ordinator, told BBC World Service's Assignment programme. \"Now things are a little calmer, there are slightly less people - but, after two and a half years of broadcasting, there are still a lot of people going.\"\n \n The media in the southern African country, twice the size of France, has been gripped by the quest of so many people to find their relatives. Hundreds of thousands of people died in Angola's 30-year civil war, which finally ended in 2002, and tens of thousands of people are still missing. Many have not heard anything for 10 or more years - in all, 90% of Angolan families have lost someone.\n \n The idea of recording in Independence Square was modelled on a square in the Argentine capital Buenos Aries, where mothers go to talk about the dead and the missing, and to exchange news. One woman, Victoria Lapete, found her sister - the only remaining member of her family - in Independence Square live on Meeting Point. She had not seen her sibling for 28 years. \"When we saw each other, we threw ourselves into each other's arms,\" she told Assignment. \"We started to cry. I felt very, very happy, because I'd spent so long without any family. Suddenly I had a sister again.\" However, Angola is one of the poorest countries in Africa, and the number of people with access to either a television or radio is comparatively few. This means that elsewhere in the country, the task of reuniting families lies primarily with the International Committee of the Red Cross (ICRC). In the city of Wambo, the ICRC runs the Gazetta - a 200-page, tabloid-size book which contains 13,000 names of missing or displaced.\n \n Their task is made much harder by the huge number of landmines dotted around the country. \"It's very difficult - there are many displaced,\" stated Joaquim Sahundi, head of tracing in Wambo.\n \n \"As they try to go back [home], others are trying to relocate their relatives. Many people are getting injured because of that - in the villages, in the bush, there has been no clearance of mines. \"When people are crossing these areas, they step on mines.\" The ICRC also uses the media where it can, running four daily broadcasts of their lists of the missing on Radio Angola. Meanwhile, there remain massive challenges to Angolan families even once they are reunited. \"The programme of family reunification is extremely important, but for these families to remain reunified, there has to be social integration, job access, education, healthcare,\" said Rafael Marques of the pro-democracy George Soros Foundation for Southern Africa. \"Essentially the government is waiting for the international community to pay for the reconstruction - that's why it has been persistently calling for a donor's conference. That is just a way of detaching itself from its political responsibilities.\"\n", "llama3.2:1b": "Angolan families who were separated by nearly 30 years of war are coming together through TV show \"Meeting Point\" which reunites hundreds with lost relatives, in Independence Square in Luanda where people record messages to increase the chances of being seen. \n\nThe program has brought attention to Angola's high number of missing persons and deaths in its civil war (1990-2002), with 90% of families reported as having a member missing. Many were reunited through the show, but challenges persist due to poverty and limited access to media.", "llama3.2:3b": "Angolan families are being reunited thanks to a TV show called Meeting Point, which airs daily on TV and radio and features hundreds of people gathering in Luanda's Independence Square to record messages in hopes that lost relatives will see them. The programme has reunited hundreds of families after nearly 30 years of war, which resulted in the deaths of hundreds of thousands of people and tens of thousands who are still missing. Despite its success, the task of reuniting families lies primarily with the International Committee of the Red Cross, particularly in rural areas where landmines pose a significant obstacle. Reunification is not enough; social integration, job access, education, and healthcare are also essential for families to remain together.", "gemma2:2b": "A popular TV show in Angola, \"Meeting Point,\" is helping reunite families separated by the country's 30-year civil war.  Many Angolan families have lost loved ones and are searching for missing relatives. The program allows people to record messages of hope for reunion, which are broadcast publicly on TV and radio.  The International Committee of the Red Cross (ICRC) is also playing a major role in locating missing individuals using lists and other resources. However, challenges like landmines and limited access to media hinder their efforts. Reuniting families is only one part of the problem; the government needs international aid for long-term solutions such as education, healthcare, and job opportunities to ensure lasting stability. \n", "qwen2.5:0.5b": "Meeting Point, a popular TV show in Angola, has helped reunite thousands of Angolan families separated by 30 years of war. It broadcasts live every Friday at Luanda's Independence Square, where tens of thousands gather daily to record messages for relatives. While the media in Angola is often busy with finding missing people, the country still faces a significant problem with limited access to television and radio. The program has helped reunite many families, but there are still challenges like maintaining social integration, providing basic services like education and healthcare.", "qwen2.5:1.5b": "Angolan families separated by war now reunited thanks to TV show, despite media limited access and landmines. The \"Meeting Point\" program has become popular, with hundreds of people gathering weekly in Luanda's Independence Square for messages broadcast live on TV and radio. Although it faces challenges such as poverty and lack of television or radio access, the project aims to help families integrate socially and receive education and healthcare.", "qwen2.5:3b": "TV show Meeting Point in Angola connects hundreds of families separated by 30 years of war, with broadcasts watched daily on TV and radio. Many gather at Independence Square to send messages hoping to reunite with lost relatives affected by the country's civil war (1975-2002) where over 90% of families have lost someone. While the show has reunited many, challenges persist such as the high number of landmines and poverty in Angola. The International Committee of the Red Cross supports those not reached through media by running a book with missing/displaced names. Even after reunification, integration into society remains challenging, requiring access to healthcare, education, and job opportunities.", "opencoder:1.5b": "\"TV show unites Angolan families\"\n\nAngolan families who are attempting to track each other down, after being separated by nearly 30 years of war, are succeeding thanks to a hugely popular TV programme. It runs daily, not only on the television but also on the radio. Every Friday, hundreds of people gather in Luanda's Independence Square to record a message in front of the TV cameras, hoping that a lost relative will see it.\n\nThe media in the southern African country, twice the size of France, has been gripped by the quest of so many people to find their relatives. Hundreds of thousands of people died and tens of thousands of people are still missing.\n\nThis idea of recording in Independence Square was modelled on a square in the Argentine capital Buenos Aries, where mothers go to talk about the dead and the missing, and to exchange news. One woman, Victoria Lapete, found her sister - the only remaining member of her family - in Independence Square live on Meeting Point.\n\nThey cry when we see each other, and start to cry because of how long they've spent without any family. Suddenly I had a sister again. They don't know why people are crying, but knowing that's part of their job is a sure way they have found someone to help in their lives.\n\nHowever, Angola is one of the poorest countries in Africa, and the number of people with access to either a television or radio is comparatively few. This means that elsewhere in the country, the task of reuniting families lies primarily with the International Committee of the Red Cross (ICRC). In Wambo, the ICRC runs the Gazetta, a 200-page, tabloid-size book which contains 13,000 names of missing or displaced people.\n\nTheir task is made much harder by the huge number of landmines dotted around the country. Others are trying to relocate their relatives, many people are getting injured because of that - in the villages, in the bush, there has been no clearance of mines. When people are crossing these areas, they step on mines.\n\nThe government is waiting for the international community to pay for the reconstruction - that's why it has been persistently calling for a donor's conference. That is just a way of detaching itself from its political responsibilities.\n", "smollm:1.7b": "The Angolan families who are attempting to track each other down after being separated by nearly 30 years of war have succeeded in reuniting hundreds of people thanks to the hugely popular TV show \"Meeting Point\". The programme runs daily, not only on television but also on the radio. Every Friday, hundreds of people gather in Luanda's Independence Square to record a message in front of the TV cameras, in the hope that a lost relative will see it. Many relatives have been reunited on air.\nThe media in Angola has been gripped by the quest of so many people to find their relatives. Hundreds of thousands of people died in Angola's 30-year civil war, which finally ended in 2002, and tens of thousands are still missing. Many have not heard anything for 10 or more years - in all, 90% of Angolan families have lost someone.\nThe idea of recording in Independence Square was modeled on a square in the Argentine capital Buenos Aires, where mothers go to talk about the dead and the missing, and to exchange news. One woman, Victoria Lapete, found her sister - the only remaining member of her family - in Independence Square live on Meeting Point. She had not seen her sibling for 28 years.\nThe ICRC runs the \"Gazette\" - a 200-page, tabloid-size book which contains 13,000 names of missing or displaced people. In the city of Wambo, the ICRC runs the \"Gazetta\", a 200-page, tabloid-size book which contains 13,000 names of missing or displaced people.\nTheir task is made much harder by the huge number of landmines dotted around the country. \"It's very difficult - there are many displaced,\" stated Joaquim Sahundi, head of tracing in Wambo.\nThe ICRC also uses the media where it can, running four daily broadcasts of their lists of the missing on Radio Angola.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about how a TV show in Angola helps reunite families after a long war. Let me read through the text again to make sure I understand all the key points.\n\nThe first sentence mentions that TV shows are making it easier for families who've been separated by nearly 30 years because of conflict. The show, Meeting Point, has brought together hundreds of families and even more people on camera each week in Luanda. It's both seen on TV and radio, which is interesting.\n\nThen, the text talks about Angola being a small country with half the size of France, but they're in a prolonged civil war. A lot of families lost relatives, and now many are missing, especially since 2002 when the conflict ended. Only 90% of families have someone alive—so it's still a big challenge.\n\nThe show was inspired by a program in Argentina where mothers talked to dead people about their families. In Angola, Victoria Lapete found her sister in Independence Square live on Meeting Point, but she hadn't seen her for 28 years. That moment made the family feel hopeful and connected.\n\nHowever, Angola has limited access to TV or radio, so reuniting families there mostly depends on organizations like the Red Cross in Wambo, who run a tabloid-sized magazine with a lot of information. But the families still face other challenges, like lots of landmines, which can cause serious harm when people move through areas.\n\nThere's also mention of how families need social integration, education, and healthcare for them to stay together after reunification. The government seems focused on getting international donors instead because that's their political goal.\n\nAlright, so I need to condense this into a concise summary without any extra information or explanations. Let me list the main points:\n\n1. Meeting Point is a TV show that brings families back.\n2. It was inspired by a program in Argentina where mothers shared stories.\n3. The show ran daily and also on radio.\n4. Many families are missing, especially Angolan families, due to conflict.\n5. There's a big issue of landmines disrupting relocation efforts.\n6. The show has hopeful moments like Victoria Lapete finding her sister.\n7. The government is struggling with reuniting families despite the show's help.\n\nI need to make sure each of these points is included but in a simplified way without losing any important details.\n</think>\n\nMeeting Point, a TV program in Angola, aims to bring together families separated by nearly 30 years due to conflict. Inspired by a program on Argentine mothers sharing stories, it features daily updates and is also available on radio. Many Angolan families lost relatives during the civil war, with tens of thousands still missing. A pivotal moment was Victoria Lapete finding her sister in Independence Square live on the show, though she had not seen her for 28 years. The government faces challenges like landmines and limited media access, requiring social integration, education, and healthcare for families to stay together. Despite the show's efforts, reconciliation remains tough, and the government struggles with donors.", "tinyllama:1.1b": "The TV show uniting Angolan families after nearly 30 years of war is a hit in the country, bringing happiness and hope to many affected by the atrocity. The program's chief co-ordinator, Sergio Gerá, stated that since its launch on April 28th 2016, it has reunited hundreds of families. Despite the challenges faced by the affected individuals, Meeting Point remains an essential service in bringing these families together. The media plays a significant role in the Angolan civil war, which resulted in the loss of many lives due to violence and the need for proper reporting to identify missing individuals. This has led to the establishment of a Red Cross-run Gazetta book containing 13,000 names of missing or displaced individuals by the ICRC in Waombobu. Despite challenges, the program remains important in uniting families and ensuring social integration, education, healthcare, and job access for affected families. The government has been calling for a donor's conference, but its political responsibilites have remained detached from its reconstruction needs.", "tinydolphin:1.1b": " Summarized: The TV show \"Meeting Point\" reunites missing family members in Angola, using media to connect families who were separated by over three decades of civil war. The program has been running for two years and helps countless people find their relatives. However, it is also a reminder of the challenges faced by families after they are reunited. Some have trouble integrating into society due to lack of education, jobs, or access to basic healthcare. The government has called for a donor's conference to secure funding for these reintegrative efforts.", "phi:2.7b": " A popular TV show in Angola, called Meeting Point, has reunited hundreds of Angolan families who were separated by war and are trying to find their loved ones. The program runs daily on television and radio and in the square, where people can record messages for their missing relatives. This was inspired by a similar program in Buenos Aires. However, many other families do not have access to TV or radio, so the International Committee of the Red Cross is working with them instead. There are still many challenges to family reunification, including social integration and job opportunities. The government needs international support for reconstruction. \n\n", "orca-mini:3b": " TV show unites Angolan families seeking lost relatives after 30 years of war, with hundreds finding missing kin in Luanda's Independence Square.", "hermes3:3b": "TV show reunites Angolan families, tracking relatives separated by war over 30 years and aiding hundreds in finding lost loved ones through daily broadcasts on TV Angola and Radio Angola.", "stablelm-zephyr:3b": "A popular TV show called Meeting Point in Angola is helping reunite families who were separated by 30 years of war. The show, which broadcasts daily on both television and radio, gathers people at Luanda's Independence Square every Friday to record messages for lost relatives. Many relatives have been reunited while watching the program. Although the country's media is popular, not everyone can access it, so the International Committee of the Red Cross (ICRC) takes on the task of finding missing or displaced people in other areas like Wambo. However, their work is made difficult by the large number of landmines scattered across Angola. Even once families are reunited, challenges remain, including social integration, job access, education, and healthcare, as the government waits for international help to pay for reconstruction.", "chatgpt-4o-latest": "Angola's popular TV show, *Meeting Point*, is reuniting families separated by nearly 30 years of civil war. Broadcast daily on TV and radio, the program has helped hundreds find lost relatives, with many reunions happening live on air. Every Friday, people gather in Luanda’s Independence Square to record messages in hopes of reconnecting with loved ones. Inspired by a similar initiative in Argentina, the show remains crucial in a country where 90% of families have lost someone. However, limited access to media means the International Committee of the Red Cross (ICRC) also plays a key role, publishing a 200-page list of missing persons and running radio broadcasts. Landmines further complicate reunification efforts, causing injuries as people search for relatives. Even after reunification, challenges remain, including social integration, jobs, education, and healthcare. Critics argue the Angolan government is relying on international aid rather than taking responsibility for reconstruction.", "stablelm2:1.6b": "A TV show called \"Meeting Point\" in Angola has successfully reunited hundreds of families who were separated by war, with many more still searching for loved ones. The show brings together Angolan families to track each other down after being separated for nearly two decades. It broadcasts daily both on television and radio and every Friday, hundreds gather in Luanda's Independence Square to record a message. After two-and-a-half years of broadcasting, there are still many people looking for their relatives. Although Angola is one of the poorest countries, access to information about missing or displaced persons is limited, with the International Committee of the Red Cross running the Gazetta, a book containing names of those who have disappeared. The challenges faced by Angolan families even after reunion remain significant due to social integration, job access, education, and healthcare issues in the country.", "granite3.1-dense:2b": "Angolan families separated by nearly 30 years of civil war are finding each other thanks to the highly popular TV show Meeting Point, which airs daily on television and radio. The program has reunited hundreds of families, with crowds of up to several hundred people gathering in Luanda's Independence Square every Friday to record messages for potential relatives. Sergio Gera, the coordinator, notes that despite two and a half years of broadcasting, crowd sizes remain substantial.\n\nThe civil war, which ended in 2002, claimed the lives of approximately 10% of Angola's population (90% of families have lost someone), with many people missing for over a decade. The inspiration for recording in Independence Square came from a similar practice in Buenos Aires. Victoria Lapete found her sister, the last surviving family member, during a Meeting Point broadcast.\n\nDespite the show's impact, Angola is one of the world's poorest countries, and access to television or radio is limited. The International Committee of the Red Cross (ICRC) takes on a crucial role in reuniting families by maintaining the Gazetta, a 200-page book listing 13,000 missing or displaced individuals. This effort is complicated by an extensive landmine problem that injures and kills many displaced people attempting to return home.\n\nThe ICRC also broadcasts its lists of the missing on Radio Angola daily. However, even after reunification, families face significant challenges, including social integration, job opportunities, education, and healthcare. Rafael Marques, from the George Soros Foundation for Southern Africa, emphasizes that successful family reunification requires comprehensive support beyond emotional connections. The Angolan government appeals to the international community for financial assistance to address these issues but has been criticized for abdicating its political responsibilities in doing so.", "reference": "The media in the southern African country, twice the size of France, has been gripped by the quest of so many people to find their relatives.Many people are getting injured because of that - in the villages, in the bush, there has been no clearance of mines.Many have not heard anything for 10 or more years - in all, 90% of Angolan families have lost someone.However, Angola is one of the poorest countries in Africa, and the number of people with access to either a television or radio is comparatively few.One woman, Victoria Lapete, found her sister - the only remaining member of her family - in Independence Square live on Meeting Point.Hundreds of thousands of people died in Angola's 30-year civil war, which finally ended in 2002, and tens of thousands of people are still missing.Meeting Point has become one of TV Angola's most watched programmes, and has reunited hundreds of families.\"The programme of family reunification is extremely important, but for these families to remain reunified, there has to be social integration, job access, education, healthcare,\" said Rafael Marques of the pro-democracy George Soros Foundation for Southern Africa.Every Friday, hundreds of people gather in Luanda's Independence Square to record a message in front of the TV cameras, in the hope that a lost relative will see it.Meanwhile, there remain massive challenges to Angolan families even once they are reunited.\"Now things are a little calmer, there are slightly less people - but, after two and a half years of broadcasting, there are still a lot of people going.\"This means that elsewhere in the country, the task of reuniting families lies primarily with the International Committee of the Red Cross (ICRC)."}