{"raw_text": "Volcano drama erupts on BBC One\n \n Supervolcano, a docu-drama about a volcanic eruption in Yellowstone National Park in the US, is among the highlights on the BBC One this winter.\n \n The £178m winter schedule also includes the return of Doctor Who and a drama about Angela Cannings, who was wrongly convicted of killing two of her babies. Sarah Lancashire and Timothy Spall will star in the real-life drama, Cherished. ITV also unveiled their festive season on Tuesday, which includes Stephen Fry in a remake of Tom Brown's Schooldays. Supervolcano, follows in the footsteps of last year's Pompei, which drew 10 million viewers to BBC One in October 2003.\n \n The programme merges science, drama and computer imagery to reveal what could happen if Yellowstone - home to the only currently active supervolcano in the world - were to erupt again. BBC Two will run a two-part documentary, The Science Behind Supervolcano, in conjunction with the transmission. Other educational highlights include a documentary about infamous Mongolian warrior Genghis Khan and Grandchild of The Holocaust. Grandchild of The Holocaust, part of the BBC commitment to Holocaust Memorial Day, follows Adrian, 13, on a journey to uncover the truth about what happened to his grandmother in Auschwitz and Belsen.\n \n New drama includes Archangel, an adaptation of the Robert Harris best-seller, which stars Daniel Craig on the trail of Stalin's diaries in Communist Russia. And Sarah Waters' gets her second adaptation on BBC One with Imelda Staunton and Charles Dance lined up to star in Fingersmith. The adaptation, about a conman in Victorian England, will make an interesting contrast to Julie Burchill's Sugar Rush - a lesbian teenage drama part of Channel Four's winter season. On a lighter note, Jessica Stevenson will star in new BBC One sitcom, The World According to Bex, penned by My Family creator Fred Barron and the Two Ronnies return for a celebration of their classic comedy series.\n \n Fry's portrayal of headmaster Dr Arnold dominates a muted Christmas schedule on ITV1, which sees the channel retreat from broadcasting blockbuster movies in favour of extended soap episodes and popular quiz shows.\n \n Sir Paul McCartney, wife Heather Mills and Manchester United manager Sir Alex Ferguson will join a celebrity edition of Who Wants to be a Millionaire? on Christmas Day. Also on Christmas Day, John Nettles will return in a one-off edition of Midsomer Murders, while two episodes of the new Miss Marple drama will air over the festive period. Films on ITV1 include Gus Van Sant's Finding Forrester, starring Sean Connery, and classics such a Mary Poppins, Star Wars and The Good, the Bad and the Ugly. In contrast, BBC's Christmas season includes terrestrial debuts of the first Harry Potter film, Shrek and Steven Spielberg's AI, as well as new epipsodes of the Vicar of Dibley and the final Auf Wiedersehen, Pet.\n", "llama3.2:1b": "BBC One highlights include:\n\n* Supervolcano\n* Doctor Who\n* Cherished (Angela Cannings drama)\n* Stephen Fry in Tom Brown's Schooldays\n* ITV: Stephen Fry, Sarah Lancashire, Timothy Spall, Genghis Khan documentary, Grandchild of The Holocaust", "llama3.2:3b": "BBC One's winter schedule includes a docu-drama about a supervolcano eruption in Yellowstone National Park (Supervolcano), the return of Doctor Who, and Sarah Lancashire in a drama about Angela Cannings wrongly convicted of killing her babies (Cherished). ITV also unveiled its festive season with Stephen Fry in a remake of Tom Brown's Schooldays, as well as other dramas like Archangel and Fingersmith.", "gemma2:2b": "BBC One: Supervolcano docu-drama;  Doctor Who returns; Cherished real-life drama with Sarah Lancashire & Timothy Spall; Pompei-style coverage of Yellowstone supervolcano eruption. BBC Two: The Science Behind Supervolcano documentary; Grandchild of the Holocaust. New drama includes Archangel and Fingersmith. ITV1: Stephen Fry in Tom Brown's Schooldays; celebrity edition of Who Wants to be a Millionaire?; John Nettles returns for one-off Midsomer Murders; classics like Mary Poppins and Star Wars are available. \n", "qwen2.5:0.5b": "The British Broadcasting Corporation (BBC) will air the latest TV programs this winter, including a documentary about Yellowstone National Park's potential for a supervolcano eruption. Meanwhile, BBC One is preparing new drama series such as \"Archangel,\" \"Fingersmith,\" and \"The World According to Bex.\" The BBC 2 channel will run two-part documentaries on \"The Science Behind Supervolcanos\" in conjunction with the TV transmission. ITV1 will broadcast a new soap opera called \"The World According to Bex.\" Additionally, a one-off episode of \"Miss Marple\" and a Christmas edition of the new Miss Marple series will air over the festive period.", "qwen2.5:1.5b": "Supervolcano docu-drama about Yellowstone eruption is one highlight on BBC One's winter schedule; Doctor Who returns, Genghis Khan documentary runs alongside it, and other shows include adaptations of best-selling books, celebrity quizzes, and festive specials including Christmas films from the West End.", "qwen2.5:3b": "Volcano drama \"Supervolcano\" on BBC One highlights a winter schedule including Doctor Who returns and a real-life Angela Cannings drama. ITV’s festive lineup features Stephen Fry in Tom Brown's Schooldays. Supervolcano merges science with computer imagery to depict potential Yellowstone eruption impacts. BBC Two will also air a documentary series “The Science Behind Supervolcano.” Educational programs like \"Genghis Khan\" and Holocaust-related documentaries are part of the winter schedule. New dramas include adaptations of Robert Harris' \"Archangel,\" Charles Dance in \"Fingersmith,\" and Jessica Stevenson in \"The World According to Bex.\" ITV1's Christmas lineup features light-hearted sitcoms and popular quiz shows, while BBC’s includes terrestrial debuts of Harry Potter films, Shrek, Steven Spielberg's AI, new episodes of \"The Vicar of Dibley,\" and the final episode of \"Auf Wiedersehen, Pet.\"", "opencoder:1.5b": "Volcano drama on BBC One: An exploration into the effects of a volcanic eruption in Yellowstone National Park.\n \nThe programme merges science, drama, and computer imagery to unveil the extraordinary event that could happen if the only currently active volcano remains dead or collapsed. Supervolcano follows the story of last year's Pompei, which was a colossal feat made possible by BBC One's anticipation about October 2003.\n \nIn addition to scientific revelations, dramas like this one unfurl a deeper understanding of human behavior during a volcanic event. The programme is an invitation to witness life on Earth around Yellowstone National Park as it happens and the effects that could ripple across the globe. It also introduces viewers to more than just volcanoes, including the likes of Doctor Who and Angela Cannings who was wrongly convicted.\n", "smollm:1.7b": "The summary should be concise and to the point, focusing on the main ideas and key details. Here is a possible summary:\n\n\"Supervolcano, a docu-drama about a volcanic eruption in Yellowstone National Park in the US, is among the highlights on the BBC One this winter. The £178m winter schedule also includes the return of Doctor Who and a drama about Angela Cannings, who was wrongly convicted of killing two of her babies. Sarah Lancashire and Timothy Spall will star in the real-life drama, Cherished. ITV also unveiled their festive season on Tuesday, which includes Stephen Fry in a remake of Tom Brown's Schooldays. Supervolcano, follows in the footsteps of last year's Pompei, which drew 10 million viewers to BBC One in October 2003.\"", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving the key ideas and details. Let me read through it again to make sure I get all the main points.\n\nSo the first paragraph talks about a BBC One drama called \"Supervolcano,\" focusing on a volcanic eruption in Yellowstone. It's among the highlights with a £178m budget this winter. They mention it merges science, drama, and computer imagery. They also compare it to last year's \"Pompei.\" Then they give details about other shows on BBC One: Doctor Who, Cherished with Timothy Spall and Sarah Lancashire, The Science Behind Supervolcano with Stephen Fry in a remake of Tom Brown's Schooldays, Genghis Khan, a documentary about the Holocaust, Archangel based on Robert Harris, and a new adaptation of Julie Burchill's Sugar Rush. There are also some new shows like Fingersmith and The World According to Bex by Jessica Stevenson. On the festive day, there are celebrity events with McCartney and Manchester United manager, John Nettles in Midsomer Murders, and a variety of TV shows including Gus Van Sant's Finding Forrester and Mary Poppins.\n\nThe next part is about ITV1, which is different from BBC One this season. It starts with a Christmas special featuring Fry portrayals of Arnold, Heather Mills, and Alex Ferguson. There are events like Midsomer Murders and Miss Marple, and the first Harry Potter film and Star Wars movie. Then it brings in the first Shrek and Spielberg's AI.\n\nSo I need to condense all this into one summary without explanations or formatting. Let me make sure I include all the main points: the launch of \"Supervolcano,\" details about the schedule, including Doctor Who, Cherished, The Science Behind Supervolcano, Genghis Khan, Archangel, and the Holocaust documentary, new shows like Fingersmith, The World According to Bex, and Sugar Rush adaptation. Also mention that BBC One's Christmas specials include celebrity events with McCartney, John Nettles, and Misha. Then for ITV1, it's different with a Christmas special featuring Fry on Arnold, Heather Mills, and Alex Ferguson, plus events like Midsomer Murders, Miss Marple, Shrek, and Spielberg AI.\n\nI need to make sure I include all these points without missing any key details.\n</think>\n\nBBC One launches \"Supervolcano,\" a film about Yellowstone's volcanic eruption with a £178m budget, featuring Dr Arnold on the trail of Stalin's diaries. The show is part of a winter schedule that includes Doctor Who, Cherished, the science behind supervision, Genghis Khan, Archangel (Robert Harris adaptation), and a Holocaust documentary. Additionally, new adaptations include Fingersmith and The World According to Bex, with G Buschell's Sugar Rush being contrasted with Julie Burchill's Sugar Rush.\n\nOn ITV1, a Christmas special features Sir Paul McCartney, Heather Mills, and Manchester United manager Alex Ferguson, along with John Nettles in Midsomer Murders. The season includes new Harry Potter film Shrek, Star Wars, Miss Marple, and the final Auf Wiedersehen.", "tinyllama:1.1b": "The BBC One winter schedule features a drama about a supervolcano erupting in Yeoldstone National Park in the US, which is followed by real-life drama series \"Cherished.\" The show includes actors Timothy Spall and Sarah Lancashire, while the new sitcom \"The World According to Bex\" starred actress Jessica Stevenson. The Christmas schedule on ITV1 features a celebrity edition of \"Who Wants to be a Millionaire?\", a new Miss Marple drama, and classic films.\n\nSupervolcano eruption on TV", "tinydolphin:1.1b": " The summary provided does not provide enough context to describe or understand the main subjects and actions being discussed in this passage. Further elaboration would be helpful to provide a fuller understanding.", "phi:2.7b": " The docu-drama Supervolcano will air on BBC One in winter, which also includes Doctor Who, Cherished, Tom Brown's Schooldays remake, and a two-part documentary about Yellowstone National Park supervolcano eruption. ITV's Christmas schedule features new drama Archangel and Fingersmith, as well as soap operas. \n\nThe BBC's season will include documentaries on Genghis Khan, Holocaust Memorial Day, and Grandchild of The Holocaust. There are also new sitcoms, such as The World According to Bex, Midsomer Murders, and the first Harry Potter film. In contrast, ITV is broadcasting extended soap operas and popular quiz shows, with a focus on Sir Paul McCartney and John Nettles' appearances in Who Wants to be a Millionaire?. \n", "orca-mini:3b": " - Supervolcano is a docu-drama about a volcanic eruption in Yellowstone National Park\n- The programme merges science, drama and computer imagery to reveal what could happen if Yellowstone erupted again\n- BBC Two will run a two-part documentary, The Science Behind Supervolcano\n- Other educational highlights include a documentary about Genghis Khan and Grandchild of The Holocaust\n- Archangel is an adaptation of the Robert Harris best-seller, which stars Daniel Craig on the trail of Stalin's diaries in Communist Russia\n- Fingersmith is a lesbian teenage drama part of Channel Four's winter season\n- The World According to Bex is a new BBC One sitcom, penned by My Family creator Fred Barron and the Two Ronnies return for a celebration of their classic comedy series\n- Fry's portrayal of headmaster Dr Arnold dominates a muted Christmas schedule on ITV1\n- Sir Paul McCartney, wife Heather Mills and Manchester United manager Sir Alex Ferguson will join a celebrity edition of Who Wants to be a Millionaire? on Christmas Day\n- Two episodes of the new Miss Marple drama will air over the festive period\n- Gus Van Sant's Finding Forrester, starring Sean Connery, and classics such a Mary Poppins, Star Wars and The Good, the Bad and the Ugly will be shown on ITV1.", "hermes3:3b": "Supervolcano docu-drama on BBC One winter lineup, joins other highlights like Doctor Who return & dramas about Angela Cannings & Yellowstone eruption.", "stablelm-zephyr:3b": "BBC One is featuring a docu-drama called Supervolcano, about a volcanic eruption in Yellowstone National Park, joining last year's popular Pompeii. The £178m winter schedule also includes the return of Doctor Who and a drama based on real-life Angela Cannings, who was wrongly convicted of killing her babies. Other programs include Stephen Fry's remake of Tom Brown's Schooldays and a new sitcom called The World According to Bex. ITV is focusing more on extended soap episodes and popular quiz shows for their Christmas schedule, with Sir Paul McCartney, Heather Mills, and Manchester United manager Sir Alex Ferguson joining the celebrity edition of Who Wants to be a Millionaire? BBC's Christmas season includes new episodes of Harry Potter, Shrek, and AI.", "chatgpt-4o-latest": "BBC One's winter schedule features the docu-drama *Supervolcano*, depicting a potential eruption at Yellowstone National Park, alongside the return of *Doctor Who* and *Cherished*, a drama about Angela Cannings' wrongful conviction. Other highlights include *Archangel*, starring Daniel Craig, and *Fingersmith*, featuring Imelda Staunton and Charles Dance. BBC Two will air a related documentary, *The Science Behind Supervolcano*, as well as educational programs on Genghis Khan and the Holocaust. ITV's Christmas lineup includes Stephen Fry in *Tom Brown's Schooldays*, extended soap episodes, and celebrity editions of *Who Wants to be a Millionaire?*. ITV will also air *Midsomer Murders*, *Miss Marple*, and films like *Finding Forrester*, *Mary Poppins*, and *Star Wars*. BBC's festive offerings include the first *Harry Potter* film, *Shrek*, *AI*, and new episodes of *The Vicar of Dibley* and *Auf Wiedersehen, Pet*.", "stablelm2:1.6b": "Supervolcano, a docudrama about a potential volcanic eruption in Yellowstone National Park, airs on BBC One this winter season alongside Doctor Who and Angela Cannings drama. The £2 million winter schedule also includes Stephen Fry's Tom Brown's Schooldays and the second adaptation of Sarah Waters' novel Fingersmith on BBC One. Additionally, ITV unveils their Christmas offerings with films like Finding Forrester, Mary Poppins, Star Wars, and The Good, the Bad, and the Ugly; while BBC presents a mix of educational documentaries including Genghis Khan and Grandchild of The Holocaust along with the drama adaptation of Robert Harris' novel Archangel starring Daniel Craig.", "granite3.1-dense:2b": "This winter, BBC One and ITV unveil captivating lineups featuring both drama and educational content. On BBC One, highlights include:\n\n1. Supervolcano ($178m production), a docu-drama exploring the catastrophic consequences of a Yellowstone volcanic eruption, drawing from last year's popular Pompei.\n2. Cherished, starring Sarah Lancashire and Timothy Spall, a real-life drama about Angela Cannings, who was wrongly convicted of infanticide.\n3. Archangel, an adaptation of Robert Harris' best-seller, with Daniel Craig as Stalin's diary hunter in Communist Russia.\n4. Fingersmith, based on Sarah Waters' novel, with Imelda Staunton and Charles Dance.\n5. Grandchild of The Holocaust, part of BBC's Holocaust Memorial Day commitment, following a 13-year-old on his quest to discover his grandmother's fate in Auschwitz and Belsen.\n6. A lighter note: Jessica Stevenson stars in The World According to Bex, a new BBC One sitcom created by My Family's Fred Barron.\n7. Two Ronnies reunite for a comedy celebration.\n8. Julie Burchill's Sugar Rush, a lesbian teenage drama on Channel Four.\n\nITV's festive season features:\n\n1. Stephen Fry in Tom Brown's Schooldays, remade.\n2. Genghis Khan documentary and part of the BBC's Holocaust Memorial Day commitment, Grandchild of The Holocaust.\n3. A Christmas special with Sir Paul McCartney, Heather Mills, and Manchester United manager Sir Alex Ferguson on Who Wants to be a Millionaire?\n4. John Nettles returns for a one-off episode of Midsomer Murders.\n5. Two new episodes of the Miss Marple drama.\n6. Classic films like Finding Forrester, Mary Poppins, Star Wars, and The Good, the Bad and the Ugly on ITV1.\n7. BBC's Christmas offerings include terrestrial debuts of Harry Potter, Shrek, AI, Vicar of Dibley episodes, and Auf Wiedersehen, Pet.", "reference": "Also on Christmas Day, John Nettles will return in a one-off edition of Midsomer Murders, while two episodes of the new Miss Marple drama will air over the festive period.On a lighter note, Jessica Stevenson will star in new BBC One sitcom, The World According to Bex, penned by My Family creator Fred Barron and the Two Ronnies return for a celebration of their classic comedy series.The £178m winter schedule also includes the return of Doctor Who and a drama about Angela Cannings, who was wrongly convicted of killing two of her babies.Supervolcano, a docu-drama about a volcanic eruption in Yellowstone National Park in the US, is among the highlights on the BBC One this winter.New drama includes Archangel, an adaptation of the Robert Harris best-seller, which stars Daniel Craig on the trail of Stalin's diaries in Communist Russia.BBC Two will run a two-part documentary, The Science Behind Supervolcano, in conjunction with the transmission.And Sarah Waters' gets her second adaptation on BBC One with Imelda Staunton and Charles Dance lined up to star in Fingersmith.Grandchild of The Holocaust, part of the BBC commitment to Holocaust Memorial Day, follows Adrian, 13, on a journey to uncover the truth about what happened to his grandmother in Auschwitz and Belsen."}