{"raw_text": "South Bank Awards honour hit soap\n \n Coronation Street has become the first soap to triumph at the South Bank Show Awards, which traditionally reward highbrow and groundbreaking culture.\n \n The soap beat fellow ITV1 show Filthy Love and Channel 4's Shameless to win the best TV drama prize on Thursday. Little Britain was named best comedy while Franz Ferdinand beat Morrissey and The Libertines to the music award. Shane Meadows' Dead Man's Shoes picked up the best film award, beating Shaun of the Dead and My Summer of Love. The two award ceremonies reflect the achievements the industry believes have been made in the last year.\n \n In 2004, Coronation Street pulled away from its BBC One rival EastEnders in the ratings and dominated other TV awards. Last year, the South Bank Award for best TV drama went to Steven Poliakoff's period piece The Lost Prince, while Bloody Sunday, about the 1972 killings in Northern Ireland, won in 2003. In other South Bank categories, Little Britain's second series beat Nighty Night and The Green Wing to the comedy trophy while Alan Bennett's The History Boys won in the theatre category. Author David Mitchell made up for losing out in the Booker Prize to Alan Hollinghurst by beating him to the literary award with his book Cloud Atlas. Shameless, State Of Play and Clocking Off creator Paul Abbott got a lifetime achievement award while former Grange Hill actress Amma Asante won the breakthrough award for writing and directing her first film, A Way Of Life.\n", "llama3.2:1b": "Coronation Street wins South Bank Show Awards. Coronation Street beat Filthy Love and Shameless in TV drama. Little Britain named best comedy. Franz Ferdinand won music award. Dead Man's Shoes picked up film award.", "llama3.2:3b": "Coronation Street won the best TV drama prize at the South Bank Show Awards, beating Filthy Love and Shameless. Little Britain took home the comedy award, while Franz Ferdinand won the music award. The ceremony recognized achievements in 2004-2005, with winners including Shane Meadows for Dead Man's Shoes, David Mitchell for Cloud Atlas, and Paul Abbott for a lifetime achievement award.", "gemma2:2b": "Coronation Street won the South Bank Show Awards' best TV drama prize. Little Britain was awarded best comedy, Franz Ferdinand took the music award, and Shane Meadows' Dead Man's Shoes won the film award. \nOther notable winners include:\n- Paul Abbott received a lifetime achievement award.\n- Amma Asante won the breakthrough award for writing and directing her first film. \n", "qwen2.5:0.5b": "The South Bank Awards honoured soap operas Coronation Street and Little Britain as they beat other shows including Filthy Love, Shameless and Franz Ferdinand. They also gave a lifetime achievement award to David Mitchell for his book Cloud Atlas. The awards reflect the industry's recognition of their achievements in the last year.", "qwen2.5:1.5b": "Coronation Street is honored at South Bank Show Awards as the first soap opera to win in the category of best TV drama. Other winners include Little Britain, Franz Ferdinand (music), Shane Meadows' Dead Man's Shoes, and The Libertines (best band). The event celebrates recent achievements in highbrow culture across television dramas, comedy, music, film, theatre, and literature.", "qwen2.5:3b": "Coronation Street became the first soap to win at the South Bank Show Awards, beating ITV1's Filthy Luck and Channel 4's Shameless for best TV drama. Little Britain was named best comedy and Franz Ferdinand won in music. Shane Meadows' Dead Man's Shoes took the best film award. In previous years, The Lost Prince, Bloody Sunday, and The History Boys have also won at these awards.", "opencoder:1.5b": "The soap took 2004 against its BBC One rival EastEnders in the ratings, dominating other TV awards last year. In South Bank categories, Little Britain's second series beat Nighty Night and The Green Wing to a comedy trophy while Alan Bennett won in the theatre category. Author David Mitchell made up for losing the Booker Prize by beating him to the literary award with Cloud Atlas. Shameless, State Of Play, and Clocking Off created Paul Abbott and former Grange Hill actress Amma Asante won a lifetime achievement award.\n", "smollm:1.7b": "South Bank Awards honor hit soap. South Bank Awards have become the first soap to triumph at the South Bank Show Awards. South Bank Awards recognize outstanding achievements in television drama, comedy, music, theatre, and literature. The South Bank Award for best TV drama went to Coronation Street, while the South Bank Award for Best Comedy won in 2003.\n\nSouth Bank Awards honor hit soap. South Bank Awards have become the first soap to triumph at the South Bank Show Awards. South Bank Awards recognize outstanding achievements in television drama, comedy, music, theatre, and literature. The South Bank Award for best TV drama went to Coronation Street, while the South Bank Award for Best Comedy won in 2003.\n\nSouth Bank Awards honor hit soap. South Bank Awards have become the first soap to triumph at the South Bank Show Awards. South Bank Awards recognize outstanding achievements in television drama, comedy, music, theatre, and literature. The South Bank Award for Best TV Drama went to Coronation Street, while the South Bank Award for Best Comedy won in 2003.\n\nSouth Bank Awards honor hit soap. South Bank Awards have become the first soap to triumph at the South Bank Show Awards. South Bank Awards recognize outstanding achievements in television drama, comedy, music, theatre, and literature. The South Bank Award for Best TV Drama went to Coronation Street, while the South Bank Award for Best Comedy won in 2003.", "deepseek-r1:1.5b": "<think>\nAlright, let's tackle this query. The user wants me to summarize a given text concisely. They specified that I should only output the summary in plain text without any explanations or formatting. \n\nFirst, I'll read through the provided text carefully to understand the main points. It's about South Bank Awards winning Coronation Street as the first soap dishonored on the show. The text mentions several awards categories won by Coronation Street, including best TV drama, comedy, film, and theater. It also provides some context from past awards in 2004 and 2003.\n\nI need to capture the key elements: Coronation Street winning major prizes like best TV drama (The Lost Prince), comedy (Little Britain), film (Dead Man's Shoes), and theater (Alan Bennett's The History Boys). I should also include some context about its dominance in other awards, especially from 2004.\n\nI have to make sure the summary is concise, focusing on the main achievements without going into too much detail. The user emphasized preserving key ideas and details, so accuracy is important even if it's a quick summary.\n\nLet me structure this: start with the title or mention the competition, then list each category and what Coronation Street won in. Also, include some historical context about its dominance from 2004 and earlier. That should cover everything without being too lengthy.\n</think>\n\nCoronation Street triumphed at the South Bank Awards, winning best TV drama (The Lost Prince), comedy (Little Britain), film (Dead Man's Shoes), and theater (Alan Bennett's The History Boys). The series dominated awards in 2004 and earlier, including dominating the TV drama category in 2003.", "tinyllama:1.1b": "In recent years, Coronación Street has become the most successful soap on ITV1, outpacing its BBC One rival EastEnders in ratings and garnering various awards including the South Bank Show Awards. Last year, the award for best TV drama went to Steven Poliakoff's period piece The Lost Prince, while Bloody Sunday, about the 1972 killing of civilians in Northern Ireland, won in the same category. Other winners included Litlle Britain's second series, which beat Niughty Niught and The Green Wing to win the comedy trophy, and David Mitchell's novel Cloud Atlas received a lifetime achievement award. Former Grange Hill actress Amma Asante won the breakthrough award for writing and directing her first film A Way Of Life, which also took home the best film award.", "tinydolphin:1.1b": " The South Bank Show Awards, which celebrate excellence in television arts and culture, have crowned Coronation Street as the winner of best TV drama. This follows a strong performance by the ITV1 soap, which defeated fellow ITV1 show Filthy Love and Channel 4's Shameless to win. The awards ceremony took place on Thursday at the Southbank Centre in London, where other notable winners included Dead Man's Shoes, Deadliest Crew, and Franz Ferdinand. In the best comedy category, Little Britain triumphed over Shaun of the Dead and My Summer of Love. Additionally, Shane Meadows' Dead Man's Shoes earned Best Film at the event, beating fellow 2004 winner Shaun of the Dead and his own film, My Summer of Love. In the best film category, Steven Poliakoff's The Lost Prince triumphed over Steven Sopkall's The Stationagent and Christopher Hampton's A Way of Life. Last year, The Lost Prince won in the best drama category and Bloody Sunday claimed the same honor for its period piece. Little Britain's second series saw a surge in popularity after it won the comedy award, while Alan Bennett's The History Boys was recognized for its 2003 second series. David Mitchell, who lost out in the Booker Prize to Alan Hollinghurst, received his lifetime achievement award at the event.", "phi:2.7b": " Coronation Street is the first soap to win the best TV drama prize at the South Bank Show Awards, beating Filthy Love and Shameless. It also takes home the music award, while Little Britain wins in the comedy category. In other categories, The Lost Prince won the 2004 award for best TV drama and Bloody Sunday took home the 2003 award.\n", "orca-mini:3b": " The South Bank Awards honored Coronation Street as the best TV drama, beating Filthy Love and Shameless. The soap won the best drama award, with Franz Ferdinand winning the music award and Dead Man's Shoes winning the best film award. The Lost Prince won the best TV drama award in 2004 and Bloody Sunday won the best TV drama award in 2003. Steven Poliakoff's period piece The Lost Prince won the South Bank Award for best TV drama in 2004, while The History Boys won the theater award. David Mitchell's book Cloud Atlas won the literary award, and A Way Of Life's Amma Asante won the lifetime achievement award. Paul Abbott received a lifetime achievement award.", "hermes3:3b": "Coronation Street wins first soap prize at South Bank Awards.", "stablelm-zephyr:3b": "Coronation Street wins best TV drama at South Bank Show Awards, becoming the first soap to achieve this honor. It beat competing shows Filthy Love and Shameless. Little Britain won best comedy, while Franz Ferdinand took the music award. Dead Man's Shoes won best film, defeating Shaun of the Dead and My Summer of Love. The awards recognize significant achievements in TV, film, and literature from the past year.", "chatgpt-4o-latest": "Coronation Street became the first soap to win at the South Bank Show Awards, taking the best TV drama prize over Filthy Love and Shameless. Little Britain won best comedy, Franz Ferdinand took the music award, and Dead Man's Shoes was named best film. The awards recognize industry achievements over the past year. Coronation Street outperformed EastEnders in ratings and other TV awards in 2004. Previous best TV drama winners included The Lost Prince and Bloody Sunday. Other winners included The History Boys in theatre, David Mitchell's Cloud Atlas in literature, and Paul Abbott received a lifetime achievement award. Amma Asante won the breakthrough award for her film A Way Of Life.", "stablelm2:1.6b": "Coronation Street wins South Bank Show Awards: The popular soap beats Filthy Love and Shameless to win best TV drama prize. Little Britain is named best comedy, while Franz Ferdinand wins music award. Shane Meadows' Dead Man's Shoes wins best film award, beating Shaun of the Dead and My Summer of Love. Coronation Street has dominated TV ratings and awards in 2015.", "granite3.1-dense:2b": "Coronation Street, a soap opera on ITV1, secured its first-ever win at the South Bank Show Awards, traditionally honoring highbrow culture. The drama outperformed competitors like Filthy Love and Shameless to claim the best TV drama prize on Thursday. Little Britain triumphed in the comedy category, while Franz Ferdinand took home the music award over Morrissey and The Libertines. Dead Man's Shoes, directed by Shane Meadows, won for best film, surpassing Shaun of the Dead and My Summer of Love. Historically, South Bank Awards have recognized shows like Steven Poliakoff's The Lost Prince, Bloody Sunday, and plays such as Alan Bennett's The History Boys. Notable winners also include David Mitchell for his book Cloud Atlas, Paul Abbott for a lifetime achievement award, and Amma Asante for her breakthrough film A Way Of Life.", "reference": "Last year, the South Bank Award for best TV drama went to Steven Poliakoff's period piece The Lost Prince, while Bloody Sunday, about the 1972 killings in Northern Ireland, won in 2003.Little Britain was named best comedy while Franz Ferdinand beat Morrissey and The Libertines to the music award.The soap beat fellow ITV1 show Filthy Love and Channel 4's Shameless to win the best TV drama prize on Thursday.Shane Meadows' Dead Man's Shoes picked up the best film award, beating Shaun of the Dead and My Summer of Love."}