{"raw_text": "Baywatch dubbed 'worst TV import'\n \n Surf show Baywatch has won the title of worst TV import of all time in a poll of UK television executives.\n \n The programme, which starred David Hasselhoff and Pamela Anderson during its 12-year run, was shown in 140 countries at its height. Model Anna Nicole Smith's reality show and The Dukes of Hazzard were runners-up in the Broadcast magazine survey. The Simpsons and Dallas and 24 were among the magazine's list of the best all-time imports from the US. Soap operas Knots Landing, Falcon Crest plus The Bold And The Beautiful all made the top 10 of Transatlantic TV howlers. The Jerry Springer Show, which came in at sixth on the list, did not fare well.\n \n Broadcast magazine said: \"British TV never realised how low it could go before Jerry showed the way.\" Baywatch rose to the top of the list for having \"mind-numbingly predictable scripts: beachgoer is saved from drowning,\" according to the magazine. Just inside the all-time worst top 10 came Extreme Makeover, which sees members of the public given thousands of pounds worth of plastic surgery. Other American shows which won praise were The X-Files, I Love Lucy, Twin Peaks and Star Trek.\n", "llama3.2:1b": "Baywatch dubbed 'worst TV import'\nUK television executives poll: Baywatch ranked as worst\nBaywatch wins title for mind-numbingly predictable scripts\nOther American shows praised in poll", "llama3.2:3b": "Baywatch has been voted the worst TV import in a UK survey, with 140 countries airing it during its 12-year run, beating out other bad imports like Anna Nicole Smith's reality show and Extreme Makeover.", "gemma2:2b": "Baywatch was voted the worst TV import of all time in a UK poll of executives. It topped the list for its predictable storylines about beach rescues. Other popular US imports that ranked high include The Simpsons, Dallas, 24 and the Jerry Springer Show. \n", "qwen2.5:0.5b": "British TV has failed to rank among the world's best for a decade after Baywatch topped its list, according to Broadcast magazine.", "qwen2.5:1.5b": "Baywatch is ranked as the worst TV import globally by a UK television poll following its 12-year run. Model Anna Nicole Smith's reality show came in second, while Simpsones and Dallas are among the best US imports. The Jerry Springer Show was at sixth place but not highly regarded overall.", "qwen2.5:3b": "Baywatch dubbed 'worst TV import', winning title from UK television executives. Noted for its predictable scripts like \"beachgoer is saved from drowning.\" Ranked sixth by Broadcast magazine was Jerry Springer Show. Best all-time US imports included The Simpsons, Dallas, and 24. Transatlantic TV howlers list also featured Knots Landing, Falcon Crest, and The Bold And The Beautiful. Extreme Makeover placed just inside worst top 10. Shows praised as American imports included The X-Files, I Love Lucy, Twin Peaks, and Star Trek.", "opencoder:1.5b": "Baywatch has dubbed 'worst TV import' as a poll show by the UK television executives.\nThe programme was aired in 140 countries at its height with the support of 24 countries among the US.\nBroadcast magazine ranked it as one of the top 10 all-time imports from the US, including a show named Extreme Makeover which saw members of the public given thousands of pounds worth of plastic surgery. Other American shows that won praise include The X-Files, I Love Lucy, Twin Peaks and Star Trek.\nThe program was not rated very high by Jerry Springer Show as it did not fare well in the poll show ranking stage.\n", "smollm:1.7b": "Baywatch was the worst TV import of all time in a poll of UK television executives. Surf show Baywatch has won the title of worst TV import of all time in a poll of UK television executives. The programme, which starred David Hasselhoff and Pamela Anderson during its 12-year run, was shown in 140 countries at its height. Model Anna Nicole Smith's reality show and The Dukes of Hazzard were runners-up in the Broadcast magazine survey. The Simpsons and Dallas and 24 were among the magazine's list of the best all-time imports from the US. Soap operas Knots Landing, Falcon Crest plus The Bold And The Beautiful all made the top 10 of Transatlantic TV howlers. The Jerry Springer Show, which came in at sixth on the list, did not fare well.\n\nBroadcast magazine said: \"British TV never realised how low it could go before Jerry showed the way.\" Baywatch rose to the top of the list for having \"mind-numbly predictable scripts: beachgoer is saved from drowning,\" according to the magazine. Just inside the all-time worst top 10 came Extreme Makeover, which sees members of the public given thousands of pounds worth of plastic surgery. Other American shows which won praise were The X-Files, I Love Lucy, Twin Peaks and Star Trek.", "deepseek-r1:1.5b": "<think>\nOkay, so I have this query where the user wants a summary of a provided text. Let me read through it carefully to understand what they're asking for.\n\nThe original text is about Baywatch being called the worst TV import ever, based on a poll by UK executives. It mentions specific shows like The Dukes of Hazzard and others winning in the survey. There are also details about how different shows rank in terms of all-time imports from the US. \n\nI need to condense this into just plain text without any explanations or formatting. So, I'll identify the key points: Baywatch is the worst import, it's been on TV for 12 years, stars David Hasselhoff and Pamela Anderson, watched in over 140 countries, and did well against US shows like The X-Files, Twin Peaks, etc., but was ranked sixth. It didn't go as high as the top 10. \n\nI should make sure to mention that British TV hasn't realized how low it can go before Baywatch. Also, include the details about how other American shows performed in that poll.\n\nAlright, putting it all together into a concise summary without any extra information.\n</think>\n\nThe program \"Baywatch\" was deemed the worst TV import ever by UK executives, according to a poll conducted by Broadcast magazine. It starred David Hasselhoff and Pamela Anderson since its 12-year run. The show was widely watched in over 140 countries and ranked sixth on the list of all-time imports from the US. Other top shows included The X-Files, Twin Peaks, and I Love Lucy. Baywatch did not reach the highest ranking for British TV ever, which wasn't achieved by \"Jerry Spring's Show,\" a drama that came in at sixth place instead.", "tinyllama:1.1b": "In a survey conducted by UK television magazine Broadcast, the surf show Baywačch emerged as the worst TV import of all time, with \"mind-numbingly predictable scripts\" for its beachgoer being saved from drowning, and an all-time worst top 10 including Extreme Makeover, which saw members of the public given thousands of pounds worth of plastic surgery. The Simpsonesque soap opera Knoç Landing, Falcon Crest, The Bold & The Beautiful, Jerry Springer Show, and The Jerry Springer Show were also noteworthy offenders on the list for their predictability.", "tinydolphin:1.1b": " Baywatch was voted as the worst TV import in a British poll, coming in at number six on the list of worst all-time imports from the US. The show starred David Hasselhoff alongside Pamela Anderson during its run, but its low-quality scripts and predictable storylines made it stand out among the best imports from both countries.", "phi:2.7b": " Baywatch is a TV show that won an award for being the \"worst import\" of all time in a poll of UK television executives. It was popular in 140 countries during its 12-year run, but it did not do well when compared to other American shows like The Simpsons, The Dukes of Hazzard and Dallas. Other British shows like Knots Landing and The Bold And The Beautiful also made the top 10 list. Jerry Springer's show was the sixth worst in the survey, while Extreme Makeover received praise for its plastic surgery episodes. \n", "orca-mini:3b": " UK television executives polled Baywatch as the worst TV import of all time, with David Hasselhoff and Pamela Anderson starring in the program during its 12-year run. Model Anna Nicole Smith's reality show and The Dukes of Hazzard were runners-up in the survey. The Simpsons and Dallas and 24 made the top 10 of the magazine's list of the best all-time imports from the US. Soap operas Knots Landing, Falcon Crest plus The Bold And The Beautiful all made the top 10 of Transatlantic TV howlers. The Jerry Springer Show, which came in at sixth on the list, did not fare well.", "hermes3:3b": "Baywatch named 'worst TV import', beating Bay\n(Baywatch)\nBaywatch and other poor UK TV imports win\n worst import title in Broadcast magazine poll.", "stablelm-zephyr:3b": "Baywatch was voted the worst TV import of all time by UK television executives, according to a poll in Broadcast magazine. The show, which starred David Hasselhoff and Pamela Anderson, was shown in 140 countries during its 12-year run. Other shows that made the list of top 10 worst imports include Model Anna Nicole Smith's reality show, The Dukes of Hazzard, Soap operas Knots Landing, Falcon Crest and The Bold And The Beautiful. The Jerry Springer Show came in sixth on the list. American shows such as The X-Files, I Love Lucy, Twin Peaks and Star Trek also received praise and were considered among the best imports from the US.", "chatgpt-4o-latest": "Baywatch was voted the worst TV import of all time in a poll of UK television executives conducted by Broadcast magazine. Despite its global popularity, the show was criticized for its predictable scripts. Other poorly received imports included Anna Nicole Smith's reality show, The Dukes of Hazzard, and The Jerry Springer Show. Meanwhile, The Simpsons, Dallas, and 24 were ranked among the best US imports. Other praised American shows included The X-Files, I Love Lucy, Twin Peaks, and Star Trek.", "stablelm2:1.6b": "Baywatch, once dubbed 'worst TV import' by UK television executives, earned this title due to its predictable scripts about beachgoers being saved from drowning during a poll conducted by Broadcast magazine. Other poorly performing shows included The Dukes of Hazzard, Anna Nicole Smith's reality show, and The Jerry Springer Show. Comparatively successful American programs were praised, such as The X-Files, I Love Lucy, Twin Peaks, and Star Trek.", "granite3.1-dense:2b": "Baywatch, a 12-year-old beach patrol series featuring David Hasselhoff and Pamela Anderson, was named the worst TV import in a UK television executives' poll by Broadcast magazine. The show, initially broadcast in 140 countries, lost to other American imports like The Dukes of Hazzard (runners-up) and was criticized for its predictable scripts focusing on rescuing beachgoers from drowning. Other notable U.S. shows that performed well included The X-Files, I Love Lucy, Twin Peaks, Star Trek, and soap operas such as Knots Landing, Falcon Crest, and The Bold And The Beautiful. Shows like The Jerry Springer Show, Extreme Makeover, and others with more creative or thought-provoking content fared better in the poll.", "reference": "The Jerry Springer Show, which came in at sixth on the list, did not fare well.Surf show Baywatch has won the title of worst TV import of all time in a poll of UK television executives.Baywatch rose to the top of the list for having \"mind-numbingly predictable scripts: beachgoer is saved from drowning,\" according to the magazine.Model Anna Nicole Smith's reality show and The Dukes of Hazzard were runners-up in the Broadcast magazine survey."}