{"raw_text": "Stern dropped from radio stations\n \n Controversial DJ Howard Stern has been dropped from four US radio stations because he keeps promoting his move to a network broadcasting on satellite.\n \n Cidatel Broadcasting said Stern had transformed his show into a \"continuous infomercial promoting Sirius, his new satellite radio employer\". Stern will join the Sirius subscription service, which is not governed by US regulators, next year. Citadel pulled Stern's show from stations in New York and Pennsylvania. Stern had been holiday for two weeks but his show did not return to the four stations as expected on 3 January. Citadel said it did not yet know whether it would return to its network.\n \n Stern announced in October that he was leaving conventional radio, where his syndicated show goes out across the US, for the relatively restriction-free satellite service. The DJ's broadcasts are well known for landing in trouble with regulators for obscene and sexually explicit rantings. Stern was dropped by six stations owned by media giant Clear Channel in 2004 after it had to pay the Federal Communications Commission $1.75m (£950,000), over breaches indecency laws. Media giant Viacom has also reportedly agreed to the FCC's demands that if Stern is issued with another indecency violation then his show must be pulled from all of its stations. Viacom has also been hit with record fines of $3.5m (£1.8m) over Stern and two other New York DJs. But Stern continues to be one of the most popular talk show hosts, particularly in the 25-54 age category.\n", "llama3.2:1b": "Stern was dropped from four US radio stations for promoting his new satellite radio employer Sirius on his show, which is governed by foreign regulators rather than US ones.", "llama3.2:3b": "Howard Stern's radio show has been dropped from four US stations due to promoting his move to Sirius satellite radio, which is not governed by US regulators. The drop follows previous issues with indecency laws and FCC fines, with Viacom agreeing to pull the show if another violation occurs.", "gemma2:2b": "Howard Stern was dropped from four US radio stations for promoting his move to a satellite radio network owned by Sirius. This decision came after Stern's show transformed into an infomercial about Sirius and was not returned to those stations as expected on January 3rd.  Stern's history of controversial content led to legal action and fines from the FCC, prompting Viacom, one of his media partners, to restrict him further. Despite these challenges, Stern remains a popular talk show host. \n", "qwen2.5:0.5b": "The controversial DJ Howard Stern was dropped from four US radio stations after he converted his show into a \"continuous infomercial\" promoting Sirius satellite broadcasting. Stern's broadcasts have landed him in trouble with regulators for obscene and sexually explicit content. Media giant Viacom has been hit by fines of $3.5m (£1.8m) over Stern and two other DJs, but the DJ remains one of the most popular talk show hosts in the 25-54 age group.", "qwen2.5:1.5b": "DJ Howard Stern was dropped from four US radio stations due to promoting his move to a satellite network. This has led to his show being pulled and returned to two stations temporarily before leaving permanently until next year when he joins Sirius. Stern is known for controversial content that frequently lands him in regulatory trouble, but maintains a strong following in young audiences aged 25-54 despite previous dismissals by media giants like Clear Channel and Viacom over indecency issues.", "qwen2.5:3b": "Stevenson, a controversial radio DJ known for obscene content, has been dropped from four US radio stations by Citadel Broadcasting due to his constant promotion of Sirius satellite service. This move comes after six stations owned by Clear Channel and media giant Viacom pulled his show in 2004 and 2016 respectively over indecency issues. Despite these controversies, Stern remains popular, especially among the 25-54 age group. Citadel plans to determine if Stern’s show will return to its network after taking a two-week holiday.", "opencoder:1.5b": "Ster dropped from radio stations. Controversial DJ Howard Stern has been dropped from four US radio stations because he keeps promoting his move to a network broadcasting on satellite. Cidatel Broadcasting said Stern had transformed his show into a \"continuous infomercial promoting Sirius, his new satellite radio employer\". Citadel pulled Stern's show from stations in New York and Pennsylvania. The show did not return to the four stations as expected on 3 January. The DJ’s broadcasts are well known for landing in trouble with regulators for obscene and sexually explicit rantings.\nStern announced in October that he was leaving conventional radio, where his syndicated show goes out across the US, for the relatively restriction-free satellite service. The broadcasts of Stern's show are widely reported to be affected by regulatory fines from Clear Channel, a media giant.\nViacom has reportedly agreed to pay the FCC's demands that if Stern is repeatedly indicted with another indecency violation then his show must be pulled from all of its stations. Record fines of $3.5m (£1.8m) over Stern and two other New York DJs have also been reported on Viacom.\nSter continues to be one of the most popular talk show hosts, particularly in the 25-54 age category. Clear Channel's request by Viacom that he return to its network has sparked controversy among viewers and critics alike.\n", "smollm:1.7b": "Summarizing the text:\n\nStern dropped from four US radio stations because he promoted his move to a network broadcasting on satellite. Cidatel Broadcasting said Stern had transformed his show into a \"continuously infomercial promoting Sirius, his new satellite radio employer\". Stern will join the Sirius subscription service, which is not governed by US regulators, next year. Citadel pulled Stern's show from stations in New York and Pennsylvania. Stern had been holiday for two weeks but his show did not return to the four stations as expected on 3 January. Citadel said it does not yet know whether it would return to its network.\n\nThe summary preserves key ideas, including:\n\n* The main topic of the text is the controversy surrounding Howard Stern's decision to drop from four US radio stations due to his promotion of satellite broadcasting.\n* The context provided by the text includes information about the controversy surrounding Stern's decision and the fact that he was dropped by six stations owned by Clear Channel in 2004 for breaching indecency laws.\n* The key idea is that Stern's decision to drop from four US radio stations was due to his promotion of satellite broadcasting, which was not governed by US regulators.\n* The summary does not include any additional information or explanations about the text.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Howard Stern being dropped from radio stations. Let me read through it carefully.\n\nStern was originally a DJ for the popular \"The Office\" and \"60 Minutes.\" He's controversial because he promotes moving his show to a satellite network. But now, four US radio stations have pulled him off because he promoted Sirius, which is Sirius XM's satellite service.\n\nCidatel Broadcasting, the owner of those stations, removed Stern's show from them. They had to pull it out in New York and Pennsylvania after two weeks, though he expected it back on January 3rd.\n\nStern announced moving his career to a new satellite service next year. He left conventional radio where he used to be. Before that, four stations owned by Clear Channel dropped him because of issues with the FCC's regulations.\n\nClear Channel and Viacom both faced big fines for violating the FCC. I should note their financial repercussions.\n\nEven though Stern is popular among 25-54 listeners, his controversial stuff made him drop from the radio network. He did well in talk shows but not much on other outlets.\n\nSo, putting it all together, Stern's move was controversial and caused some big issues with regulations, leading to his removal from radio for a couple of weeks. But he continued his career elsewhere.\n</think>\n\nHoward Stern moved to Sirius XM's satellite service next year but was dropped from four US radio stations in January 2024 due to promoting its network. The stations pulled his show out of New York and Pennsylvania after two weeks, despite expecting it to return by then. Cidatel Broadcasting, the owners of those stations, had already removed Stern from them before this. Before moving to Sirius, Stern was fired by Clear Channel for violating FCC regulations in 2004 and later by Viacom, which agreed to additional fines. Despite his success in talk shows, he remained a favorite among listeners aged 25-54 but faced backlash over his controversial content.", "tinyllama:1.1b": "Stern dropped from radio stations due to his continued promotion of Sirius, a subscription service that is not governed by US regulators. Stern had been holidaying for two weeks but his show did not return to four stations as expected on January 3rd. Citadel announced that it had withdrawn Stern's show from its network, citing the DJ's \"continuous infomercial promoting Sirius, his new satellite radio employer\". The announcement comes after Stern was dropped by six Clear Channel owned-and-operated stations in 2004 for breaches of indecency laws. In a recent settlement with the Federal Communications Commission (FCC), media giant Viacom has agreed to issue indecency violation fines totaling $3.5m to Stern and another New York DJ, but Stern continues to be one of the most popular talk show hosts in America.", "tinydolphin:1.1b": " Stern, a well-known radio personality who had gained fame for promoting his own network broadcasting on satellite, was dropped from four US radio stations due to his contentious approach to radio promotion. The decision came after Stern's show continued airing without his permission in November, prompting Citadel to take it off the air. This action resulted in Stern having to reconsider his future in radio and potentially his relationship with Clear Channel. It is not yet clear whether he will return to these stations or other ones owned by Clear Channel. Stern's decision to leave conventional radio has been praised by his fans, who appreciate the uncensored nature of his show, but it also sparked debate about potential regulatory concerns over contentious rants.", "phi:2.7b": " Howard Stern's radio shows have been cancelled due to his promotion of Sirius satellite radio, which is not regulated by US authorities. The DJ had previously been dropped from six Clear Channel stations for indecent content. He announced his move to Sirius in October and has been a popular host among 25-54 year olds despite past controversies.\n", "orca-mini:3b": " Controversial radio DJ Howard Stern has been dropped by four US radio stations due to his move to a satellite radio service. The stations were not informed by Citadel Broadcasting and are expected to return to their regular programming. The move came after Stern was ordered to pay a fine of $1.75 million by the Federal Communications Commission for violating indecency laws. He is also facing another possible fine from the FCC over another indecency violation. Despite this, Stern continues to have a large following and is one of the most popular talk show hosts in the 25-54 age category.", "hermes3:3b": "Howard Stern dropped from 4 US radio stations for promoting satellite network (Sirius), after infomercial-like promotion on his show.", "stablelm-zephyr:3b": "Radio personality Howard Stern was dropped from four US radio stations owned by Citadel Communications Inc., following concerns that he continued to promote his move to Sirius, a satellite radio network. Cidatel Broadcasting accused Stern of transforming his show into a \"continuous infomercial promoting Sirius.\" Despite being removed from the stations, Stern's show returned on 3 January, and it remains unclear whether Citadel will rejoin its network. In 2004, Stern was dropped from six Clear Channel stations following a $1.75 million fine for breaching indecency laws. Viacom, another media giant, has also faced record fines over Stern's content. However, Stern remains one of the most popular talk show hosts among adults aged 25-54.", "chatgpt-4o-latest": "Howard Stern has been dropped from four US radio stations by Citadel Broadcasting for using his show to promote his move to Sirius satellite radio. Stern, known for controversial content, will join Sirius next year, escaping US regulatory restrictions. His show was expected to return after a holiday break but did not. Stern has faced multiple fines and bans for indecency, including a $1.75 million fine for Clear Channel in 2004 and Viacom's agreement to pull his show if another violation occurs. Despite controversies, Stern remains highly popular, especially among listeners aged 25-54.", "stablelm2:1.6b": "Controversial DJ Howard Stern has been dropped from four US radio stations for promoting his move to a satellite radio network without proper regulation. Stern's show turned into an infomercial promoting Sirius, his new employer, and was pulled by Citadel Broadcasting after he joined the satellite service next year. This is not governed by US regulators yet. Stern announced leaving conventional radio in October for the satellite service, known for its unrestricted content, which led to previous fines from the FCC.", "granite3.1-dense:2b": "Howard Stern, a controversial DJ known for his explicit rants, has been dropped from four US radio stations: those in New York and Pennsylvania operated by Citadel Broadcasting. The stations cited Stern's show as an \"infomercial\" promoting Sirius, his upcoming satellite radio service. Stern announced his departure from conventional radio to join Sirius, which is not regulated by US authorities. This decision follows a history of regulatory issues; Stern was previously dropped by six stations owned by Clear Channel due to indecency law breaches, leading to a $1.75m (£950,000) fine. Viacom, another major broadcaster, also agreed to pull his show from their stations if he violated indecency rules again. Despite this, Stern remains one of the most popular talk show hosts, particularly among the 25-54 age group. Citadel has not decided whether they will return to Stern's network following this development.", "reference": "Cidatel Broadcasting said Stern had transformed his show into a \"continuous infomercial promoting Sirius, his new satellite radio employer\".Stern had been holiday for two weeks but his show did not return to the four stations as expected on 3 January.Controversial DJ Howard Stern has been dropped from four US radio stations because he keeps promoting his move to a network broadcasting on satellite.Viacom has also been hit with record fines of $3.5m (£1.8m) over Stern and two other New York DJs.Stern announced in October that he was leaving conventional radio, where his syndicated show goes out across the US, for the relatively restriction-free satellite service."}