{"raw_text": "New media battle for Bafta awards\n \n The BBC leads the nominations for the Bafta Interactive Awards, including one for the Radio Times website and one for Sport Interactive's Euro 2004 coverage.\n \n The awards, which were started in 1997, recognise the best websites, digital TV shows and CD roms. Other nominees include The Guardian news website, the National Theatre, MTV, the Science Museum and the London Stock Exchange. The winners from 12 different categories are crowned on 2 March 2005. There were nearly 400 entries this year - a third more than last year. The BBC has 16 nominations while The Guardian has three nominations.\n \n \"This year's nominees are a testament to the creative and innovative work going on within the industry,\" said Grant Dean, chair of the interactive committee. Categories include interactive TV, film, digital TV, mobile phones and music. Shaun of the Dead, Oasis' Definitely Maybe, Really Bend It Like Beckham, The Chaplin Collection and The Day Today will battle it out in the DVD category.\n \n ITV's Great British Spelling Test takes on the BBC's Olympics and Spooks Interactive for the interactive TV award. And the Guardian takes three of a possible five nominations in the news and sport category for its website coverage of Euro 2004, the Tour de France and the US elections. The BBC's iCan site is up for the technical and social innovation award alongside the likes of Nottingham University's Uncle Roy All Around You. In 2002, the British Academy of Film and Television decided to split the awards into separate games and interactive ceremonies, to fully cover the range of innovation outside the gaming industry.\n", "llama3.2:1b": "The BBC leads the nominations for the Bafta Interactive Awards with 16 entries, including the Radio Times website and Sport Interactive's Euro 2004 coverage. Other nominees include The Guardian news website, MTV, and several other websites and TV shows. Winners are crowned on March 2, 2005, after nearly 400 entries were received this year.", "llama3.2:3b": "The Bafta Interactive Awards were started in 1997 and recognize best websites, digital TV shows, and CD roms. This year, the BBC leads with 16 nominations, including Radio Times website and Euro 2004 coverage, while The Guardian has three nominations. Winners will be crowned on March 2, 2005, from nearly 400 entries. Categories include interactive TV, film, music, and mobile phones, with some awards going to notable titles such as Shaun of the Dead and The Chaplin Collection.", "gemma2:2b": "The BBC leads nominations for the Bafta Interactive Awards, with 16 nominations. Other notable nominees include The Guardian, MTV, Science Museum, and London Stock Exchange. Categories include interactive TV, film, digital TV, mobile phones, and music.  Awards ceremony will be held on March 2nd, 2005. Nearly 400 entries were submitted this year, a third more than last year. The awards recognize innovative work in websites, digital television shows, and CD-ROMs.  \n", "qwen2.5:0.5b": "This year marks the BBC's fifth participation in the Bafta Interactive Awards after its first participation was in 1997. The BBC leads nominations in various categories including Radio Times' website, Sport Interactive's Euro 2004 coverage and a new category for digital TV shows.\n\nThe awards were started in 1997, with nearly 400 entries this year, making it one of the most active competitions in online media history. The BBC has 16 nominations while The Guardian has three, and two sites (iCan) are up for the technical and social innovation award alongside Nottingham University's Uncle Roy All Around You.\n\nThe BBC has won five times, with its site coverage of Euro 2004, iCan, the TV show The Chaplin Collection and ITV's Great British Spelling Test. They also claim a third place in the interactive TV category for their website for Euro 2004, Tour de France, US elections and BBC's iCan site.\n\nThe Guardian has taken three of its five categories up against sites including The Daily Telegraph (news), the Daily Mail (sports) and the BBC's Future TV. In the news and sports category, they are up against the BBC, ITV and The Guardian's own websites for their coverage.", "qwen2.5:1.5b": "The BBC leads nominations for Bafta Interactive Awards with entries for Radio Times website and Euro 2004 coverage; nearly 400 entries from 12 categories nominated on March 2nd, up 33% over last year. Other nominees include The Guardian news site, National Theatre, MTV, Science Museum, London Stock Exchange, Shaun of the Dead film, Oasis album, etc., with BBC having 16 nominations and Guardian 3.", "qwen2.5:3b": "The BBC leads nominations for the Bafta Interactive Awards with one nomination each for Radio Times website and Euro 2004 coverage. Other nominees include The Guardian news site, National Theatre, MTV, Science Museum, London Stock Exchange, and ITV’s Great British Spelling Test competes against BBC's Olympics and Spooks Interactive for interactive TV award. Guardian wins three in news/sport category with Euro 2004, Tour de France, US elections coverage. iCan site wins technical/social innovation award alongside Nottingham University's project. The awards celebrate the best websites, digital TV shows, and CD roms from 1997, featuring categories like interactive TV, film, mobile phones, and music, with winners announced on March 2, 2005.", "opencoder:1.5b": "The BBC has led the nominations for the Bafta Interactive Awards, including one for the Radio Times website and one for Sport Interactive's Euro 2004 coverage. The awards recognize the best websites, digital TV shows and CDroms. Winners from 12 different categories are crowned on 2 March 2005. There were nearly 400 entries this year - a third more than last year. The BBC has 16 nominations while The Guardian has three nominations. \"This year's nominees are a testament to the creative and innovative work going on within the industry,\" said Grant Dean, chair of the interactive committee.\n", "smollm:1.7b": "The summary should be concise, clear, and free of unnecessary information. The key ideas and details that are important for understanding the text can be summarized as follows:\n\n1. The New Media Battle for the Bafta Awards is a competition among various media outlets to win the most nominations in the 2005 Bafta Awards.\n2. The BBC leads the nominations, including one for the Radio Times website and one for Sport Interactive's Euro 2004 coverage.\n3. There were nearly 400 entries this year - a third more than last year.\n4. The winners from 12 different categories are crowned on 2 March 2005.\n5. The BBC has 16 nominations, while The Guardian has three nominations.\n6. This year's nominees are a testament to the creative and innovative work going on within the industry.\n7. ITV's Great British Spelling Test takes on the BBC's Olympics and Spooks Interactive for the interactive TV award.\n8. The Guardian takes three of a possible five nominations in the news and sport category for its website coverage of Euro 2004, the Tour de France and the US elections.\n9. The BBC's iCan site is up for the technical and social innovation award alongside the likes of Nottingham University's Uncle Roy All Around You.\n10. In 2002, the British Academy of Film and Television decided to split the awards into separate games and interactive ceremonies, to fully cover the range of innovation outside the gaming industry.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about the BBC leading the Bafta Interactive Awards. Let me read through it carefully.\n\nThe main points are: The BBC is leading the nominations for the Bafta Interactive Awards, which started in 1997. They've got one category for the Radio Times website and one for Sport's Euro 2004 coverage. There were nearly 400 entries this year—38% more than last year.\n\nOther nominees include The Guardian news site, National Theatre, MTV, Science Museum, London Stock Exchange, and others like The Daily Telegraph. The winners are announced on March 2nd, 2005. BBC has 16 nominations, The Guardian three.\n\nThere were two categories for interactive media: TV, Film, etc., and a third category is online coverage. Shaun of the Dead, Oasis' track, The Chaplin Collection, The Day Today, and The Day Today are in the DVD category.\n\nOther competitions like Great British Spelling Test and Olympics go to ITV. The Guardian's website has entries for Euro 2004, Tour de France, and US elections. Also, there were two categories of technical and social innovation, with iCan up against others.\n\nThe article also mentions that in 2002, the BAFTA decided to split into games and interactive ceremonies because gaming wasn't enough. I should note that too.\n\nI need to make sure I capture all these key points without adding any extra information or explanations. Just a concise summary of each main point.\n</think>\n\nThe BBC is leading the Bafta Interactive Awards, which started in 1997. Key points include nearly 400 entries this year—38% more than last year, with the BBC at 16 nominations and The Guardian at three. Categories cover interactive TV, film, digital TV, mobile phones, music, online coverage (news and sport), and technical-social innovation.", "tinyllama:1.1b": "The BBC has led the nominations for the Bafta Interactive Awards with a record-breaking 16 nominations across various categories, including one for its Radio Times website and one for Sport Interactive's Euro 2004 coverage. Other notable nominees include The Guardian news website, the National Theatre, MTV, London Stock Exchange, and over 30 others. In the digital TV show category, BBC1 has three nominations, while The Guardian has two. The interactive commitee chairman says that this year's nominees are \"testament to the creative and innovative work going on within the industry.\" ITV's Great British Spelling Test takes on BBC2 for the interactive TV award in the news and sport category, while the Guardian's Olympic coverage won three nominations in the interactive TV category. The BBC, iCan site, and Nottingham University's Uncle Roy All Around You received nominations from the academy of Film and Television for their innovative work outside the gaming industry.", "tinydolphin:1.1b": " The Bafta Interactive Awards, which recognize the best websites for digital media, have announced their nominations this year, with over 400 entries submitted. Amongst them are nominations from major media organizations such as The Guardian, BBC, and The Science Museum. This follows on from last year's record-breaking number of nominations in the various categories.\n\nThis year's nominees are a testament to the creativity and innovation taking place within the interactive media industry. Some of the leading contenders include Shaun of the Dead, Oasis' Definitely Maybe, Really Bend It Like Beckham, The Chaplin Collection, and The Day During the Weekend. This showcases the diverse range of content that is being produced, highlighting the importance of interactive media in reaching and engaging audiences.\n\nThe awards ceremony will take place on March 2nd, with the winner announced live during the event.", "phi:2.7b": " The BBC leads nominations at the Bafta Interactive Awards for its Radio Times website and Sport Interactive' Euro 2004 coverage. Other nominees include The Guardian news site, National Theatre, MTV, Science Museum, London Stock Exchange, Shaun of the Dead, Oasis' Definitely Maybe, Really Bend It Like Beckham, The Chaplin Collection, The Day Today, ITV's Great British Spelling Test, Spooks Interactive, and the Guardian's website coverage of Euro 2004, Tour de France, and US elections.\n", "orca-mini:3b": " The BBC leads the nominations for the Bafta Interactive Awards, including one for the Radio Times website and one for Sport Interactive's Euro 2004 coverage. Other nominees include The Guardian news website, the National Theatre, MTV, the Science Museum and the London Stock Exchange. The winners from 12 different categories will be announced on March 2, 2005.", "hermes3:3b": "Bafta Interactive Awards nominations: BBC for various websites, Grant Dean mentions creative & innovative work; 400 entries, 16 BBC, 3 Guardian nominations; categories include interactive TV, film, digital TV, mobile phones, music.", "stablelm-zephyr:3b": "The BBC dominates the nominations for the Bafta Interactive Awards, with 16 nominations including Radio Times website and Sport Interactive's Euro 2004 coverage. The National Theatre, Guardian, MTV, Science Museum, and London Stock Exchange also have nominations. The awards recognize excellence in websites, digital TV shows, and CD-ROMs, with winners set to be announced on 2 March 2005. This year's nominees reflect the creativity and innovation within the industry.", "chatgpt-4o-latest": "The BBC leads the nominations for the Bafta Interactive Awards, which recognize excellence in websites, digital TV, and CD-ROMs. The 2005 awards feature nearly 400 entries, with winners announced on 2 March. The BBC has 16 nominations, while The Guardian has three. Categories include interactive TV, film, digital TV, mobile phones, and music. Notable nominees include Shaun of the Dead, Oasis' Definitely Maybe, and The Guardian's news website. ITV's Great British Spelling Test competes with BBC's Olympics and Spooks Interactive for the interactive TV award. The BBC's iCan site is nominated for technical and social innovation. The awards were split from gaming in 2002 to better highlight non-gaming innovations.", "stablelm2:1.6b": "The BBC leads in nominations for the Bafta Interactive Awards, including notable achievements like Radio Times website and Sport Interactive's Euro 4 coverage. The awards honor best websites, digital TV shows, and CD-ROMs; other nominees include The Guardian news site, National Theatre, MTV, Science Museum, London Stock Exchange, and more. Over 200 entries were submitted this year, with nearly double the number from last year. The winners will be announced on March 2nd, with categories including interactive TV, film, digital TV, mobile phones, and music. Notable nominees include Shaun of the Dead, Oasis' Definitely Maybe, Really Bend It Like Beckham, The Chaplin Collection, and The Day Today.", "granite3.1-dense:2b": "The Bafta Interactive Awards, launched in 1997, are set to honor exceptional digital content in various categories, including websites, digital TV shows, and CD-ROMs. This year's nominees include The Guardian, with three nods; the BBC, with 16; and other notable entries like ITV, MTV, and the Science Museum. The winners will be announced on March 2, 2005, following a surge in entries of nearly 400, up from last year. Categories span interactive TV, film, digital TV, mobile phones, and music, with competitors such as Shaun of the Dead, Oasis' Definitely Maybe, and Really Bend It Like Beckham for DVD. The BBC's iCan site and Nottingham University's Uncle Roy All Around You are also in contention. In 2002, the British Academy of Film and Television divided awards into games and interactive categories to broaden coverage of digital innovation beyond gaming.", "reference": "ITV's Great British Spelling Test takes on the BBC's Olympics and Spooks Interactive for the interactive TV award.And the Guardian takes three of a possible five nominations in the news and sport category for its website coverage of Euro 2004, the Tour de France and the US elections.Categories include interactive TV, film, digital TV, mobile phones and music.The BBC leads the nominations for the Bafta Interactive Awards, including one for the Radio Times website and one for Sport Interactive's Euro 2004 coverage.In 2002, the British Academy of Film and Television decided to split the awards into separate games and interactive ceremonies, to fully cover the range of innovation outside the gaming industry.Other nominees include The Guardian news website, the National Theatre, MTV, the Science Museum and the London Stock Exchange."}