{"raw_text": "Fox 'too reliant on reality TV'\n \n The head of US TV network Fox has admitted the broadcaster had relied too heavily on reality TV shows such as the poor-rating Who's Your Daddy.\n \n Chief executive Gail Berman said \"in the case of this fall we drifted to too much on the unscripted side\". The series Who's Your Daddy, where a young woman tries to pick her natural father for a cash prize caused outrage from adoption groups and rated badly. Last season, Fox's prime-time audience fell by 600,000 to 5.9 million. Ms Berman said: \"I think the audience expects loud things from Fox. Sometimes they work, and sometimes they don't.\"\n \n Who's Your Daddy, the first episode of which was shown on 3 January, pulled in a disappointing audience of 6.3 million, according to the Nielsen ratings system. Five other episodes of the show had also been filmed will be dropped from Fox's schedules, Ms Berman said. She was predicting a drop in ratings even for some of the network's established reality shows, such as American Idol, which is due to start its fourth series this week. Fox had unveiled a new strategy last year promising to launch new shows every season, including the traditionally quiet summer season. Though that had met with a poor reception, Ms Berman said \"there's no question that the audience, in our mind, is ready, willing and able to accept new programming in the summer\". Fox has changed this plan, launching new shows in May instead of June. One of the new shows will be the animated series American Dad, made by Seth MacFarlane, the creator of Family Guy. That series, after becoming a hit on DVD, is also set to return with new episodes.\n", "llama3.2:1b": "Fox's US TV network has admitted to relying too heavily on reality TV shows like \"Who's Your Daddy\", which caused outrage and low ratings. The show was cancelled after one season due to poor reception. Fox is shifting its strategy from a traditional prime-time schedule to launching new shows in May instead of June, including an animated series based on Seth MacFarlane's \"American Dad\".", "llama3.2:3b": "Fox head Gail Berman says the network relied too heavily on reality TV shows like \"Who's Your Daddy\" and expects louder programming from viewers. The show rated badly with 6.3 million viewers, leading Fox to drop five more episodes. Fox is re-evaluating its strategy after poor reception to new summer shows.", "gemma2:2b": "Fox's CEO admits reliance on reality TV led to poor ratings and plans to shift strategy. The network acknowledges audience expects \"loud\" programming and will change its plan for new shows, launching some in May instead of June.  The show \"Who's Your Daddy\" was a failure and has been dropped from schedules, along with five other episodes. \n", "qwen2.5:0.5b": "Fox has increased its focus on reality TV and primetime dramas in order to increase viewership. One such show is \"Who's Your Daddy\" where an aspiring actress tries to be her natural father for a cash prize. However, the series fell short of ratings expectations and Fox plans to launch new shows during the summer season instead.", "qwen2.5:1.5b": "Fox's reality TV-heavy strategy led to lower ratings and an audience drop from 5.9 million to 600,000 for Who's Your Daddy season finale. Fox plans to launch new shows in May instead of June.", "qwen2.5:3b": "Fox's CEO Gail Berman admitted the network relied too heavily on reality TV like Who's Your Daddy for ratings, which caused outrage and poor performance. The show initially drew 6.3 million viewers but will have five episodes dropped from its schedule. Despite Fox predicting an increase in summer shows, Berman announced launching them in May instead of June. Fox also plans to introduce the animated series American Dad, created by Seth MacFarlane.", "opencoder:1.5b": "Fox 'too reliant on reality TV' - The head of US TV network Fox has admitted the broadcaster had relied too heavily on reality TV shows such as the poor-rating Who's Your Daddy.\n\nChief executive Gail Berman said \"in the case of this fall we drifted to too much on the unscripted side\". The series Who's Your Daddy, which aired in 2008, was rated badly and had a disappointing audience of 6.3 million viewers.\n\nFox's prime-time audience fell by 600,000 compared with last season but rose to 5.9 million at the end of 2018. Ms Berman said: \"I think the audience expects loud things from Fox. Sometimes they work, and sometimes they don't.\"\n\nThe animated series American Dad, made by Seth MacFarlane, which is due to launch this week, has also been dropped from Fox's schedule as viewership was disappointing.\n\nFox had unveiled a new strategy last year, promising to launch new shows every season, including the traditionally quiet summer season. Though that had met with a poor reception, Ms Berman said \"there's no question that the audience, in our mind, is ready, willing and able to accept new programming in the summer\". Fox has changed this plan, launching new shows in May instead of June.\n", "smollm:1.7b": "The Fox network had been accused of relying too heavily on reality TV shows such as Who's Your Daddy, which caused outrage from adoption groups and rated badly. The head of the network admitted that in the case of this fall season, they drifted too much on the unscripted side. Chief executive Gail Berman said: \"in the case of this fall we drifted to too much on the unscripted side\". The series Who's Your Daddy, where a young woman tries to pick her natural father for a cash prize caused outrage from adoption groups and rated badly. Ms Berman said: \"I think the audience expects loud things from Fox. Sometimes they work, and sometimes they don't.\" She was predicting a drop in ratings even for some of the network's established reality shows, such as American Idol, which is due to start its fourth season this week. Fox had unveiled a new strategy last year promising to launch new shows in May instead of June. One of the new shows will be the animated series American Dad, made by Seth MacFarlane, the creator of Family Guy. That series, after becoming a hit on DVD, is also set to return with new episodes.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving the key ideas and details. Let me read through it carefully.\n\nThe main point here is that Fox TV Network's head, Gail Berman, admitted they were too reliant on reality TV shows like Who's Your Daddy. She mentioned that in the fall season, Fox felt they spent too much time on unscripted material, which caused a drop in ratings and generated outrage from adoption groups.\n\nShe talked about How the Ratings dropped by 600,000 to 5.9 million last season. The show pulled in 6.3 million, but five more episodes were canceled for production reasons. She predicted that established reality shows like American Idol might also see ratings drops because it's their fourth season.\n\nFox changed their strategy from launching new shows every season by introducing a traditional summer lineup, which didn't work well. They're now planning to launch new shows in May instead of June, with one being the animated series American Dad made by Seth MacFarlane.\n\nI need to condense all this into a summary without explanations or formatting. I'll make sure to capture the key points: Fox's reliance on reality TV, impact on ratings, specific example of How, Berman's prediction about other shows, and the change in their new lineup.\n</think>\n\nFox's head admitted excessive reliance on reality TV like Who's Your Daddy, which caused audience drops and generated criticism. They predicted rating declines in established shows due to multiple episodes being canceled for production reasons. The network changed its strategy by introducing traditional summer programming instead of a traditional launch every season. American Dad, created by Seth MacFarlane, will be part of the new lineup starting in May.", "tinyllama:1.1b": "Fox Has Released a Press Release Confessing that Its Broadcasting Company Was Too Dependent on Unscripted Shows such as \"Who's Your Daddy\"\n\nThe head of US TV network Fox has admitted that the broadcast company had relied too heavily on reality shows such as the poorly received Who's Your Daad? The series, which aimed to pick the real father for a casualty prize caused outrage from adoptive groups and ratings to be down by 600,000 last season. Ms Gaile Berman of Fox has said that \"I think the audience expects loud things from Fox\". This season, five other episodes of the show were scheduled to be dropped from Fox's schedule, with Ms Berman predicting a drop in ratings even for established reality shows such as American Idol. The network had unveiled a new strategy last year promising to launch new shows every season, including the traditionally quiet summer season. However, this plan was met with poor reception, and Fox has changed its plans by launching new shows in May instead of June, with one of them being the animated series American Daad, which is set to return with new episodes.", "tinydolphin:1.1b": " Fox has been heavily reliant on reality TV shows such as \"Who's Your Daddy\" for much of its programming this fall, and it may need to reconsider its approach moving forward. The network had initially aimed to launch new shows every season in the summer but changed that strategy last year in hopes of improving viewership during the typically quiet summer season. However, despite its initial enthusiasm for new programming, audiences were not as keen on these new shows, and Fox has now announced plans to drop several reality series from its schedule. This change suggests that the network is reevaluating its approach to original content in comparison to what it might be able to attract during the summer months, which typically offers less competition for viewers' time than other times of the year.", "phi:2.7b": " The head of US TV network Fox has admitted that the broadcaster had relied too heavily on reality TV shows such as Who's Your Daddy. Last season, Fox'’s prime-time audience fell by 600,000. Ms Berman said the audience expects loud things from Fox. She is predicting a drop in ratings even for some of the network's established reality shows, American Idol and other series will be dropped.\n", "orca-mini:3b": " Gail Berman admitted that Fox had relied too heavily on reality TV shows such as Who's Your Daddy, which caused controversy and ratings decline. The network plans to launch new shows during the summer season, including Seth MacFarlane's animated series American Dad, which became a hit on DVD and is set to return with new episodes.", "hermes3:3b": "Fox relies too much on reality TV, especially _Who's Your Daddy_, which led to decreased ratings and audience.", "stablelm-zephyr:3b": "Fox TV network's CEO Gail Berman admitted overreliance on reality TV shows like \"Who's Your Daddy,\" which caused poor ratings and audience decline. Fox will adjust its plan by launching new shows in May instead of June, with a focus on producing quality programming throughout the year.", "chatgpt-4o-latest": "Fox's chief executive, Gail Berman, admitted the network had relied too much on reality TV, citing the poor performance of Who's Your Daddy, which faced backlash and low ratings. Fox's prime-time audience declined by 600,000 to 5.9 million. The network is dropping five unaired episodes of Who's Your Daddy and anticipates a ratings dip even for established shows like American Idol. Fox had planned to introduce new shows year-round but is now shifting premieres to May instead of June. Upcoming programming includes the animated series American Dad and the return of Family Guy.", "stablelm2:1.6b": "Fox has admitted to relying too heavily on reality TV, such as Who's Your Daddy, which caused controversy and poor ratings. CEO Gail Berman said Fox drifted too much to the unscripted side in fall, leading to a 5.9 million viewer audience drop. Five episodes of Who's Your Daddy will be dropped from schedules, but new programming is expected to thrive during the summer season despite initially changing plans.", "granite3.1-dense:2b": "Fox's CEO, Gail Berman, acknowledged that the network had overrelied on reality TV shows during the fall season, citing poor-rated series like Who's Your Daddy as an example. This show, which aimed to help adoptees find their biological parents for a cash prize, was criticized by adoption groups and garnered disappointing ratings of 6.3 million viewers per episode. As a result, Fox plans to air fewer unscripted programs, including the popular American Idol, due to declining audience expectations. Last year, Fox had committed to launching new shows annually, even during summer, but they've shifted this strategy to May, with one such show being Seth MacFarlane's American Dad returning for new episodes after its success on DVD.", "reference": "Five other episodes of the show had also been filmed will be dropped from Fox's schedules, Ms Berman said.Ms Berman said: \"I think the audience expects loud things from Fox.Fox had unveiled a new strategy last year promising to launch new shows every season, including the traditionally quiet summer season.Though that had met with a poor reception, Ms Berman said \"there's no question that the audience, in our mind, is ready, willing and able to accept new programming in the summer\".Fox has changed this plan, launching new shows in May instead of June.One of the new shows will be the animated series American Dad, made by Seth MacFarlane, the creator of Family Guy."}