{"raw_text": "Joy Division story to become film\n \n The life of late Joy Division singer Ian Curtis is to be made into a film, it has been announced.\n \n The Manchester-based production is called Touching From A Distance, after a book by Curtis's widow Deborah which forms the basis for the film. Music mogul Tony Wilson, who headed the record company Joy Division were signed to, will be co-executive producer. The musician committed suicide in 1980 aged 23, shortly before the band were due to go on tour in the US. Mr Wilson, who has remained friends with Curtis's widow and daughter Natalie, who he says asked for his involvement to make the film \"official\". \"People have different ideas as to why Ian committed suicide, so maybe the film will reflect those different views,\" he told the BBC News website.\n \n Plans for a separate Joy Division film had been announced at the Cannes Film Festival earlier this year, but the project did not get off the ground as it failed to get the backing of Curtis's family. Mr Wilson, who was also involved with Joy Division's sucessor band New Order, as well as the Happy Mondays, said he would \"rather not\" appear in the film. He made a cameo appearance in 24 Hour Party People, in which his leading role was played by Steve Coogan. \"I'm not an actor and I did a lousy job playing my part in 24 Hour Party People,\" said the Factory Records founder, who has been associated with the Manchester music scene since the 1970s. \"Film people have a tendency to mess up when they touch music, but I hope this one works.\n \n \"This is much more than the music - they want to do the real story of Ian,\" he said. The film is to be directed by Dutch-born Anton Corbijn, who has made music movies for Depeche Mode and U2. It will be produced by a US production company, while the widow of Ian Curtis will also be an executive producer.\n", "llama3.2:1b": "The life of Joy Division singer Ian Curtis will be made into a film. The project is titled Touching From A Distance and features music mogul Tony Wilson as co-executive producer. Plans for a separate Joy Division film had been announced but failed to secure backing from the band's family.\n\nA film about Curtis' final days, directed by Anton Corbijn, will feature an executive producer, Deborah Curtis, who is also Ian's widow.", "llama3.2:3b": "A film about Joy Division singer Ian Curtis's life is being made, called Touching From A Distance, with Tony Wilson as co-executive producer and Anton Corbijn directing. The project is based on a book by Curtis's widow Deborah and aims to tell the \"real story\" of his life.", "gemma2:2b": "A film about the life of Joy Division singer Ian Curtis is being made called \"Touching From A Distance\". The film is based on Deborah Curtis's book and Tony Wilson, music mogul who helped launch Joy Division, is co-executive producer.  Director Anton Corbijn will helm the project. \n", "qwen2.5:0.5b": "A movie about Joy Division singer Ian Curtis' life has been planned to become reality. The project is called \"Touching From A Distance\" after a book by his wife Deborah. Tony Wilson, who co-executed the film with Curtis's family, hopes it might reflect different views of his late friend. However, the collaboration was not successful and the plan to make a separate Joy Division film did not get off the ground. The director is Dutch-born Anton Corbijn, who has made music movies before. The movie will be directed by Tony Wilson, who co-executed with Curtis's family, and the widow of Ian Curtis also serves as an executive producer.", "qwen2.5:1.5b": "Joy Division singer Ian Curtis's life story will be adapted into a film directed by Dutch-born Anton Corbijn and produced by Tony Wilson, featuring his widow as an executive producer. The project aims to explore the real story behind Curtis's suicide in 1980.", "qwen2.5:3b": "Joy Division singer Ian Curtis's life story is being turned into a film titled \"Touching From A Distance,\" based on his widow Deborah's book. Manchester-based production, co-executive produced by Tony Wilson (of Factory Records fame), aims to reflect differing views on why Curtis committed suicide in 1980. Initially planned at Cannes but stalled due to family objections, the project is now moving forward with Anton Corbijn directing and a US production company producing it alongside Ian's widow as an executive producer.", "opencoder:1.5b": "Joy Division story to become film. \n\nThe life of late Joy Division singer Ian Curtis is to be made into a film.\n\nAfter a book by Curtis's widow Deborah forms the basis for the film. \n\nMusic mogul Tony Wilson co-executive producer the musician committed suicide in 1980, shortly before the band were due to go on tour in the US. Mr Wilson was friends with Curtis's widow and daughter Natalie, who he says invited his involvement to make the film \"official\". People have different ideas as to why Ian committed suicide; perhaps the film reflects those different views.\n\nPlans for a separate Joy Division film had been announced at the Cannes Film Festival earlier this year. However, it did not turn out successfully due to complications from Curtis's family. Mr Wilson insisted that he would \"rather not\" appear in the film, who also plays a leading role in 24 Hour Party People.\n\nAs for the film, it is directed by Dutch-born Anton Corbijn, who has made music movies for Depeche Mode and U2. The film will be produced by a US production company while the widow of Ian Curtis will be an executive producer.\n", "smollm:1.7b": "The Joy Division story to become a film is being made into a film with the title Touching From A Distance. The film is based on a book called Touching From A Distance which forms the basis for the film. Music mogul Tony Wilson has been involved in the production and will be co-executive producer. The musician Ian Curtis, who died at the age of 23, was due to go on tour in the US. Mr Wilson said that he would \"rather not\" appear in the film because he did not want to be associated with the music industry. He made a cameo appearance in 24 Hour Party People, but this time it was played by Steve Coogan.\nThe film is being produced by a US production company and the widow of Ian Curtis will also be an executive producer. The real story of Ian Curtis is being told through the film.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Joy Division becoming a film based on their singer Ian Curtis's life. Let me read through it carefully.\n\nFirst, the main point is that the story is to become a film. The announcement says that the life of Ian Curtis will be made into a film and it's been announced. It mentions the production company is called Touching From A Distance, which uses a book by his widow Deborah as the basis for the film. \n\nThen, they mention that music mogul Tony Wilson, who was previously associated with Joy Division, is co-executive producer. He knows Ian because he was his daughter Natalie asked for his involvement to make the film official. He told BBC News that people have different ideas about why Ian committed suicide when he was 23.\n\nNext, there's some context on a separate film by Joy Division had been announced earlier but didn't get support from Curtis's family. Wilson still is friends with both the widow and daughter Natalie, so he doesn't want to be in this new film. He appeared in a cameo in \"24 Hour Party People,\" where he played Steve Coogan, who was actually his best friend at the time.\n\nWilson also mentions that while he wasn't an actor, he did a lousy job playing his role in 24 Hour Party People. He said it's more than just the music because they want to do the real story of Ian Curtis. He directed the film, and the production company is US-based. The widow of Curtis will also be an executive producer.\n\nI need to make sure I capture all these key points: the announcement about making a film based on Ian's life, the production details with Tony Wilson as co-executive, the different ideas among survivors regarding his suicide, the failed attempt at a separate film by Joy Division, Wilson's comments on not appearing in this one, his cameo in another movie, and his involvement with other bands.\n\nI also need to structure the summary concisely without any extra information or explanations. Just plain text.\n</think>\n\nJoy Division is planning a film based on their late singer Ian Curtis' life, which has been announced. The production is called \"Touching From A Distance,\" directed by Anton Corbijn and co-produced by a US company. The widow of Ian Curtis, Deborah Wilson, will be an executive producer. Wilson, who was part of Joy Division, stated he won't appear in the film but has appeared in another film with Steve Coogan. Wilson also mentioned that \"they want to do the real story of Ian,\" contrasting it as more than just music since they focus on the survivors. He directed and worked with other bands like New Order and Happy Mondays.", "tinyllama:1.1b": "The life of late Joy Division singer Ian Curtis is to be turned into a film that explores the artist's mental health and suicide in the years leading up to his death at the age of 23. The movie, called \"Touching From A Distance,\" is being co-produced by Tony Wilson, who founded Manchester record label Factory Records and was friends with Ian Curtis's widow. It will be directed by Dutch director Ducretch-born Anton Corbijn and produced by a US company. The widow of the deceased musician has offered her involvement in the film as part of a deal to allow the music industry and media to tell the story of Ian Curtis's life through the lens of his death.", "tinydolphin:1.1b": " The Joy Division story to become film: This is much more than just the music – they want to tell the real story of Ian, which includes his relationship with his family and the tragic death of his friend who was part of the band. A talented director, Anton Corbijn, has been tapped to make this movie, which will be produced by a US production company. The film's plot is yet to be finalized, but it is expected to release in theaters sometime next year.", "phi:2.7b": " A film about Joy Division singer Ian Curtis' life is being made after his death in 1990. The movie, titled Touching From A Distance, is based on Deborah Curtis' book and will explore different theories about Ian's suicide. Tony Wilson, who was a close friend of the family and had worked with the band before their tragic end, has been appointed as co-executive producer. He has said that he would rather not appear in the film and hopes it does justice to the music and the real story of Ian. The movie will be directed by Anton Corbijn and produced by a US company.\n", "orca-mini:3b": " Joy Division singer Ian Curtis's life is going to be made into a film called Touching From A Distance. The film is being co-executive produced by music mogul Tony Wilson and will feature cameo appearances from him. The film will reflect different views on why Ian committed suicide and is expected to be directed by Anton Corbijn, known for his work with music acts Depeche Mode and U2. The film will be executive produced by Ian Curtis's widow Deborah and will also feature in a separate project at the Cannes Film Festival. Steve Coogan played the leading role in 24 Hour Party People, which was based on Mr Wilson's life. The film will not be a music movie, but rather a full-length story of Ian Curtis's life.", "hermes3:3b": "Joy Division singer's life to be made into film \"Touching From A Distance\", based on wife's book & co-executed by Tony Wilson.", "stablelm-zephyr:3b": "A film based on the life of late Joy Division singer Ian Curtis, named Touching From A Distance, is in development. The movie, inspired by Curtis' widow Deborah's book, will be produced by a US company and directed by Dutch-born Anton Corbijn. Music mogul Tony Wilson, who headed Joy Division's record company, will be co-executive producer and has remained friends with Curtis' widow and daughter Natalie. The film aims to tell the real story of Ian Curtis, whose suicide occurred in 1980 before the band was due to go on tour in the US.", "chatgpt-4o-latest": "A film about the late Joy Division singer Ian Curtis, titled *Touching From A Distance*, is in production, based on a book by his widow, Deborah Curtis. Tony Wilson, who headed Joy Division’s record company, will co-executive produce at the request of Curtis’s family. Curtis died by suicide in 1980 at age 23, just before a U.S. tour. A previous Joy Division film project failed due to a lack of family support. The film, directed by Anton Corbijn and produced by a U.S. company, aims to tell Curtis’s real story beyond just the music. Wilson, involved with Joy Division’s successor band New Order, will not appear in the film, expressing hope that it will accurately portray Curtis’s life.", "stablelm2:1.6b": "A film adaptation of Joy Division singer Ian Curtis' life is set to be produced by Manchester-based Touching From A Distance. Tony Wilson, who was signed by Ian's band Joy Division, will co-executive produce alongside Deborah Curtis, Ian's widow. The film intends to reflect various perspectives on Ian's suicide; the project has faced obstacles as plans for a separate Joy Division film at Cannes failed to secure backing from Curtis' family. Anton Corbijn, known for music films like Depeche Mode and U2, will direct with a US production company and Deborah Curtis as an executive producer.", "granite3.1-dense:2b": "Joy Division's late frontman Ian Curtis' life is set to be portrayed in a film titled \"Touching From A Distance.\" The project, based on Deborah Curtis' book, was co-produced by music mogul Tony Wilson. Initially planned at the Cannes Film Festival, it gained traction when Wilson, friends with the late singer's widow and daughter Natalie, expressed his desire to support the film as a form of official recognition.\n\nThe project aims to explore Ian Curtis' life and the circumstances surrounding his suicide in 1980 at age 23, shortly before the band was to embark on their US tour. Wilson, who has been associated with Manchester's music scene since the 1970s and co-founded Factory Records, said he would \"rather not\" act in the film but expressed hope for its success after his less-than-impressive cameo in \"24 Hour Party People.\"\n\nAnton Corbijn, a renowned Dutch director known for music videos of Depeche Mode and U2, will helm the movie. It will be produced by a US company and feature Deborah Curtis as an executive producer. The film promises to delve deeper into Ian Curtis' story beyond his musical contributions.", "reference": "The life of late Joy Division singer Ian Curtis is to be made into a film, it has been announced.The film is to be directed by Dutch-born Anton Corbijn, who has made music movies for Depeche Mode and U2.\"Film people have a tendency to mess up when they touch music, but I hope this one works.Plans for a separate Joy Division film had been announced at the Cannes Film Festival earlier this year, but the project did not get off the ground as it failed to get the backing of Curtis's family.Mr Wilson, who was also involved with Joy Division's sucessor band New Order, as well as the Happy Mondays, said he would \"rather not\" appear in the film.Mr Wilson, who has remained friends with Curtis's widow and daughter Natalie, who he says asked for his involvement to make the film \"official\"."}