{"raw_text": "Aaliyah claim dismissed by court\n \n Late R&B star Aaliyah's record company has failed in an attempt to sue the video producer who booked the ill-fated flight on which she died in 2001.\n \n A New York appeals court has told Blackground Records that only the singer's parents had the right to launch a claim for wrongful death. The 22-year-old singer's family came to an undisclosed settlement over a negligence claim in 2003. Aaliyah had completed a music video when the plane crashed in the Bahamas. She and eight others were killed on the plane, which crashed as if left for Florida. Blackground Records' lawyer Frank Penski said he had yet to examine the decision and did not know whether they would pursue the case.\n \n An investigation into the crash revealed the twin-engined Cessna was overloaded by 700 pounds (320kg). A post-mortem carried out on the remains of the pilot showed there was cocaine and alcohol in his body. Aaliyah was a rising star in music and film before she was killed. She was honoured with a string of posthumous awards and her single More Than A Woman went to number one in the UK.\n", "llama3.2:1b": "A New York appeals court has ruled that only Aaliyah's parents have the right to sue the video producer who booked the ill-fated flight on which she died. The case is over a negligence claim related to a post-mortem investigation into her death, which revealed cocaine and alcohol in the pilot's body.", "llama3.2:3b": "A New York appeals court dismissed Blackground Records' attempt to sue video producer over Aaliyah's death, stating only Aaliyah's parents had the right to launch a claim for wrongful death; an undisclosed settlement was reached by her family in 2003.", "gemma2:2b": "Aaliyah's record company failed to sue a video producer involved in her death because only her parents have the right to file a wrongful death claim. The singer's family settled their negligence claim in 2003. An investigation revealed the plane was overloaded and the pilot had cocaine and alcohol in his system. Aaliyah was a successful artist before her tragic death. \n", "qwen2.5:0.5b": "Aaliyah's record company has sued a video producer who booked her plane flight, but only her parents had the right to sue for wrongful death, according to an appeal court ruling.", "qwen2.5:1.5b": "Aaliyah's record company has been dismissed by court after attempting to sue the video producer for wrongful death, following an investigation into her plane crash in 2001. The singer was a rising star who died during filming and left behind posthumous awards including More Than A Woman at number one in the UK.", "qwen2.5:3b": "Aaliyah's record company failed in an attempt to sue the video producer for booking the flight where she died in 2001. Only the singer's parents had the right to launch a wrongful death claim, which they settled for undisclosed terms in 2003. The New York appeals court ruled this out. An investigation revealed the plane was overloaded and the pilot tested positive for drugs and alcohol before crashing near Florida. Aaliyah, then a rising star in music and film, received posthumous awards including a number one hit in the UK.", "opencoder:1.5b": "Aaliyah's record company has failed in an attempt to sue the video producer who booked the flight on which she died in 2001. A New York appeals court has ruled that only the singer's parents had rights to initiate a death penalty claim for negligent behavior in 2003. The 22-year-old singer's family came to an undisclosed settlement over negligence, and Blackground Records' lawyer Frank Penski said he had not yet examined the decision. He did not know whether they would pursue the case.\n", "smollm:1.7b": "Aaliyah's claim dismissed by court: Late R&B star Aaliyah's record company has failed in an attempt to sue the video producer who booked the ill-fated flight on which she died in 2001.\n\nA New York appeals court has told Blackground Records that only the singer's parents had the right to launch a claim for wrongful death. The 22-year-old singer's family came to an undisclosed settlement over a negligence claim in 2003. Aaliyah had completed a music video when the plane crashed in the Bahamas. She and eight others were killed on the plane, which crashed as if left for Florida. Blackground Records' lawyer Frank Penski said he had yet to examine the decision and did not know whether they would pursue the case.\n\nAn investigation into the crash revealed the twin-engined Cessna was overloaded by 700 pounds (320kg). A post-mortem carried out on the remains of the pilot showed there was cocaine and alcohol in his body. Aaliyah was a rising star in music and film before she was killed. She was honoured with a string of posthumous awards and her single More Than A Woman went to number one in the UK.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text into a concise summary that preserves key ideas and details. Let me start by reading through the text carefully.\n\nFirst, the main points are about Aaliyah being dismissed by the court after being found wrongful dead in 2001. Her record company is suing the video producer of the plane crash where she died. The NY appeals court states that only her parents have the right to claim for wrongful death. The singer's family had a negligence claim in 2003, but they were not awarded damages because of an undisclosed settlement. There was an investigation into the crash involving a Cessna plane, which was overloaded and the pilot was found intoxicated. Aaliyah is a rising star with various honors and a new single released posthumously.\n\nI should ensure that the summary includes all these key points without getting too detailed. I'll focus on the dismissal of the case by the court, the role of her parents, the original claim's denial, the details of the crash, and her music career highlights.\n\nLet me structure this in a clear way, making sure to mention each important element mentioned.\n</think>\n\nAaliyah was dismissed from the court due to being found wrongful dead in 2001. Her record company is suing the video producer of the plane crash where she died in 2001. An appeals court in New York ruled that only her parents have the right to claim for wrongful death, declining the case despite a negligence claim in 2003 that was not awarded damages. Aaliyah, a rising star in music and film before her death, received several honors and is currently honoring with awards and releasing a new single posthumously. The crash involved an overloaded Cessna plane crashed as if left for Florida by 700 pounds (320kg) of weight, with the pilot's body found intoxicated.", "tinyllama:1.1b": "Blackground Records failed to secure a wrongful death claim against the creator of a fatal flight that killed singer Aaliyah, an appeal court has ruled. Despite an undisclosed settlement over a negligence case, Aaliyah's family came to terms with the tragedy in 2003 and agreed to pay for a music video shot on the ill-fated aircraft. The singer had completed a music video before her plane crashed while en route from Florida to Jamaica. Her twin-engine propeller aircraft, carrying six passengers, was overloaded by 700 pounds (320kg), according to an investigation into the crash. There were no signs of alcohol or drugs in Aaliyah's body, and a post-mortem carried out on her remains revealed traces of cocktail drugs and alcohol. Despite the death of a rising star in music and film, Blackground Records claimed to have no right to launch a wrongful death claim over Aaliyah's tragic end.", "tinydolphin:1.1b": " A court has dismissed a claim made by Blackground Records, a record company, against the video producer responsible for booking the plane that tragically crashed in 2001, killing two passengers and leaving six others injured. The record company claimed they had a right to pursue a wrongful death suit on behalf of Aaliyah's family. However, New York's Court of Appeals recently ruled that only her parents could bring such a claim due to the settlement reached between them in 2003. Attorney Frank Penski has not commented publicly on the case but stated he would examine the court's decision and decide whether to pursue the claim or not.", "phi:2.7b": " A summary of the text is:\n\nThe video producer who booked Aaliyah's plane that crashed in 2001 failed to sue Blackground Records for her death, as only her parents had the right to do so, according to a court decision in \n", "orca-mini:3b": " The court dismissed Blackground Records' attempt to sue the video producer who booked the ill-fated flight on which Aaliyah died. Only the singer's parents had the right to launch a claim for wrongful death, and they settled the case in 2003. The plane was overloaded by 700 pounds and had cocaine and alcohol in the pilot's body, and an investigation revealed that the pilot was under the influence of drugs and alcohol at the time of the crash. Aaliyah was a rising star in music and film before her death, and her music continues to be celebrated even today.", "hermes3:3b": "Aaliyah's record label failed to sue video producer for wrongful death, as court dismisses claim; only parents had right to lawsuit.", "stablelm-zephyr:3b": "Aaliyah's record company, Blackground Records, failed in their attempt to sue video producer Karl Blixen, who booked the ill-fated flight in 2001. The New York appeals court ruled that only Aaliyah's parents could pursue a claim for wrongful death. In 2003, the family reached an undisclosed settlement regarding a negligence claim. An investigation into the crash revealed that the twin-engined Cessna was overloaded with 700 pounds of weight, leading to Aaliyah's tragic death at the age of 22.", "chatgpt-4o-latest": "A New York appeals court dismissed Blackground Records' lawsuit against the video producer who booked the flight on which Aaliyah died, ruling that only her parents could file a wrongful death claim. Aaliyah's family had already settled a negligence claim in 2003. The 22-year-old singer died in a 2001 plane crash in the Bahamas along with eight others after completing a music video. Investigations found the plane was overloaded and the pilot had cocaine and alcohol in his system. Aaliyah, a rising star in music and film, received posthumous honors, and her single \"More Than A Woman\" topped the UK charts.", "stablelm2:1.6b": "Aaliyah's record company unsuccessfully sued a video producer for wrongful death in connection to her fatal plane crash. The court ruled that only her parents had legal rights to claim, whereas Aaliyah's family reached an undisclosed settlement over a negligence case related to a music video she completed at the time of the crash. Aaliyah, then 14, died when the twin-engine Cessna was overloaded with 562 pounds (around 250 kg) of payload; her post-mortem examination revealed cocaine and alcohol in the pilot's system. She was popular before passing, earning numerous awards after her death, including a string of posthumous honors for her single \"More Than A Woman,\" which reached number one in the UK.", "granite3.1-dense:2b": "The court has ruled that only Aaliyah's parents could initiate a wrongful death lawsuit following her 2001 plane crash death in the Bahamas, where she was filming a music video. In 2003, they reached an undisclosed settlement for negligence claims. Blackground Records, Aaliyah's record label, has been told by a New York appeals court that only her parents possess this right. The crash occurred due to the plane being overloaded by 700 pounds and the pilot having cocaine and alcohol in his system. Despite the ruling, Blackground Records' lawyer has not yet determined whether to pursue the case further. Aaliyah, a promising musician and film actor at 22, received posthumous accolades and her song \"More Than A Woman\" peaked at number one in the UK.", "reference": "Aaliyah was a rising star in music and film before she was killed.A New York appeals court has told Blackground Records that only the singer's parents had the right to launch a claim for wrongful death.Aaliyah had completed a music video when the plane crashed in the Bahamas.An investigation into the crash revealed the twin-engined Cessna was overloaded by 700 pounds (320kg)."}