{"raw_text": "Connick Jr to lead Broadway show\n \n Singer and actor Harry Connick Jr is to star in a Broadway revival of 1950s hit musical The Pajama Game.\n \n He will play the supervisor of a US pyjama factory who has a romance with a union activist during labour unrest. Jeffrey Richards, the show's co-producer, said Connick was \"an actor of enormous charisma and skill, a wonderful singer and a bona fide star\". He has recently starred in hit US comedy Will and Grace as the husband of Grace, played by Debra Messing. The musical will open in November, said Mr Richards, who added that no other casting had been announced yet.\n \n The original book by George Abbott and Richard Bissell will be revised by playwright Peter Ackerman, who co-wrote the screenplay for the movie Ice Age. It has a score by Richard Adler and Jerry Ross, and Adler is writing two new songs for the score, which includes numbers including Hey There, Small Talk and Steam Heat. Connick appeared with his band on Broadway in 1990, and he wrote the score for a musical based on Emile Zola's novel Therese Raquin, called Thou Shalt Not. It had a three-month run on Broadway in 2001.\n", "llama3.2:1b": "Harry Connick Jr is starring as the supervisor of a US pyjama factory in a Broadway revival of The Pajama Game, which will open in November.", "llama3.2:3b": "Harry Connick Jr will star in a Broadway revival of The Pajama Game, opening in November. He will play the supervisor with a romance to a union activist during labor unrest.", "gemma2:2b": "Harry Connick Jr will star in a Broadway revival of \"The Pajama Game\", opening in November.  The show features an updated book and score with new songs from Richard Adler. Connick's previous theatre experience includes performances on Broadway with his band and composing for the musical \"Thou Shalt Not\". \n", "qwen2.5:0.5b": "Singer Harry Connick Jr is set to star in a revival of 1950s hit musical The Pajama Game. He will play the supervisor of a US pyjama factory who has a romance with a union activist during labour unrest, co-produced by Jeffrey Richards. The musical will open in November and will be directed by Peter Ackerman, who wrote the screenplay for the movie Ice Age. Connick appeared with his band on Broadway in 1990 and wrote the score for a musical based on Emile Zola's novel Therese Raquin.", "qwen2.5:1.5b": "Singer and actor Harry Connick Jr will star in a Broadway revival of The Pajama Game, set to open in November after Jeffrey Richards announces he has been cast as the show's supervisor who romances a union activist during labor unrest. Connick is praised for his charisma and skill as an actor and singer. He most recently starred in Will and Grace on television. The musical will be directed by Peter Ackerman, whose screenplay co-wrote Ice Age.", "qwen2.5:3b": "Harry Connick Jr. will star in a Broadway revival of The Pajama Game starring the supervisor of a US pyjama factory who has a romance with a union activist during labor unrest. Connick, an actor and singer, recently starred in Will & Grace. Jeffrey Richards, co-producer, praised Connick's charisma, skill, and stardom. The musical will open in November 2023; Peter Ackerman revised the original book, Richard Adler and Jerry Ross composed the score, with Adler writing two new songs. Connick has appeared on Broadway before, including a musical based on Emile Zola’s novel which ran for three months in 2001.", "opencoder:1.5b": "Summarized text:\n\nHarry Connick Jr will play as The Pajama Game supervisor during a US pyjama factory. He has a romance with a union activist and will work closely with Jeffrey Richards, who co-produced the show's script. Connick Jr was an actor of tremendous character and skill, appearing in the opening scenes of The Pajama Game, which opened on November 19th, 2001.\n", "smollm:1.7b": "The summary is concise and to the point, capturing the main ideas and key details of the text:\n\n1. Connick Jr will star in a Broadway revival of 1950s hit musical The Pajama Game.\n2. He will play the supervisor of a US pyjama factory who has a romance with a union activist during labour unrest.\n3. Jeffrey Richards, the show's co-producer, said Connick was \"an actor of enormous charisma and skill, a wonderful singer and a bona fide star\".\n4. He has recently starred in hit US comedy Will and Grace as the husband of Grace, played by Debra Messing.\n5. The musical will open in November, said Mr Richards, who added that no other casting had been announced yet.\n6. The original book by George Abbott and Richard Bissell will be revised by playwright Peter Ackerman, who co-wrote the screenplay for the movie Ice Age.\n7. The score by Richard Adler and Jerry Ross has two new songs written for the show, which includes numbers including Hey There, Small Talk and Steam Heat.\n8. Connick appeared with his band on Broadway in 1990, and he wrote the score for a musical based on Emile Zola's novel Therese Raquin, called Thou Shalt Not.\n\nThe summary captures the main ideas and key details of the text, including:\n\n* The title and genre of the show (musical)\n* The main characters involved (Connick Jr, supervisor of a US pyjama factory, Mr. Richards, etc.)\n* The plot or storyline of the show (the romance between Connick and Grace during labour unrest)\n* Key details about the cast and crew (Harry Connick Jr., Will and Grace, Peter Ackerman, Richard Adler and Jerry Ross)\n* Any notable background information or context for the show (1950s hit musical, 1990s revival, etc.)", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely while preserving key ideas and details. The user provided a detailed passage about Harry Connick Jr. joining a Broadway show based on \"The Pajama Game\" from 1950s. Let me break down the main points.\n\nFirst, the article mentions that Harry will star in the production, playing a supervisor involved in a pyjamas factory romance with a union activist during labor unrest. He previously starred in \"Will and Grace,\" so his experience might add some background interest.\n\nHe's coming to star alongside actor Jeffrey Richards, co-producer Peter Richards also mentions his past roles, including his prior collaboration with Debra Messing on \"Will and Grace.\" The musical will open in November, and no other casting has been announced yet. \n\nThe original book is being revised by playwright Peter Ackerman. He wrote the score for Ice Age, which features a score by Richard Adler and Jerry Ross. There are new songs included: Hey There, Small Talk, Steam Heat, with Adler working on more. Connick has performed with his band in 1990 and wrote a musical called \"Thou Shalt Not\" from Emile Zola's novel, which ran for three months on Broadway.\n\nI should capture all these elements but keep it concise. I'll mention Harry joining the show, his previous roles, the musical details, co-producer information, and some of the music details about Peter Ackerman's work.\n</think>\n\nHarry Connick Jr is to lead a Broadway revival of \"The Pajama Game\" based on a 1950s hit musical. He will play the supervisor of a US pyjama factory involved in a romance with a union activist during labor unrest, co-starring with actor Jeffrey Richards and co-producer Peter Richards. The show will open in November, with no other casting announced yet. Peter Ackerman is revising the book by George Abbott and Richard Bissell, which will be scored by Richard Adler and Jerry Ross, who are also writing new songs, including \"Hey There, Small Talk\" and \"Steam Heat.\" He previously appeared with his band on Broadway in 1990 and wrote the score for a musical based on Emile Zola's novel \"Thou Shalt Not,\" which ran on Broadway three months prior.", "tinyllama:1.1b": "Broadway show to be revived with Harry Connick Jr starring as supervisor during labour unrest, Jeffrey Richardson co-producer says he was \"an actor of enormous charisma and skill\" who can handle both singing and acting, will open in November. The original book by George Abbott and Richard Biscell will be revisited by playwright Peter Ackerman with new songs by Adler and Ross. Connick has also appeared on Broadway before, with his band in 1990's Therese Raquin and the show was based on Zoola's novel. The musical, titled The Pajama Game, is set to open in November, as announced by co-producer Jeffrey Richardson.", "tinydolphin:1.1b": " Connick Jr is set to star in a new Broadway revival of the 1950s musical The Pajama Game. He will play the supervisor of a US pyjama factory who has a romance with a union activist during labor unrest. Connick was last seen on Broadway in a production of Therese Raquin, which had a three-month run in 2001. He is an accomplished singer and actor with experience on the big screen as well.", "phi:2.7b": " Harry Connick Jr is to star as the supervisor of a US pyjama factory in The Pajama Game revival. Co-producer Jeffrey Richards praised Connick's acting, singing and stardom skills. The original book was revised by Peter Ackerman, who co-wrote the screenplay for Ice Age.\n", "orca-mini:3b": " Harry Connick Jr will star in a Broadway revival of The Pajama Game, which is a musical based on a novel by Emile Zola.", "hermes3:3b": " Harry Connick Jr to lead Broadway production of The Pajama Game, opening November.", "stablelm-zephyr:3b": "Harry Connick Jr., a singer and actor, will star in a Broadway revival of the 1950s hit musical, The Pajama Game. He will play the supervisor of a US pyjama factory who falls in love with a union activist during labor unrest. The production will be led by Jeffrey Richards, the show's co-producer, who praised Connick as an \"amazing actor, wonderful singer, and bona fide star.\" The musical, which originally had a book by George Abbott and Richard Bissell, will be revised by playwright Peter Ackerman, who also co-wrote the screenplay for Ice Age. Richard Adler and Jerry Ross composed the score, with Adler writing two new songs, including \"Hey There\" and \"Small Talk.\" Connick previously appeared on Broadway in 1990 with his band and wrote the score for a musical based on Emile Zola's novel, Thou Shalt Not, which ran for three months on Broadway in 2001. The Broadway revival of The Pajama Game is set to open in November, although no further casting has been announced yet.", "chatgpt-4o-latest": "Harry Connick Jr will star in a Broadway revival of the 1950s musical The Pajama Game, playing a factory supervisor who falls for a union activist during labor unrest. Co-producer Jeffrey Richards praised Connick's talent and star power. The musical, opening in November, will feature a revised book by Peter Ackerman and a score by Richard Adler and Jerry Ross, with Adler adding two new songs. Connick, known for his role in Will and Grace, previously performed on Broadway with his band and composed the score for the 2001 musical Thou Shalt Not.", "stablelm2:1.6b": "Singer Harry Connick Jr. will star in a Broadway revival of the hit musical The Pajama Game alongside his wife Grace, as a US pyjama factory supervisor with a romance during labor unrest. Connick is described as having \"enormous charisma and skill\" by co-producer Jeffrey Richards. The revised original book by George Abbott and Richard Bissell will be updated by playwright Peter Ackerman, with music by Richard Adler and Jerry Ross, who also composed two new songs for the score. Harry previously appeared on Broadway in 2014 with his band and wrote the score for a musical based on Emile Zola's novel Therese Raquin.", "granite3.1-dense:2b": "Harry Connick Jr., a renowned singer and actor, will headline the Broadway revival of The Pajama Game. The musical, set to open in November, features him as the factory supervisor involved in a romance with a union activist amidst labor unrest. Co-producer Jeffrey Richards praised Connick for his charisma, vocal prowess, and stardom. This production will see revisions of George Abbott and Richard Bissell's original book by playwright Peter Ackerman. The score, composed by Richard Adler and Jerry Ross, includes classics like \"Hey There, Small Talk\" and \"Steam Heat,\" with two new songs added by Adler. Connick previously performed on Broadway in 1990 and wrote the score for Thou Shalt Not, a musical based on Emile Zola's Therese Raquin, which had a three-month run in 2001.", "reference": "Singer and actor Harry Connick Jr is to star in a Broadway revival of 1950s hit musical The Pajama Game.Connick appeared with his band on Broadway in 1990, and he wrote the score for a musical based on Emile Zola's novel Therese Raquin, called Thou Shalt Not.Jeffrey Richards, the show's co-producer, said Connick was \"an actor of enormous charisma and skill, a wonderful singer and a bona fide star\".It has a score by Richard Adler and Jerry Ross, and Adler is writing two new songs for the score, which includes numbers including Hey There, Small Talk and Steam Heat."}