{"raw_text": "Singer Knight backs anti-gun song\n \n R&B star Beverley Knight said she sang on an anti-gun single after being \"haunted\" by the fatal 2003 shooting of two teenage girls in Birmingham.\n \n Knight and drum 'n' bass star Roni Size have released No More in a bid to reduce gun use among young people. She said she was \"horrified\" by the deaths of Charlene Ellis, 18, and Letisha Shakespeare, 17. Size, whose New Forms album won the 1997 Mercury Music Prize, said gun use was \"nothing to be glamorised\".\n \n There were more than 10,500 firearms offences and 70 gun crime deaths in England and Wales between June 2003 and 2004, according to Home Office figures. Knight said the scale of the problem became clear to her after the 2003 shootings in Aston, near Knight's Birmingham home.\n \n \"It haunted me to be honest, it haunted my sleep,\" she said. Size became involved after two friends, Donna Small and Asha Jama, were shot in his Bristol hometown in October. Jama, 25, lost her sight in one eye while 22-year-old Small suffered serious head injuries. Size said he collaborated on the single, which was released on Monday, because he has \"a bird's eye view of what's going on\". \"Over the last 10 years, I have seen a lot of things happen and it is nothing to be glamorised, it really isn't,\" he said.\n", "llama3.2:1b": "Beverley Knight sang an anti-gun song after being haunted by the 2003 Birmingham shootings. Roni Size released the song \"No More\" as part of his campaign to reduce gun use among young people in England and Wales.", "llama3.2:3b": "Beverley Knight released an anti-gun single with Roni Size following fatal shootings in Birmingham and Bristol that left two teenagers disabled and another dead.", "gemma2:2b": "R&B star Beverley Knight released an anti-gun song called \"No More\" with drum 'n' bass artist Roni Size. The single aims to reduce gun use among young people after a series of shootings in Birmingham haunted the singer.  Size, who has witnessed gun violence in his own community, collaborated on the song because he believes gun violence is a serious issue that should not be glamourized. \n", "qwen2.5:0.5b": "The singer Beverley Knight sang a song on her album No More that night, and she expressed horror at seeing a tragic shooting. The gun crime rate in England and Wales was 10,500 firearms offences and 70 deaths from gun-related incidents between June 2003 and October 2004, according to Home Office figures. Size became involved after his friends were shot in Bristol but he collaborated with Knight on a song called No More that night because he has \"a bird's eye view of what's going on\".", "qwen2.5:1.5b": "Beverley Knight, R&B singer, backed by Roni Size for an anti-gun song released in June after being \"haunted\" by the 2003 shooting deaths of Charlene Ellis and Letisha Shakespeare in Birmingham. The single promotes reducing gun use among young people to prevent future tragedies.", "qwen2.5:3b": "Singer Beverley Knight collaborated with Roni Size on an anti-gun single called \"No More\" after being haunted by the deaths of two teenage girls in Birmingham in 2003. The song aims to reduce gun use among young people. Knight, who was \"horrified\" by the killings of Charlene Ellis and Letisha Shakespeare, participated due to the shootings near her home haunting her. There were over 10,500 firearms offenses and 70 gun-related deaths in England and Wales from June 2003 to 2004. Size contributed because he has seen many such incidents firsthand and emphasized that gun use should not be glamorized.", "opencoder:1.5b": "Singer Knight backs anti-gun song\n\nR&B star Beverley Knight said she sang on an anti-gun single after being \"haunted\" by the fatal 2003 shooting of two teenage girls in Birmingham.\n\nKnight and drum 'n' bass star Roni Size have released No More in a bid to reduce gun use among young people. She said she was \"horrified\" by the deaths of Charlene Ellis, 18, and Letisha Shakespeare, 17.\n\nSize, whose New Forms album won the 1997 Mercury Music Prize, said gun use was \"nothing to be glamorised\".\n\nThere were more than 10,500 firearms offences and 70 gun crime deaths in England and Wales between June 2003 and 2004, according to Home Office figures. Knight said the scale of the problem became clear to her after the 2003 shootings in Aston, near Knight's Birmingham home.\n\n\"She said it haunted me to be honest, it haunted my sleep. Donna Small and Asha Jama, who were shot in their Bristol hometown in October, 22-year-old lost her sight in one eye while 22-year-old Size suffered serious head injuries. He collaborated on the single, which was released on Monday.\n", "smollm:1.7b": "The summary should preserve key ideas and details from the original text while omitting unnecessary information. Here are some suggestions:\n\n1. **Main points**: The main points in the original text can be summarized as follows:\n\t* Singer Knight sings on an anti-gun song after being haunted by the 2003 shooting of two teenage girls in Birmingham.\n\t* Knight and drum 'n' bass star Roni Size have released No More, a bid to reduce gun use among young people.\n\t* Knight said she was \"horrified\" by the deaths of Charlene Ellis and Letisha Shakespeare, 18-year-old teenagers who were killed in the 2003 shooting.\n\t* There were more than 10,500 firearms offences and 70 gun crime deaths in England and Wales between June 2003 and 2004, according to Home Office figures.\n\t* Knight said the scale of the problem became clear to her after the 2003 shootings in Aston, near her home.\n\t* She collaborated with Roni Size on No More because she has a \"bird's eye view\" of what's going on and believes it is nothing to be glamorized.\n2. **Key details**: The key details that should be preserved are:\n\t* Singer Knight sings on an anti-gun song after being haunted by the 2003 shooting of two teenage girls in Birmingham.\n\t* Knight and drum 'n' bass star Roni Size have released No More, a bid to reduce gun use among young people.\n\t* Knight said she was \"horrified\" by the deaths of Charlene Ellis and Letisha Shakespeare, 18-year-old teenagers who were killed in the 2003 shooting.\n\t* There were more than 10,500 firearms offences and 70 gun crime deaths in England and Wales between June 2003 and 2004, according to Home Office figures.\n\t* Knight said the scale of the problem became clear to her after the 2003 shootings in Aston, near her home.\n\t* She collaborated with Roni Size on No More because she has a \"bird's eye view\" of what's going on and believes it is nothing to be glamorized.\n\nThe summary should preserve the key ideas and details from the original text while omitting unnecessary information.", "deepseek-r1:1.5b": "<think>\nOkay, let me try to figure out how to approach this query. The user has provided a text that I need to summarize concisely while preserving the key ideas and details. They also specified that the output should only be the summary in plain text without any explanations or formatting.\n\nFirst, I'll read through the text carefully. The main points seem to be about singers and a song related to anti-guns. It mentions Beverley Knight singing on an anti-gun song after being haunted by a 2003 shooting. She's talking about reducing gun use among young people, which led her to collaborate with Roni Size.\n\nI need to capture the key elements: the artists, the event they were involved in, the impact of that event, and their collaboration. I should ensure that all these details are included but kept concise. Also, I have to make sure not to include any explanations or additional information beyond what's provided.\n\nSo, structuring it, I'll start with the main topic: singers supporting an anti-guns song. Then mention the singer's inspiration from a shooting in Birmingham and her collaboration with Size. Include how they're working on No More to address gun use. Mention the statistics about shootings and deaths between 2003 and 2004, and end by highlighting the collaboration and their view on reducing gun crime.\n\nI should make sure each sentence is clear and flows well without any fluff. Also, ensure that all key dates and figures like \"June 2003\" are included correctly.\n</think>\n\nSingers Singer Knight and Roni Size collaborate on an anti-guns song after being haunted by a 2003 shooting near their home in Birmingham. They work together to release No More, aiming to reduce gun use among young people. The collaboration led to the publication of a song that reflects the call for reducing gun crime. Statistics show over 10,500 firearms offenses and 70 gun death incidents between 2003 and 2004. Size mentioned collaborating on the song because he had a bird's-eye view of the issue, while Knight described the tragedy as haunting her to sleep.", "tinyllama:1.1b": "Bevérley Knight, R&B star Beatrice Knight, has backed an anti-gun single after being \"haunted\" by the 2003 shooting of two teenage girls in Birmingham. Knight wrote and recorded the track No More with British drum 'n' bass star Roni Size, who also features on the single release. The lyrics were co-written by Knight and she was \"horrified\" by the deaths of Charlene Elliott, 18, and Letisha Shakespeare, 17. Since June 2003 there have been more than 10,500 firearm offences in England and Wales with gun crime deaths accounting for 70 in that same period, according to Home Office figures. Knight has said she became involved after two friends were shot in Bristol in October. The single is due to be releaased on Monday.", "tinydolphin:1.1b": " Beverley Knight, well-known singer from the R&B group \"Miami Sound Machine,\" has taken part in an anti-gun single. In her statement, she said that gun violence against children is a \"horrifying issue\" and that she was \"haunted\" by two fatal 2003 shootings in Birmingham. Knight and Size, along with other musicians, have joined forces to express their disapproval of the use of guns among young people. Their single \"No More,\" released on Monday, aims to reduce gun-related violence.", "phi:2.7b": " Singer Beverley Knight recorded an anti-gun song after being traumatized by two teenage girls who were shot in Birmingham. The song, No More, was released with Roni Size to reduce gun use among young people. There were more than 10,500 firearms offenses and 70 deaths in England and Wales between June 2003 and 2004, according to Home Office figures. Knight's friend Asha Jama lost her sight after being shot, while 22-year old Donna Small suffered severe head injuries.\n", "orca-mini:3b": " Beverley Knight, Roni Size collaborate on anti-gun song, citing fatal 2003 shooting in Birmingham", "hermes3:3b": "Beverley Knight, RB star, sings anti-gun single after 2003 Birmingham shootings haunting her; collaborated with Roni Size.", "stablelm-zephyr:3b": "R&B star Beverley Knight sang on an anti-gun single \"No More\" with drum 'n' bass artist Roni Size, after being haunted by the fatal 2003 shooting of two teenage girls in Birmingham. The duo collaborated to raise awareness about reducing gun use among young people and promote peace. Their single was released to address the issue of gun crimes, following over 10,500 firearms offenses and 70 gun crime deaths in England and Wales between June 2003 and 2004.", "chatgpt-4o-latest": "R&B singer Beverley Knight and drum 'n' bass artist Roni Size released the anti-gun single *No More* to discourage gun violence among young people. Knight was deeply affected by the 2003 shooting deaths of two teenage girls in Birmingham, while Size was motivated by the shooting of two friends in his hometown of Bristol. Both artists condemned the glamorization of gun use, citing the high number of firearms offences and gun-related deaths in England and Wales. The single was released to raise awareness and address the growing problem of gun crime.", "stablelm2:1.6b": "R&B star Beverley Knight sings in an anti-gun single after being haunted by the tragic Birmingham shooting that killed two teenage girls. The song, called \"No More,\" was released with drum 'n' bass artist Roni Size to reduce gun use among young people. Over 100 firearms offenses and 386 gun crime deaths were reported between June 2004 and 2005 in England and Wales, according to Home Office statistics. Singer Knight was moved by the tragedy after a friend, Asha Jama, lost her sight and suffered serious injuries in a shooting incident involving two friends, Donna Small and Knight's sister, in Bristol. The song's message is that gun use should not be glamored or celebrated.", "granite3.1-dense:2b": "R&B singer Beverley Knight and drum 'n' bass artist Roni Size collaborated on an anti-gun song titled \"No More.\" This single was inspired by the 2003 tragic shooting of two teenage girls, Charlene Ellis and Letisha Shakespeare, in Birmingham, which deeply affected Knight. She expressed being \"horrified\" by their deaths and how it impacted her sleep. Size, whose friends Donna Small and Asha Jama were shot in his Bristol hometown, joined the project due to his firsthand experience of gun violence over the past decade. He emphasized that such incidents should not be glamorized. The single was released in 2004 amid a broader trend of firearms offenses and gun crime deaths in England and Wales, with over 10,500 such cases reported between June 2003 and 2004, according to Home Office figures.", "reference": "Size, whose New Forms album won the 1997 Mercury Music Prize, said gun use was \"nothing to be glamorised\".R&B star Beverley Knight said she sang on an anti-gun single after being \"haunted\" by the fatal 2003 shooting of two teenage girls in Birmingham.Size said he collaborated on the single, which was released on Monday, because he has \"a bird's eye view of what's going on\".Knight said the scale of the problem became clear to her after the 2003 shootings in Aston, near Knight's Birmingham home.She said she was \"horrified\" by the deaths of Charlene Ellis, 18, and Letisha Shakespeare, 17."}