{"raw_text": "Portishead back after eight years\n \n Cult British group Portishead have revealed they are writing their third album, their first in eight years.\n \n Founding member Geoff Barrow told BBC 6 Music the record was well on the way to being completed. \"We're actually into it as we speak. We took some time off for Christmas, but generally we're doing another record,\" Barrow told the digital radio station. News of their album plans comes after confirmation the Bristol band will play a tsunami charity show next month. Portishead will play alongside fellow Bristol band Massive Attack at Oxfam's Tsumani appeal, held at the Bristol Academy on 19 February. Barrow said he was surprised people thought the band, who won a Mercury Music Prize in 1995 for their debut album Dummy, had split up.\n \n \"We've just had our heads down really, we've never actually broken up, or parted, or whatever. \"So for us it just seems, even though we haven't played for years, we still see each other and write - we just haven't released a record for a long time.\" Portishead will not play any new material at next month's concert, which will feature singer Beth Gibbons playing with an acoustic backing. Other acts appearing include Liverpool band The Coral and former Led Zeppelin singer Robert Plant. Portishead became an international success and a deeply influential band despite their scant recorded output. Dummy was a critics' favourite in 1994, hailed for its blend of menacing sounds and hip-hop beats married to old soul samples. The follow up, Portishead, was released three years later.\n", "llama3.2:1b": "Portishead are writing their third album after an eight-year hiatus. They were previously confirmed to play a tsunami charity show in February alongside Massive Attack. Despite never officially breaking up, the band members had been working on new material, and it seems they have finally completed it. The group will not perform any new music at the concert, which also features singer Beth Gibbons playing an acoustic set with a backing.", "llama3.2:3b": "Portishead are writing their third album after an eight-year hiatus. Founding member Geoff Barrow confirmed the project is well underway, stating the band never officially broke up. They will play a charity show in February alongside Massive Attack and other notable acts, with Beth Gibbons performing acoustic.", "gemma2:2b": "Portishead is working on their third album after an eight-year break. They will play a charity show in February featuring singer Beth Gibbons and other acts.  The band has been active writing music but hasn't released new material for several years. \n", "qwen2.5:0.5b": "Portishead, a British rock band, revealed they will be releasing their third album after eight years. They had previously announced that they would continue with the project but not at any speed. Their current work includes writing another album and playing a charity show in Bristol next month. The group has played with several acts including singer Beth Gibbons and former Led Zeppelin singer Robert Plant, who will be appearing on stage alongside them.", "qwen2.5:1.5b": "Portishead will release their third album soon after completing it during the Christmas break. They are playing a charity show with Massive Attack alongside other acts including Beth Gibbons on acoustic guitar and Robert Plant. The band's long-term friendship has kept them active even without any new releases for eight years, but they plan to perform next month's concert. Portishead is an influential synth-pop trio that gained international fame despite their limited album output.", "qwen2.5:3b": "Portishead have announced they are writing their third album after an eight-year hiatus. Founding member Geoff Barrow revealed the record is nearly complete, having taken a Christmas break but continuing work generally. The band has been confirmed to perform at a charity show in February alongside Massive Attack and other acts like The Coral and Robert Plant. Despite not releasing new music, Portishead gained international acclaim for their debut \"Dummy\" which won a Mercury Music Prize in 1995. Their follow-up album was released three years later.", "opencoder:1.5b": "The British group Portishead have revealed they are writing their third album, which was their first for eight years.\nAfter the release of the album, Geoff Barrow told BBC 6 Music that they were well on the way to being completed and excited about the outcome. They were surprised people thought the band had split up due to the lack of new material released. Portishead did not play any new material at next month's concert, which will feature singer Beth Gibbons playing with an acoustic backing.\nOther acts appearing include Liverpool band The Coral and former Led Zeppelin singer Robert Plant. Portishead became an international success and a profound influence due to their limited record output. Dummy was acclaimed for its combination of mesmerizing sounds and upbeat beats, even though they have not released new material in over a decade.\n", "smollm:1.7b": "Portishead have revealed they are writing their third album, their first in eight years.", "deepseek-r1:1.5b": "<think>\nOkay, so the user has given me this text about Portishead's new album. They want a concise summary that preserves key ideas and details. Hmm, let me break it down.\n\nFirst, I need to identify the main points. The article starts by saying that Portishead, who had just started their third album in eight years, is now working on their first since 1995. That's an important detail about their progression.\n\nThen, there's a segment where Geoff Barrow talks to BBC. He mentions they're on track and have been busy because of Christmas, but they're still writing the record. He even hints that people thought they were splitting up just for the charity show at Oxfam. That adds some context about their success despite not releasing much yet.\n\nNext, Portishead's lineup for the concert: Beth Gibbons will perform solo, and there are other bands like The Coral and Robert Plant. They're celebrating with a special set of tracks featuring Gibbons on acoustic. This sets up the event nicely.\n\nThey mention that they've become an international success despite their sparse output. Dummy was a hit in 1994, so Portishead being released three years later is significant. Also, Barrow says they've been into each other since they started writing, which shows they're not just playing together without anything personal.\n\nAlright, putting it all together, I need to condense this information into a clear summary without any extra fluff. Make sure to include key details like the album's timing, their signing off on the record, the charity show, lineup, and the band's international success.\n</think>\n\nPortishead is set to release their first album in eight years, following their third album from 1995. Geoff Barrow confirms the record is on track and has been busy due to Christmas, but it's still under development. Meanwhile, they will perform at Oxfam's Tsumani appeal at Bristol Academy, featuring Beth Gibbons soloing alongside acoustic backing, alongside The Coral and former Led Zeppelin singer Robert Plant. Despite their sparse output, Portishead is an international success, with their debut album being a hit and the follow-up album just three years later.", "tinyllama:1.1b": "Portishead has announced their third album, which is well on the way to completion, and they're set to play a charity show with fellow Bristol band Massive Attack in February. The band's members were surprised that they had remained active, and Barrow revealed that they are still writing for their upcoming release. Despite being known for their groundbreaking debut album, the band has not played any new material at their Tsunami charity show, featuring Beth Gibbons from The Coral as an acoustic backing. Other acts appearing include Robert Plant, who is performing with The Coral and Led Zeppelin singer Jimmy Page. Portishead's album will be out in a few years after the charity show, which has been dubbed \"tsuna-shen\", or time of sun.", "tinydolphin:1.1b": " Portishead has announced their third album is almost complete, following an eight-year hiatus from the music scene. Founding member Geoff Barrow revealed they have been focusing on writing for the upcoming project, their first in eight years. The band will release another record under BBC 6 Music, adding to their previous successes like Dummy and Portishead. Portishead will perform a charity show in Bristol next month alongside Massive Attack and other Bristoli-based bands.", "phi:2.7b": " Portishead is writing their third album after eight years, with Geoff Barrow stating they are already into it. They will play a charity show in February with Massive Attack and will not perform new material.\n", "orca-mini:3b": " British group Portishead have announced they are writing their third album after eight years. They revealed they are currently into it and will release the record soon. The band, who won a Mercury Music Prize in 1995 for their debut album Dummy, has not released any new material in a long time. Their concert at Oxfam's Tsumani appeal in Bristol on February 19, 2022, will feature singer Beth Gibbons playing with an acoustic backing. Other acts appearing include Liverpool band The Coral and former Led Zeppelin singer Robert Plant. Portishead's music has been highly influential despite their scant recorded output.", "hermes3:3b": "Portishead return after 8-year hiatus, working on third album.", "stablelm-zephyr:3b": "Cult British group Portishead is working on their third album, eight years after releasing their debut album, Dummy, which won a Mercury Music Prize in 1995. Geoff Barrow confirmed to BBC 6 Music that they are close to completing the record and will play a tsunami charity show with fellow Bristol band Massive Attack next month. Despite not playing live for many years, the members of Portishead continue to write together and are releasing new material soon.", "chatgpt-4o-latest": "Portishead is working on their third album, their first in eight years, according to founding member Geoff Barrow. Despite rumors, the band never split up but took time away from releasing music. They will perform at a tsunami charity concert in Bristol on February 19 alongside Massive Attack, though they will not debut new material. The event will also feature The Coral and Robert Plant. Portishead gained international acclaim with their 1994 debut album Dummy and its follow-up in 1997, despite their limited discography.", "stablelm2:1.6b": "Portishead, a British cult group, is writing their third album after eight years without a release. Founding member Geoff Barrow said the record is \"well on the way to being completed\" and that they have not split up despite never having released an album for a long time. Portishead will play at a tsunami charity show with other bands like The Coral and Beth Gibbons, who will perform acoustic backing. Their previous albums, Dummy (Mercury Music Prize) and Portishead, were influential in blending menacing sounds with hip-hop beats and old soul samples.", "granite3.1-dense:2b": "Portishead, the renowned British group known for their critically acclaimed 1994 album \"Dummy,\" which won a Mercury Music Prize, are preparing to release their third album after an eight-year hiatus. Founding member Geoff Barrow confirmed to BBC 6 Music that the band has been actively working on the record, taking only temporary time off for Christmas. Portishead will collaborate with Massive Attack at Oxfam's Tsunami appeal concert on February 19 at the Bristol Academy, performing acoustic sets and featuring singer Beth Gibbons. Despite their absence from the music scene for over a decade, Portishead remains intact, writing new material while not releasing it. Their influential blend of menacing sounds, hip-hop beats, and old soul samples has solidified their status as an international success story.", "reference": "Barrow said he was surprised people thought the band, who won a Mercury Music Prize in 1995 for their debut album Dummy, had split up.The follow up, Portishead, was released three years later.Portishead will play alongside fellow Bristol band Massive Attack at Oxfam's Tsumani appeal, held at the Bristol Academy on 19 February.News of their album plans comes after confirmation the Bristol band will play a tsunami charity show next month.Founding member Geoff Barrow told BBC 6 Music the record was well on the way to being completed.Portishead became an international success and a deeply influential band despite their scant recorded output."}