{"raw_text": "Fightstar take to the stage\n \n Charlie Simpson took his new band Fightstar to the stage on Friday night, just hours after officially announcing his departure from pop band Busted.\n \n He was greeted by a sell-out crowd at the University of Warwick. Confirmation of Busted's long-rumoured split had come earlier in the day, when Simpson held a press conference in London with bandmates Matt Willis and James Bourne. All three band members stressed that the break up was amicable, although Bourne admitted he was \"devastated\" to hear of Simpson's departure. \"This has been a really difficult decision,\" 19-year-old Simpson revealed, \"I hope the fans will understand.\"\n \n While Simpson declared he would look back with pride on Busted's enormous success, his focus turned immediately to Fightstar, with Friday's press conference coinciding with the start of the band's 13-date tour of the UK. Fuelled by this news, all 1,400 tickets to see Charlie's first post-Busted live appearance - at the University of Warwick's Student Union - sold out rapidly. Mike Eccleshall, the venue's Promotions Coordinator, said: \"Tickets had been selling strongly over the past few days, but sales went mad after the news broke. We had completely sold out by 4pm.\"\n \n With queues outside the venue long and expectations high, the pressure was on Fightstar to impress. Although many dedicated fans travelled to the gig from around the country, they faced a tough crowd made up chiefly of students, the average age of the audience far exceeding that of any Busted concert. Gone were the screaming girls to which Simpson had become accustomed. Support act Brigade, fronted by Simpson's brother, played a short set first and were met with general approval. When Fightstar eventually took to the stage around 11pm, however, a riotous cheer easily drowned out any hecklers lurking in the crowd.\n \n Unfortunately, the band were initially hindered by technical teething problems as Simpson's guitar amplifier failed to work. As sound technicians rushed to fix it, other band members did their best to improvise. When they eventually got under way, Fightstar's blend of emotionally charged rock was warmly received. Far heavier and less commercial than Busted's chart-topping pop-punk, the band will undoubtedly appeal to a more mature fan-base. Warwick student Helen Clutterbuck admitted: \"I came to check out Fightstar because of all the controversy. \"I've never heard them before, but I'm pretty impressed.\" Less impressed were fellow students Ryan Crabbe and Gordon Rennie, who observed, \"With Fightstar, Charlie has clearly progressed from Busted's sound, but they're still not very inspiring.\" Fightstar played for around 45 minutes, showcasing material from their forthcoming EP called They Liked You Better When You Were Dead, due for release in February.\n", "llama3.2:1b": "Charlie Simpson took his band Fightstar to the stage on Friday night after announcing his departure from Busted. The crowd was sold out at the University of Warwick, with fans facing a tough student-only audience. Fightstar played to a smaller but still enthusiastic crowd, who were initially disappointed by technical issues with Simpson's guitar amplifier. Despite these problems, the band delivered an emotionally charged rock set that received positive reviews from some fans and criticism from others.", "llama3.2:3b": "Charlie Simpson announced his departure from Busted and took the stage with new band Fightstar at the University of Warwick, selling out all 1,400 tickets. The show was marred by technical issues but eventually played a successful 45-minute set showcasing their EP material, receiving warm reception from fans.", "gemma2:2b": "Charlie Simpson announced his departure from Busted and formed the band Fightstar, which immediately went on tour.  The first show sold out with a crowd of mainly students excited by his new project. Despite some technical issues during the performance, Fightstar's heavier rock style was well-received by many attendees, who enjoyed hearing their original material and felt that they had progressed from Busted's pop-punk sound. \n", "qwen2.5:0.5b": "On Friday, Charlie Simpson announced his departure from pop band Busted and joined Fightstar to perform at a university venue. Despite initial concerns about the split, many attendees enjoyed Fighting Starr's blend of emotionally charged rock while still remaining supportive of the band after losing their beloved Busted lineup.", "qwen2.5:1.5b": "Charlie Simpson, ex-Busted guitarist, takes Fightstar to the University of Warwick stage after Busted's split announcement, achieving a sell-out gig despite challenges, leading to an enthusiastic audience reaction and positive reception from new fans.", "qwen2.5:3b": "Charlie Simpson took his new band Fightstar to the stage after officially announcing he was leaving pop band Busted. The press conference coincided with a sold-out UK tour and included details of an amicable breakup but still emotional split from the band's members. Tickets sold out quickly for Simpson’s first post-Busted live performance at the University of Warwick, where students formed the main audience. Technical issues initially hindered Fightstar, but they gained momentum with their heavier rock sound appealing to a more mature fan base. The band played emotionally charged material from their upcoming EP \"They Liked You Better When You Were Dead,\" scheduled for release in February.", "opencoder:1.5b": "Fightstar took the stage on Friday night just hours after officially announcing his departure from Busted's pop band. Charlie Simpson held a press conference in London with fans who included Matt Willis and James Bourne, which stressed the amicable decision made by the bandmates. The break up was a tough decision for both of them, but it was a challenging one as well. The loss of the group made it hard for fans to understand how the show went. Despite the news, the fans were just starting to feel the excitement. After that, Fightstar played with enthusiasm and exceeded expectations. With the start of the tour, the venue's Promotions Coordinator said: \"Tickets had been selling strongly over the past few days. But sales went mad after the news broke. We had completely sold out by 4pm.\"\nThe crowd was so loud, it got hard to impress. However, with the right audience, they were able to overcome this situation and Fightstar showed off his enormous success on Busted's tour. The band has seen an incredible return for fans who watched it at University of Warwick's Student Union. Despite being a huge success, many dedicated fans have not been able to appreciate the music. They’ve also had to deal with technical issues that made it difficult to hear the music.\nWith all 1,400 tickets sold out and the show starting around 11pm, there was a major crowd in the venue. This caused the show to get more heated and eventually ran into a situation where the music had to be replaced, which has caused the band to lose fans.\nThe fans who watched the tour had already started feeling the loss of fans. However, they were only starting to understand why the band loved to watch it. They’ve also seen it on several different platforms with the same results.\nFightstar's EP, They Liked You Better When You Were Dead, due for release in February, has been a popular show for fans who enjoyed watching it. It is a more mature fan base version of Busted’s pop-punk and can appeal to a younger demographic.\n", "smollm:1.7b": "Fightstar take to the stage with a sell-out crowd at the University of Warwick on Friday night, just hours after officially announcing his departure from pop band Busted. Charlie Simpson took his new band Fightstar to the stage on Friday night, confirming that he would look back with pride on Busted's long-rumoured split had come earlier in the day when Simpson held a press conference in London with Matt Willis and James Bourne. Confirmation of Busted's break up from pop band Busted had come earlier in the day when Simpson held a press conference in London with Matt Willis and James Bourne, all three band members stressing that the break up was amicable.\n\nConfirmation of Busted's long-rumoured split from pop band Busted had come earlier in the day when Simpson held a press conference in London with Matt Willis and James Bourne. All three band members stressed that the break up was amicable, although Bourne admitted he was \"devastated\" to hear of Simpson's departure from Fightstar.\n\nWith queues outside the venue long and expectations high, the pressure was on Fightstar to impress. Although many dedicated fans travel to the gig from around the country, they faced a tough crowd made up chiefly of students, the average age of the audience far exceeding that of any Busted concert. Gone were the screaming girls to which Simpson had become accustomed. Support act Brigade, fronted by Simpson's brother, played a short set first and were met with general approval. When Fightstar eventually got under way, Fightstar's blend of emotionally charged rock was warmly received.\n\nUnfortunately, the band were initially hindered by technical teething problems as Simpson's guitar amplifier failed to work. As sound technicians rushed to fix it, other band members did their best to improvise. When they finally got under way, Fightstar's show was a sell-out, showcasing material from their forthcoming EP called They Liked You Better When You Were Dead, due for release in February.\n\nFightstar played for around 45 minutes, showcasing material from their forthcoming EP called They Liked You Better When You Were Dead, due for release in February.", "deepseek-r1:1.5b": "<think>\nOkay, so the user has given me a query where I need to summarize a specific text about Fightstar's performance at the University of Warwick. The output should be concise and only include the summary without any explanations or formatting.\n\nFirst, I'll read through the provided text carefully to identify the key points. The main events are Simpson taking Busted apart, then moving on to Fightstar with a successful tour promotion. There are specific details about the crowd, technical issues, the reaction from students, and how the band was received despite technical problems.\n\nI need to make sure I capture all these elements accurately but in a more succinct way. The user wants just the summary, so I should avoid any extra fluff or explanations. It's also important that it's only plain text without any markdown or reasoning involved.\n\nLet me break it down:\n\n1. Simpson took his band to the stage.\n2. He was greeted by an sell-out crowd at Warwick.\n3. Confirmation of Busted's split happened in London with Simpson in a press conference.\n4. Simpson revealed he left Busted.\n5. The decision was amicable but distressing for some.\n6. Simpson plans to tour Britain, and tickets sold out quickly.\n7. Despite technical issues, the band performed well and caused queues.\n\nI should combine these points into a coherent summary without going into too much detail. Make sure it's clear and flows well. I'll start with Simpson taking the stage, mention the crowd reaction, Simpson's announcement of the split, and then his tour plans. Also, highlight the technical issues but keep it general.\n\nDouble-checking for any specific details that might be important or omitted in the summary. The part about the EP release and the students' opinions should be included to give a complete picture without missing key points.\n</think>\n\nCharlie Simpson took his new band Fightstar to the stage on Friday night, following his departure from Busted after a long tenure as a pop band member. He was greeted by a sell-out crowd at the University of Warwick, where the band's split with Busted had already been confirmed earlier that day. Simpson highlighted the break-up as amicable but distressing for some fans, while he acknowledged his brother Jim who will front a support act alongside Simpson. The tour plans include a 13-date UK tour starting Friday night, coinciding with Fightstar's first live performance at the University of Warwick's Student Union. Despite selling-out all 1,400 tickets within hours of the announcement, the venue quickly reached capacity by 4pm due to strong demand from dedicated fans and the diverse age group of the audience. However, a mixed reaction was expected as students represented by many had been missing during Busted performances, while the support act provided mixed reviews. Simpson's live performance saw a lively crowd with cheers and a mix of electric rock and emotional backing tracks, which quickly captured the attention of attendees. The band's EP 'They Liked You Better When You Were Dead' is expected to appeal to fans of mature music, but their technical issues may have delayed some hits during the tour.", "tinyllama:1.1b": "Fightstar, a new band consisting of Charlie Simpson and his former band Busted, took to the stage at Warwick University on Friday night amid heavy technical difficulties. Despite these challenges, the audience was able to appreciate the band's emotional blend of rock-based music that drew in fans from all walks of life. The band played for an hour and showcased their forthcoming EP called \"They Liked You Better When You Weren't Dead,\" which will be released on February 2nd. Simpson, who announced his departure from Busted a day before the press conference, explained that the split was mutually amicable, despite the rock band's immense success. Despite technical difficulties, the show was well-received by fans and undoubtedly appealed to a more mature fan-base.", "tinydolphin:1.1b": " On Friday night, Charlie Simpson took to the stage with his new band Fightstar, following a tumultuous split from Busted. The concert was a sell-out at the University of Warwick, with tickets selling out within minutes. The band members, Matt Willis and James Bourne, expressed their relief that the breakup was amicable, adding that they hoped the fans would understand. Charlie declared his love for Busted's massive success while addressing the audience at the press conference. The band's performance was met with excitement, as Fightstar had not been the same without their former lead guitarist and singer. The crowd's enthusiasm was palpable, and they were clearly eager to see what they could expect from the upcoming EP.", "phi:2.7b": " Fightstar's lead singer, Charlie Simpson, announced his departure from the pop band Busted and performed at a sold-out show at the University of Warwick. The band faced technical difficulties but received a warm reception from their audience, who were mostly students. Despite being more mature than Busted, some fans felt that the band's sound was not very inspiring.\n", "orca-mini:3b": " Friday night saw Charlie Simpson take his new band, Fightstar, to the stage at the University of Warwick's Student Union. After officially announcing his departure from pop band Busted earlier in the day, Simpson was greeted by a sell-out crowd. Simpson stressed that the break up was amicable, but expressed disappointment over former bandmate Matt Willis's decision not to join the tour. The band played an EP called \"They Liked You Better When You Were Dead,\" with material from their debut album set to follow. Some fans traveled from around the country to see Fightstar, but the crowd was primarily made up of students and those older than Busted's concert audience. Technical issues initially hindered their sound but the band persevered.", "hermes3:3b": "Fightstar band (w/ Charlie Simpson) performs at sold-out concert at University of Warwick after Busted's split announcement.", "stablelm-zephyr:3b": "Fightstar's debut performance saw lead singer Charlie Simpson depart from his former band Busted to form a new band with the same name. Just hours after officially announcing his departure from Busted, Simpson took his new band Fightstar to the stage at the University of Warwick where they were greeted by a sell-out crowd. The confirmation of Busted's split was announced earlier in the day when Simpson held a press conference in London along with bandmates Matt Willis and James Bourne. They confirmed that the breakup was amicable, though Bourne admitted he was \"devastated\" to hear of Simpson's departure.\n\nFightstar's first live appearance coincided with their 13-date UK tour, which led to a press conference held on the day of the concert. The venue sold all 1,400 tickets for Charlie's first post-Busted live appearance within hours after the news broke. The pressure was high as fans traveled from around the country to attend the gig at the University of Warwick's Student Union. Despite facing a tough crowd mainly made up of students with higher average ages than Busted concerts, Fightstar delivered an emotionally charged rock performance that warmed audiences. Their sound was heavier and less commercial compared to Busted's pop-punk chart-toppers, appealing to a more mature fan base.", "chatgpt-4o-latest": "Charlie Simpson performed with his new band Fightstar on Friday night, just hours after officially announcing his departure from Busted. The announcement was made at a press conference in London, where Simpson and his former bandmates emphasized the amicable nature of the split, though James Bourne admitted he was \"devastated.\" Simpson expressed hope that fans would understand his decision. \n\nFightstar's 13-date UK tour began that same night at the University of Warwick, where all 1,400 tickets sold out quickly following the news. The audience, primarily students rather than Busted's usual teenage fanbase, had high expectations. Support act Brigade, led by Simpson's brother, received a positive response before Fightstar took the stage to a mix of cheers and some heckling. \n\nTechnical difficulties delayed the start of their set, but once resolved, Fightstar's heavier, more mature rock sound was well received by many, though some students remained unimpressed. The band played for 45 minutes, performing songs from their upcoming EP, *They Liked You Better When You Were Dead*, set for release in February.", "stablelm2:1.6b": "Fightstar band members took the stage at a sell-out event in the University of Warwick after announcing Simpson's departure from pop band Busted. The tour sold out with rapid ticket sales following the news, and despite being a tough crowd, Fightstar received warm reception. Technical problems initially hindered their performance, but they eventually impressed the audience with emotionally charged rock music that appealed to a more mature fan-base.", "granite3.1-dense:2b": "On Friday night, Charlie Simpson, the frontman of the newly formed band Fightstar, performed his first post-Busted concert at the University of Warwick's Student Union. The event was a sell-out, with 1,400 tickets sold out rapidly following Simpson's press conference announcing Busted's split, an amicable decision that left bandmate James Bourne \"devastated.\" The crowd, primarily students younger than those who attended Busted concerts, was enthusiastic but different in demographic. Fightstar's set, initially delayed due to technical issues with Simpson's guitar amplifier, showcased their heavier, less commercial rock style compared to Busted's pop-punk. The band received warm reception despite hecklers, and their performance highlighted their evolution from Simpson's previous project.", "reference": "Charlie Simpson took his new band Fightstar to the stage on Friday night, just hours after officially announcing his departure from pop band Busted.All three band members stressed that the break up was amicable, although Bourne admitted he was \"devastated\" to hear of Simpson's departure.When Fightstar eventually took to the stage around 11pm, however, a riotous cheer easily drowned out any hecklers lurking in the crowd.Less impressed were fellow students Ryan Crabbe and Gordon Rennie, who observed, \"With Fightstar, Charlie has clearly progressed from Busted's sound, but they're still not very inspiring.\"He was greeted by a sell-out crowd at the University of Warwick.Warwick student Helen Clutterbuck admitted: \"I came to check out Fightstar because of all the controversy.While Simpson declared he would look back with pride on Busted's enormous success, his focus turned immediately to Fightstar, with Friday's press conference coinciding with the start of the band's 13-date tour of the UK.With queues outside the venue long and expectations high, the pressure was on Fightstar to impress.Fuelled by this news, all 1,400 tickets to see Charlie's first post-Busted live appearance - at the University of Warwick's Student Union - sold out rapidly."}