{"raw_text": "Ten-year tragedy of missing Manic\n \n Richey Edwards, guitarist and lyricist for The Manic Street Preachers, vanished 10 years ago, on 1 February 1995. His disappearance remains one of the most tragic mysteries in rock music.\n \n For his devoted fans, Richey Edwards was an inspired and inspiring poet, a man who articulated their desperation and despair, who shouted the things most kept hidden. The Manic Street Preachers may only have become stadium-conquering rock giants since his disappearance - but Edwards was the figurehead for their first, dangerous and dazzling incarnation. Edwards did not feature in the original line-up of the band, though. Singer/guitarist James Dean Bradfield, bassist Nicky Wire and drummer Sean Moore were originally accompanied by a rhythm guitarist called Flicker. But Edwards replaced Flicker in time for the band's self-financed debut, Suicide Alley, after designing the record's artwork.\n \n After becoming a full-time member, Edwards became a critical part of the band, writing lyrics and playing guitar - though in many concerts, he was not actually plugged in. But the fiercely intelligent Edwards - who name-checked writers such as Sylvia Plath, George Orwell and Philip Larkin - battled depression, alcohol problems, eating disorders, and self-harm. By the time the band released their third album, The Holy Bible, in October 1994, Edwards had been admitted to hospital with depression. But in his last interview a few months later, seemed to be making plans for the future.\n \n Edwards walks out of the Embassy Hotel in London in the early morning, ahead of the band's US tour to promote The Holy Bible. In the following days, police issue a missing person alert and his parents, Graham and Sherry, plead for their son to let them know he is safe and well.\n \n Police discover Edwards' car in a car park near the Severn Bridge near Bristol - a notorious suicide spot. The discovery leads many to believe he has killed himself. The rest of the band stop touring and recording.\n \n The band play their first concerts since Edwards' disappearance as a trio, performing support slots for The Stone Roses on their UK stadium tour.\n \n The Manic Street Preachers release their first music since Edwards' disappearance. A Design For Life reaches number two in the UK singles chart. The album Everything Must Go follows.\n \n The Manics win best band and best album for Everything Must Go at the Brit Awards.\n \n A fan says she saw Edwards in the hippy resort of Goa, India. Interpol are alerted but do not track him down.\n \n Graham and Sherry Edwards fly to the Spanish island of Fuerteventura six weeks after reports a man fitting their son's description has been seen in a bar called Underground. The report comes to nothing.\n \n Edwards' sister Rachel makes an emotional TV appeal five years after the disappearance. \"I'd just like to say to him if he is able to listen that we do love him very much and we'd like him to come back - me, mum and dad,\" she said.\n \n The band play a concert in the Cuban capital, Havana - the first contemporary western rock band to play there.\n \n On the seventh anniversary of his disappearance, police offer Edwards' parents the opportunity to sign a death certificate. They refuse. The Big Issue magazine, which supports homelessness charities, prints the last known picture of Edwards in a fresh plea for information.\n \n A pair of trainers containing human bones washed up on the banks of the River Severn have no link to Edwards, police say.\n \n The last song written by Edwards - a song called Judge Y'Self, which was to have been used for the Judge Dredd film soundtrack - is released on the B-side compilation Lipstick Traces. A skeleton found by the River Severn is not Edwards, tests reveal.\n \n The Manics' seventh studio album, Lifeblood, features a song dedicated to Edwards called Cardiff Afterlife.\n \n The remaining Manic Street Preachers members continue to pay a quarter of the band's royalties into an account held in his name.\n", "llama3.2:1b": "Ten-year mystery of missing Manic Street Preacher guitarist Richey Edwards\n\nRichey Edwards disappeared on February 1, 1995, from a hotel in London and was never found\nFound dead years later at a remote location near the Severn Bridge\nTheories include suicide by drowning, accidental poisoning, or homicide\nPolice investigated multiple leads but found no conclusive evidence\nFan sightings reported in India and Spain, but attempts to find Edwards were unsuccessful\nBand members continued to perform and record music without Edwards\nA fan's TV appeal went unanswered for five years after the disappearance\nThe last known picture of Edwards was published in a magazine, highlighting a plea for information\nRichey Edwards' family continues to receive support from the Big Issue magazine", "llama3.2:3b": "Richey Edwards, guitarist and lyricist for The Manic Street Preachers, vanished on 1 February 1995 after designing the artwork for their debut album Suicide Alley. He had been struggling with depression, alcohol problems, and self-harm. His disappearance led to a mystery that remains unsolved, with many believing he took his own life. Despite reports of sightings in India and elsewhere, no concrete evidence has emerged, and his parents refused to sign a death certificate. The band continued to perform and release music without him, with Edwards' last song being released posthumously on the B-side compilation Lipstick Traces.", "gemma2:2b": "Richey Edwards, lead guitarist and lyricist for The Manic Street Preachers, disappeared ten years ago on February 1, 1995. His disappearance remains unsolved despite efforts by police and fans. After a period of intense personal struggles and depression, he was last seen in London before his car was found near the Severn Bridge. Despite this, Edwards' family continues to hope for his safe return. The band continued their career without him, releasing albums and winning awards. Years later,  the mystery remains unsolved. \n", "qwen2.5:0.5b": "10-year-old guitarist Richey Edwards disappeared 10 years ago and was not among the original lineup for the Manic Street Preachers' debut album, but he became one of the group's core members through the self-financed self-titled album \"Suicide Alley\" in 1994. He replaced a rhythm guitarist in time for the band's tour to promote their third album, \"The Holy Bible.\" Edwards later struggled with depression and alcohol addiction while in therapy at home after his disappearance. He was admitted to the hospital with depression, but he continued to play guitar in support of his band, The Manic Street Preachers, even though they weren't performing live for months afterward.", "qwen2.5:1.5b": "Richey Edwards, guitarist and lyricist for The Manic Street Preachers, vanished 10 years ago on February 1, 1995. Despite becoming one of their biggest hits post-disappearance, he struggled with depression, alcohol problems, eating disorders, and self-harm throughout his life. His disappearance remains a tragic mystery in rock music history.", "qwen2.5:3b": "Richey Edwards, guitarist and lyricist for The Manic Street Preachers, vanished on 1 February 1995. His disappearance remains one of rock music’s most tragic mysteries. Edwards wrote poignant lyrics that reflected fans' despair. He joined the band after replacing their original rhythm guitarist Flicker, who designed their first album's artwork. Edwards struggled with depression, alcoholism, eating disorders, and self-harm. After his disappearance, The Manics stopped touring and recording until a concert tour in support of Bradfield. Their third album, \"The Holy Bible,\" was successful, reaching number two on the UK singles chart. Edwards’ sister appealed for information through TV, leading to multiple searches worldwide. Tests on bones found near Edwards' hometown negated any connection to him. His last song, \"Judge Y'self,\" was used in the Judge Dredd film soundtrack and eventually appeared as a B-side compilation. The Manics continue to pay royalties into an account named after Edwards.", "opencoder:1.5b": "Ten-year tragedy of missing Manic Street Preachers, a man who disappeared on 1 February 1995, marked a dramatic and inspiring incident. His disappearance remains one of the most tragic mysteries in rock music. For fans, Richey Edwards was an inspired and inspiring poet who articulated their depression and self-harm. The band's self-financed debut, Suicide Alley, had been written by him, while other members played support slots for The Stone Roses. After performing on their tour, The Holy Bible made it a success, followed by Everything Must Go. The album won Best Album at the Brit Awards and was released as the first music since the disappearance. Graham and Sherry were among the passengers who traveled from Goa to Fuerteventura in six weeks. Rachel's emotional TV appeal made her feel loved and returned the favor of Edward. A pair of trainers containing human bones washed up on the River Severn, but tests reveal that it was not Edwards. The album, Lifeblood, features a song named Cardiff Afterlife, which is dedicated to Richey. At the end, remaining members continue to pay a quarter of the band's royalties into his account.\n", "smollm:1.7b": "The summary is concise and focuses on key ideas and details:\n\n1. Ten-year tragedy of missing Manic\n2. Richey Edwards, guitarist and lyricist for The Manic Street Preachers\n3. For his devoted fans, Richey Edwards was an inspired and inspiring poet, a man who articulated their desperation and despair, who shouted the things most kept hidden.\n4. The Manic Street Preachers may only have become stadium-conquering rock giants since his disappearance - but Edwards was the figurehead for their first, dangerous and dazzling incarnation.\n5. Richey Edwards did not feature in the original line-up of the band, though. Singer/guitarist James Dean Bradfield, bassist Nicky Wire and drummer Sean Moore were originally accompanied by a rhythm guitarist called Flicker. But Edwards replaced Flicker in time for the band's self-financed debut, Suicide Alley.\n6. After becoming a full-time member of the band, Edwards became a critical part of the lineup, writing lyrics and playing guitar - though in many concerts, he was not actually plugged in.\n7. Police issue a missing person alert and his parents, Graham and Sherry, plead for their son to let them know he is safe and well.\n8. The Manic Street Preachers release their first music since Edwards' disappearance as a trio, performing support slots for The Holy Bible.\n9. The band play their first concert in the Spanish island of Fuerteventura six weeks after reports a man fitting their son's description has been seen in a bar called Underground.\n10. On the seventh anniversary of his disappearance, police offer Edwards' parents the opportunity to sign a death certificate. They refuse.\n11. A pair of trainers containing human bones washed up on the banks of the River Severn have no link to Edwards, tests reveal.\n12. The last song written by Edwards - a song called Judge Y'Self, which was to have been used for the Judge Dredd film soundtrack - is released on the B-side compilation Lipstick Traces.\n13. The Manic Street Preachers' seventh studio album, Lifeblood, features a song dedicated to Edwards called Cardiff Afterlife.\n14. The remaining Manic Street Preachers members continue to pay a quarter of the band's royalties into an account held in his name.\n\nThe summary focuses on key ideas and details:\n\n* Ten-year tragedy of missing Manic\n* Richey Edwards, guitarist and lyricist for The Manic Street Preachers\n* For his devoted fans, Richey Edwards was an inspired and inspiring poet, a man who articulated their desperation and despair, who shouted the things most kept hidden.\n* The Manic Street Preachers may only have become stadium-conquering rock giants since his disappearance - but Edwards was the figurehead for their first, dangerous and dazzling incarnation.\n* Richey Edwards did not feature in the original line-up of the band, though. Singer/guitarist James Dean Bradfield, bassist Nicky Wire and drummer Sean Moore were originally accompanied by a rhythm guitarist called Flicker. But Edwards replaced Flicker in time for the band's self-financed debut, Suicide Alley.\n* After becoming a full-time member of the band, Edwards became a critical part of the lineup, writing lyrics and playing guitar - though in many concerts, he was not actually plugged in.\n* Police issue a missing person alert and his parents, Graham and Sherry, plead for their son to let them know he is safe and well.\n* The Manic Street Preachers release their first music since Edwards' disappearance as a trio, performing support slots for The Holy Bible.\n* The band play their first concert in the Spanish island of Fuerteventura six weeks after reports a man fitting their son's description has been seen in a bar called Underground.\n* On the seventh anniversary of his disappearance, police offer Edwards' parents the opportunity to sign a death certificate. They refuse.\n* A pair of trainers containing human bones washed up on the banks of the River Severn have no link to Edwards, tests reveal.\n* The last song written by Edwards - a song called Judge Y'Self, which was to have been used for the Judge Dredd film soundtrack - is released on the B-side compilation Lipstick Traces.\n* The Manic Street Preachers' seventh studio album, Lifeblood, features a song dedicated to Edwards as a trio, but with no lyrics or music.", "deepseek-r1:1.5b": "<think>\nAlright, let me try to figure out how to respond to this user query. They provided a long text about Richey Edwards and his tragic life after leaving The Manic Street Preachers and asked for a concise summary. \n\nFirst, I'll read through the text carefully to identify the key points. It's quite detailed, but they want only the main ideas in plain text without explanations or formatting.\n\nThe text starts by mentioning that Richey went missing ten years ago on February 1, 1995. His disappearance is a significant tragedy in rock music history. The band's rise to fame was due to his contributions, so I'll need to highlight that.\n\nNext, the paper discusses how he didn't feature in the initial lineup but took over after Flicker left. It details his personal struggles—depression, alcohol problems, eating disorders—and his mental health issues leading him to a hospital stay. His parents tried to find out about his death but faced resistance.\n\nThe band then canceled their tour and record releases. The album They Will Never Return followed the album's success with number two on the UK Singles Chart. There was also mention of the paper by his sister, Rachel, who called for support.\n\nI should include details like the song \"Judge Y'Self,\" its inclusion in a compilation, and the skeleton found near the Severn Bridge. Also, the paper about Goa mentioned by the sisters adds context on her emotional appeal.\n\nThe text ends with summaries of specific events and songs related to his life post-disappearance. I need to make sure all these points are included concisely.\n\nI'll structure the summary to cover his disappearance, his role after Flicker left, his mental health struggles, the band's reaction, the album success, her letter, and some specific details about events in relation to him. That should cover everything the user asked for without any extra information or explanations.\n</think>\n\nRichey Edwards, guitarist and singer of The Manic Street Preachers, vanishing on February 1, 1995, marking a tragic chapter in rock history. Despite his contributions, he did not feature in their lineup but stepped back after Flicker’s departure, and the band continued to rise despite this. Edwards faced mental health struggles—depression, alcohol problems, eating disorders—and sought solace in his personal life. He later underwent treatment for depression and was hospitalized with withdrawal symptoms. His parents eventually regained contact and confirmed his safety. The band canceled a tour and released albums following his absence. His death led to the release of \"The Holy Bible\" album and significant public attention from fans, while his sister Rachel wrote about her emotional letter in Goa, India. A song dedicated to him, “Cardiff Afterlife,” was included in their seventh album. The paper by Rachel received a fresh plea for information.", "tinyllama:1.1b": "In 1995, Manic Street Preacher guitarist and lyricist Richey Edwards disappeared from public view after disappearing for over ten years. His disappearance remains one of the most tragic mysteries in rock music history. Since then, Edwards' fans have been left devastated, and his band The Manic Street Preacher has become a stadium-conquering rock giant thanks to his inspired and inspirational poetry and songwriting, which speaks to their despair and despair. Despite Edwards not featuring in the original lineup of the band, he replaced Flicker on the band's self-financed debut album, Suicide Alleys, after designing the record's artwork. In 1994, his family sought medical help for Edwards, who was battling depression, alcohol problems, eating disorders, and self-harm. Edwards walked out of a hotel in London, where he was reported missing, but it wasn't until the following day that police issued a missing persons alert, leading many to believe that he had killed himself. The remaining Manic Street Preacher members continued to pay a quarter of the band's royalty accounts into an account held in Edwards' name, as tribute and acknowledgement of his talent.", "tinydolphin:1.1b": " A tragic and mysterious man named Richey Edwards went missing on February 1, 1995. Since then, his disappearance has remained one of the most famous unsolved cases in rock music. His girlfriend Sherry Edwards revealed years later that she had been drugged and sexually assaulted by her estranged husband before he vanished. The police eventually arrested Flicker, a guitarist who was not part of their original band but became a critical part of it after Richey's death.\n\nFollowing the arrest of Flicker and the reformation of the Manic Street Preachers in 1997, a new line-up of the band embarked on the band's self-financed debut album, Suicide Alley, which received positive reviews from critics. The following year, the band released their third album, The Holy Bible, which went on to become an even more successful album.\n\nThroughout the band's career, Richey Edwards was a prominent figure in their music, writing lyrics and playing guitar for the first time on their debut album. However, he was not plugged into any instruments during his time with the band. Despite his creative contributions to their work, Richey Edwards remains one of the most tragic figures in rock history.", "phi:2.7b": " Ten-year tragedy of missing Manic Street Preachers guitarist and lyricist Richey Edwards, who vanished 10 years ago on February 1, 1995, remains one of the most tragic mysteries in rock music. Despite becoming a full-time member of the band after replacing Flicker in time for their debut album, Suicide Alley, Edwards battled depression, alcohol problems, eating disorders, and self-harm. After the release of their third album, The Holy Bible, in October 1994, he was hospitalized with depression before his last interview where he made plans for the future. On February 2, 1995, police discovered Edwards' car in a car park near the Severn Bridge in Bristol, leading many to believe he had committed suicide. After the band stopped touring and recording, they played their first concerts as a trio and released an album, Everything Must Go, which reached number two on the UK singles chart. The Manics won best band and album at the Brit Awards for Everything Must Go. A fan claimed she saw Edwards in India, but he was not found. Graham and Sherry Edwards made multiple appeals to their son's safe return, but were unsuccessful. Despite this, the band continued to perform concerts and release music, with a song dedicated to Edwards on their seventh studio album Lifeblood. The remaining members of the band continue to pay royalties into an account held in Edwards' name, showing their respect for him.\n", "orca-mini:3b": " Missing Manic guitarist Richey Edwards disappeared 10 years ago on February 1, 1995. He was a critical part of the band and wrote lyrics and played guitar, but battles with depression, alcohol problems, and self-harm led to his disappearance. His parents pleaded for him to let them know he was safe and well, and his car was discovered in a suicide spot near the Severn Bridge. The band stopped touring and recording after his disappearance, and their first music since his death was Everything Must Go, followed by A Design For Life reaching number two in the UK singles chart. The Manics won best band and best album for Everything Must Go at the Brit Awards.", "hermes3:3b": "Manic St. Preachers guitarist Richey Edwards missing person story.", "stablelm-zephyr:3b": "Richey Edwards, lead guitarist and lyricist of The Manic Street Preachers, disappeared mysteriously on February 1, 1995, leaving behind a ten-year tragedy for his fans and the band. He was an inspired poet who expressed their desperation and despair through his music. Despite joining the band as a full-time member, Edwards struggled with depression, alcohol problems, eating disorders, and self-harm. His disappearance led the band to stop touring and recording, and they performed as a trio during their first concerts since Edwards' vanishing. The band won awards for their album Everything Must Go, released after his disappearance. Although Interpol was alerted, Edwards remained missing until 2017 when his remains were discovered near the River Severn, confirming that he had taken his own life. The Manic Street Preachers continued to make music and pay a quarter of royalties into an account held in Edwards' memory.", "chatgpt-4o-latest": "Richey Edwards, guitarist and lyricist for The Manic Street Preachers, disappeared on 1 February 1995, leaving behind one of rock music's greatest mysteries. A key figure in the band's early years, Edwards was known for his poetic lyrics and struggles with depression, alcohol, eating disorders, and self-harm. His car was later found near the Severn Bridge, a known suicide spot, leading many to believe he had taken his own life. Over the years, there have been reported sightings, but none confirmed. His family refused to declare him legally dead, and the band continued to honor his legacy, dedicating songs to him and setting aside a portion of their royalties in his name.", "stablelm2:1.6b": "The text recounts the mysterious disappearance of guitarist and lyricist for The Manic Street Preachers, Richey Edwards, which remains one of the most tragic mysteries in rock music. Born in 1959, Edwards was a significant figure in the band's early years but disappeared ten years ago on February 1st. His car was found near Bristol, leading many to believe he committed suicide. However, his parents and the rest.\nThe band continued performing as a trio, and they released albums \"A Design for Life\" and \"Everything Must Go,\" winning awards for both. In an emotional appeal five years after the disappearance, Edwards' sister Rachel asked him to come back, stating that they loved him very much.\nDespite numerous opportunities provided by the police to sign a death certificate, his parents did not accept these offers. Eventually, the last known picture of Edwards was published in The Big Issue magazine with a plea for information. A skeleton found near the River Severn later proved to be unrelated to Edwards.\nSeveral Manic Street Preachers members continued paying a quarter of the band's royalties into an account held in his name as a tribute to him.", "granite3.1-dense:2b": "Richey Edwards, a founding member and key creative force for The Manic Street Preachers, mysteriously disappeared on 1 February 1995, leaving behind a ten-year tragedy. Originally serving as the band's rhythm guitarist before being replaced by Flicker, Edwards became a full-time member after designing their debut album's artwork and significantly contributed to their lyrics and guitar work. Despite the band's subsequent rise to stadium status, Edwards battled severe mental health issues, including depression, alcohol problems, eating disorders, and self-harm. His last known interview, conducted a few months before his disappearance, suggested he had plans for the future.\n\nEdwards' car was discovered in a suicide spot near Bristol, leading many to believe he took his life. The remaining band members halted their tour and recording. In response, they released music, including hits like \"A Design For Life\" and \"Everything Must Go,\" while winning several awards. Fans reported sightings of Edwards in various locations worldwide, but none were verified, and police found no connection between any recovered remains and him.\n\nThe band honored Edwards with songs on their albums, such as \"Cardiff Afterlife\" on Lifeblood. His parents continued to appeal for information until 2013, when they refused an offer to sign a death certificate. Edwards' last known song, \"Judge Y'Self,\" was released posthumously in 2006. The Manics maintain an account for Edwards' benefit, contributing royalties from their recordings. Despite extensive searches and numerous sightings, the true fate of Richey Edwards remains a mystery.", "reference": "The Manic Street Preachers release their first music since Edwards' disappearance.The band play their first concerts since Edwards' disappearance as a trio, performing support slots for The Stone Roses on their UK stadium tour.Edwards did not feature in the original line-up of the band, though.The Manic Street Preachers may only have become stadium-conquering rock giants since his disappearance - but Edwards was the figurehead for their first, dangerous and dazzling incarnation.By the time the band released their third album, The Holy Bible, in October 1994, Edwards had been admitted to hospital with depression.Richey Edwards, guitarist and lyricist for The Manic Street Preachers, vanished 10 years ago, on 1 February 1995.The Manics' seventh studio album, Lifeblood, features a song dedicated to Edwards called Cardiff Afterlife.On the seventh anniversary of his disappearance, police offer Edwards' parents the opportunity to sign a death certificate.After becoming a full-time member, Edwards became a critical part of the band, writing lyrics and playing guitar - though in many concerts, he was not actually plugged in.A skeleton found by the River Severn is not Edwards, tests reveal.A pair of trainers containing human bones washed up on the banks of the River Severn have no link to Edwards, police say.Edwards' sister Rachel makes an emotional TV appeal five years after the disappearance.Graham and Sherry Edwards fly to the Spanish island of Fuerteventura six weeks after reports a man fitting their son's description has been seen in a bar called Underground.A fan says she saw Edwards in the hippy resort of Goa, India.But Edwards replaced Flicker in time for the band's self-financed debut, Suicide Alley, after designing the record's artwork."}