{"raw_text": "Singer Sizzla jailed for swearing\n \n Reggae star Sizzla, whose UK tour was cancelled after protests at his \"anti-gay\" lyrics, has been jailed in Jamaica for swearing on stage.\n \n The singer must serve 15 days in prison after he consistently swore during a concert in St Thomas, Jamaica, in January despite warnings by police. He was charged under a law which prohibits indecent dress or expression. Sizzla's five-date UK tour was cancelled last November after protests by gay rights campaigners.\n \n Sizzla, whose real name is Miguel Collins, has released 25 albums since 1995 and is credited with taking dancehall music back to its reggae origins. Many Jamaican entertainers have appeared before the courts for use of profanity in recent years but they usually receive a verbal warning, a suspended sentence or community service. Sizzla's UK tour was cancelled after Scotland Yard's Racial and Violent Crime taskforce announced it was examining lyrics by eight reggae artists. It would not confirm that Sizzla was among them. One of his most controversial songs, Pump Up, contains the Jamaican patois lyrics \"fire fi di man dem weh go ride man behind\", translated by gay rights group OutRage! as \"burn the men who have sex with men\".\n", "llama3.2:1b": "Singer Sizzla jailed for swearing on stage in Jamaica due to protests over his lyrics. He was charged under a law prohibiting indecent dress or expression and must serve 15 days in prison after consistently swearing during a concert in January despite warnings from police. His five-date UK tour was cancelled in November following similar incidents by other Jamaican entertainers.", "llama3.2:3b": "Reggae star Sizzla was jailed in Jamaica for 15 days for swearing on stage despite police warnings. His UK tour was cancelled due to protests over his \"anti-gay\" lyrics, which were a subject of an investigation by Scotland Yard's Racial and Violent Crime taskforce. Sizzla is known for releasing music that blends dancehall with reggae origins.", "gemma2:2b": "Sizzla has been jailed for 15 days in Jamaica for swearing during a concert despite warnings.  His UK tour was cancelled after protests due to his anti-gay lyrics, and he was charged under a law prohibiting indecent expression. This is not the first time Jamaican entertainers have faced legal action for profanity, but Sizzla's case stands out due to his repeated use of swear words during his performance. \n", "qwen2.5:0.5b": "Reggae singer Sizzla was sentenced to 15 days in jail for swearing during a concert in Jamaica. He had been warned by police, but he still used profanity on stage without permission. His UK tour was canceled after it was revealed that he had sung the \"fire fi di man dem weh go ride man behind\" lyrics from OutRage!", "qwen2.5:1.5b": "Singer Sizzla jailed for swearing during a UK concert in Jamaica. He was charged under a law prohibiting indecent dress or expression, following warnings from police and cancellation of his five-date tour due to protests related to anti-gay lyrics.", "qwen2.5:3b": "Singer Sizzla jailed in Jamaica for 15 days after swearing during a concert despite warnings. Protesters had cancelled his UK tour over alleged anti-gay lyrics. Sizzla, known for reggae music, has been before courts for profanity use; typically receives lesser punishments. His song \"Pump Up\" contains lyrics interpreted as offensive towards gay people by rights groups.", "opencoder:1.5b": "Singer Sizzla was jailed for swearing after he said during a concert in St Thomas, Jamaica, that his anti-gay lyrics were offensive. He served 15 days in prison due to constant swearing at the stage. The charges are under strict supervision provided by a law that prohibits indecent dressing or expressing self on stage.\n", "smollm:1.7b": "Sizzla jailed for swearing. Reggae star Sizzla, whose UK tour was cancelled after protests at his \"anti-gay\" lyrics, has been jailed in Jamaica for swearing on stage. He is charged under a law which prohibits indecent dress or expression. Sizzla's five-date UK tour was cancelled last November after protests by gay rights campaigners.\n\nSizzla, whose real name is Miguel Collins, has released 25 albums since 1995 and is credited with taking dancehall music back to its reggae origins. Many Jamaican entertainers have appeared before the courts for use of profanity in recent years but they usually receive a verbal warning, a suspended sentence or community service. Sizzla's UK tour was cancelled after Scotland Yard's Racial and Violent Crime taskforce announced it was examining lyrics by eight reggae artists. It would not confirm that Sizzla was among them. One of his most controversial songs, Pump Up, contains the Jamaican patois lyrics \"fire fi di man dem weh go ride man behind\", translated by gay rights group OutRage! as \"burn the men who have sex with men\".", "deepseek-r1:1.5b": "<think>\nAlright, let's tackle this query. The user has given a text and wants it summarized into just plain text without any explanations or formatting. So, I need to make sure I capture all the key points.\n\nFirst, I'll read through the provided text carefully. It mentions Sizzla Singer from Reggae who was jailed for swearing in Jamaica. He canceled his UK tour last November after protests by gay rights people. He's been on a tour since 1995, released 25 albums, and links reggae to dancehall.\n\nThe summary should focus on the main points: his jail time, the reasons (protests, police warnings), the duration, and his achievements in reggae. I need to mention his cancelation of tour, the law against swearing, and why some artists are getting warnings but Sizzla's case is under investigation. Also, noting that OutRage! used it with \"burn the men who have sex with men\" as a key part.\n\nI should avoid any additional details beyond what's essential for clarity. Making sure to include all critical elements without going into too much depth unless necessary. Let me structure this in bullet points or list form within the summary, but since the user wants it in plain text without explanations, I'll present it concisely as a single sentence.\n\nI should also ensure that the summary doesn't imply any connection beyond the facts provided. It's important to convey that Sizzla was jailed for swear words despite warnings, highlighting his achievements and the legal implications.\n\nOkay, putting this all together into a clear, concise summary without any fluff.\n</think>\n\nSizzla Singer has been jailed in Jamaica for swearing on stage after canceling his UK tour last November due to protests by gay rights campaigners. He served 15 days in prison for consistent swearing during a concert in St Thomas, Jamaica, despite police warnings. The legal charge stems from a law prohibiting inappropriate dress or expression. His five-date UK tour was canceled due to the same reason, and while many artists face warnings, monetary penalty, or community service, Sizzla's case remains under investigation. He has released 25 albums since 1995 and credited dancehall music with reggae roots. His most controversial song, Pump Up, contains Jamaican lyrics translated by OutRage! into \"burn the men who have sex with men.\"", "tinyllama:1.1b": "Reggae star Sizzla has been jailed in Jamaica for swearing on stage during his concert, despite warnings from police. He was charged under a law which prohibits indecent dress or expression and had his UK tour cancelled after protests by gay rights campaigners. Sizzla, whose real name is Miguel Collins, has released five albums since 1995 and has been credited with taking dancehall music back to its roots. He has also faced charges for using profanity in recent years but was usually given a verbal warning or suspended sentence by authorities in Jamaica. Sizzla's tour was cancelled after Scotland Yaard's Racial and Violen Crime taskforce announced that it was examining lyrics by eight reggae artists, including one of his most controversial songs, \"Pump Up\", which includes the Jamaican phrase \"fire fi di man dem weh go ride man behind\".", "tinydolphin:1.1b": " Singer Sizzla has been jailed in Jamaica for swearing on stage. This comes after his UK tour was cancelled due to protests against his anti-gay lyrics. The reggae star must serve a 15-day prison sentence and is charged with swearing under a law which prohibits indecent dress or expression. Sizzla's real name is Miguel Collins, and his first UK tour was in November of last year, when protests were held due to his \"anti-gay\" lyrics. He has released 25 albums since 1995, and many Jamaican entertainers have been targeted by the authorities for using profanity recently.", "phi:2.7b": " Reggae star Sizzla was jailed for 15 days in Jamaica after consistently swearing on stage during a concert, which resulted in his UK tour being cancelled due to protests against his \"anti-gay\" lyrics. The singer has released 25 albums since 1995 and is credited with taking dancehall music back to its reggae roots. Other Jamaican entertainers have faced legal action for using profanity, but Sizzla received a prison sentence.\n", "orca-mini:3b": " Sizzla, a reggae star, was jailed for swearing on stage during a concert in St. Thomas, Jamaica, and was charged under a law prohibiting indecent dress or expression. His UK tour was cancelled after protests by gay rights campaigners.", "hermes3:3b": "Sizzla jailed for swearing, 15days in jail for concert profanity in Jamaica.", "stablelm-zephyr:3b": "Reggae star Sizzla, known as Miguel Collins, was jailed in Jamaica for 15 days for consistently swearing during a concert. He had his UK tour cancelled in November 2020 due to protests against his \"anti-gay\" lyrics. The singer was charged under a law that prohibits indecent dress or expression. Many Jamaican entertainers have faced similar charges before, typically receiving verbal warnings, suspended sentences, or community service. Sizzla's controversy arose from the song \"Pump Up,\" which contained lyrics translated by OutRage! as suggesting to burn men who have sex with men.", "chatgpt-4o-latest": "Reggae star Sizzla has been jailed for 15 days in Jamaica for swearing on stage during a concert in St Thomas, despite police warnings. He was charged under a law prohibiting indecent expression. His UK tour was previously canceled after protests over his \"anti-gay\" lyrics, and Scotland Yard's Racial and Violent Crime taskforce had been reviewing lyrics by several reggae artists. Sizzla, whose real name is Miguel Collins, has released 25 albums and is known for bringing dancehall music back to its reggae roots. Many Jamaican entertainers have faced court for profanity, but usually receive lighter penalties. One of Sizzla's controversial songs, \"Pump Up,\" has been criticized for homophobic lyrics.", "stablelm2:1.6b": "Reggae artist Sizzla was jailed in Jamaica for swearing on stage during a concert in January, despite police warnings. He must serve 10 days in prison under a law prohibiting indecent expression. Sizzla's UK tour was canceled after Racial and Violent Crime taskforce examined the lyrics of eight reggae artists, including his song \"Pump Up.\" His most infamous track contains profanity targeting men who have sex with men, translated from Jamaican patois as \"burn the men who have sex with men.\"", "granite3.1-dense:2b": "Reggae artist Sizzla (Miguel Collins) has been sentenced to 15 days in prison for swearing during a concert in St Thomas, Jamaica, on January 2023. This incident followed warnings from police and is governed by a law prohibiting indecent dress or expression. Sizzla's five-date UK tour was previously canceled due to protests by gay rights groups, citing his \"anti-gay\" lyrics, particularly the track \"Pump Up.\" Despite the controversy, many Jamaican performers have faced similar charges but typically receive less severe penalties like verbal warnings or community service.", "reference": "Reggae star Sizzla, whose UK tour was cancelled after protests at his \"anti-gay\" lyrics, has been jailed in Jamaica for swearing on stage.Sizzla's UK tour was cancelled after Scotland Yard's Racial and Violent Crime taskforce announced it was examining lyrics by eight reggae artists.Sizzla's five-date UK tour was cancelled last November after protests by gay rights campaigners.It would not confirm that Sizzla was among them."}