{"raw_text": "Rock star sued by ex-girlfriend\n \n Motley Crue guitarist Mick Mars is being sued by his ex-girlfriend for $10 million (£5.4 million), claiming he broke a promise to take care of her.\n \n The woman, Robin Mantooth, said Mars promised her repeatedly that he would provide financial support in the event of the couple breaking up. When they split in December, Mantooth says Mars denied any such agreement. She is asking a Los Angeles court to award her half the musician's property, a monthly allowance and damages. Mantooth added that the pair became lovers in 1990, after which she abandoned her career as a documentary film-maker to move in with the guitarist at his Malibu home.\n \n She is also claiming that Mars, 53, has failed to provide her with any material support since they ceased to be a couple. Motley Crue recently reunited after being apart for a period of five years. They originally formed in the early 1980s and scored six hits in the UK, including Girls Girls Girls in 1987. They are embarking on a world tour later this year which will take in 60 cities across the US, Europe, Asia and Australia. Mars - real name Bob Allen Deal - underwent hip replacement surgery in October. He suffers from a degenerative rheumatic disease which causes ligaments and tendons to attach to the bone.\n", "llama3.2:1b": "Mick Mars is being sued by his ex-girlfriend Robin Mantooth for $10 million, claiming he broke a promise to provide financial support after their breakup.", "llama3.2:3b": "Mick Mars is being sued by ex-girlfriend Robin Mantooth for $10 million over a promise he allegedly made to support her financially after their breakup in December 1990, with the lawsuit seeking half of his property, a monthly allowance, damages, and material support, amid Motley Crue's upcoming world tour.", "gemma2:2b": "Mick Mars' ex-girlfriend Robin Mantooth is suing him for $10 million, claiming he broke a promise to financially support her after their breakup. She seeks half his property, monthly allowance, and damages.  The pair were romantically involved from 1990 onwards when she quit her career. They split in December and Mars allegedly hasn't provided financial support since. The Motley Crue guitarist is 53 and suffers from a degenerative rheumatic disease.  \n", "qwen2.5:0.5b": "Mick Mars is suing his ex-girlfriend Robin Mantooth for $10 million (£5.4 million), claiming he broke a promise to take care of her by providing financial support in the event of their breakup. Mantooth, who was dating Mars at the time of their breakup, claims Mars has failed to provide material support since they separated. She is also asking a Los Angeles court to award her half of Mars' property and a monthly allowance.", "qwen2.5:1.5b": "Motley Crue guitarist Mick Mars is being sued by ex-girlfriend Robin Mantooth for $10 million, claiming he broke a promise to financially support her during their breakup in December 2019, when they became lovers. Mantooth wants half of his property and monthly allowance, as well as damages. They reformed after five years apart. Mars is suing due to hip replacement surgery complications from his degenerative rheumatic disease.", "qwen2.5:3b": "Mick Mars, guitarist of Motley Crue, is being sued by his ex-girlfriend Robin Mantooth for $10 million (£5.4 million) alleging he broke promises to financially support her after their breakup in December 2022. They met in 1990 and moved together to his Malibu home. Now separated, Mantooth claims Mars has not provided financial support since then. She seeks half of his property, monthly allowance, and damages. Their last reunion was in the early 1980s when they scored hits including Girls Girls Girls. They are currently touring for a world tour spanning 60 cities across the US, Europe, Asia, and Australia. Mars had hip replacement surgery earlier that year due to degenerative rheumatic disease.", "opencoder:1.5b": "Rock star sued by ex-girlfriend\n\nMick Mars was being sued for $10 million against his ex-girlfriend, Robin Mantooth.\n\nMantooth, who is a Rock star, said that Mars promised her repeatedly about financial support in the event of a loss between them. They reportedly split up in December, and Mantooth later denied any agreement. She added that they found it strange that she abandoned his career as a documentary film-maker to move into the guitarist’s home at Malibu.\n\nThe pair are now lovers; they met 5 years ago in 1989. After moving into the band, they are embarking on a tour with 60 cities across the US and Europe, including Asia and Australia.\n", "smollm:1.7b": "Rock star sued by ex-girlfriend for $10 million", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text about rock musician Mick Mars being sued by his ex-girlfriend Robin Mantooth for breaking her promise of financial support after they split up. Let me break down what each part says.\n\nFirst, the main points are: rock star is suing his ex-girlfriend for $10 million. The woman is asking court to give her half the musician's property and damages. She got into a relationship in 1990, moved back with him after they were apart for five years. He has a hip replacement because of an autoimmune disease.\n\nI need to make sure I capture all these key elements without getting too detailed. I'll start by stating that Mick Mars is being sued for breaking his ex-girlfriend's promise. Then mention the $10 million fine and the monthly allowance he wants. Next, include Robinmantooth's 53-year-old status and her claim of material support since they were apart. Also, note that she moved back after their split five years ago and that he had a hip replacement surgery.\n\nI should make sure to mention that they became lovers in 1990 when she started making documentaries instead of moving in with him. Ending with his current tour schedule as part of the summary would add context about his career situation. I'll wrap it up by summarizing how this situation affects both parties, highlighting their different financial claims.\n\nI need to keep each point concise and make sure there's no extra information beyond what's necessary for a clear summary. Avoiding explanations or formatting is key since the user wants only plain text.\n</think>\n\nMick Mars, a rock musician, is being sued by his ex-girlfriend Robin Mantooth for $10 million in fine, claiming she promised to provide financial support when they separated. She seeks half of his property and damages.mantooth claims 53 years old from 1990, moving back after five years apart, seeking material support since then. They became lovers that year, moved back, and Mars underwent hip replacement surgery for an autoimmune disease. Now on a tour spanning U.S., Europe, Asia, and Australia.", "tinyllama:1.1b": "Inspired by Motley Crue's ex-girlfriend, singer Mickey Mars is being sued for $10 million (approximately £5.4 million) by his former girlfriend, who claims he broke a promise to provide financial support and care for her when they split up in December 1990. The ex-couple became romantically involved after Mantouch moved into Motley Crue's Malibu home in January 1990. Despite the couple being apart for five years, Mantouch filed the lawsuit after they finally reconciled. Motley Crue is scheduled to embark on a world tour this year and Mars had underwent hip replacement surgery in October but suffered from a degenerative rhauhatid disease which caused him to attach ligaments and tendons to his bone.", "tinydolphin:1.1b": " Motley Crue guitarist Mick Mars has been sued by his ex-girlfriend, Robin Mantooth, for $10 million (£5.4 million) in damages. The lawsuit claims that Mars broke a promise to take care of her, and argues that he claimed he always intended to provide financial support after they split up in December. Mantooth claims that she became pregnant with his child in 1990, after which she moved into his Malibu home. She is seeking a monthly allowance and damages for not being taken care of by Mars. The couple were together from 1990 to 2015, when they split up.", "phi:2.7b": " Mick Mars, guitarist of Motley Crue, is being sued by his ex-girlfriend Robin Mantooth for $10 million (£5.4 million) for breaking their promise to take care of her financially in case they separated. She claims he has failed to provide any support since they split in December and wants half of his property, a monthly allowance, and damages. They stopped being a couple when she left her career as a documentary filmmaker to move into Mars' home in Malibu. They are reuniting and going on tour later this year after a five-year break.\n", "orca-mini:3b": " Mick Mars, a guitarist for the band Motley Crue, is being sued by his ex-girlfriend for $10 million as she claims he broke a promise to provide financial support in case of their breakup. The woman, Robin Mantooth, is asking a Los Angeles court to award her half of the musician's property, a monthly allowance, and damages. Motley Crue recently reunited after being apart for five years and will embark on a world tour later this year. Mars underwent hip replacement surgery in October and suffers from a degenerative rheumatic disease.", "hermes3:3b": "Motley Crue guitarist Mick Mars sued for $10m by ex-girlfriend over broken promise of financial support after breakup.", "stablelm-zephyr:3b": "Rock star Mick Mars of Motley Crue is being sued by ex-girlfriend Robin Mantooth for $10 million, alleging breach of promise to provide financial support upon breakup. She seeks half his property, a monthly allowance, and damages. Mantooth claims that Mars promised her support after their 1990 relationship ended, but ceased providing any assistance following the couple's separation.", "chatgpt-4o-latest": "Motley Crue guitarist Mick Mars is being sued for $10 million by his ex-girlfriend, Robin Mantooth, who claims he broke a promise to support her financially if they split. Mantooth, who left her career to live with Mars, is seeking half his property, a monthly allowance, and damages. She alleges Mars has provided no support since their breakup in December. Mars, 53, recently had hip replacement surgery due to a degenerative disease. Motley Crue, reunited after five years, is set for a world tour covering 60 cities.", "stablelm2:1.6b": "Guitarist Mick Mars is being sued by ex-girlfriend Robin Mantooth for $1 million (£5.4 million), claiming he failed to uphold a promise to support her financially after their breakup in December. Mantooth claims Mars made multiple promises, but when they split, she said he denied any agreement. She's asking a court to award her half his property, a monthly allowance, and damages. Mantooth also asserts Mars has failed to provide material support since the break up of their relationship. Mars, real name Bob Allen Deal, underwent hip replacement surgery in October after suffering from a degenerative rheumatic disease that attaches ligaments and tendons to the bone. Motley Crue recently reunited after five years apart; they scored six hits in the UK and are embarking on a world tour later this year, with plans to visit cities across the US, Europe, Asia, and Australia.", "granite3.1-dense:2b": "Ex-girlfriend Robin Mantooth, former lover of Motley Crue guitarist Mick Mars (real name Bob Allen Deal), has filed a $10 million lawsuit against him in Los Angeles court. She alleges that Mars promised financial support if their relationship ended, but denies any such agreement when they broke up in December 2021. Mantooth seeks half of Mars' property, a monthly allowance, and damages. They began dating in 1990, with Mantooth leaving her career as a documentary filmmaker to live with Mars at his Malibu home. Since their split, she claims he has not provided any material support. Despite recent reunion of the band that formed in the 1980s and ongoing world tour, Mars, 53, is dealing with a degenerative rheumatic disease that requires hip replacement surgery.", "reference": "Motley Crue guitarist Mick Mars is being sued by his ex-girlfriend for $10 million (£5.4 million), claiming he broke a promise to take care of her.The woman, Robin Mantooth, said Mars promised her repeatedly that he would provide financial support in the event of the couple breaking up.She is also claiming that Mars, 53, has failed to provide her with any material support since they ceased to be a couple.When they split in December, Mantooth says Mars denied any such agreement.Mars - real name Bob Allen Deal - underwent hip replacement surgery in October."}