{"raw_text": "Scissor Sisters triumph at Brits\n \n US band Scissor Sisters led the winners at the UK music industry's Brit Awards, walking off with three prizes. The flamboyant act scored a hat-trick in the international categories, winning the best group, best album and best newcomer awards. Glasgow group Franz Ferdinand won two prizes, as did Keane and Joss Stone, who was voted best urban act by digital TV viewers. Robbie Williams' Angels was named the best song of the past 25 years. Scissor Sisters frontwoman Ana Matronic collected the best international album prize from singer Siouxsie Sioux. She told the audience: \"If you told us a year ago we would be getting these awards today we would have called you crazy. You guys made our dream come true.\"\n \n The band - whose self-titled LP was 2004's biggest-selling album - thanked \"all the members of the sisterhood\", adding: \"We wouldn't be here without you.\" The US band, who opened the show with Take Your Mama, won the best international act and newcomer awards, as well as best international album.\n \n Franz Ferdinand, who were shortlisted in five categories, won best rock act and best British group, an award they dedicated to late DJ John Peel. But they missed out on best British live act, which went to Muse. Keane won best British album and breakthrough act. Will Young won the best single prize for Your Game. McFly won the best pop act prize, and Gwen Stefani picked up the best international female artist award. Eminem won the male prize.\n \n Best British male artist winner Mike Skinner - aka The Streets - does not usually attend award ceremonies, but the Birmingham hip-hop artist performed his hit Dry Your Eyes at the ceremony. However, he did not collect his prize. A bandmate informed the crowd Skinner was \"in the toilet\". After beating Amy Winehouse, Jamelia, Natasha Bedingfield and PJ Harvey to the best British female prize, Joss Stone said: \"I don't know what to say. I don't like doing this at all. I'd like to thank my family for being really supportive and everybody that made my record with me.\" \"I don't even know what to do right now. Thank you all you guys for voting for me, I feel sick right now.\" Viewers of digital music TV channel MTV Base voted Stone the winner in the best urban act category.\n \n Little Britain comedy duo Matt Lucas and David Walliams presented the best song prize to Robbie Williams dressed as his former Take That colleagues Gary Barlow and Howard Donald, leading him to quip he was \"always the talented man of the band\".\n \n Williams' track beat songs by Will Young, Queen, Kate Bush and Joy Division in a vote by BBC Radio 2 listeners to mark 25 years of the UK music industry ceremony. It is his 15th Brit award, having already received 10 solo awards and four with Take That. He told the audience: \"I'm just amazed that my career keeps going.\" Keane frontman Tom Chaplin thanked fans for enduring \"rubbish gigs\" after they won the British breakthrough act prize. He added: \"A lot of people don't think it's cool that we've had the guts to be ourselves but it's a vital part of who we are as a band and receiving this is recognition of that.\"\n \n Natasha Bedingfield - in the running for best British female and best pop act - performed with her brother Daniel for the first time at Wednesday's event.\n \n The chart-topping siblings duetted on the Chaka Khan hit Ain't Nobody. Meanwhile, Joss Stone performed Right To Be Wrong backed by a gospel choir, while Lemar and Jamelia performed the Robert Palmer track Addicted To Love. Bob Geldof won a prize for his outstanding contribution to music. Of the 15 Brit awards for achievements in 2004, 10 were won by artists tipped in the BBC News website's Sound of 2004 list of artists to watch, published at the start of last year. Scissor Sisters, Franz Ferdinand, Keane, Joss Stone and McFly were all in the Sound of 2004 top 10. The other five Brits winners were already established before Sound of 2004 was compiled. The ceremony will be televised on ITV1 on Thursday.\n \n \n \n I'm speechless. Best song of the last 25 years? Yeah right.\n \n I very much doubt that 'Angels' was even the best song of the week that it came out. Like every track Robbie has released as a single, it's a blatant but poor facsimile of something that someone else has done better before.\n \n Give us a break...!!!\n \n Best song in 25 years, you must be joking. Its good if you like that sort of thing, but really!\n \n Listened to Angels on Radio 1 this morning when I was driving into work. Had not heard it for a while. I love Robs voice, the lyrics and tune. Perfection!\n \n As usual, the public have short memories when it comes to voting for \"the greatest\". There must be more than a dozen songs in the last 25 years that deserve this award more. It's not exactly groundbreaking. Presumably, the age range that could be bothered to vote is is pretty low...\n \n I'm actually embarrassed to be British if that is the best song we have produced in the last 25 years!!\n \n What about The Specials - Ghost Town, The Buzzcocks - Ever Fallen in Love With Someone... Happy Mondays - Kinky Afro, McAlmont & Butler - Yes, Joy Division - Love Will Tear Us Apart... Angels is middle-of-the-road rubbish.\n \n Angels is a awful piece of sentimental claptrap. It's musically and lyrically inept; and fantastically overrated, a bit like Mr Williams himself. This result isn't very surprising though, The Brits has a long history of celebrating rubbish music!\n \n Best of the last 25 years? Maybe. Cunning to make the timescale not include Stairway to Heaven or Bohemian Rhapsody, but it does kind of make it a bit of a hollow award really. Not much competition in the last 25 years after all.\n \n It's alright for a pop song - but the best song of the last 25 years???\n \n There is no way on earth that song should have been voted the best of the last 25 years....it's a travesty.\n \n Rubbish! Who voted it for it to be included in any list? I am a regular listener to Radio 2 but I don't recall the invitation to vote for this bland, slushy rubbish which might appeal to the masses who wouldn't know a good song if it jumped up and bit them on the nose but is certainly NOT the best song of the last 25 years. How depressing and just when we thought manufactured 'pop' was on the way out - where on earth did this dreadful list appear from?\n \n While I am biassed in that I thought Love Will Tear Us Apart should have won, in all seriousness, I think that the best song of the last 25 years should not include songs less than 5 years old as that would exclude songs which are popular because of novelty. Then again, well done Robbie, good show.\n \n You've got to be kidding.\n \n Angels is a great song, but not the best song of the last 25 years. Only the best song to be up for nomination at the Brits.\n \n I think Angels is a great song and deserved to be in the run up for this award but I don't think its the best song from the past 25 years! Right enough, it is better than some of the others in this catergory, for example, what was Will Young doing being nominated in the first place - he is alright but the song isn't that good! I'm happy for Robbie himself though!\n \n Best song in the last 25 years? What a Joke! Think of all the great rock and pop songs released in the 80s and pretty much all of them are better than Angels. Phil Collins doesn't deserve awards for all the good songs he wrote? Angels is an overrated song, that got tiresome even before you had finished listening to it. Soppy rubbish at best. Hopefully manufactured rubbish will die down soon, and let the real artists who worked hard for there glory receive awards.\n \n So boringly obvious and typical of the bland nature of mainstream music in Britain today, for me it's proof that music and democracy just don't mix. Still, at least it wasn't Will Young...\n \n Oh it's all just a bit of fun. People take these awards too seriously! Robbie has millions of loyal fans, while even non-fans know the words to angels. Him winning obviously reflects who votes in these awards. Personally I wanted Will Young to win, but that was not really due to his musical talent!\n \n I hate the song, all it brings back is memories of school discos and no-one to slow-dance with!\n \n I agree about Angels. I never get fed up hearing it. Whenever the song comes on the radio I turn the radio up, smile and sing along (very badly, that is why the radio has to be turned up to drown my voice out). The song makes me calm and serene and happy. Well done Robbie.\n \n I think that although Robbie Williams is a good performer, that Angels isn't really that good a song. It certainly isn't anywhere near as good as Love Will Tear Us Apart by Joy Division or Wuthering Heights by Kate Bush.\n \n Angels is a fantastic song. All credit to Robbie Williams and Guy Chambers. It's a song that will be played forever and bridges all age groups.\n \n Robbie did in no way deserve that mantle. Whenever we have these awards it is always 'artists' from the past five years that seem to win the best of the best...We forget about the late 80s and early 90s for example. They weren't cool at the time, but because they are cool again now shows that the songs have greater longevity than people think.\n \n Yes Angels is the best song since the past 25 years, because it touches the soul as it carries a lot of meaning.\n \n I've always disliked Angels intensely. I believe it to be symbolic of the general capacity of British pre-teens, teens and middle aged women to accept low quality/ low aspirational music as \"classic\" songwriting. It's 'orrible. It seems obvious to me that people who like Robbie are people who don't particularly like music all that much. Folks without collections; folks who have never engaged in that madness one experiences when falling under the spell of pop music. Angels adds nothing - it is merely an irritating distraction - a wasp that refuses to go away on a summer's afternoon picnic. What a dreadful result. If you voted for it - you should feel ashamed of yourself - you probably only know a dozen songs or so don't you - so where do get off applying this uninformed filter and casting this ridiculous vote. Booo hisss\n \n Angels, best song? You are kidding, right? Last five years I might be willing to accept, but 25, no way. Did whoever voted for this actually have ANY music knowledge prior to, say, 1995? Really quite insulting to the British music industry of the past quarter of a century.\n \n No surprise about Robbie Williams considering the list. Where on earth did the nominations list come from???? Compiled by an eleven year-old girl perhaps?? I mean, Will Young? Come on.\n \n What a load of crap, best song in the last 25 years - I don't think so!! What about all the REAL artists out there over the last 25 years - the list is endless, but Robbie Williams doesn't even come close.\n \n What a joke. That song has become such a bane to me that I have developed a Pavlovian response to the word 'Angels' where I thrash around, and scream \"no no no no no\" until someone tells me \"the radio's off\". Why a half-baked cheesy ditty like Angels, which has become the anthem for millions of romantic sops (think how many times it was sung on Pop Idol for example, and by whom), should be voted the best song of the past 25 years, is beyond me. If this is the song against which all others are judged, then musicians may as well give up.\n \n Why do we reward mediocrity so highly in this country?? The initial list was very weak anyway, but Angels the best song of the last 25 years!!!! I think not, I didn't realize Radio 2 had so many listeners under the age of 10!!\n \n People have such short memories! A great song yes, but the best of the last 25 years? Not a chance. I think the person as opposed to the song has been voted for here.\n \n The Great British Public at work again. It's a mediocre, sentimental and safe song. Granted, it's not too bad, either. But can it stand up against ANYTHING by The Smiths (in particular \"How Soon is Now?\") or anything from the Stone Roses' first album? Nope.\n \n No, Because I'm not female and I'm not 10!\n \n Ok I like Robbie and Angels is a decent song. But it is no way the best song of the past 25 years! The shortlist wasn't great but him winning it is a joke!\n \n Predictable and laughable.\n \n The success of Angels at this years Brits reflects poorly on the state of British music over the last 25 years. The British public are brainwashed by the corporate pulp that is presneted to them as cutting edge music and true talent is being sadly missed. Whilst Angels is a popular song it is not even the best song in Robbie's repertoire never mind best song of the last 25 years.\n \n I am a huge Robbie fan and love that song. But I think there are a lot more outstanding songs / music out there that influenced music today, unfortunately they were left out of the list.\n \n Have Radio 2 listeners even heard of Joy Division? A band who, through two albums, have had a bigger impact on music, and continue to do so, over the last 25 years than Robbie Williams ever will.\n \n No doubt about it. There's not a song done by anyone with more emotion and feeling. Some people will adopt their slightly snobby stances, but Angels has hit home with a far larger audience than any other song.\n \n It should have been Joy Division.Those guys have played an influential part in shaping modern day music while Angels remains yet another pop song. I sincerely do not believe that in 25 years from now, the most influential artists will argue that Robbie Williams inspired their art in the way that the Byrds, the Beatles and Nick Drake have done for music today.\n \n Yes!! I think its a brilliantly written song with different meanings to different people. There were other great songs in the category... but somebody had to win! Robbie was a deserved winner.\n \n I am astounded that such a second-rate record has beaten such a line up of amazing songs! it's a terrible song, voted for by the masses who don't have the brains to appreciate innovative and exciting music.\n \n The best song of the past 25 years? Really? Come on, this is surely a joke? No? I think I need a long lie down...\n \n It just goes to show that the british public do not have a clue about good quality music when they pick Robbie Williams over the beautifully talented Kate Bush and Joy Division. I suppose it's confirmed one thing - the British public are consistently dull :- &lt;(\n \n No offence Robbie, but pleeease! There must be a thousand better songs than a formulated cheesy pop song for kids. No one agrees with this and quite frankly it is an embarassment to the integrity of British music, and a further nail in the coffin!\n \n I think Robbie deserves it, he has been the most iconic of any stars we have had in Britain since John Lennon and is an idol to millions worldwide. Anybody who says he doesn't deserve it is jealous of his success. The only real challenger was Queen but hey, Another One Bites the Dust!!\n \n Obviously all the Karaoke singers in the UK voted for it.\n \n If this is the best song of the last 25 years then the British Music industry is in trouble. Sure Robbie is talented and produces excellent material, but this is not the best record.\n \n A sad day for music\n \n It's not the type of music I normally like, but even as a diehard rock fan, I recognise that it is a good song and appelas to most people. That's why it has been voted best song of the last 25 years. It's a good all-rounder. Just like Robbie.\n \n Best song in 25 years? Since 1980? I'm confused. \"Angels\" isn't a bad song. It's a nice, catchy, formulaic anthem that ticks all the boxes. But this is not great music. If anything it's regressive. Bland even. I suppose it's just more evidence of how redundant the Brit Awards have become.\n \n Granted angels is a good song, however it really wasn't up against any other proper competition. The Queen's song was lackluster, and apart from Kate Bush, the other choices were pathetic! Also, why weren't the Stones there, David Bowie, etc, there are so many greater songs than Angels...I wonder if it was simply the fact that Robbie wasn't getting more awards so they had to make one up for him!\n \n Best song of the last 25 years? What a ridiculuous concept, and an even more ridiculous winner. Sigh. On the upside, at least it wasn't Bohemian Rhapsody, for which we should all be thankful.\n \n Angels is without doubt a great song but I really don't think it deserves the title of best song in 25 years.perhaps the vote had more to do with teenage opinion on Robbies' goodlooks than the actual song!!! Don't get me wrong, I'm not disputing his looks, but there are more deserved winners.\n \n It would have been a travesty had Angels not won. Without Angels, Robbie Williams may well not be where he is now, and Britain would have been deprived of one of its most charismatic and talented performing artists. It has to be seen performed live, with 125,000 people singing along to be fully appreciated. Well done Rob.\n \n I find it hard to believe that 'Angels' is the best we have to show for the past 25 years! I'm rapidly redifining 'best' in my own head now to mean 'most gratuitously played at weddings and funerals because people think it has deep meaning'. What about Britpop? Blur, Oasis, Suede, Pulp... not only making fantastic songs but also making changes, doing something different. Why must 'best' always come down to most commercially popular?\n \n I've nothing against Robbie, I actually like his music, but how can this possibly be the best song from the last 25year? The Brits has proved to be nothing more than a bargaining tool between the pop moguls to boost band profiles and record sales. The same goes with the Scissor Sisters, I think this is a superb record and thoroughly deserves the newcomer award, but the album comes no where near U2's new record, neither are they in the same league. Once again there have been some baffling discisions made, they are not for artisic reasons, but for profit.\n \n No surprise really, it's voted for by the general public. Since when did they have taste in music?\n \n Personally I find Angels by Robbie Williams to be one of the most irritating songs I have ever heard!\n \n It absolutely deserved to win. It is a song that has united the generations and will continue to be played for many years to come.\n \n It's an absolute joke, however most of the original 25 were very poor choices as well. All in all a pretty pointless exercise !\n \n The song is overplayed and oversentimental. Out of the rather poor five choices that were left, it should have gone to either Joy Division or Queen. I suppose we should be thankful that it didn't end up in the hands of Will Young though.\n \n Although it has nostalgia value, there is no way it deserved to win. Everybody knows the words to Bohemian Rhapsody, Nothing Compares 2 U, etc. Much better songs and more timeless. Give it to someone with real talent.\n \n Although Angels is a good song I think that anyone with the slightest musical taste will realise that this is not the best song of the last 25 years. This is just another example of record company manipulation to keep an artist in the public eye. Why not give him an award for the greatest pair of trousers if that's all it means!\n", "llama3.2:1b": "It looks like you've had a long and passionate rant about the Brit Awards, specifically the choice of Best Song winner. Here are some key points from your post:\n\n1. **You didn't enjoy \"Angels\"**: You mentioned it was one of the most irritating songs you've ever heard.\n2. **It's overplayed and oversentimental**: You felt that \"Angels\" is too commercialized and sentimental, rather than a genuinely good song.\n3. **Better choices were overlooked**: You suggested alternative songs like Joy Division or Queen could have been better winners.\n4. **Record company manipulation**: Your tone shifted from frustration to outrage when you mentioned the record label's influence on choosing the winner.\n5. **You think it was unfair to award an artist with little talent**: You suggested that giving a Best Song award to someone without much musical merit would be a miscarriage of justice.\n\nOverall, your post expresses a strong opinion that the Brit Awards can be manipulated and that \"Angels\" is not a standout song in its genre. However, it's worth noting that opinions about music are subjective, and many people enjoy \"Angels.\"", "llama3.2:3b": "The reactions to Robbie Williams' \"Angels\" being voted Best Song of the Last 25 Years are varied and often critical. Many commenters express surprise, frustration, and disappointment at the choice, feeling that it doesn't deserve the title. Some argue that the song is overplayed, sentimental, and not particularly original or groundbreaking.\n\nSome also suggest that the award may have been influenced by commercial considerations, such as record company interests and the desire to keep an artist in the public eye. A few commenters even imply that the voting process was rigged or manipulated.\n\nHowever, a smaller number of respondents defend Robbie Williams' song, acknowledging its catchy melody and nostalgic value. Some argue that it's a good example of a well-crafted pop song that has become iconic and widely appealing.\n\nOverall, the reactions to this award are a reflection of the subjective nature of music taste and the importance of considering artistic merit, originality, and impact on the musical landscape when evaluating the \"best\" of something.", "gemma2:2b": "This is a collection of opinions on why \"Angels\" by Robbie Williams won the Brit Award for best song of the last 25 years.  The tone is mixed, with some praising its enduring popularity and others decrying it as bland and overly sentimental. Here's a breakdown:\n\n**Arguments in Favor of \"Angels\":**\n\n* **Catchy & Universally Appealing:** Many find it a good \"all-rounder\" – simple, catchy, and easily understood, making it relatable to a broad audience. \n* **Emotional Connection:** It evokes strong emotions for many listeners, leading to a sense of unity and shared experience. \n* **Commercial Success:**  It has enjoyed massive commercial success over the years, indicating widespread appeal.\n* **Cultural Impact:** The song remains popular, playing at weddings and funerals, highlighting its enduring cultural significance.\n\n**Arguments Against \"Angels\":**\n\n* **Lack of Originality:** Many find it lacking in artistic depth or creative innovation, leading to a sense of stagnation compared to other great songs. \n* **Over-played & Oversentimental:**  It's considered overplayed and sometimes viewed as sentimental fluff instead of true artistic merit. \n* **Commercial Manipulation:** Some believe the award reflects more on the artist's marketing strategies than genuine musical talent. \n\n**Common Themes:**\n\n* **Popularity vs. Artistic Merit:**  The debate highlights a clash between popular appeal and critical acclaim, with \"Angels\" representing a common choice for commercial success but not necessarily artistic excellence.\n* **Nostalgia & Time:** The discussion touches on the power of nostalgia and how certain songs transcend time, but it also suggests a preference for more timeless music over overly sentimental works. \n* **The Purpose of Awards:**  It raises questions about the purpose and relevance of awards like the Brit Awards, especially in terms of their influence on artistic merit versus commercial success.\n\n**Overall Conclusion:** \n\nThis collection of opinions showcases the debate surrounding musical taste and its relation to awards ceremonies. While some find \"Angels\" a charming and universally appealing song, others see it as lacking artistic depth and relying heavily on commercial appeal. The discussion serves as a testament to the subjective nature of music appreciation and the complexity of determining what constitutes \"the best.\" \n", "qwen2.5:0.5b": "Based on a careful analysis, here are the top 10 songs from the \"Best Of 25 Years\" category:\n\n  * \"Angels\" by Robbie Williams: This song was voted as the best song of the last 25 years and is described as a great anthem that has united generations. It has a catchy melody and is well received by both music critics and fans.\n  * \"Bohemian Rhapsody\" by Queen: While this song may have not been voted as best, it was chosen to celebrate Queen's 60th anniversary. The song features lyrics that are often seen as political or controversial at the time of its release.\n  * \"Hotel California\" by Eagles: This song is a classic rock anthem and has become a symbol of Hollywood music. While it may not have been voted as best, it was chosen to celebrate the band's 30th anniversary.\n  * \"Ain't No Mountain High Enough\" by Bette Midler: Despite its title, this song actually reached number one on the Billboard Hot 100 chart, making it a top 40 hit and an international commercial success. It was voted as the best song of the last 25 years.\n  * \"Bohemian Rhapsody\" by Queen: This is one of the most popular songs in music history and has been covered numerous times over the years. While it may not have been voted as best, it was chosen to celebrate Queen's 60th anniversary.\n  * \"My Heart Will Go On\" by Elvis Presley: Although this song does not reach number one on the Billboard Hot 100 chart, it is considered a classic and is often cited as a hit. While it may not have been voted as best, it was chosen to celebrate Presley's 50th birthday.\n  * \"Hotel California\" by Eagles: This song has become iconic in the music industry and remains popular today. While it may not have been voted as best, it was chosen to celebrate the band's 30th anniversary.\n\nOverall, the choice of songs from this category depends on personal preferences and the specific context of the awards show.", "qwen2.5:1.5b": "The debate over who should have won the Brit Awards \"Best British Single\" category has been a lively one, with opinions ranging from those who think Robbie Williams deserves accolades as a top artist to others who believe he doesn't deserve recognition. \n\nRegardless of what the award was for, it seems that the nominations and the final decision were largely based on popular opinion rather than quality music. The fact that \"Angels\" came in as one of the best British singles of 2008 shows just how far-reaching public taste can be.\n\nIt's worth noting that while some people may have voted for Williams because of his good looks, it would seem to me that many were simply voting based on his popularity. And when a record is played at weddings and funerals, even if the lyrics aren't understood, that doesn't make it any better or worse than any other song.\n\nSo in the end, while \"Angels\" may have been well-received by fans of Robbie Williams, it's not necessarily the best single of its kind. The Brit Awards were just a way to boost an artist's profile and sell records, rather than recognizing quality music.\n\nIn the words of one poster: \"It's an absolute joke, however most of the original 25 were very poor choices as well. All in all a pretty pointless exercise ! \"", "qwen2.5:3b": "The discussions highlight a variety of perspectives regarding why \"Angels\" by Robbie Williams might have been voted as the best song from the last 25 years:\n\n### Arguments For \"Angels\"\n\n1. **Uniting Generation Gap**: Many supporters argue that \"Angels\" is a unifying song across different generations, with its catchy melody and lyrics resonating widely.\n\n2. **Popularity and Nostalgia**: There are those who appreciate the song's broad appeal and commercial success, suggesting it has stood the test of time in terms of popularity and reach.\n\n3. **Live Performances**: Some people highlight how well \"Angels\" performs live with large audiences singing along, which adds to its perceived greatness.\n\n### Arguments Against \"Angels\"\n\n1. **Quality Compared to Other Songs**: Many critics believe that the song is far less artistically or musically significant compared to other songs from the last 25 years.\n\n2. **Lack of Originality**: There's a consensus that \"Angels\" doesn't stand out as innovative or groundbreaking in terms of composition or style, especially when compared to more influential songs.\n\n3. **Critique of Pop Culture Awards**: Some commentators see the awards as mere marketing tools for record companies rather than genuine musical achievements, implying the song might have been chosen primarily for its commercial success and not artistic merit.\n\n4. **Competition with Other Songs**: Several people suggest that if \"Angels\" had competed against other top songs from the last 25 years, it would not have won due to its lack of originality or depth compared to those competitors.\n\n### Specific Points Raised\n\n- **Commercial Success vs Artistry**: There's a clear preference for awards recognizing artistic achievements over commercial popularity.\n  \n- **Comparisons to Other Songs**: Many pointed out that songs like \"Bohemian Rhapsody,\" \"Nothing Compares 2 U,\" or even Queen's hits would have been considered more worthy of the title.\n\n- **Taste in Music**: There's a perception that awards often favor popular choices over genuine artistic quality, leading some to question if these awards accurately represent what constitutes \"best\" music.\n\nIn summary, while there are strong arguments for why \"Angels\" might have won due to its broad appeal and live performances, the majority of critics seem to believe it was an overachievement in terms of musical merit. Their perspective often aligns around the idea that such prestigious awards should recognize deeper artistic contributions rather than mere commercial success or popularity.", "opencoder:1.5b": "This is a fascinating discussion and many of the points raised could be the reason why certain songs like \"Angels\" has been selected as the best song from the last 25 years despite having several other similar records.\n\n1. Quality: The quality of \"Angels\" cannot be underestimated, it's a classic British rock song with a clear rhythm and an engaging melodic theme that captures the essence of pop culture.\n\n2. Innovation: Although many have mentioned that this was not a \"best song\" in the last 25 years, this song continues to inspire and stimulate new ideas for what should be considered the best song title ever.\n\n3. Market Appeal: The fact that it's been hailed as one of the greatest pair of trousers on the record speaks volumes about its appeal and perceived value.\n\n4. Record Company Manipulation: The creators of this song are likely well-versed in their craft, making them a valuable resource for any record company looking to produce quality music.\n\n5. Lack of Recognition: Despite being acclaimed, it's not without its critics who may have seen it as a joke or a pun.\n\n6. Future Possibilities: It's unlikely that \"Angels\" will be selected again for the same reason - its potential is vast and exciting, yet unsurmountable by any other song on the record.\n\nIn conclusion, while there are many reasons why certain songs could have been chosen as the best, it's not a lack of recognition but an invitation to create something new and innovative.\n", "smollm:1.7b": "I think you're misunderstanding the concept of \"best\" when it comes to music awards. While opinions on individual songs can vary, a \"best\" song from the last 25 years is more than just personal taste - it's based on critical acclaim, commercial success, and enduring popularity.\n\nIn this case, I think you're right that there are better songs out there that could have been nominated for the \"Best Song of the Last 25 Years.\" However, the fact remains that \"Angels\" is a timeless classic that has stood the test of time, with its iconic status and enduring appeal.\n\nIt's also worth noting that the \"Best Song of the Last 25 Years\" award is not just about the song itself, but also about the artist who wrote it. Robbie Williams was an incredible songwriter and performer, and his contribution to the song's success cannot be overstated.\n\nSo, while opinions on individual songs can vary, I think it's fair to say that \"Angels\" is a good choice for this award - not because of its popularity or commercial success, but because of its enduring impact on music and its continued relevance today.", "deepseek-r1:1.5b": "<think>\nAlright, I need to help summarize this pretty long essay about \"Angels\" by Robbie Williams. The user has provided a detailed essay with many points discussed, including Robbys' career, his style as a rapper and singer, his songwriting, the choice of songs for the award, various criticisms of the song, the industry's state, and more.\n\nFirst, I should identify the main themes or central ideas in the essay. It seems to focus on evaluating the song \"Angels,\" comparing it with other candidates like Queen and Bohemian Rhapsody, discussing Robbys' style, and criticizing the choice of songs for awards.\n\nI notice that the essay is quite lengthy, so I should make sure to condense this into a coherent summary without losing important details. Maybe highlight key points about Robbys' career, his songwriting, criticisms against \"Angels,\" industry challenges, and the overall reception of the song.\n\nI also see some personal opinions from the user, like how much he adores the song but that it didn't deserve the award for being repetitive. There's criticism of the judges selecting \"Angels\" over other top choices, such as Queen or Bohemian Rhapsody, even though the song is good.\n\nThe industry aspect mentions problems like competition between artists and the need for more diversity in awards, suggesting potential issues but not necessarily a complete downer. However, it's important to note thatRobbys' style has been praised for his emotional depth and storytelling.\n\nI should structure the summary to include Robbys' achievements, the song's strengths and weaknesses, the industry's state of mind regarding awards, and how the song is perceived in comparison to other artists.\n\nLet me make sure I cover all these aspects concisely. The user's essay goes into detail on each point, so a summary should reflect that balance without necessarily repeating every single idea verbatim.\n</think>\n\nRobbys' 2013 album \"Angels\" was a standout in the UK music industry, blending raw emotion and powerful storytelling with his unique voice as both rapper and singer. The song's catchy anthems, such as \"Boho Dax,\" resonated deeply with listeners, showcasing Robbys' ability to connect on an emotional level. However, critics pointed out that the song felt repetitive and formulaic, often sounding like a rehearsal routine rather than genuinely connecting with fans. Despite this, many praised the album's energy and emotional impact, particularly for its heartfelt lyrics about love and unity. The industry faced criticism regarding its selection of songs, often overvaluing top contenders like Bohemian Rhapsody and Queen while downplaying Robbys' own work. The song's reception was mixed—some praised it as a standout, others criticized it for being repetitive. In the end, \"Angels\" earned critical acclaim, but not widespread commercial success due to its perceived lack of originality and potential repetition.", "tinyllama:1.1b": "Based on the given text, several criticisms and arguments have been made against the decision to nominate Robbie Williams as the winner of the Best New Artist award at the 2008 Brit Awards. Some of these include:\n\n1. The popularity of the original five nominees: All the other nominees in this category (Joan Armatrading, Tinie Tempah, Elbow, Blur and Sigstedt) were also very popular, while Robbie's only notable song at the time was \"Angels\".\n\n2. The narrowness of the original five: Only one of these songs (Tinie Tempah's \"Pass Out\") was a hit in the UK and Robbie had not yet released an album or received any substantial publicity or popular support.\n\n3. Nominations based on commercial rather than artistic success: The decision to nominate Robbie for Best New Artist at the Brit Awards is seen as being largely driven by the need to boost his own profile and career, rather than honoring a truly exceptional artist who had yet to achieve much commercial success or critical acclaim.\n\n4. A lack of alternative nominees: In contrast, there were several other talented artists who should have been nominated for the award, but whose music did not meet the eligibility criteria for Best New Artist or otherwise fell outside of the scope of the category (such as Oasis, Coldplay and U2).\n\n5. The narrow nature of the original five: While it is true that this particular group of nominees was more diverse in terms of genre, quality, and popularity than those who received nominations in similar categories in previous years or later on, their overall lack of commercial success meant they were not the most appropriate or deserving recipients of the award.\n\nIn conclusion, while there is certainly merit to arguments that Robbie Williams' \"Angels\" does not deserve to win Best New Artist at the 2008 Brit Awards, it seems that the decision to nominate him was based on popularity rather than artistic or critical success. Additionally, there were several other talented artists who deserved to be nominated for the award but who did not meet the eligibility criteria, and whose music did not resonate with the public in any meaningful way. Ultimately, the Best New Artist category at the 2008 Brit Awards was a bit of a muddle, with Robbie Williams' nomination serving as a reminder that popularity is not necessarily a reliable measure of artistic excellence or critical or commercial success.", "tinydolphin:1.1b": " The voters have spoken, and despite a few outcry over what was deemed 'commercial', the Brit Awards saw Robbie Williams crowned Best New Artist. However, some argue that the choice of Angels was undeniably wrong. Many felt that the song should have been performed live, with a large audience present to show their support. Others argued that it is overplayed and oversensitated, not deserving of the award it won.", "phi:2.7b": " It seems like the user would like to know more about the content of the conversation and possibly have a discussion about it.\n", "orca-mini:3b": " Well, I'm certainly not going to argue with the overwhelming majority on this one. While I do enjoy \"Angels\" and think it's a great song, it doesn't really hold a candle to some of the other options we were given. The fact that it won over more deserving songs like \"Bohemian Rhapsody\" or \"Hey Jude\" is a bit of a head scratcher, but I guess there are only so many awards to go around. Ultimately, this is just one person's opinion and we can all agree to disagree on this one.", "hermes3:3b": "Your views on Robbie Williams' \"Angels\" winning the Best Single award at The Brits are varied and quite passionate. Here is a summary of some of your comments:\n\n1. You believe \"Angels\" may not be the best song from the last 25 years, considering other artists like Blur, Oasis, Suede, Pulp, Joy Division, Queen or David Bowie.\n\n2. Many of you find it hard to believe that such a commercially popular song could win the award and consider its popularity as evidence of voting by the general public rather than true musical taste.\n\n3. Some of you find \"Angels\" irritating, while others find it sentimental but nostalgic. \n\n4. You question the relevance and value of such awards in today's music industry, attributing them to record company manipulation.\n\n5. A few believe that Robbie Williams' charisma, talent, and ability to unite generations made him a worthy winner.\n\n6. Some feel it was more of a travesty if \"Angels\" hadn't won rather than a travesty if it did win.\n\n7. You appreciate the song's unifying power, but recognize its commercial appeal as being overplayed and oversentimental in some cases.\n\nIn conclusion, there is no consensus among you on whether Robbie Williams' \"Angels\" deserved to be the Best Single at The Brits for the last 25 years. Your views range from genuine appreciation of his talent, to criticism of its artistic value or commercial appeal, to questioning the relevance and purpose of such awards in today's industry.\n\nYour opinions have clearly highlighted the importance of individual tastes and preferences in music as well as your doubts about commercial success dictating musical choices.", "stablelm-zephyr:3b": "Some people might disagree with the choice of \"Angels\" as the best song of the last 25 years, but it's clear that it has been a popular and successful song. It's interesting to see how different people have different opinions on what makes a great song or an award-worthy record. Ultimately, though, music is subjective, and everyone can choose their own favorites based on personal taste and experiences.", "chatgpt-4o-latest": "Scissor Sisters dominated the Brit Awards, winning Best International Group, Album, and Newcomer. Franz Ferdinand, Keane, and Joss Stone also won multiple awards, with Robbie Williams' \"Angels\" named Best Song of the Last 25 Years. Other winners included Muse, Will Young, McFly, Gwen Stefani, and Eminem. Bob Geldof received an Outstanding Contribution to Music award. The selection of \"Angels\" sparked controversy, with many criticizing it as an unworthy choice compared to other influential songs from the past 25 years. Some praised its emotional appeal, while others dismissed it as overrated and indicative of mainstream music's mediocrity.", "stablelm2:1.6b": "The author expresses their disappointment with the selection of \"Angels\" as the best song of the last few years, claiming that it is a catchy but overplayed anthem rather than the great music they expected. They criticize the Brit Awards for their commercial motivations and question whether Robbie Williams' appearance on the awards show influenced the result. The author goes on to express disbelief in the popularity of this particular song among the general public, suggesting that the selection process was more about boosting sales than recognizing real talent.\n\nThey also compare it unfavorably to other popular songs from the same period, such as \"Bohemian Rhapsody\" and \"Nothing Compares 2 U,\" arguing that these are better songs with more timeless value. The author concludes by questioning whether the song genuinely deserved its award and whether it was a result of record company manipulation rather than genuine artistic merit.", "granite3.1-dense:2b": "Based on the provided text, it appears that the consensus among readers is that \"Angels\" by Robbie Williams did not deserve to be considered the best song of the last 25 years. Here are some key points from the discussion:\n\n1. Many readers agree that the selection process may have been influenced by commercial factors rather than artistic merit, with one person suggesting it could have been awarded for the artist's trousers instead.\n2. The song is seen as overplayed and sentimental, which some argue diminishes its value as the best song of the era.\n3. Some readers find \"Angels\" to be irritating or not particularly memorable compared to other songs from the same period, such as those by Queen, Blur, Oasis, Pulp, and Britpop bands like Blur, Oasis, Suede, and Pulp.\n4. Several readers point out that there are many songs with more depth and artistic value that could have been chosen as the best of the last 25 years, such as U2's new record or other works by artists like David Bowie, David Guetta (Scissor Sisters), and various Blur members.\n\nIn summary, while \"Angels\" is acknowledged as a good song with nostalgic appeal, it does not seem to meet the criteria of being the best overall song from the last 25 years due to its overplayed nature, sentimentality, and comparison to other more critically acclaimed tracks.", "reference": "Angels is a great song, but not the best song of the last 25 years.Whilst Angels is a popular song it is not even the best song in Robbie's repertoire never mind best song of the last 25 years.Best song of the last 25 years?Best song in the last 25 years?I think Angels is a great song and deserved to be in the run up for this award but I don't think its the best song from the past 25 years!Robbie Williams' Angels was named the best song of the past 25 years.It's alright for a pop song - but the best song of the last 25 years???Best song in 25 years?Although Angels is a good song I think that anyone with the slightest musical taste will realise that this is not the best song of the last 25 years.A great song yes, but the best of the last 25 years?That's why it has been voted best song of the last 25 years.Angels is without doubt a great song but I really don't think it deserves the title of best song in 25 years.perhaps the vote had more to do with teenage opinion on Robbies' goodlooks than the actual song!!!The best song of the past 25 years?I've nothing against Robbie, I actually like his music, but how can this possibly be the best song from the last 25year?If this is the best song of the last 25 years then the British Music industry is in trouble.The initial list was very weak anyway, but Angels the best song of the last 25 years!!!!But it is no way the best song of the past 25 years!I'm actually embarrassed to be British if that is the best song we have produced in the last 25 years!!Booo hisss  Angels, best song?I very much doubt that 'Angels' was even the best song of the week that it came out.What a load of crap, best song in the last 25 years - I don't think so!!While I am biassed in that I thought Love Will Tear Us Apart should have won, in all seriousness, I think that the best song of the last 25 years should not include songs less than 5 years old as that would exclude songs which are popular because of novelty.Best song in 25 years, you must be joking.Only the best song to be up for nomination at the Brits.Why a half-baked cheesy ditty like Angels, which has become the anthem for millions of romantic sops (think how many times it was sung on Pop Idol for example, and by whom), should be voted the best song of the past 25 years, is beyond me.I am a regular listener to Radio 2 but I don't recall the invitation to vote for this bland, slushy rubbish which might appeal to the masses who wouldn't know a good song if it jumped up and bit them on the nose but is certainly NOT the best song of the last 25 years.There is no way on earth that song should have been voted the best of the last 25 years....it's a travesty.Ok I like Robbie and Angels is a decent song.I think that although Robbie Williams is a good performer, that Angels isn't really that good a song.Angels is a fantastic song.Yes Angels is the best song since the past 25 years, because it touches the soul as it carries a lot of meaning.\"Angels\" isn't a bad song.Personally I find Angels by Robbie Williams to be one of the most irritating songs I have ever heard!Best of the last 25 years?I am a huge Robbie fan and love that song.Think of all the great rock and pop songs released in the 80s and pretty much all of them are better than Angels.There must be more than a dozen songs in the last 25 years that deserve this award more.I think the person as opposed to the song has been voted for here.There must be a thousand better songs than a formulated cheesy pop song for kids.Williams' track beat songs by Will Young, Queen, Kate Bush and Joy Division in a vote by BBC Radio 2 listeners to mark 25 years of the UK music industry ceremony.But I think there are a lot more outstanding songs / music out there that influenced music today, unfortunately they were left out of the list.A sad day for music  It's not the type of music I normally like, but even as a diehard rock fan, I recognise that it is a good song and appelas to most people.Angels is an overrated song, that got tiresome even before you had finished listening to it.The success of Angels at this years Brits reflects poorly on the state of British music over the last 25 years.It is a song that has united the generations and will continue to be played for many years to come.McFly won the best pop act prize, and Gwen Stefani picked up the best international female artist award.I find it hard to believe that 'Angels' is the best we have to show for the past 25 years!The flamboyant act scored a hat-trick in the international categories, winning the best group, best album and best newcomer awards.What about all the REAL artists out there over the last 25 years - the list is endless, but Robbie Williams doesn't even come close.It should have been Joy Division.Those guys have played an influential part in shaping modern day music while Angels remains yet another pop song.it's a terrible song, voted for by the masses who don't have the brains to appreciate innovative and exciting music.Little Britain comedy duo Matt Lucas and David Walliams presented the best song prize to Robbie Williams dressed as his former Take That colleagues Gary Barlow and Howard Donald, leading him to quip he was \"always the talented man of the band\".Some people will adopt their slightly snobby stances, but Angels has hit home with a far larger audience than any other song.The song is overplayed and oversentimental.Granted angels is a good song, however it really wasn't up against any other proper competition.Right enough, it is better than some of the others in this catergory, for example, what was Will Young doing being nominated in the first place - he is alright but the song isn't that good!There were other great songs in the category... but somebody had to win!Much better songs and more timeless.Phil Collins doesn't deserve awards for all the good songs he wrote?Also, why weren't the Stones there, David Bowie, etc, there are so many greater songs than Angels...I wonder if it was simply the fact that Robbie wasn't getting more awards so they had to make one up for him!The US band, who opened the show with Take Your Mama, won the best international act and newcomer awards, as well as best international album.Franz Ferdinand, who were shortlisted in five categories, won best rock act and best British group, an award they dedicated to late DJ John Peel.It's a mediocre, sentimental and safe song.Keane won best British album and breakthrough act.If this is the song against which all others are judged, then musicians may as well give up.Natasha Bedingfield - in the running for best British female and best pop act - performed with her brother Daniel for the first time at Wednesday's event.A band who, through two albums, have had a bigger impact on music, and continue to do so, over the last 25 years than Robbie Williams ever will.Soppy rubbish at best.It just goes to show that the british public do not have a clue about good quality music when they pick Robbie Williams over the beautifully talented Kate Bush and Joy Division.That song has become such a bane to me that I have developed a Pavlovian response to the word 'Angels' where I thrash around, and scream \"no no no no no\" until someone tells me \"the radio's off\".It seems obvious to me that people who like Robbie are people who don't particularly like music all that much.The song makes me calm and serene and happy.The Queen's song was lackluster, and apart from Kate Bush, the other choices were pathetic!Will Young won the best single prize for Your Game.Robbie has millions of loyal fans, while even non-fans know the words to angels.If you voted for it - you should feel ashamed of yourself - you probably only know a dozen songs or so don't you - so where do get off applying this uninformed filter and casting this ridiculous vote.I think its a brilliantly written song with different meanings to different people.Viewers of digital music TV channel MTV Base voted Stone the winner in the best urban act category.I'm rapidly redifining 'best' in my own head now to mean 'most gratuitously played at weddings and funerals because people think it has deep meaning'.There's not a song done by anyone with more emotion and feeling.Sure Robbie is talented and produces excellent material, but this is not the best record.It's a song that will be played forever and bridges all age groups.They weren't cool at the time, but because they are cool again now shows that the songs have greater longevity than people think.Robbie was a deserved winner.Why must 'best' always come down to most commercially popular?Just like Robbie.After beating Amy Winehouse, Jamelia, Natasha Bedingfield and PJ Harvey to the best British female prize, Joss Stone said: \"I don't know what to say.Glasgow group Franz Ferdinand won two prizes, as did Keane and Joss Stone, who was voted best urban act by digital TV viewers.Best British male artist winner Mike Skinner - aka The Streets - does not usually attend award ceremonies, but the Birmingham hip-hop artist performed his hit Dry Your Eyes at the ceremony.Whenever the song comes on the radio I turn the radio up, smile and sing along (very badly, that is why the radio has to be turned up to drown my voice out).Then again, well done Robbie, good show.But they missed out on best British live act, which went to Muse.Whenever we have these awards it is always 'artists' from the past five years that seem to win the best of the best...We forget about the late 80s and early 90s for example."}