{"raw_text": "T in the Park sells out in days\n \n Tickets for Scotland's biggest music festival have sold out in record time, five months before the event is held.\n \n The 12th annual T in the Park festival, which takes place at Balado near Kinross in July, sold out just four days after the line-up was announced. Green Day, the Foo Fighters and Keane are among the acts that had already been lined up to appear at the event. However, the organisers have revealed Scots favourites Travis as well as soulman James Brown will also appear.\n \n Last year tickets sold out 10 weeks before the festival but organisers confirmed that all 130,000 for the two-day event had been sold. Geoff Ellis, CEO of festival organisers Big Day Out Ltd, said this year's event promises to be the best yet. \"After last year's sell-out, we did think this year's event would sell slightly earlier, however this is way beyond our expectations,\" Mr Ellis said.\n \n \"We are extremely proud that fans are so excited about T in the Park that they have made absolutely sure that their place at Balado is booked for 2005, and we will deliver one of the greatest events yet for them in July.\" More than 120 acts will play on eight stages over the weekend of 9 and 10 July. Brit Award winners Keane and The Streets are among the main attractions, while The Killers and dance act The Prodigy are also on the bill. Both Green Day and The Foo Fighters last played at the festival in 2002, the same year Oasis and Basement Jaxx were among the headline acts.\n", "llama3.2:1b": "T in the Park sells out quickly. Tickets sold out in just four days after announcement. The festival takes place July 9-10 near Kinross, Scotland. Acts including Green Day, Foo Fighters, Keane, Travis, and soulman James Brown will perform.", "llama3.2:3b": "Tickets for T in the Park sold out in four days after the line-up was announced, with all 130,000 tickets sold five months before the event. The festival will feature over 120 acts on eight stages, including Green Day, Keane, and Travis. Organisers say this year's event promises to be the best yet, following last year's sell-out in 10 weeks' time.", "gemma2:2b": "T in the Park's tickets sold out four days after the lineup was announced, selling all 130,000 for the two-day event five months before July's festival.  Acts like Green Day, The Foo Fighters, Keane, Travis and James Brown will perform, with over 120 acts playing across eight stages on July 9th and 10th. \n", "qwen2.5:0.5b": "A major music festival has sold out just four days before it takes place, with tickets for the 12th annual T in the Park event being sold out just after its announcement. Tickets for Scottish acts Travis as well as James Brown are also available. More than 120 acts will play on eight stages over the weekend of 9 and 10 July at Balado near Kinross, Scotland.", "qwen2.5:1.5b": "The 12th annual T in the Park music festival has sold out four days after it was announced due to high demand from fans of Green Day, The Foo Fighters, Keane, Travis, James Brown, Soulman James Brown, Brit Award winners Keane and The Streets, and dance act The Prodigy. Geoff Ellis predicts this year's event will be the best yet with more than 120 acts playing on eight stages over two days in July 2005.", "qwen2.5:3b": "T in the Park sells out in days, five months before event. Line-up includes Green Day, Foo Fighters, Keane, Travis, James Brown. Sold out 130,000 tickets just four days after announcement last year. Organizers predict best yet with over 120 acts playing across eight stages from July 9-10.", "opencoder:1.5b": "T in the Park sells out in days. Tickets for Scotland's biggest music festival have sold out in record time, five months before the event is held. The 12th annual T in the Park festival, which takes place at Balado near Kinross in July, sold out just four days after the line-up was announced. Green Day, the Foo Fighters and Keane are among the acts that had already been lined up to appear at the event. However, the organisers have revealed Scots favourites Travis as well as soulman James Brown will also appear. Last year tickets sold out 10 weeks before the festival but organisers confirmed that all 130,000 for the two-day event had been sold. Geoff Ellis, CEO of festival organisers Big Day Out Ltd, said this year's event promises to be the best yet. \"After last year's sell-out, we did think this year's event would sell slightly earlier, however this is way beyond our expectations,\" Mr Ellis said. \"We are extremely proud that fans are so excited about T in the Park that they have made absolutely sure that their place at Balado is booked for 2005, and we will deliver one of the greatest events yet for them in July.\" More than 120 acts will play on eight stages over the weekend of 9 and 10 July. Brit Award winners Keane and The Streets are among the main attractions, while The Killers and dance act The Prodigy are also on the bill. Both Green Day and The Foo Fighters last played at the festival in 2002, the same year Oasis and Basement Jaxx were among the headline acts.\n", "smollm:1.7b": "The summary is concise, preserving key ideas and details from the original text while omitting unnecessary information. It captures the main points of the text without adding or changing them. The summary should be written in a clear and neutral tone, avoiding any opinions or explanations.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about T in the Park's performance sold out quickly. First, it says that tickets sold out five months before the event. Then, last year at a similar festival, tickets sold out 10 weeks earlier. So now, they're even quicker. They mention that they have some fans excited because they'll all be booked by July and plan to do something great there in 2005.\n\nI should keep key details like the time it sells out, the fact that it's quick compared to last year, and mention the acts participating this year. I don't need any extra information or explanations, just a clear summary.\n</think>\n\nThe tickets for T in the Park's 12th annual festival sold out five months before the event held, faster than last year when they were sold out 10 weeks earlier. With several fans already confirmed to attend, the organisers are aiming for a sell-out in July, planning to give fans an unforgettable experience in 2005.", "tinyllama:1.1b": "Tickets for T in the Park have sold out within days, with over 120 acts set to perform on eight stages across two days at Balado in July. The festival sold out four days after its lineup was announced, and organisers expect that all 130,000 tickets will be gone before summer starts. Expecting fans are described as \"extremely proud\" of their booking for the event that promises to deliver one of the biggest lineups ever. Acts such as Keane and The Street will perform across two stages on July 9th and 10th, while Brit Award winners Keane and The Killers have also been confirmed for the festival. The Prodigy and Oasis were among the headliners in 2002, but both bands performed at the event last year.", "tinydolphin:1.1b": " T in the Park has sold out, marking a significant achievement for festival organizers. This year's event will be the best yet, with thousands of eager fans having their names on the line to witness Travis, James Brown, and other notable artists perform. Balado in Kinross, Scotland, will host the star-studded festival from July 9th to 10th, providing an unforgettable experience for attendees.", "phi:2.7b": " The T in the Park music festival in Scotland sells out in record time with 130,000 tickets already sold for the two-day event. This is five months before the festival takes place and all 130,000 tickets have been purchased. Some of the main attractions include Green Day, The Foo Fighters, and Keane, along with other popular acts such as Travis and James Brown.\n", "orca-mini:3b": " T in the Park sells out in record time with Green Day, the Foo Fighters and Keane as headliners. Scots favourites Travis and soulman James Brown will also perform. All 130,000 tickets for the two-day event have been sold. Last year's festival was a sellout 10 weeks before it took place, but this year's event has already sold all 130,000 tickets. The organisers are confident that the 2005 festival will be the best yet.", "hermes3:3b": "T in the Park tickets sell out in 4 days, 5 months before event; all 130k sold last year, expectations exceeded.", "stablelm-zephyr:3b": "T in the Park music festival's sold-out tickets were recorded within four days of announcing the line-up, occurring five months before the event. The festival will feature over 120 acts performing on eight stages across two days, with headliners including Green Day, Foo Fighters, Keane, The Killers, and The Prodigy. Travis and soul artist James Brown will also join the lineup. Festival organizer Big Day Out Ltd expressed pride in fans' enthusiasm and promised another great event in 2005.", "chatgpt-4o-latest": "Tickets for Scotland's T in the Park music festival sold out in a record four days, five months before the event. The 12th annual festival, held in July at Balado near Kinross, features acts like Green Day, Foo Fighters, Keane, Travis, and James Brown. Organisers confirmed all 130,000 tickets for the two-day event were sold, surpassing expectations. CEO Geoff Ellis expressed pride in fans' enthusiasm and promised an exceptional event. More than 120 acts will perform across eight stages, including Brit Award winners Keane and The Streets, as well as The Killers and The Prodigy.", "stablelm2:1.6b": "Tickets for T in the Park, Scotland's largest music festival, sold out in just four days after the lineup announcement, with Green Day, Foo Fighters, Keane, Travis, James Brown and more than 15 other acts set to perform. Last year, tickets sold weeks before the event, while this year's promises to be the best yet. Over eight stages, more than 19 acts will play on July 9th and 10th.", "granite3.1-dense:2b": "T in the Park, Scotland's premier music festival, has experienced an unprecedented early sellout five months prior to its July date at Balado near Kinross. Line-ups include Green Day, Foo Fighters, Keane, Travis, and James Brown, with over 130,000 tickets sold for the two-day event. This year's event promises to surpass last year's record of 10 weeks before selling out, as announced by Big Day Out Ltd CEO Geoff Ellis. The festival will feature more than 120 artists across eight stages, including Keane, The Streets, The Killers, and The Prodigy, showcasing a diverse lineup that also includes Brit Award winners.", "reference": "Green Day, the Foo Fighters and Keane are among the acts that had already been lined up to appear at the event.Geoff Ellis, CEO of festival organisers Big Day Out Ltd, said this year's event promises to be the best yet.Last year tickets sold out 10 weeks before the festival but organisers confirmed that all 130,000 for the two-day event had been sold.Both Green Day and The Foo Fighters last played at the festival in 2002, the same year Oasis and Basement Jaxx were among the headline acts.The 12th annual T in the Park festival, which takes place at Balado near Kinross in July, sold out just four days after the line-up was announced."}