{"raw_text": "Rocker Doherty in on-stage fight\n \n Rock singer Pete Doherty has been involved in a fight with his band's guitarist at their biggest gig to date.\n \n Babyshambles played for 5,000 fans at London's Brixton Academy on Tuesday. The former Libertines singer traded blows with guitarist Patrick Walden. They were separated and bundled off stage before returning to end the set. The show was earlier held up due to audience overcrowding. On Monday Doherty faced blackmail and robbery charges in court, which he denies. He is out on £50,000 bail and the judge agreed to extend his 2200 GMT curfew deadline by two hours so he could play the Brixton gig.\n \n Babyshambles, which he formed after his acrimonious departure from the Libertines, played a warm-up show at The Garage, north London, on Monday. On Tuesday, Doherty and his three bandmates were introduced to the crowd by Mick Jones, the former Clash guitarist who produced the Libertines' second album. Babyshambles took the stage to a frenzied reception at 2200 GMT, launching into their last single, Killamangiro, which reached number eight in December. But the group had to stop during the next song to persuade fans not to push forward and allow security guards to pull people out of the crush. Doherty appealed to fans to calm down, saying: \"There's a few people getting hurt down the front, you've got to move back.\"\n \n The music resumed minutes later but after several more songs, the singer appeared to accidentally disconnect Walden's guitar, leading the pair to trade kicks and punches. Bouncers stepped in and the band left the stage, but returned after five minutes and finished their 50-minute performance with no further trouble. Doherty, 25, had to be home by midnight to observe the curfew, which is one of the conditions of his bail. On Monday, the judge agreed to allow him to perform on condition that requests for changes to his bail terms were \"not too regular an occurrence\". The singer was arrested with fellow musician Alan Wass on 2 February after an alleged dispute with documentary-maker Max Carlish at a London hotel. They are next due in court on 18 April.\n", "llama3.2:1b": "Pete Doherty's band Babyshambles played to 5,000 fans at Brixton Academy on Tuesday, but guitarist Patrick Walden got into a fight with him before returning to the stage. The show was delayed and eventually finished without further incident after a heated exchange between the two musicians resulted in kicks and punches.", "llama3.2:3b": "Pete Doherty got into a fight with his guitarist Patrick Walden during Babyshambles' gig at London's Brixton Academy. The show was stopped briefly, then resumed without further incident after Doherty disconnected Walden's guitar. The singer had been in court earlier that day on blackmail and robbery charges, for which he denies responsibility.", "gemma2:2b": "Pete Doherty fought with his guitarist during a Babyshambles performance at Brixton Academy after crowd issues caused the music to stop and security removed some fans.  Doherty faces legal charges and was allowed to perform under specific bail conditions, including curfew. The incident is part of ongoing legal issues involving Doherty and another musician. \n", "qwen2.5:0.5b": "Pete Doherty and Babyshambles have been involved in a big fight, separated and bundled off stage before returning to end the set. They were earlier held up because of audience overcrowding, but later faced charges for blackmail and robbery. The show was at London's Brixton Academy on Tuesday, where they played a warm-up session with Babyshambles at 2200 GMT.", "qwen2.5:1.5b": "Pete Doherty fought with bandmate Patrick Walden during Babyshambles' performance at Brixton Academy, leading to a curfew and cancellation of the show due to crowd control issues. Doherty was also charged earlier for blackmail and robbery and is on bail until 28 April.", "qwen2.5:3b": "Pete Doherty of Babyshambles was involved in a fight with guitarist Patrick Walden during his band's gig at Brixton Academy, involving 5,000 fans. The show had to be cut short by security and restarted after an initial interruption due to overcrowding. This incident occurred against the backdrop of Doherty facing charges related to blackmail and robbery, for which he was out on £50,000 bail with a curfew until 00:20 GMT.", "opencoder:1.5b": "Rocker Doherty, a former fan who has played on stage for several years, has had one of the most successful shows since his departure from the Libertines in Brixton, London, a spectacle which marked a new chapter in rock music and entertainment history. The album's main attraction is the duo's collaboration with guitarist Patrick Walden, who was initially reluctant to play at the concert but ended up forming Babyshambles after he left the Libertines. This event provided a warm-up experience for fans who missed out on the concert's rigorous set.\nThe band played 5,000 fans on Wednesday at Brixton Academy, a stage before returning and closing the show. The musician traded blows with guitarist Patrick Walden during the show, which was initially disappointing as he had never been a fan of him in any form.\nFans took part in the crowd and the show went up to 2,200 GMT, playing at the same time. But, as they were dissecting the group's reactions and trying to calm down their situation, the pair agreed to pull people out of the show. They demanded a change to the bail terms which was not regular.\nThe music resumed with a few minutes later but it got progressively harder during several songs, especially after a confrontation with a documentary-maker at a London hotel.\nOne night, the singer, who is known to make up on the guitar, was arrested following an alleged dispute. It was an arrest of a former fan who was facing similar issues and sparked interest in a new music album.\nThe fans were not happy about it and decided to calm down. The judge agreed to allow him to perform for condition that requests change to bail terms.\nAfter some more songs the singer disconnected Walden's guitar, which left him engaged with his side guitarist Patrick Walden. The duo traded kicks and punches which allowed them to trade in the band's performance at the concert.\nThe music continued playing until five minutes later and Babyshambles finished their 50-minute gig with no trouble. The singer had been on condition that requests for changes to bail terms, but he had not received any formal permission.\nAfter hearing this it was decided that he needed a new album released on 18 April after the judge allowed him to perform in case of further disruptions.\n", "smollm:1.7b": "Rocker Doherty in on-stage fight", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely while preserving key ideas and details. Let me start by reading through each paragraph carefully.\n\nFirst paragraph introduces Pete Doherty and his fight with his guitarist during a gig. He traded blows with Walden, which separated them and they were bundled off stage. The show was delayed due to overcrowding. Tuesday's part talks about the fight scene on Brixton Academy.\n\nSecond paragraph details the band's performance at The Garage. They received a warm-up before a single called \"Killamangiro.\" However, fans got pushed out by guards when they tried to move past them. Doherty urged fans to calm down after hearing noise complaints. He also mentions being late for an event and later being home due to his bail conditions.\n\nThird paragraph explains the music situation on Tuesday. After some songs, there was a guitar incident where Walden's sound went out, causing a trade of kicks and punches. Bouncers stepped in, and the band left but returned after five minutes. They finished their performance without issues. Doherty is being held with Alan Wass on February 18th.\n\nI need to extract the main points: Pete fighting his guitarist on a gig, the aftermath of the fight, the band's performance at The Garage, the music mishap leading to some fans getting hurt, and the ongoing legal proceedings for both dancers.\n</think>\n\nPete Doherty fought with his guitarist during a gig, which separated them. They were removed from stage and pulled away due to overcrowding. On Tuesday, he performed at The Garage as part of Babyshambles, playing \"Killamangiro.\" Fans were pushed out by security guards. After some songs, Walden's guitar played an audio glitch, leading to a trade-off in the set. They returned late but finished their performance without issues. Doherty and Wass are being held on February 18th for potential bail issues.", "tinyllama:1.1b": "Rocker Doherty, member of the now-defunct Libertines band, got involved in a fight with his guitarist Patrick Walden at their biggest gig to date when they clashed on stage during Babyshaimbles' last performance at The Garage in North London. A judge ruled that Doherty would be allowed to perform on condition that requests for changes to his bailee terms were \"not too regular an occurrence\". He was arrested with another musician, Alan Wass, following allegations of a dispute with documentary-maker Max Carlish at a hotel. The charges against them have been suspended until their next appearance in court on 18 April.", "tinydolphin:1.1b": " A popular rock band, Babyshambles, faced a heated on-stage altercation between guitarist Patrick Walden and rocker Pete Doherty during their gig at London's Brixton Academy. The incident resulted in Doherty being held in £50,000 bail and the curfew extended by an additional two hours, allowing them to continue playing despite the tight crowd constraints.", "phi:2.7b": " In the Brixton Academy, singer Pete Doherty and guitarist Patrick Walden got into a fight during Babyshambles' 5,000-person performance of their latest single \"Killamangiro\". The show had to be stopped several times because of overcrowding. Doherty was also charged with blackmail and robbery at court on Monday but was later allowed to perform at the Brixton gig by receiving £50,000 bail and extended curfew time. On Tuesday, he got into a scuffle with Walden during their performance before leaving the stage briefly to calm down the crowd. The song \"Killamangiro\" became Babyshambles' last single which reached number 8 in December. Doherty had to leave by midnight due to his curfew and was arrested on February 2 after getting into a dispute at a hotel.\n", "orca-mini:3b": " Pete Doherty got into a fight with his Babyshambles guitarist during their biggest gig. The incident occurred at the London's Brixton Academy where Babyshambles played for 5,000 fans.", "hermes3:3b": "Pete Doherty (Rocker, Babyshambles) fights guitarist Patrick Walden during gig; trade blows on Brixton Academy stage.", "stablelm-zephyr:3b": "Rock singer Pete Doherty had a fight with his band's guitarist, Patrick Walden, during their performance at London's Brixton Academy. The show was delayed due to overcrowding, and Doherty faced blackmail and robbery charges the previous day in court, which he denied. He was granted bail and extended curfew hours to complete his performances. Babyshambles, the band Doherty formed after leaving the Libertines, performed with a warm reception before the fight occurred. After the incident, they finished their 50-minute set without further trouble.", "chatgpt-4o-latest": "Rock singer Pete Doherty was involved in a fight with Babyshambles guitarist Patrick Walden during their biggest gig at London's Brixton Academy. The altercation occurred after Doherty accidentally disconnected Walden's guitar, leading to an exchange of kicks and punches before security intervened. The band briefly left the stage but returned to complete their set. Earlier, the concert was delayed due to audience overcrowding. Doherty, out on £50,000 bail for blackmail and robbery charges, had his curfew extended to perform. The judge warned against frequent bail modifications. Doherty was arrested in February after an alleged dispute with filmmaker Max Carlish and is due in court on 18 April.", "stablelm2:1.6b": "Rocker Pete Doherty got into a fight with his band's guitarist during their biggest gig, Babyshambles played at the Brixton Academy. Doherty and Patrick Walden traded blows before being separated and removed from the stage. This occurred after Monday's court hearing when Doherty faced charges of blackmail and robbery, which he denies. He was out on bail and a judge extended his curfew by two hours for his gig at Brixton. Babyshambles played a warm-up show at The Garage before their main performance. After the warm-up show, Doherty tried to calm fans who were pushing forward during intermission, warning that \"a few people get hurt down front,\" urging them to move back. Doherty and his bandmates returned to finish the set without further issues. Due to a curfew on bail conditions, Doherty had to be home by midnight after finishing five songs. He was next due in court in April.", "granite3.1-dense:2b": "Pete Doherty, former Libertines singer and Babyshambles frontman, was involved in an on-stage altercation with his guitarist, Patrick Walden, during their gig at London's Brixton Academy for 5,000 fans. The event, held to promote Babyshambles' upcoming album, started with audience overcrowding issues and was previously delayed due to crowd control. Doherty, who faced court charges on Monday (denying blackmail and robbery), had his 2200 GMT curfew extended for the performance.\n\nThe fight broke out after Doherty accidentally disconnected Walden's guitar during a song. Bouncers intervened, but the band returned to finish their 50-minute set. The singer was required to be home by midnight due to his bail conditions. On Monday, a judge agreed to allow him to perform under specific terms, stating that requests for changes were not frequent. Doherty and Wass were arrested on February 2 in connection with an alleged dispute at a London hotel. They are next scheduled to appear in court on April 18.", "reference": "Babyshambles, which he formed after his acrimonious departure from the Libertines, played a warm-up show at The Garage, north London, on Monday.Rock singer Pete Doherty has been involved in a fight with his band's guitarist at their biggest gig to date.On Tuesday, Doherty and his three bandmates were introduced to the crowd by Mick Jones, the former Clash guitarist who produced the Libertines' second album.On Monday Doherty faced blackmail and robbery charges in court, which he denies.Doherty, 25, had to be home by midnight to observe the curfew, which is one of the conditions of his bail.The former Libertines singer traded blows with guitarist Patrick Walden.Babyshambles played for 5,000 fans at London's Brixton Academy on Tuesday.He is out on £50,000 bail and the judge agreed to extend his 2200 GMT curfew deadline by two hours so he could play the Brixton gig."}