{"raw_text": "Musicians to tackle US red tape\n \n Musicians' groups are to tackle US visa regulations which are blamed for hindering British acts' chances of succeeding across the Atlantic.\n \n A singer hoping to perform in the US can expect to pay $1,300 (£680) simply for obtaining a visa. Groups including the Musicians' Union are calling for an end to the \"raw deal\" faced by British performers. US acts are not faced with comparable expense and bureaucracy when visiting the UK for promotional purposes.\n \n Nigel McCune from the Musicians' Union said British musicians are \"disadvantaged\" compared to their US counterparts. A sponsor has to make a petition on their behalf, which is a form amounting to nearly 30 pages, while musicians face tougher regulations than athletes and journalists. \"If you make a mistake on your form, you risk a five-year ban and thus the ability to further your career,\" says Mr McCune.\n \n \"The US is the world's biggest music market, which means something has to be done about the creaky bureaucracy,\" says Mr McCune. \"The current situation is preventing British acts from maintaining momentum and developing in the US,\" he added.\n \n The Musicians' Union stance is being endorsed by the Music Managers' Forum (MMF), who say British artists face \"an uphill struggle\" to succeed in the US, thanks to the tough visa requirements, which are also seen as impractical. The MMF's general secretary James Seller said: \"Imagine if you were an orchestra from the Orkneys? Every member would have to travel to London to have their visas processed.\"\n \n \"The US market is seen as the holy grail and one of the benchmarks of success, and we're still going to fight to get in there. \"It's still very important, but there are other markets like Europe, India and China,\" added Mr Seller. A Department for Media, Culture and Sport spokeswoman said: \"We're aware that people are experiencing problems, and are working with the US embassy and record industry to see what we can do about it.\" A US Embassy spokesman said: \"We are aware that entertainers require visas for time-specific visas and are doing everything we can to process those applications speedily.\" \"We are aware of the importance of cultural exchange and we will do our best to facilitate that,\" he added.\n", "llama3.2:1b": "Musicians from the UK are calling on US authorities to change visa regulations, which they say is hindering their chances of performing in the US. The cost of obtaining a US visa can be as high as $1,300 (£680), compared to £20-£30 for a similar process in the UK. Musicians argue that this is unfair and puts them at a disadvantage compared to their US counterparts, who are not subject to the same regulations and bureaucracy when visiting the UK for promotional purposes.", "llama3.2:3b": "Musicians' groups in the UK, including the Musicians' Union and Music Managers' Forum, are calling for an end to visa regulations that make it difficult for British acts to perform in the US. The cost of obtaining a visa can be $1,300 (£680) and involves lengthy paperwork, with a sponsor required to fill out nearly 30 pages of form. The groups argue that this creates an unfair disadvantage compared to US artists, who face less bureaucracy when visiting the UK for promotional purposes.", "gemma2:2b": "British musicians face difficulties obtaining US visas, leading to increased costs and complex procedures compared to American acts. Musicians' groups like the Musicians' Union and Music Managers' Forum are calling for reform, citing disadvantages in visa regulations and bureaucratic processes. They argue these regulations hinder British artists' success in the US market, which is considered a key benchmark of achievement. The UK government and US Embassy are acknowledging the issue and working towards solutions to facilitate cultural exchange. \n", "qwen2.5:0.5b": "US musicians facing visa regulations, British acts' chances hindered by US visa restrictions.\nMusicians' groups hope to negotiate with US authorities to reduce costs on visa fees for British performers.", "qwen2.5:1.5b": "Musicians' groups in Britain, including the Musicians' Union, plan to challenge US visa regulations seen as hindering British acts' chances of success across the Atlantic due to high fees and bureaucracy.", "qwen2.5:3b": "Musicians' groups aim to address US visa regulations hindering British acts in the US market. The Union argues for an end to burdensome $1,300 visa fees, comparing unfavorably with US performers. Current regulations are seen as disadvantageous and impractical, particularly for smaller or remote artists. The Musicians' Union and Music Managers' Forum support easing requirements, highlighting the importance of maintaining momentum in the lucrative US market despite difficulties. Efforts to improve processes involve collaboration between UK government agencies and the US embassy.", "opencoder:1.5b": "Musicians to tackle US red tape\n\nA singer hoping to perform in the US can expect to pay $1,300 (£680) simply for obtaining a visa. Groups including the Musicians' Union are calling for an end to the \"raw deal\" faced by British performers. US acts are not faced with comparable expense and bureaucracy when visiting the UK for promotional purposes. Nigel McCune from the Musicians' Union said British musicians are \"disadvantaged\" compared to their US counterparts. The US is the world's biggest music market, which means something has to be done about the creaky bureaucracy.\n", "smollm:1.7b": "The summary is concise, preserving key ideas and details from the original text while omitting unnecessary information. The main points include:\n\n1. Musicians' groups are to tackle US visa regulations which are blamed for hindering British acts' chances of succeeding across the Atlantic.\n2. A singer hoping to perform in the US can expect to pay $1,300 (£680) simply for obtaining a visa. Groups including the Musicians' Union are calling for an end to the \"raw deal\" faced by British performers. US acts are not faced with comparable expense and bureaucracy when visiting the UK for promotional purposes.\n3. Nigel McCune from the Musicians' Union said British musicians are \"disadvantaged\" compared to their US counterparts. A sponsor has to make a petition on their behalf, which is a form amounting to nearly 30 pages, while musicians face tougher regulations than athletes and journalists. \"If you make a mistake on your form, you risk a five-year ban and thus the ability to further your career,\" says Mr McCune.\n4. The US is the world's biggest music market, which means something has to be done about the creaky bureaucracy. The current situation is preventing British artists from maintaining momentum and developing in the US, according to the Musicians' Union. The MMF's general secretary James Seller said British artists face \"an uphill struggle\" to succeed in the US, thanks to the tough visa requirements, which are also seen as impractical. The MMF's general secretary James Seller said: \"Imagine if you were an orchestra from the Orkneys? Every member would have to travel to London to have their visas processed.\"\n5. The US market is seen as the holy grail and one of the benchmarks of success, and we're working with the US embassy and record industry to see what we can do about it. We are aware that entertainers require visas for time-specific visas and are doing everything we can to facilitate that. \"We are aware of the importance of cultural exchange and we will do our best to facilitate that,\" he added.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text. Let me read through it first.\n\nThe text is about musicians facing US visa regulations, which are criticized as hindering British acts. They mention a singer paying $1,300 for a visa, compared to athletes and journalists who face similar or more cumbersome regulations when visiting the UK. There's a musician named Nigel McCune from the Musicians' Union who argues that British musicians are disadvantaged due to the bureaucracy.\n\nThe MMF, the Music Managers' Forum, supports this stance, saying British artists in the US face tough visa requirements which they see as impractical and an uphill battle. The current US market is supposed to be a holy grail, but they're still fighting entry. Media and sports activities require visas for time-specific applications. They’re working with the US embassy and record industry to address issues.\n\nI should focus on key ideas: Musicians facing US visa regulations, cost of obtaining a visa, comparison between British acts and athletes/journalists, McCune's argument about disadvantaged status, MMF’s endorsement, other markets they’re fighting over, efforts to make it easier for artists in the US.\n\nNow, putting this all together into a concise summary.\n</think>\n\nMusicians face US visa regulations that hinder British acts, which are compared to athletes and journalists. A singer pays $1,300 for a visa, while others pay more or face similar regulations when visiting the UK. Nigel McCune argues British musicians are disadvantaged due to bureaucracy. The Music Managers' Forum supports this stance, noting tough visa requirements as impractical. They aim to make US markets like Europe, India, and China accessible while addressing cultural exchange needs, with efforts to streamline visas for artists.", "tinyllama:1.1b": "Musician groups, including the Music Managers' Forum (MMF), have called for an end to the raw deal faced by British performers when attempting to enter the United States visa-free due to insufficient buruecracies and bureaucracy. In a recent petition, musicians are being accused of being disadvantaged compared to their US counterparts. The current process is preventing British acts from developing in the US market, as the US market is considered one of the benchmarks for success in the industry. MMF's general secretary James Seller stated that a visa-free regime is still essential and that there are other market segments like Europe, India, and China to tackle the challenges faced by British performers in entering the US market. The Department for Media, Culture and Sport (DMC) and US Embassy have acknowledged these issues but did not provide a timeline for resolving them. The DMC acknowledged that entertainers require visas for specific visa-free periods, and are doing their best to process those applications as quickly as possible.", "tinydolphin:1.1b": " The Musicians' Union, a British-based music rights organization representing many musicians and other performers, is urging the US government to reform its visa regulations for British artists. They argue that these regulations make it difficult for musicians from Britain to compete with their American counterparts in terms of access to the massive U.S. music market. The union's position is supported by other groups like the MMF, which represents orchestra members who traveled to London to have their visas processed. Both organizations see the current visa process as a \"raw deal\" for British performers and are calling on the US government to reform these regulations.", "phi:2.7b": " Musicians' groups in the UK want to remove US visa regulations that are preventing British acts from performing across the Atlantic. The cost of obtaining a visa is $1,300 for a singer, compared to minimal expense and no bureaucracy for American acts visiting the UK for promotional purposes. UK musicians face tougher regulations than athletes and journalists when applying for visas, which could result in a five-year ban on their career. Musicians' Union and Music Managers' Forum are calling for an end to this \"raw deal.\"\n", "orca-mini:3b": " The Musicians' Union is calling for an end to the \"raw deal\" faced by British performers when it comes to US visa regulations, which are blamed for hindering their chances of success across the Atlantic. Musicians have to pay $1,300 simply for obtaining a visa, and they face tougher regulations than athletes and journalists. The UK has a larger music market than the US, but British artists face an uphill struggle to succeed in the US due to the tough visa requirements. The MMF supports the Musicians' Union stance, saying that the visa requirements are impractical for orchestras from the Orkneys. The UK government is working with the US embassy and record industry to see what can be done about it.", "hermes3:3b": "Musicians groups aim to reduce US visa costs & bureaucracy for British acts, as they claim disadvantage compared to US counterparts.", "stablelm-zephyr:3b": "Musicians in the UK, particularly the Musicians' Union, are calling for an end to the US visa regulations that they believe hinder British acts from succeeding in the American market. The process of obtaining a visa costs around $1,300 and involves a lengthy and bureaucratic form. British musicians face tougher regulations than athletes and journalists, leading to potential bans if mistakes are made on the form. The Musicians' Union claims that US counterparts do not face comparable expenses and bureaucracy when visiting the UK for promotional purposes. They argue that the creaky bureaucracy is preventing British acts from maintaining momentum and developing in the US market, which is seen as the world's biggest music market. The Department for Media, Culture and Sport is aware of the issues faced by musicians and is working with the US embassy and record industry to find solutions.", "chatgpt-4o-latest": "Musicians' groups, including the Musicians' Union and the Music Managers' Forum, are campaigning against US visa regulations that they say hinder British artists' success in America. British musicians face high costs and complex bureaucracy, unlike their US counterparts visiting the UK. The process requires a sponsor and extensive paperwork, with mistakes potentially leading to a five-year ban. The restrictions are seen as impractical, especially for large groups like orchestras. The US remains a key market, but alternative markets like Europe, India, and China are also being considered. The UK government and US embassy acknowledge the issue and are working to improve the process.", "stablelm2:1.6b": "Musicians' groups plan to tackle US visa regulations, blamed for hindering British acts' success in the country. A singer must pay $1 (£1) simply for obtaining a visa, while UK performers face less bureaucratic processes when visiting the US for promotional purposes. The Musicians' Union is calling for an end to this \"raw deal.\" US acts are not similarly burdened with expense and rules when performing in the UK. British artists face difficulty in maintaining momentum and developing their careers in the US market due to visa requirements, according LSE's James Seller.", "granite3.1-dense:2b": "British musicians face significant challenges in performing in the US due to burdensome visa regulations, according to the Musicians' Union and the Music Managers' Forum (MMF). These groups argue that obtaining a visa costs £680 per artist and involves lengthy paperwork, with errors potentially leading to a five-year ban. This process is more complex than those for US performers visiting the UK for promotional purposes. The MMF's James Seller likens it to an \"orchestra from the Orkneys\" needing all members to travel to London for visa processing, highlighting the impracticality of current requirements. Despite these obstacles, the US remains a crucial market for British artists. The Department for Media, Culture and Sport is working with the US embassy and record industry to address these issues, recognizing their importance in cultural exchange.", "reference": "Nigel McCune from the Musicians' Union said British musicians are \"disadvantaged\" compared to their US counterparts.A US Embassy spokesman said: \"We are aware that entertainers require visas for time-specific visas and are doing everything we can to process those applications speedily.\"The Musicians' Union stance is being endorsed by the Music Managers' Forum (MMF), who say British artists face \"an uphill struggle\" to succeed in the US, thanks to the tough visa requirements, which are also seen as impractical.Musicians' groups are to tackle US visa regulations which are blamed for hindering British acts' chances of succeeding across the Atlantic.\"The US is the world's biggest music market, which means something has to be done about the creaky bureaucracy,\" says Mr McCune.\"The current situation is preventing British acts from maintaining momentum and developing in the US,\" he added.A singer hoping to perform in the US can expect to pay $1,300 (£680) simply for obtaining a visa."}