{"raw_text": "Angels 'favourite funeral song'\n \n Angels by Robbie Williams is the song Britons would most like played at their funeral, a survey has suggested.\n \n While the melancholy hit topped the UK poll, Europeans favoured Queen's more upbeat anthem The Show Must Go On as their first choice. Frank Sinatra's My Way was second in the UK vote with Monty Python's Always Look on the Bright Side of Life in third place. More than 45,000 people were surveyed by digital TV station Music Choice.\n \n The European chart, which included Denmark, France and Germany, put Led Zeppelin's Stairway to Heaven in second and AC/DC's Highway to Hell in third. Queen's Who Wants to Live Forever was highly favoured by both UK and European voters.\n \n Both lists featured only one traditional or classic song each, with Britons requesting the Royal Scots Dragoon Guards' Amazing Grace and their continental counterparts opting for Mozart's Requiem. \"Wanting to share your most treasured musical gem with those you're leaving behind is the perfect way to sign off and leave a lasting impression,\" Music Choice music and marketing manager Simon George said.\n", "llama3.2:1b": "Angels by Robbie Williams was the UK favourite funeral song, while Europeans preferred Queen's \"The Show Must Go On\". The top 5 choices were: \n1. Robbie Williams - Angels\n2. Queen - The Show Must Go On\n3. Frank Sinatra - My Way\n4. Monty Python - Always Look on the Bright Side of Life\n5. Led Zeppelin - Stairway to Heaven", "llama3.2:3b": "Angels by Robbie Williams is Britons' top funeral song choice, while Europeans prefer Queen's The Show Must Go On. Frank Sinatra's My Way ranks second in the UK poll, with Monty Python's Always Look on the Bright Side of Life third. In Europe, Led Zeppelin's Stairway to Heaven is preferred, with AC/DC's Highway to Hell ranking third. Only one classic song is featured on each list: Amazing Grace for the UK and Mozart's Requiem for Europe.", "gemma2:2b": "Angels by Robbie Williams is the most popular song Britons would like played at their funeral, followed closely by Queen's The Show Must Go On in Europe. Other popular songs include My Way by Frank Sinatra and Monty Python's Always Look on the Bright Side of Life. \nBoth UK and European lists featured only one traditional or classic song each: Amazing Grace for the UK and Mozart's Requiem for Europe. \n", "qwen2.5:0.5b": "The Royal Scots Dragoon Guards' Amazing Grace was requested by Britons, while AC/DC's Highway to Hell was preferred by European fans. Both songs featured only traditional or classic tunes.", "qwen2.5:1.5b": "Angels, a Robbie Williams song, topped UK funeral preferences according to a survey of more than 45,000 people by digital TV station Music Choice. While Europe's chart placed Led Zeppelin's Stairway to Heaven in second place, Britain favored the upbeat Queen track The Show Must Go On and Monty Python's Always Look on the Bright Side of Life as their funeral choices respectively.", "qwen2.5:3b": "Robbie Williams' Angels by Britons, Queen's The Show Must Go On by Europeans, Sinatra’s My Way in UK, Monty Python’s Always Look on the Bright Side of Life third place overall. Led Zeppelin’s Stairway to Heaven second in European chart, AC/DC’s Highway to Hell third. Amazing Grace and Mozart’s Requiem top both lists. Simon George suggests it's perfect to share cherished song with loved ones at their passing.", "opencoder:1.5b": "Angels, by Robbie Williams is the song Britons would most like played at their funeral. The survey has suggested that the UK poll favored Frank Sinatra's My Way second in the vote and Monty Python's Always Look on the Bright Side of Life in third place. More than 45,000 people surveyed by Music Choice included Led Zeppelin's Stairway to Heaven in second and AC/DC's Highway to Hell in third. The British chart preferred Queen's Who Wants to Live Forever highly.\n", "smollm:1.7b": "The song that Britons would most like played at their funeral is Angels by Robbie Williams, according to a survey conducted in the UK. The song topped the UK poll, with 45% of respondents choosing it as their first choice. While the melancholy hit topped the UK poll, Europeans preferred Queen's more upbeat anthem The Show Must Go On as their first choice. Frank Sinatra's My Way was second in the UK vote with Monty Python's Always Look on the Bright Side of Life in third place.\n\nThe European chart, which included Denmark, France and Germany, put Led Zeppelin's Stairway to Heaven in second and AC/DC's Highway to Hell in third. Queen's Who Wants to Live Forever was highly favoured by both UK and European voters. Both lists featured only one traditional or classic song each, with Britons requesting the Royal Scots Dragoon Guards' Amazing Grace and their continental counterparts opting for Mozart's Requiem. \"Wanting to share your most treasured musical gem with those you're leaving behind is the perfect way to sign off and leave a lasting impression,\" Music Choice music and marketing manager Simon George said.\n\nThe survey was conducted by digital TV station Music Choice, which surveyed 45,000 people in the UK and 10,000 in Europe. The results were released on Saturday morning.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to help the user by summarizing this text concisely. Let me read through the query again. The user provided a paragraph about a survey on funerals, specifically mentioning songs and voters' preferences. They want just a summary in plain text with no explanations or formatting.\n\nFirst, I'll break down the main points. It's about a survey by Music Choice where people were asked which song to play at a funeral. The focus is on angels (both spiritual and English terms) for both UK and European voters. Robbie Williams' \"Favourite funeral song\" was highlighted as a top choice.\n\nIn the UK, the survey found thatfbutons with \"favourite\" were preferred by 51% of people. They compared this to other songs like The Show Must Go On by Frank Sinatra and Monty Python's Always Look on the Bright Side of Life. In Europe, led zeppelin was in second place among a list including Monty Python.\n\nBoth countries showed that traditional or classic songs were requested by different groups: Britons wanting something for the Royal Scots Dragoon Guards, while Europeans favoring The Show Must Go On. Also, Queen's song \"Who Wants to Live Forever\" was highly regarded by both audiences in their respective regions.\n\nThe survey included 45,000 people, which is a key detail to mention. There were specific mentions of classic songs like Mozart's Requiem and Monty Python's song being chosen as the most preferred by listeners.\n\nI need to make sure I capture all these points without adding any extra information. The user wants a concise summary preserving key ideas and details. So, I should highlight the main findings: the survey results on funeral songs, preferences in each country, specific songs mentioned, and the total number surveyed.\n\nWait, let me check if I have all the important parts. The survey was conducted by Music Choice, the song is angels, UK voted for Robbie Williams as top, European preferred the Queen's anthem. The UK had more varied choices except for the classic ones, while Europe had specific preferences with Monty Python leading.\n\nI think that covers everything. Now I'll structure it into a concise paragraph without any additional explanations or formatting.\n</think>\n\nA survey by Music Choice revealed that people were asked which song to play at their funeral, focusing on angels, and found Robbie Williams' \"Favourite funeral song\" as the most preferred choice among 45,000 participants. In the UK,fbutons with \"favourite\" were favored by 51% of people, whileEurope prefers the Queen's anthem \"Who Wants to Live Forever.\" The survey included classic songs like Mozart's Requiem and Monty Python's song highlighted by Simon George.", "tinyllama:1.1b": "The top pick for Britons following their own funeral is Robbie Williams' angelical funeral song Angel, closely followed by Queen's more upbeat anthem The Show Must Go On as the first choice in the European survey conducted by digital TV station Music Choice. Among the European chart, Led Zeppelin's Highway to Hell and AC/DC's Who Wants to Live Forever were highly popular choices, but both UK and European lists only included one traditional or classic song each. British voters requested the Royal Scotts Dragoon Guard's Amazing Grace as their most treasured musical gem, while their continental counterparts opted for Mozart's Requiem. Signing off with a memorable piece of music was seen as the perfect way to leave a lasting impression.", "tinydolphin:1.1b": " In summary, Robbie Williams' song \"Angels\" is the most popular choice for Britons when planning their funerals, according to a recent survey. Although Queen's \"The Show Must Go On\" had more support from Europeans, Frank Sinatra's classic anthem \"My Way\" came in second place, with Monty Python's \"Always Look on the Bright Side of Life\" finishing third. The European chart also featured Led Zeppelin's \"Stairway to Heaven,\" while AC/DC's \"Highway to Hell\" was highly favored by both the UK and European voters. The British people requested only one traditional or classic song each, with both lists featuring only one Scots Dragoon Guards' favorite song—Amazing Grace—and Mozart's Requiem for continental audiences.", "phi:2.7b": " According to a survey conducted by Digital TV station Music Choice, Britons' favourite funeral song is Robbie Williams' Angels. Europeans preferred Queen's The Show Must Go On as their first choice, with Frank Sinatra's My Way in second place. Led Zeppelin's Stairway to Heaven and AC/DC's Highway to Hell were also popular choices among European voters.\n\nThe UK and European charts each featured only one traditional or classic song each, with Britons requesting the Royal Scots Dragoon Guards' Amazing Grace and their continental counterparts opting for Mozart's Requiem. Simon George from Music Choice commented that sharing a treasured musical gem was an ideal way to sign off on someone's life.\n", "orca-mini:3b": " Robbie Williams' Angels is the funeral song Britons would want played, followed by Queen's The Show Must Go On and Frank Sinatra's My Way. Monty Python's Always Look on the Bright Side of Life and Led Zeppelin's Stairway to Heaven are also popular choices.", "hermes3:3b": "Robbie Williams' Angels is Brits' preferred funeral song, according to UK survey (over 45k respondents). Europe favours Queen's The Show Must Go On.", "stablelm-zephyr:3b": "Robbie Williams' Angels topped a UK survey on preferred funeral songs, while Europeans favored Queen's The Show Must Go On. Frank Sinatra's My Way came second in the UK poll, and Monty Python's Always Look on the Bright Side of Life placed third. Both lists had only one traditional song each, with Amazing Grace for the UK and Mozart's Requiem for Europe. Music Choice music and marketing manager Simon George emphasized wanting to share cherished music at funerals.", "chatgpt-4o-latest": "Angels by Robbie Williams is the most popular funeral song in the UK, according to a survey by Music Choice, while Europeans prefer Queen's The Show Must Go On. In the UK, Frank Sinatra's My Way and Monty Python's Always Look on the Bright Side of Life ranked second and third. The European list placed Led Zeppelin's Stairway to Heaven second and AC/DC's Highway to Hell third. Queen's Who Wants to Live Forever was popular in both regions. Traditional songs were less common, with the UK favoring Amazing Grace and Europeans choosing Mozart's Requiem. Music Choice's Simon George noted that selecting a meaningful song is a way to leave a lasting impression.", "stablelm2:1.6b": "Angels by Robbie Williams is the preferred funeral song in the UK, according to a survey where more than 10,0 Lenders, including the US Treasury and CDCs, must follow federal guidelines to ensure compliance with state laws.\nThe proposed bill would eliminate this requirement, allowing lenders to ignore state law while still adhering to federal guidelines. This approach has been criticized by opponents of the bill who argue that it could result in unfair practices and harm consumers.\nAdvocates of the bill contend that removing state law from the lending process would streamline the loan approval process and reduce costs for both borrowers and lenders. However, critics argue that this approach would only benefit a few large financial institutions at the expense of many small businesses and individual homeowners who rely on fair and consistent lending practices to manage their finances.\nThe proposed bill has been referred to the House Committee on Financial Services, where it will be considered by members in the coming months before potentially moving on to the full House for debate and consideration. If passed, the bill would require a separate vote in the Senate to become law.", "granite3.1-dense:2b": "According to a survey by digital TV station Music Choice, Britons' preferred funeral song is Robbie Williams' \"Angels.\" In contrast, Europeans chose Queen's upbeat anthem \"The Show Must Go On\" as their top pick. Frank Sinatra's \"My Way\" was the second most popular choice in the UK, followed by Monty Python's \"Always Look on the Bright Side of Life.\" The European chart included Led Zeppelin's \"Stairway to Heaven\" and AC/DC's \"Highway to Hell,\" with Queen's \"Who Wants to Live Forever\" being a popular choice across both regions. Only one traditional or classic song was selected in each list: Amazing Grace for Britons and Mozart's Requiem for Europeans. Simon George, Music Choice's music and marketing manager, noted that sharing a cherished musical piece with loved ones upon death is an effective way to create a lasting impression.", "reference": "Queen's Who Wants to Live Forever was highly favoured by both UK and European voters.While the melancholy hit topped the UK poll, Europeans favoured Queen's more upbeat anthem The Show Must Go On as their first choice.Frank Sinatra's My Way was second in the UK vote with Monty Python's Always Look on the Bright Side of Life in third place.Angels by Robbie Williams is the song Britons would most like played at their funeral, a survey has suggested."}