{"raw_text": "Spider-Man creator wins profits\n \n Spider-Man creator Stan Lee is to get a multi-million dollar windfall after winning a court battle with comic book company Marvel.\n \n A judge has upheld Lee's demand for 10% of Marvel's profits from the hugely successful Spider-Man films. Spider-Man and its sequel made $1.6bn (£857m) at box offices worldwide. Of the cut now due to Lee, 82, who created Spider-Man in 1962, his lawyer said: \"It could be tens of millions of dollars, that's no exaggeration.\" US District Court Judge Robert W Sweet ruled Lee should get a tenth of profits generated since November 1998 by Marvel TV and movie productions involving the company's characters. Lee took legal action in 2002, saying Marvel shut him out of \"jackpot\" profits from the first blockbuster film.\n \n He said the company - where he worked for more than 60 years - had gone back on agreement to give him the 10%. As well as Spider-Man, Lee co-created the Incredible Hulk, X-Men, Daredevil and Fantastic Four characters. He said: \"I am gratified by the judge's decision although, since I am deeply fond of Marvel and the people there, I sincerely regret that the situation had to come to this.\" The ruling also means he is entitled to a slice of profits from DVD sales and certain merchandise. Marvel said it would appeal and did not expect the decision to impact on financial forecasts for 2004 and beyond. The New York court did not rule on Lee's claims to a share of profits from some Spider-Man and Hulk movie merchandise, which will be decided at a future trial, Marvel said.\n", "llama3.2:1b": "Stan Lee wins $10 million in profit cuts from comic book company Marvel.", "llama3.2:3b": "Stan Lee wins multi-million dollar windfall after winning court battle with Marvel over 10% cut of profits from Spider-Man films, as well as DVD sales and merchandise, after judge rules he was initially shut out due to company's agreement breach.", "gemma2:2b": "Stan Lee won a court case against Marvel concerning profit distribution from the Spider-Man films. He will receive 10% of the profits generated by Marvel's television and movie productions using his characters since November 1998.  The ruling is expected to generate tens of millions of dollars for Lee, although Marvel plans to appeal.  \n", "qwen2.5:0.5b": "Spider-Man creator Stan Lee has won a significant windfall after the judge upheld his demand for 10% of Marvel's profits generated since November 1998. The ruling means Lee receives an additional 43 million dollars from Marvel and will have a slice of profits from DVD sales and certain merchandise as well.", "qwen2.5:1.5b": "Spider-Man creator Stan Lee wins $10 million in profit settlement over Marvel company.", "qwen2.5:3b": "Spider-Man creator Stan Lee wins a multi-million dollar windfall after a court battle with comic book company Marvel. A judge ruled that Lee should get 10% of Marvel's profits from movies involving the Spider-Man characters since November 1998. The ruling includes royalties from TV and movie productions as well as merchandise sales. Lee, who created characters like the Incredible Hulk, X-Men, Daredevil, and Fantastic Four, is gratified by the decision but regrets the need for legal action. Marvel plans to appeal and does not expect financial impact on forecasts beyond 2004. Lee's claims regarding profits from some Spider-Man and Hulk movie merchandise will be decided at a future trial.", "opencoder:1.5b": "The text provided is a summary of a case involving two characters, Spider-Man (a creator) and the fictional character Daredevil (another creator), in a fight with a company. The creators have won a large sum of money and are to make the profits publically known. The judge has upheld the decision of the former while challenging the latter's decision. The creators have also been granted rights to make this information publicly known, including the rights to a slice of the profits from merchandise sold on DVD. The case is not just limited to Spider-Man and Daredevil but also encompasses their other characters such as Incredible Hulk, X-Men, Fantastic Four etc. The decision was announced in court, and the creators now have the right to publicly declare any profit generated since the creation of these characters.\n", "smollm:1.7b": "The summary is concise, yet it captures the main ideas:\n\n1. Spider-Man creator Stan Lee is awarded a multi-million dollar windfall for his contributions to the Marvel franchise.\n2. Judge Robert W Sweet rules that Lee should get 10% of Marvel's profits from the Spider-Man films since November 1998, citing the company's agreement with Lee as evidence.\n3. The court finds that Lee has been entitled to a share of profits from various merchandise and DVD sales related to Spider-Man and other Marvel characters for years, but this decision does not affect the overall profitability of Marvel in 2004 or beyond.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Spider-Man creator Stan Lee getting a million dollar windfall. Let me read through the passage first.\n\nSo, the main points are: Stan Lee was suing Marvel for making him take 10% profits from their Spider-Man films. The court ruled him owed at least $10 million. He had been suing since 2002 because he wanted to keep his character in Marvel without being part of the company's profits.\n\nI should make sure I capture both the financial reward and Stan's emotional response. Also, mention that the case is pending as of October 4th.\n\nLet me structure it concisely: state the judge granted a portion of profits from Spider-Man films, Stan's legal battle, his co-creation of Marvel characters, the specific profit amount, and the current status regarding other merchandise sales.\n</think>\n\nStan Lee was awarded at least $10 million by the court for a portion of Marvel's Spider-Man film profits. He sued Marvel after losing $857 million in film box office earnings to the company. The court ruled Stan owed \"tens of millions,\" though it's unclear if that includes other profit streams like DVD sales or merchandise. Lee, a co-created superhero with others like X-Men and Daredevil, was deeply fond of Marvel but is now at odds over the decision.", "tinyllama:1.1b": "A judge has granted Stan Lee a windfall of multi-million dollar profits for the iconic Spider-Man creator. The American comic book writer and producer won a court battle with Marvel, claiming they refused to share their success from the massively successful films featuring the superhero character. In a ruling, Judge Robert Swett found in Lee's favour, stating that he deserves 10% of Marvel's profits since November 2002 from TV and movie productions involving Spider-Man characters. The lawyer for Lee stated that the company went back on an agreement to give him this percentage, but said that, \"I am grateful that the court's decision has come.\" Furthermore, it was revealed that Lee will be entitled to a slice of profits from DVD sales and certain merchandise, including DVDs and other merchandise for Spider-Man and his sequels. Marvel did not comment on Lee's claims for a share of profit from the movies, which are set to be tried at a future trial.", "tinydolphin:1.1b": " Summarized: In a recent ruling, a judge has ruled in favor of Spider-Man creator Stan Lee, awarding him with a multi-million dollar windfall after successfully winning a court battle against comic book company Marvel. As part of the settlement, Lee is set to receive an additional 10% of Marvel's profits from the iconic Spider-Man films, as well as from its TV and movie productions involving the characters he created. The ruling comes after nearly two decades of conflict between the creator of Spider-Man and Marvel, with Lee demanding a cut of profits for creating the character and his other comics. However, the judge dismissed Lee's claim to a share of profits from some Spider-Man and Hulk movie merchandise, which will be decided at a future trial. Marvel is expected to appeal this decision, as it did not expect the ruling to impact on financial forecasts for 2004 and beyond.", "phi:2.7b": " Stan Lee, the creator of Spider-Man, has won a court battle with Marvel for 10% of their profits from the hugely successful films. The court ruling also means he is entitled to a share of DVD sales and certain merchandise profits. While Marvel plans to appeal the decision, Lee's lawyer said it could be tens of millions of dollars in compensation.\n", "orca-mini:3b": " Stan Lee, the creator of Spider-Man, won a multi-million dollar windfall after a court battle with comic book company Marvel. He is entitled to a tenth of profits generated since November 1998 from Marvel TV and movie productions involving the company's characters.", "hermes3:3b": "Stan Lee gets multi-mill $ from court, winning 10% of Spider-Man film profits since 1998.", "stablelm-zephyr:3b": "Spider-Man creator Stan Lee demands 10% of Marvel's profits from the Spider-Man films, resulting in a multi-million dollar windfall. A judge upholds Lee's demand and he becomes entitled to a share of profits from DVD sales and certain merchandise. Marvel plans to appeal the decision.", "chatgpt-4o-latest": "Stan Lee won a court battle against Marvel, securing 10% of profits from Marvel's TV and movie productions since November 1998, including the highly successful Spider-Man films, which grossed $1.6 billion worldwide. The ruling could grant Lee tens of millions of dollars. Lee, who co-created Spider-Man and other major Marvel characters, sued in 2002, claiming Marvel reneged on an agreement to share profits. The decision also entitles him to a share of DVD and merchandise sales. Marvel plans to appeal and stated the ruling would not affect financial forecasts. A separate trial will determine Lee’s claims to profits from certain Spider-Man and Hulk merchandise.", "stablelm2:1.6b": "Spider-Man creator Stan Lee receives a multi-million dollar payout after winning a lawsuit against comic book company Marvel. A judge upheld Lee's demand for 10% of Marvel's film profits from $1.6bn worldwide box office success. Lee will receive this amount as part of the cut, which could be tens of millions of dollars. The ruling also includes DVD sales and certain merchandise profits. Marvel plans to appeal and expects no impact on financial forecasts.", "granite3.1-dense:2b": "Stan Lee, the creator of Spider-Man, has been awarded a multi-million dollar sum in a court battle with comic book giant Marvel. US District Court Judge Robert W Sweet ruled that Lee, 82, is entitled to 10% of Marvel's profits from Spider-Man films and related TV productions since November 1998. This includes earnings from box office sales, DVDs, and merchandise. The judge estimated the amount could be tens of millions of dollars. Lee took legal action in 2002, alleging Marvel violated a 1976 agreement by denying him his share of Spider-Man film profits. Despite his gratitude for the ruling, Lee expressed regret over the situation with Marvel, where he had worked for over six decades. Marvel plans to appeal the decision, asserting it won't affect their 2004 and future financial forecasts. The court did not decide on Lee's claims for Spider-Man and Hulk merchandise profits, which will be addressed in a subsequent trial.", "reference": "The New York court did not rule on Lee's claims to a share of profits from some Spider-Man and Hulk movie merchandise, which will be decided at a future trial, Marvel said.Spider-Man creator Stan Lee is to get a multi-million dollar windfall after winning a court battle with comic book company Marvel.US District Court Judge Robert W Sweet ruled Lee should get a tenth of profits generated since November 1998 by Marvel TV and movie productions involving the company's characters.Of the cut now due to Lee, 82, who created Spider-Man in 1962, his lawyer said: \"It could be tens of millions of dollars, that's no exaggeration.\"Lee took legal action in 2002, saying Marvel shut him out of \"jackpot\" profits from the first blockbuster film."}