{"raw_text": "Carry On star Patsy Rowlands dies\n \n Actress Patsy Rowlands, known to millions for her roles in the Carry On films, has died at the age of 71.\n \n Rowlands starred in nine of the popular Carry On films, alongside fellow regulars Sid James, Kenneth Williams and Barbara Windsor. She also carved out a successful television career, appearing for many years in ITV's well-loved comedy Bless This House. Rowlands died in Hove on Saturday morning, her agent said.\n \n Born in January 1934, Rowlands won a scholarship to the Guildhall School of Speech and Drama scholarship when she was just 15.\n \n After spending several years at the Players Theatre in London, she made her film debut in 1963 in Tom Jones, directed by Tony Richardson. She made her first Carry On film in 1969 where she appeared in Carry On Again Doctor. Rowlands played the hard-done-by wife or the put-upon employee as a regular Carry On star. She also appeared in Carry On at your Convenience, Carry On Matron and Carry On Loving, as well as others.\n \n In recent years she appeared in BBC mini-series The Cazalets and played Mrs Potts in the London stage version of Beauty and the Beast. Agent Simon Beresford said: \"She was just an absolutely favourite client She never complained about anything, particularly when she was ill, she was an old trouper. \"She was of the old school - she had skills from musical theatre and high drama, that is why she worked with the great and the good of directors. \"She didn't mind always being recognised for the Carry On films because she thoroughly enjoyed making them. She was a really lovely person and she will be much missed.\" Her last appearance on stage was as Mrs Pearce in the award-winning production of My Fair Lady at the National Theatre. Previously married, she leaves one son, Alan. Her funeral will be a private, family occasion, with a memorial service at a later date.\n", "llama3.2:1b": "Patsy Rowlands, 71, has died after being ill and passing away in Hove. She was known for her roles in Carry On films alongside Sid James, Kenneth Williams, Barbara Windsor, and appeared in TV series such as Bless This House. Born in 1934, she won a scholarship to the Guildhall School of Speech and Drama at age 15.", "llama3.2:3b": "Patsy Rowlands, actress known for Carry On films and Bless This House, dies at 71. Born in January 1934, she won a Guildhall School of Speech and Drama scholarship at 15. She made her film debut in Tom Jones (1963) and appeared in nine Carry On films, alongside Sid James and Barbara Windsor.", "gemma2:2b": "Patsy Rowlands, an actress known for her roles in the Carry On films, died at age 71. She appeared in nine of the popular films alongside other actors like Sid James and Barbara Windsor. Her career also included success in television with \"Bless This House\".  She was a respected performer with skills from musical theatre who enjoyed working on projects like those directed by Tony Richardson. Rowlands leaves her son, Alan. \n", "qwen2.5:0.5b": "Patsy Rowlands, 71, actress and regular Carry On cast member, died on Saturday morning in Hove. She was born January 1934. Patsy Rowlands made her film career debut with the Carry On films in 1963, appearing in three of them: \"Carry On Again Doctor\", \"Carry On Matron\" and \"Carry On Loving\". She appeared in other Carry On films including \"Bless This House\", \"My Fair Lady\" and a role as Mrs. Potts in the National Theatre production of \"My Fair Lady\". In her career, she was also active on television with roles in ITV's comedy show \"Bless This House\" and the ITV sitcom \"The Cazalets\". Rowlands had been well-regarded by audiences for decades and would have delighted many fans.", "qwen2.5:1.5b": "Patsy Rowlands, known for her roles in Carry On films, has died at age 71 after suffering from cancer. She starred in nine of the popular Carry On films alongside Sid James, Kenneth Williams, and Barbara Windsor.", "qwen2.5:3b": "Actress Patsy Rowlands, known for her roles in Carry On films, died at 71 after a successful career including television series and stage performances like Beauty and the Beast's Mrs Potts. Born in 1934, she won a scholarship to Guildhall School of Speech and Drama at age 15. She appeared in nine Carry On films alongside regulars such as Sid James and Kenneth Williams. Rowlands also had a successful TV career with ITV's Bless This House. In her later years, she starred in BBC mini-series The Cazalets and the stage production of My Fair Lady. Her last appearance was in National Theatre's award-winning production of My Fair Lady. Agent Simon Beresford described her as an old trouper who enjoyed making Carry On films despite fame. Rowlands leaves one son, Alan, and will have a private funeral with memorial service at a later date.", "opencoder:1.5b": "\"Carry On star Patsy Rowlands died\"\n \nRowlands, known for her roles in Carry On films, has died at the age of 71.\n\nShe starred in nine popular Carry On films alongside fellow regulars Sid James, Kenneth Williams, and Barbara Windsor. She also made a successful television career, appearing for many years in ITV's well-loved comedy Bless This House.\n\nRowlands died on Saturday morning, with her agent said.\n\nBorn in January 1934, she won a scholarship to the Guildhall School of Speech and Drama when she was just 15.\n\nAfter spending several years at the Players Theatre in London, she made her film debut in 1963 in Tom Jones directed by Tony Richardson. She made her first Carry On film in 1969 where she appeared in Carry On Again Doctor. She played the failed-by wife or the unanticipated employee as a Carry On star.\n\nIn recent years, she has appeared in BBC mini-series The Cazalets and played Mrs Potts in the London stage version of Beauty and the Beast.\n\nShe made her last appearance on stage was as Mrs Pearce at the award-winning production of My Fair Lady at the National Theatre. She previously married, leaving one son, Alan. Her funeral will be a private family occasion with a memorial service.\n", "smollm:1.7b": "Carry On star Patsy Rowlands has died at the age of 71.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the given text about Patsy Rowlands' death into a concise summary that preserves key ideas and details. The output should be plain text without any explanations or formatting.\n\nFirst, let me read through the text carefully. It starts by mentioning that Carry On star Patsy Rowlands died at 71. Then it lists her roles in nine Carry On films with other actors like Sid James, Kenneth Williams, and Barbara Windsor. She also had a successful television career on ITV's Bless This House.\n\nThe text then breaks down her personal details: she was born in January 1934, won a scholarship to the Guildhall School at 15, made her film debut in 1963 in Tom Jones' movie, and started her first Carry On film in 1969. She played various roles including a hard-done wife or employee.\n\nIn recent years, she appeared on BBC shows like The Cazalets and in the London stage version of Beauty and the Beast. Her agent praised her as someone who was old-school with skills from musical theatre and high drama and that she worked with great directors. She never complained when she was ill, which made people fondly refer to her as \"the old trouper.\"\n\nHer last appearance on stage was as Mrs Pearce in My Fair Lady. She has one son, Alan, and her funeral is private with a memorial service later.\n\nNow, I need to condense this into a summary. I should include key points like her name, age, death details, the films she starred in, her acting roles, personal background, professional career highlights, her personality traits, her legacy, and the information about her last appearance and children.\n\nI'll make sure to mention that her agent described her as a favorite client who never complained, highlighting her character. I should include the number of films she appeared in, both film and TV, and specific examples like the 1963 movie and Carry On At Your Convenience.\n\nAlso, her last acting role on stage and the memorial service details are important for completeness. Including that she had one son, Alan, adds to her legacy.\n\nI need to keep each point clear and concise without adding extra information beyond what's provided in the original text. The summary should flow logically from introducing Patsy Rowlands, her career highlights, personal background, personality traits, professional achievements, and her legacy with family details.\n\nLet me structure it:\n\n1. Introduction: Name, age at death.\n2. Role in Carry On films: List of actors and number of films.\n3. Professional career on TV: Details of Bless This House and other shows.\n4. Personal life: Born details, scholarship, film debut, first appearance.\n5. Personality traits: Old-school skills, never complaining when ill.\n6. Legacy: funeral details, memorial service.\n7. Additional information: One son, last acting role, production details.\n\nI think that covers all the key points without missing anything important from the original text. I'll make sure each sentence is clear and that it's a smooth summary.\n</think>\n\nPatsy Rowlands, 71 years old, passed away on Saturday morning in Hove. Known for her roles in nine Carry On films with Sid James, Kenneth Williams, Barbara Windsor, and television work on ITV’s Bless This House, she was a beloved actress with a legacy that includes appearances in BBC shows like The Cazalets and the London stage version of Beauty and the Beast. Born on January 1934, she won a Guildhall scholarship at 15. Her professional career began in 1963 with \"Tom Jones,\" and she appeared in several Carry On films beyond her first appearance. Patsy was described as an old-school artist who never complained when ill, earning a warm fondness for her work. She recently starred in \"Carry On At Your Convenience\" and appeared as Mrs Pearce in *My Fair Lady*. With one son, Alan, the funeral will be private with a memorial service later.", "tinyllama:1.1b": "Born in January 1934, actress Patsy Rowlands (also known as Pat Rowlands) died on Saturday morning at the age of 71. Rowlands starred in nine films starring in Carry On series between 1969 and 2010. She appeared in 25 Carry On films, including notable roles in Carry On Again Doctor (1973), Carry On Matron (1974), and Carry On Lovin' (1973). Rowlands was known for her versatile performance style across genres, particularly in musical theatre and high drama. She enjoyed working with the great and the good of director, and died after battling illness. Her funeral will be a private family occasion followed by a memorial service at a later date.", "tinydolphin:1.1b": " Carry On star Patsy Rowlands has passed away at the age of 71. She was known for her roles in the popular Carry On films alongside fellow regulars Sid James, Kenneth Williams, and Barbara Windsor. Rowlands played many different characters throughout her career, including the hard-working wife or the put-upon employee. Throughout her acting career, she appeared in nine of the Carry On films.", "phi:2.7b": " Actress Patsy Rowlands, known for her roles in Carry On films and television shows like Bless This House, has passed away at age 71. She made nine Carry On films, including Carry On Again Doctor and Carry On Loving. In recent years, she appeared in The Cazalets and played Mrs Potts in Beauty and the Beast. Agent Simon Beresford said Rowlands was a favorite client who enjoyed making films. Her last stage performance was as Mrs Pearce in My Fair Lady at the National Theatre. Her funeral will be private with a memorial service later.\n", "orca-mini:3b": " Patsy Rowlands, an actress known for her roles in the Carry On films, has died aged 71. She appeared in nine of the films alongside regulars Sid James, Kenneth Williams, and Barbara Windsor, and also had a successful television career, appearing in shows such as Bless This House and The Cazalets. Rowlands won a scholarship to the Guildhall School of Speech and Drama when she was just 15, and made her film debut in Tom Jones in 1963, before appearing in Carry On Again Doctor in 1969. She played regular characters as a hard-done-by wife or put-upon employee in the Carry On films, and also appeared in others such as Carry On Loving. She was known for her professionalism and worked with some of the great directors in theatre and film.", "hermes3:3b": "Patsy Rowlands, Carry On actress, dies at 71; starred in 9 films and ITV's Bless This House.", "stablelm-zephyr:3b": "Patsy Rowlands, known for her role in the Carry On films and ITV's Bless This House, has died at 71. She starred in nine Carry On films and made her film debut in 1963 in Tom Jones. Rowlands was born in January 1934 and won a scholarship to Guildhall School of Speech and Drama when she was 15. Her agent described her as \"an absolutely favourite client\" who enjoyed making the Carry On films despite being recognised for them. She leaves one son, Alan, and will be privately buried with a memorial service at a later date.", "chatgpt-4o-latest": "Actress Patsy Rowlands, known for her roles in nine Carry On films and the ITV comedy Bless This House, has died at 71 in Hove. Born in 1934, she won a scholarship to the Guildhall School of Speech and Drama at 15 and began her career at the Players Theatre before debuting in the 1963 film Tom Jones. She first appeared in Carry On Again Doctor in 1969 and became known for playing hard-done-by wives and put-upon employees in the series. In later years, she acted in The Cazalets and played Mrs Potts in Beauty and the Beast. Her agent described her as a beloved client and a talented performer. She last appeared on stage in My Fair Lady at the National Theatre. She leaves behind a son, Alan, and her funeral will be private, with a memorial service planned later.", "stablelm2:1.6b": "Actress Patsy Rowlands, known for her roles in Carry On films, has passed away at 76 after starring in nine popular films and a successful TV career. Born with a scholarship to the Guildhall School of Speech and Drama, she appeared in various Carry On films and mini-series, and also on stage. Her agent described her as a \"really lovely person\" who never complained about anything, particularly during her ill health.", "granite3.1-dense:2b": "Actress Patsy Rowlands, renowned for her Carry On film roles and appearances in ITV's Bless This House, died on Saturday at the age of 71 in Hove. She began her acting career at 15 after winning a Guildhall School of Speech and Drama scholarship and made her film debut in Tom Jones (1963). Rowlands starred in nine Carry On films, often playing the wife or employee of the main characters. She also ventured into television, featuring in The Cazalets and as Mrs Potts in Beauty and the Beast's London stage production. Her last stage appearance was in My Fair Lady at the National Theatre. Despite her fame, she remained humble and professional, known for her old-school acting skills and ability to work with esteemed directors. She is survived by one son, Alan. A private family funeral will be held, followed by a memorial service at a later date.", "reference": "She made her first Carry On film in 1969 where she appeared in Carry On Again Doctor.She also appeared in Carry On at your Convenience, Carry On Matron and Carry On Loving, as well as others.Rowlands played the hard-done-by wife or the put-upon employee as a regular Carry On star.Actress Patsy Rowlands, known to millions for her roles in the Carry On films, has died at the age of 71.Agent Simon Beresford said: \"She was just an absolutely favourite client She never complained about anything, particularly when she was ill, she was an old trouper.Born in January 1934, Rowlands won a scholarship to the Guildhall School of Speech and Drama scholarship when she was just 15.Rowlands starred in nine of the popular Carry On films, alongside fellow regulars Sid James, Kenneth Williams and Barbara Windsor."}