{"raw_text": "Corbett attacks 'dumbed-down TV'\n \n Ronnie Corbett has joined fellow comedy stars Victoria Wood and David Jason in attacking the declining standards of British television programmes.\n \n Speaking to the Radio Times, the Two Ronnies star said there is too much bad language and reality TV. \"You get fed up watching shows with not much care and love,\" he complained. Corbett, soon to reunite with Ronnie Barker for a new Two Ronnies series, also criticised quiz shows like the BBC's They Think It's All Over. \"It's just laughing at each other and thinking, 'Aren't we clever?'\" said the 74-year-old comedian. Corbett is the latest comedy star to bemoan the \"dumbing down\" of modern TV programmes. In an interview published in the Radio Times in January, Victoria Wood slated comedian Sacha Baron Cohen for his character Ali G's \"horrible\" brand of \"victim\" humour.\n \n \"With so many good writers and good performers, it's a shame people can't just write a script and have other people learn it,\" she said. And last week Only Fools and Horses star David Jason criticised British TV for being \"too safe and too cheap\". \"We've got to be careful not to dumb down for the audience,\" he said. \"They shouldn't be sitting at home on the sofa vegetating.\" Corbett said he and Barker were always mindful of their family audience while making The Two Ronnies. \"Our material was good-natured,\" he said. \"We knew what would upset the average man in the street. \"There's a lot of swearing on TV today. They even have documentaries with the f-word.\"\n \n Corbett goes on to criticise \"reality programmes where they put people in a house for a fortnight and film them doing everything\". The Two Ronnies ran from 1971 to 1987 and attracted 17 million viewers at its peak. Its bespectacled stars will return later this year in The Two Ronnies Sketchbook, which will combine classic sketches with newly recorded material. Corbett claims he and Barker differ from today's celebrities in that they did not allow their success to go to their heads. \"We were never temperamental, fractious or walked out slamming doors,\" he said. \"We were fussy though,\" he added. \"We wanted everything done properly.\"\n", "llama3.2:1b": "Ronnie Corbett has joined Victoria Wood and David Jason in criticizing the decline of British television programs due to excessive bad language and reality TV.", "llama3.2:3b": "Ronnie Corbett joined Victoria Wood and David Jason in criticizing the decline of British television programming standards, calling it \"dumbed-down\". He specifically targeted bad language on TV and reality shows.", "gemma2:2b": "Ronnie Corbett criticizes the decline of television standards, citing excessive vulgarity and a lack of quality in modern programming. He compares this to the high-quality family-friendly humor he created with his partner Ronnie Barker in \"The Two Ronnies\" series.  He feels that television today is too focused on reality shows and cheap content, missing opportunities for creativity and intellectual stimulation. \n", "qwen2.5:0.5b": "Corbett is criticizing British television programmes for being too formulaic and boring. He complains that the show's content includes a lot of bad language and reality TV. He also says that some shows, like BBC's The Two Ronnies, are more about drinking beer than telling a story. Corbett plans to make another show based on The Two Ronnies Sketchbook, which will combine classic sketches with newly recorded material.", "qwen2.5:1.5b": "Comedian Ronnie Corbett criticizes declining standards of British television programming, including excessive bad language and reality TV shows like They Think It's All Over, which he refers to as \"laughing at each other\" rather than providing meaningful content. He also condemns the over-simplification of comedy and writers' failure to adapt their work for modern audiences.", "qwen2.5:3b": "Ronnie Corbett has joined Victoria Wood and David Jason in criticizing the decline of British television standards. He complained about excessive bad language, reality TV, and quiz shows like BBC's They Think It's All Over, which he described as merely boasting. Corbett said modern TV programs are \"dumbed down,\" citing swearing in documentaries and reality shows featuring people filmed for weeks. He praised The Two Ronnies, a long-running comedy series, for maintaining quality content aimed at a family audience. The show will return with the sketchbook later this year after airing from 1971 to 1987 and reaching its peak of 17 million viewers.", "opencoder:1.5b": "Corbett attacks 'dumbed-down TV'\n\nRonnie Corbett has joined fellow comedy stars Victoria Wood and David Jason in attacking the declining standards of British television programmes.\n\nSpeaking to the Radio Times, the Two Ronnies star said there is too much bad language and reality TV. \"You get fed up watching shows with not much care and love,\" he complained. \n\nCorbett, soon to reunite with Ronnie Barker for a new Two Ronnies series, also criticised quiz shows like the BBC's They Think It’s All Over. \"It’s just laughing at each other and thinking, ‘Aren’t we clever?'\" said the 74-year-old comedian.\n\nCorbett is the latest comedy star to bemoan the \"dumbing down\" of modern TV programmes. In an interview published in the Radio Times in January, Victoria Wood suggested a character named Sacha Baron Cohen for his character Ali G’s ‘horrible’ brand of 'victim' humour.\n\n\"We’ve got to be careful not to dumb down for the audience,\" he said. \"They shouldn’t be sitting at home on the sofa vegetating.\"\n\nCorbett goes on to criticise \"reality programmes where they put people in a house for a fortnight and film them doing everything\". The Two Ronnies ran from 1971 to 1987 and attracted 17 million viewers at its peak.\n\nIts bespectacled stars will return later this year in The Two Ronnies Sketchbook, which will combine classic sketches with newly recorded material. Corbett claims he and Barker differ from today's celebrities in that they did not allow their success to go to their heads.\n", "smollm:1.7b": "The summary is concise and objective, preserving the key ideas and details of the original text while omitting unnecessary information. The main points covered in the text are:\n\n1. Corbett attacks 'dumbed-down TV' - The Two Ronnies star has joined forces with fellow comedy stars Victoria Wood and David Jason to attack the declining standards of British television programmes.\n2. Speaking to the Radio Times, the Two Ronnies star said there is too much bad language and reality TV. \"You get fed up watching shows with not much care and love,\" he complained.\n3. Corbett, soon to reunite with Ronnie Barker for a new Two Ronnies series, also criticized quiz shows like the BBC's They Think It's All Over. \"It's just laughing at each other and thinking, 'Aren't we clever?'\" said the 74-year-old comedian.\n4. Corbett is the latest comedy star to bemoan the 'dumbing down' of modern TV programmes - In an interview published in the Radio Times in January, Victoria Wood slated comedian Sacha Baron Cohen for his character Ali G's \"horrible\" brand of \"victim\" humour.\n5. With so many good writers and good performers, it's a shame people can't just write a script and have other people learn it - The Two Ronnies star David Jason criticized British TV for being \"too safe and too cheap\".\n6. They even have documentaries with the f-word - The Two Ronnies ran from 1971 to 1987 and attracted 17 million viewers at its peak. Its bespectacled stars will return later this year in The Two Ronnies Sketchbook, which will combine classic sketches with newly recorded material.\n7. Corbett claims he and Barker differ from today's celebrities - The Two Ronnies star was never temperamental, fractious or walked out slamming doors - they did not allow their success to go to their heads. They wanted everything done properly.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Ronnie Corbett criticizing modern British TV shows. Let me read through it carefully.\n\nFirst, the main points: Corbett is a comedian who's joining the group that includes Victoria Wood and David Jason. They're attacking the declining standards of TV, especially reality shows and quiz shows. He mentions bad language and reality TV, pointing out that people get tired watching shows without much care or love. He also criticizes quiz shows like BBC's \"They Think It's All Over\" as just laughing at each other and thinking they're clever.\n\nHe attributes this to the decline in standards of modern TV. For example, he mentions Sacha Baron Cohen being criticized for his \"horrible\" humor with Ali G, and David Jason calling British TV too safe or expensive because people are \"too safe and too cheap.\" Corbett talks about his family audience when creating The Two Ronnies, where they were good-natured but had to deal with street摩擦. He also mentions modern TV shows with swear words.\n\nHe then moves on to reality shows like The Two Ronnies, which ran from 1971 to 1987 and drew a huge audience of 17 million viewers. He criticizes these shows for putting people in a house together and filming them, suggesting it didn't work well. He notes that they're fussy about things like swearing.\n\nHe ends by saying Corbett and Barker don't allow their success to drive their personalities out, emphasizing their family-friendly approach despite modern TV trends. He also suggests there might be new comedians coming in the future who are less prone to these issues.\n\nSo I need to condense all that into a concise summary without explanations or formatting. Just the key points: Corbett joining comedy stars to criticize TV shows, his complaints about bad language and reality TV, his criticism of quiz shows like BBC's \"They Think It's All Over,\" comparison to modern TV shows with swear words, mention of family audience in creating The Two Ronnies, peak viewership of 17 million, call to action for new comedians without big issues.\n\nI should make sure it's clear and captures all these elements. Maybe start by stating that Ronnie Corbett is joining the group and criticizing TV shows. Then mention his complaints about bad language in reality TV. Highlight his critique of quiz shows. Compare modern TV with swear words. Include details about The Two Ronnies and its success. Mention David Jason's criticism on safety and expense. End with his comments on family audience and the need for new comedians.\n</think>\n\nRonnie Corbett has joined comedy stars Victoria Wood and David Jason to criticize declining standards of British TV, particularly reality shows and quiz shows. He criticized bad language in reality TV, stating \"you get fed up watching shows with not much care and love.\" He also opposed quiz shows like BBC's \"They Think It's All Over,\" calling them \"laughing at each other and thinking, 'Aren't we clever?'\" Corbet, the formerRonnies member, mentioned he and Barker were mindful of family audience needs in creating The Two Ronnies, a series from 1971 to 1987 with over 17 million viewers. He called modern TV \"too safe and too cheap\" due to safety and cost issues. However, he criticized modern TV shows with swear words. Corbet suggested new comedians might face less of these issues by focusing on family-friendly approaches.", "tinyllama:1.1b": "Ronnie Corbett, along with fellow comedy stars Victoria Wood and David Jason, criticized the declining standards of British TV programmes, including the use of vulgar language and reality shows. They also expressed dissatisfaction with the \"dumbing down\" of modern TV programme formats, citing shows like BBC's \"They Think It's All Over\" as an example. Despite being mindful of their family audience while making The Two Ronnies, Corbett and Barker were not temperamental or fractious like some contemporary celebrities. They believed that they had the right to deliver a humorous take on life without losing touch with the viewers.", "tinydolphin:1.1b": " Comedian Ronnie Corbett has joined forces with fellow comedy stars Victoria Wood and David Jason in a campaign to raise awareness of the declining standards of British television shows. The trio have criticised programmes featuring excessive use of bad language, reality TV and quiz shows where viewers are subjected to constant laughter. Corbett pointed out that it is not uncommon for scriptwriters to create characters with a certain level of 'victim' humour, but he felt audiences should not be allowed to sit back on the sofa and simply enjoy them. \n\nHe also criticised the use of documentaries, where viewers are shown scenes that upset average men in the street. Corbett believes such programs often focus too much on factual information rather than creating an entertaining atmosphere for audiences. He felt that while comedy is a good thing, it should not come at the expense of the audience's sensibilities. \n\nCorbett has been enjoying success in the reunion of his Two Ronnies comedy duo with Ronnie Barker since 2019. The show has seen high ratings and critical acclaim, earning nominations for Best Comedy Show at the British Academy Film Awards and receiving a special Golden Globe nomination in 2021. He is excited to be working with his fellow comedy icons on their new Two Ronnies Sketchbook project, which will combine classic sketches with newly recorded material.", "phi:2.7b": " Ronnie Corbett and David Jason criticize the declining standards of British television programs in an interview with the Radio Times. They blame bad language, reality TV, and quiz shows like They Think It'S All Over for dumbing down modern TV. However, they maintain that The Two Ronnies, a popular show from over two decades ago, was well-written and had good-natured humor. Corbett also points out the prevalence of profanity on television today. He hopes to work with Ronnie Barker again in their new sketchbook series this year.\n", "orca-mini:3b": " Ronnie Corbett criticizes the declining standards of British television programmes, saying there is too much bad language and reality TV. He also criticized quiz shows like They Think It's All Over, which he describes as \"horrible\" and \"victim\" humor. The Two Ronnies stars Ronnie Barker and Corbett reunite for a new series that combines classic sketches with newly recorded material.", "hermes3:3b": " Ronnie Corbett criticizes decline in British TV quality, blaming bad language, reality shows, and low standards on quiz shows.", "stablelm-zephyr:3b": "Comedians Ronnie Corbett, Victoria Wood and David Jason have criticized the declining standards of British television programs, stating there is too much bad language and reality TV. They argue that modern TV shows are \"dumbed down\" and lack good writing and acting. Their concerns were echoed in a January Radio Times interview where Victoria Wood criticized comedian Sacha Baron Cohen for his character Ali G's \"horrible\" brand of humor, while David Jason warned against British TV being too safe and cheap. Corbett also criticized reality TV shows that film people in a house for two weeks.", "chatgpt-4o-latest": "Ronnie Corbett has criticized the declining standards of British television, joining Victoria Wood and David Jason in lamenting excessive bad language, reality TV, and superficial quiz shows. Corbett, soon to reunite with Ronnie Barker for a new Two Ronnies series, expressed concern over the lack of care in modern programming. Wood previously condemned Sacha Baron Cohen's \"victim\" humor, while Jason warned against making TV too safe and cheap. Corbett emphasized that The Two Ronnies maintained a family-friendly approach, avoiding offensive content. He also criticized reality shows for their lack of substance and noted that he and Barker remained professional and dedicated to quality throughout their careers.", "stablelm2:1.6b": "Comedy stars Ronnie Corbett, Victoria Wood, and David Jason criticize British TV for having declining standards with too much bad language and reality TV. They argue that there is a lack of care and love in shows, especially those with excessive swearing and humor focused on mocking others. This stems from the \"dumbing down\" of modern television programs, which they blame for their decline. Corbett and Barker are mindful of family audiences while making The Two Ronnies and avoid such content. Instead\nthey focus on good-natured material that doesn 't upset the public. They claim to have avoided becoming too successful or temperamental like today's celebrity stars who walk out slamming doors.", "granite3.1-dense:2b": "Ronnie Corbett, a renowned comedian and former member of The Two Ronnies (1971-1987), criticizes the current state of British television. He laments the prevalence of bad language, reality TV, and quiz shows like BBC's They Think It's All Over, which he perceives as superficial and self-congratulatory. Corbett emphasizes that modern TV lacks care, love, and quality writing compared to past programs. He and fellow comedy stars Victoria Wood and David Jason have previously expressed concerns about the \"dumbing down\" of television, citing examples such as Sacha Baron Cohen's Ali G and British TV's over-reliance on safe, cheap content. Corbett highlights that The Two Ronnies, known for its good-natured material and family-friendly approach, set a different standard by being meticulous and fussy in their production choices. Despite his nostalgia, Corbett and Ronnie Barker are reuniting for The Two Ronnies Sketchbook, blending classic sketches with new material to cater to contemporary audiences while maintaining integrity in their craft.", "reference": "Speaking to the Radio Times, the Two Ronnies star said there is too much bad language and reality TV.Corbett said he and Barker were always mindful of their family audience while making The Two Ronnies.Corbett, soon to reunite with Ronnie Barker for a new Two Ronnies series, also criticised quiz shows like the BBC's They Think It's All Over.Corbett is the latest comedy star to bemoan the \"dumbing down\" of modern TV programmes.said the 74-year-old comedian.Ronnie Corbett has joined fellow comedy stars Victoria Wood and David Jason in attacking the declining standards of British television programmes.\"Our material was good-natured,\" he said.Corbett goes on to criticise \"reality programmes where they put people in a house for a fortnight and film them doing everything\".Its bespectacled stars will return later this year in The Two Ronnies Sketchbook, which will combine classic sketches with newly recorded material.\"We've got to be careful not to dumb down for the audience,\" he said."}