{"raw_text": "Patti Smith to host arts festival\n \n Rock star Patti Smith has been made artistic director of this year's Meltdown festival, to be held at London's South Bank Centre in June.\n \n The punk pioneer follows Morrissey, David Bowie and Nick Cave in directing 15 days of concerts and events. Smith has yet to decide the line-up for Meltdown, which begins on 11 June. \"I want to touch on all aspects of our culture, perhaps with readings from Genet, and I have an idea for Jeremy Irons to read Proust,\" she said.\n \n The 58-year-old US singer of Because the Night told The Observer newspaper that the festival would be her response to these \"material, exploitative and greedy times\". \"It is important we explore the new, but we should also salute the best art there is, aesthetically and spiritually,\" she said. Last year's Meltdown festival, directed by the ex-Smiths star Morrissey, included appearances by singer Jane Birkin, Nancy Sinatra and playwright Alan Bennett. He also persuaded punk band The New York Dolls to reform for a reunion show.\n", "llama3.2:1b": "Patti Smith will host arts festival Meltdown at South Bank Centre in London this June. She is directing 15 days of concerts and events, which include readings from authors like Jean Genet and Marcel Proust, as well as Jeremy Irons reading Proust's work. The festival aims to explore new art while also honoring the best existing art. Smith will announce the lineup for Meltdown this year.", "llama3.2:3b": "Patti Smith will host this year's Meltdown festival in London, following Morrissey, David Bowie, and Nick Cave as artistic director. The festival starts on June 11 and will include readings from Genet and Proust, with an unnamed performer set to read by Jeremy Irons.", "gemma2:2b": "Patti Smith will be artistic director of the Meltdown festival in London this June. She plans to include readings from Genet and Jeremy Irons reading Proust as part of the 15-day event. Smith, influenced by current times, hopes to explore both new and classic art forms.  Last year's festival featured artists such as Jane Birkin and Alan Bennett and saw a reunion performance by The New York Dolls. \n", "qwen2.5:0.5b": "Rock star Patti Smith has been made artistic director of the 15-day Meltdown festival in June at London's South Bank Centre. She is focusing on themes such as literature, music and culture, and plans to feature readings by Jeremy Irons. The festival includes performances by Jane Birkin, Nancy Sinatra and Alan Bennett.", "qwen2.5:1.5b": "Rock star Patti Smith has been appointed artistic director of this year's Meltdown festival at London's South Bank Centre, set for June 11th. Smith will focus on exploring various aspects of culture but intends to also highlight excellent art. Last year's event featured Jane Birkin, Nancy Sinatra, and The New York Dolls.", "qwen2.5:3b": "Patti Smith, as artistic director, will host this year's Meltdown festival at London's South Bank Centre in June. Following Morrissey, David Bowie, Nick Cave, and others, she aims to cover various aspects of culture with readings from authors like Genet and Jeremy Irons reading Proust. At 58, Smith views the festival as a response to current materialistic times, emphasizing exploration of new art while celebrating the best in aesthetics and spirituality. Last year's festival featured Jane Birkin, Nancy Sinatra, Alan Bennett, and The New York Dolls.", "opencoder:1.5b": "Patti Smith will host the arts festival at London's South Bank Centre in June.\n \nPatti has been an artistic director for this year's Meltdown festival, to be held on 11 June. She plans to touch on aspects of her culture and has an idea for Jeremy Irons to read Proust. The festival would be her response to the new, but it will also acknowledge the best art that exists - aesthetically and spiritually.\n \nPatti's singer noted that the \"material, exploitative and greedy times\" are important in her quest to touch on all aspects of her culture. She also persuaded The New York Dolls to reform for a reunion show.\n", "smollm:1.7b": "Patti Smith is set to direct this year's Meltdown festival, which will feature performances by rock legends Morrissey, David Bowie, Nick Cave, and Jeremy Irons among others. The event aims to explore the best of art in response to these \"material, exploitative and greedy times\". Patti Smith has yet to decide the line-up for Meltdown, but she is expected to include performances by singer Jane Birkin, actress Nancy Sinatra, and playwright Alan Bennett. She also plans to invite punk band The New York Dolls to reunite with their former members for a special performance.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Patti Smith hosting the Meltdown festival. Let me read through it again to make sure I understand all the key points.\n\nSo, Patti Smith is being made artistic director at this year's Meltdown festival in London. The festival will be held from June 11th to June 26th. She has been working with Morrissey, who was the ex-Smith star, directing 15 days of events. The artists involved include bands like The New York Dolls and Proust.\n\nI remember that the song \"Proust\" is a good choice because it's from the South Bank. Patti Smith made that famous move in her solo show at Morrissey's festival. This time, she's directing her own event with her ex, so it's a double act!\n\nShe mentioned reading Genet and maybe Jeremy Irons to read Proust. That ties into her theme of exploring new art forms. She also emphasized the balance between materiality and innovation in art history.\n\nThe festival is being described as a response to these challenging times for art, which makes sense. Last year's event was organized by Morrissey, but this time it's his sister Patti Smith who is taking over. That could create some tension or even a bit of drama around the names.\n\nShe also talked about previous events, like The New York Dolls reuniting, featuring Proust and other artists. It shows that this festival isn't just her own creation but a collaboration with others, which might give it more credibility as an inclusive art event.\n\nSo putting all these together, I should mention Patti Smith's role, the lineup including 15 days of events, the specific artists involved like The New York Dolls and Proust, the themes of exploration vs. exploitation in art history, the title of the festival and its purpose, and her previous collaboration with Morrissey.\n</think>\n\nPatti Smith will host the Meltdown festival at London's South Bank Centre from June 11 to June 26, making artistic director this year. She has been directing events for Morrissey, who was Patty Smith's ex, but this time she is taking over as director. The lineup includes Proust and includes bands like The New York Dolls and a collaborator. The festival aims to explore new art forms while salute the best art there.", "tinyllama:1.1b": "Patti Smith will host this year's Meltdown festival at London's South Bank Centre, which will feature a variety of performers, including Morrissey and Jane Birkin. Smith is known for her commitment to exploring new artistic and spiritual avenues, while also saluting the best works in music and literature. The festival will take place from June 11th-25th.", "tinydolphin:1.1b": " Patti Smith is set to host this year's Meltdown arts festival, which will take place at the South Bank Centre in London on June 11th. This year's festival will focus on touching on all aspects of our culture, including readings from renowned authors such as Alan Bennett and Jeremy Irons, while also commemorating classic works like Because the Night by Patti Smith. Patti Smith is known for her work with iconic bands such as The Smiths and Morrissey, and has previously directed successful festival shows in the past, including the critically acclaimed Meltdown 2018, which included performances from various artists including Jane Birkin, Nancy Sinatra, and David Bowie.", "phi:2.7b": " Patti Smith is directing this year's Meltdown arts festival in London, which will be held at South Bank Centre from June 11th to 15th. She aims to explore all aspects of our culture and has ideas for reading Proust and having Jeremy Irons read Genet. The festival seeks to touch on the best art there is while also exploring new avenues. Last year's festival included appearances by Jane Birkin, Nancy Sinatra, and playwright Alan Bennett.\n", "orca-mini:3b": " Patti Smith will be the artistic director of this year's Meltdown festival, which is held at London's South Bank Centre in June. She has not yet decided the line-up for Meltdown but has ideas such as readings from Genet and Jeremy Irons reading Proust. The festival aims to explore new art while saluting the best art there is, aesthetically and spiritually. Last year's festival directed by Morrissey included appearances by Jane Birkin, Nancy Sinatra, and playwright Alan Bennett.", "hermes3:3b": "Patti Smith to host London's Meltdown arts festival\nSmith replaces Morrissey as artistic director\nPlans include readings, Jeremy Irons, Genet readings\nFestival focuses on culture exploration during \"material, exploitative\" times", "stablelm-zephyr:3b": "Patti Smith has been appointed as the artistic director of this year's Meltdown festival, taking place at London's South Bank Centre in June. She will direct 15 days of concerts and events, following previous directors Morrissey, David Bowie, and Nick Cave. Although Smith has not yet announced the line-up for the event, she mentioned wanting to incorporate various aspects of culture, including readings from Genet and a Proust reading by Jeremy Irons. Meltdown aims to explore both new art and celebrated works in order to respond to \"material, exploitative, and greedy times.\" Last year's festival featured appearances by Jane Birkin, Nancy Sinatra, and Alan Bennett, among others.", "chatgpt-4o-latest": "Patti Smith has been named artistic director of this year's Meltdown festival at London's South Bank Centre in June. Following previous directors like Morrissey and David Bowie, she will oversee 15 days of concerts and events, with the lineup yet to be decided. Smith aims to explore various cultural aspects, possibly including readings from Genet and Proust. She sees the festival as a response to materialistic times, emphasizing both new and classic artistic expressions. Last year's festival, directed by Morrissey, featured Jane Birkin, Nancy Sinatra, Alan Bennett, and a reunion of The New York Dolls.", "stablelm2:1.6b": "Punk pioneer Patti Smith has been appointed artistic director of this year's Meltdown festival at London's South Bank Centre in June. As the only female artist among previous directors, Smith will oversee concert and event activities, with no details on the festival line-up yet to be announced. She aims to \"touch on all aspects of our culture\" while also acknowledging the best art that showcases both aesthetically and spiritually significance. Last year's Meltdown festival featured appearances by Jane Birkin, Nancy Sinatra, and playwright Alan Bennett, as well as a reunion show by punk band The New York Dolls.", "granite3.1-dense:2b": "Patti Smith, the iconic punk artist, will serve as artistic director for Meltdown 2023, an arts festival at London's South Bank Centre in June. This marks her inclusion among notable musicians like Morrissey, David Bowie, and Nick Cave. As of now, Smith has not announced the specific lineup but plans to feature diverse elements such as readings by figures like Jean Genet and possibly Jeremy Irons reading Marcel Proust's work. The festival aims to be a celebration of both contemporary and enduring art, particularly in response to current societal issues characterized as materialistic, exploitative, and greedy. Last year, under Morrissey's direction, Meltdown featured performances by Jane Birkin, Nancy Sinatra, and playwright Alan Bennett, along with a reunion show by The New York Dolls.", "reference": "Rock star Patti Smith has been made artistic director of this year's Meltdown festival, to be held at London's South Bank Centre in June.Last year's Meltdown festival, directed by the ex-Smiths star Morrissey, included appearances by singer Jane Birkin, Nancy Sinatra and playwright Alan Bennett.\"It is important we explore the new, but we should also salute the best art there is, aesthetically and spiritually,\" she said.He also persuaded punk band The New York Dolls to reform for a reunion show."}