{"raw_text": "Roxy Music on Isle of Wight bill\n \n Roxy Music will appear at June's Isle of Wight music festival, along with Morrissey, Supergrass and Idlewild.\n \n REM have already been confirmed as headliners for the three-day event, which takes place from 10-12 June. Original band members Bryan Ferry, Phil Manzerana, Andy Mackay and Paul Thompson will take to the stage on the Saturday night of the festival. The band are also working in the studio on new material, their first since the 1982 album Avalon. Roxy Music were formed in 1971 by Ferry, Mackay and Brian Eno, with Manzanera joining the following year. Their first hit was 1972's Virginia Plain, with other hits including Street Life, Love Is The Drug and the 1981 John Lennon cover, Jealous Guy. Roxy Music's back catalogue was re-released in 2000, leading to the band undertaking a world tour in 2001. Morrissey will also play on Saturday at the festival, while Supergrass and Idlewild have been confirmed for the Friday.\n", "llama3.2:1b": "Roxy Music will perform at Isle of Wight music festival alongside Morrissey, Supergrass, and Idlewild.", "llama3.2:3b": "Roxy Music will perform at the Isle of Wight music festival alongside Morrissey, Supergrass, and Idlewild. REM is set to headline the three-day event from June 10-12. Roxy Music is also working on new material, their first in over 30 years. The band's original members will take the stage on Saturday night, featuring Bryan Ferry, Phil Manzanera, Andy Mackay, and Paul Thompson.", "gemma2:2b": "Roxy Music is performing at the Isle of Wight music festival alongside Morrissey, Supergrass, and Idlewild.  REM are headlining, with Roxy Music performing on Saturday night.  The band will be working on new material after a long hiatus. \n", "qwen2.5:0.5b": "Roxy Music will perform at an Isle of Wight music festival from June 10-12, with original members Bryan Ferry, Phil Manzerana, Andy Mackay, and Paul Thompson taking the stage on Saturday night. Roxy Music's first hit was their 1972 album \"Virginia Plain,\" and they are working in the studio to record new material for their album \"Avalon.\" The band has an extensive back catalogue of hits from 1970s to the present, including \"Street Life,\" \"Love Is The Drug,\" and their 1981 cover of \"Jealous Guy.\" Roxy Music's re-release of their first hit, \"Virginia Plain, \" helped lead to a world tour in 2001. Morrissey will perform on Saturday at the festival, while Supergrass and Idlewild have also been confirmed for the Friday night show.", "qwen2.5:1.5b": "Roxy Music, along with Morrissey, Supergrass, and Idlewild, will perform at the Isle of Wight music festival scheduled for June 10-12 featuring Bryan Ferry, Phil Manzerana, Andy Mackay, and Paul Thompson as headliners. The band has new material in the studio; previously hits include Virginia Plain, Street Life, Love Is The Drug, and John Lennon cover Jealous Guy.", "qwen2.5:3b": "Roxy Music, along with Morrissey, Supergrass, and Idlewild, are confirmed performers at the June Isle of Wight music festival. REM are headliners. Bryan Ferry and band members will perform on Saturday as part of a studio album release following 1982’s Avalon. Roxy Music was formed in 1971 by Ferry, Mackay, Eno (with Manzanera joining later), known for hits like Virginia Plain, Street Life, Love Is The Drug, and Jealous Guy. Their catalogue was re-released in 2000, leading to a world tour in 2001. Morrissey will also play on Saturday, with Supergrass and Idlewild confirmed for Friday.", "opencoder:1.5b": "\"Roxy Music will appear at June's Isle of Wight music festival, along with Morrissey, Supergrass and Idlewild.\"\n", "smollm:1.7b": "Roxy Music will appear at June's Isle of Wight music festival, along with Morrissey, Supergrass and Idlewild. Roxy Music will be headlining the three-day event, which takes place from 10-12 June. Original band members Bryan Ferry, Phil Manzerana, Andy Mackay and Paul Thompson will take to the stage on the Saturday night of the festival. The band are also working in the studio on new material, their first since the 1982 album Avalon. Roxy Music were formed in 1971 by Ferry, Mackay and Brian Eno, with Manzanera joining the following year. Their first hit was 1972's Virginia Plain, with other hits including Street Life, Love Is The Drug and the 1981 John Lennon cover, Jealous Guy. Roxy Music's back catalogue was re-released in 2000, leading to the band undertaking a world tour in 2001. Morrissey will also play on Saturday at the festival, while Supergrass and Idlewild have been confirmed for the Friday.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Roxy Music's appearance at the Isle of Wight music festival. Let me read through the provided text first.\n\nThe main points are that Roxy Music is performing on the sixth day, along with Morrissey and Supergrass. The event runs from June 10th to 12th, so they'll have three days. They've already confirmed REM as the mainliners for the full three-day festival. There's a lot about the band members: Bryan Ferry, Phil Manzerana, Andy Mackay, Paul Thompson. I know they started with Ferry, Manzerana, and Brian Eno in 1971, then added more members each year. Their early hits include Virginia Plain, Love Is The Drug, and the John Lennon cover. They've been touring since 2001.\n\nSo, I need to create a summary that includes all these details but in a concise way. I should mention Roxy Music's lineup on Saturday night with their new material, the band members, the first hits they had, and the tour they've done. Also include that REM are confirmed as mainliners for the three days.\n\nI have to make sure not to add any explanations or extra information beyond summarizing key ideas and details. Just plain text. So I'll list each main point clearly without getting too detailed.\n</think>\n\nRoxy Music will perform on the sixth day of the Isle of Wight music festival, with Morrissey and Supergrass also participating. REM have confirmed their support for the three-day event, which runs from June 10th to 12th. The band members include Bryan Ferry, Phil Manzerana, Andy Mackay, and Paul Thompson, who started with Ferry, Manzerana, and Brian Eno in 1971 and expanded since then. Roxy Music' early hits include Virginia Plain, Love Is The Drug, and the John Lennon cover, released in 2000. They have a world tour since 2001.", "tinyllama:1.1b": "Roxy Music will perform at Isle of Wiight music festival, alongside Morrissey and Supergraff, on the Saturday night. Original band members Bryan Ferry, Phil Manzerana, Andy Mackay and Paul Thompson are set to take the stage on the Saturday evening, with new material also reportedly in the works for a forthcoming studio album. Roxy Music was formed in 1971 by Ferry, Mackay, Eno, Manzanera and Thompson, with other hits including \"Virginia Plain\" (1972) and \"Street Life\" (1974). Their 1981 hit single, \"Jealous Guy,\" was also a success. Roxy Music's back catalogue was released in 2000, with a tour of the same year also taking place. Morrissey will play on Saturday night at the festival, while Supergraff and Idlewiild are also confirmed for the Friday.", "tinydolphin:1.1b": " Roxy Music is set to perform at the Isle of Wight music festival, along with iconic bands Morrissey, Supergrass, and Idlewild. The three-day event will take place on June 10th - 12th, in the picturesque Isle of Wight. The original band members, Bryan Ferry, Phil Manzerana, Andy Mackay, and Paul Thompson will join the stage for the Saturday night performance. Roxy Music was formed in 1971 by Ferry, Mackay, and Brian Eno, with Manzanera joining the following year. Their first hit was Virginia Plain, followed by other classics like Street Life, Love Is The Drug, and Jealous Guy. \n\nThe re-release of their back catalogue in 2000 led to a world tour in 2001, with Morrissey joining the band on Saturday at the festival. Supergrass and Idlewild have also been confirmed for the Friday.", "phi:2.7b": " The Isle of Wight music festival is featuring Roxy Music as well as Morrissey, Supergrass and Idlewild. Bryan Ferry, Phil Manzerana, Andy Mackay, and Paul Thompson are set to perform on June's headliners' night while the band has also revealed that they will be working on new material in the studio.\n", "orca-mini:3b": " Roxy Music will perform at the Isle of Wight music festival in June along with Morrissey, Supergrass, and Idlewild. They are working on new material in the studio, and their first album since 1982 is Avalon.", "hermes3:3b": "Roxy Music, Morrissey, Supergrass, Idlewild at Isle of Wight festival (10-12 Jun), with REM as headliners.", "stablelm-zephyr:3b": "Roxy Music and Morrissey will perform at the Isle of Wight music festival alongside Supergrass and Idlewild. The event, taking place from 10-12 June, features REM as headliners with original members Bryan Ferry, Phil Manzanera, Andy Mackay, and Paul Thompson also performing on Saturday night. Roxy Music, formed in 1971 by Ferry, Mackay, and Brian Eno with Manzanera joining the following year, achieved hits such as \"Virginia Plain,\" \"Street Life,\" \"Love Is The Drug,\" and their John Lennon cover, \"Jealous Guy.\"", "chatgpt-4o-latest": "Roxy Music will perform at the Isle of Wight Festival in June, alongside Morrissey, Supergrass, and Idlewild. REM are headlining the three-day event from June 10-12. Original Roxy Music members Bryan Ferry, Phil Manzanera, Andy Mackay, and Paul Thompson will play on Saturday night. The band is also working on new material, their first since 1982's *Avalon*. Formed in 1971, Roxy Music had hits like *Virginia Plain*, *Love Is The Drug*, and *Jealous Guy*. Their back catalogue was re-released in 2000, leading to a world tour in 2001. Morrissey will also perform on Saturday, while Supergrass and Idlewild are set for Friday.", "stablelm2:1.6b": "Roxy Music is set to perform at the Isle of Wight music festival alongside Morrissey, Supergrass, and Idlewild. The three-day event takes place from June 8th, with REM as the headliners. Roxy Music features Bryan Ferry, Phil Manzanera, Andy Mackay, and Paul Thompson; original members Ferry, Mackay, and Eno joined later. Their first hit was \"Virginia Plain,\" followed by hits like \"Street Life,\" \"Love Is The Drug,\" and a John Lennon cover. Morrissey will perform on Saturday, while Supergrass and Idlewild are confirmed for Friday at the festival.", "granite3.1-dense:2b": "Roxy Music, comprising original members Bryan Ferry, Phil Manzanera, Andy Thompson (replaced by Paul Thompson in 1973), and Paul McCartney's former guitarist, will perform on June 10 at the Isle of Wight music festival. This event also features headliners REM, Morrissey, Supergrass, and Idlewild. Roxy Music, known for hits like \"Virginia Plain,\" \"Street Life,\" and \"Jealous Guy,\" last toured in 2001 following the re-release of their catalogue in 2000.", "reference": "Morrissey will also play on Saturday at the festival, while Supergrass and Idlewild have been confirmed for the Friday.Roxy Music will appear at June's Isle of Wight music festival, along with Morrissey, Supergrass and Idlewild.Original band members Bryan Ferry, Phil Manzerana, Andy Mackay and Paul Thompson will take to the stage on the Saturday night of the festival.Roxy Music were formed in 1971 by Ferry, Mackay and Brian Eno, with Manzanera joining the following year."}