{"raw_text": "Pixies take on Reading and Leeds\n \n Pixies, Foo Fighters and Iron Maiden will headline this summer's Leeds and Reading festivals.\n \n The trio of rock heavyweights will top the bill for the three-day events at Bramham Park, near Wetherby, and at Richfield Avenue, Reading. They are the Pixies' and Iron Maiden's only UK festival gigs, while Foo Fighters are also at T In The Park. The Killers, Razorlight and Queens of the Stone Age are also playing the twin festivals, to be held on 26-28 August. Other acts in this year's line-up include The Charlatans, Marilyn Manson and Kings of Leon. Pete Doherty's band Babyshamblers will appear on the NME/Radio One stage along with Kasabian, Black Rebel Motorcycle Club and Bloc Party.\n \n Organiser Mean Fiddler said more acts were still to be confirmed for the summer event. \"We are all very excited to be going back to Reading and intend to have a fantastic time,\" said Iron Maiden's Bruce Dickinson. \"We're sure fans will too.\" It will the first time the veteran British metal band have played Reading in 23 years. At Leeds, Iron Maiden will headline the first day of the festival on the Friday, Pixies will follow on Saturday and the Foo Fighters will close the event on Sunday. The Pixies will headline the first day of Reading, while Foo Fighters will play on Sunday and Iron Maiden will close the event. Weekend tickets are now on sale priced at £125 each.\n", "llama3.2:1b": "Pixies, Foo Fighters, Iron Maiden to headline Leeds and Reading festivals.", "llama3.2:3b": "Pixies, Foo Fighters, and Iron Maiden to headline Leeds and Reading festivals this summer with The Killers, Razorlight, Queens of the Stone Age, and others also performing. Weekend tickets cost £125 per person.", "gemma2:2b": "Pixies, Foo Fighters, and Iron Maiden will headline the Leeds and Reading festivals in August. Other bands on the line-up include The Killers, Razorlight, Queens of the Stone Age, The Charlatans, Marilyn Manson, and Kings of Leon.  Weekend tickets are available for £125 each. \n", "qwen2.5:0.5b": "Pixies, Iron Maiden and Foo Fighters headlining this summer's Leeds and Reading festivals. Other acts include Black Rebel Motorcycle Club, Kings of Leon, The Charlatans, Marilyn Manson, Queens of the Stone Age, Kasabian, Black Rebel Motorcycle Club, and Bloc Party. Tickets for these events are on sale at £125 each.", "qwen2.5:1.5b": "Foo Fighters, Pixies, and Iron Maiden to headline Reading and Leeds festivals in August. Pixies' only UK gig since 2004. Dickinson confirms \"We're sure fans will too.\" BBC's NME/Radio One stage features Babyshamblers alongside Kasabian, Black Rebel Motorcycle Club, and Bloc Party. More acts still confirmed but not announced. Tickets priced at £125 per weekend event.", "qwen2.5:3b": "Pixies, Foo Fighters, and Iron Maiden headline this summer's Leeds and Reading festivals. The triple-header acts include Pixies for their only UK festival gig, Iron Maiden after 23 years in Reading, and Foo Fighters also appearing at T In The Park. Acts like The Killers, Razorlight, Queens of the Stone Age, Babyshambles, Marilyn Manson, and Kings of Leon are playing as well. Weekend tickets cost £125 each.", "opencoder:1.5b": "Pixies take on Reading and Leeds\n\nThe trio of rock heavyweights will head for the three-day events at Bramham Park, near Wetherby, and at Richfield Avenue, Reading. They are the Pixies' and Iron Maiden's only UK festival gigs, while Foo Fighters are also at T In The Park. The Killers, Razorlight and Queens of the Stone Age are playing the twin festivals, to be held on 26-28 August. Other acts in this year's line-up include The Charlatans, Marilyn Manson and Kings of Leon. Pete Doherty's band Babyshamblers will appear on the NME/Radio One stage along with Kasabian, Black Rebel Motorcycle Club and Bloc Party. Organiser Mean Fiddler said more acts were still to be confirmed for the summer event. \"We are all very excited to be going back to Reading and intend to have a fantastic time,\" said Iron Maiden's Bruce Dickinson. \"We're sure fans will too.\" It will be the first time the veteran British metal band has played Reading in 23 years. At Leeds, Iron Maiden will start playing on the Friday before the festival and close it on Sunday. The Pixies will headline the first day of Reading, while Foo Fighters will play on Sunday and Iron Maiden will conclude the event.\n", "smollm:1.7b": "The following summary captures the key ideas and details from the text:\n\n\"Pixies take on Reading and Leeds\" - The three-day festivals in Bramham Park and Richfield Avenue, near Wetherby, will feature a lineup of rock heavyweights, including Iron Maiden, Foo Fighters, and the Killers.\n\n\"The trio of rock heavyweights will top the bill for the three-day events at Bramham Park, near Wetherby, and at Richfield Avenue, Reading.\" - The three-day festivals in these locations will have a lineup of rock heavyweights, including Iron Maiden, Foo Fighters, and the Killers.\n\n\"They are the Pixies' and Iron Maiden's only UK festival gigs, while Foo Fighters are also at T In The Park.\" - The two-day festivals in these locations will feature a lineup of rock heavyweights, including Iron Maiden, Foo Fighters, and the Killers.\n\n\"Pete Doherty's band Babyshamblers will appear on the NME/Radio One stage along with Kasabian, Black Rebel Motorcycle Club and Bloc Party.\" - The two-day festivals in these locations will feature a lineup of rock heavyweights, including Iron Maiden, Foo Fighters, and the Killers.\n\n\"Organiser Mean Fiddler said more acts were still to be confirmed for the summer event.\" - The organizer of the two-day festivals in these locations is planning to have a large lineup of rock heavyweights, including Iron Maiden, Foo Fighters, and the Killers.\n\n\"It will the first time the veteran British metal band have played Reading in 23 years.\" - This statement captures the key idea that this summer's festivals will feature a lineup of rock heavyweights that has not been seen before at these locations for 23 years.\n\n\"At Leeds, Iron Maiden will headline the first day of the festival on the Friday, Pixies will follow on Saturday and the Foo Fighters will close the event on Sunday.\" - The two-day festivals in these locations will have a lineup of rock heavyweights that has not been seen before at these locations for 23 years.\n\n\"Weekend tickets are now on sale priced at £125 each.\" - The organizers are offering discounted ticket prices to fans who want to attend the summer festival, with weekend tickets priced at £125 each.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely. Let me read through it carefully.\n\nThe main events mentioned are the Leeds and Reading festivals. They are taking place in two locations: Bramham Park near Wetherby for three days and Richfield Avenue in Reading for three days as well. The trio includes the Pixies, Foo Fighters, Iron Maiden, and others like The Killers, Razorlight, Queens of the Stone Age, Babyshamblers, Kasabian, and Bloc Party. Organiser Mean Fiddler is excited about this lineup and mentioned that Iron Maiden will play Reading for the first time in 23 years.\n\nThey're selling weekend tickets at £125 each. The key points are the dates, locations, artists performing, and the event's name. I should focus on those details without adding extra information.\n</think>\n\nThe Leeds and Reading festivals are happening over a weekend with performances at Bramham Park (Wetherby) and Richfield Avenue (Reading). Performers include Pixies, Foo Fighters, Iron Maiden, The Killers, Razorlight, Queens of the Stone Age, Babyshamblers, Kasabian, Black Rebel Motorcycle Club, Bloc Party, and Mean Fiddler. Iron Maiden will play Reading for the first time in 23 years. Weekend tickets are £125 each.", "tinyllama:1.1b": "Pixiés, Foo Fighters, and Iron Maidem will headline the Leeds and Reading festival in the UK, taking place from August 26-28 and featuring more than 30 rock acts and a lineup including The Killers, Razorlight, Queens of the Stone Age, The Charlatans, Mariyln Manson, Kings of Leon, Pete Doherty's band Babyshaimblasters, Bloco Party, Black Rebel Motorcycle Club, and Kasabian. The NME/Radio One stage is also expected to feature many more acts. The festival's lineup will continue to grow over the next few months.", "tinydolphin:1.1b": " This text is about an upcoming music festival in England that will feature Pixies, Foo Fighters, Iron Maiden, and other popular rock bands. The event will take place in Leeds and Reading and will include three days of concerts on August 26-28, with tickets available at £125 each.", "phi:2.7b": " The Pixies, Foo Fighters, and Iron Maiden will headline Leeds and Reading festivals in summer, with more acts confirmed to be added to the line-up. Iron Maiden's Bruce Dickinson said fans would have a \"wonderful time,\" as they had not played in Reading for 23 years. The Killers, Razorlight, Queens of the Stone Age, The Charlatans, Marilyn Manson, and Kings of Leon are also playing at the twin festivals.\n", "orca-mini:3b": " This text reports that three rock heavyweights - the Pixies, Iron Maiden, and Foo Fighters - will headline this year's Leeds and Reading festivals. Other acts include The Charlatans, Marilyn Manson, Kings of Leon, and Kasabian. Babyshamblers, led by Pete Doherty, will appear on the NME/Radio One stage along with Razorlight, The Killers, Queens of the Stone Age, and Bloc Party. Organizers say more acts are still to be confirmed for the summer event.", "hermes3:3b": "Pixies, Foo Fighters, Iron Maiden to headline Leeds, Reading festivals; other acts include The Killers, Marilyn Manson.", "stablelm-zephyr:3b": "Pixies, Foo Fighters, and Iron Maiden will headliner the Leeds and Reading festivals this summer. It'll be the trio's only UK festival gigs, with other notable acts including The Charlatans, Marilyn Manson, and Queens of the Stone Age. More acts are still to be confirmed for the events which take place on 26-28 August. Weekend tickets are now available at £125 each.", "chatgpt-4o-latest": "Pixies, Foo Fighters, and Iron Maiden will headline the Leeds and Reading festivals, taking place from August 26-28. These will be the only UK festival appearances for Pixies and Iron Maiden, while Foo Fighters will also play T In The Park. Other acts include The Killers, Razorlight, Queens of the Stone Age, The Charlatans, Marilyn Manson, and Kings of Leon. Babyshambles, Kasabian, Black Rebel Motorcycle Club, and Bloc Party will perform on the NME/Radio One stage. Iron Maiden's Bruce Dickinson expressed excitement about returning to Reading after 23 years. Iron Maiden will headline Leeds on Friday, Pixies on Saturday, and Foo Fighters on Sunday, while at Reading, Pixies will headline Friday, Foo Fighters on Sunday, and Iron Maiden will close the event. Weekend tickets are available for £125. More acts are yet to be confirmed.", "stablelm2:1.6b": "Pixies, Foo Fighters, and Iron Maiden headline the 2012 Leeds and Reading festivals with performances over three days at Bramham Park and Richfield Avenue in Reading. Other bands include The Killers, Razorlight, Queens of the Stone Age, The Charlatans, Marilyn Manson, Kings of Leon, Babyshamblers, Kasabian, Black Rebel Motorcycle Club, Bloc Party, and Bruce Dickinson from Iron Maiden. Weekend tickets are £10 each.", "granite3.1-dense:2b": "Pixies, Foo Fighters, and Iron Maiden will headline the 2023 Leeds and Reading festivals, taking place from August 26-28 at Bramham Park, near Wetherby, and Richfield Avenue, respectively. This marks Pixies' and Iron Maiden's only UK festival appearances this year, with Iron Maiden last performing in Reading 23 years ago. Foo Fighters will also play T In The Park. Other confirmed acts include The Killers, Razorlight, Queens of the Stone Age, The Charlatans, Marilyn Manson, Kings of Leon, Babyshamblers (with Kasabian, Black Rebel Motorcycle Club, and Bloc Party), and multiple others. Weekend tickets for both festivals are priced at £125 each. More acts are yet to be announced.", "reference": "The Pixies will headline the first day of Reading, while Foo Fighters will play on Sunday and Iron Maiden will close the event.Pixies, Foo Fighters and Iron Maiden will headline this summer's Leeds and Reading festivals.At Leeds, Iron Maiden will headline the first day of the festival on the Friday, Pixies will follow on Saturday and the Foo Fighters will close the event on Sunday.They are the Pixies' and Iron Maiden's only UK festival gigs, while Foo Fighters are also at T In The Park.It will the first time the veteran British metal band have played Reading in 23 years.\"We are all very excited to be going back to Reading and intend to have a fantastic time,\" said Iron Maiden's Bruce Dickinson."}