{"raw_text": "Kidman wins photographer battle\n \n Actress Nicole Kidman has won a restraining order against two paparazzi photographers who she claims left her fearful of leaving her Sydney mansion.\n \n The Oscar-winning star took action against Jamie Fawcett and Ben McDonald after a bugging device was found outside her home earlier this week. Lawyers for the pair denied allegations they had planted the device. The Australian actress is currently in Sydney to film her latest movie, Eucalyptus, with Russell Crowe. Kidman was prompted to take action following a reported high-speed car chase with members of the paparazzi in Sydney last weekend.\n \n According to local newspaper the Daily Telegraph, the incident involved paparazzi driving through red lights and on the wrong side of the road in pursuit of Kidman's vehicle. Lawyers for Mr Fawcett and Mr McDonald denied that the pair were involved in the chase. Kidman sought the \"apprehended violence\" orders - normally used in Australia in cases of domestic violence and similar incidents - after being advised to do so by local police. \"Nicole would like to make it clear that she acknowledges she is a public figure and that reporters and photographers have a job to do and she respects that,\" said Kidman's publicist Wendy Day. \"However, these are specific actions against two individuals who, over a period of time, have caused her to feel threatened, intimidated and unable to leave her home without fearing for her safety.\" Magistrate Lee Gilmore, who issued the restraining order at Waverley Local Court in Sydney, said she understood the photographers were entitled to earn a living but there had to be limits to their behaviour. \"Miss Kidman says she's willing to put up with some of it, but it's gone beyond that,\" she said. \"I do believe the allegation in relation to the driving is a serious issue.\"\n", "llama3.2:1b": "Nicole Kidman has won a restraining order against two paparazzi photographers who allegedly left her fearful of leaving her Sydney mansion after a bugging device was found outside her home. The incident occurred during a reported high-speed car chase with members of the paparazzi in Sydney last weekend, and lawyers for the pair denied allegations they had planted the device.", "llama3.2:3b": "Nicole Kidman wins restraining order against two paparazzi photographers who claimed she left her Sydney mansion fearful of leaving due to a bugging device outside her home after a reported high-speed car chase with members of the paparazzi.", "gemma2:2b": "Nicole Kidman obtained restraining orders against two paparazzi photographers after they allegedly used a bugging device on her property and engaged in a high-speed car chase with her last weekend. The actress claims these actions made her fear for her safety and has been advised by police to pursue this course of action.  The magistrate who issued the order acknowledged the photographers' right to work but ruled that their conduct went beyond reasonable limits. \n", "qwen2.5:0.5b": "Actress Nicole Kidman has won a restraining order from two paparazzi photographers who left her frightened of leaving her Sydney mansion. She took action against Jamie Fawcett and Ben McDonald after a bugging device was found outside her home earlier this week. Lawyers for the pair denied allegations they had planted the device. The incident involved paparazzi driving through red lights and on the wrong side of the road in pursuit of Kidman's vehicle. Kidman's lawyers argue she is aware of the situation and has no intention of fleeing without permission.", "qwen2.5:1.5b": "Nicole Kidman sues two paparazzi photographers for restraining order after being chased by them and left fearful of leaving her home due to alleged stalking and threatening behavior, including a high-speed chase.", "qwen2.5:3b": "Nicole Kidman has won a restraining order against two paparazzi photographers who left her fearful after finding a bugging device outside her Sydney home. The incident involved a reported high-speed car chase with members of the media last weekend. Kidman sought \"apprehended violence\" orders, typically used for domestic violence cases, following advice from local police. She believes the photographers have crossed boundaries by pursuing her and others in an intimidating manner, especially during the chase through red lights.", "opencoder:1.5b": "Kidman Wins Photographer Battle.\n\nThe Oscar-winning star, following a bugging device, took action against Jamie Fawcett and Ben McDonald with a high-speed car chase involving paparazzi in Sydney. The local newspaper reported the incident in a red light district and on the wrong side of the road. Prosecutors for the alleged acts of Mr Fawcett and Mr McDonald declined that the pair were involved in the chase, while Kidman sought a \"respected violence\" order to ensure her safety.\n", "smollm:1.7b": "Kidman wins restraining order against two paparazzi photographers who left her fearful of leaving her Sydney mansion. Actress Nicole Kidman has won a restraining order against two paparazzi photographers who she claims left her fearful of leaving her Sydney mansion. The Oscar-winning star took action against Jamie Fawcett and Ben McDonald after a bugging device was found outside her home earlier this week. Lawyers for the pair denied allegations they had planted the device. Kidman is currently in Sydney to film her latest movie, Eucalyptus, with Russell Crowe. Kidman was prompted to take action following a reported high-speed car chase with members of the paparazzi in Sydney last weekend. According to local newspaper the Daily Telegraph, the incident involved paparazzi driving through red lights and on the wrong side of the road in pursuit of Kidman's vehicle. Lawyers for Mr Fawcett and Mr McDonald denied that the pair were involved in the chase. Kidman sought the \"apprehended violence\" orders - normally used in Australia in cases of domestic violence and similar incidents - after being advised to do so by local police. \"Nicole would like to make it clear that she acknowledges she is a public figure and that reporters and photographers have a job to do and she respects that,\" said Kidman's publicist Wendy Day. \"However, these are specific actions against two individuals who, over a period of time, have caused her to feel threatened, intimidated and unable to leave her home.\" Magistrate Lee Gilmore, who issued the restraining order at Waverley Local Court in Sydney, said she understood the photographers were entitled to earn a living but there had to be limits to their behaviour. \"Miss Kidman says she's willing to put up with some of it,\" she said. \"I do believe the allegation in relation to the driving is a serious issue.\"", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about Nicole Kidman winning an restraining order against two paparazzi photographers. The user provided specific details: Kidman was involved in a car chase with photographers last weekend, found a high-speed device outside her home, and now wants orders. She's trying to stay safe.\n\nFirst, I should extract the main points: she won restraining orders due to fear, the incident happened when she was filming, the photographers were driving around red lights and on the wrong side of the road, they didn't claim responsibility, police believed in their actions but limited behavior, and she wants to explain it without blame.\n\nI need to make sure I keep key ideas and details intact. Avoid adding any extra information or explanations. Just a concise summary.\n\nLet me structure it: start with her winning restraining orders, mention the cause, then who was involved (paparazzi), the specific incident of the car chase outside her home, and the legal response from the court. Make sure each sentence flows smoothly without any fluff.\n</think>\n\nNicole Kidman won restraining orders for two paparazzi photographers after a car chase near her home, found a device there, and wants to stay safe with her new movie.", "tinyllama:1.1b": "Actress Nicolle Kidman has won a restrain order against two paparazzi who left her fearful of leaving her Sydney manse after an incident where they allegedly planted a bugging device outside her home last weekend. Attorneys for the pair denied allegations that they had committed high-speed car chases and were involved in the incident, which Kidman called \"apprehended violence\" orders. The Australian actress also reportedly requested that local police advise her to take legal action after being advised to do so by local law enforcement. Kidman's publicist Wendy Day explained that Kidman acknowledges reporting photographers and press, but these specific actions were directed against two paparazzi who she claims have caused her to fear for her safety. The restrain order issued by magistrate Lee Gilmore also acknowledged the right of photographers to earn a living but limits their behavior with regards to Kidman.", "tinydolphin:1.1b": " Nicole Kidman has recently won a restraining order against two paparazzi photographers who reportedly left her fearful of leaving her Sydney mansion. The Oscar-winning actress took legal action after discovering that they had tampered with a bugging device, claiming that the pair were planting it to scare her off. Kidman's lawyers have denied allegations that the photographers intentionally tampered with the device and argued that the Australian star was under pressure to take action following an incident of high-speed chasing with paparazzi in Sydney last weekend.", "phi:2.7b": " Actress Nicole Kidman has won a restraining order against two paparazzi photographers who planted a bugging device outside her home and left her feeling fearful of leaving. The pair denied the allegations but Kidman sought the restraining orders after being advised by local police. She acknowledged she respected their job as reporters and photographers, but the specific actions of these individuals had caused her to fear for her safety.\n", "orca-mini:3b": " Nicole Kidman won a restraining order against two paparazzi photographers who she accused of leaving her fearful of leaving her Sydney mansion. The Australian actress took legal action after a bugging device was found outside her home earlier this week. She sought \"apprehended violence\" orders, which are typically used in Australia in cases of domestic violence and similar incidents. Lawyers for the pair denied allegations they had planted the device. The incident involving paparazzi driving through red lights and on the wrong side of the road in pursuit of Kidman's vehicle was reported to local police.", "hermes3:3b": "Nicole Kidman wins restraining order against paparazzi photographers after finding bugging device outside her Sydney mansion.", "stablelm-zephyr:3b": "Actress Nicole Kidman secured a restraining order against paparazzi Jamie Fawcett and Ben McDonald, following the discovery of a bugging device outside her Sydney home. Lawyers for the photographers denied allegations of planting the device. Kidman sought \"apprehended violence\" orders, after being advised by local police to do so. Magistrate Lee Gilmore issued the restraining order, stating that while photographers have a right to earn a living, there must be limits to their behavior.", "chatgpt-4o-latest": "Nicole Kidman has obtained a restraining order against paparazzi photographers Jamie Fawcett and Ben McDonald after claiming they made her feel unsafe at her Sydney home. The action followed the discovery of a bugging device near her residence and a high-speed car chase involving paparazzi. The photographers denied involvement in both incidents. Kidman, currently in Sydney filming *Eucalyptus*, sought the order after police advice, citing ongoing intimidation. A magistrate acknowledged the photographers' right to work but emphasized limits to their behavior, noting the seriousness of the driving allegations.", "stablelm2:1.6b": "Actress Nicole Kidman wins restraining order against paparazzi photographers who caused her fear due to a device found outside her Sydney mansion. Kidman sought \"apprehended violence\" orders after being advised by local police, with Magistrate Lee Gilmore issuing the restraining order at Waverley Local Court in Sydney. Lawyers for Jamie Fawcett and Ben McDonald deny involvement in a high-speed car chase involving Kidman's vehicle, but Kidman acknowledges her status as a public figure while stressing limits to the photographers' behavior.", "granite3.1-dense:2b": "Nicole Kidman, an Oscar-winning actress currently filming in Sydney for Eucalyptus with Russell Crowe, has secured restraining orders against two paparazzi photographers, Jamie Fawcett and Ben McDonald. The Australian star expressed fear due to a bugging device discovered near her home and a high-speed car chase involving the photographers last weekend, where they allegedly disregarded traffic rules in pursuit of her vehicle. Despite lawyers' denials, Kidman's publicist affirmed that the actress acknowledges the paparazzi's role as reporters and respects their work. Magistrate Lee Gilmore issued the orders, emphasizing that while photographers have a right to earn a living, their behavior must be limited to protect Kidman's safety. The magistrate deemed the allegations of the chase serious.", "reference": "Actress Nicole Kidman has won a restraining order against two paparazzi photographers who she claims left her fearful of leaving her Sydney mansion.Kidman was prompted to take action following a reported high-speed car chase with members of the paparazzi in Sydney last weekend.Magistrate Lee Gilmore, who issued the restraining order at Waverley Local Court in Sydney, said she understood the photographers were entitled to earn a living but there had to be limits to their behaviour.Lawyers for Mr Fawcett and Mr McDonald denied that the pair were involved in the chase.Lawyers for the pair denied allegations they had planted the device.According to local newspaper the Daily Telegraph, the incident involved paparazzi driving through red lights and on the wrong side of the road in pursuit of Kidman's vehicle."}