{"raw_text": "Applegate's Charity show closes\n \n US musical Sweet Charity has cancelled its run on Broadway after poor ticket sales for its early shows.\n \n Star Christina Applegate had to pull out of pre-Broadway performances earlier this month with a broken foot. Producer Barry Weissler said he was \"deeply proud\" of the show, but said the decision to close it was \"painful but fiscally responsible\". Applegate, who starred in TV comedy Married With Children, had been hoping to make her Broadway debut in the show. The 33-year-old injured herself while performing in Chicago, and had been hoping to recover in time for its official New York opening on 21 April. She had received mixed reviews for performances in Minneapolis and Chicago. Previews of the $7.5m (£4m) show were due to begin on 4 April. Sweet Charity tells the story of Charity Hope Valentine, a dancer who always falls in love with the wrong man. It was first performed on Broadway in 1966 with Gwen Verdon in the title role, while Shirley MacLaine starred in the 1969 film version.\n", "llama3.2:1b": "Applegate's charity show on Broadway has closed due to poor ticket sales and she had to pull out of pre-Broadway performances due to a broken foot. The decision was made by producer Barry Weissler citing \"fiscal responsibility\". Applegate, who starred in the TV comedy Married With Children, had hoped to debut in Sweet Charity before its April 21 New York opening but injured herself while performing in Chicago and couldn't recover on time.", "llama3.2:3b": "US musical Sweet Charity has closed its run on Broadway due to poor ticket sales after initial performances, following a broken foot by star Christina Applegate and mixed reviews of her performances, which was her hoped debut on Broadway.", "gemma2:2b": "Sweet Charity musical closed on Broadway due to poor ticket sales. Christina Applegate had to pull out of pre-Broadway shows with a broken foot and couldn't recover in time for its opening. The show was scheduled to run starting April 21st but has been cancelled.  The show tells the story of Charity Hope Valentine, a dancer who always falls in love with the wrong man.  \n", "qwen2.5:0.5b": "Sweet Charity's run on Broadway has been cancelled due to poor ticket sales for its early shows. Christina Applegate had hoped to make her Broadway debut with Sweet Charity and received mixed reviews for performances in Minneapolis and Chicago. The show began previews of previews on April 4th, though it was not announced if the official New York opening would take place until later.", "qwen2.5:1.5b": "Applegate's charity show, starring Christina Applegate, has been cancelled after poor ticket sales due to a broken foot. Producer Barry Weissler said it was \"painful but fiscally responsible\" decision to close the run on Broadway. The production, worth $7.5 million, had mixed reviews from previews in Minneapolis and Chicago.", "qwen2.5:3b": "US musical Sweet Charity on Broadway has been cancelled due to poor ticket sales for early shows. Star Christina Applegate had to pull out of pre-Broadway performances with a broken foot. She was hoping for her Broadway debut but suffered injuries while performing elsewhere. Producer Barry Weissler announced the decision as both \"painful\" and \"fiscally responsible\". The show, initially set to open in April, received mixed reviews.", "opencoder:1.5b": "Applegate's Charity show closes with US musical Sweet Charity has cancelled its run on Broadway after poor ticket sales for its early shows. Star Christina Applegate had to pull out of pre-Broadway performances earlier this month with a broken foot, producer Barry Weissler said he was \"deeply proud\" of the show, but said the decision to close it was \"painful but fiscally responsible\". Applegate, who starred in TV comedy Married With Children, had been hoping to make her Broadway debut in the show. The 33-year-old injured herself while performing in Chicago, and had been hoping to recover in time for its official New York opening on 21 April. She had received mixed reviews for performances in Minneapolis and Chicago. Previews of the $7.5m (£4m) show were due to begin on 4 April. Sweet Charity tells the story of Charity Hope Valentine, a dancer who always falls in love with the wrong man. It was first performed on Broadway in 1966 with Gwen Verdon in the title role, while Shirley MacLaine starred in the 1969 film version.\n", "smollm:1.7b": "The summary is concise and to the point, capturing the main ideas of the text without including any additional information or explanations. It provides a brief overview of the events surrounding Sweet Charity's cancellation on Broadway and the subsequent performances, while also mentioning the key players involved in the production. The summary does not include any analysis or interpretation of the text, but rather presents the facts as they are presented in the original text.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely while preserving key ideas and details. Let me read through it carefully.\n\nFirst sentence mentions that the Applegate's Charity show is closing because of poor ticket sales for its early performances. Then, there's a mention about Star Christina Applegate pulling out of pre-Broadway due to a broken foot during a performance in Chicago. She was \"deeply proud\" of the show but made the difficult decision to close it, which is financially responsible.\n\nShe was hoping to recover for the official New York opening on April 21 and had mixed reviews from previous performances in Minneapolis and Chicago. Previews start on April 4 and the show makes $7.5 million. Sweet Charity is another Broadway play about a dancer who ends up falling in love with the wrong man, first performed in 1966 by Gwen Verdon and later in 1969 in a film version.\n\nSo, key points are: Applegate pulling out of pre-Broadway show due to injury and financial reasons; her hopes for recovery or new show; production starting next week with funds raised from ticket sales. Also, mention of the other Broadway play.\n\nI need to condense this into one concise paragraph without adding explanations or formatting.\n</think>\n\nApplegate's Charity show has closed its pre-Broadway run after poor ticket sales. Star Christina Applegate was unable to join the production due to a broken foot during a performance in Chicago, though it was deeply appreciated for its potential Broadway success. She sought to recover by April 21 but had mixed reviews from previous performances and had hopes of making the show on time. The show, which makes $7.5 million, starts previews next week. Sweet Charity is another Broadway play about a dancer who falls in love with the wrong man, first performed in 1966 with Gwen Verdon and later in a film version.", "tinyllama:1.1b": "Applegate's Charity Show Closes Early After Poor Ticket Sales for Early Shows; Cast Member Christina Applegate Pulls Out Due to Foot Injury, Producer Says Show \"Fiscally Responsible\" for Closing After Initial Success in Chi-Town\n\nUS musical Sweeet Charity had to close its run on Broadway after poor ticket sales for early shows. Star Christina Applegate pulled out of performances due to a broken foot, which producer Barry Weisslr said was \"fiscally responsible\" for the show's closure as it was expecting to earn $7.5m in previews before its official opening. The 33-year-old actress injured herself while performing in Chicago earlier this month and had been hoping to make her Broadway debut in the show. Applegate performed in TV comedy Married With Children, but had received mixed reviews for performances in Chi-Town. Previews of the $7.5m show were due to begin on 4 April, but Sweeet Charity will now \"fiscally\" close after initial success in Chicago.", "tinydolphin:1.1b": " Applegate's Charity has officially closed its Broadway run after poor ticket sales for early performances. The iconic musical Sweet Charity had been set to premiere on April 21, but must now close its doors due to disappointing ticket sales. Star actress Christina Applegate was forced to miss the opening day of the show's pre-Broadway performances earlier this month due to a broken foot. Despite her appearance in the initial trailers for the new musical, producers have made the difficult decision to cancel Sweet Charity's run. The iconic TV comedy Married With Children had starred Applegate in its lead role alongside Gene Hackman. However, she has been performing with a broken foot and will not be able to attend any of the final previews before officially closing on April 18.", "phi:2.7b": " The musical Sweet Charity has closed early due to poor ticket sales and one of its stars' injury. Christina Applegate had a broken foot when she was supposed to perform on Broadway for the show's official opening. It is based on a story about a dancer who always falls in love with the wrong man. It originally opened in \n", "orca-mini:3b": " Sweet Charity, a musical based on the story of Charity Hope Valentine, a dancer who falls in love with the wrong man, has closed after poor ticket sales for its early shows. Star Christina Applegate had to cancel her pre-Broadway performances due to a broken foot. The show was originally scheduled to begin previews on 4 April and open officially on 21 April. Producers Barry Weissler said they were \"deeply proud\" of the show, but closing it was \"painful but fiscally responsible\". Sweet Charity had received mixed reviews for performances in Minneapolis and Chicago.", "hermes3:3b": "Sweet Charity Broadway show closes due to poor ticket sales, despite Christina Applegate's participation cancellation due to broken foot.", "stablelm-zephyr:3b": "US musical Sweet Charity has closed on Broadway due to poor ticket sales for early shows. Christina Applegate starred in pre-Broadway performances but had to withdraw due to a broken foot. Producer Barry Weissler announced the closure, stating it was \"painful but fiscally responsible.\" The show's $7.5m budget proved unsustainable with low ticket sales. Sweet Charity tells the story of Charity Hope Valentine, a dancer who always falls in love with the wrong man, first performed on Broadway in 1966 and later starred Gwen Verdon in the title role while Shirley MacLaine starred in the 1969 film version.", "chatgpt-4o-latest": "The Broadway run of the musical *Sweet Charity* has been canceled due to poor ticket sales. Star Christina Applegate, known for *Married With Children*, had to withdraw from pre-Broadway performances after breaking her foot. Producer Barry Weissler called the decision to close \"painful but fiscally responsible.\" Applegate had received mixed reviews in earlier performances and hoped to recover in time for the official New York opening. The $7.5 million production was set to begin previews on April 4. *Sweet Charity*, first performed on Broadway in 1966, tells the story of a dancer who repeatedly falls for the wrong man.", "stablelm2:1.6b": "US musical Sweet Charity has canceled its run on Broadway due to poor ticket sales for early shows, with Christina Applegate's pre-Broadway performance being cancelled after a broken foot injury. Show producer Barry Weissler is \"proud\" of the production but decided to close it out as \"painful but fiscally responsible\". The original New York opening was scheduled for April 4th, with mixed reviews from Minneapolis and Chicago previews. Sweet Charity tells the story of Charity Hope Valentine, a dancer who always falls in love with the wrong man.", "granite3.1-dense:2b": "Broadway's musical adaptation of Sweet Charity, featuring Christina Applegate, has concluded its run due to insufficient ticket sales from early performances. The 33-year-old actress, known for her role in Married With Children, was forced to withdraw from pre-Broadway engagements after sustaining a broken foot while rehearsing in Chicago. Producer Barry Weissler expressed pride in the production but acknowledged the closure as a tough, financially sound decision. Applegate had aimed for her Broadway debut through this role, receiving mixed reviews from previews in Minneapolis and Chicago. The show's official New York opening was set for 21 April, with previews commencing on 4 April. Sweet Charity, a $7.5m production, first premiered on Broadway in 1966 with Gwen Verdon as the lead, and was later reprised by Shirley MacLaine in the 1969 film adaptation.", "reference": "Applegate, who starred in TV comedy Married With Children, had been hoping to make her Broadway debut in the show.US musical Sweet Charity has cancelled its run on Broadway after poor ticket sales for its early shows.It was first performed on Broadway in 1966 with Gwen Verdon in the title role, while Shirley MacLaine starred in the 1969 film version.Previews of the $7.5m (£4m) show were due to begin on 4 April."}