{"raw_text": "Aviator and Vera take Bafta glory\n \n Hollywood blockbuster The Aviator and low-budget British movie Vera Drake have shared the main honours at the 2005 Bafta film awards. The Aviator was declared best film, and its star Cate Blanchett won best supporting actress. But Vera Drake scored best director for Mike Leigh while Imelda Staunton took the hotly contested best actress award. Jamie Foxx won best actor for Ray, while British actor Clive Owen took best supporting actor for Closer. The two actors have repeated their success at the Golden Globes in January. But big British hope Kate Winslet walked away empty-handed on Saturday despite two nominations for best actress. Celebrating his win, the Oscar-nominated Owen told reporters: \"The whole award season is new to me because I haven't won anything before. All of that is a bit overwhelming.\" Blanchett, who won a Bafta in 1999 for her leading role in Elizabeth, said: \"Winning a Bafta means an enormous amount to me.\" She thanked the woman she played, Katharine Hepburn, for paving the way for women to work in film. \"Thank you very much, I'm sure you're pleased, although you're not able to see this,\" she said.\n \n The Aviator took four awards in all, also collecting best make-up and hair and production design, while Vera Drake also scooped best costume design. Staunton, who is up for an Oscar for her role in Vera Drake, arrived wearing a green silk and chiffon beaded evening dress. \"Thank you very much. I'm so thrilled and so grateful and I'm delighted that the success of Vera Drake has boosted sales of hair nets and pinnies, which is very good,\" she said on accepting her award. Her director Leigh, who beat Martin Scorsese to the best director award, told the audience: \"We always say it was a surprise and sometimes I've said it and not meant it. On this occasion, given the other names, it's a real surprise and an extraordinary honour. \"It's an immense privilege to have been allowed the freedom to make as uncompromising a film as I think Vera Drake is and an epic with such a small budget.\" Best actor Foxx could not make the ceremony, but actress Helen Mirren read out his acceptance speech. \"I'm honoured and proud to receive this Bafta. I'd like to thank the late Ray Charles himself.\" He apologised for not being in London, joking: \"Unfortunately I'm stuck driving a car in LA at gunpoint and I can't get away.\" DiCaprio, who lost out on the best actor Bafta to Foxx, will face him again at the Academy Awards in two weeks' time.\n \n \"It's the first time I've come to the Baftas because it's the first time I've been nominated,\" he told reporters on the red carpet. \"I've appreciated British cinema for a long time and to be recognised like this is a special honour.\" Other winners included The Motorcycle Diaries which took best foreign film and best music, while Eternal Sunshine of the Spotless Mind won best original screenplay and best editing. Best British film was My Summer of Love, the story of two young women and their developing relationship, while Foxx's movie Ray, a bio-pic of late singer Ray Charles, also took best sound. Harry Potter and the Prisoner of Azkaban won the Orange Film Of The Year, voted for by the public.\n \n The Orange British Academy Film Awards are being shown on BBC One from 2010 GMT.\n", "llama3.2:1b": "Hollywood blockbuster \"The Aviator\" and low-budget British movie \"Vera Drake\" took main honours at the 2005 Bafta film awards. Cate Blanchett won best supporting actress for her role in \"The Aviator\". Jamie Foxx won best actor for his role in \"Ray\", while Imelda Staunton won best director for Mike Leigh. Other winners included \"Closer\" and \"Eternal Sunshine of the Spotless Mind\". The ceremony was held on Saturday, March 12, 2005.", "llama3.2:3b": "The Aviator and Vera Drake shared main honors at the 2005 Bafta film awards with The Aviator taking best film and Cate Blanchett winning best supporting actress, while Imelda Staunton won best director for Vera Drake and Jamie Foxx took best actor for Ray. Clive Owen won best supporting actor for Closer, and Kate Winslet was nominated but lost in the best actress category.", "gemma2:2b": "The Aviator won best film at the 2005 BAFTAs, while Vera Drake was awarded Best Director and received the award for best costume design. Imelda Staunton won best actress for her role in Vera Drake. Jamie Foxx won best actor for Ray, and Clive Owen won best supporting actor for Closer.  \n", "qwen2.5:0.5b": "The Aviator and Vera Drake share the Bafta film awards with Cate Blanchett as best actors and director respectively. Cate Blanchett won best supporting actress and Imelda Staunton took best actress, while Jamie Foxx won best actor for his role in The Ring. Kate Winslet from \"A Beautiful Mind\" won best actress but was unable to attend the ceremony due to her two nominations for Best Actress. The Oscar winner was Jamie Foxx who won best actor for his role in Ray.", "qwen2.5:1.5b": "The Aviator and Vera Drake shared Bafta film awards: best director for Mike Leigh, best actress for Imelda Staunton, best supporting actor for Clive Owen in Closer, and a special award to Jamie Foxx for Ray. Actress Kate Winslet missed out on the big prize but won an Oscar nomination. The Aviator was praised as an \"epic with such a small budget.\"", "qwen2.5:3b": "The Aviator and Vera Drake shared main honours at the 2005 Bafta film awards. The Aviator won best film with Cate Blanchett taking best supporting actress. Mike Leigh’s Vera Drake claimed best director, while Imelda Staunton won best actress. Jamie Foxx was named best actor for Ray, and Clive Owen took best supporting actor for Closer. Kate Winslet missed out on an award despite nominations. The Aviator collected four awards including best make-up and hair and production design, while Vera Drake secured best costume design. Helen Mirren read Oscar-nominated Jamie Foxx's acceptance speech. DiCaprio lost the best actor prize to Foxx. Other winners included best foreign film for The Motorcycle Diaries, best original screenplay for Eternal Sunshine of the Spotless Mind, best sound for Ray, and Orange Film Of The Year for Harry Potter and the Prisoner of Azkaban.", "opencoder:1.5b": "The summary of the given text is as follows:\n\nAviator and Vera take Bafta glory at Hollywood blockbuster The Aviator's winning director Mike Leigh and the actor Imelda Staunton took the hotly contested Bafta award, while British actor Clive Owen won best supporting actor for Closer. The two actors have repeated their success at the Golden Globes in January, but Kate Winslet walked away empty-handed on Saturday due to her nomination for best actress. She was pleased with the winning season and received an Oscar-nominated Owen from reporters who appreciated her win, claiming all of that is a bit overwhelming. They thanked the woman she played, Katharine Hepburn, for paving the way for women to work in film.\n\nThe Aviator achieved four awards in total, collecting best make-up, hair and production design, as well as best costume design. The Owen who won the Oscar-nominated Owen also expressed satisfaction with the Bafta season and received a large amount of recognition from the audience. Additional recognition could be given to actors like Foxx and actresses like Mirren based on their performances.\n\nThe movie's success has raised sales of hair nets and pinnies, which is very good. The film's acceptance speech also received applause and a special honour for being nominated in a British cinema. Other nominations, including the Motorcycle Diaries and Eternal Sunshine of the Spotless Mind, were also won by British film and music respectively.\n\nThe BBC One, showing on Orange British Academy Film Awards, is a show that continues to capture the excitement and recognition of winning at the Bafta stage.\n", "smollm:1.7b": "The Aviator and Vera Drake have shared the main honours at the 2005 Bafta film awards. The Aviator was declared best film, and its star Cate Blanchett won Best Supporting Actress for her role in the film. But Vera Drake has taken Best Director for Mike Leigh while Imelda Staunton took Best Make-up and Hair Design.\n\nThe two actors have repeated their success at the Golden Globes in January. But big British hope Kate Winslet walks away empty-handed on Saturday despite two nominations for Best Actress. Celebrating his win, the Oscar-nominated Owen told reporters: \"Winning a Bafta means an enormous amount to me.\" She thanked the woman she played, Katharine Hepburn, for paving the way for women in film.\n\nBest actress Foxx has not been able to attend the ceremony due to her health condition and will face him again at the Academy Awards in two weeks' time.\n\nThe Aviator took four awards in all, also collecting Best Make-up and Hair Design. Vera Drake also scooped Best Costume Design for her role in the film.\n\nBest actor Foxx could not attend the ceremony due to his health condition and will face him again at the Academy Awards in two weeks' time.\n\nThe Aviator took Best Foreign Film and Best Original Screenplay, while Best British Film was My Summer of Love.\n\nBest foreign film was My Summer of Love, the story of two young women and their developing relationship, while Best British Film was Ray, a bio-pic of late singer Ray Charles.\n\nBest original screenplay was My Summer of Love, the story of two young women and their developing relationship, while Best Original Screenplay was Ray, a bio-pic of late singer Ray Charles.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely while preserving the key ideas and details. Let me read through it carefully.\n\nThe text talks about two movies: Aviator and Vera Drake (Btw, I remember that VERA DRAKE is a real name; probably a typo in the original summary). They won awards at the 2005 Bafta. Aviator was best film with Cate Blanchett as a lead actress, while Vera Drake got best director for Mike Leigh. Imelda Staunton won best Actress, and Jamie Foxx got best actor for Ray. Owen won best supporting actor for Clive Owen.\n\nThen it mentions Kate Winslet didn't win anything this year but celebrated her win at the Oscars. The film was a surprise winner because Vera Drake's movie had a small budget and made people think about their careers in film.\n\nStaupton andisha mentioned thanking Katharine Hepburn for paving the way, which is a key point. Vera Drake got best costume design as well. Foxx said he didn't win any awards yet due to his experience from a previous film.\n\nOther winners include The Motorcycle Diaries with foreign films and music, Eternal Sunshine of the Spotless Mind with original screenplay and editing. Best British film was My Summer of Love for two young women's relationship. Ray's movie won for best sound in a bio pic.\n\nThe text also mentions the Orange Film Of The Year going to Harry Potter, which was directed by Ron Weir. It all concludes on BBC One from 2010 GMT with some subtitles and notes about categories.\n\nSo I need to make sure my summary includes all these points: the two movies' awards, actors' wins, Kate's situation at the Oscars, Staupton thanking Hepburn, Vera getting best costume design, Foxx's uncertainty, other winners, and the OFAyawards on BBC One.\n\nI should condense this into a few key sentences without going into too much detail. Make sure to capture all major achievements and quotes.\n</think>\n\nThe 2005 Bafta Film Awards recognized two movies: *Aviator* with Cate Blanchett winning Best Supporting Actress, while Vera Drake claimed Best Director for Mike Leigh. Imelda Staunton won Best Actress, and Jamie Foxx received Best Actor for Ray. The ceremony also honored Helen Mirren for her acceptance speech at the Oscars, where she thanked Ray Charles. Kate Winslet presented the OPA Best Actress Award but didn't receive anything. Vera Drake was recognized as an extraordinary honour with a surprise win for *Vera Drake* due to its budget. She received Best Director and Best Costume Design. *The Motorcycle Diaries* won Foreign Film and Music, while *Eternal Sunshine of the Spotless Mind* won Original Screenplay and Editing. The OPA of British Film was awarded to *My Summer of Love*, focusing on a developing relationship between two young women. Clive Owen won Best Supporting Actor for his bio Pic *Ray*. Harry Potter and the Prisoner of Azkaban also earned OPA recognition. The ceremony is live on BBC One from 2010 GMT.", "tinyllama:1.1b": "The Aviator and Verda Drake shared top honors at the 2005 Bafta film awards, with actress Cateblanet receiving the Best Actress award. Actor Jamie Foxx won Best Actor for his performance in Ray while British actor Clively Owen won the Best Supporting Award for his role in Close Ride. The two actors are repeat winners at the Golden Globe Awards in January, but big British hope Kate Winslestalked off with her win after being awarded Best Actress. Her co-star Helen Mirren read out her acceptance speech before joking that she was stuck behind a car in LA during filming of Ray and apologizing for not being at the ceremony. The Bafta awards recognize British cinema, as well as best foreign film, best music, and best screenplay. The winner of best original screenplay is My Summer of Love while Eternal Sunshine of the Spoilt Mind won best editing. Best British film was also won by Harry Potter and the Prisoner of Azkaban. The Orange British Academy Film Awards are being shown on BBC One from 2010 GMT.", "tinydolphin:1.1b": " A brief summary of the 2005 Bafta film awards:\n\nCate Blanchett won best actress for her role in The Aviator, beating out Imelda Staunton for Vera Drake. The awards are a precursor to the Oscars.", "phi:2.7b": " The Aviator and Vera Drake were both recognized at the 2005 Bafta film awards with The Aviator winning best film, Imelda Staunton taking best director for Vera Drake, and Cate Blanchett winning best supporting actress for her role in The Aviator. Jamie Foxx took best actor for Ray while Clive Owen won best supporting actor for Closer at the ceremony held at the Royal Albert Hall on February 26th, 2006. Kate Winslet was nominated for best actress but walked away without a win after two nominations at the awards show. \n\nExplanation: \nTo summarize the text concisely, we need to extract only the important information and omit any details that are not relevant to the main ideas of the article. We can do this by using the following steps:\n- Read through the entire article carefully to understand the main events and characters mentioned.\n- Identify the most significant facts and figures related to each category (e.g., film awards, actors, director nominees). \n- Use bullet points or a table to organize the information in a clear and concise way.\n- Write out the summary as plain text, without any explanations, formatting, or reasoning process.\nIn this case, we have summarized the article by highlighting the winners of various categories at the 2005 Bafta film awards, including The Aviator, Vera Drake, Ray, Closer, Jamie Foxx, Clive Owen, Kate Winslet, and many more. We also noted that Kate Winslet was nominated for best actress but did not win the award.\n", "orca-mini:3b": " Hollywood blockbuster The Aviator and low-budget British movie Vera Drake shared the main honours at the 2005 Bafta film awards, with The Aviator declared best film and Cate Blanchett winning best supporting actress for her role in The Aviator. Imelda Staunton took best director for Mike Leigh's Vera Drake, while Jamie Foxx won best actor for his role in Ray, but Kate Winslet walked away empty-handed on Saturday despite two nominations for best actress. Clive Owen took best supporting actor for Closer, while British actor Clive Owen took best supporting actor for Closer. The two actors have repeated their success at the Golden Globes in January. But big British hope Kate Winslet won an award for the second year running on Saturday, winning best actress for her role in Vera Drake.", "hermes3:3b": "The Aviator and Vera Drake shared Bafta awards in 2005, with The Aviator winning best film, Cate Blanchett for supporting actress, and Vera Drake winning best director and Imelda Staunton for best actress. Other winners included Jamie Foxx (best actor), Clive Owen (best supporting actor) and Kate Winslet (two nominations but no win).", "stablelm-zephyr:3b": "The 2005 BAFTA film awards saw victories for both high-budget Hollywood blockbuster \"The Aviator\" and low-budget British movie \"Vera Drake.\" \"The Aviator,\" starring Cate Blanchett, took home the Best Film award, while its director Martin Martin Scorsese was beat to the Best Director title by Mike Leigh for \"Vera Drake\". Clive Owen won Best Supporting Actor for his role in \"Closer\" at the event, having previously won the same accolade at the Golden Globes in January. Despite receiving two nominations, Kate Winslet went home empty-handed. Notable winners included Imelda Staunton for \"Vera Drake\", which also took Best Costume Design and Best Make Up & Hair & Production Design.", "chatgpt-4o-latest": "The Aviator and Vera Drake dominated the 2005 Bafta film awards, with The Aviator winning Best Film and Cate Blanchett taking Best Supporting Actress. Vera Drake earned Best Director for Mike Leigh and Best Actress for Imelda Staunton. Jamie Foxx won Best Actor for Ray, while Clive Owen took Best Supporting Actor for Closer. The Aviator also won Best Make-up and Hair and Best Production Design, while Vera Drake secured Best Costume Design. Other winners included The Motorcycle Diaries for Best Foreign Film and Best Music, Eternal Sunshine of the Spotless Mind for Best Original Screenplay and Best Editing, and My Summer of Love for Best British Film. Ray also won Best Sound, and Harry Potter and the Prisoner of Azkaban was voted Orange Film of the Year by the public. The awards were broadcast on BBC One.", "stablelm2:1.6b": "The Aviator and Vera Drake both won major awards at the Bafta film awards, with Cate Blanchett earning best supporting actress for The Aviator and Mike Leigh winning best director for Vera Drake. Meanwhile, Jamie Foxx took best actor for his role in Ray, while Kate Winslet was nominated but didn FLOWTHORNE\nI have created a Python script that uses a simple loop to simulate the growth of a pineapple plant over an extended period. The script keeps track of several key performance metrics such as the number of fruits produced each year and the average number of fruits per square meter.\n\nHere is the code:\n\n```python\nimport random\n\n# Constants\nyears = 10\nplant_area_sq_m = 5\nfruit_production_rate = 0.2 # in kg/year per sq.m\n\n# Initialize plant state\nyear = 0\nplants = 0\nfruit_count = 0\n\ndef simulate_growth():\n    nonlocal year, plants, fruit_count\n    global_year, global_plants, global_fruit_count = year, plants, fruit_count\n    \n    if year > years:\n        # Reset the state for next year's simulation\n        global_year = 0\n        global_plants = 0\n        global_fruit_count = 0\n\n    # Grow one pineapple plant each year\n    global_plants += 1\n    global_fruit_count += fruit_production_rate\n    \n    if global_plants >= plant_area_sq_m:\n        # If the plant is growing at or above the desired area, calculate average fruit density\n        fruit_density = global_fruit_count / (global_plants * fruit_production_rate)\n        \n        print(f'Year {year+1}:')\n        print(f'Total plants grown: {plants}')\n        print(f'Fruits produced: {fruit_count} ({fruit_density:.2f} fruits/sq.m)')\n\n    year += 1\n\n# Simulate growth over ten years\nsimulate_growth()\nprint('After ten years, the pineapple plant has:')\nprint(f'Vertnage: {plant_area_sq_m}')\nprint(f'Fruits produced in total: {global_fruit_count}')\n\nprint('\\nAverage fruit density per square meter:')\nprint(f'At {plants} plants/tree (average area 5 sq.m):')\nprint(f'Fruits produced: {fruit_count:.2f} ({(fruit_density/number_of_plants).toFixed(2)} fruits/sq.m)')\n```\n\nThis script uses a simple nested loop to simulate the growth of a pineapple plant over ten years. The initial plant area is set to 5 square meters, with a fruit production rate of 0.2 kg per year and per square meter.\n\nEach year, the simulation calculates how many plants have been grown and how many fruits have been produced. It then updates the state variables (`year`, `plants`, and `fruit_count`) based on these calculations.\n\nIn this script, I've used a simple nested loop to simulate the growth of the pineapple plant over ten years. The number of plants per year is randomly generated between 1 and 10 (for instance, there might be one pineapple plant in the first year, five in the second, etc.). Similarly.\nI'm pretty sure if she wasn S HE was a high school student doing an English paper on Jane Austen, she would have read Pride and Prejudice. It's a classic! You could say that it's her \"To Kill a Mockingbird,\" or whatever everyone else is calling it these days.\nSo...yeah. That was all pretty much pointless because I already know how the story ends. Jenga anyone?\nAnyway, here are some pictures from my weekend!\nOn Friday evening, we went to see my friend Lizzy perform at a local bar/restaurant. We had a great time and got to enjoy some delicious food while listening to her sing.\nSaturday was pretty much all about food, as you can tell from the lack of anything else in these pictures.\nWe started with some seriously amazing avocado toast (from this little spot called Avocado Press) that we both raved about. Then we hit up a few other restaurants for some tasty eats:\n- The Crack Shack for some loaded fries\n- A Mexican place for tacos\n- A pizza place where the pepperoni was sliced into long thin strips (for some reason, I don't think I've ever had pepperoni like that before)\nAnd of course, there were plenty of drinks to go around. My friend Lizzy brought a bottle of her favorite tequila, and we also got some fancy-schmancy lemonade from this place called The Lemon Room.\nWe all know how much I love my lemons, so when I saw that they had a lemonade bar with different types of syrups to mix with the juice, I had to try it. It was pretty fantastic!\nAfter we'd eaten and drank our fill (and tried a bunch of other places as well), we headed back to Lizzy's apartment for some goodnight chat time.\nAll in all, it was quite the weekend. I'm pretty sure I've already mentioned before that my birthday is on Sunday, so maybe this is just how I'm celebrating? Probably not...\nIn any case, here are a few more pictures from my birthday celebration last year (which took place over several days and included lots of drinks and games of Kanoku):\nThis picture was taken by our friend Rachel, who somehow managed to capture me mid-moon face without making me look like I'm about to explode. Haha!\nWe spent the evening playing a game called \"Kanoku,\" which is basically a fancy version of Jenga where you have to stack all your blocks in order (or as ordered by your partner) before anyone can take any down. It was surprisingly fun, especially since it got pretty competitive and stressful.\nAnother picture from that night - this one was taken by my mom:\nI love how happy these pictures make me feel! My mom is the best.\nIn case you're wondering, I'm not really a fan of Kanoku or anything else we did on Saturday. It's just that once you've been to Avocado Press once, you kind of know what you're getting into...\nOh, and here are some more pictures from my birthday celebration last year:\nThis one was taken by my sister, who somehow managed to capture me looking stern and determined while simultaneously trying to avoid tripping over my own feet.\nAnd this picture is just a really old one from when I was a kid, of myself and a few friends posing in front. We were all pretending we were famous actors or something.\nI've got some pretty funny stories about that one!\nOverall, it was definitely a fun weekend with lots of good food and drinks. And hey, now that my birthday is over (for the most part - I'll probably be back to eating cake soon enough), it's time to get back on track and start prepping for my next adventure! We'll see how long that lasts...\nAnyway, I'm off to try and make this blog post come together in a coherent way. I think my brain has been feeling a bit scattered lately, so we'll just have to wait and see if it works out.\nUntil then, cheers!\nP.S. Just for fun, here's a picture of me looking particularly pleased with myself from that night:\nOh, look at that - I must be doing something right! Or maybe I'm just really good at pretending to enjoy myself...\nhaha\nHappy birthday again and thanks for sharing your weekend celebration photos! It looks like a lot of yummy food and drinks! Your mom's photo is lovely too - she seems to have a gift for capturing happy moments in your life. Happy Monday!\nOh, and I'm so with you on the Kanoku game. It could be hours before we get any blocks off the ground, and it becomes an all-out competition that makes us want to cry. Haha\nBut hey, at least now you know what it's like to play! :) Thanks for sharing your birthday celebration photos too - I hope you had a wonderful day filled with lots Laramie.\nIn 1984, as part of the Reagan Revolution, she was a member of the College Republicans. She also served as president of her local YWCA chapter and volunteered at various community organizations.\n\nAfter graduating from college, Ms. Anderson worked in marketing for several years before starting her own event planning business. She also taught adult education classes on topics like budgeting and time management.\n\nMs. Anderson's success led to her being hired by the city to manage events. Her responsibilities included coordinating large-scale events such\nas parades, street fairs, and holiday celebrations.\n\nOne of Ms. Anderson's most notable achievements was managing the 1987 centennial celebration for the town of Pawnee in Oklahoma.\nThe event drew over 30,000 people from around the world to celebrate the town's history and culture.\n\nMs. Anderson's dedication to her work and community earned her recognition as one of People Magazine's \"40 Under 40\" in 2010.\n\nIn addition to her professional achievements, Ms. Anderson was also devoted to her family. She spent many years coaching youth soccer teams, volunteering at local schools, and spending time with her husband and three children.\n\nDespite facing personal challenges such as the loss of her mother and the passing of a childhood friend, Ms. Anderson remained committed to living life to its fullest.\n\nMs. Anderson passed away in 2017 at the age of 40 after a battle with thyroid cancer. Her legacy lives on through the many events she managed during her time with the city of Pawnee and the impact she had on her community and family members alike.\n\nIn conclusion, Ms. Anderson's dedication to her work, passion for event planning, commitment to her community, and strong family relationships are just a few examples of how she left an enduring legacy in both her professional and personal life.\nMs. Anderson's achievements serve as inspiration for aspiring entrepreneurs, event planners, and community leaders who aspire to make an impact on their respective communities.\n\nIn addition, Ms. Anderson's story highlights the importance of resilience, hope, and commitment to one's goals amidst adversity. Her journey from college student to successful business owner and community leader demonstrates that with determination, hard work, and a willingness to learn, one can overcome life's challenges and achieve remarkable success.", "granite3.1-dense:2b": "At the 2005 Bafta film awards, two distinct films—Hollywood's The Aviator and British production Vera Drake—shared accolades. The Aviator won best film, with Cate Blanchett as best supporting actress for her role as Katharine Hepburn. Meanwhile, Mike Leigh received best director for Vera Drake, and Imelda Staunton took the best actress prize. Jamie Foxx's Ray, earning him a Golden Globe nomination, won best actor, while Clive Owen's Closer earned him best supporting actor. British hope Kate Winslet was left empty-handed despite two nominations for best actress. Staunton, an Oscar contender for Vera Drake, expressed gratitude for the film's success in boosting sales of traditional British attire like hair nets and pinnies. Leigh, winner over Martin Scorsese, emphasized his freedom to create uncompromising cinema on a small budget. Foxx, unable to attend, had Helen Mirren read his acceptance speech. DiCaprio, who lost best actor Bafta to Foxx, anticipates a rematch at the Academy Awards. Other winners included The Motorcycle Diaries for best foreign film and best music, Eternal Sunshine of the Spotless Mind for original screenplay and editing, My Summer of Love as best British film, and Harry Potter and the Prisoner of Azkaban for Orange Film Of The Year.", "reference": "But Vera Drake scored best director for Mike Leigh while Imelda Staunton took the hotly contested best actress award.Best British film was My Summer of Love, the story of two young women and their developing relationship, while Foxx's movie Ray, a bio-pic of late singer Ray Charles, also took best sound.The Aviator was declared best film, and its star Cate Blanchett won best supporting actress.Jamie Foxx won best actor for Ray, while British actor Clive Owen took best supporting actor for Closer.DiCaprio, who lost out on the best actor Bafta to Foxx, will face him again at the Academy Awards in two weeks' time.Other winners included The Motorcycle Diaries which took best foreign film and best music, while Eternal Sunshine of the Spotless Mind won best original screenplay and best editing.Hollywood blockbuster The Aviator and low-budget British movie Vera Drake have shared the main honours at the 2005 Bafta film awards.The Aviator took four awards in all, also collecting best make-up and hair and production design, while Vera Drake also scooped best costume design.Her director Leigh, who beat Martin Scorsese to the best director award, told the audience: \"We always say it was a surprise and sometimes I've said it and not meant it.But big British hope Kate Winslet walked away empty-handed on Saturday despite two nominations for best actress.I'm so thrilled and so grateful and I'm delighted that the success of Vera Drake has boosted sales of hair nets and pinnies, which is very good,\" she said on accepting her award.Best actor Foxx could not make the ceremony, but actress Helen Mirren read out his acceptance speech."}