{"raw_text": "Original Exorcist to be screened\n \n The original version of horror prequel Exorcist: The Beginning, dropped by producers over claims it was not scary enough, is to have its world premiere.\n \n The film, directed by Paul Schrader, will be screened on 18 March at the International Festival of Fantastic Film in Brussels. The psychological drama stars Stellan Skarsgard and foreruns the 1973 film. Schrader was replaced by director Renny Harlin who made a new version of the film which debuted in 2004. The prequel project was originally announced in 2001, with actor Liam Neeson in the lead role and John Frankenheimer as director. However Frankenheimer pulled out in 2002, a month before he died.\n \n Skarsgard then replaced Neeson in the role of Father Merrin, made famous by Max Von Sydow in the 1973 film. Principal footage was shot in Morocco and Rome at a reported cost of $32m. However, in August 2003 it emerged that producers Morgan Creek were shelving Schrader's version of the film, having complained it was not scary enough. As well as replacing Schrader with Harlin - the director behind Die Hard 2 and Cliffhanger - the producers also changed most of the cast, but Swedish star Skarsgard stayed in the Merrin role. Harlin's film, released in the UK in October 2004, received lukewarm reviews but went on to make over $76m (£40.7m) worldwide. The festival screening will be the first time that Schrader's film has been seen in public. Reports that it will be released either in cinemas or on DVD have yet to be confirmed. Other films at the festival in the Belgium capital, which runs from 11-26 March, include the US horror hit Boogeyman and the forthcoming sequel Ring 2, as well as a selection of films adapted from the works of Jules Verne.\n", "llama3.2:1b": "The original Exorcist prequel film \"Exorcist: The Beginning\" is to premiere at an international festival in Brussels on March 18th. Directed by Paul Schrader, it stars Stellan Skarsgard as Father Merrin and was originally announced in 2001 but changed its director multiple times before finally being completed by Renny Harlin.", "llama3.2:3b": "The original version of Exorcist: The Beginning, directed by Paul Schrader, will have its world premiere on March 18 at the International Festival of Fantastic Film in Brussels. The film stars Stellan Skarsgard and is a prequel to the 1973 film, with principal footage shot in Morocco and Rome for $32m. Producers shelved Schrader's version due to it not being scary enough, leading to director Renny Harlin replacing him, but ultimately resulting in a successful worldwide box office performance of over $76m.", "gemma2:2b": "The original Exorcist prequel directed by Paul Schrader is to have its world premiere at the International Festival of Fantastic Film in Brussels on March 18th. This version was dropped by producers for being not scary enough and replaced by Renny Harlin, who made a new version in 2004.  This film stars Stellan Skarsgard as Father Merrin and features principal footage shot in Morocco and Rome for $32 million. Reports of the original film's release are yet to be confirmed, but it will be shown publicly for the first time. \n", "qwen2.5:0.5b": "The Exorcist: The Beginning film is to be screened at the International Fantastic Film Festival in Brussels on March 18th, 2005. It stars Stellan Skarsgard and features a psychological drama adaptation of the 1973 horror classic. Production costs were reported to be $32 million but the film was shelved by producers Schrader and Harlin after replacing them with Renny Harlin. The director, John Frankenheimer, has been replaced with Stellan Skarsgard in the role of Father Merrin. The festival screening will feature a prequel version of the Exorcist: The Beginning that was originally announced in 2001 but later shelved due to concerns about it not being scary enough. Reports suggest the film could be released either in cinemas or on DVD, with other films from the Belgium capital including Boogeyman, Ring and sequel Ring 2, as well as a selection of adaptations of Jules Verne's works.", "qwen2.5:1.5b": "The original version of Exorcist: The Beginning, directed by Paul Schrader and starring Stellan Skarsgard, will screen at an International Festival of Fantastic Film in Brussels on March 18th due to its perceived lack of scare factor, following the producer's decision to replace Schrader with Renny Harlin. Harlin's film made over $76m globally, but it was initially shelved by Morgan Creek producers who complained about its lack of fear, prompting changes in casting and production costs.", "qwen2.5:3b": "The original Exorcist: The Beginning, a psychological drama directed by Paul Schrader and starring Stellan Skarsgard, was shelved due to criticisms of its perceived lack of scares. Directed by Renny Harlin after replacing Schrader, the film had principal shooting in Morocco and Rome with a budget of $32m. While Harlin's 2004 version received lukewarm reviews, it grossed over $76m worldwide. The original version will be screened for the first time at the International Festival of Fantastic Film in Brussels on March 18th.", "opencoder:1.5b": "The original version of horror prequel Exorcist: The Beginning has been dropped by producers over claims it was not scary enough. It will be premiered on 18 March at the International Festival of Fantastic Film in Brussels.\n", "smollm:1.7b": "The original version of horror prequel Exorcist: The Beginning is to have its world premiere on 18 March at the International Festival of Fantastic Film in Brussels. The film, directed by Paul Schrader, will be screened on 18 March at the festival and will feature Stellan Skarsgard as Father Merrin and John Frankenheimer as Director. The film was originally announced in 2001 with actor Liam Neeson in the lead role and John Frankenheimer as director. However, producer Morgan Creek replaced Schrader with Harlin - the director behind Die Hard 2 and Cliffhanger - for the world premiere of the film on 18 March at the festival. The film was originally released in Morocco and Rome at a reported cost of $32m (£40.7m). However, in August 2003 it emerged that producers Morgan Creek were shelving Schrader's version of the film, having complained it was not scary enough. As well as replacing Schrader with Harlin - the director behind Die Hard 2 and Cliffhanger - the producers also changed most of the cast, but Swedish star Skarsgard stayed in the Merrin role. Harlin's film, released in the UK on 1 October 2004, received lukewarm reviews but went on to make over $76m (£40.7m) worldwide. The festival screening will be the first time that Schrader's version of the film has been seen in public. Reports that it will be released either in cinemas or on DVD have yet to be confirmed. Other films at the festival in Belgium, which runs from 11-26 March, include the US horror hit Boogeyman and the forthcoming sequel Ring 2, as well as a selection of films adapted from the works of Jules Verne.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely. The user wants only the summary in plain text without any explanations or formatting.\n\nFirst, I'll read through the original passage carefully. It's about Exorcist: The Beginning prequel being scheduled for a premiere.\n\nKey points from the original text:\n\n- It's a psychological drama film.\n- Directed by Paul Schrader and later replaced by Renny Harlin.\n- Prequel project was announced in 2001 with Liam Neeson as lead and John Frankenheimer director, but he left early.\n- The prequel was made cheaper by producers Morgan Creek because it wasn't scary enough.\n- Skarsgard took over for the lead role, which was a big change from Neeson.\n- The film was shot in Morocco and Rome at $32 million cost.\n- It faced some casting changes but Skarsgard stayed.\n- Harlin's new version had mixed reviews but made $76 million worldwide.\n\nSo, I need to include all these points concisely without any extra information. Make sure each key element is included: the film's title, director, changes, main cast details, production costs, and some critical points about reception.\n</think>\n\nExorcist: The Beginning prequel will be screening at the International Festival of Fantastic Film in Brussels on 18 March. Directed by Paul Schrader, who was replaced by Renny Harlin for his new film that debuted in 2004. Skarsgard replaces Neeson in Father Merrin's role and directs the film, shot in Morocco and Rome at $32 million cost. The prequel faced criticism but made over $76 million worldwide. It will be the first time Schrader's film has been seen publicly.", "tinyllama:1.1b": "The original version of horror prequel Exorcism: The Beginning, directed by Paul Schradeer, will have its world premier at the International Festival of Fantastic Film in Bruxelles on March 18th. Despite claims that it was not scary enough, the film is set to be relased after being screened at the festival, with Liam Neeseon replacing Steffan Skarsgard as Father Merrin, making a new version of the original film by John Frankenheimer. Other films in this year's edition of the festival include horror hits Boogeyman and Ring 2, as well as sequels to classic American novels from Jules Verné.", "tinydolphin:1.1b": " In January, rumors circulated that the original version of the horror prequel Exorcist: The Beginning would be screened at the International Festival of Fantastic Film in Brussels, scheduled to take place on March 18th. Directed by Paul Schrader, the film starred Stellan Skarsgard and was supposed to premiere in 2004. However, this film project was later replaced by director Renny Harlin, who made a new version of the film with an updated cast. The prequel had already received lukewarm reviews before being revised, prompting concerns from producers over whether it was scary enough for audiences.\n\nIn August 2003, it was announced that Morgan Creek Productions, which acquired the rights to the film in 2001, were considering shelving Schrader's version of the movie due to its perceived lack of scares. As a result, several actors, including Stellan Skarsgard and John Frankenheimer, lost their roles in the film.\n\nThe new cast included Swedish actor Liam Neeson, who was initially expected to play Father Merrin before replacing Skarsgard. Principal footage was shot in Morocco and Rome, with additional scenes taken in New York. The film's producers reportedly complained that the film was not scary enough and decided to change their minds by shelving Schrader's version of the movie.\n\nIn March 2004, it was reported that the original film would be screened at the Brussels International Festival of Fantastic Film, followed by a DVD release. The festival screening will mark the first public appearance of Schrader's film. Other films at the event include the US horror hit Boogeyman and the forthcoming sequel Ring 2.", "phi:2.7b": " Original Exorcist is being screened at the International Festival of Fantastic Film with a new version by director Renny Harlin. The psychological drama stars Stellan Skarsgard, and replaced original director John Frankenheimer who left due to death in February 20022. Filming took place in Morocco and Rome for $32m and the film was released in October 20041 as Die Hard 2-3. Schrader's version of the film was dropped by Morgan Creek producers as it wasn't scary enough, but will be screened at the festival in Brussels in March. Other films include Boogeyman, Ring, and Jules Verne adaptations.\n", "orca-mini:3b": " The original Exorcist prequel, titled Exorcist: The Beginning, will have its world premiere at the International Festival of Fantastic Film in Brussels. It stars Stellan Skarsgard and foreruns the 1973 film. However, it was not scary enough for producers who shelved Schrader's version and replaced most of the cast. Harlin's version, released in the UK in October 2004, received lukewarm reviews but went on to make over $76m worldwide. The festival screening will be the first time that Schrader's film has been seen in public.", "hermes3:3b": "Exorcist: The Beginning (orig.) horror preq. to be screened at Brussels festival on 18th Mar; directed by Paul Schrader, stars Stellan Skarsgard; replaced Schrader's version due to not being scary enough; cost $32m.", "stablelm-zephyr:3b": "The original Exorcist: The Beginning, cancelled by producers due to lack of scareness, will have its world premiere at the International Festival of Fantastic Film in Brussels on 18 March. Directed by Paul Schrader and starring Stellan Skarsgard, this psychological drama serves as a prequel to the 1973 film. Producers replaced Schrader with Renny Harlin, who directed Die Hard 2, and altered the cast. The film was shot in Morocco and Rome for $32m. Although Schrader's version received lukewarm reviews upon its UK release in 2004, it went on to make over $76m worldwide. The festival screening marks the first public showing of Schrader's film. Its future release in cinemas or on DVD remains uncertain.", "chatgpt-4o-latest": "The original version of *Exorcist: The Beginning*, directed by Paul Schrader and previously shelved for not being scary enough, will have its world premiere on 18 March at the International Festival of Fantastic Film in Brussels. The film, a psychological drama starring Stellan Skarsgard, was replaced by a new version directed by Renny Harlin, which debuted in 2004. The prequel project was initially announced in 2001 with Liam Neeson and John Frankenheimer, but changes led to Skarsgard taking the lead role. Schrader's version, filmed in Morocco and Rome for $32 million, was discarded by producers Morgan Creek in 2003. Harlin's version, though receiving lukewarm reviews, earned over $76 million worldwide. The festival screening marks the first public showing of Schrader's film, with no confirmation yet on a wider release. The festival will also feature *Boogeyman*, *Ring 2*, and films based on Jules Verne's works.", "stablelm2:1.6b": "The original Exorcist prequel film, Exorcist: The Beginning, will have its world premiere at the International Festival of Fantastic Film in Brussels after being dropped by producers due to concerns about its level of horror. Directed by Paul Schrader, starring Stellan Skarsgard, it will screen on March 15th at the festival. Originally announced with Liam Neeson as the lead actor and John Frankenheimer directing, the project was later revived with Renny Harlin as director. Principal footage was filmed in Morocco and Rome but producers Morgan Creek removed Schrader's version due to concerns about its scare factor. Skarsgard replaced Neeson as Father Merrin, and while most of the cast changed, Skarsgard stayed in his role. The film received lukewarm reviews upon release and is set to be screened for the first time publicly at the festival.", "granite3.1-dense:2b": "The original Exorcist prequel, \"Exorcist: The Beginning,\" directed by Paul Schrader in 2001, will have its world premiere at the International Festival of Fantastic Film in Brussels on March 18. The film, starring Stellan Skarsgard as Father Merrin (a role previously held by Max Von Sydow), was shelved due to its lack of scares. Director Renny Harlin took over after replacing Schrader in 2003. Principal photography cost $32 million, primarily in Morocco and Rome. Despite receiving mixed reviews upon release in 2004 (making over $76m worldwide), this version of the story has not been widely available since. This festival screening marks the first time Schrader's film will be seen publicly. The event features other films like Boogeyman, Ring 2, and adaptations from Jules Verne's works.", "reference": "Schrader was replaced by director Renny Harlin who made a new version of the film which debuted in 2004.However, in August 2003 it emerged that producers Morgan Creek were shelving Schrader's version of the film, having complained it was not scary enough.The film, directed by Paul Schrader, will be screened on 18 March at the International Festival of Fantastic Film in Brussels.Skarsgard then replaced Neeson in the role of Father Merrin, made famous by Max Von Sydow in the 1973 film.Other films at the festival in the Belgium capital, which runs from 11-26 March, include the US horror hit Boogeyman and the forthcoming sequel Ring 2, as well as a selection of films adapted from the works of Jules Verne.The psychological drama stars Stellan Skarsgard and foreruns the 1973 film."}