{"raw_text": "Bollywood DVD fraudster is jailed\n \n A major distributor of pirated DVDs of Bollywood films has been sent to prison for three years.\n \n Jayanti Amarishi Buhecha from Cambridge was found guilty of two trademark offences last month, and sentenced at Harrow Crown Court, London, on Tuesday. Buhecha, who made £26,000 per month from his illegal trade, was called \"one of the biggest Bollywood pirates in the UK\" by the sentencing judge. The British Phonographic Industry (BPI) worked for two years on the case.\n \n An operation was launched against Buhecha in 2002 after complaints were received about his activities. The judge in the case, which lasted seven days, said that \"a heavy penalty was called for because of the enormous damage Buhecha caused to legitimate business\". Fake DVDs were manufactured in Pakistan and Malaysia and sold on wholesale to shops by Buhecha, who traded in conterfeit DVDs in 2002 and 2003.\n \n In December 2002, he was stopped in his car by trading standards officers, who uncovered 1,000 pirated DVDs and faked inlay cards printed with registered trademarks. Despite being arrested and bailed, Buhecha was caught a second time at the end of 2003. His home and a lock-up in Cambridge were found to contain 18,000 counterfeit DVDs and further faked inlay cards. Buhecha was previously a legitimate distributor of Bollywood films, but was suspended and sued by his employers for dealing in illegal copies of Bollywood classic Mohabbatein. Legitimate Bollywood film distributors have hailed the conviction as \"a major boost\". Bollywood music and film suffers piracy at the rate of 40%, which is more than that suffered by mainstream productions. The BPI welcomed the news of the prison sentence, but warned there are plenty of other active counterfeiters of Bollywood films. The organisation's anti-piracy director David Martin said: \"The problem simply will not disappear with Buhecha. Others and more will take his place, so it's vital that keep up our efforts in this field.\"\n", "llama3.2:1b": "A Bollywood DVD distributor was sentenced to three years in prison after being found guilty of trademark offenses related to pirated DVDs. The court ruled he caused £26,000 worth of damage by selling counterfeit copies of films and distributing them across the UK. Buhecha was stopped in 2002 and again in 2003 for allegedly possessing over 18,000 counterfeit DVDs and faked inlay cards from registered trademarks.", "llama3.2:3b": "Jayanti Amarishi Buhecha, a major distributor of pirated Bollywood DVDs, was jailed for three years after being found guilty of two trademark offenses. He made £26,000 per month from the illegal trade and was called \"one of the biggest Bollywood pirates in the UK\". The case involved fake DVDs manufactured in Pakistan and Malaysia, sold to shops by Buhecha, and resulted in 18,000 counterfeit DVDs and faked inlay cards being discovered at his homes. Legitimate Bollywood distributors hailed the conviction as a major boost, while the BPI warned that others would take Buhecha's place.", "gemma2:2b": "Jayanti Amarishi Buhecha, a former legitimate Bollywood film distributor, was sentenced to three years in prison for trademark offences related to selling pirated DVDs of Bollywood films.  He made £26,000 per month from his illegal trade and is considered one of the UK's biggest Bollywood pirates. The British Phonographic Industry (BPI) worked on this case for two years.   Buhecha manufactured and sold fake DVDs in both 2002 and 2003.  His home and a lock-up contained 18,000 counterfeit DVDs, and he was caught multiple times for illegal activities.   The case highlights the issue of piracy affecting Bollywood film production and distributors are optimistic about this conviction as a step toward reducing it. \n", "qwen2.5:0.5b": "A major distributor of pirated DVDs from the UK has been sentenced to three years in prison for being found guilty of two trademark offences. The court ordered him to pay £26, 000 per month and banned him from selling Bollywood films for life. He was called \"one of the biggest Bollywood pirates in the UK\".", "qwen2.5:1.5b": "Bollywood DVD distributor Jayanti Amarishi Buhecha from Cambridge has been sentenced to three years in prison for trademark offenses related to counterfeit DVDs. This is part of a larger crackdown on illegal Bollywood film distribution, which has affected legitimate distributors and the overall industry's reputation. The court case highlighted the scale of the problem: more than 18,000 fake DVDs were found at Buhecha's home and lock-up, leading authorities to conclude that \"a heavy penalty was called for\" due to the damage caused to legitimate business.", "qwen2.5:3b": "A major distributor of pirated Bollywood DVDs, Jayanti Amarishi Buhecha from Cambridge, was jailed for three years after being found guilty of two trademark offences by Harrow Crown Court, London. Buhecha made £26,000 per month from illegal trade and manufactured counterfeit DVDs in Pakistan and Malaysia before selling them wholesale to shops in the UK. He was sentenced due to causing significant damage to legitimate business. The case lasted seven days as it revealed he had been caught twice for possessing 18,000 counterfeit DVDs. Buhecha initially traded legit Bollywood films but later dealt in pirated copies. Legitimate distributors welcomed his conviction and BPI, an anti-piracy organisation, praised the news but acknowledged that other counterfeiters might take his place.", "opencoder:1.5b": "\"Jailed for three years by a major distributor of pirated DVDs of Bollywood films\" is the summary text.\n", "smollm:1.7b": "Bollywood DVD fraudster is jailed for three years.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the given text about a DVD fraudster being jailed. First, I'll read through the entire text carefully to understand all the key points.\n\nThe text starts by mentioning that a major distributor of pirated DVDs from Bollywood has been sent to prison for three years. That's the main point here. Then it introduces Jayanti Amarishi Buhecha, who was found guilty last month. He made £26,000 per month but was arrested for two trademark offences.\n\nNext, it says he was worked on the case by BPI for two years and ended up serving time at Harrow Crown Court in London. He's described as one of the biggest Bollywood pirates in the UK. The operation involved manufacturing fake DVDs in Pakistan and Malaysia and selling them to Buhecha in 2002 and 2003. He was stopped in his car, found 1,000 pirated DVDs, and faked inlay cards.\n\nDespite being arrested, he was caught again in 2003. His home and a lock-up contained 18,000 counterfeit DVDs and more faked inlay cards. Earlier, he was a legitimate distributor but now is suspended and sued by his employers for selling illegal Bollywood films. The BPI acknowledged the guilty verdict but warned there are others with the problem too. Martin emphasized the importance of continuing efforts in this field.\n\nI need to make sure I include all these key points without adding any extra information. So, I'll start by stating that a major distributor is jailed, then introduce him and his crimes, mention the duration of his sentence, the BPI's involvement, the specifics of the operation, the consequences, and his previous status as a distributor versus current situation.\n\nI should make sure the summary is concise, only including the important parts without any explanations or formatting. No markdown or anything else.\n</think>\n\nA major distributor of pirated DVDs from Bollywood has been jailed for three years. Jayanti Amarishi Buhecha, who made £26,000 monthly, was found guilty of two trademark offences and served a full sentence at Harrow Crown Court in London. He was involved in manufacturing fake DVDs in Pakistan and Malaysia and selling them to him between 2002 and 2003. Despite being arrested, he was caught again in 2003 when stopped in his car, found 1,000 pirated DVDs and faked inlay cards. He was previously a legitimate distributor but now faces legal action from his employers for illegal film sales. The British Phonographic Industry (BPI) acknowledged the guilty verdict but warned of other active counterfeiters and urged ongoing efforts.", "tinyllama:1.1b": "A major distributor of pirated DVDs of Bollywood films has been sentenced to three years in prison for two trademark offenses. The BPI (British Phonographic Industry) said it worked with the court on the case for two years, and called for \"a heavy penalty\" because Buhecha caused \"enormous damage\" to legitimate businesses. Facial DVDs were manufactured in Pakistan and Malaysia and sold on whole-sale shops in 2002 and 2003 by Buhecha, who was arrested twice for distributing counterfeit copies of Bollywood classic Mohabbatein. The conviction is expected to boost efforts by Bollywood music and film companies against piracy at the rate of 40%, according to the BPI. Despite his arrest and bail, Buhecha was found in possession of 18,000 counterfeit DVDs and fake inlay cards printed with registered trade marks. The BPI is warning about an active market for Bollywood film piracy that's growing at a high rate, with millions of copies distributed annually.", "tinydolphin:1.1b": " Summary: Jayanti Amarish Buhecha, a major distributor of pirated DVDs of Bollywood films, has been sentenced to three years in prison for two trademark offenses. He made £26,000 per month and was convicted after complaints were received about his activities. Buhecha's operation was launched against him in 2002, and the judge called for a \"heavy penalty\" due to the enormous damage caused by his fraudulent trade. In December 2002, Buhecha was arrested again, this time for a second time, after more than 1,000 counterfeit DVDs were found in his car.", "phi:2.7b": " A Bollywood DVD fraudster from Cambridge has been jailed for three years after being found guilty of two trademark offences. The distributor made £26,000 per month from selling counterfeit DVDs and was called \"one of the biggest pirates\" by a sentencing judge. The British Phonographic Industry (BPI) worked on the case for two years and accused him of manufacturing fake DVDs in Pakistan and Malaysia and distributing them in shops. He was caught twice after being stopped by trading standards officers, and his home and lock-up were found to contain 18,000 counterfeit DVDs and faked inlay cards. The conviction is seen as a major boost for legitimate Bollywood film distributors, who are struggling with piracy rates of 40%. The BPI welcomed the news but warned there are other active counterfeiters of Bollywood films.\n", "orca-mini:3b": " A major Bollywood DVD fraudster was sent to prison for three years after being found guilty of trademark offences. The distributor traded in counterfeit DVDs and faked inlay cards printed with registered trademarks, and was arrested in his car by trading standards officers in 2002. He was previously suspended and sued for dealing in illegal copies of the Bollywood classic Mohabbatein. Legitimate Bollywood film distributors hailed the conviction as a major boost. The BPI welcomed the news of the prison sentence but warned there are plenty of other active counterfeiters of Bollywood films.", "hermes3:3b": "Bollywood DVD distributor Jayanti Buheca jailed for 3yrs over piracy.", "stablelm-zephyr:3b": "A man from Cambridge who distributed a lot of fake Bollywood DVDs was put in prison for three years. He was found guilty of two trademark offenses and made a lot of money from selling counterfeit DVDs. The British Phonographic Industry worked hard to stop him, and they are still fighting against fake DVDs because there are many other people making them too.", "chatgpt-4o-latest": "Jayanti Amarishi Buhecha, a major distributor of pirated Bollywood DVDs in the UK, has been sentenced to three years in prison after being found guilty of trademark offences. Buhecha, who earned £26,000 per month from his illegal trade, was described as one of the biggest Bollywood pirates in the country. Authorities launched an investigation in 2002 following complaints, uncovering counterfeit DVDs manufactured in Pakistan and Malaysia and sold wholesale. Despite being arrested in 2002 with 1,000 pirated DVDs, he was caught again in 2003 with 18,000 counterfeit DVDs. Previously a legitimate distributor, he was suspended and sued for selling illegal copies. The conviction has been welcomed by Bollywood distributors, as piracy affects 40% of the industry. The British Phonographic Industry (BPI) praised the sentence but warned that piracy remains a widespread issue.", "stablelm2:1.6b": "Bollywood DVD fraudster Jayanti Amarishi Buhecha was sentenced to three years in prison for two trademark offenses involving £500,0 BPI estimated yearly income of £1.2 million from pirated DVDs distribution. Buhecha was found guilty by Harrow Crown Court after an operation targeting his activities uncovered 1,500 pirated DVDs and faked inlay cards. Despite being arrested twice, his home and a lock-up in Cambridge were searched for more counterfeit DVDs. Legitimate Bollywood film distributors praised the conviction as \"a major boost,\" while BPI warned there are many active counterfeiters of Bollywood films.", "granite3.1-dense:2b": "Jayanti Amarishi Buhecha, a Cambridge resident and former Bollywood distributor, was sentenced to three years in prison for trademark offenses. Buhecha, known as one of the largest Bollywood pirates in the UK, made £26,000 monthly from selling counterfeit DVDs. His operation spanned two years, involving manufacturing fake DVDs in Pakistan and Malaysia and distributing them through shops. He was caught in 2002 with 1,000 pirated DVDs and faked inlay cards, then again in 2003 with 18,000 more. The British Phonographic Industry (BPI) worked on the case for two years following complaints about Buhecha's activities. Despite being suspended from his legitimate distributor job, Buhecha continued dealing in illegal copies of Bollywood films. Legitimate distributors hailed the conviction as a significant victory, but warned that the battle against piracy is ongoing due to numerous active counterfeiters.", "reference": "Buhecha was previously a legitimate distributor of Bollywood films, but was suspended and sued by his employers for dealing in illegal copies of Bollywood classic Mohabbatein.Buhecha, who made £26,000 per month from his illegal trade, was called \"one of the biggest Bollywood pirates in the UK\" by the sentencing judge.A major distributor of pirated DVDs of Bollywood films has been sent to prison for three years.The judge in the case, which lasted seven days, said that \"a heavy penalty was called for because of the enormous damage Buhecha caused to legitimate business\".An operation was launched against Buhecha in 2002 after complaints were received about his activities.Jayanti Amarishi Buhecha from Cambridge was found guilty of two trademark offences last month, and sentenced at Harrow Crown Court, London, on Tuesday.Legitimate Bollywood film distributors have hailed the conviction as \"a major boost\"."}