{"raw_text": "Tarantino 'to make Friday sequel'\n \n Director Quentin Tarantino is in talks to write and direct a new instalment in the Friday the 13th horror franchise, according to the Hollywood Reporter.\n \n The film-maker will reportedly meet executives from New Line Cinema this week to discuss the 12th film in the long-running 'stalk and slash' series. The original film, released in 1980, has spawned ten sequels based around mask-wearing murderer Jason Voorhees. The most recent, Freddy Vs Jason, was released in summer 2003. That film saw Jason battle Freddy Krueger, star of the Nightmare on Elm Street franchise. According to the industry newspaper, New Line had been trying to make another sequel involving Ash, the hero of the Evil Dead movies, but was unable to agree terms with director Sam Raimi. Tarantino is said to be intrigued by the prospect of building a new film around one of the horror genre's most recognised figures. First, however, he is scheduled to direct the season finale of US television series CSI: Crime Scene Investigation. Filming is due to start in early April. Tarantino's episode, for which he also wrote the original story, will be broadcast in the US on 19 May.\n", "llama3.2:1b": "Quentin Tarantino is in talks to write and direct a new Friday the 13th film, meeting with New Line Cinema executives to discuss the project this week.", "llama3.2:3b": "Quentin Tarantino is in talks to write and direct a new Friday the 13th film, meeting with New Line Cinema executives this week, according to the Hollywood Reporter. The film would be the 12th installment in the franchise and has reportedly been in development since an attempt was made with Sam Raimi's Ash character.", "gemma2:2b": "Quentin Tarantino is in talks to write and direct a new *Friday the 13th* film.  He plans to meet with executives from New Line Cinema this week to discuss the potential sequel. \n", "qwen2.5:0.5b": "Director Quentin Tarantino is reportedly in talks with New Line Cinema to write and direct a new instalment in the Friday the 13th horror franchise, based on the 12th film in the series. The current sequel, \"The Nightmare on Elm Street: Chapter 10,\" starring Sam Raimi, was cancelled after being unable to agree terms with him regarding the third installment of the Friday the 13th series. The new film is scheduled to debut at the same time as the season finale of the popular US TV show CSI: Crime Scene Investigation, which has already been announced in early April.", "qwen2.5:1.5b": "Quentin Tarantino has been approached to write and direct a new Friday the 13th sequel. The film would continue the \"stalk and slash\" series featuring Jason Voorhees. Tarantino is expected to begin filming for his CSI episode while also developing this new project, which could be an adaptation of one of the franchise's most recognizable figures.", "qwen2.5:3b": "Quentin Tarantino is reportedly discussing a new Friday the 13th sequel with New Line Cinema executives. The director has previously directed CSI: Crime Scene Investigation and is set to begin filming his episode later this month. Initially interested in featuring Ash from Evil Dead, he now considers Jason Voorhees of the series as more intriguing for a potential film.", "opencoder:1.5b": "Director Quentin Tarantino is expected to create a new instalment in the Friday the 13th horror franchise by engaging with executives from New Line Cinema this week. The storyline revolves around Jason Voorhees, a mask-wearing murderer who's been plagued by insomnia for years, despite his tendency to fall for it. The film, which features a blend of suspense and mystery, is expected to be released in 2003 with the sequels based around him. It will feature Freddy Krueger as the hero, and the main character, Jason, who's been plagued by visions of becoming human. New Line has been trying to get into another storyline involving Ash, but is unable to fully grasp the depth and breadth of the plot. Tarantino is looking forward to directing a new episode in the US television series CSI: Crime Scene Investigation, which will be aired on 19 May. He's also proposed a sequel to build on one of the most recognized figures in the horror genre.\n", "smollm:1.7b": "The director is reportedly in talks with executives from New Line Cinema to write and direct a new installment of the Friday the 13th horror franchise, according to the Hollywood Reporter. The film-maker will reportedly meet executives from New Line this week to discuss the 12th film in the long-running series. The original film, released in 1980, has spawned ten sequels based around mask-wearing murderer Jason Voorhees. The most recent, Freddy Vs Jason, was released in summer 2003. That film saw Jason battle Freddy Krueger, star of the Nightmare on Elm Street franchise. According to the industry newspaper, New Line had been trying to make another sequel involving Ash, the hero of the Evil Dead movies, but was unable to agree terms with director Sam Raimi. Tarantino is said to be intrigued by the prospect of building a new film around one of the horror genre's most recognized figures. First, however, he is scheduled to direct the season finale of US television series CSI: Crime Scene Investigation. Filming is due to start in early April. Tarantino's episode for which he also wrote the original story will be broadcast in the US on 19 May.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely. Let me read through it carefully first.\n\nThe text starts by mentioning that Tarantino is involved in talks about writing and directing a new film in the Friday the 13th horror franchise series called \"Stalk and Slash.\" He's meeting people from New Line Cinema, which makes sense because they make films like CSI: Crime Scene Investigation. \n\nThen it says that the original film from 1980, which has ten sequels, was Freddy Vs Jason, released in summer 2003. It was directed by Jason Voorhees and involved the famous horror hero Ash. Tarantino is intrigued but can't agree with Sam Raimi on a new film around Ash.\n\nHe's scheduled to direct CSI: Crime Scene Investigation, which will be released next season of a TV show he wrote. The finale is expected to be on May 19th in the US. \n\nI need to make sure I capture all key points without unnecessary details. Let me list out the main points:\n\n1. Tarantino is working on a newFriday the 13th horror film.\n2. He's meeting New Line Cinema executives.\n3. The original film was Freddy Vs Jason, 1980, directed by Jason Voorhees and involving Ash.\n4. Tarino can't agree with Raimi for another film around Ash.\n5. He'll direct CSI: Crime Scene Investigation, a new season finale.\n\nPutting it together in a concise summary without explanations or formatting, just plain text.\n</think>\n\nTarantino is involved in writing and directing a new film in the Friday the 13th horror franchise series. He will meet New Line Cinema executives to discuss it this week. The original film, Freddy Vs Jason from 1980, has ten sequels involving Jason Voorhees and horror icon Ash. Tarino cannot agree with Sam Raimi for another film around Ash. He will direct CSI: Crime Scene Investigation's season finale, which is set for May 19th in the US.", "tinyllama:1.1b": "Taranisno 'to make Friday sequel'\nDirector Quentin Tarantinno is reportedly in talks to write and direct a new instalment in the horror franchise Friday the 13th, according to the Hollywood Reporter. The filmmaker will meet with executives from New Line Cinema this week to discuss the 12th film in the long-running 'stalk and slash' series. Tarantinno was reportedly interested in writing for Jason Voorhees but was unable to agree terms with director Sam Raimi, who directed Evil Dead movies. Tarantinno is set to direct the season finale of CSI: Crime Scene Investigation, which will air on US television in early April.", "tinydolphin:1.1b": " Based on the provided text, it seems that Quentin Tarantino is considering writing and directing a sequel to the 1980 horror film \"Friday the 13th\". This film franchise has spawned multiple sequels, each focusing on Jason Voorhees, the sinister, mask-wearing murderer. New Line Cinema executives are expected to meet Tarantino this week to discuss the possibility of making a new film in the series. The original film, released in 1980, has spawned ten sequels, with the most recent being \"Freddy Vs Jason\" (released in summer 2003). However, New Line was unable to make another film involving Ash, the hero of the Evil Dead franchise, and this led to the decision not to proceed with a new movie.", "phi:2.7b": " Director Quentin Tarantino is considering writing and directing a new installment of Friday the 13th, a long-running horror franchise that has spawned ten sequels. He will meet with New Line Cinema executives this week to discuss the 12th film, which will feature mask-wearing murderer Jason Voorhees. The last film in the series was Freddy Vs Jason, where Jason fought Freddy Krueger from Nightmare on Elm Street. Tarantino is also set to direct the season finale of US TV show CSI: Crime Scene Investigation, which will air in May.\n", "orca-mini:3b": " Director Quentin Tarantino is set to helm a new Friday the 13th film, following talks with New Line Cinema. The 12th instalment in the horror franchise would feature Jason Voorhees, but Tarantino is also exploring the character of Ash from the Evil Dead movies.", "hermes3:3b": "Quentin Tarantino set to direct Friday the 13th sequel for New Line Cinema.", "stablelm-zephyr:3b": "Director Quentin Tarantino is in talks to write and direct a new Friday the 13th horror film, meeting with New Line Cinema executives to discuss the 12th installment in the long-running 'stalk and slash' series. He is intrigued by the possibility of working with one of horror's most recognizable figures, after New Line initially wanted to make another sequel involving Ash from the Evil Dead movies but couldn't agree with director Sam Raimi. Tarantino is set to direct the season finale of US television series CSI: Crime Scene Investigation, with filming starting in early April.", "chatgpt-4o-latest": "Quentin Tarantino is in talks to write and direct the 12th installment of the Friday the 13th horror franchise, according to the Hollywood Reporter. He is set to meet with New Line Cinema executives to discuss the project, which would continue the long-running series featuring Jason Voorhees. The most recent film, Freddy Vs Jason, was released in 2003. New Line had previously attempted to develop a sequel involving Ash from Evil Dead but failed to reach an agreement with Sam Raimi. Tarantino is reportedly interested in working with the iconic horror character. Before this project, he is scheduled to direct the season finale of CSI: Crime Scene Investigation, which will air in the US on May 19.", "stablelm2:1.6b": "Director Quentin Tarantino is reportedly in talks to write and direct a new installment in the Friday the 13th horror franchise for New Line Cinema. This sequel follows the masked murderer Jason Voorhees, who has been featured in ten sequels. The most recent film, Freddy Vs Jason, also featuring the Nightmare on Elm Street villain Freddy Krueger, was released in 2003. However, due to disagreements with director Sam Raimi, New Line tried and failed to make a sequel centered around Ash from the Evil Dead movies. Tarantino is excited about creating a new film centered around one of horror's most recognizable characters but will initially direct the season finale of the TV series CSI: Crime Scene Investigation. Filming for his episode is set to begin in April, with the finished product expected to air on May 4th in the US.", "granite3.1-dense:2b": "Quentin Tarantino is set to write and direct a new Friday the 13th film as New Line Cinema prepares its 12th installment in the series. The talks come after Tarantino agreed to produce the season finale of TV series CSI: Crime Scene Investigation, scheduled for US broadcast on May 19. The original Friday the 13th was released in 1980, and New Line had previously attempted to make a Jason-Ash crossover but couldn't secure terms with Sam Raimi. Tarantino's involvement brings renewed interest to this classic horror franchise.", "reference": "The original film, released in 1980, has spawned ten sequels based around mask-wearing murderer Jason Voorhees.Director Quentin Tarantino is in talks to write and direct a new instalment in the Friday the 13th horror franchise, according to the Hollywood Reporter.Tarantino is said to be intrigued by the prospect of building a new film around one of the horror genre's most recognised figures.That film saw Jason battle Freddy Krueger, star of the Nightmare on Elm Street franchise."}