{"raw_text": "Apple laptop is 'greatest gadget'\n \n The Apple Powerbook 100 has been chosen as the greatest gadget of all time, by US magazine Mobile PC.\n \n The 1991 laptop was chosen because it was one of the first \"lightweight\" portable computers and helped define the layout of all future notebook PCs. The magazine has compiled an all-time top 100 list of gadgets, which includes the Sony Walkman at number three and the 1956 Zenith remote control at two. Gadgets needed moving parts and/or electronics to warrant inclusion. The magazine specified that gadgets also needed to be a \"self-contained apparatus that can be used on its own, not a subset of another device\".\n \n \"In general we included only items that were potentially mobile,\" said the magazine.\n \n \"In the end, we tried to get to the heart of what really makes a gadget a gadget,\" it concluded. The oldest \"gadget\" in the top 100 is the abacus, which the magazine dates at 190 A.D., and put in 60th place. Other pre-electronic gadgets in the top 100 include the sextant from 1731 (59th position), the marine chronometer from 1761 (42nd position) and the Kodak Brownie camera from 1900 (28th position). The Tivo personal video recorder is the newest device to make the top 10, which also includes the first flash mp3 player (Diamound Multimedia), as well as the first \"successful\" digital camera (Casio QV-10) and mobile phone (Motorola Startac). The most popular gadget of the moment, the Apple iPod, is at number 12 in the list while the first Sony transistor radio is at number 13.\n \n Sony's third entry in the top 20 is the CDP-101 CD player from 1983. \"Who can forget the crystalline, hiss-free blast of Madonna's Like A Virgin emenating from their first CD player?\" asked the magazine. Karl Elsener's knife, the Swiss Army Knife from 1891, is at number 20 in the list. Gadgets which could be said to feature surprisngly low down in the list include the original telephone (23rd), the Nintendo GameBoy (25th), and the Pulsar quartz digital watch (36th). The list also contains plenty of oddities: the Pez sweet dispenser (98th), 1980s toy Tamagotchi (86th) and the bizarre Ronco inside the shell egg scrambler (84th).\n \n Why worry about mobile phones. Soon they will be subsumed into the PDA's / laptops etc.\n \n What about the Marine Chronometer? Completely revolutionised navigation for boats and was in use for centuries. For it's time, a technological marvel!\n \n Sony Net Minidisc! It paved the way for more mp3 player to explode onto the market. I always used my NetMD, and could not go anywhere without it.\n \n A laptop computer is not a gadget! It's a working tool!\n \n The Sinclair Executive was the world's first pocket calculator. I think this should be there as well.\n \n How about the clockwork radio? Or GPS? Or a pocket calculator? All these things are useful to real people, not just PC magazine editors.\n \n Are the people who created this list insane ? Surely the most important gadget of the modern age is the mobile phone? It has revolutionalised communication, which is more than can be said for a niche market laptop. From outside the modern age, the marine chronometer is the single most important gadget, without which modern transportation systems would not have evolved so quickly.\n \n Has everyone forgot about the Breville pie maker??\n \n An interesting list. Of the electronic gadgets, thousands of journalists in the early 1980s blessed the original noteboook pc - the Tandy 100. The size of A4 paper and light, three weeks on a set of batteries, an excellent keyboard, a modem. A pity Tandy did not make it DOS compatible.\n \n What's an Apple Powerbook 100 ? It's out of date - not much of a \"gadget\". Surely it has to be something simple / timeless - the tin opener, Swiss Army Knife, safety razor blade, wristwatch or the thing for taking stones out of horses hooves ?\n \n It has to be the mobile phone. No other single device has had such an effect on our way of living in such a short space of time.\n \n The ball point pen has got to be one of the most used and common gadgets ever. Also many might be grateful for the pocket calculator which was a great improvement over the slide rule.\n \n The Casio pocket calculator that played a simple game and made tinny noises was also a hot gadget in 1980. A true gadget, it could be carried around and shown off.\n \n All top 10 are electronic toys, so the list is probably a better reflection of the current high-tech obsession than anyhting else. I say this as the Swiss Army Knife only made No 20.\n \n Sinclair QL a machine far ahead of its time. The first home machine with a true multi-takings OS. Shame the marketing was so bad!!!\n \n Apple.. a triumph of fashion over... well everything else.\n \n Utter rubbish. Yes, the Apple laptop and Sony Walkman are classic gadgets. But to call the sextant and the marine chronometer 'gadgets' and rank them as less important than a TV remote control reveals a quite shocking lack of historical perspective. The former literally helped change the world by vastly improving navigation at see. The latter is the seed around which the couch potato culture has developed. No competition.\n \n I'd also put Apple's Newton and the first Palm Pilot there as the front runners for portable computing, and possibly the Toshiba Libretto for the same reason. I only wish that Vulcan Inc's Flipstart wasn't just vapourware otherwise it would be at the top.\n \n How did a laptop ever manage to beat off the challenge of the wristwatch or the telephone (mobile or otherwise)? What about radios and TVs?\n \n The swiss army knife. By far the most useful gadget. I got mine 12 years ago. Still wearing and using it a lot! It stood the test of time.\n \n Psion Organiser series 3, should be up there. Had a usable qwerty keyboard, removable storage, good set of apps and programmable. Case design was good (batteries in the hinge - a first, I think). Great product innovation.\n \n The first mobile PC was voted best gadget by readers of...err... mobile PC?! Why do you keep putting these obviously biased lists on your site? It's obviously the mobile phone or remote control, and readers of a less partisan publication would tell you that.\n \n The Motorola Startac should be Number One. Why? There will be mobile phones long after notebook computers and other gadgets are either gone or integrated in communications devices.\n \n The Psion series 3c! The first most practical way to carry all your info around...\n \n I too would back the Sinclair Spectrum - without this little beauty I would never have moved into the world of IT and earn the living that I do now.\n \n I'd have put the mobile phone high up the list. Probably a Nokia model.\n \n Sinclair Spectrum - 16k. It plugged into the tv. Games were rubbish but it gave me a taste for programming and that's what I do for a living now.\n \n I wish more modern notebooks -- even Apple's newest offerings -- were more like the PB100. Particularly disheartening is the demise of the trackball, which has given way to the largely useless \"trackpad\" which every notebook on the market today uses. They're invariably inaccurate, uncomfortable, and cumbersome to use.\n \n Congratulations to Apple, a deserved win!\n", "llama3.2:1b": "Apple Powerbook 100 \n\nUS magazine Mobile PC chose it as greatest gadget of all time in 1991. It was one of first lightweight portable computers and helped define layout of future notebook PCs. Gadgets needed moving parts and electronics to be included. The list only includes items that were potentially mobile, excluding subsets of other devices.", "llama3.2:3b": "The 1991 Apple Powerbook 100 was chosen as the greatest gadget of all time by US magazine Mobile PC. The list includes items that were \"potentially mobile\" and considered gadgets due to their self-contained nature. Other notable entries include the Sony Walkman at number three, the Zenith remote control at two, and the marine chronometer from 1761 in 42nd place.", "gemma2:2b": "The US magazine *Mobile PC* chose the Apple Powerbook 100 as the greatest gadget of all time. The magazine compiled an all-time top 100 list of gadgets including Sony Walkman, Zenith remote control, and Tivo, which included items with moving parts or electronics needed for inclusion. The list includes both electronic gadgets and pre-electronic devices, ranging from abacus to wristwatch.  A focus on modern technology resulted in a high ranking for the Apple iPod and Motorola Startac. Some people disagree with the list's selections, including arguing that mobile phones should be at the top. They highlight inventions like Swiss Army Knife and Sinclair QL as more practical and useful than the laptop. \n", "qwen2.5:0.5b": "The Apple Powerbook 100 of 1991 was chosen as one of the greatest gadgets by the US magazine Mobile PC. The magazine states that it is \"one of the first 'lightweight' portable computers\" and helped define notebook PCs. It included self-contained apparatuses and required moving parts to be included in a gadget.\n\nThe list of top 100 gadgets compiled by the magazine includes various items, some of which are described as potentially mobile and subcategories like smartphones, wireless devices, and electronic toys. The magazine notes that the core criteria for determining a gadget include self-contained apparatuses not needing other devices to be used alone or in subsets.\n\nGadgets with impressive longevity, versatility, or high technical standards would likely rank highly among top 100 gadgets.\n\nThe article suggests that the iPhone, which has made significant advancements since its release, is considered a \"gadget\" by some sources. It does not explicitly state that this would be a true gadget but implies it fits these criteria based on Apple's status and recent releases.\n\nSome popular gadgets mentioned in the list are:\n- Swiss Army Knife (20th)\n- Pez sweet dispenser (98th)\n- Tivo personal video recorder (42nd)\n- Sony Walkman (2nd)\n- Motorola Startac (1st)\n\nThe article notes that some gadgets, like the Swiss Army Knife and the Tivo, are seen as essential tools rather than \"gadgets.\"\n\nOverall, the article argues that \"gadgets\" should be considered more widely when evaluating products and comparing them against one another in a comparison with other forms of technology.\n\nSome readers may find this analysis challenging to consider. Others might argue it highlights the value of some items as being superior over others, such as the iPhone. The argument for Apple's winning the title is that their devices have received the most public praise (\"triumph\") and are more widely used than those in the \"gadgets\" category.\n\nThe article suggests that the \"gadgets\" category may not be a complete measure of all gadgets, but it serves as a useful starting point when making comparisons. It is worth considering how different categories can help understand various aspects of technology.", "qwen2.5:1.5b": "The Apple Powerbook 100 was named as the greatest gadget of all time by US magazine Mobile PC for being one of the first lightweight portable computers that defined future notebook PCs. The list includes popular devices like Sony Walkman and Tivo, oddities such as Pulsar watch and Pez dispenser, but also notable historical milestones from 1950s to 2000s, including abacus, sextant, marine chronometer, and even the first mobile phone.", "qwen2.5:3b": "The Apple PowerBook 100 was chosen as the greatest gadget of all time by US magazine Mobile PC. It defined the layout of all future notebook PCs. The magazine compiled an all-time top 100 list of gadgets, including pre-electronic items like the abacus and sextant. The Sony Walkman is ranked third while the first mobile phone (Motorola Startac) made it to number eleven. The list contains pre-PC devices, modern gadgets, and electronic toys. Critics argue that some historical gadget classifications are inaccurate and less significant than recent technological innovations.", "opencoder:1.5b": "Apple's Powerbook 100 is an outdated gadget that was once the backbone of modern technological advancements. Despite its age, it remains as one of the most popular gadgets in its time period due to its versatility and user-friendly design. \n\nThe list of gadgets in the top 10 includes the iPhone, the iPod, a NetMD (Net Minidisc), a Tandy 100 (the original notebook PC from 1983), the Marianne Chronometer (a modern navigation device for boats and boats alike), the Pocket Calculator, a pocket calculator, an electronic toy, a vintage TV remote control, the Casio QL (an excellent home entertainment machine), and a computer game console. \n\nThe list is not limited to just one manufacturer; it covers all gadgets that have made their way onto the market in the 1980s. Despite its age, these gadgets continue to be a top-of-the-line selection for modern life. \n\nThe comparison between the Apple laptop and Sony Walkman, which were introduced together, doesn't change the position of the Powerbook 100 in the list — it's still one of the most popular devices overall. \n\nAs a result, the age-old question remains: Why worry about mobile phones? Soon they will be subsumed into the PDA’s / laptops etc. The lack of competition and the growing popularity of electronic gadgets have significantly contributed to Apple's dominance in this technological landscape.\n", "smollm:1.7b": "The list is biased towards modern gadgets, but it's not entirely unfair. The mobile phone has become an essential part of our daily lives, with many people relying on them for communication, entertainment, and information. However, the list also includes some older gadgets that were influential in shaping the technology landscape.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about mobile gadgets into one concise summary. Let me go through each section carefully.\n\nFirst paragraph says that Apple's Powerbook 100 was chosen as the greatest gadget by US magazine Mobile PC. So that's a key point.\n\nThen it talks about how the 91st laptop in the list was the first lightweight, portable computer and helped define notebook PCs. It mentions that gadgets need moving parts or electronics to be self-contained.\n\nThe text then describes the criteria for gadgets: must be mobile, have no electronics inside, and be a \"self-contained apparatus.\" Examples include Sony Walkman at 3 and Zenith remote at 2.\n\nNext, there's an extensive list of gadgets including various devices like CD players, phones, TVs, MP3 players, cameras, etc. It also includes some oddities and mentions the importance of gadgets for navigation, communication, and mobile phone revolutionization.\n\nSome parts get more detailed, explaining why certain gadgets are included or excluded. For example, the Tivo is noted as the new device to make the top 10, which includes flash MP3 players like Diamound Multimedia, and the first Casio QV-10.\n\nThe text also brings up other notable gadgets: Sony Net Minidisc, Sinclair Executive, clockwork radio, pocket calculator. It clarifies that while some might be classic gadgets, others are considered modern or niche.\n\nThere's a section about why worry about mobile phones—since they'll be integrated into PDA's and laptops. The Apple iPod is noted as the newest device on the top 10.\n\nThe text discusses historical perspective and compares Apple's success against other companies, noting that sales of portable computers are higher than notebook computers. It mentions Sinclair QL being ahead of time but with poor marketing.\n\nIt talks about other notable gadgets like the sextant for navigation, pocket calculator for improvement over slide rules, casio QV-10 for home machines, transistor radio, and tvs. It also mentions the Swiss Army Knife in no 20, which might be the most useful.\n\nThere's a section about not recommending Sinclair Spectrum because of issues with programming. The writer suggests that notebooks could do better than PDA's, suggesting a shift from mobile phones to more integrated tech.\n\nThe conclusion wraps up by emphasizing Apple's success despite criticism and mentions other notable gadgets like IBM's Blue Gene supercomputer or IBM's Blue Gene++ for higher performance computing.\n\nI need to ensure the summary captures all key points: Apple's choice, the historical context of notebook computers, criteria for gadgets (mobile, self-contained), the detailed list of 37 gadgets with their importance and exclusions, historical significance, criticism about mobile phones vs. other tech, mention of notable gadgets like sextant, pocket calculator, casio QV-10, transistor radio, tvs, comparison to portable computers, and a conclusion on Apple's success despite issues.\n\nI should avoid being too detailed in each point but summarize the main ideas clearly.\n</think>\n\nThe Apple Powerbook 100 was uniquely chosen as the greatest mobile gadget by US magazine Mobile PC. It emerged as the first lightweight, portable computer, setting the standard for notebook PCs. Mobile gadgets must be self-contained, with no electronics inside and a focus on being mobile. The list includes notable devices like Sony Walkman (ranked 3) and Zenith remote (ranked 2). Key criteria include simplicity, portability, and innovation, with some gadgets excluded due to their niche nature.\n\nThe text highlights the importance of gadgets for various fields: navigation (Sextant), communication ( TVs, radios), and mobile phone revolutionization. It lists 37 notable gadgets, including Sony Net Minidisc, Sinclair QL, clockwork radio, and transistor radio. Sinclair QL is noted as ahead but with poor marketing.\n\nThe writer emphasizes historical perspective, noting that portable computers are more sales-effective than notebook computers. Sinclair Spectrum is highlighted as a leading device for its programming appeal, though issues like the trackball's impracticality suggest potential future shifts towards integrated tech.\n\nApple's success in mobile gadgets is celebrated despite criticism, citing its innovations in software and portability. The writer concludes by noting that notable gadgets include the sextant and pocket calculator, while mentioning notable modern devices like Diamound Multimedia ( Flash MP3 player) and IBM's Blue Gene supercomputer.", "tinyllama:1.1b": "The author praises several notable technological achievements that have shaped modern society, including the Apple iPod, iPhone, and iPad, the Sony Walkman and PSP, the Palm Pilot and Treo smartphone, the Casio PC-9800 and GBA, the Swatch watch, and the Sony Ericsson K750i phone. They also mention the Motorola QL portable computer, the Vulcan Spectrum, and the Sinclair Spectrum/Spectra II. The author emphasizes the importance of mobile phones in modern life, particularly in the industry, and their role in facilitating work-from-anywhere arrangements. The notebooks mentioned are notably less popular than the recent iPads or other modern products. Overall, the author appreciates the contributions of these technological innovations to modern society and sees them as deserving of recognition and celebration.", "tinydolphin:1.1b": " The article mentions various gadgets as examples of how technology has changed the way we live and work. It also includes comparisons of different gadgets' impact on society and their importance in people's lives. The author appreciates the ease with which people can access information, communicate with others, and perform a range of tasks that would have been impossible just a few years ago.\n\nOne thing they do not mention is the power of social media to connect people from all walks of life and to help us learn more about our own experiences and those of others. The author seems to be in favor of social media's positive impact on society, but does not seem to appreciate how important it has become for individuals to express themselves and to connect with others around the world.\n\nThe article concludes by acknowledging the importance of technology in people’s lives but also highlighting its potential for misuse and abuse. The author suggests that there may come a time when people need to balance their desire for convenience with their respect for privacy and safety.", "phi:2.7b": " Apple's laptop was voted as the greatest gadget of all time by US magazine Mobile PC. The magazine included other pre-electronic gadgets like abacus, marine chronometer, and Kodak Brownie in their top 100 list. The oldest \"gadget\" on the list is the abacus, which the magazine dates back to 190 A.D., while the first mobile phone was voted number 12. Some of the oddities on the list include Pez sweet dispenser, Tamagotchi, and Ronco inside-the-shell egg scrambler. The list also contains some classic gadgets like the ballpoint pen, pocket calculator, wristwatch, and safety razor blade. However, there are a few people who believe that other items should have been included in the list, such as the marine chronometer, mobile phone, and clockwork radio.\n", "orca-mini:3b": " The article discusses the top gadgets of all time according to Mobile PC magazine, which includes the Apple Powerbook 100. The device is described as one of the greatest gadgets ever, and it was chosen because it was one of the first laptops that could be easily carried around. It also had a great keyboard and a memory for storing programs. The article emphasizes that the list is based on readers' votes and that the mobile phone should be number one because it will continue to be relevant long after other gadgets have become obsolete.", "hermes3:3b": "Apple Powerbook 100 chosen as greatest gadget; US magazine Mobile PC ranks it over other devices for top 100 list.", "stablelm-zephyr:3b": "The Apple Powerbook 100 was named the greatest gadget of all time by US magazine Mobile PC in 1991. It was one of the first \"lightweight\" portable computers and helped define future notebook PCs. The top 100 list compiled by the magazine included items like the Sony Walkman at number three, the 1956 Zenith remote control at two, and the Apple Powerbook 100 at 7. Gadgets were chosen based on their ability to function independently and be used on their own. Older gadgets mentioned in the text include the abacus, sextant, marine chronometer, original iPod, Sony transistor radio, and various other electronic devices that had an impact on people's lives during their time. The list highlighted a shift towards high-tech gadgets at the time and sparked debate regarding the importance of items like the Apple Powerbook 100 compared to more modern innovations such as mobile phones and laptops.", "stablelm2:1.6b": "Apple laptop is named as the greatest gadget of all time by US magazine Mobile PC in its \"top 50 gadgets\" list. The Apple Powerbook was chosen because it helped define the layout of future notebook PCs. Gadgets on the list included smartphones, navigation devices, personal video recorders, digital cameras, and other electronic toys. Gadgets needed moving parts and/or electronics to warrant inclusion, and only items that were potentially mobile were considered for the list.", "granite3.1-dense:2b": "The Apple Powerbook 100 is ranked as the greatest gadget of all time by US magazine Mobile PC, owing to its status as one of the first lightweight portable computers that influenced future notebook designs. The top 100 list includes a diverse range of gadgets from various eras, such as the Swiss Army Knife (No. 2), the Tandy 100 (an early personal computer), and the Psion Organiser series 3. Other notable mentions are the mobile phone (likely the Motorola Startac), the Sinclair Spectrum for sparking interest in computing, and various timeless tools like the tin opener, Swiss Army Knife, and ballpoint pen.\n\nCritics argue that rankings like these reflect current high-tech obsession rather than historical significance. They point out omissions of gadgets like wristwatches, radios, televisions, or even the importance of the sextant and marine chronometer in historical navigation. The inclusion of a laptop (the Powerbook 100) over traditional communication devices like mobile phones or early portable TVs is also criticized.\n\nThe list highlights a mix of practical tools and influential inventions, while some argue that modern notebooks should be more focused on ergonomics, such as the trackball's demise being replaced by less-effective trackpads. Nonetheless, Apple's Powerbook 100 is celebrated for its enduring design and impact on portable computing.", "chatgpt-4o-latest": "The Apple Powerbook 100 was named the greatest gadget of all time by Mobile PC magazine for its influence on modern notebook design. The list of top 100 gadgets included the Sony Walkman (3rd), Zenith remote control (2nd), and various historical devices like the abacus (60th) and marine chronometer (42nd). The Apple iPod ranked 12th, while the Swiss Army Knife placed 20th. The ranking sparked debate, with many arguing that the mobile phone, marine chronometer, or Swiss Army Knife were more deserving. Some criticized the list for favoring electronic devices and overlooking practical, timeless tools. Others praised the Powerbook 100 for its design but lamented the decline of certain features like the trackball. The ranking reflected a mix of historical significance and modern technological impact.", "reference": "The Apple Powerbook 100 has been chosen as the greatest gadget of all time, by US magazine Mobile PC.The most popular gadget of the moment, the Apple iPod, is at number 12 in the list while the first Sony transistor radio is at number 13.The first mobile PC was voted best gadget by readers of...err... mobile PC?!Surely the most important gadget of the modern age is the mobile phone?The magazine has compiled an all-time top 100 list of gadgets, which includes the Sony Walkman at number three and the 1956 Zenith remote control at two.A laptop computer is not a gadget!It has to be the mobile phone.The Tivo personal video recorder is the newest device to make the top 10, which also includes the first flash mp3 player (Diamound Multimedia), as well as the first \"successful\" digital camera (Casio QV-10) and mobile phone (Motorola Startac).The Sinclair Executive was the world's first pocket calculator.There will be mobile phones long after notebook computers and other gadgets are either gone or integrated in communications devices.The Casio pocket calculator that played a simple game and made tinny noises was also a hot gadget in 1980.I'd have put the mobile phone high up the list.The oldest \"gadget\" in the top 100 is the abacus, which the magazine dates at 190 A.D., and put in 60th place.The 1991 laptop was chosen because it was one of the first \"lightweight\" portable computers and helped define the layout of all future notebook PCs.The ball point pen has got to be one of the most used and common gadgets ever.By far the most useful gadget.\"In the end, we tried to get to the heart of what really makes a gadget a gadget,\" it concluded.The magazine specified that gadgets also needed to be a \"self-contained apparatus that can be used on its own, not a subset of another device\".From outside the modern age, the marine chronometer is the single most important gadget, without which modern transportation systems would not have evolved so quickly.Karl Elsener's knife, the Swiss Army Knife from 1891, is at number 20 in the list.Case design was good (batteries in the hinge - a first, I think).It's out of date - not much of a \"gadget\".Yes, the Apple laptop and Sony Walkman are classic gadgets.A true gadget, it could be carried around and shown off.No other single device has had such an effect on our way of living in such a short space of time.Other pre-electronic gadgets in the top 100 include the sextant from 1731 (59th position), the marine chronometer from 1761 (42nd position) and the Kodak Brownie camera from 1900 (28th position).Also many might be grateful for the pocket calculator which was a great improvement over the slide rule.It's obviously the mobile phone or remote control, and readers of a less partisan publication would tell you that.\"In general we included only items that were potentially mobile,\" said the magazine.It has revolutionalised communication, which is more than can be said for a niche market laptop.Gadgets which could be said to feature surprisngly low down in the list include the original telephone (23rd), the Nintendo GameBoy (25th), and the Pulsar quartz digital watch (36th).How did a laptop ever manage to beat off the challenge of the wristwatch or the telephone (mobile or otherwise)?All top 10 are electronic toys, so the list is probably a better reflection of the current high-tech obsession than anyhting else.But to call the sextant and the marine chronometer 'gadgets' and rank them as less important than a TV remote control reveals a quite shocking lack of historical perspective.An interesting list.Psion Organiser series 3, should be up there.The Psion series 3c!The first most practical way to carry all your info around..."}