{"raw_text": "Google's toolbar sparks concern\n \n Search engine firm Google has released a trial tool which is concerning some net users because it directs people to pre-selected commercial websites.\n \n The AutoLink feature comes with Google's latest toolbar and provides links in a webpage to Amazon.com if it finds a book's ISBN number on the site. It also links to Google's map service, if there is an address, or to car firm Carfax, if there is a licence plate. Google said the feature, available only in the US, \"adds useful links\". But some users are concerned that Google's dominant position in the search engine market place could mean it would be giving a competitive edge to firms like Amazon.\n \n AutoLink works by creating a link to a website based on information contained in a webpage - even if there is no link specified and whether or not the publisher of the page has given permission.\n \n If a user clicks the AutoLink feature in the Google toolbar then a webpage with a book's unique ISBN number would link directly to Amazon's website. It could mean online libraries that list ISBN book numbers find they are directing users to Amazon.com whether they like it or not. Websites which have paid for advertising on their pages may also be directing people to rival services. Dan Gillmor, founder of Grassroots Media, which supports citizen-based media, said the tool was a \"bad idea, and an unfortunate move by a company that is looking to continue its hypergrowth\". In a statement Google said the feature was still only in beta, ie trial, stage and that the company welcomed feedback from users. It said: \"The user can choose never to click on the AutoLink button, and web pages she views will never be modified. \"In addition, the user can choose to disable the AutoLink feature entirely at any time.\"\n \n The new tool has been compared to the Smart Tags feature from Microsoft by some users. It was widely criticised by net users and later dropped by Microsoft after concerns over trademark use were raised. Smart Tags allowed Microsoft to link any word on a web page to another site chosen by the company. Google said none of the companies which received AutoLinks had paid for the service. Some users said AutoLink would only be fair if websites had to sign up to allow the feature to work on their pages or if they received revenue for any \"click through\" to a commercial site. Cory Doctorow, European outreach coordinator for digital civil liberties group Electronic Fronter Foundation, said that Google should not be penalised for its market dominance. \"Of course Google should be allowed to direct people to whatever proxies it chooses. \"But as an end user I would want to know - 'Can I choose to use this service?, 'How much is Google being paid?', 'Can I substitute my own companies for the ones chosen by Google?'.\" Mr Doctorow said the only objection would be if users were forced into using AutoLink or \"tricked into using the service\".\n", "llama3.2:1b": "Google's AutoLink feature, part of its latest toolbar, allows links to specific websites in webpages based on ISBN numbers or addresses. However, some users are concerned that this could give Google an unfair competitive edge, as it may direct users to Amazon or other rival services without their consent. Critics argue that the tool does not respect website owner permissions and could lead to unwanted commercial promotions.", "llama3.2:3b": "Google's new AutoLink feature has sparked concern among net users due to its ability to direct people to commercial websites without their consent, potentially giving Amazon a competitive edge. The feature creates links based on information in webpages, including ISBN numbers and addresses, and is available only in the US. Google claims the tool adds useful links but some users are critical of its dominant market position and lack of transparency regarding revenue and user choice.", "gemma2:2b": "Google's new \"AutoLink\" feature in its toolbar automatically links webpages to commercial websites based on information found on the page, such as ISBN numbers for books. This has raised concerns about Google giving a competitive edge to companies like Amazon and potentially manipulating users without their consent. While Google claims the feature is still in beta testing and offers user control over its usage, some users worry about privacy and transparency regarding AutoLink's implementation. \n", "qwen2.5:0.5b": "Google's new AutoLink feature, which directs people to pre-selected commercial websites when they click in the toolbar, has been criticized by some net users. The company claims it works by linking directly to Amazon, Google's map service, and car firms' websites. However, others are concerned that Google might be giving a competitive edge to firms like Amazon by directing users to their sites whether they like them or not. AutoLink is described as a bad idea, an unfortunate move by a company looking to continue its growth.\nGoogle claims the feature is still in beta and can only work on websites it has previously tested. Users are free to disable the feature at any time. Some users suggest that Google should be allowed to direct people to their own proxy servers instead of using the AutoLink feature. Cory Doctorow, an electronic liberty activist, argues that Google should not be penalized for its market dominance and wants users to know about these features.", "qwen2.5:1.5b": "Google's new toolbar trial feature, called AutoLink, links pages to pre-selected commercial sites when finding ISBN numbers, ISBNs, or car registration plates, sparking concerns over potential monopolistic practices. The tool is only available in the US. Users worry it could lead to \"tricked into using\" auto-links and demand transparency on payment and alternatives. Google denies these allegations but warns users can disable AutoLink completely.", "qwen2.5:3b": "Google's AutoLink feature in its toolbar links pages containing ISBN numbers to Amazon, addresses to Google Maps, and license plates to Carfax. Despite claims of usefulness, some users are concerned about giving a competitive edge to dominant firms like Amazon. The tool creates links based on webpage information without permission from publishers, potentially affecting online libraries and paid ad websites. Critics argue it's a \"bad idea,\" while Google maintains it’s in trial mode with user choices available. Some compare AutoLink to Microsoft's Smart Tags feature, which faced backlash for similar issues. Users and advocates like Cory Doctorow suggest users should have control over the service, including being able to choose alternative links or opt-out altogether.", "opencoder:1.5b": "Google's toolbar spark concern\n\nSearch engine firm Google has released a trial tool which directs people to pre-selected commercial websites. The tool comes with an auto-link feature that links to Amazon.com for books' ISBN numbers, and allows linking to Google's map service or Carfax if there is an address or a licence plate. Google said the feature, available only in the US, \"adds useful links\". However, some users are concerned about Google's dominance in the search engine market place.\n\nThe tool works by creating links based on information contained in webpages - even if there is no link specified and whether or not the website's publisher has given permission. If a user clicks the tool, it can then direct them to appropriate websites dependent on content present on the webpage.\n\nIf a user clicks this feature, for example, a webpage that contains a book's unique ISBN number would be linked directly to Amazon.com, regardless of whether they like or dislike the product. It could mean online libraries list ISBN numbers and find users on Amazon if they choose to do so.\n\nSimilarly, websites which have paid for advertising on their pages can also be directed to rival services. The tool was initially praised by some net users and later dropped by Microsoft due to concerns over trademark use. Smart Tags, allowed Microsoft to link any word on a web page to another site chosen by the company, was compared with this feature.\n\nGoogle’s stance on this is that it should not be penalised for its dominance in the market place, as it could well be providing valuable services to firms like Amazon. But users need clear and transparent information about how the tool works, what it costs, and where it can be used. The tool was initially only available in beta stage and has been accepted by a wider range of users.\n", "smollm:1.7b": "The summary of the text above should include:\n\n1. The main idea: Google's AutoLink feature sparks concern among net users because it directs people to pre-selected commercial websites without their consent.\n2. Key details:\n\t* The AutoLink feature is a trial tool available only in the US, and it links to Amazon.com if there is an ISBN number on the site. It also links to Google's map service, if there is an address, or to Carfax, if there is a license plate.\n\t* Some users are concerned that Google's dominant position in the search engine market place could give it an unfair advantage over other companies by allowing them to direct people to their own websites without permission.\n3. The tone: The summary should be neutral and informative, providing information about the AutoLink feature without expressing opinions or emotions.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the given text concisely. Let me read through it carefully.\n\nThe main issue is that Google's new feature, AutoLink, is causing some concern because it redirects users to commercial websites instead of their own. It links Amazon, Google Maps, or Carfax based on book ISBN numbers or URLs.\n\nThere are specific points: the tool works by pointing to these sites even if there’s no link specified and doesn’t require permission. It's available only in the US as a beta feature, which is something to note. Some users express worry about Google dominating the market leading to a competitive edge for companies like Amazon. Dan Gillmor criticized it as a bad idea, and Google said they’d welcome user feedback.\n\nOther users argue that if websites allow the feature or are charged, there's no risk. They mention concerns about trademark issues, so some caution is needed. Cory Doctorow suggests that while Google can redirect people, users should know more about their options. He also mentions avoiding the feature to avoid being penalized and substituting companies for those chosen.\n\nAlright, I need to condense this into a single paragraph without explanations or formatting.\n</think>\n\nGoogle's new AutoLink tool redirects users to commercial sites based on book ISBN numbers, even if no link is specified, making it appear unfair. It links Amazon, Google Maps, or Carfax and is available only in the US as a beta feature. Some users worry about Google leading to a competitive edge for Amazon due to its dominant market position. The tool can cause confusion but is still being tested.", "tinyllama:1.1b": "A seafoam-colored tool with a yellow triangle on it has recently surfaced in Google's toolbar, sparking concerns among net users. The \"AutoLink\" feature directs users to pre-selected commercial websites when they click on the icon, prompting users to choose if they want to link directly to Amazon.com or another website for a free online library service. This tool also has a \"Disable\" button that allows users to prevent any links from being clicked at all, and to disable its feature entirely whenever they desire. The trial nature of the auto-link feature is likely to make it unfavorable to some net users as an unfettered link would undoubtedly lead to Amazon's gaining a competitive edge over rivals such as independent bookshops. Internet users are concerned that Google's dominance in the search engine market place could give a competitive advantage to companies like Amazon, where users' data and financial information is being collected for targeted advertising.", "tinydolphin:1.1b": " A recent announcement from Google's toolbar sparked concerns regarding user privacy and commercial influence. This feature allows search results to direct people to pre-selected commercial websites based on their search queries. Some users have expressed concern that this may lead to misleading information and unfair competition. The new feature is only available in the US for now, but some users are worried that Google's dominant position in the search engine market could mean it has an unfair advantage over other companies. AutoLink works by creating a link to a website based on information found in the page, even if there is no explicit link specified. This creates concerns among some users who may be misled or unwittingly directed to rival services. The tool is in beta and has not been tested extensively by users. Although Google has stated that AutoLink only works with websites that have given permission for third party links, this could still lead to misleading information if there are no clear guidelines on what counts as \"permission\". As a result, it is essential for users to take the time to review and understand the terms and conditions of the service before clicking the AutoLink button.", "phi:2.7b": " The summary of the text is:\n\nGoogle's new toolbar, called AutoLink, links people to pre-selected commercial websites based on information in a webpage. Some users are worried that this will give Google an unfair advantage and affect other businesses. Google said the tool is still in trial stage and users can choose not to use it or disable it at any time.\n", "orca-mini:3b": " Google's toolbar has a feature called AutoLink, which links to pre-selected commercial websites without user consent. It directs people to Amazon.com if a book's ISBN number is found on a webpage, and also links to Google's map service and car firm Carfax if an address or license plate is present. Users are concerned that this gives a competitive edge to rival firms like Amazon and could lead to online libraries directing users to rival services without their permission. However, Google says the feature is still in beta stage and invites feedback from users. It denies that it has been criticized by Microsoft for using Smart Tags, which allowed Microsoft to link any word on a web page to another site chosen by the company. Users can disable AutoLink or choose never to click on the feature, but Google says it receives revenue from websites it directs traffic to. Critics argue that Google should not be penalized for its market dominance, but the company says users have the right to choose which websites they want to link to.", "hermes3:3b": "Google's AutoLink feature, in US toolbar, directs users to pre-selected commercial websites based on webpage content; some concern over potential competitive advantage for partnered companies.", "stablelm-zephyr:3b": "Google released a trial tool, AutoLink, which directs users to pre-selected commercial websites. Concerns arise as this feature could give Google a competitive advantage and potentially direct users to rival services or Amazon.com if they have an ISBN number on their webpage. Google maintains that the feature is in beta stage and allows users to disable it entirely at any time, but some argue that users should have the option to choose whether or not they want to use AutoLink, as well as be aware of any financial arrangements between Google and these linked sites.", "stablelm2:1.6b": "Google's new toolbar, called AutoLink, directs users to pre-selected commercial websites when searching based on an ISBN number in a webpage. Some worry this could give Amazon a competitive advantage over others. AutoLink works by creating links without explicit permission or specified sites. The feature is currently only available in the US and was not paid for by any of the companies receiving AutoLinks. Critics compared it to Microsoft's Smart Tags, which faced concerns over trademark use when dropped by Microsoft.", "granite3.1-dense:2b": "Google has introduced a trial feature, AutoLink, within its toolbar that automatically generates links on webpages to pre-selected commercial sites like Amazon, Google Maps, and Carfax. This concerns some net users due to potential conflicts of interest, as Google's dominance in search engines might advantage these businesses over competitors. The feature works by linking information from a webpage, such as ISBN numbers or addresses, directly to the respective commercial sites without user permission. Users can opt-out or disable AutoLink entirely. Critics compare it to Microsoft's discontinued Smart Tags feature, which faced trademark issues and allowed any word on a web page to link to another site chosen by Microsoft. Google asserts that no companies have paid for this service and emphasizes user control over the feature. Digital civil liberties advocates argue that users should be informed about the commercial ties and the potential for financial compensation or substitution of default sites.", "chatgpt-4o-latest": "Google's new AutoLink feature in its toolbar has raised concerns as it automatically links webpage content to pre-selected commercial websites like Amazon, Google Maps, and Carfax without publisher consent. Critics worry that Google's market dominance could unfairly benefit certain companies. While Google states the feature is optional and can be disabled, some users compare it to Microsoft's discontinued Smart Tags, which faced backlash for similar reasons. Concerns include the lack of compensation for affected websites and the inability for users to customize linked destinations. Digital rights advocates argue that Google should be transparent about its partnerships and allow user choice.", "reference": "If a user clicks the AutoLink feature in the Google toolbar then a webpage with a book's unique ISBN number would link directly to Amazon's website.Some users said AutoLink would only be fair if websites had to sign up to allow the feature to work on their pages or if they received revenue for any \"click through\" to a commercial site.Google said none of the companies which received AutoLinks had paid for the service.\"But as an end user I would want to know - 'Can I choose to use this service?, 'How much is Google being paid?In a statement Google said the feature was still only in beta, ie trial, stage and that the company welcomed feedback from users.Search engine firm Google has released a trial tool which is concerning some net users because it directs people to pre-selected commercial websites.It said: \"The user can choose never to click on the AutoLink button, and web pages she views will never be modified.Mr Doctorow said the only objection would be if users were forced into using AutoLink or \"tricked into using the service\".\"In addition, the user can choose to disable the AutoLink feature entirely at any time.\"The AutoLink feature comes with Google's latest toolbar and provides links in a webpage to Amazon.com if it finds a book's ISBN number on the site."}