{"raw_text": "UK net users leading TV downloads\n \n British TV viewers lead the trend of illegally downloading US shows from the net, according to research.\n \n New episodes of 24, Desperate Housewives and Six Feet Under, appear on the web hours after they are shown in the US, said a report. Web tracking company Envisional said 18% of downloaders were from within the UK and that downloads of TV programmes had increased by 150% in the last year. About 70% were using file-sharing program BitTorrent, the firm said. \"It's now as easy to download a pirate TV show as it is to programme a VCR,\" said Ben Coppin from Envisional. A typical episode of 24 was downloaded by about 100,000 people globally, said the report, and an estimated 20,000 of those were from within the UK.\n \n Fans of many popular US TV programmes, like 24, usually have to wait weeks or months until the latest series is shown in the UK. But in some cases, said the report, people were able to watch the new episodes in Britain before US audiences on the west coast of the country. \"Missing a television show presents little problem to anyone with a basic knowledge of the internet,\" explained Mr Coppin.\n \n \"Two clicks and your favourite programme is downloading. In effect, the internet is now a global video recorder.\" Exact figures are difficult to pin down, but it is thought that about 80,000 to 100,000 people in the UK download TV programmes. Some may just want the odd episode, others are downloading regularly. Many broadcast analysts agree that the net is radically altering the way people get content, like TV programmes. This presents a challenge to broadcasters who are concerned that channel schedules may become less important to people. It is also of concern to them because advertisements are usually cut out of the downloaded programmes. The industry has coined the term \"time-shifting\" to describe this trend of being able to watch what you want, when you want. The increased popularity of personal digital video recorders, TiVo-type boxes which automatically record programmes like Sky+, have also contributed to the trend. There are also numerous programs available on the net which automatically search and store TV programmes for viewers, effectively creating a personal video recorder on a computer.\n \n Within half an hour, recorded episodes can be uploaded - or posted - onto file-sharing networks or other download sites. Because they tend to be shorter then full-length films, they can be processed - digitised - quickly. More people with high-speed broadband connections in the UK also means that episodes can be downloaded quickly.\n \n According to Jupiter Research 40% of homes with broadband say it helps them pick and choose the programmes they want to see or that friends have recommended. The Envisional reports said that the TV industry should consider offering a legal way to download shows. The BBC ran a trial of what it calls the Interactive Media Player (iMP) last year, which was based on a peer-to-peer distribution model. It let people download programmes it held the rights to up to eight days after they had already aired. It is looking to do a more expansive trial later this year. The BBC already allows radio fans to hear programmes they missed online up to a week after broadcast. About six million people in the UK now have a fast, always-on net connection via cable or phone lines.\n", "llama3.2:1b": "UK net users lead the trend of illegally downloading US TV shows from the internet. \n\nResearch found 18% of downloaders were from within the UK and downloads increased by 150% in the last year. File-sharing program BitTorrent was used for 70%. Typical episode of 24 downloaded 100,000 people globally.\n\nFans can watch new episodes before US audiences on the west coast in some cases, as they are downloading from within the UK. \n\nUp to 80,000-100,000 UK net users download TV programmes daily. The trend is changing how people get content, such as the way people watch what they want, when they want.\n\nMore people with high-speed broadband connections can quickly upload recorded episodes to file-sharing networks or other sites.", "llama3.2:3b": "UK TV viewers lead US show downloads from the internet with 18% of downloaders coming from within the country, a 150% increase in the last year, primarily using BitTorrent.", "gemma2:2b": "UK viewers are downloading US TV shows illegally from the internet at high rates, leading the trend among countries.  This illegal download activity is facilitated by fast broadband connections and file-sharing programs like BitTorrent. While waiting for UK broadcast of US shows can be a problem for viewers, this trend presents challenges to broadcasters who need to consider adapting their content schedules and advertising practices. The trend, also influenced by the popularity of personal DVRs, leads to time-shifting viewing and increased viewer control over their content consumption.  The industry is exploring legal options like the BBC's iMP program that offers limited downloads after broadcast, suggesting a shift towards more accessible and user-controlled content delivery. \n", "qwen2.5:0.5b": "UK viewers are downloading US shows illegally, according to Envisional research. Downloads of TV programmes increased by 150% in the last year. Two clicks on a video game download can make it \"download\" without opening browser. Personal digital video recorders (PDVRs) and TiVo-type boxes store downloaded videos on computers. Broadcast analysts say the trend will change television watching habits, with personal video recorders taking over from channels and ads now being removed from downloads. Downloads are not just about getting shows, but also about selecting content based on friends' recommendations or preferences.", "qwen2.5:1.5b": "UK internet users download US TV shows illegally, with 18% of downloads from within the country and 70% using BitTorrent for 150% increase in downloads over one year. About 20,000 people downloaded 24 episodes in the UK.", "qwen2.5:3b": "UK viewers lead in illegally downloading US TV shows from the internet. New episodes of popular series like 24, Desperate Housewives, and Six Feet Under appear hours after US broadcasts. About 18% of downloaders are from within UK, with BitTorrent being used by about 70%. The trend has seen TV programme downloads increase by 150% in a year. Fans can watch new episodes before US audiences on the west coast. With broadband availability and file-sharing networks facilitating quick download speeds, more people have access to these programs. Envisional suggests offering legal downloading options as broadcasters struggle with reduced importance of schedules due to this trend.", "opencoder:1.5b": "A summary can be written as:\n\nUK's tendency to illegally download US shows from the internet has increased significantly since Envisional reports that about 80% of UK users download TV programmes.\n\nThe trend is changing due to new technologies like personal digital video recorders, which automatically record favorite TV programmes and allow them to be uploaded quickly. The increased popularity of content sharing platforms, such as file-sharing networks or other download sites, has also contributed to the trend. \n\nThe BBC has already launched an interactive media player based on a peer-to-peer distribution model that allows users to listen to programmes they missed online up to eight days after their broadcast. According to the British Broadband Consumer Survey (BCS), roughly 40% of homes with broadband connections in the UK have picked and choose the programmes they want to see or are recommended by friends.\n", "smollm:1.7b": "The text above summarizes the main points of the article \"UK net users leading TV downloads\" by summarizing the key ideas and details. The article highlights the trend of illegal downloading of US shows from the net by British viewers, with a focus on the rise in popularity of personal digital video recorders (PVRs) and time-shifting. It also mentions the increasing importance of the internet as a global video recorder and the challenges faced by broadcasters to compete with online content providers.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely. Let me read through it carefully first.\n\nThe text talks about how British TV viewers are downloading American shows from the web, with some episodes being available weeks after they air. There's mention of Envisional and BitTorrent. The UK sees a 150% increase in TV show downloads last year.\n\nAlso, fans wait a few months for new episodes to appear in Britain. Some can watch them before US audiences on the west coast. This is a challenge for broadcasters since schedules might become less important. There's concern about ads being cut from downloaded content.\n\nThere are personal video recorders like TiVo and others that automatically store TV shows, which reduces the need to manually edit them. Envisional's report highlights this, with 80k-100k downloads per UK home, some downloading regularly and others just watching odd episodes.\n\nHigh-speed internet in the UK allows quick download of shorter TV episodes, making it easier for people with many connections. The BBC tried an interactive media player earlier, which could allow immediate viewing after a broadcast. They're expanding on that trial next week.\n\nSo, to summarize, British viewers download American shows quickly and sometimes before their US counterparts. The UK internet is facilitating this, especially with new services and faster connections.\n</think>\n\nThe text discusses the trend where British TV fans download American shows from the web, some episodes appearing weeks after they air. It mentions Envisional's 150% increase in TV show downloads and BitTorrent usage by 80k-100k UK homes. Fans wait a few months for new episodes to appear in Britain, with 24 downloading up to 100,000 viewers, including those within the UK. This is a challenge for broadcasters as schedules may become less important and advertisements are often removed from downloaded content. Personal video recorders like TiVo and others create a personal recorder on computers, reducing need for manual editing. The BBC tried an interactive media player earlier but plans to expand this trial next week. High-speed internet in the UK allows quick download of shorter TV episodes.", "tinyllama:1.1b": "The UK is leading the trend of downloading American TV shows from the web by half an hour, according to a report. Popular US shows such as \"24,\" \"Desperate Housewives,\" and \"6 Feet Under\" appear on the web hours after they are shown in the US, and viewers can download them for free using file-sharing programs like BitToorrent. The report suggests that more people with high-speed broadband connections in the UK also have more interest in picking and choosing TV shows compared to their friends who may recommend certain programmes. The BBC is considering offering a legal way to download shows, based on a peer-to-peer distribution model. A trial of this system will begin later this year.", "tinydolphin:1.1b": " This report suggests that British users of television downloads are doing so for more than just the latest US shows; they're also downloading pirated content from the internet to watch shows they missed in the US. This could pose a challenge for broadcasters, as it means that advertisements are being cut out of these downloaded programs, and that the industry has coined the term \"time-shifting\" to describe this trend. The increased popularity of personal digital video recorders like TiVo is also contributing to the trend, with some users even using them to watch what they want, when they want. This could eventually change how people access and enjoy their favorite TV shows.", "phi:2.7b": " In the UK, TV viewers are illegally downloading US shows from the internet at a rate of 18% compared to other countries. The most popular illegal downloads include episodes of 24, Desperate Housewives and Six Feet Under. Web tracking company Envisional found that about 70% of these downloads were done using BitTorrent file-sharing program. Fans of many popular US TV programmes are now able to watch the new episodes in Britain before US audiences on the west coast. The internet has made it easy for people to download their favourite shows, and this is a challenge for broadcasters who may see less importance in programming schedules and advertisements may be cut out of downloaded programmes. However, the industry has created online services that allow users to watch shows at their convenience.\n", "orca-mini:3b": " British TV viewers lead the trend of illegally downloading US shows from the net, according to research.", "hermes3:3b": "UK TV viewers lead download of US shows online, 18% of downloads originate from UK, downloads increased by 150%, mostly using BitTorrent for file-sharing.", "stablelm-zephyr:3b": "British TV viewers are leading the trend of illegally downloading US TV shows via the internet, according to research by web tracking company Envisional. The study found that 18% of downloads came from within the UK, with file-sharing program BitTorrent used by around 70% of users. Envisional's Ben Coppin said: \"It's now as easy to download a pirate TV show as it is to programme a VCR.\"\n\nPopular US shows such as 24, Desperate Housewives and Six Feet Under are appearing on the internet hours after they were shown in the US, allowing viewers in Britain to watch them before US audiences. The report suggests that about 80,000 to 100,000 people in the UK download TV programs regularly, with numerous programs available on the net creating a \"personal video recorder on a computer.\"\n\nBroadcast analysts agree that the internet is radically altering the way people get content, presenting challenges for broadcasters who are concerned schedule importance may decrease and issues of advertising being removed from downloaded content. The industry has coined the term \"time-shifting\" to describe this trend.", "stablelm2:1.6b": "British TV viewers lead the trend of legally downloading US shows from the internet, according to a report by Envisional. New episodes of popular TV programs like \"Desperate Housewives\" and \"Six Feet Under\" are available within hours after airing in the U.S., with 40% of downloaders being in the UK. Fans of these shows can now watch new episodes of Britain before US audiences on the internet, making it easier than ever to record a TV program. The popularity of personal digital video recorders and online tools that automatically search for and store TV programs for viewers has contributed to this trend. The industry should consider offering a legal way to download shows to counter the influence of time-shifting on traditional channel schedules.", "granite3.1-dense:2b": "British internet users are at the forefront of illegally downloading U.S. TV shows, according to research by Envisional. Popular series like 24, Desperate Housewives, and Six Feet Under become available for download within hours of their U.S. airdates due to piracy. The report indicates that 18% of these illegal downloads originate from the UK, with a 150% increase in downloads over the past year. BitTorrent is the preferred file-sharing platform, used by approximately 70% of downloaders. Ben Coppin from Envisional likens downloading TV shows to using a VCR. A typical episode of 24 was downloaded by around 100,000 global users, with about 20,000 from the UK.\n\nThis trend disrupts traditional viewing habits, as many U.S. viewers typically wait weeks or months for new episodes. Some British viewers can now access these shows before U.S. audiences on the west coast. The internet serves as a global video recorder, with about 80,000 to 100,000 UK users downloading TV programs. This phenomenon, termed \"time-shifting,\" challenges broadcasters and concerns them due to advertisement cutouts in downloaded content and potentially reduced channel scheduling importance.\n\nBroadcast analysts agree that the internet is transforming content consumption. The increasing availability of personal digital video recorders (PVRs) like Sky+ and software programs that automatically store TV shows on computers also contributes to this trend. With high-speed broadband connections, episodes can be downloaded quickly—within half an hour of recording—and shared on file-sharing networks or other download sites.\n\nJupiter Research predicts that 40% of British homes with broadband use it to select programs based on friends' recommendations or recommended content. Envisional suggests that the TV industry should explore legal download options, such as the BBC's iMP trial, which allows users to download rights-protected shows up to eight days after broadcast for those with fast, always-on internet connections (approximately six million UK residents).", "chatgpt-4o-latest": "British TV viewers are leading the trend of illegally downloading US shows, with 18% of global downloaders coming from the UK. Popular series like *24* and *Desperate Housewives* appear online hours after airing in the US, with downloads increasing by 150% in the past year. BitTorrent is the primary tool used, and a typical episode of *24* is downloaded by around 100,000 people worldwide, including 20,000 from the UK. The delay in UK broadcasts drives viewers to download episodes, sometimes even before US west coast audiences see them. \n\nThe rise of broadband and digital video recorders has made downloading easier, challenging traditional broadcasters as viewers bypass advertisements and schedules. The industry refers to this shift as \"time-shifting.\" Some broadcasters, like the BBC, are exploring legal alternatives, such as the Interactive Media Player (iMP), which allows users to download shows for a limited time. With six million UK homes having high-speed internet, the trend is expected to grow, prompting the TV industry to reconsider content distribution strategies.", "reference": "Web tracking company Envisional said 18% of downloaders were from within the UK and that downloads of TV programmes had increased by 150% in the last year.A typical episode of 24 was downloaded by about 100,000 people globally, said the report, and an estimated 20,000 of those were from within the UK.\"It's now as easy to download a pirate TV show as it is to programme a VCR,\" said Ben Coppin from Envisional.More people with high-speed broadband connections in the UK also means that episodes can be downloaded quickly.Exact figures are difficult to pin down, but it is thought that about 80,000 to 100,000 people in the UK download TV programmes.But in some cases, said the report, people were able to watch the new episodes in Britain before US audiences on the west coast of the country.There are also numerous programs available on the net which automatically search and store TV programmes for viewers, effectively creating a personal video recorder on a computer.The Envisional reports said that the TV industry should consider offering a legal way to download shows.Many broadcast analysts agree that the net is radically altering the way people get content, like TV programmes.It let people download programmes it held the rights to up to eight days after they had already aired.British TV viewers lead the trend of illegally downloading US shows from the net, according to research.Fans of many popular US TV programmes, like 24, usually have to wait weeks or months until the latest series is shown in the UK."}