{"raw_text": "IBM puts cash behind Linux push\n \n IBM is spending $100m (£52m) over the next three years beefing up its commitment to Linux software.\n \n The cash injection will be used to help its customers use Linux on every type of device from handheld computers and phones right up to powerful servers. IBM said the money will fund a variety of technical, research and marketing initiatives to boost Linux use. IBM said it had taken the step in response to greater customer demand for the open source software.\n \n In 2004 IBM said it had seen double digit growth in the number of customers using Linux to help staff work together more closely. The money will be used to help this push towards greater collaboration and will add Linux-based elements to IBM's Workplace software. Workplace is a suite of programs and tools that allow workers to get at core business applications no matter what device they use to connect to corporate networks. One of the main focuses of the initiative will be to make it easier to use Linux-based desktop computers and mobile devices with Workplace. Even before IBM announced this latest spending boost it was one of the biggest advocates of the open source way of working. In 2001 it put $300m into a three-year Linux program and has produced Linux versions of many of its programs. Linux and the open source software movement are based on the premise that developers should be free to tinker with the core components of software programs. They reason that more open scrutiny of software produces better programs and fuels innovation.\n", "llama3.2:1b": "IBM plans to invest $100m over three years to boost usage of Linux, a move in response to customer demand for the open source software. The investment will support technical, research, and marketing initiatives aimed at increasing collaboration among users and adding Linux-based elements to IBM's Workplace software suite.", "llama3.2:3b": "IBM is spending $100m over three years supporting Linux, increasing customer demand for its open-source software. The funding will aid in making Linux compatible across various devices, including servers, handheld computers, phones, and mobile devices. This initiative aims to boost collaboration among customers using Linux, adding Linux-based elements to IBM's Workplace software.", "gemma2:2b": "IBM is investing $100 million over three years to strengthen its commitment to Linux software. This funding will support initiatives aimed at increasing customer use of Linux across various devices, including handheld computers and powerful servers. The money will be used to boost collaboration and integrate Linux-based elements into IBM's Workplace software suite.  \n", "qwen2.5:0.5b": "IBM is investing $100 million in Linux software over the next three years, aiming to boost customer adoption by helping them use Linux on various devices including handheld computers and phones, powerful servers, and other types of hardware. The cash will be used to support a variety of initiatives aimed at promoting Linux use among customers. IBM has also made its move in response to increased demand for open source software solutions.", "qwen2.5:1.5b": "IBM invests $100 million over three years in Linux initiatives, focusing on collaboration tools like Workplace for Linux-based devices. The goal is to make Linux more accessible for corporate environments by integrating it into existing software solutions. IBM has been a leader in promoting open-source methods since 2001 through various Linux-related programs and investments.", "qwen2.5:3b": "IBM commits $100m over three years to enhance Linux software use, including support for devices from handhelds to servers. The money will fund technical, research, and marketing initiatives to boost Linux adoption. IBM has seen double-digit growth in Linux users since 2004 for better collaboration. Workplace software will be enhanced with Linux elements. Prior investments include a $300m program in 2001 and Linux versions of many programs. The open source approach emphasizes freedom to modify software components, fostering innovation through community scrutiny.", "opencoder:1.5b": "IBM puts cash behind Linux push\n\nIBM is spending $100m (£52m) over the next three years beefing up its commitment to Linux software.\n\nThe cash injection will be used to help its customers use Linux on every type of device from handheld computers and phones right up to powerful servers. IBM said the money will fund a variety of technical, research and marketing initiatives to boost Linux use.\n\nIn 2004, IBM saw double digit growth in the number of customers using Linux to help staff work together more closely. The money will be used to help this push towards greater collaboration and will add Linux-based elements to IBM's Workplace software.\n\nWorkplace is a suite of programs and tools that allow workers to get at core business applications no matter what device they use to connect to corporate networks. One of the main focuses of the initiative will be to make it easier to use Linux-based desktop computers and mobile devices with Workplace.\n", "smollm:1.7b": "IBM is investing $100 million over three years in a variety of initiatives to boost Linux use among its customers, according to a statement from the company on Friday. The cash injection will be used to help IBM's customers use Linux on every type of device from handheld computers and phones right up to powerful servers.\n\nThe money will also fund a variety of technical, research and marketing initiatives to boost Linux use, according to IBM. IBM said it had taken the step in response to greater customer demand for the open source software. In 2004 IBM said it had seen double digit growth in the number of customers using Linux to help staff work together more closely. The money will be used to help this push towards greater collaboration and add Linux-based elements to IBM's Workplace software.\n\nOne of the main focuses of the initiative will be to make it easier for IBM employees to use Linux-based desktop computers and mobile devices with IBM's Workplace software, according to a statement from IBM. Even before IBM announced this latest spending boost it was one of the biggest advocates of the open source way of working. In 2001 IBM put $300 million into a three-year Linux program and has produced Linux versions of many of its programs.\n\nIBM's Linux initiatives are based on the premise that developers should be free to tinker with the core components of software programs, according to IBM. They reason that more open scrutiny of software produces better programs and fuels innovation.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely. Let me read through it carefully.\n\nThe main points seem to be about IBM spending money on Linux software. They spend $100 million over three years to improve Linux support for customers from handheld devices up to servers. This money will fund technical, research, and marketing initiatives. IBM is responding to customer demand for open-source software by helping more collaborative teams use Linux. In 2004, they saw significant Linux adoption, and now this spending will make Workplace easier to use on various devices like laptops and smartphones.\n\nAlright, so the key ideas are: IBM increases $100 million annually over three years; this money is used to expand Linux support across different devices; aims to encourage collaboration among employees using Linux; inspired by the open-source movement where developers can improve software freely. IBM was already a big supporter before 2004, and now they're investing more in making Linux tools accessible.\n\nI need to make sure I capture all these points without getting too detailed or adding explanations. Keep it straightforward.\n</think>\n\nIBM plans to increase $100 million annually over the next three years to enhance Linux support for businesses across devices from handheld computers to servers. This money will fund tech, research, and marketing efforts aimed at boosting Linux adoption and promoting collaborative work among employees. IBM has already invested significant amounts in Linux since 2001, including its software versions on various programs. By investing more, IBM aims to make Linux tools accessible for workplaces, supporting collaboration while leveraging the open-source movement where developers can innovate without costs.", "tinyllama:1.1b": "IBM invests $100m over three years in expanding Linux usage across its product lines, including providing technical, research, marketing, and collaborative services to drive customer adoption. The investment aims to boost the use of Linux software on every device, from handheld computers and smartphones to powerful servers, in response to growing customer demand for open source technology. In 2004, IBM saw double-digit growth in the number of customers using Linux in its Workplace suite of productivity tools, which allows staff to work together regardless of device. To make it easier to use Linux-based desktop computers and mobile devices with Workplace, IBM plans to increase investment in technologies such as Linux desktop versions and more open source software applications. IBM's push towards greater collaboration is also part of this initiative, with the aim of making Workplace easier to use across a variety of platforms, including Windows, MacOS, and mobile devices.", "tinydolphin:1.1b": " IBM is putting an estimated $100m (£52m) investment over the next three years to boost its commitment to Linux software, the powerful open-source operating system used on every type of device from handheld computers to powerful servers. The company is aiming to help customers use Linux more widely across a variety of sectors including enterprise computing and collaboration tools. In 2004, IBM saw double digit growth in the number of customers using Linux for work-related applications such as Workplace. This initiative will be implemented through a combination of technical, research, and marketing efforts, aimed at boosting Linux use across IBM's range of software products and services.", "phi:2.7b": " IBM is investing $100m over three years into enhancing Linux software support, enabling customers to use it in a range of devices from handhelds to powerful servers. The company plans to focus on improving collaboration through the integration of Linux-based elements into its Workplace suite of programs. Despite being one of the biggest advocates for open source software, IBM has been investing in Linux since 2001 with $300m in its three-year program and releasing Linux versions of several of its applications.\n", "orca-mini:3b": " IBM is investing $100 million over the next three years in beefing up its commitment to Linux software. The money will fund a variety of technical, research, and marketing initiatives to boost Linux use among customers. IBM sees increased demand for Linux in helping staff collaborate more closely, and the initiative will focus on making it easier to use Linux-based desktop and mobile devices with Workplace software. IBM has been a strong advocate of open source software since 2001 when it invested $300 million into a three-year Linux program and produced Linux versions of many of its programs. Linux and open source software are based on the premise that more open scrutiny of software produces better programs and fuels innovation.", "hermes3:3b": "IBM invests $100m in pushing Linux usage.", "stablelm-zephyr:3b": "IBM plans to spend $100m over three years to increase its commitment to Linux software, aiming to help customers use it on all types of devices from handheld computers and phones to servers. The funds will support technical, research, and marketing initiatives to boost Linux adoption, in response to increased customer demand for the open source software. In 2004, IBM reported double digit growth in the number of customers using Linux to facilitate collaboration. This latest spending boost will focus on making it easier to use Linux-based desktop computers and mobile devices with IBM's Workplace software. As an advocate of the open source movement since 2001, IBM has already invested $300m over a three-year Linux program and produced Linux versions for many of its programs.", "stablelm2:1.6b": "IBM plans to spend $£¥ 3 years on Linux initiatives, supporting its customers' use of the open source software across various devices. This funding will fund technical, research, and marketing efforts for boosting Linux adoption in business applications. A double-digit growth has been seen in customers using Linux for collaboration purposes. Workplace software, which allows access to core business applications from any device, will incorporate Linux-based elements to facilitate easier use of desktop computers and mobile devices. IBM is one of the biggest advocates of open source software and has already invested $£¥ into a three-year Linux program and produced Linux versions of its programs.", "granite3.1-dense:2b": "IBM is investing $100 million over three years to strengthen its support for Linux, an open-source software platform. This financial commitment aims to facilitate the use of Linux across various devices, from handheld computers and smartphones to powerful servers, in response to increasing customer demand. The funds will be allocated towards technical development, research, and marketing efforts to enhance collaboration through IBM's Workplace software suite, which enables employees to access core business applications irrespective of the device used. A significant portion of this investment targets simplifying the integration of Linux-based desktops and mobile devices with Workplace. Since 2001, IBM has been a prominent advocate of open-source principles, previously committing $300 million to a three-year Linux program and developing numerous programs in Linux format. The open-source philosophy, based on unrestricted software tinkering for improved quality and fostering innovation, underpins IBM's initiative.", "chatgpt-4o-latest": "IBM is investing $100 million over three years to expand its commitment to Linux, funding technical, research, and marketing initiatives to support its customers in using Linux across various devices, from handhelds to servers. This move responds to growing customer demand and aims to enhance collaboration by integrating Linux-based elements into IBM's Workplace software, which provides access to business applications across different devices. A key focus is improving Linux-based desktop and mobile device compatibility with Workplace. IBM has been a strong advocate of open source, previously investing $300 million in Linux and developing Linux versions of its software. The open source model promotes transparency and innovation by allowing developers to modify core software components.", "reference": "IBM said it had taken the step in response to greater customer demand for the open source software.Linux and the open source software movement are based on the premise that developers should be free to tinker with the core components of software programs.IBM is spending $100m (£52m) over the next three years beefing up its commitment to Linux software.IBM said the money will fund a variety of technical, research and marketing initiatives to boost Linux use.The cash injection will be used to help its customers use Linux on every type of device from handheld computers and phones right up to powerful servers."}