{"raw_text": "Britons fed up with net service\n \n A survey conducted by PC Pro Magazine has revealed that many Britons are unhappy with their internet service.\n \n They are fed up with slow speeds, high prices and the level of customer service they receive. 17% of readers have switched suppliers and a further 16% are considering changing in the near future. It is particularly bad news for BT, the UK's biggest internet supplier, with almost three times as many people trying to leave as joining.\n \n A third of the 2,000 broadband users interviewed were fed up with their current providers but this could be just the tip of the iceberg thinks Tim Danton, editor of PC Pro Magazine. \"We expect these figures to leap in 2005. Every month the prices drop, and more and more people are trying to switch,\" he said. The survey found that BT and Tiscali have been actively dissuading customers from leaving by offering them a lower price when they phone up to cancel their subscription. Some readers were offered a price drop just 25p more expensive than that offered by an alternative operator, making it hardly worth while swapping.\n \n Other found themselves tied into 12-month contracts. Broadband has become hugely competitive and providers are desperate to hold on to customers. 12% of those surveyed found themselves unable to swap at all. \"We discovered a huge variety of problems, but one of the biggest issues is the current supplier withholding the information that people need to give to their new supplier,\" said Tim Danton, editor of PC Pro. \"This breaks the code of practice, but because that code is voluntary there's nothing we or Ofcom can do to help,\" he said. There is a vast choice of internet service providers in the UK now and an often bewildering array of broadband packages. With prices set to drop even further in coming months Mr Danton advises everyone to shop around carefully. \"If you just stick with your current connection then there's every chance you're being ripped off,\" he warned.\n", "llama3.2:1b": "Many Britons are unhappy with their internet service, citing slow speeds and high prices as major issues. A survey by PC Pro Magazine found that 17% of readers have switched suppliers, while a further 16% are considering doing so in the near future. BT has been actively discouraging customers from leaving, offering lower price alternatives to phone-in cancellations.", "llama3.2:3b": "Britons are unhappy with their internet service, citing slow speeds and high prices. 17% have switched suppliers and 16% are considering it soon. BT has almost three times as many people trying to leave as joining. Many customers find themselves tied into contracts or unable to switch due to withheld information from current providers.", "gemma2:2b": "Many Britons are unhappy with their internet service, including slow speeds, high prices, and poor customer service.  17% of respondents have switched providers while 16% plan to soon. This is particularly negative for BT, which sees more people leaving than joining. Competition has intensified, leading to some users being unable to switch due to contracts. Some customers are facing price drops only offered by their current provider as a way to dissuade them from switching, and there are problems with information exchange.  A wide variety of broadband packages available, coupled with falling prices in the near future, urges consumers to shop around carefully. \n", "qwen2.5:0.5b": "Key points:\n- 17% of readers have switched internet suppliers.\n- Some 2,000 broadband users surveyed are switching.\n- Some customers were offered a price drop for canceling subscriptions.\n- BT and Tiscali offer lower prices for cancelling, but it's difficult to switch quickly.\n- Customers who can't easily swap may be tied into long contracts.", "qwen2.5:1.5b": "A survey by PC Pro Magazine found that 20% of British internet users are dissatisfied with their service, including slow speeds, high prices, and poor customer service, particularly for BT, which faces mass defections as alternative providers offer lower rates or longer contracts.", "qwen2.5:3b": "A survey by PC Pro Magazine reveals many Britons are dissatisfied with their internet service, citing issues like slow speeds and high prices. 17% have switched suppliers while another 16% plan to do so soon. BT, the largest provider, faces nearly three times as many customers looking to switch as those joining. Customers often face difficulty in finding information needed for switching providers due to supplier withholding such information. With competitive pricing making more people consider leaving their current service, Tim Danton from PC Pro expects dissatisfaction levels to rise further by 2005. He advises Britons to shop around carefully given the choice of internet providers and broadband packages now available, warning that sticking with a current connection may result in being overcharged.", "opencoder:1.5b": "The key idea here is that many Britons are unhappy with their internet service and it's particularly bad news for BT, the UK's biggest internet supplier. The survey found that BT and Tiscali have been actively dissuading customers from leaving by offering them a lower price when they phone up to cancel their subscription. The customers were offered a price drop just 25p more expensive than that offered by an alternative operator, making it hardly worth the hassle of swapping. Broadband has become hugely competitive and providers are getting increasingly desperate to hold on to customers.\n", "smollm:1.7b": "The text is a summary of the article, which highlights the dissatisfaction of Britons with their internet service and the reasons behind it. The main points are:\n\n1. A survey conducted by PC Pro Magazine has revealed that many Britons are unhappy with their internet service.\n2. They are fed up with slow speeds, high prices and the level of customer service they receive.\n3. 17% of readers have switched suppliers and a further 16% are considering changing in the near future.\n4. It is particularly bad news for BT, the UK's biggest internet supplier, with almost three times as many people trying to leave as joining.\n5. Tim Danton, editor of PC Pro Magazine, expects these figures to leap in 2005. Every month the prices drop, and more and more people are trying to switch.\n6. Other found themselves tied into 12-month contracts. Broadband has become hugely competitive and providers are desperate to hold on to customers.\n7. One of the biggest issues is the current supplier withholding the information that people need to give to their new supplier, which breaks the code of practice.\n8. There is a vast choice of internet service providers in the UK now and an often bewildering array of broadband packages. With prices set to drop even further in coming months, Mr Danton advises everyone to shop around carefully.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Britons and their internet service dissatisfaction. Let me read through it carefully.\n\nThe first part talks about a survey by PC Pro Magazine showing that many Britons are unhappy with their net service. They’re upset because of slow speeds, high prices, poor customer service. 17% have switched suppliers, and another 16% are considering changing soon. BT is particularly affected, almost tripling the number of people leaving compared to joining.\n\nThen Tim Danton from PC Pro magazine says that the figures might jump in 2005. Prices drop each month, more people trying to switch.BT is dissuading customers by offering lower prices when they cancel their subscription. Some offered just a tiny bit more than another operator's price, making swapping hard.\n\nOther users are stuck in 12-month contracts due to competition and the need to hold onto customers. They found problems like suppliers withholding info. Danton warns that there’s many choices now, and careful shopping can avoid being ripped off if you stick with your current connection.\n\nI need to capture all these points concisely without any explanations or formatting. Just a summary of key ideas: BT is the main supplier facing high attrition, other providers offer help by offering discounts on cancelation, and competition makes switching hard.\n</think>\n\nBT is the leading internet provider in the UK facing significant churn among users, with nearly triple the number trying to leave compared to joining. Other providers offer discounts when customers cancel, while competition forces users into 12-month contracts, highlighting a competitive market where switching remains challenging.", "tinyllama:1.1b": "The survey conducted by PC Pro Magazine has revealed that many Britons are unhappy with their internet service provider due to slow speeds, high prices, and a lack of customer service. A third of the more than 2,000 people who responded were dissatisfied with their current providers but expect these figures to increase in 2005. The survey also found that BT and TiScala have actively discouraged customers from leaving by offering them a lower price when they call up to cancel their subscription. As a result, many Britons are forced to stick with their existing connections while being ripped off, as some broadband packages are set to drop further in coming months. The author advises shoppers to do their research carefully and to shop around for better deals.", "tinydolphin:1.1b": " A recent survey conducted by PC Pro Magazine revealed that the majority of Britons are unhappy with their internet service providers, and many have switched suppliers in search of better deals. In a surprising twist, almost half of those surveyed were considering changing their providers in the near future. \n\nBT, the UK's biggest internet supplier, has been particularly hard hit by the shift in customer preferences. A third of its users surveyed were unhappy with their current providers and this could be a harbinger of even more dissatisfaction to come. The low prices provided by BT have been a major factor contributing to its popularity among consumers, but it now appears that these benefits may be set to diminish in the coming years.\n\nThe issue has also raised concerns about the code of practice governing supplier information disclosures. In some cases, providers are withholding this crucial information from customers, a violation of the code. This not only affects consumers but can also have significant ramifications for the industry as a whole.\n\nIn response to these concerns, Ofcom has recently launched a review into the effectiveness of the code and its enforcement. The ultimate goal is to create a more competitive marketplace for internet providers in the UK, allowing consumers to make informed decisions when choosing their provider. \n\nAs a result of the survey results, PC Pro Magazine has suggested that consumers should shop around carefully when making their decision about their internet provider. This not only ensures that they get the best deal but also helps to maintain competition and ultimately lower prices for consumers.\n\nIn conclusion, the net service situation in Britain is far from ideal, with many Britons feeling unhappy with their current providers. Shop around carefully and consider switching to a provider offering better deals, as well as supporting smaller suppliers that are more likely to provide exceptional customer service.", "phi:2.7b": " A survey by PC Pro Magazine shows that many Britons are unhappy with their internet service, citing slow speeds, high prices, and poor customer service. Many have switched or plan to switch in the near future, but are deterred by high cancellation fees from their current provider. Other readers are tied into 12-month contracts. The survey also found that some providers withhold crucial information for customers switching suppliers, which is a violation of the code of practice. With a vast array of internet service providers available, it's important to shop around carefully to avoid being ripped off.\n", "orca-mini:3b": " A survey conducted by PC Pro Magazine revealed that many Britons are unhappy with their internet service, with 17% of readers having switched suppliers and a further 16% considering doing so in the near future. BT is particularly affected, with almost three times as many people trying to leave as joining. Customers have been offered lower prices by alternative providers just 25p more expensive than those offered by BT, but this barely justifies switching. Some readers were unable to switch at all due to contracts or hidden fees. The UK's broadband market has become highly competitive, with providers actively discouraging customers from leaving. However, some customers are still struggling to find the right package that suits their needs. Mr. Danton urges everyone to shop around carefully and warns that prices are set to drop even further in coming months.", "hermes3:3b": "Britons dissatisfied with internet service,\n  - Slow speeds\n  - High prices\n  - Poor customer service\n  - Many considering changing providers (17%, actively planning to switch 16%)", "stablelm-zephyr:3b": "A PC Pro Magazine survey revealed that many Britons are unhappy with their internet service, primarily due to slow speeds, high prices, and poor customer service. 17% of respondents have already switched suppliers, and 16% are considering changing in the near future. BT, the UK's biggest internet supplier, suffers from almost three times as many people trying to leave as join. Editor Tim Danton predicts these figures will increase in 2005 as more people become aware of the issues and prices drop. Providers discourage customers from switching by offering lower prices when cancelling subscriptions, and some are tied into 12-month contracts. Danton recommends shopping around carefully for better deals, as consumers may be paying more than necessary with their current connections.", "stablelm2:1.6b": "A survey by PC Pro Magazine reveals that many Britons are unhappy with their internet service, particularly slow speeds, high prices, and poor customer service. The number of people switching suppliers or considering doing so is 50%, and this is particularly bad news for BT as almost three times as many leave compared to join. A third of surveyed broadband users were dissatisfied with their current providers; however, Tim Danton, editor of PC Pro Magazine, suggests that the problems may be deeper as every month prices drop, and more people are trying to switch. Other broadband customers face lengthy contracts and difficulty in leaving. Some service providers offer lower prices when customers call to cancel subscriptions or even offer price drops just 5 pounds higher than an alternative operator. This practice discourages customers from switching service providers. With a vast range of internet service providers available, Danton advises careful shopping around for the best deals in the future.", "granite3.1-dense:2b": "Britons are dissatisfied with their internet services, citing slow speeds, high prices, and poor customer support as main concerns. A survey by PC Pro Magazine found that 17% have already switched providers, with nearly three times as many attempting to leave BT as join the company. Nearly a third of respondents are unhappy with their current providers, indicating potential future dissatisfaction. Competition among providers is intense, with some offering lower prices to retain customers despite being on 12-month contracts or preventing switches through information holding. Editor Tim Danton predicts more dissatisfaction in 2005 as prices continue to drop. He advises consumers to thoroughly research and compare broadband options due to the risk of overpayment with existing providers.", "chatgpt-4o-latest": "A survey by PC Pro Magazine found that many Britons are dissatisfied with their internet service due to slow speeds, high prices, and poor customer service. 17% have switched providers, and 16% are considering it. BT, the UK's largest provider, is losing more customers than it gains. A third of the 2,000 broadband users surveyed were unhappy, and the trend is expected to grow as prices drop. Some providers, like BT and Tiscali, try to retain customers by offering lower prices when they attempt to cancel, while others lock users into 12-month contracts. 12% of respondents were unable to switch due to providers withholding necessary information, violating a voluntary code of practice. With increasing competition and falling prices, PC Pro's editor advises consumers to shop around to avoid overpaying.", "reference": "Every month the prices drop, and more and more people are trying to switch,\" he said.\"We discovered a huge variety of problems, but one of the biggest issues is the current supplier withholding the information that people need to give to their new supplier,\" said Tim Danton, editor of PC Pro.A third of the 2,000 broadband users interviewed were fed up with their current providers but this could be just the tip of the iceberg thinks Tim Danton, editor of PC Pro Magazine.A survey conducted by PC Pro Magazine has revealed that many Britons are unhappy with their internet service.With prices set to drop even further in coming months Mr Danton advises everyone to shop around carefully.The survey found that BT and Tiscali have been actively dissuading customers from leaving by offering them a lower price when they phone up to cancel their subscription.It is particularly bad news for BT, the UK's biggest internet supplier, with almost three times as many people trying to leave as joining."}