{"raw_text": "Sun offers processing by the hour\n \n Sun Microsystems has launched a pay-as-you-go service which will allow customers requiring huge computing power to rent it by the hour.\n \n Sun Grid costs users $1 (53p) for an hour's worth of processing and storage power on systems maintained by Sun. So-called grid computing is the latest buzz phrase in a company which believes that computing capacity is as important a commodity as hardware and software. Sun likened grid computing to the development of electricity.\n \n The system could mature in the same way utilities such as electricity and water have developed, said Sun's chief operating officer Jonathan Schwartz. \"Why build your own grid when you can use ours for a buck an hour?\" he asked in a webcast launching Sun's quarterly Network Computing event in California. The company will have to persuade data centre managers to adopt a new model but it said it already had interest from customers in the oil, gas and financial services industries.\n \n Some of them want to book computing capacity of more than 5,000 processors each, Sun said. Mr Schwartz ran a demonstration of the service, showing how data could be processed in a protein folding experiment. Hundreds of servers were used simultaneously, working on the problem for a few seconds each.\n \n Although it only took a few seconds, the experiment cost $12 (£6.30) because it had used up 12 hour's worth of computing power. The Sun Grid relies on Solaris, the operating system owned by Sun. Initially it will house the grid in existing premises and will use idle servers to test software before shipping it to customers. It has not said how much the system will cost to develop but it already has a rival in IBM, which argues that its capacity on-demand service is cheaper than that offered by Sun.\n", "llama3.2:1b": "Sun Microsystems launches pay-as-you-go grid computing service allowing customers to rent processing power by the hour for $1 per hour. The system is likened to electricity and water development, with companies like utilities using it as a commodity. Demand from industries such as oil, gas, and finance is high, with some wanting 5,000+ processor capacity.", "llama3.2:3b": "Sun Microsystems launches pay-as-you-go service called Sun Grid, charging $1 (53p) per hour for processing and storage power. The system uses Solaris operating system and could mature like utilities such as electricity, allowing customers to use computing capacity without owning hardware or software. The company already has interest from oil, gas, and financial services industries, with some wanting to book 5,000 processors each. Sun Grid will initially test software on idle servers before shipping to customers, with IBM arguing that its capacity-on-demand service is cheaper.", "gemma2:2b": "Sun Microsystems launched \"Sun Grid\", a pay-as-you-go service allowing users to rent computing power by the hour. It costs $1 per hour and uses idle servers to provide grid computing services similar to electricity utilities. The company expects grid computing to grow into a major industry, offering access to large-scale processing capabilities.  They already have customers from industries like oil and gas and financial services with interest in renting more than 5,000 processors. Sun has a demonstration showing the service's potential, but it will not publicly share its development cost yet.  IBM also offers on-demand computing services, challenging Sun Grid's entry into the market. \n", "qwen2.5:0.5b": "Sun Microsystems offers a pay-as-you-go service for computing power that enables users to rent it by the hour. This new model of grid computing aligns with Sun's belief that computing capacity is as important as hardware and software. The company, Sun Grid, claims to be able to mature in the same way utilities have developed electricity. Some customers are interested in renting more than 5,000 processors at once, but they cost $12 (£6.30) per hour for the first hour's worth of processing power. While the experiment took only a few seconds and resulted in a high cost due to resource usage by Sun Grid, this service has not yet been developed further.", "qwen2.5:1.5b": "Sun Microsystems introduces Grid Computing: $1/hour processing and storage power, likened to electricity development, aiming for adoption from data center managers in industries like oil, gas, and finance; initial demonstration of protein folding experiment costing $12 (£6.30) using 12 hours of computing power.", "qwen2.5:3b": "Sun Microsystems offers a pay-as-you-go computing and storage service via Sun Grid costing $1 (53p) per hour for processing power maintained by Sun. This grid computing model, akin to electricity development, allows users access to vast computing resources without incurring large upfront costs. The system is part of Sun's belief that computing capacity should be treated as a commodity alongside hardware and software. Sun’s chief operating officer Jonathan Schwartz likens the service to utilities like water and electricity, suggesting users can rent processing power for $1 an hour. As of now, customers are interested in using more than 5,000 processors per instance. The service leverages Solaris, Sun's operating system, and uses idle servers to test software before deploying it to clients. Despite IBM offering a capacity-on-demand service, Sun Grid has potential rivals but aims at providing a cheaper alternative.", "opencoder:1.5b": "Sun offers processing by the hour.\n\nSun Microsystems launches a pay-as-you-go service which allows users to rent it by the hour if they need huge computing power. Users who require extensive processing will be charged based on an hourly rate for their work. This service is designed to cater to companies that demand a commodity like electricity but do not have the infrastructure or technical expertise required to build their own grid.\n", "smollm:1.7b": "The summary of the text above should be:\nSun Microsystems offers processing by the hour for customers requiring huge computing power at a low cost. The company's pay-as-you-go model allows users to rent this processing power on an hourly basis, which is similar to how utilities charge people for electricity and water. Sun Grid costs users $1 (53p) for an hour's worth of processing and storage power on systems maintained by Sun.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Sun Grid. Let me read through it carefully.\n\nThe first sentence says Sun offers processing by the hour. That means they charge users based on how much time they use their processing power. Cool.\n\nNext, Sun has launched a pay-as-you-go service called grid computing. They're marketing it as a new buzz phrase for a company that thinks computing capacity is as important as hardware and software. Interesting, so the main idea here is about the value of cloud computing infrastructure.\n\nSun Grid costs $1 per hour for an employee's processing power and storage on Sun-optimized systems. So if someone needs 50 hours of processing, it'll be $50. This is described as a \"grid computing service\" which they liken to electricity, emphasizing efficiency.\n\nThe chief operating officer, Jonathan Schwartz, says why build your own grid if you can get one for just a dollar an hour? That's the key point in his talk. He believes their model is cost-effective and transparent.\n\nSun will have to convince data center managers to switch from their current system but already has interest from industries like oil, gas, and finance. Some are willing to pay $12 per hour, which is a bit expensive, especially since they used 12 hours worth of power. But it's worth it for those customers.\n\nIn his demonstration, Sun showed servers processing data in a protein folding simulation. It took about a few seconds each, but the total cost was significant because it used up 12 hours. This experiment highlights the high upfront cost despite short runtime.\n\nSun Grid has an initial setup in existing buildings using idle servers to test software before shipping. IBM is a rival offering cheaper services. So Sun needs to position their service as cost-effective and efficient before competing with others.\n\nPutting this all together, the summary should capture the main points: pay-as-you-go processing, grid computing model linked to electricity (efficiency), pricing ($1 per hour), data centers wanting to switch models, interest from specific industries, successful demonstration of cost-effectiveness despite short runtime.\n</think>\n\nSun Grid offers a pay-as-you-go service for processing power and storage, akin to the development of utilities like electricity. Customers pay $1 per hour for services on Sun-optimized systems. Sun Grid, used by energy providers in states like California, aims to compete with IBM's-demanding model. The company has interest from industries like oil, gas, and finance but is still developing initial systems, which will test software before full-scale deployment.", "tinyllama:1.1b": "Sun offers processing by the hour, known as \"Sun Grid\", for users requiring massive computing power on systems maintained by Sun. Sun likened grid computing to the development of electricity and saw it becoming more common due to the advancement of technology and increasing demand from industries such as oil, gas, and financial services. Some customers want to book capacity of up to 5,000 processor cores per hour, which Sun said they had already had interest in. Although it only took a few seconds for this system, it still costs $12 (£6.30) because it has used up 12 hours' worth of computing power. The service will initially be available on existing systems before being expanded into on-demand capacity.", "tinydolphin:1.1b": " In brief, Sun Microsystems launches a pay-as-you-go service for large computing power usage. Users pay only for what they need, similar to electricity and water utilities in developing countries. This new service has the potential to revolutionize computing services by enabling customized solutions for specific tasks or industries such as energy and finance.", "phi:2.7b": " Sun Microsystems has released a new pay-as-you-go service called Sun Grid that allows customers to rent large computing power for an hourly fee of $1 (53p). The company believes grid computing is as important a commodity as hardware and software, and compares it to the development of electricity. Customers in industries such as oil, gas, and finance are already showing interest in using the system, which uses Solaris operating system. IBM also has a similar service called capacity on-demand, but Sun argues that its service is cheaper. The Sun Grid can be used for experiments like protein folding, but may cost up to $12 (6.30) per hour because it requires a few seconds of computing power from hundreds of servers at the same time.\n", "orca-mini:3b": " Sun offers processing by the hour through its pay-as-you-go service, which allows customers requiring huge computing power to rent it by the hour. The service is called Sun Grid and costs users $1 (53p) for an hour's worth of processing and storage power on systems maintained by Sun. Grid computing is the latest buzz phrase in a company that believes computing capacity is as important a commodity as hardware and software. Sun likened grid computing to the development of electricity, saying customers want to book computing capacity of more than 5,000 processors each. The service has already interest from customers in the oil, gas and financial services industries. It runs on Solaris, the operating system owned by Sun, and will use idle servers to test software before shipping it to customers. However, it has not yet said how much the system will cost to develop.", "hermes3:3b": "Sun pay-per-hour computing service", "stablelm-zephyr:3b": "Sun Microsystems introduced a pay-as-you-go service, Sun Grid, allowing customers to rent massive computing power by the hour for $1 (53p) per hour. This grid computing system aims to compete with utilities like electricity and water. Sun already has interest from customers in oil, gas, and financial services industries who wish to book more than 5,000 processors each. The company plans to initially house the grid in existing premises and use idle servers for testing software before shipping it to customers. A rival service is offered by IBM.", "stablelm2:1.6b": "Sun Microsystems offers pay-as-you-go computing services with their Sun Grid offering users $1 per hour for processing and storage power. This grid computing model is similar to electricity utilities and could develop similarly like utilities such as electricity, water, and gas. The company aims to persuade data center managers to adopt this new model, receiving interest from industries such..\nThe Sun Grid relies on the Solaris operating system by Sun. It initially houses the grid in existing premises and uses idle servers for testing before shipping it to customers. While Sun hasn 24 hours' worth of computing power using a few seconds' worth, costs $6 per hour due to usage, as IBM has a competitor arguing that its capacity on-demand service is cheaper than Sun's.", "granite3.1-dense:2b": "Sun Microsystems has introduced a pay-per-hour computing service called Sun Grid, enabling customers to rent vast processing and storage power. Priced at $1 (53p) per hour, this grid computing model positions computational resources as crucial, likening it to the evolution of electricity utilities. Sun's CEO, Jonathan Schwartz, emphasized the cost-effectiveness of using their grid over building one independently. Interested industries include oil, gas, and finance, with potential customers utilizing more than 5,000 processors at a time for complex tasks like protein folding experiments. The service is based on Solaris, Sun's proprietary operating system. Initially, it will utilize idle servers in existing data centers to test software before deployment. Although costs have not been disclosed for development, IBM presents a competing capacity-on-demand service at potentially lower prices.", "chatgpt-4o-latest": "Sun Microsystems has introduced a pay-as-you-go service called Sun Grid, allowing customers to rent computing power for $1 per hour. The company compares grid computing to utilities like electricity, aiming to make computing capacity a commodity. Sun's COO, Jonathan Schwartz, highlighted the benefits of using their grid instead of building one. The service has attracted interest from industries like oil, gas, and finance, with some customers requesting over 5,000 processors. A demonstration showed a protein folding experiment using multiple servers, costing $12 for 12 hours of computing power. Sun Grid runs on Solaris and will initially use idle servers for testing. IBM offers a competing capacity-on-demand service, claiming it is more cost-effective.", "reference": "Sun likened grid computing to the development of electricity.Sun Grid costs users $1 (53p) for an hour's worth of processing and storage power on systems maintained by Sun.The Sun Grid relies on Solaris, the operating system owned by Sun.Some of them want to book computing capacity of more than 5,000 processors each, Sun said.Sun Microsystems has launched a pay-as-you-go service which will allow customers requiring huge computing power to rent it by the hour.So-called grid computing is the latest buzz phrase in a company which believes that computing capacity is as important a commodity as hardware and software."}