{"raw_text": "Lasers help bridge network gaps\n \n An Indian telecommunications firm has turned to lasers to help it overcome the problems of setting up voice and data networks in the country.\n \n Tata Teleservices is using the lasers to make the link between customers' offices and its own core network. The laser bridges work across distances up to 4km and can be set up much faster than cable connections. In 12 months the lasers have helped the firm set up networks in more than 700 locations.\n \n \"In this particular geography getting permission to dig the ground and lay the pipes is a bit of a task,\" said Mr R. Sridharan, vice president of networks at Tata. \"Heavy traffic and the layout under the ground mean that digging is uniquely difficult,\" he said. In some locations, he said, permission to dig up roads and lay cables was impossible to get. He said it was far easier to secure permission for putting networking hardware on roofs. This has led Chennai-based Tata to turn to equipment that uses lasers to make the final mile leap between Tata's core network and the premises of customers. The Lightpointe laser bridges work over distances of up to 4km and are being used to route both voice and data from businesses on to the backbone of the network. The hardware works in pairs and beam data through the air in the form of laser pulses.\n \n The laser bridges can route data at speeds up to 1.25gbps (2,000 times faster than a 512kbps broadband connection) but Tata is running its hardware at more modest speeds of 1-2mbps. The lasers are also ideal for India because of its climate. \"It's particularly suitable as the rain rate is a little low and it's hardly ever foggy,\" he said. In places where rain is heavy and fog is common laser links can struggle to maintain good connection speeds. The laser links also take far less time to set up and get working, said Mr Sridharan. \"Once we get the other permissions, normal time period for set up is a few hours,\" he said. By contrast, he said, digging up roads and laying cables can take weeks or months. This speed of set up has helped Tata with its aggressive expansion plans. Just over 12 months ago the firm had customers in only about 70 towns and cities. But by the end of March the firm hopes to reach more than 1,000. \"Speed is very important because of the pace of competition,\" said Mr Sridharan.\n", "llama3.2:1b": "Tata Teleservices uses lasers to bridge network gaps between customers' offices and its core network in India, enabling faster setup and higher speeds. Lasers work across distances of up to 4km and can be set up much faster than cable connections. The firm has set up networks in over 700 locations in 12 months, with laser bridges helping it overcome permission difficulties and secure time-consuming digging and laying permits.", "llama3.2:3b": "Tata Teleservices uses lasers to bridge network gaps in India, setting up networks in over 700 locations in 12 months. Lasers can connect customers' offices to its core network up to 4km, faster and more reliable than cable connections. The technology is ideal for India's climate, but struggles with heavy rain and fog.", "gemma2:2b": "Tata Teleservices uses laser technology to connect customer offices to their core network. This overcomes challenges of setting up networks in India's congested urban areas by using roof-mounted equipment for minimal ground disturbance and allowing faster setup times compared to traditional cables. The technology enables high-speed data transmission (up to 1.25gbps) with laser beams, contributing to the company's rapid expansion plans and market competitiveness in a country with diverse climatic conditions. \n", "qwen2.5:0.5b": "Tata Teleservices uses lasers for network bridges, helping it overcome infrastructure challenges in India. The laser technology can connect voice and data networks up to 4 kilometers away, with speeds approaching 1.25 gigabits per second (2000 times faster than broadband). Tata has also used the laser bridge in locations like Chennai, where permission for digging roads is difficult. Laser bridges are ideal due to favorable weather conditions, as rain rates are lower and fog is rare. This makes them more suitable for India's climate compared to traditional cable solutions. Setting up a laser bridge takes several hours or days, whereas laying new cables can take weeks. By reducing the set-up time, this technology helps Tata expand its network quickly.", "qwen2.5:1.5b": "A telecommunications company in India has adopted lasers for network connections due to challenging geographical locations. They are using laser bridges that can link up to 4km and set up voice and data networks more quickly than traditional cable methods, helping them reach 700+ locations within 12 months. This approach is especially suited for areas with low rain and little fog, improving connection reliability compared to digging trenches or laying cables. The lasers offer higher speeds of up to 2,000 times faster than broadband connections but are running at a slower rate of 1-2mbps in some cases. Their fast setup time has accelerated Tata's expansion plans, connecting over 700 locations within 12 months and aiming for more than 1,000 customers by the end of March.", "qwen2.5:3b": "Lasers help Tata Teleservices bridge gaps in India's network infrastructure. The company uses laser bridges across up to 4km distances to connect customer offices with its core network more quickly than cable connections, especially viable where permission for digging is difficult due to heavy traffic and ground layout. Laser technology operates at speeds up to 1.25 Gbps but currently runs at slower rates of 1-2 Mbps. Suitable for India's climate (less rain and fog), laser bridges are quicker to set up than traditional cable connections, helping Tata expand rapidly in less than a year from serving about 70 towns and cities to aiming for over 1,000 by March.", "opencoder:1.5b": "The output from the above text will be a summary that includes the main points conveyed in it. In this case, the key idea is to help overcome network gaps with laser technology. This process is more efficient than using traditional fiber optics networks as they tend to have larger distances and more complex setups.\n", "smollm:1.7b": "The text above summarizes the following key ideas:\n\n1. The Indian telecommunications firm Tata Teleservices has turned to lasers to help it overcome the problems of setting up voice and data networks in India.\n2. Lasers have been used to bridge network gaps between customers' offices and Tata's core network, which is located in Chennai.\n3. The use of lasers has helped Tata to set up its networks more quickly than traditional methods, such as laying cables or using other forms of networking equipment.\n4. The laser technology used by Tata Teleservices is particularly suitable for India due to the country's climate and geography.\n5. The speed at which Tata can set up and operate its network has helped the firm to expand more quickly than it would have been able to do otherwise.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text into a concise summary that preserves the key ideas and details. Let me read through it again carefully.\n\nThe text starts by mentioning lasers helping bridge network gaps in India. Then, an Indian telecom company called Tata Teleservices is using lasers to set up their voice and data networks. They're setting up more than 700 locations in 12 months. The vice president said digging the ground for these laser bridges is difficult because of heavy traffic and underground layout.\n\nTata uses Lightpointe laser bridges, which can go up to 4km and connect both voice and data from premises to the core network. Their hardware runs at 1-2mbps but are much faster than broadband connections—up to 20 times quicker.\n\nLaser bridges help because the firm needs more speed for their expansion plans. They set up faster, especially after getting necessary permissions which take a few hours once done. This has helped them grow quickly over time.\n\nSo, the key points I need to include are:\n1. Laser bridges replacing cables.\n2. Setting up 700 locations in 12 months.\n3. The firm's approach using Lightpointe bridges.\n4. Their hardware speed (up to 20x faster) compared to broadband.\n5. The difficulty of getting permission for laser setup, especially underground.\n6. Why lasers are better suited for India with their climate.\n7. Faster set-up time after permissions and the importance of speed in competitive markets.\n\nI need to make sure I capture all these points without being too verbose. Let me structure it step by step.\n</think>\n\nLasers have enabled Tata Teleservices in India to efficiently set up voice and data networks across 700 locations, with setup completed in just over a year. The firm uses Lightpointe laser bridges that connect premises to the core network at speeds up to 20 times faster than broadband. Setting up these bridges is challenging due to underground conditions but offers a faster alternative to cables. With the right permissions, lasers take fewer hours to establish, allowing for rapid expansion. This approach is crucial for their competitive growth and efficiency in managing climate conditions suitable for Indian networks.", "tinyllama:1.1b": "A leading Indian telecommunications firm has turned to lasers to facilitate communication and data networks in their country, specifically to overcome problems with setting up networks and linking core networks with businesses on their backbone network. The company's laser-based solutions allow them to quickly set up and maintain high-speed connections over distances of up to 4km using equipment that can route data at speeds ranging from 1-2mbps. This is particularly useful in regions where heavy rain or fog may impede the use of traditional cable networks, making laser links ideal for India's climate conditions. In contrast to cable and fiber cables, lasers require less time and effort to set up, making them a fast and efficient solution for expanding the company's network reach. Tatas has already set up networks in more than 700 locations, with plans to reach over 1,000 by the end of March, demonstrating its aggressive expansion plans.", "tinydolphin:1.1b": " Tata Telecommunications has successfully set up voice and data networks in India using lasers to bridge network gaps. The lasers can handle distances up to 4km and offer faster, more reliable connections compared to traditional cable connections. By utilizing laser technology, the firm can set up networks quickly and efficiently, ultimately increasing their presence and supporting their aggressive expansion plans.", "phi:2.7b": " Tata Teleservices has used lasers to set up voice and data networks in India, overcoming difficulties related to digging cables in certain locations. The Lightpointe laser bridges are effective for distances up to 4km, allowing for faster set-up times compared to traditional cable connections. They have helped the firm expand its network to over 700 locations in just 12 months. While they can route data at speeds of 1.25gbps, the hardware is currently running at 1-2mbps. The climate in India makes lasers a suitable option, as heavy rain and fog can affect connection speed with other methods.\n", "orca-mini:3b": " Tata Teleservices uses lasers to set up networks in various locations and overcome challenges such as difficult permissions to dig, low rain rates, and common weather conditions such as fog. The Lightpointe laser bridges work over distances of up to 4km and are used to route both voice and data from businesses on to the backbone of the network. These hardware units work at speeds of 1-2mbps but Tata is running them at more modest speeds of 1-2mbps.", "hermes3:3b": "Tata Teleservices uses lasers for network connectivity in India, overcoming layout issues & permission problems by setting up laser bridges up to 4km away, faster than cable connections.", "stablelm-zephyr:3b": "Indian telecommunications company Tata Teleservices uses lasers to overcome challenges of setting up voice and data networks in the country. The Lightpoine laser bridges work across distances up to 4km and can be set up much faster than cable connections. With permission issues for digging roads and laying cables, Tata turns to placing networking hardware on roofs, which makes the process easier. This equipment is ideal for India's climate as it withstands rain better than other solutions. The laser links take less time to set up and get working, speeding up expansion plans for the company.", "stablelm2:1.6b": "Tata Teleservices uses lasers to create efficient voice and data networks in India. The company leverages Lightpointe laser bridges that can span up to 4km distances to establish connections, bypassing challenging ground permissions. Deployed on roofs and paired with modest speeds of 1-2mbps, the hardware routes both voice and data from businesses onto the backbone of Tata's network. Launched during the early months of this year, the technology has been instrumental in setting up networks in more than 40 locations. The laser bridges offer faster speeds, as much as twice that of a typical broadband connection, primarily due to their suitability in low-rain and foggy climates ideal for this equipment. With an average setup time being hours, compared to weeks or months for laying cables, Tata is enhancing its expansion plans.", "granite3.1-dense:2b": "Tata Teleservices, an Indian telecommunications firm, has adopted laser technology to expedite and simplify the installation of voice and data networks across the country. These laser bridges, deployed in 700 locations within 12 months, span up to 4km without requiring ground-based infrastructure due to its challenging terrains and traffic conditions. The devices, manufactured by Lightpointe, beam data as laser pulses through the air at speeds of up to 1.25gbps, though Tata operates at 1-2mbps. This solution is favored due to India's low rainfall and minimal fog, ensuring reliable connections. The setup time for these lasers is significantly shorter than cable connections, typically a few hours, versus weeks or months needed for road digging and cable laying. This efficiency has enabled Tata to expand rapidly from 70 urban centers to over 1,000 by March, meeting the demands of an increasingly competitive market.", "chatgpt-4o-latest": "Tata Teleservices, an Indian telecommunications firm, is using laser technology to connect customers' offices to its core network, overcoming challenges in laying cables due to difficult terrain and bureaucratic hurdles. The laser bridges, which work over distances up to 4km, enable faster setup compared to traditional cable connections. In a year, Tata has deployed these networks in over 700 locations. The technology, which transmits data via laser pulses, supports speeds up to 1.25gbps but is currently operated at 1-2mbps. India's favorable climate, with low rain and fog levels, makes laser links particularly effective. The quick installation process, taking only a few hours compared to weeks or months for cable laying, has supported Tata’s rapid expansion, allowing it to grow from serving 70 towns to a projected 1,000 by March.", "reference": "The laser links also take far less time to set up and get working, said Mr Sridharan.In 12 months the lasers have helped the firm set up networks in more than 700 locations.The laser bridges can route data at speeds up to 1.25gbps (2,000 times faster than a 512kbps broadband connection) but Tata is running its hardware at more modest speeds of 1-2mbps.Tata Teleservices is using the lasers to make the link between customers' offices and its own core network.The Lightpointe laser bridges work over distances of up to 4km and are being used to route both voice and data from businesses on to the backbone of the network.An Indian telecommunications firm has turned to lasers to help it overcome the problems of setting up voice and data networks in the country.The laser bridges work across distances up to 4km and can be set up much faster than cable connections.\"In this particular geography getting permission to dig the ground and lay the pipes is a bit of a task,\" said Mr R. Sridharan, vice president of networks at Tata.In some locations, he said, permission to dig up roads and lay cables was impossible to get."}