{"raw_text": "Game firm holds 'cast' auditions\n \n Video game firm Bioware is to hold open auditions for people to become cast members for future games.\n \n The company, which makes role playing games such as Knights of the Old Republic and Neverwinter Nights, is seeking people aged 18 to 99. The Canada-based company says it was looking for \"a wide variety of people to use as face models for characters\". Everyone chosen to appear in a video game will receive a performer's fee for the use of their image. The company is inviting people to come along to a shopping mall in West Edmonton, Alberta, on Friday and Saturday, bringing along a piece of photo identification.\n \n \"There are hundreds and hundreds of characters in a typical Bioware game,\" said Shauna Perry, Bioware's audio and external resources producer. \"Those people live in any city and village and so we need ordinary people, people with interesting faces.\" She added: \"Not everyone is a model in the world so we don't want just models in our games.\" People chosen to appear in a game will have their head scanned in three dimensions. Hundreds of photos of the person's head are taken so that a model of the head can be generated in 3D. \"The 3D model will look exactly like the person - it's really quite incredible how detailed they are,\" said Ms Perry. She said chosen participants will have no control over how the image is used in a computer game. \"We cannot give people any control over how the images are used. \"But their face could be used in multiple games - so they could be the hero in one, the villain in another and just a merchant in a third.\"\n", "llama3.2:1b": "Bioware will hold open auditions for cast members to appear in future video games, seeking people aged 18-99 with interesting faces. Participants will have their head scanned in 3D for a model that can be used in multiple games. Face models will receive a performer's fee and will not have control over how the image is used.", "llama3.2:3b": "Bioware, a video game firm, is holding open auditions for people to become cast members for future games. The company is seeking ordinary people with interesting faces aged 18-99 to use as face models for characters. Participants will have their head scanned and hundreds of photos taken to create a 3D model, which can be used in multiple games. Chosen participants will receive a performer's fee but have no control over how the image is used.", "gemma2:2b": "Bioware is holding open auditions for people aged 18 to 99 to become cast members in future video games. Participants will have their heads scanned to create 3D models of their faces that can be used in various game characters. They will receive a performer's fee for use of their image, and the model can be used across multiple games.  \n", "qwen2.5:0.5b": "Bioware plans to host auditions for future video games. Participants need to be 18-99 years old, with \"a wide variety of people to use as face models for characters\". People selected to appear in a game will have their head scanned in three dimensions and can only appear in one video game at a time.", "qwen2.5:1.5b": "Bioware, the video game firm that makes role-playing games like Knights of the Old Republic and Neverwinter Nights, is holding open auditions to become cast members for future games. The company seeks people aged 18-99, with those chosen receiving performers' fees for using their image in video games. Auditions will be held at a shopping mall in West Edmonton, Alberta on Friday and Saturday, where participants must bring photo identification for head scanning into three dimensions. The resulting 3D model will look exactly like the person and can be used across multiple games without control over usage.", "qwen2.5:3b": "Game firm Bioware is holding open auditions for cast members in Edmonton, Alberta, to create a diverse range of characters for future role-playing video games. The company invites people aged 18-99 with photo ID to attend the event at a shopping mall. Participants will have their heads scanned and photographed multiple times for a detailed three-dimensional model which can be used as any character in various Bioware games, without control over how their image is employed.", "opencoder:1.5b": "Game firm holds 'cast' auditions\n\nA video game firm is seeking to hold open auditions for people to become cast members. The company, which produces role playing games such as \"Knights of the Old Republic\" and \"Neverwinter Nights\", will have a variety of people aged 18-99 seeking to use as face models for their characters. The company is also looking for \"a wide variety of people to use as face models for characters\". Everyone chosen will receive a performer's fee for the use of their image. Their fee will be paid by regular Friday and Saturday malls in West Edmonton, Canada.\n", "smollm:1.7b": "Game firm holds 'cast' auditions", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Bioware's casting auditions. Let me read through it again.\n\nThe company is holding auditions for future video game characters. They're targeting people aged 18 to 99 from Canada. The goal is to use these actors in their games as face models. Each actor will receive a performer fee and has to pass a background check.\n\nThere's someone named Shauna Perry who said Bioware needs diverse individuals with interesting faces, not just model characters. They have 3D scans that create detailed images of actors for game uses without giving much control over how the images are used across different games.\n\nI need to capture all these key points: they're casting auditions, target age range, face models, performer fees, background checks, diversity in face types, and a specific process with 3D scans.\n</think>\n\nBioware is conducting open auditions for future video game characters. The company seeks individuals aged 18 to 99 from Canada as potential actors. They aim to use diverse participants based on interesting faces. Each actor will receive a performer fee and has a background check requirement. Participants will undergo 3D scanning to generate detailed models, which can be used across multiple games without giving much control over their usage.", "tinyllama:1.1b": "Game firm Bioware holds 'cast' audition for people to become cast members for future games. Company seeks out \"a wide variety of people\" to use as face models for characters in role-playing games such as \"Neverwinter Niights\" and \"Knight of the Old Republic\". Participants invited to shopping mall on Friday, Saturday to bring identification with photo. Bioware wants ordinary people with interesting faces to create virtual characters for video games. Participants selected will have their head scanned in 3D, resulting in a detailed 3D model. No control over images used in games is guaranteed.", "tinydolphin:1.1b": " Bioware, a leading video game company in Canada, is currently seeking participants for its next-generation role playing game. The auditions will take place at West Edmonton Mall on Friday and Saturday. Interested individuals must bring along identification that shows their photo, and they'll also need to apply via the company's website or by emailing casting@bioware.com. Applicants must be at least 18 years old and have a wide range of personalities to choose from, with options for all genders and ethnicities.", "phi:2.7b": " Bioware holds open auditions for cast members to become characters in future video games. Participants will receive a performer's fee for using their image as part of a character in a game. The company is looking for ordinary people with interesting faces who are aged 18-99 and have no control over how the images are used.\n", "orca-mini:3b": " Bioware, a video game firm, is holding open auditions for people to become cast members for future games. The company is seeking people aged 18 to 99 and will pay them actor fees for using their image in video games. Participants will have no control over how the images are used in a computer game. However, they could appear in multiple games as a hero, villain or merchant.", "hermes3:3b": "Bioware holds auditions for cast members, looking for diverse people (18-99) to appear as characters in role-playing games.", "stablelm-zephyr:3b": "Video game company Bioware is holding open auditions for people aged 18 to 99 to become cast members in future games. The company wants a wide variety of people with interesting faces to use as face models for characters. Selected participants will have their head scanned and multiple photos taken to create a 3D model that will be used in the games. They will receive a performer's fee for the use of their image, but will not have control over how their image is used in the computer games.", "stablelm2:1.6b": "Video game firm Bioware is holding open auditions for people to appear as \"face models\" in future video games, with applicants aged 18-25 needing photo ID. Those chosen will have their head scanned three dimensions, resulting in a detailed 3D model used for game characters. Participants' faces cannot be controlled but could potentially appear in multiple games where they might play as heroes, villains or merchants.", "granite3.1-dense:2b": "Bioware, a Canadian video game developer known for titles like Knights of the Old Republic and Neverwinter Nights, is hosting open auditions for individuals aged 18 to 99 to serve as face models for characters in future games. The company will select participants who possess diverse facial features, emphasizing that not all candidates need to be professional models. Participants will have their heads scanned in three dimensions to create highly detailed 3D models. While they won't have control over how these images are used in the games, their likeness could appear as heroes, villains, or merchants across multiple titles. The auditions take place at a West Edmonton mall in Alberta, and attendees must bring photo identification.", "chatgpt-4o-latest": "Bioware, a video game company known for role-playing games like Knights of the Old Republic and Neverwinter Nights, is holding open auditions for people aged 18 to 99 to serve as face models for future games. The auditions will take place at a shopping mall in West Edmonton, Alberta. Selected participants will have their heads scanned in 3D, with highly detailed models created from hundreds of photos. They will receive a performer's fee but will have no control over how their image is used, potentially appearing as different characters across multiple games. Bioware aims to include a diverse range of ordinary people to enhance the realism of its game worlds.", "reference": "People chosen to appear in a game will have their head scanned in three dimensions.She said chosen participants will have no control over how the image is used in a computer game.\"We cannot give people any control over how the images are used.Everyone chosen to appear in a video game will receive a performer's fee for the use of their image.Video game firm Bioware is to hold open auditions for people to become cast members for future games.The Canada-based company says it was looking for \"a wide variety of people to use as face models for characters\"."}