{"raw_text": "Warning over tsunami aid website\n \n Net users are being told to avoid a scam website that claims to collect cash on behalf of tsunami victims.\n \n The site looks plausible because it uses an old version of the official Disasters Emergency Committee webpage. However, DEC has no connection with the fake site and says it has contacted the police about it. The site is just the latest in a long list of scams that try to cash in on the goodwill generated by the tsunami disaster.\n \n The link to the website is contained in a spam e-mail that is currently circulating. The message's subject line reads \"Urgent Tsunami Earthquake Appeal\" and its text bears all the poor grammar and bad spelling that characterises many other phishing attempts. The web address of the fake site is decuk.org which could be close enough to the official www.dec.org.uk address to confuse some people keen to donate. Patricia Sanders, spokeswoman for the Disaster Emergency Committee said it was aware of the site and had contacted the Computer Crime Unit at Scotland Yard to help get it shut down. She said the spam e-mails directing people to the site started circulating two days ago shortly after the domain name of the site was registered. It is thought that the fake site is being run from Romania. Ms Sanders said DEC had contacted US net registrars who handle domain ownership and the net hosting firm that is keeping the site on the web.\n \n DEC was going to push for all cash donated via the site to be handed over to the official organisation. BT and DEC's hosting company were also making efforts to get the site shut down, she said.\n \n Ms Sanders said sending out spam e-mail to solicit donations was not DEC's style and that it would never canvass support in this way. She said that DEC hoped to get the fake site shut down as soon as possible. All attempts by the BBC News website to contact the people behind the site have failed. None of the e-mail addresses supplied on the site work and the real owner of the domain is obscured in publicly available net records. This is not the first attempt to cash in on the outpouring of goodwill that has accompanied appeals for tsunami aid. One e-mail sent out in early January came from someone who claimed that he had lost his parents in the disaster and was asking for help moving an inheritance from a bank account in the Netherlands. The con was very similar to the familiar Nigerian forward fee fraud e-mails that milk money out of people by promising them a cut of a much larger cash pile. Other scam e-mails included a link to a website that supposedly let people donate money but instead loaded spyware on their computers that grabbed confidential information. In a monthly report anti-virus firm Sophos said that two e-mail messages about the tsunami made it to the top 10 hoax list during January. Another tsunami-related e-mail is also circulating that carries the Zar worm which tries to spread via the familiar route of Microsoft's Outlook e-mail program. Anyone opening the attachment of the mail will have their contact list plundered by the worm keen to find new addresses to send itself to.\n", "llama3.2:1b": "A website claiming to collect cash on behalf of tsunami victims has been sent out, using a fake version of an official webpage from Disasters Emergency Committee (DEC). The site is being run from Romania and is attempting to scam people into donating money online. Decuk.org is the domain name of the site, which could be close to the real DEC website.", "llama3.2:3b": "A fake tsunami aid website, decuk.org, is being spread through spam emails that appear to be legitimate appeals for donations. The site is not affiliated with the official Disasters Emergency Committee (DEC) and is thought to be operated from Romania. DEC has contacted authorities to shut down the site, which is suspected of collecting cash on behalf of fake victims.", "gemma2:2b": "A fake website claiming to collect tsunami aid donations is using a plausible lookalike of the official Disasters Emergency Committee (DEC) site and spamming email links to spread it. DEC has contacted law enforcement, BT and its hosting company to have the site shut down, and is working with the US net registrars to manage the domain. The website seems to be running from Romania, and attempts to contact the owners were unsuccessful. This scam isn't unique; similar incidents involving phishing e-mails claiming inheritance or malware-filled links to donate have been reported before, proving that people are exploiting the public's generosity. \n", "qwen2.5:0.5b": "A website claiming to collect cash on behalf of tsunami victims is being targeted, despite it using an official disaster emergency committee webpage. DEC has contacted police about this site and is planning to shut it down. The fake site appears to be run by Romania's Computer Crime Unit, but DEC also hopes to get rid of it soon. Several other scams have been launched in the aftermath of the tsunami aid campaign, such as a Nigerian forward fee scam, a mail-to-mail worm called Zar, and a link to a website supposedly letting people donate money but instead loaded with spyware.", "qwen2.5:1.5b": "A scam website impersonating the Disasters Emergency Committee has been linked to spam emails encouraging donations for tsunami victims, using poor grammar and spelling similar to previous phishing attempts. The site's domain name decuk.org is claimed to be close to but not identical with the official DEC address, potentially confusing donors who want to donate. Police are investigating and urge users to avoid it.", "qwen2.5:3b": "Warning over scam website collecting donations for tsunami victims has been issued. The site appears similar to an official Disaster Emergency Committee webpage but is unrelated and contacted police. Spammed e-mails with poor grammar direct users to fake site decuk.org. DEC spokeswoman Patricia Sanders claims the site was shut down by contacting law enforcement and hosting companies, despite efforts by BT to get it removed. It's part of a trend of phishing scams using tsunami as a pretext, including Nigerian-style frauds. Sophos reports two tsunami-related emails made its top 10 hoax list in January, alongside another spreading via the Microsoft Outlook program.", "opencoder:1.5b": "The text provided contains a mix of technical and non-technical writing that may be considered too detailed for plain text summarization. However, the important points are:\n\n1) The website appears to be a scam.\n2) It claims to collect cash on behalf of tsunami victims.\n3) The DEC website is the latest in a list of scams trying to cash donations.\n4) There is a phishing attempt involving a fake website that is supposed to contact police.\n5) Spam e-mails are being circulated.\n6) The message's subject line reads \"Urgent Tsunami Earthquake Appeal\" and its text has poor grammar and spelling. It also links to the website and spams it with fraudulent messages.\n7) DEC has contacted the Computer Crime Unit and was informed by US net registrars that the domain name is registered.\n8) The fake site is running from Romania, and a spokesman for the Disaster Emergency Committee said it was aware of the site. The hosting company also seems to be involved.\n9) DEC plans to get the site shut down in a short time, as well as with BT and the hosting company. The owner of the domain reportedly moved money from his bank account in the Netherlands.\n10) The BBC News website is spamming people to make donations. The real owner's address appears to be hidden in publicly available net records.\n11) There are several other scam e-mails circulating, each with a different purpose and fraudulent message. Some of them seem to involve money donation, while others link to a fake website.\n", "smollm:1.7b": "The text summarizes the warning about a scam website that is trying to cash in on the goodwill generated by the tsunami disaster, highlighting its poor grammar and bad spelling, as well as its fake domain name and suspicious hosting company. It also mentions the fact that the site uses an old version of the official DEC webpage, which makes it harder for people to identify the scam. The text then explains how the website is trying to collect cash on behalf of victims by using a fake charity or organization, but this is not the case with the official DEC website. Instead, the scammer is targeting people who have already donated money to the official DEC website and are hoping to get more money out of them. The text also mentions that the scammer has contacted the police about the site and that they have notified other net users about it. Finally, the text highlights the fact that the link to the fake website is contained in a spam e-mail that is circulating on the internet, making it harder for people to identify the scam.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about a scam website related to the tsunami disaster. Let me read through it carefully and identify the key points.\n\nThe main issue is that there's a fake website collecting cash for victims of tsunamis. It looks plausible because it uses an old DEC webpage. The DEC, which stands for the Disasters Emergency Committee in England, has no connection with this site and has previously contacted the police about it. They have other scams planned too.\n\nThe link is in a spam email circulating on a spam e-mail server. The subject line is \"Urgent Tsunami Earthquake Appeal,\" which suggests it's a call to donate. The fake site is at decuk.org, but it's close enough that some people might think they're official. It uses Romanian domains, and the registration date was two days ago after being registered. They contacted Scotland Yard's Computer Crime Unit to shut it down.\n\nDEC plans to handle all donations via their site. They have other actions, like hosting the site and trying to get it down. Ms Sanders mentioned that sending spam emails isn't DEC's style—they don't want people donating for this reason. The BBC News email didn't work, and the real owner is hidden in net records. Also, there were e-mails similar to the Nigerian fraud where you lose parents and donate money.\n\nOther scams involve spyware and Microsoft Outlook. Sophos found two e-mails related to the tsunami that made it into January's list. There was a Zar worm email trying to find new addresses through Outlook. People opening attachments could get lists of contacts, which is bad.\n\nPutting this all together, I need to capture the key points: fake site using DEC webpage, no connection to DEC, multiple attempts via spam emails, no donation style by DEC, and other scams with spyware or phishing tactics.\n</think>\n\ndecuk.org", "tinyllama:1.1b": "The scam website on the internet promising aid for tsunami victims has been shut down after receiving numerous complaints from users who were tricked into sending money or personal information. The scammers have been using old versions of the official Disasters Emergency Committee (DEC) webpage as a cover, with spam e-mails containing links to fake sites. The DEC has contacted police about the site and the web hosting firm that's keeping it up, while DEC spokesperson Ms. Sanders has called on net registrars, hosters, and e-mail providers to help shut down the site as soon as possible. DEC hopes to get the fake site closed soon, but all attempts by BBC News website to contact scammers have failed so far. The scamming e-mails used fake links to websites that claimed to cashew money or personal information, and many people were convinced to donate large sums of money or share their private details through the hoaxes.", "tinydolphin:1.1b": " The tsunami disaster has created a wave of scams, from fake donation sites to malicious software spying on computer users. In this case, a scam e-mail claiming to be from DEC's website urges people to donate money to tsunami victims through the old official Disasters Emergency Committee (DEC) website. The spam email includes an old version of the official site which may look similar but is not affiliated with DEC and contains poor grammar and grammar. However, the message does warn users about the danger of falling for fake emails and urges them to avoid any scams related to tsunami aid.", "phi:2.7b": " A fake website claiming to collect cash for tsunami victims has been set up and is circulating spam emails. The Disaster Emergency Committee has contacted the police about it, but so far no action has been taken to shut it down. It's unclear who is behind the site, but the scam is similar to previous attempts to exploit people's goodwill following natural disasters.\n", "orca-mini:3b": " There is a warning over a scam website that claims to collect cash on behalf of tsunami victims. The site looks plausible because it uses an old version of the official Disasters Emergency Committee webpage, but it has no connection with DEC and the police have been contacted about it. Spam e-mails containing the link to the website are currently circulating, and the fake site is being run from Romania. The real owner of the domain is obscured in publicly available net records. The website is just the latest in a long list of scams that try to cash in on the goodwill generated by the tsunami disaster. DEC will not canvass support in this way and all attempts to shut down the fake site have been made.", "hermes3:3b": "Warning over fake tsunami aid website; avoids official DEC site due to scam; reported to police, computer crime unit; believed run from Romania.", "stablelm-zephyr:3b": "A scam website imitating the Disasters Emergency Committee (DEC) tsunami aid webpage has been identified, urging net users to avoid it. The fake site looks similar to the official DEC page and is contained within a spam email circulating today. The DEC has contacted police about the matter, urging them to shut down the site. The actual DEC website asks for no such connection; any cash donated via the deceptive site would have been handed over to the organization itself had it stayed online. Efforts by BT and the hosting company of the DEC are being made to take down the site. This is not the first time scammers have attempted to exploit the public's generosity following natural disasters.", "stablelm2:1.6b": "A warning was issued over a website claiming to collect money for tsunami victims, as they are part of a long list of scams attempting to capitalize on goodwill after the disaster. The official Disaster Emergency Committee webpage is being used as inspiration, but DEC has no connection with the fake site and has contacted police about it. The fraudulent site uses an old version of the official Decuk.org website and sends out spam emails directing people to donate money via the site. Attempts to get the site shut down have been made by various organizations, including BT and DEC's hosting company. Scams like this are not the organization's style, as they hope to stop the fake site from being launched as soon . The BBC has tried contacting those behind the site without success.", "granite3.1-dense:2b": "A warning has been issued for a scam website (decuk.org) impersonating the official Disasters Emergency Committee (DEC) site, which is being used to solicit tsunami relief funds. The fake site appears legitimate due to its resemblance to the official DEC webpage, but DEC has no association with it and has reported the issue to Scotland Yard's Computer Crime Unit for action. The spam emails containing the website link started circulating two days after the domain was registered, suggesting the site is based in Romania. DEC emphasizes that they do not use spam for fundraising and urges all cash donations to be redirected to them. This incident is part of a broader trend of tsunami aid scams, including phishing attempts, fake donation sites with spyware, and malware-laden emails. The Zar worm, which spreads through Outlook attachments, has also been detected in tsunami-related emails.", "chatgpt-4o-latest": "Internet users are being warned about a scam website that falsely claims to collect donations for tsunami victims. The fraudulent site mimics an old version of the official Disasters Emergency Committee (DEC) webpage and is promoted through spam emails with poor grammar and spelling. The fake site, decuk.org, closely resembles the legitimate DEC website, potentially misleading donors. DEC has reported the scam to Scotland Yard’s Computer Crime Unit and is working with US domain registrars and hosting companies to shut it down. The scam is believed to originate from Romania. DEC emphasizes that it does not solicit donations via spam emails. Other scams exploiting the tsunami disaster include phishing emails, spyware-laden donation sites, and fraudulent inheritance claims. Additionally, some tsunami-related emails have spread computer viruses, such as the Zar worm, which harvests email contacts.", "reference": "She said the spam e-mails directing people to the site started circulating two days ago shortly after the domain name of the site was registered.She said that DEC hoped to get the fake site shut down as soon as possible.The site is just the latest in a long list of scams that try to cash in on the goodwill generated by the tsunami disaster.Patricia Sanders, spokeswoman for the Disaster Emergency Committee said it was aware of the site and had contacted the Computer Crime Unit at Scotland Yard to help get it shut down.Ms Sanders said DEC had contacted US net registrars who handle domain ownership and the net hosting firm that is keeping the site on the web.DEC was going to push for all cash donated via the site to be handed over to the official organisation.None of the e-mail addresses supplied on the site work and the real owner of the domain is obscured in publicly available net records.All attempts by the BBC News website to contact the people behind the site have failed.BT and DEC's hosting company were also making efforts to get the site shut down, she said.The web address of the fake site is decuk.org which could be close enough to the official www.dec.org.uk address to confuse some people keen to donate."}