{"raw_text": "Piero gives rugby perspective\n \n BBC Sport unveils its new analysis tool Piero at the Wales v England rugby union match on Saturday. But what does it do and how does it work?\n \n Picture the scene - Wales are camped on the England line in the dying seconds of the Six Nations' opening match. A ball is flung out to winger Shane Williams who crosses to score the winning try for Wales. But the England players are incensed - arguing that the pass was forward and the try should not stand. In the past, sports fans would be left debating the validity of the try for days and weeks to come. But BBC Sport's new tool Piero could end discussions in minutes.\n \n Piero, named after the Italian painter and pioneer of perspective Piero della Francesco, creates a virtual stadium in which virtual players can be tracked from almost any angle. Viewers will be able to see precisely how the ball was thrown and by whom, giving a greater depth to the growing wealth of analysis available during sports broadcasts. The technology has been created by BBC Research and Development for BBC Broadcast and BBC Outside Broadcasts. BBC Sport is the first client to start using the system. \"In order to keep audiences growing and growing... we need to work closely with people who create technology and innovation to bring sport to life,\" said Andrew Thompson, the BBC's head of development, new media and sports news. \"We want to appeal to core fans - to give them more analysis, more detail, more definitive answers about key passages of play.\" Piero works by taking telemetric data from fixed camera positions and sending that data inside the video signal to a PC which can then render the information into 3D graphics.\n \n The more cameras using Piero, the better the detail possible out the other end when the data is turned into 3D models. \"It allows us to tell the story of a passage of play, tracking individual players across the field, looking at tactics,\" said Andy Townsend, from BBC Broadcast.\n \n An operator can manipulate the information and provide almost real-time replays of incidents, as well as more in-depth analysis. The \"virtual camera\" can focus on virtually any aspect of the pitch, giving viewers an insight into action that the camera normally cannot see. Piero also provides a wealth of statistical detail - from the length of kicks, to the length of a run of an individual player and the height of a lift at any lineout. Mr Townsend said sports performance companies were already showing an interest in the technology. BBC Broadcast hopes the technology can be sold to third parties interested in using it a number of different ways - from sport broadcasting to entertainment and game shows.\n", "llama3.2:1b": "Piero is a new analysis tool developed by BBC Sport that allows viewers to track virtual players on a rugby pitch from almost any angle. The system takes telemetric data from fixed cameras and sends it to a PC, which renders the information into 3D graphics. Piero can provide detailed analysis of key passages of play, including individual player tracking and tactics. The technology uses multiple cameras to capture high-quality footage, allowing for real-time replays and more in-depth analysis.", "llama3.2:3b": "BBC Sport has launched Piero, a new analysis tool that uses virtual stadium visuals to track players' movements and provide detailed replays and statistics for sports broadcasts, potentially ending debates over disputed plays.", "gemma2:2b": "Piero is a new analysis tool developed by the BBC that allows viewers to see replays of sports incidents from multiple angles, providing more detailed insights than traditional broadcasts. It uses technology to create virtual cameras and tracks players on the field. The tool will be available for use during upcoming broadcasts and could be sold to other organizations interested in using it for various purposes.  \n", "qwen2.5:0.5b": "Piero creates a virtual stadium for rugby players so they can see how each player threw the ball and where they were. It allows viewers to see how the team played without the camera getting too close. The technology is being used on BBC Sport's live stream of the Wales vs. England match, and it promises more detailed analysis of key moments in a game.", "qwen2.5:1.5b": "BBC unveils new rugby analysis tool Piero, allowing real-time tracking and 3D visualization of player movements across any angle during matches. BBC Research and Development created the system for BBC Broadcast and BBC Outside Broadcasts, targeting sports news and performance companies interested in using it for various applications like entertainment shows.", "qwen2.5:3b": "BBC Sport introduces Piero, named after Italian painter Piero della Francesco, which creates a virtual stadium for precise analysis during sports broadcasts. Using telemetric data from fixed camera positions, the system turns information into 3D graphics allowing viewers to track individual players across the field. It offers real-time replays and in-depth analysis while providing statistical details such as kick length or player height. Developed by BBC Research and Development, Piero aims to keep audiences engaged with more detail about key passages of play. The technology can be sold for various uses beyond sports broadcasting.", "opencoder:1.5b": "Piero gives rugby perspective\n\nPicture the scene - Wales are camped on the England line in the dying seconds of the Six Nations' opening match. A ball is flung out to winger Shane Williams who crosses to score the winning try for Wales. But the England players are incensed - arguing that the pass was forward and the try should not stand. In the past, sports fans would be left debating the validity of the try for days and weeks to come. But BBC Sport's new tool Piero could end discussions in minutes.\n", "smollm:1.7b": "Piero, a new analysis tool for rugby, is designed to provide detailed insights into the game by tracking players' movements and ball passes during live matches. The technology uses telemetric data from fixed camera positions to create 3D graphics that can be used to recreate key moments of play in stunning detail. By providing real-time replays of incidents and more in-depth analysis, Piero aims to give viewers a deeper understanding of the game and its intricacies.\n\nThe tool is designed for use by sports broadcasters and analysts who want to provide more detailed commentary on live matches. BBC Sport will be one of the first clients to start using Piero, with the goal of providing fans with more in-depth analysis and insights into key passages of play. The technology has been developed in partnership with BBC Research and Development for BBC Broadcast and BBC Outside Broadcasts, and is expected to become a standard feature of live sports broadcasts in the future.\n\nThe development of Piero was led by Andrew Thompson, the head of development at BBC Research and Development, who said that the goal was to create technology that could be used by anyone - not just sports broadcasters or analysts. \"We want to appeal to core fans,\" he said. \"To give them more analysis, more detail, more definitive answers about key passages of play.\"\n\nThe technology uses a combination of telemetric data from fixed camera positions and computer-generated graphics to create 3D models of the pitch. This allows users to track individual players across the field, as well as more in-depth analysis of specific incidents such as kicks or lifts at any lineout. The virtual camera can also be used to manipulate the information and provide different perspectives on the same incident - for example, a user could see how the ball was thrown from different angles or what the wind speed would have been if the pass had been made in a different location.\n\nThe BBC is currently showing live rugby matches using Piero, with the goal of providing fans with more detailed analysis and insights into key passages of play. The technology has already been used to provide additional commentary for several live matches, including the Wales v England match on Saturday.\n\nOverall, Piero is a new tool that aims to give viewers a deeper understanding of rugby by providing detailed insights into the game. By tracking players' movements and ball passes during live matches, the technology can be used to recreate key moments of play in stunning detail - and provide fans with more analysis and insights than ever before.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to help the user by summarizing this text concisely. The user provided a detailed paragraph about a sports tool called Piero. Let me read through the text again to make sure I understand all the key points.\n\nFirst, the text talks about a rugby perspective in the context of the Wales vs England match. It mentions how fans were divided on whether the try should stand because it seemed too straightforward. Then it introduces Piero, which is named after the Italian artist Piero della Francesco. The tool uses virtual players from different angles to track where the ball was thrown and who scored.\n\nBBC Sport starts using Piero as a new analysis tool for their broadcast. They want fans to have more detailed and accurate information about games. Piero works by using telemetric data, which is captured by cameras, and then processing that into 3D graphics. More cameras mean better detail at the other end, showing how players are moving across the field.\n\nThey mention that Piero allows for replays in real-time and provides statistical details like kick lengths, player runs, and lifts. It's not just for broadcasting but could be used in entertainment too. The goal is to engage fans more deeply with detailed analysis.\n\nSo, putting this together into a summary, I need to capture the main points: the introduction of Piero by BBC, how it uses virtual players, the technology behind it (telemetric data and 3D graphics), the use of multiple cameras for better detail, and its application beyond just sports broadcasting. Also, the appeal is towards core fans who want more analysis.\n\nI should make sure to include all these elements in a concise manner without adding any extra information. The summary needs to be clear and to the point, reflecting the key ideas as described.\n</think>\n\nBBC Sport introduced Piero, an innovative virtual stadium tracking tool for sports analysis, designed to provide fans with detailed 3D insights into game events. By leveraging telemetric data from fixed cameras and processing it into visual models, Piero allows fans to track players across the pitch, understand tactics, and receive precise play-by-play information. With multiple cameras enhancing detail at both ends of the process, Piero offers a comprehensive sports experience beyond traditional broadcasting.", "tinyllama:1.1b": "Piero, developed by BBC Research and Development for BBC Broadcast and BBC Outside Broadcasts, is a new tool that provides virtual stadium views in real-time during sports broadcasts. It allows viewers to see precise analysis of key moments from any angle, with detailed information and statistics that can be used in various ways, such as sport broadcasting or entertainment and game shows. Sports performance companies are already showing an interest in the technology, while BBC Broadcast hopes to sell it to third parties for use in various formats.", "tinydolphin:1.1b": " BBC Sport's new analysis tool, Piero, creates a virtual stadium that tracks players and passes with a depth not available before. This innovation enables the audience to understand key moments in a rugby match more clearly. The system was developed by BBC Research & Development and utilizes telemetric data from fixed camera positions to render the information into 3D graphics. As more cameras are added, the detail becomes more detailed.", "phi:2.7b": " Piero is a new tool created by BBC Sport that uses 3D graphics to track virtual players from any angle, providing more detailed analysis during sports broadcasts. It works by taking telemetric data from fixed camera positions and rendering it into 3D models. The more cameras using the system, the better the detail possible. An operator can manipulate the information and provide real-time replays of incidents and in-depth analysis. The technology provides statistical details such as the length of kicks, runs of players, and lift heights at lineouts. Sports performance companies are interested in using it for other purposes like entertainment and game shows.\n", "orca-mini:3b": " Piero is a virtual stadium that uses 3D graphics to track individual players on the field during a rugby match. It allows viewers to see how the ball was thrown and by whom, providing more definitive answers about key passages of play. The technology works by taking telemetric data from fixed camera positions and sending it to a PC, which can then render the information into 3D models. Piero allows for more in-depth analysis and can provide almost real-time replays of incidents. It provides statistical detail, including the length of kicks, the length of a run of an individual player, and the height of a lift at any lineout. The technology has potential applications in sport broadcasting, entertainment, and game shows.", "hermes3:3b": "Piero: BBC's 3D analysis tool for rugby matches, creating virtual stadium views to track players' angles & analyze plays.", "stablelm-zephyr:3b": "BBC Sport has unveiled its new analysis tool, Piero, during the Wales v England rugby union match. Piero, named after Italian painter Piero della Francesco, creates a virtual stadium that tracks virtual players from almost any angle. Viewers can see how the ball was thrown and by whom, providing deeper analysis of sports broadcasts. The technology works by taking telemetric data from fixed camera positions and sending it inside the video signal to a PC which renders the information into 3D graphics. Piero provides statistical details such as kick length, run length for individual players, and height of lifts at lineouts. BBC Broadcast hopes to sell the technology to third parties interested in using it for various purposes including sport broadcasting and entertainment/game shows.", "stablelm2:1.6b": "BBC Sport has developed a new analysis tool called Piero, named after Italian painter Piero della Francesco. The tool tracks virtual players on a stadium screen during rugby matches, providing instant feedback on play by analyzing telemetric data from fixed camera positions. It allows viewers to see more depth in sports broadcasts through detailed 3D graphics, tracking individual players across the field and offering nearly real-time replays of incidents. Piero can be manipulated for in-depth analysis, making it appealing to core fans for more information on key passages of play. The technology has been created by BBC Research and Development for BBC Broadcast and BBC Outside Broadcasts, with the first client using it for Wales vs England rugby match.", "granite3.1-dense:2b": "BBC Sport introduces Piero, its new analysis tool for rugby union matches. Named after Italian artist Piero della Francesco, Piero creates a virtual stadium where viewers can track players' movements from various angles. This technology was developed by BBC Research and Development for BBC Broadcast and Outside Broadcasts to enhance sports broadcasting. During the Wales v England Six Nations match, Piero helped determine whether a controversial try should stand by precisely tracking the ball's trajectory and identifying the thrower.\n\nPiero functions by collecting telemetric data from fixed camera positions and converting it into 3D graphics on a PC. The more cameras utilizing Piero, the more detailed the rendered images become. This allows operators to provide real-time replays of incidents and offer in-depth analysis, including tracking players across the field, examining tactics, and displaying statistical details like kick lengths, player run distances, and lineout lift heights.\n\nBBC Broadcast plans to market Piero for various applications beyond sports broadcasting, such as entertainment and game shows. Sports performance companies have shown interest in the technology, indicating its potential for growth and expansion outside of rugby.", "chatgpt-4o-latest": "BBC Sport introduces Piero, a new analysis tool debuting at the Wales v England rugby match. Piero creates a virtual stadium with 3D models of players, allowing precise tracking of movements and plays from multiple angles. Developed by BBC Research and Development, it enhances sports analysis by providing detailed insights into key moments, such as determining whether a pass was forward. The system uses telemetric data from fixed cameras to generate 3D graphics, offering near real-time replays and in-depth tactical analysis. Piero also provides statistical details like kick distances and player runs. BBC Broadcast aims to market the technology for various applications, including sports broadcasting, entertainment, and game shows.", "reference": "BBC Sport unveils its new analysis tool Piero at the Wales v England rugby union match on Saturday.BBC Sport is the first client to start using the system.But BBC Sport's new tool Piero could end discussions in minutes.The more cameras using Piero, the better the detail possible out the other end when the data is turned into 3D models.The technology has been created by BBC Research and Development for BBC Broadcast and BBC Outside Broadcasts.BBC Broadcast hopes the technology can be sold to third parties interested in using it a number of different ways - from sport broadcasting to entertainment and game shows.\"In order to keep audiences growing and growing... we need to work closely with people who create technology and innovation to bring sport to life,\" said Andrew Thompson, the BBC's head of development, new media and sports news.Viewers will be able to see precisely how the ball was thrown and by whom, giving a greater depth to the growing wealth of analysis available during sports broadcasts.\"It allows us to tell the story of a passage of play, tracking individual players across the field, looking at tactics,\" said Andy Townsend, from BBC Broadcast."}