{"raw_text": "Open source leaders slam patents\n \n The war of words between Microsoft and the open source movement heated up this week as Linux founder Linus Torvalds led an attack on software patents.\n \n In a panel discussion at a Linux summit in California Mr Torvalds said software patents were a problem for the open source movement. Mitchell Kapor, chairman of the Mozilla foundation, warned that Microsoft could use patent lawsuits in the future. Linux is a freely-available alternative to Microsoft's Windows. It relies on a community of programmers for its development and is based on open source principles, which allow others to use and modify it without having to pay licence fees. The attack on software patents comes at a time when IBM has made 500 of its patents freely available. Other companies are expected to follow suit.\n \n There are between 150,000 and 300,000 registered software patents in the US and open source developers argue that many should never have been granted. This is a view corroborated by the UK Patent Office. \"Some of the patents have dubious validity and are being wielded by some big companies to force smaller companies to buy licenses in the knowledge that they can't afford to take them to court,\" said Dr Jeremy Philpott of the UK Patent Office. Some panel members are worried that Microsoft would issue a series of patent lawsuits in the future. \"If totally pushed to the wall - because their business model no longer holds up in an era in which open source is an economically superior way to produce software...of course they're going to unleash the WMDs,\" Mr Kapor is reported as saying. Microsoft did not want to comment directly, referring the issue instead to trade body Intellect, of which it is a member. \"As far as Intellect is concerned, open source and patents have co-existed for many years without problems,\" said spokeswoman Jill Sutherland. \"The industry respects the open source movement and in fact many of the members we represent use the open source system to develop software,\" \"We think the important point to make is that companies should be able to choose between patents, copyrights and open source as to the treatment of their intellectual discoveries, and not be forced into using one or the other,\" she added.\n", "llama3.2:1b": "Microsoft's patent lawsuits are a threat to the open source movement, according to Linus Torvalds. The Linux founder argues that software patents are a problem for open source developers who rely on free and collaborative development models. IBM has already made its 500 patents freely available, with other companies expected to follow suit. Some panel members believe Microsoft will use patent lawsuits to force smaller companies into licensing agreements due to their inability to afford court battles.", "llama3.2:3b": "Linux founder Linus Torvalds criticized software patents as a problem for the open source movement, citing concerns about Microsoft's potential use of patent lawsuits in the future. The UK Patent Office has stated that some patents have dubious validity, and companies like IBM have made 500 of their patents freely available.", "gemma2:2b": "Linus Torvalds criticized software patents for harming the open source movement.  He was joined by others who argued that many patents are unjustified and used by companies like Microsoft to stifle competition through licensing fees. Concerns were raised about potential future lawsuits from Microsoft. While Microsoft has not commented directly, it referenced Intellect's stance, stating that open source and patents can coexist without issues. \n", "qwen2.5:0.5b": "Open-source leaders are warning Microsoft against granting software patents by slamming them in a panel discussion at a Linux summit in California. They argue that many of the software patents should never have been granted. Some companies believe that Microsoft could use patent lawsuits to force smaller developers to pay licensing fees for open-source projects. The UK Patent Office and IBM have made 500 of their own software patents freely available, according to Jeremy Philpott of the UK Patent Office. Microsoft's spokesman Jill Sutherland says they respect open source and prefer using the open source system over using software patents.", "qwen2.5:1.5b": "Open source leaders criticize software patents, with Microsoft facing potential patent lawsuits, amid growing interest in free software alternatives like Linux. Companies like IBM have also released many patents for free, sparking debate about the future role of open-source development versus traditional intellectual property law.", "qwen2.5:3b": "Open source leaders criticize software patents, highlighting concerns about potential future patent lawsuits from Microsoft. Linus Torvalds criticizes them for the open-source movement, while Mitchell Kapor warns against it. IBM has made 500 of its patents available openly. UK Patent Office supports critics, stating many patents lack validity and are used unfairly by larger companies. Critics fear Microsoft could launch a series of lawsuits in response to failing business models. Intellect representatives defend patents but acknowledge coexistence with open-source practices.", "opencoder:1.5b": "The Open Source leaders have slammed patents in this week as Linux founder Linus Torvalds attacked software patents. The discussion at a Linux summit in California Mr Torvalds stressed that software patents posed a problem for the open source movement, emphasizing the need for more flexible platforms. Microsoft warned about the potential lawsuits from other companies, while open source developers argue many of their rights are being threatened by some large corporations. IBM made 500 patents freely available, and many companies are arguing in favor of open sourcing. The US Patent Office reported a view with several cases under dubious validity. The UK trade body Intellect argued that the open source system had co-existed without problems, but Microsoft's stance on this was not completely ignored. Companies should be able to choose between patents, copyrights and open source according to the rules of intellectual property.\n", "smollm:1.7b": "The war of words between Microsoft and the open source movement heated up this week as Linux founder Linus Torvalds led an attack on software patents. In a panel discussion at a Linux summit in California, Mr Torvalds said software patents were a problem for the open source movement. Mitchell Kapor, chairman of the Mozilla foundation, warned that Microsoft could use patent lawsuits in the future. Linux is a freely available alternative to Microsoft's Windows. It relies on a community of programmers for its development and is based on open source principles, which allow others to use and modify it without having to pay licence fees. The attack on software patents comes at a time when IBM has made 500 of its patents freely available. Other companies are expected to follow suit.\n\nThere are between 150,000 and 300,000 registered software patents in the US and open source developers argue that many should never have been granted. This is a view corroborated by the UK Patent Office. \"Some of the patents have dubious validity and are being wielded by some big companies to force smaller companies to buy licenses in the knowledge that they can't afford to take them to court,\" said Dr Jeremy Philpott of the UK Patent Office. Mr Kapor is reported as saying that Microsoft would issue a series of patent lawsuits in the future. \"If totally pushed to the wall - because their business model no longer holds up in an era in which open source is an economically superior way to produce software...of course they're going to unleash the WMDs,\" Mr Kapor is quoted as saying.\n\nMicrosoft did not want to comment directly, referring the issue instead to trade body Intellect, of which it is a member. \"As far as Intellect is concerned, open source and patents have co-existed for many years without problems,\" said spokeswoman Jill Sutherland. \"The industry respects the open source movement and in fact many of the members we represent use the open source system to develop software.\"\n\nThe important point to make is that companies should be able to choose between patents, copyrights and open source as to the treatment of their intellectual discoveries, and not be forced into using one or the other. Mr Torvalds said Microsoft could use patent lawsuits in the future, but this was a hypothetical scenario. The war of words between Microsoft and the open source movement has been escalating over the past few weeks, with both sides accusing each other of unfair business practices.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Microsoft trying to fight back against open-source movement. Let me read through it carefully.\n\nThe main points are that Microsoft is attacking Linux because Linus Torvalds is challenging their patents. There's a panel discussion where Torvalds said software patents are a problem for the open source community, warning that Microsoft could sue companies if they use patents. The US has many software patents but argue that most shouldn't have been granted. Some companies like IBM are free to make patents. Others expect follow-up from IBM and other companies.\n\nDr Jeremy Philpott from the UK said some patents are invalid because big companies use them for no-cost reasons. Panelists worry Microsoft will issue patent lawsuits in the future. Microsoft didn't comment, but went to Intellect which respects open source. They want companies to choose between patents, copyrights, and open source rights.\n\nI need to make sure I capture all these key points: the attack by Torvalds on patents, the comparison with IBM, the lack of patent grants in US, Philpott's warning about big companies using patents, and the discussion on future lawsuits from Microsoft. Also, mention that many companies are free to choose options.\n</think>\n\nThe open-source community is being challenged by Microsoft over software patents led by Linus Torvalds at a panel discussion in California. Dr. Mitchell Kapor warns Microsoft could sue companies for patent disputes using legal action. The US has several software patents but argues they should not have been granted, while others expect free patents from IBM and other companies. Some companies, including IBM, expect future patent lawsuits. The UK's Patent Office warns some patents are invalid due to big companies' use without court action. Panelists emphasize that Microsoft faces future patent lawsuits and call for a software development system based on open-source principles.", "tinyllama:1.1b": "Leaders of the open sources movement have slammed software patents, warning that Microsoft could use them in future lawsuits against other tech giants like their Windows rival. In a panel discussion at a Linux summit in California, Linus Torvalds criticized software patents, likening them to \"theft\". He also warned that Microsoft could exploit such lawsuits, urging open sources developers to \"leave the open sources for those who want to use them and join us in the community.\" This comes at a time when IBM has made 500 patents freely available, with the software community calling for more similar moves. Meanwhile, trade body Intellect disputed claims that open sources and patents have \"co-existed\" for years, stating that such issues are not an issue for the industry.", "tinydolphin:1.1b": " The war of words between Microsoft and the open source movement heated up this week with Linus Torvalds leading an attack on software patents at a Linux summit in California. In a panel discussion, Torvalds accused Microsoft of using patent lawsuits to intimidate developers. He also warned that Microsoft could potentially use patents to restrict access to open source software. The issue of software patents is not new, but the situation has grown more intense recently as open source advocates and companies like Mozilla are voicing their concerns about the potential damage patent lawsuits can cause to the community.", "phi:2.7b": " Microsoft's founder Linus Torvalds criticized software patents, saying they are a problem for the open-source movement. Panelists at a Linux summit in California agreed that some software patents may never have been valid and expressed concern about potential patent lawsuits by big companies like Microsoft. Other technology companies, such as IBM, are expected to make their patents available for free as well. While there is no clear agreement on how software patents should be handled, the open-source community continues to grow and develop freely accessible alternatives to proprietary software.\n", "orca-mini:3b": " Open source leaders slammed patents this week as Linus Torvalds led an attack on software patents. Microsoft could use patent lawsuits in the future, according to some panel members. The UK Patent Office worries about dubious validity of some patents being wielded by big companies to force smaller ones to buy licenses. Microsoft did not want to comment directly, referring the issue instead to Intellect, which it is a member.", "hermes3:3b": "Open source leaders criticize software patents, as Microsoft's Linus Torvalds & Mitchell Kapor argue patents harm open source movement.", "stablelm-zephyr:3b": "Open source leaders criticized software patents, with Linux founder Linus Torvalds stating that they are a problem for the open source movement. Mitchell Kapor warned that Microsoft could use patent lawsuits in the future. The attack comes as IBM makes 500 of its patents freely available and other companies are expected to follow suit. There are between 150,000 and 300,000 registered software patents in the US, and some have been deemed invalid by the UK Patent Office. Some panel members are concerned that Microsoft could launch a series of patent lawsuits if pushed too far. While Microsoft referred the issue to trade body Intellect, which respects open source, Kapor emphasized companies should be able to choose between patents, copyrights, and open source.", "stablelm2:1.6b": "Linus Torvalds criticized software patents in a panel discussion at a Linux summit, arguing they are a problem for the open source movement. Microsoft could potentially use patent lawsuits in the future as Linux is based on open source principles. IBM has made many of its patents freely available, and other companies likely will follow suit. Open source developers claim some granted patents have dubious validity. Some panel members worry about Microsoft issuing patent lawsuits to force smaller companies to buy licenses. Microsoft refers the issue to trade body Intellect, which represents that open source and patents can co-exist without problems.", "granite3.1-dense:2b": "Open source leaders, including Linux founder Linus Torvalds, criticized software patents at a recent summit in California. They argue that many patents have dubious validity and are being used to extort smaller companies into licensing agreements, which they cannot afford due to their economically superior open source model. This concern stems from the perceived threat of Microsoft potentially leveraging patent lawsuits against open source alternatives like Linux. IBM has already made 500 patents freely available, and other companies are expected to follow suit. Despite these concerns, Microsoft's trade body Intellect maintains that open source and patents have coexisted peacefully for years, and they support the option for companies to choose between patents, copyrights, and open source.", "chatgpt-4o-latest": "Open source leaders, including Linux founder Linus Torvalds and Mozilla Foundation chairman Mitchell Kapor, criticized software patents at a Linux summit in California, warning they pose a threat to open source development. Kapor suggested Microsoft might use patent lawsuits to defend its business model against open source competition. The debate comes as IBM has made 500 patents freely available, with other companies expected to follow. The UK Patent Office acknowledges that many software patents may be invalid and are used by large firms to pressure smaller companies. Microsoft declined to comment directly, but trade body Intellect stated that patents and open source have coexisted without issue and that companies should have the freedom to choose how to protect their intellectual property.", "reference": "In a panel discussion at a Linux summit in California Mr Torvalds said software patents were a problem for the open source movement.There are between 150,000 and 300,000 registered software patents in the US and open source developers argue that many should never have been granted.\"The industry respects the open source movement and in fact many of the members we represent use the open source system to develop software,\" \"We think the important point to make is that companies should be able to choose between patents, copyrights and open source as to the treatment of their intellectual discoveries, and not be forced into using one or the other,\" she added.\"As far as Intellect is concerned, open source and patents have co-existed for many years without problems,\" said spokeswoman Jill Sutherland.The war of words between Microsoft and the open source movement heated up this week as Linux founder Linus Torvalds led an attack on software patents.Some panel members are worried that Microsoft would issue a series of patent lawsuits in the future."}