{"raw_text": "Reboot ordered for EU patent law\n \n A European Parliament committee has ordered a rewrite of the proposals for controversial new European Union rules which govern computer-based inventions.\n \n The Legal Affairs Committee (JURI) said the Commission should re-submit the Computer Implemented Inventions Directive after MEPs failed to back it. It has had vocal critics who say it could favour large over small firms and impact open-source software innovation. Supporters say it would let firms protect their inventions. The directive is intended to offer patent protection to inventions that use software to achieve their effect, in other words, \"computer implemented invention\". The draft law suffered setbacks when Poland, one of the largest EU member states, rejected its adoption twice in two months. Intense lobbying on the issue has started to gain momentum in some national parliaments putting them under immense pressure. Only two MEPs backed the draft law at the JURI meeting, with one voting to abstain.\n \n Opponents of the draft directive welcomed the decision and said a new first reading of the proposals would give the EU a chance to have fuller debates about its implications in all member states. In the US, the patenting of computer programs and internet business methods is permitted. This means that the US-based Amazon.com holds a patent for its \"one-click shopping\" service, for example. Critics are concerned that the directive could lead to a similar model happening in Europe. This, they fear, could hurt small software developers because they do not have the legal and financial might of larger companies if they had to fight patent legal action in court. Supporters say current laws are inefficient and it would serve to even up a playing field without bringing EU laws in line with the US.\n", "llama3.2:1b": "A European Parliament committee ordered the Commission to re-submit proposals for computer-based inventions law due to MEPs' failure to back them. The directive aims to protect software-implemented inventions, but critics say it could favor large firms and harm small open-source software developers.", "llama3.2:3b": "European Parliament committee orders rewrite of proposed computer-based invention rules after MEPs failed to back them, citing concerns that they could favor large firms over small developers and impact open-source software innovation.", "gemma2:2b": "The European Parliament's Legal Affairs Committee has ordered a revision of proposed EU rules regarding computer-based inventions after failing to gain enough support for their initial adoption.  This new directive aims to offer patent protection to inventions using software, but opponents raise concerns about its potential impact on small businesses and open-source software innovation. \n", "qwen2.5:0.5b": "A European Parliament committee ordered a rewrite of EU computer-based inventions rules, which aim to protect software patents. MEPs failed to support the directive, leading to intense lobbying from national parliaments, including Poland, urging EU countries to adopt it. The draft law was rejected by two MEPs and has yet to be fully debated in all EU member states. The UK is an exception with a similar policy allowing Amazon's \"one-click shopping\" service to claim patents for its online services. Supporters argue it would increase the effectiveness of EU laws, while opponents fear a potential equalization of patent protections between EU members and US companies.", "qwen2.5:1.5b": "A European Parliament committee has ordered a rewrite of controversial new EU rules governing computer-based inventions, following MEPs' failure to back them. The directive aims to offer patent protection for software-based innovations but faces criticism due to potential favoritism towards large firms and impact on open-source software innovation.", "qwen2.5:3b": "A European Parliament committee has ordered revisions to proposals for new EU rules on computer-based inventions, which critics argue could favor large over small firms and impact open-source software innovation. The directive aims to provide patent protection for inventions that use software but faced setbacks due to Poland's rejection twice in two months. Opponents welcome the decision as a chance for broader debates across all member states about its implications, while supporters believe current laws are inefficient and aim to level the playing field without aligning EU regulations with US practices.", "opencoder:1.5b": "A European Parliament committee has ordered a rewrite of the proposals for new European Union rules governing computer-based inventions. The proposed new rules will protect inventions that use software to achieve their effect, hence it is \"computer implemented invention\". The directive intends to offer patent protection to these inventions and was rejected by Poland in two months due to intense lobbying. Despite critics arguing that it could favour large firms, the support of MEPs backed the decision, with one voting to abstain.\n", "smollm:1.7b": "The European Parliament committee has ordered a rewrite of the proposals for controversial new European Union rules that govern computer-based inventions. The draft law suffered setbacks when Poland, one of the largest EU member states, rejected its adoption twice in two months. Intense lobbying on the issue has started to gain momentum in some national parliaments putting them under immense pressure. Only two MEPs backed the draft law at the JURI meeting, with one voting to abstain. Opponents of the draft directive welcomed the decision and said a new first reading of the proposals would give the EU a chance to have fuller debates about its implications in all member states. In the US, the patenting of computer programs and internet business methods is permitted. This means that the US-based Amazon.com holds a patent for its \"one-click shopping\" service, for example. Critics are concerned that the directive could lead to a similar model happening in Europe. This, they fear, would hurt small software developers because they do not have the legal and financial might of larger companies if they had to fight patent legal action in court. Supporters say current laws are inefficient and it would serve to even up a playing field without bringing EU laws in line with the US.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about the EU's Computer Implemented Inventions Directive being rewritten based on what I've read. Let me break it down.\n\nFirst, it mentions that a European Parliament committee ordered them to rewrite proposals for new EU rules on computer-based inventions. The law is called the Computer Implemented Inventions Directive (CID).\n\nThen, there are two main groups: the Legal Affairs Committee (JURI) and the Legal and Administrative Services (LASS). JURI said the Commission should re-submit the CID after the MEPs failed to back it, which was a problem because critics say it might favor large companies over small ones and could hurt open-source software. Supporters argue it would allow firms to protect their inventions.\n\nThe draft law had some issues with Poland rejecting it twice in two months. That's intense lobbying happening in other member states too. Only two MEPs supported it at the JURI meeting, one abstaining.\n\nOpponents welcomed a new reading of the proposals so EU can discuss it better. The US allows patenting for computer programs and internet methods, like Amazon.com's \"one-click shopping.\" Some worry this could make small software developers lose their legal standing compared to big companies in Europe if they had to defend their patents in court.\n\nSupporters say current laws are inefficient and a rewrite would even out the market without aligning with US standards. They want the EU to be fairer, more open-ended so it doesn't mirror the US.\n\nPutting this all together, I need a concise summary that captures the main points: the directive's background, both sides' concerns, key issues like Poland rejection and potential impact on SMEs, and the implications of reform.\n</think>\n\nThe European Parliament has ordered a rewrite of proposals for the Computer Implemented Inventions Directive (CID), intended to offer patent protection for software-based inventions. Critics argue it could favor large companies over small ones and may harm open-source software innovation. Supporters claim it would enable firms to protect their inventions. Poland rejected it twice in two months, with intense lobbying efforts across member states. Only two MEPs supported the draft law at a JURI meeting, one abstaining. Opponents welcomed a new reading of proposals to shape EU debates, while critics fear this could harm small software developers compared to larger companies in Europe.", "tinyllama:1.1b": "The European Parliament has ordered a rewrite of the proposal for new EU rules governing computer-based inventions, after MEPs failed to support the Commission's proposals twice in two months. Poland had voted to reject adopting the directive, but the directive is expected to now be re-submitted by the Commission, which hopes to get a second chance at gaining EU member state backing. Critics of the proposal worry that it would favor large firms and potentially harm small software developers who rely on patents to protect their inventions. Supporters argue that the directive is necessary to provide legal protection for inventors, while also ensuring fair competition in a digitized marketplace. The draft law has faced strong opposition from countries such as Poland, which rejected its first reading twice in two months.", "tinydolphin:1.1b": " A European Parliament committee has ordered a rewrite of proposals for controversial new European Union rules that govern computer-based inventions, following vocal criticism from some members who fear they may favor large over small firms and impact open-source software innovation. This is due to the proposal to allow firms to protect their inventions using computer software. Critics argue that this could infringe upon smaller companies and lead to increased patent litigation, ultimately reducing innovation in Europe's tech sector.", "phi:2.7b": " The European Parliament committee has ordered the Commission to re-submit the Computer Implemented Inventions Directive, which has been criticized for favoring large over small firms and impacting open-source software innovation. The directive allows patent protection to inventions that use software to achieve their effect. Opponents of the draft law welcome the decision, saying a new first reading would give full debates about its implications in all member states.\n", "orca-mini:3b": " The European Parliament's Legal Affairs Committee has ordered a rewrite of the Computer Implemented Inventions Directive, which proposed new rules for computer-based inventions in the European Union. MEPs criticized the proposal, saying it could favor large firms over small ones and limit innovation in open-source software. However, supporters say it would offer patent protection to inventions that use software to achieve their effect. The directive faces opposition from some national parliaments due to intense lobbying on the issue. Only two MEPs backed the draft law at a committee meeting, with one voting to abstain.", "hermes3:3b": "EU Patent Law Committee orders rewrite of Computer Implemented Inventions Directive due to opposition, lack of support from MEPs.", "stablelm-zephyr:3b": "The European Parliament's Legal Affairs Committee (JURI) has ordered a rewrite of the proposals for the Computer Implemented Inventions Directive, due to MEPs failing to back it. The directive was faced rejection twice by Poland and is seen as favouring large over small firms and impacting open-source software innovation. The draft law suffered setbacks when Poland rejected its adoption twice in two months. Critics are concerned that the directive could lead to a similar model happening in Europe, hurting small software developers because they do not have the legal and financial might of larger companies if they had to fight patent legal action in court. Supporters say current laws are inefficient and it would serve to even up a playing field without bringing EU laws in line with the US.", "stablelm2:1.6b": "A European Parliament committee has ordered a rewrite for the Computer Implemented Inventions Directive, after MEPs failed to back the original proposals. The directive aims to provide patent protection for computer-based inventions using software. It faced opposition from Poland and intense lobbying in some national parliaments, leading to concerns it could favor large companies over small ones. Supporters argue that current laws are inefficient and the new law would even out a playing field without aligning with US laws.", "granite3.1-dense:2b": "The European Parliament's Legal Affairs Committee (JURI) has instructed the Commission to reconsider and revise the Computer Implemented Inventions Directive, which aims to grant patent protection for software-based inventions. This decision stems from widespread criticism that the directive favors large firms over small ones and may negatively impact open-source software development. Opponents argue it could disadvantage small software developers due to potential expensive legal battles against larger companies with patent claims. Conversely, supporters believe current EU laws are ineffective and the directive would level the playing field without altering EU patent laws beyond US standards. The directive faced setbacks in Poland and lacked backing from most MEPs during a JURI meeting. Critics fear it could mimic the US system, potentially harming small developers, while proponents argue it would enhance efficiency by providing equal patent protection.", "chatgpt-4o-latest": "The European Parliament's Legal Affairs Committee (JURI) has ordered a rewrite of the proposed EU Computer Implemented Inventions Directive after failing to gain sufficient support. Critics argue it could favor large firms and harm open-source innovation, while supporters claim it would help protect inventions. The directive, which aims to patent software-based inventions, faced setbacks, including rejection by Poland. Intense lobbying has pressured national parliaments, and only two MEPs backed the draft law. Opponents welcomed the decision, hoping for broader debate. Concerns exist that the directive could lead to a US-style patent system, disadvantaging small developers, while supporters argue it would improve inefficiencies without fully aligning with US laws.", "reference": "The Legal Affairs Committee (JURI) said the Commission should re-submit the Computer Implemented Inventions Directive after MEPs failed to back it.Opponents of the draft directive welcomed the decision and said a new first reading of the proposals would give the EU a chance to have fuller debates about its implications in all member states.Supporters say current laws are inefficient and it would serve to even up a playing field without bringing EU laws in line with the US.It has had vocal critics who say it could favour large over small firms and impact open-source software innovation.The directive is intended to offer patent protection to inventions that use software to achieve their effect, in other words, \"computer implemented invention\".Supporters say it would let firms protect their inventions."}