{"raw_text": "Solutions to net security fears\n \n Fake bank e-mails, or phishing, and stories about ID theft are damaging the potential of using the net for online commerce, say e-business experts.\n \n Trust in online security is falling as a result. Almost 70% of those asked in a poll said that net firms are not doing enough to protect people. The survey of more than 1,000 people reported that 43% were not willing to hand over personal information online. It is worrying for shopaholics and firms who want to exploit the net. More people are becoming aware of online security issues but they have little confidence that companies are doing enough to counter the threats, said security firm RSA, which carried out the poll. An estimated 12 million Britons now use the net as a way of managing their financial affairs. Security experts say that scare stories and the vulnerabilities dogging e-commerce and e-banking are being taken seriously - by banks in particular.\n \n \"I don't think the threat is overplayed,\" Barry Beal, global security manager for Capgemini, told the BBC News website. He added: \"The challenge for banks is to provide the customer with something that improves security but balances that with usability.\" Ensuring extra security measures are in place protects them too, as well as the individual, and it is up to both parties to make sure they do what is necessary to prevent fraud, he said. \"Card issuers will keep us informed of types of attacks and what procedure to take to protect ourselves. If we do that, they will indemnify us,\" he said. Many believe using login details like usernames and passwords are simply not good enough anymore though. One of the biggest challenges to improving security online is how to authenticate an individual's identity. Several security companies have developed methods which complement or replace passwords, which are easily compromised and easy to forget. Last year, a street survey found that more than 70% of people would reveal their password for a bar of chocolate.\n \n On average, people have to remember four different passwords. Some resort to using the same one for all their online accounts. Those who use several passwords often write them down and hide them in a desk or in a document on their computer. In a separate survey by RSA, 80% said they were fed up with passwords and would like a better way to login to work computer systems. For many, the ideal is a single online identity that can be validated once with a series of passwords and questions, or some biometric measurement like a fingerprint or iris scan with a token like a smartcard.\n \n Activcard is just one of the many companies, like RSA Security, which has been trying to come up with just that. RSA has a deal with internet provider AOL that lets people pay monthly for a one-time passcode generation service. Users get a physical token which automatically generates a code which stays active for 60 seconds. Many companies use a token-based method already for employees to access networks securely already. Activcard's method is more complex. It is currently trailing its one-time passcode generation technology with UK banks. Steve Ash, from Activcard, told the BBC News website there are two parts to the process of identification. The most difficult is to ascertain whether an individual is who they say they are when they are online.\n \n \"The end solution is to provide a method where you combine something the user knows with something they have and present those both.\" The method it has developed makes use of the chip embedded in bank cards and a special card reader which can generate unique codes that are active for a specified amount of time. This can be adjusted at any time and can be active for as little as 30 seconds before it changes. It combines that with usual usernames and passwords, as well as other security questions. \"You take the card, put it in the reader, enter your pin number, and a code is given. \"If you wanted then to transfer funds, for instance, you would have to have the code to authorise the transaction.\" The clever bit happens back at the bank's secure servers. The code is validated by the bank's systems, matching the information they expect with the customer's unique key. \"Each individual gets a key which is unique to them. It is a 2048-bit long number that is virtually impossible to crack,\" said Mr Ash. It means that in a typical security attack, explains Mr Ash, even if password information is captured by a scammer using keystroke software or just through spoof websites, they need the passcode. \"By the time they go back [to use the information], the code has expired, so they can't prove who they are,\" according to Mr Ash. In the next few years, Mr Ash predicts that this kind of method will be commonplace before we see biometric authentication that is acceptable for widespread use. \"PCs will have readers built into them, the cost of readers will be very cheap, and more people will have the cards.\" The gadgets we carry around, like personal digital assistants (PDAs) and mobiles, could also have integrated card reader technology in them. \"The PDA or phone method is a possible alternative as people are always carrying phones around,\" he said.\n", "llama3.2:1b": "Solutions to net security fears include fake bank e-mails and stories about ID theft, with many people not willing to hand over personal information online. \nSecurity experts say banks are taking the threats seriously, including improving login processes and providing customers with better security measures.\nThey suggest methods such as using passwords or biometric authentication, but not relying solely on them for identification.\nA company called Activcard has developed a method that combines something a user knows (username) with something they have (chip embedded in bank cards), which can be used to authenticate an individual's identity.", "llama3.2:3b": "People are losing trust in online security due to phishing attacks and identity theft concerns, with 70% of respondents saying net firms aren't doing enough to protect them. Many believe passwords are not secure anymore, with 80% wanting a better way to login. Companies like Activcard are developing methods to authenticate individuals using unique codes generated by physical tokens, which combine something the user knows (e.g., PIN) with something they have (e.g., bank card). This method is being tested with UK banks and could become commonplace in the next few years, potentially replacing biometric authentication.", "gemma2:2b": "Online security fears hinder online commerce. Despite concerns about phishing and ID theft, many people lack trust in companies' security efforts.  New authentication methods are being developed to improve security and address password vulnerabilities. These include token-based systems that combine knowledge and possession for verification. One such method utilizes unique codes generated by embedded chip technology, offering a strong defense against attacks. The focus is shifting towards more convenient single online identities with secure authentication methods like biometric measurements. This approach aims to simplify user access while providing robust security measures in the future.  \n", "qwen2.5:0.5b": "e-business experts worry that online banks are not doing enough to protect customers from phishing scams and ID theft. Many shops have become aware of these problems but do not feel confident enough in their own security measures. Security companies like RSA offer solutions, while Activcard has developed a technology to combine something the user knows with something they have.", "qwen2.5:1.5b": "Security fears over online commerce threaten to dampen net use, with 70% of respondents stating companies aren't doing enough and 43% unwilling to share personal info due to fear. Security experts urge improvements in authentication methods like passwords, smartcards, and biometrics, noting that criminals are likely to target banks for vulnerabilities while ensuring user protection measures balance security with ease of use.", "qwen2.5:3b": "Solutions to net security fears\n\nPhishing attacks and concerns over ID theft hinder online commerce; almost 70% of surveyed individuals believe companies aren't doing enough to protect users, with only 43% willing to share personal information online. RSA's survey highlighted the challenge banks face in improving security without compromising usability.\n\nBarry Beale from Capgemini advises that providing an improved security system balanced with ease-of-use is crucial, as well as informing customers about potential threats and procedures for protection. Despite this, many rely on passwords, which are easy to compromise, leading to a search for better authentication methods like biometrics or token-based systems.\n\nActivcard's method involves using bank card chips and special readers that generate unique codes valid for specific durations. This approach combines knowledge (usernames/passwords) with possession (bank cards), making it harder for unauthorized access. The system also relies on banks validating the code, which is virtually uncrackable even if passwords are compromised.", "opencoder:1.5b": "Solutions to net security fears involve making sure that online transactions are secure for both the customers and businesses. This includes implementing extra security measures such as using strong, unique passwords, preventing phishing attacks by verifying the legitimacy of the website or email being accessed, ensuring two-factor authentication, using SSL encryption for data transmission, and keeping software up to date. Furthermore, companies can also use unique, token-based methods where a physical token or smartcard is used to generate secure passcodes that are active for a specified amount of time.\n", "smollm:1.7b": "To summarize the text concisely:\n\n1. Summarize the main ideas of the text: The article discusses the negative impact of fake bank emails and phishing on online security, highlighting the lack of trust in online transactions among consumers. It also mentions the importance of providing a secure login method for online banking and e-commerce.\n2. Identify key points: The text highlights the need for better security measures to protect individuals' personal information when using online services. It emphasizes the importance of biometric authentication, such as fingerprint or iris scanning, in future security methods.\n3. Provide an objective summary: The article provides a balanced view of the issue, highlighting both the negative impact of fake bank emails and phishing on online security and the need for better security measures to protect individuals' personal information. It also mentions the importance of biometric authentication as a potential solution to improve security in the future.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about net security fears and how they're being addressed by some companies. The user provided the original text and an example of what it should look like, which is three concise paragraphs. \n\nFirst, I'll read through the original text carefully. It starts by talking about fake emails and phishing, along with ID theft issues affecting online commerce and e-banking. It mentions a poll where 70% said net firms aren't doing enough to protect people, citing RSA's findings. The UK has over 1 million net users managing financial affairs.\n\nThen it discusses the need for better security measures in banks by companies like Capgemini, noting that they need to balance security with usability and ensure extra measures are in place too. It talks about authentication methods—people using passwords is criticized, but companies are suggesting alternatives like biometrics, tokens, etc. Activcard, for example, uses a one-time code service.\n\nThe conclusion mentions that this method is getting better with technology, especially card readers on chips, making it cheaper and more widespread than expected. It also suggests PDAs or mobile phones could be used as alternatives.\n\nNow, I need to make sure the summary captures all these key points succinctly without adding extra details. I should avoid explanations, just keep the text clean.\n\nLet me structure this into three parts:\n\n1. The growing fears about net security threats and their impact on online business.\n2. The response from companies like RSA Security, including challenges with passwords and solutions like biometric methods or tokens.\n3. The current progress towards adopting these solutions, especially with card readers and integrated technology.\n\nI need to ensure each part is short and captures the main idea without getting too detailed. Also, avoid using any formatting or explanations as per the user's instruction.\n\nLet me check if I missed any important details. The text mentions things like 12 million British net users, concerns about fraud prevention, solutions from companies like RSA, the use of biometric identifiers in security tokens, and Activcard's specific solution with one-time codes.\n\nI think that covers all the main points. Now, I'll paraphrase each section into a few sentences.\n</think>\n\nThe growing concern over internet security threatens businesses and consumers alike, as evidenced by 70% of net firms reporting they aren't doing enough to protect people online. Companies like RSA Security highlighted that while 43% of participants in a poll expressed reluctance to share personal info online, their survey found 43% unwilling to give up privacy. The financial landscape alone uses over 1 million net users managing personal finances.\n\nTo address these challenges, companies are pushing for better security solutions beyond traditional methods. While passwords remain the most common approach, they're criticized for being weak and prone to compromise. However, advancements in authentication methods, such as biometric identifiers like fingerprint or iris scans, combined with tokens like smartcards, offer alternatives that require fewer resources. Activcard's one-time code service is notable for combining card readers with usernames and passwords, making it accessible yet secure.\n\nThe industry is moving toward more integrated security systems, particularly through card reader technology on chips. This approach aims to reduce costs and enhance user experience while providing robust security. While this method isn't widespread yet, the trend suggests closer integration of biometrics with traditional security practices. As technology evolves, companies are investing in these innovations to ensure secure connectivity across digital landscapes.", "tinyllama:1.1b": "The following is a summary of key ideas and details from the given text:\n\nFake bank e-mails, or phishing, and stories about ID theft are damaging the potential of using the net for online commerce. Trust in online security is falling as a result, but there are more people becoming aware of online security issues and scarce stories and vulnerabilities dogging e-commercce and e-banking. Security experts suggest that extra security measures are necessary to protect users and companies from fraud, and this includes the use of password-protected login credentials and biometric authentication methods. ActivCard, a company specializing in identity validation through a one-time passcode generation method, is currently testing token-based methods with UK banks. This unique combination of methods provides a secure way to authenticate individuals using their unique personal identities, including chip-embedded bank cards, card readers, and PDAs/cell phones. With the increased use of mobile devices, there may be an alternative method for carrying out transactions such as having readers built into them or PDAs integrated with a card reader.", "tinydolphin:1.1b": " Summarizing the text: The current security issue for online transactions is not only due to scam stories but also from companies' inability to provide proper security measures. Many people now use the internet for managing their financial affairs, and they have little confidence that companies are doing enough to counter potential threats. A solution is being developed by a company called ActivCard, which combines a unique code generated using a bank card with a person's known information like username and password to authenticate themselves when accessing secure online resources. This method could become commonplace before we see even more advanced biometric authentication methods like smartcards or voice recognition that are preferred for widespread use by users.", "phi:2.7b": " AI's summary of text with key ideas and details: Solutions to net security fears include fake bank e-mails, phishing, and ID theft damaging online commerce. Trust in online security is decreasing due to companies not doing enough to protect individuals. More than 70% of respondents in a poll reported that they are not willing to hand over personal information online. Banks in particular have responded by providing extra security measures to protect both themselves and their customers from fraud. Passwords may no longer be adequate, and several companies are developing methods like biometric authentication or token-based systems. Activcard is currently testing its one-time passcode generation technology with UK banks which combines something the user knows with something they have. The end solution will involve combining this method with additional security questions to validate an individual's identity online.\n", "orca-mini:3b": " Summary: \nFake bank e-mails and ID theft are damaging the potential of using the net for online commerce, say e-business experts. Trust in online security is falling as a result. Only 70% of those asked in a poll said that net firms are doing enough to protect people. The survey of more than 1,000 people reported that only 43% were willing to hand over personal information online. It is worrying for shopaholics and firms who want to exploit the net. More people are becoming aware of online security issues but they have little confidence in companies' ability to counter the threats. Security experts say that online identity protection is needed, and a single online identity that can be validated once with a series of passwords and questions or biometric measurement like a fingerprint or iris scan with a token like a smartcard is being tried out. Activcard is one such company that has developed a method which combines something the user knows with something they have and something they have and present those both. It can be adjusted for a specific amount of time and can be active for as little as 30 seconds before it changes. This method is being tested with UK banks and is expected to become commonplace in the future.", "hermes3:3b": "Online security concerns reduce net commerce potential, according to e-business experts. Surveys show people lack confidence that companies counter online threats and 70% believe net firms aren't doing enough for security. Proposed solutions include biometric measurements like fingerprint scans or iris scans combined with a one-time passcode generated by tokens, such as bank cards embedded with unique codes active for short periods.", "stablelm-zephyr:3b": "E-business experts say that fake bank emails (phishing) and ID theft stories are damaging the potential of using the internet for online commerce, leading to a decline in trust in online security. Security firm RSA carried out a poll of over 1,000 people, discovering that 43% were not willing to share personal information online. This lack of confidence is concerning for shopaholics and companies wanting to exploit the internet. Security experts emphasize that extra measures should be put in place to protect users while maintaining usability.\n\nA major challenge in improving online security is authenticating an individual's identity. RSA conducted a survey where 80% of respondents expressed their frustration with passwords and wanted a better way to log into work computer systems. Many people would like a single online identity that can be validated using a series of passwords or biometric measurements like fingerprints or iris scans, alongside a token like a smartcard. Companies such as Activcard are working on similar technology to provide an additional layer of security for online transactions.\n\nSteve Ash from Activcard explains their one-time passcode generation system. Users use a special card reader to input their PIN and receive a unique code that is active for a specified time. The code is then validated by the bank's secure servers, making it virtually impossible for scammers to prove who they are despite having captured password information. In the next few years, Mr. Ash predicts biometric authentication will become commonplace before integrated card reader technology is widespread in devices like personal digital assistants (PDAs) and mobiles.", "stablelm2:1.6b": "E-business experts warn that phishing emails and ID theft concerns are damaging online commerce potential. Falling trust in online security has led to 10% of those surveyed not handing over personal information online. More than 1 million Britons use the net for financial affairs. Security firm RSA found that banks need to provide an enhanced security balance between usability and extra security measures, with biometric authentication methods like fingerprint or iris scans emerging as possible alternatives.", "granite3.1-dense:2b": "Trust in online security is waning due to increasing concerns over fake bank emails (phishing) and identity theft, according to e-business experts. A poll of 1,000 Britons revealed that nearly 70% feel businesses aren't doing enough to safeguard personal information, with 43% refusing to share data online. This is problematic for both consumers and companies involved in online commerce. Security firm RSA highlights this issue, noting that around 12 million Britons manage their finances digitally.\n\nBarry Beal, global security manager at Capgemini, emphasizes that the threat isn't overstated but warns of the challenge for banks to balance enhanced security with usability. To improve security without compromising user experience, card issuers will inform customers about attacks and recommended protection methods, indemnifying individuals if they follow these steps.\n\nUsers find traditional login credentials like usernames and passwords insufficient, as they're easily compromised and forgettable. The primary challenge lies in robust identity verification. Several companies have developed alternative authentication methods that complement or replace passwords. These include token-based systems using physical devices generating one-time codes for a specified time frame or biometric measurements like fingerprints or iris scans with smartcards.\n\nActivcard, among other security firms, is working on an ideal solution: a single online identity validated through a combination of something the user knows (like a PIN), something they have (a unique chip in bank cards and special card readers), and biometric data. The process involves inputting a PIN into a reader attached to the bank card, which generates a time-limited code for transactions. This code is then verified on the bank's secure servers by matching it with the user's unique key.\n\nSteve Ash from Activcard explains that the solution combines something users know (PIN) and something they have (bank card chip), making it nearly impossible for unauthorized individuals to use captured password information. In the future, this method will likely be commonplace before biometric authentication becomes widespread. He predicts that readers could be built into personal digital assistants (PDAs), mobile phones, and even laptops, providing an integrated solution to address users' concerns about online security.", "chatgpt-4o-latest": "Phishing and identity theft concerns are undermining trust in online commerce, with nearly 70% of surveyed individuals believing companies are not doing enough to protect users. Many people are reluctant to share personal information online, despite the growing use of the internet for financial management. Security experts acknowledge the seriousness of these threats, and banks are working to balance security with usability. Traditional login methods, such as passwords, are increasingly seen as inadequate, with many users frustrated by the need to remember multiple credentials. \n\nTo address these issues, security firms are developing alternative authentication methods, such as one-time passcodes and biometric verification. Companies like RSA and Activcard are testing solutions that combine something the user knows (e.g., a PIN) with something they have (e.g., a smartcard or token). Activcard's system uses bank card chips and card readers to generate unique, time-sensitive codes, making it difficult for scammers to exploit stolen credentials. Experts predict that such methods will become widespread before biometric authentication gains mainstream acceptance, with future devices integrating card reader technology for enhanced security.", "reference": "More people are becoming aware of online security issues but they have little confidence that companies are doing enough to counter the threats, said security firm RSA, which carried out the poll.The method it has developed makes use of the chip embedded in bank cards and a special card reader which can generate unique codes that are active for a specified amount of time.Activcard is just one of the many companies, like RSA Security, which has been trying to come up with just that.Almost 70% of those asked in a poll said that net firms are not doing enough to protect people.\"By the time they go back [to use the information], the code has expired, so they can't prove who they are,\" according to Mr Ash.Trust in online security is falling as a result.It means that in a typical security attack, explains Mr Ash, even if password information is captured by a scammer using keystroke software or just through spoof websites, they need the passcode.In a separate survey by RSA, 80% said they were fed up with passwords and would like a better way to login to work computer systems.One of the biggest challenges to improving security online is how to authenticate an individual's identity.The survey of more than 1,000 people reported that 43% were not willing to hand over personal information online.Several security companies have developed methods which complement or replace passwords, which are easily compromised and easy to forget.For many, the ideal is a single online identity that can be validated once with a series of passwords and questions, or some biometric measurement like a fingerprint or iris scan with a token like a smartcard.\"The PDA or phone method is a possible alternative as people are always carrying phones around,\" he said.It combines that with usual usernames and passwords, as well as other security questions.Ensuring extra security measures are in place protects them too, as well as the individual, and it is up to both parties to make sure they do what is necessary to prevent fraud, he said.The code is validated by the bank's systems, matching the information they expect with the customer's unique key.He added: \"The challenge for banks is to provide the customer with something that improves security but balances that with usability.\"It is a 2048-bit long number that is virtually impossible to crack,\" said Mr Ash.\"You take the card, put it in the reader, enter your pin number, and a code is given."}