{"raw_text": "Microsoft seeking spyware trojan\n \n Microsoft is investigating a trojan program that attempts to switch off the firm's anti-spyware software.\n \n The spyware tool was only released by Microsoft in the last few weeks and has been downloaded by six million people. Stephen Toulouse, a security manager at Microsoft, said the malicious program was called Bankash-A Trojan and was being sent as an e-mail attachment. Microsoft said it did not believe the program was widespread and recommended users to use an anti-virus program. The program attempts to disable or delete Microsoft's anti-spyware tool and suppress warning messages given to users.\n \n It may also try to steal online banking passwords or other personal information by tracking users' keystrokes.\n \n Microsoft said in a statement it is investigating what it called a criminal attack on its software. Earlier this week, Microsoft said it would buy anti-virus software maker Sybari Software to improve its security in its Windows and e-mail software. Microsoft has said it plans to offer its own paid-for anti-virus software but it has not yet set a date for its release. The anti-spyware program being targeted is currently only in beta form and aims to help users find and remove spyware - programs which monitor internet use, causes advert pop-ups and slow a PC's performance.\n", "llama3.2:1b": "Microsoft is investigating a trojan program called Bankash-A Trojan that attempts to switch off the firm's anti-spyware software. The malicious program was released by Microsoft in recent weeks and has been downloaded by six million people, including 1 million who have used an e-mail attachment to download it.", "llama3.2:3b": "Microsoft investigating Trojan program called Bankash-A that attempts to disable anti-spyware software and steal online banking passwords, downloaded by 6 million people via email attachment.", "gemma2:2b": "Microsoft is investigating a trojan called Bankash-A Trojan that disables its anti-spyware software, steals passwords, and suppresses warnings. The malicious program was distributed through email attachments and has been downloaded by six million people. Microsoft recommends users use anti-virus programs until their own anti-spyware tool, currently in beta testing, is released. \n", "qwen2.5:0.5b": "Microsoft investigating a trojan that disables anti-spyware software. The program attempts to disable or delete Microsoft's anti-spyware tool. Possible attacks include stealing passwords or tracking keystrokes. Microsoft is considering buying Sybari Software for improved security in Windows and e-mail software. The targeted software is beta version, aimed at users finding spyware programs.", "qwen2.5:1.5b": "Microsoft investigating Bankash-A Trojan spyware that attempts to disable Windows Defender and steal personal information; the program was released recently with six million downloads; it may also steal online banking passwords.", "qwen2.5:3b": "Microsoft investigating trojan called Bankash-A Trojan, initially released weeks ago and downloaded by six million users. It attempts to disable Microsoft’s anti-spyware software, steal online banking passwords, or other personal data, and track keystrokes. The company recommends using an antivirus program for protection; it's currently in beta form and aims to detect and remove spyware. Microsoft has previously planned to offer its own paid-for anti-virus software but hasn't set a release date yet.", "opencoder:1.5b": "Microsoft is investigating a trojan program that attempts to switch off Microsoft's anti-spyware software.\n\nThe spyware tool was released by Microsoft in the last few weeks and has been downloaded by six million people. Stephen Toulouse, a security manager at Microsoft, said the malicious program is called Bankash-A Trojan and it was being sent as an e-mail attachment. Microsoft said it did not believe the program was widespread and recommended users to use an anti-virus program. The program attempts to disable or delete Microsoft's anti-spyware tool and suppress warning messages given to users.\n\nIt may also try to steal online banking passwords or other personal information by tracking users' keystrokes. Microsoft has said it is investigating what it called a criminal attack on its software earlier this week.\n", "smollm:1.7b": "Microsoft is investigating a trojan program that attempts to switch off the firm's anti-spyware software. The malicious program was only released by Microsoft in the last few weeks and has been downloaded by six million people. Stephen Toulouse, a security manager at Microsoft, said the program was called Bankash-A Trojan and was being sent as an e-mail attachment. Microsoft did not believe the program was widespread and recommended users to use an anti-virus program. The program attempts to disable or delete Microsoft's anti-spyware tool and suppress warning messages given to users.\n\nMicrosoft said in a statement it is investigating what it called a criminal attack on its software. Earlier this week, Microsoft said it would buy anti-virus software maker Sybari Software to improve its security in its Windows and e-mail software. Microsoft has said it plans to offer its own paid-for anti-virus software but it has not yet set a date for its release. The anti-spyware program being targeted is currently only in beta form and aims to help users find and remove spyware - programs which monitor internet use, causes advert pop-ups and slow a PC's performance.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely while preserving the key ideas and details. Let me go through each paragraph one by one.\n\nThe first sentence mentions Microsoft is looking for a spyware trojan. Then, it describes how the spyware tool was released in the past few weeks but has been downloaded by six million users. The user provided the name of the program as Bankash-A Trojan and mentioned Stephen Toulouse, a security manager at Microsoft. He suggested using an anti-virus program because the program can disable their anti-spyware software to suppress warnings.\n\nMicrosoft also stated that they don't believe the program is widespread and recommended users use another anti-virus tool. There's mention of the program attempting to delete Microsoft's anti-spyware tools or suppress warnings. It might also be used to steal passwords or personal info by tracking keystrokes on other systems.\n\nMicrosoft mentioned an investigation into a criminal attack on its software. Earlier this week, they said they would buy Sybari Software for improved security in Windows and e-mail. They plan to release their own anti-virus software but haven't set a release date yet. The target is the Bankash-A Trojan program, which can disable their anti-spyware tools or suppress warnings, possibly deleting them or causing performance issues.\n\nI need to condense all this into one concise paragraph without explanations or any formatting or reasoning. So, I'll start by mentioning Microsoft's investigation of a spyware tool called Bankash-A Trojan, which was downloaded by millions and contains malicious code. They don't believe the program is widespread but recommend using another anti-virus tool. The tool can disable their anti-spyware software to remove warnings. It might also steal personal info or cause issues on other systems. Microsoft plans to investigate and fix this with Sybari Software, possibly in beta form for a few weeks before release.\n\nI should make sure it's clear but concise, keeping all the key points from each section.\n</think>\n\nMicrosoft is investigating a malicious spyware program called Bankash-A Trojan, which has been downloaded by over six million users. The program contains malicious code and may attempt to disable Microsoft's anti-spyware software or suppress user warnings. Microsoft recommends using an alternative anti-virus tool for security. The bankish program could also steal personal information through keystroke tracking. Microsoft plans to investigate the issue, possibly using Sybari Software in a beta form for a few weeks before release.", "tinyllama:1.1b": "Microsoft has reportedly discovered a trojan that attempts to disable its anti-spyware program, Bankash-A, by stealing online banking passwords or other personal information. The spyware was only released in recent weeks and had been downloaded by over six million people worldwide as of the time this article was published. Stephen Toulouse, a Microsoft security manager, stated that the malicious program is called Bankash-A and aims to prevent users from using anti-spyware tool and suppress warning messages given to them. The Bankash-A Trojan may also try to steal online banking passwords or other personal information tracked by users' keystrokes, making it a criminal attack on Microsoft's software. Microsoft plans to offer its own paid-for anti-virus software but has not yet set a release date for the program in beta form. The company is currently investigating what it called a criminal attack on its software.", "tinydolphin:1.1b": " Microsoft is investigating a trojan that appears to be designed to switch off anti-spyware software from their own company. The malicious program is being downloaded by over six million people and has been released recently. The spyware threat comes as an email attachment and, according to security manager Stephen Toulouse at Microsoft, it was created by a group called 'Bankash'. The tool does not pose a significant threat to users but can be used maliciously to steal online banking passwords or other personal information. \n\nMicrosoft has also been investigating an attack on its software earlier this week and purchased Sybari Software, a security company, to improve their own anti-virus software. The new anti-virus software is still in beta form and will be released as part of Microsoft's own paid-for anti-virus software plan.", "phi:2.7b": " Microsoft is investigating a trojan program called Bankash-A Trojan that attempts to turn off the firm's anti-spyware software. The program has been downloaded by six million people but it may not be widespread. The malicious tool tries to disable or delete Microsoft's anti-spyware tool and suppress warning messages given to users. It can steal online banking passwords and other personal information by tracking keystrokes. Microsoft is offering its own paid-for anti-virus software, which will be available soon.\n", "orca-mini:3b": " Microsoft is investigating a trojan program that attempts to switch off its anti-spyware software. The spyware tool was only released by Microsoft in the last few weeks and has been downloaded by six million people. It attempts to disable or delete Microsoft's anti-spyware tool and suppress warning messages given to users. Additionally, it may steal online banking passwords or other personal information by tracking users' keystrokes. Microsoft is investigating a criminal attack on its software. The company plans to release its own paid-for anti-virus software.", "hermes3:3b": "Microsoft discovering spyware (Bankash-A Trojan) that targets anti-spyware software, potentially disabling it & stealing info.", "stablelm-zephyr:3b": "Microsoft is investigating a Bankash-A Trojan spyware program that attempts to disable its own anti-spyware software and potentially steal online banking passwords or personal information. The malicious program was released by Microsoft and has been downloaded by six million people; it's being sent as an email attachment. Although Microsoft doesn't believe the program is widespread, they're still investigating a potential criminal attack on their software. In response, the company plans to buy anti-virus software maker Sybari Software and offer its own paid-for anti-virus software in the future.", "stablelm2:1.6b": "Microsoft investigates a Trojan targeting their anti-spyware software; the malicious program was called Bankash-A Trojan and disabled warnings given to users. It may steal personal information or track keystrokes while being investigated as a criminal attack on Microsoft's software, including Windows and e-mail software. The program is currently in beta form aimed at identifying and removing spyware, which affects internet use and performance. Microsoft has partnered with Sybari Software for improved security.", "granite3.1-dense:2b": "Microsoft is investigating a newly released trojan named Bankash-A (also known as the anti-spyware tool), which has been downloaded by six million people in recent weeks via email attachments. This malicious software aims to disable or delete Microsoft's own anti-spyware, suppress warnings, and potentially steal personal information like online banking details through keystroke tracking. Microsoft views this as a criminal attack on its software and is investigating the issue. Prior to this, they announced plans to acquire Sybari Software for enhanced security in Windows and email, with an intention to offer their own paid anti-virus solution. The targeted anti-spyware program is currently in beta testing, intended to assist users in detecting and removing spyware that monitors internet activity, generates ad pop-ups, and degrades system performance.", "chatgpt-4o-latest": "Microsoft is investigating the Bankash-A Trojan, a malicious program that attempts to disable or delete its recently released anti-spyware software. The trojan, sent via email attachment, may also steal online banking passwords by tracking keystrokes. Microsoft stated the attack is not widespread and advised users to use anti-virus software. The company is also acquiring Sybari Software to enhance security in Windows and email services and plans to release its own paid anti-virus software in the future. The targeted anti-spyware tool is still in beta and helps users detect and remove spyware.", "reference": "Microsoft is investigating a trojan program that attempts to switch off the firm's anti-spyware software.Microsoft said it did not believe the program was widespread and recommended users to use an anti-virus program.Stephen Toulouse, a security manager at Microsoft, said the malicious program was called Bankash-A Trojan and was being sent as an e-mail attachment.Microsoft said in a statement it is investigating what it called a criminal attack on its software."}