{"raw_text": "Movie body hits peer-to-peer nets\n \n The movie industry has struck out at file-sharing networks with another round of lawsuits in the US.\n \n The Motion Picture Association of America (MPAA) also said it had succeeded in getting a network called LokiTorrent closed down. It is the latest network which uses the peer-to-peer system called BitTorrent to be hit by the MPAA. The MPAA began its legal campaign against operators of similar networks across four continents in December. A Dallas court agreed that Hollywood lawyers would be allowed access to LokiTorrent's server records which could let them single out those who were sharing files illegally. In October 2004, the site had provided links to more than 30,000 files. The action came after the operators of LokiTorrent agreed a settlement with the MPAA. A stark message has appeared on the site from the MPAA warning \"You can click, but you can't hide\". In BitTorrent systems, server sites do not host the files being shared. They host links, called \"trackers\" that direct people to others that have it instead.\n \n As well as filing an unspecified number of file suits across the US, the MPAA said it had given operators that host eDonkey servers \"take down\" notices. Hollywood studios are aggressively clamping down on file-sharers who it says infringe copyright laws by copying films and TV programmes then share the files online. But it is now targeting the operators of BitTorrent networks themselves. It has filed 100 lawsuits against operators of BitTorrent server sites since December. The strategy of hitting those who run the servers which link to copyrighted material is intended to stunt file-sharers' ability to swap content using BitTorrent systems. The film industry says the black market for illegally copied videos and DVDs already costs them billions every year and it is worried that illegal file-sharing is adding to their losses. In December, the legal action claimed its most high-profile victim. The popular Suprnova.org website was forced to close, and others like Phoenix Torrent followed soon after.\n", "llama3.2:1b": "Movie industry lawsuits targeting BitTorrent networks.", "llama3.2:3b": "The Motion Picture Association of America (MPAA) has launched another round of lawsuits against peer-to-peer file-sharing networks in the US, targeting LokiTorrent and operators of BitTorrent servers across four continents. The MPAA has obtained access to server records and given \"take down\" notices to eDonkey server hosts.", "gemma2:2b": "The Motion Picture Association of America (MPAA) has filed lawsuits against operators of BitTorrent networks in the US, targeting those who run server sites that link to copyrighted material. They argue this strategy is intended to disrupt file-sharing on these platforms by making it harder for users to swap content illegally. This follows the shutdown of popular file-sharing site Suprnova.org and other similar sites. \n", "qwen2.5:0.5b": "The US motion picture industry has filed lawsuits against BitTorrent network operators in an effort to regulate file-sharing practices. They have succeeded in closing LokiTorrent, which uses the peer-to-peer system called BitTorrent, and are now targeting BitTorrent servers themselves. The movie industry claims that illegal file-sharing is costing them billions annually, while they argue that it's also adding to their losses by enabling illegal content swapping. They've filed a total of 100 lawsuits against BitTorrent network operators since December.", "qwen2.5:1.5b": "The Motion Picture Association of America (MPAA) has filed lawsuits against operators of peer-to-peer file-sharing networks in multiple countries, including LokiTorrent, which uses BitTorrent technology. The MPAA also notified BitTorrent servers to remove hosting links for copyrighted files and took down notices from eDonkey server hosts. This campaign aims to curb the sharing of illegally copied content using BitTorrent systems.", "qwen2.5:3b": "The Motion Picture Association of America (MPAA) has initiated new lawsuits against BitTorrent networks in response to file-sharing activities, following a December campaign across four continents. LokiTorrent was closed down for hosting over 30,000 files illegally; the MPAA sent \"take down\" notices to eDonkey server operators as well. The MPAA aims to curtail illegal sharing by targeting BitTorrent server operators, claiming this strategy prevents file-sharing using BitTorrent systems. This follows previous lawsuits against sites like Suprnova.org and Phoenix Torrent in December, where they were forced to close due to legal actions. The film industry believes unauthorized copying damages their revenues significantly annually.", "opencoder:1.5b": "The movie industry has struck out at file-sharing networks with another round of lawsuits in the US. MPAA also agreed to close LokiTorrent network as it found BitTorrent to be a better alternative. The law ended December was issued to allow access to server records by Hollywood lawyers. A court in October 2004 agreed that users can see server site's files but not download them. In BitTorrent systems, servers do not host the files being shared. They host link \"trackers\" that direct people to others who might have it.\n\nMPAA filed a number of lawsuits against operators of similar networks across four continents in December. The action came after they agreed a settlement with the MPAA. It is a stark message on the site from the MPAA warning \"You can click, but you can't hide\". Operators of BitTorrent server sites have agreed to host files for infringing material.\n\nThe film industry has also aggressively clamped down on file-sharers who it says infringe copyright laws by copying films and TV programmes then share the files online. But in December, operators of BitTorrent networks themselves have filed 100 lawsuits against them. The target strategy is to stifle the sharing of copyrighted material.\n\nThe website Suprnova.org has been forced to close, and others like Phoenix Torrent followed soon after. As to copyright infringement laws as we know them today, it's not that it's adding to their losses or any other negative implications — it's about ensuring fair access to legitimate content.\n", "smollm:1.7b": "The movie industry has struck out at peer-to-peer networks by filing lawsuits against them in the US. It is also targeting the operators of BitTorrent server sites themselves. The strategy of hitting those who run the servers which link to copyrighted material is intended to stifle file-sharers' ability to swap content using BitTorrent systems. The film industry says that illegal file-sharing is adding to their losses and it is worried that illegal file-sharing is increasing the number of people sharing copyrighted content. In December, the legal action claimed its most high-profile victim. The popular Suprnova.org website was forced to close, and others like Phoenix Torrent followed soon after.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help the user summarize a given text concisely while preserving key ideas and details. Let's read through the query carefully.\n\nThe user provided a detailed paragraph about a movie industry lawsuit involving BitTorrent networks. They want only the summary in plain text without any explanations or formatting.\n\nFirst, I'll identify the main points. The main subject is the US movie industry suing peer-to-peer networks like LokiTorrent and BitTorrent. The MPAA is involved in lawsuits targeting these operators. They filed 100 lawsuits as of December, claiming they infringe copyright laws by sharing illegal content. They used trackers that reference copyrighted material to block users.\n\nAlso, several file suits were filed against the operators themselves. The film industry is concerned about the financial impact on their profits from illegal sharing. Specific examples include Suprnova.org closing, others like PhoenixTorrent as well. The main issue is potential economic losses for content creators and the industry's growing problem with illegal sharing.\n\nI should condense this into a concise summary without extra fluff. Make sure to mention both the MPAA's actions against operators and the film industry's reactions. Keep it clear and directly address the key points: lawsuit, BitTorrent networks, MPAA's efforts, tracking mechanisms, closure of sites like Suprnova.org, financial impact on content creators.\n\nI need to ensure that each bullet point in the summary is accurate and captures all the essential details without adding any personal opinions or explanations. Let me make sure the language is straightforward and maintains the original meaning without unnecessary complexity.\n</think>\n\nThe US movie industry has filed lawsuits in a bid to defend against peer-to-peer networks like LokiTorrent and BitTorrent, citing copyright infringement by users sharing illegal content. The Motion Picture Association of America (MPAA) initiated legal actions targeting these operators across four continents, claiming they could access server records to identify illegal file-sharing activities. In December 2004, the site provided links to over 30,000 files. The MPAA advised users to click but not hide, warning they might inadvertently infringe on copyrights. While the MPAA hasn't been directly involved in these lawsuits, operators of BitTorrent networks have taken legal action by \"taking down\" their servers, filing 100 lawsuits against BitTorrent sites since December 2013. The film industry is increasingly targeting BitTorrent operators to stop illegal file-sharing. Examples include Suprnova.org and Phoenix Torrent closing, with the industry worried about increased losses from illegal content sharing.", "tinyllama:1.1b": "The movie industry has announced a new wave of legal actions against file-sharing networks in the US, seeking to close down PeerToPier (or BitTorrent) sites that facilitate copyright infringement. The MPAA, which has successfully shut down similar networks across four continents in December, is targeting operators of these networks and has filed 100 lawssuits against them since December. Hollywood studios have been aggressively targeting these networks, which enable users to copy films and TV programmes from the Internet without paying for content. The MPAA claims that shutting down such networks will deter others from sharing copyrighted material and ultimately lead to fewer illicit downloads. In addition to BitTorrent sites, operators of eDonkey servers are also being targeted by Hollywood studios, which have been given take-down notices for their servers. The MPAA's campaign comes amid concerns about the negative impact of file sharing on the film industry's income and revenue.", "tinydolphin:1.1b": " A US film industry group has initiated a legal campaign against a network used to share files using the BitTorrent technology, claiming that its users are infringinging copyrights. These networks, known as P2P (peer-to-peer) file sharing sites, have grown popular among internet users to access movies and other files quickly and easily without permission from their creators. However, the film industry fears that such networks can also be used by pirates to share stolen content like films and TV shows, thus adding more financial strain on its operations. The MPAA (Motion Picture Association of America) has initiated legal actions against LokiTorrent, which shut down in December after a US court agreed that the Hollywood lawyers would be allowed access to their server records. In a statement, the MPAA claimed that it had succeeded in obtaining server take-down notices from the site and is now targeting BitTorrent network operators itself. The industry argues that by taking this approach, the MPAA is stifling innovation and reducing its earnings from piracy.", "phi:2.7b": " The movie industry has sued operators of BitTorrent networks for illegally sharing movies and TV programs online. This strategy is intended to stop file-sharers from using these networks by targeting the servers that link to copyrighted material. Hollywood studios say illegal file-sharing costs them billions of dollars each year, but it is now beginning to target the operators of BitTorrent server sites instead of just those who share files illegally.\n", "orca-mini:3b": " The movie industry has sued operators of peer-to-peer networks and filed notices to take down eDonkey servers. Hollywood studios are targeting those who run BitTorrent server sites, as well as file-sharers themselves.", "hermes3:3b": "MPAA suits peer-to-peer BitTorrent networks for copyright infringement.", "stablelm-zephyr:3b": "The movie industry is fighting against peer-to-peer file-sharing networks, particularly LokiTorrent and eDonkey servers, using legal actions in the US. The Motion Picture Association of America (MPAA) has filed multiple lawsuits across the US, targeting those who operate BitTorrent networks. This strategy aims to disrupt file-sharing by focusing on those who run the servers linking to copyrighted material. The MPAA claims that this aggressive approach helps reduce losses from the black market for illegally copied videos and DVDs. Popular websites such as Suprnova.org have already been forced to close as a result of these legal actions.", "stablelm2:1.6b": "The Motion Picture Association of America (MPAA) has continued its campaign against file-sharing networks by successfully getting a network called LokiTorrent shut down in the US. This is the latest peer-to-peer system used for sharing films and TV programmes that have been targeted by the MPAA. The association began legal action against operators of similar networks across four continents in December, with a Dallas court allowing access to server records that could identify file sharers. In October 2013, LokiTorrent provided links to over 5,0..\nTo further emphasize its stance on this issue, the MPAA has also given take-down notices for eDonkey servers and filed lawsuits against operators of BitTorrent server sites since December. The strategy of targeting these servers aims to reduce file-sharing by disrupting the ability to swap content using BitTorrent systems. The film industry is concerned that illicit file sharing is adding to its losses, which it estimates are billions every year due to the black market for copied videos and DVDs. In 2013, the legal action claimed its most significant victim: popular website Suprnova.org was forced to close, followed by other sites such as Phoenix Torrent.", "granite3.1-dense:2b": "The MPAA has intensified its legal battle against file-sharing networks in the US, focusing on those using BitTorrent peer-to-peer systems. In December 2019, the organization gained access to LokiTorrent's server records and closed down the network due to illegal file sharing. Since then, it has filed 100 lawsuits against operators of BitTorrent server sites, aiming to disrupt illicit content distribution that costs the film industry billions annually. The MPAA also targeted eDonkey servers with take-down notices. This strategy follows previous successes in closing popular file-sharing platforms like Suprnova.org and Phoenix Torrent in December 2019.", "chatgpt-4o-latest": "The Motion Picture Association of America (MPAA) has intensified its crackdown on file-sharing networks, filing lawsuits in the U.S. and shutting down LokiTorrent, a BitTorrent-based network. A Dallas court granted Hollywood lawyers access to LokiTorrent's server records, potentially identifying illegal file-sharers. The MPAA has also issued \"take down\" notices to eDonkey server operators and has filed 100 lawsuits against BitTorrent server operators since December. The film industry claims piracy costs billions annually and is targeting those who facilitate file-sharing. Previous legal actions led to the closure of major sites like Suprnova.org and Phoenix Torrent.", "reference": "It has filed 100 lawsuits against operators of BitTorrent server sites since December.In BitTorrent systems, server sites do not host the files being shared.It is the latest network which uses the peer-to-peer system called BitTorrent to be hit by the MPAA.But it is now targeting the operators of BitTorrent networks themselves.As well as filing an unspecified number of file suits across the US, the MPAA said it had given operators that host eDonkey servers \"take down\" notices.The MPAA began its legal campaign against operators of similar networks across four continents in December.The action came after the operators of LokiTorrent agreed a settlement with the MPAA.The Motion Picture Association of America (MPAA) also said it had succeeded in getting a network called LokiTorrent closed down."}