{"raw_text": "Hotspot users gain free net calls\n \n People using wireless net hotspots will soon be able to make free phone calls as well as surf the net.\n \n Wireless provider Broadreach and net telephony firm Skype are rolling out a service at 350 hotspots around the UK this week. Users will need a Skype account - downloadable for free - and they will then be able to make net calls via wi-fi without paying for net access. Skype allows people to make free PC-based calls to other Skype users.\n \n Users of the system can also make calls to landlines and mobiles for a fee. The system is gaining in popularity and now has 28 million users around the world. Its paid service - dubbed Skype Out - has so far attracted 940,000 users. It plans to add more paid services with forthcoming launches of video conferencing, voice mail and Skype In, a service which would allow users to receive phone calls from landlines and mobiles. London-based software developer Connectotel has unveiled software that will expand the SMS functions of Skype, allowing users to send text messages to mobile phones from the service. Broadreach Networks has around two million users and hotspots in places such as Virgin Megastores, the Travelodge chain of hotels and all London's major rail terminals. The company is due to launch wi-fi on Virgin Trains later in the year. \"Skype's success at spreading the world about internet telephony is well-known and we are delighted to be offering free access to Skype users in our hotspots,\" commented Broadreach chief executive Magnus McEwen-King.\n", "llama3.2:1b": "People using wireless hotspots will gain free net calls, surf the web, and make phone calls via wi-fi without paying for internet access. A service called Skype Out allows users to make PC-based calls to other Skype users for free, with 28 million users worldwide. The company plans to add more paid services, including video conferencing and voice mail.", "llama3.2:3b": "Wireless provider Broadreach and net telephony firm Skype are launching a service allowing Hotspot users to make free Wi-Fi phone calls, requiring a Skype account. Users can also make paid calls to landlines and mobiles. The system has gained 28 million users worldwide and plans to add services such as video conferencing and voice mail.", "gemma2:2b": "Hotspot users will be able to make free phone calls via Skype, with a trial starting this week.  Users need a Skype account, which is free to download. Calls can be made to other Skype users for free and to landlines and mobiles for a fee. \nThe system has gained popularity and 28 million users worldwide. It offers paid services like Skype Out and plans for video conferencing, voice mail and Skype In soon.  Connectotel has also developed software that expands SMS functions within the service.   Broadreach Networks, which owns many of these hotspots (like Virgin Megastores and London's major rail terminals), is launching Wi-Fi on Virgin Trains later in the year. \n", "qwen2.5:0.5b": "Hotspot users can make free net calls and browse the web with Skype. Users have to download a Skype account. They can make phone calls via WiFi, which is not free but cheaper than on landlines or mobiles. Skype Out service is available in 28 million locations around the world now. Additional paid services will be introduced in the future. The company provides software that allows users to send SMS messages from their phones using Skype.", "qwen2.5:1.5b": "Wireless provider Broadreach and net telephony firm Skype are launching a service allowing people using wireless hotspots to make free phone calls and surf the web without paying for internet access. Users need a Skype account, which is available for free download. Calls can also be made to landlines and mobiles at a cost. The system has grown to 28 million users worldwide and plans future services including video conferencing and voice mail. Broadreach currently has two million hotspots in place across the UK.", "qwen2.5:3b": "Hotspot users will soon be able to make free phone calls via Wi-Fi, as Wireless provider Broadreach partners with net telephony firm Skype for a service at 350 UK hotspots. Users need a Skype account and can call other Skype users for free; they also pay for calls to landlines and mobiles. The service has 28 million users worldwide, with paid services like Skype Out attracting 940,000 users. Connectotel's software will expand SMS capabilities. Broadreach operates in various locations including Virgin Megastores, hotels, and London's rail terminals. CEO Magnus McEwen-King praised the collaboration’s success in spreading internet telephony.", "opencoder:1.5b": "Hotspot users gain free net calls\n\nPeople using wireless net hotspots will soon be able to make free phone calls as well as surf the net.\n\nBroadreach and net telephony firm Skype are rolling out a service at 350 hotspots around the UK this week. Users will need a Skype account - downloadable for free - and they will then be able to make net calls via wi-fi without paying for net access. Skype allows people to make free PC-based calls to other Skype users.\n\nUsers of the system can also make calls to landlines and mobiles for a fee. The system is gaining in popularity and now has 28 million users around the world. Its paid service - dubbed Skype Out - has so far attracted 940,000 users. It plans to add more paid services with forthcoming launches of video conferencing, voice mail and Skype In, allowing users to receive phone calls from landlines and mobiles. London-based software developer Connectotel has unveiled software that will expand the SMS functions of Skype, allowing users to send text messages to mobile phones from the service. Broadreach Networks has around two million users and hotspots in places such as Virgin Megastores, the Travelodge chain of hotels and all London's major rail terminals. The company is due to launch wi-fi on Virgin Trains later in the year.\n", "smollm:1.7b": "The text summary should preserve key ideas, details, and relationships between them. The main idea of the text is that people will soon have the ability to make free phone calls using wireless net hotspots. This service is being offered by two companies: Broadreach Networks and Skype. The service allows users to make free calls to other users on Skype, but also offers paid services with additional features.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help this user by summarizing a given text concisely. Let me read through the provided text carefully.\n\nThe main points are about how wireless net hotspots will become accessible for free phone calls and internet browsing. The tech companies involved are Broadreach and Skype. They're rolling out a service with 350 hotspots in the UK this week, offering wi-fi access without paying for net access. Users can also use their own phone numbers or landlines.\n\nAdditionally, there's a paid service called Skype Out with around 940,000 users. This is expected to expand into more services like video conferencing and voice mail. The company has software that allows sending text messages from their service, which can be used to call landlines and mobiles.\n\nBroadreach has a large user base in places like Virgin Megastores, the Travelodge network, London's major terminals, and will launch wi-fi on Virgin Trains by the end of the year. They're excited about the free trial for users in their hotspots.\n\nI need to make sure the summary captures all these key points: free trials, expansion into services, user base locations, pricing model, and any notable company details like Magnus McEwen-King's statement.\n\nI should avoid any explanations or additional information. Just a clear, concise summary highlighting all the main features and details from the text.\n</think>\n\nHotspot users will soon be able to make free phone calls, surf the net, and use their own phone numbers without paying for internet access. Broadreach and Skype are rolling out a service with 350 hotspots in the UK this week, offering wi-fi access while also providing a paid service called Skype Out, which is expected to expand into video conferencing, voice mail, and SMS functionality. Skype's success in spreading internet telephony is well-known, and they're making free access available to their users using these hotspots. The company has a large user base across various locations including Virgin Megastores, the Travelodge chain of hotels, London's major rail terminals, and expects to launch wi-fi on Virgin Trains by the end of the year.", "tinyllama:1.1b": "Concise summary: Hotspot users gain free net calls with wireless provider Broadreach's net telephon service, \"Skype Out\" launched by Skype, an app that allows users to receive phone calls from landlines and mobile phones at no additional cost. The launching of video conferencing, voice mail, and Skype In services will follow in upcoming months. Skype's 28 million users worldwide are increasingly popular, with paid service Skype Out gaining 940,000 users. Connectotele has unveiled software to expand SMs functions of Skype, allowing users to send text messages from the app. The company is launching wi-fi on Virgin Train's later in the year. Broadreach Networks with over two million users and hotspot locations in London's main rail terminals is set to offer free net calls for its users in Skype's wireless hotspots.", "tinydolphin:1.1b": " Hotspot users gain free net calls. People using wireless net hotspots will soon be able to make free phone calls as well as surf the internet. Wireless provider Broadreach and Skype are rolling out a service at 350 hotspots around the UK this week. Users need a Skype account - downloadable for free - and they will then be able to make free PC-based calls to other Skype users. Skype allows people to make free PC-based calls to other Skype users. Users of the system can also make calls to landlines and mobiles for a fee. The service has gained in popularity, attracting 940,000 users globally, with plans to expand the paid services through future launches including video conferencing, voice mail, and Skype In, which allows users to receive phone calls from landlines and mobiles. London-based software developer Connectotel has unveiled software that will expand the SMS functions of Skype, allowing users to send text messages to mobile phones from the service. Broadreach Networks has around two million users and hotspots in places such as Virgin Megastores, the Travelodge chain of hotels, all London's major rail terminals, and the Virgin Trains network, due to launch wi-fi on Virgin Trains later this year.", "phi:2.7b": " Broadreach has partnered with Skype to allow people using wireless net hotspots to make free phone calls and surf the internet without paying for net access. Users will need a Skype account, which can be downloaded for free, and they will also be able to make calls to landlines and mobiles for a fee. The system is gaining popularity and already has 28 million users worldwide. It plans to add more paid services such as video conferencing and voice mail in the future. London-based Connectotel has developed software that expands Skype's SMS functions, allowing users to send text messages to mobile phones from the service. Broadreach Networks, which has around two million users and hotspots at Virgin Megastores, Travelodge hotels, and major rail terminals, will also launch wi-fi on Virgin Trains later in the year.\n", "orca-mini:3b": " People using wireless net hotspots will soon be able to make free phone calls as well as surf the net. Wireless provider Broadreach and net telephony firm Skype are rolling out a service at 350 hotspots around the UK this week. Users will need a Skype account - downloadable for free - and they will then be able to make net calls via wi-fi without paying for net access. Skype allows people to make free PC-based calls to other Skype users.", "hermes3:3b": "Free net calls via wi-fi for Hotspot users using Skype service, available at 350 UK hotspots.", "stablelm-zephyr:3b": "Broadreach and Skype are introducing a service at 350 UK hotspots allowing wireless net hotspot users to make free phone calls without paying for net access. Users need a free Skype account to use the service, which also allows making calls to landlines and mobiles. The system has 28 million users worldwide and 940,000 paid users, with upcoming launches of video conferencing, voice mail, and Skype In. Broadreach has two million users and partnerships with Virgin Megastores, Travelodge hotels, and London's major rail terminals.", "stablelm2:1.6b": "Wireless provider Broadreach and net telephony firm Skype will offer a service allowing users to make free net calls at various UK hotspot locations this week. The service requires a Skype account, which is available for free download. Users can also make calls to landlines and mobiles through the system for a fee. With millions of users worldwide, Skype aims to expand its paid services in future launches of video conferencing, voice mail, and Skype In. London-based software developer Connectotel has developed software expanding SMS functions of Skype, allowing users to send text messages to mobile phones from the service. Broadreach Networks serves locations such as Virgin Megastores, Travelodge chain of hotels, and major rail terminals with around two million hotspot users.", "granite3.1-dense:2b": "Broadreach, a UK wireless provider, and Skype, a net telephony firm, are collaborating to offer free net calls via 350 UK hotspots starting this week. Users must have a Skype account (free downloadable) to utilize the service, enabling them to make free PC-to-PC calls over wi-fi. For calls to landlines and mobiles, users pay a fee through Skype Out, which has 940,000 subscribers globally. The system, used by 28 million people worldwide, will soon expand with video conferencing, voice mail, and Skype In (for receiving calls from landlines and mobiles). London-based Connectotel is developing SMS functionality for Skype users to text mobile phones. Broadreach Networks, with approximately two million users and hotspots at Virgin Megastores, Travelodge, and major London rail terminals, plans to introduce wi-fi on Virgin Trains later this year. Broadreach's chief executive expressed satisfaction with Skype's global impact and the company's offer for free access in their hotspots.", "chatgpt-4o-latest": "Hotspot users in the UK will soon be able to make free internet calls via Wi-Fi, thanks to a partnership between wireless provider Broadreach and net telephony firm Skype. The service, available at 350 hotspots, requires a free Skype account and allows users to make free PC-based calls to other Skype users without paying for internet access. Users can also call landlines and mobiles for a fee through Skype Out, which has 940,000 users. Skype plans to introduce additional paid services, including video conferencing, voicemail, and Skype In, which enables receiving calls from landlines and mobiles. Connectotel has developed software to expand Skype’s SMS functions, allowing text messaging to mobile phones. Broadreach, with two million users and hotspots in locations like Virgin Megastores and major rail terminals, plans to launch Wi-Fi on Virgin Trains later this year. Broadreach CEO Magnus McEwen-King expressed enthusiasm for offering free Skype access at their hotspots.", "reference": "Skype allows people to make free PC-based calls to other Skype users.Users will need a Skype account - downloadable for free - and they will then be able to make net calls via wi-fi without paying for net access.Its paid service - dubbed Skype Out - has so far attracted 940,000 users.Wireless provider Broadreach and net telephony firm Skype are rolling out a service at 350 hotspots around the UK this week.It plans to add more paid services with forthcoming launches of video conferencing, voice mail and Skype In, a service which would allow users to receive phone calls from landlines and mobiles."}