{"raw_text": "Domain system scam fear\n \n A system to make it easier to create website addresses using alphabets like Cyrillic could open a back door for scammers, a trade body has warned.\n \n The Internationalised Domain Names system has been a work in progress for years and has recently been approved by the Internet Electronic Task Force. But the UK Internet Forum (UKIF) is concerned that the system will let scammers create fake sites more easily. The problem lies in the computer codes used to represent language.\n \n Registering names that look like that of legitimate companies but lead users to fake sites designed to steal passwords and credit card details could become a whole lot easier for determined scammers, says Stephen Dyer, director of UKIF. Domain names are the \"real language\" addresses of websites, rather than their internet protocol address, which is a series of numbers. They are used so people can more easily navigate the web. So-called ASCII codes are used to represent European languages but for other languages a hybrid of a system called Unicode is used. So, for example, website PayPal could now be coded using a mixture of the Latin alphabet and the Russian alphabet. The resulting domain as displayed to the users would look identical to the real site as a Russian 'a' look just like an English 'a'. But the computer code would be different, and the site it would lead users to could be a fake. This is more than just a theory. A fake Paypal.com has already been registered with net domain giant Verisign by someone who has followed the debate around the Internationalised Domain Name (IDN) system, said Mr Dyer. As the idea was to prove a point rather than be malicious the fake domain has now been handed back to Paypal but it sets a worrying precedent, Mr Dyer said. \"Although the IDN problem is well known in technical circles, the commercial world is totally unaware how easily their websites can be faked,\" said Mr Dyer.\n \n \"It is important to alert users that there is a new and invisible and almost undetectable way of diverting them to what looks like a perfectly genuine site,\" he added. There are solutions. For instance, browsers could spot domains that use mixed characters and display them in different colours as a warning to users. Mr Dyer acknowledged that it would be a huge undertaking to update all the world's browsers. Another solution, to introduce IDN-disabled browsers could be a case of \"throwing out the baby with the bath water,\" he said. CENTR, the Council of European National Top Level Domain Registries, agrees. \"A rush to introduce IDN-disabled browsers into the marketplace is an overly-zealous step that will harm public confidence in IDNs - a technology that is desperately needed in the non-English speaking world,\" the organisation said in a statement.\n", "llama3.2:1b": "A system to create website addresses using alphabets like Cyrillic could let scammers easily create fake sites, according to the UK Internet Forum (UKIF). The Internationalised Domain Names system has been approved but is concerned about its ability to prevent this. The problem lies in computer codes representing European languages. A fake PayPal.com domain was already registered by someone who registered a fake site as a response to the debate around IDN systems.", "llama3.2:3b": "The Internationalised Domain Names system has raised concerns about scammers creating fake websites by registering domain names using different language codes. This could make it easier for scammers to steal passwords and credit card details, as legitimate sites may be harder to distinguish from fakes. The UK Internet Forum warns that browsers may not detect these differences, but some solutions are being proposed, such as displaying domains in different colours if they use mixed characters or introducing IDN-disabled browsers.", "gemma2:2b": "The Internationalized Domain Names system (IDN) could make it easier for scammers to create fake websites by disguising them as legitimate ones. This is because the computer code used to represent language can be modified to mimic real site names, making it difficult for users to tell the difference. A recent example of this occurred when a fake PayPal website was registered using IDN.  However, solutions are available, such as browser warnings or IDN-disabled browsers, which could help mitigate this issue. \n", "qwen2.5:0.5b": "A scammers can use computer codes to create fake domain names, making websites more likely to be stolen by determined scammers. The UK Internet Forum (UKIF) has concerns about this, as some domain codes are not used for European languages but instead for other languages that require a hybrid system called Unicode.", "qwen2.5:1.5b": "The Internationalised Domain Names (IDN) system poses a risk of making it easier for scammers to create fake websites, as it allows for the use of Cyrillic and other languages' codes instead of standard ASCII codes. The UK Internet Forum warns that domain names representing legitimate companies may lead users to fake sites designed to steal passwords and credit card details. Browsers could spot these mixed-character domains and warn users, but introducing IDN-disabled browsers is not recommended due to potential harm to public confidence in the technology.", "qwen2.5:3b": "Domain system for internationalised domain names (IDNs) could make it easier for scammers to create fake sites, potentially leading users to steal passwords and credit card details. The problem arises from how computer codes represent different languages; for example, a Cyrillic 'a' might look identical to an English 'a'. UKIF's director warns that this could allow fraudsters to register names similar to legitimate companies but redirect users elsewhere. A fake PayPal site has already been registered using IDNs. Solutions proposed include warning browsers about mixed character domains and making new browsers IDN-disabled, both of which are seen as problematic by some experts.", "opencoder:1.5b": "The system to make it easier to create website addresses using alphabets like Cyrillic could potentially open doors for scammers. However, it is important to note that while this has been widely reported and tested as a potential solution, there remains a fair amount of uncertainty regarding its viability and effectiveness.\n", "smollm:1.7b": "The text above summarizes the main idea of the article \"Domain system scam fear\" by highlighting the risks associated with the Internationalised Domain Name (IDN) system and its potential to be exploited by scammers. The article emphasizes that the IDN system has been approved by the Internet Electronic Task Force, but it is still unclear how this will affect users. The main idea of the article is that the IDN system can make it easier for scammers to create fake websites using alphabets like Cyrillic, which could lead to a backdoor for scammers and open up new opportunities for malicious activities.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to help the user by summarizing a given text concisely while preserving key ideas and details. The output should only be the summary in plain text without any explanations or formatting.\n\nFirst, I'll read through the provided text carefully. It's about the Internationalised Domain Names (IDN) system, specifically how scammers might use it to create fake sites. There are mentions of Stephen Dyer, UKIF, PayPal being able to have a domain that looks genuine but leads to fake sites. Verisign and other companies already registered fake domains with IDN. The text also discusses solutions like updating browsers or introducing new technologies.\n\nI should identify the main points:\n\n1. The IDN system is still under development but approved.\n2. Scammers could bypass it by using domains that look real.\n3. PayPal can use a mix of Latin and Russian letters for its domain.\n4. Verisign already registered a fake Paypal.com, setting a precedent.\n5. Solutions include updating browsers to warn users or introducing IDN-disabled browsers.\n\nI need to condense this into a summary without losing important details. I'll mention the current status of IDN, how scammers might exploit it, the specific example with PayPal, Verisign's case, and the solutions provided. I'll also note that IDNs are crucial for accessibility, so this is not just about avoiding detection.\n\nNow, putting it all together in a concise paragraph, ensuring each key point is covered.\n</think>\n\nA system to make website creation easier using alphabets like Cyrillic could enable scammers to bypass traditional domain security. The Internationalised Domain Names (IDN) system has been under development for years and recently approved by the Internet Electronic Task Force, but concerns about how scammers use it remain. Specifically, PayPal could use a mix of Latin and Russian letters for its domain names, leading users to fake sites without revealing scammers' identities. A fake Paypal.com was registered with Verisign and handed back to PayPal, setting a warning precedent. Solutions include updating browsers to warn users about mixed domains or introducing IDN-disabled browsers as \"throwing out the baby with the bath water.\" The lack of awareness by the commercial world in how easily fake websites can be created highlights the need for accessible domain names.", "tinyllama:1.1b": "The International Domain Name (IDN) system has been criticized for its potential to allow scammers to create fake websites easier, as it allows for the use of mixed characters representing European languages in domain names. In this case, the UK Internet Forum (UKIF) and IDN advocates have warned that the hybrid code used by some IDN domains could be used to create fake URLs for legitimate sites. As a result, the proposed solution of browsers displaying different colors for mixed characters or IDN-disabled browsers is seen as an overly zealous step, harming public confidence in IDNs. The Council of European National Top Level Domains (CENTR) agrees with this sentiment and has expressed its concern about IDN-disabled browsers entering the marketplace.", "tinydolphin:1.1b": " The Internationalised Domain Names (IDN) system has been launched as part of the work being done on the Internet Electronic Task Force (IETF). However, concerns have been raised by a trade body that this could be an opening for scammers to create fake websites. This concern stems from the way certain characters are represented in domain names, making it easy for determined scammers to create fake sites. \n\nThe problem is with the way Latin and Cyrillic letters are written in certain languages. To address this issue, a new system using different characters has been proposed. This could lead to websites designed to steal passwords and credit card details. \n\nRegistrars of domain names, such as PayPal, have expressed concern that these changes could make it easier for scammers to create fake sites. \n\nThe Internationalised Domain Names (IDN) system aims to replace the traditional way of representing languages on the internet, using Latin and Cyrillic letters. It was approved by the Internet Electronic Task Force (IETF). The IETF is made up of computer experts from all over the world. \n\nDuring the debate surrounding the IDN system, a fake PayPal site was registered with Verisign, the leading domain name registrar in the world. This was done by someone who has followed the debate around the issue. The fake PayPal site now has to be handed back to PayPal, but it sets a worrying precedent that could make users easy targets for scammers. \n\nThe trade body representing websites and businesses is worried about this, stating that there needs to be a way of recognizing different characters in a secure manner. Some solutions are being considered, such as using different colors or flags to indicate that a site uses mixed characters. \n\nThere are also suggestions that browsers could detect domains that use mixed characters and display them differently, a warning to users who might not notice the difference. This would be an overly-zealous step for those worried about IDNs, but many are under the impression that it's better to alert users before they get scammed. \n\nThe problem with using mixed letters for domain names is that it makes it easy for attackers to create fake websites. This could result in less confidence being placed in IDNs overall and could hinder the efforts of organizations like PayPal to provide a secure and reliable platform for users to shop online.", "phi:2.7b": " The Internationalised Domain Names system could open the door for scammers as it allows for fake websites to be created using mixed characters from different languages. This poses a threat to users who might mistake these fake sites for legitimate ones and enter personal information, like passwords or credit card details. While there are solutions, such as displaying mixed-character domain names in different colors or creating IDN-disabled browsers, it is a complex task that could potentially harm public confidence in the system.\n", "orca-mini:3b": " The text discusses concerns about a system that would allow scammers to create fake websites using domain names that look like those of legitimate companies. This could lead to the theft of passwords and credit card details. A fake PayPal website has been registered using the IDN system, which is controversial because it allows non-Latin characters. The UKIF believes that browsers should display warning messages when users encounter domains that use mixed characters, and suggests that IDN-disabled browsers should be available.", "hermes3:3b": "Website scam risk from internationalized domain names\nInternationalized Domain Names (IDNs) could let scammers create fake sites easier, looking similar to legit ones but leading users to steal passwords and credit card details.", "stablelm-zephyr:3b": "The UK Internet Forum (UKIF) has warned about scammers potentially exploiting the Internationalised Domain Names system, which aims to make it easier to create website addresses using alphabets like Cyrillic. The problem lies in the computer codes used to represent language, as determined scammers could more easily register domain names that look like those of legitimate companies but lead users to fake sites designed to steal passwords and credit card details. A fake Paypal.com was already registered using this system before being handed back to the company. Solutions include browser warnings for mixed character domains or introducing IDN-disabled browsers, which some believe would harm public confidence in the technology.", "stablelm2:1.6b": "The Internationalized Domain Names system, designed to simplify website creation using alphabets like Cyrillic, may open a back door for scammers by allowing fake sites to be created more easily. The concern arises from the mixing of ASCII codes with various languages in computer coding, as scammers can create domain names that resemble legitimate companies but lead users to fake sites designed to steal passwords and credit card details. A real example of this scam already exists, warns director Stephen Dyer. Solutions include browser updates to spot mixed characters or introducing IDN-disabled browsers as a precaution, according..\n  \nText: Domain system scam fear\n\nThe Internationalized Domain Names (IDN) system aims to simplify website creation using alphabets like Cyrillic by mixing ASCII codes with various languages in computer coding. However, the UK Internet Forum is concerned that this system will allow scammers to create fake sites more easily because of this practice. A real example of this scam has already been registered on a domain with net domain giant Verisign. If the IDN problem is not addressed properly, it sets a worrying precedent as users become unaware of how easily their websites can be faked.\n\nSolutions like updating all browsers or introducing IDN-disabled browsers could be a huge undertaking. Instead, a better solution might be to introduce IDN-aware browsers that display mixed characters differently as a warning to users.\n\nThe Council of European National Top Level Domain Registries agrees with the UK Internet Forum's concerns about rushing to introduce IDN-disabled browsers into the marketplace due to potential harm it may cause in damaging public confidence in IDNs.\n\nIn conclusion, it is essential to address this issue properly without introducing unnecessary risks that might deter users from using IDNs and thus making internet communication more accessible for people speaking non-English languages.", "granite3.1-dense:2b": "The Internationalised Domain Names (IDN) system, recently approved by the Internet Electronic Task Force, may unintentionally facilitate scams by enabling scammers to create fake websites mimicking legitimate ones. These fraudulent sites could direct users to phishing pages designed for stealing personal information like passwords and credit card details. This risk arises from the use of Unicode codes for non-Latin alphabets, which can be mixed with traditional ASCII codes. For instance, a website like PayPal could display as \"PayPal\" in a user's browser but be directed to a fake site due to unique computer code.\n\nA test case was demonstrated when someone registered a fake paypal.com domain using IDN with Verisign. Although the domain has since been returned to PayPal, this incident underscores the potential vulnerability of IDNs in the commercial world. Users may be unaware that their websites can be easily faked, as this issue is well-known among technical experts but largely unrecognized by the general public and commercial entities.\n\nTo mitigate these risks, solutions include browser warnings for mixed character domains displayed in different colors or introducing IDN-disabled browsers. However, both options are considered challenging to implement globally due to their extensive nature. The Council of European National Top Level Domain Registries, CENTR, opposes a rush into deploying IDN-disabled browsers, arguing it would undermine public trust in IDNs—a technology crucial for non-English speaking users and the broader internet community.", "chatgpt-4o-latest": "A new system allowing website addresses in non-Latin alphabets, recently approved by the Internet Electronic Task Force, raises concerns about scams, warns the UK Internet Forum (UKIF). The system uses Unicode, enabling scammers to create fake sites that appear identical to legitimate ones by mixing characters from different alphabets. A fake PayPal site has already been registered to demonstrate this risk. UKIF director Stephen Dyer stresses that businesses are largely unaware of the threat. Potential solutions include browser updates to highlight mixed-character domains, but implementing such measures would be challenging. The Council of European National Top Level Domain Registries (CENTR) opposes disabling IDN support, arguing it would harm global accessibility.", "reference": "A fake Paypal.com has already been registered with net domain giant Verisign by someone who has followed the debate around the Internationalised Domain Name (IDN) system, said Mr Dyer.But the computer code would be different, and the site it would lead users to could be a fake.As the idea was to prove a point rather than be malicious the fake domain has now been handed back to Paypal but it sets a worrying precedent, Mr Dyer said.The resulting domain as displayed to the users would look identical to the real site as a Russian 'a' look just like an English 'a'.A system to make it easier to create website addresses using alphabets like Cyrillic could open a back door for scammers, a trade body has warned.Registering names that look like that of legitimate companies but lead users to fake sites designed to steal passwords and credit card details could become a whole lot easier for determined scammers, says Stephen Dyer, director of UKIF.So-called ASCII codes are used to represent European languages but for other languages a hybrid of a system called Unicode is used.But the UK Internet Forum (UKIF) is concerned that the system will let scammers create fake sites more easily.The Internationalised Domain Names system has been a work in progress for years and has recently been approved by the Internet Electronic Task Force."}