{"raw_text": "Microsoft launches its own search\n \n Microsoft has unveiled the finished version of its home-grown search engine.\n \n The now formally launched MSN search site takes the training wheels off the test version unveiled in November 2003. The revamped engine indexes more pages than before, can give direct answers to factual questions, and features tools to help people create detailed queries. Microsoft faces challenges establishing itself as a serious search site because of the intense competition for queries.\n \n Google still reigns supreme as the site people turn to most often when they go online to answer a query, keep up with news or search for images. But in the last year Google has faced greater competition than ever for users as old rivals, such as Yahoo and Microsoft, and new entrants such as Amazon and Blinkx, try to grab some of the searching audience for themselves. This renewed interest has come about because of the realisation that many of the things people do online begin with a search for information - be it for a particular web page, recipe, book, gadget, news story, image or anything else. Microsoft is keen to make its home-grown search engine a significant rival to Google. To generate its corpus of data, Microsoft has indexed 5 billion webpages and claims to update its document index every two days - more often than rivals. The Microsoft search engine can also answer specific queries directly rather than send people to a page that might contain the answer.\n \n For its direct answer feature, Microsoft is calling on its Encarta encyclopaedia to provide answers to questions about definitions, facts, calculations, conversions and solutions to equations. Tony Macklin, director of product at Ask Jeeves, pointed out that its search engine has been answering specific queries this way since April 2003. \"The major search providers have moved beyond delivering only algorithmic search, so in many ways Microsoft is following the market,\" he said. Tools sitting alongside the MSN search engine allow users to refine results to specific websites, countries, regions or languages. Microsoft is also using so-called \"graphic equalisers\" that let people adjust the relevance of terms to get results that are more up-to-date or more popular. The company said that user feedback from earlier test versions had been used to refine the workings of the finished system. The test, or beta, version of the MSN search engine unveiled in November had a few teething troubles. On its first day many new users keen to try it were greeted with a page that said the site had been overwhelmed.\n", "llama3.2:1b": "Microsoft's new home-grown search engine is now live and indexes 5 billion webpages, allowing for direct answers to factual questions and detailed queries. It claims to update its document index every two days and can answer specific queries directly instead of sending users to related pages. The engine provides tools such as refinable results, graphic equalisers, and user feedback to improve the search experience.", "llama3.2:3b": "Microsoft has launched its own search engine, MSN search, which indexes 5 billion webpages and updates its document index every two days, making it more often than rivals like Google. The search engine can answer specific queries directly rather than sending users to a page with the answer. It also features tools to refine results by location, language or relevance.", "gemma2:2b": "Microsoft has launched its own search engine, MSN Search, which indexes billions of pages and delivers direct answers using knowledge from Encarta encyclopaedia. The engine competes with Google for online search dominance by providing more specific answers and customising results.  MSN Search also uses advanced tools like \"graphic equalisers\" to refine searches. Despite early technical difficulties, the company hopes its new platform will attract users seeking accurate and relevant information online. \n", "qwen2.5:0.5b": "Microsoft unveiled its own search engine after reworking it from a home-grown one launched in 2003. The newly formed search engine has more pages to index, can give direct answers, and features tools to help users create detailed queries. Microsoft faces challenges establishing itself as a serious search site due to intense competition for queries. Google still reigns supreme among people who turn to searching online most often when doing internet searches. In the last year, Google has faced greater competition for users as old rivals have taken over and new entrants like Amazon have joined in trying to grab some of those online searching audience. The finished search engine can answer specific queries directly. To generate its corpus of data, Microsoft has indexed 5 billion webpages. It also provides answers to questions about definitions, facts, calculations, conversions, solutions to equations.", "qwen2.5:1.5b": "Microsoft has launched its own search engine, which is more powerful and accurate than Google's, following intense competition for queries. Microsoft plans to become a significant rival to Google by indexing 5 billion webpages daily and answering specific queries directly rather than sending users to pages that might contain the answer. The new engine features refinements in results and updated relevance of terms through graphic equalisers, adapting user feedback from earlier test versions.", "qwen2.5:3b": "Microsoft launches a revamped home-grown search engine, MSN Search, which indexes more pages than before and can give direct answers to factual questions. Features include tools for creating detailed queries and a reliance on Encarta for specific query responses. Despite intense competition from Google, Microsoft aims to establish itself as a significant rival with updated data indexing every two days and refined user feedback. Previous test versions faced issues like overwhelming traffic, but the fully launched engine addresses these problems.", "opencoder:1.5b": "Microsoft launches its own search engine:\n\nThe company unveils the finished version of its home-grown search engine. The updated version of the MSN search site takes the training wheels off the test version unveiled in November 2003. Microsoft has indexed more pages than ever before, and can provide direct answers to factual questions. It also includes features like detailed queries, aiding users in creating more precise queries.\n\nGoogle is still at the forefront as it is the largest and most popular site people turn to when they go online for information. But Google faces greater competition than ever for users as rivals like Yahoo and Microsoft. New entrants such as Amazon and Blinkx have also tried to grab attention, and Microsoft has been keen on making its search engine a significant competitor.\n\nMicrosoft's home-grown search engine is expected to generate substantial data in the future due to Microsoft having indexed 5 billion webpages. Also, the Encarta encyclopedia could answer specific queries since April 2003. The company said that user feedback from earlier test versions had been utilized to refine the system further.\n", "smollm:1.7b": "Microsoft has launched its own search engine and is offering more features than ever before. The company claims to have indexed 5 billion webpages, which is significantly more than Google's index of 4 billion webpages. Microsoft's search engine can answer specific queries directly rather than sending users to a page that might contain the answer. For example, if someone asks \"What is the definition of a word?\", Microsoft's search engine will provide an instant answer. This feature is particularly useful for people who are looking for definitions or facts about a particular topic.\n\nMicrosoft has also introduced its own graphic equaliser tool that allows users to adjust the relevance of terms in their search results. For example, if someone searches for \"What is the definition of a word?\", Microsoft's search engine will provide an instant answer and then allow them to adjust the relevance of the results by selecting from a range of options such as \"most popular\" or \"newest\". This tool can be very useful for people who are looking for specific information about a particular topic.\n\nMicrosoft is also offering more features than ever before, including its own search engine that can answer direct questions and provide graphic equalisers to help users refine their search results. The company claims that user feedback from earlier test versions of the MSN search engine has been used to refine the workings of the finished system. This means that Microsoft's search engine is likely to be more accurate and relevant than Google's search engine, which has faced increased competition in recent years.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Microsoft's new search engine. Let me read through each paragraph carefully.\n\nThe first paragraph introduces the launch of their own search engine called MSN. It mentions they've removed some test version features and now it's formally launched after a year. They say they can answer factual questions directly, have tools for detailed queries, and have indexed more pages than before. But they face competition from Google because people search online for everything.\n\nThe second paragraph talks about how Google remains the main competitor. Microsoft faces competition in the last year, with rivals like Yahoo and Amazon trying to gain users. The rise in interest is due to people's need to find information themselves. Microsoft plans to index more pages—5 billion—and answer specific questions using Encarta. They also mentioned tools that refine search results based on location or language.\n\nThe third paragraph gives specifics about how the engine works: it can directly answer questions, has a \"graphic equalizer\" for relevance, and uses tools like Encarta for definitions. Tony Macklin from Ask Jeeves said this approach is because many searches now involve finding information, not just search results. The test version had issues but was fixed.\n\nPutting it all together, I need to capture the key points: MSN's launch, its features, competition from Google and competitors, indexing more pages, direct answers, tools for refining queries, use of Encarta, specific functionalities, and the rise in user interest due to search needing info.\n</think>\n\nThe text discusses Microsoft's official launch of their own search engine called MSN. It highlights that MSN removes test version features, formally launches after a year, and offers direct answers to factual questions. The engine also provides tools for detailed queries and indexes more pages than before. Despite this, competition from Google is intense, especially with rivals and newcomers like Amazon and Blinkx. Microsoft aims to index 5 billion pages daily and answer specific queries using Encarta. They introduced a \"graphic equalizer\" for relevance adjustments and tools for refining results by location or language. Tony Macklin emphasized that many searches are about information retrieval rather than just finding websites, noting that the search engine's approach works because users need info themselves. The test version had some issues but was fixed to improve performance.", "tinyllama:1.1b": "Microsoft has launched its own home-grown search engine, MSN Search, featuring updated data and direct answers for queries. The revamped engine indexes more pages than before, features tools to help users create detailed queries, and offers a range of tools such as graphic equalizers that adjust the relevance of terms based on user feedback. To generate its corpus of information, Microsoft has indexed 5 billion webpage data and claims to update it every two days. The search engine's direct answer feature provides instant access to answers to specific queries, while users can refine results according to their preference or latest news updates. While Google remains the leading seaurch site for users, new competitors such as Amazon and Blinkx also stake a claim in the seaurch market, thanks to the realization that many people do online research before making decisions. To generate direct answers, Microsoft's Encarta encyclopedia has been used to provide answers to user queries since April 2003, while graphic equalizers have been added to help users adjust relevance based on feedback.", "tinydolphin:1.1b": " Microsoft has unveiled the finished version of its home-grown search engine. The now formally launched MSN search site takes the training wheels off the test version unveiled in November 2003. It features more pages than before, offers direct answers to factual questions and provides tools to help people create detailed queries. Google still reigns supreme as the site people turn to most often when they go online to answer a query, keep up with news or search for images. However, this renewed interest has come about because of the realization that many of the things people do online begin with a search for information – be it for a particular web page, recipe, book, gadget, news story, image or anything else. Microsoft is keen to make its home-grown search engine a significant rival to Google and it's looking to generate its corpus of data by indexing 5 billion web pages daily – more often than rivals. To update the corpus, Microsoft has indexed 5 billion web pages and claims to update its document index every two days, providing users with quicker access to information on a variety of topics. For this direct answer feature, Microsoft is calling on its Encarta encyclopaedia to provide answers to questions about definitions, facts, calculations, conversions and solutions to equations. Tony Macklin, director of product at Ask Jeeves, pointed out that MSN's search engine has been answering specific queries since April 2003. Graphic equalisers are used in the search results to refine results based on a user's criteria. The company is also using graphic equalisers to adjust the relevance of terms to get better results for users. This is an example of how Microsoft is using its home-grown search engine to compete with Google, a search site that has been around for almost as long but has quickly risen to dominate the market.", "phi:2.7b": " Microsoft's home-grown search engine is now fully launched and provides more advanced features than its beta test version, including indexing 5 billion webpages, being able to answer specific queries directly rather than sending people to another page, and offering tools to help refine results. Microsoft wants to compete with Google as a serious search site due to increased competition for users on the internet.\n", "orca-mini:3b": " Microsoft has launched its own search engine, which is a home-grown search engine called MSN search. The revamped engine indexes more pages than before and can give direct answers to factual questions. It also features tools to help people create detailed queries. The company faced challenges establishing itself as a serious search site because of intense competition from Google. However, the renewed interest has come about because many things people do online begin with a search for information, and Microsoft wants to make its home-grown search engine a significant rival to Google. The MSN search engine can answer specific queries directly and also provides answers to questions about definitions, facts, calculations, conversions, and solutions to equations.", "hermes3:3b": "Microsoft launches full search engine, indexing 5b pages, aiming to compete with Google against increasing competition.", "stablelm-zephyr:3b": "Microsoft has launched its own search engine, MSN search, aiming to compete with Google. The revamped engine indexes more pages, provides direct answers to factual questions, and offers tools for creating detailed queries. Microsoft generates its corpus of data from indexed webpages (5 billion) updated every two days. Direct answer feature utilizes the Encarta encyclopaedia for definitions, facts, calculations, conversions, and solutions to equations. MSN search also allows refining results by specific websites, countries, regions, or languages, and uses \"graphic equalizers\" for adjusting term relevance for up-to-date or popular results. While Microsoft faces intense competition from old rivals and new entrants like Yahoo, Amazon, and Blinkx, it aims to establish itself as a significant search site rival to Google.", "stablelm2:1.6b": "Microsoft has launched its own search engine, MSN Search, replacing an earlier test version. The revamped engine indexes more pages and can give direct answers to factual questions. It also features tools for creating detailed queries and competes against dominant Google. To develop its database, Microsoft indexed 5 billion webpages, with the index updated daily. Users can refine search results based on specific websites, countries, regions or languages, and adjust relevance using \"graphic equalisers.\" A previous test version faced issues with being overwhelmed by new users.", "granite3.1-dense:2b": "Microsoft has launched its own search engine, MSN Search, following the completion of a test version introduced in November 2003. The updated MSN Search indexes more pages, answers factual questions directly, and offers tools to help users refine queries. Microsoft aims to challenge Google's dominance by indexing 5 billion webpages daily and updating its index every two days, surpassing competitors' update frequencies. To provide direct answers, MSN Search leverages Encarta encyclopedia for definitions, facts, calculations, conversions, and equations solutions. Users can also filter results to specific websites, countries, regions, or languages. Graphic equalizers allow users to adjust the relevance of terms for more current or popular results. Despite initial issues on its launch day, MSN Search incorporates user feedback from the beta test to enhance its functionality. Microsoft faces stiff competition from established players like Google and new entrants such as Amazon and Blinkx in the competitive online search market.", "chatgpt-4o-latest": "Microsoft has officially launched its own search engine, MSN Search, after testing since November 2003. The revamped engine indexes more pages, provides direct answers to factual queries, and includes tools for refining searches. Microsoft aims to compete with Google, which remains the dominant search engine despite increasing competition from Yahoo, Amazon, and Blinkx. Microsoft's search engine indexes 5 billion webpages and updates its index every two days, claiming to do so more frequently than rivals. It also integrates Encarta encyclopaedia for direct answers to factual questions. Features include refining searches by website, region, or language, and \"graphic equalisers\" to adjust relevance. Microsoft refined the system based on user feedback, though the beta version faced initial technical issues due to high demand.", "reference": "Microsoft has unveiled the finished version of its home-grown search engine.The Microsoft search engine can also answer specific queries directly rather than send people to a page that might contain the answer.Microsoft is keen to make its home-grown search engine a significant rival to Google.The test, or beta, version of the MSN search engine unveiled in November had a few teething troubles.\"The major search providers have moved beyond delivering only algorithmic search, so in many ways Microsoft is following the market,\" he said.Microsoft faces challenges establishing itself as a serious search site because of the intense competition for queries.The now formally launched MSN search site takes the training wheels off the test version unveiled in November 2003.Google still reigns supreme as the site people turn to most often when they go online to answer a query, keep up with news or search for images."}