{"raw_text": "Mobiles 'not media players yet'\n \n Mobiles are not yet ready to be all-singing, all-dancing multimedia devices which will replace portable media players, say two reports.\n \n Despite moves to bring music download services to mobiles, people do not want to trade multimedia services with size and battery life, said Jupiter. A separate study by Gartner has also said real-time TV broadcasts to mobiles is \"unlikely\" in Europe until 2007. Technical issues and standards must be resolved first, said the report. Batteries already have to cope with other services that operators offer, like video playback, video messaging, megapixel cameras and games amongst others. Bringing music download services based on the success of computer-based download services will put more demands on battery life.\n \n Fifty percent of Europeans said the size of a mobile was the most important factor when it came to choosing their phone, but more power demands tend to mean larger handsets. \"Mobile phone music services must not be positioned to compete with the PC music experience as the handsets are not yet ready,\" said Thomas Husson, mobile analyst at Jupiter research. \"Mobile music services should be new and different, and enable operators to differentiate their brands and support third generation network launches.\" Other problems facing mobile music include limited storage on phones, compared to portable players which can hold up to 40GB of music. The mobile industry is keen to get into music downloading, after the success of Apple's iTunes, Napster and other net music download services.\n \n With phones getting smarter and more powerful, there are also demands to be able to watch TV on the move. In the US, services like TiVo To Go let people transfer pre-recorded TV content onto their phones. But, the Gartner report on mobile TV broadcasting in Europe suggests direct broadcasting will have to wait. Currently, TV-like services, where clips are downloaded, are offered by several European operators, like Italy's TIM and 3. Mobile TV will have to overcome several barriers before it is widely taken up though, said the report.\n \n Various standards and ways of getting TV signals to mobiles are being worked on globally. In Europe, trials in Berlin and Helsinki are making use of terrestrial TV masts to broadcast compressed signals to handsets with extra receivers. A service from the Norwegian Broadcasting Corporation lets people watch TV programmes on their mobiles 24 hours a day. The service uses 3GP technology, one of the standards for mobile TV. But at the end of 2004, the European Telecommunications Institute (Etsi) formally adopted Digital Video Broadcasting Handheld (DVB-H) as the mobile TV broadcasting standard for Europe. Operators will be working on the standard as a way to bring real-time broadcasts to mobiles, as well as trying to overcome several other barriers. The cost and infrastructure needs to set up the services will need to be addressed. Handsets also need to be able to work with the DVB-H standard. TV services will have to live up to the expectations of the digital TV generation too, which expects good quality images at low prices, according to analysts. People are also likely to be put off watching TV on such small screens, said Gartner. Digital video recorders, like Europe's Sky+ box, and video-on-demand services mean people have much more control over what TV they watch. As a result, people may see broadcasting straight to mobiles as taking away that control. More powerful smartphones like the XDA II, Nokia 6600, SonyEricsson P900 and the Orange E200, offering web access, text and multimedia messaging, e-mail, calendar and gaming are becoming increasingly common. A report by analysts InStat/MDR has predicted that smartphone shipments will grow by 44% over the next five years. It says that smartphones will make up 117 million out of 833 million handsets shipped globally by 2009.\n", "llama3.2:1b": "Mobile phones are not yet ready to replace portable media players, with size and battery life being major concerns. The technical issues and standards necessary for real-time TV broadcasts on mobiles have yet to be resolved. The majority of Europeans prefer smaller handsets due to the demands placed on batteries from other services. Mobile music services must differentiate themselves from PC music experiences. Mobile TV broadcasting in Europe faces several barriers, including limited storage capacity and overcoming standardization issues. Various international trials are underway to address these challenges.", "llama3.2:3b": "Mobiles are not yet equipped to be all-singing, all-dancing multimedia devices like portable media players, due to technical issues and battery life concerns. The industry is keen on mobile music services but must differentiate them from PC-based experiences and address storage limitations. Mobile TV broadcasting in Europe is unlikely until 2007 due to technical standards and infrastructure needs.", "gemma2:2b": "Mobiles are not yet ready to fully replace portable media players. Concerns about battery life, storage limitations, and technical hurdles hinder the adoption of mobile music services. Real-time TV broadcasts are unlikely in Europe until 2007 due to technical challenges and standards development. Despite these barriers, advancements in phone capabilities pave the way for a future where smartphones can offer TV viewing experiences on the go. Mobile TV broadcasting faces obstacles like standardization, cost, infrastructure, and user expectations of high quality images at low prices. The popularity of digital video recorders and video-on-demand services has made users accustomed to greater control over their TV viewing choices, which may negatively impact the appeal of mobile TV broadcasts as a replacement for traditional methods. \n", "qwen2.5:0.5b": "Mobiles are not yet ready to replace portable media players, and they lack multimedia services which compete with PC music experiences as well as limited storage on mobile phones.\nThe report suggests that real-time TV broadcasts will need to be made available in Europe until 2007. It also proposes the use of different standards for digital video broadcasting hand-helds (DVB-H) across Europe and further development work needed to get mobile services working with them.\nThe various standards are being worked on globally, including trials in Berlin and Helsinki using terrestrial TV masts to broadcast compressed signals to mobiles equipped with extra receivers. A Norwegian Broadcasting Corporation service lets people watch TV programmes 24 hours a day on their phones using the 3G technology from an earlier standard called DVB-T. But the European Telecommunications Institute officially adopted Digital Video Broadcasting Handheld (DVB-H) as the mobile broadcasting standard for Europe in 2004.", "qwen2.5:1.5b": "Mobiles are not yet capable of fully replacing portable media players due to technical issues and standards needing resolution, with real-time TV broadcasts on mobiles \"unlikely\" in Europe until 2007. The report suggests that while phones can offer music downloads based on PC services, operators need new methods for differentiation and support third-generation networks. TV broadcasting also faces hurdles before it becomes widely adopted, including overcoming infrastructure costs and technical standards.", "qwen2.5:3b": "Mobiles are not yet ready to be all-singing, all-dancing multimedia devices which could replace portable media players according to two reports. Despite moves towards integrating music download services, real-time TV broadcasts to mobiles in Europe is unlikely before 2007 due to technical and standard issues. Factors like size and battery life hinder the development of such devices. Mobile phone music services should be new and different to compete with PC experiences; they must also address limited storage compared to portable players. Standards for mobile TV broadcasting are being developed, though significant infrastructure needs to be addressed before widespread use is possible. Smartphones have become increasingly common, offering features like web access, text messaging, multimedia capabilities, e-mail, gaming, and calendar functions, with shipments expected to grow significantly over the next five years.", "opencoder:1.5b": "The text provided summarizes information about mobile devices, focusing on user expectations and issues related to tech adoption in the mobile industry. The primary goal is to create a concise, easily understandable version of this report.\n", "smollm:1.7b": "The summary is concise and to the point, preserving key ideas and details while omitting unnecessary information. The main points are:\n\n1. Mobiles are not yet ready to be all-singing, all-dancing multimedia devices which will replace portable media players, say two reports.\n2. Despite moves to bring music download services to mobiles, people do not want to trade multimedia services with size and battery life, said Jupiter. A separate study by Gartner has also said real-time TV broadcasts to mobiles is \"unlikely\" in Europe until 2007. Technical issues and standards must be resolved first, said the report. Batteries already have to cope with other services that operators offer, like video playback, video messaging, megapixel cameras and games amongst others. Bringing music download services based on the success of computer-based download services will put more demands on battery life.\n3. Fifty percent of Europeans said the size of a mobile was the most important factor when it came to choosing their phone, but more power demands tend to mean larger handsets. \"Mobile phone music services must not be positioned to compete with the PC music experience as the handsets are not yet ready,\" said Thomas Husson, mobile analyst at Jupiter research.\n4. Other problems facing mobile music include limited storage on phones, compared to portable players which can hold up to 40GB of music. The Gartner report on mobile TV broadcasting in Europe suggests direct broadcasting will have to overcome several barriers before it is widely taken up though, said the report. Operators are working on the standard as a way to bring real-time broadcasts to mobiles, but they need to overcome several other barriers before that can happen. The cost and infrastructure needs to set up the services will need to be addressed. Handsets also need to be able to work with the DVB-H standard for mobile TV broadcasting, said analysts. People are likely to be put off watching TV on such small screens, said Gartner. More powerful smartphones like the XDA II, Nokia 6600, SonyEricsson P900 and the Orange E200, offering web access, text and multimedia messaging, e-mail, calendar and gaming are becoming increasingly common. A report by analysts InStat/MDR has predicted that smartphone shipments will grow by 44% over the next five years. It says that smartphones will make up 117 million out of 833 million handsets shipped globally by 2009.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about mobiles and their relationship with media services. First, I'll read through the entire passage to understand the main points.\n\nThe first sentence says that mobiles aren't ready yet for all-singing-all-dancing multimedia devices. That gives me a clear idea. Then it mentions reports from two companies, Jupiter and Gartner, discussing how music download services are being moved to mobiles but people don't want them replaced by other media services. They also mention real-time TV broadcasts in Europe won't happen until 2007, which is a key point.\n\nI notice that the report talks about battery life being a concern because of other services like video playback and games. It says technical issues need to be resolved first. There's also a focus on user experience—people value smaller handsets over larger ones for factors like size and battery life.\n\nAnother important part is how mobile music is different from PC-based music experiences. They mention that music should offer new features, not just better sound quality or lower battery use. Plus, there are reports showing that devices will transition to digital video broadcasting (DVB-H), which might improve video quality but also require a lot of infrastructure and high-end smartphones.\n\nI need to make sure the summary includes these key points: mobiles aren't ready for full media experience, reports on music download services and real-time TV, issues with battery life, user preference for smaller devices, differentiating music services from PC-based ones, and moving into music downloads after Apple's successes. Also, mention that other services like video-on-demand are available as alternatives.\n\nI should structure the summary concisely without any explanations or extra details, just capturing all these main points.\n</think>\n\nMobiles 'not media players yet'  \nReports suggest mobiles aren't ready for full multimedia experiences. Despite moving music download to mobiles, users prefer size and battery life over trading with PC-based services. Real-time TV in Europe is unlikely until 2007. Mobile music must be new and differentiate operators. Battery issues arise from other services like video playback. Focusing on user experience: smaller handsets preferred for factors like size and battery life. Music should offer variety, not just sound quality. Transitioning to DVB-H may improve video quality but requires infrastructure. Users might prefer video-on-demand alternatives. Other services like TiVo To Go exist in the US.", "tinyllama:1.1b": "The mobile industry has been facing several challenges in regards to mobile music services, with the success of computer-based download services causing increased demand for multimedia devices. However, two reports have predicted that real-time TV broadcasts will not come to mobile sets until 2007, and batteries may face technical issues before then. In Europe, various standards and ways of getting TV signals on mobile phones are being worked on globally, with the European Telecommunications Institute (ETSI) adopting Digital Video Broadcasting Handheld (DVB-H) as the preferred standard for real-time broadcasts to mobile sets. However, the cost and infrastructure needs to set up these services will need to be addressed, and handsets may not offer consumers as much control over what TV they watch as digital video recorders and video-on-demand (VOD) services. The report by analysts InStat/MDR predicts that smartphone shipments will grow by 44% over the next five years, with more powerful smartphones like the XDA II, NoiSy 6600, SonyEricsson P900 and Orange E200 expected to become increasingly common.", "tinydolphin:1.1b": " The mobile industry is facing several challenges in its transition to multimedia services on mobile phones. These include the need for larger, more powerful devices to handle multimedia content and meet user demands, the cost and infrastructure needed to offer real-time broadcasts of music download services, and the desire to differentiate their branding from PC music experience. Some experts believe that television broadcasting on mobile phones is not a viable proposition until 2007 due to technological limitations, while others argue that multimedia services will become increasingly popular as smartphones become more powerful and user-friendly.", "phi:2.7b": " Despite attempts to bring music download services and real-time TV broadcasts to mobiles, Jupiter's report suggests it is unlikely that these features can be implemented in Europe until 2007 due to technical issues and standards. The size and battery life of mobiles make them less appealing for multimedia services. However, mobile phone music services can differentiate brands and support third-generation network launches as long as they are new and different from the PC experience. Storage on phones is limited compared to portable players, but the mobile industry wants to get into music downloading after the success of services like Apple'S iTunes. Direct broadcasting of TV content onto handsets is also being developed in Europe, using terrestrial TV masts and 3GP technology. However, there are still barriers to overcome before it becomes widely taken up, such as the cost, infrastructure needs, and expectations for quality at a low price. As smartphones become more powerful, there may be less interest in watching TV on mobiles due to a lack of control over what is watched. Nevertheless, smartphone shipments are expected to grow significantly in the next five years.\n", "orca-mini:3b": " Mobiles are not yet ready for multimedia functions like music downloads, and it may take time to resolve technical issues and standardize mobile TV broadcasting. Mobile phone manufacturers are working on smaller screens to make them more convenient for use. However, people still prefer control over what they watch, and may avoid watching TV on small screens. Digital video recorders and video-on-demand services offer more options, and smartphones are becoming increasingly powerful. Nonetheless, mobile phone music services can differentiate themselves from computer-based download services by offering new and different features. Operators must address battery demands and provide a full range of multimedia services to succeed in the market.", "hermes3:3b": "Mobiles not ready as multimedia players, say reports; technical issues and battery life hinder real-time TV broadcasts to mobiles in Europe until 2007.", "stablelm-zephyr:3b": "Two reports say mobiles are not yet ready to replace portable media players, as people prefer larger devices for multimedia services. Mobile music services should be new and different, not compete with PC music experiences, as phones' battery life is still a concern. Watching TV on the move is also limited by technical issues and battery life demands. Various standards and infrastructure improvements are needed to bring real-time broadcasts to mobiles, but people may resist watching TV on small screens due to digital video recorder and video-on-demand options. More powerful smartphones are increasing in popularity, with predicted growth of 44% in handset shipments over the next five years.", "stablelm2:1.6b": "Mobiles aren't multimedia devices yet: reports from Jupiter and Gartner indicate mobiles aren't ready to replace portable media players. Technological issues, such as battery life and compatibility with other services like video and messaging, must be resolved before they can become all-singing, all-dancing multimedia devices. The size of a mobile is deemed the most important factor when choosing a phone by 50% of Europeans. Apple's iTunes, Napster, and net music download services have been successful in this market sector. Smartphones with web access, text messaging, e-mail, gaming features are increasingly common among users.", "granite3.1-dense:2b": "Mobiles are not yet well-suited to replace traditional multimedia devices due to limitations in size, battery life, and storage capacity, according to reports from Jupiter and Gartner. Despite mobile operators' interest in music download services following the success of PC-based platforms, users prioritize other features like video playback and camera capabilities over media consumption. Battery demands from potential music services would burden already taxed battery life for multiple functionalities. Mobile music services should focus on providing unique experiences that differentiate brands and support 3G network launches, rather than competing directly with desktop PC music experiences.\n\nReal-time TV broadcasting to mobiles in Europe is currently deemed unlikely by Gartner due to technical challenges, including the need for standardized signals, additional receivers on handsets, and infrastructure upgrades. European trials are exploring terrestrial TV masts for compressed signal transmission via 3GP technology or DVB-H, the adopted mobile TV broadcasting standard. However, widespread adoption faces barriers such as high costs, infrastructure requirements, and users' preference for maintaining control over their television viewing through digital video recorders and on-demand services.\n\nThe growing smartphone market indicates a shift towards more capable devices with multimedia functionalities. Analysts predict a 44% increase in smartphone shipments by 2009, with devices like the XDA II, Nokia 6600, SonyEricsson P900, and Orange E200 becoming increasingly common. These advanced handsets offer web access, messaging, email, calendars, and gaming, suggesting that users' preferences are moving towards versatile devices rather than specialized media players or standalone TVs for mobile use.", "chatgpt-4o-latest": "Mobiles are not yet ready to replace portable media players due to concerns over size, battery life, and storage limitations, according to reports by Jupiter and Gartner. While mobile music services are growing, they should not compete directly with PC-based downloads but instead offer unique experiences. Real-time mobile TV broadcasting in Europe is unlikely before 2007 due to technical and standardization challenges. Trials using terrestrial TV masts and technologies like DVB-H are underway, but cost, infrastructure, and user preferences remain barriers. Additionally, the rise of digital video recorders and video-on-demand services may reduce demand for mobile TV. Meanwhile, smartphones are becoming more powerful, with shipments expected to grow significantly, reaching 117 million units by 2009.", "reference": "The service uses 3GP technology, one of the standards for mobile TV.A service from the Norwegian Broadcasting Corporation lets people watch TV programmes on their mobiles 24 hours a day.\"Mobile phone music services must not be positioned to compete with the PC music experience as the handsets are not yet ready,\" said Thomas Husson, mobile analyst at Jupiter research.A separate study by Gartner has also said real-time TV broadcasts to mobiles is \"unlikely\" in Europe until 2007.Mobile TV will have to overcome several barriers before it is widely taken up though, said the report.Despite moves to bring music download services to mobiles, people do not want to trade multimedia services with size and battery life, said Jupiter.Various standards and ways of getting TV signals to mobiles are being worked on globally.But, the Gartner report on mobile TV broadcasting in Europe suggests direct broadcasting will have to wait.But at the end of 2004, the European Telecommunications Institute (Etsi) formally adopted Digital Video Broadcasting Handheld (DVB-H) as the mobile TV broadcasting standard for Europe.Digital video recorders, like Europe's Sky+ box, and video-on-demand services mean people have much more control over what TV they watch.In the US, services like TiVo To Go let people transfer pre-recorded TV content onto their phones.People are also likely to be put off watching TV on such small screens, said Gartner.TV services will have to live up to the expectations of the digital TV generation too, which expects good quality images at low prices, according to analysts."}