{"raw_text": "Concern over RFID tags\n \n Consumers are very concerned about the use of radio frequency ID (RFID) tags in shops, a survey says.\n \n More than half of 2,000 people surveyed said they had privacy worries about the tags, which can be used to monitor stock on shelves or in warehouses. Some consumer groups have expressed concern that the tags could be used to monitor shoppers once they had left shops with their purchases. The survey showed that awareness of tags among consumers in Europe was low. The survey of consumers in the UK, France, Germany and the Netherlands was carried out by consultancy group Capgemini. The firm works on behalf of more than 30 firms who are seeking to promote the growth of RFID technology. The tags are a combination of computer chip and antenna which can be read by a scanner - each item contains a unique identification number.\n \n More than half (55%) of the respondents said they were either concerned or very concerned that RFID tags would allow businesses to track consumers via product purchases. Fifty nine percent of people said they were worried that RFID tags would allow data to be used more freely by third parties. Ard Jan Vetham, Capgemini's principal consultant on RFID, said the survey showed that retailers needed to inform and educate people about RFID before it would become accepted technology. \"Acceptance of new technologies always has a tipping point at which consumers believe that benefits outweigh concerns. \"With the right RFID approach and ongoing communication with consumers, the industry can reach this point.\" He said that the survey also showed people would accept RFID if they felt that the technology could mean a reduction in car theft or faster recovery of stolen items. The tags are currently being used at one Tesco distribution centre in the UK - the tags allow the rapid inventory of bulk items. They are also in use as a passcard for the M6 Toll in the Midlands, in the UK. Mr Vetham said the majority of people surveyed (52%) believed that RFID tags could be read from a distance. He said that was a misconception based on a lack of awareness of the technology. At least once consumer group - Consumers Against Supermarket Privacy Invasion and Numbering (Caspian) - has claimed that RFID chips could be used to secretly identify people and the things they are carrying or wearing. All kinds of personal belongings, including clothes, could constantly broadcast messages about their whereabouts and their owners, it warned.\n", "llama3.2:1b": "Consumers in Europe have expressed concerns over the use of radio frequency ID (RFID) tags in shops due to potential tracking of shoppers once they leave. A survey of 2,000 people found that more than half were concerned or very concerned about RFID tags allowing businesses to track consumers via product purchases and using data for third-party purposes.", "llama3.2:3b": "Consumers in the UK, France, Germany, and the Netherlands are concerned about the use of RFID tags, with more than half expressing privacy worries. They believe RFID tags can be used to track consumers via product purchases and data will be shared with third parties. The industry needs to inform and educate people about RFID before it's accepted technology, according to a survey by Capgemini.", "gemma2:2b": "Consumers express privacy concerns about RFID tags used in shops for inventory tracking and potential misuse by third parties. Awareness of RFID technology is low among consumers. Some argue for increased education on the benefits of RFID while others raise concerns about its use for surveillance and data sharing. \n", "qwen2.5:0.5b": "Concerns over RFID tags among consumers are high, with 55% concerned or very concerned that businesses can track customers using the RFID system. RFID tags allow businesses to read and transmit data from items as they move through a store, potentially allowing for more accurate inventory tracking and faster recovery of stolen goods. While there is ongoing discussion about potential risks associated with this technology, such as potential use by third parties, some consumers are concerned that their privacy could be compromised.", "qwen2.5:1.5b": "Over 50% of consumers surveyed in Europe expressed privacy concerns about radio frequency ID (RFID) tags used for tracking purposes. The technology has the potential to monitor purchases and track shoppers once they leave stores, raising security worries but also offering benefits like reducing car theft or faster recovery of stolen items with RFID at Tesco and M6 Toll. Consumers are not well informed about RFID technology's widespread use.", "qwen2.5:3b": "Concern over RFID tags is widespread among consumers, with half expressing privacy worries due to potential tracking via product purchases or data misuse by third parties. Awareness is low in Europe. Retailers need to inform and educate consumers before RFID technology can be accepted. Some people accept the technology if it promises benefits like reducing car theft or speeding up stolen goods recovery. However, there are concerns about the tags potentially being read from a distance, which could lead to privacy invasions. Consumers Against Supermarket Privacy Invasion and Numbering (Caspian) has raised these issues.", "opencoder:1.5b": "Concern over RFID tags: Consumers are very concerned about the use of radio frequency identification (RFID) tags in shops.\n\nMore than half of 2,000 people surveyed indicated a concern about RFID tags being used for surveillance or inventory purposes. Consumer groups reported concerns that the tags could be monitored by shoppers without leaving them at checkout. Surveys from a consulting group like Capgemini showed that awareness among consumers was low in Europe. In surveys conducted in the UK, France, Germany, and Netherlands, the firm worked on behalf of several firms seeking to expand RFID technology.\n\nMore than 55% of respondents expressed concerns about whether RFID tags would allow businesses to track consumers based on product purchases. Ninety-nine percent said they were concerned about data being used for commercial purposes. The company reported that retailers needed to educate people about RFID before it became widely accepted technology, and the industry can reach this point with ongoing communication.\n\nThe majority of respondents (52%) believed that RFID tags could be read from a distance, a misconception based on a lack of awareness of the technology. At least once Consumer Groups - Consumers Against Supermarket Privacy Invasion and Numbering (Caspian) - have reported that RFID chips could potentially identify people and things they're carrying or wearing, suggesting a secretive use.\n\nThe tags are being used in one Tesco distribution centre in the UK for rapid inventory of bulk items. They are also being used as passcards for the M6 Toll in the Midlands, although these aren't necessarily about theft but are more related to the physicality of the tag.\n", "smollm:1.7b": "Concern over RFID tags is a widespread issue among consumers in Europe, with more than half of respondents expressing worries about privacy concerns. The survey showed that awareness of RFID tags was low, but the majority of people believed they could be read from a distance. This misconception based on lack of knowledge about the technology is a major concern for retailers and manufacturers who want to implement RFID technology.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text concisely while preserving the key ideas and details. Let's break down each part.\n\nThe main concern is consumer worry about RFID tags in shops. The survey found that over half of 2000 people surveyed expressed concerns about privacy. They worried that tags could monitor shoppers after they leave, which might be a red flag for brands trying to target customers.\n\nCapgemini, the consultancy, did a study on Europe and other countries. The survey was conducted by them, not Capgemini per se but their company's work on promoting RFID. RFID tags are a combination of computer chip and antenna; each item has a unique number. That makes sense because tracking items would require precise identification.\n\nPeople were aware that RFID is in use now, especially at places like Tesco's distribution center and M6 Toll in the UK. They said some stores already use RFID for bulk inventory or toll payments. The initial impact was rapid and cost-effective, which is a plus but might be seen as a security risk if tracked.\n\nVetham, Capgemini's consultant, emphasized that acceptance of new technologies like RFID doesn't happen overnight. It needs proper marketing and communication with consumers. He also pointed out that the tags could potentially reduce theft or recovery issues, which is a business advantage.\n\nHowever, there are concerns too. Some believe RFID can be read from distance, which might not be secure. Consumer groups like Caspian have warned against RFID being used for personal identification, suggesting it could target people instead of products. This could lead to privacy issues if the tags track someone's location or物品.\n\nPutting this all together, I should highlight the main concerns about privacy and potential misuse, mention Capgemini's role in conducting the study, talk about current usage examples, and address both positive uses like cost-effective tracking and negative risks like security concerns. Also, include Caspian's warning about identity theft using RFID.\n</think>\n\nConsumers are highly concerned about RFID tags, with over half surveyed expressing privacy worries. They worry that these tags could monitor shoppers after purchases, potentially raising red flags for brands. The survey also highlighted awareness levels across Europe and other countries, as Capgemini conducted the study. RFID uses computer chips and antennas to track items uniquely, commonly found in places like Tesco's distribution center and M6 Toll in the UK. People were unaware that the technology could improve security or reduce theft. However, some concern about reading tags from distance might pose privacy risks. While RFID is effective for bulk tracking, its potential misuse, such as secretly identifying individuals, has sparked worries.", "tinyllama:1.1b": "Consumer concerns about RFID tags led to a survey by consultancy firm Capgemini, which revealed that half of those surveyed were either concerned or very concerned regarding RFID scanning for tracking consumer purchases via product stocks. The majority of respondents (52%) believed that RFID tags could be read from a distance, while only 37% thought they would allow businesses to track consumers via purchase data. While consumers were aware of the technology's potential privacy concerns, the survey showed people would accept RFID scanning if it meant a reduction in car theft or faster recovery of stolen goods. CaSPian, an anti-privacy campaign group that claimed that RFID tags could be used to secretly identify individuals and wearables, was also mentioned as another example of consumers' misconceptions about RFID technology.", "tinydolphin:1.1b": " The issue of concern over radio frequency identification (RFID) tags is a major topic of debate in various regions, particularly Europe and the United States. \n\nThis concern arises due to the potential use of these tags for tracking consumers' purchases, as well as for monitoring their movements or activities. There have been numerous instances where consumers have been concerned about the use of RFID tags for surveillance purposes.\n\nThe survey conducted by Capgemini indicates that approximately half of the respondents are concerned about the use of RFID tags in shops and warehouses, while only 10% of people surveyed feel completely safe with these technologies. This concern is particularly relevant given the increasing adoption of smart devices, such as smartphones, which contain RFID chips.\n\nIn response to this growing concern, Capgemini suggests that businesses need to educate consumers about the benefits of RFID before implementing these technology-driven solutions. The firm also emphasizes the importance of a well-thought-out approach to the implementation of RFID in order to minimize consumer privacy concerns and maximize its potential for enhancing customer experience.\n\nAs more people become aware of the implications of RFID tags on their personal data, there is a growing call for a tipping point where consumers believe that benefits outweigh concerns. This could potentially lead to greater acceptance of these technologies and may pave the way for future innovations in this area.", "phi:2.7b": " A survey found that consumers in Europe are concerned about the use of radio frequency ID (RFID) tags in shops. The majority of respondents were worried about the potential for businesses to track them via product purchases or the free-flowing of data by third parties. However, people would accept RFID technology if they believed it could reduce car theft or speed up the recovery of stolen items. RFID tags are currently being used at a Tesco distribution centre and as a passcard for the M6 Toll in the UK. \n", "orca-mini:3b": " Concern is expressed by consumers over radio frequency ID (RFID) tags in shops, according to a survey. More than half of 2,000 people surveyed said they had privacy worries about the tags, which can be used to monitor stock on shelves or in warehouses. Some consumer groups have expressed concern that the tags could be used to monitor shoppers once they had left shops with their purchases. The survey showed that awareness of tags among consumers in Europe was low. The survey of consumers in the UK, France, Germany and the Netherlands was carried out by consultancy group Capgemini. The firm works on behalf of more than 30 firms who are seeking to promote the growth of RFID technology. The tags are a combination of computer chip and antenna which can be read by a scanner - each item contains a unique identification number.", "hermes3:3b": "Consumers worried about privacy over RFID tags, survey finds\n- Over half concerned with tracking via product purchases (55%)\n- 59% worried about data usage by third parties\n- Retailers need to inform and educate consumers about RFID benefits", "stablelm-zephyr:3b": "Consumers express significant concerns over RFID tags in shops, with privacy being a major concern. More than half of those surveyed (55%) believe that the technology allows businesses to track consumers through product purchases. The right approach and ongoing communication could lead to acceptance of RFID, especially if it means reduced car theft or faster recovery of stolen items. Misconceptions about the technology's distance reading capabilities persist among the public. Retailers need to inform and educate consumers on RFID before it becomes widely accepted.", "stablelm2:1.6b": "Consumers express privacy concerns over radio frequency ID (RFID) tags used in shops for monitoring stock and potential tracking of shoppers. Capgemini conducted a survey of UK, France, Germany, and Netherlands residents, finding low awareness of tags among consumers. 67% expressed worry about using RFID to track data more freely by third parties. Retailers must inform and educate people before RFID becomes accepted technology. Misconception that RFID tags can be read from distance is based on lack of awareness. RFID could reduce car theft or improve recovery of stolen items, but privacy concerns remain. Some consumer groups fear that RFID chips might identify individuals and their belongings.", "granite3.1-dense:2b": "A survey of 2,000 consumers across UK, France, Germany, and the Netherlands reveals significant privacy concerns regarding RFID tags, which track inventory but are also feared to monitor shoppers post-purchase. Over half (55%) expressed worry about businesses tracking them via purchases, while 59% were concerned about data misuse by third parties. The survey, conducted by Capgemini for firms promoting RFID technology, found that people underestimate the tags' readability range due to lack of awareness. Despite these concerns, 52% believed RFID could be read from a distance. Retailers need to educate consumers about RFID's benefits, such as reducing car theft and speeding up stolen item recovery, to gain acceptance for this technology. Consumer groups like Consumers Against Supermarket Privacy Invasion and Numbering (Caspian) warn of potential misuse for tracking people and their belongings.", "chatgpt-4o-latest": "A survey of 2,000 consumers in the UK, France, Germany, and the Netherlands found that more than half were concerned about RFID tags, fearing they could be used to track shoppers and share data with third parties. Awareness of RFID technology was low, and consumer groups like Caspian warned that RFID chips could secretly identify people and their belongings. Capgemini, which conducted the survey, emphasized the need for retailers to educate consumers to increase acceptance. The survey also indicated that people might support RFID if it helped reduce car theft or recover stolen items. Currently, RFID tags are used in a Tesco distribution center and as a passcard for the M6 Toll in the UK. Many respondents mistakenly believed RFID tags could be read from a distance, highlighting a lack of understanding of the technology.", "reference": "Mr Vetham said the majority of people surveyed (52%) believed that RFID tags could be read from a distance.He said that the survey also showed people would accept RFID if they felt that the technology could mean a reduction in car theft or faster recovery of stolen items.Fifty nine percent of people said they were worried that RFID tags would allow data to be used more freely by third parties.Ard Jan Vetham, Capgemini's principal consultant on RFID, said the survey showed that retailers needed to inform and educate people about RFID before it would become accepted technology.More than half (55%) of the respondents said they were either concerned or very concerned that RFID tags would allow businesses to track consumers via product purchases.Consumers are very concerned about the use of radio frequency ID (RFID) tags in shops, a survey says.At least once consumer group - Consumers Against Supermarket Privacy Invasion and Numbering (Caspian) - has claimed that RFID chips could be used to secretly identify people and the things they are carrying or wearing.The survey showed that awareness of tags among consumers in Europe was low."}