{"raw_text": "Kenyan school turns to handhelds\n \n At the Mbita Point primary school in western Kenya students click away at a handheld computer with a stylus.\n \n They are doing exercises in their school textbooks which have been digitised. It is a pilot project run by EduVision, which is looking at ways to use low cost computer systems to get up-to-date information to students who are currently stuck with ancient textbooks. Matthew Herren from EduVision told the BBC programme Go Digital how the non-governmental organisation uses a combination of satellite radio and handheld computers called E-slates. \"The E-slates connect via a wireless connection to a base station in the school. This in turn is connected to a satellite radio receiver. The data is transmitted alongside audio signals.\" The base station processes the information from the satellite transmission and turns it into a form that can be read by the handheld E-slates. \"It downloads from the satellite and every day processes the stream, sorts through content for the material destined for the users connected to it. It also stores this on its hard disc.\"\n \n The system is cheaper than installing and maintaining an internet connection and conventional computer network. But Mr Herren says there are both pros and cons to the project. \"It's very simple to set up, just a satellite antenna on the roof of the school, but it's also a one-way connection, so getting feedback or specific requests from end users is difficult.\"\n \n The project is still at the pilot stage and EduVision staff are on the ground to attend to teething problems with the Linux-based system. \"The content is divided into visual information, textual information and questions. Users can scroll through these sections independently of each other.\" EduVision is planning to include audio and video files as the system develops and add more content. Mr Herren says this would vastly increase the opportunities available to the students. He is currently in negotiations to take advantage of a project being organised by search site Google to digitise some of the world's largest university libraries. \"All books in the public domain, something like 15 million, could be put on the base stations as we manufacture them. Then every rural school in Africa would have access to the same libraries as the students in Oxford and Harvard\" Currently the project is operating in an area where there is mains electricity. But Mr Herren says EduVision already has plans to extend it to more remote regions. \"We plan to put a solar panel at the school with the base station, have the E-slates charge during the day when the children are in school, then they can take them home at night and continue working.\" Maciej Sundra, who designed the user interface for the E-slates, says the project's ultimate goal is levelling access to knowledge around the world. \"Why in this age when most people do most research using the internet are students still using textbooks? The fact that we are doing this in a rural developing country is very exciting - as they need it most.\"\n", "llama3.2:1b": "A Kenyan school has implemented a handheld computer system called E-slates, which connects to a satellite radio and downloads information from a base station. The system uses Linux-based software and can display visual, textual, and question content independently of each other. The project is still in pilot stage, but EduVision staff are working on addressing teething problems. The goal is to provide access to knowledge for students in rural areas, with plans to extend the service to more remote regions using solar power.", "llama3.2:3b": "EduVision pilot project uses handheld computers and satellite radio to provide up-to-date information to Kenyan students, replacing ancient textbooks. The system is cheaper than internet connection but has limitations on feedback and requests. It is currently being expanded to remote regions with solar power and plans to include audio and video files, aiming to level access to knowledge worldwide.", "gemma2:2b": "EduVision uses handheld computers called E-slates and satellite technology to deliver digitized school materials to students in Kenya. \n  These devices connect via wireless connection to a base station, which then processes the data for the E-slates. The system provides access to visual, textual, and question-based learning content.  \nEduVision plans to expand the project to more remote regions by using solar panels for off-grid power. \nThe ultimate goal of the project is to provide universal access to knowledge, especially in developing countries where access to information resources is limited. \n", "qwen2.5:0.5b": "Kenyan school uses handheld computers for online learning, with EduVision's E-slates connecting to satellite radio receiver. Data transmitted is then processed and stored locally. Content includes visual information, textual information and audio/video files. Project plans to digitize libraries in remote areas, using solar panel charging system during school hours.", "qwen2.5:1.5b": "A Kenyan school uses E-slates, which connect via satellite radio and wireless to process digitized textbook content through an EduVision Linux-based system. The project aims to provide updated educational resources for students without internet access or conventional computer networks, with plans to expand coverage beyond remote regions with solar-powered solutions.", "qwen2.5:3b": "At Mbita Point primary school in western Kenya, students use digitized textbooks on handheld computers called E-slates for exercises. This pilot project by EduVision uses low-cost computer systems and satellite radio to provide up-to-date information to students with outdated textbooks. The system connects via a wireless connection to a base station that processes data from a satellite receiver. While simple to set up, it has one-way communication limitations. Currently at the pilot stage, EduVision is negotiating to include audio and video files in the content for broader student access. They aim to extend this project to remote areas with solar panels and are planning to digitize millions of university books to make them accessible to all rural schools worldwide. The ultimate goal is to level access to knowledge globally, especially crucial in developing countries.", "opencoder:1.5b": "Kenyan school turns to handhelds\n\nAt the Mbita Point primary school in western Kenya students click away at a handheld computer with a stylus. They are doing exercises in their school textbooks which have been digitised. The pilot project run by EduVision is looking at ways to use low cost computer systems to get up-to-date information to students who are currently stuck with ancient textbooks. Matthew Herren from EduVision told the BBC programme Go Digital how the non-governmental organisation uses a combination of satellite radio and handheld computers called E-slates. \"The E-slates connect via a wireless connection to a base station in the school. This in turn is connected to a satellite radio receiver. The data is transmitted alongside audio signals.\" The base station processes the information from the satellite transmission and turns it into a form that can be read by the handheld E-slates. \"It downloads from the satellite and every day processes the stream, sorts through content for the material destined for the users connected to it. It also stores this on its hard disc.\"\n\nEduVision is planning to include audio and video files as the system develops and add more content. Mr Herren says there are both pros and cons to the project. \"It's very simple to set up, just a satellite antenna on the roof of the school, but it's also a one-way connection, so getting feedback or specific requests from end users is difficult.\" The project is still at the pilot stage and EduVision staff are on the ground to attend to teething problems with the Linux-based system. \"The content is divided into visual information, textual information and questions. Users can scroll through these sections independently of each other.\" Currently the project is operating in an area where there is mains electricity. But Mr Herren says EduVision already has plans to extend it to more remote regions. \"We plan to put a solar panel at the school with the E-slates, have the E-slates charge during the day when the children are in school, then they can take them home at night and continue working.\" Maciej Sundra, who designed the user interface for the E-slates, says the project's ultimate goal is levelling access to knowledge around the world. \"Why in this age when most people do most research using the internet are students still using textbooks? The fact that we are doing this in a rural developing country is very exciting - as they need it most.\"\n", "smollm:1.7b": "The summary above captures the main ideas and key details of the text, preserving the original meaning and tone. It does not include any explanations or justifications for the project's decisions or actions. The focus remains on the project itself, its goals, and its potential impact.", "deepseek-r1:1.5b": "<think>\nOkay, so I have this text about Kenyan primary school students using handheld computers with styluses to access digitized textbooks. The user wants me to summarize it concisely, keeping only the key ideas and details without any explanations or formatting.\n\nFirst, I'll read through the text carefully to identify the main points. It starts by talking about the school in western Kenya where students are using these handheld computers with styluses to access digitized textbooks. That's a clear key point.\n\nNext, it mentions that this is part of a pilot project run by EduVision. They're working on using low-cost computer systems and satellite radio to get up-to-date information from ancient books. I need to note the method they're using—satellite radio connected to E-slates which connect wirelessly to base stations.\n\nThe text also says that while the system is cheaper than installing an internet connection, it has pros and cons. The setup is simple with just a satellite antenna, but users can't request specific info easily. That's important because it tells me about the challenges of this project.\n\nThen there's mention of the content being divided into visual, textual, and questions sections, allowing independent scrolling. They're planning to add audio and video files as development progresses. This highlights the future potential and features of their system.\n\nThey plan to expand beyond developed countries with solar panels, using base stations powered by solar energy. The ultimate goal is making knowledge accessible worldwide for students. There's an exciting aspect here about rural areas needing education more than cities do.\n\nPutting this all together, I need to condense it into a concise summary without losing these key elements: the setup, the method used, pros and cons, content features, future plans, and the broader goal.\n</think>\n\nThe Kenyan primary school uses handheld computers with styluses to access digitized textbooks for students. This is part of a pilot project by EduVision using satellite radio and E-slates connected wirelessly via base stations in schools. The system processes data from satellite transmission, downloads content, and stores it. The setup is simple but lacks immediate user interaction beyond remote requests. Content includes visual, textual, and question sections with independent scrolling. Future expansions include audio/video files and solar panel integration to reach more rural areas.", "tinyllama:1.1b": "The handheld computers at a primary school in western Kenya have been connected to a satellite radio receiver, allowing for easy access to up-to-date information and content. The E-slates, connected via wireless connections from the base station, process the stream data from the satellite transmission and store it on a hard disc. The pilot project is aimed at providing low-cost computer systems to rural schools in Africa, with plans to expand into more remote regions. EduVision plans to add audio and video content and increase access to knowledge through the digitization of public domain libraries, currently operating in an area with mains electricity. The ultimate goal is to provide universal access to knowledge around the world, using the internet as a tool for leveling access to information for students in rural areas.", "tinydolphin:1.1b": " Kenyan school turns to handhelds to improve access to education with the help of EduVision. This innovative project leverages satellite technology, along with low-cost computer systems and E-slates, to provide students with up-to-date information. The E-slate connects to a base station in the school through satellite radio, while the base station processes the information from satellite transmission and turns it into a form that can be read by the handheld E-slates.", "phi:2.7b": " A Kenyan school is piloting a project where students use handheld computers to access digitized textbooks. EduVision uses satellite radio and a base station to transmit information from a server to the E-slates, which download and process the data. The system is cheaper than an internet connection but has limited features. As the project develops, it could provide more opportunities for rural school students, who currently have access only to outdated textbooks.\n", "orca-mini:3b": " A Kenyan school is piloting a handheld computer system with a stylus to access digitized educational resources, using low-cost computer systems to bring up-to-date information to students who have outdated textbooks. The project is run by EduVision, which uses a combination of satellite radio and handheld computers called E-slates, and plans to extend it to more remote regions with solar-powered bases.", "hermes3:3b": "Kenyan school uses handheld computers (E-slates) for digitized exercises, connected via satellite radio to provide updated content to students with old textbooks.", "stablelm-zephyr:3b": "Mbita Point primary school in western Kenya is using handheld computers called E-slates for educational purposes. These low-cost computer systems are part of a pilot project by EduVision, which aims to provide up-to-date information to students via satellite radio and wireless connection. The system is cheaper than installing and maintaining traditional internet connections or conventional networks. However, it's a one-way connection with limited feedback opportunities. As the project progresses, EduVision plans to include audio and video files and expand access to rural schools in Africa and other regions.", "stablelm2:1.6b": "Mbita Point primary school in western Kenya uses handheld computers (E-slates) connected via satellite radio to digitize their textbooks. EduVision runs the pilot project, which uses E- slates and base stations to provide up-to-date information to students who previously used ancient textbooks. The system is cheaper than internet connections and computer networks but has a one-way connection aspect. Although still in the pilot stage, EduVision plans to expand the project to remote areas powered by solar panels to offer access to global libraries for rural schools in Africa.", "granite3.1-dense:2b": "At Mbita Point primary school in western Kenya, a pilot project by EduVision utilizes low-cost handheld computers (E-slates) connected via satellite radio to a base station. This system digitizes textbooks, providing up-to-date information for students with outdated resources. The project involves downloading content daily from satellites, processing it for E-slab users, and storing it on the hard disc. Despite being cheaper than traditional internet or computer networks, the one-way connection lacks feedback capabilities.\n\nEduVision staff are present to address technical issues with the Linux-based system. Content includes visual information, textual material, and questions, allowing users to access each section independently. The project aims to incorporate audio and video files for enhanced learning experiences. Currently operational in areas with mains electricity, EduVision plans to extend it to more remote regions by installing solar panels to power the base station and charge E-slates during school hours, enabling continued use at home.\n\nThe ultimate goal is to bridge global knowledge gaps, especially benefiting students in developing countries where internet access is limited.", "chatgpt-4o-latest": "A Kenyan school is piloting a project using handheld computers called E-slates to provide students with digitized textbooks. Run by the NGO EduVision, the system uses satellite radio to transmit educational content to a base station, which then wirelessly connects to the E-slates. This method is more affordable than traditional internet connections but has limitations, such as one-way communication. The project aims to expand by incorporating audio and video content and leveraging Google's initiative to digitize university libraries, potentially giving rural African schools access to vast academic resources. Future plans include using solar power to extend the system to remote areas, with the ultimate goal of equalizing global access to knowledge.", "reference": "The base station processes the information from the satellite transmission and turns it into a form that can be read by the handheld E-slates.\"The E-slates connect via a wireless connection to a base station in the school.It is a pilot project run by EduVision, which is looking at ways to use low cost computer systems to get up-to-date information to students who are currently stuck with ancient textbooks.\"We plan to put a solar panel at the school with the base station, have the E-slates charge during the day when the children are in school, then they can take them home at night and continue working.\"Then every rural school in Africa would have access to the same libraries as the students in Oxford and Harvard\" Currently the project is operating in an area where there is mains electricity.Matthew Herren from EduVision told the BBC programme Go Digital how the non-governmental organisation uses a combination of satellite radio and handheld computers called E-slates.But Mr Herren says there are both pros and cons to the project.\"It's very simple to set up, just a satellite antenna on the roof of the school, but it's also a one-way connection, so getting feedback or specific requests from end users is difficult.\"But Mr Herren says EduVision already has plans to extend it to more remote regions.At the Mbita Point primary school in western Kenya students click away at a handheld computer with a stylus.EduVision is planning to include audio and video files as the system develops and add more content."}