{"raw_text": "'Friends fear' with lost mobiles\n \n People are becoming so dependent on their mobile phones that one in three are concerned that losing their phone would mean they lose their friends.\n \n More than 50% of mobile owners reported they had had their phone stolen or lost in the last three years. More than half (54%) of those asked in a poll for mobile firm Intervoice said that they do not have another address book. A fifth rely entirely on mobiles. About 80% of UK adults own at least one mobile, according to official figures. It is estimated that 53% of over 65s own a mobile, according to Intervoice, but the figures are higher for those aged between 15 and 34.\n \n Most 15 to 24-year-olds (94%), and 25 to 34-year-olds (92%), own at least one. Nineteen percent of mobile owners were more concerned about how long it would take to find their contacts' information again if the phone was lost, stolen or replaced.\n \n The survey showed that extent to which people have become reliant on their phones as address book. Many mobile owners do not bother to make back-ups of their contact details, and with people changing their phones once a year on average, it becomes a problem. They also are becoming less likely to remember numbers by heart, relying on the mobile phone book instead. \"We're a nation of lazy so-and-sos,\" David Noone from Intervoice said. \"We put the numbers in our phones so we can call a friend at the touch of just one or two buttons and we certainly can't be bothered to write them down in an old fashioned address book. \"The mobile phone plays such a key role in modern relationships; take the phone away and the way we manage these relationships falls apart.\" One in three women, the survey said, thought if they lost their phones, it would mean they would lose touch with people altogether. Most (62%) said they had no idea what their partner's number was. Mr Noone said it should be up to mobile operators to provide back-up services on the network itself, instead of relying on mobile owners to find ways themselves.\n \n Generally, information from Sim cards can be backed up on physical memory cards, or can be copied onto computers via cables if the phone is a smartphone model with the right software. Sim back-up devices can be bought from phone shops for just a few pounds.\n \n But some operators offer customers free web-based back-up services too. Orange told the BBC News website that those with Orange Smartphones could use the My Phone syncing service which means back-ups of address books and other data are created online. For non-smartphone users, a Memory Mate card could be used to back up data on the phone. O2 also offers a free, web-based syncing service which works over GPRS and GSM. Neither Vodafone or T-Mobile currently offer a free network service for back-ups, but encourage people to use Sim back-up devices. It is thought that about 10,000 phones are lost or stolen every month and 50% of total street crime involves a mobile. Mobile phone sales are expected to continue growing over the next year. Globally, more than 167 million mobile phones were sold in the third quarter of 2004, 26% more than the previous year, according to analysts. It is predicted that there will be two billion handsets in use worldwide by the end of 2005.\n", "llama3.2:1b": "People are becoming increasingly dependent on their mobile phones and fear losing them would mean they lose friends due to a lack of address books. Over half (54%) of those polled reported losing or having their phone stolen, and more than a fifth rely entirely on mobiles. Mobile owners often have difficulty making back-ups of contact details and may not remember numbers by heart. The survey found that 62% thought they would lose touch with people if they lost their phones.", "llama3.2:3b": "People are increasingly dependent on their mobile phones and concerned about losing them, with one in three worried they'll lose friends.\n \n More than half (54%) of mobile owners report not having another address book, while a fifth rely entirely on mobiles.\n \n The survey also found that 19% of mobile owners are more concerned about finding their contacts' information again if the phone is lost or stolen.\n \n Mobile operators can provide back-up services on their networks to prevent this issue, but currently only offer this for some customers.", "gemma2:2b": "Over half of mobile phone owners have had their phone stolen or lost. Many rely on phones for contact information and are less likely to remember numbers by heart. Mobile phone dependence has led to a reliance on phones as address books, and there is a lack of backup services offered by many networks. While some networks offer online back-up services, SIM card back-up devices and memory cards can also be used.  More than 167 million mobile phones were sold in the third quarter of 2004 and are expected to grow even more in the coming years. \n", "qwen2.5:0.5b": "Mobile phone dependence is so high among people that they are worried about losing their phones, with over 50% reporting having had their phone stolen or lost recently. Most users rely on their mobiles for a long time to come, using them instead of other forms of address book and doing less remembering numbers by heart than before. Some operators offer back-up services via the internet.", "qwen2.5:1.5b": "Mobile phone owners worry about losing their friends due to reliance on phones as address books; nearly half of UK adults own a mobile, with younger users more likely to rely on them for contacts and addresses being harder to remember. Many don't back up contact information, leading to concerns about how long it takes to find lost or replaced phones' contacts. Some operators offer free backup services through web-based systems, but phone shops sell Sim cards for backup.", "qwen2.5:3b": "'Friends fear' with lost mobiles: One-third of people are worried about losing their phone leading to loss of friends; over half have had a stolen or lost phone in last three years, mostly relying on phones as address books. Intervoice found that 94% of 15-24-year-olds and 92% of 25-34-year-olds own at least one mobile. Mobile owners often do not backup contact details, leading to forgetfulness about phone numbers. Operators should provide backup services, with Orange and O2 offering free web-based back-up services. About 10,000 phones are lost or stolen monthly; mobile sales expected to grow globally by next year.", "opencoder:1.5b": "The output from this prompt would be a summary of the given text content, preserving key ideas and details while omitting explanations and reasoning processes.\n", "smollm:1.7b": "The summary should contain only the main ideas and key details from the original text. The following information should be preserved:\n\n1. The title \"Friends fear\" with lost mobiles.\n2. The statement that more than half of mobile owners reported they had had their phone stolen or lost in the last three years.\n3. The statistic that 80% of over 65s own a mobile, but this figure is higher for younger people.\n4. The fact that most mobile owners do not bother to make back-ups of their contact details.\n5. The statement that extent to which people have become reliant on their phones as address book.\n6. The fact that 94% of mobile owners own a phone and 100% of them own a mobile phone book.\n7. The statistic that most mobile owners do not bother to make back-ups of their contact details, but this figure is higher for younger people.\n8. The statement that the mobile phone plays such a key role in modern relationships and it would be difficult to manage these relationships without a mobile phone.\n9. The fact that 62% of mobile owners think if they lost their phone, it would mean they would lose touch with people altogether.\n10. The statistic that some operators offer customers free back-up services.", "deepseek-r1:1.5b": "<think>\nAlright, I need to help the user summarize a given text. They want only the summary as plain text without any explanations or additional formatting.\n\nFirst, let me read through the text carefully. It's about mobile phone dependency and issues like losing contacts when phones are lost. Key points include that one in three people lose friends if their phone is stolen or lost. Over half of mobile owners had their phones stolen or lost. Half owned no address book at all. Only 54% mentioned not having another contact list. A fifth entirely relied on mobiles. UK stats show many own them, with over 90% owning at least one. The survey found that many are becoming reliant on their phones as addresses, and people lose their number more easily now.\n\nThe response should capture all these key ideas: dependency, lost contacts, percentage of ownership, phone theft statistics, reliance on address books, concerns about finding contact info when phone is lost, mention of operators offering back-ups, and future sales stats.\n\nI need to make sure the summary includes all main points without getting too detailed. Also, I should keep it concise and only output the summary in plain text.\n</think>\n\nFriends lose their friendship if their mobile phone is stolen or lost; over half of mobile owners reported losing contact info in three years; 54% said they had no other address book; a fifth relied entirely on phones; UK stats show 94% of 15-24-year-olds and 92% of 25-34-year-olds own at least one mobile; 80% of UK adults own at least one; 53% of over 65s and 57% of those between 15-34 own phones; many are reliant on their phones, fearing losing contacts; most worried about lost data recovery time; survey found many lost contacts, people lose their numbers more easily; phone owners use back-ups like sim cards or sync services; operators offer free sync and backup; mobile sales are expected to grow; stats show over 90% of UK adults own at least one; globally, by end 2005, around 167 million mobiles sold in Q3 2004; predicted to reach 2 billion mobiles by end 2005.", "tinyllama:1.1b": "The survey conducted by Intervoice reveals that among the UK's mobile phone owners, 15% are more concerned about how long it would take to find their contacts' information again if their phones were lost or stoled, compared to just 9% of non-phone owners. The majority (94%) of respondents stated they have become so reliant on their mobile phones that they feel a sense of loss when losing them. Almost half (54%) reportedly trusted their phone more than people they know, while more than 80% of adults and over 25-year-olds own at least one. Mobile phone operators are urged to provide free back-up services for Sim cards or web-based backups for non-smartphone users. Furthermore, mobile phone sales are expected to grow in the next year, with more than 167 million handsets sold globally as of the third quarter of 2004, an increase of 26% from the previous year.", "tinydolphin:1.1b": " The text provided discusses the increasing reliance on mobile phones and its impact on relationships. Many people are now less inclined to remember phone numbers by heart, relying solely on their smartphones for address book information. Mobile phone owners also become less likely to make back-ups of their contact details, relying instead on the operator's back-up services. This is concerning as it puts them at risk if their phones are lost or stolen. The survey found that about 19% of mobile owners had a difficulty in finding their contacts' information again if they were missing. Many mobile phone users do not take measures to protect their address books, with only one in three keeping copies on paper or using an address book application like Sim. Mobile operators are now offering free web-based back-up services for certain types of phones, such as those with Orange Smartphones and memory cards. However, this service might not be accessible to everyone. The rise in mobile phone thefts has also contributed to the issue, with over 50% of street crime involving a mobile phone. The International Telecommunication's Association (ITU) predicts that there will be two billion handsets in use worldwide by the end of 2005.", "phi:2.7b": " The text discusses how people have become dependent on their mobile phones and are concerned about losing them as they may lose touch with friends. More than half of those who responded to a poll reported having had their phone stolen or lost, and many rely solely on their phones for contact information. Most adults own at least one mobile, but the figures are higher for younger people. The survey showed that people do not make back-ups of their contacts' information and can't be bothered with address books. Mobile operators could provide better back-up services to help customers.\n", "orca-mini:3b": " A survey found that people are becoming too dependent on their mobile phones and one in three worry losing their phone would mean losing their friends. More than a fifth rely entirely on mobiles. Most young adults own at least one, but 19% of mobile owners were concerned about how long it would take to find their contacts' information again if they lost their phone. The survey revealed that people are becoming less likely to remember numbers by heart and rely on the mobile phone book instead. Mobile operators should provide back-up services on the network itself, but some offer free web-based back-up services too.", "hermes3:3b": "People increasingly reliant on mobiles, with 1/3 worried losing phone would mean losing friends. 80% UK adults own at least one mobile; many rely on phones for contacts instead of address books. Solutions like Sim backup devices or free web-based back-ups can be used to store contacts.", "stablelm-zephyr:3b": "People are heavily reliant on their mobile phones for contacts and have become fearful of losing them, with one in three people concerned they would lose friends if they lost their phone. More than 50% of mobile owners have had a stolen or lost phone in the last three years, and many do not backup contact details. About 80% of UK adults own a mobile, with 53% of over 65s and higher percentages among 15-24 and 25-34 year olds. Information from Sim cards can be backed up on physical memory cards or online via operators' services. 10,000 phones are lost or stolen every month, and mobile sales continue to grow.", "stablelm2:1.6b": "One-third of people have a fear of losing their mobile phone due to dependency on it as an address book. Over 20% of mobile owners reported having had their phone stolen or lost within the last three years, and 19% were concerned about how they would find contact information if needed. Mobile operators should provide backup services on the network rather than relying on users to find ways themselves. Sim card data can be backed up using physical memory cards or computers via cables with devices such as Sim back-up devices. Some operators offer free web-based syncing services, and it is estimated that about 25% of street crime involves a stolen mobile phone. Mobile phone sales are expected to continue growing in the next year, with around two billion handsets predicted to be in use worldwide by the end of 2023.", "granite3.1-dense:2b": "People's increasing reliance on mobile phones for storing personal contacts has led to significant concerns about losing their phones and severing ties with friends, especially among younger generations (62% of 15-34-year-olds). Over half (54%) of mobile owners do not have a physical address book, relying solely on their phones. Nearly two-thirds (67%) of UK adults own at least one mobile, with the highest ownership among those aged 15-24 (94%).\n\nThe survey reveals that many mobile owners do not regularly back up contact details, as they change phones annually. This dependency on phones for contact information has led to concerns: 19% of respondents were anxious about regaining access to lost contacts if their phone was lost, stolen, or replaced. Nearly a third (32%) of women fear losing touch with people entirely upon losing their phones.\n\nIntervoice's David Noone criticizes this trend as indicative of \"a nation of lazy so-and-sos,\" emphasizing the critical role mobiles play in modern social connections and expressing frustration that users aren't more diligent about preserving contact information. Back-up solutions include purchasing Sim back-up devices for a few pounds, or free web-based services offered by some operators like Orange's My Phone syncing service and O2's GPRS/GSM syncing service. Vodafone and T-Mobile encourage the use of Sim back-up devices but do not provide free network-based back-up options.\n\nApproximately 10,000 mobile phones are lost or stolen each month, accounting for half of total street crime involving mobiles. Global sales of mobile phones have been growing steadily, with over 167 million sold in the third quarter of 2004, a 26% increase from the previous year, and projections predict two billion handsets in use worldwide by late 2005.", "chatgpt-4o-latest": "Many people are highly dependent on their mobile phones, with one in three fearing that losing their phone would mean losing their friends. Over half of mobile users have lost or had their phones stolen in the past three years, and many do not keep backup address books. Younger people are especially reliant on mobiles, with most 15 to 34-year-olds owning at least one. A significant number of users do not remember phone numbers and rely entirely on their phone’s contact list. Some mobile operators offer backup services, but many users do not take advantage of them. Around 10,000 phones are lost or stolen each month, and mobile-related street crime is high. Mobile phone sales continue to grow, with an estimated two billion handsets expected to be in use worldwide by the end of 2005.", "reference": "People are becoming so dependent on their mobile phones that one in three are concerned that losing their phone would mean they lose their friends.More than 50% of mobile owners reported they had had their phone stolen or lost in the last three years.Mr Noone said it should be up to mobile operators to provide back-up services on the network itself, instead of relying on mobile owners to find ways themselves.They also are becoming less likely to remember numbers by heart, relying on the mobile phone book instead.\"The mobile phone plays such a key role in modern relationships; take the phone away and the way we manage these relationships falls apart.\"Nineteen percent of mobile owners were more concerned about how long it would take to find their contacts' information again if the phone was lost, stolen or replaced.Mobile phone sales are expected to continue growing over the next year.It is thought that about 10,000 phones are lost or stolen every month and 50% of total street crime involves a mobile.Many mobile owners do not bother to make back-ups of their contact details, and with people changing their phones once a year on average, it becomes a problem.Globally, more than 167 million mobile phones were sold in the third quarter of 2004, 26% more than the previous year, according to analysts.More than half (54%) of those asked in a poll for mobile firm Intervoice said that they do not have another address book.The survey showed that extent to which people have become reliant on their phones as address book."}