{"raw_text": "US peer-to-peer pirates convicted\n \n The first convictions for piracy over peer-to-peer networks have been handed down in the US.\n \n New Yorker William Trowbridge and Texan Michael Chicoine have pleaded guilty to charges that they infringed copyright by illegally sharing music, movies and software. The two men faced charges following raids in August on suspected pirates by the FBI. The pair face jail terms of up to five years and a $250,000 (£130,000) fine.\n \n In a statement the US Department of Justice said the two men operated the central hubs in a piracy community organised across the Direct Connect peer-to-peer network. The piracy group called itself the Underground Network and membership of it demanded that users share between one and 100 gigabytes of files. Direct Connect allows users to set themselves up as central servers that act as co-ordinating spots for sharers. Users would swap files, such as films and music, by exchanging data over the network. During its investigation FBI agents reportedly downloaded 84 movies, 40 software programs, 13 games and 178 \"sound recordings\" from the five hubs that made up the larger piracy group. The raids were organised under the umbrella of Operation Digital Gridlock which was aimed at fighting \"criminal copyright theft on peer-to-peer networks\". In total, six raids were carried out in August. Five were on the homes of suspected copyright thieves and one on a net service firm. The Department of Justice said that both men pleaded guilty to one count of conspiracy to commit felony copyright infringement. They also pleaded guilty to acting for commercial advantage. The two men are due to be sentenced on 29 April.\n", "llama3.2:1b": "US peer-to-peer pirates William Trowbridge and Michael Chicoine have pleaded guilty to charges of copyright infringement over illegal file sharing through the Direct Connect network, with possible jail terms ranging from one year up to five years and a $250,000 fine. They operated central hubs for the Underground Network, which demanded users share files between 1-100GB.", "llama3.2:3b": "Two US men, William Trowbridge and Michael Chicoine, have been convicted of piracy over peer-to-peer networks, pleading guilty to charges of copyright infringement. They operated the central hubs in a piracy community called the Underground Network, sharing files including music, movies, and software. The pair face up to five years in jail and a £130,000 fine.", "gemma2:2b": "William Trowbridge and Michael Chicoine, US residents convicted of illegal file-sharing through a peer-to-peer network called the Underground Network, face up to five years in prison and a $250,000 fine. The two men operated central servers for the group, which shared copyrighted material like music, movies, and software. Their actions were part of Operation Digital Gridlock, targeting criminal copyright theft on peer-to-peer networks.  \n", "qwen2.5:0.5b": "The first US convictions in peer-to-peer piracy over peer-to-peer networks have been handed down, following raids by the FBI. William Trowbridge and Michael Chicoine were convicted of conspiring to commit copyright infringement and acting for commercial advantage. The two men faced jail terms of up to five years and a $250, 000 fine.", "qwen2.5:1.5b": "Two US men convicted for peer-to-peer copyright piracy, facing up to five years in prison and $250,000 fine following raids on Direct Connect networks.", "qwen2.5:3b": "US pirates convicted over peer-to-peer networks\n\nTwo individuals, William Trowbridge and Michael Chicoine, were found guilty in the US for piracy over peer-to-peer networks. They faced charges after raids by FBI in August where they operated central hubs in a copyright-infringing community on Direct Connect network. Members of this group called Underground Network shared between 1-100 GB files. The investigation revealed agents downloaded 84 movies, 40 software programs, and other media from their servers. Operation Digital Gridlock was launched to combat \"criminal copyright theft.\" Both men pleaded guilty to conspiracy to commit felony copyright infringement and acting for commercial advantage. They are due to be sentenced on April 29th.", "opencoder:1.5b": "The first convictions for piracy over peer-to-peer networks have been handed down in the US. New Yorker William Trowbridge and Texan Michael Chicoine have been charged with charges that they infringed copyright by illegally sharing music, movies and software. They face jail terms of up to five years and a $250,000 (£130,000) fine.\n", "smollm:1.7b": "The first convictions for piracy over peer-to-peer networks have been handed down in the US. New York-based William Trowbridge and Texan Michael Chicoine have pleaded guilty to charges that they infringed copyright by illegally sharing music, movies and software. The two men face jail terms of up to five years and a $250,000 (£130,000) fine for each year of their sentence.\n\nIn a statement the US Department of Justice said that the two men operated the central hubs in a piracy community organized across the Direct Connect peer-to-peer network. The piracy group called itself the Underground Network and membership of it demanded that users share between one and 100 gigabytes of files. Direct Connect allows users to set themselves up as central servers that act as co-ordinating spots for sharers. Users would swap files, such as films and music, by exchanging data over the network. During its investigation FBI agents reportedly downloaded 84 movies, 40 software programs, 13 games and 178 \"sound recordings\" from the five hubs that made up the larger piracy group. The raids were organized under the umbrella of Operation Digital Gridlock which was aimed at fighting \"criminal copyright theft on peer-to-peer networks\". In total, six raids were carried out in August. Five were on the homes of suspected copyright thieves and one on a net service firm. The Department of Justice said that both men pleaded guilty to one count of conspiracy to commit felony copyright infringement. They also pleaded guilty to acting for commercial advantage. The two men are due to be sentenced on 29 April.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely. Let me read through it carefully.\n\nThe first convictions in piracy using peer-to-peer networks were handed down in the US. So the key points here are that William Trowbridge and Michael Chicoine have been convicted.\n\nThey operated under the Direct Connect network. That's a big deal because it's a peer-to-peer service, so they're part of a group where users share files. They were in charge of hosting these shared spaces, which allowed others to swap files, movies, music, etc., over the network.\n\nFBI agents downloaded several materials from their hubs during their raids. Specifically, 84 movies, 40 software programs, 13 games, and 178 sound recordings. That's a lot of stuff, so that's another key point.\n\nThe raids were part of Operation Digital Gridlock, aimed at fighting copyright theft. There were six raids in August: five on people suspected of piracy and one on a net service firm. They pleaded guilty to conspiracy and acting for commercial advantage. Both are due in April with possible jail time or fines.\n\nSo I need to capture all that into a summary without any extra details.\n</think>\n\nThe US Department of Justice has handed down the first convictions for piracy using peer-to-peer networks, involving William Trowbridge and Michael Chicoine. They operated under the Direct Connect network as hosts of shared spaces, with membership requiring sharing files between 1-100 gigabytes. FBI agents downloaded materials from their hubs during raids organized by Operation Digital Gridlock, totaling over 84 movies, 40 software programs, 13 games, and 178 sound recordings. They were convicted for conspiracy to commit copyright infringement and acting for commercial advantage. Both are set to be sentenced on April 29th.", "tinyllama:1.1b": "The first convictions in the US for piracy over peer-to-peer networks have resulted in the imprisonment of William Trowbridge and Michael Chicoine, with both pleading guilty to charges of copyright infringement through sharing music, movie, software, and games. The two men operated the central hubs for a piracy community organized across Direct Connect peer-to-peer networks. The US Department of Justice stated that during their investigation, FBI agents downloaded 84 movie files, 40 software programs, 13 games, and over 178 \"sound recording\" files from the five hubs that made up the larger piracy group. The six raids were carried out in August on suspected copyright thieves and one net service firm. The two men pleaded guilty to one count of conspiracy to commit felony copyright infringement, which carries a maximum sentence of 5 years and $250,000 (£130,000) in fines. They are due to be sentenced on April 29.", "tinydolphin:1.1b": " In a recent development, US peer-to-peer pirates have been convicted after being arrested in August. Two suspected pirates - William Trowbridge and Michael Chicoine - have pleaded guilty to charges that they shared music, movies, and software. They face jail terms of up to five years and a $250,000 (£130,000) fine each.", "phi:2.7b": " William Trowbridge and Michael Chicoine, who have been convicted in the US of illegally sharing copyrighted material through a peer-to-peer network called Underground Network, face prison terms and fines of up to $250,000. The pair were part of a larger piracy community that used Direct Connect to share files such as music, movies, and software programs. Six raids were carried out by the FBI under Operation Digital Gridlock in August, leading to 84 downloaded movies, 40 software programs, 13 games, and 178 sound recordings.\n", "orca-mini:3b": " US peers convicted of piracy over peer-to-peer networks.", "hermes3:3b": "US peers convicted for peer-to-peer piracy, face up to 5yrs jail & $250k fine.", "stablelm-zephyr:3b": "Two US individuals, William Trowbridge and Michael Chicoine, have received their first convictions for piracy over peer-to-peer networks in the US. They infringed copyright by sharing music, movies, and software through a piracy community called the Underground Network that operated on Direct Connect networks. The two men faced charges following FBI raids in August, which resulted in Operation Digital Gridlock aimed at fighting criminal copyright theft on peer-to-peer networks. Trowbridge and Chicoine pleaded guilty to one count of conspiracy to commit felony copyright infringement and another for acting for commercial advantage. They face jail terms of up to five years and a $250,000 fine.", "stablelm2:1.6b": "US authorities convicted two individuals, William Trowbridge and Michael Chicoine, in the first peer-to-peer piracy cases. Both men pled guilty to charges related to copyright infringement involving music, movies, and software. They were part of the Direct Connect network organized by the Underground Network, facing up to five-year jail terms and a $10,0 C (£10,000) fine. The FBI conducted six raids in August targeting suspected pirates, downloading copyrighted files from the central hubs in the group. Trowbridge and Chicoine pleaded guilty to one count of conspiracy to commit felony copyright infringement and acting for commercial advantage. They are scheduled to be sentenced on April 1st.", "granite3.1-dense:2b": "Two US citizens, William Trowbridge from New York and Michael Chicoine from Texas, have been convicted of piracy through peer-to-peer networks. They pleaded guilty to charges of illegally sharing music, movies, and software as part of the Underground Network, a piracy group operating on Direct Connect. The FBI conducted raids in August as part of Operation Digital Gridlock, resulting in 84 downloaded movies, 40 software programs, 13 games, and 178 sound recordings from their hubs. Both men face up to five years in jail and a $250,000 fine for conspiracy to commit felony copyright infringement and acting for commercial advantage. Sentencing is scheduled for April 29.", "chatgpt-4o-latest": "The first US convictions for piracy over peer-to-peer networks have been handed down. William Trowbridge and Michael Chicoine pleaded guilty to copyright infringement for illegally sharing music, movies, and software. They operated central hubs in the Underground Network, a piracy group using the Direct Connect network, where users shared large amounts of files. FBI agents downloaded extensive pirated content during their investigation. The convictions resulted from Operation Digital Gridlock, which targeted copyright theft. The two men face up to five years in prison and a $250,000 fine, with sentencing set for April 29.", "reference": "In a statement the US Department of Justice said the two men operated the central hubs in a piracy community organised across the Direct Connect peer-to-peer network.The Department of Justice said that both men pleaded guilty to one count of conspiracy to commit felony copyright infringement.The two men faced charges following raids in August on suspected pirates by the FBI.The piracy group called itself the Underground Network and membership of it demanded that users share between one and 100 gigabytes of files.The first convictions for piracy over peer-to-peer networks have been handed down in the US.Five were on the homes of suspected copyright thieves and one on a net service firm."}