{"raw_text": "Rich pickings for hi-tech thieves\n \n Viruses, trojans and other malicious programs sent on to the net to catch you out are undergoing a subtle change.\n \n The shift is happening as tech savvy criminals turn to technology to help them con people out of cash, steal valuable data or take over home PCs. Viruses written to make headlines by infecting millions are getting rarer. Instead programs are now crafted for directly criminal ends and firms are tightening up networks with defences to combat the new wave of malicious code.\n \n The growing criminal use of malware has meant the end of the neat categorisation of different sorts of viruses and malicious programs. Before now it has been broadly possible to name and categorise viruses by the method they use to spread and how they infect machines. But many of the viruses written by criminals roll lots of technical tricks together into one nasty package.\n \n \"You cannot put them in to the neat little box that you used to,\" said Pete Simpson, head of the threat laboratory at security firm Clearswift. Now viruses are just as likely to spread by themselves like worms, or to exploit loopholes in browsers or hide in e-mail message attachments. \"It's about outright criminality now,\" said Mr Simpson, explaining why this change has come about. He said many of the criminal programs came from Eastern Europe where cash-rich organised gangs can find a ready supply of technical experts that will crank out code to order. Former virus writer Marek Strihavka, aka Benny from the 29A virus writing group, recently quit the malware scene partly because it was being taken over by spyware writers, phishing gangs, and spammers who are more interested in money rather than the technology. No longer do virus writers produce programs to show off their technical prowess to rivals in the underground world of malware authors. Not least, said Paul King, principal security consultant at Cisco, because the defences against such attacks are so common. \"In many ways the least likely way to do it is e-mail because most of us have got anti-virus and firewalls now,\" he said. Few of the malicious programs written by hi-tech thieves are cleverly written, many are much more pragmatic and use tried and tested techniques to infect machines or to trick users into installing a program or handing over important data. \"If you think of criminals they do not do clever,\" said Mr King, \"they just do what works.\"\n \n As the tactics used by malicious programs change, said Mr King, so many firms were changing the way they defend themselves. Now many scan machines that connect to the corporate networks to ensure they have not been compromised while off the core network.\n \n Many will not let a machine connect and a worker get on with their job before the latest patches and settings have been uploaded. As well as using different tactics, criminals also use technology for reasons that are much more transparent. \"The main motivation now is money,\" said Gary Stowell, spokesman for St Bernard software. Mr Stowell said organised crime gangs were turning to computer crime because the risks of being caught were low and the rates of return were very high. With almost any phishing or spyware attack, criminals are guaranteed to catch some people out and have the contacts to exploit what they recover. So-called spyware was proving very popular with criminals because it allowed them to take over machines for their own ends, to steal key data from users or to hijack web browsing sessions to point people at particular sites. In some cases spyware was being written that searched for rival malicious programs on PCs it infects and then trying to erase them so it has sole ownership of that machine.\n", "llama3.2:1b": "Viruses and trojans are becoming less effective as malware, as tech-savvy criminals turn to technology to con people out of cash, steal data, or take over home PCs. Malware is now often crafted for direct criminal ends, with firms tightening up networks to combat the new wave of malicious code. The shift has led to a more subtle and sophisticated approach by criminals, using tactics such as exploiting loopholes in browsers and hiding in email message attachments.", "llama3.2:3b": "Tech-savvy criminals are using malware to steal cash, valuable data, or take over home PCs, shifting away from sensational virus outbreaks. Malicious code is becoming more targeted and less about showcasing technical prowess, with many firms adopting common defenses like anti-virus and firewalls. Criminals now prioritize money, using tried-and-tested techniques like phishing, spyware, and exploiting loopholes in browsers to infect machines or trick users into installing malicious programs.", "gemma2:2b": "Malicious software is shifting focus from grand viral attacks to targeted, criminal use. Criminals are increasingly using technical tricks to create efficient, single-purpose malware like spyware and phishing tools, bypassing traditional virus detection methods. Organized crime gangs exploit this vulnerability for financial gain, targeting individuals' data or systems for their own purposes.  They prioritize straightforward tactics over elaborate techniques, focusing on high-return activities with lower risk of capture due to the growing sophistication of security measures. \n", "qwen2.5:0.5b": "The rise in hi-tech thieves, who use technology for their criminal ends, makes the need to distinguish malware by method and way of spread crucial. More sophisticated techniques such as worm infection or exploit holes are now common. Viruses can now spread directly through infected machines like a virus writer named Benny from 29A. The new methods make it difficult to know what type of program is malicious in today's online environment. Many firms are improving their defenses against malware, while others might simply choose not to defend themselves and let things go unchecked.", "qwen2.5:1.5b": "Criminal use of malware is increasing, leading to more sophisticated and varied viruses targeting specific goals rather than merely spreading widely. This change in tactics necessitates stronger defenses against cyber threats. Criminals now exploit loopholes in browsers, email attachments, and other vulnerabilities for direct financial gain or system takeover. Malware programs are becoming less technically adept and instead focus on practical methods that users commonly overlook to compromise their systems.", "qwen2.5:3b": "Rich pickings for hi-tech thieves as viruses, trojans, and other malware are evolving to directly target criminal ends. Traditionally categorized methods like email spread or browser infections are now common among new, blended threats. Criminals increasingly use Eastern European gangs for technical expertise; former writers quit due to diversification into spyware, phishing, and spamming. While malware has become more pragmatic, targeting practical solutions, firms are enhancing their defenses by scanning machines and ensuring patches are up-to-date before connecting them to networks. The main motivations are now financial, with criminals exploiting vulnerabilities to steal data or control compromised systems for profit.", "opencoder:1.5b": "Rich pickings for hi-tech thieves\n\nViruses, trojans and other malicious programs sent on to the net to catch you out are undergoing a subtle change as tech savvy criminals turn to technology to help them con people out of cash, steal valuable data or take over home PCs. Rather programs are now crafted for directly criminal ends and firms are tightening up networks with defences to combat the new wave of malicious code.\n\nThe growing criminal use of malware has meant the end of the neat categorisation of different sorts of viruses and malicious programs. Before now it has been broadly possible to name and categorise viruses by the method they spread and how they infect machines.\n\n\"The only reliable way to identify malicious software is through careful and effective programming practices, and constant updates to virus definitions,\" said Mr Simpson, explaining why this change has come about. He said many of the criminal programs came from Eastern Europe where cash-rich organised gangs can find a ready supply of technical experts that will crack out code to order.\n\nFormer virus writer Marek Strihavka aka Benny from the 29A virus writing group recently quit the malware scene partly because it was being taken over by spyware writers, phishing gangs, and spammers who are more interested in money rather than the technology. Not longer do virus writers produce programs to show off their technical prowess to rivals in the cyber world of malware authors.\n\nNot least, said Paul King, principal security consultant at Cisco, because the defenses against such attacks are so common. \"In many ways the least likely way to do it is e-mail because most of us have got anti-virus and firewalls now,\" he explained. Few of the malicious programs written by hi-tech thieves are cleverly written, many are much more pragmatic and use tried and tested techniques to infect machines or to trick users into installing a program or handing over important data.\n\nAs the tactics used by malicious programs change, so many firms were changing the way they defend themselves. Now many scan machines that connect to the corporate networks to ensure they have not been compromised while off the core network. With almost any phishing or spyware attack, criminals are guaranteed to catch some people out and have the contacts to exploit what they recover.\n\nSo-called spyware was proving very popular with criminals because it allowed them to take over machines for their own ends, to steal key data from users or to hijack web browsing sessions to point people at particular sites. In some cases spyware was being written that searched for rival malicious programs on PCs it infects and then trying to erase them so it has sole ownership of that machine. \n\nThis change has driven up the popularity of hi-tech thieves as they are increasingly using technology to gain access to their systems and steal data, which is a major threat to businesses and individuals alike.\n", "smollm:1.7b": "The shift in the tactics used by criminals is a result of the increasing sophistication of malware writers, who are now using more advanced techniques to evade detection and exploit vulnerabilities in software. This change in tactics has also led to an increase in the use of phishing attacks, which target users rather than machines directly.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help the user summarize a given text concisely while preserving key ideas and details. Let me read through the provided text carefully.\n\nThe main points seem to revolve around how malware is evolving among criminals and how firms are adapting. The text mentions viruses getting more complex and targeting specific methods like e-mail or phishing for trickery. Also, there's a focus on organized crime groups using computer crime as a tool with high return rates and low risk of being caught.\n\nI should make sure to highlight the shift from simple antivirus software to more sophisticated, often anonymous tools. The key ideas are the changing tactics in malware, increased sophistication among criminals, and firms tightening defenses against this evolving threat.\n\nI need to condense all these points into a short paragraph without any explanations or formatting. Let me start by identifying the main elements: viruses becoming more complex, criminals using various methods, firms adapting their defense strategies, and organized crime's shift in utilizing computer crime.\n</think>\n\nThe text discusses how malware is evolving among criminals, moving from simple antivirus software to increasingly sophisticated, anonymous tools that target specific methods like e-mail or phishing. Firms are also tightening their defenses against this threat, adopting more advanced techniques for securing their networks. Organized crime groups are shifting toward computer crime as a tool with high return rates and low risk of being caught, often using phishing, spyware, or hijacking web browsing sessions to manipulate users. The text highlights the transparency in criminals' motivations—turning them towards computer crime despite low risks.", "tinyllama:1.1b": "The hi-tech thieves are switching to a subtle yet effective method of attack, changing from using cleverly written malware to more practical programs designed for direct criminal ends, such as stealing personal information or taking over home PCs. Criminals now use malicious programs that combine tried and tested techniques with less glamorous tactics, including scanning machines connected to corporate networks, monitoring employee activities to catch them out, and using software for spyware attacks to take over machines or hijack browsing sessions. Many criminal organizations are turning to technology for money reasons, as the risk of being caught is low and the returns are very high.", "tinydolphin:1.1b": " The shift in the way criminals approach computer crime is taking place, with tech savvy criminals now turning towards technology to help them con people out of their hard-earned money. Many of the virus programs are being written in rarer and more direct ways, making it harder for law enforcement agencies to catch them. The emergence of this new wave of malicious code is seen as a threat not just to individuals but also to large corporations that rely on software for their operations. Criminals use various techniques to infect computers with their malware, from phishing attacks that exploit user weaknesses to sophisticated spyware that can control the machines it infects.\n \nThe increasing use of malicious programs by criminals has led to a shift in how these threats are being addressed. Firms are tightening up their networks with defenses to combat this new wave of malicious code, and this is seen as a result of the ever-increasing sophistication of the attacks themselves. Many of the programs written by criminals roll various technical tricks together into one nasty package, making it difficult for law enforcement agencies to identify and catch them.\n\nThe end of neatly categorizing different types of viruses and malicious programs is a significant change in the way these threats are being dealt with. Previously, many attacks were broadly classified into categories like worms or trojans, which helped law enforcement agencies and security professionals to more effectively combat these issues. However, the rapid evolution of the malware landscape has led to this categorization changing significantly.\n\n\"The most recent threat is not just about showing off technical prowess but also about making money,\" said Pete Simpson, head of the threat laboratory at Clearswift. As a result, many of these programs are being written for direct criminal ends and firms are tightening up their networks to combat this new wave of malicious code. Many criminals now prefer to infect computers with their own software rather than using viruses or malware that come from the dark web or underground communities.\n\nIn many ways, this shift in approach is not as dramatic as some would have predicted, but it does indicate a change in the way that criminal threats are being dealt with. With such a high rate of return for infected machines, criminals are now more interested in exploiting loopholes and hiding in e-mail message attachments rather than relying on traditional techniques like phishing or spyware attacks. This new approach may also be more difficult for law enforcement agencies to identify and catch because they rely on different types of data to track down threats.\n\nAs the threat landscape evolves, it is important that companies invest in strong defenses against these types of threats and stay alert to the latest developments in cybersecurity. By working together with their security partners and using the latest tools available, organizations can help to protect themselves from the ever-growing range of malicious programs being used by criminals.", "phi:2.7b": " The shift in the tactics used by viruses, trojans, and other malicious software is due to tech-savvy criminals using technology to con people out of money or steal valuable data. Criminal programs are now crafted for direct criminal ends and firms are tightening up networks with defenses against them. Viruses that once spread like worms have become more complex and are harder to categorize. Many of the viruses written by organized crime gangs come from Eastern Europe, where cash-rich gangs can find technical experts who will write code on demand. These criminals no longer produce programs just to show off their technical prowess, but rather use tried and tested techniques that trick users into downloading malicious software or hand over important data. As a result, many firms are changing the way they defend themselves by scanning machines connected to the network for vulnerabilities. While criminals use technology in more transparent ways, like making money from phishing attacks, they also still rely on old-school tricks.\n", "orca-mini:3b": " Rich pickings for tech-savvy thieves, viruses and malicious programs are undergoing subtle change as criminals turn to technology to help them con people out of cash, steal valuable data or take over home PCs. The shift is happening as tech-savvy criminals roll technical tricks together into one nasty package, making it harder for firms to categorize viruses by the method they use to spread and how they infect machines. Many viruses now spread by themselves like worms or exploit loopholes in browsers or hide in e-mail message attachments. Few of the malicious programs written by hi-tech thieves are cleverly written, many are much more pragmatic and use tried and tested techniques to infect machines or to trick users into installing a program or handing over important data. Firms are changing the way they defend themselves as tactics used by malicious programs change, and technology is becoming more transparent for criminal purposes.", "hermes3:3b": "Malware evolving into criminal tools, less categorized as they spread using multiple techniques, gaining from money-driven motivations and increasing network defenses.", "stablelm-zephyr:3b": "Tech-savvy criminals are using viruses, trojans, and other malicious programs for direct criminal purposes instead of just infecting millions for headline-grabbing effects. The traditional categorization of different types of viruses is no longer applicable as many malicious programs now combine multiple technical tricks into a single package. These programs exploit loopholes in browsers or hide in email message attachments. Criminals are using malware to con people out of cash, steal valuable data, and take over home PCs. The motivation behind these attacks is money, with organized crime gangs turning to computer crime due to low risks and high returns. Companies are adapting their defenses by scanning machines for compromise and updating patches before allowing workers to access the corporate network.", "stablelm2:1.6b": "Tech-savvy criminals are using technology to aid their fraudulent activities, replacing viruses with more sophisticated malware crafted for criminal purposes. As the categories of viruses have expanded, criminals now blend numerous technical tricks into one malicious package. Eastern Europe-based hackers supply tech experts for criminal programs production, and many of these programs come from the region due to the higher concentration of skilled individuals in that area. However..\nThe growing use of malware among criminals has resulted in a lack of neatly categorized viruses, as criminals write more pragmatic and tried-and-tested techniques for infecting machines or tricking users into installations or data leakages. As the tactics employed by malicious programs change, firms have become more proactive to defend themselves from potential intrusions. Many organizations now scan machines that connect to their corporate networks to ensure they are not compromised while off the core network.\n\nPhishing and spyware attacks remain popular among criminals because they guarantee a catch some people, and they can also use technology for transparent reasons: money. The motivation of organized crime gangs is turning to computer crime due to low chances of being caught and high rates of return in computer-related crimes. This shift has led to the end of neatly categorizing different sorts of viruses and malicious programs, as criminals now write programs that employ more pragmatic methods.", "granite3.1-dense:2b": "The landscape of malware, once characterized by distinct types like viruses and worms, is evolving as criminals prioritize financial gain over technological bragging rights. These malicious programs are increasingly crafted for specific, illicit purposes such as data theft or system takeover. Criminal groups from Eastern Europe, with access to skilled technical experts, now drive this trend. Previously inventive virus writers have shifted focus towards pragmatic, tried-and-tested methods due to improved defenses against their creations.\n\nModern malware employs a variety of techniques to infect machines and deceive users, often relying on exploiting software loopholes or disguising themselves as harmless attachments. The primary motivation for criminals is monetary gain, with low-risk opportunities yielding high returns through phishing, spyware, and hijacked web browsing sessions. Spyware has gained popularity because it allows criminals to control infected machines, steal data, or manipulate users' internet activities. Some advanced spyware even targets and removes rival malicious programs for exclusive system control.\n\nIn response, organizations are refining their security measures, implementing more rigorous checks on connected devices and mandating regular software updates before granting access to the core network. The defensive strategies of hi-tech thieves have shifted from relying on e-mail to exploiting vulnerabilities in corporate systems, reflecting the growing sophistication and practicality of their tactics.", "chatgpt-4o-latest": "Tech-savvy criminals are increasingly using malware for financial gain rather than notoriety, leading to a shift in how viruses are created and categorized. Instead of mass infections, modern malware combines multiple techniques to steal data, take over PCs, or trick users. Many of these programs originate from Eastern Europe, where organized crime groups hire technical experts to develop malicious code. Traditional virus writers have moved away from the scene as financial motives dominate. Criminals rely on tried-and-tested methods rather than sophisticated coding, exploiting security loopholes and user vulnerabilities. Companies are adapting by scanning devices before allowing network access and ensuring security updates are applied. Cybercrime is attractive to criminals due to low risks and high returns, with spyware being particularly popular for hijacking machines, stealing data, and eliminating rival malware.", "reference": "As the tactics used by malicious programs change, said Mr King, so many firms were changing the way they defend themselves.Few of the malicious programs written by hi-tech thieves are cleverly written, many are much more pragmatic and use tried and tested techniques to infect machines or to trick users into installing a program or handing over important data.He said many of the criminal programs came from Eastern Europe where cash-rich organised gangs can find a ready supply of technical experts that will crank out code to order.\"If you think of criminals they do not do clever,\" said Mr King, \"they just do what works.\"The growing criminal use of malware has meant the end of the neat categorisation of different sorts of viruses and malicious programs.But many of the viruses written by criminals roll lots of technical tricks together into one nasty package.In some cases spyware was being written that searched for rival malicious programs on PCs it infects and then trying to erase them so it has sole ownership of that machine.Instead programs are now crafted for directly criminal ends and firms are tightening up networks with defences to combat the new wave of malicious code.\"It's about outright criminality now,\" said Mr Simpson, explaining why this change has come about.\"In many ways the least likely way to do it is e-mail because most of us have got anti-virus and firewalls now,\" he said.With almost any phishing or spyware attack, criminals are guaranteed to catch some people out and have the contacts to exploit what they recover."}