{"raw_text": "New delay hits EU software laws\n \n A fresh delay has hit controversial new European Union rules which govern computer-based inventions.\n \n The draft law was not adopted by EU ministers as planned at a Brussels meeting on Monday during which it was supposed to have been discussed. The fresh delay came after Polish officials had raised concerns about the law for the second time in two months. Critics say the law would favour large companies over small ones and could impact open-source software innovation. \"There was at one point the intention to put the item on today's agenda. But in the end we could not put it on,\" an EU spokesman told the Reuters agency. He added that no date had been chosen for more discussion of the law.\n \n In December, Poland requested more time to consider the issue because it was concerned that the law could lead to the patenting of pure computer software. Its ministers want to see the phrasing of the text of the Directive on the Patentability of Computer-Implemented Inventions changed so that it excludes software patenting. Poland is a large EU member, so its backing for the legislation is vital. The EU says the law would bring Europe more in line with how such laws work in the US, but this has caused some angry debate amongst critics and supporters. In the US, the patenting of computer programs and internet business methods is permitted. This means that the US-based Amazon.com holds a patent for its \"one-click shopping\" service. Critics say a similar model in Europe would hurt small software developers which do not have the legal and financial might of larger companies. But supporters say current law does not let big companies protect inventions which they have spent years developing.\n", "llama3.2:1b": "A new delay has hit European Union rules governing computer-based inventions, with Polish officials raising concerns about the law for a second time in two months. The law was not adopted as planned by EU ministers during a meeting in Brussels on Monday, and there is no agreed-upon date for further discussion. Critics say the law would favor large companies over small ones and impact open-source software innovation, while supporters argue it brings Europe closer to US-style laws that allow patenting of computer programs.", "llama3.2:3b": "EU ministers failed to adopt new rules on computer-based inventions, with Poland requesting more time to consider the issue due to concerns it could lead to patenting pure software, favoring large companies over small ones and potentially hurting open-source innovation.", "gemma2:2b": "EU software laws have been delayed due to concerns from Poland, a large EU member.  Poland wants changes to exclude patenting of computer software, arguing it would benefit large companies over small ones. The delay follows similar objections from Poland in December, pushing back on the proposed law that aims to align European regulations with US practices. \n", "qwen2.5:0.5b": "EU law has a new delay due to concerns about computer-based inventions. Poland's ministers wanted to see changes made in the EU Directive on Patentability for Computer-Implemented Inventions, so that software patents are excluded from patent protection. The US law allows software to be patented by small companies with limited financial might, but EU law does not let big companies protect inventions which they have spent years developing. This new delay has caused some debate and anger amongst supporters and critics of the European Union.", "qwen2.5:1.5b": "A delay has occurred regarding new EU rules on patenting computer-based inventions, following Polish concerns about potential discrimination against small companies due to software patents. The directive would align European standards with those in the U.S., sparking debate over whether it unfairly benefits large firms at the expense of smaller tech businesses. Poland wants to change wording to exclude software patents, but this has been met with resistance from critics and supporters who argue its impact on innovation is unclear.", "qwen2.5:3b": "A new draft law governing computer-based inventions, initially scheduled for adoption by EU ministers at a Brussels meeting on Monday, has been delayed again due to Polish officials' concerns. Poland requested more time in December over fears the law could allow software patents, leading them to demand changes that exclude such patenting of software. The delay affects controversial new EU rules and raises concerns about favoritism towards larger companies while potentially impacting open-source software innovation.", "opencoder:1.5b": "The new delay has hit EU rules governing computer-based inventions.\n\nEU Minister Boris Podolsky, in a meeting at Brussels last week, said it was planned to discuss the draft EU directive but not yet adopted. The fresh delay came after Polish officials raised concerns about the EU law for the second time in two months, further complicating discussions. Critics suggest the legislation would favor large companies over small ones and could potentially impact open-source software innovation. The press release read that it had been agreed to discuss on Monday but not yet implemented. However, the Reuters agency said that no date was set for more discussion of the law. In December, Poland demanded more time as concerns about patenting of pure computer software. The EU Minister has insisted on a balanced approach, which has caused some heated debates among critics and supporters.\n", "smollm:1.7b": "The summary above is concise, yet it captures the key ideas and details from the original text:\n\n1. The new EU delay has hit controversial European Union rules on computer-based inventions.\n2. The draft law was not adopted by EU ministers as planned at a Brussels meeting on Monday during which it was supposed to have been discussed.\n3. The fresh delay came after Polish officials raised concerns about the law for the second time in two months.\n4. Critics say the law would favor large companies over small ones and could impact open-source software innovation.\n5. There was at one point the intention to put the item on today's agenda, but in the end no date had been chosen for more discussion of the law.\n6. The EU says the law would bring Europe more in line with how such laws work in the US, but this has caused some angry debate amongst critics and supporters.\n7. In the US, the patenting of computer programs and internet business methods is permitted. This means that the US-based Amazon.com holds a patent for its \"one-click shopping\" service. Critics say a similar model in Europe would hurt small software developers which do not have the legal and financial might of larger companies. But supporters say current law does not let big companies protect inventions which they have spent years developing.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to help summarize this text about a delay affecting EU software laws. Let me read through it first.\n\nThe text starts by mentioning New Delay hits controversial new European Union rules on computer-based inventions. Then it talks about the draft law being discussed at a meeting in Brussels but not adopted. Poland officials raised concerns for two months, and critics say the law might favor big companies over small ones, which could hurt open-source software. There's some back-and-forth between EU and Polish sides.\n\nThe EU says they'll bring Europe in line with US laws but this has caused debate. Poland wants more time to consider their plans. Amazon's patent remains for \"one-click shopping,\" but that might affect smaller software developers. They argue the EU law protects big companies better, which is good for them but hurt small ones.\n\nI need to create a concise summary preserving key ideas and details. So I'll focus on the main points: New Delay delaying EU rules, concerns about big vs small companies, Poland's role, Amazon patent impact, debate between sides, and their opposing views.\n\nLet me structure it concisely. Maybe start with the delay affecting the laws, mention Poland's two-month delay, the possible influence on open-source software, the EU stance on bringing Europe in line with US laws but causing criticism due to favoring big companies over small ones. Then include Amazon's patent situation and the debate between sides.\n\nI should make sure each key point is included without getting too detailed. So something like: The delay hits EU rules, Poland has a two-month delay, could hurt open-source software innovation, EU plans to align with US laws but critics say it benefits big companies less than small ones.\n</think>\n\nThe new delay has affected controversial EU rules governing computer-based inventions. The draft law was discussed at a meeting in Brussels but not adopted. Poland officials raised concerns for two months and fears about the law's impact on open-source software innovation. The EU plans to bring Europe in line with US laws but critics argue it benefits big companies more than small ones, which could hurt small software developers. Amazon remains patenting its \"one-click shopping\" service, while another similar model might affect smaller developers.", "tinyllama:1.1b": "The EU has hit another delay regarding their controversial new computer-based inventions rules, with Poland raising concerns about the text for the second time in two months. Critics say a fresh delay is likely to affect open-source software innovation and supporters believe current law does not adequately protect small software developers. Despite this, the EU has stated that more discussion on the issue will take place before any final decision is made.", "tinydolphin:1.1b": " EU software laws are facing delays again, with Polish officials raising concerns about a new draft rule that would impact open-source software innovation. The directive was supposed to be discussed during a meeting of EU ministers scheduled for Monday, but it appears there won't be enough time for the negotiations. In December, Poland requested more time to consider the issue because it is concerned that the new law could lead to patenting of pure computer software. The country may also want to see changes in the phrasing of the Directive on the Patentability of Computer-Implemented Inventions.", "phi:2.7b": " The new European Union rules governing computer-based inventions were delayed again due to concerns raised by Polish officials about potential negative impacts on smaller software companies. The draft law aims to bring Europe in line with the US, but it has caused controversy among critics and supporters of the legislation. Poland, a large EU member, wants to change the wording of the Directive on the Patentability of Computer-Implemented Inventions so that it excludes software patenting.\n", "orca-mini:3b": " New EU rules for patenting computer-implemented inventions were delayed due to concerns raised by Poland. The draft law was not adopted by EU ministers as planned, and the delay came after Polish officials raised concerns about the law. Critics say the law would favor large companies over small ones and could impact open-source software innovation. However, supporters argue that the current law does not allow big companies to protect inventions they have spent years developing.", "hermes3:3b": "New delay in EU software patent laws; Polish concerns lead to postponement.", "stablelm-zephyr:3b": "There was a delay in the adoption of new European Union rules governing computer-based inventions, due to Polish officials raising concerns for the second time in two months. Critics argue that the law favors large companies over small ones and could impact open-source software innovation. The draft law aims to bring Europe's laws more in line with those in the US, allowing patenting of computer programs and internet business methods. However, this has caused debate amongst supporters and critics who claim it would harm small software developers by not letting big companies protect their inventions fully.", "stablelm2:1.6b": "A new delay has affected European Union rules governing computer-based inventions, as the proposed draft law was not adopted by EU ministers at a meeting in Brussels. Polish officials raised concerns about the law for the second time in two months, with critics arguing that it could favor large companies over small ones and impact open-source software innovation. Poland requested more time to consider the issue due to its concern about potentially patenting pure computer software, while the EU says the law aligns with how similar laws operate in the US. This has sparked controversy amongst critics and supporters, with some arguing that a similar model would harm small developers who lack legal and financial resources compared to larger companies.", "granite3.1-dense:2b": "The European Union's controversial draft law governing computer-based inventions faces another delay due to concerns raised by Polish officials, who fear it could lead to software patenting and favor large corporations over small businesses and open-source development. This delay is the second within two months. The EU argues the law aligns Europe with US patent laws, which allow software companies like Amazon to patent innovative services. Critics worry such a system would suppress small software developers due to their limited resources compared to larger corporations. Poland's support is crucial for the legislation's passage, as it's a significant EU member, but its concerns have caused heated debate. No new meeting date has been set for further discussion on the law.", "chatgpt-4o-latest": "A new delay has affected the EU's proposed software patent law after Polish officials raised concerns for the second time in two months. The law, which was not discussed as planned at an EU ministers' meeting, is criticized for favoring large companies over small ones and potentially harming open-source innovation. Poland, a key EU member, wants the directive's wording changed to exclude software patenting, fearing it could lead to patents on pure computer software. The EU argues the law would align Europe with US practices, where software and business method patents are allowed, but critics warn this could disadvantage smaller developers. No new date has been set for further discussions.", "reference": "Critics say the law would favour large companies over small ones and could impact open-source software innovation.In December, Poland requested more time to consider the issue because it was concerned that the law could lead to the patenting of pure computer software.The EU says the law would bring Europe more in line with how such laws work in the US, but this has caused some angry debate amongst critics and supporters.The draft law was not adopted by EU ministers as planned at a Brussels meeting on Monday during which it was supposed to have been discussed.The fresh delay came after Polish officials had raised concerns about the law for the second time in two months.But supporters say current law does not let big companies protect inventions which they have spent years developing."}