{"raw_text": "Nintendo handheld given Euro date\n \n Nintendo's new handheld console, the DS, will launch in Europe on 11 March, the company has announced.\n \n The portable games machine, which features touch-screen control, will retail for £99 in the UK (149 euros). Nintendo said 15 games would be available in the UK at launch, with prices ranging from £19 to £29. More than 2.8 million DS consoles have been sold since it first appeared in the US and Japan at the end of 2004. Rival Sony has said it will launch its first handheld console, the PSP, in the US and Europe before the end of March. The PSP is expected to compete for a large part of the same handheld market, despite Sony's assertion that the machines are aimed at different consumers.\n \n The 15 games available on the European launch date will include Nintendo's Super Mario 64 DS, as well as titles from third-party developers such as Ubisoft's Rayman DS.\n \n More than 120 games are in development for the new console, Nintendo has said. The DS is backwards compatible with the Game Boy Advance, allowing the earlier machine's back catalogue of 700 games to be played. Additionally, a short-range wireless link for multiplayer gaming is built in to the DS, with a \"download play\" option which allows a group to play against each other, even if just one person owns a copy. Other features include a short-range messaging application called Pictochat, and a built-in microphone which is used in Sega's launch title Project Rub. Nintendo has also announced a media adapter, which will allow the console to play music and video on the move.\n \n The launch price of £99 (149 euros) compares favourably with the US price of $149, according to John Houlihan, editor of the Computerandvideogames.com magazine. \"It's a very, very competitive price point. There are some innovative features, and Nintendo has created quite a buzz,\" he says. \"However, the line-up of games could have been stronger. Everyone wanted to see the eight-player Mario Kart DS, for example.\"\n \n Mr Houlihan believes that there is likely to be an audience for both the Nintendo DS and Sony's new PSP, with the former aimed largely at a younger audience and the latter expected to be marketed as a multimedia device. \"The PSP is a sexy bit of kit, but Sony's attitude to the PSP has been very understated in Europe, so far,\" Mr Houlihan said. The worldwide handheld software market had an estimated worth of $2.6bn at the end of 2004, according to industry analysts Screen Digest.\n \n In the past, games consoles and handhelds have generally launched much later in Europe than in other parts of the world. However Nintendo president Satoru Iwata said the company was \"pleased to have offered such a short period of time between the US and European launch\". \"Europe is an extremely important market for Nintendo,\" Mr Iwata added. Nintendo raised its sales targets for the DS console last December after selling a million in the US and Japan in just a few weeks.\n", "llama3.2:1b": "Nintendo's handheld console, the DS, will launch in Europe on March 11 for £99 in the UK (149 euros). The device features touch-screen control and is available with up to 15 games at launch, priced from £19 to £29. Nintendo has announced 120 games in development, including titles like Rayman DS and Project Rub.", "llama3.2:3b": "Nintendo's new handheld console, the DS, will be released in Europe on March 11, retailing at £99 (149 euros). The initial launch includes 15 games, including Super Mario 64 DS, with over 120 titles planned. The console is backwards compatible with Game Boy Advance and features a wireless multiplayer link, Pictochat messaging app, and built-in microphone. The launch price is seen as competitive, but some critics feel the game lineup could have been stronger.", "gemma2:2b": "Nintendo's new handheld device, the DS, will be launched in Europe on March 11th with a price of £99 (149 euros). The console will feature touch-screen controls, backward compatibility with Game Boy Advance games, and various multiplayer features like download play.  It has over 2.8 million units sold globally.  Nintendo's rival, Sony, is releasing its PSP in the US and Europe before the end of March. Both devices are expected to compete for a large share of the handheld market. The DS boasts a strong launch lineup including titles like Super Mario 64 DS, while the PSP emphasizes multimedia capabilities. Market analysts predict a healthy demand for both devices, with the DS focusing on younger audiences and the PSP targeting those seeking entertainment beyond gaming.  \n", "qwen2.5:0.5b": "Nintendo's new handheld console, the DS, will be released in Europe on 11 March and will retail for £99 (149 euros) in the UK. Nintendo has announced that more than 2.8 million DS consoles have been sold since it first appeared in the US and Japan at the end of 2004, with more than 120 games available on the European launch date including titles from third-party developers such as Ubisoft's Rayman DS. The console is backward compatible with the Game Boy Advance and has a short-range wireless link for multiplayer gaming, along with Pictochat, a messaging application built into the console which allows groups to play against each other even if just one person owns a copy. The console also has built-in features such as a microphone and a media adapter, allowing games to be played on moveable devices.", "qwen2.5:1.5b": "Nintendo's new handheld console, the DS, will be launched in Europe on March 11th, priced at £99 (€149), competing with Sony's PSP and aiming to appeal mainly to younger gamers while also being marketed as a multimedia device. The UK launch lineup includes Super Mario 64 DS and titles from third-party developers like Ubisoft. Nintendo has announced it will offer more than 2 million DS consoles since its US debut, and over 100 games in development are planned for release, including a short-range wireless multiplayer option.", "qwen2.5:3b": "Nintendo's new handheld DS console, featuring touch-screen control, will launch in Europe on 11 March priced at £99 (€149). The device is backwards compatible with Game Boy Advance and has features like multiplayer gaming, messaging app Pictochat, and built-in microphone. More than 2.8 million DS consoles have sold worldwide since its debut in US and Japan in late 2004. The European launch will include 15 games, including Super Mario 64 DS, and more than 120 titles are in development. Nintendo claims the price point is competitive compared to the US at $149 (€149). Sony's PSP is expected for release shortly before or after the DS. Industry analysts estimate the handheld software market was worth $2.6bn by year-end 2004. Europe launched DS soon after US, considered important market for Nintendo.", "opencoder:1.5b": "Nintendo's new handheld console, the DS, will launch in Europe on 11 March, with prices ranging from £19 to £29, offering a large part of the same handheld market. The games available on this launch date include Super Mario 64 and titles from third-party developers such as Ubisoft's Rayman DS. The overall price range compares favourably with the US ($149 vs $99), marking a significant competitive edge. The line-up of games could have been stronger, benefiting from the more innovative features and a larger audience. According to Mr Houlihan, the handheld market had an estimated worth of $2.6bn at the end of 2004.\n", "smollm:1.7b": "The summary should be: Nintendo's new handheld console, the DS, will launch in Europe on 11 March, with prices ranging from £99 to £29. The 15 games available on the European launch date will include Nintendo's Super Mario 64 DS, as well as titles from third-party developers such as Ubisoft's Rayman DS. More than 120 games are in development for the new console, Nintendo has said. The launch price of £99 (149 euros) compares favourably with the US price of $149, according to John Houlihan, editor of the Computerandvideogames.com magazine. \"It's a very, very competitive price point,\" he says. \"There are some innovative features, and Nintendo has created quite a buzz.\" However, the line-up of games could have been stronger, everyone wanted to see the eight-player Mario Kart DS, for example.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Nintendo's new DS console. Let me read through it carefully.\n\nThe text starts by announcing the launch date in Europe on March 11th. It mentions the price is £99 in the UK and €149 elsewhere. They say 15 games will be available there, with prices from £19 to £29. There've sold over 2.8 million DS consoles since it came out in the US and Japan.\n\nThen, it talks about Sony's PSP launch next week but says they'll compete similarly despite their target audience being different. The DS is backwards compatible, so older games can be played, which is good for cost. Also, there are features like wireless multiplayer, messaging, and a media adapter.\n\nThe price in the US is $149, compared to £99 in the UK. John Houlihan thinks the price is competitive but thinks there's potential for more games than currently announced. He mentions the 8-player Mario Kart DS example people are interested in.\n\nMr. Iwata says they're happy with the short shipping time and that Europe is important to them, aiming for higher sales targets. The market in Europe was worth $2.6bn at the end of 2004.\n\nSo, the key points are: DS launch in March, pricing, number of games, compatibility features, wireless multiplayer, price competition with PSP, potential expansion in games, and Europe's importance as a target market.\n</think>\n\nThe Nintendo handheld DS is set to launch in Europe on March 11th at £99. The European release will feature 15 games priced from £19 to £29, selling over 2.8 million consoles since its US and Japanese debut. The device is compatible with the Game Boy Advance for back catalogue games. It includes features like wireless multiplayer, messaging, a media adapter, and a Pictochat app. The price in the UK is competitive compared to the US $149. Although Sony's PSP is expected next week but aims to compete similarly, it targets a different audience. Key points include the launch date, pricing, number of games, compatibility, features, Europe's importance as a market, and potential expansion in games.", "tinyllama:1.1b": "The Nintendo handheld console, the DS, will launch in Europe on March 11th. The portable games machine is expected to retail for £99 ($149) in the UK (149 euros). Nintendo's initial launch games are priced from £19 to £29 and include Mario 64 DS, Rayman DS, and more than 100 other titles. The DS will be available for purchase across Europe at the same launch date, and third-party developers have also announced a short-range wireless link called Pictochat and built-in microphone. Nintendo's media adapter is set to allow players to play music and video on the move, and the console is expected to have a market share of 20% in Europe by the end of the year. The launch price for £99 (149 euros) is slightly lower than that of Sony's PSP and may attract younger audiences, while Sony's latest handheld game console has a sexier lineup compared to Nintendo's DS.", "tinydolphin:1.1b": " Nintendo has announced that its upcoming handheld console, the DS, will launch in Europe on March 11th. The DS launches in the UK at the end of March, offering 2.8 million titles available to purchase at launch. The European launch date is significant as it comes one week after the US and Japanese launches of Nintendo's predecessor, the Game Boy Advance.\n\nThe launch price for the DS is £99 in the UK, which is lower than the $149 price tag in the US and €19 (around £19) in the European market. The device features a touch-screen interface, along with rear-mounted controls that resemble those of an Nintendo Game Boy.\n\nAmong the 15 launch games are popular titles such as Super Mario 64 DS, Rayman DS, and Nintendogs. The console also comes with built-in Wi-Fi, allowing users to download and play back catalogues from previous handheld consoles, as well as participate in multiplayer gaming.\n\nThe launch of the DS in Europe follows its release in the US and Japan earlier this year. Despite this, a number of third-party games have been announced for the European version of the DS. For example, Ubisoft has confirmed that Rayman DS will be available when it launches in March, alongside titles such as Rayman Legends and Rayman: Rage Island.\n\nThe launch date of the DS in Europe also compares favorably with its US counterpart, with a price tag of £99 (149 euros). However, it's worth noting that the UK has seen an innovative feature offered by both the Game Boy Advance and Nintendo's new PSP, which could have been better utilized in the launch strategy for the DS.", "phi:2.7b": " The Nintendo DS will be launched in Europe on 11 March, with 15 games priced at £99 (149 euros). It's a popular handheld console that can play back 700 Game Boy Advance games, has multiplayer gaming, and built-in Pictochat. The launch price is competitive compared to the US price of $149. There are over 120 games in development for the DS and both consoles, PSP and DS, will be marketed as multimedia devices.\n", "orca-mini:3b": " Nintendo's new handheld console, the DS, will launch in Europe on March 11th at a price of £99, which is equivalent to 149 euros. The console will have a range of games available at launch, including Super Mario 64 DS, Rayman DS, and Sega's Project Rub. The console is also backwards compatible with the Game Boy Advance, allowing players to access more than 700 games from the previous console. Additionally, the device has a short-range wireless link for multiplayer gaming, as well as a built-in microphone for a messaging application called Pictochat. The launch price compares favorably with the US price of $149. However, the line-up of games could have been stronger, and the PSP is expected to compete for a large part of the same handheld market. Both the Nintendo DS and Sony's new PSP are expected to have an audience, but it remains to be seen which one will be more successful.", "hermes3:3b": "Nintendo DS handheld set for Europe on 11th March, £99/149 euros price. Over 120 games planned, backwards compatible with Game Boy Advance; multiplayer gaming feature built-in.", "stablelm-zephyr:3b": "Nintendo's DS handheld console launched in Europe on 11 March, with a retail price of £99 (€149) and 15 games available at launch. The console features touch-screen controls, is backwards compatible with Game Boy Advance, and includes a \"download play\" option for multiplayer gaming. More than 120 games are in development, including titles from third-party developers like Ubisoft's Rayman DS. Nintendo also announced a media adapter that allows the console to play music and video on the move. The launch price of £99 is seen as competitive compared to the US price of $149, and industry analysts estimate the worldwide handheld software market to be worth $2.6bn at the end of 2004.", "stablelm2:1.6b": "Nintendo's DS handheld will launch in Europe on March 22, with prices starting at £79 (€89). The European version includes Super Mario DS and other games from third-party developers. More than 2.8M consoles have been sold worldwide since its US/Japan debut. Nintendo plans to release over 30 games for the European market. Prices range from £5 to £14. A media adapter will allow DS to play music and video on the go, and a short-range wireless link enables multiplayer gaming.", "granite3.1-dense:2b": "Nintendo's handheld, the DS, will be released in Europe on 11 March for £99 (149 euros). The device, featuring touch-screen control, has sold over 2.8 million units since its US and Japanese debut at the end of 2004. European launch games include Super Mario 64 DS, Rayman DS, and various others priced from £19 to £29. Nintendo plans more than 120 games for the console, which is compatible with the Game Boy Advance's 700-game library via wireless link. Innovative features like Pictochat and a built-in microphone are included. The DS also supports media playback on the go through a media adapter. Experts note the competitive pricing and innovative features, but suggest the game lineup could be stronger. Nintendo expects significant demand for its handheld, despite rival Sony's upcoming PSP launch in Europe before March. The global handheld software market was valued at $2.6 billion in late 2004.", "chatgpt-4o-latest": "Nintendo's DS handheld console will launch in Europe on 11 March for £99 (149 euros), with 15 games available at launch, including Super Mario 64 DS and Rayman DS. The DS, which has sold over 2.8 million units in the US and Japan since late 2004, features touch-screen controls, backward compatibility with Game Boy Advance games, short-range wireless multiplayer, Pictochat messaging, and a built-in microphone. A media adapter will enable music and video playback. Sony's PSP, a competing handheld, is set to launch in the US and Europe by the end of March, targeting a different audience. Industry analysts estimate the handheld software market was worth $2.6 billion in 2004. Nintendo president Satoru Iwata emphasized Europe's importance and noted the short gap between the US and European launches.", "reference": "More than 120 games are in development for the new console, Nintendo has said.Nintendo's new handheld console, the DS, will launch in Europe on 11 March, the company has announced.Rival Sony has said it will launch its first handheld console, the PSP, in the US and Europe before the end of March.Nintendo said 15 games would be available in the UK at launch, with prices ranging from £19 to £29.The 15 games available on the European launch date will include Nintendo's Super Mario 64 DS, as well as titles from third-party developers such as Ubisoft's Rayman DS.Nintendo raised its sales targets for the DS console last December after selling a million in the US and Japan in just a few weeks.More than 2.8 million DS consoles have been sold since it first appeared in the US and Japan at the end of 2004.However Nintendo president Satoru Iwata said the company was \"pleased to have offered such a short period of time between the US and European launch\".Mr Houlihan believes that there is likely to be an audience for both the Nintendo DS and Sony's new PSP, with the former aimed largely at a younger audience and the latter expected to be marketed as a multimedia device.Nintendo has also announced a media adapter, which will allow the console to play music and video on the move."}