{"raw_text": "Latest Opera browser gets vocal\n \n Net browser Opera 8.0, due for official release at the end of next month, will be \"the most accessible browser on the market\", according to its authors.\n \n The latest version of the net browser can be controlled by voice command and will read pages aloud. The voice features, based on IBM technology, are currently only available in the Windows version. Opera can also magnify text by up to 10 times and users can create \"style sheets\", its developers say. This will enable them to view pages with colours and fonts that they prefer. But the browser does not yet work well with screen reader software often used by blind people, so its accessibility features are more likely to appeal to those with some residual vision. \"Our mission was always to provide the best internet experience for everyone,\" said Opera spokeswoman, Berit Hanson. \"So we would obviously not want to exclude disabled computer users.\"\n \n Another feature likely to appeal to people with low vision is the ability to make pages fit to the screen width, which eliminates the need for horizontal scrolling.\n \n The company points out that this will also appeal to anyone using Opera with a handheld device. The company says that features like voice activation are not solely aimed at visually impaired people. \"Our idea was to take a first step in making human-computer interaction more natural,\" said Ms Hanson. \"People are not always in a situation where they can access a keyboard, so this makes the web a more hands-free experience.\" Unlike commercially available voice recognition software, Opera does not have to be \"trained\" to recognise an individual voice. Around 50 voice commands are available and users will have to wear a headset which incorporates a microphone. The voice recognition function is currently only available in English. Opera is free to download but a paid-for version comes without an ad banner in the top right hand corner and with extra support. Opera began life as a research project - a spin-off from Norwegian telecoms company Telenor. Its browser is used by an estimated 10 million people on a variety of operating systems and a number of different platforms.\n", "llama3.2:1b": "Opera 8.0, due for release in late November, will include voice command control and text magnification up to 10 times. The browser can also create custom style sheets to customize pages. \n\nThe features are intended to improve accessibility for those with residual vision, but the company acknowledges that screen reader software may not work well. \n\nOpera aims to make human-computer interaction more natural by eliminating horizontal scrolling and providing a hands-free experience.", "llama3.2:3b": "Opera 8.0, set to release at the end of next month, will be the most accessible browser, with features like voice command, text magnification up to 10 times, and style sheets. The feature set is designed for those with some residual vision but not blind users, who may find it less user-friendly due to lack of screen reader compatibility. Voice activation is not solely aimed at visually impaired people, aiming to make human-computer interaction more natural and hands-free, with around 50 voice commands available in English.", "gemma2:2b": "Opera 8.0, set for release at the end of next month, features voice command control, text reading aloud, and adjustable font sizes. The browser also offers style sheet creation to customize page appearance. While accessibility features are intended primarily for those with some vision, the browser's focus on intuitive human-computer interaction aims to create a more hands-free web browsing experience. Opera is free but offers paid versions with additional features. \n", "qwen2.5:0.5b": "Opera has released its latest version, Opera 8.0, which will be the most accessible browser on the market according to its authors. The latest version supports voice commands for controlling the browser and can magnify text up to 10 times. Users can create style sheets, enabling them to view pages with colors and fonts they prefer. However, the browser does not yet work well with screen reader software commonly used by blind people, so its accessibility features are more likely to appeal to those with some residual vision. The company's mission is to provide a better internet experience for everyone, and their feature that makes pages fit to the screen width, eliminates the need for horizontal scrolling, also appeals to anyone using Opera with a handheld device.", "qwen2.5:1.5b": "Opera, set for release in April, offers voice command control, text magnification up to ten times, style sheet creation, and ability to fit pages to screen width, appealing to those with low vision and handheld device users, while also not excluding visually impaired individuals. Opera is free but has a commercial version without an ad banner.", "qwen2.5:3b": "Latest Opera browser version 8.0, due for release next month, offers voice control and text reading features based on IBM technology. It can magnify text up to ten times and allows users to create their preferred style sheets. While currently accessible mainly to those with residual vision due to lack of compatibility with screen readers used by blind people, it includes a feature that fits pages to the screen width for better viewing on handheld devices. Voice activation features are more natural interaction tools not limited to visually impaired users. The browser is free but comes with an ad banner in the paid version. Opera's origins date back to Telenor’s research project and it is used by around 10 million people across various operating systems and platforms.", "opencoder:1.5b": "Latest Opera browser gets vocal, \n\nNet browser Opera 8.0, due for official release at the end of next month, will be \"the most accessible browser on the market\". According to its authors, the latest version of the net browser can be controlled by voice command and will read pages aloud. The voice features, based on IBM technology, are currently only available in the Windows version. Opera can also magnify text by up to 10 times and users can create \"style sheets\", which enables them to view pages with colours and fonts that they prefer. But the browser does not yet work well with screen reader software often used by blind people. \"Our mission was always to provide the best internet experience for everyone,\" said Opera spokeswoman, Berit Hanson. Another feature likely to appeal to people with low vision is the ability to make pages fit to the screen width, which eliminates the need for horizontal scrolling. The company points out that this will also appeal to anyone using Opera with a handheld device. The company says that features like voice activation are not solely aimed at visually impaired people. \"Our idea was to take a first step in making human-computer interaction more natural,\" said Ms Hanson. \"People are not always in a situation where they can access a keyboard, so this makes the web a more hands-free experience.\" Unlike commercially available voice recognition software, Opera does not have to be \"trained\" to recognise an individual voice. Around 50 voice commands are available and users will have to wear a headset which incorporates a microphone. The voice recognition function is currently only available in English. Opera is free to download but a paid-for version comes without an ad banner in the top right hand corner and with extra support. Opera began life as a research project - a spin-off from Norwegian telecoms company Telenor. Its browser is used by an estimated 10 million people on a variety of operating systems and a number of different platforms.\n", "smollm:1.7b": "The latest Opera browser gets vocal, which means it will be controlled by voice command and read aloud the pages. The net browser can also magnify text up to 10 times and users can create style sheets for better readability. This will appeal to people with low vision who use screen readers. Another feature likely to appeal to people with low vision is the ability to make pages fit to the screen width, which eliminates the need for horizontal scrolling.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help summarize the given text concisely. Let me read through it carefully.\n\nThe first paragraph introduces Opera 8.0 as the most accessible browser on the market. It mentions that voice commands will be integrated, using IBM technology for features like reading pages aloud and magnifying text up to 10 times. Also, style sheets will allow users to customize colors and fonts based on their preference. However, it's not fully accessible via screen readers yet because of this limitation.\n\nThe next part talks about the company's mission, emphasizing that they want everyone to benefit from the best internet experience. They note that there are features like adjusting page width without scrolling, which is helpful for those with low vision. The handheld feature makes it more hands-free for users.\n\nNow, considering how to structure the summary:\n\n1. Introduce Opera 8.0 as the new browser.\n2. Highlight the main features: voice commands and text magnification.\n3. Mention that voice recognition isn't universal yet because of screen reader compatibility.\n4. Note other accessibility features like adjusting page width.\n5. Summarize that while not fully accessible to everyone, it's an exciting step towards broader accessibility.\n\nI need to ensure all these points are included concisely without any extra information or explanations. Also, since the user specified to output only the summary as plain text, I should avoid using any markdown or explanations.\n</think>\n\nThe latest Opera browser, 8.0, is described as the most accessible on the market. It features voice commands and voice activation using IBM technology for reading pages aloud and magnifying text up to 10 times. However, it hasn't been fully compatible with screen readers yet. Despite this limitation, it offers additional accessibility features like adjusting page width without scrolling and style sheets allowing customization of colors and fonts. The browser is free but includes a paid version without an ad banner and extra support. Originally developed by Norwegian telecom company Telenor, it's used by over 10 million users across various platforms and operating systems.", "tinyllama:1.1b": "Net browser Opera 8.0, due for official release at the end of next month, will be \"the most accessible browser on the market\" according to its authors. The latest version of the browser can be controlled by voice command and will read pages aloud, with features like magnifying text up to 10 times and creating \"style sheets\". This is intended for people who are blind or have low vision, who will find Opera's accessibility features especially useful. Other features include voice activation which does not require a keyboard, hands-free browsing via a headset, and no ads in the browser window's top right hand corner. Users can download it free from the Opera website but the paid version offers extra support without an ad banner in the top right hand corner. Approximately 10 million people worldwide use Opera on Windows platforms.", "tinydolphin:1.1b": " The Latest Opera Browser Will Be the Most Accessible 8.0 Version, With Voice Command and Magnifying Text Support in a Streamlined Interface, and It Can Work Well with Screen Readers for Some Users. However, It Does Not Yet Work Well with Screen Reader Software for Blind Individuals, So Its Voice Function May Appeal More to Those with Limited Vision.", "phi:2.7b": " The latest version of Opera, set to release soon, will have voice activation, text magnification, screen reader compatibility, and the ability for pages to fit the screen width. These features cater to visually impaired users as well as those with low vision or handheld devices. The voice recognition is not limited to one individual's voice, making it a more natural user experience. Opera was founded by Telenor and has been used by millions on different platforms.\n", "orca-mini:3b": " Opera, the net browser, will soon be released with improved accessibility features such as voice command and text-to-speech capabilities, making it easier for users to access information on the internet. The latest version of Opera can be controlled by voice command, allowing users to perform actions like opening links, searching for files, and reading pages aloud. Additionally, Opera's magnify feature can increase the size of text by up to 10 times, making it easier for visually impaired users to read and navigate pages. However, screen reader software is not yet fully supported by Opera, which limits its accessibility for blind computer users. To overcome this limitation, Opera will soon introduce a wider range of accessibility features, including horizontal scrolling optimization and support for voice commands. These features are not exclusive to visually impaired individuals but are aimed at making human-computer interaction more natural and hands-free for everyone.", "hermes3:3b": "Opera 8.0 browser (upcoming release) (Windows only):\n* Voice control based on IBM technology\n* Read pages aloud\n* Text magnification up to 10x\n* Style sheets for custom colors/fonts\n* FIT to screen width, eliminating horizontal scrolling\n* Aimed at enhancing human-computer interaction, especially for users with low vision", "stablelm-zephyr:3b": "The upcoming Opera 8.0 browser, set to release at the end of the month, aims to be the most accessible browser on the market according to its creators. It features voice command functionality, reading pages aloud using IBM technology, text magnification up to 10 times, and \"style sheets\" for customizable page viewing. However, it currently has issues with compatibility with screen reader software used by visually impaired individuals. Opera also allows pages to fit the screen width, appealing to those with low vision or using handheld devices. Around 50 voice commands are available without training, making it a more natural human-computer interaction option. A paid version of Opera is available without an ad banner and with extra support.", "stablelm2:1.6b": "Opera, set to release its 8.0 browser at the end of next month, will be hailed as \"the most accessible browser on the market\" due to its voice control and text magnification features. The browser, developed by Opera, uses IBM technology for its voice capabilities and is available only in Windows at present. It can read pages aloud, support color and font preferences, and zoom text up to 5 times. However, compatibility with screen reader software remains an issue as users with low vision may have trouble using the browser. Another feature likely to appeal to people with low vision is the ability..\nThe company highlights that voice activation isn  \"not solely aimed at visually impaired people\" and points out the benefits of a hands-free experience for anyone using Opera with a handheld device. In contrast, commercially available voice recognition software requires users to be trained on individual voices. At present, the browser only supports English voice commands.\n\nOpera began life as a research project before becoming a spin-off from Norwegian telecoms company Telenor. As of now, it's used by approximately 1 million people across various operating systems and different platforms. The forthcoming release aims to make web browsing more accessible and user-friendly for individuals who cannot access a keyboard.", "granite3.1-dense:2b": "Opera Browser 8.0, launching at the end of next month, introduces significant accessibility features for users with visual impairments or those seeking a more hands-free browsing experience. These include voice command control, text magnification up to 10 times, customizable \"style sheets\" for preferred color and font displays, and screen fitting that eliminates horizontal scrolling. The browser can read pages aloud using IBM technology currently available only on Windows versions. Unlike commercial voice recognition software, Opera does not require individual voice training; it supports around 50 voice commands via a headset. While these features primarily benefit visually impaired users, they also enhance usability for those using Opera on handheld devices or situations where keyboard access is limited. Opera remains free to download but offers an ad-free version for a fee. The project originated from Telenor's research division and now serves approximately 10 million users across various platforms.", "chatgpt-4o-latest": "Opera 8.0, set for release next month, introduces voice control and text-to-speech features, making it \"the most accessible browser,\" according to its developers. These voice functions, based on IBM technology, are currently available only for Windows. The browser also allows text magnification up to 10 times and customizable style sheets for preferred colors and fonts. However, it does not yet work well with screen readers, making it more useful for users with some vision. Other accessibility features include automatic page resizing to fit screen width, reducing the need for horizontal scrolling. Opera's voice activation is designed for broader use beyond visually impaired users, enabling hands-free browsing. Unlike other voice recognition software, it does not require training and supports around 50 commands, though it currently only works in English. Opera is free to download, with a paid version offering an ad-free experience and additional support. Originally a research project from Norwegian telecom company Telenor, Opera now has around 10 million users across various platforms.", "reference": "Unlike commercially available voice recognition software, Opera does not have to be \"trained\" to recognise an individual voice.The latest version of the net browser can be controlled by voice command and will read pages aloud.The company says that features like voice activation are not solely aimed at visually impaired people.The voice recognition function is currently only available in English.But the browser does not yet work well with screen reader software often used by blind people, so its accessibility features are more likely to appeal to those with some residual vision.The voice features, based on IBM technology, are currently only available in the Windows version.\"Our mission was always to provide the best internet experience for everyone,\" said Opera spokeswoman, Berit Hanson.Around 50 voice commands are available and users will have to wear a headset which incorporates a microphone."}