{"raw_text": "Movie body targets children's PCs\n \n The body that represents the US movie industry has released its latest tool in its campaign to clamp down on movie file-sharing, aimed at parents.\n \n The Movie Association for America's (MPAA) free Parent File Scan software lets parents check their children's computers for peer-to-peer programs. It will also list all movie and music files they have on their hard drive. Parents then have the choice to remove programs and files. The MPAA said files found would not be passed on to it. \"Our ultimate goal is to help consumers locate the resources and information they need to make appropriate decisions about using and trading illegal files,\" said Dan Glickman, MPAA chief. \"Many parents are concerned about what their children have downloaded and where they've downloaded it from.\"\n \n But some computer users who had tested the latest software reported on some technology sites that the program had identified Windows default wav files as copyrighted material and wanted to delete them. Movie piracy cost the industry £3.7bn ($7bn) in 2003, according to analysts. The MPAA said in a statement that it would continue to provide easy access to similar tools in the coming months to combat \"the deleterious effects of peer-to-peer software, including such common problems as viruses, Trojan horses and identity theft\".\n \n Mr Glickman said that the film industry was embracing \"digital age technologies\", like Movielink and CinemaNow, which are legal movie sites. \"But legal services such as these need a chance to grow and thrive without having to compete against illegitimate operations that depend on stolen property to survive,\" he added. The industry body also said it had launched a second round of legal action against online movie-swappers across the US, but did not say how many were being sued. Its first set of lawsuits were filed in November 2004. It also started a campaign against operators of BitTorrent, eDonkey and DirectConnect peer-to-peer networks. The first convictions for peer-to-peer piracy were handed out in the US in January. William Trowbridge and Michael Chicoine pleaded guilty to charges that they infringed copyright by illegally sharing music, movies and software.\n", "llama3.2:1b": "The Movie Association for America (MPAA) has released a tool called \"free Parent File Scan\" which allows parents to check their children's computers for peer-to-peer programs. The program lists all movie and music files on the computer and gives parents the option to remove them. The MPAA aims to help consumers make informed decisions about file-sharing, with some users reporting issues with copyright-protected content in the software.", "llama3.2:3b": "The MPAA has released a free Parent File Scan software that allows parents to check their children's computers for peer-to-peer programs and lists all movie and music files on the hard drive. The program was tested but reported identifying Windows default wav files as copyrighted material. The MPAA plans to provide similar tools in the coming months to combat peer-to-peer software issues, which cost the industry £3.7bn in 2003, and has launched a second round of lawsuits against online movie-swappers across the US.", "gemma2:2b": "The MPAA released a free software called Parent File Scan to help parents identify movie file sharing on their children's computers. The program lists copyrighted materials and allows parents to delete them. While the MPAA claims it won't share this information with anyone, some users report inaccurate identification of common files as copyrighted material. The industry also launched legal actions against online movie-swappers and continued advocating for legal streaming platforms like Movielink and CinemaNow. \n", "qwen2.5:0.5b": "The Movie Association (MPAA) recently released its Parent File Scan software aimed at parents to check children's computers for file-sharing activities. The MPAA will list all files found on a user’s computer and allow them to remove programs and files if necessary. However, some users have reported issues with the program identifying Windows default wav files as copyrighted material that they wanted to delete. The MPAA stated in a statement that it would continue to provide similar tools for legal sites and that it was launching another round of legal action against online movie-swappers across the US.", "qwen2.5:1.5b": "The MPAA has released Parent File Scan software aimed at parents to check children's PCs for illegal file-sharing programs like peer-to-peer networks. While the software helps locate files, it does not pass them on to the MPAA. The movie industry is expanding its legal services but faces challenges from piracy. Peer-to-peer and BitTorrent sites are still problematic despite efforts against operators.", "qwen2.5:3b": "The MPAA has released free Parent File Scan software to detect P2P programs on children's PCs, listing all movie and music files for parents to remove unauthorized content. This follows the £3.7bn ($7bn) loss from movie piracy in 2003. The software mistakenly flagged Windows default wav files as copyrighted material. The MPAA aims to aid consumers in making decisions about illegal file use, while continuing to promote legal digital services and targeting illegal P2P networks. It has also initiated a second wave of lawsuits against online movie-swappers.", "opencoder:1.5b": "Movie body targets children's PCs\n\nThe body that represents the US movie industry has released its latest tool aimed at parents to clamp down on movie file-sharing. It will also list all movie and music files held by users' hard drives. The MPAA said files found would not be passed on, permitting them to stay free of infringement. The ultimate goal is to aid in locating necessary resources and information for decision-making purposes.\n", "smollm:1.7b": "The summary is a brief overview of the main points from the text. It does not include any additional information or explanations about the movie industry, its target audience, or the specific details of the MPAA's free Parent File Scan software. The summary only provides the key ideas and details that are relevant to understanding the main topic of the text.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about the Parent File Scan tool from The Movie Association for America. Let me read through it carefully.\n\nThe main points are: MPAA released a free software to check parents' computers for illegal files like wav and windows default files. Parents can delete them if they find anything. They reported that some sites flagged Windows default wav files as copyrighted, which could hurt piracy costs of £3.7bn in 2003. The film industry is embracing digital tech like Movielink and CinemaNow legally but needs to grow without competition. MPAA also talks about legal actions against peer-to-peer networks like BitTorrent and some online services.\n\nI should capture the key elements: release of software, functionality for parents, piracy costs, industry response, digital services, and emerging legal actions. Make sure it's concise without explanations.\n</think>\n\nThe Movie Association for America (MPAA) released a free Parent File Scan tool aimed at parents to check their children’s computers for unauthorized peer-to-peer files. Parents can delete found files. In 2003, this software caused piracy costs of £3.7 billion, according to analysts. The film industry is embracing digital content like Movielink and CinemaNow but needs legal action against peer-to-peer networks. MPAA has also sued operators of BitTorrent, eDonkey, and DirectConnect.", "tinyllama:1.1b": "The American movie industry has launched free peer-to-peer file-sharing scanning software aimed at parents, as part of its campaign to limit and prevent the spread of illigal file-sharing. The MPAA's latest tool allows parents to check their children's computers for such programs and files, which they can then remove if they are found. However, some users reported being advised to delete these files by the software, which has led to concerns that it is seeking to target children's PCs. The MPAA said it would continue to provide easy access to similar tools in coming months to combat the \"deleteious effects of peer-to-peer software\", such as MovieLink and CinemaNow. Additionally, the industry body launched a second round of legal action against online movie swappers, with 12 operators being sued so far. The first convictions for peer-to-peer piracy were handed out in the US earlier this year.", "tinydolphin:1.1b": " The movie industry has launched a new tool, called Movielink and CinemaNow, to help parents check their children's computers for files related to peer-to-peer (P2P) programs. This new software, which is provided by the Movie Association of America (MPAA), aims to help parents locate the resources they need to make informed decisions about using and trading such files. The MPAA has urged parents to use the tool to protect their children from unknowingly sharing copyrighted material. This initiative comes at a time when the film industry is facing significant losses due to the prevalence of P2P networks, which enable users to share and download pirated content without permission.", "phi:2.7b": " The MPAA's free Parent File Scan software allows parents to check their children's computers for file-sharing programs and list all movie and music files on the hard drive. If parents choose to remove programs and files found, it will not be passed on to the MPAA. However, some users report that the program incorrectly identified Windows default wav files as copyrighted material. The film industry is using digital age technologies like Movielink and CinemaNow but legal services must compete with illegitimate operations that rely on stolen property. The industry has also launched legal action against online movie-swappers across the US.\n", "orca-mini:3b": " The US movie industry has released a tool to scan parents' computers for illegal file-sharing, targeting children's PCs. The free Parent File Scan software helps parents check their children's computers for peer-to-peer programs and lists all movie and music files they have on their hard drive. Parents can choose to remove programs and files. The MPAA said files found would not be passed on to it, but some computer users reported that the program identified Windows default wav files as copyrighted material and wanted to delete them. The industry cost £3.7bn in 2003 due to piracy, according to analysts. The MPAA is continuing to provide easy access to similar tools in the coming months to combat illegal software such as viruses, Trojan horses, and identity theft. However, legal services such as these need a chance to grow and thrive without having to compete against illegitimate operations that depend on stolen property to survive.", "hermes3:3b": "MPAA releases parent software to identify child computer files for movie-sharing clampdown.\nSome issues reported with identifying default Windows files as copyrighted material.\nMovie piracy cost industry £3.7bn in 2003.", "stablelm-zephyr:3b": "The MPAA released Parent File Scan, a free software targeting parents to check their children's computers for peer-to-peer programs and listing all movie and music files stored on their hard drives. The ultimate goal is to help consumers locate resources to make appropriate decisions about using and trading illegal files. Some users reported issues with the program identifying Windows default wav files as copyrighted material and deleting them. Movie piracy cost the industry £3.7bn ($7bn) in 2003. The MPAA plans to continue providing easy access to tools like Parent File Scan in the coming months to combat \"the deleterious effects of peer-to-peer software.\"", "stablelm2:1.6b": "The MPAA's Parent File Scan software allows parents to check their children's computers for peer-to-peer programs and lists movie and music files found on the hard drive. Parents can choose to remove these programs and files. The goal is to help consumers make appropriate decisions about using/trading illegal files, while preventing piracy costs of £3.7bn ($7bn) in 2012. The MPAA will continue to provide similar tools to combat piracy issues such: viruses, Trojan horses, and identity theft. Legal services like Movielink and CinemaNow are embraced by the film industry but legal growth needs to thrive without competition against illegitimate operations.", "granite3.1-dense:2b": "The MPAA has introduced Parent File Scan software, aimed at parents concerned about their children's movie and music file-sharing. This tool identifies peer-to-peer programs and associated files on children's computers, allowing parents to decide whether to remove them. Despite some issues where the software flagged default Windows wav files as copyrighted, the MPAA emphasizes its goal of helping consumers make informed decisions about using illegal files. Movie piracy costs the industry approximately £3.7bn ($7bn) annually. The MPAA plans to continue providing such tools to combat security risks like viruses and identity theft linked to peer-to-peer software.\n\nThe film industry is promoting digital platforms like Movielink and CinemaNow, but faces challenges from illegitimate operations depending on stolen content for survival. In response, the MPAA has intensified legal actions against online movie-swappers, with the first convictions handed down in January 2005, involving William Trowbridge and Michael Chicoine for copyright infringement through peer-to-peer networks.", "chatgpt-4o-latest": "The MPAA has released free Parent File Scan software to help parents detect peer-to-peer programs and media files on their children's computers, allowing them to remove unauthorized content. The MPAA assures that detected files will not be reported. Some users, however, reported that the software mistakenly flagged default Windows files as copyrighted. The film industry, which lost $7 billion to piracy in 2003, continues to combat illegal file-sharing through legal actions and by promoting legal movie services like Movielink and CinemaNow. The MPAA has launched lawsuits against online movie-swappers and operators of peer-to-peer networks, with the first convictions for piracy occurring in January.", "reference": "The Movie Association for America's (MPAA) free Parent File Scan software lets parents check their children's computers for peer-to-peer programs.The body that represents the US movie industry has released its latest tool in its campaign to clamp down on movie file-sharing, aimed at parents.It will also list all movie and music files they have on their hard drive.The industry body also said it had launched a second round of legal action against online movie-swappers across the US, but did not say how many were being sued.Mr Glickman said that the film industry was embracing \"digital age technologies\", like Movielink and CinemaNow, which are legal movie sites.The MPAA said files found would not be passed on to it.The first convictions for peer-to-peer piracy were handed out in the US in January."}