{"raw_text": "Mobile games come of age\n \n The BBC News website takes a look at how games on mobile phones are maturing. A brief round-up follows but you can skip straight to the reviews by clicking on the links below.\n \n If you think of Snake when some mentions \"mobile games\" then you could be in for a bit of a surprise. This is because mobile games have come a long way in a very short time. Even before Nokia's N-Gage game phone launched in late 2003, many mobile operators were realising that there was an audience looking for something to play on their handset.\n \n And given that many more people own handsets than own portable game playing gadgets such as the GameBoy it could be a very lucrative market. That audience includes commuters wanting something to fill their time on the way home, game fans looking for a bit of variety and hard core gamers who like to play every moment they can. Life for all these types of player has got immeasurably better in the last year as the numbers of titles you can download to your phone has snowballed. Now sites such as Wireless Gaming Review list more than 200 different titles for some UK networks and the ranges suit every possible taste. There are ports of PC and arcade classics such as Space Invaders, Lunar Lander and Bejewelled. There are also versions of titles, such as Colin McRae Rally, that you typically find on PCs and consoles.\n \n There are shoot-em-ups, adventure games, strategy titles and many novel games only found on handsets. Rarely now does an action movie launch without a mobile game tie-in. Increasingly such launches are all part of the promotional campaign for a film, understandable when you realise that a good game can rack up millions of downloads. The returns can be pretty good when you consider that some games cost £5. What has also helped games on mobiles thrive is the fact that it is easier than ever to get hold of them thanks to technology known as Wap push. By sending a text message to a game maker you can have the title downloaded to your handset. Far better than having to navigate through the menus of most mobile operator portals. The number of handsets that can play games has grown hugely too. Almost half of all phones now have Java onboard meaning that they can play the increasingly sophisticated games that are available - even the ones that use 3D graphics.\n \n The minimum technology specifications that phones should adhere to are getting more sophisticated which means that games are too. Now double key presses are possible making familiar tactics such as moving and strafing a real option. The processing power on handsets means that physics on mobile games is getting more convincing and the graphics are improving too. Some game makers are also starting to take advantage of the extra capabilities in a mobile. Many titles, particularly racing games, let you upload your best time to see how you compare to others. Usually you can get hold of their best time and race against a \"ghost\" or \"shadow\" to see if you can beat them. A few games also let you take on people in real time via the network or, if you are sitting close to them, via Bluetooth short-range radio technology. With so much going on it is hard to do justice to the sheer diversity of what is happening. But these two features should help point you in the direction of the game makers and give you an idea of where to look and how to get playing.\n \n  TOO FAST TOO FURIOUS (DIGITAL BRIDGES) \n \n As soon as I start playing this I remember why I never play driving games - because I'm rubbish at them. No matter if I drive the car via joystick or keypad I just cannot get the hang of braking for corners or timing a rush to pass other drivers. The game rewards replay because to advance you have to complete every section within a time limit. Winning gives you cash for upgrades. Graphically the rolling road is a convincing enough evocation of speed as the palm trees and cactus whip by and the city scrolls past in the background. The cars handle pretty well despite my uselessness but it was not clear if the different models of cars were appreciably different on the track. The only niggle was that the interface was a bit confusing especially when using a joystick rather than the keypad to play.\n \n  FATAL FORCE (MACROSPACE) \n \n A futuristic shooter that lets you either play various deathmatch modes against your phone or run through a series of scenarios that involves killing aliens invading Earth. Graphics are a bit cartoon-like but only helps to make clear what is going on and levels are well laid out and encourage you to leap about exploring. Both background music and sounds effects work well. The scenarios are well scripted and you regularly get hints from the Fatal Force commanders. Weapons include flamethrowers, rocket launchers, grenades and at a couple of points you even get chance to use a mech for a short while. With the right power-up you can go into a Matrix-style bullet time to cope with the onslaught of aliens. The game lets you play via Bluetooth if others are in range. Online the game has quite a following with clans, player rankings and even new downloadable maps.\n", "llama3.2:1b": "mobile games come of age\nmobile games have matured significantly in recent years\nmany mobile operators now cater to gamers\nthere is a wide range of games available for download on UK networks\nsome popular titles include space invaders, lunar lander, bejewelled\nrarely does an action movie launch without a mobile game tie-in\ngames are easier to access than ever with wap push technology", "llama3.2:3b": "Mobile games have come a long way since the early days of Snake and Nokia's N-Gage game phone. The market has grown and diversified, offering over 200 titles across various genres. Many popular PC and arcade classics are available on mobiles, as well as original games. The ease of access through Wap push technology has increased, making it easier for players to download games. Advances in technology have improved graphics and gameplay, with features like physics engines, 3D graphics, Bluetooth connectivity, and online multiplayer capabilities.", "gemma2:2b": "Mobile games have advanced significantly in recent years, evolving from simple arcade classics like Snake to sophisticated mobile gaming experiences. \n\nThe availability of titles on handsets has exploded, thanks to Wap push technology and the increasing number of smartphones equipped for games. The genre caters to a diverse audience: commuters seeking entertainment, hardcore gamers, and casual players alike. \n\nAdvanced features like double key presses, more realistic physics, and enhanced graphics have enabled games with greater depth and engagement. Multiplayer options via Bluetooth or online platforms further enhance user experience.  \n", "qwen2.5:0.5b": "Mobile games have come of age. With more people owning handsets, there is now an audience for mobile games on their phones. Sites such as Wireless Gaming Review list over 200 different titles for many UK networks. Games are getting easier to get hold of thanks to Wap push technology and many game makers use the extra capabilities in a mobile phone to improve gameplay. The games have a lot going on, with features like physics, graphics and a variety of modes such as driving and deathmatch.", "qwen2.5:1.5b": "Mobile games have evolved rapidly in recent years, providing diverse options for various players including commuters, gamers, and those looking for entertainment on the go. With over 200 titles available from multiple networks and supporting genres ranging from action to strategy, this market offers significant potential due to easy accessibility through Wap push technology. Handset capabilities have improved with nearly half of phones now capable of Java-based games, leading to more complex game mechanics such as physics and 3D graphics. Additionally, the ability to upload personal times for comparison can enhance competitive gaming experiences.", "qwen2.5:3b": "Mobile games have matured significantly since their early days on handsets. Today's options include ports of PC classics like Space Invaders and arcade hits, as well as variety for commuters, gamers, and casual players. With titles available across multiple platforms (PC, consoles, mobile), and push technology making downloads easier, the market has grown to over 200 titles in some UK networks. Advancements in processing power have improved physics engines and graphics, supporting more sophisticated games like 3D models. Popular games include fast-paced racing and shooting experiences like TOO FAST TOO FURIOUS (DIGITAL BRIDGES) and FATAL FORCE (MACROSPACE). Despite initial hurdles with driving controls or gameplay elements, modern mobile gaming offers a wide range of engaging experiences for diverse player types.", "opencoder:1.5b": "The BBC News website takes a look at how games on mobile phones are maturing.\n\nA brief round-up follows but you can skip straight to the reviews by clicking on the links below:\n\nGames on mobile phones have come a long way in a very short time. Even before Nokia's N-Gage game phone launched in late 2003, many mobile operators were realising that there was an audience looking for something to play on their handset.\n\nWith so much going on it is hard to do justice to the sheer diversity of what is happening. But these two features should help point you in the direction of the game makers and give you an idea of where to look and how to get playing. \n\nAs soon as I start playing this I remember why I never play driving games - because I'm rubbish at them. No matter if I drive the car via joystick or keypad I just cannot get the hang of braking for corners or timing a rush to pass other drivers. The game rewards replay because to advance you have to complete every section within a time limit. Winning gives you cash for upgrades. Graphically the rolling road is a convincing enough evocation of speed as the palm trees and cactus whip by and the city scrolls past in the background. The cars handle pretty well despite my uselessness but it was not clear if the different models of cars were appreciably different on the track. The only niggle was that the interface was a bit confusing especially when using a joystick rather than the keypad to play.\n\nA futuristic shooter that lets you either play various deathmatch modes against your phone or run through a series of scenarios that involves killing aliens invading Earth. Graphics are a bit cartoon-like but only helps to make clear what is going on and levels are well laid out and encourage you to leap about exploring. Both background music and sounds effects work well. The scenarios are well scripted and you regularly get hints from the Fatal Force commanders. Weapons include flamethrowers, rocket launchers, grenades and at a couple of points you even get chance to use a mech for a short while. With the right power-up you can go into a Matrix-style bullet time to cope with the onslaught of aliens. The game lets you play via Bluetooth if others are in range. Online the game has quite a following with clans, player rankings and even new downloadable maps.\n", "smollm:1.7b": "Mobile games have come a long way since the early days of the iPhone. From simple puzzle games to complex multiplayer experiences, mobile gaming has evolved significantly over the years. Here's a summary of the key ideas and details that can be summarized in a concise manner:\n\n1. **Mobile games on the rise**: The number of mobile game downloads has grown exponentially over the past decade, with more than 2 billion monthly active users worldwide. This growth is driven by the increasing popularity of smartphones and the convenience they offer.\n2. **Diversification of genres**: Mobile games now cater to a wide range of genres, including action, adventure, puzzle, sports, strategy, and social games. This diversity has attracted players from various age groups and backgrounds.\n3. **Improved graphics and sound**: Advances in mobile technology have enabled developers to create more realistic graphics and immersive audio experiences. High-quality visuals and engaging soundtracks are essential for a good gaming experience on mobile devices.\n4. **Cross-platform play**: Many popular games now offer cross-platform play, allowing players to play together across different devices, including smartphones, tablets, and PCs. This feature has increased social interaction and community building among gamers.\n5. **Esports and competitive gaming**: Mobile esports has emerged as a significant force in the gaming industry, with professional teams and leagues competing in tournaments and championships. Popular games like PUBG, Fortnite, and Apex Legends have become household names.\n6. **Cloud gaming and streaming**: Cloud gaming services like Google Stadia, Microsoft xCloud, and NVIDIA GeForce Now enable gamers to play high-quality games on any device with an internet connection, without the need for dedicated hardware.\n7. **Mobile game development studios**: The rise of mobile game development studios has led to a proliferation of new titles and innovative gameplay mechanics. These studios often have a strong focus on community engagement and social features.\n8. **Monetization models**: Mobile games employ various monetization strategies, including in-app purchases, subscriptions, advertising, and freemium models. Developers must balance these revenue streams with player expectations and game quality.\n9. **Accessibility and inclusivity**: Modern mobile games prioritize accessibility and inclusivity, offering features like subtitles, audio descriptions, and customizable controls to cater to players with disabilities.\n10. **Esports and tournaments**: Mobile esports has become a significant event in the gaming calendar, with major tournaments and championships attracting large audiences and high-profile participants.\n\nBy understanding these key ideas and details, you'll be well-equipped to appreciate the evolution of mobile games and their impact on the gaming industry as a whole.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about mobile games. Let me read through it carefully.\n\nThe first paragraph talks about how mobile gaming is maturing quickly, mentioning that before N-Gage, many operators were already developing games for mobile phones in 2003. It also mentions a lucrative market due to the growing number of players who have more devices than traditional games like GameBoy.\n\nNext, there's a section on genres: shoot-em-ups, adventure games, strategy titles. There are examples given like Space Invaders and Lunar Lander, along with older titles such as Colin McRae Rally.\n\nThen, the text describes how WAP push allows downloading games easily from websites to phones without menus, which is easier than navigating through portals. It also mentions that Java onboard in most phones, making more complex games possible. The minimum tech specs have improved, allowing more features like double key presses and physics simulation.\n\nAnother example is a racing game where you can upload your best time to compare with others or play real-time against someone via Bluetooth. This adds an interactive element beyond just playing the game.\n\nThe second part discusses another game called FATAL FORCE, which is a futuristic shooter with deathmatch modes, unique scenarios, and clear graphics. It also mentions how mobile games are now more accessible online with clans, rankings, and downloads.\n\nPutting it all together, I need to capture the key points: rapid evolution of mobile games, diverse genres, WAP push's role in easy game download, improved specs and features, examples like FATAL FORCE and racing games with interactive elements.\n</think>\n\nThe text discusses how mobile gaming is rapidly evolving, with a significant presence growing due to increased player numbers. It highlights genres such as shoot-em-ups, adventure, strategy, and includes older titles like Colin McRae Rally. The text also emphasizes WAP push's role in easy download using websites, features improved graphics and physics on newer phones, and mentions FATAL FORCE for a futuristic shooter with interactive elements like real-time play.", "tinyllama:1.1b": "The BBC News website takes a look at how mobile games are gaining popularity thanks to increased technology capabilities, portable gameplay on handsets, and shoot-em-up titles like Rarely that appeal to various tastes, including those who prefer adventure games, strategy titles, and more. Games like Double Key Press and physics making can enhance familiar tactics such as moving and strafe, while racing games use graphics to bring out the best time and compete against real-time rivals. Popular game makers like Mobile Choice and Digital Bridgees are also providing a diverse range of titles, including a futuristic shooter that offers a mix of deathmatch modes and scenarios featuring alien invaders, while multiple levels are laid out to provide clear instructions for playing. The game is also well-scripted with hints from the Faotal Force commander, making weapon choices easier to use in challenging situations. Online play and downloadable maps can attract players worldwide.", "tinydolphin:1.1b": " The BBC News website reports that mobile games are \"making waves\" in the gaming industry. The report mentions that popular titles such as Snake on mobile devices have evolved significantly since their launch. These include games like Nokia's N-Gage, which was launched in late 2003, and more recent releases such as Colin McRae Rally and Bejeweled. The article also highlights the rise of mobile gaming in Europe, with around 2 billion mobile game sessions being recorded per year, according to a report by the International Game Developers Association (IGDA). In the UK alone, there are now over 100 million gamers using their phones, making it one of the fastest-growing segments of the gaming industry.\n\nThe BBC News article mentions several popular mobile games that offer a variety of genres and playstyles. These include Rare's Wireless Gaming Review lists more than 200 different titles for its UK networks, with the range suitably accommodating every taste. Additionally, users can download mobile versions of well-known PC or arcade classics such as Space Invaders and Lunar Lander. The report also suggests that mobile games are a lucrative market, with revenue reaching $1 billion for handset operators in 2011. This increase in revenue is partly due to the rise of advanced technology such as Wap push, which allows mobile game titles to download to handsets without requiring players to navigate through menus on the mobile operator's website.\n\nFurthermore, mobile games are becoming increasingly popular with an increasing number of handsets in Europe and around the world having Java onboard, enabling them to play the increasingly sophisticated games that are available. This technology is also starting to make it easier for developers to create games with 3D graphics, a feature that has become increasingly sought after by mobile gamers. The BBC News report suggests that more and more handsets are now having Java onboard, which could have significant implications for the growth of mobile gaming in the future.\n\nFinally, the article mentions that there are several games available that are exclusive to mobile devices. These include titles such as Colin McRae Rally and Bejeweled, both of which have been launched on platforms like Wireless Gaming Review. The rise of exclusivity in mobile gaming could make it easier for players to find new games to play or even lead to the development of unique gameplay mechanics that are exclusive to mobile devices.\n\nIn summary, mobile games are continuing to evolve and showcase how technology is making gaming accessible to a wider audience. With advancements in graphics, wireless connectivity, and advanced technologies such as Wap push, it seems increasingly likely that the industry will only continue to grow.", "phi:2.7b": " Mobile games have come a long way in recent years, with more options available than ever before on different networks for diverse tastes such as shoot-em-ups, adventure games, strategy titles, and novel games only found on handsets. The processing power of mobile phones has improved, allowing for realistic graphics and physics. Games are becoming increasingly complex, offering features like uploadable best times and real-time multiplayer options via network or Bluetooth technology. However, some drivers may find these games difficult to master due to their advanced gameplay.\n", "orca-mini:3b": " The article discusses how mobile games have come a long way in a short time and how more people own handsets than portable game playing gadgets. It mentions that there are over 200 different titles available for some UK networks and the ranges suit every possible taste. The article also highlights the minimum technology specifications that handsets should adhere to, which include double key presses and realistic physics and graphics. The article gives an example of a racing game that lets users upload their best time to see how they compare to others and lets them take on people in real time via Bluetooth short-range radio technology. The article also mentions another racing game that rewards replay and graphically depicts the rolling road as a convincing enough evocation of speed. Lastly, the article explains that Fatality Force is a futuristic shooter that lets players either run through a series of scenarios or deathmatch modes against their phone. The article concludes by highlighting the game's futuristic setting, well-written scenarios and scripted storylines.", "hermes3:3b": "Mobile gaming maturing:\n- Improving graphics, physics, and processing power on handsets.\n- Wider variety of games (PC classics, novel titles, shoot-em-ups, adventure games etc.)\n- Easy access via text message or wireless push to game makers.\n- Rising audience due to increased ownership of mobile devices; it's a lucrative market.", "stablelm-zephyr:3b": "Mobile games have come a long way in recent years, with a massive increase in available titles suitable for every taste and device. Once considered basic fare like Snake, mobile gaming now offers a diverse range of genres, including PC classics, action movie tie-ins, adventure games, strategy titles, and unique novelty games. The ease of accessibility has also grown exponentially thanks to Wap push technology, allowing game downloads via text message. Advancements in smartphone technology have led to more sophisticated games with improved graphics and processing power, even offering 3D capabilities on some devices. Examples of such games include \"Too Fast Too Furious\" (Digital Bridges) and \"Fatal Force\" (MacroSpace).", "stablelm2:1.6b": "Mobile games have significantly evolved since Nokia's N-Gage game phone launched in 2003. Wap push technology allows users to download games directly from text messages sent by game makers, expanding the market for mobile games. The number of handsets capable of playing games has also grown due to increasing processing power and sophisticated graphics capabilities. Titles range from classic PC/arcade games like Space Invaders and Bejewelled, to newer games with 3D graphics and advanced physics simulations. Examples such..\nAs previously mentioned, the gaming market on mobile phones is highly varied with various genres like racing, strategy, adventure, and shooting games becoming popular. As more than 20+ different titles are available for download based on UK networks, it's an expanding market that has attracted many game makers.\n\nTwo of these games reviewed in this passage include \"Too Fast Too Furious\" (DIGITAL BRIDGES) and \"FATAL FORCE\" (MACROSPACE). \n\n- In \"Too Fast Too Furious\", a futuristic shooter that lets you either play various deathmatch modes against your phone or run through a series of scenarios involving killing aliens. The game rewards replay because to advance, users have to complete every section within a time limit. Winning gives them cash for upgrades. Graphically, the rolling road is an adequate representation of speed, with palm trees and cacti whizzing by and the city in the background scrolling past.\n\n- In \"FATAL FORCE\", a futuristic shooter that lets you either play various deathmatch modes against your phone or run through a series of scenarios involving killing aliens. The game has well-scripted scenes and provides hints from Fatal Force commanders. It includes weapons like flamethrowers, rocket launchers, grenades, and at some points, you can use a mech for short while periods. In addition to the online gaming community where clans, player rankings, and even new downloadable maps are available.\n\nOverall, these two games represent just a small portion of the wide range of mobile games available now - ranging from simple arcade-style games like Snake and Tetris, to complex strategy titles, adventure games, and shooter games that use advanced graphics capabilities.", "granite3.1-dense:2b": "Mobile games have evolved significantly from their early days, such as Nokia's N-Gage, to become a lucrative market with diverse offerings. This growth is driven by the widespread ownership of mobile phones compared to dedicated gaming devices like GameBoy. Today, over 200 titles are available for various UK networks, catering to commuters, casual gamers, and hardcore enthusiasts alike. These games include ports of PC and arcade classics, as well as popular titles like Colin McRae Rally and shoot-em-ups. Mobile game development has been facilitated by technology like Wap push, allowing users to download titles via text messages.\n\nThe rise in mobile gaming capabilities is evident; nearly half of all phones now support Java, enabling more sophisticated games with 3D graphics and advanced features such as double-key presses for improved control. Graphics have improved, with better physics and more convincing visuals. Some titles enable online multiplayer, letting users race against ghost times or engage in real-time battles via Bluetooth.\n\nGame genres range from shooters to adventure, strategy, and novel mobile-exclusive games. Recent releases often include mobile game tie-ins for film promotions, which can garner millions of downloads due to their high quality and affordability (typically £5 each). Despite the diversity, two standout titles are TOO FAST TOO FURIOUS (Digital Bridges) and FATAL FORCE (Macrospace).\n\nTOO FAST TOO FURIOUS is a challenging racing game that rewards players for completing sections within time limits. The graphics convincingly depict fast driving, but the interface can be confusing. FATAL FORCE is a futuristic shooter featuring various deathmatch modes and alien invasion scenarios. Although graphics are cartoon-like, they effectively communicate game events. Weapons vary, and users can enjoy Matrix-style bullet time with the right power-up. Online, FATAL FORCE boasts clans, rankings, and downloadable maps.", "chatgpt-4o-latest": "Mobile games have evolved significantly from simple titles like Snake, becoming a lucrative market due to the widespread ownership of mobile phones. A growing audience, including commuters and hardcore gamers, has driven the expansion of mobile gaming, with hundreds of titles now available for download. Games range from classic arcade ports to console-style experiences, and many action movies now launch with mobile game tie-ins. Advances in mobile technology, such as Java support and improved processing power, have enabled more sophisticated gameplay, including 3D graphics, better physics, and multiplayer options via Bluetooth or online networks. \n\nTwo reviewed games highlight this progress: *Too Fast Too Furious* is a racing game with upgradeable cars and a convincing sense of speed, though its interface can be confusing. *Fatal Force* is a futuristic shooter featuring various weapons, well-designed levels, and multiplayer options, including Bluetooth and online play with rankings and downloadable maps.", "reference": "Even before Nokia's N-Gage game phone launched in late 2003, many mobile operators were realising that there was an audience looking for something to play on their handset.This is because mobile games have come a long way in a very short time.The game lets you play via Bluetooth if others are in range.The number of handsets that can play games has grown hugely too.Some game makers are also starting to take advantage of the extra capabilities in a mobile.The BBC News website takes a look at how games on mobile phones are maturing.A few games also let you take on people in real time via the network or, if you are sitting close to them, via Bluetooth short-range radio technology.What has also helped games on mobiles thrive is the fact that it is easier than ever to get hold of them thanks to technology known as Wap push.But these two features should help point you in the direction of the game makers and give you an idea of where to look and how to get playing.The processing power on handsets means that physics on mobile games is getting more convincing and the graphics are improving too.That audience includes commuters wanting something to fill their time on the way home, game fans looking for a bit of variety and hard core gamers who like to play every moment they can.By sending a text message to a game maker you can have the title downloaded to your handset.Almost half of all phones now have Java onboard meaning that they can play the increasingly sophisticated games that are available - even the ones that use 3D graphics.Rarely now does an action movie launch without a mobile game tie-in.The minimum technology specifications that phones should adhere to are getting more sophisticated which means that games are too.The game rewards replay because to advance you have to complete every section within a time limit.There are shoot-em-ups, adventure games, strategy titles and many novel games only found on handsets.The returns can be pretty good when you consider that some games cost £5."}