{"raw_text": "California sets fines for spyware\n \n The makers of computer programs that secretly spy on what people do with their home PCs could face hefty fines in California.\n \n From 1 January, a new law is being introduced to protect computer users from software known as spyware. The legislation, which was approved by Governor Arnold Schwarzenegger, is designed to safeguard people from hackers and help protect their personal information. Spyware is considered by computer experts to be one of the biggest nuisance and security threats facing PC users in the coming year. The software buries itself in computers and can collect a wide range of information. At its worst, it has the ability to hijack personal data, like passwords, login details and credit card numbers. The programs are so sophisticated they change frequently and become impossible to eradicate.\n \n One form of spyware called adware has the ability to collect information on a computer user's web-surfing. It can result in people being bombarded with pop-up ads that are hard to close. In Washington, Congress has been debating four anti-spyware bills, but California is a step ahead. The state's Consumer Protection Against Spyware Act bans the installation of software that takes control of another computer. It also requires companies and websites to disclose whether their systems will install spyware. Consumers are able to seek up to $1,000 in damages if they think they have fallen victim to the intrusive software. The new law marks a continuing trend in California towards tougher privacy rights. A recent survey by Earthlink and Webroot found that 90% of PCs are infested with the surreptitious software and that, on average, each one is harbouring 28 separate spyware programs. Currently users wanting protection from spyware have turned to free programs such as Spybot and Ad-Aware.\n", "llama3.2:1b": "California introduces a new law banning spyware installation and requiring disclosure of potential spyware installations by companies and websites. The law also provides up to $1,000 in damages for consumers who believe they've been victimized by intrusive software.", "llama3.2:3b": "California introduces a law banning the installation of spyware, requiring companies and websites to disclose whether their systems will install spyware, and allowing consumers to seek up to $1,000 in damages if they fall victim to intrusive software. The legislation aims to safeguard computer users from hackers and protect personal information, amid concerns that spyware is a major security threat.", "gemma2:2b": "California will penalize computer program makers for installing spyware. The new law, effective January 1st, restricts software that secretly monitors personal data on computers, protects users from hackers, and requires companies to disclose if their systems use spyware. Consumers can seek damages of up to $1,000 if they suffer from such intrusions.  \n", "qwen2.5:0.5b": "California introduces new law banning spyware in computer programs. The law will protect people from hackers and improve the security of their personal information by imposing fines. It includes a ban on adware that collects web-surfing data, making it more challenging for users to block pop-ups.", "qwen2.5:1.5b": "California will impose fines for computer programs that secretly spy on user activity, following a new law aimed at protecting consumers from \"sophisticated\" software like adware that collects personal data without their knowledge.", "qwen2.5:3b": "California introduces new laws against spyware effective Jan 1st, imposing fines up to $1,000 for software that secretly collects personal data or hijacks computers. The legislation aims to protect users from hackers and secure their information, which can be collected by sophisticated adware and other types of spyware. California's Consumer Protection Against Spyware Act bans unauthorized control over another computer and requires disclosures about installed software. Recent surveys indicate high prevalence of spyware on PCs in the state.", "opencoder:1.5b": "The California law puts in place fines for software that may be used by computers to monitor or spy on what they do. This includes spyware, which is a type of malicious software designed to change the way computers work, collect sensitive information about individual users, and often steal personal data.\n", "smollm:1.7b": "California sets fines for spyware", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about California fines for spyware. Let me read through it carefully.\n\nThe main points are that the makers of spyware can face fines in California, starting on January 1st with a new law. This law aims to protect people from software that secretly monitors their PC usage.\n\nI remember that spyware changes all the time and can collect personal info like passwords or credit cards. There's a form called adware that collects web surfing data into ads. Congress is considering anti-spyware bills, but California has its own act that bans installing spyware on another computer and requires disclosure.\n\nConsumers in California can sue for up to $1k damages if they think they were infected by spyware. They've started using free programs like Spybot and Ad-Aware as alternatives. The survey shows 90% of PCs have it, with an average of 28 separate programs.\n\nI need to make sure I capture all the key elements: fine in California, new law starting Jan 1, protecting users from spyware, types of spyware (adware and spyware), benefits they can cause, Congress' bill, state's act blocking spyware, consumer protection, free alternatives, survey results.\n\nI should avoid explaining too much, just focus on the summary. Make sure it's concise without losing important details.\n</think>\n\nCalifornia has introduced a law to protect computer users from spyware, starting January 1st with a new law aimed at safeguarding against software that secretly monitors personal data. Spyware can be categorized into adware and other forms, which monitor web surfing activities and potentially collect sensitive information like passwords or credit card numbers. The law requires companies and websites to disclose system software that might install spyware. Consumers can seek up to $1,000 in damages if they believe they were affected by the software. California has passed the Consumer Protection Against Spyware Act, which prohibits the installation of spyware on another computer and mandates disclosure. Free programs like Spybot and Ad-Aware are available for users seeking protection. A survey by Earthlink and Webroot indicates that 90% of PCs are infected with spyware and average having 28 separate programs installed.", "tinyllama:1.1b": "California has become the first state in the United States to introduce a law aimed at protecting computer users from malicious software known as spyware. The new law, which became effective on January 1st, is designed to safeguard people from hackers and help protect their personal information. Spyware can collect a wide range of data, including passwords, login details, credit card numbers, and web-surfing habits, making it one of the biggest security threats facing PC users in the coming year. The law is aimed at blocking the installation of software that takes control of another computer, requiring companies and websites to disclose whether their systems will install spyware, and awarding up to $1,000 in damages if users believe they have fallen victim to such software. California joins a number of other states, including Washington, as it seeks to protect its consumers from the intrusive software that poses a threat to their online privacy rights.", "tinydolphin:1.1b": " California sets fines for spyware, a new law introduced in the state of California will impose hefty fines on those who install or run software that secretly spies on users' computer activities, from January 1st. Spyware is considered one of the biggest threats to PC users and can collect personal information like passwords, login details, and credit card numbers. A recent survey by Earthlink and Webroot found that over half (54%) of all PCs have been infested with spyware programs, while on average each one harbors 28 separate spyware programs.", "phi:2.7b": " California's new law aims to protect computer users from spyware by imposing hefty fines on makers of the software. It will also require companies and websites to disclose if their systems will install spyware, and consumers can seek up to $1,000 in damages for installing such software. Spyware is a serious threat that can hijack personal data and bomb people with pop-up ads. The state's new law follows a trend towards tougher privacy rights, as a survey found that 90% of PCs have spyware and each one has on average 28 separate programs installed.\n", "orca-mini:3b": " California sets fines for spyware. The state's Consumer Protection Against Spyware Act bans the installation of software that takes control of another computer and requires companies and websites to disclose whether their systems will install spyware. Consumers can seek up to $1,000 in damages if they think they have fallen victim to spyware.", "hermes3:3b": "California fines for spyware (introduces protections against)\n  - Fines for spyware makers\n  - Disclosure requirement for installing spyware systems\n - Up to $1000 damages for consumer victims", "stablelm-zephyr:3b": "California implemented a new law effective January 1st to protect computer users from spyware, introducing fines for makers of software secretly spying on home PCs. The legislation aims to safeguard people from hackers and their personal information. The state's Consumer Protection Against Spyware Act bans the installation of software taking control of another computer and requires companies and websites to disclose whether they install spyware. Consumers can seek up to $1,000 in damages if they fall victim to intrusive software. A survey found that 90% of PCs are infested with spyware, and users have turned to free programs like Spybot and Ad-Aware for protection.", "stablelm2:1.6b": "California fines makers of spyware up to $1,000 per violation for secretly spying on computer users. A new law aims to protect people from hackers and their personal information, targeting spyware that can hijack data and bombard users with pop-up ads. The Consumer Protection Against Spyware Act in California also requires companies and websites to disclose if they install spyware and allows consumers to seek up to $1,0 P for damages if they think they have been victimized by intrusive software.", "granite3.1-dense:2b": "California has enacted a new law, effective January 1st, to combat the growing threat of spyware on personal computers. This legislation, approved by Governor Arnold Schwarzenegger, imposes fines on developers of such software, up to $1,000 per infection. Spyware, considered a significant security risk, conceals itself within PCs and collects sensitive data like passwords, login details, and credit card numbers. It is difficult to remove due to its frequent updates and adaptability. One type, adware, generates intrusive pop-up ads based on web browsing history. Unlike other states, California has taken proactive steps by passing the Consumer Protection Against Spyware Act. This law mandates companies and websites to disclose if their platforms install spyware, thereby increasing transparency. The new regulation reflects California's commitment to enhancing privacy rights, with recent surveys indicating 90% of PCs are infected with spyware on average. Users currently rely on free tools like Spybot and Ad-Aware for protection against this pervasive threat.", "chatgpt-4o-latest": "California has enacted a law, effective January 1, to combat spyware, imposing fines on makers of programs that secretly monitor users' activities. Approved by Governor Arnold Schwarzenegger, the legislation aims to protect personal data from hackers. Spyware, a major security threat, can steal sensitive information like passwords and credit card details. A related form, adware, tracks web activity and triggers intrusive ads. While Congress debates anti-spyware bills, California's Consumer Protection Against Spyware Act bans unauthorized software installations and mandates disclosure by companies. Consumers can seek up to $1,000 in damages. A survey found 90% of PCs contain spyware, with users relying on free tools like Spybot and Ad-Aware for protection.", "reference": "From 1 January, a new law is being introduced to protect computer users from software known as spyware.One form of spyware called adware has the ability to collect information on a computer user's web-surfing.The state's Consumer Protection Against Spyware Act bans the installation of software that takes control of another computer.The software buries itself in computers and can collect a wide range of information.The makers of computer programs that secretly spy on what people do with their home PCs could face hefty fines in California.Spyware is considered by computer experts to be one of the biggest nuisance and security threats facing PC users in the coming year.Currently users wanting protection from spyware have turned to free programs such as Spybot and Ad-Aware."}