{"raw_text": "Web helps collect aid donations\n \n The web is helping aid agencies gather resources to help cope with the aftermath of the tsunami disaster.\n \n Many people are making donations via websites or going online to see how they can get involved with aid efforts. High-profile web portals such as Google, Yahoo, Ebay and Amazon are gathering links that lead people to aid and relief organisations. So many were visiting some aid-related sites that some webpages were struggling to cope with the traffic. An umbrella organisation called the Disasters Emergency Committee (DEC) has been set up by a coalition of 12 charities and has been taking many donations via its specially created website. It urged people to go online where possible to help because donations could be processed more quickly than cash donated in other ways, meaning aid could be delivered as quickly as possible. The site has so far received almost £8 million, with more than 11,000 donations being made online every hour.\n \n Telco BT stepped in to take over the secure payments on the DEC site and provided extra logistical support for phone and online appeals after it was initially crippled with online donations. It has also provided space in London's BT tower for one of the call centres dealing with donations.\n \n Some of the web's biggest firms are also helping to channel help by modifying their homepages to include links to aid agencies and organisations collecting resources. On its famously sparse homepage Google has placed a link that leads users to a list of sites where donations can be made. Among the 17 organisations listed are Oxfam, Medecins sans Frontieres (Doctors Without Borders) and Network for Good. Many of the sites that Google lists are also taking online donations. Online retailer Amazon has put a large message on its start page that lets people donate money directly to the American Red Cross that will be used with relief efforts. Auction site eBay is giving a list of sites that people can either donate directly to, divert a portion of their profits from anything they sell on eBay to the listed organisations or simply buy items that direct cash to those in the list. Yahoo is proving links direct to charities for those that want to donate. The Auction Drop website is asking people to donate old digital cameras, computers and other gadgets they no longer want that can be auction to raise cash for the aid effort. Sadly, the outpouring of goodwill has also encouraged some conmen to try to cash in. Anti-fraud organisations are warning about e-mails that are starting to circulate which try to convince people to send money directly to them rather than make donations via aid agencies. Those wanting to give cash were urged to use legitimate websites of charities and aid agencies.\n", "llama3.2:1b": "Web is helping aid agencies gather resources for tsunami disaster relief efforts, with Google, Yahoo, Ebay, Amazon, and Microsoft (BT) providing links to donate online.\n\nAid agencies are receiving donations through these web portals, which have been overwhelmed by traffic from people trying to make donations via websites such as Oxfam and Doctors Without Borders.", "llama3.2:3b": "The web is helping aid agencies gather resources for the tsunami disaster by collecting donations through various online platforms, including Google, Yahoo, Ebay, and Amazon. The Disasters Emergency Committee has received almost £8 million in donations, while Telco BT provided logistical support. Many companies are also channeling help by adding links to their websites, allowing people to donate directly to aid agencies.", "gemma2:2b": "The web is a vital resource for the tsunami disaster relief effort, facilitating donations and connecting individuals with aid organizations. Major online platforms like Google, Yahoo, Amazon, and eBay are directing users to relevant resources, while DEC's website has processed over £8 million in donations. Telecommunication company BT has provided logistical support and secure payment processing for the DEC site. Several tech companies have modified their homepages to include links to aid organizations, and online retailers like Amazon offer direct donation options. The Auction Drop initiative aims to collect usable technology to raise funds through auctioning. However, conmen are attempting to capitalize on the situation, prompting warnings against illegitimate solicitations.  \n", "qwen2.5:0.5b": "Web helps collect aid donations by providing links for online donations, such as Google, Yahoo, eBay and Amazon. Some aid organizations, like the Disasters Emergency Committee (DEC), have set up a website and received many donations through it. BT has taken over security support for the DEC site after it was initially crippled with online donations. Other companies are modifying their websites to include links to aid agencies and organizations collecting resources.", "qwen2.5:1.5b": "The internet is aiding disaster relief by gathering resources for tsunami victims, increasing online donations through high-profile portals like Google, Yahoo, Amazon, and eBay, and providing secure payment solutions for the Disasters Emergency Committee (DEC) website. PayPal has also been used to process donations and secure funds from large telecommunication firms.", "qwen2.5:3b": "The web aids aid agencies by facilitating donation collection from users through high-profile portals like Google, Yahoo, eBay, and Amazon. The Disasters Emergency Committee (DEC) created a website for quick donations that has received nearly £8 million with over 11,000 donations per hour. BT helped secure payments and provided logistical support. Many tech giants modified their homepages to include links to aid agencies. Some platforms allow direct donations or offer alternative methods such as auctioning unwanted items. However, conmen are exploiting the situation by sending fraudulent emails asking for cash donations directly. Anti-fraud organizations advise using legitimate charity websites.", "opencoder:1.5b": "Web helps collect aid donations\n\nThe web is helping aid agencies gather resources to cope with the aftermath of the tsunami disaster.\n\nMany people are making donations via websites or going online to see how they can get involved with aid efforts. High-profile web portals such as Google, Yahoo, Ebay and Amazon are gathering links that lead people to aid and relief organisations.\n\nSo many were visiting some aid-related sites that some webpages were struggling to cope with the traffic. An umbrella organisation called the Disasters Emergency Committee (DEC) has been set up by a coalition of 12 charities and has been taking donations via its specially created website.\n\nIt urged people to go online where possible to help because donations could be processed more quickly than cash donated in other ways, meaning aid could be delivered as quickly as possible. The DEC site has so far received almost £8 million, with more than 11,000 donations being made online every hour.\n\nTelco BT stepped in to take over the secure payments on the DEC site and provided extra logistical support for phone and online appeals after it was initially crippled with online donations.\n\nIt has also provided space in London's BT tower for one of the call centres dealing with donations. Among the 17 organisations listed are Oxfam, Medecins sans Frontieres (Doctors Without Borders) and Network for Good. Many of the sites that Google lists are also taking online donations. Online retailer Amazon has put a large message on its start page that lets people donate money directly to the American Red Cross that will be used with relief efforts.\n\nEbay is giving a list of sites that people can either donate directly to, divert a portion of their profits from anything they sell on eBay to the listed organisations or simply buy items that direct cash to those in the list. Yahoo is proving links direct to charities for those that want to donate.\n\nThe Auction Drop website is asking people to donate old digital cameras, computers and other gadgets they no longer want that can be auctioned to raise cash for the aid effort. Sadly, the outpouring of goodwill has also encouraged some con men to try to cash in. Anti-fraud organisations are warning about e-mails that are starting to circulate which try to convince people to send money directly to them rather than make donations via aid agencies. Those wanting to give cash were urged to use legitimate websites of charities and aid agencies.\n", "smollm:1.7b": "The web is helping aid agencies gather resources to help cope with the aftermath of the tsunami disaster. Many people are making donations via websites or going online to see how they can get involved with aid efforts. High-profile web portals such as Google, Yahoo, Ebay and Amazon are gathering links that lead people to aid and relief organisations. So many were visiting some aid-related sites that some webpages were struggling to cope with the traffic. An umbrella organisation called the Disasters Emergency Committee (DEC) has been set up by a coalition of 12 charities and has been taking many donations via its specially created website. It urged people to go online where possible to help because donations could be processed more quickly than cash donated in other ways, meaning aid could be delivered as quickly as possible. The site has so far received almost £8 million, with more than 11,000 donations being made online every hour.\nThe Telco BT stepped in to take over the secure payments on the DEC site and provided extra logistical support for phone and online appeals after it was initially crippled with online donations. It has also provided space in London's BT tower for one of the call centres dealing with donations. Some of the web's biggest firms are also helping to channel help by modifying their homepages to include links to aid agencies and organisations collecting resources. On its famously sparse homepage Google has placed a link that leads users to a list of sites where donations can be made. Among the 17 charities listed are Oxfam, Medecins sans Frontieres (Doctors Without Borders) and Network for Good. Many of the sites that Google lists are also taking online donations. Online retailer Amazon has put a large message on its start page that lets people donate money directly to the American Red Cross that will be used with relief efforts. Auction site eBay is giving a list of sites that people can either donate old digital cameras, computers and other gadgets they no longer want that can be auctioned to raise cash for the aid effort. The Auction Drop website is asking people to donate old digital cameras, computers and other gadgets they no longer want that can be auctioned to raise cash for the aid effort. Unfortunately, the outpouring of goodwill has also encouraged some conmen to try to cash in. Anti-fraud organisations are warning about e-emails that are starting to circulate which try to convince people to send money directly to them rather than make donations via aid agencies. Those wanting to give cash were urged to use legitimate websites of charities and aid agencies.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text into a concise summary preserving key ideas and details. Let me read through the provided text carefully.\n\nThe first part talks about how the web is helping aid agencies deal with the aftermath of the tsunami. Many people are using websites or going online to donate. High-profile portals like Google, Yahoo, etc., have links to these aid sites. They were struggling with traffic and decided to take over after some issues. They received a lot of donations from their specially created DEC site.\n\nThen, Telco BT took over secure payments on the DEC site and provided more support for online appeals. They also allocated space in London's BT tower for one of their call centers dealing with donations.\n\nNext, several big companies are modifying their homepages to include links to aid sites. Google has a sparse homepage with Oxfam and other organizations listed. Amazon directly donates money to the American Red Cross. eBay offers options like donating via auction drop or selling items to get cash for help. Yahoo also links to charities.\n\nHowever, some conmen tried to cash in by sending money directly. Anti-fraud groups warn about e-mails convincing people to donate instead of using proper sites.\n\nI need to condense this into a concise summary without explanations, just plain text.\n</think>\n\nThe web is aiding aid agencies during the tsunami response by offering resources online. Many people use websites or make donations via internet. High-profile portals like Google created a specially designed DEC site, which received £8 million in over 11,000 donations per hour.\n\nTelco BT took over secure payments on the DEC site and provided extra support for online appeals. They allocated space in London's BT tower for donations from their call centers.\n\nSeveral companies modified their homepages to include links to aid sites: Google listed Oxfam and others; Amazon directly donated to the American Red Cross; eBay offered direct donations or selling items for cash. Yahoo also linked to charities. However, some conmen tried cashing in via improper means. Anti-fraud groups warn against direct donations from e-mails.", "tinyllama:1.1b": "The Web Helps Collect Aid Donations, High-Profile Charities Are Participating in a Coalition Website for Disaster Relief Efforts, with Many Online Resources Provided by Organizations Like the Disasters Emergency Committee (DEC), including One of the Coordinating Call Centers. BT Has Step-In to Take Over Secure Payments on the DEC Site, and Telcos, Big Firms, Are Helping to Distribute Help by Modifying Homepages with Links to Aid Agencies and Organizations. Online Retailer Amazon Provides a List of Sites to Donate Directly to American Red Cross, Auction Site eBay Is Diversifying How People Can Donate, while the Web's Top 10 Bloggers Are Helping by Promoting Help for Affected Countries and Organizations.", "tinydolphin:1.1b": " The web is helping aid organizations collect resources, primarily through online platforms such as Google, Yahoo, Amazon, and Ebay to facilitate easy donations for those affected by the tsunami disaster. Major internet companies like Google and Yahoo have made efforts to integrate these links on their homepages, allowing people to easily donate directly to a variety of aid organizations or initiatives. In addition to this, auction site eBay is allowing users to direct donations from sales of certain items, auctions, or to specific charities listed on the platform. \n\nThe Disasters Emergency Committee (DEC), which is set up by a coalition of 12 charities and has been taking many donations via its specially created website, is also utilizing digital platforms for its aid efforts. The site has received more than £8 million in donations and has been processing these through secure payment systems operated by BT, the British Telecom. With their support, the site has processed over 11,000 donations daily.\n\nThe efforts of the internet's biggest companies to help those affected by the tsunami disaster have also encouraged some conmen to try and cash in on the outpouring of goodwill. Anti-fraud organizations are warning people not to send money directly to these scams but rather to use legitimate websites of aid agencies instead. These agencies often require a specific form of payment, such as wire transfers or checks, which can be used to fundraise for disaster relief efforts.", "phi:2.7b": " The web is being used by aid agencies to gather resources for the tsunami disaster, with many people donating through high-profile websites like Google and eBay. The Disasters Emergency Committee has set up a special website that has received over £8 million in donations so far, with more than 11,000 donations being made online every hour. Telco BT is also helping by taking over secure payments on the DEC site. Some of the world's biggest firms are providing links to aid agencies on their homepages for those who want to donate, and auction sites like eBay and Amazon are giving people options to donate directly or through auctioning items. However, there are concerns about scammers trying to take advantage of people's generosity, so it is important to use legitimate websites when making donations.\n", "orca-mini:3b": " The web is helping aid agencies gather resources to help cope with the aftermath of the tsunami disaster. Many people are making donations via websites or going online to see how they can get involved with aid efforts. High-profile web portals such as Google, Yahoo, Ebay and Amazon are gathering links that lead people to aid and relief organizations. The Disasters Emergency Committee (DEC) has been set up by a coalition of 12 charities and has been taking many donations via its specially created website. It urged people to go online where possible to help because donations could be processed more quickly than cash donated in other ways, meaning aid could be delivered as quickly as possible. The site has so far received almost £8 million, with more than 11,000 donations being made online every hour. Telco BT stepped in to take over the secure payments on the DEC site and provided extra logistical support for phone and online appeals after it was initially crippled with online donations. It has also provided space in London's BT tower for one of the call centers dealing with donations. Some of the web's biggest firms are also helping to channel help by modifying their homepages to include links to aid agencies and organizations collecting resources. On its famously sparse homepage Google has placed a link that leads users to a list of sites where donations can be made. Among the 17 organizations listed are Oxfam, Medecins sans Frontieres (Doctors Without Borders) and Network for Good. Many of the sites that Google lists are also taking online donations. Online retailer Amazon has put a large message on its start page that lets people donate money directly to the American Red Cross that will be used with relief efforts. Auction site eBay is giving a list of sites that people can either donate directly to, divert a portion of their profits from anything they sell on eBay to the listed organizations or simply buy items that direct cash to those in the list. Yahoo is providing links to charities for those that want to donate. The Auction Drop website is asking people to donate old digital cameras, computers and other gadgets they no longer want that can be auction to raise cash for the aid effort. Unfortunately, the outpouring of goodwill has also encouraged some conmen to try to cash in. Anti-fraud organizations are warning about e-mails that are starting to circulate which try to convince people to send money directly to them rather than make donations via aid agencies. Those wanting to give cash were urged to use legitimate websites of charities and aid agencies.", "hermes3:3b": "Web aiding tsunami aid agencies collect donations, with DEC site receiving ~$8m & over 11k donations per hour. Telco BT provided logistical support after initial traffic issues.", "stablelm-zephyr:3b": "The web is aiding in collecting aid donations for tsunami relief efforts, with high-profile companies like Google, Yahoo, Ebay, and Amazon providing links to aid organizations on their websites. The Disasters Emergency Committee (DEC) has created a website to collect donations via the internet, receiving almost £8 million in less than 24 hours with over 11,000 online donations per hour. Some firms are also helping by modifying their homepage links to aid agencies and organizations collecting resources. However, conmen have infiltrated the goodwill movement, leading anti-fraud organizations to warn of fraudulent emails asking for direct cash payments instead of donating through legitimate charities and aid agencies.", "stablelm2:1.6b": "The web is helping aid agencies collect resources for the aftermath of a tsunami disaster by allowing people to donate using high-profile websites, such", "granite3.1-dense:2b": "The web is playing a crucial role in facilitating aid donations for the tsunami relief efforts. Major companies like Google, Yahoo, Ebay, Amazon, BT, Oxfam, Medecins sans Frontieres (MSF), Network for Good, American Red Cross, and others are incorporating links to their respective aid organizations on their homepages or dedicated websites. These platforms have experienced significant traffic, with the Disasters Emergency Committee (DEC) receiving nearly £8 million in online donations per hour. BT provided secure payment processing and logistical support after initial issues. Google displays a list of aid-receiving sites on its homepage, while Amazon enables direct donations to the American Red Cross. eBay allows donating profits from sales or buying items that benefit listed organizations, and Yahoo offers charity links for donations. Additionally, Auction Drop encourages users to donate old electronics for cash. However, this surge in goodwill has also led to fraudulent attempts, warning people to use legitimate charity websites for donations to avoid scams.", "chatgpt-4o-latest": "The web is playing a crucial role in gathering aid donations for the tsunami disaster relief. Many people are donating online, and major web portals like Google, Yahoo, eBay, and Amazon are directing users to aid organizations. The Disasters Emergency Committee (DEC), a coalition of 12 charities, has received nearly £8 million through its website, processing over 11,000 donations per hour. BT stepped in to manage secure payments and provide logistical support after the DEC site was overwhelmed. Major tech firms have modified their homepages to include donation links, with Google listing 17 organizations, Amazon enabling direct donations to the Red Cross, and eBay allowing users to donate profits or buy charity-linked items. Auction Drop is collecting old electronics to auction for aid funds. However, fraudsters are exploiting the goodwill, prompting warnings to donate only through legitimate charity websites.", "reference": "Many of the sites that Google lists are also taking online donations.Many people are making donations via websites or going online to see how they can get involved with aid efforts.On its famously sparse homepage Google has placed a link that leads users to a list of sites where donations can be made.Auction site eBay is giving a list of sites that people can either donate directly to, divert a portion of their profits from anything they sell on eBay to the listed organisations or simply buy items that direct cash to those in the list.An umbrella organisation called the Disasters Emergency Committee (DEC) has been set up by a coalition of 12 charities and has been taking many donations via its specially created website.The site has so far received almost £8 million, with more than 11,000 donations being made online every hour.High-profile web portals such as Google, Yahoo, Ebay and Amazon are gathering links that lead people to aid and relief organisations.Anti-fraud organisations are warning about e-mails that are starting to circulate which try to convince people to send money directly to them rather than make donations via aid agencies."}