{"raw_text": "Mobiles rack up 20 years of use\n \n Mobile phones in the UK are celebrating their 20th anniversary this weekend.\n \n Britain's first mobile phone call was made across the Vodafone network on 1 January 1985 by veteran comedian Ernie Wise. In the 20 years since that day, mobile phones have become an integral part of modern life and now almost 90% of Britons own a handset. Mobiles have become so popular that many people use their handset as their only phone and rarely use a landline.\n \n The first ever call over a portable phone was made in 1973 in New York but it took 10 years for the first commercial mobile service to be launched. The UK was not far behind the rest of the world in setting up networks in 1985 that let people make calls while they walked. The first call was made from St Katherine's dock to Vodafone's head office in Newbury which at the time was over a curry house. For the first nine days of 1985 Vodafone was the only firm with a mobile network in the UK. Then on 10 January Cellnet (now O2) launched its service. Mike Caudwell, spokesman for Vodafone, said that when phones were launched they were the size of a briefcase, cost about £2,000 and had a battery life of little more than 20 minutes.\n \n \"Despite that they were hugely popular in the mid-80s,\" he said. \"They became a yuppy must-have and a status symbol among young wealthy business folk.\" This was also despite the fact that the phones used analogue radio signals to communicate which made them very easy to eavesdrop on. He said it took Vodafone almost nine years to rack up its first million customers but only 18 months to get the second million. \"It's very easy to forget that in 1983 when we put the bid document in we were forecasting that the total market would be two million people,\" he said. \"Cellnet was forecasting half that.\" Now Vodafone has 14m customers in the UK alone. Cellnet and Vodafone were the only mobile phone operators in the UK until 1993 when One2One (now T-Mobile) was launched. Orange had its UK launch in 1994. Both newcomers operated digital mobile networks and now all operators use this technology. The analogue spectrum for the old phones has been retired. Called Global System for Mobiles (GSM) this is now the most widely used phone technology on the planet and is used to help more than 1.2 billion people make calls. Mr Caudwell said the advent of digital technology also helped to introduce all those things, such as text messaging and roaming that have made mobiles so popular.\n", "llama3.2:1b": "Mobile phones in the UK are celebrating their 20th anniversary this weekend, with Britain's first mobile phone call being made on January 1, 1985 by Ernie Wise. Mobile usage has increased from nearly 0% of Britons to almost 90%. The advent of digital technology has led to widespread adoption, as seen in the number of customers now reaching over 14 million for one operator alone.", "llama3.2:3b": "Mobile phones in the UK are celebrating their 20th anniversary. The first call was made in 1985 by Ernie Wise across the Vodafone network. Since then, mobile phones have become a part of modern life with almost 90% of Britons owning a handset. The first commercial mobile service was launched in 1985 after 10 years since the first call over a portable phone in 1973.", "gemma2:2b": "Mobile phones in the UK have been used for 20 years. They went mainstream in the early 1980s after their first commercial launch in 1985. Mobile phone technology has evolved from bulky, expensive devices to smaller, more accessible options through digital networks.  The popularity of mobile phones has led to near-universal adoption and made them a primary means of communication for many people.  Their impact on modern life is significant and their evolution is largely attributed to advancements in technology like text messaging and roaming services. \n", "qwen2.5:0.5b": "Mobiles have become an integral part of modern life in the UK for nearly 20 years, with most Britons owning a handset since then. Prior to this, landlines were the dominant form of phone service, but mobile phones are now used as their only form of communication. The first-ever call over a portable phone was made in 1973 by Ernie Wise in New York City, which took 10 years for the UK's first commercial mobile service to be launched in 1985. Mobiles have become so popular that many people use their handset as their only phone and rarely use landlines.", "qwen2.5:1.5b": "Mobile phones in the UK celebrate their 20th anniversary this weekend. Since January 1985, Britain's first mobile phone call was made by comedian Ernie Wise on Vodafone networks. Since then, mobile usage has grown dramatically, with nearly all Britons owning handsets and most people relying solely on mobiles for calls. The technology began as large, expensive devices but became widely popular due to their status symbol appeal among young wealthy businessfolk, despite the challenge of eavesdropping. Mobile phone operators have expanded significantly in recent decades, now having 14 million customers in the UK alone and using digital networks like GSM for widespread communication.", "qwen2.5:3b": "Mobile phones in the UK celebrate their 20th anniversary since the first call on January 1, 1985. Ernie Wise from Vodafone made Britain's first mobile phone call using a portable phone introduced in 1973 by New York-based company Motorola. The service was initially launched commercially in the UK in 1985 but only became widely used due to digital networks adopted in 1990s, leading to global adoption of GSM technology and features like text messaging and roaming. By January 2005, almost 90% of Britons owned a mobile phone.", "opencoder:1.5b": "The output of the given task is a concise summary highlighting key moments and ideas from the provided text.\n", "smollm:1.7b": "The UK's first mobile phone call was made on January 1st, 1985 by Ernie Wise, a comedian who was then in his mid-30s. In the 20 years since that day, mobile phones have become an integral part of modern life and now almost 90% of Britons own a handset. The first ever call over a portable phone was made on January 1st, 1973 in New York but it took 10 years for the first commercial mobile service to be launched. The UK was not far behind the rest of the world in setting up networks in 1985 that let people make calls while they walked. The first call was made from St Katherine's dock to Vodafone's head office in Newbury which at the time was over a curry house. For the first nine days of 1985 Vodafone was the only firm with a mobile network in the UK. Then on January 10th, 1985 Cellnet (now O2) launched its service. Mike Caudwell, spokesman for Vodafone, said that when phones were launched they were the size of a briefcase, cost about £2,000 and had a battery life of little more than 20 minutes. Despite that they were hugely popular in the mid-80s, they became a yuppy must-have and a status symbol among young wealthy business folk. The phones used analogue radio signals to communicate which made them very easy to eavesdrop on. He said it took Vodafone almost nine years to rack up its first million customers but only 18 months to get the second million. \"It's very easy to forget that in 1983 when we put the bid document in we were forecasting that the total market would be two million people,\" he said. \"Cellnet was forecasting half that.\" Now Vodafone has 14m customers in the UK alone. Cellnet and Vodafone were the only mobile phone operators in the UK until 1993 when One2One (now T-Mobile) was launched. Both newcomers operated digital mobile networks and now all operators use this technology. The analogue spectrum for the old phones has been retired. Called Global System for Mobiles (GSM), this is now the most widely used phone technology on the planet and is used to help more than 1.2 billion people make calls. Mr Caudwell said the advent of digital technology also helped to introduce all those things, such as text messaging and roaming that have made mobiles so popular. He said the 20 years since that day have seen a significant increase in mobile phone usage, with over 80% of Britons now owning a handset.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving the key ideas and details. Let me read through the provided text carefully.\n\nThe main points seem to be about mobile phone history in the UK, starting from their first call on January 1985 up until now. Mobiles have been around for over two decades, making them a major part of modern life. The first commercial mobile service was launched in the UK in 1985, and it took until 1993 when another major operator, One2One (now T-Mobile), started operating. Before that, companies like Vodafone and O2 were leading in mobile services.\n\nThe text mentions the first mobile call being made via a portable phone in New York in 1973, but the UK was in the process of setting up mobile networks before 1985. It also talks about how analog signals are easy to intercept, which is a concern for privacy. Vodafone's phone technology, now known as GSM, is used worldwide by billions and remains popular.\n\nI need to make sure that all these key points are included in the summary without adding any extra details or explanations. I should focus on the timeline of mobile phone adoption, the companies involved, the transition from analog to digital, the impact of GSM, and how all operators now use it.\n</think>\n\nMobile phones in the UK celebrated their 20th anniversary this weekend. The first mobile call was made across the Vodafone network on January 1, 1985 by Ernie Wise. Since then, mobiles have become an integral part of modern life, with approximately 90% of Britons owning a handset. Mobiles have become so popular that many use them exclusively, rarely using landlines. The first call over a portable phone was in 1973 in New York, but the UK launched mobile networks in 1985, and O2 (now Vodafone) emerged as a leader. Vodafone's phone technology, now GSM, is widely used around the world by billions, thanks to its ease of use and adaptability to digital networks.", "tinyllama:1.1b": "Britain's first mobile phone call was made over a portable phone in 1973, while the first commercial mobile service was launched in 1985 by Cellnet (now O2). In 1986, One2One launched the first digital mobile network in the UK, which used the GSM technology that has since become the most widely used and beneficial mobile communication system on earth. The first million VoDAfoners were customers in 1985, while the first million Cellnet users joined two years later, in 1987. By 1993, VoDAfon had 14m customers in the UK alone, while One2One had launched its UK mobile phone operation in 1994. Today, VoDAfon is part of O2 (formerly T-Mobile), which has around 60m active users across Europe and a global user base of over 1.2bn people.", "tinydolphin:1.1b": " The origins of mobile phones, which are now a part of our lives, dates back to the year 1985. At that time, there were almost 90% of people owning a mobile phone, even though they were not very comfortable with them. The introduction of digital technology and GSM technology has revolutionized the way we communicate, making it easier to send messages, take photos, and access the internet on our phones. In the UK alone, there are now over 14 million mobile phone users, and the number is increasing each year. Vodafone, which was the first company to launch a mobile service in the UK, has become one of the biggest mobile phone companies globally, with nearly 15 million subscribers. Cellnet was also one of the early players, and its success was based on offering a high-quality product at a reasonable price. The advent of digital technology and GSM technology has made mobiles even more popular, and they continue to evolve and enhance our lives.", "phi:2.7b": " In January 1985, Britain's first mobile phones were launched with the Vodafone network being the only one at the time. The first commercial mobile service was launched in the US in 1983, but it took a few years for the UK to follow suit. By 1985, people could make calls while walking and by the late 80s, mobile phones had become popular among young wealthy business folk. Mobile phone technology has come a long way since then with the introduction of digital networks, text messaging, and roaming making them an integral part of modern life for almost 90% of Britons.\n", "orca-mini:3b": " In 1985, the first mobile phone call was made in the UK across the Vodafone network. Ernie Wise made the first phone call using a portable handset. By the 20th anniversary of mobile phones in the UK this year, almost 90% of Britons own a mobile phone. Mobile phones have become an integral part of modern life and are now used as the only phone by many people. In the 1980s, mobile phones were bulky and used analogue radio signals to communicate, making them easy to eavesdrop on. However, despite this, Vodafone was the only operator in the UK until 1993 when One2One (now T-Mobile) was launched. Orange had its UK launch in 1994. All operators now use digital mobile networks, and all are using the same technology, GSM. The analogue spectrum for old phones has been retired, ushering in the digital era of mobile phone technology.", "hermes3:3b": "Mobile phones in UK turn 20; now almost 90% Britons own a handset, integral part of modern life. First call made in 1985 by Ernie Wise. Became status symbol in mid-80s, with analogue signals which could be easily eavesdropped. GSM technology is now most widely used phone tech globally, helping over 1.2 billion people make calls.", "stablelm-zephyr:3b": "Mobile phones in the UK turned 20 years old this weekend. The first mobile phone call in the UK was made on January 1, 1985, by comedian Ernie Wise using Vodafone's network. In those 20 years, mobile phones have become an essential part of daily life, with almost 90% of Britons owning a handset. They've become so popular that many people use their mobiles as their only phone and rarely use landlines. The first call over a portable phone was made in 1973 in New York, but it took 10 years for the first commercial mobile service to be launched in the UK. Now, Vodafone has 14 million customers in the UK alone, with digital technology having helped introduce features like text messaging and roaming that have made mobiles so popular worldwide.", "stablelm2:1.6b": "Mobile phones celebrate their 5th anniversary in the UK with over 90% of Britons owning a handset. The first call was made from New York to a UK office in 1955, but it took years for commercial services to launch. Vodafone and O2 launched services, while Cellnet initially operated until its acquisition by Vodafone. Mobiles have grown popular with many using their phones as the sole phone, avoiding landlines. Analogue radio signals were easy to eavesdrop on, but digital technology introduced features like text messaging and roaming now make mobiles widely used among 1.2 billion people worldwide.", "granite3.1-dense:2b": "Mobile phones in the UK mark their 20th anniversary this weekend, having evolved from large, expensive devices costing around £2,000 with a mere 20-minute battery life to ubiquitous status symbols among Britons. The first commercial mobile service launched in the UK on January 1, 1985, by Vodafone, following 10 years of research and development. Mike Caudwell, Vodafone's spokesman, notes that despite initial challenges, these early models were popular among young, affluent businesspeople due to their status as a \"yuppy must-have.\"\n\nBy the mid-80s, Vodafone predicted the total UK market would reach two million subscribers. However, it took them 18 months to acquire their second million customers. Cellnet (now O2) entered the market on January 10, 1985, and One2One (T-Mobile) was launched in 1993, followed by Orange in 1994. All UK mobile operators now use digital Global System for Mobiles (GSM) technology, which has helped popularize features like text messaging and roaming. Today, over 1.2 billion people worldwide rely on GSM for their mobile communication needs.", "chatgpt-4o-latest": "Mobile phones in the UK mark their 20th anniversary, with the first call made on 1 January 1985 by comedian Ernie Wise on Vodafone's network. Since then, mobile phones have become essential, with nearly 90% of Britons owning one. The first portable phone call was made in 1973 in New York, but commercial services took a decade to launch. Vodafone initially dominated the UK market until Cellnet (now O2) launched on 10 January 1985. Early mobile phones were large, expensive, and had short battery life but became status symbols. Vodafone took nine years to reach one million customers but only 18 months for the second million. By 1993, One2One (now T-Mobile) and Orange (1994) entered the market, introducing digital networks that replaced analogue systems. The Global System for Mobiles (GSM) became the dominant technology, enabling features like text messaging and roaming, contributing to mobile phones' widespread popularity.", "reference": "Cellnet and Vodafone were the only mobile phone operators in the UK until 1993 when One2One (now T-Mobile) was launched.For the first nine days of 1985 Vodafone was the only firm with a mobile network in the UK.Britain's first mobile phone call was made across the Vodafone network on 1 January 1985 by veteran comedian Ernie Wise.The first ever call over a portable phone was made in 1973 in New York but it took 10 years for the first commercial mobile service to be launched.Mobile phones in the UK are celebrating their 20th anniversary this weekend.This was also despite the fact that the phones used analogue radio signals to communicate which made them very easy to eavesdrop on.The UK was not far behind the rest of the world in setting up networks in 1985 that let people make calls while they walked.Mike Caudwell, spokesman for Vodafone, said that when phones were launched they were the size of a briefcase, cost about £2,000 and had a battery life of little more than 20 minutes.In the 20 years since that day, mobile phones have become an integral part of modern life and now almost 90% of Britons own a handset.Now Vodafone has 14m customers in the UK alone."}