{"raw_text": "Bush website blocked outside US\n \n Surfers outside the US have been unable to visit the official re-election site of President George W Bush.\n \n The blocking of browsers sited outside the US began in the early hours of Monday morning. Since then people outside the US trying to browse the site get a message saying they are not authorised to view it. The blocking does not appear to be due to an attack by vandals or malicious hackers, but as a result of a policy decision by the Bush camp.\n \n The international exclusion zone around georgewbush.com was spotted by net monitoring firm Netcraft which keeps an eye on traffic patterns across many different sites. Netcraft said that since the early hours of 25 October attempts to view the site through its monitoring stations in London, Amsterdam and Sydney failed.\n \n By contrast Netcraft's four monitoring stations in the US managed to view the site with no problems. The site can still be seen using anonymous proxy services that are based in the US. Some web users in Canada also report that they can browse the site. The pattern of traffic to the website suggests that the blocking was not due to an attack by vandals or politically motivated hackers. Geographic blocking works because the numerical addresses that the net uses to organise itself are handed out on a regional basis. On 21 October, the George W Bush website began using the services of a company called Akamai to ensure that the pages, videos and other content on its site reaches visitors. Mike Prettejohn, president of Netcraft, speculated that the blocking decision might have been taken to cut costs, and traffic, in the run-up to the election on 2 November. He said the site may see no reason to distribute content to people who will not be voting next week. Managing traffic could also be a good way to ensure that the site stays working in the closing days of the election campaign. However, simply blocking non-US visitors also means that Americans overseas are barred too. Akamai declined to comment, saying it could not talk about customer websites.\n", "llama3.2:1b": "Bush website blocked outside US due to policy decision. The block was implemented by Bush's camp on October 25 and affects browsing from anywhere in the world, including Canada and Australia. The site can still be accessed using anonymous proxy services. Attempts to view the site through monitoring stations in London, Amsterdam, and Sydney were successful.", "llama3.2:3b": "Bush website blocked outside US due to policy decision by Bush camp, likely to cut costs and traffic in run-up to election on 2 November; international exclusion zone is in place but some users in Canada can still access site using proxy services.", "gemma2:2b": "The George W. Bush reelection website is blocked for visitors outside the US. The blocking began on October 25th and appears to be a policy decision by the Bush campaign.  It is possible that the blockage was implemented due to cost-savings or to manage traffic as election day approaches. While some users in Canada and other countries report being able to access the site, many outside the US are blocked.  \n", "qwen2.5:0.5b": "The US government blocked access to the George W Bush website outside the United States due to a policy decision related to voter registration and election management. The blocking was observed by Netcraft monitoring firm, who noted that attempts using anonymous proxy services in the US were successful despite the blocking. Traffic patterns suggested that the blocking might have been aimed at cutting costs or preventing unauthorized access to non-US users during the election.", "qwen2.5:1.5b": "Bush's re-election website is temporarily inaccessible outside the US due to a policy decision by his camp, likely to cut costs and ensure website stability in election period traffic management efforts, which also blocks American visitors overseas.", "qwen2.5:3b": "Bush website blocked outside US; began on 25 October. Blocking occurred through policy decision rather than attack by vandals or hackers. Not seen as a technical issue but due to geographic blocking system based on regional IP address allocation. Akamai was used for content distribution in late October. Blocking may aim to reduce costs and traffic, especially leading up to election on 2 November. However, it also affects Americans abroad who cannot access the site.", "opencoder:1.5b": "Bush website blocked outside US\n\nSurfers outside the US have been unable to visit the official re-election site of President George W Bush.\n\nSince then people outside the US trying to browse the site get a message saying they are not authorised to view it. The blocking does not appear to be due to an attack by vandals or malicious hackers, but as a result of a policy decision by the Bush camp. The blocking was triggered by a policy decision made by the Bush administration in response to concerns about potential legal ramifications of the georgewbush.com exclusion zone. The US-based monitoring firm Netcraft is another company that has been monitoring traffic to and from georgewbush.com at various points in time, with a consistent pattern showing no issues after the early hours on 25 October.\n", "smollm:1.7b": "The summary is concise and objective, capturing the main points of the original text:\n\n1. The blocking of browsers outside the US by the Bush camp was due to a policy decision rather than an attack or malicious hacking.\n2. The international exclusion zone around George W Bush's website was spotted by Netcraft, which monitors traffic patterns across many different websites.\n3. Netcraft reported that since the early hours of 25 October attempts to view the site through its monitoring stations in London, Amsterdam and Sydney failed.\n4. By contrast, Netcraft's four monitoring stations in the US managed to view the site with no problems.\n5. The pattern of traffic to the website suggests that the blocking was not due to an attack by vandals or malicious hacking.\n6. Geographic blocking works because the numerical addresses that the net uses to organize itself are handed out on a regional basis.\n7. On 21 October, the George W Bush website began using Akamai to ensure that the pages, videos and other content on its site reaches visitors.\n8. Mike Prettejohn, president of Netcraft, speculated that the blocking decision might have been taken to cut costs or traffic in the run-up to the election campaign on 2 November.\n9. The summary does not include any explanations or reasoning processes, focusing solely on the main points and key ideas.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text. Let me read through it carefully.\n\nThe main point is that the Bush website got blocked outside the US. The US users were fine but others weren't. I should mention the blocks happening on Monday morning in the early hours and how attempts failed in London, Amsterdam, Sydney, but worked in the US and Canada. \n\nNetcraft uses this info from their monitoring system. They saw traffic patterns that suggested no blockage elsewhere except where they monitored. They also mentioned Akamai helping with content distribution via a company they called Akamai. Mike Prettejohn thought it might be a cost-saving measure, probably to reduce spending on the site.\n\nI need to make sure I capture all these details without adding extra information. Focus on the key points: the policy causing US visitors to be blocked, non-US users unaffected; the sources of info (Netcraft and Akamai); and Mike Prettejohn's theory about cost reasons.\n</think>\n\n Bush website was blocked outside the U.S., preventing visitors from accessing its official re-election site. Attempts to browse the site failed in London, Amsterdam, Sydney, but worked in the U.S. and Canada. A net monitoring firm (Netcraft) observed traffic patterns that suggested no blocks elsewhere except where they monitored. They noted content distribution via Akamai, a company Mike Prettejohn speculated might be used for cost reasons to reduce expenses during the election campaign.", "tinyllama:1.1b": "United States: Bush website blocked outside US due to policy decision by George W. Bush's campaign team, resulting in a geographical exclusions zone around the site that includes international exclusions zones in London, Amsterdam, and Sydney. The blocking does not appear to be caused by an attack or political motivation, but instead a decision made by the Bush campaign team to ensure that only those within the US can access the site ahead of the election on 2 November. The internet monitoring firm Netcraft managed to view the site with no problems, indicating that the blocking was not due to malicious attacks or political hacking. Non-US visitors are barred from accessing the site.", "tinydolphin:1.1b": " The Bush website was blocked outside the US on October 25th. This decision came as a surprise for users trying to access the official re-election site of President George W. Bush from within the US. The blockage does not seem to be caused by attacks or malicious hacking, but rather an attempt to limit the visibility and reach of the site among people outside the US. This has led to concerns that this decision may have consequences for both the website and the election campaign.", "phi:2.7b": " Surfers outside the US have been unable to visit the official re-election site of President George W Bush due to a policy decision by the Bush camp.\n", "orca-mini:3b": " The official re-election site of President George W Bush has been blocked for surfers outside the US. The blocking began early morning on Monday and is still in effect. The decision appears to be due to a policy decision by the Bush camp rather than an attack or malicious hacker activity. The website can still be viewed using anonymous proxy services based in the US, but other countries are not able to access it. The reason for the blocking may be due to cost-cutting measures, as traffic may not be important during the election campaign. Additionally, non-US visitors are unable to browse the site even if they are American citizens living abroad.", "hermes3:3b": "George W. Bush re-election website blocked outside US.", "stablelm-zephyr:3b": "Surfers outside the US faced difficulty accessing President George W. Bush's official re-election site due to a policy decision by his team, rather than an attack or malicious hacking. Netcraft monitoring firm reported that browsers sited outside the US received an unauthorized message, while attempts to view the site through their London, Amsterdam, and Sydney monitoring stations failed. However, some web users in Canada and Americans overseas still managed to browse the site using anonymous proxy services based in the US or viewing content distributed by Akamai, the company handling the site's content management. Mike Prettejohn, Netcraft's president, speculated that the blocking decision might have been made to cut costs and manage traffic during the election campaign.", "stablelm2:1.6b": "The official re-election website for President George W Bush was inaccessible by surfers outside the US due to a policy decision by his campaign team. This occurred when browsers of non-US users attempted to view the site and received an unauthorized message. The blocking is not likely a result of vandalism or politically motivated hacking, but rather as a cost-saving measure before the election on 2 November. Geographic blocking works with regionalized numerical addresses used for net organization. It was observed by Netcraft, which reported that London, Amsterdam, and Sydney monitoring stations were unable to access the site; four US monitoring stations were successful. Akamai was employed by Bush's website to manage content delivery to users, although its president could not comment on specific details. The blocking also restricted American voters overseas from accessing the site.", "granite3.1-dense:2b": "Surfers outside the US encountered issues accessing President George W. Bush's re-election site due to a policy decision by his campaign team, rather than an attack or hacking. This geographic blocking began on October 25 and affected monitoring stations in London, Amsterdam, Sydney, and some Canadian locations. The site could still be accessed through US-based anonymous proxy services. The Bush camp likely implemented this restriction to manage traffic and potentially cut costs, as the website's content was primarily intended for US voters. Akamai, a company providing content delivery services, was engaged by the Bush campaign on October 21. They declined to comment on their role in this blocking measure.", "chatgpt-4o-latest": "Surfers outside the US have been unable to access President George W. Bush's official re-election website since early Monday, receiving a message stating they are not authorized to view it. The blocking appears to be a policy decision rather than a hacker attack. Net monitoring firm Netcraft detected the restriction, noting that while US-based monitoring stations could access the site, those in London, Amsterdam, and Sydney could not. Some Canadian users reported access, and the site remains viewable via US-based proxy services. The restriction likely stems from geographic blocking, which uses numerical internet addresses assigned regionally. The Bush campaign began using Akamai's services on 21 October, and Netcraft's president speculated that the decision might be aimed at reducing costs and managing traffic before the 2 November election. However, the move also prevents Americans overseas from accessing the site. Akamai declined to comment.", "reference": "Since then people outside the US trying to browse the site get a message saying they are not authorised to view it.Surfers outside the US have been unable to visit the official re-election site of President George W Bush.By contrast Netcraft's four monitoring stations in the US managed to view the site with no problems.Netcraft said that since the early hours of 25 October attempts to view the site through its monitoring stations in London, Amsterdam and Sydney failed.On 21 October, the George W Bush website began using the services of a company called Akamai to ensure that the pages, videos and other content on its site reaches visitors.The site can still be seen using anonymous proxy services that are based in the US.The blocking of browsers sited outside the US began in the early hours of Monday morning."}