{"raw_text": "Blogger grounded by her airline\n \n A US airline attendant is fighting for her job after she was suspended over postings on her blog, or online diary.\n \n Queen of the Sky, otherwise known as Ellen Simonetti, evolved into an anonymous semi-fictional account of life in the sky. But after she posted pictures of herself in uniform, Delta Airlines suspended her indefinitely without pay. Ms Simonetti was told her suspension was a result of \"inappropriate\" images. Delta Airlines declined to comment.\n \n \"I was really shocked, I had no warning,\" Ms Simonetti told BBC News Online. \"I never thought I would get in trouble because of the blog. I thought if they had a problem, someone would have said something before taking action.\" The issue has highlighted concerns amongst the growing blogging community about conflicts of interest, employment law and free speech on personal websites. Ms Simonetti was suspended on 25 September pending an investigation and has since lodged a complaint with the US Equal Employment Opportunity Commission (EEOC). A spokesperson for Delta Airlines told BBC News Online: \"All I can tell you is we do not discuss internal employee issues with the media.\" She added she could not say whether a similar situation over personal websites had occurred in the past.\n \n Ms Simonetti started her personal blog in January to help her get over her mother's death. She had ensured she made no mention of which airline she worked for, and created fictional names for cities and companies. The airline's name was changed to Anonymous Airline and the city in which she was based was called Quirksville. A large part of the blog contained fictional stories because Queen of the Sky developed over the months as a character in her own right, according to Ms Simonetti.\n \n The images were taken from a digital camera she had inherited from her mother. \"We often take pictures on flight or on layovers. I just though why not include them on my blog for fun. \"I never meant it as something to harm my company and don't understand how they think it did harm them,\" Ms Simonetti said. She has also claimed that pictures of male Delta Airline employees in uniform are freely available on the web. Of the 10 or so images on the site, only one showed Ms Simonetti's flight \"wings\". \"They did not tell me which pictures they had a problem with. I am just assuming it was the one of me posing on seats where my skirt rode up,\" she said. The images were removed as soon as she learned she had been suspended. As far as Ms Simonetti knows, there is no company anti-blogging policy. There is guidance which suggests the company uniform cannot be used without approval from management, but use in personal pictures on websites is unclear.\n \n Jeffrey Matsuura, director of the law and technology programme at the University of Dayton, said personal websites can be hazardous for both employers and their employees. \"There are many examples of employees who have presented some kind of material online that have gotten them in trouble with employers,\" he said. It was crucial that any policy about what was and what was not acceptable was expressed clearly, was reasonable, and enforced fairly in company policy. \"You have to remember that as an employee, you don't have total free speech anymore,\" he said. Mr Matsuura added that some companies actively encouraged employees to blog. \"One of the areas where it does become a problem is that they encourage this when it suits them, but they may not be particularly clear when they [employees] do cross the line.\" He speculated that Delta might be concerned that the fictional content on the blog may be linked back to the airline after the images of Ms Simonetti in uniform were posted. \"Whether or not that is successful will depend on what exactly is prohibited, and whether you can reasonably say this content now crosses that line,\" he said. Ms Simonetti said her suspension has caused two of her friends to discontinue their blogs. One of them was asked to stop blogging by his company before any action was taken. \"If they had asked me just take down the blog, I would have done it, but that was not been given to me as an option,\" she said. \"This blogging thing is obviously a new problem for employers and they need to get a policy about it. If I had known it would cost me my job, I would not have done that.\"\n", "llama3.2:1b": "A US airline attendant, Ellen Simonetti, was suspended indefinitely by Delta Airlines without pay after she posted pictures of herself in uniform on her online blog, \"Queen of the Sky\". She claimed the images were taken from a digital camera and were meant to be for personal use only. The airline argued that the posting was \"inappropriate\" and that she had not notified them about it beforehand. Simonetti's blog evolved into a semi-fictional account of life on an airplane, but Delta Airlines claims they have no record of her posting such content before the incident. A spokesperson for Delta said they could not comment on internal employee issues with the media. Simonetti has lodged a complaint with the US Equal Employment Opportunity Commission and is seeking guidance on employment law regarding personal websites.", "llama3.2:3b": "US airline attendant suspended indefinitely after posting pictures of herself in uniform on her blog, which Delta Airlines deemed \"inappropriate\". The blogger claims the suspension was unfair and that there is no company anti-blogging policy. She has lodged a complaint with the US Equal Employment Opportunity Commission and said her suspension has caused friends to discontinue their blogs.", "gemma2:2b": "A US airline attendant, Ellen Simonetti, was suspended indefinitely without pay by Delta Airlines after posting pictures of herself in uniform on her blog, \"Queen of the Sky.\" The blog was a fictional account of life in the sky and did not explicitly mention her employer. Ms. Simonetti believes the company's response is due to the images being taken from a camera passed down from her mother.  Her suspension highlights concerns about personal websites, employment law, and free speech. She has filed a complaint with the US Equal Employment Opportunity Commission and seeks clarification on Delta's unclear policy regarding employee blogging. Experts agree that clear company policies are crucial in this situation, but they also note the growing complexity of regulating employee expression online. \n", "qwen2.5:0.5b": "A US airline attendant named Ellen Simonetti was suspended by Delta Airlines after she posted pictures of herself in uniform. The issue has highlighted concerns about conflicts of interest, employment law and free speech on personal websites. Ms. Simonetti's suspension prompted a complaint with the Equal Employment Opportunity Commission. She claims her blog is not a violation of any company policy because it contains fictional characters and locations instead of names of airlines or cities.", "qwen2.5:1.5b": "A US airline attendant was suspended from her job after posting pictures of herself in uniform on an online diary, resulting in controversy regarding personal blogging policies, employment rights, and conflict of interest concerns among the growing blogging community.", "qwen2.5:3b": "A US airline attendant Ellen Simonetti, who writes under the alias Queen of the Sky, was suspended indefinitely by Delta Airlines without pay after posting images of herself in uniform on her blog. She claims she never intended to harm her company and objects to being held responsible for unrelated male employee photos. The incident highlights conflicts of interest, employment law concerns, and free speech issues in personal websites. Simonetti started the blog in January to help with grief but had obscured details about which airline she worked for. After her suspension, the images were removed, though she doesn't know what else was banned from the site. Her case has raised questions among legal experts on how to balance employee rights and company policies regarding personal online content.", "opencoder:1.5b": "Blogger grounded by her airline\n \nA US airline attendant is fighting for her job after she was suspended over postings on her blog, or online diary. The issue has highlighted concerns amongst the growing blogging community about conflicts of interest, employment law and free speech on personal websites. Delta Airlines declined to comment, stating that their suspension was a \"result of inappropriate images.\" The suspension was lifted on 25 September pending an investigation and has since lodged a complaint with the US Equal Employment Opportunity Commission (EEOC). A spokesperson for Delta Airlines told BBC News Online: \"All I can tell you is we do not discuss internal employee issues with the media. However, we have always agreed upon a policy of no disclosures about internal affairs.\" She added she could not say whether a similar situation over personal websites had occurred in the past.\n \nThe images were taken from a digital camera her mother had inherited from her mother. \"We often take pictures on flight or on layovers. I just though why not include them on my blog for fun. I never meant it as something to harm my company and don't understand how they think it did harm them,\" Ms Simonetti said. She has also claimed that pictures of male Delta Airline employees in uniform are freely available on the web. Of the 10 or so images on the site, only one showed Ms Simonetti's flight \"wings\". \"They did not tell me which pictures they had a problem with. I am just assuming it was the one of me posing on seats where my skirt rode up,\" she said. The images were removed as soon as she learned she had been suspended. As far as Ms Simonetti knows, there is no company anti-blogging policy. There is guidance which suggests the company uniform cannot be used without approval from management, but use in personal pictures on websites is unclear.\n", "smollm:1.7b": "The summary of the text above should be:\n\n\"A US airline attendant is fighting for her job after she was suspended over postings on her blog, or online diary. Ms Simonetti evolved into an anonymous semi-fictional account of life in the sky. But after she posted pictures of herself in uniform, Delta Airlines suspended her indefinitely without pay. Ms Simonetti told BBC News Online that she had no warning before getting in trouble because of the blog. She said she never thought about it as something to harm her company and don't understand how they think it did harm them. Of the 10 or so images on the site, only one showed Ms Simonetti's flight \"wings\". Ms Matsuura, director of the law and technology programme at the University of Dayton, said personal websites can be hazardous for both employers and their employees. You have to remember that as an employee, you don't have total free speech anymore.\"", "deepseek-r1:1.5b": "<think>\nOkay, so I've got this text about Ellen Simonetti being suspended by Delta Airlines after posting her blog. I need to summarize the key points. Let me read through it again.\n\nThe main event is that Simonetti was suspended because she posted pictures of herself in uniform while on a flight. She used images from her mother's digital camera, which were taken on flights and layovers. They thought it wasn't harmful to her company but didn't tell them about the problem. Delta offered her a reason to post on their site without approval but later faced legal issues.\n\nThere are details about Ms Simonetti creating an anonymous account called Queen of the Sky. She had various images, some fictional ones like herself in uniform with male employees. The images were taken from a digital camera, which she inherited from her mother. She's suing Delta and the Equal Employment Opportunity Commission. There's mention of legal advice from the EEOC and that other companies can encourage blogging but might not be clear on boundaries.\n\nAlso, there are points about employment laws being a concern for blogging communities. Ms Simonetti is working in Quirksville, which doesn't seem to be related to her mother's blog. There were two friends who stopped her blogs because of this new issue. She was worried about losing her job if she didn't comply.\n\nI need to make sure I include all the key details without getting too detailed. So the summary should cover her suspension reason, how Delta handled it, any legal stuff, and the broader impact on blogging in the US.\n</think>\n\nMs. Ellen Simonetti was suspended by Delta Airlines after posting images of herself in uniform while on a flight, taken from her mother's digital camera. She created an anonymous account called Queen of the Sky to avoid direct repercussions. The company faced legal challenges over her actions and highlighted concerns about employment laws and free speech on personal websites. Ms. Simonetti was suing both Delta Airlines and the EEOC, with legal advice from the Equal Employment Opportunity Commission. She works in Quirksville but has a mother's blog suspended by her. Her suspension caused two friends to stop her blogs, raising awareness about the challenges blogging faces in employment settings.", "tinyllama:1.1b": "The US airline Delta Airlines has suspended an employee, Ellen Simonetti, who had been working as a \"semi-fictional\" account of life in the sky for some time. The employee posted pictures depicting herself wearing uniform and using work equipment on her company's blog. She was later told that these images were not in line with company policy and were taken from a digital camera she had inherited from her mother. Delta Airlines declined to comment, but Queen of the Sky was reportedly written as an unofficial character in the airline's persona. This story highlights concerns among blogging communities about conflicts of interest, employment law and free speech, as well as potential risks for employers if they encourage employees to blog. The incident is a reminder that personal websites can also be hazardous for both employees and employers, as there are many examples where employees have presented some kind of material online without proper permission. Employees may have taken their inspiration from company policies, but employers need to ensure clear guidance on what constitutes \"free speech\" in company policy before implementing such a policy.", "tinydolphin:1.1b": " In September, airline attendant Ellen Simonetti created a personal blog called Queen of the Sky, where she documented her daily life in the sky and shared images from her uniform. However, after posting pictures of herself wearing a uniform, Delta Airlines suspended her indefinitely without pay. The issue has raised concerns among other bloggers about conflicts of interest, employment law, and free speech on personal websites. Ms Simonetti claims that only one picture was removed by Delta Airlines as soon as she discovered they had a problem with it. She argues that the airline's reaction to her blog is inconsistent with their own stated company policy.", "phi:2.7b": " A US airline attendant was suspended from work after posting pictures of herself in uniform on her blog, which led to concerns over conflicts of interest, employment law, and free speech on personal websites within the blogging community. The employee's suspension has raised questions about whether similar situations have occurred in the past and highlights the need for clear policies regarding what is acceptable on personal websites.\n", "orca-mini:3b": " A US airline attendant named Ellen Simonetti started her personal blog in January to help her get over the loss of her mother. However, she discovered that her airline, Delta Airlines, was concerned about conflicts of interest, employment law, and free speech on personal websites. Ms Simonetti's blog, which evolved into a semi-fictional account of life in the sky, included pictures of herself in uniform taken from a digital camera. She was suspended by Delta Airlines after posting pictures of male airline employees in uniform. The suspension led to a complaint with the US Equal Employment Opportunity Commission.", "hermes3:3b": "US airline attendant suspended over blog post regarding her anonymous diary. Ms Simonetti was suspended after posting pictures of herself in uniform.", "stablelm-zephyr:3b": "US airline attendant Ellen Simonetti was suspended indefinitely without pay by Delta Airlines after she posted pictures of herself in uniform on her personal blog, Queen of the Sky. The suspension raised concerns among bloggers about conflicts of interest, employment law, and free speech on personal websites. Simonetti argued that her images were no different from those of male Delta Airline employees in uniform, which she claimed were freely available online. She has lodged a complaint with the US Equal Employment Opportunity Commission and believes there is no company anti-blogging policy.", "stablelm2:1.6b": "A US airline attendant, Ellen Simonetti (Queen of the Sky), was suspended by Delta Airlines after posting pictures of herself in uniform on her blog without prior consent. Concerns over conflicts of interest, employment law, and free speech on personal websites led to her suspension without pay. Ms. Simonetti has lodged a complaint with the US Equal Employment Opportunity Commission. She started her personal blog to cope with her mother's death, creating fictional characters for stories but never mentioning which airline she worked for. A few images of her were removed after her suspension and are assumed to be related to Delta due to the use of company uniforms in her blog posts. The issue highlights conflicts that arise when blogging becomes a part of employment.", "granite3.1-dense:2b": "Ellen Simonetti, a Delta Airlines attendant, faces job loss due to her indefinite suspension following the discovery of images from her personal blog, \"Queen of the Sky.\" The images, taken with an inherited camera, depicted her in Delta uniform. Simonetti began the blog in January as a coping mechanism for grief, creating a fictional airline and city to protect her identity. Upon learning about the suspension, she lodged a complaint with the US Equal Employment Opportunity Commission.\n\nDelta Airlines declined to comment on the matter, citing internal employee issues policy. Simonetti is unsure if there's an official anti-blogging policy; her guidance suggests uniform use without management approval, but personal pictures on websites is unclear. The suspension has sparked concerns within the blogging community about conflicts of interest, employment law, and free speech on personal websites.\n\nJeffrey Matsuura, director of the University of Dayton's law and technology program, noted that personal websites can be risky for both employers and employees. He emphasized the necessity for clear, reasonable policies enforced fairly to address these concerns. Simonetti's suspension has also discouraged two friends from continuing their blogs, with one being asked to stop by his company before any action was taken.", "chatgpt-4o-latest": "A US flight attendant, Ellen Simonetti, was suspended by Delta Airlines after posting photos of herself in uniform on her blog, \"Queen of the Sky.\" The airline deemed the images \"inappropriate,\" though Simonetti had anonymized company details. She was not warned beforehand and has since filed a complaint with the US Equal Employment Opportunity Commission. The case raises concerns about free speech, employment law, and corporate policies on personal blogging. Experts note that companies need clear guidelines on employee online activity. Simonetti argues she never intended harm and would have removed the blog if asked. Her suspension has led some colleagues to stop blogging, highlighting the growing tension between personal expression and corporate policies.", "reference": "Ms Simonetti was told her suspension was a result of \"inappropriate\" images.\"If they had asked me just take down the blog, I would have done it, but that was not been given to me as an option,\" she said.He speculated that Delta might be concerned that the fictional content on the blog may be linked back to the airline after the images of Ms Simonetti in uniform were posted.\"I was really shocked, I had no warning,\" Ms Simonetti told BBC News Online.One of them was asked to stop blogging by his company before any action was taken.The airline's name was changed to Anonymous Airline and the city in which she was based was called Quirksville.It was crucial that any policy about what was and what was not acceptable was expressed clearly, was reasonable, and enforced fairly in company policy.Ms Simonetti started her personal blog in January to help her get over her mother's death.A US airline attendant is fighting for her job after she was suspended over postings on her blog, or online diary.Ms Simonetti was suspended on 25 September pending an investigation and has since lodged a complaint with the US Equal Employment Opportunity Commission (EEOC).\"I never meant it as something to harm my company and don't understand how they think it did harm them,\" Ms Simonetti said.Ms Simonetti said her suspension has caused two of her friends to discontinue their blogs.As far as Ms Simonetti knows, there is no company anti-blogging policy.I am just assuming it was the one of me posing on seats where my skirt rode up,\" she said.A large part of the blog contained fictional stories because Queen of the Sky developed over the months as a character in her own right, according to Ms Simonetti.But after she posted pictures of herself in uniform, Delta Airlines suspended her indefinitely without pay."}