{"raw_text": "Games 'deserve a place in class'\n \n Computer games could enhance learning and have a legitimate place in the classroom, say researchers.\n \n Academics from the Institute of Education at London University found that \"games literacy\" was a key skill for youngsters. As well as being used in different areas of the curriculum, games are a legitimate area of study in their own right, researchers say. Pupils should also be able to create their own games, they say.\n \n \"Like all games, computer and video games entertain while promoting social development, and playing and talking about games is an important part of young people's lives,\" said project manager Caroline Pelletier.\n \n \"Games literacy is a way of investigating how games are means of expression and representation, just like writing or drawing,\" she said. The researchers conducted two studies into the impact of games on education, the first looking at how they can be used in different curriculum subjects to enhance learning. Researchers found that girls were often excluded from the male-dominated world of game playing. \"Without first-hand experience of how much fun a game can be, they have little motivation to play and remain disengaged from an engrossing and sociable activity,\" said research fellow Diane Carr.\n \n The second project looked at how games can be integrated into media education and concluded that writing games should be a core part of studying them. Sixth-form teacher Barney Oram already teaches computer games alongside the more traditional study of film, TV and popular music at the A-level course he runs at Long Road Sixth Form College in Cambridge.\n \n For parents, the idea that computer games could be brought into the classroom environment, could cause controversy. Dr Andrew Burn, associate director of the Institute of Education's Centre for the Study of Children, Youth and Media moved to reassure anxious parents. \"Games are a legitimate cultural form that deserve critical analysis in schools just as film, television and literature do,\" he said. \"But we also want to argue that full understanding only comes when children have the tools to create their own games.\" The games industry welcomed the report, saying it showed how games had a positive impact on children. \"At a time of hysterical and inaccurate reporting it is heartening to see the cultural, social and educational value of computer and video games being assessed intelligently,\" said Roger Bennett, director general of the Entertainment and Leisure Software Publishers Association. \"This report is further evidence, if it were needed, about the excellence and imagination that thrives in gaming. They have much to offer to the education of our children and they have much to offer as a career.\" The three-year research project, which is being presented at a seminar on Tuesday in London, was partly funded by the Department of Trade and Industry.\n", "llama3.2:1b": "Computer games can enhance learning and have a place in the classroom, with researchers finding that they are an effective way to engage students and promote social development.\n\nGirls who were excluded from traditional game playing often lack motivation to play and remain disengaged when introduced to computer games. \n\nWriting games is a key area of study in itself, as it allows for investigation into expression and representation.\n\nThe Institute of Education found that integrating writing games into media education can be beneficial.\n\nParents may have concerns about bringing computer games into the classroom environment, but researchers argue that they are a legitimate cultural form deserving critical analysis.", "llama3.2:3b": "Academics from the Institute of Education at London University suggest that computer games could enhance learning and have a legitimate place in the classroom, citing \"games literacy\" as a key skill for youngsters. Researchers found that girls were often excluded from game playing, but also argued that writing games should be a core part of studying them. The report's findings were welcomed by the games industry, which sees computer games having a positive impact on children and offering much to education and career development.", "gemma2:2b": "Research indicates games can enhance learning and should be integrated into classrooms. Games literacy, the ability to understand and analyze game mechanics, is essential for young people's development. Studies showed girls are often underrepresented in video games and creating their own games improves engagement. Integrating game studies into media education is recommended, along with encouraging students to create their own games. The report suggests games have positive educational value and can foster creative skills. \n", "qwen2.5:0.5b": "Games \"deserve a place in class,\" say researchers from the Institute of Education at London University, who found that games can enhance learning and should be included as legitimate areas of study in their curriculum. Games literacy is about investigating how games are means of expression and representation, which like writing or drawing is important for young people's lives. They also provide a way to investigate how games are meant to entertain.", "qwen2.5:1.5b": "Researchers from London University assert games should be considered legitimate subjects in schools alongside traditional curricula, promoting \"games literacy\" that encompasses both playing and creating games as an important educational tool. The studies highlight the importance of addressing gender stereotypes in game culture and integrating writing games into media education, while also emphasizing the need for parents to accept games as a cultural form worthy of critical analysis.", "qwen2.5:3b": "Computer games could enhance learning and deserve a place in classrooms, according to researchers from the Institute of Education at London University. They found \"games literacy\" as a key skill for children, who can use and create games across different curriculum areas. The studies also highlighted that girls are often excluded from male-dominated game playing environments. Sixth-form teacher Barney Oram already incorporates computer game study alongside traditional subjects like film, TV, and popular music at his college. Despite concerns from parents about the inclusion of games in classrooms, experts maintain that games are a legitimate cultural form deserving critical analysis and educational engagement. The Entertainment and Leisure Software Publishers Association welcomed the findings, emphasizing the positive impact on children and suggesting games as an excellent career path. The three-year research project was partly funded by the Department of Trade and Industry.", "opencoder:1.5b": "Games 'deserve a place in class' provides an engaging medium for learning and studying. They can enrich social lives and foster creative expression among young learners, while researchers strive to understand how these games impact education. By creating games literacy skills, they aim to make learning more accessible and inclusive, thereby pushing the boundaries of human-computer interaction.\n", "smollm:1.7b": "The summary should be:\nGames 'deserve a place in class'", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely. Let me read through it first.\n\nThe main points are about how computer games can be useful in learning and should be placed in classrooms. There's research done at London University showing that \"games literacy\" is a key skill for kids. They also mention that games are used in different subjects, like math or social studies, to enhance learning. Girls sometimes feel excluded because of being male-dominated, which might make them disengaged. Then there's another study about integrating games into media education, and sixth-form teachers already using video games alongside traditional media topics.\n\nOn the positive side, the report received attention from gaming companies saying it shows how good computer and video games are for children both socially and educationally. The project was supported by trade industry involvement but also mentioned potential controversy from parents.\n\nI need to capture all these points in a concise summary without explanations or formatting.\n</think>\n\nComputer games enhance learning and should be considered part of the curriculum, as found in London University's study. Girls may feel excluded due to gender dominance, which could affect engagement. Another study integrates games into media education, with sixth-form teachers using video games alongside traditional media topics. Gaming companies praise the report for highlighting educational benefits and potential controversy from parents.", "tinyllama:1.1b": "The Institute of Education at London University conducted two studies into the impact of games on education, one looking at how they can be used in different curriculum subjects to enhance learning and another at integrating games into media education. Their research found that girls were often excluded from game playing, but concluded that writing games should be a core part of studying them. While parents fear the integration of computer games into classroom environments, the games industry views it as a positive impact on children. The study was partly funded by the Department of Trade and Industry.", "tinydolphin:1.1b": " In summary, computer games, particularly those used in different curriculum subjects, have positive effects on education and can be part of the classroom experience. This report highlights key areas that need further exploration and understanding. The studies conclude that girls are often left out in the representation and entertainment aspects of these games. Integrating games into media education could be beneficial for both parents and students alike, but critics argue about potential controversies involved.", "phi:2.7b": " Computer games can improve learning and are an important part of children's lives, according to researchers from the Institute of Education at London University. They recommend integrating game creation into media education courses and using games as a means of study in their own right. However, this idea may be controversial for parents who worry about the impact of computer games on their children's behavior. The report was welcomed by the games industry, which sees games as having a positive impact on children and offering career opportunities.\n", "orca-mini:3b": " Computer games could enhance learning and have a legitimate place in the classroom, say researchers. Games literacy is a key skill for youngsters, says the Institute of Education at London University. Playing and talking about games is an important part of young people's lives, according to project manager Caroline Pelletier. Games are a legitimate area of study in their own right, researchers say. Pupils should also be able to create their own games, they say. Without first-hand experience of how much fun a game can be, girls are often excluded from the male-dominated world of game playing, according to research fellow Diane Carr. The second project looked at how games can be integrated into media education and concluded that writing games should be a core part of studying them. Sixth-form teacher Barney Oram already teaches computer games alongside the more traditional study of film, TV and popular music at the A-level course he runs at Long Road Sixth Form College in Cambridge. For parents, the idea that computer games could be brought into the classroom environment, could cause controversy. Dr Andrew Burn, associate director of the Institute of Education's Centre for the Study of Children, Youth and Media moved to reassure anxious parents. \"Games are a legitimate cultural form that deserve critical analysis in schools just as film, television and literature do,\" he said. \"But we also want to argue that full understanding only comes when children have the tools to create their own games.\" The games industry welcomed the report, saying it showed how games had a positive impact on children. \"At a time of hysterical and inaccurate reporting it is heartening to see the cultural, social and educational value of computer and video games being assessed intelligently,\" said Roger Bennett, director general of the Entertainment and Leisure Software Publishers Association. \"This report is further evidence, if it were needed, about the excellence and imagination that thrives in gaming. They have much to offer to the education of our children and they have much to offer as a career.\"", "hermes3:3b": "Games can enhance learning & be used in classrooms, say researchers. Key skills like 'games literacy' needed for pupils to create their own games. Games promote social development & cultural form deserving study in schools.", "stablelm-zephyr:3b": "Researchers from the Institute of Education at London University found that computer games could enhance learning and have a place in classrooms. They argued that \"games literacy\" is an essential skill for young people, just like writing or drawing. The studies showed that girls often miss out on the enjoyment of gaming due to lack of first-hand experience. Project manager Caroline Pelletier said that playing and talking about games is important in promoting social development. Dr. Andrew Burn from the Institute of Education added that games deserve critical analysis just like film, television, and literature. The games industry welcomed the report as further evidence of the positive impact computer and video games can have on children's education and overall growth.", "stablelm2:1.6b": "Researchers from the Institute of Education at London University argue that computer games could enhance learning and deserve a place in classrooms. They found that \"games literacy\" is essential for children and support integrating games into various curriculum subjects. Girls face exclusion in male-dominated game playing, while writing games should be part of studying them as per media education studies. Parents may face controversy regarding bringing computer games into classroom environments; however, the gaming industry supports the assessment of its educational value. A three-year research project supported by the Department of Trade and Industry is being presented at a seminar in London.", "granite3.1-dense:2b": "Computer games can significantly enhance learning and should be considered an integral part of the curriculum, according to researchers from London University's Institute of Education. The study identifies \"games literacy\" as a crucial skill for students, encompassing both game usage in various subjects and the creation of their own games. Games serve as effective tools for teaching social development and expression, similar to writing or drawing. Research found that girls are often underrepresented in game-playing due to lack of initial experience, leading to disengagement. The second study explored integrating games into media education, emphasizing the importance of game writing in comprehensive analysis. For parents, the potential integration of computer games into classrooms may raise concerns; however, Dr. Andrew Burn reassures that games are a legitimate cultural form deserving critical examination alongside film, TV, and literature. The gaming industry agrees, viewing this report as evidence of their positive impact on children's education and future careers. This three-year research project, partially funded by the Department of Trade and Industry, aims to foster a better understanding of games' value in educational settings.", "chatgpt-4o-latest": "Computer games can enhance learning and deserve a place in the classroom, according to researchers from the Institute of Education at London University. They argue that \"games literacy\" is an important skill, and games should be studied as a legitimate cultural form, similar to literature or film. Studies found that games can support learning across subjects and should be integrated into media education, with students encouraged to create their own games. However, girls are often excluded from gaming, limiting their engagement. Researchers reassured parents that games have educational value and should be critically analyzed in schools. The gaming industry welcomed the findings, emphasizing the positive impact of games on education and career opportunities. The three-year study, partly funded by the Department of Trade and Industry, is being presented at a seminar in London.", "reference": "\"Like all games, computer and video games entertain while promoting social development, and playing and talking about games is an important part of young people's lives,\" said project manager Caroline Pelletier.The games industry welcomed the report, saying it showed how games had a positive impact on children.Computer games could enhance learning and have a legitimate place in the classroom, say researchers.The second project looked at how games can be integrated into media education and concluded that writing games should be a core part of studying them.\"Games literacy is a way of investigating how games are means of expression and representation, just like writing or drawing,\" she said.The researchers conducted two studies into the impact of games on education, the first looking at how they can be used in different curriculum subjects to enhance learning.As well as being used in different areas of the curriculum, games are a legitimate area of study in their own right, researchers say.For parents, the idea that computer games could be brought into the classroom environment, could cause controversy."}