{"raw_text": "Nuclear body seeks new tech\n \n The computer systems used to monitor the world's nuclear power installations are so outdated that they are hampering the work of inspectors.\n \n A spokesman for the International Atomic Energy Agency (IAEA) said its current technology could allow key information to be overlooked as it was more than 20 years old. Such systems are the only method of tracking nuclear material worldwide. The agency has appealed for more funds to update its hardware and software. \"A major overhaul of the system is needed to allow inspectors immediate, secure online access to information,\" said project manager Livio Costantini.\n \n IAEA inspectors make around 3,000 visits a year to more than 900 nuclear facilities worldwide. They are there to verify official reports of activities in the plants, to carry out environmental checks, and also to look for any signs that nuclear material is being smuggled in or out of the facility.\n \n The computer system inspectors currently use for comparing data from earlier visits, for instance, was built in the 1970s and largely paper based. An IAEA spokesman said this was extremely inefficient and makes searching for anomalies like searching for a needle in a haystack. The organisation is aiming to start a system upgrade in November, aiming to provide inspectors in the field with secure online access to previous inspection data, design blueprints of nuclear facilities, even satellite images of the plant. Where possible, it hopes to link the system with national records of the import and export of nuclear materials. Further analysis of these could help spot potential smuggling activities or illicit technology transfers between countries, according to a spokesman.\n \n Computer specialist at the IAEA, Peter Smith, would like to be able to incorporate state of the art visualisation techniques, more familiar to video games players, into the inspector's toolkit. \"The commercials you now see have people are moving around in a virtual world,\" he said. \"If we could have that on our laptops, we could be walking through the plant seeing, on the laptop, how the plant should look. \"And if there's a door in the wall that is not on our laptop, then we have a problem.\" The IAEA estimates the total cost of the four-year project to upgrade its technology will be $40m. So far it has only received $11m from the US and the UK. \"Failure to replace the hardware and software, and to integrate fully all the information system components will carry large risks,\" said an agency statement.\n", "llama3.2:1b": "The International Atomic Energy Agency (IAEA) is seeking new technology for its nuclear monitoring systems due to outdated computer systems that are hindering inspector work. The current systems, over 20 years old, can allow key information to be overlooked. Inspectors aim to upgrade the system by November to provide immediate online access to data and link it with national records of nuclear material import and export.", "llama3.2:3b": "The International Atomic Energy Agency's computer systems are outdated, hampering inspectors' work, and the agency is seeking $29m in funding to upgrade its technology. The current system, built in the 1970s, is inefficient and cannot be accessed online. A new system will provide secure access to inspection data, design blueprints, satellite images, and national records of nuclear material imports and exports.", "gemma2:2b": "The International Atomic Energy Agency (IAEA) is requesting funding for a major overhaul of its outdated computer systems used to monitor nuclear power facilities worldwide. The current system's reliance on paper-based processes, dating back to the 1970s, hinders inspection efficiency and hampers the ability to track nuclear material and identify potential smuggling activities.  The project aims to provide inspectors with secure online access to historical data, design blueprints, satellite imagery, and national import/export records to detect anomalies and illicit transfers of nuclear materials or technology. Estimated at $40 million over four years, the project requires additional funding from various countries. \n", "qwen2.5:0.5b": "The IAEA is looking for ways to improve its computer monitoring system that allows inspectors to quickly access historical data of nuclear facilities around the world. The company has appealed for more funds to update its technology, with a major overhaul needed in November. A solution being considered involves incorporating state-of-the-art visualisation techniques into the inspector's toolkit.", "qwen2.5:1.5b": "The International Atomic Energy Agency is calling for a major overhaul of its outdated computer systems used to monitor nuclear power installations worldwide, which hinder inspectors' work by allowing key data to be overlooked. The upgrade would provide secure online access to previous inspection data and design blueprints as well as satellite images, and link the system with national records of nuclear materials imports/export, helping spot potential smuggling or illicit technology transfers.", "qwen2.5:3b": "The computer systems used by IAEA inspectors to monitor nuclear power installations are outdated and inefficient, leading to oversight of key information. Currently over 20 years old, these systems are essential for tracking global nuclear material. The IAEA has called for funding to update its technology, aiming for a major overhaul that would provide inspectors with secure online access to data, blueprints, satellite images, and national records. Key features include visualisation tools akin to video games, which could enhance inspection accuracy. Despite the need, only $11m out of an estimated $40m total project cost has been received thus far.", "opencoder:1.5b": "Nuclear body seeks new technology\n\nThe computer systems used to monitor the world's nuclear power installations are outdated and hampering the work of inspectors. An IAEA spokesman said this was extremely inefficient and makes searching for anomalies like searching for a needle in a haystack. The organisation is aiming to start a system upgrade in November, aiming to provide inspectors with secure online access to previous inspection data, design blueprints of nuclear facilities, even satellite images of the plant. Where possible, it hopes to link the system with national records of the import and export of nuclear materials. Further analysis could help spot potential smuggling activities or illicit technology transfers between countries. The computer specialist at the IAEA would like to incorporate state of the art visualisation techniques, more familiar to video games players, into the inspector's toolkit.\n", "smollm:1.7b": "Nuclear body seeks new tech", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about nuclear inspectors in the IAEA using outdated computer systems. The user wants a concise summary that preserves key ideas and details.\n\nFirst, the main issue is the outdated systems hampering the work of IAEA inspectors. They've been around for 20 years, which makes sense because nuclear technology has evolved quickly.\n\nThen, the IAEA is asking for more funding to update these systems. The current system isn't efficient; it's like a paper-based method that's slow and time-consuming. The goal is to provide better access for real-time data analysis using online tools.\n\nThe updated system aims to link old data with new records from national materials inventories. This could help spot smuggling or tech transfers, which is crucial for security. There are experts involved, like computer scientists, who want better visualization for field use.\n\nSo the key points I need to include: outdated systems, funding request, efficient data access through online tools, linking old and new records, aiming for 2024, and the costs involved.\n</think>\n\nThe outdated computer systems used by IAEA inspectors are hindering their ability to quickly monitor nuclear facilities. They have been operational for over two decades, which has made them inefficient and slow. The IAEA is requesting additional funding to upgrade these systems to allow for more efficient and secure access to historical data using online tools. The updated system aims to link previous inspection records with national material inventories to detect potential smuggling or tech transfers between countries. Experts like Peter Smith aim to integrate advanced visualization techniques, similar to video games, into their field use.", "tinyllama:1.1b": "The computer systems used by inspectors monitoring worldwide nuclear power installations are so outdated that they are hampering their work. The current technology is too old, and it lacks secure online access for accessing past inspection data, design blueprints of nuclear facilities, satellite images of plants, and linking to national records of importing and exporting nuclear materials. The IAEA is seeking funding from the US and UK for a four-year project aimed at upgrading its technology, integrating all information system components, and replacing outdated hardware and software. The cost of the project is estimated at $40m but has only received $11m so far.", "tinydolphin:1.1b": " The International Atomic Energy Agency (IAEA) seeks new technologies for tracking nuclear material worldwide, as its current systems are outdated and hamper their work. Its inspectors require secure online access to the most up-to-date information at every visit, and need a more efficient way of handling this data. To improve the security of their data, the IAEA is planning a major upgrade in November that will include upgrading its computer systems, providing inspectors with secure online access to previous inspection data, design blueprints of nuclear facilities, satellite images, and incorporating state-of-the-art visualization techniques. This project could help detect potential smuggling activities or illicit technology transfers between countries more easily.", "phi:2.7b": " The IAEA's computer systems used to monitor nuclear power installations are outdated, making it difficult for inspectors to track nuclear material worldwide efficiently. A spokesperson for the organization has appealed for more funds to update hardware and software. Upgrading to a new system in November would allow secure online access to previous inspection data, design blueprints of facilities, and satellite images. The upgrade could also link the system with national records of import and export of nuclear materials. Computer specialist Peter Smith would like to incorporate state-of-the-art visualization techniques into the inspector's toolkit for better analysis. The total cost of the project is estimated to be $40m, but the IAEA has only received $11m so far. Failure to upgrade could lead to large risks.\n", "orca-mini:3b": " The IAEA is seeking new technology to improve its monitoring of nuclear installations worldwide. outdated computer systems are hindering inspectors' work, as they cannot easily access previous inspection data or satellite images of the plant. The organization aims to start a system upgrade in November, which will provide inspectors with secure online access to previous inspection data, design blueprints of nuclear facilities, and even satellite images of the plant. Computer specialist Peter Smith would like to incorporate state-of-the-art visualization techniques into the inspector's toolkit, making it easier for them to see potential smuggling activities or illicit technology transfers between countries. The total cost of the project is estimated at $40 million, with only $11 million received so far from the US and UK. The IAEA hopes to start the project in November with a new system that can be linked to national records of nuclear materials.", "hermes3:3b": "Aged nuclear monitoring systems need upgrades, as they are over 20 years old and hinder IAEA inspectors' ability to track nuclear material effectively. IAEA seeks $40m for a four-year project to upgrade technology, aiming for secure online access to data, better visualisation tools and integration with national records of imports/exports.", "stablelm-zephyr:3b": "Old computer systems at the International Atomic Energy Agency (IAEA) are hindering inspections at nuclear facilities worldwide by providing outdated technology that overlooks key information. The IAEA has appealed for funding to update its hardware and software, with a major overhaul of the system planned for November. The new system will provide inspectors secure online access to previous inspection data, design blueprints of nuclear facilities, and even satellite images of plants. An estimated $40m four-year project is underway, with only $11m secured so far from the US and UK.", "stablelm2:1.6b": "The International Atomic Energy Agency (IAEA) needs more funds to update its outdated computer systems used for monitoring nuclear power installations worldwide. The current technology is over 10 years old and allows inspectors to overlook key information, hampering their work. Inspectors visit over 30 facilities per year to verify official reports, carry out environmental checks, and spot potential smuggling or illicit transfers between countries. A major overhaul of the system is needed for online access to inspection data, blueprints, satellite images, and national records. The IAEA aims to start a four-year project costing $10 million in total, with only $500,0..\n  \nIn summary: The IAEA requires more funding to update its outdated computer systems for monitoring nuclear installations worldwide, as the current technology is over 10 years old and can overlook key information. Inspectors visit around 30 facilities per year to verify reports, environmental checks, and spot potential smuggling or illicit transfers between countries. A major overhaul of the system is necessary to provide secure online access to inspection data, satellite images, blueprints, and national records. The total cost of the four-year project is $10 million.", "granite3.1-dense:2b": "The International Atomic Energy Agency (IAEA) faces significant challenges due to outdated computer systems used for monitoring nuclear power installations worldwide. These 20-year-old systems, primarily paper-based and from the 1970s, hinder inspectors' ability to efficiently compare data from previous visits, detect anomalies, or access secure online information. The IAEA is seeking $40 million over four years to modernize its technology, aiming to provide inspectors with real-time, secure online access to inspection data, facility designs, satellite images, and links to national records of nuclear material imports and exports. This upgrade would enhance their ability to identify potential smuggling or illicit technology transfers. As of now, the agency has only secured $11 million from the US and UK, highlighting the financial need for this project.", "chatgpt-4o-latest": "The International Atomic Energy Agency (IAEA) warns that its outdated computer systems, over 20 years old, are hampering nuclear inspections and could lead to key information being overlooked. These systems are crucial for tracking nuclear material worldwide. The IAEA, which conducts around 3,000 inspections annually at over 900 facilities, is seeking funds to modernize its technology. The current system, largely paper-based and dating back to the 1970s, makes detecting anomalies highly inefficient. The planned upgrade, starting in November, aims to provide inspectors with secure online access to past inspection data, facility blueprints, and satellite images, and potentially link with national nuclear material records to detect smuggling or illicit transfers. The agency also hopes to incorporate advanced visualization tools to enhance inspections. The four-year project is estimated to cost $40 million, but only $11 million has been secured from the US and UK. The IAEA warns that failing to upgrade the system poses significant risks.", "reference": "A spokesman for the International Atomic Energy Agency (IAEA) said its current technology could allow key information to be overlooked as it was more than 20 years old.IAEA inspectors make around 3,000 visits a year to more than 900 nuclear facilities worldwide.Such systems are the only method of tracking nuclear material worldwide.\"Failure to replace the hardware and software, and to integrate fully all the information system components will carry large risks,\" said an agency statement.\"A major overhaul of the system is needed to allow inspectors immediate, secure online access to information,\" said project manager Livio Costantini.The organisation is aiming to start a system upgrade in November, aiming to provide inspectors in the field with secure online access to previous inspection data, design blueprints of nuclear facilities, even satellite images of the plant.The computer systems used to monitor the world's nuclear power installations are so outdated that they are hampering the work of inspectors.An IAEA spokesman said this was extremely inefficient and makes searching for anomalies like searching for a needle in a haystack."}