{"raw_text": "Web logs aid disaster recovery\n \n Some of the most vivid descriptions of the devastation in southern Asia are on the internet - in the form of web logs or blogs.\n \n Bloggers have been offering snapshots of information from around the region and are also providing some useful information for those who want to help. Indian writer Rohit Gupta edits a group blog called Dogs without Borders. When he created it, the site was supposed to be a forum to discuss relations between India and Pakistan. But in the wake of Sunday's tsunami, Mr Gupta and his fellow bloggers switched gears.\n \n They wanted to blog the tsunami and its aftermath. One Sri Lankan blogger in the group goes by the online name Morquendi. With internet service disrupted by the tsunami, Morquendi started sending SMS text messages via cell phone from the affected areas of Sri Lanka. \"We started publishing these SMSes,\" says Mr Gupta.\n \n \"Morquendi was describing scenes like 1,600 bodies washed up on a shore, and people burying, and burying and burying them. People digging holes with their hands. And this was coming through an SMS message. \"We didn't have visual accounts on radio or on TV, or in the print media.\" Soon, thousands of web users around the world were logging on to read Morquendi's first hand accounts. In one message, Morquendi wrote about a Sri Lankan woman who was running home with a friend when the wave hit. \"She was being swept away,\" Morquendi's message read. \"She grabbed a tree with one hand and her friend with the other. She says she watched the water pull her friend away.\" Mr Gupta says the power of Morquendi's text message blogs was palpable. \"He was running around, looking for friends, burying bodies, carrying bodies,\" Mr Gupta says of Morquendi. \"I can't even begin to imagine the psychological state he was in when he was sending us reports, and doing the relief work at the same time. \"He was caught between being a journalist and being a human being.\"\n \n Others blogs are helping to spread information about relief efforts. Dina Mehta is an Indian blogger who's helping with the newly created South East Asia Earthquake and Tsunami Blog. She says the blog is not meant to be filled with first person accounts. \"What we're doing is we're building a resource,\" she says. \"Anyone who says, OK, I want to come and do some work in India, volunteer in India, or in Sri Lanka or Malaysia, this is the sort of one-stop-shop that they can come to for all sorts of resources - emergency help lines, relief agencies, aid agencies, contacts for them etc.\"\n \n Ms Mehta also says she wishes that governments in the region would realise the power of blogs. \"Imagine if they had this resource available to them, if there was a disaster, how quickly you could funnel aid in, and get people to help,\" she says. Bloggers in the United States are also getting involved. Ramdhan Yadav Kotamaraja is originally from India, but now lives in Dallas. Mr Kotamaraja wanted to help those affected by the tsunami by pooling money with concerned friends. So, he set up an online payment system on his website. Then, says Mr Kotamaraja, the blogging world found out. \"All my blogger friends started linking up my site, and I saw a lot of people other than my friends. I'd say 70% of the donations came from people I don't know. \"It's simply unbelievable to me, that people that I don't know will come and start donating.\" News spreads quickly on weblogs, a phenomenon that helps bloggers expand their audience and scope. In Sri Lanka, blogger Morquendi is recruiting others to help. One recruit calls himself Heretic. In one of his latest posts, Heretic asks: \"Have you ever seen fishing trawlers on the road? Ever seen a bus inside a house? \"Well,\" Heretic writes, \"that was just the least affected areas - so you can just imagine - or can you?\" He concludes: \"Keep it blogged.\"\n \n Clark Boyd is technology correspondent for The World, a BBC World Service and WGBH-Boston co-production.\n", "llama3.2:1b": "Web logs aid disaster recovery through providing immediate information to those in need.\n\nBloggers are creating online platforms to share their experiences with the tsunami and its aftermath, helping to disseminate information quickly.\n\nOne blogger, Morquendi, is using SMS messages from affected areas to send updates to thousands of web users worldwide.\n\nOther bloggers, such as Dina Mehta, are also creating resources to help relief efforts, including emergency contact numbers and aid agency websites.\n\nBloggers in the US are taking a similar approach, pooling money with friends to support those affected by the tsunami.\n\nThe blogging world is expanding its audience through news that spreads quickly online.", "llama3.2:3b": "Web logs are providing vivid descriptions of devastation in southern Asia following the tsunami, as well as useful information for those wanting to help with relief efforts. Bloggers such as Rohit Gupta and Morquendi are sharing firsthand accounts, including SMS messages from affected areas. Others, like Dina Mehta, are creating resources for volunteers and aid agencies. The blogging community is also facilitating donations and spreading news quickly, highlighting the potential of blogs in disaster recovery and response.", "gemma2:2b": "Web logs are aiding disaster recovery by providing real-time information about the devastation and relief efforts in South Asia. Bloggers like Rohit Gupta, Morquendi, Dina Mehta, and Ramdhan Yadav Kotamaraja are sharing firsthand accounts of the tsunami's impact, connecting individuals to resources for aid, and even recruiting volunteers. The power of weblogs in disseminating information quickly allows bloggers to expand their audiences and contribute to efficient relief efforts. \n", "qwen2.5:0.5b": "Web logs help disaster recovery by providing information about the response to natural disasters like the tsunami in southern Asia. Bloggers are sharing their experiences and describing the aftermath of the event, with some reporting on physical damage while others focusing on mental impacts. Others are offering help through mobile text messages to those affected. The use of blogs is seen as a way for bloggers to spread information more efficiently than traditional media.", "qwen2.5:1.5b": "Web logs (blogs) have become important resources in disaster relief efforts. Bloggers are providing real-time updates on natural disasters like the tsunami. They include vivid accounts of scenes such as 1,600 bodies washed up on a shore and people burying or digging holes to help survivors recover. The blogs also connect people interested in volunteering with aid agencies for guidance on where to donate or assist. Blogging has increased donors' willingness to contribute due to the ease of spreading information quickly online.", "qwen2.5:3b": "Web logs, or blogs, have been instrumental in disaster recovery efforts following the 2004 tsunami in southern Asia. Indian writer Rohit Gupta's group blog, Dogs without Borders, initially focused on India-Pakistan relations but shifted to provide real-time accounts of the tsunami and its aftermath. Blogger Morquendi shared SMS text messages from Sri Lanka, detailing harrowing scenes like bodies being buried en masse. Dina Mehta created a relief efforts blog for South East Asia, offering comprehensive resources for those aiding affected regions. In the U.S., Ramdhan Yadav Kotamaraja used his website to set up an online payment system for tsunami relief, with contributions from strangers. Blogging's speed in spreading news helps expand readership and scope. Another blogger, Heretic, encourages sharing disaster experiences on blogs.", "opencoder:1.5b": "The disaster recovery web log aims to preserve key ideas and details related to the disaster from which the affected areas in southern Asia experienced tsunami. Through the use of text-based blogs, it provides an accessible and interactive platform for sharing information about various incidents that impacted the region. The blogger's intention is to help others navigate through the aftermath of the disaster, including the impact on people and resources.\n", "smollm:1.7b": "The following summary preserves key ideas and details from the text:\n\nWeb logs aid disaster recovery\n\nSome of the most vivid descriptions of the devastation in southern Asia are on the internet - in the form of web logs or blogs. Indian writer Rohit Gupta edits a group blog called Dogs without Borders. When he created it, the site was supposed to be a forum to discuss relations between India and Pakistan. But in the wake of Sunday's tsunami, Mr Gupta and his fellow bloggers switched gears. They wanted to blog about the tsunami and its aftermath.\n\nOne blogger in particular caught our attention - Morquendi. With internet service disrupted by the tsunami, Morquendi started sending SMS messages via cell phone from the affected areas of Sri Lanka. \"She was being swept away,\" Morquendi's message read. \"She grabbed a tree with one hand and her friend with the other. She says she watched the water pull her friend away.\" Mr Kotamaraja, who had been in touch with Morquendi before the tsunami, was impressed by his bravery and generosity.\n\nOther blogs are helping to spread information about relief efforts. Dina Mehta is an Indian blogger who's helping to build a resource for those affected by the disaster. She says that governments in the region should realize the power of blogs in spreading information quickly. \"Imagine if they had this resource available to them, if there was a disaster, how quickly you could funnel aid in, and get people to help,\" she says. \"It's simply unbelievable to me, that people that I don't know will come and start donating.\"\n\nNews spreads quickly on weblogs\n\nA phenomenon that helps bloggers expand their audience and scope is news spreading quickly on weblogs. In Sri Lanka, blogger Morquendi was recruited by a local newspaper to help spread information about the tsunami. He started posting updates from the ground, which helped to attract attention from other bloggers in the region. News of the disaster spread like wildfire through the blogging community, and soon Morquendi's message was being shared with thousands of people around the world.\n\nThe following summary preserves key ideas and details from the text:\n\nWeb logs aid disaster recovery\n\nSome of the most vivid descriptions of the devastation in southern Asia are on the internet - in the form of web logs or blogs. Indian writer Rohit Gupta edits a group blog called Dogs without Borders. When he created it, the site was supposed to be a forum to discuss relations between India and Pakistan. But in the wake of Sunday's tsunami, Mr Gupta and his fellow bloggers switched gears. They wanted to blog about the tsunami and its aftermath.\n\nOne blogger in particular caught our attention - Morquendi. With internet service disrupted by the tsunami, Morquendi started sending SMS messages via cell phone from the affected areas of Sri Lanka. \"She was being swept away,\" Morquendi's message read. \"She grabbed a tree with one hand and her friend with the other. She says she watched the water pull her friend away.\" Mr Kotamaraja, who had been in touch with Morquendi before the tsunami, was impressed by his bravery and generosity.\n\nOther blogs are helping to spread information about relief efforts. Dina Mehta is an Indian blogger who's helping to build a resource for those affected by the disaster. She says that governments in the region should realize the power of blogs in spreading information quickly. \"Imagine if they had this resource available to them, if there was a disaster, how quickly you could funnel aid in, and get people to help,\" she says. \"It's simply unbelievable to me, that people that I don't know will come and start donating.\"\n\nNews spreads quickly on weblogs\n\nA phenomenon that helps bloggers expand their audience and scope is news spreading quickly on weblogs. In Sri Lanka, blogger Morquendi was recruited by a local newspaper to help spread information about the tsunami. He started posting updates from the ground, which helped to attract attention from other bloggers in the region. News of the disaster spread like wildfire through the blogging community, and soon Morquendi's message was being shared with thousands of people around the world.\n\nThe following summary preserves key ideas and details from the text:\n\nWeb logs aid disaster recovery", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about web logs aiding disaster recovery. First, the text mentions that web logs are becoming vivid online in southern Asia due to disasters like the tsunami in India.\n\nThe bloggers contribute information, both for helping and providing data. Rohit Gupta's group blog, Dogs without Borders, switches from a forum to cover the aftermath of the tsunami with SMS stories. Morquendi writes about bodies being washed up and burying people via text messages, showing how news spreads quickly.\n\nOther blogs assist in spreading relief info, like Dina Mehta creating a blog for South East Asia's震 tsunami, not focused on first-person accounts. US bloggers Ramdhan Kotamaraja join a friend to pool donations, highlighting the potential of blogs for aid spread.\n\nThe text also touches on Clark Boyd's role as a tech reporter but doesn't go into details about that part.\n</think>\n\nSome of the most vivid descriptions of the devastation in southern Asia are online—through web logs or blogs. Bloggers offer insights and support during disasters like the tsunami, which disrupted relations between India and Pakistan. Rohit Gupta edited Dogs without Borders, a forum initially for discussions but switched to covering the tsunami's aftermath with SMS stories about bodies, tunnels, and buries. Morquendi wrote about people being swept away or buried in text messages, showing how news spreads.\n\nOther blogs aid relief efforts, like Dina Mehta for South East Asia’s震 blog, which isn’t filled with first-person accounts but provides resources for disaster relief. US bloggers like Ramdhan Kotamaraja pool donations via a website and linked friends to help, indicating blogs can spread aid. Highlighting the tech reporter Clark Boyd's role adds context, though details on that part are omitted.", "tinyllama:1.1b": "In the aftermath of Sunday's disaster in southern Asia, weblogs have played a crucial role in helping those affected by the event to communicate with others who can provide aid. Indian writer Rohit Gupta and his fellow bloggers are among those using their online platforms to share information, such as firsthand accounts from Sri Lanka, and mobilize support for relief efforts. In addition, some individuals have set up pay-it-forward websites on their sites, while others have recruited others to help in the effort. As a result of these initiatives, bloggers have expanded their audiences and scope beyond just those they knew beforehand. Overall, weblogs aid disaster recovery by providing a platform for communicating with people who may not be able to travel or access traditional media outlets.", "tinydolphin:1.1b": " The Summarized Text: In the aftermath of the tsunami that hit India, Sri Lanka, and other regions, web logs serve as valuable communication channels for sharing real-time information, providing assistance to those affected, and connecting people globally. Indian blogger Rohit Gupta's group blog, Dogs without Borders, has been a crucial resource in coordinating relief efforts in the affected regions, enabling the spread of information and assistance. In response to the tsunami, one Sri Lankan blogger, Morquendi, started sending SMS messages to relay messages from the disaster-affected areas of Sri Lanka, garnering over 70% of donations from strangers. Another blogger, Heretic, has been recruiting helpers in other parts of the world to assist with rescue efforts and other tasks.", "phi:2.7b": " Web logs aid disaster recovery by providing first-hand accounts of devastation and offering useful information for those who want to help. Bloggers are sharing these reports through SMS messages and online blogs, helping spread awareness about relief efforts and acting as a one-stop resource for anyone seeking aid in the affected regions. Governments can also learn from this power of blogs and use it to funnel aid quickly during disasters. Donations to online fundraisers can come from people all over the world, showing how blogging has a global reach.\n", "orca-mini:3b": " Web logs aid disaster recovery efforts by providing firsthand accounts of the devastation in southern Asia and helping to distribute resources such as aid agencies, aid, and contacts. Bloggers are also spreading information about relief efforts and building a resource for anyone who wants to come and volunteer in India, Sri Lanka, or Malaysia. The power of blogs is their ability to reach a wide audience quickly, which helps bloggers expand their scope and attract more readers.", "hermes3:3b": "Blogs aid disaster recovery by providing real-time accounts and resources for those looking to help in times of natural disasters.", "stablelm-zephyr:3b": "During the disaster in southern Asia, web logs or blogs provided vivid descriptions of the devastation and aided recovery efforts. Bloggers offered snapshots of information from the region and shared useful information to help those who wanted to assist. Web users around the world accessed firsthand accounts through SMS messages sent by bloggers like Morquendi from affected areas in Sri Lanka. These accounts described scenes of bodies washed up onshore, people burying victims, and disrupted communications due to internet service disruptions.\n\nSome blogs aimed at spreading information about relief efforts, offering resources for those wishing to help such as emergency help lines, aid agencies, and contacts. Indian blogger Dina Mehta wished that governments in the region realized the power of blogs, enabling quick funneling of aid during disasters. An example of this collaboration was observed when an unknown 70% of donations in an online payment system set up by Ramdhan Yadav Kotamaraja came from people he didn't know. The ease and widespread reach of blogging made it a valuable tool for expanding the scope of assistance efforts.", "stablelm2:1.6b": "Web logs aid disaster recovery by providing snapshots of information from around the region in the form of blogs during natural disasters such as the tsunami in southern Asia. Bloggers offer useful information for those who want to help while also blogging their experiences. A Sri Lankan blogger named Morquendi is an example of a successful blogger, sending SMS text messages describing scenes like washed bodies and digging holes to fellow bloggers worldwide. The power of Morquendi's text message blogs was palpable as he caught between being a journalist and human being during the relief work. Other bloggers create resources such as South East Asia Earthquake and Tsunami Blog, which is a one-stop-shop for emergency help lines, relief agencies, aid agencies, and contacts for those who want to volunteer in the region. The phenomenon helps bloggers expand their audience and scope. In Sri Lanka, blogger Morquendi is recruiting others to help.", "granite3.1-dense:2b": "Web logs (blogs) have become crucial in disseminating information about the devastation caused by the 2004 Indian Ocean tsunami in southern Asia, particularly in Sri Lanka and India. Blogger Rohit Gupta initiated Dogs without Borders to discuss relations between India and Pakistan, but he shifted its focus post-tsunami to document the disaster's impact. One of his contributors, Morquendi, sent SMS messages from affected areas, providing graphic firsthand accounts that were unparalleled in visual media at the time.\n\nDina Mehta created South East Asia Earthquake and Tsunami Blog as a resource for volunteers, offering contact information for relief agencies, emergency help lines, and locations for aid work in India, Sri Lanka, and Malaysia. She advocates for governments to recognize the power of blogs during disasters to expedite aid distribution.\n\nIn the United States, Ramdhan Yadav Kotamaraja facilitated a crowdfunding system on his website, which gained traction through bloggers' promotion, resulting in significant donations from unfamiliar individuals.\n\nSri Lankan blogger Heretic, recruited by Morquendi, posted details about the least affected areas to emphasize the magnitude of the disaster's impact. Blogs serve not only as a means to convey information but also as platforms for rallying support and coordinating relief efforts among internet users worldwide.", "chatgpt-4o-latest": "Web logs, or blogs, have played a crucial role in documenting the devastation caused by the South Asian tsunami and aiding relief efforts. Bloggers like Rohit Gupta and Sri Lankan blogger Morquendi provided real-time updates, including harrowing first-hand accounts via SMS when internet services were down. Their reports conveyed the scale of the disaster, such as mass burials and personal survival stories. Other blogs, like the South East Asia Earthquake and Tsunami Blog, served as resource hubs for volunteers and aid agencies. Indian blogger Dina Mehta highlighted the potential of blogs for disaster response, urging governments to utilize them for faster aid coordination. In the U.S., blogger Ramdhan Yadav Kotamaraja used his site to collect donations, with most contributions coming from strangers. The rapid spread of information through blogs has expanded their reach and impact, with bloggers like Morquendi recruiting others to share updates.", "reference": "Mr Gupta says the power of Morquendi's text message blogs was palpable.\"He was running around, looking for friends, burying bodies, carrying bodies,\" Mr Gupta says of Morquendi.In one message, Morquendi wrote about a Sri Lankan woman who was running home with a friend when the wave hit.\"Imagine if they had this resource available to them, if there was a disaster, how quickly you could funnel aid in, and get people to help,\" she says.One Sri Lankan blogger in the group goes by the online name Morquendi.Then, says Mr Kotamaraja, the blogging world found out.\"She was being swept away,\" Morquendi's message read.In Sri Lanka, blogger Morquendi is recruiting others to help.\"We started publishing these SMSes,\" says Mr Gupta.With internet service disrupted by the tsunami, Morquendi started sending SMS text messages via cell phone from the affected areas of Sri Lanka.And this was coming through an SMS message.Mr Kotamaraja wanted to help those affected by the tsunami by pooling money with concerned friends.\"All my blogger friends started linking up my site, and I saw a lot of people other than my friends.\"I can't even begin to imagine the psychological state he was in when he was sending us reports, and doing the relief work at the same time.\"Well,\" Heretic writes, \"that was just the least affected areas - so you can just imagine - or can you?\"But in the wake of Sunday's tsunami, Mr Gupta and his fellow bloggers switched gears.I'd say 70% of the donations came from people I don't know.She says the blog is not meant to be filled with first person accounts."}