{"raw_text": "Home phones face unclear future\n \n The fixed line phone in your home could soon be an endangered species.\n \n Research by handset maker Nokia shows that more and more people are using their mobile phone for every call they make or take. According to the study, more than 45 million people in the UK, Germany, US and South Korea now only use a mobile. It showed that people keep their fixed line phone because call charges are lower, but most of those questioned said the future was definitely mobile.\n \n The Nokia-sponsored research showed that mobiles and fixed phones were used for different purposes. Home phones were used for longer calls but conversations on mobiles tended to be shorter, between mobiles and to friends. In the UK 69% of those questioned said they turned to their fixed phone because it was still cheaper to use than a mobile. However, when pressed few could say with accuracy how tariffs on fixed and mobile phones compared. In the US and Germany many of those interviewed said they used the fixed phone because it was more reliable than a mobile handset and let them get access to the net at relatively high speeds. In all the countries where interviews were carried out, older people were more likely to use a fixed line phone more than a mobile. Women aged 50 or above almost never use a mobile phone, the research found.\n \n The move to mobile was most pronounced in South Korea where 65% of those questioned said they already make most of their calls from a mobile. 18% said they would not get a landline if they moved house.\n \n Many of those questioned said they had an emotional connection to their fixed phone that drew on its position in the home and the \"cosiness\" of making a call there. Nokia said these findings had implications for mobile operators who must work hard to ensure that mobiles are seen as cheap, reliable and providing good call quality. The survey also showed that it is not just voice calls that are going wireless. Some of those questioned said they were looking to use a mobile or wireless service to get net access within the next couple of years. Polling firm Mori interviewed more than 6,000 people in the UK, US, Germany and South Korea for the survey.\n", "llama3.2:1b": "The fixed line phone is becoming less popular due to increased use of mobile phones, particularly among younger users who prefer mobile calls but may be hesitant to switch. In some countries, such as South Korea, 65% of respondents chose to make most their calls on a mobile, citing reliability and access to the internet at high speeds. However, older adults are less likely to use a fixed line phone, and women above 50 years old rarely use a mobile.", "llama3.2:3b": "More than 45 million people worldwide are using only their mobile phone, with older people and women aged 50 or above being less likely to use a fixed line phone. The majority of those questioned said they keep their fixed phone due to lower call charges, but many struggle to compare tariffs between fixed and mobile phones. Mobiles were preferred for shorter calls and conversations, while fixed phones were used for longer calls and internet access.", "gemma2:2b": "More people are using their mobiles for all calls instead of fixed lines.  Fixed line phones are less popular due to lower call charges but most respondents believe the future is mobile. Mobiles are used for shorter conversations compared to fixed lines and are perceived as more reliable and offering better internet access by some users.  South Korea has seen a large shift towards mobile phone usage with 65% already using them exclusively for calls.  The study suggests that mobile operators must improve their perception of mobiles, especially in terms of affordability, reliability, and call quality.  Users are also looking to use mobile networks for internet access within the next few years. \n", "qwen2.5:0.5b": "The global trend is moving from fixed phones (home phones) to mobile devices, especially for long-distance calls. Many older people and women prefer mobiles because they are reliable, allowing them to access the internet at high speeds. Mobiles are also seen as more secure and comfortable compared to fixed phones. However, users in South Korea already rely heavily on their fixed phone due to its convenience and emotional connection. The survey indicates that many consumers are moving towards using both fixed and mobile phones for calls and accessing services.", "qwen2.5:1.5b": "Fixed-line home phones facing decline as mobiles become predominant; mobiles are preferred for longer calls and easier internet access, but fixed lines remain popular with older users and some older women. The shift towards mobile technology is most pronounced in South Korea, where many people rely almost exclusively on mobile for their phone needs.", "qwen2.5:3b": "Home phones could become endangered species with more people preferring mobiles for calls due to lower call charges. In the UK, Germany, US, and South Korea, over 45 million use only their mobile for all calls. While fixed lines are still cheaper in some cases (e.g., longer calls), most respondents believe mobile will be the future. Mobiles are preferred for shorter conversations and internet access due to better reliability and higher speeds. In older age groups and women aged 50 or above, fixed-line phones are more commonly used. South Korea shows the highest percentage of people who rely solely on mobiles (65%). Emotional attachment to fixed lines also plays a role. The survey indicates mobile operators need to focus on making mobiles seen as cheap, reliable, and with good call quality while expanding wireless internet access options.", "opencoder:1.5b": "The fixed line phone in your home could soon be an endangered species. Research by handset maker Nokia showed that more and more people are using their mobile phone for every call they make or take. According to the study, more than 45 million people in the UK, Germany, US and South Korea now only use a mobile. The research showed that mobiles and fixed phones were used for different purposes. Home phones were used for longer calls but conversations on mobiles tended to be shorter, between mobiles and to friends. Older people almost never use a mobile phone. Nokia said these findings had implications for mobile operators who must work hard to ensure that mobiles are seen as cheap, reliable and providing good call quality.\n", "smollm:1.7b": "The fixed line phone in your home could soon be an endangered species. Research by handset maker Nokia shows that more and more people are using their mobile phone for every call they make or take. According to the study, more than 45 million people in the UK, Germany, US and South Korea now only use a mobile. It showed that people keep their fixed line phone because call charges are lower, but most of those questioned said the future was definitely mobile.\nThe Nokia-sponsored research showed that mobiles and fixed phones were used for different purposes. Home phones were used for longer calls but conversations on mobiles tended to be shorter, between mobiles and to friends. In the UK 69% of those questioned said they turned to their fixed phone because it was still cheaper to use than a mobile. However, when pressed few could say with accuracy how tariffs on fixed and mobile phones compared. In the US and Germany many of those interviewed said they used the fixed phone because it was more reliable than a mobile handset and let them get access to the net at relatively high speeds. In all the countries where interviews were carried out, older people were more likely to use a fixed line phone than a mobile. Women aged 50 or above almost never use a mobile phone, the research found.\nThe move to mobile was most pronounced in South Korea where 65% of those questioned said they already make most of their calls from a mobile. 18% said they would not get a landline if they moved house. Many of those questioned said they had an emotional connection to their fixed phone that drew on its position in the home and the \"cosiness\" of making a call there. Nokia said these findings had implications for mobile operators who must work hard to ensure that mobiles are seen as cheap, reliable and providing good call quality. The survey also showed that it is not just voice calls that are going wireless. Some of those questioned said they were looking to use a mobile or wireless service to get net access within the next couple of years.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text. Let me read through it carefully.\n\nThe main points are about the future of fixed line phones. The user says that fixed lines now face an endangered status because they're being used more than mobile phones. They mention a study by Nokia that showed over 45 million in UK, Germany, US, and South Korea use mobiles less than fixed lines. \n\nThe study revealed that home phones were used for longer calls but conversations were shorter on mobiles or between mobiles and friends. Fixed lines were cheaper in terms of charges. But when asked about tariffs, it was hard to compare mobile and fixed line phones.\n\nIn the UK, 69% said fixed lines were cheaper because they were still cheaper, but some couldn't say if fixed lines were more expensive. In the US and Germany, fixed lines were preferred for reliability and net access. Older people used fixed lines more than mobiles. Women over 50 rarely use mobile phones.\n\nIn South Korea, 65% already use mobiles a lot, so they didn't switch to landlines. More than half of those questioned had a strong emotional connection to their home phone.\n\nNokia is concerned about ensuring mobiles are seen as affordable, reliable, and good quality. It also found that some people want net access now using wireless services even in the future.\n\nThe survey was done by Mori with over 6k participants from UK, US, Germany, and South Korea.\n\nI need to capture these key points concisely without explanations or formatting.\n</think>\n\nThe fixed line phone is facing a potential decline as mobile phones are increasingly used more globally. A study by Nokia found that over half of individuals in the UK, USA, and South Korea now use mobiles less than fixed lines. Fixed lines were cheaper due to lower charges, while mobiles offered better reliability and speed for some segments like older people and women over 50. Mobiles are preferred in the US and Germany for their speed and accessibility. The future of mobiles is more important in South Korea where almost all calls are from mobile phones. The survey by Mori highlighted these trends and implications for mobile operators, showing the need to manage mobile quality while considering net access options.", "tinyllama:1.1b": "Research by handset-maker Nokia reveals that while home phone usage is declining due to mobile dominance, fixed line phones are experiencing a resurgence due to the rise of mobile internet use. The study showed that 69% of UK respondents prefer calling from their landline to their smartphone or other handset for long calls, suggesting that they value the quality and comfort offered by landlines. As mobile phone tariffs have become more expensive than fixed-line, many older people are choosing to switch to a fixed line, with South Korean residents being particularly enthusiastic about this trend. While most respondents stated they were not likely to get a new landline in the next couple of years, some were looking to use their mobile or wireless service for online access within that timeframe. The survey's findings suggest that while there is room for growth in fixed line phone usage, operators must work hard to ensure that mobile phones are seen as affordable and reliable for their customers.", "tinydolphin:1.1b": " Home phones face uncertain future as mobile phone usage soars, putting them at risk of being replaced by cheaper alternatives. A study by Nokia reveals that many people are turning to their fixed line phones for longer calls, while others in the UK and Germany are using mobiles more frequently. The research also shows a growing preference for fixed lines over mobile handsets. In South Korea, where 65% of users surveyed had switched from fixed to mobile, a lack of concern about cost was thought to be driving this trend. However, some people still value the comfort and familiarity of their home phones, suggesting that there could be a shift in preference in future. The findings suggest that mobile phone operators must work harder to keep up with these changing preferences or risk losing customers to cheaper alternatives.", "phi:2.7b": " More people are using their mobile phones instead of fixed lines, as shown by a study by Nokia that found 45 million people in the UK, Germany, US and South Korea only use mobile phones. The research showed that mobiles were used more for shorter conversations with friends than home phones were used for longer calls. In the UK, 69% of those questioned said they preferred fixed lines because they were cheaper to use. However, many could not accurately compare tariffs between fixed and mobile phones. Older people were also more likely to use a fixed phone. Women aged 50 or above almost never used mobile phones. The move to using mobiles was most pronounced in South Korea where 65% of those questioned said they made most calls from their mobile. Some people had an emotional connection to their fixed phone, seeing it as part of the home and cosy place to make a call. Mobile operators needed to ensure that their services were cheap, reliable and provided good call quality. The survey also showed that people were looking to use mobile or wireless services for net access in the future.\n", "orca-mini:3b": " Home phones are becoming less common as more people use their mobile phones for every call they make or take, according to a study by Nokia. More than 45 million people in the UK, Germany, US, and South Korea now only use a mobile. Fixed line phones are used mostly for longer calls but conversations on mobiles tend to be shorter, and fewer people know how much tariffs on fixed and mobile phones compare in those countries. Older people are more likely to use a fixed line phone than a mobile. Women aged 50 or above almost never use a mobile phone. South Korea has the highest percentage of people who use their mobile for most of their calls. Many people have an emotional connection to their fixed phone that draws on its position in the home and the \"cosiness\" of making a call there. Mobile operators must work hard to ensure that mobiles are seen as cheap, reliable, and providing good call quality, according to the survey. The survey also showed that it is not just voice calls that are going wireless. Some people say they are looking to use a mobile or wireless service to get net access within the next couple of years.", "hermes3:3b": "Home phones facing decline as more people only use mobiles, according to Nokia research. Fixed line phones cheaper but less popular; older people more likely to use them. Mobiles used for shorter calls, becoming dominant especially in South Korea (65% say mostly make calls from mobile).", "stablelm-zephyr:3b": "Nokia research shows that over 45 million people in UK, Germany, US, and South Korea only use mobile phones for calls, as fixed line phones are still considered cheaper. Fixed phones are used for longer calls and older individuals prefer them more. In South Korea, 65% of respondents make most of their calls from mobiles. The findings suggest that mobile operators need to provide cheap, reliable, and good call quality to compete with the perceived value of fixed line phones. Some participants also expressed interest in using mobile or wireless services for internet access within the next couple of years.", "stablelm2:1.6b": "Home phones may become endangered as more people use mobile phones for all calls instead. A study by Nokia reveals that over 10 million people in the UK, Germany, US, and South Korea exclusively use their mobile phones. The research indicated that mobiles and fixed phones were used for different purposes: home phones for longer calls but conversations on mobiles tended to be shorter. In the UK, 43% of those questioned said they used the fixed phone because it was still cheaper to use than a mobile. However, many could not accurately compare fixed and mobile tariffs. The move towards mobile is most pronounced in South Korea where 25% said they already make most of their calls from a mobile. Many also said they wouldn, or soon, get rid of a landline if they moved house.", "granite3.1-dense:2b": "More people are shifting from traditional home phones to mobile devices due to Nokia's research, which indicates that over 45 million individuals across the UK, Germany, US, and South Korea primarily use their mobiles for calls. Factors driving this shift include lower call charges on mobiles and their convenience. Home phones are favored for longer conversations, while mobiles serve as a quick alternative for casual calls to friends. Reliability and internet access through fixed lines also contribute to their usage, particularly among older adults in all regions surveyed. In South Korea, 65% of respondents already make most calls on their mobiles, with 18% preferring no landline if they relocated. The emotional attachment to home phones is a significant factor, as people associate them with home comfort and tradition. This trend has implications for mobile operators, emphasizing the need to maintain affordability, reliability, and high call quality in their services. Additionally, some respondents expressed interest in using mobile or wireless services for internet access within the next few years.", "chatgpt-4o-latest": "The future of home landline phones is uncertain as more people rely solely on mobile phones. A Nokia study found that over 45 million people in the UK, Germany, the US, and South Korea use only mobiles. While landlines are preferred for longer calls and perceived as cheaper and more reliable, many users are unsure of actual cost differences. Older individuals, especially women over 50, tend to use landlines more. South Korea shows the strongest shift to mobile, with 65% primarily using mobiles and 18% unwilling to install a landline when moving. Emotional attachment to landlines remains, but mobile operators must improve affordability, reliability, and call quality. The study also indicates a growing trend toward wireless internet access.", "reference": "It showed that people keep their fixed line phone because call charges are lower, but most of those questioned said the future was definitely mobile.In the UK 69% of those questioned said they turned to their fixed phone because it was still cheaper to use than a mobile.The move to mobile was most pronounced in South Korea where 65% of those questioned said they already make most of their calls from a mobile.In the US and Germany many of those interviewed said they used the fixed phone because it was more reliable than a mobile handset and let them get access to the net at relatively high speeds.Home phones were used for longer calls but conversations on mobiles tended to be shorter, between mobiles and to friends.In all the countries where interviews were carried out, older people were more likely to use a fixed line phone more than a mobile.The Nokia-sponsored research showed that mobiles and fixed phones were used for different purposes.Research by handset maker Nokia shows that more and more people are using their mobile phone for every call they make or take."}