{"raw_text": "Games maker fights for survival\n \n One of Britain's largest independent game makers, Argonaut Games, has been put up for sale.\n \n The London-based company behind the Harry Potter games has sacked about 100 employees due to a severe cash crisis. The administrators told BBC News Online that selling Argonaut was the only way to save it as it had run out of cash. Argonaut warned that it was low on cash 10 days ago when its shares were suspended from trading on the London Stock Exchange.\n \n Argonaut has been making games for some 18 years and is one the largest independent games developers in the UK.\n \n Along with its headquarters in north London, it operates studios in Cambridge and Sheffield. Argonaut was behind the Harry Potter games which provided a healthy flow of cash into the company. But, like all software developers, Argonaut needed a constant flow of deals with publishers. Signs that it was in trouble emerged in August, when it warned it was heading for losses of £6m in the financial year due to delays in signing new contracts for games. Those new deals were further delayed, leading Argonaut to warn in mid-October that it was running out of cash and suspend trading of its shares on the London Stock Exchange. As part of cost-cutting measures, some 100 employees were fired. \"When the news about the £6m loss came out, we knew there were going to be redundancies,\" said Jason Parkinson, one of the game developers sacked by Argonaut. \"A lot of people suspected that Argonaut had been in trouble for some time,\" he told BBC News Online. Mr Parkinson said staff were told the job losses were necessary to save Argonaut from going under. At the start of the year, the company employed 268 people. After the latest round of cuts there are 80 staff at Argonaut headquarters in Edgware in north London, with 17 at its Morpheme offices in Kentish Town, London, and 22 at the Just Add Monsters base in Cambridge.\n \n Argonaut called in administrators David Rubin & Partners on Friday to find a way to rescue the company from collapse. It spent the weekend going over the company's finances and concluded that the only way to save the business was to put it up for sale. The administrator told BBC News Online that the costs of restructuing would be too high, partly because of the overheads from the company's four premises across the UK. It said it was hopeful that it could save some 110 jobs by selling the business, saying it had had expressions of interest from several quarters and were looking for a quick sale. The administrator said it would ensure that staff made redundant would receive any wages, redundancy or holiday pay due to them, hopefully by Christmas.\n", "llama3.2:1b": "Argonaut Games, Britain's largest independent game maker, is facing bankruptcy due to severe cash crisis. The company has sacked 100 employees and warned of losses of £6m in the financial year. Administrators have been called in to find a way to rescue the business, with options including putting it up for sale.", "llama3.2:3b": "Argonaut Games, one of Britain's largest independent game makers behind the Harry Potter games, has been put up for sale due to severe cash crisis. The company has sacked around 100 employees and warned it was heading for losses of £6m in the financial year, with shares suspended from trading on the London Stock Exchange 10 days ago. Administrators have concluded that selling the business is the only way to save it, with expressions of interest from several quarters and a hope to save around 110 jobs by Christmas.", "gemma2:2b": "Argonaut Games, a major UK independent game developer known for the Harry Potter games, is being put up for sale after running out of cash.  The company laid off 100 employees in response to financial difficulties and delays in securing new game contracts. The administrators believe selling the business is the only way to save it from collapse, with hopes of retaining some of its workforce.  \n", "qwen2.5:0.5b": "Argonaut Games, one of Britain's largest independent game makers, has been put up for sale after facing severe financial difficulties. It was forced to lay off 100 employees and suspend its shares trading on the London Stock Exchange following a cash crisis. The company is one of the largest independent games developers in the UK and has been making games since 18 years ago.", "qwen2.5:1.5b": "Argonaut Games, an independent game developer with roots in Harry Potter games, is facing financial difficulties leading to layoffs, cuts, and potential bankruptcy. Administrators are seeking a sale to save the company from collapse, which could lead to up to 100 job losses and potentially as many as 235 employees across four locations.", "qwen2.5:3b": "One of Britain's largest independent game makers, Argonaut Games, has been put up for sale after being forced to cut 100 jobs due to severe cash problems. The company, which developed Harry Potter games, warned it was running out of cash in August and suspended its shares from trading on the London Stock Exchange. Founded over 18 years ago, Argonaut was one of the UK's largest independent game developers but has struggled with delays in new contracts. Administrators now believe selling the business is the only way to save it, potentially saving around 110 jobs.", "opencoder:1.5b": "\"Games maker fights for survival\", with \"sacking about 100 employees due to a severe cash crisis\" being the primary focus.\n\nArgonaut Games has been operating since its establishment in 2006 and operates in multiple locations, including Cambridge and Sheffield. Following a severe cash crisis, Argonaut warned that it was low on cash and suspended trading at the London Stock Exchange.\n\nThe game maker faced significant criticism from staff after reporting delays in signing new contracts with publishers due to losses of $6 million. The company needed a constant flow of deals as publishers reported increased sales with the Harry Potter games.\n\nIn August, Argonaut warned that it was going into trouble and said it would suspend trading of its shares on the London Stock Exchange if the financial year continues into October. Following the loss, Argonaut provided cash to the company through Harry Potter's revenue. \n\nAs part of cost-cutting measures, Argonaut fired 100 employees due to concerns over the potential of their business collapse.\n\nThe news flash that_argonaut had been in trouble_ led Argonaut to seek out investors for help. Mr Parkinson, one of Argonaut's sacked employees, suggested a partnership with Partners to rescue the company from collapse and save about $110 million worth of revenue.\n\nArgonaut has also announced plans to restructure their business by selling their business. The company discussed plans in London that would allow them to raise more money to offset any potential losses incurred due to staff turnover or other disruptions.\n", "smollm:1.7b": "Argonaut Games fights for survival", "deepseek-r1:1.5b": "<think>\nOkay, I need to help summarize this text about Argonaut Games. Let me read through the provided text first.\n\nSo, the main point is that Argonaut Games, a company based in London, has been facing cash issues and has laid off 100 employees. The administrators are asking for its sale as the only way to save it. They mentioned it's one of Britain's largest independent game makers, which gives context about their size and prominence in the industry.\n\nThe text also talks about how Argonaut makes games for years, was behind Harry Potter, which generated a lot of revenue. However, because of delays in signing new contracts with publishers, they are facing financial losses. This is why they've decided to lay off employees to prevent going into debt further.\n\nThere's some background on their employees—268 at the start of the year, reduced to 80 after cuts. The administrators have hired them and plan to sell it for a sale, possibly around Christmas, ensuring that redundancies are addressed so employees can re-enter the workforce with proper benefits.\n\nI should make sure to capture all these key points: Argonaut's history, its status as a large UK company, the cash crisis, layoff of 100 people, the need for sale, and their restructuring plan. I also need to mention that they're one of Britain's largest game makers and how that gives them prominence.\n\nNow, putting it all together into a concise summary without any extra information or explanations.\n</think>\n\nArgonaut Games, a large independent video game company based in London, has faced financial challenges and laid off 100 employees. The administrators have requested its sale to survive and require restructuring costs to address the losses, hoping to save around 80 staff at the headquarters and provide restructured pay for redundancies. Argonaut, known for its prominence as one of Britain's largest independent games developers, has faced delays in securing deals with publishers, leading to financial losses and employee cuts.", "tinyllama:1.1b": "The largest independent game developer in the UK, Argonaut Games, has been put up for sale following severe casch crisis and its closure of several studios as a result. The company behind popular Harry Potter games had announced that it was facing losses due to delaying new deals with publishers, leading Argonaut to issue warnings earlier this year about the impact of declining sales. In an attempt to avoid collapse, Argonaut called in administrators on Friday, after spending weekend discussing its finances with specialist outsourcing company David Rubin & Partners. The administrator said that saving the company would be too expensive, due to costs related to restructuring and overheads from four UK premises. While hopes of a quick sale were initially expressed by administrators, they added that they hoped to offer all affected staff their usual Christmas bonuses.", "tinydolphin:1.1b": " A prominent game developer, Argonaut Games, was placed in financial difficulties after its shares dropped from the stock exchange due to an unexpected decline in sales of its popular Harry Potter games. The company, which has been in operation for over a decade, managed to avoid bankruptcy by hiring administrators and selling its assets to one of Britain's largest independent game makers. Argonaut had around 268 employees at the start of 2014, but after the latest cuts and job losses, there are now only 80 staff at the company’s headquarters in Edgware, north London. The move to sell the company could save Argonaut from going under, though it still faces significant financial challenges as it struggles to secure new deals with publishers for its games.", "phi:2.7b": " Argonaut Games, a leading independent game maker in the UK, has been put up for sale as part of cost-cutting measures after experiencing a severe cash crisis and laying off about 100 employees. The company's headquarters are located in north London with studios in Cambridge and Sheffield. It was behind the popular Harry Potter games which provided a healthy flow of cash into the company but experienced delays in securing new contracts, leading to losses of £6m in the financial year due to difficulties in signing deals. As part of cost-cutting measures, some \n", "orca-mini:3b": " One of Britain's largest independent game makers, Argonaut Games, has been put up for sale due to a severe cash crisis. The London-based company behind the Harry Potter games has sacked about 100 employees and warned that it was running out of cash. Argonaut called in administrators David Rubin & Partners on Friday to find a way to rescue the company from collapse. It spent the weekend going over the company's finances and concluded that the only way to save the business was to put it up for sale. The administrator told BBC News Online that the costs of restructuring would be too high, partly because of the overheads from the company's four premises across the UK.", "hermes3:3b": "Argonaut Games, British games developer, sold due to severe cash crisis; laid off about 100 employees; behind Harry Potter games.", "stablelm-zephyr:3b": "Argonaut Games, a London-based independent game developer responsible for the Harry Potter games, has been put up for sale due to a severe cash crisis. The company sacked around 100 employees and suspended trading of its shares on the London Stock Exchange in August as it faced potential losses of £6m. Despite being one of the largest independent games developers in the UK with studios in Cambridge, Sheffield, and north London, Argonaut struggled to secure new contracts for games due to delays. The recent round of job cuts resulted in 80 staff at its headquarters in Edgware, north London, and 17 at its Morpheme offices in Kentish Town. Administrators David Rubin & Partners concluded that selling the company was the only way to save it, potentially saving around 110 jobs through a quick sale.", "stablelm2:1.6b": "British game maker Argonaut Games has been put up for sale amidst a severe cash crisis after running out of funds. London-based company responsible for Harry Potter games had sacked about 100 employees due to financial troubles and warned of impending losses. Administrators called David Rubin & Partners found that cost restructuring would be too high, partly due to the company's four UK premises' overheads. They are hopeful of saving some jobs by selling Argonaut, expressing interest from several quarters and looking for a quick sale.", "granite3.1-dense:2b": "Argonaut Games, a prominent British independent game developer known for Harry Potter series, is facing insolvency and has put itself up for sale due to a severe cash crisis. The company, headquartered in north London with additional studios in Cambridge and Sheffield, has sacked approximately 100 employees as of October. This decision came after warnings of potential £6 million losses in the previous financial year due to contract delays with publishers. Argonaut's shares were suspended from trading on the London Stock Exchange last August when it first signaled troubles.\n\nAdministered by David Rubin & Partners, Argonaut aims to rescue the business through a sale. The administrators believe selling would be more cost-effective than restructuring due to the high overhead of maintaining multiple UK locations. They are optimistic about saving around 110 jobs and have received expressions of interest from potential buyers. The administrators commit to ensuring affected staff receive any outstanding wages, redundancy payments, or holiday pay by Christmas.", "chatgpt-4o-latest": "Argonaut Games, one of the UK's largest independent game developers, has been put up for sale due to a severe cash crisis. The London-based company, known for the Harry Potter games, has fired about 100 employees as part of cost-cutting measures. Argonaut had warned of financial trouble in August, citing a projected £6m loss due to delays in securing new contracts. In mid-October, it suspended trading on the London Stock Exchange after running out of cash. Administrators David Rubin & Partners were called in and determined that selling the company was the only viable option, as restructuring costs were too high. They are seeking a quick sale and hope to save around 110 jobs, while ensuring that redundant staff receive their due payments.", "reference": "The administrators told BBC News Online that selling Argonaut was the only way to save it as it had run out of cash.Argonaut was behind the Harry Potter games which provided a healthy flow of cash into the company.Argonaut warned that it was low on cash 10 days ago when its shares were suspended from trading on the London Stock Exchange.\"When the news about the £6m loss came out, we knew there were going to be redundancies,\" said Jason Parkinson, one of the game developers sacked by Argonaut.Argonaut has been making games for some 18 years and is one the largest independent games developers in the UK.Mr Parkinson said staff were told the job losses were necessary to save Argonaut from going under.Those new deals were further delayed, leading Argonaut to warn in mid-October that it was running out of cash and suspend trading of its shares on the London Stock Exchange.One of Britain's largest independent game makers, Argonaut Games, has been put up for sale.\"A lot of people suspected that Argonaut had been in trouble for some time,\" he told BBC News Online."}