{"raw_text": "Progress on new internet domains\n \n By early 2005 the net could have two new domain names.\n \n The .post and .travel net domains have been given preliminary approval by the net's administrative body. The names are just two of a total of 10 proposed domains that are being considered by the Internet Corporation for Assigned Names and Numbers, Icann. The other proposed names include a domain for pornography, Asia, mobile phones, an anti-spam domain and one for the Catalan language and culture.\n \n The .post domain is backed by the Universal Postal Union that wants to use it as the online marker for every type of postal service and to help co-ordinate the e-commerce efforts of national post offices.\n \n The .travel domain would be used by hotels, travel firms, airlines, tourism offices and would help such organisations distinguish themselves online. It is backed by a New York-based trade group called The Travel Partnership. Icann said its early decision on the two domains was in response to the detailed technical and commercial information the organisations behind the names had submitted. Despite this initial approval, Icann cautioned that there was no guarantee that the domains would actually go into service. At the same time Icann is considering proposals for another eight domains. One that may not win approval is a proposal to set up a .xxx domain for pornographic websites. A similar proposal has been made many times in the past. But Icann has been reluctant to approve it because of the difficulty of making pornographers sign up and use it. In 2000 Icann approved seven other new domains that have had varying degrees of success. Three of the new so-called top level domains were for specific industries or organisations such as .museum and .aero. Others such as .info and .biz were intended to be more generic. In total there are in excess of 200 domain names and the majority of these are for nations. But domains that end in the .com suffix are by far the most numerous.\n", "llama3.2:1b": "The Internet Corporation for Assigned Names and Numbers (Icann) has approved two new internet domain names: .post and .travel. The .post domain is backed by the Universal Postal Union, which wants to use it as an online marker for postal services and e-commerce efforts of national post offices. The .travel domain will be used by hotels, travel firms, airlines, tourism offices, to help them distinguish themselves online.\n\nIcann has also approved other eight domain proposals, including a proposal for a .xxx domain for pornographic websites. However, the organization is considering alternatives and Icann's approval of seven new domains in 2000 was not sufficient to guarantee that these will be implemented.", "llama3.2:3b": "The Internet Corporation for Assigned Names and Numbers (Icann) has given preliminary approval to two new internet domain names: .post and .travel, backed by the Universal Postal Union and The Travel Partnership respectively. Eight other proposals, including a potential .xxx domain for pornographic websites, are being considered. Icann approved seven other new domains in 2000, which have had varying degrees of success, with most nations having their own domain names that end in .com suffix.", "gemma2:2b": "Two new top-level domains, .post and .travel, have been approved for consideration by Icann and are backed by organizations seeking to utilize them for postal services and travel businesses.  Icann is also considering additional domain names, including a potential pornographic domain but facing difficulties in enforcing its use. Past attempts at establishing new top-level domains, while successful in some instances, demonstrate the ongoing process of expanding internet naming conventions. \n", "qwen2.5:0.5b": "Progress on new internet domains was made possible in early 2005 with the approval of two names: .post and .travel, which are considered to be the most popular online domain additions. Icann is currently considering approving eight more domains, but not all will go into service yet.", "qwen2.5:1.5b": "By early 2005, two new internet domain names—.post and .travel—had been approved by the Internet Corporation for Assigned Names and Numbers (Icann). The .post domain is aimed at postal services, while the .travel domain will help online businesses distinguish themselves in the travel industry. Icann initially granted approval but noted that final implementation was uncertain. Icann is also considering proposals for eight other domains. A .xxx pornographic website proposal has been approved previously but faces difficulties with obtaining sign-ups and usage. The majority of internet domains end in the .com suffix, with about 200 total domain names.", "qwen2.5:3b": "By early 2005, two new internet domains (.post and .travel) were given preliminary approval by Icann from a total of 10 proposed domains. The .post domain is supported by the Universal Postal Union for online postal services coordination, while the .travel domain aims to aid travel industry organizations in their online presence. Despite this initial approval, there's no guarantee these domains will be implemented. Icann also considers eight additional proposals, including a controversial .xxx domain for pornography which faced previous rejections due to registration issues. In 2000, seven new top-level domains were approved with varying levels of success, mostly catering to specific industries or generic uses like .info and .biz.", "opencoder:1.5b": "\"By early 2005, the net could have two new domain names: .post and .travel. The .post domain was approved by Icann with a unified postal system, while the .travel domain was backed by The Travel Partnership for online marketing purposes.\"\n", "smollm:1.7b": "The summary is concise, preserving key ideas and details:\n\n1. The text describes two new internet domains proposed by early 2005.\n2. The text mentions the names of these domains as well as a third proposed domain that was not approved.\n3. It provides information about the proposed domains, including their names, countries where they are intended to be used and what kind of content they will host.\n4. The text also mentions the technical and commercial information submitted by organizations behind the proposed domains.\n5. The summary does not provide explanations or reasoning processes for the proposals or the reasons why some were approved while others were not.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about the new internet domains proposed by ICANN. Let me read through it again carefully.\n\nThe main points are: By early 2005, there could be two new domain names for the net. The other eight proposals are not yet approved. There's a focus on .post and .travel domains. .Post is backed by U.S. Postal Union, as mentioned. .Travel is under The Travel Partnership. Others include Asia, mobile phones, anti-spam, Catalan language, etc.\n\nI should mention the number of domain names being considered, their backgrounds, purposes like postal services or e-commerce, and ICANN's stance on approval.\n</think>\n\nBy early 2005, there could be two new domain names proposed for the net. The other eight proposals are not yet approved. The .post domain is backed by the Universal Postal Union, intended for postal services, while .travel is under The Travel Partnership. These domains aim to help organizations like hotels and travel firms online. Some are for specific industries or regions, with others being generic. There's a focus on .com domains which dominate, but some, like .xxx for porn, are less successful. ICANN approved seven new domain names in 2000, mostly for nations or specific industries.", "tinyllama:1.1b": "During early 2005, two new internet domains were approved by the Administrative Body of the Internet Corporation for Assigned Names and Numbers (ICANN). These include a domain name for pornography (post), Asia (travel), mobile phones (animal), Catalan language (language) and culture (culture). The Post and Travel domains, which are backed by the Universal Postal Union, aim to help co-ordinate e-commerce efforts of national post offices. However, ICANN is currently considering proposals for eight other new domains that could include .xxx for pornography websites but has been reluctant to approve such a domain due to their difficulty in being signed up by pornographers. The majority of internet domains end in the .com suffix and are primarily used by businesses.", "tinydolphin:1.1b": " The text provided outlines the proposal and approval of two new internet domain names, namely .post and .travel. These domain names are being considered by the Internet Corporation for Assigned Names and Numbers, Icann, as part of their efforts to standardize the naming system. The .post domain is proposed by a group of postal unions backed by the Universal Postal Union (UPU), who wish to use it as an online marker for every type of postal service. The .travel domain is proposed by travel industry organizations, such as The Travel Partnership and Icann, which wishes to distinguish their members' products and services online. Despite receiving initial approval from Icann, the agency cautions that there are no guarantees that these domains will be implemented in service. In addition to these new domain names, Icann is also considering a list of additional eight proposed domains. One that may not win approval is a .xxx domain for adult websites, which has been proposed many times before but has faced significant issues in terms of obtaining sign-up and use. The decision by Icann is part of their efforts to streamline the internet's naming system, making it easier for businesses to create and manage their online presence.", "phi:2.7b": " Two new domain names, .post and .travel, have been approved by the Internet Corporation for Assigned Names and Numbers (Icann) for postal services and travel industry respectively. Other proposed names include .pornography, , and .catalunya. \n\nDespite this initial approval, Icann warned that there is no guarantee that these domains will go into service. They have also considered eight other domain names. One of the proposals that may not get approved is a \n\n.xxx domain for pornographic websites due to difficulty in making pornographers sign up and use it. Other new domains include .museum, .aero, , .info, and .biz, while \n\n.com remains the most common top-level domain. In 2000, Icann approved seven other domain names, including three for specific industries or organizations.\n", "orca-mini:3b": " Progress has been made on two new internet domain names, .post and .travel. Both have received preliminary approval from the Internet Corporation for Assigned Names and Numbers (Icann), which is responsible for managing the global internet infrastructure. The domains are intended to help differentiate online and distinguish various types of online services such as hotels, travel firms, airlines, tourism offices. However, there is no guarantee that these domains will go into service, and Icann has been hesitant to approve a proposal for a .xxx domain for pornographic websites due to the difficulty of requiring pornographic websites to sign up and use it. In total, there are over 200 domain names available, with many being used by nations. However, domains that end in .com are by far the most numerous.", "hermes3:3b": "New internet domains:\n- .post (for postal services)\n- .travel (for travel firms, airlines, tourism offices)", "stablelm-zephyr:3b": "In 2005, Icann considered approving two new domain names: .post and .travel. The .post domain was backed by the Universal Postal Union for use with postal services and e-commerce. The .travel domain would be used by travel companies, airlines, and tourism offices to distinguish themselves online. Other proposed domains included a pornographic domain (.xxx), an Asia domain, an anti-spam domain, and a Catalan language and culture domain. Icann cautioned that approval for these domains wasn't guaranteed. At the time, Icann was considering eight new domains, with .info and .biz intended to be more generic.", "stablelm2:1.6b": "By early 2020, the net could have two new internet domains: .post (backed by the Universal Postal Union) and .travel (backed by The Travel Partnership). Icann approved these domains due to detailed technical and commercial information submitted by their organizations. However, there is no guarantee that these domains will actually go live. Eight more domains are being considered, including one for adult content. Although some previous proposals were rejected, Icann is open to approving a .xxx domain for pornographic websites. The majority of internet domains belong to nations, with .com suffixes the most common.", "granite3.1-dense:2b": "By early 2005, Icann, the internet's administrative body, granted preliminary approval to two new top-level domains: .post and .travel. The .post domain is supported by the Universal Postal Union for use as an online marker for postal services and e-commerce coordination. The .travel domain aims to benefit hotels, travel firms, airlines, and tourism offices, enabling them to differentiate themselves online. Other proposed domains include Asia, mobile phones, anti-spam, Catalan language and culture, and a controversial .xxx for adult content, which Icann has been reluctant to approve due to the challenge of enforcing its use. Despite initial approval, there's no assurance these domains will be implemented. Icann is also evaluating proposals for eight more new domain names, with over 200 existing ones available, mostly for nations and .com being the most prevalent.", "chatgpt-4o-latest": "By early 2005, two new internet domains, .post and .travel, could be introduced following preliminary approval by Icann. The .post domain, backed by the Universal Postal Union, aims to serve postal services and e-commerce coordination, while .travel, supported by The Travel Partnership, would be used by travel-related businesses. Icann's decision was based on detailed technical and commercial submissions, though final approval is not guaranteed. Additionally, Icann is reviewing eight other proposed domains, including .xxx for pornography, which has faced repeated rejection due to enforcement challenges. In 2000, Icann approved seven new domains with mixed success, including industry-specific ones like .museum and .aero, and more general ones like .info and .biz. While over 200 domain names exist, .com remains the most widely used.", "reference": "By early 2005 the net could have two new domain names.The names are just two of a total of 10 proposed domains that are being considered by the Internet Corporation for Assigned Names and Numbers, Icann.In 2000 Icann approved seven other new domains that have had varying degrees of success.The other proposed names include a domain for pornography, Asia, mobile phones, an anti-spam domain and one for the Catalan language and culture.Icann said its early decision on the two domains was in response to the detailed technical and commercial information the organisations behind the names had submitted.Despite this initial approval, Icann cautioned that there was no guarantee that the domains would actually go into service.In total there are in excess of 200 domain names and the majority of these are for nations.The .post and .travel net domains have been given preliminary approval by the net's administrative body."}