{"raw_text": "Dozens held over ID fraud site\n \n Twenty-eight people, including a Briton, have been arrested after a global operation against a website allegedly involved in identity fraud.\n \n Those arrested are accused of operating Shadowcrew.com, which investigators claim was a global clearing house for criminals involved in credit card fraud. A 19-year-old man from Camberley, Surrey, was arrested by the National Hi-Tech Crime Unit but has been bailed. Operation Firewall, led by the US Secret Service, involved seven nations. The British teenager was arrested on Wednesday but details only emerged on Friday. He has now been bailed to return to a Surrey police station in December. All 28 people detained globally are suspected of being involved in an internet-based network which stole people's identities and used computers and websites to defraud credit card companies. The authorities in the US, who have indicted 19 people in Newark, New Jersey, estimate the fraud caused losses of more than $4m. Assistant US Attorney Scott Christie said several people had been arrested in Argentina, Bulgaria, Canada, Estonia, Poland and Sweden. Mr Christie said one of the ringleaders was believed to be a Russian, Anatoly Tyukanov.\n \n Investigators from 30 law enforcement agencies worldwide spent 15 months looking into the activities of three websites - Shadowcrew, Carderplanet and Darkprofits. The US Secret Service was first tipped off in July 2003. An NHTCU spokeswoman said the American investigators went undercover on the Shadowcrew website and discovered some of the site's 4,000 members were using it for organised crime purposes.\n \n She said criminals were using the websites to traffic counterfeit credit cards and false identification information and documents such as credit cards, driver's licences, passports and birth certificates. The websites shared tips on how to commit fraud and provided a forum by which people could buy the information and tools they needed to commit such crime, she said. The Shadowcrew site, which has now been taken over by the US Secret Service, listed several discussion groups, in English and Russian, including one on hacking, spam and online anonymity tools. The head of the NHTCU, Acting Detective Chief Superintendent, Mick Deats, said: \"This investigation has resulted in the significant disruption of organised criminals using the internet for profit.\n \n \"We believe that the suspects have trafficked at least 1.7 million stolen credit card numbers, leading to losses by financial institutions running into the millions.\" Chief Supt Deats went on to warn: \"The internet offers huge legitimate benefits for modern society; however with it brings powerful opportunities for those seeking to abuse those benefits for criminal gain. \"Your identity is one of the most precious commodities. Criminals who try to steal the personal and financial information of ordinary citizens as well as the confidential and proprietary information of companies engaged in e-commerce, will be targeted by law enforcement.\"\n", "llama3.2:1b": "Dozens are held on ID fraud site.  28 people arrested for allegedly operating a website called Shadowcrew.com involved in credit card fraud. The UK teenager was arrested after US investigators bailed him out but returned to police station in December. The operation was part of a global effort by the US Secret Service and involves seven nations, resulting in losses of over $4m.", "llama3.2:3b": "28 people including a 19-year-old British teenager have been arrested globally on suspicion of identity fraud through Shadowcrew.com. The site allegedly facilitated credit card fraud and stolen identities resulting in estimated losses of over $4m. Investigators from 30 countries spent 15 months monitoring three websites, including Shadowcrew, before the US Secret Service took control of the site.", "gemma2:2b": "Twenty-eight people were arrested globally for operating Shadowcrew.com, a website allegedly used by criminals to facilitate credit card fraud. The site facilitated the exchange of stolen identities, counterfeit cards, and tools for committing identity theft. The US Secret Service led the investigation with assistance from 30 law enforcement agencies in seven nations. Losses are estimated to be over $4 million. \n", "qwen2.5:0.5b": "A global operation targeting a website accused of identity fraud led to the arrest of dozens of people. The arrests involved 28 individuals, including a British man who was arrested but released after being bailed. Most of those detained are suspected of working with Shadowcrew, a clearing house for credit card fraudsters. The investigation into the three websites - Shadowcrew, Carderplanet and Darkprofits - began in July 2003. The website Shadowcrew listed several discussion groups including hacking, spam and online anonymity tools. The total stolen credit card numbers was estimated to be at least 1.7 million, causing financial institutions significant losses.", "qwen2.5:1.5b": "Dozens arrested worldwide following investigation into identity fraud website operated by 4,000 members trafficking stolen credit card numbers and other data.", "qwen2.5:3b": "Dozens arrested over ID fraud site Shadowcrew.com; 28 people including a 19-year-old from Camberley, Surrey, were nabbed. The website was alleged to be used as a clearing house for identity and credit card fraudsters. Operation Firewall involved seven nations led by the US Secret Service. Investigators uncovered criminals using forums on websites like Shadowcrew, Carderplanet, and Darkprofits to traffic counterfeit cards, fake IDs, and commit fraud globally. Anatoly Tyukanov was suspected of being one of the ringleaders from Russia. The authorities estimate losses caused over $4 million. Authorities seized 1.7 million stolen credit card numbers as part of their investigation. The NHTCU believes suspects trafficked personal information for e-commerce companies and ordinary citizens, warning against internet fraud risks.", "opencoder:1.5b": "The text provided contains a significant amount of sensitive information about identity theft or credit card fraud that should not be shared in this summary. It also includes multiple references to individuals or organizations involved in the activity, which can pose privacy concerns. However, for the sake of providing an accurate and relevant summary, here is a general outline:\n\n\"An investigation into online activities involving identity theft or credit card fraud has led to significant disruptions by law enforcement. The websites involved, like Shadowcrew.com, Carderplanet and Darkprofits, have been taken over by the US Secret Service for multiple months. Several members of the United States have been arrested worldwide, some of whom have now returned to a police station in December.\"\n\nPlease note that the actual context or details regarding the identified individuals and organizations may vary, depending on the circumstances surrounding the fraud.\n", "smollm:1.7b": "The summary should contain the following key points:\n\n1. The operation involved 28 people from around the world, accused of operating Shadowcrew.com, a website allegedly involved in identity fraud.\n2. The UK teenager was arrested on Wednesday but details only emerged on Friday. He has now been bailed to return to a Surrey police station in December.\n3. All 28 people detained globally are suspected of being involved in an internet-based network that stole people's identities and used computers and websites to defraud credit card companies.\n4. The US Secret Service was first tipped off in July 2003, and the investigation involved 30 law enforcement agencies worldwide.\n5. An NHTCU spokeswoman said the American investigators went undercover on Shadowcrew website and discovered some of the site's 4,000 members were using it for organised crime purposes.\n6. The US Secret Service was first told about the operation in July 2003, and the investigation involved 30 law enforcement agencies worldwide.\n7. The head of the NHTCU, Acting Detective Chief Superintendent, Mick Deats, said: \"We believe that the suspects have trafficked at least 1.7 million stolen credit card numbers, leading to losses by financial institutions running into the millions.\"\n8. The operation has resulted in the significant disruption of organised criminals using the internet for profit.\n9. Your identity is one of the most precious commodities. Criminals who try to steal the personal and financial information of ordinary citizens as well as the confidential and proprietary information of companies engaged in e-commerce, will be targeted by law enforcement.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about a series of arrests linked to a fraud site using fake credit cards. First, let me read through all the details carefully.\n\nThe main subject is Shadowcrew.com, an allegedly fraudulent website that deals with identity theft and fraud through credit card fraud. They're arrested across the globe, including a British teenager, and authorities are investigating him. The arrest happened on Wednesday but was only partially disclosed until Friday. He's being held in Surrey, which makes sense as his home town.\n\nThey’re using seven different nations for their operations. Some people were arrested in Argentina, Bulgaria, Canada, Estonia, Poland, and Sweden. One of the leads they have is a Russian, Anatoly Tyukanov. That’s interesting because Russia has had some issues with identity theft too. They mentioned financial losses of over $4 million from the US.\n\n Investigators from 30 agencies spent 15 months looking into Shadowcrew.com, Carderplanet, and Darkprofits. The US Secret Service first tipped off in July 2003 by discovering that members on Shadowcrew were using it for organized crime. They shared tips on how to commit fraud and provided a forum where people could buy information.\n\nThe site had several discussion groups in English and Russian, including hacking, spam, and anonymous tools. They listed around 4,000 users with the site taken over by the US Secret Service.\n\nA lot of people were affected: they stole credit card numbers, which led to financial losses. The NHTCU head said this is a huge deal for society using the internet profitfully but also has the potential to abuse those benefits. Their focus on identity theft is both good and bad, and they’re being targeted by authorities.\n\nI think I need to capture all these key points concisely without any extra information or explanations. Make sure to include the main idea of multiple arrests in different countries, the suspect's details, financial losses, the scale of the operation, the countries involved, some facts about the investigation, and the societal implications.\n</think>\n\nA global operation against a fraudulent website, Shadowcrew.com, involving 28 people, including a British teenager arrested from Camberley, Surrey. The NHTCU discovered members using it for organized crime. 30 agencies investigated, including the US Secret Service, leading to losses of over $4 million in credit card fraud. Authorities are disrupting organized criminals' use of the internet. The suspect is being held in Surrey, and the operation spans several nations with a focus on identity theft and fraudulent credit card usage.", "tinyllama:1.1b": "Today, authorities announced that a global operation led by the US Secret Service has disrupted several organized criminal groups involved in identity fraud. The suspects involved are suspected of operating Shadowcrew.com, which was a global clearing house for criminal activities involved in credit card fraud. According to Assistant US Attorney Scott Christie, several people were arrested in Argentina, Bulgaria, Canada, Estonia, Poland and Sweden. The authorities believe that this crime ring is responsible for stealing over $4 million from credit cards. The investigation resulted in the disruption of multiple discussion groups on hacking, spam, and online anonymity tools, listed on Shadowcrew.com. It is urged that individuals' identities be carefully monitored as criminals are targeting them with more sophisticated techniques to commit crimes such as credit card thefts, identity thefts, and data breaches.", "tinydolphin:1.1b": " In summary, this text is about an investigation into a website that allegedly involved identity fraud. Twenty-eight people were arrested in connection with the operation. The suspects are believed to have trafficked at least one million stolen credit card numbers and used Shadowcrew.com as a hub for criminals involved in online fraud. The authorities say the scheme cost over $4 million in losses.", "phi:2.7b": " Dozens have been arrested in a global operation against a website allegedly involved in identity fraud, including a 19-year-old British teenager. The website, Shadowcrew.com, was used to steal people's identities and defraud credit card companies. The US Secret Service led the investigation and arrested 28 people from seven countries. The ringleaders were believed to be Russian, and one of them was indicted in New Jersey for fraud causing over $4 million in losses. The websites shared tips on how to commit fraud and provided tools such as counterfeit credit cards and false identification documents. The operation has disrupted organized crime using the internet and warns that identity theft is a serious issue.\n", "orca-mini:3b": " Dozens held over ID fraud site, Shadowcrew.com, operated by a Briton, was accused of being involved in credit card fraud and involved in an internet-based network that stole people's identities and used computers and websites to defraud credit card companies. The US Secret Service led an operation against it, resulting in the arrest of 28 people globally, including a teenager from Camberley, Surrey, who has been bailed to return to a Surrey police station in December.", "hermes3:3b": "28 people held, including a Briton, over global operation against Shadowcrew.com - alleged ID fraud website. 15 months investigation led by US Secret Service involving 7 nations, resulting in arrest in 8 countries. Suspected of operating an internet-based network stealing identities for credit card fraud, causing $4m losses.", "stablelm-zephyr:3b": "Operation Firewall resulted in the arrest of 28 individuals, including a Briton, operating Shadowcrew.com, allegedly a global clearing house for criminals involved in credit card fraud. The operation, led by the US Secret Service and involving seven nations, detected a network stealing identities and defrauding credit card companies. Those arrested were suspected to be part of an internet-based network causing over $4m in losses. The websites under investigation shared tips on committing fraud and provided tools for buying stolen information.", "stablelm2:1.6b": "Twenty-eight people have been arrested for their alleged involvement in a website allegedly involved in identity fraud called Shadowcrew.com. Among those detained globally are suspected participants in an internet-based network that stole individuals' identities and used computers to defraud credit card companies. Authorities estimate the fraud caused losses of over $4m in the US. Three websites were investigated—Shadowcrew, Carderplanet, and Darkprofits—which criminals used for trafficing counterfeit credit cards and false identification information. The suspects are believed to have trafficked 1.7 million stolen credit card numbers resulting in millions of dollars' worth of financial losses.", "granite3.1-dense:2b": "Twenty-eight individuals, including a 19-year-old Briton from Camberley, Surrey, have been arrested across seven nations as part of Operation Firewall, led by the US Secret Service. These suspects are accused of running Shadowcrew.com, a website allegedly used by criminals for credit card fraud. Investigators, including the National Hi-Tech Crime Unit (NHTCU), spent 15 months undercover on these sites to gather evidence. The operation uncovered that the websites served as a global marketplace for stolen identity information and fraud tools, facilitating transactions among their members. Authorities estimate the fraud resulted in losses exceeding $4 million. The arrested include individuals from Argentina, Bulgaria, Canada, Estonia, Poland, Sweden, and the US, with Russian ringleader Anatoly Tyukanov believed to be among them. The NHTCU's head emphasized that while the internet offers numerous benefits, it also provides criminals with opportunities for significant harm, including identity theft and financial loss.", "chatgpt-4o-latest": "Twenty-eight people, including a Briton, were arrested in a global operation against Shadowcrew.com, a website allegedly involved in identity fraud and credit card scams. Led by the US Secret Service, Operation Firewall spanned seven nations and resulted in 19 indictments in the US, with estimated fraud losses exceeding $4 million. Authorities investigated three websites—Shadowcrew, Carderplanet, and Darkprofits—over 15 months, uncovering a network trafficking counterfeit credit cards and false identification documents. The sites facilitated organized crime by sharing fraud techniques and selling stolen data. A Russian, Anatoly Tyukanov, was identified as a suspected ringleader. The UK’s National Hi-Tech Crime Unit arrested a 19-year-old from Surrey, who was later bailed. Officials warned of the dangers of online identity theft and pledged continued action against cybercriminals.", "reference": "Twenty-eight people, including a Briton, have been arrested after a global operation against a website allegedly involved in identity fraud.Those arrested are accused of operating Shadowcrew.com, which investigators claim was a global clearing house for criminals involved in credit card fraud.She said criminals were using the websites to traffic counterfeit credit cards and false identification information and documents such as credit cards, driver's licences, passports and birth certificates.All 28 people detained globally are suspected of being involved in an internet-based network which stole people's identities and used computers and websites to defraud credit card companies.The websites shared tips on how to commit fraud and provided a forum by which people could buy the information and tools they needed to commit such crime, she said.A 19-year-old man from Camberley, Surrey, was arrested by the National Hi-Tech Crime Unit but has been bailed.Assistant US Attorney Scott Christie said several people had been arrested in Argentina, Bulgaria, Canada, Estonia, Poland and Sweden.The Shadowcrew site, which has now been taken over by the US Secret Service, listed several discussion groups, in English and Russian, including one on hacking, spam and online anonymity tools.The US Secret Service was first tipped off in July 2003."}