{"raw_text": "Commodore finds new lease of life\n \n The once-famous Commodore computer brand could be resurrected after being bought by a US-based digital music distributor.\n \n New owner Yeahronimo Media Ventures has not ruled out the possibility of a new breed of Commodore computers. It also plans to develop a \"worldwide entertainment concept\" with the brand, although details are not yet known. The groundbreaking Commodore 64 computer elicits fond memories for those who owned one back in the 1980s.\n \n In the chronology of home computing, Commodore was one of the pioneers.\n \n The Commodore 64, launched in 1982, was one of the first affordable home PCs. It was followed a few years later by the Amiga. The Commodore 64 sold more than any other single computer system, even to this day. The brand languished somewhat in the 1990s. Commodore International filed for bankruptcy in 1994 and was sold to Dutch firm Tulip Computers. In the late 1980s the firm was a great rival to Atari, which produced its own range of home computers and is now a brand of video games, formerly known as Infogrames.\n \n Tulip Computers sold several products under the Commodore name, including portable USB storage devices and digital music players. It had planned to relaunch the brand, following an upsurge of nostalgia for 1980s-era games. Commodore 64 enthusiasts have written emulators for Windows PC, Apple Mac and even PDAs so that the original Commodore games can be still run. The sale of Commodore is expected to be complete in three weeks in a deal worth over £17m.\n", "llama3.2:1b": "The Commodore computer brand has been bought by US-based digital music distributor Yeahronimo Media Ventures for £17m, and plans to revive it with a new \"worldwide entertainment concept\". The brand's 1982 launch of the Commodore 64 was one of the first affordable home PCs.", "llama3.2:3b": "The Commodore computer brand may be resurrected by US-based Yeahronimo Media Ventures, which has bought the company for over £17m. The new owner plans to develop a \"worldwide entertainment concept\" with the brand and possibly create new computers.", "gemma2:2b": "A US-based digital music distributor has bought the Commodore computer brand. They plan to develop a new \"worldwide entertainment concept\" using the brand, and may even create new computers.  The original Commodore 64 was one of the first affordable home PCs and remains popular among enthusiasts. \n", "qwen2.5:0.5b": "The once-famous Commodore computer brand was acquired by Yeahronimo Media Ventures, but details are not yet known. It's hoped the new owners will develop a \"worldwide entertainment concept\" for the brand, although there is no information about it being released. The chronology of home computing begins with the Commodore 64 in 1982; after that came Amiga and Commodore 64 (with more than 100 million copies sold). In the 1990s, Commodore International filed for bankruptcy and was acquired by Tulip Computers.", "qwen2.5:1.5b": "US-based digital music distributor buys former Commodore brand, potentially reviving it with new products like USB storage devices and digital music players while developing a \"worldwide entertainment concept\" centered around the 1980s-era Commodore 64 computer, which has strong nostalgic appeal despite its long停产历史。", "qwen2.5:3b": "Commodore computer brand could be revived after being bought by a US digital music distributor. New owner plans worldwide entertainment concept with the brand, which pioneered home computing with models like the Commodore 64 and Amiga. The 1982-launched Commodore 64 was highly successful but declined in the 1990s when Commodore International filed for bankruptcy and sold to Dutch firm Tulip Computers. Tulip sold several products under Commodore name, including USB storage devices and digital music players. Despite a resurgence of nostalgia in the late 1980s, Tulip planned to relaunch the brand. The sale is expected to be completed in three weeks for over £17m.", "opencoder:1.5b": "Summarization: \n\nCommodore finds new lease of life.\n\nThe once-famous Commodore computer brand could be resurrected after being bought by a US-based digital music distributor.\n\nNew owner Yeahronimo Media Ventures has not ruled out the possibility of a new breed of Commodore computers. It also plans to develop a \"worldwide entertainment concept\" with the brand, although details are not yet known. The groundbreaking Commodore 64 computer elicits fond memories for those who owned one back in the 19th century.\n", "smollm:1.7b": "Commodore finds new lease of life", "deepseek-r1:1.5b": "<think>\nOkay, let's tackle this query step by step. The user has provided a text about Commodore computers, their history, and a recent buyer deal. They want me to summarize it into a concise summary with only the key points without any explanations or formatting.\n\nFirst, I need to extract the main ideas from each paragraph. Starting with the first sentence: \"Commodore finds new lease of life.\" That's straightforward—the brand is being sold again, so that's an important point about their revival.\n\nNext, it says the owner is Yeahronimo Media Ventures. The user wants only key details, so I'll note that they're buying out Commodore but not ruling out a new tech product.\n\nThen, the company plans to develop a \"worldwide entertainment concept\" with the brand. The 64 computer was introduced in 1982 and sold well even today. But in the 90s, it was struggling because of competition from Amiga and others.\n\nThe original release was under Commodore International, which filed for bankruptcy in 1994 and then sold to Tulip Computers in 2001. Prior to that, they were a big rival to Atari, known for their home games.\n\nTulip's deal is worth over £17m and it's expected to be completed in three weeks. Their products include storage devices and music players. They relaunch the brand because people keep trying Commodore games on newer PCs like Windows PC, Mac, PDA.\n\nPutting this together into a summary without any extra info or explanations. I'll make sure each key point is included concisely.\n</think>\n\nThe Commodore computer brand has been sold again by a digital music distributor, Yesronimo Media Ventures, who plans to develop a new tech product and launch a \"worldwide entertainment concept.\" The 64 computer, introduced in the 1980s, remains a significant player despite challenges in the 90s. The original release was under Commodore International, which filed for bankruptcy in 1994 before selling to Tulip Computers in 2001. Tulip's deal is valued at over £17m and includes products like portable USB devices and music players. They aim to relaunch the brand because people keep trying old Commodore games on newer PCs.", "tinyllama:1.1b": "The once-famous Commodore computer brand could potentially rise from the ashes, according to new owners of the brand. It was previously owned by Yeahronimo Media Ventures and plans for a \"worldwide entertainment concept\" are yet to be revealed. However, the groundbreaking Commodore 64 computer from the 1980s is still remembered fondly among home computing enthusiasts who have written emulators for various platforms. It was launched in 1982 and followed by the Amiga in the late 1980s. Despite suffering bankruptcy in the early 1990s, Commodore International filed for bankruptcy in 1994 before being sold to Tulip Computer Systems. At its peak in the mid-1990s, the brand sold more than any other single computer system, including the original Atari and Infocomes' portable USB storage devices. Although new owners haven't yet revealed their plans for Commodore's revival, enthusiasts are excited at the prospect of seeing retro games run on modern platforms.", "tinydolphin:1.1b": " A US-based digital music distributor has purchased Commodore, the once-famous computer brand, for an undisclosed amount. The company plans to develop a \"worldwide entertainment concept\" with the brand, as nostalgia for the Commodore 64 increases. The Commodore 64 was one of the first affordable home PCs and has been widely celebrated in popular culture, even after its release in the 1980s.", "phi:2.7b": " Yeahronimo Media Ventures has bought the brand 'Commodore' and is planning to revive it with a new digital music distributor, but they haven't ruled out the possibility of new computers. Commodore was one of the first affordable home computers, and their 64 sold more than any other single computer system even today. Tulip Computers had already relaunched the brand by developing portables USB storage devices and digital music players. The deal will be complete in three weeks worth over £17m.\n", "orca-mini:3b": " The Commodore brand could be resurrected with a new owner who plans to develop a \"worldwide entertainment concept\" with the brand. Details are not yet known, but the brand elicits fond memories for those who owned one back in the 1980s. In the chronology of home computing, Commodore was one of the pioneers and was followed by the Amiga. The Commodore 64, launched in 1982, sold more than any other single computer system, even to this day.", "hermes3:3b": "Commodore potentially revived by new owner Yeahronimo, planning computers & global entertainment concept; Commodore 64, pioneer home PC, could see revival.", "stablelm-zephyr:3b": "Commodore, a once-famous computer brand, has been bought by a digital music distributor, Yeahronimo Media Ventures. Though no new Commodore computers have been announced yet, the company plans to develop a worldwide entertainment concept using the brand. The iconic Commodore 64, launched in 1982, sold more than any other home computer system and revived fond memories of the 1980s. Tulip Computers, which owned the brand after its bankruptcy in the 1990s, had planned to relaunch it due to an increase in nostalgia for 1980s games. The sale of Commodore is expected to be completed within three weeks for over £17 million.", "chatgpt-4o-latest": "The Commodore computer brand may be revived after being acquired by US-based Yeahronimo Media Ventures. The company has not ruled out developing new Commodore computers and plans to create a global entertainment concept with the brand. Commodore was a pioneer in home computing, with the Commodore 64, launched in 1982, becoming the best-selling single computer system. The brand declined in the 1990s, and Commodore International went bankrupt in 1994, later being sold to Dutch firm Tulip Computers. Tulip sold products under the Commodore name and considered relaunching it due to nostalgia for 1980s games. Commodore 64 enthusiasts have developed emulators to keep its games playable. The sale, valued at over £17m, is expected to be completed in three weeks.", "stablelm2:1.6b": "A US-based digital music distributor has acquired the once-famous Commodore computer brand, potentially resurrecting it with new computers or an entertainment concept. The Commodore 2 launched in 1984 was one of the first affordable home PCs and sold more than any other single computer system at the time. Although details are not yet known, the Commodore brand could see revival through a \"worldwide entertainment concept.\"", "granite3.1-dense:2b": "Commodore, a pioneering 1980s computer brand known for the best-selling Commodore 64 and Amiga models, may be revived by US-based digital music distributor Yeahronimo Media Ventures. The new owner has not discarded the idea of introducing modern Commodore computers and plans to develop a global entertainment concept with the brand. After a period of decline following bankruptcy in 1994, Tulip Computers, which later sold products under the Commodore name like USB storage devices and digital music players, was a significant competitor to Atari. Nostalgia for 1980s gaming has led to emulators for modern platforms running original Commodore games. The acquisition is expected to close in three weeks for over £17 million.", "reference": "In the chronology of home computing, Commodore was one of the pioneers.The Commodore 64, launched in 1982, was one of the first affordable home PCs.Commodore International filed for bankruptcy in 1994 and was sold to Dutch firm Tulip Computers.The once-famous Commodore computer brand could be resurrected after being bought by a US-based digital music distributor.The Commodore 64 sold more than any other single computer system, even to this day.In the late 1980s the firm was a great rival to Atari, which produced its own range of home computers and is now a brand of video games, formerly known as Infogrames."}