{"raw_text": "When invention turns to innovation\n \n It is unlikely that future technological inventions are going to have the same kind of transformative impact that they did in the past.\n \n When history takes a look back at great inventions like the car and transistor, they were defining technologies which ultimately changed people's lives substantially. But, says Nick Donofrio, senior vice-president of technology and manufacturing at IBM, it was not \"the thing\" itself that actually improved people's lives. It was all the social and cultural changes that the discovery or invention brought with it. The car brought about a crucial change to how people lived in cities, giving them the ability to move out into the suburbs, whilst having mobility and access. \"When we talk about innovation and creating real value in the 21st Century, we have to think more like this, but faster,\" Mr Donofrio told the BBC News website, after giving the Royal Academy of Engineering 2004 Hinton Lecture. \"The invention, discovery is likely not to have the same value as the transistor had or the automobile had. \"The equivalent of those things will be invented or discovered, but by themselves, they are just not going to able to generate real business value or wealth as these things did.\" These are not altogether new ideas, and academics have been exploring how technologies impact wider society for years. But what it means for technology companies is that a new idea, method, or device, will have to have a different kind thinking behind it so that people see the value that innovative technology has for them.\n \n We are in a different phase now when it comes to technology, argues Mr Donofrio, Industry Week's 2003 Technology Leader of the Year. The hype and over-promise is over and now technology leaders have to demonstrate that things work, make sense, make a difference and life gets better as a result.\n \n \"In the dotcom era, there was something that was jumping up in your face every five minutes. \"Somebody had a new thing that would awe you. You weren't quite sure that it did anything, you weren't quite sure if you needed it, you weren't quite sure if it had value for it, but it was cool.\" But change and innovation in technology that people will see affecting their daily lives, he says, will come about slowly, subtlety, and in ways that will no longer be \"in your face\". It will creep in pervasively. Nanotechnologies will play a key part in this kind of pervasive environment in all sorts of ways, through new superconducting materials, to coatings, power, and memory storage. \"I am a very big believer in the evolution of this industry into a pervasive environment, in an incredible network infrastructure,\" says Mr Donofrio. Pervasive computing is where wireless computing rules, and where jewellery, clothes, and everyday objects become the interfaces instead of bulky wires, screens and keyboards. The net becomes a true network that is taken for granted and just there, like air. \"People will not have to do anything to stay connected. People will know their lives are just better,\" says Mr Donofrio. \"Trillions of devices will be connected to the net in ways people will not know.\" Natural interfaces will develop, devices will shape your persona, and our technologically underused voices could be telling our jewellery to sort out the finances.\n \n Ultimately, there will be, says Mr Donofrio, no value in being \"computer illiterate\". To some, it sounds like a technological world gone mad. To Mr Donofrio, it is a vision innovation that will happen. Behind this vision should be a rich robust network capability and \"deep computing\", says Mr Donofrio. Deep computing is the ability to perform lots of complex calculations on massive amounts of data, and integral to this concept is supercomputing. It has value, according to IBM, because it helps humans work out extremely complex problems to come up with valuable solutions, like how to refine millions of net search results, finding cures for diseases, or understanding of exactly how a gene or protein operates.\n \n But pervasive computing presumably means having technologies that are aware of diversity of contexts, commands, and requirements of a diverse world. As computing and technologies become part of the environment, part of furniture, walls, and clothing, physical space becomes a more important consideration.\n \n This is going to need a much broader range of skills and experience. \"I am confident that the SET [science, engineering and technology] industry is going to be short on skills,\" he says. \"If I am right about what innovation is, you need to be multidisciplinary and collaborative. \"Women tend to have those traits a lot better than men.\" Eventually, women could win out in both life and physical sciences, he says. In the UK, a DTI-funded resource centre for women has set a target to have 40% representation on SET industry boards. IBM, according to Mr Donofrio, has 30%. \"Our goal is for our research team to become the preferred organisation for women in science and technology to begin their career.\" The whole issue of global diversity is as much a business matter as it is a moral and social concern to Mr Donofrio. \"We believe in the whole issue of global diversity,\" he says. \"Our customers are diverse, our clients are diverse. They expect us to look like them. \"As more and more women or underrepresented minorities succeed into leadership positions, it becomes and imperative for us to constantly look like them.\"\n", "llama3.2:1b": "Invention and innovation in technology will change people's lives but not directly improve their lives. It is the social and cultural changes that inventions bring with them that have value. The equivalent of old technologies like cars or transistors are likely to be invented or discovered, but without generating business value or wealth.\n\nCurrently, the hype around new technologies is over because they may not work as promised. Technology leaders need to demonstrate that things work, make sense, and improve people's lives. This will come from innovation in areas like nanotechnology, pervasive computing, and deep computing, which can create a network environment that is taken for granted.\n\nThe key to success lies in developing technologies that are multidisciplinary and collaborative, with women being more suitable for these roles. Industry leaders have already shown an interest in diversity and inclusion, and there is a target of 40% representation on SET industry boards by the UK's DTI.\n\nUltimately, innovation will not be \"computer illiterate\" because it involves creating a rich network capability and deep computing to solve complex problems. Pervasive computing means technologies that are aware of diversity of contexts and requirements, and physical space becomes an important consideration as technology becomes part of everyday life.", "llama3.2:3b": "Invention may not have the same transformative impact as past innovations such as cars and transistors. Instead, social and cultural changes brought about by these discoveries had a greater impact on people's lives. New technologies will need to be designed with this in mind, focusing on creating value and making a difference in daily life. Pervasive computing will become the norm, where devices and objects are interconnected, making it easier for people to stay connected without effort. Deep computing and supercomputing will be essential for complex problem-solving. The industry will require a broader range of skills and experience, including multidisciplinary collaboration. Women are being encouraged to enter STEM fields, with IBM aiming to increase representation and diversity globally.", "gemma2:2b": "Technological inventions will not have the same transformative impact as in the past.  Innovation today must focus on social change rather than technological advancement alone.   Pervasive computing is a key aspect of this new approach, where technology seamlessly integrates into daily life with complex network infrastructure and deep computation capabilities. This paradigm shifts to a more subtle and pervasive environment driven by nanotechnologies and natural interfaces, resulting in a greater user experience.  The skills needed for success in this evolving era will necessitate multidisciplinary collaboration and focus on diversity, as demonstrated through the UK's DTI-funded resource center for women. \n", "qwen2.5:0.5b": "Future technological inventions will not have the same transformative impact on people's lives as they did in the past because of changes that are social and cultural instead of technological. The discovery or invention bringing about these changes is more important than what technology itself brings. These new technologies will create wider societal impacts rather than individual ones, as long as it does not become a new kind of tool to change people's daily lives, like the automobile or transistor.", "qwen2.5:1.5b": "Innovation is shifting from invention to a slower, subtle process of creating value in the 21st century by considering social and cultural impacts alongside technological improvements. Companies should think \"like this but faster\" as new ideas often lack transformative impact compared to past inventions. Technology's future will involve pervasive computing with deep networking capabilities and natural interfaces that shape personas. Skills across diverse disciplines are crucial for innovation, particularly in women-centric industries like SET (Science, Engineering, and Technology).", "qwen2.5:3b": "When future technological inventions do not match the transformative impact of past innovations such as the car and transistor, they will bring about social and cultural changes rather than solely functional improvements. Innovations in the 21st century need a different approach, considering their long-term societal impacts. Innovation should demonstrate tangible benefits that make people's lives better. Emerging technologies like pervasive computing and nanotechnology suggest a shift towards less obvious yet profound technological integration into daily life. This evolution requires deep computing for complex problem-solving and advanced forms of deep learning, along with broader skill sets to handle diverse contexts. IBM emphasizes the importance of gender diversity in SET industry leadership positions, recognizing that underrepresented groups bring valuable perspectives.", "opencoder:1.5b": "The given text is a summary of the following passage:\n\n\"Future technological inventions likely have transformative impact on people's lives but not as directly as the past. The discovery or invention brought about social and cultural changes that further contribute to their impact. A car, for instance, brought about a change in how cities function - making them more accessible and more livable. This has led to increased mobility and access. Conversely, an automobile didn't bring much value but it was necessary as a fundamental tool of transport. The invention also changed the way people live, allowing them to move out into urban areas. On this note, innovation stands to have significant impacts on society, but there's still a lot to explore.\" \n\nAs for what it means for technology companies to demonstrate that things work, make sense and generate value in the 21st Century, they may say, we're on a different phase now. The idea of \"dotcom era\" is emerging, where new technologies are being developed and tested with growing businesses. Companies are also realizing their potential through innovation. Finally, it's also about the evolution of this industry into a pervasive network infrastructure that will continue to grow and evolve.\" \n\nThis summarization aims to preserve the key ideas from the original text while making sure all technical terms are correctly explained or referenced.\n", "smollm:1.7b": "The summary is concise and easy to understand, but there are some minor details that could be added:\n\n1. The text mentions the importance of innovation in creating value for people's lives, but does not elaborate on this point further.\n2. The text suggests that when we talk about innovation and creating real value in the 21st century, we need to think more like this, but what exactly is meant by \"real value\" and how will it be demonstrated?\n3. The text mentions the importance of pervasive computing, but does not provide any specific examples or details on how this concept will play out in practice.\n4. The text suggests that women tend to have those traits a lot better than men, but does not elaborate on this point further.\n5. The text implies that global diversity is important for businesses, but does not provide any specific examples of how this can be achieved or what the implications are for business strategy.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely. Let me read through it carefully.\n\nThe first paragraph talks about how future tech won't have the same impact as past innovations. Nick Donofrio, IBM's vice-president, says that while social and cultural changes are important, just thinking creatively is not enough—it has to be something real. He mentions the dotcom era example where people were surprised by new things.\n\nThen he talks about industry leaders now focusing on proving tech works in everyday life through technologies like nanotechnology and pervasive computing. Pervasive computing uses data as a network, reducing physical space barriers.\n\nHe also discusses the importance of \"deep computing\" which involves massive data processing and supercomputers. IBM's success is cited for solving complex problems with it. But the text says there will be fewer IT skills in society, so more interdisciplinary and diverse teams are needed.\n\nMr Donofrio notes that women are underrepresented in tech leadership roles, especially in science and technology. The UK aims to increase their presence through specific initiatives like the DTI resource centre for women targeting 40% representation on SET boards. IBM has already reached 30%.\n\nFinally, he emphasizes global diversity as a business concern—customers and clients need diverse leaders.\n\nSo I should capture all these points into a summary without too much detail.\n</think>\n\nInnovation in technology is unlikely to have the same transformative impact as past inventions. Nick Donofrio argues that while social changes matter, real value requires something tangible. The dotcom era example shows how new tech can change lives suddenly. Now, industry leaders focus on proving tech works daily through technologies like nanotechnology and pervasive computing. Pervasive computing uses data as a network, making devices connected without physical space. Deep computing involves massive data processing with supercomputers, aiding in solving complex problems. IBM's success shows how it solves issues like refining search results or understanding gene functions. However, there are fewer IT skills in society, prompting more interdisciplinary teams and diverse leadership roles. Women face underrepresentation but aim to increase their presence in leadership roles, especially in SET industry boards. Globally, diversity is a business concern—customers and clients need diverse leaders.", "tinyllama:1.1b": "The author suggests that the future of invention and innovation will be shaped by a transformative impact on human lives rather than just bringing about technology. The idea that people will see value in new inventions or technologies will be different from the typical hyping up that occurred during the dotcom era, where changes were perceived as \"in your face\" with no noticeable change. Industry Week's 2003 Technology Leader of the Year, Nick Donofrio, argues that there will be a pervasive environment in which pervasive computing becomes the norm and natural interfaces will emerge. The author sees this as an evolutionary process that will make it possible for women to become the preferred organization for researchers in SET industries.", "tinydolphin:1.1b": " AII Assistant: The passage discusses the impact of innovation on human life, focusing on how technology can change people's lives and bring new opportunities. It highlights the rise of micro-scopy as a way to improve medicine and healthcare, as well as advanced technologies like supercomputing that can help scientists understand complex issues. The text also mentions IBM's commitment to diversity in science and technology and how it is aiming for 40% representation of women on SET industry boards.", "phi:2.7b": " AI ", "orca-mini:3b": " When innovation turns to innovation, it is unlikely that future technological inventions will have the same kind of transformative impact that they did in the past. Social and cultural changes brought about by the discovery or invention of the car and transistor were defining technologies that ultimately changed people's lives substantially. However, these days, ideas are spreading faster and becoming more pervasive, and it is difficult to know exactly what will be valuable until it is actually used. The net becomes a true network that is taken for granted, and people will not have to do anything to stay connected. Natural interfaces will develop, and devices will shape our persona. Deep computing could help us work out extremely complex problems to come up with valuable solutions, like how to refine millions of search results or understand exactly how a gene or protein operates. Women tend to have multidisciplinary and collaborative skills, and IBM has set a target to attract 40% representation on SET industry boards. However, the issue of global diversity is as much a business matter as it is a moral and social concern for Mr Donofrio. As more and more women or underrepresented minorities succeed into leadership positions, it becomes an imperative for us to constantly look like them.", "hermes3:3b": "Future tech innovations likely won't have same transformative impact as past inventions; emphasis should be on social & cultural changes, faster thinking for real value creation in 21st century.", "stablelm-zephyr:3b": "Inventions in the past, such as the car and transistor, had a substantial impact on people's lives due to the social and cultural changes they brought. However, future innovations may not have the same transformative power. Technology companies must think differently and demonstrate value for innovative technologies in order to create real business value and wealth. The evolution of technology into a pervasive environment, where nanotechnologies play a key part, will affect daily lives slowly and subtly. Pervasive computing includes wireless interfaces in everyday objects, creating interconnected devices that shape people's personas. Deep computing enables the performance of complex calculations on large amounts of data to find valuable solutions. The SET industry needs more multidisciplinary and collaborative professionals, with a focus on global diversity for success. IBM aims to increase women's representation on their research team and align their organization with diverse customers and clients.", "chatgpt-4o-latest": "Future technological inventions may not have the same transformative impact as past innovations like the car or transistor. According to IBM's Nick Donofrio, the real value of technology lies in the social and cultural changes it brings, rather than the invention itself. In the 21st century, innovation must focus on creating tangible value rather than hype. Technology will evolve subtly and pervasively, with nanotechnology and pervasive computing playing key roles. Wireless computing will integrate seamlessly into daily life, making connectivity effortless. Deep computing and supercomputing will help solve complex problems, while technology must adapt to diverse global contexts. The industry will require multidisciplinary collaboration, and women may play a greater role in science and technology. Diversity in leadership is both a business and social necessity, as companies must reflect their diverse customer base.", "stablelm2:1.6b": "This text discusses the role of innovation in transforming people's lives through inventions such.\nAccording to Nick Donofrio, a senior vice-president at IBM, the true value of technological inventions lies not in their individual features but in the cultural and social changes they bring about. The car, for example, changed how people lived in cities by giving them mobility and access to suburbs. This highlights that innovation does not always result from major breakthroughs; rather, it often involves smaller, more gradual changes.\n\nDonofrio argues that the next generation of innovative technology won't be as impactful because they'll have to work within a \"pervasive\" environment where devices like jewelry and everyday objects become interfaces for interaction. This will require multidisciplinary skills and collaboration since the internet is becoming a part of people's daily lives.\n\nHe also emphasizes the importance of addressing global diversity, stating that companies' customers are diverse, and they expect to be represented by employees who share similar backgrounds or experiences. By promoting a culture of inclusion and encouraging women to join leadership positions in their respective fields, such as science and technology, we can ensure that innovation is inclusive and beneficial for all.", "granite3.1-dense:2b": "In the future, technological inventions may not carry the same transformative impact as historical ones like the car and transistor, according to Nick Donofrio, senior vice-president of technology and manufacturing at IBM. Instead, value will come from the social and cultural changes these innovations bring about, such as improved mobility or new ways of interacting with technology. This shift necessitates a change in perspective for technology companies, requiring them to demonstrate practical benefits and tangible improvements in people's daily lives rather than focusing on sensationalism.\n\nDonofrio envisions a future where technology becomes pervasive, integrating seamlessly into everyday objects like jewelry, clothing, and the internet itself. This \"pervasive computing\" will empower individuals with powerful capabilities without their conscious effort, such as managing finances through voice commands or accessing information through wearable devices.\n\nKey to this future is deep computing—the ability to process vast amounts of data and complex problems for valuable outcomes. Supercomputing plays a significant role in this context. Moreover, pervasive technology will require consideration of physical spaces and diverse contexts, making the need for multidisciplinary skills and collaboration essential.\n\nDonofrio emphasizes the importance of global diversity within the SET (science, engineering, and technology) industry, recognizing that it is both a business imperative and a moral responsibility. IBM aims to increase representation of women in leadership positions, aligning with their target of having 40% female representation on industry boards, which they currently hold at 30%. Ultimately, this diversity will enable the company to better understand and cater to its diverse customer base.", "reference": "People will know their lives are just better,\" says Mr Donofrio.We are in a different phase now when it comes to technology, argues Mr Donofrio, Industry Week's 2003 Technology Leader of the Year.But what it means for technology companies is that a new idea, method, or device, will have to have a different kind thinking behind it so that people see the value that innovative technology has for them.Ultimately, there will be, says Mr Donofrio, no value in being \"computer illiterate\".But, says Nick Donofrio, senior vice-president of technology and manufacturing at IBM, it was not \"the thing\" itself that actually improved people's lives.Behind this vision should be a rich robust network capability and \"deep computing\", says Mr Donofrio.IBM, according to Mr Donofrio, has 30%.To Mr Donofrio, it is a vision innovation that will happen.\"I am a very big believer in the evolution of this industry into a pervasive environment, in an incredible network infrastructure,\" says Mr Donofrio.But change and innovation in technology that people will see affecting their daily lives, he says, will come about slowly, subtlety, and in ways that will no longer be \"in your face\".When history takes a look back at great inventions like the car and transistor, they were defining technologies which ultimately changed people's lives substantially.But pervasive computing presumably means having technologies that are aware of diversity of contexts, commands, and requirements of a diverse world.The whole issue of global diversity is as much a business matter as it is a moral and social concern to Mr Donofrio.\"When we talk about innovation and creating real value in the 21st Century, we have to think more like this, but faster,\" Mr Donofrio told the BBC News website, after giving the Royal Academy of Engineering 2004 Hinton Lecture.\"I am confident that the SET [science, engineering and technology] industry is going to be short on skills,\" he says.As computing and technologies become part of the environment, part of furniture, walls, and clothing, physical space becomes a more important consideration.The hype and over-promise is over and now technology leaders have to demonstrate that things work, make sense, make a difference and life gets better as a result.\"Trillions of devices will be connected to the net in ways people will not know.\"\"Our goal is for our research team to become the preferred organisation for women in science and technology to begin their career.\""}