{"raw_text": "Players sought for $1m prize\n \n UK gamers are getting a chance to take part in a $1m tournament thanks to one of the country's top teams.\n \n The Four-Kings clan is staging a Pop Idol type competition to find new members who can take on the world's best in the lucrative tournament. Four-Kings hopes the open qualifiers will turn up gamers good enough to beat all comers at the Painkiller game. Top players also get a contract with the Four-Kings team which will pay travelling expenses for the contest.\n \n UK gamers have until 12 November to register their interest in taking part and can sign up via the Four-Kings, Jolt.co.uk and Painkiller tournament websites. Philip Wride, who co-manages the Four-Kings team, said online qualifiers will be held from 16-28 November to find the best eight players of the Painkiller game. He said the clan was running the contest because Four-Kings does not currently have any players that excel at Painkiller. These eight players will be brought together in London on 3-5 December for the Bloodline Tournament that will find the best two players.\n \n The event will be filmed and the final cut made available online for others to watch. The movie is being put together by Simon Bysshe who has shot many other films about pro-gaming that have been widely shared online. Said Mr Bysshe: \"Painkiller is a new game and the opportunity is there for a new player to step up.\" Painkiller has been described as a game that adds a few modern touches, such as improved graphics, to the old-fashioned first-person shooter. These two players will be put forward as the UK's entrants to the Cyberathlete Professional League $1m Painkiller contest that will take place throughout 2005. The event is being billed as the CPL World Tour and will be arranged around ten separate tournaments at different locations around the world. Travel expenses to all the stops on the tour will be paid by Four-Kings for the two UK players who make the grade. The top prize at each stop on the world tour will be $15,000. A further $150,000 will be given to the winner of the Grand Final due to be held in December 2005. Mr Wride said any gamer that wins a few tour stop tournaments and the grand final will have a very good year. The first stop on the world tour will be Istanbul, Turkey from 10-13 February. A total of $50,000 in cash prizes is on offer. The CPL has said that it picked a one-on-one game such as Painkiller to make it easier for spectators to follow the action. Counter-Strike, by far the most popular online game, pits teams against each other and can be confusing to follow if those watching are not familiar with the layout of the maps on which it is played. The decision to pick Painkiller was greeted with surprise by many gamers, as it was widely expected that Doom 3 would be chosen as the one-one-one title.\n", "llama3.2:1b": "UK gamers will participate in a $1m tournament for the Painkiller game. Four-Kings clan wants players to compete and win the top prize of $15,000 each at select tournaments around the world, with travel expenses paid by the group. Online qualifiers will be held from November 16-28, followed by a Bloodline Tournament in London on December 3-5, where two UK players will compete for the Grand Final prize of $150,000. The CPL World Tour will consist of ten tournaments worldwide.", "llama3.2:3b": "UK gamers invited to $1m tournament; open qualifiers start November 16-28; top players get contract and travel expenses for tour stops in various locations worldwide, including Istanbul, Turkey; event to be filmed and available online; winners take home $150,000 at grand final in December 2005.", "gemma2:2b": "A UK gaming team, Four-Kings, is hosting a $1 million tournament for players of the game \"Painkiller\". The open qualifiers will select the best eight players who will compete in London from November 16th to 28th.  The top two players will represent the UK in the \"Cyberathlete Professional League\" world tour. \n \nThe winner of each tournament stop, totaling $50,000 in cash prizes, and the grand final winner will receive an additional $150,000, making for a substantial year's earnings for those who succeed.  \n", "qwen2.5:0.5b": "UK gamers have a chance to take part in a $1m tournament called the Painkiller game thanks to Four-Kings, which hopes to find new members who can beat all comers at the Painkiller game.", "qwen2.5:1.5b": "Four-Kings team hosting $1m Painkiller tournament seeking top UK gamers; online qualifiers open Nov-November; final cut of documentary available for watching online after filming in Dec-January.", "qwen2.5:3b": "UK gamers have a chance to enter a $1m tournament for the top Painkiller players through Four-Kings clan. Open qualifiers will find the best eight players who will compete in Bloodline Tournament from December 3-5 in London. These two winners will represent UK in Cyberathlete Professional League contest and could win up to $205,000. The event is filmed by Simon Bysshe and the first stop will be in Istanbul on February 10-13 with a total prize pool of $50,000.", "opencoder:1.5b": "Players seeking for $1m prize in UK gamers are getting a chance to take part in a tournament where Four-Kings clan can find new members who can take on the world's best in the lucrative tournament.\n\nTop players get a contract with the Four-Kings team which will pay travelling expenses for the contest. UK gamers have until 12 November to register their interest in taking part and can sign up via the Four-Kings, Jolt.co.uk and Painkiller tournament websites. Four-Kings hope online qualifiers will turn up gamers good enough to beat all competitors at the Painkiller game.\n\nThe clan running the contest because Four-Kings does not currently have any players that excel at Painkiller. These eight players will be brought together in London on 3-5 December for the Bloodline Tournament, which is being billed as the CPL World Tour and will be arranged around ten separate tournaments at different locations around the world.\n\nThe final cut of the movie is made available online for others to watch. The movie is a shot by Simon Bysshe who has been widely shared online with many other films about pro-gaming. The game, Painkiller, has been described as a game that adds a few modern touches, such as improved graphics, to the old-fashioned first-person shooter.\n\nThe top prize at each tour stop will be $15,000 and a further $150,000 is given to the winner of the Grand Final which was held in December 2005. The event is being billed as the CPL World Tour and will be arranged around ten separate tournaments at different locations around the world with travel expenses paid by Four-Kings.\n\nThe first stop on the world tour will be Istanbul, Turkey from 10-13 February. A total of $50,000 in cash prizes is on offer. The CPL has said that it picked a one-on-one game such as Painkiller to make it easier for spectators to follow the action. Counter-Strike, by far the most popular online game, pits teams against each other and can be confusing to follow if those watching are not familiar with the layout of the maps on which it is played.\n", "smollm:1.7b": "The summary should capture the main points of the text without including any additional information or explanations. It should preserve the key ideas and details of the original text while presenting them in a concise and clear manner. The goal is to provide a brief overview of the text, highlighting its main points and themes, without going into too much detail or providing unnecessary background information.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about a gaming tournament event in the UK called the Painkiller Contest. Let me read through the text carefully.\n\nFirst, it mentions that players are seeking a $1 million prize. Then, the UK gamers are getting part of this tournament thanks to one of their top teams—the Four-Kings clan. They’re staging a competition where they can take on world-class athletes in a format similar to Pop Idol, which is popular among gamers.\n\nThe event involves four groups: Red, Blue, Green, and Yellow. Each group is supposed to send eight players who are then grouped into two teams of four for the Bloodline Tournament. These top two will proceed to the main tournament in London.\n\nThe film being made has a budget with Simon Bysshe, who has done other films about pro-gaming. He emphasized that Painkiller is new and a chance for a new player. It's described as a blend of old-school PS2 game with modern touches like better graphics. The two players from the top of Painkiller will be selected to represent the UK in the Cyberathlete Professional League, which is set to happen in 2005.\n\nThe event has multiple stops around the world, each offering $15,000 as a prize. There's an additional $150,000 for the grand final winner. The top prize is $50,000 at the first stop in Istanbul. If you win several tournaments and the grand final, you get a good year.\n\nI need to make sure I capture all key points: the $1 million prize, the event being $1m with a subset for UK gamers, the tournament structure involving four groups each sending eight players into bloodline and then two in London, film details by Simon Bysshe, the game's mix of old-school and modern elements, the two players from Painkiller moving forward, the various stops around the world with prize money, and the grand final winner.\n\nI'll need to condense this without getting too detailed. Make sure each main point is included concisely.\n</think>\n\nThe UK gamers are participating in a $1 million contest called the Painkiller Contest, part of an initiative by their top team, the Four-Kings clan, aiming to showcase new players. The event will include four groups sending eight players into a bloodline tournament and then selecting two for a London event. A film is being made with Simon Bysshe directing, emphasizing the game's blend of old-school PPS2 gameplay with modern touches like improved graphics. The top two from Painkiller will represent the UK in the Cyberathlete Professional League 2005, offering $15,000 at each stop and a grand final winner receiving an additional $150,000. The first stop is in Istanbul with a $50,000 prize, and top prizes are distributed across multiple stops around the world. Winning several tournaments and the grand final could earn good luck.", "tinyllama:1.1b": "The UK game team, Four-Kings, is organizing a \"Pop Idol\" style competition for new members who can take on the world's best in the lucrative tournament, with £1 million prize money up for grabs. The competitors will also receive travel expenses and a contract with Four-Kings, while players who register their interest by November 12th can sign up online and be part of the open qualifiers to find the top eight players for the Bloodline Tournament to find the best two players in January. The Bloodline Tournament is being filmed and made available online for others to watch, and both top-performing teams from each stop on the world tour will get a chance at the Grand Final in December 2005, with $15,000 given out as winners of each stop. With £50,000 in cash prizes up for grabs, the CPLE World Tour and the top-performing team will have an easy time winning viewers' hearts.", "tinydolphin:1.1b": " Players seeking a once-in-a-lifetime chance at earning $1 million for their skills in Painkiller will have to take part in a qualifying event hosted by one of the UK's top teams, Four-Kings. The tournament will be an all-expenses-paid opportunity for those who can stand out against the best competitors from around the world.", "phi:2.7b": " The Four-Kings clan is hosting a $1M tournament for UK gamers, where they compete in the online game Painkiller. Two players will represent the UK at the Cyberathlete Professional League World Tour starting in December 2005. The competition offers cash prizes and travel expenses to top players. \n", "orca-mini:3b": " UK gamers have a chance to participate in a $1m tournament hosted by the Four-Kings clan. The team is staging a Pop Idol-style competition to find new members who can compete against the best in the lucrative tournament. Players who are good enough to beat all comers at the Painkiller game will get a contract with the Four-Kings team, which will pay their travelling expenses for the contest. The event will be filmed and made available online for others to watch. The top prize at each stop on the world tour will be $15,000, while the winner of the Grand Final will receive $150,000. The first stop on the world tour is Istanbul, Turkey from 10-13 February.", "hermes3:3b": "$1m gaming tournament competition for UK players, looking for new Painkiller experts; open qualifiers to find best 8 players and winner gets world tour spot.", "stablelm-zephyr:3b": "UK team Four-Kings is holding an open qualifier tournament for Painkiller worth $1m, partnering with Jolt.co.uk and the game's developers. The top eight players will compete in a Bloodline Tournament on 3-5 December, with the winners representing the UK in the Cyberathlete Professional League's $1m Painkiller contest. Travel expenses for the winning duo will be covered by Four-Kings.", "chatgpt-4o-latest": "UK gaming team Four-Kings is hosting a competition to find top players for the $1m Cyberathlete Professional League (CPL) Painkiller tournament. Open qualifiers will be held online from 16-28 November, with the best eight players advancing to a London event on 3-5 December to determine the top two. These players will represent the UK in the CPL World Tour, which includes ten global tournaments throughout 2005, with travel expenses covered by Four-Kings. The tour offers $15,000 prizes at each stop and a $150,000 grand final prize. The first event will be in Istanbul in February. Painkiller was chosen for its spectator-friendly format, though many expected Doom 3 to be selected.", "stablelm2:1.6b": "Four-Kings clan holds a $1m tournament for UK gamers interested in competing in the popular game Painkiller. The team is seeking new members to join them and hopes online qualifiers will attract eight players, with eight more joining in December at the Bloodline Tournament. Filmed event will be made available on-line after the final cut by Simon Bysshe. Winning players also receive travel expenses for ten stops around the world with $1m prize pool and a $500 bonus each for top performers.", "granite3.1-dense:2b": "UK gamers have a chance to compete in a $1m tournament called Bloodline Tournament, organized by Four-Kings, a prominent gaming clan. This event aims to find and contract top Painkiller players for the UK team, which currently lacks elite Painkiller players. Online qualifiers will take place from 16-28 November, with the best eight players advancing to London's 3-5 December Bloodline Tournament. The tournament winner will represent the UK in the Cyberathlete Professional League (CPL) $1m Painkiller contest, a global event featuring ten separate tournaments at various locations throughout 2005. Each stop on the world tour offers $15,000 in cash prizes, with the grand final holding a $150,000 top prize. The first CPL Painkiller event is scheduled for Istanbul, Turkey, from February 10-13. Four-Kings will cover travel expenses for the two UK players who qualify. The decision to select Painkiller as the game was surprising, as it was anticipated that Counter-Strike would be chosen due to its popularity and ease of spectator following compared to Painkiller's one-on-one format.", "reference": "Philip Wride, who co-manages the Four-Kings team, said online qualifiers will be held from 16-28 November to find the best eight players of the Painkiller game.He said the clan was running the contest because Four-Kings does not currently have any players that excel at Painkiller.Travel expenses to all the stops on the tour will be paid by Four-Kings for the two UK players who make the grade.Said Mr Bysshe: \"Painkiller is a new game and the opportunity is there for a new player to step up.\"The top prize at each stop on the world tour will be $15,000.Mr Wride said any gamer that wins a few tour stop tournaments and the grand final will have a very good year.UK gamers have until 12 November to register their interest in taking part and can sign up via the Four-Kings, Jolt.co.uk and Painkiller tournament websites.Four-Kings hopes the open qualifiers will turn up gamers good enough to beat all comers at the Painkiller game.The CPL has said that it picked a one-on-one game such as Painkiller to make it easier for spectators to follow the action.Top players also get a contract with the Four-Kings team which will pay travelling expenses for the contest."}