{"raw_text": "Musicians 'upbeat' about the net\n \n Musicians are embracing the internet as a way of reaching new fans and selling more music, a survey has found.\n \n The study by US researchers, Pew Internet, suggests musicians do not agree with the tactics adopted by the music industry against file-sharing. While most considered file-sharing as illegal, many disagreed with the lawsuits launched against downloaders. \"Even successful artists don't think the lawsuits will benefit musicians,\" said report author Mary Madden.\n \n For part of the study, Pew Internet conducted an online survey of 2,755 musicians, songwriters and music publishers via musician membership organisations between March and April 2004.\n \n They ranged from full-time, successful musicians to artists struggling to make a living from their music. \"We looked at more of the independent musicians, rather than the rockstars of this industry but that reflects more accurately the state of the music industry,\" Ms Madden told the BBC News website. \"We always hear the views of successful artists like the Britneys of the world but the less successful artists rarely get represented.\" The survey found that musicians were overwhelming positive about the internet, rather than seeing it as just a threat to their livelihood. Almost all of them used the net for ideas and inspiration, with nine out of 10 going online to promote, advertise and post their music on the web. More than 80% offered free samples online, while two-thirds sold their music via the net. Independent musicians, in particular, saw the internet as a way to get around the need to land a record contract and reach fans directly. \"Musicians are embracing the internet enthusiastically,\" said Ms Madden. \"They are using the internet to gain inspiration, sell it online, tracking royalties, learning about copyright.\"\n \n Perhaps surprisingly, opinions about online file-sharing were diverse and not as clear cut as those of the record industry.\n \n Through the Recording Industry Association of America (RIAA), it has pursued an aggressive campaign through the courts to sue people suspected of sharing copyrighted music. But the report suggests this campaign does not have the wholehearted backing of musicians in the US. It found that most artists saw file-sharing as both good and bad, though most agreed that it should be illegal. \"Free downloading has killed opportunities for new bands to break without major funding and backing,\" said one musician quoted by the report. \"It's hard to keep making records if they don't pay for themselves through sales.\" However 60% said they did not think the lawsuits against song swappers would benefit musicians and songwriters. Many suggested that rather than fighting file-sharing, the music industry needed to recognise the changes it has brought and embrace it. \"Both successful and struggling musicians were more likely to say that the internet has made it possible for them to make more money from their music, rather than make it harder for them to protect their material from piracy,\" said Ms Madden.\n", "llama3.2:1b": "Musicians are embracing the internet as a way to reach new fans and sell more music, despite some disagreements with industry tactics against file-sharing. A survey of 2,755 musicians found that most viewed the internet positively, using it for ideas, promotion, advertising, and music sales. However opinions on online file-sharing were diverse, with some seeing it as both good and bad, and not all agreeing with aggressive lawsuits by the record industry.", "llama3.2:3b": "Musicians support internet as a tool for reaching new fans and selling music, contrary to industry's file-sharing tactics. Most saw file-sharing as both good and bad but most agreed it should be illegal. 60% believed lawsuits against downloaders wouldn't benefit musicians, while almost all used the net for ideas, inspiration, promotion, and sales.", "gemma2:2b": "Musicians largely view the internet as a positive tool for promoting their music and selling directly to fans, despite its use in illegal file-sharing being considered a threat by some.  While most musicians believe file-sharing is illegal, they see it more as an opportunity than a hindrance to making money off their music. Independent artists specifically have embraced the internet to bypass traditional record contracts and build direct fan relationships. The majority of musicians agree that illegal downloading hinders new band's success and that the music industry should acknowledge the changes the internet has brought. \n", "qwen2.5:0.5b": "Musicians are embracing the internet as a way of selling more music. Many use the net to promote and advertise their work, offer free samples online, track royalties, and sell their music directly through the web. Some musicians see file-sharing as both good and bad, with 60% stating it benefits them while others disagree. The internet has made it easier for new bands to break into the market without major funding or backing. Many think that the lawsuits against file-sippers could benefit musicians but that the music industry needs to respect changes brought by the web.", "qwen2.5:1.5b": "Musicians in the US study are overwhelmingly positive about the internet as a means of reaching new fans and promoting music sales, with 90% using online platforms. Nearly half promote, advertise, and post music on the web, offer free samples, and sell via the net. They view it as essential for breaking without major funding and finding direct connections with fans. Many see file-sharing as a mixed blessing but believe in its legality and suggest the industry should embrace these changes rather than fight against them.", "qwen2.5:3b": "Musicians view the internet positively, using it for promoting, advertising, and selling their music. They disagree with lawsuits against file-sharing downloaders, seeing it as ineffective for protecting their work. While most believe file-sharing has both positive and negative aspects, many support regulation rather than legal action. Independent musicians utilize the internet to avoid record contracts and reach fans directly. The survey of 2,755 musicians found that almost all use the net for inspiration, promotion, posting music online, offering free samples, and selling their work digitally, with two-thirds selling via the web. Despite differing views on file-sharing, there is a consensus among artists about its impact on income.", "opencoder:1.5b": "Musicians are embracing the internet as a way of reaching new fans and selling more music. A study by US researchers, Pew Internet, suggests that musicians do not agree with the tactics adopted by the music industry against file-sharing. While many disagreed with the lawsuits launched against downloaders, \"Even successful artists don't think the lawsuits will benefit musicians,\" said report author Mary Madden. Independent musicians have embraced the internet to gain inspiration, sell it online, track royalties and reach fans directly. However, opinions about online file-sharing were diverse and not as clear cut as those of the record industry. Through RIAA, it has pursued an aggressive campaign through the courts to argue with artists who believed in copyright law.\n", "smollm:1.7b": "The survey found that most of the musicians surveyed did not agree with the tactics adopted by the record industry against file-sharing. While some saw file-sharing as illegal and a threat to their livelihood, many disagreed with the lawsuits launched against downloaders. The report suggests that while there is no consensus on the issue, most musicians do not think the lawsuits will benefit them directly.\nThe survey found that musicians were overwhelmingly positive about the internet, rather than seeing it as just a threat to their livelihood. Almost all of them used the net for ideas and inspiration, with over 80% offering free samples online. More than 75% sold their music via the net, while two-thirds tracked royalties online. Independent musicians in particular saw the internet as a way to get around the need to land a record contract and reach fans directly.\nThe report suggests that while opinions about online file-sharing were diverse and not as clear cut as those of the record industry, there is no consensus on the issue. While some saw file-sharing as both good and bad, many musicians did not think the lawsuits against song swappers would benefit them directly. Many suggested that rather than fighting file-sharing, the music industry needed to recognize the changes it has brought and embrace it.\nThe survey found that while there is no consensus on the issue, most of the musicians surveyed did not agree with the tactics adopted by the record industry against file-sharing. While some saw file-sharing as illegal and a threat to their livelihood, many disagreed with the lawsuits launched against downloaders. The report suggests that while there is no clear-cut view on the issue, most musicians do not think the lawsuits will benefit them directly.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about musicians embracing the internet. Let me start by reading through the entire passage carefully to understand the main points.\n\nThe first sentence talks about musicians 'upbeat' about using the internet as a way to reach new fans and sell more music. There's a survey conducted by Pew Internet that supports this idea.\n\nThen, the study found that many musicians disagree with some tactics used by the music industry against file-sharing. Some people think these lawsuits won't benefit musicians. The author of the report says even successful artists don't see it as beneficial, especially regarding their profits from sales. However, 60% of musicians and songwriters didn't agree with the lawsuits.\n\nThe survey showed that many musicians use the internet for ideas, promoting their music online. They also sell their music via the net and offer free samples. Independent musicians found it easier to get contracts by using the internet to reach fans directly.\n\nThey compared this to the record industry, which has its own campaigns against file-sharing, but these don't seem to have the same level of public support among musicians.\n\nThe conclusion is that while some see file-sharing as a good thing, especially for independent artists, others aren't convinced. Musicians are more open to using the internet because it helps them make money and get contracts, whereas the record industry's campaign lacks public support.\n\nI need to condense all this into a concise summary without losing key details. I'll start by mentioning that musicians are embracing the internet for reaching new fans and selling music. Then mention the survey found mixed opinions on file-sharing tactics. Highlight the statistics about online use, free samples, and independent musicians' perspectives. End with the public sentiment comparison between musicians and record industry leaders.\n\nI should make sure to include all important points without being too verbose. Let me structure this in a clear, concise way.\n</think>\n\nMusicians are embracing the internet as a means for reaching new fans and selling more music through a survey. Mixed opinions exist about file-sharing tactics used by the music industry, with some finding them beneficial while others disagree, citing difficulties in funding and protecting material from piracy. The study found that many musicians use the internet to promote their work, share ideas online, and offer free samples, though independent musicians view it as easier to land contracts. In contrast, the record industry has its own campaigns against file-sharing, but these do not have widespread public support among musicians.", "tinyllama:1.1b": "The above text provides an analysis of a recent survey conducted by Pew Internet, which highlights the views and perspectives of musicians towards file-sharing on the internet. The report found that while most musicians agree that file-sharing is illlegal, it can be both beneficial and good for them as well. While some artists perceive the laws against file-shaing as detrimental to their careers, others see it as a way to reach new fans and sell more music directly to them. The report suggests that while the music industry is embroiled in debates over copyright infringement, they have not gained widespread support for their campaigns against file-sharing. Instead, many musicians see the internet as an opportunity to promote, advertise and post their music directly to fans, and two-thirds of those surveyed sold their music online. The report highlights that while most artists saw file-shaing negatively, some saw it positively, with almost all independent musicians seeing it as a way to gain inspiration, sell their music via the net, track royalties, learn about copyright and avoid record companies' pursuit through courts. Overall, the survey suggests that while musicians may differ on file-sharing, they are embracing the internet positively and view it not just as a threat to their livelihoods, but also an opportunity for self-expression, promotion, and financial gain.", "tinydolphin:1.1b": " The internet has had a significant impact on the way musicians promote and sell their work. According to a study by Pew Internet, over three-quarters of musicians believe file-sharing is both good and bad. The most positive views were held by independent musicians, with them using the internet to gain inspiration, sell their music online, and track royalties. These results are in line with other research that suggests artists are embracing the internet as a way to reach new fans and increase sales. However, some musicians have mixed opinions about file-sharing, with some seeing it as both a threat and an opportunity to earn more money. The Pew Internet study is just one piece of evidence supporting the idea that the internet has revolutionized the music industry by making it easier for artists to reach their fans directly and gain control over their work.", "phi:2.7b": " The Pew Internet report found that musicians are embracing the internet as a way of reaching new fans and selling more music, despite disagreement with the tactics used by the music industry against file-sharing. Most artists see file-sharing as both good and bad but do not think lawsuits will benefit them. Instead, they believe the music industry should embrace the changes brought about by the internet to make more money from their music.\n", "orca-mini:3b": " Musicians are embracing the internet as a way of reaching new fans and selling more music, according to a survey. However, opinions about online file-sharing were diverse and not as clear cut as those of the record industry. Most artists saw file-sharing as both good and bad, though most agreed that it should be illegal.", "hermes3:3b": "Musicians support internet, positive about it instead of viewing it as threat, despite seeing file-sharing as both good and bad; study found over 80% using internet for ideas, promotion, advertising music online; majority believed lawsuits against downloaders wouldn't benefit musicians.", "stablelm-zephyr:3b": "A survey by Pew Internet found that musicians are positive about the internet and its potential to reach new fans and sell more music. Contrary to the tactics adopted by the music industry against file-sharing, most musicians did not agree with the lawsuits launched against downloaders. Musicians used the net for ideas and inspiration and saw it as a way to promote, advertise, and post their music online. They also offered free samples and sold their music via the internet. While opinions about online file-sharing were diverse, most artists agreed that it should be illegal, but they did not believe the lawsuits against song swappers would benefit musicians and songwriters. Instead, they suggested that the industry needed to recognize the changes brought by the internet and embrace it.", "chatgpt-4o-latest": "Musicians are increasingly using the internet to reach fans and sell music, according to a Pew Internet survey. While most musicians view file-sharing as illegal, many oppose lawsuits against downloaders, believing they do not benefit artists. The survey, conducted among 2,755 musicians, found that independent artists especially see the internet as a way to bypass record labels and connect directly with audiences. Most musicians use the internet for promotion, inspiration, and sales, with many offering free samples and selling music online. Opinions on file-sharing are mixed; while some believe it harms new artists, 60% think lawsuits against file-sharers are ineffective. Many musicians argue that the industry should adapt to digital changes rather than fight them, as the internet has helped them generate income rather than simply enabling piracy.", "stablelm2:1.6b": "Musicians are using the internet to reach new fans and sell more music, according to a survey by Pew Internet. The study found that musicians don't agree with the tactics used by the music industry against file-sharing. While most considered file-sharing as illegal, many disagreed with lawsuits against downloaders. Successful artists do not think lawsuits will benefit musicians. Independent musicians are using the internet for inspiration and promoting their music on it. Two-thirds of them sold their music online. Independent musicians see the internet as a way to get around the need for a record contract. The opinions about online file-sharing were diverse, and most artists agreed that it should be illegal. However, the study suggests that the aggressive campaign against file-sharing by the Recording Industry Association of America might not have the wholehearted backing of musicians in the US.", "granite3.1-dense:2b": "Musicians are enthusiastic about leveraging the internet for fans and sales, according to a 2004 Pew Internet survey of 2,755 musicians, songwriters, and publishers. The study reveals mixed opinions on file-sharing: while most consider it illegal, many believe lawsuits against downloaders will not aid musicians or record labels. Musicians view the internet primarily as a tool for inspiration, promotion, and direct fan interaction, often bypassing traditional record contracts. Over 80% offer free music samples online, and two-thirds sell their work digitally. Despite concerns about file-sharing's impact on new artists' opportunities to succeed without major funding, most musicians agree the internet has enabled them to earn more from their music. A significant portion of respondents suggested that instead of fighting piracy, the industry should adapt to the changes brought by file sharing.", "reference": "The study by US researchers, Pew Internet, suggests musicians do not agree with the tactics adopted by the music industry against file-sharing.\"Both successful and struggling musicians were more likely to say that the internet has made it possible for them to make more money from their music, rather than make it harder for them to protect their material from piracy,\" said Ms Madden.Musicians are embracing the internet as a way of reaching new fans and selling more music, a survey has found.For part of the study, Pew Internet conducted an online survey of 2,755 musicians, songwriters and music publishers via musician membership organisations between March and April 2004.They ranged from full-time, successful musicians to artists struggling to make a living from their music.\"Even successful artists don't think the lawsuits will benefit musicians,\" said report author Mary Madden.\"Musicians are embracing the internet enthusiastically,\" said Ms Madden.Many suggested that rather than fighting file-sharing, the music industry needed to recognise the changes it has brought and embrace it.\"We looked at more of the independent musicians, rather than the rockstars of this industry but that reflects more accurately the state of the music industry,\" Ms Madden told the BBC News website.The survey found that musicians were overwhelming positive about the internet, rather than seeing it as just a threat to their livelihood."}