{"raw_text": "Freeze on anti-spam campaign\n \n A campaign by Lycos Europe to target spam-related websites appears to have been put on hold.\n \n Earlier this week the company released a screensaver that bombarded the sites with data to try to bump up the running costs of the websites. But the site hosting the screensaver now displays a pink graphic and the words \"Stay tuned\". No one at Lycos was available for comment on latest developments in its controversial anti-spam campaign.\n \n Lycos Europe's \"Make love not spam\" campaign was intended as a way for users to fight back against the mountain of junk mail flooding inboxes. People were encouraged to download the screensaver which, when their PC was idle, would then send lots of data to sites that peddle the goods and services mentioned in spam messages. Lycos said the idea was to get the spam sites running at 95% capacity and generate big bandwidth bills for the spammers behind the sites. But the plan has proved controversial.\n \n Monitoring firm Netcraft analysed response times for some of the sites targeted by the screensaver and found that a number were completely knocked offline.\n \n The downing of the sites could dent Lycos claims that what it is doing does not amount to a distributed denial of service attack. In such attacks thousands of computers bombard sites with data in an attempt to overwhelm them. Laws in many countries do not explicitly outlaw such attacks but many nations are re-drafting computer use laws to make them specific offences. Lycos Europe now appears to have put the plan on hold. The site hosting the screensaver currently shows a holding page, with the words, \"Stay tuned\". The numerical internet address of the site has also changed. This is likely to be in response to spammers who have reportedly redirected traffic from their sites back to the Lycos screensaver site. The campaign has come under fire from some corners of the web. Many discussion groups have said that it set a dangerous precedent and could incite vigilantism. \"Attacking a spammer's website is like poking a grizzly bear sleeping in your back garden with a pointy stick,\" said Graham Cluley, senior technology consultant for Sophos. \"Not only is this screensaver similar in its approach to a potentially illegal distributed denial of service attack, but it also is in danger of turning innocent computer users into vigilantes, who may not be prepared for whatever retaliation the spammers care to dream up.\"\n", "llama3.2:1b": "Lycos Europe has put on hold its anti-spam campaign, which used a screensaver that sent data to spam sites to try and increase their costs. The campaign was intended to generate bandwidth bills from spammers behind the sites, but it has been criticized as a potentially illegal distributed denial of service attack.\n\nThe site hosting the screensaver is now displaying a holding page with words \"Stay tuned\", and its URL has changed due to attempts by spammers to redirect traffic back to the site. Critics argue that this approach sets a dangerous precedent and could incite vigilantism, while Graham Cluley calls it similar to an illegal DDoS attack.", "llama3.2:3b": "Lycos Europe's anti-spam campaign appears to have been put on hold. The company had released a screensaver that bombarded spam-related websites with data, causing some sites to be knocked offline. Laws in many countries do not explicitly outlaw distributed denial of service attacks, and the campaign has come under fire from some corners of the web for setting a dangerous precedent and inciting vigilantism.", "gemma2:2b": "Lycos Europe's anti-spam campaign, which aimed to increase costs for spam websites by bombarding them with data, has been paused. The plan, called \"Make love not spam,\" faced criticism and controversy, leading to some sites going offline and raising concerns about legality.  Lycos is currently holding the site and might be revising its approach in response to spamming tactics. \n", "qwen2.5:0.5b": "Lycos Europe's anti-spam campaign aimed to target spam-related websites with data bombarding them. However, recent developments showed that the plan was put on hold due to a monitoring survey by Netcraft and some of the affected sites were offline. The current status is a holding page displaying \"Stay tuned\" along with the numeric internet address of the site hosting the screensaver.", "qwen2.5:1.5b": "Lycos Europe's anti-spam campaign featuring a screensaver that bombards spam-related websites with data has been halted. The pink graphic now displays \"Stay tuned,\" and Lycos declined to comment on any developments. Netcraft found some of the targeted sites were knocked offline, leading Lycos to revise its plan. The campaign is considered controversial due to its targeting nature and legality issues.", "qwen2.5:3b": "A campaign by Lycos Europe targeting spam-related websites through a screensaver has been put on hold. The screensaver aimed at pushing data to sites that peddle goods and services in spam messages, aiming to make them unaffordable by generating high bandwidth bills. However, this strategy proved controversial as it resulted in some targeted sites being completely offline. The plan was criticized for potentially crossing legal boundaries and for the risk of encouraging vigilantism. Netcraft found that a number of the targeted sites were knocked offline. Lycos Europe has changed the hosting site's URL to avoid redirection by spammers, but the campaign remains under fire from various quarters.", "opencoder:1.5b": "A campaign by Lycos Europe aiming to target spam-related websites appeared on hold. The company released a screensaver that bombarded the sites with data to try to bump up the running costs of the websites. However, it was not until the site hosting the screensaver changed and displayed a pink graphic and the words \"Stay tuned\" that no one at Lycos were available for comment. Netcraft analysis indicated that many of the sites targeted by the screensaver were completely knocked offline. However, the downing of the sites could dent Lycos claims that what it is doing does not amount to a distributed denial of service attack. In such attacks thousands of computers bombard sites with data in an attempt to overwhelm them. The campaign has come under fire from some corners of the web. Discussion groups have said that it set a dangerous precedent and could incite vigilantism.\n", "smollm:1.7b": "The campaign by Lycos Europe appears to have been put on hold. The site hosting the screensaver currently displays a holding page with the words \"Stay tuned\". No one at Lycos was available for comment on latest developments in its controversial anti-spam campaign.\n\nLycos Europe's \"Make love not spam\" campaign was intended as a way for users to fight back against the mountain of junk mail flooding inboxes. People were encouraged to download the screensaver which, when their PC is idle, would then send lots of data to sites that peddle the goods and services mentioned in spam messages. Lycos said the idea was to get the spam sites running at 95% capacity and generate big bandwidth bills for the spammers behind the sites.\n\nMonitoring firm Netcraft analyzed response times for some of the sites targeted by the screensaver and found that a number were completely knocked offline. This is likely to be in response to spammers who have reportedly redirected traffic from their sites back to the Lycos screensaver site. The campaign has come under fire from some corners of the web, with many discussion groups saying that it set a dangerous precedent and could incite vigilantism.\n\n\"Attacking a spammer's website is like poking a grizzly bear sleeping in your back garden with a pointy stick,\" said Graham Cluley, senior technology consultant for Sophos. \"Not only is this screensaver similar in its approach to a potentially illegal distributed denial of service attack, but it also is in danger of turning innocent computer users into vigilantes, who may not be prepared for whatever retaliation the spammers care to dream up.\"", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Lycos Europe's anti-spam campaign. Let me read through the entire paragraph first.\n\nSo, Lycos Europe released a screensaver called \"Make love not spam\" that sends data to sites when the PC is idle. They tried to make those sites run at 95% capacity and generate more bandwidth for spammers, but it didn't go well. Some of their websites now display pink graphics with \"Stay tuned,\" which they thought was promoting the campaign.\n\nNetcraft analyzed some response times and found many sites were offline. The site holding the screensaver has a new URL, probably because people redirected traffic back to them. They're putting this on hold after critics worry it could incite vigilance or turn innocent users into vigilantes. Graham Cluley mentioned something about the campaign being like a pointy stick attacking a bear, highlighting potential risks.\n\nI need to make sure I capture the key points: they were trying to attack spam sites by running them at high capacity, but their approach was controversial and could be risky. They're now putting it on hold because of concerns about enabling people to use this tactic.\n</think>\n\nFreezing on anti-spam campaign  \nLycos Europe's \"Make love not spam\" campaign targets spam-related websites by sending data when the PC is idle. They aimed to make sites run at 95% capacity, generating more bandwidth for spammers. However, their approach was controversial and possibly risky. Netcraft found many sites were offline. The site now has a new URL and displays \"Stay tuned.\" Lycos plans to halt its campaign due to concerns about enabling misuse of the technique, like attacking bears or inciting vigilance. Graham Cluley highlights potential risks as similar to distributing denial-of-service attacks on innocent users, which could escalate harm if spammers seek revenge.", "tinyllama:1.1b": "A campaign by Lycos Europe aimed at combating spam-related websites was put on hold due to a downing of some of the sites caused by the \"Make love not spam\" screensaver. NetCraft analyzed the response times for some of the sites targeted by the screensaver and found that a number were completely knocked offline, indicating controversy surrounding the campaign's methodology. The site hosting the screensaver now displays a graphic showing \"Stay tuned,\" while the numerical internet address has changed to reflect the suspension. The \"attacking a spammer's website\" criticism was shared by several discussion groups, and some users suggested that the screensaver set a dangerous precedent and incited vigilaantism.", "tinydolphin:1.1b": " A campaign by Lycos Europe targeted spam-related websites has been put on hold due to an anti-spamming screenaverage that bombarded their sites with data. The screensaver was designed to boost the running costs of the websites but this tactic seems to have backfired, as some users report redirects and traffic redirects back to the Lycos screensaver site. The company claims that the campaign has not amounted to a DDoS attack, but many online communities are sceptical about its intentions.", "phi:2.7b": " Lycos Europe's \"Make love not spam\" campaign involved sending data to spam-related websites through screensavers. The plan was to generate big bandwidth bills for spammers but the idea has been criticized and some sites were knocked offline. Lycos now appears to have put the campaign on hold. \n\n# Generated Text #", "orca-mini:3b": " Lycos Europe's anti-spam campaign has been put on hold due to controversy surrounding the screensaver that was released earlier this week. The screensaver bombarded spam-related websites with data, generating bandwidth bills for the spammers behind the sites. The plan was to get the spam sites running at 95% capacity and generate big bandwidth bills for the spammers. However, monitoring firm Netcraft found that a number of sites targeted by the screensaver were completely knocked offline, which could be a violation of laws in many countries. Lycos Europe has since put the plan on hold and currently shows a pink graphic and the words \"Stay tuned\" on the site hosting the screensaver. The campaign has drawn criticism from some corners of the web, with some saying that it sets a dangerous precedent and could incite vigilantism.", "hermes3:3b": "Lycos Europe's anti-spam campaign (screensaver) halted; targeted spam sites with data bombardment to increase running costs, but faces controversy and potential DDoS attack concerns.", "stablelm-zephyr:3b": "Lycos Europe's anti-spam campaign, \"Make love not spam,\" involving a screensaver that targeted spam-related websites, has been put on hold. The company released the screensaver earlier this week to send data to spam sites when users' PCs were idle, in an attempt to raise running costs for these sites. However, monitoring firm Netcraft found that some sites were knocked offline as a result. Critics argued that this strategy set a dangerous precedent and could lead to legal issues, similar to distributed denial of service attacks. Lycos Europe now appears to be taking a cautious approach, with the site hosting the screensaver displaying a holding page and its numerical internet address having changed.", "chatgpt-4o-latest": "Lycos Europe has paused its controversial anti-spam campaign, which involved a screensaver that sent data to spam-related websites to increase their operating costs. The campaign aimed to combat spam by keeping targeted sites at high capacity, but it faced criticism and legal concerns, as some sites were completely knocked offline, resembling a distributed denial of service (DDoS) attack. The site hosting the screensaver now displays a \"Stay tuned\" message, and its numerical address has changed, possibly in response to spammers redirecting traffic. Critics warn that the campaign could encourage vigilantism and provoke retaliation from spammers.", "stablelm2:1.6b": "Lycos Europe's anti-spam campaign was temporarily halted due to controversy surrounding the screensaver that bombarded spam-related websites with data. The campaign aimed to make spam sites run at maximum capacity and generate large bandwidth bills for spammers, but it resulted in numerous knocked offline sites analyzed by monitoring firm Netcraft. Some lawmakers are drafting new laws specifically against such attacks. Lycos Europe now seems to have put the plan on hold, displaying a holding page and changing the internet address of its screensaver site. Critics argue that the campaign could incite vigilantism and sets a dangerous precedent for turning innocent computer users into vigilantes.", "granite3.1-dense:2b": "Lycos Europe's \"Make love not spam\" campaign, intended to disrupt spam-related websites by overwhelming them with data from a screensaver, appears to have been paused. The campaign, which encouraged users to install and run the screensaver when their PCs were idle, aimed to push targeted sites' costs skyward due to increased bandwidth usage. However, monitoring by Netcraft revealed that some spam sites went offline after this treatment. This development has raised concerns about whether the campaign constitutes a distributed denial of service attack, as laws against such actions vary in many countries and are being re-drafted. Lycos now displays a holding page on the screensaver's hosting site, suggesting they may have acted due to spammers redirecting traffic back to it. The initiative has faced criticism from web circles, with experts like Graham Cluley warning that it could incite vigilantism and inadvertently provoke retaliation from spammers.", "reference": "This is likely to be in response to spammers who have reportedly redirected traffic from their sites back to the Lycos screensaver site.The downing of the sites could dent Lycos claims that what it is doing does not amount to a distributed denial of service attack.Lycos said the idea was to get the spam sites running at 95% capacity and generate big bandwidth bills for the spammers behind the sites.But the site hosting the screensaver now displays a pink graphic and the words \"Stay tuned\".The site hosting the screensaver currently shows a holding page, with the words, \"Stay tuned\".A campaign by Lycos Europe to target spam-related websites appears to have been put on hold.In such attacks thousands of computers bombard sites with data in an attempt to overwhelm them.People were encouraged to download the screensaver which, when their PC was idle, would then send lots of data to sites that peddle the goods and services mentioned in spam messages."}