{"raw_text": "Broadband fuels online change\n \n Fast web access is encouraging more people to express themselves online, research suggests.\n \n A quarter of broadband users in Britain regularly upload content and have personal sites, according to a report by UK think-tank Demos. It said that having an always-on, fast connection is changing the way people use the internet. More than five million households in the UK have broadband and that number is growing fast.\n \n The Demos report looked at the impact of broadband on people's net habits. It found that more than half of those with broadband logged on to the web before breakfast. One in five even admitted to getting up in the middle of the night to browse the web.\n \n More significantly, argues the report, broadband is encouraging people to take a more active role online. It found that one in five post something on the net everyday, ranging from comments or opinions on sites to uploading photographs. \"Broadband is putting the 'me' in media as it shifts power from institutions and into the hands of the individual,\" said John Craig, co-author of the Demos report. \"From self-diagnosis to online education, broadband creates social innovation that moves the debate beyond simple questions of access and speed.\" The Demos report, entitled Broadband Britain: The End Of Asymmetry?, was commissioned by net provider AOL. \"Broadband is moving the perception of the internet as a piece of technology to an integral part of home life in the UK,\" said Karen Thomson, Chief Executive of AOL UK, \"with many people spending time on their computers as automatically as they might switch on the television or radio.\" According to analysts Nielsen//NetRatings, more than 50% of the 22.8 million UK net users regularly accessing the web from home each month are logging on at high speed They spend twice as long online than people on dial-up connections, viewing an average of 1,444 pages per month. The popularity of fast net access is growing, partly fuelled by fierce competition over prices and services.\n", "llama3.2:1b": "Here is a concise summary of the text:\n\n* A quarter of broadband users in Britain regularly upload content and have personal sites.\n* More than half of those with broadband log on to the web before breakfast.\n* Broadband is encouraging people to take an active role online, with one in five posting something daily.\n* This shift is changing how people use the internet and creating new opportunities for social innovation.", "llama3.2:3b": "A quarter of broadband users in Britain regularly upload content and have personal sites, while half log on to the web before breakfast, and one in five browse online at night. Broadband encourages people to take a more active role online, with one in five posting something daily. The internet is becoming an integral part of home life, with many spending time on computers as automatically as they would with TV or radio.", "gemma2:2b": "Broadband internet usage has increased significantly in the UK, leading to more people expressing themselves online.  The report finds that broadband users actively participate in online activities like posting on websites daily and engaging in online research. This shift from passive to active internet use empowers individuals to contribute their thoughts and experiences to public discourse. \n\n\n", "qwen2.5:0.5b": "Broadband is transforming how people use the internet, encouraging more self-expression, engagement with social media, and online education. It's shifting the perception from technology to home life, potentially leading to a shift in internet usage patterns beyond access speeds and speed, making it more about the content users are accessing rather than individual devices.", "qwen2.5:1.5b": "Broadband use is increasing, leading to more internet engagement and personal content creation among users in the UK. More people are using broadband for daily online activities, uploading photos, commenting on sites, and accessing information instantly, as evidenced by a Demos report showing one in five post something every day. This shift is fostering media innovation and individual empowerment.", "qwen2.5:3b": "Broadband access in Britain encourages more content creation and internet usage, with one-quarter of users regularly uploading content and maintaining personal sites. A report by UK think-tank Demos found that more than half of broadband users log on before breakfast and one-fifth even at night. Broadband empowers individuals to take a more active role online, posting daily from comments or photos to self-diagnosis and online education. AOL commissioned the report, titled \"Broadband Britain: The End Of Asymmetry?,\" highlighting that many people use computers as frequently as they turn on traditional media like TV or radio. Analysts estimate over 50% of UK internet users at home access web content at high speeds, spending twice as long online compared to dial-up users viewing an average of 1,444 pages per month. Competition for prices and services fuels this growth in fast net usage.", "opencoder:1.5b": "Broadband fuels online change. Fast web access is encouraging more people to express themselves online, research suggests. A quarter of broadband users in Britain regularly upload content and have personal sites, according to a report by UK think-tank Demos. It said that having an always-on, fast connection is changing the way people use the internet. More than five million households in the UK have broadband and that number is growing fast. The Demos report looked at the impact of broadband on people's net habits. It found that more than half of those with broadband logged on to the web before breakfast. One in five even admitted to getting up in the middle of the night to browse the web. More significantly, argues the report, broadband is encouraging people to take a more active role online. From self-diagnosis to online education, broadband creates social innovation that moves the debate beyond simple questions of access and speed. Broadband is moving the perception of the internet as a piece of technology to an integral part of home life in the UK, with many people spending time on their computers as automatically as they might switch on the television or radio. According to analysts Nielsen//NetRatings, more than 50% of the 22.8 million UK net users regularly accessing the web from home each month are logging on at high speed They spend twice as long online than people on dial-up connections.\n", "smollm:1.7b": "The text above summarizes the main points from the provided text, which focuses on the impact of broadband on online behavior in Britain. The key ideas and details that are preserved include:\n\n1. Broadband fuels online change: The report suggests that having an always-on, fast connection is changing the way people use the internet.\n2. More than quarter of broadband users regularly upload content: A quarter of all broadband users in Britain have a website or blog, which indicates that broadband has enabled more people to express themselves online.\n3. Broadband increases the likelihood of posting on social networks: With fast net access, people are more likely to post their opinions and thoughts on social media platforms like Twitter and Facebook.\n4. Broadband is encouraging people to take an active role in online activities: The report argues that broadband has shifted power from institutions and into the hands of individuals, allowing them to participate more actively in online discussions and communities.\n5. Broadband is changing the way people use the internet: The report suggests that broadband has enabled people to access a wider range of content and services online, which is contributing to changes in online behavior and activity.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely while preserving key ideas and details. Let me start by reading through the text carefully.\n\nThe first sentence mentions that broadband fuels online change. Then it talks about the Fast Web Access encouraging more people to express themselves online. A report from the UK think-tank called Demos says a quarter of British broadband users upload content regularly, logging in at high speeds, especially before breakfast and at night. They spend twice as long online compared to those on dial-up.\n\nThe Demos report found that 50% of internet users at home with broadband log on to the web during their lunch break, which is more frequent than before. It also mentions that using the internet has encouraged people to take a more active role online. They upload photos and comments on sites like Facebook or Twitter, even as fast access grows because of price competition. There's an article about this called \"Broadband Britain: The End Of Asymmetry?\" by AOL.\n\nI should keep only the summary without any extra explanations or formatting. So I'll list each key point in a short sentence, making sure to include all important details like the impact on net habits, high-speed usage before and after bed, increased participation in online activities, and the reasons behind the shift towards fast access.\n</think>\n\nBroadband fuels online change  \nFast web access is fostering more global interaction. A report by the UK think-tank Demos reveals that a quarter of British broadband users upload content regularly, logging in at high speeds before breakfast and at night. They spend twice as long online as on dial-up connections, viewing an average of 1,444 pages per month. Broadband has encouraged people to take an active role online, with half logging on during lunch break and uploading photos or comments. The rise in fast net access is driven by high-speed internet's ability to transform personal lives, according to a report by net provider AOL UK.", "tinyllama:1.1b": "Based on the research conducted by UK think tank DemoS, people in Britain are increasingly expressing themselves online using broadband, with a quarter logging on to the web before breakfast and nearly five million households having broadband. The report claims that more than half of those with broadband post something on the net every day, including uploading photographs and commenting on sites. The report suggests that broadband is encouraging people to take a more active role online and moves the perception of the internet from an \"asymmetrical\" relationship to a key part of home life in the UK.", "tinydolphin:1.1b": " In recent years, broadband has played a critical role in changing the way people use the internet. With access to faster connections, individuals can not only access information and content more easily but also express themselves through various forms of online communication such as blogging, social networking and personal websites. The impact of broadband on people's habits is significant: nearly half of households have broadband, and one in five even admitted to logging onto the web before going to bed. This shift in power from institutions to individuals has brought about a new level of innovation and social change in the way people access and interact with the internet.", "phi:2.7b": " Broadband allows more people to express themselves online and take a more active role in the internet. One quarter of British broadband users regularly upload content or have personal sites. More than five million households in the UK have broadband, with more people using the internet before breakfast and even getting up in the middle of the night to browse. The report argues that broadband is shifting power from institutions to individuals, allowing them to engage in social innovation beyond questions of access and speed. AOL commissioned the report, which found that broadband users spend twice as long online per month than those on dial-up connections and view an average of 1,444 pages.\n", "orca-mini:3b": " Broadband usage is encouraging more people to express themselves online, with a quarter of British broadband users regularly uploading content and having personal sites. This shift towards active participation online is attributed to the growing popularity of fast internet access, which has led to more people logging on to the web before breakfast and one in five even admitting to getting up in the middle of the night to browse the web. The Demos report found that more than half of those with broadband logged on to the web before breakfast, while one in five post something on the net every day, ranging from comments or opinions on sites to uploading photographs. This shift towards social innovation and power from institutions into the hands of individuals has been labeled as \"Broadband Britain: The End Of Asymmetry?\". As a result, broadband is now seen as an integral part of home life in the UK, with many people spending time on their computers as automatically as they would switch on the television or radio.", "hermes3:3b": "Broadband users more likely to create online content, as it encourages active internet usage and shifts power from institutions to individuals. Over 20m UK households with broadband, increasing rapidly; many use it before breakfast and throughout day for various activities like self-diagnosis, education etc.", "stablelm-zephyr:3b": "Broadband is encouraging more people to use the internet regularly, with a quarter of UK broadband users uploading content or having personal sites. Fast connections are changing how people use the internet, with over half logging on before breakfast and one in five using it at night. Broadband has led to increased participation online, with many people posting daily updates ranging from opinions to photographs. This shift toward individual involvement is seen as social innovation driven by broadband access, leading to a perception of the internet as an integral part of home life in the UK.", "chatgpt-4o-latest": "Broadband internet is transforming online behavior in the UK, encouraging more people to actively engage by uploading content and maintaining personal sites. A report by think-tank Demos found that broadband users log on more frequently, with over half accessing the web before breakfast and one in five posting content daily. The report highlights broadband’s role in shifting media power to individuals, fostering social innovation in areas like self-diagnosis and online education. Commissioned by AOL, the study suggests broadband is becoming an integral part of home life, with high-speed users spending twice as long online as dial-up users. The growing popularity of broadband is driven by increasing competition over prices and services.", "stablelm2:1.6b": "Broadband encourages online expression and change in internet usage patterns, with a quarter of UK broadband users uploading content and having personal sites. A report by Demos suggests that broadband shifts power from institutions to individuals and influences net habits, including logging onto the web before breakfast and participating in social media daily. Analysts predict that broadband usage is growing rapidly due to competition over prices and services.", "granite3.1-dense:2b": "Broadband adoption in the UK is surging, with over five million households now connected, and this trend is transforming internet usage. A report by UK think-tank Demos reveals that 25% of broadband users regularly upload content to personal websites, indicating a shift from passive browsing to active engagement online. More than half of broadband users start their internet use before breakfast, and one in five admits to waking up at night for web browsing. One-fifth of broadband households post daily content, ranging from comments to photographs. The report highlights that broadband empowers individuals by enabling social innovation and democratizing media, moving the internet beyond mere access and speed. Analyst Nielsen//NetRatings confirms this trend, reporting that over 50% of UK net users spend more than twice as much time online as dial-up users, viewing an average of 1,444 pages per month. This growth is driven by intense competition in pricing and services.", "reference": "More than five million households in the UK have broadband and that number is growing fast.The Demos report looked at the impact of broadband on people's net habits.More significantly, argues the report, broadband is encouraging people to take a more active role online.The Demos report, entitled Broadband Britain: The End Of Asymmetry?, was commissioned by net provider AOL.A quarter of broadband users in Britain regularly upload content and have personal sites, according to a report by UK think-tank Demos.Fast web access is encouraging more people to express themselves online, research suggests."}