{"raw_text": "Games win for Blu-ray DVD format\n \n The next-generation DVD format Blu-ray is winning more supporters than its rival, according to its backers.\n \n Blu-ray, backed by 100 firms including Sony, is competing against Toshiba and NEC-backed HD-DVD to be the format of choice for future films and games. The Blu-Ray Association said on Thursday that games giants Electronic Arts and Vivendi would both support its DVD format. The next generation of DVDs will hold high-definition video and sound. This offers incredible 3D-like quality of pictures which major Hollywood studios and games publishers are extremely keen to exploit in the coming year. In a separate press conference at the Consumer Electronics Show in Las Vegas, Toshiba announced that DVD players for its technology would be on the market by the end of 2005.\n \n \"As we move from standard definition video images to high-definition images, we have a much greater need for storage,\" Richard Doherty, from Panasonic's Hollywood Laboratories, one of the pioneers of Blu-ray, told the BBC news website. \"So by utilising blue laser-based technology we can make an optical laser disc that can hold six times as much as today's DVD.\" A Blu-ray disc will be able to store 50GB of high-quality data, while Toshiba's HD-DVD will hold 30GB. Mr Doherty added that it was making sure the discs could satisfy all high-definition needs, including the ability to record onto the DVDs and smaller discs to fit into camcorders. Both Toshiba and Blu-ray are hopeful that the emerging DVD format war, akin to the Betamax and VHS fight in the 1980s, can be resolved over the next year when next-generation DVD players start to come out. When players do come out, they will be able to play standard DVDs too, which is good news for those who have huge libraries of current DVDs.\n \n But the support from Vivendi and Electronics Arts is a big boost to Blu-ray in the battle for supremacy.\n \n Gaming is a $20 billion industry worldwide, so is as crucial as the film industry in terms of money to be made. \"The technical requirement for game development today demands more advanced optical-disc technologies,\" said Michael Heilmann, chief technology officer for Vivendi Universal. \"Blu-ray offers the capacity, performance and high-speed internet connectivity to take us into the future of gaming.\" EA, a leading games developer and publisher, added that the delivery of high-definition games of the future was vital and Blu-ray had the capacity, functionality and interactivity needed for the kinds of projects it was planning. Sony recently announced it would be using the technology in its next generation of PlayStations. Mr Doherty said gamers were \"ravenous\" for high-quality graphics and technology for the next generation of titles. \"Gamers, especially those working on PCs, are always focused on more capacity to deliver textures, deeper levels, for delivering higher-resolution playback.\"\n \n He added: \"The focus for games moving forward on increased immersion.\n \n \"Gaming companies really like to focus on creating a world which involves creating complicated 3D models and textures and increasing the resolution, increasing the frame rate - all of these are part of getting a more immersive experience.\" Fitting these models on current DVD technologies means compressing the graphics so much that much of this quality is lost. As games move to more photo-real capability, the current technology is limiting. \"They are thrilled at the advanced capacity to start to build these immersive environments,\" said Mr Doherty. Currently, graphics-intensive PC games also require multiple discs for installation. High-definition DVDs will cut down on that need. Likewise, consoles rely on single discs, so DVDs that can hold six times more data mean much better, high-resolution games. Blu-ray has already won backing from major Hollywood studios, such as MGM Studios, Disney, and Buena Vista, as well as top technology firms like Dell, LG, Samsung and Phillips amongst others. While Toshiba's HD-DVD technology has won backing from Paramount, Universal and Warner Bros. \"The real world benefits (of HD-DVD) are apparent and obvious,\" said Jim Cardwell, president of Warner Home Video. Mr Cardwell added that rapid time to market and dependability were significant factors in choosing to go with HD-DVD. Both formats are courting Microsoft to be the format of choice for the next generation Xbox, but discussions are still on-going. Next generation DVDs will also be able to store images and other data. CES is the largest consumer electronics show in the world, and runs from 6 to 9 January.\n", "llama3.2:1b": "Games win for Blu-ray DVD format because it has gained more supporters than its rival HD-DVD. The Blu-Ray Association backs games giants Electronic Arts and Vivendi, while Toshiba supports both formats. Blu-ray offers high-definition video and sound, resulting in 3D-like quality of pictures that major studios and publishers are keen to exploit for upcoming films and games. Toshiba plans to release DVD players by the end of 2005. Both Blu-ray and HD-DVD discs can store six times as much data as current DVDs, with Blu-ray holding 50GB of high-quality data. The support from Vivendi and Electronic Arts is a boost to Blu-ray in its battle for supremacy.", "llama3.2:3b": "Blu-ray DVD wins more supporters than its rival HD-DVD as it gains backing from Electronic Arts and Vivendi for its high-definition video and sound capabilities. The technology offers six times more storage capacity, with a single disc able to hold 50GB of data, compared to Toshiba's 30GB. Gaming industry giants such as EA and Vivendi say the format is crucial for delivering high-definition games and immersive experiences. Major Hollywood studios and top technology firms also back Blu-ray, while Toshiba relies on rapid time to market and dependability for its HD-DVD format.", "gemma2:2b": "Blu-ray DVD format is gaining support over HD-DVD for future films and games, driven by its ability to store high-definition content with six times the capacity of current DVDs.  Electronic Arts and Vivendi, major gaming companies, have pledged their support for Blu-ray's capacity for immersive 3D graphics and high-resolution games. This technology will benefit gamers seeking larger game worlds, improved graphics, and higher frame rates. Major studios like Sony and Microsoft are involved in the competition for next-generation DVD players and Xbox format.  \n", "qwen2.5:0.5b": "Blu-ray has won support from major movie studios, such as MGM Studios, Disney, and Buena Vista, as well as top technology firms like Dell, LG, Samsung and Phillips amongst others. Its video storage capacity is expected to be around six times that of a DVD. It will also hold high-definition videos and sound with 3D-like quality which Hollywood studios and game publishers are interested in developing over the next year.", "qwen2.5:1.5b": "Blu-ray wins support from major game developers and publishers, while Toshiba's HD-DVD faces competition with Sony's next-gen PlayStation technology. Blu-ray format will offer high-definition video and sound capabilities for better gaming experiences, reducing the need for multiple discs in PCs and consoles. Both formats are supported by Hollywood studios and leading technology firms, including Microsoft discussions ongoing.", "qwen2.5:3b": "Games win for Blu-ray DVD format\n\nThe Blu-ray format, backed by 100 companies including Sony, is gaining support over rival HD-DVD championed by Toshiba and NEC. Blu-ray supports high-definition video with six times more storage than current DVDs, appealing to major Hollywood studios and game publishers like EA and Vivendi. Blu-ray's blue laser technology offers superior capacity, functionality for gaming needs, and will be compatible with existing DVDs. While Toshiba also secured backing from Paramount, Universal, and Warner Bros., EA and Vivendi's support bolstered Blu-ray’s position in the format war. Both formats are under consideration by Microsoft for the next-generation Xbox.", "opencoder:1.5b": "\"Blu-ray, backed by 100 firms including Sony, is competing against Toshiba and NEC-backed HD-DVD to be the format of choice for future films and games.\" \n\n\"Games win for Blu-ray DVD format.\"\n\n\"The next-generation DVD format Blu-ray is winning more supporters than its rival,\" as announced by its backers.\n\n\"Blu-ray, backed by 100 firms including Sony, is competing against Toshiba and NEC-backed HD-DVD to be the format of choice for future films and games.\" \n\n\"In a separate press conference at the Consumer Electronics Show in Las Vegas, Toshiba announced that DVD players for its technology would be on the market by the end of 2005. The DVD players for this technology are expected to start making it onto the market by the end of 2005.\"\n\n\"The emerging DVD format war, akin to the Betamax and VHS fight in the 19th century, can be resolved over the next year when next-generation DVD players start to come out.\" \n\n\"When players do come out, they will be able to play standard DVDs too, which is good news for those who have huge libraries of current DVDs.\"\n\n\"The support from Vivendi and Electronics Arts is a big boost to Blu-ray in the battle for supremacy. \"As we move from standard definition video images to high-definition images, we have a much greater need for storage,\" said Richard Doherty, from Panasonic's Hollywood Laboratories.\" \n\n\"Blu-ray offers the capacity, performance and high-speed internet connectivity to take us into the future of gaming.\" \n\n\"The technical requirement for game development today demands more advanced optical-disc technologies,\" as explained by Michael Heilmann. \n\n\"EA, a leading games developer and publisher, added that the delivery of high-definition games of the future was vital and Blu-ray had the capacity, functionality and interactivity needed for the kinds of projects it was planning.\" \n\n\"The focus for games moving forward on increased immersion.\"\n\n\"Gaming companies really like to focus on creating a world which involves creating complicated 3D models and textures and increasing the resolution, increasing the frame rate - all of these are part of getting a more immersive experience.\" \n\n\"This signifies that more advanced optical-disc technologies have been incorporated in gaming technology for better high-definition gaming. \"The gamers are ravenous for high-quality graphics and technology for the next generation of titles.\"\n", "smollm:1.7b": "Summarize the following text concisely, preserving key ideas and details.  \nThe next-generation DVD format Blu-ray is winning more supporters than its rival, according to its backers. Games win for Blu-ray, backed by 100 firms including Sony, are competing against Toshiba and NEC-backed HD-DVD to be the format of choice for future films and games publishers are extremely keen to exploit in the coming year. In a separate press conference at the Consumer Electronics Show in Las Vegas, Toshiba announced that DVD players for its technology would be on the market by the end of 2005. Mr Doherty said Blu-ray was making sure it could meet the demands of game developers and publishers. He added: \"The focus for games moving forward on increased immersion. They are thrilled at the advanced capacity to start to build these immersive environments.\" While Toshiba's HD-DVD technology has won backing from major Hollywood studios, such as MGM Studios, Disney, and Warner Bros., discussions are still on-going between the two formats. Next generation DVDs will also be able to store images and other data. CES is the largest consumer electronics show in the world, and runs from 6 to 9 January.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Blu-ray DVD winning support over HD-DVD. Let me read through the provided text first.\n\nThe main points seem to be: Blu-ray being supported by 100 companies including Sony and electronic giants, it's competing with Toshiba and NEC for future films and games. It supports high-definition video and sound, which is needed for major studios like Hollywood. The press conference mentioned that blue laser tech can hold six times as much as standard DVDs. Both players aim to get the market in a year after next-gen DVD players come out.\n\nVivendi and Electronics Arts are boosting Blu-ray support because they're crucial to the industry. Gaming companies, especially those on PCs, want better graphics and immersion. The main concern is that current methods lose quality for high-res games.\n\nI should make sure I capture all these key points concisely without adding any extra information or details. Let me organize them into a clear summary.\n</think>\n\nThe next-generation DVD format Blu-ray is leading support over HD-DVD, competing with Toshiba and NEC in the market. It supports high-definition video and sound for future films and games, particularly appealing to Hollywood studios. The press conference highlighted blue laser technology that can hold six times more data than standard DVDs. Both players aim to gain dominance within a year after emerging DVD players become available. Vivendi and Electronics Arts are key in this rivalry, boosting Blu-ray's market. Gaming companies, especially those on PCs, value advanced graphics and immersive environments. The main concern is quality loss due to current methods, where high-resolution games struggle to maintain their photo-realism.", "tinyllama:1.1b": "Game developers and publishers have already expressed their support for Blu-ray format as the next-generation DVD format for high-definition video and sound. The backers include Sony, Electronic Arts (EA), Vivendi Universal, and major Hollywood studios like MGM Studios, Disney, Buena Visita, Deluxe, LG, Samsonung, and Phillips. \n\nThe Blu-ray Association, which represents 100 firm backers including Sony, has announced the support of several game developers and publishers such as Electronic Arts and Vivendi. Gamers are \"ravenoous\" for high-quality graphics and technology for the next generation of titles, and game developers have been focusing on creating more immersive experiences through complex 3D models and texture mapping. Blu-ray's ability to hold six times more data than current DVDs is a major advantage in terms of storage, making it the preferred format for consoles and high-definition TV. Support from Hollywood studios like Paramount, Universal, Warner Brothers, and Sony, as well as top technology firms like Deluxe, LG, Samsonung, and Phillips has also boosted Blu-ray's chances of winning over the gaming industry. As for Microsoft, it is considering supporting both formats for the next generation Xbox, but discussions are still ongoing.", "tinydolphin:1.1b": " Dolphin: Innovative Blu-ray DVD technology has emerged that not only wins for movie studios but also for games publishers. The next generation of DVDs will be capable of holding high-definition video and sound, offering incredible 3D-like quality for future films and games. The backers of Blu-ray are leading the charge for this technology.", "phi:2.7b": " The battle between Blu-ray DVD and HD-DVD for future films and games is heating up. With major Hollywood studios and games publishers supporting the use of high-definition DVDs, Blu-ray has gained momentum with backing from Electronic Arts and Vivendi. The next generation of DVDs will have higher storage capacity than current DVDs, which can hold up to 50GB of data compared to 30GB for HD-DVD. Both formats are hoping that the DVD format war can be resolved before the release of next-generation DVD players in 2005. High-definition gaming is a $20 billion industry and requires advanced optical-disc technologies like Blu-ray. Sony has already announced plans to use the technology in its next generation of PlayStations, while game developers and publishers are excited about the capacity, performance, and interactivity offered by Blu-ray. The focus for games moving forward will be creating immersive environments with complex 3D models and textures, which is made possible by high-definition DVDs. With support from major Hollywood studios and technology firms like Dell, LG, Samsung, Philips, Paramount, Universal, and Warner Bros., it seems that both formats are courting Microsoft to be the format of choice for the next generation Xbox. High-definition DVDs will not only allow for higher-resolution playback but also store images and other data. The Consumer Electronics Show (CES) in Las Vegas is a major consumer electronics show where these technologies are presented and showcased.\n", "orca-mini:3b": " Next-generation DVD formats Blu-ray and HD-DVD are competing for support from major Hollywood studios and technology firms. Blu-ray is winning more supporters than its rival, according to its backers. Gaming is a $20 billion industry worldwide and requires more advanced optical-disc technologies. High-definition games of the future are crucial and Blu-ray has the capacity, functionality and interactivity needed for such projects. Both formats are courting Microsoft to be the format of choice for the next generation Xbox but discussions are still on-going. Next generation DVDs will also be able to store images and other data. CES is the largest consumer electronics show in the world, and runs from 6 to 9 January.", "hermes3:3b": "Blu-ray DVD format wins support from gaming companies Electronic Arts and Vivendi over HD-DVD for next-generation high-definition storage and better graphics for games.", "stablelm-zephyr:3b": "Blu-ray format, backed by over 100 companies including Sony, is gaining more supporters than its rival, HD-DVD, according to the Blu-Ray Association. The next generation of DVDs will hold high-definition video and sound, offering incredible 3D-like quality of pictures. Major Hollywood studios and games publishers are keen to exploit this in the coming year. Electronic Arts and Vivendi have now supported Blu-ray, which is crucial for the gaming industry as it demands more advanced optical-disc technologies. Both Toshiba and Blu-ray are hoping that the DVD format war can be resolved over the next generation of players, which will also be able to play standard DVDs.", "chatgpt-4o-latest": "Blu-ray, backed by Sony and 100 other firms, is gaining more industry support than its rival HD-DVD, backed by Toshiba and NEC. Major gaming companies Electronic Arts and Vivendi have endorsed Blu-ray, citing its superior storage capacity (50GB vs. HD-DVD's 30GB) and ability to support high-definition gaming. The gaming industry, worth $20 billion, sees Blu-ray as essential for delivering high-quality, immersive experiences. Sony plans to use Blu-ray in its next PlayStation, and major Hollywood studios like MGM, Disney, and Buena Vista also support the format. Meanwhile, HD-DVD has backing from Paramount, Universal, and Warner Bros., emphasizing its reliability and faster market entry. Both formats are vying for Microsoft's support for the next Xbox. The competition between Blu-ray and HD-DVD mirrors the Betamax-VHS format war of the 1980s, with next-generation DVD players expected to resolve the battle when they launch.", "stablelm2:1.6b": "Blu-ray DVD format is gaining more supporters than HD-DVD, as it backed by major firms including Sony. The next-gen DVDs will hold high-definition video and sound, with a Blu-Ray disc capable of storing 1GB data compared to Toshiba's HD-DVD at 2GB. Both formats are now targeting Microsoft for the next generation Xbox. This battle between the two formats emerged as gaming is a $B billion industry worldwide, crucial to the film industry in terms of money generated. High-Definition DVDs will cut down on installation disc needs, making room for more data storage space and high-quality graphics.", "granite3.1-dense:2b": "Blu-ray, backed by 100 firms including Sony and supported by major gaming companies like Electronic Arts and Vivendi, is gaining ground over its rival HD-DVD (backed by Toshiba and NEC). Blu-ray's DVD format will store high-definition video and sound, offering superior 3D-like quality that appeals to Hollywood studios and game publishers. The format can hold 50GB of data, six times more than current DVDs (30GB for HD-DVD), allowing for larger file sizes and better storage for high-definition games and movies. This advancement is crucial due to the growing $20 billion gaming industry's need for more advanced optical disc technologies. Gamers are eager for increased immersion through higher-resolution graphics, detailed textures, and deeper levels, which current DVDs can't fully accommodate without significant compression, leading to loss of visual quality. Blu-ray is also supported by major Hollywood studios such as MGM Studios, Disney, and Buena Vista. While Toshiba's HD-DVD has backing from Paramount, Universal, and Warner Bros., the upcoming release of next-generation DVD players, compatible with both formats, is expected to drive consumer adoption. The battle for supremacy in this emerging DVD format war mirrors the 1980s Betamax vs. VHS conflict, with resolution expected within a year as players hit the market.", "reference": "The Blu-Ray Association said on Thursday that games giants Electronic Arts and Vivendi would both support its DVD format.Mr Doherty said gamers were \"ravenous\" for high-quality graphics and technology for the next generation of titles.The next generation of DVDs will hold high-definition video and sound.Both Toshiba and Blu-ray are hopeful that the emerging DVD format war, akin to the Betamax and VHS fight in the 1980s, can be resolved over the next year when next-generation DVD players start to come out.Next generation DVDs will also be able to store images and other data.EA, a leading games developer and publisher, added that the delivery of high-definition games of the future was vital and Blu-ray had the capacity, functionality and interactivity needed for the kinds of projects it was planning.Blu-ray, backed by 100 firms including Sony, is competing against Toshiba and NEC-backed HD-DVD to be the format of choice for future films and games.A Blu-ray disc will be able to store 50GB of high-quality data, while Toshiba's HD-DVD will hold 30GB.\"So by utilising blue laser-based technology we can make an optical laser disc that can hold six times as much as today's DVD.\"Sony recently announced it would be using the technology in its next generation of PlayStations.In a separate press conference at the Consumer Electronics Show in Las Vegas, Toshiba announced that DVD players for its technology would be on the market by the end of 2005.Fitting these models on current DVD technologies means compressing the graphics so much that much of this quality is lost.As games move to more photo-real capability, the current technology is limiting.Mr Doherty added that it was making sure the discs could satisfy all high-definition needs, including the ability to record onto the DVDs and smaller discs to fit into camcorders."}