{"raw_text": "Freeze on anti-spam campaign\n \n A campaign by Lycos Europe to target spam-related websites appears to have been put on hold.\n \n Earlier this week the company released a screensaver that bombarded the sites with data to try to bump up the running costs of the websites. But the site hosting the screensaver now displays a pink graphic and the words \"Stay tuned\". No one at Lycos was available for comment on latest developments in its controversial anti-spam campaign.\n \n Lycos Europe's \"Make love not spam\" campaign was intended as a way for users to fight back against the mountain of junk mail flooding inboxes. People were encouraged to download the screensaver which, when their PC was idle, would then send lots of data to sites that peddle the goods and services mentioned in spam messages. Lycos said the idea was to get the spam sites running at 95% capacity and generate big bandwidth bills for the spammers behind the sites. But the plan has proved controversial.\n \n Monitoring firm Netcraft analysed response times for some of the sites targeted by the screensaver and found that a number were completely knocked offline.\n \n The downing of the sites could dent Lycos claims that what it is doing does not amount to a distributed denial of service attack. In such attacks thousands of computers bombard sites with data in an attempt to overwhelm them. Laws in many countries do not explicitly outlaw such attacks but many nations are re-drafting computer use laws to make them specific offences. Lycos Europe now appears to have put the plan on hold. The site hosting the screensaver currently shows a holding page, with the words, \"Stay tuned\". The numerical internet address of the site has also changed. This is likely to be in response to spammers who have reportedly redirected traffic from their sites back to the Lycos screensaver site. The campaign has come under fire from some corners of the web. Many discussion groups have said that it set a dangerous precedent and could incite vigilantism. \"Attacking a spammer's website is like poking a grizzly bear sleeping in your back garden with a pointy stick,\" said Graham Cluley, senior technology consultant for Sophos. \"Not only is this screensaver similar in its approach to a potentially illegal distributed denial of service attack, but it also is in danger of turning innocent computer users into vigilantes, who may not be prepared for whatever retaliation the spammers care to dream up.\"\n", "llama3.2:1b": "A campaign by Lycos Europe to target spam-related websites has been put on hold. The screensaver that tried to send data to sites to generate high bandwidth bills was launched earlier this week but now displays a pink graphic and says \"Stay tuned\". Netcraft found that some of the targeted sites were completely knocked offline, leading some to question whether Lycos Europe is engaging in an illegal distributed denial of service attack. The campaign has faced criticism from online security experts, who warn that it could set a dangerous precedent and lead to vigilantism.", "llama3.2:3b": "Lycos Europe's anti-spam campaign appears to have been put on hold after its screensaver caused a backlash. The campaign aimed to flood spam sites with data to generate high bandwidth bills, but monitoring firm Netcraft found that many sites were knocked offline, raising concerns about the legality of such actions. Critics argue it set a dangerous precedent and could incite vigilantism, comparing it to a potentially illegal distributed denial of service attack.", "gemma2:2b": "Lycos Europe's anti-spam campaign, which used screensavers to increase spammer costs, has been put on hold. The campaign faced criticism due to its potential impact on website availability and its association with potential illegal attacks. A holding page now appears at the site hosting the screensaver. \n", "qwen2.5:0.5b": "Lycos Europe announced a campaign to target spam-related websites and display screensavers with data to bump their running costs. However, Lycos Europe's previous screensaver displayed pink text instead of images and words indicating that the site was offline. The company has now decided to stop its campaign.", "qwen2.5:1.5b": "A freeze on an anti-spam campaign by Lycos Europe has been implemented after problems were found with targeted sites. The screensaver that previously bombarded spam-related websites was no longer available, displaying a pink graphic and saying \"Stay tuned\" instead. This move suggests the campaign may be put on hold due to controversy.", "qwen2.5:3b": "A campaign by Lycos Europe to target spam-related websites through a screensaver that sent data to targeted sites has been put on hold. The site hosting the screensaver now displays \"Stay tuned\" and shows a pink graphic, with monitoring firm Netcraft finding some sites completely knocked offline due to response times being affected. Lycos Europe is likely responding to potential legal issues regarding distributed denial of service attacks in countries where such actions might be illegal or soon will be. The campaign has faced criticism for potentially setting a dangerous precedent and encouraging vigilantism, with critics like Graham Cluley from Sophos warning it may lead to retaliatory attacks against innocent users who inadvertently participate due to lack of preparation.", "opencoder:1.5b": "The summary preserves key details about the anti-spam campaign by Lycos Europe. It summarizes its objective as a way to fight spam-related websites and explains how it was put on hold in the past, including the monitoring firm's analysis of response times and potential attacks.\n", "smollm:1.7b": "The campaign by Lycos Europe appears to have been put on hold. The site hosting the screensaver currently displays a holding page with the words \"Stay tuned\". No one at Lycos was available for comment on latest developments in its controversial anti-spam campaign.\n\nLycos Europe's campaign, which aimed to target spam-related websites and generate big bandwidth bills for the spammers behind them, appears to have been put on hold. The site hosting the screensaver now displays a pink graphic and the words \"Stay tuned\". No one at Lycos was available for comment on latest developments in its anti-spam campaign.\n\nMonitoring firm Netcraft analyzed response times for some of the sites targeted by the screensaver and found that a number were completely knocked offline. This suggests that the campaign may have been successful in generating traffic, but not necessarily in achieving its intended goals.\n\nThe downing of the sites could dent Lycos claims that what it is doing does not amount to a distributed denial of service attack. In such attacks thousands of computers bombard sites with data in an attempt to overwhelm them. Laws in many countries do not explicitly outlaw such attacks, but many nations are re-drafting computer use laws to make them specific offences. Lycos Europe now appears to have put the plan on hold. The site hosting the screensaver currently shows a holding page, with the words \"Stay tuned\". The numerical internet address of the site has also changed. This is likely to be in response to spammers who have reportedly redirected traffic from their sites back to the Lycos screensaver site.\n\nThe campaign by Lycos Europe appears to have been put on hold. The site hosting the screensaver currently displays a holding page with the words \"Stay tuned\". No one at Lycos was available for comment on latest developments in its anti-spam campaign.\n\nLycos Europe's campaign, which aimed to target spam-related websites and generate big bandwidth bills for the spammers behind them, appears to have been put on hold. The site hosting the screensaver now displays a pink graphic and the words \"Stay tuned\". No one at Lycos was available for comment on latest developments in its anti-spam campaign.\n\nMonitoring firm Netcraft analyzed response times for some of the sites targeted by the screensaver and found that a number were completely knocked offline. This suggests that the campaign may have been successful in generating traffic, but not necessarily in achieving its intended goals.\n\nThe downing of the sites could dent Lycos claims that what it is doing does not amount to a distributed denial of service attack. In such attacks thousands of computers bombard sites with data in an attempt to overwhelm them. Laws in many countries do not explicitly outlaw such attacks, but many nations are re-drafting computer use laws to make them specific offences. Lycos Europe now appears to have put the plan on hold. The site hosting the screensaver currently shows a holding page, with the words \"Stay tuned\". The numerical internet address of the site has also changed. This is likely to be in response to spammers who have reportedly redirected traffic from their sites back to the Lycos screensaver site.\n\nThe campaign by Lycos Europe appears to have been put on hold. The site hosting the screensaver now displays a holding page with the words \"Stay tuned\". No one at Lycos was available for comment on latest developments in its anti-spam campaign.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help the user summarize this text. Let me read through it carefully.\n\nSo, the main point seems to be about Lycos Europe's anti-spam campaign. They released a screensaver that sends data to spam sites, aiming to make them run at high speed and cost others money. But they're facing backlash.\n\nI should focus on the key points: the shutdown of the campaign, the issue with how it's monitoring, mentions Netcraft analysis showing some sites are offline, and the controversy from Graham Cluley.\n\nI need to keep only the summary without explanations or formatting. So just plain text.\n</think>\n\nFreeze on anti-spam campaign \n\nA Lycos Europe screensaver aimed at attacking spam sites has been put on hold. The screensaver was designed to download data to spam sites, making them run at high speed and generate bills. However, Netcraft analysis showed some targeted sites were offline, potentially detaching the campaign from its original intent of preventing distributed denial-of-service attacks. Graham Cluley, a senior consultant for Sophos, criticized the approach as risky, comparing it to illegal DDoS attacks that could turn innocent users into vigilantes with little preparation.", "tinyllama:1.1b": "Freeze on anti-spam campaign after screening tool shows no results to targeted websites. The Lycos Europe campaign was launched as a way to combat the mountain of junk mail flooding inboxes, but it has now been put on hold after spammer redirects traffic back to screensaver site. Some discussion groups criticized the campaign for setting a dangerous precedent and inciting vigilaantism. The screensaver targeted innocent computer users as vigilaent, with some sites being completely knocked offline.", "tinydolphin:1.1b": " Freeze on anti-spam campaign: In response to recent controversies regarding Lycos Europe's \"Make Love Not Spam\" campaign, the company has decided to pause its anti-spam efforts temporarily. The campaign was intended as a way for users to fight back against the mountain of junk mail flooding their inboxes. However, Lycos Europe faced backlash from some corners of the web when it used data to target spam websites and the company now appears to have put the plan on hold. Many discussion groups are expressing concerns that this set a dangerous precedent, which could lead to vigilantism and potentially unintended consequences for innocent users.", "phi:2.7b": " Lycos Europe's \"Make love not spam\" campaign was intended to target spam-related websites by using a screensaver to bombard them with data, which would generate big bandwidth bills. However, the plan has been controversial and even caused some sites to be knocked offline. As a result, Lycos has put the campaign on hold and is currently displaying a message asking users to stay tuned. The website hosting the screensaver has also changed. Some people are concerned that this could set a dangerous precedent for vigilantism.\n", "orca-mini:3b": " Lycos Europe's anti-spam campaign has been put on hold due to controversy surrounding the screensaver that was released earlier this week. The screensaver bombarded some spam-related websites with data, trying to bump up their running costs, and caused some sites to go offline. However, Lycos now appears to have put the plan on hold, with a pink graphic and the words \"Stay tuned\" displayed on the site hosting the screensaver.", "hermes3:3b": "Lycos Europe's anti-spam campaign (screensaver) halted; aimed to increase bandwidth costs for spam sites by sending data when idle, but faced opposition and potential legal issues.", "stablelm-zephyr:3b": "Lycos Europe's anti-spam campaign, \"Make love not spam,\" aimed to use a screensaver to target spam-related websites and force them to run at 95% capacity, resulting in high bandwidth bills for the spammers. However, the plan faced controversy and backlash, with some sites being knocked completely offline. The company put the campaign on hold, prompting concerns about setting a dangerous precedent for vigilantism and potentially violating distributed denial of service (DDOS) laws in many countries.", "chatgpt-4o-latest": "Lycos Europe has put its anti-spam campaign on hold after controversy. The campaign involved a screensaver that sent data to spam-related websites to increase their operating costs. However, some targeted sites were completely knocked offline, raising concerns that the campaign resembled a distributed denial of service (DDoS) attack. Critics warned that it could encourage vigilantism and provoke retaliation from spammers. The site hosting the screensaver now displays a holding message, and its internet address has changed, possibly in response to countermeasures from spammers. Lycos has not commented on the latest developments.", "stablelm2:1.6b": "Lycos Europe's anti-spam campaign, intended to combat spam-related websites by flooding them with data, appears on hold due to controversy surrounding the screensaver. The campaign aimed to get spam sites running at capacity and generate large bandwidth bills for their operators. However, many sites were knocked offline during the trial period. Critics argue that similar attacks could lead to vigilantism and infringe upon legal rights. Lycos now appears to have delayed the campaign.", "granite3.1-dense:2b": "Lycos Europe's anti-spam campaign, \"Make love not spam,\" has been put on hold. The initiative involved a screensaver that directed idle PC data to spam sites, increasing their running costs and potentially causing downtime. Netcraft analysis revealed some targeted sites were completely offline due to this, challenging Lycos' claim it wasn't conducting a distributed denial of service (DoS) attack. The campaign faced criticism for setting a dangerous precedent, inciting vigilantism, and potentially triggering spammers' retaliation. Lycos now displays a holding page on the screensaver site's address, possibly as a response to spoofed traffic redirection from the targeted sites.", "reference": "This is likely to be in response to spammers who have reportedly redirected traffic from their sites back to the Lycos screensaver site.The downing of the sites could dent Lycos claims that what it is doing does not amount to a distributed denial of service attack.Lycos said the idea was to get the spam sites running at 95% capacity and generate big bandwidth bills for the spammers behind the sites.But the site hosting the screensaver now displays a pink graphic and the words \"Stay tuned\".The site hosting the screensaver currently shows a holding page, with the words, \"Stay tuned\".A campaign by Lycos Europe to target spam-related websites appears to have been put on hold.In such attacks thousands of computers bombard sites with data in an attempt to overwhelm them.People were encouraged to download the screensaver which, when their PC was idle, would then send lots of data to sites that peddle the goods and services mentioned in spam messages."}