{"raw_text": "'Brainwave' cap controls computer\n \n A team of US researchers has shown that controlling devices with the brain is a step closer.\n \n Four people, two of them partly paralysed wheelchair users, successfully moved a computer cursor while wearing a cap with 64 electrodes. Previous research has shown that monkeys can control a computer with electrodes implanted into their brain. The New York team reported their findings in the Proceedings of the National Academy of Sciences. \"The results show that people can learn to use scalp-recorded electroencephalogram rhythms to control rapid and accurate movement of a cursor in two directions,\" said Jonathan Wolpaw and Dennis McFarlane. The research team, from New York State Department of Health and State University of New York in Albany, said the research was another step towards people controlling wheelchairs or other electronic devices by thought.\n \n The four people faced a large video screen wearing a special cap which, meant no surgery or implantation was needed.\n \n Brain activity produces electrical signals that can be read by electrodes. Complex algorithms then translate those signals into instructions to direct the computer. Such brain activity does not require the use of any nerves of muscles, so people with stroke or spinal cord injuries could use the cap effectively. \"The impressive non-invasive multidimensional control achieved in the present study suggests that a non-invasive brain control interface could support clinically useful operation of a robotic arm, a motorised wheelchair or a neuroprosthesis,\" said the researchers. The four volunteers also showed that they could get better at controlling the cursor the more times they tried. Although the two partially-paralysed people performed better overall, the researchers said this could be because their brains were more used to adapting or that they were simply more motivated. It is not the first time researchers have had this sort of success in brain-control experiments. Some teams have used eye motion and other recording techniques. Earlier this year, a team at the MIT Media Labs Europe demonstrated a wireless cap which read brain waves to control a computer character.\n", "llama3.2:1b": "A team of US researchers showed that four people can move a computer cursor using a \"Brainwave\" cap with 64 electrodes, learning to use scalp-recorded electroencephalogram rhythms to control rapid and accurate movement in two directions. The research was conducted with partially paralyzed wheelchair users, who wore the cap for several minutes before successfully moving the cursor once or twice.", "llama3.2:3b": "US researchers successfully controlled a computer cursor using a scalp-recorded electroencephalogram rhythm-based system with 64 electrodes on a cap that didn't require surgery or implantation. The study involved four participants, including two partially paralyzed wheelchair users, who achieved rapid and accurate movement of the cursor in both directions with increasing proficiency over repeated attempts.", "gemma2:2b": "Researchers developed a non-invasive brainwave-controlled cap for cursor movement. Four participants successfully controlled a computer cursor while wearing the cap. This device utilizes scalp electrodes to record brain activity and translate it into instructions. This research suggests potential applications in controlling wheelchairs, robotic arms, and other devices for individuals with disabilities. \n", "qwen2.5:0.5b": "A study shows that people can move a computer cursor by controlling their brain activity with electrodes attached to their scalp. The researchers found four people who had partially paralyzed arms and faced a large screen wearing a special cap equipped with 64 electrodes. With no surgery or implantation, they could successfully control the cursor in two directions using signals produced by brain activity detected by electrodes.", "qwen2.5:1.5b": "US researchers show that people can learn to use their brains directly to control computers using scalp-recorded electroencephalogram rhythms in four paralyzed or partially-paralyzed volunteers without surgery or implantation, achieving non-invasive multidimensional control of a cursor. This is another step towards brain-controlled devices for controlling wheelchairs and other electronic gadgets by thought.", "qwen2.5:3b": "A team of US researchers has shown that controlling devices with the brain is closer to reality, as four participants, including two paralysed wheelchair users, successfully moved a computer cursor using an EEG-cap with 64 electrodes. Previous research showed this capability in monkeys but here it was demonstrated in humans without surgery or implantation. The study in the Proceedings of the National Academy of Sciences suggests that people could potentially control wheelchairs or other devices by thought, with complex algorithms translating brain activity into cursor movement instructions. The researchers also noted potential for non-invasive brain control interfaces to support operation of robotic arms, motorised wheelchairs, and neuroprosthetics. Volunteers improved their performance over time, although differences in initial ability cannot be definitively attributed to the technology's effectiveness.", "opencoder:1.5b": "The team of US researchers has shown that controlling devices with the brain is a step closer. Four people successfully moved a computer cursor while wearing a cap with 64 electrodes. The research team, from New York State Department of Health and State University in Albany, reported their findings in the Proceedings of the National Academy of Sciences. They showed \"The impressive non-invasive multidimensional control achieved in the present study suggests that a non-invasive brain control interface could support clinically useful operation of a robotic arm, a motorised wheelchair or a neuroprosthesis.\" The two partially-paralysed people performed better overall.\n", "smollm:1.7b": "Brainwave control technology has made significant progress in recent years, with researchers successfully demonstrating the ability to control devices using only brain activity. The four people who participated in the study were able to move a cursor on a screen while wearing a special cap that monitored their brain waves. This is achieved through the use of electroencephalogram (EEG) signals, which are generated by electrical impulses in the brain.\n\nThe EEG signal processing algorithms used in this study allowed for complex instructions to be translated into commands that could control the computer cursor. The four participants demonstrated remarkable improvement over time, with their ability to move the cursor becoming more accurate and precise as they repeated the task. This suggests that the brain's neural activity can be harnessed to control devices, even if the user is not physically able to do so.\n\nThe study's findings have significant implications for people with paralysis or other motor disorders, who may be able to regain some independence by using brain-control technology. The researchers also noted that this technology could potentially be used to support people with neurological disorders such as Parkinson's disease, where motor control is impaired.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text. The user provided a specific prompt about summarizing a research summary in plain text without any explanations or formatting. So, let me first read through the text carefully.\n\nThe text is about US researchers who showed that controlling devices with a brain cap is closer than before. It mentions four volunteers, two of whom are partially paralysisied. They used a 64-electrode device and did experiments on a computer cursor. The results were published in the journal, and they mentioned how humans can use electrocutaneous signals to control movement without nerves.\n\nI need to capture key points: they controlled a computer while wearing electrodes, it's a step towards controlling devices with less invasive methods, like brain commands or robotic arms. They also noted effectiveness for stroke patients, which is interesting because strokes might require such techniques. Earlier studies used eye motion and other methods, so this is new in that area.\n\nI should make sure to include the main findings: electrocutaneous signals producing electrical signals that are read by electrodes, converting brain activity into cursor movement without nerves. Also, mention that multiple trials improve performance, especially for patients with paralysis. Highlighting it's a closer step towards clinical applications and noting previous similar research but using different methods.\n\nI need to structure this concisely, ensuring all important details are included without unnecessary fluff. Maybe start with the main result, then explain what they did, the results, their findings about adaptability and motivation, mention the previous work in other areas, and conclude with the significance of these findings towards future applications.\n</think>\n\nA team of US researchers demonstrated that brainwave control through electrodes is closer to human proficiency than previous research. Four volunteers, including partially paralysisied users, successfully controlled a computer cursor while wearing 64 electrodes. Their results were published in *Proceedings of the National Academy of Sciences*. The study shows that electrocutaneous signals produce electrical signals that can be read by electrodes, translating brain activity into cursor movement without reliance on nerves. This finding suggests human adaptability and motivation may enhance performance, particularly for stroke patients. Earlier studies used eye motion or other techniques, but this is a new method for controlling devices. The research advances the field toward clinical applications like robotic arms or neuroprosthesis.", "tinyllama:1.1b": "A research team from the New York State Department of Health and the State University of New York in Albany has reported that paralyzed wheelchair users can successfully control a computer with electrodes implanted into their brains, demonstrating the potential for brainwave-controlled devices. The researchers found that participants' brains showed complex algorithms being translated into instructions to direct the computer, which was achieved non-invasively and demonstrated impressive multi-dimensional control, suggesting that a non-invasive brain interface could be clinically useful in robotic arm operation, motorised wheelchair or neuroprosthesis. The research team's findings could lead to people with stroke, spinal cord injuries or paralysis being able to operate electronic devices more easily and with less pain. The researchers also found that the volunteers showed better control over two cursor movements compared to the partially paralyzed participants, suggesting they were motivated enough for the task. Despite the initial success of brain-controlled experiments, this is not the first time recordings of eye motions or other techniques have been used. Earlier this year, a team at MIT Media Lab's Europe demonstrated wireless caps which read brain waves to control computer characters, leading to speculation that future devices could even be designed with no physical movement required.", "tinydolphin:1.1b": " The research team has successfully controlled a computer with brain waves. A group of four wheelchair users participated in the study, wearing a special cap with 64 electrodes that allowed them to move a computer cursor using their thoughts. The cap's signals were read by electrodes on the user's scalp and translated into instructions for operating a computer. They achieved impressive non-invasive multidimensional control, which could potentially help people with paralysis or other neurological issues operate robotic arms, motorized wheelchairs, or neuroprosthetics. The results also suggest that the cap could be a useful tool for assisting individuals who rely on a robotic arm due to spinal cord injuries or stroke.", "phi:2.7b": " A team of US researchers reported that four people, two wheelchair users, were able to move a computer cursor with a cap containing 64 electrodes on their scalp, demonstrating progress in non-invasive brain control for wheelchairs and other electronic devices. The study was published in the Proceedings of the National Academy of Sciences and showed that complex algorithms can convert electrical signals from the brain into instructions for movement. While the partially-paralysed volunteers performed better overall, motivation may have played a role. Other research has used eye motion or similar recording techniques to achieve similar results with wireless caps.\n", "orca-mini:3b": " A team of US researchers has shown that controlling devices with the brain is a step closer. Four people, two of them partially paralysed wheelchair users, successfully moved a computer cursor while wearing a cap with 64 electrodes. This research was published in the Proceedings of the National Academy of Sciences. The results show that people can learn to use scalp-recorded electroencephalogram rhythms to control rapid and accurate movement of a cursor in two directions. The non-invasive brain control interface could support clinically useful operation of a robotic arm, motorised wheelchair or neuroprosthesis. The four volunteers also showed that they could get better at controlling the cursor the more times they tried. However, some teams have used eye motion and other recording techniques. This is not the first time researchers have had this sort of success in brain-control experiments.", "hermes3:3b": "Control computer with brain via electrode cap; people can move cursor using non-invasive method.", "stablelm-zephyr:3b": "A study by US researchers reveals that four people, including two partly paralysed wheelchair users, successfully moved a computer cursor using a Brainwave cap with 64 electrodes without surgery or implantation. Scalp-recorded electroencephalogram rhythms were used to translate brain activity into controlling rapid and accurate movement of a cursor in both directions, which could potentially enable people with stroke or spinal cord injuries to control electronic devices without using nerves or muscles. The four volunteers showed improvement over time, with the two partially paralysed individuals possibly performing better due to their brains being more accustomed to adapting or increased motivation.", "chatgpt-4o-latest": "US researchers have demonstrated progress in brain-controlled devices, with four participants, including two partially paralyzed individuals, successfully moving a computer cursor using a cap with 64 electrodes. Unlike previous studies that required brain implants, this non-invasive method reads brain activity through electrodes and translates signals into computer commands. The study, published in the Proceedings of the National Academy of Sciences, suggests potential applications for controlling wheelchairs, robotic arms, or neuroprostheses. The participants improved with practice, and the paralyzed individuals performed better, possibly due to greater brain adaptability or motivation. Other research teams have explored similar brain-control methods, including a wireless cap developed by MIT Media Labs Europe.", "stablelm2:1.6b": "A team of researchers from New York has shown that people can control a computer with their brains, using a cap with electrodes for the first successful test. Four partially paralyzed wheelchair users successfully moved a cursor while wearing the cap. The research could pave the way for non-invasive brain control interfaces to operate electronic devices such..\n  \nThis summary highlights the progress of brain-activity-based computer control made by researchers from New York. They conducted an effective study with four participants, where two were wheelchair users partially paralyzed. These participants successfully moved a cursor while wearing a specialized cap with electrodes, without needing surgery or nerve implantation. The research implies that a non-invasive brain control interface could facilitate operation of robotic arms, motorized wheelchairs, or neuroprostheses in people with stroke or spinal injuries.", "granite3.1-dense:2b": "A US research team, comprising members from New York State Department of Health and SUNY Albany, has successfully demonstrated that individuals can control a computer cursor using a non-invasive, 64-electrode cap. This achievement includes two partially paralyzed wheelchair users among the participants. The study, published in Proceedings of the National Academy of Sciences, indicates that brain activity can be translated into precise cursor movements in both horizontal and vertical directions. This development paves the way for people with stroke or spinal cord injuries to potentially operate electronic devices like wheelchairs or robotic arms by thought alone. The researchers observed improved performance as volunteers practiced, attributing this progress to either brain adaptability or increased motivation. This experiment builds upon previous work utilizing electrodes implanted in the brain and other recording methods.", "reference": "Although the two partially-paralysed people performed better overall, the researchers said this could be because their brains were more used to adapting or that they were simply more motivated.A team of US researchers has shown that controlling devices with the brain is a step closer.Earlier this year, a team at the MIT Media Labs Europe demonstrated a wireless cap which read brain waves to control a computer character.Four people, two of them partly paralysed wheelchair users, successfully moved a computer cursor while wearing a cap with 64 electrodes.Previous research has shown that monkeys can control a computer with electrodes implanted into their brain.The research team, from New York State Department of Health and State University of New York in Albany, said the research was another step towards people controlling wheelchairs or other electronic devices by thought.Such brain activity does not require the use of any nerves of muscles, so people with stroke or spinal cord injuries could use the cap effectively."}