{"raw_text": "Seamen sail into biometric future\n \n The luxury cruise liner Crystal Harmony, currently in the Gulf of Mexico, is the unlikely setting for tests of biometric technology.\n \n As holidaymakers enjoy balmy breezes, their ship's crew is testing prototype versions of the world's first internationally issued biometric ID cards, the seafarer's equivalent of a passport. Along with the owner's picture, name and personal details, the new Seafarers' Identity Document incorporates a barcode representing unique features of its holder's fingerprints. The cards are due to be issued in February next year, in line with the revised UN Convention on Seafarers' Identity Documents of June 2003. Tests currently under way in the Caribbean are designed to ensure that new cards and their machine readers, produced by different companies in different countries, are working to interoperable standards. Results of the current tests, which involve seafarers from a wide range of occupations and nationalities, will be published by the International Labour Organisation (ILO) by the end of November. Crystal Cruises, which operates the Crystal Harmony, is exploring the use of biometrics but has not yet committed to the technology.\n \n Authenti-corp, the US technology consultancy, has been working with the ILO on its technical specifications for the cards.\n \n \"If you're issued a seafarer's ID in your country, you want to be sure that when the ship lands in a port in, say, my country you can validate yourself using whatever equipment we have installed,\" Authenti-corp's CEO, Cynthia Musselman, told the BBC's Go Digital programme. She said French, Jordanian and Nigerian nationals would be the first seafarers to get the new ID cards since their countries have already ratified the convention. It aims to combat international terrorism whilst guaranteeing the welfare the one million seafarers estimated to be at sea. The convention highlights the importance of access to shore facilities and shore leave as vital elements to a sailor's wellbeing and, therefore, it says, to safer shipping and cleaner oceans. \"By increasing security on the seas as well as border control and protection, the cards will hopefully reduce the number of piracy problems around the world,\" said Ms Musselman. \"It should be a safer environment for seafarers to work in, and will allow people protecting their borders to have confidence that the people getting off the ship are, in fact, seafarers.\"\n", "llama3.2:1b": "Luxury cruise liner Crystal Harmony is testing biometric technology as part of its Seafarer's Identity Document. The document includes a barcode representing fingerprints, which should be unique for each individual. Tests involving seafarers from various countries and occupations have been conducted in the Caribbean. Companies are working on implementing interoperable standards for machine readers and cards, with results expected by November. The goal is to increase security on the seas, combat terrorism, and improve welfare for seafarers.", "llama3.2:3b": "Seamen on luxury cruise liner Crystal Harmony are testing prototype biometric ID cards with fingerprints as part of international efforts to combat terrorism and improve maritime safety. The cards, set to be issued in February, will feature a barcode representing unique fingerprint features and aim to ensure secure border control and reduce piracy problems worldwide.", "gemma2:2b": "Seamen's biometric ID cards are being tested on a luxury cruise liner in preparation for widespread use. The new cards incorporate fingerprint-based barcodes and aim to interoperate with machine readers at ports worldwide.  Testing is expected to be complete by November, with results published by the ILO. The cards will be issued starting February 2016, following the UN Convention on Seafarers' Identity Documents. The technology aims to improve security, border control, and sailor welfare while combating piracy. \n", "qwen2.5:0.5b": "Seamen aboard the cruise liner Crystal Harmony are testing biometric technology designed as the world's first internationally issued ID cards. These new cards contain features of a Seafarers' Identity Document while also incorporating unique features of their holders' fingerprints, which will be used to verify seafarers' identities and ensure interoperability with different companies in different countries. Results from current tests involving seafarers from various countries are expected by the end of November, with the cards due for issuance in February next year. The convention on seafarers' identity documents, ratified by several countries, aims to combat international terrorism while ensuring the welfare of seafarers and protecting their borders.", "qwen2.5:1.5b": "Seafarer identity cards, incorporating biometric fingerprint technology, are being tested aboard luxury cruise liner Crystal Harmony as part of a global initiative aimed at improving border security while safeguarding maritime workers. The UN Convention on Seafarers' Identity Documents will introduce these new passports to replace traditional paper documents by 2005. Authenti-corp is leading the effort with support from the ILO, aiming for interoperability among different card-issuing countries and industries.", "qwen2.5:3b": "The luxury cruise liner Crystal Harmony is testing prototype biometric ID cards for seafarers. These cards incorporate unique fingerprint barcodes alongside personal details such as a picture and name. They are part of the UN Convention on Seafarers' Identity Documents and will be issued in February 2019, with interoperability standards tested across different companies in various countries from January to November. Authenti-corp is working with the ILO on technical specifications. The cards aim to combat terrorism while ensuring seafarer welfare, and can improve border security by verifying a person's identity upon arrival at ports.", "opencoder:1.5b": "\"Seamen sail into biometric future\". The luxurious cruise liner Crystal Harmony has tests of biometric technology. As holidaymakers enjoy balmy breezes, their ship's crew is testing prototype versions of the world's first international biometrics ID cards, Seafarer's equivalent passport. Along with the owner's picture, name and personal details, the new Seafarers' Identity Document incorporates a barcode representing unique features of its holder's fingerprints. Tests currently under way in the Caribbean are designed to ensure that new cards and their machine readers, produced by different companies in different countries, are working interoperable standards. Results will be published by the International Labour Organisation (ILO) by the end of November, Crystal Cruises is exploring the use of biometrics but has not yet committed to the technology. Authenti-corp, US technology consultancy has been working with the ILO on its technical specifications for the cards.\"\n", "smollm:1.7b": "The summary is concise and clear, preserving key ideas and details about the text. It captures the main points of the original text without adding or removing any information. The summary does not provide explanations, no formatting, and no reasoning process.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about biometric technology on luxury ships. Let me read through it carefully.\n\nThe first sentence mentions a luxury cruise liner called Crystal Harmony in the Gulf of Mexico testing biometric ID cards for sailors. These would be like a passport but for the sea. The new cards include a barcode based on fingerprints and are being issued in February 2014, following a UN convention.\n\nThen there's mention of tests done by seafarers from various countries, showing they're working to make these ID cards interoperable. The ILO is part of this effort with another company.\n\nCynthia Musselman, the CEO of a US tech company, talks about ensuring that people get their country's ID cards and how it would help prevent piracy. She also mentions border protection and safer shipping.\n\nThe text ends by noting the biometric cards will cover more countries as they join the UN convention, aiming for peace on the seas with seafarers' welfare.\n\nI need to condense this into a concise summary without explanations or formatting. Just key points: Crystal Harmony testing biometrics, new ID cards include fingerprints, issued in February 2014, tests involve many countries, ILO's role, Musselman's speech about security and safety.\n</think>\n\nThe luxury cruise liner Crystal Harmony is testing biometric ID cards for sailors in the Gulf of Mexico. New biometric ID documents include a fingerprint barcode and will be issued in early 2014 under the UN Convention on Seafarers' Identity Documents. Tests involve seafarers from various countries, aiming to ensure interoperability. The International Labour Organisation (ILO) is working with a US tech company to develop these cards. Cynthia Musselman, CEO of a tech company, mentioned they will cover more countries and aim to reduce piracy by ensuring safe shipping for sailors.", "tinyllama:1.1b": "The luxury cruise line Crystal Harmony is currently testing biometric technology with the goal of offering international identity documents to sea-going employees and visitors. The International Labour Organization (ILO) has established a technical specification for the cards while Authenti-corp, an American technology consultancy, is working on the certification process. Frecnh, Jordana, Nigerian nationals will be among the first sea-going employees to use the new cards, which incorporate unique features of their fingerprints, as the convention aims to guarantee access to shore facilities and shore leave for a sailor's wellbeing. The cards are designed to increase security on the sea and border control, while reducing piracy problems in an environment. The ILO has established the Convention on Sea-farers' Identity Documents of June 2003, and Ms Musselman, CEO of Authenti-corp, has called for its ratification by her country to improve security during sea operations.", "tinydolphin:1.1b": " Crystal Harmony, an international luxury cruise liner, is undergoing tests of biometric technology for its seafarer's ID cards. These tests involve test subjects from diverse occupations and nationalities, as well as a machine reader that can identify the holder's unique features. The cards are due to be issued in February next year, with the new Seafarers' Identity Document replacing the current internationally issued identification card. This new technology promises a more secure environment for seafarers while also ensuring the well-being and protection of those working onboard ships.", "phi:2.7b": " The Crystal Harmony cruise liner is testing prototype biometric ID cards for seafarers' international use, with hopes of reducing piracy problems around the world. Tests involve seafarers from a wide range of occupations and nationalities, with results to be published by the ILO by the end of November. Authenti-corp, a US technology consultancy, has been working with the ILO on technical specifications for the cards, while French, Jordanian, and Nigerian nationals will be the first seafarers to receive them since their countries have ratified the UN Convention on Seafarers' Identity Documents. The aim is to make shipping safer by increasing security on the seas and protecting borders, ultimately creating a safer environment for seafarers to work in.\n", "orca-mini:3b": " The article discusses the testing of biometric technology for seafarer's ID cards, which are due to be issued by the International Labour Organisation (ILO) in February 2004. The new cards will incorporate a barcode representing unique features of their holder's fingerprints and will be used to identify and authenticate seafarers around the world. The tests are being conducted on the luxury cruise liner Crystal Harmony in the Gulf of Mexico and involve several companies and countries, including Authenti-corp and the ILO. The article highlights the importance of seafarer welfare and border control, as well as the potential benefits of using biometrics to combat piracy around the world.", "hermes3:3b": "Crystal Har. sails biometric tests for seafarer ID cards (unique fingerprints barcodes, interoperable standards), aimed at combating international terrorism & ensuring sailors' welfare & border control safety.", "stablelm-zephyr:3b": "Crystal Harmony cruise liner is testing biometric technology, specifically prototype versions of world's first internationally issued Seafarers' Identity Documents. The new cards include an individual's photo, name, personal details, and a barcode representing unique fingerprint features. These tests are designed to ensure that the new cards and their readers can work together regardless of where they were produced. The aim is to combat international terrorism while also improving seafarer wellbeing and safety, with access to shore facilities and leave being vital for sailors' health. Crystal Cruises has not committed to using biometrics yet but may do so in the future as a result of these tests.", "chatgpt-4o-latest": "The luxury cruise liner Crystal Harmony is testing biometric ID cards for seafarers, which include personal details and fingerprint barcodes. These cards, set for issuance in February next year under the revised UN Convention on Seafarers' Identity Documents, aim to enhance security and ensure interoperability across different countries. The International Labour Organisation (ILO) is overseeing tests involving seafarers of various nationalities, with results expected by November. Authenti-corp, a US consultancy, is assisting with technical specifications. The first recipients will be from France, Jordan, and Nigeria, as their countries have ratified the convention. The initiative seeks to improve security, combat terrorism and piracy, and ensure seafarers' welfare by facilitating access to shore facilities and leave. Crystal Cruises is exploring biometrics but has not committed to the technology.", "stablelm2:1.6b": "The Crystal Harmony cruise liner is testing biometric ID cards for seafarers as part of the world's first internationally issued passport. The Seafarers' Identity Document includes a barcode representing unique fingerprint features, and is set to be issued by February 2021. Current tests are ensuring interoperable standards for different companies producing readers and cards. French, Jordanian, and Nigerian seafarers will be the first recipients of the new ID cards since their countries ratified the convention to combat international terrorism. The card aims to improve safety and security on ships while granting access to shore facilities and leave for one million seafarers estimated at sea.", "granite3.1-dense:2b": "Seafarers aboard Crystal Harmony, in the Gulf of Mexico, are testing biometric ID cards as part of an international initiative. These cards, issued under the revised UN Convention on Seafarers' Identity Documents of 2003, incorporate unique fingerprint data, along with personal details and a seafarer's photograph. The technology aims to improve security for seafarers and facilitate border control. Authenti-corp, a US technology consultancy, collaborated with the ILO on these specifications. Initial testing in the Caribbean involves seafarers from various nationalities, and results will be published by the end of November. The first seafarers to receive these cards are expected to be from France, Jordan, and Nigeria, as their countries have ratified the convention. The goal is to enhance security on the high seas, reduce piracy, and ensure safer conditions for seafarers while providing border protection confidence.", "reference": "She said French, Jordanian and Nigerian nationals would be the first seafarers to get the new ID cards since their countries have already ratified the convention.The cards are due to be issued in February next year, in line with the revised UN Convention on Seafarers' Identity Documents of June 2003.\"It should be a safer environment for seafarers to work in, and will allow people protecting their borders to have confidence that the people getting off the ship are, in fact, seafarers.\"As holidaymakers enjoy balmy breezes, their ship's crew is testing prototype versions of the world's first internationally issued biometric ID cards, the seafarer's equivalent of a passport.\"If you're issued a seafarer's ID in your country, you want to be sure that when the ship lands in a port in, say, my country you can validate yourself using whatever equipment we have installed,\" Authenti-corp's CEO, Cynthia Musselman, told the BBC's Go Digital programme.The luxury cruise liner Crystal Harmony, currently in the Gulf of Mexico, is the unlikely setting for tests of biometric technology."}