{"raw_text": "Mobiles double up as bus tickets\n \n Mobiles could soon double up as travel cards, with Nokia planning to try out a wireless ticket system on German buses.\n \n Early next year travellers in the city of Hanau, near Frankfurt, will be able to pay for tickets by passing their phone over a smart-card reader already installed on the buses. Passengers will need to own a Nokia 3220 handset which will have a special shell attached to it. The system would reduce queues and make travelling easier, said Nokia.\n \n Transport systems around the world are seeing the advantage of using ticketless smartcards. Using a mobile phone is the next step, said Gerhard Romen, head of market development at Nokia.\n \n The ticketless trial will start early in 2005 and people will also be able to access transport information and timetables via their phones. Nokia has worked with electronics giant Philips to develop a shell for the mobile phone that will be compatible with Hanau's existing ticketing system. The system opens up possibilities for mobile devices to be interact with everyday environments, said Mr Romen. \"It could be used in shops to get product information, at bus-stops to get information about the next bus or, for example, by being passed over an advert of a rock star to find out details of concerts or get ringtones,\" he told the BBC News website. He is confident that the trial being run in Germany could be extended to transport systems in other countries. \"The technology offers access to a lot of services and makes it easy to get the information you want,\" he said.\n", "llama3.2:1b": "Nokia plans to test a wireless ticket system on German buses, allowing passengers to pay for tickets using their Nokia 3220 handsets with smart-card readers already installed on the buses. The trial will start in early 2005 and include access to transport information and timetables via mobile phones.", "llama3.2:3b": "Nokia plans to test a wireless ticket system on German buses starting early in 2005, allowing passengers to pay for tickets with their Nokia 3220 handsets passed over a smart-card reader. The system aims to reduce queues and make traveling easier.", "gemma2:2b": "Nokia is launching a wireless ticket system on German buses where passengers can pay for tickets using their Nokia 3220 smartphones. The trial will start in early 2005, enabling users to access transport information and timetables through their phones. This innovative system aims to reduce queues and improve travel convenience.  \n", "qwen2.5:0.5b": "Mobile phones are being used as travel tickets, with Nokia planning to introduce a wireless ticket system on German buses. Passengers will need to own a Nokia 3220 handset with a special shell that will have a slot for their phone. The system reduces queues and makes travelling easier. It allows people to access transport information and timetables via their phones, similar to using smartcards in Germany.", "qwen2.5:1.5b": "Nokia plans to test a wireless ticket system on German buses, allowing mobile phones as passively payment methods. The trial will start early 2005 and includes transport info access via phones, with compatibility developed for existing systems. This could expand mobile usage in daily environments like shops and bus stops.", "qwen2.5:3b": "Mobiles could soon replace bus tickets with Nokia planning a wireless ticket system on German buses starting early 2005. Passengers will pay using a special Nokia handset compatible with existing ticketing systems, reducing queues and making travel easier. The trial also allows access to transport information and timetables via phones. Technology opens possibilities for mobile devices in various environments like shops, bus stops, or advertisements for concert details and ringtones. Nokia believes the system could be extended to other countries.", "opencoder:1.5b": "Mobiles double up as bus tickets, with Nokia planning to try out a wireless ticket system on German buses.\n\nEarly next year travellers in Hanau, near Frankfurt, will be able to pay for tickets by passing their phone over a smart-card reader already installed on the buses.\n\nTransport systems around the world are seeing the advantage of using ticketless smartcards. Using a mobile phone is the next step, said Gerhard Romen, head of market development at Nokia. The system opens up possibilities for mobile devices to be interact with everyday environments. \"It could be used in shops to get product information, at bus-stops to get information about the next bus or, for example, by being passed over an advert of a rock star to find out details of concerts or get ringtones,\" he told the BBC News website.\n", "smollm:1.7b": "Mobile phones can soon double up as bus tickets, with Nokia planning to try out a wireless ticket system on German buses. Early next year travellers in the city of Hanau will be able to pay for tickets by passing their phone over a smart-card reader already installed on the buses. Passengers will need to own a Nokia 3220 handset which will have a special shell attached to it. The system would reduce queues and make travelling easier, said Gerhard Romen, head of market development at Nokia.\nThe ticketless trial will start early in 2005 and people will also be able to access transport information and timetables via their phones. Nokia has worked with electronics giant Philips to develop a shell for the mobile phone that will be compatible with Hanau's existing ticketing system. The system opens up possibilities for mobile devices to be interact with everyday environments, said Mr Romen. \"It could be used in shops to get product information, at bus-stops to get information about the next bus or, for example, by being passed over an advert of a rock star to find out details of concerts or get ringtones,\" he told the BBC News website. He is confident that the trial being run in Germany could be extended to transport systems in other countries. \"The technology offers access to a lot of services and makes it easy to get the information you want,\" he said.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to help the user by summarizing this text concisely. Let me read through it carefully first.\n\nAlright, the text is about Nokia's new smart ticket system for buses. It mentions that mobiles can double up as travel cards and that they're planning a wireless ticket system on German buses. The system involves passing a phone over a smart-card reader which has already installed one. \n\nNokia said this will reduce queues and make traveling easier, especially in Hanau, near Frankfurt. They own a Nokia 3220 device with a special shell attached. Transport systems are using this method because it's smart and not dependent on paying for tickets, which is convenient.\n\nGerhard Romen from Nokia explained that the ticketless trial starts early next year and people can get information via phones. He mentioned using their mobile phone, maybe for getting product info or concert details, and even passing it over an advert of a rock star to find out concert information. \n\nHe also talked about how this could open up more possibilities for mobile devices interacting with everyday environments, like shopping or bus stops. He's confident the trial in Germany can be extended elsewhere because it offers access to many services and makes getting info easy.\n\nSo, I need to condense all this into a summary without adding any explanations or formatting. Just plain text. I'll start by mentioning that mobiles could double up as travel cards and mention the smart ticket system on German buses. Then, include Nokia's details about owning a special device with a shell, the system reducing queues, location in Hanau, and their market presence with Philips. Also, note the expansion potential beyond Germany and Romen's confidence.\n\nI should make sure I capture all key points: the system uses smart cards, the phone is passed over one, the device is Nokia 3220, special shell for security, reduced queues, Hanau location, transport info via phones, Philips partnership, and future expansion. \n\nLet me structure it concisely without any extra fluff.\n</think>\n\nMobiles could double up as travel cards with a smart ticket system on German buses, allowing travelers to pay by passing their phone over a reader installed on the vehicle. Nokia plans to sell a specially designed device, likely the Nokia 3220, that includes a unique shell for security. This system will reduce queues and enhance traveling, especially in Hanau, where it will be available starting early next year. Gerhard Romen noted transport systems worldwide are adopting ticketless smartcards, using mobiles as a first step. He highlighted the device's compatibility with existing systems, opening possibilities beyond Germany.", "tinyllama:1.1b": "Nokiá, a German company, plans to test a wireless ticket system on public buses near Frankfurt, Germany, that will allow passengers to pay for their travel using their mobile phones. The Nokia 3220 hands-free terminal will have a special shell attached to it, reducing queues and making traveling easier. Transport systems around the world are transitioning from traditional tickets to smartcards, and Nokiá is taking advantage of this trend by testing a ticketless smartcard system on Hanau buses. The company has already developed a shell compatible with Hanau's existing ticketing system and plans to extend the trial to transport systems in other countries. The technology offers access to various services, such as getting information about upcoming concerts or bus schedules, making it easy for passengers to get the most out of their trips. Nokiá CEO Gerhard Romen is confident that the wireless ticket system will be widely accepted and extended beyond transport systems in Germany.", "tinydolphin:1.1b": " Mobiles can soon double up as bus tickets if Nokia plans to launch a wireless ticket system on German buses. This will be an innovative solution for public transportation, enabling passengers to pay for their tickets without using physical tickets or cards by passing their mobile phones over special readers already installed on the buses. This new system could also pave the way for other markets and applications where mobile devices can connect with everyday environments.", "phi:2.7b": " Nokia plans to test a wireless ticket system on German buses, where passengers can pay for tickets by using their Nokia phone with a special shell attached. The trial will also provide transport information and timetables via the phone. The technology has the potential to be used in other countries as well.\n", "orca-mini:3b": " Nokia plans to trial a wireless ticket system on German buses by next year, using mobile phones as travel cards with a special shell attached to the Nokia handset. The system will allow passengers to pay for tickets by passing their phone over a smart-card reader on the buses. It could also provide access to information and timetables via mobile devices. Nokia has worked with Philips to develop a shell for the mobile phone compatible with Hanau's existing ticketing system. The trial could be extended to other countries, Mr Romen said.", "hermes3:3b": "Nokia mobiles as wireless bus tickets (trial in Hanau)", "stablelm-zephyr:3b": "Nokia plans to test a mobile ticket system on German buses, allowing passengers to pay for tickets using their phones next year in Hanau. The trial will use Nokia 322 handsets with special shells compatible with the local ticketing system. This initiative aims to reduce queues and improve travel convenience. Other transport systems around the world are exploring similar ticketless smartcard options; using a mobile phone is the next logical step, according to Gerhard Romen, head of market development at Nokia. The trial will begin in early 2005, offering access to transportation information and timetables through mobile devices as well. This technology has potential applications beyond transport systems, such as interacting with shops, bus stops, and advertising for concert details or ringtones.", "chatgpt-4o-latest": "Nokia plans to test a wireless ticket system on German buses, allowing passengers in Hanau to pay for tickets by passing a Nokia 3220 phone with a special shell over a smart-card reader. The trial, starting in early 2005, aims to reduce queues and simplify travel. Nokia, in collaboration with Philips, developed the shell to work with Hanau’s existing ticketing system. The technology could extend to other transport systems and enable mobile phones to interact with everyday environments, such as accessing transport information, product details in shops, or concert information from advertisements.", "stablelm2:1.6b": "Nokia plans to introduce a wireless ticket system on German buses, allowing phone users to pay for tickets by passing their phones over a smart-card reader installed on the buses. This trial will start early next year in Hanau, near Frankfurt, and will enable travelers to access transport information and timetables via their phones. The technology has already proven successful in other areas of daily life and offers easy access to various services. Nokia has partnered with electronics giant Philips to create a shell compatible with Hanau's existing ticketing system. The system is expected to open up possibilities for mobile devices to be interacted with everyday environments, potentially extending its use in other countries' transport systems.", "granite3.1-dense:2b": "Nokia plans to introduce a wireless ticket system on German buses, starting with Hanau near Frankfurt. This service will allow passengers to use their Nokia 3220 handsets with specially designed shells as travel cards. By passing the phones over smart-card readers on buses, users can eliminate long queues and streamline ticketing. The trial is set to begin in early 2005, offering access to transport information and timetables via mobile devices. Nokia has collaborated with Philips to create the compatible shell for Hanau's existing system. Gerhard Romen, head of market development at Nokia, envisions this technology being expanded to various transport systems globally, potentially serving as a universal tool for accessing services and information in everyday environments, such as shops or bus stops.", "reference": "The system would reduce queues and make travelling easier, said Nokia.Using a mobile phone is the next step, said Gerhard Romen, head of market development at Nokia.Nokia has worked with electronics giant Philips to develop a shell for the mobile phone that will be compatible with Hanau's existing ticketing system.Mobiles could soon double up as travel cards, with Nokia planning to try out a wireless ticket system on German buses.The system opens up possibilities for mobile devices to be interact with everyday environments, said Mr Romen."}