{"raw_text": "Learning to love broadband\n \n We are reaching the point where broadband is a central part of daily life, at least for some, argues technology analyst Bill Thompson.\n \n One of the nice things about being a writer is that I rarely have to go to an office to work. I can sit in a caf&#233; or a library, with or without a wi-fi connection, and research and write articles. If I am passing through Kings Cross station on my way to a meeting then I can log on from the platform. And I can spend the day working with my girlfriend Anne, a children's writer, at her house in Cambridge, sharing her wireless network. But just over a week ago I arrived at her house to find that there was no network connection.\n \n We checked the cable modem and noticed that it had no power, and when she changed the power lead it sparked at her in a way which made it abundantly clear that it was never going to talk to the internet again. She called her service provider, and they told her it would be five days before an engineer would show up with a new cable modem. This did not seem too bad, but in fact she really suffered until her connection was restored on Wednesday. With no modem installed in her computer, she had to borrow internet access from friends or use the dial-up connection on her daughter's laptop, so she had to choose between copying her files onto her USB memory card or accepting a slower and flakier net connection. As a result she did not submit the pictures she wanted to use for a book on earthquakes because they were too big to send over dial-up.\n \n She could not research other material because she is used to having easy access to a fast link that lets her search quickly and effectively. But the impact spread into her personal life too. She did not take her children to the cinema during half-term because she could not find out which films were showing at the local cinemas. She planned a trip to Norfolk but did not check the weather because the only place she knows to look for weather information is the BBC website. And she did not know where to go fossil-hunting on the trip because she could not type \"fossils Norfolk\" into Google. Of course, she readily admits, she could have answered these questions if she had looked in the local paper, listened to the radio or found a book on fossils. But she did not, because having fast, always on, and easy access to the net has become part of the routine of her daily life, and when it was taken away it was too much effort to go back to the old ways of doing things. She may be unusual, but I do not think Anne is alone.\n \n According to Ofcom there were almost four million broadband users in the UK in April 2004, and numbers are climbing fast. There will certainly be five million by the end of the year. Dial-up users are switching to broadband. My dad finally made the change earlier this month and new net users are selecting broadband from the start. More and more of these broadband users are beginning to mould their daily lives around the availability of broadband internet connections, and they too will find it difficult to cope if they cannot get online for any reason.\n \n It is part of the process of adaptation, and it is a vital step in the growth of broadband in the UK and elsewhere. People who have integrated net access into their daily lives tell their friends about it, and show off the cool stuff they can do. They encourage other people to get broadband so that they can share digital photos and do all of the other things that need fast and reliable connectivity. Of course, broadband in the UK is laughably slow compared to other parts of the world. In South Korea, Japan and Hong Kong normal connection speeds are measured in megabits, or millions of bits, a second rather than the thousands that we are supposed to be happy with. But speed is only a small part of the attraction of broadband, and when it comes to checking websites for film times, looking at weather forecasts, or all of the other small things that make a real difference to the routines and habits of our daily lives, even UK speeds are sufficient. It may not be the brave new world of streaming full-screen video and superfast file downloads, but it will do for now. And it is certainly better than slow access or no access. Just ask Anne.\n \n Bill Thompson is a regular commentator on the BBC World Service programme Go Digital.\n", "llama3.2:1b": "Technology analyst Bill Thompson argues that broadband has become a central part of daily life for many people, including writer Anne. She found out her internet connection was down and had to borrow from friends or use dial-up until it was restored. This experience highlighted how dependent she is on fast and reliable online access.", "llama3.2:3b": "Broadband has become an essential part of daily life for some people, enabling flexible work arrangements and convenient access to information. When broadband was disrupted in Cambridge, the writer's partner experienced difficulties researching, accessing weather forecasts, and sharing digital content, highlighting the importance of reliable internet connectivity. The growth of broadband users is expected to continue, with nearly four million UK users as of 2004 and five million projected by the end of the year.", "gemma2:2b": "Broadband internet is becoming increasingly vital to daily life.  Its widespread adoption has caused difficulties as people adapt to relying on reliable and readily available connection, which can be disrupted by outages. This shift in reliance for everyday activities is leading users to integrate broadband into their routines. Many are sharing this experience with others, promoting its benefits, especially for tasks such as checking film times or accessing weather information. While the speed of broadband may not reach global standards, it provides a functional and sufficient means for completing daily tasks. \n", "qwen2.5:0.5b": "A UK internet user struggles to get online despite broadband speeds that are five times lower than those in other parts of the world, and her main obstacle is not having access to the internet through cables or routers, but being unable to find reliable websites for information about travel, weather, and fossils, which she finds useful.", "qwen2.5:1.5b": "Bill Thompson argues that broadband has become an essential part of modern life. Despite issues with service availability and speed, nearly 4 million UK users have adopted it. As more people adopt broadband, they find it increasingly necessary for daily tasks like online shopping, weather checking, and personal connections. While slow speeds are a concern compared to international standards, the convenience outweighs these negatives, as evidenced by Anne's struggles without access.", "qwen2.5:3b": "Learning to love broadband\n\nTechnology analyst Bill Thompson suggests that broadband has become integral to many people's daily lives, especially those who can't do without it, like writers and others who need internet connectivity for work or personal use. Anne, a children's writer, found herself unable to access her network after a week-long disruption due to power issues with her cable modem. The situation forced her to use slow alternative means of accessing the internet, leading to missed opportunities such as not being able to submit images for her book on earthquakes in time. This reliance on broadband extends beyond professional life and affects personal activities like visiting the cinema or planning trips. Ofcom reports over four million UK users by 2004, with numbers rapidly increasing. Despite slow speeds compared to other countries, many find it essential for routine tasks such as checking film times and weather forecasts online. Thompson highlights how people who use broadband share its benefits, making it appealing to those considering the technology.", "opencoder:1.5b": "In summary, Bill Thompson's comments refer to an everyday routine that is often influenced by technology trends and advancements in the internet connection world. He encourages people to use fast and reliable internet services for a variety of reasons including convenience, accessibility, and efficiency. While he believes that the internet speed should not be limited to a specific country or region, it can also serve as a reminder of the importance of adapting our daily lives to meet the growing needs of the digital world.\n", "smollm:1.7b": "Summarize the following text concisely:\nThe article discusses how broadband internet has become an essential part of daily life in the UK, and how it has enabled people to access various services and information online. The author argues that broadband is not only necessary for accessing the internet but also for other activities such as checking weather forecasts, looking at film times, and downloading files.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about Anne using her internet for a book project. Let me read through the text again and see what key points are important.\n\nSo, Bill Thompson argues that broadband is central to daily life. Anne arrives with no internet connection, which causes problems like limited research options and she can't use friends' devices or do weather checks without the net. She ends up adapting by using other methods and mentions her dad's move towards broadband. The text also talks about Ofcom data showing rapid growth in broadband usage and how people expect it to improve.\n\nI need to make sure I include Anne's experience, the problems she faced due to no internet, her method of using friends or her daughter's laptop, and her personal adaptation through other methods. Also, mention Ofcom's stats on growth and the comparison with other regions like South Korea and Hong Kong where speeds are faster.\n\nI should structure this into a concise summary that captures Anne's struggle but also highlights how technology is changing her life.\n</think>\n\nAnne faced significant challenges without internet connectivity, which limited her research options and daily activities. She had to rely on friends' devices or a slower connection for weather data, leading her to adapt by using alternative methods. According to Ofcom, broadband usage in the UK grew rapidly, with current numbers well below potential future peaks. Anne's journey reflects how technology is reshaping her life, adapting despite slower speeds compared to other regions.", "tinyllama:1.1b": "A Helpful AI Assistant: Learning to Love Broadband", "tinydolphin:1.1b": " The author points out that broadband usage has grown significantly in the UK and other parts of the world, with more people becoming net users. They describe how people are adapting to this change by integrating internet access into their daily routines. In contrast, the author highlights how slow internet speeds can be in countries like South Korea, Japan, and Hong Kong, which is why online activities are being driven more by personal interests than the need for fast connections. The author argues that while UK broadband usage may not be as advanced as it could be, it is still better than no access to the internet.", "phi:2.7b": " According to technology analyst Bill Thompson, broadband has become an essential part of daily life and people who have integrated net access into their routines find it difficult to cope without it. He gives examples of how his friend's daily routine was disrupted when she lost her internet connection and had to resort to slower alternatives such as dial-up or borrowing from friends. The article also highlights the fact that in the UK, speeds may be slow compared to other parts of the world but are sufficient for everyday tasks such as checking websites for film times and weather forecasts. Overall, Thompson emphasizes the importance of fast and reliable internet access in modern life.\n", "orca-mini:3b": " Learning to love broadband: people adapt to fast internet access in daily life despite slow speeds in the UK", "hermes3:3b": "Learning to rely on broadband; people adapting daily life around always-on internet connection.", "stablelm-zephyr:3b": "The text discusses how the author, Bill Thompson, experiences broadband connectivity issues when visiting his girlfriend Anne's house in Cambridge. He illustrates the impact of broadband on daily life, showing that many people have integrated net access into their routines and rely on it for various tasks, from work to personal matters. This highlights how essential broadband has become and how difficult it would be for individuals to revert to old ways without internet connectivity. According to Ofcom, there were nearly four million broadband users in the UK in 2004, with numbers increasing rapidly. As more people switch from dial-up to broadband and adapt their daily lives around its availability, it becomes crucial for continued growth of broadband in the UK and other countries. While broadband speeds may not be as fast as in other parts of the world, such as South Korea, Japan, and Hong Kong, they still provide sufficient connection for most common uses.", "chatgpt-4o-latest": "Broadband has become an essential part of daily life for many, argues technology analyst Bill Thompson. He shares a personal experience of his girlfriend Anne, a children's writer, who struggled when her internet connection failed. Without broadband, she faced difficulties in submitting work, researching, and even planning personal activities like cinema trips and travel. This highlights how people have adapted to fast, always-on internet and find it hard to revert to older methods. Broadband adoption is growing rapidly in the UK, with millions switching from dial-up. As more people integrate broadband into their routines, they encourage others to do the same. While UK broadband speeds lag behind countries like South Korea and Japan, they are sufficient for everyday tasks. The increasing reliance on broadband underscores its importance in modern life.", "stablelm2:1.6b": "Technology analyst Bill Thompson argues that broadband has become an essential part of daily life for many people, especially those who work remotely. He cites examples like a writer whose internet connection was disrupted when visiting her girlfriend's house. In contrast..\nThe UK's Ofcom reported almost 4 million broadband users in April 2015 and expects this number to reach 5 million by the end of the year. More people are switching from dial-up to broadband, with those who adapt to net access molding their daily lives around its availability. This process is vital for growth as people share digital photos and perform various online activities.\nCompared to other countries like South Korea, Japan, and Hong Kong, UK broadband speeds may be slow, but they suffice when checking websites for film times, looking at weather forecasts or performing other everyday tasks that require fast and reliable connectivity.", "granite3.1-dense:2b": "Broadband has become an integral part of daily life for many individuals in the UK, transforming routine activities and habits. Technology analyst Bill Thompson highlights this trend through Anne's experience. When her cable modem failed, she lost broadband access for over a week. This disruption impacted her work as a children's writer, preventing her from researching, submitting files, or using the internet effectively for her projects. It also affected her personal life, as she couldn't check local cinema listings, weather updates, or fossil-hunting information online.\n\nDespite the UK having almost four million broadband users and a growing number of new subscribers, many are finding it challenging to function without internet connectivity due to its integration into their daily routines. This adaptation process encourages more people to adopt broadband, fostering a community that shares benefits like instant digital photo sharing and other convenient online activities.\n\nAlthough UK broadband speeds are slower compared to international counterparts, the practical advantages of having reliable internet access outweigh the limitations. Even though full-screen video streaming and rapid file downloads aren't possible with current UK broadband speeds, basic daily tasks like checking local information become significantly more manageable with fast connectivity. Anne's story underscores how essential it is for people to maintain their broadband connections, as they've grown accustomed to the convenience it provides in their daily lives.", "reference": "But she did not, because having fast, always on, and easy access to the net has become part of the routine of her daily life, and when it was taken away it was too much effort to go back to the old ways of doing things.More and more of these broadband users are beginning to mould their daily lives around the availability of broadband internet connections, and they too will find it difficult to cope if they cannot get online for any reason.Of course, broadband in the UK is laughably slow compared to other parts of the world.Dial-up users are switching to broadband.We are reaching the point where broadband is a central part of daily life, at least for some, argues technology analyst Bill Thompson.According to Ofcom there were almost four million broadband users in the UK in April 2004, and numbers are climbing fast.But speed is only a small part of the attraction of broadband, and when it comes to checking websites for film times, looking at weather forecasts, or all of the other small things that make a real difference to the routines and habits of our daily lives, even UK speeds are sufficient.People who have integrated net access into their daily lives tell their friends about it, and show off the cool stuff they can do.With no modem installed in her computer, she had to borrow internet access from friends or use the dial-up connection on her daughter's laptop, so she had to choose between copying her files onto her USB memory card or accepting a slower and flakier net connection.My dad finally made the change earlier this month and new net users are selecting broadband from the start.It is part of the process of adaptation, and it is a vital step in the growth of broadband in the UK and elsewhere.They encourage other people to get broadband so that they can share digital photos and do all of the other things that need fast and reliable connectivity.But just over a week ago I arrived at her house to find that there was no network connection.And she did not know where to go fossil-hunting on the trip because she could not type \"fossils Norfolk\" into Google."}