{"raw_text": "China 'blocks Google news site'\n \n China has been accused of blocking access to Google News by the media watchdog, Reporters Without Borders.\n \n The Paris-based pressure group said the English-language news site had been unavailable for the past 10 days. It said the aim was to force people to use a Chinese edition of the site which, according to the watchdog, does not include critical reports. Google told the BBC News website it was aware of the problems and was investigating the causes.\n \n China is believed to extend greater censorship over the net than any other country in the world.\n \n A net police force monitors websites and e-mails, and controls on gateways connecting the country to the global internet are designed to prevent access to critical information. Popular Chinese portals such as Sina.com and Sohu.com maintain a close eye on content and delete politically sensitive comments. And all 110,000 net cafes in the country have to use software to control access to websites considered harmful or subversive.\n \n \"China is censoring Google News to force internet users to use the Chinese version of the site which has been purged of the most critical news reports,\" said the group in a statement. \"By agreeing to launch a news service that excludes publications disliked by the government, Google has let itself be used by Beijing,\" it said. For its part, the search giant said it was looking into the issue. \"It appears that many users in China are having difficulty accessing Google News sites in China and we are working to understand and resolve the issue,\" said a Google spokesperson. Google News gathers information from some 4,500 news sources. Headlines are selected for display entirely by a computer algorithm, with no human editorial intervention. It offers 15 editions of the service, including one tailored for China and one for Hong Kong. Google launched a version in simplified Chinese in September. The site does not filter news results to remove politically sensitive information. But Google does not link to news sources which are inaccessible from within China as this would result in broken links.\n", "llama3.2:1b": "China has blocked access to Google News, a English-language news site, for 10 days, allegedly to force users to use the Chinese version of the service that excludes critical reports and politically sensitive content. The goal is believed to be driven by censorship to prevent access to information deemed subversive or contrary to the government's interests.", "llama3.2:3b": "China has blocked access to the English-language version of Google News for 10 days, according to Reporters Without Borders, citing the aim of forcing users to use a censored Chinese edition of the site.", "gemma2:2b": "China is accused of blocking access to Google News, the English-language edition of the platform has been unavailable for 10 days. Reporters Without Borders states that the move aims to force users to engage with a censored Chinese version, which excludes critical reports. Google acknowledges the issue and is investigating, while expressing concerns over user experience within China.  China is known for its extensive censorship efforts on the internet, including monitoring websites and filtering content through various means like net police and portal controls. \n", "qwen2.5:0.5b": "China blocks access to Google News because the media watchdog reports the site has been unavailable for 10 days and is being used by Beijing to force people to use a Chinese version of the site instead. Google News gathers information from many news sources but provides only one edition, including a simplified Chinese version in September. The search giant does not filter news results or link to non-China-based news websites.", "qwen2.5:1.5b": "China has blocked access to Google News, accusing the platform of censoring critical reports and forcing users to use a Chinese version that lacks such content, following pressure from Reporters Without Borders. The Chinese government monitors websites, controls internet gateways, and censors politically sensitive information across its 110,000 net cafes, while China has stricter censorship than any other country. Google plans to investigate the issue further.", "qwen2.5:3b": "China blocks access to Google News, accused by media watchdog Reporters Without Borders for censoring critical reports found only on the Chinese edition. The watchdog claims China imposes strict censorship over internet content, monitoring and controlling gateways and websites. China's net police force monitors websites and e-mails, and controls access to harmful or subversive sites in 110,000 cafes. Google News gathers information from 4,500 sources without human intervention, including a tailored edition for China with headlines selected by an algorithm. Google is investigating the issue of unavailable Chinese Google News sites.", "opencoder:1.5b": "China has been accused of blocking access to Google News by the media watchdog, Reporters Without Borders.\n\nThe Paris-based pressure group said the English-language news site had been unavailable for the past 10 days. It said the aim was to force people to use a Chinese edition of the site which, according to the watchdog, does not include critical reports.\n\nChina is believed to extend greater censorship over the net than any other country in the world. A net police force monitors websites and e-mails, and controls on gateways connecting the country to the global internet are designed to prevent access to critical information.\n\nPopular Chinese portals such as Sina.com and Sohu.com maintain a close eye on content and delete potentially sensitive comments. All 110,000 net cafes in the country have to use software to control access to websites considered harmful or subversive.\n\n\"China is censoring Google News to force internet users to use the Chinese version of the site which has been purged of the most critical news reports,\" said the group in a statement. \"By agreeing to launch a news service that excludes publications disliked by the government, Google has let itself be used by Beijing,\" it said. For its part, the search giant said it was looking into the issue. \"It appears that many users in China are having difficulty accessing Google News sites in China and we are working to understand and resolve the issue,\" said a Google spokesperson.\n", "smollm:1.7b": "China has been accused of blocking access to Google News by the media watchdog, Reporters Without Borders. The English-language news site had been unavailable for the past 10 days. It said the aim was to force people to use a Chinese edition of the site which, according to Reporters Without Borders, does not include critical reports. China is believed to extend greater censorship over the net than any other country in the world. A net police force monitors websites and e-mails, and controls on gateways connecting the country to the global internet are designed to prevent access to critical information. Popular Chinese portals such as Sina.com and Sohu.com maintain a close eye on content and delete politically sensitive comments. And all 110,000 net cafes in the country have to use software to control access to websites considered harmful or subversive.\n\nGoogle has been accused of agreeing to launch a news service that excludes publications disliked by the government. For its part, the search giant said it was looking into the issue and is working to resolve it. It does not filter news results to remove politically sensitive information. But Google does not link to news sources which are inaccessible from within China as this would result in broken links.", "deepseek-r1:1.5b": "<think>\nOkay, so the user wants me to summarize a given text concisely while preserving key ideas and details. They also specified that the output should only be plain text without any explanations or formatting.\n\nFirst, I need to read through the provided text carefully. It's about China blocking access to Google News by Reporters Without Borders. The main points are that China has been accused of this, with the group mentioning a 10-day gap and purged critical reports in their Chinese version. Google is investigating issues but hasn't confirmed yet.\n\nI should identify the main ideas: China's censorship move, the purpose behind it (to use Chinese news), the reasons for blocking, and Google's response. I need to make sure all these points are included without adding any extra information.\n\nNext, I'll structure the summary in a way that flows logically. Starting with the accusation, then the specifics about the site being unavailable, Google's response, China's broader censorship stance, and finally a mention of other platforms like Sina and Sohu.\n\nI need to ensure the language is plain text as per the user's instruction. No markdown or formatting. Just concise sentences linking each key point together without making it too long or complicated.\n\nFinally, I'll review the summary to make sure all crucial details are included: the 10-day blocked period, the purged content, Google's investigation, China's increased censorship compared to others, and examples of other platforms mentioned.\n</think>\n\nChina has been accused of blocking access to Google News by Reporters Without Borders. The Paris-based group stated that the site had been unavailable for the past 10 days, prompting people to use a Chinese version without critical reports. Google is investigating the issues but hasn't confirmed yet. China believes in greater censorship over the net than any other country, with websites and e-mails monitored by a net police force. Platforms like Sina.com and Sohu.com maintain strict content controls and require software access for harmful or subversive content. A spokesperson for Google stated that many Chinese users struggle to access the service and are working to resolve the issue.", "tinyllama:1.1b": "Le groupement d'avocats Réponsibles pour les Medias et les Réseaux (Reporters Without Borders) a été accusé de bloquer le site des médias google en Chine. Le projet anglais News.com, à la suite duquel l'utilisateur aurait pu consulter les portails de presse chinois Google News ou Sinap.com, n'est pas disponible depuis 10 jours et la censure gouvernementale empêche de passer par le net aux portails chinois de la vente d'information. La société search de Google a publié un communiqué dans lequel elle reconnait l'incident de censure chinoise, mais insiste sur l'importance des informations pour la démocratisation des médias en Chine et leur diffusion. Le groupe demande aux internautes de suivre les instructions publiées par Google afin d'imposer un nouveau site de presse chinois.", "tinydolphin:1.1b": " The article states that the Chinese government has blocked access to Google News, a leading online news platform globally. This decision could have significant consequences for global media outlets and users who rely on the service for accurate information. Reporters Without Borders, a Paris-based organization advocating for media freedom in China, accuses the Chinese government of censorship. The organization's statement suggests that some users in China are having difficulties accessing the news site, while Google itself has acknowledged the issue but is currently investigating the cause. This situation highlights the importance of maintaining transparency and access to information across the world, especially in politically charged regions like China.", "phi:2.7b": " China has blocked access to Google News on its territory, accusing the search giant of censoring critical reports and forcing people to use a Chinese version of the site that lacks such content. Reporters Without Borders accused Google of using its services for Beijing's censorship purposes, while Google said it was investigating the issue. The watchdog also criticized China for extending greater censorship over the internet than any other country in the world, citing net police monitoring and censorship of popular portals and internet cafes.\n", "orca-mini:3b": " China is blocking access to Google News, according to the media watchdog Reporters Without Borders. The Chinese edition of the site has been purged of critical news reports. Google is investigating the cause of the problem and has confirmed that it is working to resolve the issue.", "hermes3:3b": "China blocks access to Google News, according to media watchdog Reporters Without Borders.", "stablelm-zephyr:3b": "Reporters Without Borders accuses China of blocking access to Google News, claiming the Chinese edition excludes critical reports. China is believed to have greater internet censorship than any other country in the world, with a net police force monitoring websites and controlling gateways to prevent access to certain information. While Google maintains a version of its site for China that does not filter politically sensitive information, this new accusation suggests more extensive censorship.", "chatgpt-4o-latest": "China has been accused of blocking access to Google News, according to media watchdog Reporters Without Borders. The group claims China is forcing users to rely on a censored Chinese edition that excludes critical reports. Google acknowledged the issue and is investigating. China is known for extensive internet censorship, with a net police force monitoring content and restricting access to politically sensitive information. Chinese portals and internet cafes also enforce strict controls. Reporters Without Borders criticized Google for launching a news service that complies with government restrictions. Google News aggregates content from 4,500 sources using an algorithm, offering multiple editions, including one for China. While Google does not filter politically sensitive news, it avoids linking to inaccessible sources to prevent broken links.", "stablelm2:1.6b": "China allegedly blocks access to Google News, causing its availability for several days. Reporters Without Borders claims the move aims to force users to use a Chinese edition of the site without critical reports. Google is investigating the issue, while the company said it was aware of the problems and working on understanding and resolving them. The search giant offers editions tailored for China and Hong Kong, but does not filter news results to remove politically sensitive information.", "granite3.1-dense:2b": "China reportedly blocked access to its English-language Google News site for 10 days, forcing users to view a censored Chinese edition that omits critical reports. Reporters Without Borders, a Paris-based media watchdog, claimed this action aimed to suppress alternative news sources. China is known to exert extensive internet censorship, controlling access through net police and gateway filtering. Popular Chinese portals monitor content, deleting politically sensitive comments, while all 110,000 net cafes use software to block harmful or subversive websites. Google acknowledged the issue, stating it was investigating to restore service for users in China. Despite offering 15 global editions of Google News, including one tailored for China, the company does not filter content, but does not link to inaccessible news sources due to broken links.", "reference": "\"China is censoring Google News to force internet users to use the Chinese version of the site which has been purged of the most critical news reports,\" said the group in a statement.\"It appears that many users in China are having difficulty accessing Google News sites in China and we are working to understand and resolve the issue,\" said a Google spokesperson.Google News gathers information from some 4,500 news sources.China has been accused of blocking access to Google News by the media watchdog, Reporters Without Borders.But Google does not link to news sources which are inaccessible from within China as this would result in broken links.The site does not filter news results to remove politically sensitive information.It said the aim was to force people to use a Chinese edition of the site which, according to the watchdog, does not include critical reports.Google told the BBC News website it was aware of the problems and was investigating the causes."}