{"raw_text": "Call for action on internet scam\n \n Phone companies are not doing enough to warn customers about internet \"rogue-dialling\" scams, according to premium phone line regulator Icstis.\n \n It has received 45,000 complaints in recent months about dial-up internet connections diverting to premium rate numbers without users' knowledge. Phone companies refuse to pay compensation because they say calls must be paid for. They must warn people earlier about possible fraud, Icstis said.\n \n People who use dial-up connections can be affected by the scams. Without realising, a program can be downloaded which diverts internet calls via a premium phone line. Victims often fail to notice until they receive an unusually high bill. Icstis spokesman Rob Dwight said: \"Phone companies should get in touch with their customers sooner. \"If my bill goes over the usual £50 a month I want to know about it straight away - I don't want to be told when it's hit £750.\"\n \n Phone companies had the systems in place to spot fraudulent activity and artificially-inflated traffic, he said. \"We alert them to the numbers that we have under investigation and they should be looking out for these numbers,\" he added.\n \n Telecoms ombudsman Elizabeth France said: \"Certainly I would not be surprised to find my credit card company phoning me if I do something out of the ordinary. \"So I would expect phone companies to be looking to see if they can have a similar approach.\" The biggest phone company BT says it is doing what it can to monitor fraud and warn people about rogue dialling. Its advice to customers is to use call barring if they want to prevent calls to premium lines because, under the current system, once the call has been made there's little that can be done.\n \n Gavin Patterson, group managing director for BT Consumer, said \"We do look at customer's calling patterns and we do make interventions when they are out of the ordinary. \"We're looking at the moment at whether we can improve this.\" But as BT handled 180 million calls a day monitoring was \"quite a task in itself\", he added. The government has ordered a review of premium line services and is likely to say Icstis should have more power to deal with rogue diallers in future. At the moment, it cannot demand pay-outs on the behalf of customer - it can only close illegal services down.\n \n I use free anti-virus software (AVG) and free firewall protection (ZoneAlarm). Both of these tools have prevented unauthorised access and outgoing calls inadvertently and innocently caused by my daughter's love of music sites. How about ISPs informing all customers of such facilities? The responsibility clearly falls with the customer but many fall prey through simply not knowing how to avoid these issues.\n \n Ignorance is and always has been an expensive business.\n \n Does any one know what happens once this fraud has been committed and recognised? The phone companies pay the people who obtaining money fraudulently, so are these people followed up and prosecuted ?\n \n These diallers are mainly downloaded from sites offering illegal MP3s, porn and pirated software. If people didn't visit such sites they'd be considerably less at risk. Whatever happened to personal responsibility? It seems everyone has to be a 'victim' these days!\n \n Part of the blame has to rest with the manufacturers of home computer operating systems. A secure system should not allow a web page or email to download and install anything without the user's knowledge.\n \n These scams are illegal and telephone companies should have nothing to do with them. They should refuse to pay money over to the perpetrators. Or are they themselves receiving such good returns that it is in their interest to keep the scam going?\n \n Why don't BT et al block all premium numbers by default and only turn it off at the customer's request? To anyone who falls foul of this scam - refuse to pay your telephone provider for these calls. After you notify your telephone provider of these fraudulent transactions, they cannot insist on you paying the bill. To do so would be to knowingly assist the fraudsters to commit the fraud. No customers have yet been taken to court for refusing to pay these bills.\n \n Disable or remove your modem and use broadband instead - then you have nothing to worry about. Or buy some decent firewall software and anti-virus. You would not walk out in the freezing cold without a coat - you would not drive your car without any insurance - so why not protect your PC? Stop blaming the phone companies - it's not their fault!\n \n I was very impressed with our phone company recently. I had kept ringing a hotline number for Kylie tickets and next day they rang back to ask if I was aware there were 40-odd calls to the same number. Great service. And I got the tickets as well!\n \n I have a colleague who has fallen victim to this kind of scam. He informed the phone company about it, they subsequently put a block on premium rate numbers. Three months later another huge bill of over £1,000 came in - the block apparently didn't work and he still has to pay for it, even though a block was in place. Phone companies are probably quite happy for their customers to be hit with a huge bill, otherwise they'd be taking extra steps to prevent this kind of problem.\n \n I have been scammed of £139. The operator will do nothing about this and, to add insult to injury, I was charged VAT by the government.\n \n Premium rate numbers have been subject to various scams ever since they were invented. One example was where thieves would set up a premium rate number and then dial it day and night from phones whose quarterly bills were never paid. The telephone company was the victim here and you can bet that loophole was blocked very quickly.\n \n I know people who have run up large bills, despite being IT-literate. From talking to BT in Belfast, I believe that they will shortly be giving out a free application that can stop you dialling expensive numbers without knowing. It's not the fault of phone companies, and at last they are doing something about it.\n \n It's about time that the profiteering by the 'legitimate' phone companies came to an end, mainly by doing away with dial-up altogether and bring broadband down to the same price as dial-up! Not only will this ruin things for the dialler scammers but also allow people to update and upgrade their security more easily and quickly.\n \n I haven't \"fallen victim to a rogue-dialling scam\" but I think you're seriously remiss in not pointing out that the vast majority of these scams arise from people trying to access services purporting to provide free pornography. In most cases the user is entirely at fault, which is probably why the telephone companies are rightly unwilling to refund them.\n \n My telephone supplier did not inform me that my monthly bill had risen from its normal £3 to £5, to £320. This was because of the scam. They simply billed me. What particularly galls me, over and above having over £300 stolen, is that the supplier and the government (through VAT) are profiting from this crime and will not reimburse me their portion of my losses.\n \n How about an automatic monthly cap of say £20 on premium rate calls that you would have to contact your provider to have lifted? That way you could use legitimate premium rate numbers while limiting fraudulent usage. At least any disputed amount would be limited, far easier for a telecoms operator to write off £20 than it is £750.\n \n A few years back I was also the target of such scams but thank God I have already upgraded to broadband and nothing was connected to my modem so all I heard was the sound of an attempted connection.\n \n How about home users take some responsibility and ensure their anti-virus and firewall software is up to date? That should prevent the vast majority of these scams.\n", "llama3.2:1b": "Phone companies are not doing enough to warn customers about internet \"rogue-dialling\" scams, which involve dial-up internet connections diverting premium rate numbers without users' knowledge. The regulator Icstis has received 45,000 complaints in recent months about such scams, with victims often failing to notice until they receive unusually high bills.\n\nPhone companies should be more proactive in spotting and preventing these scams, rather than simply paying compensation to those who have been scammed. They can use their systems to alert customers of suspicious activity and block premium rate numbers from being dialed.\n\nThe main issue is that phone companies are reluctant to refund victims due to the potential revenue loss from billing for premium rates. The government has ordered a review of premium line services, which may lead to increased regulation of these services in future.\n\nPhone users can help prevent scams by disabling their modems and using broadband instead, or installing decent anti-virus software and firewalls. Home users should also take responsibility for ensuring their software is up to date to prevent such scams.", "llama3.2:3b": "Phone companies are not doing enough to warn customers about internet \"rogue-dialling\" scams, which divert internet calls to premium rate numbers without users' knowledge. Icstis has received 45,000 complaints and says phone companies should inform customers sooner about possible fraud. Victims often fail to notice until they receive an unusually high bill. Telecoms ombudsman Elizabeth France suggests that phone companies should have a similar approach as credit card companies alerting customers to unusual activity. BT claims it monitors fraud but acknowledges the task of monitoring 180 million calls daily is challenging.", "gemma2:2b": "Phone companies are not doing enough to warn customers about internet scam \"rogue-dialling\".  Complaints are high, victims face large bills without compensation, and phone companies argue that they only pay when a call goes through. The Icstis regulator suggests greater action from phone companies and a review of premium rate services by the government.\n\nWhile some point to ISP responsibility in protecting users, others blame online sites offering illegal content and software. Many victims are unaware of these scams until bills arrive, leading to large charges that may not be covered by compensation or refunds. BT is doing what it can to monitor for fraud but acknowledges a need for more effective monitoring. \n\nThe solution is not just about responsibility; it's also about consumer education and empowering users to protect themselves with adequate security software. Some suggest implementing automatic monthly caps on premium rate calls, while others argue that the onus is on customers to be aware of how their devices are connected to the internet.  \n\n\n", "qwen2.5:0.5b": "Phone companies are not doing enough to warn customers about rogue-dialling scams, which have received 45,000 complaints in recent months from users who were diverted to premium rate numbers without their knowledge. According to Icstis, a premium phone line regulator, if the user calls for services with this type of scam, it is often difficult for them to be contacted by the telephone company. In order to prevent such scams from happening again, Icstis has suggested that the user informs the telephone company and that they should stop paying money in order to avoid being charged for the call. For home users, the government has ordered a review of premium line services and is likely to say that phone companies should be prevented from paying money over to the perpetrators instead.", "qwen2.5:1.5b": "Phone companies failing to warn customers about internet \"rogue-dialling\" scams, with victims receiving high bills without notice due to premium rate calls diverted by programs on dial-up connections. Icstis recommends earlier customer notification for fraud detection and prevention. BT has improved its monitoring but still lacks the ability to intervene proactively across 180 million daily calls. The government plans to increase Icstis's power over rogue callers.", "qwen2.5:3b": "Call for action on internet scam\n\nPhone companies are not adequately warning customers about \"rogue-dialling\" scams targeting dial-up internet connections, resulting in thousands of complaints from unsuspecting users who have been charged for premium rate calls they were unaware of. Icstis, the regulator for premium phone lines, has called for phone companies to warn people earlier and monitor fraudulent activity more effectively.\n\nWithout proper protection, both dial-up and broadband users are at risk. People should use call barring and invest in quality anti-virus software and firewalls. The government is reviewing premium line services with a view to giving Icstis more power to combat scams. \n\nSome suggest phone companies should take stronger measures against rogue-dialling. Others recommend ISPs provide all customers with free security tools. It’s also suggested that premium rate numbers be automatically capped at a modest monthly amount, with billing disputes being limited.", "opencoder:1.5b": "Phone companies are being exploited for illegal activities such as roguelisting scams, which include calling numbers that seem legitimate but are actually fraudulent, causing unnecessary disputes and losses to users. It's important to understand that the legitimate consumers have the right to know when they're calling numbers are safe and legitimate. However, once these scams take place, it becomes increasingly difficult for businesses to protect themselves from legal consequences.\n\nThe government has also made significant efforts in combating roguelisting scams to protect against fraud. This includes regulations that provide customers with tools and information to detect, prevent, and recover from fraudulent activities.\n\nAs a result, I'm glad we've been able to keep these scams at bay and focus on other legitimate aspects of our business, such as improved customer service, more efficient system design, and reliable product development. However, it's essential to remain aware of this evolving threat and stay up-to-date with the latest regulations and developments in the cybersecurity industry.\n", "smollm:1.7b": "I completely agree with you! It's great that you're taking proactive steps to protect yourself from these types of scams, but it's also important to recognize that the telephone companies are not entirely innocent in these cases. They can be held responsible for facilitating or enabling these scams through their lack of transparency and inadequate customer support.\n\nIt's refreshing to see that your supplier is willing to work with you to resolve the issue and provide a solution, but it's also important to hold them accountable for their role in perpetuating these scams. By being proactive and taking steps to protect yourself from these types of scams, you can help prevent others from falling victim to similar schemes.\n\nAdditionally, it's great that you're considering ways to limit the damage caused by these scams, such as using a premium rate number or contacting your provider to have an attempted connection lifted. These actions can help reduce the financial impact and make it easier for you to recover from the scam.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely while preserving the key ideas and details. Let's go through it step by step.\n\nFirst, the main topic is about internet scam threats faced by phone companies in England. The text mentions that premium phone lines aren't doing enough to warn customers, especially regarding a type of scam called \"rogue-dialling.\"\n\nThe user then talks about the statistics: 45,000 complaints where dial-up connections are redirected without users' knowledge. Phone companies refuse to pay compensation because they claim calls must be paid for. The key point here is that these companies should warn customers earlier and make interventions if there's unusual behavior.\n\nThere's a mention from Rob Dwight that phone companies should contact their customers sooner. He suggests they alert customers to numbers under investigation and watch out for fraudulent activity, which includes artificial downloads that divert calls via premium lines. Users often overlook this until they notice, like when they get a high bill. The user also points out that these systems help the company spot fraud.\n\nThe text then goes into details about BT, which is one of the largest phone companies, stating it's doing its best to monitor and warn customers. It warns against using call-barred options because once calls are made, little can be done. However, there's a mention that BT handled over 180 million calls daily monitoring, which was a \"task in itself,\" suggesting their workload was heavy.\n\nThe government is reviewing premium line services to address the issue and has ordered more power for companies handling these lines. This includes telling customers directly via anti-virus or firewall software. The user also points out that without such measures, there's no recourse for customers if they're affected.\n\nThere are references to various scams, like illegal MP3s, porn, and pirated software. These can trick users into paying extra for services they don't need. The text notes that many phone companies end up charging extra fees due to these issues, which is often a result of the scammers profiting from the scam without reimbursement.\n\nThe user also mentions specific examples, like someone being scammed £139 and having their VAT bill increased because of a scam. Another example involves BT giving out free software to block premium rates if they suspect it was set up by thieves.\n\nIn terms of future steps, the text suggests taking responsibility as users by ensuring their anti-virus and firewall software is updated. It also notes that home users should be proactive about updating their devices to avoid similar scams in the future.\n\nPutting this all together, I need to condense all these points into a concise summary without losing any important details.\n</think>\n\n England's phone companies face an increasing challenge from rogue-dialling scammers targeting customers via premium lines. Key points include:\n\n1. **Statistics and Concerns**: 45,000 complaints where dial-up connections were redirected without user knowledge. Companies refuse to refund for undelivered calls, warning users of fraudulent downloads.\n\n2. **Customer Intervention**: Phone companies should contact customers sooner with warnings about under investigation numbers and fraudulent activity, emphasizing the need for intervention if unusual behavior is detected.\n\n3. ** bt's Role**: The largest operator (BT) actively manages fraud by blocking premium rates using anti-virus or firewall software. They monitor over 180 million calls daily.\n\n4. **Government Actions**: To address the issue, the government reviews premium lines and requires companies to update anti-virus software, providing direct recourse for users if blocked.\n\n5. **Scams and Profits**: Scammers exploit services like free pornography, pirated software, and fake websites to trick users into paying extra. Many phone companies end up charging additional fees due to these scams.\n\n6. **Future Steps**: Users should update anti-virus or firewall software to prevent future scams, enhancing their protection against online threats.", "tinyllama:1.1b": "Summarize the output concisely, preserving key ideas and details.\n\nPhone companies are not doing enough to warn customers about internet \"rogue-dialling\" scams, according to premium phone line regulator Icsitis. But Phone Companies had the systems in place to spot fraudulent activity and artificially-inflated traffic, which they informed their customers about. However, there are loopholes, as most scams arise from people trying to access services purporting to provide free pornography. Telecoms operators should limit fraudulent usage and have an automatic monthly cap on premium rate calls that users could use while limiting the amount of disputeed amounts written off. A few years ago, a user was targeted by such scams but already upgraded to broadband and nothing was connected to his modem, preventing most attacks.", "tinydolphin:1.1b": " The telephone industry has taken many steps to protect customers from being victimized by fraudulent calls. The Icstis regulator has proposed a new system whereby all premium rate numbers would have to be automatically blocked for all callers. This move would ensure that fraudsters can no longer profit from these numbers, which are used to make large, unauthorized payments.\n\nSimilarly, BT is introducing a system in which they will block premium rate calls from being automatically connected to their phones. This will help to prevent users from falling victim to these scams by simply connecting to an unknown number without proper authentication.\n\nHowever, while the telephone companies are taking steps to protect customers from fraudulent charges, there are still issues that they must address. For example, some people may be surprised to find out that their monthly bill has risen due to fraudulent activity. This is a significant issue for many consumers who rely on their phone company for their communication needs.\n\nIn addition, the UK government is considering introducing a cap on the amount of premium rate calls that can be made without authentication. This would ensure that legitimate services do not face disproportionate costs due to fraudulent activity.\n\nOverall, while there has been some progress in preventing fraud and ensuring that customers are protected from scams, there is still much work to be done in order to make the telephone industry a safer place for all users.", "phi:2.7b": " The phone companies are not doing enough to warn customers about internet \"rogue-dialling\" scams, according to a premium phone line regulator. The text emphasizes that people who use dial-up connections can be affected by the scams and often fail to notice until they receive an unusually high bill. Icstis has received 45,000 complaints in recent months about unauthorized access and diversion of internet calls to premium rate numbers without users' knowledge. Phone companies refuse to pay compensation as calls must be paid for, so Icstis is urging them to warn people earlier about possible fraud. The telecoms ombudsman also agrees that phone companies should do more to prevent fraudulent activity. BT, the largest phone company, says it's looking into improving its monitoring of customer call patterns and warning systems. However, many of these scams are caused by users visiting illegal sites for music, porn, and pirated software downloads. The responsibility ultimately falls on the user to use anti-virus and firewall protection. Phone companies should not be held responsible for fraudulent activity committed through their services, but they can take steps to prevent it from happening in the first place.\n", "orca-mini:3b": " \n Telephone companies should be more proactive in warning customers about internet \"rogue-dialling\" scams, as many customers fall victim to these fraudulent activities without knowing it. Customers can protect themselves by using a reliable anti-virus software and firewall protection, keeping their modem connected to the internet with a wired connection, and avoiding clicking on suspicious links or downloading unknown files. They should also report any suspicious calls to the authorities or their telephone company, and take necessary measures to limit their exposure to these scams.", "hermes3:3b": "Phone companies need to warn customers more about internet \"rogue-dialling\" scams, as they are not doing enough to protect against them and causing financial damage. Users may fall victim when programs download and divert calls via premium phone lines without their knowledge, leading to unexpectedly high bills. Phone companies should use systems in place to spot fraudulent activity.", "stablelm-zephyr:3b": "Icstis, a premium phone line regulator, has received 45,000 complaints in recent months about internet \"rogue-dialling\" scams involving dial-up internet connections diverting to premium rate numbers without users' knowledge. Phone companies refuse to pay compensation as they argue calls must be paid for. Icstis believes that phone companies should warn people earlier about possible fraud and take responsibility for their customers' safety and security. The biggest phone company, BT, says it is doing what it can to monitor fraud and warn people, but the government may order a review of premium line services with Icstis potentially having more power to deal with rogue diallers in future. Some blame must also be placed on the manufacturers of home computer operating systems for allowing web pages or emails to download and install without user knowledge or control.", "chatgpt-4o-latest": "Premium phone line regulator Icstis has called for phone companies to do more to warn customers about internet \"rogue-dialling\" scams, where dial-up internet connections are unknowingly diverted to premium rate numbers, leading to high bills. Despite receiving 45,000 complaints, phone companies refuse compensation, arguing that calls must be paid for. Icstis urges earlier fraud warnings, as companies have systems to detect unusual activity. Telecoms ombudsman Elizabeth France suggests phone companies should monitor customer usage like credit card firms do. BT claims to monitor fraud but acknowledges the challenge of tracking 180 million daily calls. The government is reviewing premium line services and may grant Icstis more power. Some argue that users should take responsibility by using firewalls and antivirus software, while others blame phone companies for profiting from the scams. Suggestions include blocking premium numbers by default, setting spending caps, and transitioning to broadband to avoid dial-up fraud.", "stablelm2:1.6b": "Premium phone line regulator Icstis claims that phone companies are not doing enough to warn customers about internet \"rogue-dialling\" scams, which can divert internet calls via a premium phone line without users' knowledge. Phone companies refuse to pay compensation because they say calls must be paid for. The government has ordered a review of premium line services and is likely to grant more power to deal with rogue diallers in the future. Without realizing it, one can download programs that divert internet calls via a premium phone line, leading to unusually high bills. However, BT et al are considering measures such.\n  \nThe article also discusses various ways to protect against these scams, including using free anti-virus software and firewalls, blocking premium numbers by default or only turning them off at the customer's request, informing customers of such facilities upfront, and ensuring they keep their security up-to-date. It emphasizes that profiteering by legitimate phone companies should come to an end, mainly by doing away with dial-up altogether and bringing broadband down to the same price as dial-up.", "granite3.1-dense:2b": "Internet \"rogue-dialling\" scams are prevalent, affecting dial-up internet users who unknowingly make calls through premium rate lines. Regulator Icstis has received 45,000 complaints and emphasizes that phone companies should proactively warn customers about this fraud, as they have the capability to detect suspicious activity. Despite having systems in place, major phone company BT claims it's doing its best to monitor fraud and alert customers when unusual call patterns emerge.\n\nPhone companies refuse compensation, citing that calls must be paid for. However, Icstis spokesman suggests they should instead focus on preventing such high bills by implementing automatic monthly caps on premium rate calls or providing free applications to block these numbers. BT has shown positive results with proactive customer service, identifying and addressing anomalous call patterns before excessive charges occur.\n\nCritics argue that users themselves are primarily responsible for falling prey to these scams due to their actions in accessing supposedly free adult content. They propose that home users should prioritize maintaining up-to-date anti-virus software and firewalls as the most effective means of preventing rogue-dialling incidents.\n\nAdditionally, there is a growing sentiment that phone companies would end their profiteering from dial-up services by phasing out dial-up altogether and making broadband comparable in price to dial-up. This approach aims to minimize both the financial impact of fraudulent activities on users and the potential profits for scammers while allowing users to upgrade security measures more readily.", "reference": "Phone companies are not doing enough to warn customers about internet \"rogue-dialling\" scams, according to premium phone line regulator Icstis.I was very impressed with our phone company recently.Phone companies refuse to pay compensation because they say calls must be paid for.The biggest phone company BT says it is doing what it can to monitor fraud and warn people about rogue dialling.These scams are illegal and telephone companies should have nothing to do with them.One example was where thieves would set up a premium rate number and then dial it day and night from phones whose quarterly bills were never paid.The phone companies pay the people who obtaining money fraudulently, so are these people followed up and prosecuted ?He informed the phone company about it, they subsequently put a block on premium rate numbers.\"So I would expect phone companies to be looking to see if they can have a similar approach.\"Stop blaming the phone companies - it's not their fault!The telephone company was the victim here and you can bet that loophole was blocked very quickly.Icstis spokesman Rob Dwight said: \"Phone companies should get in touch with their customers sooner.Phone companies are probably quite happy for their customers to be hit with a huge bill, otherwise they'd be taking extra steps to prevent this kind of problem.This was because of the scam.Its advice to customers is to use call barring if they want to prevent calls to premium lines because, under the current system, once the call has been made there's little that can be done.It has received 45,000 complaints in recent months about dial-up internet connections diverting to premium rate numbers without users' knowledge.Without realising, a program can be downloaded which diverts internet calls via a premium phone line.Phone companies had the systems in place to spot fraudulent activity and artificially-inflated traffic, he said.How about an automatic monthly cap of say £20 on premium rate calls that you would have to contact your provider to have lifted?Premium rate numbers have been subject to various scams ever since they were invented.A few years back I was also the target of such scams but thank God I have already upgraded to broadband and nothing was connected to my modem so all I heard was the sound of an attempted connection.I haven't \"fallen victim to a rogue-dialling scam\" but I think you're seriously remiss in not pointing out that the vast majority of these scams arise from people trying to access services purporting to provide free pornography.The government has ordered a review of premium line services and is likely to say Icstis should have more power to deal with rogue diallers in future.I had kept ringing a hotline number for Kylie tickets and next day they rang back to ask if I was aware there were 40-odd calls to the same number.To anyone who falls foul of this scam - refuse to pay your telephone provider for these calls.I have a colleague who has fallen victim to this kind of scam.Three months later another huge bill of over £1,000 came in - the block apparently didn't work and he still has to pay for it, even though a block was in place.It's about time that the profiteering by the 'legitimate' phone companies came to an end, mainly by doing away with dial-up altogether and bring broadband down to the same price as dial-up!That way you could use legitimate premium rate numbers while limiting fraudulent usage.People who use dial-up connections can be affected by the scams."}