{"raw_text": "New browser wins over net surfers\n \n The proportion of surfers using Microsoft's Internet Explorer (IE) has dropped to below 90%, say web analysts.\n \n Net traffic monitor, OneStat.com, has reported that the open-source browser Firefox 1.0, released on 9 November, seems to be drawing users away from IE. While IE's market share has dropped 5% since May to 88.9%, Mozilla browsers - including Firefox - have grown by 5%. Firefox is made by the Mozilla Foundation which was set up by former browser maker Netscape in 1998. Although there have been other preview versions of Firefox, version 1.0 was the first complete official program. \"It seems that people are switching from Microsoft's Internet Explorer to Mozilla's new Firefox browser,\" said Niels Brinkman, co-founder of Amsterdam-based OneStat.com.\n \n Mozilla browsers - including Firefox 1.0 - now have 7.4% of the market share, the figures suggest. Mozilla said that more than five million have downloaded the free software since its official release. Supporters of the open-source software in the US managed to raise $250,000 (£133,000) to advertise the release of Firefox 1.0 in The New York Times, and support the Mozilla Foundation. There was a flurry of downloads on its first day of release.\n \n The figures echo similar research from net analyst WebSideStory which suggested that IE had 92.9% of users in October compared to 95.5% in June. Microsoft IE has dominated the browser market for some time after taking the crown from Netscape, and its share of users has always stayed at around the 95% mark. Firefox is attractive to many because it is open-source. That means people are free to adapt the software's core code to create other innovative features, like add-ons or extensions to the program. Fewer security holes have also been discovered so far in Firefox than in IE. Paul Randle, Microsoft Windows Client product manager, responded to the figures: \"We certainly respect that some customers will choose alternative browsers and that choosing a browser is about more than a handful of features. \"Microsoft continues to make significant investments in IE, including Service Pack 2 with advanced security technologies, and continues to encourage a vibrant ecosystem of third party add-ons for Internet Explorer.\" Firefox wants to capture 10% of the market by the end of 2005. Other browser software, like Opera and Apple's Safari, are also challenging Microsoft's grip on the browser market. Opera is set to release its version 7.60 by the end of the year. OneStat.com compiled the statistical measurements from two million net users in 100 countries.\n", "llama3.2:1b": "Microsoft Internet Explorer (IE) has dropped below 90% of users, with Mozilla Firefox gaining ground and now holding 7.4% market share after Firefox's first official release, while IE's market share has decreased by 5% since May to 88.9%.", "llama3.2:3b": "Microsoft Internet Explorer's market share has dropped below 90%, while Mozilla browsers, including Firefox 1.0, have grown by 5%. Firefox 1.0 has been downloaded over five million times since its release, and Mozilla now holds around 7.4% of the market share.", "gemma2:2b": "Microsoft's Internet Explorer (IE) has seen a decline in user share, falling below 90%. Open-source browser Firefox 1.0 is gaining traction, with Mozilla browsers growing while IE's market share shrinks.  Firefox has more than five million downloads since its official release and supporters raised $250,000 for advertising.  Competition from other browsers like Opera and Apple's Safari is also impacting IE's dominance. Firefox aims to reach 10% market share by the end of 2005. \n", "qwen2.5:0.5b": "Key ideas:\n\n- New browser Firefox 1.0 released on November 9, 2004, is drawing users away from Microsoft Internet Explorer (MSIE) as a competitor.\n- Mozilla Foundation made Firefox 1.0 open-source and free software; it has become the first official version of Firefox since Netscape's decline.\n- Mozilla uses five million downloads in its first day of release, which prompted web analyst WebSideStory to suggest that IE had about 92. 9% of Internet Explorer users at the end of October compared with around 95. 5% in June 2004.\n- Opera Software is set to release version 7. 60 of its browser in December, while Microsoft's own Safari 7. 6 will be released in January 2005.\n\nSummary: Mozilla Firefox 1. 0 has become the first official version of the free and open-source Firefox browser since Netscape left Internet Explorer dominance.", "qwen2.5:1.5b": "Microsoft's Internet Explorer has lost more than half of its users to Mozilla's Firefox, as reported by web analysts. Firefox gained a significant market share and attracted over five million downloads since its release on November 9th. Mozilla's open-source browser is favored for its accessibility and security features compared to Microsoft's IE. Firefox aims to capture 10% of the market by year-end, challenging Microsoft's dominance in the browser industry.", "qwen2.5:3b": "The open-source Firefox browser has gained significant traction, with a share increasing from below 90% for Internet Explorer (IE) to over 8%. Web analysts report that IE's market share dropped by 5% since May, while Mozilla browsers, including Firefox, grew by 5%, suggesting more users are switching to Firefox. The open-source nature of Firefox, allowing customization and fewer security vulnerabilities compared to IE, is a major attraction for users. Mozilla Foundation received over $250,000 to promote the software release in The New York Times. Firefox aims to capture 10% of the market by year-end, with competition from other browsers like Opera and Apple's Safari also intensifying.", "opencoder:1.5b": "New browser wins over net surfers\n\nThe proportion of surfers using Microsoft's Internet Explorer (IE) has dropped to below 90%, reported by web analysts, OneStat.com. While IE's market share has dropped 5% since May to 88.9%, Mozilla browsers - including Firefox - have grown by 5%. Firefox is made by the Mozilla Foundation which was established in 1998. A preview version of Firefox, like version 1.0, was reported as the first complete official program. \"It seems that people are switching from Microsoft's Internet Explorer to Mozilla's new Firefox browser,\" said Niels Brinkman, co-founder of Amsterdam-based OneStat.com. Mozilla browsers now have 7.4% of the market share compared to IE, similar research by WebSideStory. While IE had 92.9% of users in October compared to 95.5% in June, Microsoft's IE has always stayed at around the 95% mark. Firefox is attractive to many because it is open-source software. The figures echoed similar research from net analysts, suggesting that IE had 92.9% of users in October compared to 95.5% in June. Microsoft continues to make significant investments in IE like Netscape, and continues to promote a vibrant ecosystem of third party add-ons for Internet Explorer. Firefox wants to capture 10% of the market by the end of 2005. Other browser software, like Opera and Apple's Safari, are also challenging Microsoft's grip on the browser market. Opera is set to release version 7.60 in October as part of a broader strategy to increase accessibility for the web. OneStat.com compiled the statistical measurements from two million net users in 100 countries.\n", "smollm:1.7b": "The summary should be:\nNew browser wins over net surfers\n\nThe proportion of surfers using Microsoft's Internet Explorer (IE) has dropped to below 90%, say web analysts. While IE's market share has dropped 5% since May to 88.9%, Mozilla browsers - including Firefox - have grown by 5%. Firefox is made by the Mozilla Foundation which was set up by former browser maker Netscape in 1998. Although there have been other preview versions of Firefox, version 1.0 was the first complete official program. \"It seems that people are switching from Microsoft's Internet Explorer to Mozilla's new Firefox browser,\" said Niels Brinkman, co-founder of Amsterdam-based OneStat.com.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text concisely. First, let me read through it carefully.\n\nThe main point is about the market share of Microsoft's Internet Explorer (IE) versus Mozilla's Firefox browser. The analysis says IE has dropped from around 95% in 2014 to below 90%. Firefox shows a significant rise since then with a 5% increase, making its market share now at 7.4%.\n\nI should mention that the figures show a switch from IE to Firefox. Mozilla's support was substantial, and they're still gaining traction because of their open-source nature.\n\nAlso, I need to include details about the initial release, downloads on day one, and how users are considering alternative browsers. It's important to note that Microsoft continues to invest in security features for IE but also has some third-party alternatives like Opera and Safari.\n\nI should structure this into a clear summary without explanations or formatting.\n</think>\n\nThe market share of Microsoft's Internet Explorer (IE) dropped below 90%, while Mozilla's Firefox browser saw a significant rise, reaching around 7.4% of the market share since IE's decline from 95% in 2014 to 88.9%. Mozilla's support was substantial, and its open-source nature gave them an attractive ecosystem. downloads on its initial release were notable, with more than five million users accessing the free software since its official launch. Windows Customer Product Manager Paul Randle emphasized that browser choices aren't just about features but also about innovation. Firefox aims to capture 10% of the market by 2005 while competitors like Opera and Apple's Safari are challenging Microsoft's dominance.", "tinyllama:1.1b": "According to web analysts, the proportion of users who are using Microsoft's Internet Explorer (IE) has dropped below 90% since its release on November 9th, and Mozilla browsers have grown by 5%. Firefox is making inroads into the browser market with a 7.4% share of the total market, as reported by OneStat.com. Mozilla's open-source software attracts many users because it allows for more innovative features like add-ons and extensions. Despite Microsoft's efforts to capture a slice of the browser market, Firefox hopes to garner 10% of the market within the next year. Other browsers like Opera and Apple's Safari are also challenging Microsoft's grip on the browser market.", "tinydolphin:1.1b": " A new browser has overtaken Microsoft's Internet Explorer (IE) in popularity among net surfers, with a market share of around 90%. In October, IE fell to 92.9% of total internet use compared to 95.5% in June, according to net analyst WebSideStory. This shift occurred despite the launch of the more expensive and feature-rich version of Internet Explorer, known as IE7. Firefox by Mozilla has gained considerable traction among users, who are switching away from IE to the open-source browser Firefox. In comparison to IE, Firefox has seen a much smaller percentage drop in usage since May, having reached 88.9%. Firefox now holds a market share of around 5%, suggesting that it is attracting users more than 50% away from Internet Explorer. The figures from Niels Brinkman, co-founder of the Mozilla Foundation, suggest that this shift towards open-source software could be indicative of an overall shift towards alternative browser options among internet users.", "phi:2.7b": " The summary of the text is: \n Mozilla's Firefox 1.0 has been gaining popularity as more surfers switch from Microsoft'S Internet Explorer to its open-source alternative, with 7.4% market share and 5.5 million downloads since its release in November. This follows a similar trend from Netscape's competitor, which saw its IE usage drop to below 90%. Mozilla's Firefox is attractive to users due to its open-source nature, allowing for customization and fewer security holes compared to Microsoft's software. Despite the market dominance of IE, other browsers like Opera and Safari are also challenging Microsoft's grip on the browser market.\n", "orca-mini:3b": " The proportion of web surfers using Microsoft's Internet Explorer (IE) has dropped to below 90%, according to web analytics firm OneStat.com. Firefox 1.0, released on November 9th, has been attracting users away from IE, reported Niels Brinkman, co-founder of Amsterdam-based OneStat.com. Mozilla browsers have gained 5% market share since the official release of Firefox 1.0, with more than five million downloads on its first day. The figures echo similar research from web analytics firm WebSideStory, which suggested that IE had 92.9% of users in October compared to 95.5% in June. While Microsoft's IE has dominated the browser market for some time after taking the crown from Netscape, its share of users has always stayed at around the 95% mark. Firefox is attractive to many because it is open-source, meaning people are free to adapt the software's core code to create other innovative features like add-ons or extensions. Fewer security holes have also been discovered in Firefox than in IE. Paul Randle, Microsoft Windows Client product manager, responded to the figures: \"We certainly respect that some customers will choose alternative browsers and that choosing a browser is about more than a handful of features. We continue to encourage a vibrant ecosystem of third-party add-ons for Internet Explorer.\" Mozilla wants to capture 10% of the market by the end of 2005, and other browser software like Opera and Apple's Safari are also challenging Microsoft's grip on the browser market.", "hermes3:3b": "Firefox browser overtake IE in web usage, reducing IE's share below 90%, while Firefox gains 5%.", "stablelm-zephyr:3b": "Internet Explorer's share of surfers has dropped below 90%, according to web analysts, with Firefox 1.0 drawing users away from Microsoft's browser. Mozilla browsers, including Firefox, have grown by 5%. OneStat.com found that more than five million people downloaded Firefox since its official release. This open-source software is attractive due to the ability to adapt its core code and fewer security holes compared to Internet Explorer. Other browsers, such as Opera and Apple's Safari, are also challenging Microsoft's dominance in the market.", "chatgpt-4o-latest": "The market share of Microsoft's Internet Explorer (IE) has dropped below 90% as users switch to Mozilla's Firefox 1.0, according to web analysts. OneStat.com reports that IE's share has declined by 5% since May to 88.9%, while Mozilla browsers, including Firefox, have gained 5%, now holding 7.4% of the market. Firefox, officially released on 9 November, has been downloaded over five million times. Supporters raised $250,000 to advertise it in The New York Times. Firefox's appeal lies in its open-source nature, allowing customization, and its fewer security vulnerabilities compared to IE. Microsoft acknowledges competition but emphasizes its continued investment in IE. Firefox aims for a 10% market share by the end of 2005, while other browsers like Opera and Safari also challenge IE's dominance. OneStat.com gathered data from two million users in 100 countries.", "stablelm2:1.6b": "The share of internet surfers using Microsoft's Internet Explorer has dropped below 20%, according to web analysts, as open-source browser Firefox grabs users away. Market share for Mozilla browsers (including Firefox) has grown by 5%. According to figures from OneStat.com, Firefox now holds 7.4% of the market share, with more than five million downloads since its official release in November 2002. Microsoft's IE has dominated the browser market for a while, but Firefox's attractiveness due to open-source status and fewer security issues compared to IE has drawn users away. Other browsers like Opera and Safari are also challenging Microsoft's hold on the browser market.", "granite3.1-dense:2b": "Web analysts report a shift in browser preference, with Microsoft's Internet Explorer (IE) losing ground and Mozilla Firefox gaining traction. IE's market share has dropped to 88.9%, down 5% since May, while Mozilla browsers, including Firefox 1.0, now hold 7.4%. This growth is attributed to Firefox's open-source nature, allowing users to customize features, and fewer security vulnerabilities compared to IE. Firefox, launched in November, has seen over five million downloads post-release, with supporters raising $250,000 for advertising. Similar research from WebSideStory indicates a similar trend of declining IE market share (from 95.5% in June to 92.9% in October). Microsoft remains committed to IE development, including the upcoming Service Pack 2 with enhanced security features and third-party add-ons. Firefox aims to capture 10% of the market by year's end, while other browsers like Opera (version 7.60) and Apple's Safari also challenge Microsoft's browser dominance.", "reference": "Mozilla browsers - including Firefox 1.0 - now have 7.4% of the market share, the figures suggest.While IE's market share has dropped 5% since May to 88.9%, Mozilla browsers - including Firefox - have grown by 5%.Net traffic monitor, OneStat.com, has reported that the open-source browser Firefox 1.0, released on 9 November, seems to be drawing users away from IE.Firefox is made by the Mozilla Foundation which was set up by former browser maker Netscape in 1998.\"It seems that people are switching from Microsoft's Internet Explorer to Mozilla's new Firefox browser,\" said Niels Brinkman, co-founder of Amsterdam-based OneStat.com.Microsoft IE has dominated the browser market for some time after taking the crown from Netscape, and its share of users has always stayed at around the 95% mark.Other browser software, like Opera and Apple's Safari, are also challenging Microsoft's grip on the browser market.Firefox wants to capture 10% of the market by the end of 2005.Supporters of the open-source software in the US managed to raise $250,000 (£133,000) to advertise the release of Firefox 1.0 in The New York Times, and support the Mozilla Foundation."}