{"raw_text": "Musical future for phones\n \n Analyst Bill Thompson has seen the future and it is in his son's hands.\n \n I bought my son Max a 3G phone, partly because they are so cheap and he needed a phone, and partly because I am supposed to know about the latest technology and thought I should see how they work in real life. After using it for a while I am not at all tempted to get rid of my SonyEricsson P800 smart phone. That has a relatively large screen, even if it does only have slower GPRS access to the network. I can read my e-mail, surf the web using a proper browser and write stuff using the stylus on its touch screen. Last week someone e-mailed me a document that had been compressed into a ZIP file, and I was pleasantly surprised to discover that my phone even knew how to decompress it for me. By contrast the confusing menus, complicated keyboard and truly irritating user interface of Max's 3G phone simply get in the way, and I did not see much value in the paid-for services, especially the limited web access. The videos of entertainment news, horoscopes and the latest celebrity gossip did not appeal, and I did not see how the small screen could be useful for any sort of image, never mind micro-TV.\n \n But then Max started playing, and I realised I was missing the point entirely.\n \n It is certainly not a great overall experience, but that is largely due to the poor menu system and the phone layout: the video content itself is compelling. The quality was at least as good as the video streaming from the BBC website, and the image is about the same size. Max was completely captivated, and I was intrigued to discover that I had nearly missed the next stage of the network revolution. It is easy to be dismissive of small screens, and indeed anyone of my generation, with failing eyesight and the view that 'there's never anything worth watching on TV', is hardly going to embrace these phones. But just as the World Wide Web was the \"killer application\" that drove internet adoption, music videos are going to drive 3G adoption. With Vodafone now pushing its own 3G service, and 3 already established in the UK, video on the phone is clearly going to become a must-have for kids sitting on the school bus, adults waiting outside clubs and anyone who has time to kill and a group of friends to impress.\n \n This will please the network operators, who are looking for some revenue from their expensively acquired 3G licences. But it goes deeper than that: playing music videos on a phone marks the beginning of a move away from the 'download and play' model we have all accepted for our iPods and MP3 players. After all, why should I want to carry 60GB of music and pictures around with me in my pocket when I can simply listen to anything I want, whenever I want, streamed to my phone? Oh - and of course you can always use the phone to make voice calls and send texts, something which ensures that it is always in someone's pocket or handbag, available for other uses too. I have never really approved of using the Internet Protocol (IP), to do either audio or video streaming, and I think that technically it is a disaster to make phone calls over the net using \"voice over IP\".\n \n But I have to acknowledge that the net, at least here in the developed Western countries, is fast and reliable enough to do both.\n \n I stream radio to my computer while I work, and enjoy hearing the bizarre stations from around the world that I can find online but nowhere else. I am even playing with internet telephony, despite my reservations, and I appear on Go Digital on the World Service, streamed over the web each week. But 3G networks have been designed to do this sort of streaming, both for voice and video, which gives them an edge over net-based IP services. The 3G services aren't quite there yet, and there is a lot to be sorted out when it comes to web access and data charges. Vodafone will let you access its services on Vodafone Live! as part of your subscription cost but it makes you pay by the megabyte to download from other sites - this one, for example. This will not matter to business users, but will distort the consumer market and keep people within the phone company's collection of partner sites, something that should perhaps be worrying telecoms regulator Ofcom. But we should not see these new phones simply as cut-down network terminals. If I want fast access to my e-mail I can get a 3G card for my laptop or hook up to a wireless network. The phone is a lot more, and it is as a combination of mini-TV, personal communications device and music/video player that it really works. There is certainly room in the technology ecosystem for many different sorts of devices, accessing a wide range of services over different networks. 3G phones and iPods can co-exist, at least for a while, but if I had to bet on the long term I would go for content on demand over carrying gigabytes in my pocket. Or perhaps some enterprising manufacturer will offer me both. An MP3G player, anyone?\n \n Bill Thompson is a regular commentator on the BBC World Service programme Go Digital.\n", "llama3.2:1b": "Here is a concise summary of the text:\n\nA 3G phone allows users to play music videos and access web content through email, making it a must-have for kids and adults alike. The phone's touch screen and video quality are impressive, but the poor menu system and layout may deter some users. Despite this, the potential for video on phones to drive 3G adoption is significant, particularly in areas with limited internet access. The technology also has the potential for content on demand, making it a viable alternative to carrying large amounts of data.", "llama3.2:3b": "Analyst Bill Thompson purchased a 3G phone for his son and was initially disappointed by its limited functionality. However, he discovered that playing music videos on the phone was a compelling experience with good image quality and engaging content. He believes that video on 3G phones will drive adoption and mark a shift away from the \"download and play\" model of traditional MP3 players.", "gemma2:2b": "Music video streaming on 3G phones is driving adoption and creating a new entertainment paradigm. This shift involves the music industry adapting to mobile devices and the use of IP technology for data transfer. 3G networks offer advantages over internet-based services for streaming audio and video, making them more efficient. Despite concerns about using IP for voice calls, the current network infrastructure is capable of handling it. While some limitations exist with data charges and access points, 3G phones represent a powerful combination of mini-TV, communication device, and music/video player.  The long-term future may involve coexisting devices or even a hybrid like an MP3G player. \n", "qwen2.5:0.5b": "Bill Thompson sees potential in 3G phones and suggests they could be a \"combination of mini-TV, personal communications device and music/video player\".", "qwen2.5:1.5b": "Bill Thompson sees the future of phones as video-based, with 3G enabling music videos to become popular and driving adoption alongside internet access for streaming media. The current generation's lack of interest in watching TV could make small screen phones appealing, but he believes they will eventually adopt a \"download and play\" model like other portable devices.", "qwen2.5:3b": "Analyst Bill Thompson sees the future of mobile phones in his son's 3G device, highlighting its compelling video content quality and user engagement. He notes that while not an ideal phone for adult use due to limited web access and confusing menus, it captures children’s attention with music videos. Thompson argues this marks a shift towards 'streaming' rather than downloading, pointing out the advantages of mobile networks in supporting audio and video streaming. Despite reservations about IP-based streaming and VoIP calls, he acknowledges network operators are pushing 3G services to generate revenue. The text emphasizes the potential for 3G phones as mini-TV devices with multimedia capabilities alongside traditional calling functions, suggesting they can coexist with standalone music players like iPods in the short term but argues for content-on-demand in the long run.", "opencoder:1.5b": "The text summarizes that \"Musical future for phones\" involves playing music videos on a phone while simultaneously accessing the internet and other services using 3G technology. The overall experience was satisfactory, but it highlights some limitations such as lack of access to traditional web services and limited ability to manage data charges. However, these are not significant points and can be ignored in this summary.\n", "smollm:1.7b": "The article highlights the key ideas and details of the text. The main idea is that the future of music lies in 3G phones with internet access, which will allow users to stream radio content and play online games. This is a significant shift from traditional mobile phones, which are limited to voice calls and basic internet browsing.\nThe article also mentions that Vodafone will offer its own streaming service on Go Digital, which will be available for subscribers only. This adds an extra layer of convenience for users who want to access their music content without having to download it from the internet. The article suggests that this is a significant advantage over traditional mobile phones, which require users to download music files from the internet.\nThe article also mentions that there are concerns about the cost of these services and how they will affect consumers. However, the author argues that Vodafone has taken steps to address these concerns by offering a range of pricing options for its streaming service. This includes a \"pay-per-song\" model, which allows users to pay only for the music content they want to access.\nOverall, the article suggests that 3G phones and internet access will play a key role in shaping the future of music consumption. It highlights the convenience and flexibility of these services, as well as their potential to reduce costs for consumers.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to help summarize this text. The user provided a detailed article about how 3G phones are being used and their benefits for consumers. They want a concise summary that captures the key points while preserving details.\n\nFirst, I'll read through the text carefully. It starts by talking about Bill Thompson buying Max's phone, noting its features but not wanting to remove the PS. He mentions his satisfaction with the video content but dismisses the menu system and user interface, leading him to think smaller screens are not worth it. But then he realizes the limitations of 3G and how it's being used for entertainment.\n\nHe points out that other devices like MP3 players work similarly for streaming audio, suggesting a market shift towards content consumption. The article also discusses how 3G is ahead in video on the phone, which is good for kids and casual users. It contrasts this with older models where menu systems were a hindrance, especially for those with poor eyesight.\n\nThe text then touches on the potential of 3G as a replacement for physical devices like MP3 players or iPods, emphasizing convenience and accessibility. It also mentions how different countries are handling content delivery differently but points out that at least in developed areas, they have reliable internet access.\n\nThere's a mention of Bill Thompson being a commentator on BBC World Service and his view on demand over bulk storage. The article ends by speculating about future trends with possible more content-on-demand devices and maybe multi-device support.\n\nNow, I need to condense this into one concise paragraph without adding anything else. I'll start by highlighting the key features of 3G phones that make them appealing for users who can't afford physical devices anymore. Mention Bill's experience showing satisfaction but also his criticism of the menu system. Then move on to how it's used for entertainment, comparing it to traditional media consumption and discussing its potential as a replacement. Finally, touch on current market trends and the possibility of future tech developments in content delivery.\n\nI'll make sure to include all these points without exceeding clarity. Let me structure this into a coherent paragraph.\n</think>\n\n3G phones are being embraced by consumers for their ability to deliver content effortlessly, eliminating the need for bulky physical devices like MP3 players or iPods. Despite criticism over menu systems and user interfaces, Bill Thompson's experience highlights their appeal in video consumption. These phones offer benefits like streaming audio and video, making them ideal for casual users and educational purposes. Their success suggests a shift towards content-on-demand models, potentially replacing traditional media storage solutions. With current internet reliability in developed areas, 3G is gaining traction as a convenient alternative, with potential advancements in content delivery further enhancing its appeal.", "tinyllama:1.1b": "Analyst Bill Thompson has seen the future and it's in his son's hands: a 3G phone, which he uses for a phone call, web browsing, surfing news sites, playing music videos, accessing content-delivery networks (CDNs), reading e-mail, and writing stuff using a stylograph. He also likes to stream radio on his computer while working, and enjoy hearing the bizarrer stations from around the world through VoDafone Live! The 3G phone is not just for mobile Internet access but also serves as a mini-TV, personal communication device, and music/video player. Despite its limitations in menus and limited screen resolution, he finds it compelling due to video streaming quality, image quality, and the fact that it can hold giga-pixels of information in his pocket for music and video playback. The future lies with content on demand, but the son has already begun playing with internet telephony services like VoDafone Live!.", "tinydolphin:1.1b": " Dolphin: Analyst Bill Thompson has seen the future and it's in his son Max's hands. That's right! He'll be using Max's SonyEricsson P800 phone to get even closer to reality. Just like how he'll be able to play music videos on a phone, read messages on his e-mail, or send photos and documents to his friends. \n\nThe future is indeed bright for phones with these advanced features!", "phi:2.7b": " Analysts predict that music videos on 3G phones will drive adoption of the technology, as it allows for streaming and easy access to media. The phone's video quality is comparable to TV streaming from popular sources like the BBC. The network operators benefit financially, while users can enjoy personalized entertainment at any time. However, technical limitations such as downloading charges and restricted content raise concerns. Despite these challenges, 3G phones offer a multi-purpose device that combines personal communication, internet access, and media consumption.\n", "orca-mini:3b": " Max's 3G phone provides compelling entertainment content through music videos, which marks the beginning of a move away from the 'download and play' model. The phone also allows for voice calls and text messages, but it is always in someone's pocket or handbag, available for other uses too. The net, at least here in the developed Western countries, is fast and reliable enough to do both. Bill Thompson, a regular commentator on the BBC World Service programme Go Digital, appears on the show each week. He also has an MP3G player, which he said he will not carry gigabytes in his pocket.", "hermes3:3b": "Phone with 3G music videos to drive adoption.<|end_of_text|><|begin_of_text|>One advantage of 3G networks over IP for audio and video streaming. Small screens, particularly for music videos, are key in attracting users. 3G phones will become popular as combination devices for mini-TV, personal communications and music/video viewing.", "stablelm-zephyr:3b": "Analyst Bill Thompson highlights the future of mobile phones and music videos, explaining how 3G phones are driving adoption despite their poor menu system and smaller screens. He believes that music video streaming on these devices will be a must-have for kids sitting on school buses and adults waiting outside clubs. This move away from the 'download and play' model for iPods and MP3 players is fueled by the ability to stream audio and video content directly to phones, which are always in someone's pocket or handbag for other uses like voice calls and text messaging. Thompson acknowledges that 3G networks have been designed specifically for streaming both voice and video content, giving them an edge over IP-based services. However, he also points out that the phone serves as a mini-TV, personal communications device, and music/video player, with room in the technology ecosystem for various devices accessing different services over different networks.", "chatgpt-4o-latest": "Bill Thompson explores the future of mobile technology through his son's use of a 3G phone. Initially unimpressed by its interface and limited web access, he realizes that video content, particularly music videos, is the key driver for 3G adoption. Younger users are captivated by streaming entertainment, which could shift the model from downloading media to on-demand streaming. This benefits network operators seeking returns on their 3G investments. While 3G services still have issues like data charges and restricted web access, they offer a compelling mix of communication, entertainment, and media consumption. Thompson predicts that content streaming will eventually surpass carrying large media libraries, potentially leading to hybrid devices combining both approaches.", "stablelm2:1.6b": "Summary: Analyst Bill Thompson discovered that playing music videos on 3G phones, like Max's, holds more value than carrying music and pictures as they can be streamed directly to the phone. This shift away from the 'download and play' model is expected to appeal to kids, adults, and anyone waiting outside clubs or killing time with friends. Network operators will benefit from this development, but it also signifies a change in how we consume media on our phones. The quality of video streaming and personal communications capabilities make these phones more versatile than just being cut-off network terminals.\n\n---\n\nAnalyst Bill Thompson's experience using his son's 3G phone has revealed the potential value of video content on these devices beyond music playback. Streaming radio, finding bizarre stations worldwide online, and participating in internet telephony are some examples that show 3G networks can do this sort of streaming for voice and video. However, there is still room for improvement in web access and data charges.\n\nThe shift from downloading gigabytes of media to streaming over the phone shows an adoption of content on demand. This approach will certainly please network operators, who are seeking revenue from their 3G licenses. Furthermore, it signifies a departure from traditional audio and video playback on iPods and MP3 players.\n\nBill Thompson's viewpoint supports this concept: \"if I want fast access to my e- mail, I can get a 3G card for my laptop or hook up to a wireless network.\" The phone is not just another network terminal but rather serves as a combination device - mini-TV, personal communication device, and music/ video player. \n\nThus, there's potential room in the technology ecosystem for various types of devices accessing numerous services over different networks.\n\nIn conclusion, it seems that while streaming music on 3G phones has its benefits, streaming video content will likely become more crucial to users' entertainment choices. This shift away from downloading media may have implications for the telecoms market and the tech industry's focus. Nevertheless, smartphones and iPods can coexist in the foreseeable future, but if I had to pick a long-term direction, I would opt for content on demand over carrying gigabytes of data in my pocket.", "granite3.1-dense:2b": "The text discusses Bill Thompson's observation of his son's 3G phone and its potential impact on the future of mobile communication. Initially, Thompson found the phone's features underwhelming due to its cluttered interface, limited web access, and small screen, which he felt did not justify the purchase over a more advanced smartphone like his son's 3G device or his own SonyEricsson P800.\n\nHowever, Thompson realized that the true value of these 3G phones lies in their ability to deliver compelling video content, particularly music videos, which captivated his son. This realization led him to understand that mobile phones will likely drive 3G adoption among younger users and adults with spare time, as they offer an accessible entertainment option for on-the-go viewing.\n\nThe text highlights how video streaming on 3G phones could become a must-have feature for people who wish to watch content during leisure hours, such as commuters or those waiting in line at clubs. This trend will benefit network operators seeking additional revenue from their 3G licenses and contribute to the shift away from traditional download-and-play models for music and video consumption on devices like iPods.\n\nThompson acknowledges that the current internet, while adequate for some applications such as radio streaming to computers, may not be ideal for high-quality, real-time audio and video transmission over mobile networks due to technical limitations related to IP protocols. He expresses reservations about voice calls over IP but recognizes that 3G networks are optimized for these services, offering faster and more reliable connections than net-based solutions.\n\nThompson suggests that the primary strength of 3G phones lies in their versatility as mini-TVs, personal communication devices, and multimedia players. He believes this combination makes them a compelling option over carrying large amounts of data on separate pocket-sized devices like iPods. Although he envisions potential coexistence between smartphones and iPods for some time, his long-term prediction favors content-on-demand services accessible through 3G phones as they offer more convenience without the need to carry extensive media files in one's pocket.\n\nIn summary, Bill Thompson foresees that 3G phones will play a significant role in driving entertainment consumption and mobile internet usage, particularly for video content, due to their small size, portability, and integration of essential communication features. This trend may lead to the eventual replacement of traditional media devices like iPods, as the value of carrying vast amounts of data becomes questionable when accessible services are readily available on 3G phones.", "reference": "I have never really approved of using the Internet Protocol (IP), to do either audio or video streaming, and I think that technically it is a disaster to make phone calls over the net using \"voice over IP\".With Vodafone now pushing its own 3G service, and 3 already established in the UK, video on the phone is clearly going to become a must-have for kids sitting on the school bus, adults waiting outside clubs and anyone who has time to kill and a group of friends to impress.I bought my son Max a 3G phone, partly because they are so cheap and he needed a phone, and partly because I am supposed to know about the latest technology and thought I should see how they work in real life.But we should not see these new phones simply as cut-down network terminals.But just as the World Wide Web was the \"killer application\" that drove internet adoption, music videos are going to drive 3G adoption.But 3G networks have been designed to do this sort of streaming, both for voice and video, which gives them an edge over net-based IP services.3G phones and iPods can co-exist, at least for a while, but if I had to bet on the long term I would go for content on demand over carrying gigabytes in my pocket.By contrast the confusing menus, complicated keyboard and truly irritating user interface of Max's 3G phone simply get in the way, and I did not see much value in the paid-for services, especially the limited web access.If I want fast access to my e-mail I can get a 3G card for my laptop or hook up to a wireless network.But it goes deeper than that: playing music videos on a phone marks the beginning of a move away from the 'download and play' model we have all accepted for our iPods and MP3 players.I am even playing with internet telephony, despite my reservations, and I appear on Go Digital on the World Service, streamed over the web each week.The 3G services aren't quite there yet, and there is a lot to be sorted out when it comes to web access and data charges.After using it for a while I am not at all tempted to get rid of my SonyEricsson P800 smart phone.The quality was at least as good as the video streaming from the BBC website, and the image is about the same size.It is certainly not a great overall experience, but that is largely due to the poor menu system and the phone layout: the video content itself is compelling."}