{"raw_text": "How to make a gigapixel picture\n \n The largest digital panoramic photo in the world has been created by researchers in the Netherlands.\n \n The finished image is 2.5 billion pixels in size - making it about 500 times the resolution of images produced by good consumer digital cameras. The huge image of Delft was created by stitching together 600 single snaps of the Dutch city taken at a fixed spot. If printed out in standard 300 dots per inch resolution, the picture would be 2.5m high and 6m long.\n \n The researchers have put the image on a website which lets viewers explore the wealth of detail that it captures. Tools on the page let viewers zoom in on the city and its surroundings in great detail. The website is already proving popular and currently has more than 200,000 visitors every day.\n \n The image was created by imaging experts from the Dutch research and technology laboratory TNO which created the 2.5 gigapixel photo as a summer time challenge.\n \n The goal of the project was to be one of the first groups to make gigapixel images. The first image of such a size was manually constructed by US photographer Max Lyons in November 2003. That image portrayed Bryce Canyon National Park, in Utah, and was made up of 196 separate photographs. The panorama of Delft is a little staid in contrast to the dramatic rockscape captured in Mr Lyons' image. \"He did it all by hand, which was an enormous effort, and we got the idea that if you use automatic techniques, it would be feasible to build a larger image,\" said Jurgen den Hartog, one of the TNO researchers behind the project. \"We were not competing with Mr Lyons, but it started as a lunchtime bet.\"\n \n The Dutch team used already available technologies, although it had to upgrade them to be able to handle the high-resolution image.\n \n \"We had to rewrite almost all the tools,\" Me den Hartog told the BBC News website. \"All standard Windows viewers available would not be able to load such a large image, so we had to develop one ourselves.\" The 600 component pictures were taken on July 2004 by a computer-controlled camera with a 400 mm lens. Each image was made to slightly overlap so they could be accurately arranged into a composite. The stitching process was also done automatically using five powerful PCs over three days. Following the success of this project, and with promises of help from others, the TNO team is considering creating a full 360-degree panoramic view of another Dutch city, with even higher resolution.\n", "llama3.2:1b": "Researchers in the Netherlands created a gigapixel image of the city of Delft, measuring 2.5 billion pixels. The image was created by stitching together 600 single snaps taken at a fixed spot. It is available online and has been viewed by over 200,000 people per day.", "llama3.2:3b": "Researchers in the Netherlands created the world's largest digital panoramic photo, measuring 2.5 billion pixels and over 500 times the resolution of consumer cameras. The image was stitched together from 600 single snaps taken at a fixed spot in Delft and can be explored on a website with zooming tools. The project used automatic techniques to create a high-resolution image that surpassed a previous record held by US photographer Max Lyons, who created a similar image in 2003.", "gemma2:2b": "Researchers in the Netherlands created a gigapixel image of Delft, containing 2.5 billion pixels, making it about 500 times more detailed than typical camera images. The photo was created by stitching together 600 individual photographs taken at a fixed location and is currently available online for public viewing. This project involved upgrading existing technologies to handle the high-resolution image and used multiple PCs for automatic stitching.  The team plans to create a similar panoramic view of another Dutch city with even higher resolution in the future. \n", "qwen2.5:0.5b": "Researchers in the Netherlands created a gigapixel image of Delft, capturing over 2.5 billion pixels at a high-resolution of 600 single snaps taken at a fixed spot. Visitors can explore the wealth of detail in the 3D panoramic view on the researchers' website. The project was inspired by Max Lyons's photograph from Bryce Canyon National Park in Utah and the earlier image from Mr. Lyons, depicting Delft with staid details.", "qwen2.5:1.5b": "Researchers in the Netherlands created a 2.5 gigapixel digital panoramic photo of Delft using computer-controlled cameras and stitching software to compile 600 single photos into one massive image. The resulting 2.5 billion-pixel picture is about five times larger than most consumer cameras can produce. It was printed at 300 dpi resolution, making it 2.5 meters high and 6 meters wide if laid flat. The website allows viewers to zoom in on the city's details and explore the image freely.", "qwen2.5:3b": "The largest digital panoramic photo in the world, 2.5 billion pixels, captures Delft's panorama created by stitching together 600 single snaps. It was developed as a summer challenge by TNO imaging experts and is now available online for viewers to explore using zoom tools. The goal was to be one of the first groups creating such high-resolution images; previous efforts involved manually assembling smaller panoramas. To handle this large image, the team had to develop their own viewer software and used automatic techniques for stitching and overlapping pictures taken with a controlled camera lens in 2004. They plan to create a full 360-degree panoramic view of another Dutch city with even higher resolution.", "opencoder:1.5b": "A \"gigapixel picture\" made by researchers in the Netherlands can be described as a massive digital panorama image which captures vast details and visual artifacts beyond the reach of any consumer digital camera. It's a 2.5 billion pixel resolution, making it about 500 times larger than a standard photo taken with good consumer digital cameras. The image of Delft was created by stitching together 600 single shot photographs at a fixed spot.\n\nThe researchers have created an impressive website where viewers can explore the wealth of detail captured in this image. Zooming and panning features make it a compelling visual experience, allowing users to delve into the city's surroundings with great detail. It's already proving popular and attracts more than 200 million daily visitors.\n\nThe project was a summer time challenge that was first made into a group effort. The original manual photo was created by US photographer Max Lyons in November 2003. This photo captured Bryce Canyon National Park, in Utah, and was composed of 196 individual photographs. The panorama of Delft is a little stilted compared to the dramatic rockscape captured in Mr Lyons' image.\n\nJurgen den Hartog had been working with TNO to recreate this huge image but ended up becoming the main competitor due to his efforts in overcoming technical challenges. \"He did it all by hand, which was an enormous effort,\" said Jurgen, indicating that it wasn't just a manual process but also an immense effort.\n\nThe group of researchers used already available technologies while upgrading them to handle this high-resolution image. The success of the project was due to the promise of help from others and the ability to work collaboratively across several computers over several days.\n", "smollm:1.7b": "The largest digital panoramic photo in the world has been created by researchers in the Netherlands. The finished image is 2.5 billion pixels in size - making it about 500 times the resolution of images produced by good consumer digital cameras. The huge image of Delft was created by stitching together 600 single snaps of the Dutch city taken at a fixed spot. If printed out in standard 300 dots per inch resolution, the picture would be 2.5m high and 6m long.\nThe researchers have put the image on a website which lets viewers explore the wealth of detail that it captures. Tools on the page let viewers zoom in on the city and its surroundings in great detail. The website is already proving popular and currently has more than 200,000 visitors every day.\nThe goal of the project was to be one of the first groups to make gigapixel images. The first image of such a size was manually constructed by US photographer Max Lyons in November 2003. That image portrayed Bryce Canyon National Park, in Utah, and was made up of 196 separate photographs. The panorama of Delft is a little staid in contrast to the dramatic rockscape captured in Mr Lyons' image. \"He did it all by hand, which was an enormous effort, and we got the idea that if you use automatic techniques, it would be feasible to build a larger image,\" said Jurgen den Hartog, one of the TNO researchers behind the project. \"We were not competing with Mr Lyons, but it started as a lunchtime bet.\"\nThe Dutch team used already available technologies, although it had to upgrade them to be able to handle the high-resolution image. The 600 component pictures were taken on July 2004 by a computer-controlled camera with a 400 mm lens. Each image was made to slightly overlap so they could be accurately arranged into a composite. The stitching process was also done automatically using five powerful PCs over three days. Following the success of this project, and with promises of help from others, the TNO team is considering creating a full 360-degree panoramic view of another Dutch city, with even higher resolution.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely while preserving key ideas and details. The user specified that the output should only be plain text without explanations or any formatting.\n\nFirst, let me read through the text carefully to understand its main points. It's about creating a gigapixel photo of Delft using 600 snapshots stitched together. The image is over 2.5 billion pixels and has a resolution about five times higher than consumer digital cameras. It was created by researchers from TNO in the Netherlands as part of a summer challenge, aiming to be one of the first gigapixel images.\n\nI need to capture all these key points:\n\n1. The photo is 2.5 billion pixels, which is over 500 times higher resolution than consumer digital cameras.\n2. It was created by stitching together 600 snapshots taken at a fixed spot in Delft.\n3. The image is displayed on a website with tools allowing detailed zooming in.\n4. The project was initiated as a summer challenge, led by TNO researchers.\n5. The first large gigapixel photo was done manually by Max Lyons in 2003, which had 196 separate images stitched together.\n6. TNO used existing technologies and advanced them to handle the high-resolution image.\n7. They faced challenges with software limitations, developed custom tools, and used multiple PCs for stitching.\n8. The project led by TNO aims to create full 360-degree panoramic views of other Dutch cities with higher resolutions.\n\nI should structure this summary concisely, including all these points without going into too much detail, as the user wants only the summary in plain text.\n\nLet me draft a sentence that combines all these elements. I'll start by stating the photo's size and resolution, mention it was created from 600 snapshots, its availability on a website for exploration, the researchers' background with TNO, their goal of being the first gigapixel project, comparison to Max Lyons' manual image, and their success leading them to consider other cities. I'll make sure each key point is included without repetition.\n\nDouble-checking: Are there any missing details? Yes, that TNO researchers were involved and they used existing tools but had to upgrade. But since the user didn't mention those specifics in the final output (only plain text), maybe it's okay to include some of them as long as they are part of the summary.\n\nWait, looking back, the user didn't ask for specific parts beyond just summarizing the key points. So perhaps I can omit technical details like the exact number of snapshots or camera specifications unless they're crucial for understanding the project's scale. Maybe keep those technical details if they add to clarity but not to the summary.\n\nI think including all key points as per the user's request is better, even if it means a bit more text.\n</think>\n\nThe Netherlands researchers at TNO created a gigapixel image of Delft with 2.5 billion pixels and five times higher resolution than consumer digital cameras, made from 600 snapshots taken at fixed spots. The image was showcased on a website with tools allowing detailed exploration, aiming to be the first large-scale gigapixel project.", "tinyllama:1.1b": "A gigapixeled photo in the size of around 2.5 billion pixels was created by researchers in the Netherlands, which stitches together single snapshots taken at a fixed spot and is currently viewed on a website that allows viewers to zoom in on the city and its surroundings in great detail. The team used standard tools but upgraded them to be able to handle the gigapixel image, developing their own viewer program. The goal was to create an impressive panoramic image, but the team is considering creating a full 360-degree view of another city using even higher resolutions.", "tinydolphin:1.1b": " The Dutch researchers have created a gigapixel picture, which is 2.5 billion pixels in size and has a resolution equivalent to a good consumer digital camera. It's about 500 times the resolution of photos made by smaller cameras. \n\nThe photo is 2.5 meters high and 6 meters long, and was created using a special website that lets viewers explore its details in great detail. The team used tools already available to create the image but had to upgrade them for its size. The project was part of a summer challenge to break records for the first time.", "phi:2.7b": " Researchers in the Netherlands created the world's largest digital panorama by stitching together 600 single snaps of Delft taken at a fixed spot. The finished image measures 2.5 billion pixels and would be 500 times the resolution of consumer digital cameras if printed out in standard 300 dots per inch resolution, making it approximately 6m long and 2.5m high. This achievement was made possible through the use of already available technologies that were upgraded to handle such a high-resolution image. The project was started as a lunchtime bet by researchers at Dutch research and technology laboratory TNO who wanted to create gigapixel images using automatic techniques. Despite being not competing with US photographer Max Lyons' manually created \n", "orca-mini:3b": " The text discusses how researchers in the Netherlands created the largest digital panoramic photo in the world, which is 2.5 billion pixels in size and about 500 times the resolution of images produced by good consumer digital cameras. The image was created by stitching together 600 single snaps of the Dutch city taken at a fixed spot and is already popular with over 200,000 visitors every day. The researchers used existing technologies but upgraded them to be able to handle the high-resolution image. The team also developed a viewer to explore the wealth of detail captured in the picture. They aimed to create one of the first gigapixel images and made it by manually capturing a large panorama of Bryce Canyon National Park, Utah, and stitching it together using five powerful PCs over three days. They are now planning to create a full 360-degree panoramic view of another Dutch city with even higher resolution.", "hermes3:3b": "Gigapix photo created in Netherlands (600 single snaps, 2.5b pixels), website lets zoom into city detail; first gigapixel made by US photographer in 2003. TNO team used available tech to create it, considering full 360-degree view with higher resolution.", "stablelm-zephyr:3b": "Researchers in the Netherlands have created a 2.5 gigapixel image - approximately 500 times the resolution of consumer digital cameras - by stitching together 600 single snaps of the Dutch city of Delft. The image has been placed on a website which enables viewers to explore the detail captured within the photograph. TNO, the research and technology laboratory that worked on the project, is considering creating 360-degree panoramic views of other Dutch cities with even higher resolution.", "chatgpt-4o-latest": "Researchers in the Netherlands created a 2.5-gigapixel panoramic image of Delft by stitching together 600 photos taken with a computer-controlled camera. The image, 500 times the resolution of consumer digital cameras, allows viewers to explore fine details online and has attracted over 200,000 daily visitors. The project, undertaken by TNO researchers as a challenge, aimed to automate the gigapixel imaging process, improving on the manual method used by photographer Max Lyons in 2003. The team had to rewrite software to handle the massive image and used five powerful PCs to stitch it together over three days. Encouraged by their success, they plan to create an even higher-resolution 360-degree panorama of another Dutch city.", "stablelm2:1.6b": "Researchers in the Netherlands created the largest digital panoramic photo with a gigapixel image of Delft by stitching together single snaps at a fixed spot and upgrading available technologies to handle the high-resolution image. The finished image is 2.5 billion pixels, twice the resolution of consumer digital camera images, and would be about 2.5m high and 6m long if printed. The TNO team showcased the image on a website where visitors can explore its detail. The project aimed to create gigapixel images first, with the first manually constructed by Max Lyons in November 2013 capturing Bryce Canyon National Park and being made of separate photographs. The Dutch team used automatic techniques, upgraded tools, and their own computer-controlled camera with a mm lens to create the Delft image. They are considering creating another full-degree panoramic view of another Dutch city with even higher resolution using help from others.", "granite3.1-dense:2b": "A team from the Netherlands' research lab, TNO, has created the world's largest digital panorama of Delft, measuring 2.5 billion pixels and about 500 times more detailed than consumer camera images. This monumental image was assembled by stitching together 600 individual shots taken with a 400mm lens, capturing the city from a single point. The project, initially a lunchtime bet, aimed to demonstrate that large-scale panoramas could be generated using automated techniques rather than manual labor. The Dutch researchers had to adapt existing tools and develop new software for handling such high-resolution images due to standard viewers' inability to load the data. The resulting image, now accessible through an online platform, showcases incredible detail upon zooming. The project's success has sparked discussions about creating a 360-degree, even higher-resolution panorama of another Dutch city in the future.", "reference": "The huge image of Delft was created by stitching together 600 single snaps of the Dutch city taken at a fixed spot.The image was created by imaging experts from the Dutch research and technology laboratory TNO which created the 2.5 gigapixel photo as a summer time challenge.The first image of such a size was manually constructed by US photographer Max Lyons in November 2003.\"He did it all by hand, which was an enormous effort, and we got the idea that if you use automatic techniques, it would be feasible to build a larger image,\" said Jurgen den Hartog, one of the TNO researchers behind the project.The researchers have put the image on a website which lets viewers explore the wealth of detail that it captures.The finished image is 2.5 billion pixels in size - making it about 500 times the resolution of images produced by good consumer digital cameras.\"All standard Windows viewers available would not be able to load such a large image, so we had to develop one ourselves.\"Each image was made to slightly overlap so they could be accurately arranged into a composite.That image portrayed Bryce Canyon National Park, in Utah, and was made up of 196 separate photographs."}