{"raw_text": "UK broadband gets speed injection\n \n Broadband's rapid rise continues apace as speeds gear up a notch.\n \n An eight megabit service has been launched by internet service provider UK Online. It is 16 times faster than the average broadband package on the market and will pave the way for services such as video-on-demand and broadband TV. The service is possible due to a new regime which allows other operators to use BT's exchanges and will initially only be available in towns.\n \n It represents a \"big leap forward\" for broadband, said Chris Stening, UK Online general manager.\n \n The service comes with a hefty £39.99 monthly price tag but will mean users can download MP3s in seconds and offers TV-quality video streaming. The service includes WiFi as standard, meaning users can connect multiple PCs, laptops and game consoles from any room in the house. Not everybody will be able to take advantage of the service, as it will be restricted to metropolitan areas. The service will initially be available to users within 2km radius of 230 telephone exchanges in areas such as London, Birmingham, Glasgow and Cambridge. That represents about 4.4 million households. The service is possible due to a decision to loosen BT's strangle-hold on telephone exchanges.\n \n The process, known as local loop unbundling, was put in motion by the now defunct telecoms watchdog Oftel but has only proved popular in recent months due to falling costs. UK Online is looking at the possibility of bundling services such as cheap net telephone calls, video-on-demand and TV by 2005 if the service proves popular. \"The service is twice as fast as any other service on offer in the UK and 16 times faster than most broadband services,\" said Mr Stening. \"It takes a big leap for broadband and we are very excited about it,\" he said. Countries such as South Korea and France have found the advantage of upping the speeds of broadband. In South Korea, video-on-demand over the net is cheaper than renting a DVD and online gaming is huge. Mr Stening believes the service will appeal to people in multi-occupancy buildings as well as easing family arguments. \"A typical family with two adults and two children is currently sharing a 512 kilobit service. This will basically give them 2 megabits each,\" he said.\n", "llama3.2:1b": "UK broadband speeds have increased by an eight megabit service, which is 16 times faster than the average package on the market. The new service uses BT's exchanges and is available in towns with a £39.99 monthly price tag, allowing users to download MP3s in seconds and stream TV-quality video.", "llama3.2:3b": "UK Online launches an 8 megabit broadband service that is 16 times faster than the average package, initially available in metropolitan areas for £39.99 monthly, with WiFi and potential bundling of TV services by 2005.", "gemma2:2b": "UK Online launched an eight megabit broadband service, 16 times faster than the average.  The service is available in specific metropolitan areas due to local loop unbundling and offers features like video streaming and WiFi connectivity. It costs £39.99 per month. UK Online plans to bundle services like net telephone calls and video-on-demand by 2005 if this new service proves popular. \n", "qwen2.5:0.5b": "UK broadband has seen significant speed upgrades, allowing users to download MP3s in seconds and access video streaming services such as TV. The service comes with a £39.99 monthly price tag and is available locally within 2km radius of telephone exchanges like London, Birmingham, Glasgow and Cambridge. It will be restricted to metropolitan areas due to costs. The process involves loosening BT's stranglehold on telephone exchanges and has only recently become popular in recent months following falling costs. The service is expected to appeal to people in multi-occupancy buildings and ease family arguments.", "qwen2.5:1.5b": "UK broadband provider UK Online has launched an eight-megabit package, the fastest in the UK at 16 times faster than average speeds, offering video-on-demand and TV streaming; it uses BT's exchanges for wider availability but is initially limited to metropolitan areas. The service comes with a high price tag of £39.99 per month and includes WiFi connectivity.", "qwen2.5:3b": "UK broadband speeds up with introduction of an eight megabit service by UK Online, offering 16 times faster than average broadband packages. This allows for services like video-on-demand and streaming TV-quality videos. The service is priced at £39.99 per month, providing instant MP3 downloads and WiFi standard allowing multiple devices to connect from any room. Initially available in metropolitan areas, serving about 4.4 million households. Due to local loop unbundling decision by Oftel, the process has gained popularity recently due to reduced costs. UK Online considers bundling services like cheap net calls and video-on-demand by 2005 if successful. The service is particularly appealing for multi-occupancy buildings and eases family disputes over internet usage among adults and children, giving each household member 2 megabits speed as opposed to the current shared 512 kilobit plan.", "opencoder:1.5b": "\"UK broadband gets speed injection.\" \n\n\"Broadband's rapid rise continues apace as speeds gear up a notch.\"\n\n\"An eight megabit service has been launched by internet service provider UK Online. It is 16 times faster than the average broadband package on the market and will pave the way for services such as video-on-demand and broadband TV.\"\n\n\"The service represents a \"big leap forward\" for broadband, said Chris Stening, UK Online general manager.\"\n\n\"The service comes with a hefty £39.99 monthly price tag but will mean users can download MP3s in seconds and offers TV-quality video streaming.\"\n\n\"The service includes WiFi as standard, meaning users can connect multiple PCs, laptops and game consoles from any room in the house.\" \n\n\"The process, known as local loop unbundling, was put in motion by the now defunct telecoms watchdog Oftel but has only proved popular in recent months due to falling costs. UK Online is looking at the possibility of bundling services such as cheap net telephone calls, video-on-demand and TV by 2005 if the service proves popular.\" \n\n\"The service is twice as fast as any other service on offer in the UK and 16 times faster than most broadband services,\" said Mr Stening. \"It takes a big leap for broadband and we are very excited about it,\" he said.\"\n\n\"Countries such as South Korea and France have found the advantage of upping the speeds of broadband.\" \n\n\"In South Korea, video-on-demand over the net is cheaper than renting a DVD and online gaming is huge. Mr Stening believes the service will appeal to people in multi-occupancy buildings as well as easing family arguments. \"A typical family with two adults and two children is currently sharing a 512 kilobit service. This will basically give them 2 megabits each,\" he said.\"\n", "smollm:1.7b": "The UK broadband gets speed injection, which represents a big leap forward for broadband, as it offers speeds that are 16 times faster than the average broadband package on the market and will pave the way for services such as video-on-demand and broadband TV. The service is possible due to a new regime that allows other operators to use BT's exchanges and will initially only be available in towns.", "deepseek-r1:1.5b": "<think>\nAlright, let me try to tackle this query step by step. The user has provided a text about UK broadband getting speed injection, which seems like a technical advancement. They want a concise summary that preserves key ideas and details. \n\nFirst, I need to understand the main points of the article. It's about how UK Online is introducing a new high-speed internet service called the Local Loop Service. This service uses BT's exchanges and is available only in certain towns. The pricing is hefty at £39.99 per month but offers features like fast download speeds, streaming video, and WiFi. \n\nI should note that this service aims to outpace existing broadband options, offering 16 times faster speed than average services. It uses a new regulatory framework called local loop unbundling, which was introduced by Oftel, leading to its launch in recent months despite costs falling. The service is particularly beneficial for multi-occupancy homes and may help ease family disputes.\n\nThe user also mentioned that the service will eventually be available across the UK but with some restrictions, mainly metro areas. The article ends with Mr Stening's excitement about this service being a big leap forward, citing examples like South Korea and France where internet speeds can be significantly faster without extra charges.\n\nPutting it all together, I need to create a concise summary that highlights the introduction of a new fast broadband service, its benefits, its launch region, pricing, and its implications for customers.\n</think>\n\nThe UK has launched a high-speed internet service called the Local Loop Service. It is 16 times faster than average broadband packages on the market and offers features like streaming video and WiFi. The service is available in local exchanges operated by BT and will be accessible to users within 2km of 230 telephone exchanges, targeting around 4.4 million households. The £39.99 monthly fee includes fast internet access and offers benefits such as downloading MP3s quickly and streaming video. This service aims to provide a significant leap forward for broadband services, particularly benefiting multi-occupancy homes.", "tinyllama:1.1b": "Concise summary of the news item: A new regime launched by internet service provider UK Online allows exchanges to be used for fast broadband services, with speeds that are 16 times faster than average on the market and will enable video-on-demand and broadband TV services. The new service costs £39.99 per month and is currently only available in metropolitan areas, with an additional €50 per year fee for WiFi access. The service aims to make broadband available in smaller towns by 2005 if successful. South Korea and France have found that introducing new technologies such as video-on-demand over the net can be profitable.", "tinydolphin:1.1b": " The UK broadband company, UK Online has launched a new service that offers speeds up to eight times faster than the average broadband package on the market. The new service is set to be available in towns and cities where there are enough internet exchanges to support its usage. Currently, the fastest broadband service available to users in the UK is offered by BT (British Telecom) at £39.99 per month, making it a significant step forward for broadband users. The new service from UK Online is expected to be able to deliver video-on-demand and TV-quality streaming at speeds up to 16 times faster than most existing broadband services in the market. \n\nAccording to Chris Stening, general manager of UK Online, the new service will provide a significant advantage for users who do not have access to high-speed internet connections and will be ideal for those with multiple PCs, laptops, game consoles or other devices in their homes. Currently, the majority of households are only able to take advantage of the service if they reside within 2km of one of the 230 telephone exchanges in the UK. The initial availability of this service is limited to areas with sufficient internet connections but could expand in the future as more networks come online and access becomes easier.", "phi:2.7b": " UK Online has launched an eight megabit broadband service that is 16 times faster than the average broadband package on the market. The new regime allowing other operators to use BT's exchanges will initially only be available in towns, with a £39.99 monthly price tag. Users can download MP3s in seconds and enjoy TV-quality video streaming. The service includes WiFi as standard, meaning users can connect multiple PCs, laptops and game consoles from any room in the house.\n", "orca-mini:3b": " UK broadband speeds increase by 16 times to 8Mb, with a £39.99 price tag. A new regime allows other operators to use BT's exchanges, but is available only in metropolitan areas, affecting 4.4 million households. The service is twice as fast as any other service on offer in the UK and 16 times faster than most broadband services. It includes free WiFi for multiple devices. UK Online looks at bundling services such as cheap net telephone calls and TV by 2005 if the service is popular.", "hermes3:3b": "UK Broadband provider UK Online launches 8MBps service, 16x faster than average, to support video-on-demand and TV; available in metropolitan areas initially.", "stablelm-zephyr:3b": "UK Online has launched an eight-megabit broadband service, 16 times faster than the average market package, which will pave the way for video-on-demand and broadband TV. The service is possible due to a new regime allowing other operators to use BT exchanges, initially only available in towns. It costs £39.99 per month and includes WiFi as standard. Available only in areas close to 230 telephone exchanges around the country, it represents about 4.4 million households.", "chatgpt-4o-latest": "UK Online has launched an eight megabit broadband service, 16 times faster than the average UK broadband package, enabling video-on-demand and broadband TV. The service, priced at £39.99 per month, includes WiFi and allows multiple devices to connect. Initially available in metropolitan areas within 2km of 230 telephone exchanges, it will reach about 4.4 million households. This advancement is made possible by local loop unbundling, which loosens BT’s control over exchanges. UK Online may bundle additional services like cheap internet calls and TV by 2005. Faster broadband speeds have proven successful in countries like South Korea, where video-on-demand and online gaming thrive. The service is expected to benefit multi-occupancy buildings and families by providing higher bandwidth per user.", "stablelm2:1.6b": "UK Online launches an eight-megabit broadband service, twice as fast as the average package, aiming to pave the way for video-onthemovied and TV services. The new regime allows other operators to use BT's exchanges, initially available in towns with 2km radius around telephone exchanges such as London, Birmingham, Glasgow, and Cambridge. UK Online is considering bundling additional services if the service proves popular.", "granite3.1-dense:2b": "UK broadband speeds have dramatically improved with the launch of an eight-megabit service by UK Online, priced at £39.99 monthly. This service is 16 times faster than typical broadband packages, enabling high-quality video streaming and MP3 downloads in seconds. It's available to users within a 2km radius of 230 BT exchanges in major cities like London, Birmingham, Glasgow, and Cambridge, potentially reaching around 4.4 million households. This capability is made possible by local loop unbundling, a policy change that allows competitors to utilize BT's exchanges. The service includes WiFi for multiple device connectivity and could soon be expanded to include other bundled services like low-cost VoIP calls, video-on-demand, and TV. UK Online anticipates this speed boost will attract users, especially those in multi-occupancy buildings or families currently sharing slower broadband connections.", "reference": "\"The service is twice as fast as any other service on offer in the UK and 16 times faster than most broadband services,\" said Mr Stening.An eight megabit service has been launched by internet service provider UK Online.UK Online is looking at the possibility of bundling services such as cheap net telephone calls, video-on-demand and TV by 2005 if the service proves popular.It is 16 times faster than the average broadband package on the market and will pave the way for services such as video-on-demand and broadband TV.It represents a \"big leap forward\" for broadband, said Chris Stening, UK Online general manager.The service is possible due to a decision to loosen BT's strangle-hold on telephone exchanges.The service is possible due to a new regime which allows other operators to use BT's exchanges and will initially only be available in towns.Not everybody will be able to take advantage of the service, as it will be restricted to metropolitan areas."}