{"raw_text": "Man auctions ad space on forehead\n \n A 20-year-old US man is selling advertising space on his forehead to the highest bidder on website eBay.\n \n Andrew Fisher, from Omaha, Nebraska, said he would have a non-permanent logo or brand name tattooed on his head for 30 days. \"The way I see it I'm selling something I already own; after 30 days I get it back,\" he told the BBC Today programme. Mr Fisher has received 39 bids so far, with the largest bid currently at more than $322 (£171). \"The winner will be able to send me a tattoo or have me go to a tattoo parlour and get a temporary ink tattoo on my forehead and this will be something they choose, a company name or domain name, perhaps their logo,\" he told the Radio 4 programme.\n \n On the online auction, Mr Fisher describes himself as an \"average American Joe, give or take\". His sales pitch adds: \"Take advantage of this radical advertising campaign and become a part of history.\" Mr Fisher said that while he would accept any brand name or logo, \"I wouldn't go around with a swastika or anything racial\". He added: \"I wouldn't go around with 666, the mark of the beast. \"Other than that I wouldn't promote anything socially unacceptable such as adult websites or stores.\" He said he would use the money to pay college - he is planning to study graphic design. The entrepreneur said his mother was initially surprised by his decision but following all the media attention she felt he was \"thinking outside the box\".\n", "llama3.2:1b": "A 20-year-old US man named Andrew Fisher is selling advertising space on his forehead for $322, a non-permanent tattoo or domain name that will be chosen by the highest bidder. He claims to be selling something he already owns and promises to return it after 30 days if no one wins.", "llama3.2:3b": "A 20-year-old US man named Andrew Fisher is selling advertising space on his forehead for 30 days through an eBay auction, with the highest bid currently over $322.", "gemma2:2b": "A 20-year-old man from Nebraska is auctioning advertising space on his forehead for 30 days, with bids reaching over $322. The winner will choose a logo or brand name to be tattooed on him.  The money will help fund his college education in graphic design. He has specified that he won't use the space to promote hate symbols, adult content, or anything socially unacceptable. \n", "qwen2.5:0.5b": "A 20-year-old US man sells advertising space on his forehead for $322 (£171). He plans to tattoo a brand name or logo on it.", "qwen2.5:1.5b": "A 20-year-old US man has auctioned advertisement space on his forehead for $322 using eBay, with bids ranging from $171. He plans to receive a non-permanent logo or brand name tattoo and sells as part of an advertising campaign. The entrepreneur aims to use the proceeds for college expenses while avoiding socially unacceptable content.", "qwen2.5:3b": "A 20-year-old US man, Andrew Fisher from Omaha, Nebraska, has started an eBay auction for advertising space on his forehead for 30 days. He will allow a non-permanent logo or brand name tattoo to be placed there and accepts any company name or domain that complies with social norms. So far he has received over $321 in bids. Fisher describes himself as \"an average American Joe\" and plans to use the proceeds for college studies in graphic design. His mother initially expressed surprise but was supportive after media attention.", "opencoder:1.5b": "Man auctions ad space on forehead\n\nA 20-year-old US man is selling advertising space on his forehead to the highest bidder on website eBay. Andrew Fisher, from Omaha, Nebraska, said he would have a non-permanent logo or brand name tattooed on his head for 30 days. \"The way I see it I'm selling something I already own; after 30 days I get it back,\" he told the BBC Today programme. Mr Fisher has received 39 bids so far, with the largest bid currently at more than $322 (£171). \"The winner will be able to send me a tattoo or have me go to a tattoo parlour and get a temporary ink tattoo on my forehead and this will be something they choose, a company name or domain name, perhaps their logo,\" he told the Radio 4 programme. On the online auction, Mr Fisher describes himself as an \"average American Joe, give or take\". His sales pitch adds: \"Take advantage of this radical advertising campaign and become a part of history.\" Mr Fisher said that while he would accept any brand name or logo, \"I wouldn't go around with a swastika or anything racial\". He added: \"I wouldn't go around with 666, the mark of the beast. \"Other than that I wouldn't promote anything socially unacceptable such as adult websites or stores.\" He said he would use the money to pay college - he is planning to study graphic design. The entrepreneur said his mother was initially surprised by his decision but following all the media attention she felt he was \"thinking outside the box\".\n", "smollm:1.7b": "The summary should be:\n\n\"A 20-year-old US man is selling advertising space on his forehead to the highest bidder on website eBay. Andrew Fisher, from Omaha, Nebraska, said he would have a non-permanent logo or brand name tattooed on his head for 30 days. 'The way I see it I'm selling something I already own; after 30 days I get it back,' he told the BBC Today programme.\"\n\nThis summary captures the key ideas and details of the original text, preserving the main points while omitting unnecessary information.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text in plain text without any explanations or formatting. Let me read through it carefully.\n\nThe first sentence talks about a 20-year-old man from the USA advertising on his forehead for eBay. He's selling space on his forehead as a form of advertising. Then Andrew Fisher, from Omaha, Nebraska, is selling on eBay and is getting some bids from other people. He says he'll get it back after 30 days. He got 39 bids so far, highest at over $322.\n\nHe told BBC Today about his idea, saying he's selling something he already has. Then Mr Fisher compares to an \"average American Joe\" and suggests using a brand name or logo for the campaign. He says the campaign is radical and they'll have options like company names or domain names. He even mentioned avoiding racial or socially unacceptable choices.\n\nHe plans to study graphic design at college but his mother was surprised by his idea and found him thinking outside the box after being told about it.\n\nI should make sure I include all key points: Mr Fisher's brand name idea, eBay ads on forehead, bids, his average Joe comparison, avoiding certain topics like swastika or 666, studying graphic design, and mother's surprise and encouragement.\n</think>\n\nA 20-year-old American man is selling advertising space on his forehead for eBay. Andrew Fisher, from Omaha, Nebraska, is the highest bidder so far with a bid over $322. He plans to get his brand back in 30 days. Mr Fisher described himself as an \"average American Joe\" and suggested using a brand name or logo for his campaign. He mentioned options like company names or domain names but avoided socially unacceptable topics such as racial symbols or adult websites. He studied graphic design at college, inspired by his idea, which he claims is radical enough to stand out.", "tinyllama:1.1b": "The 20-year-old US man, Andrew Fisher, has put up advertising space on his forehead for a non-permanent logo or brand name to be auctioned off for 30 days. Mr Fisher believes that the way he owns his assets is already available for sale, so he'll get it back after the auction. His bidder will choose a company name or domain name from a list of over 40, with the largest bid currently at more than $322 (£171). He described himself as an \"average American Joe\", who has not used any brand name or logo before, but wants to take advantage of a radical advertising campaign and become part of history. Mr Fisher is planning to use the money for college and said his mother initially thought he was thinking outside the box, following all media attention.", "tinydolphin:1.1b": " A young US man, Andrew Fisher, has decided to offer himself as a willing test subject for a one-of-a-kind advertising campaign. The man is selling advertising space on his forehead for anyone who wishes to bid the maximum amount on eBay and have it permanently etched on his head over a period of 30 days. The highest bidder will receive a unique logo or brand name tattooed onto Fisher's scalp, allowing him to keep ownership of his ad space. Although Fisher has received multiple bids ranging from $322 (£171) to a staggering $3,600 (£1,875), he insists that the winner will have complete control over what they get inked onto his forehead. This advertising campaign, which has quickly garnered attention and sparked debate among viewers on both sides of the Atlantic, is designed to showcase the power of one man's choice over societal norms.", "phi:2.7b": " A US man from Nebraska is selling advertising space on his forehead for 30 days on eBay. He has received 39 bids so far, with the largest bid at more than $322. Mr Fisher will receive a temporary tattoo or permanent brand name in return. The entrepreneur said he would accept any logo or domain name as long as it was not socially unacceptable.\n", "orca-mini:3b": " A 20-year-old US man is selling advertising space on his forehead to the highest bidder on website eBay. Andrew Fisher, from Omaha, Nebraska, will have a non-permanent logo or brand name tattooed on his head for 30 days. The winner will be able to choose any brand name or logo and have it permanently inked on their forehead. Mr Fisher has received 39 bids so far, with the largest bid currently at more than $322. The winner will be able to have Mr Fisher go to a tattoo parlour and get a temporary ink tattoo on his forehead. Mr Fisher says he would not go around with a swastika or anything racial. He also says that he would use the money to pay for college. His mother was initially surprised by his decision but following all the media attention, she feels he is \"thinking outside the box\".", "hermes3:3b": "US man sells forehead ad space on eBay", "stablelm-zephyr:3b": "A 20-year-old man from Omaha, Nebraska, is selling advertising space on his forehead for 30 days on eBay. Andrew Fisher will have a non-permanent logo or brand name tattooed on his head for this period and will choose the tattoo design based on the winning bid, which could be a company name, domain name, or logo. He has received 39 bids, with the highest being over $322 (£171). Fisher intends to use the money generated from this unusual marketing campaign to pay for college and study graphic design. His mother was surprised at first but supports his entrepreneurial idea now that it has gained media attention.", "chatgpt-4o-latest": "A 20-year-old man from Omaha, Nebraska, Andrew Fisher, is auctioning advertising space on his forehead on eBay. He plans to have a temporary tattoo of a logo or brand name for 30 days, with the highest bid currently over $322. Fisher describes this as a unique advertising opportunity and assures he will not promote offensive or socially unacceptable content. He intends to use the money for college, where he plans to study graphic design. His mother was initially surprised but later appreciated his creative approach after media attention.", "stablelm2:1.6b": "A young man in Nebraska sells advertising space on his forehead on eBay for the highest bidder, starting with bids at around $10,0..\nThe story is about Andrew Fisher, who has been tattooing a non-permanent logo or brand name on his head for 3 days. After that time, he plans to have it removed and will allow the winning bidder to choose a tattoo, company name, or domain name for their branding. Fisher mentions not wanting to promote anything \"rationalistically\" like an adult website or store. He will use the funds from the auction to pay for college while studying graphic design. His mother is initially surprised by his decision but later supports it due to media attention.", "granite3.1-dense:2b": "20-year-old Andrew Fisher from Omaha, Nebraska, is auctioning forehead tattoo space on eBay for 30 days. The highest bid currently stands at over $322 (£171). Potential bidders can choose a company name or domain as the temporary tattoo design. Fisher plans to use the funds for college, specifically graphic design studies. He has set boundaries against promoting racist symbols and adult content. Initially, his mother was surprised but now supports his unconventional marketing campaign.", "reference": "Mr Fisher said that while he would accept any brand name or logo, \"I wouldn't go around with a swastika or anything racial\".Andrew Fisher, from Omaha, Nebraska, said he would have a non-permanent logo or brand name tattooed on his head for 30 days.\"The winner will be able to send me a tattoo or have me go to a tattoo parlour and get a temporary ink tattoo on my forehead and this will be something they choose, a company name or domain name, perhaps their logo,\" he told the Radio 4 programme.On the online auction, Mr Fisher describes himself as an \"average American Joe, give or take\".He added: \"I wouldn't go around with 666, the mark of the beast."}