{"raw_text": "Millions to miss out on the net\n \n By 2025, 40% of the UK's population will still be without internet access at home, says a study.\n \n Around 23 million Britons will miss out on a wide range of essential services such as education and medical information, predicts the report by telecoms giant BT. It compares to 27 million, or 50%, of the UK, who are not currently online. The idea that the digital divide will evaporate with time is \"wishful thinking\", the report concludes.\n \n The study calls on the government and telecoms industry to come up with new ways to lure those that have been bypassed by the digital revolution. Although the percentage of Britons without home access will have fallen slightly, those that remain digital refuseniks will miss out on more, the report suggests. As more and more everyday tasks move online and offline services become less comprehensive, the divide will become more obvious and more burdensome for those that have not got net access, it predicts.\n \n The gap between \"have-nets\" and \"have-nots\" has been much talked about, but predictions about how such a divide will affect future generations has been less discussed. BT set out to predict future patterns based on current information and taking account of the way technology is changing. Optimists who predict that convergence and the emergence of more user-friendly technology will bridge the digital divide could be way off mark, the report suggests. \"Internet access on other devices tends to be something taken up by those who already have it,\" said Adrian Hosford, director of corporate responsibility at BT. Costs of internet access have fallen dramatically and coverage in remote areas have vastly improved over the last year but the real barrier remains psychological. \"There is a hard rump of have-nots who are not engaging with the net. They don't have the motivation or skills or perceive the benefits,\" said Mr Hosford.\n \n As now, the most disadvantaged groups are likely to remain among low income families, the older generation and the disabled.\n \n Those on low incomes will account for a quarter of the digital have-nots, the disabled will make up 16% and the elderly nearly a third by 2025, the report forecasts. Organisations such as BT have a responsibility to help tackle the problem, said Mr Hosford. The telco has seen positive results with its Everybody Online project which offers internet access to people in eight deprived communities around Britain. In one area of Cornwall with high levels of unemployment, online training helped people rewrite CVs and learn skills to get new jobs, explained Mr Hosford. Such grassroot activity addressing the specific needs of individual communities is essential is the problem of the digital divide is to be overcome, he said. \"If we don't address this problem now, it will get a lot worse and people will find it more difficult to find jobs, education opportunities will be limited and they'll simply not be able to keep up with society,\" he said. The Alliance for Digital Inclusion, an independent body with members drawn from government, industry and the voluntary sector has recently been set up to tackle some of the issues faced by the digital refuseniks.\n", "llama3.2:1b": "The UK's population is projected to see a decline in internet access due to a lack of online education and job opportunities for those without it. \n\nBy 2025, around 40% of Britons will not have home internet access while approximately 27 million people are missing out on essential services such as education and medical information.\n\nDespite this, the gap between \"have-nets\" (those with internet access) and \"have-nots\" may narrow in some areas. \n\nThose most disadvantaged by the lack of online access include low-income families, older generations, and those with disabilities.\n\nThe digital divide is expected to worsen as more people become digitally literate but still lack essential services.", "llama3.2:3b": "40% of UK population will lack internet access at home by 2025\n23 million Britons will miss essential services due to no online access\nDigital divide will become more burdensome and obvious with time\nPsychological barrier remains as main obstacle to internet adoption\nLow-income families, older generation, and disabled groups most affected\nOrganisations must address the problem through community-specific initiatives", "gemma2:2b": "40% of the UK population will remain without home internet access by 2025.  The report concludes that this gap will likely increase as tasks move online, leaving those without internet access at a disadvantage for education, healthcare, and everyday life. The report calls for government and telecom industry partnerships to address the issue through new initiatives and programs designed specifically for those who have not yet adopted internet access. Groups like low-income families, the elderly, and people with disabilities are likely to continue lagging behind in digital inclusion. \n", "qwen2.5:0.5b": "Key points from the text:\n\n- 40% of UK population without internet access at home by 2025 \n- More than 13 million Britons not online, predicted by BT\n- Digital divide is a \"wishful thinking\" concept (not real)\n- Government and telecoms companies should offer more convenient services to bypass the digital divide\n- Low-income families will be the most disadvantaged groups among those without access to the net \n- Disabled people are also likely to face barriers due to lack of motivation or skills\n- The digital have-nots population is projected to increase, especially elderly, older generation and disabled populations.\n- Organizations such as BT have a responsibility to help address this issue.", "qwen2.5:1.5b": "The report predicts that 40% of UK residents will lack internet access by 2025, missing out on essential services. The digital divide persists despite declining costs and improved coverage. Optimists may be wrong; those without net access face more significant barriers as technology integrates into everyday life. Organizations like BT must address the psychological aspects of digital exclusion to help bridge the gap.", "qwen2.5:3b": "By 2025, 40% of UK's population will still lack home internet access, affecting education and medical services for around 23 million people, according to a BT study. The report suggests that while current figures show nearly half of Britons are online, the digital divide is likely to widen as more tasks move online. Addressing this issue requires new strategies, particularly focusing on low-income families, the elderly, and disabled individuals who remain disconnected. BT advocates for grassroots initiatives like its Everybody Online project to help these groups connect to the internet. The Alliance for Digital Inclusion aims to address the challenges faced by digital refuseniks.", "opencoder:1.5b": "A digital divide is a significant divide created by people with access to digital technology but not capable of it. It involves individuals or groups struggling to achieve net connectivity, often referred to as 'have-nots'. The study summarizes the situation by highlighting the disparity in internet usage among different age brackets and genders. Predictions have also been made about how the digital divide will impact future generations.\n", "smollm:1.7b": "The summary should contain the following key points:\n\n1. Millions to miss out on the net\n2. Around 23 million Britons will miss out on a wide range of essential services such as education and medical information, predicts the report.\n3. The idea that the digital divide will evaporate with time is \"wishful thinking\".\n4. The study calls on the government and telecoms industry to come up with new ways to lure those that have been bypassed by the digital revolution.\n5. Those that remain digital refuseniks will miss out on more, the report suggests.\n6. Optimists who predict that convergence and the emergence of more user-friendly technology will bridge the digital divide could be way off mark.\n7. The most disadvantaged groups are likely to remain among low income families, the disabled will make up a quarter of the digital have-nots, the elderly nearly a third by 2025, the report forecasts.\n8. Organisations such as BT have a responsibility to help tackle the problem, said Mr Hosford.\n9. The telco has seen positive results with its Everybody Online project which offers internet access to people in eight deprived communities around Britain.\n10. Addressing the specific needs of individual communities is essential to overcome the digital divide.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about the UK's internet access problem in a concise way, preserving key ideas and details. Let me read through the text again carefully.\n\nFirst, it says that by 2025, 40% of the UK's population will still be without internet access at home. That seems like a big number. Then it mentions that BT, their telecoms company, predicts around 23 million Britons won't have online services compared to about 27 million who are already online. So the digital divide is expected to grow. The report concludes that this wishful thinking is not realistic because as people move online, they might also start using other devices, which BT says has reduced costs and improved coverage in remote areas. However, psychological barriers like lack of motivation or perceived benefits remain a problem.\n\nThe report also points out that the most disadvantaged groups are likely to be low-income families, older generations, and those with disabilities. For example, a quarter of digital have-nots might be low-income. The elderly would make up nearly a third by 2025. Companies like BT are mentioned as being part of the solution, especially with their Everybody Online project in Cornwall, where online training helped individuals transition to jobs.\n\nSo, I need to condense this into a summary that includes all these key points: 40% without net access in 2025, BT's prediction with improved coverage but still a digital divide barrier, issues for low-income families, the elderly, and older generations. Also, mention the focus on tackling the have-nots by addressing specific communities like Cornwall.\n\nI should make sure not to include any explanations or reasoning, just present the summary as plain text.\n</think>\n\nBy 2025, 40% of the UK's population will still lack internet access at home, according to a study. BT predicts that around 23 million Britons won't have online services, compared to 27 million who are already online, highlighting a growing digital divide. The report notes that despite improvements in coverage and remote areas with declining costs, the psychological barriers of needing net access remain significant. The most disadvantaged groups—low-income families, older generations, and those with disabilities—will face more digital issues by then. Companies like BT are being sought as solutions, particularly through their \"furthermore online\" initiative in Cornwall to address specific community needs.", "tinyllama:1.1b": "Based on a report published by telecoms giant BT in March 2019, millions of people in the UK will be without access to the internet by 2025. This gap is predicted to widen as more and more everyday tasks move online and offline services become less comprehensive, leaving behind those that have not had access to the digital revolution. In order to address this problem, BT has suggested new ways to reach remote areas and those who are already \"have-nots,\" such as low-income families, older individuals, and disabled people. The report predicts that those on low incomes will account for a quarter of the digital have-nots, while organizations such as BT have a responsibility to address the digital divide. Grassroot activity focusing on specific communities is essential to overcome the problem, according to BT's vice president, Adrián HoSFord. The Alliance for Digital Inclusion has been established to tackle issues faced by the digital refugees.", "tinydolphin:1.1b": " The UK is predicted to miss out on essential services due to a digital divide in internet access. A report suggests that by 2025, 40% of the population will still be without home internet access, compared to 27 million who are not currently online. It compares this figure to around 23 million people who have no access to the digital revolution and live in urban areas where there is more connectivity. The report calls on the government and telecoms industry to work together to bridge the gap between \"have-net\" and \"have-nots\". However, predicting future patterns based on current information and considering the impact of technology on our lives, optimists might expect that convergence and improved access for all will be a reality. However, the internet as we know it today is not a perfect invention, and its use may still be limited to certain groups such as those with the financial means to own or rent devices. The main issue highlighted in the report is the digital divide where people who do not have internet access are at a significant disadvantage compared to those who have access. In order to address this problem, organizations like BT must work together with communities and individuals to provide affordable internet access to those who need it most.", "phi:2.7b": " A study predicts that 40% of the UK population will still lack home internet access in 2025, which will limit their access to essential services like education and medical information. BT calls on the government and telecoms industry to address this issue with new strategies, as more everyday tasks move online. The gap between \"have-nets\" and \"have-nots\" has not been discussed enough, but psychological barriers may keep some people from engaging with the internet. Those on low incomes, elderly, and disabled are likely to be among those who lack access in 2025. BT's Everybody Online project shows that grassroot efforts can help tackle this problem at a community level.\n", "orca-mini:3b": " By 2025, around 23 million Britons will not have internet access at home, which is 40% of the UK's population. This gap between \"have-nets\" and \"have-nots\" will become more pronounced with time, and those who are not online will miss out on essential services such as education and medical information. The report by BT predicts that the digital divide will evaporate with time, but optimists may be underestimating its impact. The problem of the digital divide is not just about the lack of access to the internet, but also about the psychological barriers that prevent people from engaging with it. The report suggests that low income families, the elderly, and the disabled will remain among the most disadvantaged groups in terms of digital access. To tackle this problem, BT has set up an initiative called Everybody Online, which offers internet access and training to communities facing high levels of unemployment. The Alliance for Digital Inclusion, an independent body with members drawn from government, industry, and the voluntary sector, has recently been set up to address some of the issues faced by the digital refuseniks.", "hermes3:3b": "By 2025, 40% of UK population still without home internet access, study finds; govt & telecoms must address digital divide issue.", "stablelm-zephyr:3b": "A study by BT predicts that by 2025, 40% of the UK's population will still be without home internet access, equating to around 23 million people who will miss out on essential services such as education and medical information. The digital divide is expected to widen further as more tasks move online and offline services become less comprehensive. While costs have fallen and coverage has improved in remote areas, the main barrier remains psychological for those unwilling to engage with the internet. Low-income families, the elderly, and disabled individuals are most likely to remain among the digital unprivileged. BT is addressing this issue through initiatives like its Everybody Online project and organizations such as The Alliance for Digital Inclusion aim to tackle the widening digital divide.", "chatgpt-4o-latest": "By 2025, 40% of the UK population, or 23 million people, will still lack home internet access, limiting their access to essential services like education and healthcare, according to a BT report. The study warns that the digital divide will not disappear naturally and urges the government and telecoms industry to find new ways to engage those left behind. While internet costs have dropped and coverage has improved, psychological barriers such as lack of motivation and skills persist. The most affected groups will be low-income families, the elderly, and the disabled. BT's Everybody Online project has shown success in helping disadvantaged communities gain digital skills, and broader grassroots efforts are needed to prevent worsening social and economic exclusion. The Alliance for Digital Inclusion has been established to address these challenges.", "stablelm2:1.6b": "A study predicts that 5 million UK residents will lack internet access at home, compared to 1 million who are currently online. The digital divide is expected to grow more obvious and burdensome for those without access, especially low-income families, older individuals, and disabled people. To address this issue, organizations such as BT offer internet access in deprived communities, but more efforts are needed to help disadvantaged groups adapt to the digital era. A new initiative called Alliance for Digital Inclusion aims to tackle the problem, with members from government, industry, and voluntary sector working together to overcome barriers for individuals not engaging with the net.", "granite3.1-dense:2b": "By 2025, approximately 40% of the UK's population will still lack home internet access, according to a BT report. This equates to around 23 million Britons who will miss out on essential services like education and medical information. The digital divide is expected to persist rather than diminish, with those without internet access being predominantly low-income families (40%), disabled individuals (16%), and the elderly (30%).\n\nThe report emphasizes that the traditional assumption of a narrowing digital gap due to technological advancements is \"wishful thinking.\" While internet access costs have decreased and coverage has improved in remote areas, the psychological barrier remains the primary challenge. Many potential internet users lack motivation, skills, or perceive insufficient benefits from online services.\n\nBT advocates for targeted initiatives to address this issue. Their Everybody Online project successfully provides internet access to individuals from eight deprived communities in Britain. For instance, in one Cornwall area with high unemployment rates, online training has helped people update their resumes and acquire new job skills.\n\nTo tackle the digital divide effectively, organizations like BT should focus on community-specific solutions. Additionally, bodies such as the Alliance for Digital Inclusion have been established to collaborate on addressing the concerns of digital refuseniks. Failing to address this problem now could exacerbate existing disadvantages and hinder individuals' access to job opportunities and quality education in the future.", "reference": "Although the percentage of Britons without home access will have fallen slightly, those that remain digital refuseniks will miss out on more, the report suggests.\"Internet access on other devices tends to be something taken up by those who already have it,\" said Adrian Hosford, director of corporate responsibility at BT.Optimists who predict that convergence and the emergence of more user-friendly technology will bridge the digital divide could be way off mark, the report suggests.Organisations such as BT have a responsibility to help tackle the problem, said Mr Hosford.Such grassroot activity addressing the specific needs of individual communities is essential is the problem of the digital divide is to be overcome, he said.The idea that the digital divide will evaporate with time is \"wishful thinking\", the report concludes.Those on low incomes will account for a quarter of the digital have-nots, the disabled will make up 16% and the elderly nearly a third by 2025, the report forecasts.As more and more everyday tasks move online and offline services become less comprehensive, the divide will become more obvious and more burdensome for those that have not got net access, it predicts.The telco has seen positive results with its Everybody Online project which offers internet access to people in eight deprived communities around Britain."}