{"raw_text": "Disney backs Sony DVD technology\n \n A next generation DVD technology backed by Sony has received a major boost.\n \n Film giant Disney says it will produce its future DVDs using Sony's Blu-ray Disc technology, but has not ruled out a rival format developed by Toshiba. The two competing DVD formats, Blu-ray developed by Sony and others, and Toshiba's HD-DVD, have been courting top film studios for several months. The next generation of DVDs promise very high quality pictures and sound, as well as a lot of data. Both technologies use a blue laser to write information. It has a shorter wavelength so more data can be stored. Disney is the latest studio to announce which technology it is backing in a format battle which mirrors the 1980s Betamax versus VHS war. Sony lost out to JVC in that fight.\n \n The current battle for Hollywood's hearts and minds is a crucial one because high-definition films will bring in billions of revenue and the studios would prefer to use one standard. Last month, Paramount, Universal and Warner Brothers said they were opting for the Toshiba and NEC-backed format, HD-DVD high-definition discs.\n \n Those studios currently produce about 45% of DVD content. Sony Pictures Entertainment and MGM Studios have already staked their allegiance with the Blu-ray Disc Association, whose members also include technology companies Dell, Samsung and Matsushita. Twentieth Century Fox is still to announce which technology it will be supporting. If Fox decided to go with Blu-ray too, it would mean the format would have a 47% share of DVD content. Disney said its films would be available on the Blu-ray format when DVD players for the standard went on sale on North America and Japan, expected in 2006. Universal is to start producing films on the HD-DVD format in 2005, and Paramount will start releasing titles using the standard in 2006. Toshiba expects sales of HD-DVDs to reach 300bn yen ($2.9bn, £1.5bn) by 2010.\n", "llama3.2:1b": "Disney backs Sony's Blu-ray technology for future DVDs, but has not ruled out supporting Toshiba's HD-DVD format. The two formats compete in a battle against competing technologies developed by Paramount and Universal. Other studios have also opted for the Toshiba-backed HD-DVD format, while Disney will produce its films on the Blu-ray Disc Association standard when DVD players go on sale in 2006.", "llama3.2:3b": "Disney backs Sony's Blu-ray Disc technology while not ruling out Toshiba's HD-DVD format, amidst a battle for top film studios' support in the next generation of DVDs which use blue lasers to write information and promise high-quality pictures and sound.", "gemma2:2b": "Disney has chosen Sony's Blu-ray Disc technology for its future DVDs.  This decision follows a trend where major studios are aligning themselves with specific DVD technologies. Paramount, Universal, and Warner Brothers have opted for Toshiba's HD-DVD format, while Disney, Sony Pictures Entertainment, and MGM Studios support Blu-ray. The choice of format has implications for revenue generation and the overall direction of high-definition film distribution. \n", "qwen2.5:0.5b": "Disney backs Sony Blu-ray technology but has not ruled out rival format from Toshiba. Both Blu-ray and HD-DVD formats are competing for DVD titles with a short wavelength blue laser beam. Blu-ray uses Sony's Blu-ray Disc technology, while Toshiba's HD-DVD is developing its own format. Disney will produce DVDs using Sony Blu-ray technology, but may support the Toshiba format as well.", "qwen2.5:1.5b": "Disney backs Sony's Blu-ray Disc technology for future DVDs, with potential competition from Toshiba's HD-DVD format as Hollywood studios decide on next-generation DVD standard.", "qwen2.5:3b": "Disney backs Sony's Blu-ray Disc technology for future DVDs production. The move comes as two competing DVD formats, Blu-ray and Toshiba's HD-DVD, compete for top film studios' support. Disney will use Sony's format but may back HD-DVD in the future, joining other major studios like Paramount, Universal, and Warner Brothers who prefer Toshiba's standard. The battle is crucial as high-definition films will generate billions in revenue; if Fox also supports Blu-ray, it would secure 47% of DVD content share. Current plans indicate Sony and its partners plan to start using the Blu-ray format by 2006, while Universal and Paramount intend to switch to HD-DVD for film production starting 2005-2006 respectively. Toshiba expects HD-DVD sales to reach $2.9 billion ($300bn yen) by 2010.", "opencoder:1.5b": "Disney backs Sony DVD technology\n\nA next generation DVD technology backed by Sony has received a major boost. Film giant Disney says it will produce its future DVDs using Sony's Blu-ray Disc technology but has not ruled out a rival format developed by Toshiba. The two competing DVD formats, Blu-ray developed by Sony and others, and Toshiba's HD-DVD, have been courting top film studios for several months. The next generation of DVDs promise very high quality pictures and sound as well as a lot of data. They use a blue laser to write information. It has a shorter wavelength so more data can be stored. Disney is the latest studio to announce which technology it is backing in a format battle that mirrors the 19th century Betamax versus VHS war. Sony lost out to JVC in this fight.\n", "smollm:1.7b": "Disney backs Sony DVD technology", "deepseek-r1:1.5b": "<think>\nOkay, so I need to help summarize this text about Disney backing Sony's DVD technology and a competing format from Toshiba. Let me read through it again carefully.\n\nThe first paragraph mentions that Disney is backing Sony's Blu-ray Disc technology and hasn't ruled out a rival called HD-DVD from Toshiba. The competition has been ongoing for months, with several studios trying to switch formats. The main reason for this competition is high-definition content which promises better quality and more data storage. Both technologies use blue lasers but the shorter wavelength of Blue laser allows more data storage, which benefits content delivery.\n\nDisney was in a race against other big studios like JVC and others. They lost that fight by Sony to JVC, according to the text. The competition is crucial because high-definition films bring in significant revenue for studios, so they need a standard format to compete on.\n\nCurrently, 45% of DVD content comes from Blu-ray, while Toshiba's HD-DVD might have higher usage if it becomes popular. Paramount, Universal, and Twentieth Century Fox are starting production on the Toshiba formats, but it's uncertain when. If Disney chooses Blu-ray, their films would be available then. On the other hand, Universal is already going with HD-DVD starting in 2005.\n\nToshiba expects HD-DVD sales to reach $300 billion by 2010. The summary needs only the key points without any explanations or formatting.\n\nI should make sure to include Disney's backing for both formats, their current usage percentages, the competition's timing and results, the impact of high-definition on revenue, and the schedules for production on each format.\n\nLet me structure this into a concise summary that highlights these elements.\n</think>\n\nDisney is supporting both Sony's Blu-ray Disc technology and Toshiba's HD-DVD format in efforts to offer high-definition content. Currently, 45% of DVD content comes from Sony's Blu-ray discs, while Toshiba might have a higher usage. The competition was intense between 1980s Betamax versus VHS formats. Disney lost the bet to JVC, with JVC winning. High-definition films drive revenue, so studios need standardized formats like Blu-ray or HD-DVD. Currently, 47% of content is expected for Toshiba's format if it becomes popular. Disney plans to support Blu-ray by 2006, Universal starts HD-DVD in 2005, and production schedules vary between studios.", "tinyllama:1.1b": "Disney has announced that it will produce its future DVD releases using Sony's Blu-ray Disc technology, while other top film studios like Warner Brothers and Paramount have already opted for the Toshiba and NEC-backed HD-DVD format. The next generation of DVDs promises higher quality images and sounds, as well as a lot of data storage. This battle between Blu-ray Disc and HD-DVD has mirrored the 1980s Betamax versus VHS war. It is crucial for Hollywood's hearts and minds as high-definition films are about to bring in billions of revenues, and studios would prefer to use one standard. The current battle for Hollywood's attention includes approximately 45% of DVD content being produced by Sony's Blu-ray Disc technology, with Twentieth Century Fox yet to announce its support. Disney has already announced that it will release films on both the standard and HD-DVD formats in North America and Japan, expected to start producing films using the HD-DVD format in 2005 and reach a market worth $2.9bn by 2010.", "tinydolphin:1.1b": " In simple terms: Disney has recently committed to using Sony's Blu-ray Disc technology for future DVD releases. This marks a significant boost in the battle between the rival formats - Toshiba's HD-DVD and Sony's Blu-ray Disc. The next generation of DVDs promises superior> high quality pictures and sound, as well as a lot of data. Both technologies use a blue laser to write information. Both formats also have shorter wavelengths compared to standard DVDs, which means they can store more data per disc. As studios opt for one format over the other, this battle will have significant consequences on Hollywood's box office in the coming years.", "phi:2.7b": " Disney has announced that it will produce its future DVDs using Sony's Blu-ray Disc technology, but is open to a rival format developed by Toshiba. This announcement comes after several studios have released their support for either the Toshiba and NEC-backed HD-DVD high-definition discs or the Sony Pictures Entertainment and MGM Studios' Blu-ray Disc Association.\n", "orca-mini:3b": " Disney has announced that its future DVDs will be produced using Sony's Blu-ray Disc technology but it is not ruling out a rival format developed by Toshiba. The two competing formats, Blu-ray and HD-DVD, are currently courting top film studios for their next generation of DVDs which promise high quality pictures and sound along with a lot of data. Both technologies use a blue laser to write information but Sony's Blu-ray Disc technology has a shorter wavelength so more data can be stored. In the current format battle, Paramount, Universal and Warner Brothers have announced that they will be using the Toshiba and NEC-backed format, HD-DVD high-definition discs. Twentieth Century Fox is still to announce which technology it will be supporting. If Fox decided to go with Blu-ray too, it would mean the format would have a 47% share of DVD content. Disney is expected to start producing films on the Blu-ray Disc Association standard in 2006.", "hermes3:3b": "Disney supports Sony's Blu-ray DVD technology.", "stablelm-zephyr:3b": "Disney will use Sony's Blu-ray Disc technology for its future DVDs, backing the next generation format which promises high quality pictures and sound with more data storage. This decision comes after major studios like Paramount, Universal, and Warner Brothers announced they would back Toshiba and NEC's HD-DVD format. The choice of standard is crucial because high-definition films will bring in billions of revenue for Hollywood. Sony Pictures Entertainment, MGM Studios, Dell, Samsung, and Matsushita are members of the Blu-ray Disc Association, while Toshiba expects sales of its HD-DVDs to reach ¥300 billion by 2010.", "chatgpt-4o-latest": "Disney has announced its support for Sony's Blu-ray Disc technology for future DVDs but has not ruled out Toshiba's rival HD-DVD format. The two competing technologies, which use blue lasers for higher data storage and quality, have been vying for major film studio backing. Disney's decision adds to the ongoing format battle, reminiscent of the Betamax vs. VHS war. Paramount, Universal, and Warner Brothers have chosen HD-DVD, while Sony Pictures and MGM support Blu-ray. Twentieth Century Fox has yet to decide, but if it backs Blu-ray, the format would control 47% of DVD content. Disney plans to release Blu-ray films when players launch in North America and Japan in 2006. Universal will start HD-DVD production in 2005, with Paramount following in 2006. Toshiba projects HD-DVD sales to reach 300 billion yen by 2010.", "stablelm2:1.6b": "Disney has decided to produce future DVDs using Sony's Blu-ray Disc technology, while not ruling out support for Toshiba's rival format. The two competing DVD formats, Blu-ray and HD-DVD, are being pursued by major film studios in a format battle similar to the VHS versus Betamax era. Both technologies use a blue laser to write information, with Blu-ray having a shorter wavelength allowing more data to be stored. Disney is the latest studio to announce its preference for the format, which will likely result in a 50% share of DVD content. Paramount and Universal are already producing films on the HD-DVD format, while Warner Brothers chose Toshiba's format last month. Sony Pictures Entertainment, MGM Studios, Dell, Samsung, and Matsushita have joined forces with the Blu-ray Disc Association, while Twentieth Century Fox has not yet announced its preference.", "granite3.1-dense:2b": "Disney has announced its support for Sony's Blu-ray Disc technology as the next generation DVD format for future productions. This move follows other major studios like Paramount, Universal, and Warner Brothers, who have chosen Toshiba's HD-DVD format. The decision underscores the significance of this battle in Hollywood, as high-definition films are expected to generate billions in revenue. Disney plans to release its DVDs on Blu-ray when compatible players hit North America and Japan in 2006. Meanwhile, Universal will start using HD-DVD in 2005, and Paramount will begin releasing titles on the format in 2006. Toshiba anticipates sales of HD-DVDs reaching 300 billion yen ($2.9bn, £1.5bn) by 2010.", "reference": "Film giant Disney says it will produce its future DVDs using Sony's Blu-ray Disc technology, but has not ruled out a rival format developed by Toshiba.A next generation DVD technology backed by Sony has received a major boost.Disney said its films would be available on the Blu-ray format when DVD players for the standard went on sale on North America and Japan, expected in 2006.The two competing DVD formats, Blu-ray developed by Sony and others, and Toshiba's HD-DVD, have been courting top film studios for several months.If Fox decided to go with Blu-ray too, it would mean the format would have a 47% share of DVD content.Disney is the latest studio to announce which technology it is backing in a format battle which mirrors the 1980s Betamax versus VHS war.Universal is to start producing films on the HD-DVD format in 2005, and Paramount will start releasing titles using the standard in 2006."}