{"raw_text": "Britons growing 'digitally obese'\n \n Gadget lovers are so hungry for digital data many are carrying the equivalent of 10 trucks full of paper in \"weight\".\n \n Music, images, e-mails, and texts are being hoarded on mobiles, cameras laptops and PDAs (Personal Digital Assistants), a Toshiba study found. It found that more than 60% kept 1,000 to 2,000 music files on their devices, making the UK \"digitally fat\". \"Virtual weight\" measurements are based on research by California Institute of Technology professor Roy Williams. He calculated physical comparisons for digital data in the mid-1990s. He worked out that one gigabyte (1,000,000,000 bytes) was the equivalent of a pick-up truck filled with paper. The amount of data people are squirreling away on their gadgets is clearly a sign that people are finding more things to do with their shiny things.\n \n If digital hoarding habits continue on this scale, people could be carrying around a \"digitally obese\" 20 gigabytes by next year. \"Britain has become a nation of information hoarders with a ferocious appetite for data,\" said Martin Larsson, general manager of Toshiba's European storage device division.\n \n \"As storage capabilities increase and the features and functionalities of mobile devices expand to support movie files and entire libraries of multi-media content, we will all become virtually obese,\" he told the BBC News website. The survey reflects the increasing trend for portable devices with built-in hard drives like music and media players from Apple, Creative Labs, Archos, iRiver and others. This trend is set to grow, according to analysts. They suggest the number of hard drives in consumer electronics gadgets could grow from 17 million last year to 55 million in 2006. \"Consumers are driving the move towards smaller devices that have greater functionality, and industry is trying to keep up,\" said Mr Larsson. \"People are looking for more than just phone calls and text messages on the move, they want things like web browsing, e-mailing, music, photos and more.\"\n \n Many are finding memory keys and memory sticks are simply not big enough to hold everything.\n \n \"Floppies and memory keys have their place, but they don't have anything like the capacity or flexibility of a hard drive so are unable to meet the demand for more and more storage capacity in consumer devices,\" said Mr Larsson. The cost of making hard drives has dropped and is continuing to do so because of improved technologies so they are proving to be more cost-effective than other forms of memory, he added. The amount of data that can be stored has grown by 400% in the last three years, while the cost for every gigabyte has fallen by 80%. It is also getting easier to transfer files from one device to another, which has traditionally been a slow and problematic area. \"Transfer of data between different memory types has improved significantly in recent times, and will be further helped by the standards for hard drives which are currently being developed by the major manufacturers,\" said Mr Larsson. According to technology analysts IDC, a fifth of all hard drives produced will be used in consumer electronics by 2007.\n", "llama3.2:1b": "Britons are carrying around 10 trucks full of paper equivalent digital data on their devices.\n\nA study by Toshiba found that over 60% of people keep 1,000 to 2,000 music files on their mobiles and laptops.\n\nThe amount of digital data being hoarded is increasing rapidly due to the rise in portable devices with built-in hard drives and increased storage capacity.\n\nConsumers are seeking more functionality from their devices than just phone calls and text messages, driving demand for larger storage devices such as movie files and media libraries.", "llama3.2:3b": "Britons are carrying around an equivalent of 10 trucks full of paper on their mobile devices due to excessive digital data hoarding, with over 60% keeping 1,000-2,000 music files and potentially reaching a \"digitally obese\" 20 gigabytes by next year.", "gemma2:2b": "Britons store large amounts of digital data on their mobile devices and laptops.  This has led to the UK being dubbed \"digitally obese\" with some people holding more than 2 gigabytes of data. This trend is driven by increased device functionality, storage capacity improvements, and easier data transfer methods. The use of hard drives is expected to increase in consumer electronics as they become more cost-effective compared to other types of memory.  By 2007, a fifth of all hard drives are anticipated for use in consumer electronics.  \n", "qwen2.5:0.5b": "Here's a summary of the text:\n\n- Britons have a \"digitally obese\" state due to digital hoarding and storage.\n- More than 60% keep 1,000 to 2,000 music files on devices like smartphones.\n- Digital data is measured by a study from California Institute of Technology professor Roy Williams. One gigabyte (1,000,000,000 bytes) = 20 gigabytes.\n- Data hoarding has caused people to carry around digital \"digitally obese\" gadgets with \"virtual weight.\"\n- Many consumers find memory keys and memory sticks are not big enough for more storage capacity.\n- Hard drives have grown in cost but can still transfer data between devices, making it easier to transfer files.", "qwen2.5:1.5b": "In Britain, digital hoarding is widespread with mobile devices holding up to 10 trucks' worth of paper equivalents for music files alone. This trend towards larger storage capacity and expanded functionality on portable gadgets continues, projected to further increase hard drive usage among consumers. The cost has fallen, making hard drives more affordable while allowing for greater data storage. New standards are being developed to improve file transfer between devices, addressing a previously problematic area.", "qwen2.5:3b": "Britons are storing vast amounts of digital data on their gadgets, leading some experts to describe them as \"digitally fat.\" A Toshiba study found that more than 60% keep 1,000 to 2,000 music files on their devices. This trend has led experts to predict a rise in the amount of \"digital obesity\" by next year if current habits continue. The increasing popularity of portable devices with built-in hard drives is contributing to this trend, as they offer more storage capacity and functionality such as web browsing, e-mailing, music, photos, and video playback. This has led to memory limits being exceeded on some gadgets, prompting the development of standards for improved data transfer between different types of memory.", "opencoder:1.5b": "The output from this prompt is an overview of digital hoarding habits and trends within the world of gadgets and technology. It focuses on key points that highlight the growing demand for more versatile storage devices compared to traditional paper-based methods.\n", "smollm:1.7b": "The text is about how people are becoming increasingly dependent on digital devices and storage capacity has become a major concern. The article highlights the trend of people carrying around large amounts of data on their mobile devices, which is contributing to the growing problem of digital hoarding. It also mentions that many people are finding it difficult to store all this data in smaller devices like smartphones and laptops.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Britons becoming digitally obese because they're holding onto too much data. Let me read through it again.\n\nThe first sentence says \"Britons growing 'digitally obese'\". That's their main point. Then there's a quote from a Toshiba study: \"Gadget lovers are so hungry for digital data; many are carrying the equivalent of 10 trucks full of paper.\" So they're holding lots of files on their gadgets.\n\nThen it mentions music, images, emails, texts on mobiles, cameras, laptops, PDAs. According to the study, over 60% kept 1,000-2,000 music files, which is like a big pile. This makes them look \"digitally fat.\" They've measured this using something called \"virtual weight\" by Roy Williams, who compared gigabytes (1e9 bytes) to pick-up truck paper. He said one gigabyte equals about 6,500 pounds of paper.\n\nThe UK would be the largest in the world with around 20 gigabytes next year. Martin Larsson from Toshiba says this shows people find more uses for their gadgets. The study's conclusion is that Britain has become a hotspot for data hoarding because storage is getting bigger and devices are more powerful.\n\nThen there's some analysis by Larsson about the trend: devices like Apple, Creative Labs, Archos, iRiver are introducing hard drives. Last year's sales of hard drives were 17 million, aiming to reach 55 million in 2006. Hard drives are cheaper now because tech is improving.\n\nMemory sticks and floppies don't hold as much data, but he says that's not a problem yet—hard drives can handle more. Transfer speeds have improved too; moving files between different devices has become faster with hard drives standardizing better.\n\nIDC found that in 2006, only a fifth of all hard drives were used in consumer electronics. So even though they're cheaper and faster, the bigger picture is about having enough storage for content needs like movies, music, images.\n\nPutting it all together: Britain has a lot of data hoarding because people are getting more devices with big storage, and they can't keep up without using hard drives instead. They'll become \"digitally obese\" next year if this trend continues.\n</think>\n\nBritons have increasingly become \"digitally obese\" due to excessive data holding on their gadgets, according to a study by Toshiba. The study highlights that users carry over 10 truckloads of paper worth hundreds of thousands of files on average, making them look digitally fat. Using virtual weight measurements, the study equates 1 gigabyte (1e9 bytes) with roughly 6,500 pounds of paper. Britain, in particular, could reach around 20 gigabytes by next year, driven by increasing storage and device power. Analysis suggests that as hard drives become more common and data transfer speeds improve, even smaller devices will adopt them due to cost and efficiency gains from standardizing hard drive technology. This trend is set to grow, with only a fifth of all consumer electronics' 2006 output using hard drives by 2007.", "tinyllama:1.1b": "The \"digitally obese\" trend has been noticed as people are now carrying around gigabytes worth of digital data on their mobile devices and laptops, with more than 1,000 music files stored on a single device. The trend is being driven by larger storage capabilities that come with mobile devices, including memory keys and memory sticks, making it hard to hold everything, resulting in people carrying around virtual weight of digital data. According to technology analysts IDC, by 2007, half of all hard drives produced will be used for consumer electronic devices.", "tinydolphin:1.1b": " The current trend among consumers is to buy smaller and more powerful gadgets that can access and store vast amounts of data. This surge in portable devices with built-in hard drives, such as music players from Apple, Creative Labs, Archos, iRiver, and others, has driven the demand for additional storage capacity. According to analysts, this trend is set to grow by 400% in the next three years. As storage capabilities increase and functionalities become more advanced, consumers are becoming more comfortable with the idea of carrying around devices with a substantial amount of stored data. This trend has several consequences:\n\n1. Increased consumer convenience: Consumers are looking for more than just phone calls and text messages on the move, they want access to the wealth of information that can be found on their gadgets. This demand is driving innovation in storage technology, allowing devices to hold a greater amount of data without feeling heavy or cluttered.\n\n2. Flexibility: Many are finding memory keys and memory sticks simply not big enough to hold everything they need. In response, manufacturers have been developing new types of storage devices, such as hard drives and flash drives, that can accommodate larger quantities of data and are more easily carried around. This technology will continue to improve in the coming years, allowing consumers to store even greater amounts of information on their gadgets.\n\n3. Lower cost: Hard drives have become more affordable due to improved manufacturing techniques and reduced costs for producing them. With storage capacities doubling every three years, it is now much easier for consumers to invest in larger quantities of data storage than it was just a few years ago. This trend has driven the growth of the market for consumer electronics with built-in hard drives, such as music players and media players from Apple, Creative Labs, Archos, iRiver, and others.\n\n4. Accessibility: With more storage available on these devices, consumers are also looking for ways to access and manage this wealth of information. This has led to the development of user interfaces that allow users to navigate through their gadgets' contents with ease. For example, some models have touch-sensitive screens or gesture recognition capabilities, allowing users to quickly locate specific files or media content without having to rely on traditional controls.\n\n5. Improved security: With the addition of more storage capacity, manufacturers are also focusing on creating devices that are secure and reliable. This includes measures such as encryption algorithms, secure boot features, and other technologies that help protect user data from unauthorized access. In the long term, this trend will continue to drive the growth of consumer electronics with built-in hard drives, allowing users to store a vast amount of information on their devices without worrying about security vulnerabilities or the risk of losing data.", "phi:2.7b": " People carrying around multiple devices such as mobiles, laptops, and PDAs hoard digital data. They store music, images, e-mails, and texts on these devices, which could lead to 'digital obesity.' As the storage capabilities of portable gadgets increase, people will continue to store more and more data, according to Toshiba's general manager of European storage device division. Analysts predict that the number of hard drives in consumer electronics devices could grow from 17 million last year to 55 million in 2006. Many consumers are finding memory keys and sticks insufficient for their needs as they are unable to hold enough data. Hard drives are becoming more cost-effective due to improved technologies, which have made them a better storage option than other forms of memory. Transferring files between different memory types has also become easier. IDC predicts that a fifth of all hard drives produced will be used in consumer electronics by 2007.\n", "orca-mini:3b": " The British are becoming \"digitally obese\" due to their appetite for digital data on gadgets such as music, images, e-mails, and texts. Toshiba found that more than 60% of Britons keep 1,000 to 2,000 music files on their devices, making them \"digitally fat\". One gigabyte is equivalent to a pick-up truck filled with paper. The amount of data people are squirreling away on their gadgets suggests that they have more things to do with their shiny things. The trend for portable devices with built-in hard drives like music and media players from Apple, Creative Labs, Archos, iRiver, and others is set to grow. Many people are finding memory keys and memory sticks are simply not big enough to hold everything, and the cost of making hard drives has dropped. The amount of data that can be stored has grown by 400% in the last three years, while the cost for every gigabyte has fallen by 80%. It is also getting easier to transfer files from one device to another, which has traditionally been a slow and problematic area. According to technology analysts IDC, a fifth of all hard drives produced will be used in consumer electronics by 2007.", "hermes3:3b": "Britons becoming 'digitally obese' with over 60% keeping 1000-2000 music files on devices, leading to virtual weight equivalent of 20GB by next year.", "stablelm-zephyr:3b": "A study by Toshiba found that Britons are accumulating digital data similar to the amount of 10 trucks full of paper, with over 60% storing 1,000 to 2,000 music files on their devices. As storage capabilities increase and mobile devices support more media content, people risk becoming \"digitally obese.\" The trend reflects consumers' desire for greater functionality in portable devices, driving the industry to provide more storage capacity. Hard drives have become more cost-effective due to improved technologies, allowing for significant growth in hard drive usage in consumer electronics, estimated at 55 million in 2006 by technology analysts IDC.", "chatgpt-4o-latest": "Britons are accumulating vast amounts of digital data, with many carrying the equivalent of 10 truckloads of paper in \"virtual weight,\" according to a Toshiba study. The trend of digital hoarding, driven by increasing storage capacities and multifunctional mobile devices, has led to concerns of \"digital obesity.\" Many users store thousands of music files, emails, and images on gadgets like smartphones, laptops, and PDAs. As storage technology advances and costs decrease, the demand for larger capacities continues to grow, with analysts predicting a surge in hard drive use in consumer electronics. Improved data transfer and declining costs have further fueled this trend, with a fifth of all hard drives expected to be used in consumer devices by 2007.", "stablelm2:1.6b": "Gadget lovers are accumulating large amounts of digital data on devices like mobiles, laptops, and PDAs, leading to \"digital obesity\" in the UK. A Toshiba study reveals that over 10% store music files on their gadgets, making Britain a nation of information hoarders. The survey reflects the trend for portable devices with built-in hard drives supporting multi-media content. As storage capabilities increase, consumers will require more than just phone calls and text messages while on the move, including web browsing, emailing, music, photos, and others. Hard drives are proving to be more cost-effective than other forms of memory due to dropped costs for producing them. The amount of data that can be stored has grown by 10% in three years, while the cost per gigabyte has fallen by 50%.", "granite3.1-dense:2b": "Britons are accumulating digital data at an alarming rate, creating what the Toshiba study describes as \"digitally obese\" behavior. Over 60% of individuals keep between 1,000 to 2,000 music files on their devices, equating to approximately 1 gigabyte (equivalent to a pick-up truck filled with paper). This trend is driven by expanding features and functionalities in portable devices, such as media players from Apple, Creative Labs, Archos, iRiver, and others. As storage capacities increase and costs decrease, the number of hard drives in consumer electronics gadgets is expected to rise from 17 million last year to 55 million by 2006. The general manager of Toshiba's European storage device division, Martin Larsson, predicts that consumers will become \"virtually obese\" with up to 20 gigabytes of data in their devices by next year due to this growing digital hoarding habit. This shift is primarily driven by consumers' desire for more functionality on mobile devices, including web browsing, emailing, music playback, and photo viewing, which outpaces the capacity offered by memory keys and floppy disks. The cost per gigabyte has dropped by 80%, and data transfer between different storage types is becoming faster and more efficient due to ongoing industry developments.", "reference": "\"Transfer of data between different memory types has improved significantly in recent times, and will be further helped by the standards for hard drives which are currently being developed by the major manufacturers,\" said Mr Larsson.The cost of making hard drives has dropped and is continuing to do so because of improved technologies so they are proving to be more cost-effective than other forms of memory, he added.\"Floppies and memory keys have their place, but they don't have anything like the capacity or flexibility of a hard drive so are unable to meet the demand for more and more storage capacity in consumer devices,\" said Mr Larsson.Gadget lovers are so hungry for digital data many are carrying the equivalent of 10 trucks full of paper in \"weight\".They suggest the number of hard drives in consumer electronics gadgets could grow from 17 million last year to 55 million in 2006.\"Britain has become a nation of information hoarders with a ferocious appetite for data,\" said Martin Larsson, general manager of Toshiba's European storage device division.According to technology analysts IDC, a fifth of all hard drives produced will be used in consumer electronics by 2007.The survey reflects the increasing trend for portable devices with built-in hard drives like music and media players from Apple, Creative Labs, Archos, iRiver and others.The amount of data that can be stored has grown by 400% in the last three years, while the cost for every gigabyte has fallen by 80%."}