{"raw_text": "Hi-tech posters guide commuters\n \n Interactive posters are helping Londoners get around the city during the festive season.\n \n When interrogated with a mobile phone, the posters pass on a number that people can call to get information about the safest route home. Sited at busy underground stations, the posters are fitted with an infra-red port that can beam information directly to a handset. The posters are part of Transport for London's Safe Travel at Night campaign.\n \n The campaign is intended to help Londoners, especially women, avoid trouble on the way home. In particular it aims to cut the number of sexual assaults by drivers of unlicensed minicabs. Nigel Marson, head of group marketing at Transport for London (TfL), said the posters were useful because they work outside the mobile phone networks. \"They can work in previously inaccessible areas such as underground stations which is obviously a huge advantage in a campaign of this sort,\" he said.\n \n The posters will automatically beam information to any phone equipped with an IR port that is held close to the glowing red icon on the poster. \"We started with infra-red because there are a huge number IR phones out there,\" said Rachel Harker, spokeswoman for Hypertag which makes the technology fitted to the posters. \"It's a well established technology.\" Hypertag is also now making a poster that uses short-range Bluetooth radio technology to swap data. Although the hypertags in the posters only pass on a phone number, Ms Harker said they can pass on almost any form of data including images, ring tones and video clips. She said that there are no figures for how many people are using the posters but a previous campaign run for a cosmetics firm racked up 12,500 interactions. \"Before we ran a campaign there was a big question mark of: 'If we build it will they come?'\" she said. \"Now we know that, yes, they will.\" The TfL campaign using the posters will run until Boxing Day.\n", "llama3.2:1b": "Interactive posters with infrared ports at busy underground stations in London provide information to commuters on safe routes home during the festive season through mobile phone calls.", "llama3.2:3b": "Interactive hi-tech posters are helping Londoners navigate the city during the festive season with information on safe routes home. Sited at busy underground stations, the posters can be communicated with via mobile phone and beam information to handsets equipped with an infra-red port or a new Bluetooth technology. The posters aim to help reduce sexual assaults by unlicensed minicab drivers, especially targeting women, and are part of Transport for London's Safe Travel at Night campaign, which will run until Boxing Day.", "gemma2:2b": "Interactive posters in London provide information about safe routes home during the festive season. These posters use infrared technology to beam information directly to mobile phones held near a specific icon on the poster. This technology is accessible even in areas with poor mobile phone reception, such as underground stations. The posters' interaction aims to reduce sexual assaults by unlicensed minicab drivers. A previous campaign saw 12,500 interactions using similar technology.  \n", "qwen2.5:0.5b": "Hi-tech interactive posters guide commuters to navigate through London's busy underground stations during festive times. These devices use an infra-red port that can send information about safe routes home via a mobile phone. They are placed at busy locations like subways and train stations, allowing people to call for help quickly. The poster technology works outside traditional mobile networks, making it useful in areas where these networks are limited or inaccessible. The posters aim to cut the number of sexual assaults by drivers of unlicensed minicabs during Safe Travel at Night campaign.", "qwen2.5:1.5b": "Interactive high-tech posters guide Londoners during festive season for safer travel home, targeting women and minicab drivers, utilizing IR technology to beam phone numbers directly to mobiles at inaccessible underground stations; campaign aims to reduce sexual assaults by unlicensed cab drivers through increased visibility in areas without mobile signal coverage.", "qwen2.5:3b": "Hi-tech posters at London underground stations guide commuters with an infra-red port to call for safe routes home during the festive season. Part of Transport for London's Safe Travel at Night campaign, these interactive posters help avoid trouble, especially for women and are useful in areas like underground stations. The technology can beam phone numbers or other data like images, ring tones, and videos. TfL's Nigel Marson notes their advantage is they work outside mobile networks. Hypertag spokeswoman Rachel Harker says the posters started with infra-red because it's established tech but also make posters using Bluetooth radio technology. TfL campaign will run until Boxing Day, with previous campaigns showing positive engagement.", "opencoder:1.5b": "The output is a concise summary of the given text. It summarizes the key ideas and details about the use of interactive posters during the Transport for London's Safe Travel at Night campaign.\n", "smollm:1.7b": "The following is a summary of the text:\n\nInteractive posters are helping Londoners get around the city during the festive season by providing information about the safest route home through mobile phones. When interrogated with a mobile phone, the posters pass on a number that people can call to get information about the safest route home. The posters are installed at busy underground stations and have an infra-red port that can beam information directly to a handset. The posters are part of Transport for London's Safe Travel at Night campaign.\n\nThe campaign aims to help Londoners, especially women, avoid trouble on the way home by cutting the number of sexual assaults by drivers of unlicensed minicabs. Nigel Marson, head of group marketing at Transport for London (TfL), said the posters are useful because they work outside the mobile phone networks. \"They can work in previously inaccessible areas such as underground stations which is obviously a huge advantage in a campaign of this sort,\" he said.\n\nThe posters will automatically beam information to any phone equipped with an IR port that is held close to the glowing red icon on the poster. \"We started with infra-red because there are a huge number IR phones out there,\" said Rachel Harker, spokeswoman for Hypertag which makes the technology fitted to the posters. \"It's a well established technology.\" Hypertag is also now making a poster that uses short-range Bluetooth radio technology to swap data. Although the hypertags in the posters only pass on a phone number, Ms Harker said they can pass on almost any form of data including images, ring tones and video clips. She said that there are no figures for how many people are using the posters but a previous campaign run for a cosmetics firm racked up 12,500 interactions. \"Before we ran a campaign there was a big question mark of: 'If we build it will they come?'\" she said. \"Now we know that, yes, they will.\" The TfL campaign using the posters will run until Boxing Day.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text concisely while preserving the key ideas and details. Let me read through the provided text carefully.\n\nThe text starts with Hi-tech posters in London helping commuters get around during festive season. It mentions that interactive posters pass information using an infra-red port, specifically at busy underground stations, which are equipped with a glowing red icon. These posters are part of Transport for London's Safe Travel campaign.\n\nNigel Marson from TfL notes that the posters work outside mobile phone networks by emitting infrared signals to reach phones. He emphasizes their advantage in the campaign context. Then it introduces Hypertag, a company that makes such technology fitting on posters. They use both IR and Bluetooth for data exchange. Harker says they can pass images, ring tones, and video clips.\n\nThe previous campaign with a cosmetics firm had 12,500 interactions. Marson mentions this was a big question mark before the campaign, now it's clear. The TfL plans to run until Boxing Day, so the summary should include all these points concisely.\n</think>\n\nHi-tech posters in London guide commuters during festive season with an interactive system at underground stations that emit infrared signals for caller phones. Transport for London's Safe Travel campaign aims to reduce sexual assaults by minicab drivers. Hypertag technology is used on posters, allowing communication via IR and Bluetooth, with a previous campaign of 12,500 interactions highlighted as a pivot point from uncertainty to clarity. The TfL campaign will run until Boxing Day.", "tinyllama:1.1b": "En avant de se déplacer à la saison des fêtes, les commutateurs deviennent plus sûrs lors du trajet en utilisant une série d'interrompeurs d’infrarouge et d’échangeurs électriques. Un système de communication de type « Savoir-faire à nuit (Night Safety) » est également présenté. Le mouvement d’un téléphone ou une porteuriste, ainsi que les informations sur le chemin du retour sont transmises directement à un numéro infra-rouge portable via une petite fenêtre en métal installée dans un poste de type mini-cab (Cab) sous la station d’accès à des personnes non habillées. L’objectif est de réduire les chances de viol et autres crimes sexuels lors du voyage à l’encontre des femmes, selon le directeur général de TfL, Nigel Marsons. Le système est présenté par l’entreprise HyperTag qui fait partie du groupe Speke-Dixie. La mise en service des premiers poster a été prévue pour la fin novembre.", "tinydolphin:1.1b": " Transport for London (TfL) is making use of interactive safety posters to help commuters navigate their way home at night during the festive season. These posters are equipped with an infrared port that can beam information directly onto a handset, making it easy for people to locate the safest route. The campaign is aimed at helping women avoid potential danger by sharing information about unlicensed minicabs, which tend to be more prone to sexual assaults. The posters have been installed on busy underground stations and are part of TfL's Safe Travel at Night campaign, which aims to reduce the number of sexual assaults by drivers of unlicensed taxis.", "phi:2.7b": " London's interactive posters are helping commuters with the Safe Travel at Night campaign to avoid sexual assaults by unlicensed minicabs. They use an infra-red port on a mobile phone to beam information about the safest route home when interrogated with a mobile phone. The posters can work outside mobile phone networks in underground stations, and they pass on any form of data including images, ring tones, and video clips. Although there are no figures for how many people have used them, 12,500 interactions were recorded during a previous campaign run for a cosmetics firm.\n", "orca-mini:3b": " Interactive posters are helping Londoners get around the city during the festive season by providing information about safest routes home. They are fitted with an infra-red port that can beam information directly to a handset, and are part of Transport for London's Safe Travel at Night campaign. The campaign aims to cut the number of sexual assaults by drivers of unlicensed minicabs, and will run until Boxing Day. Interactive posters are helping Londoners get around the city during the festive season by providing information about safest routes home.", "hermes3:3b": "Interactive London commuter posters provide safe home route info, aimed at reducing sexual assaults by unlicensed minicabs; can beam data to IR phone-equipped devices.", "stablelm-zephyr:3b": "Interactive hybrid posters in London help commuters with safe routing during festive season. These mobile-interrogated posters relay information via infrared port to compatible phones at busy underground stations, aiding in Transport for London's Safe Travel at Night campaign targeting reduced instances of sexual assaults by unlicensed minicab drivers. The technology used can also incorporate short-range Bluetooth radio and other forms of data. Though initial usage figures were unavailable, a previous campaign with cosmetics firm had 12,500 interactions.", "chatgpt-4o-latest": "Interactive posters in London help commuters navigate the city during the festive season by providing safe travel information via mobile phones. Installed at busy underground stations, these posters use infra-red technology to beam a phone number that offers guidance on safe routes home, particularly aiming to reduce sexual assaults by unlicensed minicab drivers. Part of Transport for London's Safe Travel at Night campaign, the posters function even in areas without mobile network coverage. Developed by Hypertag, the technology can also support Bluetooth for data sharing. While usage figures are unavailable, past campaigns have shown strong engagement. The campaign runs until Boxing Day.", "stablelm2:1.6b": "Interactive posters help London commuters find safest routes home during festive season. These posters use infrared technology to beam information directly to mobile phones and are a part of Transport for London's Safe Travel at Night campaign. They aim to cut sexual assault numbers by providing safety route details specifically to women. The posters transmit data like phone numbers, images, ring tones, and video clips when held close to the poster. Hypertag technology is utilized, which has been well-established in the market. Although no exact figures are available, previous campaigns for cosmetics firms have generated significant interactions. The campaign will run until Boxing Day.", "granite3.1-dense:2b": "Interactive posters with infra-red technology are being used in London's underground stations as part of Transport for London's Safe Travel at Night campaign, aiming to assist commuters, particularly women, in staying safe during nighttime travel. These posters, when approached with a mobile phone, transmit a callable number via an infra-red port, enabling users to access the safest route home. The initiative targets reducing sexual assaults by unlicensed minicab drivers. Rachel Harker from Hypertag, the technology provider, notes that these posters can work in areas with prevalent IR phones and can potentially transmit various data types beyond just numbers. Previous campaigns have shown engagement, with 12,500 interactions recorded. The current TfL campaign will continue until Boxing Day.", "reference": "She said that there are no figures for how many people are using the posters but a previous campaign run for a cosmetics firm racked up 12,500 interactions.The TfL campaign using the posters will run until Boxing Day.When interrogated with a mobile phone, the posters pass on a number that people can call to get information about the safest route home.The posters will automatically beam information to any phone equipped with an IR port that is held close to the glowing red icon on the poster.Nigel Marson, head of group marketing at Transport for London (TfL), said the posters were useful because they work outside the mobile phone networks.Although the hypertags in the posters only pass on a phone number, Ms Harker said they can pass on almost any form of data including images, ring tones and video clips.\"We started with infra-red because there are a huge number IR phones out there,\" said Rachel Harker, spokeswoman for Hypertag which makes the technology fitted to the posters.The posters are part of Transport for London's Safe Travel at Night campaign."}