{"raw_text": "Internet boom for gift shopping\n \n Cyberspace is becoming a very popular destination for Christmas shoppers.\n \n Forecasts predict that British people will spend £4bn buying gifts online during the festive season, an increase of 64% on 2003. Surveys also show that the average amount that people are spending is rising, as is the range of goods that they are happy to buy online. Savvy shoppers are also using the net to find the hot presents that are all but sold out in High Street stores.\n \n Almost half of the UK population now shop online according to figures collected by the Interactive Media in Retail Group which represents web retailers. About 85% of this group, 18m people, expect to do a lot of their Christmas gift buying online this year, reports the industry group. On average each shopper will spend £220 and Britons lead Europe in their affection for online shopping.\n \n Almost a third of all the money spent online this Christmas will come out of British wallets and purses compared to 29% from German shoppers and only 4% from Italian gift buyers. James Roper, director of the IMRG, said shoppers were now much happier to buy so-called big ticket items such as LCD television sets and digital cameras. Mr Roper added that many retailers were working hard to reassure consumers that online shopping was safe and that goods ordered as presents would arrive in time for Christmas. He advised consumers to give shops a little more time than usual to fulfil orders given that online buying is proving so popular. A survey by Hostway suggests that many men prefer to shop online to avoid the embarrassment of buying some types of presents, such as lingerie, for wives and girlfriends. Much of this online shopping is likely to be done during work time, according to research carried out by security firm Saint Bernard Software. The research reveals that up to two working days will be lost by staff who do their shopping via their work computer. Worst offenders will be those in the 18-35 age bracket, suggests the research, who will spend up to five hours per week in December browsing and buying at online shops.\n \n Iggy Fanlo, chief revenue officer at Shopping.com, said that the growing numbers of people using broadband was driving interest in online shopping. \"When you consider narrowband and broadband the conversion to sale is two times higher,\" he said. Higher speeds meant that everything happened much faster, he said, which let people spend time browsing and finding out about products before they buy.\n \n The behaviour of online shoppers was also changing, he said. \"The single biggest reason people went online before this year was price,\" he said. \"The number one reason now is convenience.\" \"Very few consumers click on the lowest price,\" he said. \"They are looking for good prices and merchant reliability.\" Consumer comments and reviews were also proving popular with shoppers keen to find out who had the most reliable customer service. Data collected by eBay suggests that some smart shoppers are getting round the shortages of hot presents by buying them direct through the auction site. According to eBay UK there are now more than 150 Robosapiens remote control robots for sale via the site. The Robosapiens toy is almost impossible to find in online and offline stores. Similarly many shoppers are turning to eBay to help them get hold of the hard-to-find slimline PlayStation 2, which many retailers are only selling as part of an expensive bundle. The high demand for the PlayStation 2 has meant that prices for it are being driven up. In shops the PS2 is supposed to sell for £104.99. In some eBay UK auctions the price has risen to more than double this figure. Many people are also using eBay to get hold of gadgets not even released in this country. The portable version of the PlayStation has only just gone on sale in Japan yet some enterprising eBay users are selling the device to UK gadget fans.\n", "llama3.2:1b": "British internet users will spend £4bn online during Christmas, an 64% increase from 2003. Half of the population shops online, with 85% expecting to do a lot of gift buying. \n\nMost money spent online comes out of British wallets and purses, at around 29%. Germany leads Europe in internet shopping, while Italy has only 4%.\n\nMany men prefer to shop online for big-ticket items like electronics, and much of the online shopping is done during work time, particularly among younger people.\n\nThe number of people using broadband is driving interest in online shopping, with higher speeds making it possible to browse and buy products more quickly.", "llama3.2:3b": "British people are expected to spend £4bn buying gifts online during Christmas, with 85% of shoppers planning to do a lot of their gift buying online. Online shopping is becoming increasingly popular, with Britons leading Europe in their affection for it. Many retailers are working hard to reassure consumers that online shopping is safe and reliable, while some shoppers prefer to shop online due to embarrassment about certain types of gifts. The growth of broadband has driven interest in online shopping, with people now looking for convenience rather than just price.", "gemma2:2b": "Online gift shopping is booming in the UK, with Britons expected to spend £4 billion this Christmas. A large portion of shoppers (about 85%) plan to purchase items online, and average spending per person is around £220.  The ease of browsing and finding products online has driven this trend, as well as confidence in online safety and delivery reliability.  Consumers are turning increasingly to eBay for hard-to-find items and convenient shopping experiences due to shortages and high demand. \n", "qwen2.5:0.5b": "The Internet is making Christmas shopping easier for British consumers, increasing spending by £4 billion online and seeing an increase in online gift buying among shoppers aged 18-35. Britons prefer electronic payment methods like Bitcoin over cash or credit cards and are more likely to buy large items such as LCD televisions and digital cameras, with the majority of online purchases coming from consumers on workdays. Online shopping is becoming a bigger deal for British consumers than they thought.", "qwen2.5:1.5b": "Internet sales for Christmas gifts boom, with British shoppers spending £4bn online, up 64% from 2003, while Germans and Italians spend much less. Online shopping has become popular, especially for buying expensive items like TVs and cameras, and many retailers are ensuring it's safe and reliable. People often shop online during work hours, particularly younger workers, which can be a challenge given that the conversion rate is higher with broadband. The number of people using broadband to buy from websites continues to rise, and eBay offers solutions for finding hard-to-find items like remote control robots.", "qwen2.5:3b": "Internet boom for gift shopping\n\nCyberspace is becoming popular with British shoppers buying gifts online during Christmas, expected to spend £4bn up 64% from 2003. Nearly half of UK population now shop online; 85% expect to do much of their Christmas gift buying online this year averaging £220 per person. Online shopping is seen as safe with safety assurances and improved delivery times; some shoppers use broadband for quicker browsing. Preference for big-ticket items like TVs and cameras has grown. Men prefer online shopping due to potential embarrassment when buying presents, such as lingerie. Nearly a third of Christmas spending will come from British wallets compared to 29% Germans and only 4% Italians. Online purchases may cause up to two working days' loss per week for workers in the UK. Smartphone app is used by consumers looking for reliable customer service; eBay is aiding consumers in buying hard-to-find items like Robosapiens remote control robots or PlayStation 2.", "opencoder:1.5b": "Internet boom for gift shopping.\n\nCyberspace is becoming a very popular destination for Christmas shoppers. Forecasts predict that British people will spend £4bn buying gifts online during the festive season, an increase of 64% on 2003. Surveys also show that the average amount that people are spending is rising, as is the range of goods that they are happy to buy online. Savvy shoppers are also using the net to find the hot presents that are all but sold out in High Street stores.\n\nAlmost half of the UK population now shop online according to figures collected by the Interactive Media in Retail Group which represents web retailers. About 85% of this group, 18m people, expect to do a lot of their Christmas gift buying online this year, reports the industry group. On average each shopper will spend £220 and Britons lead Europe in their affection for online shopping.\n\nAlmost a third of all the money spent online this Christmas will come out of British wallets and purses compared to 29% from German shoppers and only 4% from Italian gift buyers. James Roper, director of the IMRG, advised shoppers were now much happier to buy so-called big ticket items such as LCD television sets and digital cameras. Mr Roper suggested that many retailers were working hard to reassure consumers that online shopping was safe and that goods ordered as presents would arrive in time for Christmas.\n\nThe behaviour of online shoppers was also changing according to Iggy Fanlo, chief revenue officer at Shopping.com, who said that the growing numbers of people using broadband was driving interest in online shopping. The research reveals that up to two working days will be lost by staff who do their shopping via their work computer.\n", "smollm:1.7b": "The Internet boom for gift shopping is a phenomenon that has been observed and reported by various media outlets, including newspapers, magazines, and online news websites. The increasing popularity of online shopping among consumers can be attributed to several factors, including:\n\n1. **Convenience**: Online shopping allows consumers to shop from the comfort of their own homes, 24 hours a day, 7 days a week, without having to physically visit a store or wait in line.\n2. **Wider selection**: Online retailers can offer a wider range of products and services than physical stores, which are limited by space constraints.\n3. **Price comparison**: Online shoppers can easily compare prices among different retailers, ensuring they get the best deal.\n4. **Product reviews**: Online reviews from other customers provide valuable insights into the quality and performance of products, helping consumers make informed purchasing decisions.\n5. **Warranty and support**: Many online retailers offer extended warranties and dedicated customer support, which can be more convenient than dealing with physical stores.\n6. **Sustainability**: Online shopping reduces the need for transportation, packaging, and other environmental impacts associated with brick-and-mortar stores.\n7. **Personalization**: Online retailers can use data analytics to offer personalized product recommendations, promotions, and content, enhancing the shopping experience.\n8. **Accessibility**: Online shopping is particularly beneficial for people with disabilities, elderly individuals, or those living in remote areas where physical stores are not accessible.\n9. **Real-time availability**: Online retailers can provide real-time inventory updates, ensuring consumers can track their orders and avoid stockouts.\n10. **Security**: Online transactions are typically more secure than those made at physical stores, with encryption and other security measures in place to protect consumer data.\n\nThe growth of online shopping has also led to the emergence of new business models, such as:\n\n1. **Subscription-based services**: Online retailers like Netflix, Spotify, and Apple Music offer subscription-based models that provide access to a vast library of content or music for a recurring fee.\n2. **E-commerce marketplaces**: Platforms like Amazon, eBay, and Alibaba connect buyers with suppliers from around the world, facilitating global trade and commerce.\n3. **Social commerce**: Online retailers are leveraging social media platforms to facilitate transactions, provide customer support, and offer exclusive promotions.\n4. **Augmented reality (AR) shopping**: Some online retailers are incorporating AR technology into their websites or mobile apps, enabling customers to virtually try on products or visualize how furniture would look in their home before making a purchase.\n\nOverall, the Internet boom for gift shopping has transformed the way consumers shop and interact with retailers, offering greater convenience, choice, and value for money.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this entire text about the internet boom for gift shopping. Let me start by reading through it carefully.\n\nOkay, the first sentence says that cyberspace is a popular destination for Christmas shoppers. That's a good summary point. Then they mention British people spending £4bn, which is a significant amount, and an increase of 64% from 2003. That shows the growth in gift shopping online.\n\nThey also note that people are buying more expensive goods, on average spending more money each time. The range of goods is expanding too, so it's not just cheaper but a wider variety.\n\nThe key point about savvier shoppers using the internet is that they're finding out about things quickly, likeLCD TV sets and digital cameras leading to better consumer satisfaction. This probably means people are happier buying these big-ticket items online.\n\nNext part talks about half of the UK population shopping online now, with 85% planning significant online shopping this year. The average spending is £220, which is higher than before—so it's growing. The UK also leads in online shopping compared to Germany and Italy.\n\nThere's a mention of James Roper, the director of Interactive Media in Retail Group, who highlighted that British consumers are much happier buying big-ticket items online. Also, retailers are working hard to reassure people that online shopping is safe. He advises consumers to allow more time for orders when shopping online because it's so popular.\n\nAnother point is about men preferring online shopping, especially avoiding certain types of presents like lingerie. They spend more on the internet, which helps them find good deals. Research from Saint Bernard Software shows losses from staff working from their work computers—up to two days lost and potentially five hours a week.\n\nIgy Fanlo at Shopping.com says that high speeds made online shopping faster and cheaper. People used to spend money in narrowband, but now with broadband it's more accessible. The biggest reason people went online before was price, especially before the internet boom.\n\nNow they mention Robosapiens robots, which were once hard to find online. Some are selling them on eBay. The same for PS2 games—both were expensive and didn't have availability in the UK but some people found them there on eBay. Prices are going up because of high demand.\n\nThey talk about smart shoppers buying these items directly through eBay to avoid stock issues. Also, the portable PlayStation hasn't come out yet but is available in Japan, with some selling on eBay to UK fans.\n\nPutting all this together, I need to create a concise summary that captures all key points: growth in gift shopping, increased spending, happier consumers online, reasons for this change like higher speeds and better price options, behavioral changes towards online shopping, the rise of high-speed internet, reasons for current purchasing trends, and specific examples like PS2 and Robosapiens.\n\nI should avoid any markdown or extra formatting, just plain text. I need to make sure all main points are included without going into too much detail.\n</think>\n\nThe internet boom for gift shopping has led to significant growth in online Christmas shoppers across the UK. British consumers are spending £4bn this festive season, up 64% from 2003, while people buy more expensive goods and a broader range of items. Savvy shoppers increasingly use the net to find high-quality gifts like LCD TVs and digital cameras, leading to better consumer satisfaction. Key figures indicate that half of UK shoppers now shop online, with 85% planning substantial online shopping this year. The average spending is £220, driven by an increase in demand for essential goods such as PS2 games and high-ticket items like LCD TV sets.\n\nThe rise in prices before the internet boom was a major reason for early online purchases, but higher speeds and convenience are now driving online shopping. People have found ways to avoid stock issues, with Robosapiens toys being sold on eBay despite their limited availability. This trend is also evident with the PS2 series, where prices have increased due to high demand.\n\nThe UK's rise in online shopping is driven by better purchasing options and higher spending rates, while men increasingly prefer online shopping for comfort and avoiding certain presents. However, challenges like store closures and staff time constraints remain, particularly in areas with limited online availability.\n\nOverall, the internet boom for gift shopping continues to shape consumer behavior, offering both convenience and a wider range of choices.", "tinyllama:1.1b": "As the holiday season approaches, Cyberspace is becoming a very popular destination for gift-shopping. Forecasts predict that British people will spend £4 billion on Christmas presents online during the festive season, up from £2.5 billion in 2003. A survey by the Interactive Media in Retail Group reveals that 85% of UK population is now shop-online, and almost half (47%) of all the money spent online this year will be spent on items worth over £220. The growing interest in online shopping is driven by the high price of goods compared to retailers in High Street stores, with some shoppers even looking for good prices and reliable customer service. Many online shoppers are using eBay UK to help them get their hands on hard-to-find items such as the PlayStation 2, which is reportedly selling for £104.99 in some auctions. Shoppers are also turning to eBay to find out who has reliable customer service and are using it to get hold of portable versions of the PlayStation in Japan, which have only just gone on sale in Britain.", "tinydolphin:1.1b": " In the midst of the internet's growth, Christmas shopping is becoming a popular destination for many people. The number of British people shopping online surpassed £4 billion in 2018, and many shoppers are using broadband to buy presents more quickly and conveniently than before. This has led to changes in consumer behavior, with many searching for high-quality products at reasonable prices and relying on reviews and price comparisons for guidance.", "phi:2.7b": " Cyberspace is becoming increasingly popular for Christmas shopping, with forecasts predicting a 64% increase in spending from last year, reaching £4bn. Online shoppers can avoid embarrassment by buying items online, including expensive presents like digital cameras and LCD television sets. The rise of broadband has driven interest in online shopping, as higher speeds allow people to browse and buy at their convenience. Smart shoppers are looking for reliable customer service and often seek out reviews before making purchases. Some are also turning to eBay to get hold of hard-to-find items like the Robosapiens remote control robot and slimline PlayStation \n", "orca-mini:3b": " Summary: \n\nThe internet is becoming increasingly popular for Christmas shopping, with the British public forecast to spend £4 billion online during the festive season, an increase of 64% on 2003. Surveys show that the average amount spent is rising, as are the range of goods that people are happy to buy online. Savvy shoppers are also using the net to find hot presents that are sold out in High Street stores. Online shopping is now a popular option for many people, with over a third of all the money spent online this Christmas coming from British wallets and purses. Men are particularly interested in shopping online to avoid buying lingerie or other expensive items for their partners. Broadband speeds and the convenience of online shopping are driving interest in online shopping, while consumer reviews and comments are becoming increasingly important for many shoppers who are looking for reliable customer service.", "hermes3:3b": "Online Christmas gift shopping growing, with UK shoppers spending £4bn and preferring faster, convenient online purchases over competitive prices.", "stablelm-zephyr:3b": "During the Christmas season, British people are expected to spend £4 billion (£4,000,000,000) on gifts purchased online, a 64% increase from 2003. This trend is driven by increased internet usage for shopping and a growing preference for online shopping as a convenient alternative to traditional High Street stores. According to the Interactive Media in Retail Group (IMRG), nearly half of the UK population shops online, with 85% of this group planning to do most of their Christmas gift buying online this year. This includes purchasing big-ticket items such as LCD television sets and digital cameras. IGGy Fanlo, chief revenue officer at Shopping.com, attributes this trend to broadband internet speeds allowing for faster browsing and conversion to sale. Convenience is now the number one reason consumers choose to shop online, with good prices and reliable merchants being secondary considerations. Some shoppers are even resorting to eBay to find hard-to-find presents like Robosapiens remote control robots and slimline PlayStation 2s.", "chatgpt-4o-latest": "Internet shopping is becoming increasingly popular for Christmas shopping in the UK, with forecasts predicting £4bn in online gift purchases, a 64% rise from 2003. Nearly half of the UK population shops online, with 18 million people expected to buy gifts this way, spending an average of £220. The UK leads Europe in online shopping, accounting for nearly a third of all online Christmas spending. Consumers are now more comfortable purchasing expensive items like LCD TVs and digital cameras, and retailers are working to ensure safe transactions and timely deliveries. Many men prefer online shopping to avoid embarrassment when buying certain gifts, and employees are expected to spend significant work hours shopping online. The rise of broadband has boosted online shopping, with convenience now a bigger factor than price. Shoppers value merchant reliability and customer reviews. Some are turning to eBay to find hard-to-get gifts like Robosapiens and slimline PlayStation 2 consoles, often paying inflated prices. eBay is also being used to acquire gadgets not yet released in the UK, such as the portable PlayStation from Japan.", "stablelm2:1.6b": "British people are expected to spend £4bn online during Christmas, an increase of 2% compared to last year, with surveys showing a rise in spending and variety of goods available online. Almost half of the UK population shops online, and almost a third of all money spent online will come from British wallets. Men who prefer shopping online avoid buying some presents like lingerie for wives and girlfriends. Broadband is driving interest in online shopping, with higher speeds allowing consumers to spend time browsing products before purchase. Consumers are now looking for convenience over price when shopping online. Some smart shoppers are using auction sites like eBay to buy hard-to-find gifts, like Robosapiens remote control robots or slimline PlayStation  B2. Prices for the PS2 have increased due to high demand, and people are turning to eBay to find gadgets not available in their country yet.", "granite3.1-dense:2b": "The internet is rapidly transforming gift shopping, with British consumers projected to spend £4bn online for Christmas, a 64% increase from 2003. This trend is driven by convenience and time savings, as well as the ability to find hard-to-get items not available in physical stores. Almost half of the UK population now shops online, with 85% intending to do so extensively for this Christmas. The average expenditure per person is £220, making Britain the most affectionate online shoppers in Europe.\n\nJames Roper from the Interactive Media in Retail Group (IMRG) noted that consumers are increasingly comfortable purchasing expensive items like LCD televisions and digital cameras online. Retailers are emphasizing safety and on-time delivery to reassure customers, urging them to allow extra time for order fulfillment due to high demand.\n\nMen, particularly those in the 18-35 age bracket, prefer online shopping to avoid embarrassment when buying certain items like lingerie. This online activity is increasingly conducted during work hours, potentially causing significant productivity losses for affected employees.\n\nBroadband speeds are enhancing the online shopping experience by enabling faster browsing and decision-making processes. Consumers now prioritize convenience over price as their primary motivation, and they seek merchant reliability through reviews and ratings.\n\nSome shoppers are circumventing shortages of popular gifts like Robosapiens robots and slimline PlayStation 2 by purchasing them directly from eBay. This platform is also providing access to hard-to-find international products, such as the Japanese PlayStation Portable (PSP), further expanding consumers' online gift options.", "reference": "The behaviour of online shoppers was also changing, he said.\"The single biggest reason people went online before this year was price,\" he said.Mr Roper added that many retailers were working hard to reassure consumers that online shopping was safe and that goods ordered as presents would arrive in time for Christmas.Iggy Fanlo, chief revenue officer at Shopping.com, said that the growing numbers of people using broadband was driving interest in online shopping.On average each shopper will spend £220 and Britons lead Europe in their affection for online shopping.He advised consumers to give shops a little more time than usual to fulfil orders given that online buying is proving so popular.About 85% of this group, 18m people, expect to do a lot of their Christmas gift buying online this year, reports the industry group.Forecasts predict that British people will spend £4bn buying gifts online during the festive season, an increase of 64% on 2003.Surveys also show that the average amount that people are spending is rising, as is the range of goods that they are happy to buy online.Almost half of the UK population now shop online according to figures collected by the Interactive Media in Retail Group which represents web retailers.Much of this online shopping is likely to be done during work time, according to research carried out by security firm Saint Bernard Software.Almost a third of all the money spent online this Christmas will come out of British wallets and purses compared to 29% from German shoppers and only 4% from Italian gift buyers.A survey by Hostway suggests that many men prefer to shop online to avoid the embarrassment of buying some types of presents, such as lingerie, for wives and girlfriends.Many people are also using eBay to get hold of gadgets not even released in this country."}