{"raw_text": "Go-ahead for new internet names\n \n The internet could soon have two new domain names, aimed at mobile services and the jobs market.\n \n The Internet Corporation for Assigned Names and Numbers (Icann) has given preliminary approval to two new addresses - .mobi and .jobs. They are among 10 new names being considered by the net's oversight body. Others include a domain for pornography, an anti-spam domain as well as .post and .travel, for the postal and travel industries.\n \n The .mobi domain would be aimed at websites and other services that work specifically around mobile phones, while the .jobs address could be used by companies wanting a dedicated site for job postings. The process to see the new domain names go live in cyberspace could take months and Icann officials warned that there were no guarantees they would ultimately be accepted. Applicants paid £23,000 apiece to have their proposals considered. The application for .mobi was sponsored by technology firms including Nokia, Microsoft and T-Mobile.\n \n Of the 10 currently under consideration, the least likely to win approval is the .xxx domain for pornographic websites. There are currently around 250 domain names in use around the globe, mostly for specific countries such as .fr for France and .uk for Britain. Perhaps unsurprisingly, .com remains the most popular address on the web.\n", "llama3.2:1b": "The Internet Corporation for Assigned Names and Numbers (Icann) has given preliminary approval to two new internet domain names: .mobi for mobile services and .jobs for job postings. The process is expected to take months, with applicants paying £23,000 to have their proposals considered. Ten other domain name applications are currently under consideration, including a pornographic website address (.xxx).", "llama3.2:3b": "The Internet Corporation for Assigned Names and Numbers (Icann) has given preliminary approval to two new internet domain names: .mobi for mobile services and .jobs for job postings. Other contenders include .post, .travel, an anti-spam domain, and a pornography domain. The process of implementation could take months, with no guarantees of acceptance.", "gemma2:2b": "Icann has given preliminary approval to two new internet domains: .mobi for mobile services and .jobs for job postings. Other proposed domains include those for pornography, anti-spam, postal services, and travel.  The process of finalizing these new domains could take months. \n", "qwen2.5:0.5b": "The Internet Corporation for Assigned Names and Numbers (Icann) is considering two new domain names: .mobi and .jobs. They are aimed at mobile services and jobs market-specific websites. Icann has given preliminary approval to both addresses, but there is no guarantee they will be accepted. The process to see the new domain names live in cyberspace could take months. The most unlikely address for pornographic websites is .xxx with a population of around 250 domains worldwide.", "qwen2.5:1.5b": "New internet domain names include .mobi (for mobile services) and .jobs (for job postings), set to launch alongside 9 others after preliminary approval by Icann. The process is lengthy with a £23,000 fee for applications; the least likely approved one being .xxx for pornographic sites. Current global domains include those for various countries and popular .com.", "qwen2.5:3b": "The Internet Corporation for Assigned Names and Numbers (ICANN) has granted preliminary approval to two new internet domains: .mobi for mobile services and .jobs for job postings. Among ten proposed names, there is also a domain for pornography, an anti-spam domain, and others like .post and .travel. The process could take months, with no guarantees of acceptance despite applicants paying £23,000 per proposal. Sponsorship includes tech firms like Nokia, Microsoft, and T-Mobile for the .mobi application. Currently, about 250 domains are in use globally, primarily for country-specific codes such as .fr (France) and .uk (Britain). The most popular domain remains .com.", "opencoder:1.5b": "The output will be a concise summary of the given text:\n\n\"After preliminary approval by Icann, the new domain names .mobi and .jobs are being considered as part of the 10 new domains being considered by the ICANN's oversight body. The .mobi domain aims at mobile services and job sites while .jobs is dedicated to posting jobs. As for the process, the domains go live in a matter of months, with Icann officials warning no guarantees on their eventual acceptance. The applications are being funded by high-growth technology firms.\"\n", "smollm:1.7b": "The summary should be concise and to the point, preserving key ideas and details while omitting unnecessary information. The text is written in a clear and straightforward manner, making it easy for readers to understand the main points being made.", "deepseek-r1:1.5b": "<think>\nAlright, let's tackle this query step by step. So, the user has provided a text about Icann granting domain names to their internet company for mobile services and the job market. They want a summary that preserves key ideas and details.\n\nFirst, I need to identify the main points in the text. The text mentions that two new domain names are being granted: .mobi and .jobs. These are among 10 candidates under Icann's oversight. The .mobi is for mobile services, and the .jobs is for job postings. The .mobi application was sponsored by Nokia, Microsoft, and T-Mobile.\n\nI should make sure to include these details without getting too technical or adding any extra information beyond what's provided. Also, it's important to mention that there are 250 domain names in use globally, with .com being the most popular.\n\nThe user also noted that the process takes months, and Icann officials warned about no guarantees of acceptance. The .xxx domain for porn is mentioned as the least likely candidate, but since the text doesn't go into detail beyond that, it's better to keep it brief unless instructed otherwise.\n\nI need to ensure that the summary flows well and covers all essential points without being too lengthy. Keeping it concise yet comprehensive is key here.\n</think>\n\nThe Internet Corporation for Assigned Names and Numbers (Icann) has granted preliminary approval for two new domain names: .mobi and .jobs, among 10 candidates under its oversight. The .mobi address is intended for mobile services, while the .jobs address is suitable for job postings. The .mobi proposal was sponsored by companies including Nokia, Microsoft, and T-Mobile. Of the 10 currently considered, .xxx (for porn) is the least likely to win approval, with around 250 domain names in use globally. The most popular domain name on the internet is .com. The process of determining which domains will go live could take months.", "tinyllama:1.1b": "The Internet Corporation for Assigned Names and Numbers (Icann) has given preliminary approval to two new domain names: .mobi (mobile services), aimed at websites and other services that work specifically around mobile phones, and .jobs (job posting sites), designed for companies wanting a dedicated site for job postings. The process to see the new domain names go live in cyberspace could take months with Icann officials warning there are no guarantees they will ultimately be accpeted. Applicants for the domain were required to pay a fee of £23,000 APIece to have their proposals considered. The .mobi address is aimed at websites and other services that work specifically around mobile phones while the .jobs address is designed for companies wanting a dedicated site for job postings.", "tinydolphin:1.1b": " Sure thing! Here's a brief summary of what you mentioned:\n\n1. Two new domain names are being considered by Icann (the internet's oversight body), aimed at mobile services and the jobs market, respectively.\n2. Both domains have preliminary approval from Icann, but they must go through a rigorous approval process with multiple companies offering to fund and pay for the evaluation.\n3. The \".mobi\" domain was chosen due to its focus on mobile phones and is expected to be used by companies seeking to create targeted websites or services that cater specifically to mobile users.\n4. The \".jobs\" domain is aimed at companies wanting a dedicated site for job postings, while the address could also benefit firms looking to market their products or services via digital channels.\n5. Although there are no guarantees about whether they will ultimately be accepted into cyberspace, Icann officials have warned that applications must pay a fee of £23,000 each and provide information such as how many people would visit the site if it went live.\n6. The two new domains are among 10 domain names being considered for approval, with potential competitors including \".xxx\" for adult websites and \".u\" for URLs for pornographic content.", "phi:2.7b": " Two new domain names have been approved by Icann— .mobi for mobile services and jobs market and .jobs for job postings. The process could take months and there are 10 other potential names under consideration, with a possible pornographic website in the least chance of approval. There are currently 250 domains around the world, but  .com is still most popular.\n", "orca-mini:3b": " The internet could have two new domain names for mobile services and job postings. Icann has preliminary approval for .mobi and .jobs, among 10 new names considered. They may require months to go live and cost £23,000 apiece to consider.", "hermes3:3b": "New internet domains: .mobi (mobile services) and .jobs (job market).", "stablelm-zephyr:3b": "Icann approves .mobi and .jobs, among other new domain names, aimed at mobile services and job market. 10 new domains are being considered, including .porn for adult websites and .post and .travel for specific industries. The process to implement these domains could take months, with some applicants paying £23,000 for consideration. Currently, .com is the most popular domain on the web.", "chatgpt-4o-latest": "Icann has given preliminary approval for two new internet domain names, .mobi and .jobs, aimed at mobile services and job postings. These are among 10 new domains under consideration, including .xxx for pornography, .post for postal services, and .travel for the travel industry. The .mobi domain is backed by companies like Nokia, Microsoft, and T-Mobile. The approval process could take months, with no guarantees of final acceptance. Applicants paid £23,000 for consideration. Currently, there are about 250 domain names in use, with .com remaining the most popular.", "stablelm2:1.6b": "The Internet Corporation for Assigned Names and Numbers (ICANN) has approved two new domain names - .mobi and .jobs - aimed at mobile services and job market respectively. The new domain names join a list of 20 new names being considered by ICANN's oversight body, which includes domains for pornography, anti-spam, .post, .travel, and postal/travel industries. The process to make these domains live on the internet might take months. Of the current domain names under consideration, the least likely to win approval is the .xxx domain for pornographic websites, with over 1 million currently in use worldwide. .Com remains the most popular domain address globally.", "granite3.1-dense:2b": "Icann has approved two new internet domain names: .mobi for mobile services and .jobs for job listings. These are among ten proposed extensions being evaluated by Icann's oversight body, also including .post and .travel for postal and travel sectors. Applicants paid £23,000 each to have their proposals considered; the .mobi application was sponsored by tech giants like Nokia, Microsoft, and T-Mobile. The least likely to be accepted is .xxx, intended for adult content websites. Existing domain names primarily serve specific countries, with .com being the most popular. Icann cautions that approval of these new domains may not materialize due to the ongoing review process, which could take months.", "reference": "The internet could soon have two new domain names, aimed at mobile services and the jobs market.The .mobi domain would be aimed at websites and other services that work specifically around mobile phones, while the .jobs address could be used by companies wanting a dedicated site for job postings.The Internet Corporation for Assigned Names and Numbers (Icann) has given preliminary approval to two new addresses - .mobi and .jobs.The process to see the new domain names go live in cyberspace could take months and Icann officials warned that there were no guarantees they would ultimately be accepted.They are among 10 new names being considered by the net's oversight body."}