{"raw_text": "Set your television to wow\n \n Television started off as a magical blurry image. Then came the sharpness, the colour and the widescreen format. Now the TV set is taking another leap forward into a crystal clear future, although those in Europe will have to be patient.\n \n After years of buzz about high-definition TV (HDTV) it is finally taking off in a handful of countries around the world, mainly the US and Japan. If you believe the hype, then HDTV will so wow you, that you will never want to go back to your old telly. \"HDTV is just the latest must-have technology in viewers' homes,\" says Jo Flaherty, a senior broadcaster with the CBS network in the US. All television images are made up of pixels, going across the screen, and scan lines going down. British TV pictures are made up of 625 lines and about 700 pixels. By contrast, HDTV offers up to 1,080 active lines, with each line made up of 1,920 pixels. The result is a picture which can be up to six times as sharp as standard TV. But to get the full impact, programmes need to be broadcast in this format and you need a HDTV set to receive them. Most new computer displays are already capable of handling high-resolution pictures. Viewers in Japan, the US, Australia, Canada and South Korea are already embracing the new TV technology, with a selection of primetime programmes being broadcast in the new format, which includes 5.1 digital surround sound.\n \n But TV viewers in Europe will have to wait to enjoy the eye-blasting high-definition images.\n \n Many high-end European TV programmes, such as the recent Athens Olympics, are already being produced in high-definition. But they still reach your screen in the old 625 lines. The prospects for getting sharper images soon do not seem very encouraging. According to consultants Strategy Analytics, only 12% of homes in Europe will have TVs capable of showing programmes in high-definition by 2008. But the HDTV hype spilling out of the US and Japan has spurred European broadcasters and consumer electronic companies to push for change. Big sports and entertainment events are set to help trigger the general public's attention. The 2006 World Cup in Germany will be broadcast in high-definition.\n \n In the UK, satellite broadcaster BSkyB is planning HDTV services in 2006. There is already a HDTV service in Europe called Euro1080. Other European broadcasters, especially in France and Germany, also aiming to launch similar services.\n \n In Britain, digital satellite and cable are largely seen as the natural home for HDTV, at least while a decision is taken regarding terrestrial broadcast options. The communications watchdog Ofcom could hand over some terrestrial frequencies freed up when the UK switches off its analogue TV signal. For now, broadcasters like the BBC are working on their own HDTV plans, although with no launch date in sight. \"The BBC will start broadcasting in HDTV when the time is right, and it would not be just a showcase, but a whole set of programming,\" says Andy Quested, from the BBC's high-definition support group. \"We have made the commitment to produce all our output in high-definition by 2010, which would put us on the leading edge.\" One of the options under consideration is to offer high-definition pictures on the web. The BBC has already dipped its toe into this, including some HDTV content in recent trials of its interactive media player - a video player for PCs. It is planning to offer special releases of selected flagship programmes online in the near future. According to Mr Quested, this could help put Europe back into the running in the race to switch to HDTV. This is backed by recent research which suggests that the number of Europeans with broadband has exploded over the past 12 months, with the web eating into TV viewing habits.\n", "llama3.2:1b": "Here is a concise summary of the text:\n\nTelevision sets will move from blurry images to crystal clear ones starting in Europe but at a slower pace than expected, particularly in countries such as Japan and South Korea.\n\nIn the US and Japan, high-definition (HDTV) TV started off as a buzz but has recently gained popularity with new programs being broadcast in the format. However, European viewers will have to wait due to limited HDTV-capable TVs.\n\nHigh-end European TV programs are already being produced in high definition, but they still reach existing 625-line TVs, and most European homes may not have HDTV by 2008.", "llama3.2:3b": "Television started off as a blurry image and gradually improved with sharper images and widescreen format. High-definition TV (HDTV) is now taking off in a few countries including the US and Japan, offering crystal clear pictures up to six times sharper than standard TVs. In Europe, viewers will have to wait, but some programs are already being produced in HDTV, and big events like the World Cup in Germany may trigger public attention. European broadcasters and companies are pushing for change, with plans to launch HDTV services in 2006, including satellite broadcaster BSkyB in the UK, and the BBC aiming to produce all its output in high-definition by 2010.", "gemma2:2b": "High-definition television (HDTV) is making progress globally but Europe lags behind. While HDTV is already popular in the US and Japan, European broadcasters and consumers are just beginning to adopt the technology.  The lack of high-definition broadcasts is causing a delay for European viewers.  However, there's hope as big sporting events like the 2006 World Cup and technological advancements from companies like BSkyB signal change on the horizon. The BBC aims to broadcast in HDTV by 2010 and explore online distribution options to increase accessibility. \n", "qwen2.5:0.5b": "The text describes the development of high-definition television (HDTV) technology around the world and mentions some key points:\n\n- HDTV is set to take off in Europe.\n- It offers up to 1,080 lines of pixels, making images sharper than standard TV screens.\n- UK broadcaster BBC is planning its own HDTV services, including online content.", "qwen2.5:1.5b": "Europeans will have to wait for a few years before getting high-definition television (HDTV). Although some European programs are already in HDTV format, not everyone's home TVs can receive them until around 2008. Europe is catching up with the United States and Japan by pushing for changes in the broadcasting industry and consumer electronics companies, but it will take time to reach a wide audience.", "qwen2.5:3b": "Television technology has advanced significantly from blurry images to high-definition (HDTV) capable of six times sharper pictures than standard TVs through up to 1,920 pixels per line. High-end countries like Japan, US, and South Korea have embraced HDTV with broadcasts in full resolution format including 5.1 digital surround sound. However, Europe is lagging behind; only a fraction of homes will have compatible sets by 2008. European broadcasters are planning to offer HDTV through satellite services such as BSkyB’s planned HDTV services and Euro1080 service in the UK. The BBC aims to transition all programming to high-definition by 2010, with options like offering content online potentially helping Europe catch up faster given increased broadband usage among Europeans.", "opencoder:1.5b": "The text provides an overview of how television technology evolves from a blurry image to a cutting-edge format. It includes details about different countries and regions influencing the technology's evolution. The main focus is on key ideias and details that will be covered in the summary, without any specific reasoning or explanation.\n", "smollm:1.7b": "The summary should be:\n\"Set your television to wow\"", "deepseek-r1:1.5b": "<think>\nAlright, let's tackle this query. The user wants me to summarize a given text concisely while preserving key ideas and details. They specified to output only the summary in plain text without any explanations or formatting.\n\nFirst, I'll read through the text carefully to understand its main points. It starts by talking about how TVs went from a blurry image to sharp with HDTV, then mentions that HDTV is finally starting to become popular worldwide, especially in the US and Japan, but Europe will need time to catch up.\n\nNext, it provides detailed specs for standard TV and HDTV: 625 lines and 700 pixels vs. 1,080 active lines and 1,920 pixels. It also mentions that European viewers have to wait until 2008 to enjoy the best possible picture quality with HDTV.\n\nThe text then talks about how European high-end shows like the Athens Olympics are using high-definition, but it's still on standard TVs. It suggests that HDTV hype in the US and Japan is driving changes among European broadcasters and consumers. British broadcasters are already planning HDTV services like BSkyB and Euro1080. The BBC has made some HDTV content available through their interactive media player.\n\nIn Britain, digital satellite and cable might be preferred for terrestrial broadcasts due to the potential benefits of HDTV. Ofcom could release more frequencies after the UK stops analogue TV, which is a positive sign for HDTV adoption in Europe. The BBC is ahead with its web-based high-definition features, targeting both HDTV and standard TVs.\n\nFinally, it mentions that recent data shows European netizens have better broadband access, which boosts their interest in digital services. This supports the idea that Europe is on the cusp of adopting HDTV, though there's still a delay.\n\nI need to condense this into a concise summary. I'll include the key points about the transition from standard TV to HDTV, the specifications for both, the focus in US and Japan, the impact of European events, and the current progress with broadcasters and the potential benefits of broadband access.\n</think>\n\nThe text describes the evolution of television technology, focusing on the transition from standard TV to high-definition (HDTV) format. It highlights that HDTV offers improved picture quality but requires more active lines and pixels for higher resolution. The US and Japan are leading markets for HDTV, while Europe is still in the early stages, waiting for 2008 to fully benefit. High-end European shows like the Athens Olympics use HDTV, though it's on standard TVs. British broadcasters aim to roll out HDTV services, with the BBC already experimenting with web-based features and offering content online. Digital satellite and cable may be preferred for terrestrial broadcasts in Europe, driven by the growing interest in digital services due to improved broadband access seen in many European regions.", "tinyllama:1.1b": "A new high-definition television format called \"HDTV\" is set to take Europe by storm in the coming years. The BBC plans to start broadcasting in HDTV when the time is right and has committed to producing all its output in this format, which promises a greater image quality than standard TV. European broadcasters are planning for digital satellite and cable services to offer HDTV content, while broadcasters like the BBC have started their own HDTV plans with the aim of offering all their programming in high-definition by 2010. The launch date is uncertain at present, but according to a recent research report, there has been a significant increase in households with broadband access over the past year.", "tinydolphin:1.1b": " The European Union and the United States are leading the way in adopting high-definition (HD) television, a groundbreaking technology that provides consumers with clearer images and superior performance compared to standard analog television. This is because HDTV offers far more pixels per inch than standard TVs, resulting in larger, sharper images. \n\nThe European Union's initiative to adopt HDTV is largely due to the success of the broadcasting companies in Japan and the United States, who have already introduced this technology to their viewers. By adopting HDTV, European television networks will benefit from improved visual quality and viewer satisfaction. In comparison, standard TVs produce images with only 625 lines of active pixels and about 700 pixels per screen. This can result in pixelation when there are too many pixels on the screen at once, making for uninspiring visuals.\n\nThe United States has also shown interest in HDTV, with CBS, one of the leading broadcasting networks in the US, announcing its intent to introduce high-definition images to viewers across the country. This move will not only provide a superior \"wow\" factor for consumers but it could also boost the appeal of American television programs and stimulate further innovation in the industry.\n\nHowever, there is still a long way to go before everyone in Europe can enjoy high-definition pictures on their screens. The European Broadcasting Union (EBU), which oversees the production and distribution of high-definition TV content across the continent, recognizes the importance of this technology and has established a task force to work on developing an HDTV standard that will ensure consistency across Europe.\n\nIn addition to adopting HDTV, the European Union is also working on ways to encourage European broadcasters and consumer electronic companies (CEC) to produce high-definition content. By giving a higher priority to high-definition production, these companies can produce clearer images that are more enjoyable for viewers.\n\nOverall, adopting HDTV in Europe is an ambitious goal, but with the right strategy and partnerships, it may become a reality soon.", "phi:2.7b": " The text talks about how high-definition television (HDTV) technology has become more accessible and popular in countries like the US and Japan. However, it is still not widely available in Europe due to various factors such as delays in adoption of the new format and lack of HDTV sets. Despite this, there are plans to launch services like Euro1080 in Europe, with satellite and cable being considered the natural home for HDTV. The BBC has also made a commitment to produce all its content in high-definition by 2010. One possible solution is offering special releases of selected flagship programmes online to encourage people to switch to HDTV.\n", "orca-mini:3b": " Television started off as a magical blurry image and then came the sharpness, the color, and the widescreen format. Now, the TV set is taking another leap forward into a crystal clear future, but only for a handful of countries around the world. The prospects for getting sharper images soon seem very disappointing in Europe. However, the BBC has already committed to producing all its output in high-definition by 2010, which would put it on the leading edge. One option under consideration is to offer high-definition pictures on the web, and the BBC has already tested this with some interactive media player releases. Special releases of selected flagship programmes could soon be available online, boosting Europe's chances in the race to switch to HDTV.", "hermes3:3b": "HDTV now available in few countries (US, Japan), offering up to 6x sharper images than standard TV. Europeans will have to wait as only 12% homes with HDTV capable TVs by 2008, but 2006 World Cup and other events may boost interest. British BSkyB plans HDTV services in 2006, BBC aims to broadcast HDTV by 2010.", "stablelm-zephyr:3b": "Television is advancing to provide better resolution and wider screen formats, primarily through high-definition TV (HDTV), which provides a picture six times sharper than standard TV. HDTV requires specific sets and broadcasts, with viewers in Japan, US, Australia, Canada, and South Korea already enjoying this experience. However, Europe will have to wait for widespread adoption as only 12% of European homes are expected to have HDTVs capable of displaying high-definition programs by 2008. Initiatives from satellite broadcasters like BSkyB and Euro10880, as well as plans from major European broadcasters and digital cable companies, aim to bring HDTV services to Europe in the near future.", "chatgpt-4o-latest": "Television technology has evolved from blurry images to high-definition TV (HDTV), which offers up to six times the sharpness of standard TV. HDTV is already popular in the US, Japan, Australia, Canada, and South Korea, with broadcasts featuring 5.1 digital surround sound. However, Europe lags behind, with only 12% of homes expected to have HDTV-capable sets by 2008. Major events like the 2006 World Cup are expected to drive interest, and broadcasters such as BSkyB, Euro1080, and others in France and Germany are planning HDTV services. In the UK, digital satellite and cable are seen as key platforms, while Ofcom may allocate terrestrial frequencies for HDTV after the analogue switch-off. The BBC aims to produce all content in HDTV by 2010 and is exploring online distribution, leveraging Europe's growing broadband adoption to accelerate the transition.", "stablelm2:1.6b": "Television recently advanced from blurry images to sharper, color-filled visuals due to high-definition (HDTV) technology. Currently mainly in the US and Japan, HDTV is growing in popularity worldwide. To fully experience HDTV's benefits, programs need to be broadcast in this format on a compatible HDTV set. While viewers in Europe wait for this advancement, most European TV programs are already being produced in high-definition (HD). The transition to HDTV may not be immediate due to lack of suitable hardware in some households and limited availability of compatible televisions. Despite these challenges, major European broadcasters like the BBC aim to launch their HDTV services, with satellite broadcaster BSkyB planning HDTV services in the UK. Overall, the increased use of high-speed internet is helping push for change and adoption of HDTV technology in Europe.", "granite3.1-dense:2b": "High-definition television (HDTV) is gaining traction worldwide, particularly in the US and Japan, promising significantly sharper images due to its higher resolution compared to standard TV. HDTV offers up to 1,080 active lines with 1,920 pixels per line, making the picture six times sharper than traditional television. However, to experience this enhancement, viewers need compatible sets and content broadcast in HDTV format, such as 5.1 digital surround sound.\n\nIn Europe, the adoption of HDTV is slower, with only 12% of homes expected to have capable TVs by 2008 according to Strategy Analytics. Nevertheless, European broadcasters and consumer electronics companies are pushing for change, driven by high-profile events like the 2006 World Cup in Germany and the 2012 London Olympics.\n\nBritish satellite broadcaster BSkyB plans to introduce HDTV services in 2006, while digital satellite and cable are seen as primary platforms for HDTV distribution. The BBC has committed to producing all its content in high definition by 2010, potentially offering HDTV programming online to bolster Europe's position in the race towards widespread adoption of HDTV. The surge in broadband usage across Europe supports this shift, with many users already using the internet for TV viewing.", "reference": "After years of buzz about high-definition TV (HDTV) it is finally taking off in a handful of countries around the world, mainly the US and Japan.By contrast, HDTV offers up to 1,080 active lines, with each line made up of 1,920 pixels.There is already a HDTV service in Europe called Euro1080.British TV pictures are made up of 625 lines and about 700 pixels.Many high-end European TV programmes, such as the recent Athens Olympics, are already being produced in high-definition.In the UK, satellite broadcaster BSkyB is planning HDTV services in 2006.But TV viewers in Europe will have to wait to enjoy the eye-blasting high-definition images.\"The BBC will start broadcasting in HDTV when the time is right, and it would not be just a showcase, but a whole set of programming,\" says Andy Quested, from the BBC's high-definition support group.But to get the full impact, programmes need to be broadcast in this format and you need a HDTV set to receive them.According to Mr Quested, this could help put Europe back into the running in the race to switch to HDTV.Viewers in Japan, the US, Australia, Canada and South Korea are already embracing the new TV technology, with a selection of primetime programmes being broadcast in the new format, which includes 5.1 digital surround sound.But the HDTV hype spilling out of the US and Japan has spurred European broadcasters and consumer electronic companies to push for change.For now, broadcasters like the BBC are working on their own HDTV plans, although with no launch date in sight.All television images are made up of pixels, going across the screen, and scan lines going down."}