{"raw_text": "Fast lifts rise into record books\n \n Two high-speed lifts at the world's tallest building have been officially recognised as the planet's fastest.\n \n The lifts take only 30 seconds to whisk passengers to the top of the 508m tall TFC 101 Tower in Taipei, Taiwan. The Guinness Book of Records has declared the 17m per second speed of the two lifts the swiftest on Earth. The lifts also have a pressure control system to stop passengers' ears popping as they ascend and descend at high speed.\n \n In total, the TFC Tower has 61 lifts, 34 of them double-deckers, and 50 escalators to shuttle people around its 106 floors. The TFC 101 Tower is due to be officially opened on 31 December.\n \n The super-fast lifts can speed up to 24 passengers to the tip of the tower in about 30 seconds, while ascending their 382m track. The 17m/s top speed of the lifts translates to about 38mph (61km/h). Curiously the lifts take longer to descend and spend almost a whole minute returning to ground level from the top of the TFC Tower. The key new technologies applied in the world's fastest elevators include:\n \n \n  - A pressure control system, which adjusts the atmospheric pressure inside a car by using suction and discharge blowers, preventing \"ear popping\" \n  - An active control system which tries to balance the lift more finely and remove the sources of vibrations \n  - Streamlined cars to reduce the whistling noise produced by running the lifts at a high speed inside a narrow shaft \n  \n \n \"The certification of our elevators as world record-holders by the authoritative Guinness World Records is a great honour for us,\" said Masayuki Shimono, president of manufacturer Toshiba Elevator and Building Systems which installed the lifts. The first record for the world's fastest passenger elevators was published in the first edition of the Guinness Book of Records in 1955. \"As such, it is an interesting indicator of how technology has advanced in the 50 years since that first edition, when the record was 426m per minute, or 25.6 km/h, less than half the speed of the new record,\" said Hein Le Roux, specialist researcher at the Guinness World Records. Taipei's TFC 101 Tower is more than 50m taller than the Petronas Towers in Kuala Lumpur, Malaysia - formerly the world's tallest skyscraper.\n", "llama3.2:1b": "Two high-speed lifts at the TFC 101 Tower in Taipei, Taiwan, have been officially recognized as the planet's fastest, reaching speeds of 17m/s (38mph). The lifts can whisk passengers to the top in 30 seconds and take almost a minute to descend from the top. The system used includes pressure control to prevent \"ear popping\" and an active control system for balance and vibration reduction.", "llama3.2:3b": "Two high-speed lifts in Taipei's TFC 101 Tower have been recognized by Guinness World Records as the planet's fastest, reaching speeds of 17m per second and whisking passengers to the top in 30 seconds. The towers feature 61 lifts, including 34 double-deckers, and a pressure control system to prevent ear popping during ascent and descent. The new technology includes active control systems and streamlined cars to reduce noise and vibrations.", "gemma2:2b": "Two high-speed lifts at the TFC 101 Tower in Taipei, Taiwan have been certified as the world's fastest with a top speed of 17 m/s (38 mph). They take 30 seconds to travel from floor to floor and feature pressure control for ear popping prevention. The building also has 61 elevators, including 34 double-deckers, and 50 escalators.  \n", "qwen2.5:0.5b": "Two high-speed lifts at the world's tallest building have been officially recognized as the planet's fastest elevators. They can speed up to 24 passengers to the top of the TFC 101 Tower in Taipei, Taiwan. The lifts are powered by a pressure control system that prevents \"ear popping\" and an active control system that tries to balance the lift more finely and remove vibrations. Streamlined cars are also used to reduce whistling noise produced by running the lifts at high speed inside a narrow shaft. The Guinness World Records has officially certified the TFC 101 Tower as the world's fastest passenger elevators, with a top speed of 38mph (61km/h).", "qwen2.5:1.5b": "Two high-speed lifts in Taipei, Taiwan have been officially recognized as the fastest on Earth, reaching a top speed of 17 meters per second (61 km/h). They take 30 seconds to ascend 508 meters in the TFC 101 Tower and are equipped with pressure control systems and active control technology. The tower has 61 lifts including 34 double-deckers, serving 106 floors with a dedicated record-breaking elevator speed certification.", "qwen2.5:3b": "Two high-speed lifts at Taiwan’s TFC 101 Tower have been officially recognized as the fastest on Earth, traveling at a speed of 17 meters per second (about 38 mph/61 km/h) to reach the top in just 30 seconds. The tower has 61 lifts, with 50 escalators and 106 floors. Key technologies include a pressure control system to prevent ear popping, an active control system for fine vibrations management, and streamlined cars to reduce noise. Toshiba Elevator’s Masayuki Shimono notes that this certification honors the company and represents significant technological advancement since the first record in 1955 (426m/min). The tower is taller than Malaysia's Petronas Towers.", "opencoder:1.5b": "The lifts rise into record books. Two high-speed lifts at the world's tallest building have been officially recognised as the planet's fastest. The lifts take only 30 seconds to whisk passengers to the top of the 508m tall TFC 101 Tower in Taipei, Taiwan. In total, the TFC Tower has 61 lifts, 34 of them double-deckers, and 50 escalators to shuttle people around its 106 floors. The super-fast lifts can speed up to 24 passengers to the tip of the tower in about 30 seconds, while ascending their 382m track. The key new technologies applied in the world's fastest elevators include a pressure control system, an active control system which tries to balance the lift more finely and remove the sources of vibrations, Streamlined cars to reduce the whistling noise produced by running the lifts at a high speed inside a narrow shaft. \"The certification of our elevators as world record-holders by the authoritative Guinness World Records is a great honour for us,\" said Masayuki Shimono, president of manufacturer Toshiba Elevator and Building Systems which installed the lifts. The first record for the world's fastest passenger elevators was published in the first edition of the Guinness Book of Records in 1954. \"As such, it is an interesting indicator of how technology has advanced in the 50 years since that first edition, when the record was 426m per minute, or 25.6 km/h, less than half the speed of the new record,\" said Hein Le Roux, specialist researcher at the Guinness World Records. The TFC 101 Tower is more than 50m taller than the Petronas Towers in Kuala Lumpur, Malaysia - formerly the world's tallest skyscraper.\n", "smollm:1.7b": "The text above summarizes the following key points:\n\n1. Two high-speed lifts at the world's tallest building have been officially recognized as the planet's fastest.\n2. The lifts take only 30 seconds to whisk passengers to the top of the 508m tall TFC 101 Tower in Taipei, Taiwan.\n3. The Guinness Book of Records has declared the 17m per second speed of the two lifts the swiftest on Earth.\n4. In total, the TFC Tower has 61 lifts, 34 of them double-deckers, and 50 escalators to shuttle people around its 106 floors.\n5. The TFC 101 Tower is due to be officially opened on 31 December.\n6. The super-fast lifts can speed up to 24 passengers to the tip of the tower in about 30 seconds, while ascending their 382m track.\n7. Curiously, the lifts take longer to descend and spend almost a minute returning to ground level from the top of the TFC Tower.\n8. The key new technologies applied in the world's fastest elevators include:\n\t* A pressure control system which adjusts the atmospheric pressure inside a car by using suction and discharge blowers.\n\t* An active control system which tries to balance the lift more finely and remove the sources of vibrations.\n\t* Streamlined cars to reduce the whistling noise produced by running the lifts at a high speed inside a narrow shaft.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about these super-fast lifts at the Taipei TFC 101 Tower. Let me read through it carefully.\n\nThe first sentence mentions that two high-speed lifts have been recognized by the Guinness Book of Records as the fastest in the world because they can reach 17 meters per second. That's a pretty high speed. They take only 30 seconds to whisk passengers up and down, which is super fast. The towers are 508 meters tall, but from the ground it's 34 floors.\n\nThe text also talks about other elevators in the world—like how they're more efficient, using better technology such as pressure control systems, active controls, and streamlined cars to reduce noise. It mentions that these elevators can go up faster than down because the track is wider. Also, the first record was in 1955, so these are some of the earliest and fastest.\n\nI need to condense this into a concise summary without adding any extra information or explanations. I should focus on the key points: the speed, time, location, number of lifts and elevators, and the technologies used. Maybe also include the tower's height compared to others.\n\nLet me structure it by first stating that these lifts are world record-breakers with a 17m/s top speed. Then mention how they take only 30 seconds each direction, which is super fast. The tower itself is over 50 meters tall. Highlight the number of lifts and escalators. Also, note Taipei's height compared to other skyscrapers.\n\nI should make sure it's clear and flows well. Maybe start with the key facts about speed and time, then location, technology used, and finally compare Taipei's height.\n</think>\n\nThe Taipei TFC 101 Tower's two fastest lifts are recognized as world record-breaking elevators, achieving a top speed of 17 meters per second (about 38 mph or 61 km/h) within just 30 seconds each way. The tower is 508 meters tall and spans over 50 meters above other skyscrapers like the Petronas Towers in Kuala Lumpur. Technologies include a pressure control system, active controls, streamlined cars to reduce whistling noise, and efficiency gains that improve speed. These elevators were introduced nearly 50 years after their initial record, showcasing significant technological advancements.", "tinyllama:1.1b": "The two high-speed lift systems at Taipei's TFC 101 Tower have officially been recognized as the fastest on Earth, with a speed of 30 seconds to complete one full journey up and down the tower's 106 floors. The lift speeds could be closer to an eighth of that rate for a human being, but the pressurized cars and active control systems aim to reduce sound levels in ascending and descending. A Guinness Book of Records certification recognizes this as the world's fastest passenger elevators. The lift record had stood since 1955, when it held a speed of 426m per minute or just under half the new record set by Taipei's TFC 101 Tower.", "tinydolphin:1.1b": " The TFC 101 Tower, located in Taipei, Taiwan, has recently achieved a Guinness Book of Records status for being the fastest passenger elevator in the world. This speed was accomplished by two 17m/s double-deck lifts, with an average acceleration of 24 passengers per second. The speed is equivalent to traveling at approximately 38.25 mph (61 km/h) and takes about 30 seconds to reach the top floor of the tower.\n\nThe elevators are equipped with a pressure control system to prevent ear popping as passengers ascend and descend on the tower's 106 floors. The active control system also helps to balance the lift more finely, while streamlined cars were used to reduce noise and vibrations during operation. Toshiba Elevator and Building Systems installed the lifts at a cost of over $27 million.\n\nThe fastest passenger elevators have been an essential part of modern transportation systems since their inception. As such, Taipei's TFC 101 Tower is more than 50m taller than the Petronas Towers in Kuala Lumpur, formerly the world's tallest skyscraper. However, despite its impressive height and top speed, it remains just one of many examples demonstrating how technology has evolved to improve travel experiences over time.", "phi:2.7b": " The article describes the record-breaking lifts installed in the TFC 101 Tower in Taiwan, which can whisk passengers to the top in 30 seconds at 17m/s (38mph). These super-fast elevators have a pressure control system, an active control system, and streamlined cars to reduce noise. It mentions that the first Guinness World Record for the world's fastest passenger elevators was in 1595. Taipei' s TFC 101 Tower is more than 50m taller than the Petronas Towers.\n", "orca-mini:3b": " The world's fastest high-speed lifts at the TFC 101 Tower in Taipei, Taiwan have been recognized by Guinness World Records as the swiftest on Earth. The lifts take only 30 seconds to whisk passengers to the top of the 508m tall building and can reach speeds of up to 24 people to the tip of the tower in about 30 seconds. The lifts also have a pressure control system and an active control system to reduce vibrations and prevent \"ear popping.\" A streamlined design reduces noise, while advanced technology such as pressure control and active control systems are used to balance the lift and remove vibrations.", "hermes3:3b": "Fastest lifts (17m/s) recognized as world's fastest, taking 30s to reach 508m Taipei tower; Guinness Book of Records.", "stablelm-zephyr:3b": "Two high-speed lifts at the world's tallest building, TFC 101 Tower in Taipei, Taiwan, have been officially recognized as the fastest elevators on Earth, with a speed of 17 meters per second. The superfast lifts can transport 24 passengers to the top of the 508-meter tower in just 30 seconds. The Guinness World Records has validated the lifts' top speed at about 38 miles per hour (61 km/h). The TFC Tower also houses 61 elevators, 34 of which are double-decker, and 50 escalators across its 106 floors. Manufactured by Toshiba Elevator and Building Systems, these new technologies applied in the world's fastest elevators include a pressure control system to prevent \"ear popping\" and an active control system to balance the lift more finely and remove sources of vibrations. Taipei's TFC 101 Tower is over 50 meters taller than the previous record holder for the world's tallest skyscraper, the Petronas Towers in Kuala Lumpur, Malaysia.", "chatgpt-4o-latest": "Two high-speed lifts in Taipei's TFC 101 Tower have been recognized as the world's fastest by the Guinness Book of Records, reaching speeds of 17m per second (61km/h) and taking just 30 seconds to ascend 382m. The lifts feature advanced technologies, including a pressure control system to prevent ear popping, an active control system to reduce vibrations, and streamlined cars to minimize noise. The tower, set to open on December 31, has 61 lifts and 50 escalators. Toshiba Elevator and Building Systems, the manufacturer, sees the recognition as a testament to technological progress, with the new record being more than twice as fast as the first recorded in 1955. The TFC 101 Tower surpasses the Petronas Towers as the world's tallest skyscraper.", "stablelm2:1.6b": "Two high-speed elevators in Taipei's TFC Tower set a new record as the fastest on Earth, reaching a speed of 58 meters per second (120 mph) to transport passengers to the top floor in just seconds. The tower also features pressure control systems to prevent ear popping during ascent and descent. Totaling three elevators, two of them are double-decker; there are four escalators as well. The TFC Tower is set to open on December 15th.", "granite3.1-dense:2b": "The TFC 101 Tower in Taipei, with a height of 508m, boasts two high-speed lifts that have been officially recognized by Guinness World Records as the fastest on Earth, reaching speeds of 17 meters per second (38mph). These lifts, among 61 in total, carry up to 24 passengers to the top in about 30 seconds. To prevent \"ear popping,\" they employ a pressure control system using suction and discharge blowers. Key technologies include an active control system for vibration reduction and streamlined cars that minimize whistling noise. The first record for the fastest passenger elevators was set in 1955, showcasing significant technological advancement over the past five decades. Taipei's TFC 101 Tower surpasses the former world's tallest skyscraper, the Petronas Towers in Kuala Lumpur.", "reference": "The lifts take only 30 seconds to whisk passengers to the top of the 508m tall TFC 101 Tower in Taipei, Taiwan.The super-fast lifts can speed up to 24 passengers to the tip of the tower in about 30 seconds, while ascending their 382m track.The Guinness Book of Records has declared the 17m per second speed of the two lifts the swiftest on Earth.Curiously the lifts take longer to descend and spend almost a whole minute returning to ground level from the top of the TFC Tower.The 17m/s top speed of the lifts translates to about 38mph (61km/h).The key new technologies applied in the world's fastest elevators include:   - A pressure control system, which adjusts the atmospheric pressure inside a car by using suction and discharge blowers, preventing \"ear popping\" - An active control system which tries to balance the lift more finely and remove the sources of vibrations - Streamlined cars to reduce the whistling noise produced by running the lifts at a high speed inside a narrow shaft   \"The certification of our elevators as world record-holders by the authoritative Guinness World Records is a great honour for us,\" said Masayuki Shimono, president of manufacturer Toshiba Elevator and Building Systems which installed the lifts."}