{"raw_text": "Broadband in the UK gathers pace\n \n One person in the UK is joining the internet's fast lane every 10 seconds, according to BT.\n \n The telecoms giant said the number of people on broadband via the telephone line had now surpassed four million. Including those connected via cable, almost six million people have a fast, always-on connection. The boom has been fuelled by fierce competition and falling prices, as well as the greater availability of broadband over the phone line. \"The take-up rate for broadband is accelerating at a terrific pace,\" said Ben Verwaayen, BT's chief executive. \"We will be in a very strong position to hit our five million target by summer 2006 much earlier than we had previously expected.\"\n \n The last million connections were made over the past four months, with thousands of people being added to the total every day of the week.\n \n Those signing up to broadband include those that get their service direct from BT or via the many companies that re-sell BT lines under their own name. Part of the surge in people signing up was due to BT stretching the reach of ADSL - the UK's most widely used way of getting broadband - beyond six kilometres. Asymmetric Digital Subscriber Line technology lets ordinary copper phone lines support high data speeds. The standard speed is 512kbps, though faster connections are available. According to BT, more than 95% of UK homes and businesses can receive broadband over the phone line. It aims to extend this figure to 99.4% by next summer. There are also an estimated 1.7 million cable broadband customers in the UK.\n", "llama3.2:1b": "One person joins internet's fast lane every 10 seconds, becoming part of four million people on BT's broadband service via telephone lines.\n\nBy summer 2006, five million targets have been reached for broadband connections over phone lines and cable.\n\nThe number of people signing up includes those who get their service directly from BT or through re-sellers.", "llama3.2:3b": "Four million people in the UK have broadband via telephone lines, with almost six million having fast, always-on connections. The number of new connections has accelerated due to fierce competition and falling prices. BT expects to hit its five million target by summer 2006 earlier than expected.", "gemma2:2b": "The number of people with broadband in the UK has surged, exceeding four million via telephone lines and almost six million overall. This growth is driven by competitive pricing, increased availability, and lower costs.  BT expects to reach its five million target earlier than expected. \n", "qwen2.5:0.5b": "Broadband connection growth is accelerating in the UK, with more than a million new connections made every day of the week. Many users subscribe directly to BT's services through their existing BT lines or those that re-sell them under their name, while others sign up via asymmetric Digital Subscriber Line technology. Over the past four months, 95% of homes and businesses in the UK can now receive broadband over the telephone line, with an estimated 1.7 million more cables available to consumers by next summer.", "qwen2.5:1.5b": "Broadband usage in the UK is accelerating, with four million people now on broadband via telephone lines and six million overall. Competition has driven down prices, improving access, leading to a faster take-up rate of approximately one person every 10 seconds. Over the past few months, more than two million connections have been added weekly. BT aims to reach five million broadband users by summer 2006 earlier than expected, with an additional 95% of UK homes and businesses connected via ADSL by next year.", "qwen2.5:3b": "One person in the UK joins the internet's fast lane every 10 seconds, according to BT. The number of people on broadband via telephone line has surpassed four million with almost six million having a fast, always-on connection. This growth is driven by competition and falling prices, along with improved availability of broadband over phone lines. BT aims to reach five million connections by summer 2006, earlier than expected, following the successful addition of thousands of new customers daily over the past four months. ADSL has been extended beyond six kilometers, allowing more people access to high-speed internet on ordinary copper phone lines. More than 95% of UK homes and businesses can receive broadband via telephone line with BT aiming to reach 99.4% by next summer. There are also approximately one million cable broadband customers in the UK.", "opencoder:1.5b": "Broadband in the UK gathers pace.\n\nOne person in the UK is joining the internet's fast lane every 10 seconds, according to BT.\n\nThe telecoms giant said the number of people on broadband via the telephone line had now surpassed four million. Including those connected via cable, almost six million people have a fast, always-on connection. The boom has been fuelled by fierce competition and falling prices, as well as the greater availability of broadband over the phone line.\n\n\"The take-up rate for broadband is accelerating at a terrific pace,\" said Ben Verwaayen, BT's chief executive. \"We will be in a very strong position to hit our five million target by summer 2006 much earlier than we had previously expected.\"\n\nThe last million connections were made over the past four months, with thousands of people being added to the total every day of the week.\n\nPart of the surge in people signing up was due to BT stretching the reach of ADSL - the UK's most widely used way of getting broadband - beyond six kilometres. Asymmetric Digital Subscriber Line technology lets ordinary copper phone lines support high data speeds. The standard speed is 512kbps, though faster connections are available. According to BT, more than 95% of UK homes and businesses can receive broadband over the phone line. It aims to extend this figure to 99.4% by next summer. There are also an estimated 1.7 million cable broadband customers in the UK.\n", "smollm:1.7b": "The text summary should be: Broadband in the UK gathers pace, with one person joining the internet's fast lane every 10 seconds and more people signing up to broadband than ever before. The telecoms giant BT is driving this growth through fierce competition and falling prices.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely while preserving key ideas and details. Let me read through the text carefully.\n\nThe first sentence mentions that broadband in the UK is gaining pace. Then BT says one person every 10 seconds on the phone line, so four million have joined via it. That's more than six million including cable connections. The boom is due to competition and falling prices from the rise of the telecoms giant BT. They expect a strong position by summer 2006.\n\nThe last million were added over four months, with thousands each week. BT stretched ADSL up to six km. Asymmetric DSL allows copper lines for high speeds—512kbps is standard, faster available. More than 95% of UK homes and businesses get it via phone line; aiming for 99.4% by summer. Also, there are about a million cable customers in the UK.\n\nI should condense this into a clear summary without adding explanations or formatting.\n</think>\n\nBroadband growth in the UK is strong. One person joins internet fast lane every 10 seconds—four million via phone line, nearly six million including cable. Booms fuelled by competition and falling prices. Expect BT to reach target by summer 2006. Last million signed over four months; Asymmetric DSL supports copper lines with speeds up to 512kbps, aiming for 99.4% coverage across UK homes and businesses.", "tinyllama:1.1b": "Britain has seen a remarkable increase in the number of people getting broadband connections, with over four million gaining access via the telepone line alone since last year. The telecoms giant BT announced that at least six million people have access to fast, always-on internet services as well as cable broadband connections, making it one of the most popular ways to get connected in Britain. With fierce competition and falling prices driving the growth, broadband over phone lines now accounts for more than 90% of new connections. BT said that by summer next year, half a million people will have access to high-speed internet through their phone line - nearly all cable customers. In addition, an estimated 1.7 million are now connected via cable, with BT aiming to extend this figure to 99.4% by the end of next year.", "tinydolphin:1.1b": " In recent years, broadband usage has rapidly expanded across the UK. According to BT, more than four million people now have a fast and always-on connection via the telephone line, with almost six million people enjoying cable broadband. The proliferation of these services has been driven by fierce competition and falling prices as well as the expansion of broadband over phone lines. The take-up rate for broadband is predicted to reach five million before summer 2006, much earlier than previously anticipated. In addition, thousands of new connections are being added daily, with thousands reaching or beyond the one million mark each day. This surge in people signing up to broadband is due in part to BT's commitment to extending ADSL (Asymmetric Digital Subscriber Line) beyond six kilometers and offering faster connections to those who can receive them over the phone line. Currently, more than 95% of homes and businesses have access to broadband over the phone line. Moreover, BT aims to extend this figure to 99.4% by next summer, aiming to reach the majority of UK homes and businesses with a fast, always-on connection via the telephone line.", "phi:2.7b": " The text summarizes the increasing popularity of broadband in the UK, with BT reporting that one person is joining the fast lane every 10 seconds. Nearly six million people now have a fast and always-on connection, thanks to competition and falling prices, as well as greater availability on telephone lines. The last million connections were made in the past four months, and thousands more are added every day. This growth includes those signing up directly with BT or through resellers, and BT has stretched ADSL technology to reach six kilometers beyond its initial limit. By next summer, BT aims to offer broadband over the phone line to 99.4% of UK homes and businesses, and there are also around 1.7 million cable broadband customers in the country.\n", "orca-mini:3b": " In the UK, the number of people connected to the internet through broadband on a telephone line has surpassed four million and is still growing at a rapid pace. This is being fueled by fierce competition, falling prices, and the greater availability of broadband over the phone line. By summer 2006, BT aims to have reached five million broadband customers. The majority of these connections are made through ADSL technology, which can support high data speeds using ordinary copper phone lines. BT has also extended the reach of ADSL beyond six kilometers to reach more homes and businesses. Asymmetric Digital Subscriber Line technology is used for cable broadband services, with more than 95% of UK households and businesses able to receive broadband over the phone line.", "hermes3:3b": "UK broadband users double to almost 6m, one person joining every 10 seconds, due to falling prices, competition, and extended phone line reach (ADSL).", "stablelm-zephyr:3b": "In the UK, one person gets broadband every 10 seconds, with 4 million people on broadband through telephone lines and 5.6 million via cables. The increase is due to competition, falling prices, and greater availability. BT aims to reach 99.4% of UK homes and businesses with broadband by next summer. They also have 1.7 million cable broadband customers.", "chatgpt-4o-latest": "Broadband adoption in the UK is accelerating, with one person joining every 10 seconds, according to BT. Over four million people now use broadband via telephone lines, and nearly six million including cable users. Growth is driven by competition, lower prices, and expanded availability. BT aims to reach five million broadband users by summer 2006, likely ahead of schedule. The last million connections occurred in just four months. BT has extended ADSL reach beyond six kilometers, enabling more users to access broadband. Currently, over 95% of UK homes and businesses can receive broadband via phone lines, with a target of 99.4% by next summer. Additionally, 1.7 million people use cable broadband.", "stablelm2:1.6b": "Broadband adoption in the UK has accelerated, with four million people on broadband via telephone line and almost six million connected through cable. The growth was fueled by competition, falling prices, and greater availability of broadband over phone lines. BT's CEO expects 5 million connections by summer. Over half of UK homes and businesses have access to broadband through phone lines, projected to reach 4.4% by next year. Additionally, there are an estimated 1.7 million cable broadband customers in the UK.", "granite3.1-dense:2b": "BT reports that one person in the UK is joining the high-speed internet network every 10 seconds, with over four million people now connected via phone lines and nearly six million overall, including those on cable. This growth is driven by intense competition, lower prices, and expanded accessibility of broadband over copper phone lines. BT's CEO, Ben Verwaayen, anticipates reaching their five-million target by summer 2006 earlier than expected. The last million connections were made in the past four months, with daily additions of thousands. Broadband service is available to more than 95% of UK homes and businesses, and BT aims to extend this to 99.4% by next summer. Additionally, there are approximately 1.7 million cable broadband customers in the UK.", "reference": "The telecoms giant said the number of people on broadband via the telephone line had now surpassed four million.According to BT, more than 95% of UK homes and businesses can receive broadband over the phone line.There are also an estimated 1.7 million cable broadband customers in the UK.Those signing up to broadband include those that get their service direct from BT or via the many companies that re-sell BT lines under their own name.Including those connected via cable, almost six million people have a fast, always-on connection.The last million connections were made over the past four months, with thousands of people being added to the total every day of the week."}