{"raw_text": "Hollywood campaign hits websites\n \n Movie studio efforts to stop pirated films being shared on peer-to-peer networks have claimed a high-profile victim.\n \n The campaign of legal action is thought to be behind the closure of the widely used Suprnova.org website. The site was the most popular place for people swapping and sharing links for the BitTorrent network. A recent study showed that more than half of the peer-to-peer traffic during June was for the BitTorrent system.\n \n In a message posted on Suprnova.org on Sunday, the site's controllers said the site was \"closing down for good in the way that we all know it\". If the site did return, the message said, it would not be hosting any more torrent links. It continued: \"We are very sorry for this, but there was no other way, we have tried everything. \" The only parts that would keep going, said the operators of the Suprnova site, were the discussion forums and net chat channels. The site is thought to have closed following an announcement by the Motion Picture Association of America that it was launching legal action against those operating BitTorrent servers rather than end users. Because of the way that BitTorrent works, server sites do not host the actual file being shared, instead they host a link that points people to others that have it. By targeting servers, the MPAA hopes to cripple BitTorrent's ability to share files. In the opening days of the MPAA campaign, the organisation filed 100 lawsuits against operators of BitTorrent server site. The launching of the legal seems to be having an effect. Phoenix Torrents, another popular BitTorrent site, has also decided to shut down and, though it gave no reasons for the closure, it is thought to be motivated by the threat of legal action. Last week Finnish police raided a BitTorrent site based in the country that, according to reports, let 10,000 users shared pirated films, software, music and games.\n", "llama3.2:1b": "Hollywood's movie studio campaign has shut down Suprnova.org, a popular peer-to-peer network for sharing BitTorrent links. The site is closing its operations after receiving threats from the Motion Picture Association of America to launch legal action against server operators rather than users.", "llama3.2:3b": "Suprnova.org, a widely used website for sharing links on BitTorrent networks, has closed down following an MPAA announcement of launching legal action against BitTorrent server operators rather than end users. The site's controllers cited the effort as \"the only way\" to continue. Phoenix Torrents and another Finnish BitTorrent site have also shut down in response to the threat of legal action.", "gemma2:2b": "Hollywood studios are taking legal action against websites that host links for file sharing on the BitTorrent network. The campaign has resulted in the closure of Suprnova.org, a popular website hosting torrent files, and the shutdown of Phoenix Torrents. This tactic targets server sites rather than end users, aiming to disrupt the file-sharing process. \n", "qwen2.5:0.5b": "Hollywood campaign aims to ban BitTorrent: Suprnova.org website was closed following an MPAA lawsuit against server sites. Users had access to multiple BitTorrent servers but were not allowed to host their own content.", "qwen2.5:1.5b": "Hollywood campaigns against BitTorrent sites using lawsuits have led Suprnova.org to close permanently. MPAA launches legal action against BitTorrent servers, prompting other sites like Phoenix Torrents to shut down. Piracy site closures highlight growing efforts by industry groups to combat illegal file sharing through peer-to-peer networks.", "qwen2.5:3b": "Hollywood's campaign against pirated films on peer-to-peer networks has closed widely used Suprnova.org, which was popular for hosting BitTorrent links. The Motion Picture Association of America (MPAA) announced legal action against servers rather than end users, targeting the BitTorrent system where servers do not host files but provide links to others with them. This campaign led to the closure of several popular BitTorrent sites including Phoenix Torrents and a Finnish site raided by police for hosting pirated content.", "opencoder:1.5b": "\"Hollywood campaign hits websites,\" followed by \"the studio efforts to stop pirated films being shared on peer-to-peer networks,\" are the main points of interest. The \"high-profile victim\" is also a key argument. Following that, the \"campaign of legal action,\" \"effects on Suprnova.org website,\" \"recent study showing BitTorrent traffic,\" and details about how BitTorrent operates, as well as the closing message, provide further insights into the site's decision to close down.\n", "smollm:1.7b": "Hollywood campaign hits websites", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text concisely while preserving the key ideas and details. Let me read through it again carefully.\n\nThe first sentence talks about Hollywood campaign using websites like Suprnova.org to stop pirated files being shared on peer-to-peer networks. It mentions that the site was popular for sharing links via BitTorrent, which accounts for more than half of peer-to-peer traffic in June.\n\nThen, it says that in a message posted on Suprnova.org, the operators stated that their site is closing down because \"we all know it,\" even though there's no official closure. They said if it reopens, it won't have any torrent links anymore but would host discussions and net chats instead. The motion picture association of america is taking legal action against BitTorrent servers rather than end users because they want to cripple the sharing.\n\nPhoenix Torrents has also shut down for similar reasons, possibly due to fear of legal action from other sites. There's mention of a Finnish police raiding a site that allowed 10,000 users to share pirated content, leading to the site closing down.\n\nSo the key points are:\n\n1. Hollywood is targeting websites like Suprnova.org with legal actions against BitTorrent servers.\n2. The servers host links but won't host actual files, instead hosting discussions and chats.\n3. There were 100 lawsuits filed by MPAA against BitTorrent operators.\n4. Another site Phoenix Torrents also shut down for legal reasons.\n\nI need to make sure the summary includes all these points clearly without adding any personal opinions or extra information beyond what's in the original text.\n</think>\n\nHollywood is targeting websites like Suprnova.org with legal actions against BitTorrent servers, which instead host discussions and net chats. MPAA filed 100 lawsuits against BitTorrent operators. Another site Phoenix Torrents also shut down due to legal concerns.", "tinyllama:1.1b": "Hollywood film studios are reportedly using legal action to close down popular peer-to-peer networks like Suprnova.org, which is said to have been shut down by the studio in a bid to stem the growth of BitToorrent traffic. The network's operators posted a message on its website announcing that it would not host any more torrent links after the Motion Picture Association of America launched legal action against those operating server sites instead. This move follows the MPAA filing 100 lawsuits against operators of BitTorrent servers in just days, which prompted the closure of popular networks like Suprnova.org. While a spokesperson for the studio declined to comment on the exact reasons for the closure, it is thought that threats of legal action are driving the campaign of targeting server sites. Despite the threat of legal action, BitTorrent networks continue to flourish and host millions of users each month.", "tinydolphin:1.1b": " The Hollywood campaign against pirated films on peer-to-peer networks has reached its latest victim, with the closure of Suprnova.org, one of the most popular sites for sharing such content. Suprnova had been serving as a hub for users swapping and sharing links to pirated files using the BitTorrent protocol, but after facing legal pressure from the MPAA, it announced that it would no longer host such files. The site was shutting down for good, effectively stopping all hosting of those links. In response to this move, several sites have decided to shut down as well, including Phoenix Torrents. Although there are reasons given by both the MPAA and Suprnova, it remains uncertain whether they are solely motivated by legal action or if they are also targeting the online community to control piracy on peer-to-peer networks.", "phi:2.7b": " The movie studio's campaign to stop illegal sharing of films on peer-to-peer networks led to the closure of Suprnova.org, a popular site used for swapping and sharing BitTorrent links. This is due to legal action taken by the Motion Picture Association of America against operators of BitTorrent servers. The MPAA also filed 100 lawsuits against these server sites in the first days of the campaign. As a result, other BitTorrent sites like Phoenix Torrents have shut down as well. Additionally, Finnish police raided a BitTorrent site that allegedly allowed users to share pirated films and software.\n", "orca-mini:3b": " Hollywood campaigned against peer-to-peer networks for sharing illegal files, closing a popular BitTorrent site called Suprnova.org. The site's operators cited legal action by the Motion Picture Association of America as the reason for shutting down the site. The MPAA aims to stop server sites that host links to file sharing, rather than end-users. Other popular BitTorrent sites, like Phoenix Torrents, have also closed due to potential legal action.", "hermes3:3b": "Suprnova.org closed, major P2P site; likely due to Hollywood's legal action against BitTorrent servers. MPAA filed lawsuits against server operators to cripple file sharing network.", "stablelm-zephyr:3b": "Hollywood campaign against pirated films on peer-to-peer networks has resulted in the closure of Suprnova.org, the most popular BitTorrent site for sharing links. The Motion Picture Association of America (MPAA) targeted server sites rather than end users, filing 100 lawsuits against BitTorrent operators. Other popular BitTorrent sites like Phoenix Torrents have also closed down or faced legal action.", "chatgpt-4o-latest": "Hollywood's campaign against film piracy has led to the shutdown of Suprnova.org, a major site for sharing BitTorrent links. The site's operators announced its permanent closure, stating they had no other choice. The Motion Picture Association of America (MPAA) has shifted its legal focus to BitTorrent server operators rather than individual users, aiming to disrupt file sharing by targeting sites that host torrent links. The MPAA has already filed 100 lawsuits, prompting other sites like Phoenix Torrents to shut down. Finnish police also raided a BitTorrent site with 10,000 users sharing pirated content.", "stablelm2:1.6b": "Movie studio campaign has closed Suprnova.org, the most popular website for sharing BitTorrent network links, due to legal action by the Motion Picture Association of America against BitTorrent server sites. The site was operating discussion forums and net chat channels when it closed down. The MPAA aims to target servers rather than users to weaken BitTorrent's ability to share files through legal actions, including lawsuits filed against operators of popular BitTorrent sites like Phoenix Torrents.", "granite3.1-dense:2b": "Hollywood's intensified campaign against online piracy has resulted in the shutdown of Suprnova.org, a prominent BitTorrent server hosting site. The site's operators, citing legal action from the Motion Picture Association of America (MPAA), announced its closure for good, stating they had exhausted all other options to continue operating. This decision follows the MPAA filing 100 lawsuits against BitTorrent server operators, aiming to disrupt file-sharing by targeting servers rather than end users. Other popular BitTorrent sites, such as Phoenix Torrents and a Finnish-based site, are also suspected of closing due to similar legal pressures. The MPAA's strategy appears effective in curbing unauthorized film, software, music, and game sharing on the platform.", "reference": "The site is thought to have closed following an announcement by the Motion Picture Association of America that it was launching legal action against those operating BitTorrent servers rather than end users.The site was the most popular place for people swapping and sharing links for the BitTorrent network.In the opening days of the MPAA campaign, the organisation filed 100 lawsuits against operators of BitTorrent server site.Phoenix Torrents, another popular BitTorrent site, has also decided to shut down and, though it gave no reasons for the closure, it is thought to be motivated by the threat of legal action.Because of the way that BitTorrent works, server sites do not host the actual file being shared, instead they host a link that points people to others that have it.In a message posted on Suprnova.org on Sunday, the site's controllers said the site was \"closing down for good in the way that we all know it\"."}