{"raw_text": "The year search became personal\n \n The odds are that when you fire up your browser, you go straight to your favourite search engine, rather than type in a web address.\n \n Some may see this as the height of laziness, but in an era of information overload, search has become a vital tool in navigating the net. It is symptomatic of how the way we use the internet is changing. And as Google has shown, there is money in offering a service that people cannot live without. There is no shortage of companies vying for the loyalty of web searchers, offering a wealth of different services and tools to help you find what you want. Over the past 12 months, giants of the technology world such as Microsoft and Yahoo have sought to grab a slice of the search action. \"User experience has contributed to people searching more,\" said Yonca Brunini of Yahoo. As people become more familiar with the internet, they tend to spend more time online and ask more queries, she said. \"The other second thing is broadband,\" Ms Brunini told the BBC News website. \"This will do to internet what colour has done to TV.\"\n \n But search is hardly a new phenomenon. It has been around since the early days of the net.\n \n Veteran surfers will remember old-timers like Hotbot and Altavista. \"Search was always important,\" said Urs Holzle, Google vice-president of operations. \"We trumpeted that in 1999. It is even truer now as there are more users and more information.\" \"People didn't realise that search was the future. The financials have something to do with it.\" Google has shown web commerce can work through its targeted small adverts, which appear at the top and down the right-hand side of a page and are related to the original search. These small ads helped Google reach revenues of $805.9m for the three months to September. Others have woken up to the fact that you can make money out of web queries. \"Once you see there is a market, Microsoft is bound to step to it. If Microsoft sees search as important, then nobody queries it,\" said Mr Holzle.\n \n Microsoft is just one of the net giants muscling in on search. Yahoo, Ask Jeeves, Amazon and a handful of smaller outfits are all seeking to capture eyeballs.\n \n Web users face a plethora of choices as each company tries to outflank Google by rolling out new search products such as desktop search. It reflects how the battlefield has shifted from the net to your PC. Search is not just about finding your way around the web. It is now about unlocking information hidden in the gigabytes of documents, images and music on hard drives. For all these advances, search is still a clumsy tool, often failing to come up with exactly what you had in mind. In order to do a better job, search engines are trying to get to know you better, doing a better job of remembering, cataloguing and managing all the information you come across. \"Personalisation is going to be a big area for the future,\" said Yahoo's Yonca Brunini. \"Whoever cracks that and gives you the information you want is going to be the winner. We have to understand you to give you better results that are tailored to you.\" This is perhaps the Holy Grail of search, understanding what it is you are looking for and providing it quickly. The problem is that no one yet knows how to get there.\n", "llama3.2:1b": "Here is a summary of the text in plain text:\n\nThe year search became more personal as people started typing in web addresses instead of searching engines. \nMicrosoft and Yahoo have sought to grab the loyalty of web searchers by offering different services and tools, such as Microsoft's Bing and Yahoo's Search.\nSearch has become important due to increased internet usage and broadband availability, with Google showing success through targeted ads.\nPrivate companies like Microsoft see an opportunity in targeting users and making money from their searches through targeted advertising.\nInternet users have multiple options for searching, including new products like desktop search, highlighting the shift from online search to PC-based information retrieval.", "llama3.2:3b": "Search engines have become a vital tool in navigating the internet due to information overload.\nThe rise of broadband has contributed to an increase in online searches, with companies like Google, Microsoft, and Yahoo seeking to capture market share.\nGoogle's targeted ads helped reach revenues of $805.9m for the three months to September.\nNew search products, such as desktop search, are being rolled out by net giants to compete with Google.\nPersonalisation is a key area of focus, with companies trying to understand users better and provide tailored results.", "gemma2:2b": "Search engines have become ubiquitous on the internet, evolving from a niche feature into a central tool for navigating information overload. Google's dominance in this field has led other tech giants like Microsoft and Yahoo to focus their efforts on capturing user search data, offering new products and services to enhance functionality.  As web use increases, personalization is becoming increasingly important in search, with companies aiming to understand users better to deliver more accurate results and cater to individual needs. Despite advancements in technology, the goal of achieving truly personalized and effective search remains a challenge. \n", "qwen2.5:0.5b": "The year 2019 saw a shift in internet users' usage patterns, with web searches becoming more personal as they rely on search engines like Google. Some see this as the end of laziness, while others view it as an era of information overload. The way we use the internet has changed, and companies are vying for our loyalty by offering a wide range of services to help us find what we want online. Yahoo, for example, offers targeted search ads that appear at the top and right-hand side of web pages. This is reflected in Google's success with desktop search, where users can quickly access information without leaving their websites. Search is also increasingly personal as users seek out information hidden on their hard drives. Yonca Brunini, Yahoo's vice-president of operations, says that search engines are trying to get to know us better by remembering and cataloguing our information. This understanding will be key for the future of search, where we need to provide more tailored results based on user preferences.", "qwen2.5:1.5b": "Search has become a personal tool due to increased internet use and broadband availability, with giants like Google and Microsoft vying for market share. Search engines have evolved from old-time search tools to a key feature of modern web browsing, offering targeted ads and managing vast amounts of information on users' hard drives. Despite being useful, they are still imperfect, highlighting the need for personalization in future advancements.", "qwen2.5:3b": "The rise of personal web search has led to increased competition among tech giants like Google, Yahoo, Microsoft, and smaller players offering various services. Search engines now aim to provide better user experiences through features such as targeted ads and personalized results based on users' browsing history. While progress is being made in refining search technology, issues persist with search engines often failing to deliver the exact results a user seeks. The future of search lies in understanding individual user preferences more accurately to tailor search results more effectively.", "opencoder:1.5b": "The year search became personal. \n\nWhen people fire up their browser, they go straight to their favourite search engine rather than typing in a web address.\n\nCompanies like Microsoft and Yahoo have sought to grab a slice of the search action as users become more familiar with the internet. Search has been around since the early days of the net. Veteran surfers will remember old-timers like Hotbot and Altavista. As they tend to spend more time online and ask more queries, their remark about search was \"The other second thing is broadband.\"\n\nCompanies like Microsoft and Yahoo have shown web commerce can work through its targeted small adverts which appear at the top and down the right-hand side of a page and are related to the original search. This helped Google reach revenues of $805.9m for the three months to September.\n\nIn order to do a better job, search engines are trying to get to know you better by doing a better job of remembering, cataloguing and managing all the information you come across. This helps users find what they want quicker. \n\nThe problem is that no one yet knows how to get there, understanding what it is you are looking for and providing it quickly.\n", "smollm:1.7b": "Summarize the text concisely by highlighting key ideas and details:\n\n1. The rise of search as a vital tool in navigating the internet has led to new companies vying for user attention.\n2. Search has been around since the early days of the net, but it is now more important than ever due to the abundance of information available online.\n3. Google's dominance in search has created an opportunity for other companies to enter the market and compete with them.\n4. Web users face a plethora of choices as each company tries to outflank Google by rolling out new search products such as desktop search.\n5. Search is not just about finding information online, but also about unlocking information hidden in gigabytes of documents, images and music on hard drives.\n6. To do a better job, search engines are trying to get to know users better, doing a better job of remembering, cataloguing and managing all the information they come across.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about the importance of search engines in the digital age. Let me read through it carefully.\n\nThe first paragraph talks about how we're now using web addresses instead of searching manually, which seems lazy but becomes essential with all the information overload. Then Yonca Brunini from Yahoo says that user experience matters more for people who search online. She also mentions broadband and how internet changes TV. \n\nNext, it says search isn't new; it's been around since the internet started. Veteran surfers remember old systems like Hotbot and Altavista. Holzle said Google was already marketing search in 1999, which is true now with more users and info.\n\nThe text then moves on to other tech giants like Yahoo and Amazon trying to take over search, using features like desktop searches and web commerce. These products outflank Google, offering new services. Microsoft is also involved in targeting personalization, aiming for better understanding of what people are searching for.\n\nSo, the key points I need to include are: the shift from manual searching to automatic help via search engines; their importance today with more data than ever before; user experience matters, especially targeting users who search online; Google's efforts with broadband and targeted ads; the rise of competitors like Yahoo and Amazon trying to outdo Google; Microsoft's move into personalization; and the future goal being better understanding users' needs through personalization.\n\nI need to make sure I capture these points concisely without any extra info. Maybe start by stating that search engines are more important than ever, mention user experience impact, historical roots, the rise of tech companies trying to take over, the financial aspects like Google's ads and targeted searches, Microsoft's efforts towards personalization, and end with the future goal.\n</think>\n\nsearch engines have taken center stage in our digital world, being essential for navigating vast information. while search has evolved from manual input to automatic assistance, it remains crucial due to increased data volume. user experience impacts its effectiveness, particularly targeting users seeking online help. history dates back centuries; despite growth in the web, companies like y commission are leading the charge by offering new services, enhancing personalization and competition.", "tinyllama:1.1b": "The year seaRCH became personal, as described in the given text, has seen several companies trying to capture the attention of web surfers by offering new products such as desktop seaRCH. Although it's not just about finding your way around the internet anymore, but also unlocking information hidden on hard drives and improving the accuracy of search results through personalization efforts. The future lies in better remembering, cataloguing, and managing all the information surfers come across, as well as providing them with more relevant and personalized results. While Google remains a dominant player in seaRCH, several other companies are trying to compete for their loyalty by offering personalized services that go beyond keyword searches. However, no one knows how to get there yet.", "tinydolphin:1.1b": " In an age of information overload, Google has become a vital tool in navigating the internet. Search has become a means of obtaining information and finding what we need, regardless of where we are. It's important for users to remember the importance of search since it has been around since the early days of the net. The user experience has contributed to people searching more, with more people using the internet to find out about things they want to know. This can be seen in the increased use of broadband, as people become more familiar with the internet and spend more time online. Search engines have been working hard to improve their services by focusing on personalization, understanding what we are looking for, and providing results quickly. Overall, the search engine industry is evolving in an exciting direction, driven by innovation and user engagement.", "phi:2.7b": " The internet has become a vital tool in navigating its vast amount of information. Search engines have evolved from old-timers like Hotbot and Altavista to giants like Google, which has shown that offering personalized search results can be profitable. Other companies such as Microsoft are also realizing the potential of web queries for generating revenue. However, searching on the internet is not a new phenomenon, with early searches being used since the inception of the net. Personalization in search algorithms will play a significant role in providing tailored results to users, but the technology has yet to reach this level of understanding.\n", "orca-mini:3b": " The year search became personal as people started using the internet more frequently and queries increased. Giants like Microsoft and Yahoo sought to grab a slice of the search action, and search has become an important tool in navigating the net. Web users have a plethora of choices as companies compete to offer better search products. Search is still a clumsy tool that needs improvement, but companies are working towards personalization. The winner will be the company that understands you best and provides tailored results.", "hermes3:3b": "Key summary of text:\n\nSearch has become a vital tool in navigating the internet as people spend more time online, asking more queries. Though not new, web commerce via targeted small ads (used by Google) has made search important and shown other companies it can be profitable. However, improving personalisation - understanding user intent to provide tailored results quickly - remains a challenge.", "stablelm-zephyr:3b": "The use of search engines has become essential in navigating the internet, with Google leading the market. Other technology giants like Microsoft, Yahoo, Ask Jeeves, Amazon, and smaller companies are also entering the search market to compete with Google. As people spend more time online and search more often, user experience is becoming increasingly important. Search engines strive to personalize results and improve their ability to remember and manage information for better tailored results.", "chatgpt-4o-latest": "Search engines have become essential tools for navigating the internet, reflecting changes in how people use the web. Companies like Google, Microsoft, and Yahoo are competing to dominate the search market, recognizing its financial potential. Google has demonstrated that targeted ads can generate significant revenue, prompting other tech giants to invest in search technology. The competition has led to innovations such as desktop search, shifting the focus from the web to personal computers. However, search remains imperfect, often failing to deliver precise results. The future of search lies in personalization—understanding users' needs to provide tailored results. While companies strive to achieve this, the ultimate solution remains elusive.", "stablelm2:1.6b": "The growth of search has become essential in navigating the internet. As people spend more time online asking queries, companies such..\nMicrosoft and Yahoo have entered the search market to grab a slice of this action. Google's targeted small ads make web commerce work.\nWeb users face numerous choices from these companies offering search products such as desktop search, illustrating how the battle has shifted from the net to your PC.\nTo provide better results, search engines are striving for personalization, understanding what a user is looking for and providing it quickly.\nWhile search tools have improved over time, achieving exactly what users want remains a challenge.", "granite3.1-dense:2b": "Search has evolved from a niche tool to a crucial aspect of internet navigation, driven by increased user experience and broadband penetration. Companies like Google, Microsoft, Yahoo, Ask Jeeves, and Amazon recognize its value and are investing heavily in search services. These companies offer diverse features, including desktop search capabilities that access information on personal computers. Personalization is a key focus for future improvement, with the goal of understanding users' needs and delivering tailored results. Despite progress, search remains a clumsy tool due to its inability to perfectly match user queries with desired outcomes.", "reference": "Web users face a plethora of choices as each company tries to outflank Google by rolling out new search products such as desktop search.Some may see this as the height of laziness, but in an era of information overload, search has become a vital tool in navigating the net.Microsoft is just one of the net giants muscling in on search.Search is not just about finding your way around the web.If Microsoft sees search as important, then nobody queries it,\" said Mr Holzle.Google has shown web commerce can work through its targeted small adverts, which appear at the top and down the right-hand side of a page and are related to the original search.\"Search was always important,\" said Urs Holzle, Google vice-president of operations.\"User experience has contributed to people searching more,\" said Yonca Brunini of Yahoo.\"People didn't realise that search was the future.But search is hardly a new phenomenon.In order to do a better job, search engines are trying to get to know you better, doing a better job of remembering, cataloguing and managing all the information you come across.Over the past 12 months, giants of the technology world such as Microsoft and Yahoo have sought to grab a slice of the search action.And as Google has shown, there is money in offering a service that people cannot live without.The odds are that when you fire up your browser, you go straight to your favourite search engine, rather than type in a web address.For all these advances, search is still a clumsy tool, often failing to come up with exactly what you had in mind."}