{"raw_text": "IBM frees 500 software patents\n \n Computer giant IBM says 500 of its software patents will be released into the open development community.\n \n The move means developers will be able to use the technologies without paying for a licence from the company. IBM described the step as a \"new era\" in how it dealt with intellectual property and promised further patents would be made freely available. The patents include software for a range of practices, including text recognition and database management. Traditional technology business policy is to amass patents and despite IBM's announcement the company continues to follow this route.\n \n IBM was granted 3,248 patents in 2004, more than any other firm in the US, the New York Times reports. For each of the past 12 years IBM has been granted more US patents than any other company. IBM has received 25,772 US patents in that period and reportedly has more than 40,000 current patents. In a statement, Dr John E. Kelly, IBM senior vice president, Technology and Intellectual Property, said: \"True innovation leadership is about more than just the numbers of patents granted. It's about innovating to benefit customers, partners and society.\n \n \"Our pledge today is the beginning of a new era in how IBM will manage intellectual property.\" In the past, IBM has supported the non-commercial operating system Linux although critics have said this was done only as an attempt to undermine Microsoft.\n \n The company said it wanted to encourage other firms to release patents into what it called a \"patent commons\". Adam Jollans, IBM's world-wide Linux strategy manager, said the move was a genuine attempt to encourage innovation. \"We believe that releasing these patents will result in innovation moving more quickly. \"This is about encouraging collaboration and following a model much like academia.\" Mr Jollans likened the plan for a patent commons to the way the internet was developed and said everyone could take advantage of the result of collaboration. \"The internet's impact has been on everyone. The benefits are there for everyone to take advantage of.\" Stuart Cohen, chief executive of US firm Open Source Development Labs, said the move could mean a change in the way companies deal with patents.\n \n \"I think other companies will follow suit,\" he said. But not everyone was as supportive. Florian Mueller, campaign manager of a group lobbying toprevent software patents becoming legal in the European Union,dismissed IBM's move as insubstantial. \"It's just diversionary tactics,\" wrote Mr Mueller, who leadsnosoftwarepatents.com, in a message on the group's website. \"Let's put this into perspective: We're talking aboutroughly one percent of IBM's worldwide patent portfolio. They filethat number of patents in about a month's time,\" he added. IBM will continue to hold the 500 patents but it has pledged to seek no royalties from the patents. The company said it would not place any restrictions on companies, groups or individuals who use them in open-source projects. Open source software is developed by programmers who offer the source code - the origins of the program - for free and allow others to adapt or improve the software. End users have the right to modify and redistribute the software, as well as the right to package and sell the software. Other areas covered by the patents released by IBM include storage management, simultaneous multiprocessing, image processing, networking and e-commerce.\n", "llama3.2:1b": "IBM will release 500 of its software patents into the open development community, allowing developers to use the technologies without paying for a license from the company. The move is seen as a new era in how IBM deals with intellectual property and promises further patents would be made freely available. This move contrasts with traditional technology business policy where companies typically accumulate and restrict patents.", "llama3.2:3b": "IBM releases 500 software patents into open development community, making them freely available for developers to use without a license from the company. The move is part of a new era in how IBM manages intellectual property, with more patents expected to be made freely available. The patents cover practices such as text recognition and database management, and include areas like storage management, simultaneous multiprocessing, and e-commerce.", "gemma2:2b": "IBM is releasing 500 of its software patents into the public domain. The company says this will encourage innovation and collaboration within the open development community. While traditional technology business policy has been to acquire patents, IBM claims this release marks a shift toward innovative leadership focused on customer benefit.  Others are optimistic that this move could spark similar changes in how companies manage intellectual property. \n", "qwen2.5:0.5b": "IBM is releasing 500 software patents into a public domain for developers to use without paying a license fee. The move aims to encourage innovation and collaboration. Despite IBM's previous stance of granting US patents primarily to proprietary business practices, the company now sees it as a new chapter in its approach. This step represents a significant shift from traditional business policy towards a more collaborative model.", "qwen2.5:1.5b": "IBM releases 500 of its software patents into a patent commons for free use in open-source projects without royalties or restrictions. This move represents a shift away from traditional business practices involving patent accumulation towards fostering innovation through collaboration. The company aims to encourage other firms to release their patents, citing the internet as an example of how collaborative development benefits all users. While not widely supported by critics, IBM believes this approach could lead to faster innovation and broader access to new technologies.", "qwen2.5:3b": "IBM is releasing 500 of its software patents into the open development community, allowing developers to use them without licensing fees. This move marks a shift from traditional patent policies focused on amassing intellectual property. IBM has granted over 25,000 US patents in total and pledged further releases. The company supports non-commercial operating system Linux but critics view this as an attempt to undermine Microsoft. IBM's plan encourages collaboration similar to the internet development model, believing it will foster quicker innovation. Critics like Florian Mueller argue that the move is insignificant given IBM's annual patent filings. While other companies may follow suit, not everyone sees it as significant change in handling patents. The released patents cover various areas including storage management, multiprocessing, image processing, networking, and e-commerce.", "opencoder:1.5b": "IBM frees 500 software patents\n\nThe IBM company has granted 3,248 patents in 2004 for a move towards an open source model which can be seen as a new era in intellectual property management. This step is being adopted to support innovative technology practices that could benefit businesses and customers alike.\n", "smollm:1.7b": "The summary should be concise, clear, and free of unnecessary information. The key ideas and details are preserved in the text, but the tone is neutral and informative.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about IBM releasing 500 software patents into the open development community. Let me read through it carefully.\n\nThe user provided a detailed paragraph discussing IBM's move, their rationale, the current state of their patent portfolio, and the broader implications for other companies in IT and software development.\n\nFirst, I should identify the key points: IBM granted 3,248 patents in 2004, which was more than any other company. They announced releasing these patents into a public market, not for commercial use yet. This is part of their commitment to making innovation accessible to everyone through intellectual property rights.\n\nThey mentioned that IBM's approach involves creating a \"patent commons,\" which is a term I'm not too familiar with, but it seems like an alternative to their current method of accumulating patents and then licenses them out to companies. Instead, they want to freely release these technologies so others can use them without licensing.\n\nThe text also talks about IBM's policy: in the past, non-commercial operating systems like Linux were supported but critical for Microsoft. Now, they're pushing a different model where software patents are released publicly regardless of the company that develops it. This is seen as a new era in managing IP.\n\nThere's mention of IBM's commitment to innovation by encouraging others to share their patents through this commons. They also note that while some might dismiss it as just diversionary tactics, others support it on ethical grounds.\n\nKey details: IBM granted 25,772 US patents from 2013 to 2024, with more than 40,000 current patents. The move is part of a shift in how they handle intellectual property rather than accumulating and licensing it.\n\nI should make sure the summary includes these points: IBM's announcement, the number of patents granted, their new approach (patent commons), the benefits for companies, the criticism from Microsoft-like Linux support, the ethical reception, and the broader implications for other tech companies.\n</think>\n\nIBM announced the release of 500 software patents into the public market, marking a shift in how they manage intellectual property. They granted 3,248 patents globally in 2004 and aim to freely distribute these technologies without licensing them. This move represents a new era where IBM leverages open-source innovation for accessibility, challenging traditional approaches that relied on accumulating patents and then licensing them. The company's focus is on fostering collaboration and enabling diverse tech companies to share innovations. Despite some criticism of Linux as Microsoft support, IBM's move has gained traction, particularly in encouraging ethical openness and free access to intellectual property resources.", "tinyllama:1.1b": "IBM has announced that it will release more than 500 of its software patents into the open development community for use in related technologies, including text recognition and database management. The move is seen as a new era in the company's approach to intellectual property, with IBM stating that it will continue to hold the 500 patents, but seek no royalties from them. In addition to offering the sources of programs for free, open-source projects allow users to modify and redistribute software, while also giving right to package and sell the software. The announcement comes after IBM granted more US patents in 2004 than any other firm in the country, with Dr John E. Kelly stating that true innovation leadership is about \"more than just the numbers of patents granted.\" Critics have argued that IBM's previous releaing of patents would result in increased innovation moving more quickly, but the company has said it believes that releasing patents into a shared development community will encourage collaboration and foster innovation. The move is seen as an attempt to encourage open-source software development and potentially increase the impact of the internet's impact on other areas.", "tinydolphin:1.1b": " The statement from IBM reveals a new era in its approach to intellectual property (IP) which has traditionally been characterized by amassing patents and charging for them. This decision comes as a response to increased pressure from shareholders and critics, who argue that the company has been excessively aggressive with its IP portfolio. The release of 500 outstanding patents marks a new beginning for IBM in terms of managing its IP rights. It aims to encourage collaboration among other companies and foster innovation by encouraging them to release their own inventions into the commons. This decision aligns with the company's commitment to open-source software, where users can freely modify and redistribute the software they use. The move may also have positive effects on the competitive landscape of the technology industry, as it could lead to increased investment in research and development by other companies looking to build upon IBM's innovations. However, critics argue that this move could be counterproductive, and could limit the opportunities for smaller companies seeking to leverage their inventions in a collaborative environment. Nonetheless, the statement from IBM suggests that it is embracing new ideas in response to market forces and user demand.", "phi:2.7b": " In a move towards encouraging collaboration, IBM has released 500 of its software patents into the open development community for free. The company claims this is the start of a new era in how it deals with intellectual property and promises further patents will be made available. The technology giant was granted 3,248 patents in 2004, more than any other firm in the US. However, critics argue IBM's move is insubstantial compared to its overall patent portfolio, which includes over 40,000 current patents. IBM hopes this release will encourage innovation and benefit customers, partners, and society. It has also promised not to seek royalties from the released patents.\n", "orca-mini:3b": " IBM frees 500 software patents, making them available for free use in open-source projects. The move allows developers to use the technologies without paying for a licence from the company. IBM described it as a \"new era\" in how it deals with intellectual property.", "hermes3:3b": "IBM releases 500 software patents into open development community for free use without licensing fees.", "stablelm-zephyr:3b": "IBM has announced that it will be releasing 500 of its software patents into the open development community, allowing developers to use the technologies without paying for a licence from the company. This move is seen as a \"new era\" in how IBM deals with intellectual property, and the company has pledged to release more patents freely in the future. The patents include software for text recognition, database management, and other practices. IBM hopes this move will encourage collaboration and innovation, similar to academia. While some have criticized the move as insubstantial, others believe it could lead to more companies following suit and releasing their own patents into a \"patent commons.\"", "chatgpt-4o-latest": "IBM has announced the release of 500 software patents into the open development community, allowing developers to use them without licensing fees. This move marks a shift in IBM's intellectual property strategy, though the company continues to amass patents, having received more than any other firm in the US for 12 consecutive years. The released patents cover areas such as text recognition, database management, storage management, and networking. IBM aims to encourage innovation and collaboration, likening the initiative to the development of the internet. The company hopes other firms will follow suit in creating a \"patent commons.\" While some industry figures support the move, critics argue it is a minor gesture, as the patents represent only a small fraction of IBM's portfolio. IBM will retain ownership of the patents but will not seek royalties or impose restrictions on their use in open-source projects.", "stablelm2:1.6b": "IBM releases 3,000 software patents into an open development community, allowing developers to use technologies without paying for a license from the company. This move marks a new era in how it deals with intellectual property and further patents will be made freely available. IBM was granted more US patents than any other firm in the US over the past years and has received more US patents in that period than any other company. The company wants to encourage others to release patents into what it calls \"patent commons.\"", "granite3.1-dense:2b": "IBM has announced the release of 500 software patents into an open development community, enabling developers to use these technologies without payment. This move marks a new era for IBM in managing intellectual property, with the company pledging more patents will be made freely available. Despite granting 3,248 patents in 2004, the most by any U.S. firm, IBM maintains a traditional approach of accumulating patents. The released patents cover various practices, such as text recognition and database management. Dr. John E. Kelly, IBM's senior vice president for Technology and Intellectual Property, emphasized that innovation should benefit customers, partners, and society.\n\nIBM's world-wide Linux strategy manager, Adam Jollans, explained the goal as encouraging collaboration to speed up innovation, likening it to how the internet was developed. He believes this approach will allow everyone to benefit from the results of collaborative efforts. Stuart Cohen, chief executive of Open Source Development Labs, suggested IBM's action could signal a shift in how companies handle patents, but Florian Mueller, campaign manager for a group opposing software patent legalization in the EU, dismissed the move as insignificant, calling it diversionary tactics.\n\nThe released patents cover areas like storage management, simultaneous multiprocessing, image processing, networking, and e-commerce. IBM will retain ownership of these 500 patents but promises no royalties or restrictions on their use in open-source projects by developers, companies, groups, or individuals.", "reference": "For each of the past 12 years IBM has been granted more US patents than any other company.The company said it wanted to encourage other firms to release patents into what it called a \"patent commons\".Mr Jollans likened the plan for a patent commons to the way the internet was developed and said everyone could take advantage of the result of collaboration.IBM was granted 3,248 patents in 2004, more than any other firm in the US, the New York Times reports.IBM has received 25,772 US patents in that period and reportedly has more than 40,000 current patents.Computer giant IBM says 500 of its software patents will be released into the open development community.IBM will continue to hold the 500 patents but it has pledged to seek no royalties from the patents.In a statement, Dr John E. Kelly, IBM senior vice president, Technology and Intellectual Property, said: \"True innovation leadership is about more than just the numbers of patents granted.IBM described the step as a \"new era\" in how it dealt with intellectual property and promised further patents would be made freely available.Florian Mueller, campaign manager of a group lobbying toprevent software patents becoming legal in the European Union,dismissed IBM's move as insubstantial.Traditional technology business policy is to amass patents and despite IBM's announcement the company continues to follow this route.The patents include software for a range of practices, including text recognition and database management.In the past, IBM has supported the non-commercial operating system Linux although critics have said this was done only as an attempt to undermine Microsoft."}