{"raw_text": "Rings of steel combat net attacks\n \n Gambling is hugely popular, especially with tech-savvy criminals.\n \n Many extortionists are targeting net-based betting firms and threatening to cripple their websites with deluges of data unless a ransom is paid. But now deep defences are being put in place by some of the UK's biggest net firms to stop these attacks. Increasing numbers of attacks and the huge amounts of data being used to try to bump a site off the web are prompting firms to adopt the measures. \"Net firms are realising that it's not just about anti-virus and firewalls,\" said Paul King, chief security architect at Cisco. \"There are more things that can be done in the network to protect data centres.\" Mr King said the only way to properly combat these so-called Distributed Denial-of-Service attacks was with intelligent net-based systems. Many of the gambling sites suffering DDoS attacks are in offshore data and hosting centres, so any large scale data flood could knock out access to many more sites than just the one the criminals were targeting, said Mr King. This overspill effect was only likely to grow as attacks grow in size and scale.\n \n Malcolm Seagrave, security expert at Energis, said the most common types of attacks hit sites with 10 megabytes of data over short periods of time. Bigger attacks sending down 200 megabytes of traffic or more were rarely seen, he said. \"It does feel like they are turning the dial because you see this traffic gradually growing,\" he said.\n \n So far there have been no attacks involving gigabytes of data, said Mr Seagrave. However, he added that it was only a matter of time before such large attacks were mounted. Maria Capella, spokeswoman for net provider Pipex, said that when DDoS attacks were at their height, customers were getting hit every four to five days. The defences being put in place constantly monitor the streams of data flowing across networks and pluck out the traffic destined for target sites. \"It's about understanding what's genuine traffic and keeping attack traffic from going to the site,\" she said. \"We study the profile of their traffic and as soon as we see an anomaly in the profile that's when we start to get the backbone engineering boys to see if we are going to sustain an attack,\" said Ms Capella. This traffic can be hard to spot because DDoS attacks typically use thousands of computers in many different countries, each participating machine only sends a small part of the entire data flood.\n \n Typically these computers have been infected by a virus or worm which reports its success and the net address of compromised machines back to the malicious hacker or hi-tech criminal that set off the virus. Hijacked computers are known as zombies or 'bots and collections of them are called 'bot nets. Many spammers rent out 'bot nets to help them anonymously send junk mail.\n \n Most of the zombies are based outside the country that hosts the target site so getting the attacking PCs shut off can be difficult. Often Pipex and other net suppliers do get advance notice that an attack is about to happen. \"The serious players tend to precede an attack with some kind of ransom e-mail,\" said Ms Capella. \"We ask, as part of the service we provide, that customers notify us of anything they have in advance that would give us forewarning.\" Once an attack is spotted dedicated net hardware takes over to remove the attack traffic and ensure that sites stay up. Energis took a similar approach, said Mr Seagrave. \"We have technology out there that allows us to detect attacks in minutes rather than let network engineers spend hours pulling the information together,\" said Mr Seagrave. Also net firms were starting to work more closely together on the problem of DDoS attacks and pool information about where they are coming from. Information gathered on attacks and where they originated has led to some arrests. He said Energis also did its own intelligence work to get in insight into which sites criminal gangs plan to target. \"We have people in places where they shouldn't be, monitoring tech sites,\" he said. Sometimes though, he said, spotting the next victim was easy. \"You can see them going alphabetically through the list with the gambling sites, trying one after another,\" said Mr Seagrave.\n", "llama3.2:1b": "Rings of steel combat net attacks are becoming increasingly popular among criminals, particularly those who target online betting firms for ransom. To defend against these attacks, some UK's biggest net firms are implementing deep defences such as anti-virus and firewalls, but they are also adopting intelligent net-based systems that can detect distributed denial-of-service (DDoS) attacks in real-time.\n\nThe most common types of attacks are those with 10 megabytes of data over short periods of time, while bigger attacks sending down 200 megabytes or more were rarely seen. To combat these attacks, firms constantly monitor streams of data flowing across networks and remove traffic destined for target sites.\n\nDDoS attacks typically use thousands of computers in many different countries, each participating machine only sends a small part of the entire data flood, making it hard to spot. However, some companies are working together on the problem by pooling information about where they are coming from and gathering intelligence on attacks.\n\nThe major players in this field, such as Pipex and Energis, use advanced technology to detect attacks in minutes rather than hours, allowing them to quickly remove attack traffic and prevent sites from being taken down.", "llama3.2:3b": "UK net firms are implementing deep defences to stop Distributed Denial-of-Service attacks, targeting betting firms, by using intelligent net-based systems and monitoring traffic streams in real-time. The attacks typically use \"bot nets\" of infected computers sending small parts of large data floods, making them hard to spot. Firms like Pipex and Energis are pooling information and working together to detect and remove attack traffic, with some arrests made due to shared intelligence.", "gemma2:2b": "Gambling firms are increasingly targeted by DDoS attacks, which involve a deluge of data aimed at taking down websites.  These attacks are becoming more sophisticated and frequent, as seen in increases in attack size and scale. To combat this, cybersecurity firms are implementing advanced technologies like intelligent network systems to monitor and filter traffic while working closely with other firms to share intelligence on attack patterns and origins. These measures allow for quicker response times and often pre-emptive intervention to prevent attacks from fully succeeding. \n", "qwen2.5:0.5b": "### Summary:\n\nUK net firms are adopting sophisticated defensive measures to protect themselves from Distributed Denial-Of-Service (DDoS) attacks. Some of the biggest UK gambling sites have reported data breaches and dropped access to their sites due to DDoS attacks, prompting firms to increase defenses. Malcom Seagrave emphasized that current approaches don't effectively deal with massive DDoS campaigns. He noted that the current defences monitor data streams and detect anomalous traffic patterns but are slow and expensive. Energy Solutions, Energis, and Pipex have joined forces to develop a more efficient defense mechanism that can identify and mitigate these attacks more quickly.", "qwen2.5:1.5b": "Gambling firms are adopting deep network defenses against increasing DDoS attacks that target their offshore data centers and cause overspill effects on more sites. The most common types of attacks involve 10- to 200-megabyte traffic over short periods, with gigabytes being rare but likely in the future. Defenses monitor data streams for anomalies and shut off zombie computers used by criminals. Companies work together to share information about attack origins and arrests are made based on intelligence gathered.", "qwen2.5:3b": "Rings of steel combat net DDoS attacks targeting gambling firms. These attackers use massive data floods to cripple websites. UK firms are installing advanced security measures to defend against such threats. Many attacks involve 10-200 megabytes over short periods, with larger volumes possible. Defenses monitor network traffic and distinguish legitimate from malicious activity, often using 'bot nets' of infected computers. DDoS attackers usually provide early warning through ransom emails. As sizes grow, so too do the number of arrests made due to intelligence gathering on attacks and attacker profiles. Firms are also collaborating more closely to identify patterns and potential targets.", "opencoder:1.5b": "Gambling is hugely popular, especially with tech-savvy criminals. Increasing numbers of attacks and the huge amounts of data being used to try to bump a site off the web are prompting firms to adopt the measures. Deep defences are being put in place by some of the UK's biggest net firms to stop these attacks. \"Net firms are realising that it's not just about anti-virus and firewalls,\" said Paul King, chief security architect at Cisco. The most common types of attacks hit sites with 10 megabytes of data over short periods of time. Bigger attacks sending down 200 megabytes of traffic or more were rarely seen, he said.\n \nThis attack can be hard to spot because DDoS attacks typically use thousands of computers in many different countries, each participating machine only sends a small part of the entire data flood. Often Pipex and other net suppliers do get advance notice that an attack is about to happen. The serious players tend to precede an attack with some kind of ransom e-mail. Dedicated net hardware takes over to remove the attack traffic and ensure that sites stay up.\n", "smollm:1.7b": "The following summary is based on the text:\n\nSummarize the following text concisely, preserving key ideas and details.\n\nRings of steel combat net attacks\nGambling is hugely popular, especially with tech-savvy criminals.\nMany extortionists are targeting net-based betting firms and threatening to cripple their websites with deluges of data unless a ransom is paid. But now deep defences are being put in place by some of the UK's biggest net firms to stop these attacks. Increasing numbers of attacks and the huge amounts of data being used to try to bump a site off the web are prompting firms to adopt the measures. \"Net firms are realising that it's not just about anti-virus and firewalls,\" said Paul King, chief security architect at Cisco. \"There are more things that can be done in the network to protect data centres.\" Many of the gambling sites suffering DDoS attacks are in offshore data and hosting centres, so any large scale data flood could cripple them.\nMalcolm Seagrave, security expert at Energis, said the most common types of attacks hitting sites were 10 megabytes of data over short periods of time. \"It's about understanding what's genuine traffic and keeping attack traffic from going to the site,\" he said. \"We study the profile of their traffic and as soon as we see an anomaly in the traffic, we start getting alerts.\" Typically these computers are infected with a virus or worm which reports its success and the net address of compromised machines back to the malicious hackers that set off the attack. Most of the zombies are based outside the country that hosts the target site so getting the attacking PCs before they can do damage is crucial. Energis took a similar approach, said Mr Seagrave. \"We have technology out there that allows us to detect attacks in minutes rather than hours.\" Also net firms were starting to work more closely together on the problem of DDoS attacks and pooling information about where they are coming from.\nThe following summary is based on the text:\n\nSummarize the following text concisely, preserving key ideas and details.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about extortionists targeting net-based betting firms and how companies are responding. Hmm, let me read through it carefully.\n\nThe first part talks about rings of steel combat nets attacking steel structures or something? Wait, no, probably the steel in technology. Maybe they're talking about cyber warfare tactics using physical infrastructure. The key point is that these attacks use data, not just money or human resources. They target online betting sites, which are big and rely on internet transactions.\n\nThen it mentions that many extortionists are threatening to cripple sites with ransom if their attacks get too big. But now companies like Cisco are putting in place defenses against this by installing more security measures. So it's not just about preventing data corruption but also using smart technology for defense.\n\nMr. King says security isn't the only thing being done; there are other network aspects that can protect data centers, like better firewalls and monitoring. He even mentions cyber espionage, where attackers inject viruses or worms into systems to target them later.\n\nIn his opinion, most attacks don't require huge amounts of data—only a few megabytes over short periods. But larger attacks, sending big chunks of traffic, aren't seen very often. He also points out that these attacks can affect multiple sites once they cause a DDoS event because the data flood can hit several networks at once.\n\nMr. Seagrave notes that up to this point, no attack has used gigabytes of data, and while it's not clear if such attacks will happen soon, it seems inevitable. He suggests that attackers are now using thousands of machines from different countries, each contributing a small part of the total traffic.\n\nZombies or bot nets make up these cyber threats. They're based outside the target site, making it hard to stop. Mr. Capella says that when attacks peak, customers receive hits every four days, and they use specialized software to detect malicious traffic before it arrives at the target sites. She mentions that this data can be hard to spot because DDoS attacks use many machines sending small amounts of data.\n\nHe also talks about intelligence gathering—companies are setting up systems to monitor these attacks in real-time, using minutes to identify threats instead of hours of manual work by engineers. They're also working with other companies and individually conducting intelligence to figure out where the criminals plan to target next. He even mentions that sometimes the next victim is obvious alphabetically.\n\nOverall, it seems like companies are investing heavily in security measures but facing technical challenges in defending against massive DDoS attacks. The focus is on both physical defenses and smart data monitoring to protect against these cyber threats.\n</think>\n\nRings of steel combat nets target physical infrastructure for cyber warfare, attacking sites reliant on internet transactions. Extortionists target net-based betting firms using large amounts of data, threatening to cripple sites with ransom if their attacks grow large. However, most attackers send small chunks of traffic, rarely exceeding a few megabytes over short periods.\n\nTo counter these attacks, companies like Cisco have introduced advanced network security measures, including intelligent systems and cyber espionage via viruses or worms. They emphasize the importance of monitoring data streams to detect and mitigate threats, which can affect multiple networks during a DDoS event.\n\nMost cyber attacks involve less than gigabytes of data—small chunks over short periods. However, larger attacks, with significant traffic, are rare but could grow rapidly. These attackers often exploit thousands of machines from various countries, each contributing small parts of the total data flood.\n\nZombies or bot nets, based outside target sites, make it challenging to stop. They are often used by spammers for anonymous email distribution. To detect and block attacks, companies use specialized software to monitor traffic patterns and identify anomalies, which triggers measures to remove attack traffic and maintain site stability.\n\nSmart monitoring systems can detect attacks in minutes instead of hours, using advanced algorithms. Additionally, companies work with other firms on DDoS prevention and gather intelligence for targeting sites. Intensive intelligence programs, including monitoring tech sites, have led to some arrests. Despite the lack of widespread large-scale attacks, attackers now face complex technical challenges, highlighting a need for better network defense strategies.", "tinyllama:1.1b": "Rings of steel combat against extortioniest criminal activities are being implemented by net firms to prevent DDoS attacks. The biggest firm in this field is CiScO, who use intelligent systems to protect their data center sites from massive amounts of attack traffic. Despite the fact that there have been no attacks involving gigabytes of data so far, experts warn that it's only a matter of time before such large attacks are mounted. Many net firms and cybersecurity firms are adopting measures, including intelligent net-based systems, to protect data center sites against DDoS attacks. However, these attacks pose an increasing threat as they are becoming larger in size and scale. As the most common types of attacks hit sites with 10 megabytes of traffic or more, bigger attacks sending down 200 megabytes of data or more, are likely to grow in severity.", "tinydolphin:1.1b": " In the past few months, the number of attacks on web-based betting firms has been increasing dramatically. Tech-savvy criminals have been using various methods to disrupt these businesses' operations, leaving them vulnerable to extortion attempts.\n\nThe most common type of attack involves sending down 10 MB of data in short periods of time. A massive increase in such attacks has been observed in the offshore data and hosting centers used by many gambling sites, increasing the risk of a widespread DDoS attack.\n\nTo combat these attacks, several large net firms have adopted advanced defenses. One example is the use of intelligent net-based systems, which automatically detect and stop cyber criminals before they can cause significant damage to websites or servers. Another approach involves securing network connections between hosting companies and gambling sites using dedicated net hardware.\n\nDespite this tougher defense, attacks are still on the rise, prompting firms like Energis to invest in their security measures. This collaboration has led to some arrests and a growing understanding of where criminals are coming from. However, the increasingly sophisticated nature of these attacks is putting the world's largest net firms under increasing pressure to protect their sites effectively.", "phi:2.7b": " Net-based betting firms are under attack from criminals who use Distributed Denial of Service (DDoS) attacks to overwhelm their websites. To combat this, net companies are investing in intelligent systems that can detect and remove DDoS traffic. Attacks typically involve thousands of computers infected with malware, which send data flooding to the target site's servers. Net firms need to know about attacks in advance to take action. When an attack occurs, dedicated hardware takes over to filter out the traffic, while sharing information with other net companies helps prevent future attacks.\n", "orca-mini:3b": " Rings of steel combat net attacks by Gambling is hugely popular, especially with tech-savvy criminals. Many extortionists are targeting net-based betting firms and threatening to cripple their websites with deluges of data unless a ransom is paid. Deep defences are being put in place by some of the UK's biggest net firms to stop these attacks.", "hermes3:3b": "Defences against DDoS attacks for net betting firms are being implemented to combat data deluges targeting sites, as criminal extortionists use threats of attack to demand ransoms.", "stablelm-zephyr:3b": "Some big internet companies in the UK are protecting themselves from a type of attack called Distributed Denial-of-Service (DDoS) attacks, which can make their websites very slow or even shut them down completely. Gambling sites are particularly vulnerable to these attacks, as they often have lots of visitors and are located in places where the attackers are not physically present. To stop the attacks, the internet companies are using special systems that can identify suspicious traffic on their networks quickly. They also share information about the attacks with each other to help catch the people who are doing it.", "chatgpt-4o-latest": "Online gambling sites are increasingly targeted by extortionists using Distributed Denial-of-Service (DDoS) attacks, demanding ransoms to prevent website disruptions. UK internet firms are implementing advanced network defenses to counter these attacks, which are growing in scale. Experts highlight the need for intelligent, net-based systems to protect data centers, as attacks can impact multiple sites due to their offshore hosting. While most attacks involve moderate data volumes, larger-scale attacks are expected. Security measures include monitoring traffic patterns to detect anomalies and deploying dedicated hardware to filter attack traffic. Many attacks originate from hijacked computers, or \"bot nets,\" making it difficult to shut them down. Some firms receive ransom warnings before attacks, allowing preemptive action. Internet providers are collaborating to track attack sources, leading to arrests, and conducting intelligence work to anticipate future targets.", "stablelm2:1.6b": "Large-scale Distributed Denial-of-Service (DDoS) attacks are becoming more frequent and sophisticated in their ability to overwhelm websites with data traffic. Betting firms are among the primary targets, but DDoS defenses are being implemented by UK's largest net providers to defend against these types of attacks. To combat DDoS attacks, security experts suggest using intelligent network-based systems rather than just anti-virus and firewalls.\n\nOffshore gambling sites often suffer from DDoS attacks in data centers, leading to potential outages for many more websites. The overspill effect can grow as the scale of these attacks increases. Most DDoS attacks are short-term hits with small amounts of traffic over time, but larger attacks sending hundreds or thousands of megabytes of traffic are rarely seen.\n\nDDoS defenses monitor the data streams and identify legitimate traffic while filtering out attack traffic to target sites. However, DDoS attacks often use multiple infected computers in different countries, making it challenging to shut down attacking PCs.\n\nNet providers like Pipex and Cisco offer dedicated hardware to remove attack traffic once detected. Security experts are working on strengthening cooperation among net firms to pool information about the source of DDoS attacks.\n\nDDoS defenses have led to some arrests and helped capture criminals behind these types  of attacks. However, identifying potential victims remains challenging.", "granite3.1-dense:2b": "Net-based betting firms are increasingly targeted by Distributed Denial-of-Service (DDoS) attacks, where extortionists threaten to overwhelm websites with data unless a ransom is paid. This growing menace prompts UK's major internet companies to implement advanced defenses, going beyond traditional antivirus and firewall solutions. These intelligent network systems monitor and filter incoming traffic, identifying and redirecting malicious bot-generated data streams that originate from infected computers worldwide, known as \"zombies\" or \"bot nets.\"\n\nDDoS attacks typically involve thousands of compromised machines, each sending only a fraction of the total data flood. Attackers often send ransom notes before launching an assault to give targets time to notify their internet service providers (ISPs). With advance warnings, ISPs like Pipex and Energis employ dedicated hardware to intercept and neutralize attack traffic within minutes, maintaining site uptime.\n\nNet firms are also collaborating more closely to share information about DDoS attack sources, leading to arrests of criminal gangs planning attacks on gambling sites. Despite the growing trend in attack sizes, no major gigabyte-scale assaults have occurred yet. However, security experts predict such large-scale attacks are imminent due to the escalating nature and sophistication of these cyber threats.", "reference": "So far there have been no attacks involving gigabytes of data, said Mr Seagrave.Many of the gambling sites suffering DDoS attacks are in offshore data and hosting centres, so any large scale data flood could knock out access to many more sites than just the one the criminals were targeting, said Mr King.\"It's about understanding what's genuine traffic and keeping attack traffic from going to the site,\" she said.Malcolm Seagrave, security expert at Energis, said the most common types of attacks hit sites with 10 megabytes of data over short periods of time.Once an attack is spotted dedicated net hardware takes over to remove the attack traffic and ensure that sites stay up.Bigger attacks sending down 200 megabytes of traffic or more were rarely seen, he said.Maria Capella, spokeswoman for net provider Pipex, said that when DDoS attacks were at their height, customers were getting hit every four to five days.\"We have technology out there that allows us to detect attacks in minutes rather than let network engineers spend hours pulling the information together,\" said Mr Seagrave.Mr King said the only way to properly combat these so-called Distributed Denial-of-Service attacks was with intelligent net-based systems.\"The serious players tend to precede an attack with some kind of ransom e-mail,\" said Ms Capella.\"We study the profile of their traffic and as soon as we see an anomaly in the profile that's when we start to get the backbone engineering boys to see if we are going to sustain an attack,\" said Ms Capella.\"You can see them going alphabetically through the list with the gambling sites, trying one after another,\" said Mr Seagrave.This traffic can be hard to spot because DDoS attacks typically use thousands of computers in many different countries, each participating machine only sends a small part of the entire data flood.Also net firms were starting to work more closely together on the problem of DDoS attacks and pool information about where they are coming from."}