{"raw_text": "Windows worm travels with Tetris\n \n Users are being warned about a Windows virus that poses as the hugely popular Tetris game.\n \n The Cellery worm installs a playable version of the classic falling blocks game on PCs that it has infected. While users play the game, the worm spends its time using the machine to search for new victims to infect on nearby networks. The risk of infection by Cellery is thought to be very low as few copies of the worm have been found in the wild.\n \n The Cellery worm does not spread via e-mail like many other viruses. Instead it browses computer networks for PCs that have not shut off all the insecure ways they connect to other machines. When it infects a machine, Cellery installs a version of Tetris that users can play. As the game starts up the worm also starts a music file to accompany it. At the same time the virus starts scouring networks for other vulnerable machines. The virus does no damage to machines but heavily infected networks could slow down as scanning traffic builds. Productivity may suffer too if users spend time playing Tetris. PCs running Windows 95, 98, ME, NT, 2000, and XP could be vulnerable to the worm. \"If your company has a culture of allowing games to be played in the office, your staff may believe this is simply a new game that has been installed - rather than something that should cause concern,\" said Graham Cluley, spokesman for anti-virus firm Sophos. So far the number of people infected by Cellery is thought to be very small and the risks of further infection is very low. Sophos urged users and companies to update their anti-virus software to keep themselves protected.\n", "llama3.2:1b": "Windows worm infects PCs with Tetris, installs game on visitors while searching for new victims.\n\nThe worm spreads through insecure connections on networks, not via email.\n\nIt searches for vulnerable machines and installs Tetris, a music file, before starting the game.\n\nInfection can cause slow network scanning traffic but does no damage to individual machines.\n\nUsers are warned that some PCs running Windows 95-XP may be infected.", "llama3.2:3b": "A Windows virus called Cellery poses as Tetris, infecting PCs that haven't shut off insecure connections to other machines. Once infected, a playable version of Tetris appears, while the worm scans networks for vulnerable machines and plays music. The virus doesn't cause damage but can slow down heavily infected networks and productivity suffers if users play Tetris.", "gemma2:2b": "A Windows worm called Cellery disguises itself as a Tetris game. When activated, the worm infects PCs, plays Tetris, and searches for other vulnerable machines on nearby networks. It does not cause damage but can slow down computers and networks if infected. The risk of infection is currently low. \n", "qwen2.5:0.5b": "The Windows Game virus (Cellery) travels with the Tetris game, searching for vulnerable machines to infect with a version of Tetris. The risk of infection by Cellery is thought to be very low because few copies have been found in the wild. The worm installs a playable version of Tetris on infected PCs and starts browsing networks to find other vulnerable machines. It also starts a music file to accompany its play, but no damage is done to machines. A few people are said to have been infected by Cellery, with many users believing it is simply a new game that should not cause concern. The virus can be updated to keep the user and company protected.", "qwen2.5:1.5b": "A Windows virus called Cellery, which appears as Tetris on user PCs, installs a playable version of the game and searches for new targets on nearby networks while users are playing it. The risk is considered low due to few wild instances found so far, but infected networks could slow down and productivity may suffer.", "qwen2.5:3b": "Users are warned about a Windows worm named Cellery that disguises as Tetris game installation, infecting PCs via unsecured network connections. The worm installs playable Tetris on infected machines without causing damage but could slow down networks if it scans for more vulnerable devices. It does not spread through emails; instead, it targets open network ports. Infected users might mistakenly view it as a new install rather than a threat. Vulnerable operating systems include Windows 95, 98, ME, NT, 2000, and XP. Anti-virus software updates are recommended to protect against the low-risk infection.", "opencoder:1.5b": "Users are being warned about a Windows virus that poses as Tetris game. The Cellery worm installs a playable version of the classic falling blocks game on PCs that it has infected. Users play the game, the worm spends its time using the machine to search for new victims to infect on nearby networks. The risk of infection by Cellery is thought to be very low due to its minimal presence in wild. The virus does not spread via e-mail like many other viruses. Instead, it browses computer networks for PCs that have not shut down all the insecure ways they connect to other machines. When it infects a machine, Cellery installs a version of Tetris that users can play. As the game starts up, the worm also starts a music file to accompany it. At the same time, the virus does not cause any damage to machines but heavily infected networks could slow down as scanning traffic builds. Users may experience reduced productivity if they spend time playing Tetris. These systems are typically vulnerable to infection by Cellery, so the concern about this game being played in the office seems unnecessary or even malicious.\n", "smollm:1.7b": "The Windows worm travels with Tetris, posing as a popular game that can spread through networks. Users are warned about the risk of infection by Cellery, which installs a playable version of the game on infected PCs. The risk of infection is thought to be low as few copies of the virus have been found in the wild. The Cellery worm does not spread via e-mail like many other viruses and instead browses computer networks for vulnerable machines. When it infects a machine, Cellery installs a version of Tetris that users can play. As the game starts up, Cellery also installs a music file to accompany it. At the same time the virus starts scouring networks for other vulnerable machines. The Virus does no damage to machines but heavily infected networks could slow down as scanning traffic builds. Productivity may suffer too if users spend time playing Tetris. PCs running Windows 95, 98, ME, NT, 2000, and XP can be vulnerable to the Cellery worm. \"If your company has a culture of allowing games to be played in the office, your staff may believe this is simply a new game that has been installed - rather than something that should cause concern,\" said Graham Cluley, spokesman for anti-virus firm Sophos. So far the number of people infected by Cellery is thought to be very small and the risks of further infection are very low. Sophos urged users and companies to update their anti-virus software to keep themselves protected.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about a Windows worm that spreads like a virus similar to Tetris. The user wants only the summary in plain text without any explanations or formatting.\n\nFirst, I'll read through the entire text to understand the main points. \n\nThe text starts by warning users about a virus named Cellery which infects computers infected with Tetris. It mentions how Cellery uses PC games for gameplay but doesn't spread via email. Instead, it searches for new victims on nearby networks.\n\nI should note that while the worm is playable, it doesn't cause harm directly. It only infects machines and plays a Tetris game on them. There's also a music file being used along with the game, but since the worm doesn't cause any damage, the music shouldn't be an issue for those who aren't affected.\n\nThe text talks about how infected networks can slow down because of scanning traffic, which might affect productivity. The warning is from Graham Cluley, a spokesperson for Sophos, and mentions that only a few users have been infected so far. They advise updating anti-virus software.\n\nNow, I'll extract the key points: Cellery spreads through PC games without causing harm, doesn't spread via email; it infects computers during gameplay but doesn't cause issues. Infected networks slow down due to scanning traffic. Only a few users are infected; companies should update their software.\n\nI need to make sure the summary is concise and includes all these points without adding any extra information or explanations.\n</think>\n\nThe Windows worm Cellery spreads through PC games like Tetris, infecting machines during gameplay but not causing harm. It doesn't spread via email; it searches for new victims on networks. Infected networks slow down scanning traffic, affecting productivity. Only a few users are infected, and companies should update anti-virus software to protect against potential risks.", "tinyllama:1.1b": "Windows worm poses as popular TeTri game, spreading its spores on PCs by installing a playable version in the hopes of infecting nearby victims for spread. The virus does not spread via email like other viruses but rather visits unsecured computer networks for infected machines to start a music file to accompany them, causing scanning traffic to build up if left unchecked. Productivity may suffer for those spending too much time playing TeTri, as PCs running Windows 95, 98, ME, NT, 2000, and XP are susceptible. To prevent infection, users should update their anti-virus software to keep themselves protected.", "tinydolphin:1.1b": " A Windows worm known as \"Cellery\" poses a low risk of infection to most users infected through PC networks it has infected. The worm installs a playable version of Tetris on infected computers, which the virus does not spread via e-mail like many other viruses. Instead, Cellery browses network connections for unsafety-prone machines and infects them directly with its malware. The virus installs a version of Tetris that users can play, along with an accompanying music file to help the infected computers relax. However, these infected systems may be slowed down by the worm's scanning traffic, as it searches for other vulnerable machines to infect. Sophos recommends updating anti-virus software to keep users protected from the malware.", "phi:2.7b": " A Windows worm that looks like Tetris has been found on some PCs. It installs a version of Tetris to play while searching for more vulnerable machines on nearby networks. The risk of infection is thought to be low, but it could slow down infected networks and reduce productivity if people spend too much time playing. The virus can spread through insecure ways computers connect with each other, so users should update their anti-virus software.\n", "orca-mini:3b": " The Cellery worm is a type of virus that infects Windows machines while playing the popular Tetris game. It browses computer networks for infected machines, installs a playable version of Tetris, and starts a music file along with it. The worm also scans networks for other vulnerable machines. If a machine is heavily infected, the virus may slow down network traffic and cause productivity issues. Anti-virus software is recommended to prevent infection.", "hermes3:3b": "Tetris Windows worm spreads, posing as playable game on infected PCs.\nCellsery installs Tetris, searches networks for more vulnerable machines to infect.\nLow risk of infection due to few cases found in wild.", "stablelm-zephyr:3b": "A Windows virus called Cellery, posing as the popular Tetris game, spreads through infected PCs searching for vulnerable networks to infect. Although considered low risk due to its rarity in the wild, the worm browses computer networks for unsecured connections. Installing a playable version of Tetris and accompanying music file, it scans for other susceptible machines without causing damage. Anti-virus software updates are recommended to protect users from further infection.", "chatgpt-4o-latest": "A Windows virus called the Cellery worm disguises itself as the Tetris game. Once installed, it allows users to play Tetris while secretly scanning networks for vulnerable PCs to infect. Unlike email-spreading viruses, Cellery exploits insecure network connections. It does not damage systems but could slow down networks and reduce productivity. The worm affects Windows 95, 98, ME, NT, 2000, and XP. Security experts warn that workplaces allowing games may not recognize the threat. However, the risk of widespread infection is low, and users are advised to update their anti-virus software for protection.", "stablelm2:1.6b": "A Windows virus, similar to Tetris game, has been created to infect PCs via the popular falling blocks game called Cellery. This worm spreads by searching computer networks for vulnerable machines instead of e-mail like many other viruses. Once installed, Cellery installs a version of Tetris that users can play while it also searches nearby networks for more victims. The virus does no damage but could cause productivity issues and slow down network speeds if heavily infected. Windows versions ME, NT, 0, and XP are vulnerable to the worm. So far, the number of people infected is very small, with risks low. Companies should update their antivirus software to protect themselves from further infection.", "granite3.1-dense:2b": "A Windows virus, named Cellery, disguises itself as Tetris to infect PCs. Infected systems play a playable version of the classic game while the worm scans nearby networks for new victims on insecure connections. Low risk is attributed to few detected copies and vulnerabilities limited to older Windows versions (95, 98, ME, NT, 2000, XP). The worm does not spread via email; instead, it exploits unsecured network connections. Although harmless, productivity may suffer as users engage with the game. Sophos advises updating anti-virus software to prevent infection due to potential misidentification of the virus as a legitimate game by office staff.", "reference": "The Cellery worm installs a playable version of the classic falling blocks game on PCs that it has infected.While users play the game, the worm spends its time using the machine to search for new victims to infect on nearby networks.When it infects a machine, Cellery installs a version of Tetris that users can play.The risk of infection by Cellery is thought to be very low as few copies of the worm have been found in the wild.At the same time the virus starts scouring networks for other vulnerable machines.As the game starts up the worm also starts a music file to accompany it."}