{"raw_text": "World tour for top video gamers\n \n Two UK gamers are about to embark on a world tour as part of the most lucrative-ever global games tournament.\n \n Aaron Foster and David Treacy have won the right to take part in a tournament offering $1m in total prize money. The cash will be handed out over 10 separate competitions in a continent-hopping contest organised by the Cyberathlete Professional League. As part of their prize the pair will have their travel costs paid to ensure they can get to the different bouts.\n \n The CPL World Tour kicks off in mid-February and the first leg will be in Istanbul. All ten bouts of the tournament will be played throughout 2005, each one in a different country. At each stop $50,000 in prize money will be up for grabs. The tournament champion for each leg of the CPL World Tour will walk away with a $15,000 prize. The winner of the grand final will get a prize purse of $150,000 from a total pot of $500,000.\n \n Winners of each stage of the tour automatically get a place at the next stop. The world tour stops are open to any keen gamer that registers. Online registration for the first stop opens this weekend. Some pro-players are winning a spot at the tour destinations through qualifying events organised by CPL partners. Winners at these qualifiers get seeded higher in the elimination parts of each tournament. Mr Foster and Mr Treacy get the chance to attend the World Tour as members of the UK's Four-Kings gaming clan. Towards the end of 2004 Four-Kings staged a series of online Painkiller competitions to reveal the UK's top players of the PC game. The best eight players met face-to-face in a special elimination event in late December where Mr Foster and Mr Tracey proved their prowess at Painkiller. As part of their prize the pair also get a contract with Four-Kings Intel which is one of the UK's few pro-gaming teams. \"There are a lot of people who take gaming very seriously and support their local or national team with the same passion as any other sport,\" said Simon Bysshe who filmed the event for Four-Kings and Intel. More than 80,000 people have downloaded the movie of the tournament highlights. \"Professional gaming is here to stay and will only grow in popularity,\" he said.\n", "llama3.2:1b": "Aaron Foster and David Treacy are participating in a £1m world tour as part of the Cyberathlete Professional League's CPL World Tour. The tour consists of 10 separate competitions, each taking place in a different country, with $50,000 prize money up for grabs at each stop. Winners from each stage automatically get a spot at the next stop and can earn higher seeding and a contract with Four-Kings Intel through online registration.", "llama3.2:3b": "UK gamers Aaron Foster and David Treacy are embarking on a world tour as part of the Cyberathlete Professional League's $1m tournament, with travel costs covered. The 10-leg tournament kicks off in mid-February, with each leg offering $50,000 in prize money, culminating in a grand final worth $150,000. Winners of each stage automatically qualify for the next stop and have access to online registration.", "gemma2:2b": "Two UK gamers, Aaron Foster and David Treacy, won a spot on the CPL World Tour, a $1 million global games tournament with travel expenses covered.  The tour spans ten stages in 2005, each offering $50,000 in prize money for winners of each leg. The final winner takes home $150,000 from a $500,000 total prize pool. Winners advance to the next stage automatically and online registration opens this weekend.  Four-Kings, a UK gaming team, selected Foster and Treacy after successful online Painkiller competitions, granting them a contract with Four-Kings Intel. \n", "qwen2.5:0.5b": "Top video gamers are about to embark on a world tour as part of the most lucrative-ever global games tournament. Aaron Foster and David Treacy have won right to take part in a tournament offering $1m in total prize money. The cash will be handed out over 10 separate competitions in a continent-hopping contest organised by the Cyberathlete Professional League. Winners automatically get spots at next stops and are also eligible to attend Four-Kings gaming clan.", "qwen2.5:1.5b": "Two UK gamers win $1m world tour prize; part of largest-ever global games competition; they travel across continents via pro-gamers' contracts, competing for $500k pot over 10 stops in 2005.", "qwen2.5:3b": "Two UK gamers Aaron Foster and David Treacy are participating in a $1m global video games tournament organized by the Cyberathlete Professional League. They will travel to different countries for 10 competitions, with each leg offering $50,000 in prize money. The winner of each leg gets $15,000, and the grand final champion receives $150,000 from a total pot of $500,000. Foster and Treacy won their spots through online qualifications organized by CPL partners. As part of their prize, they also get a contract with Four-Kings Intel, which is one of the UK's few pro-gaming teams.", "opencoder:1.5b": "\"World tour for top video gamers\"\n\nTwo UK gamers are about to embark on a world tour as part of the most lucrative-ever global games tournament.\n\nAaron Foster and David Treacy have won the right to take part in a tournament offering $1m in total prize money.\n\nThe CPL World Tour kicks off in mid-February and the first leg will be in Istanbul. All ten bouts of the tournament will be played throughout 2005, each one in a different country. At each stop $50,000 in prize money will be up for grabs.\n\nThe winner of the grand final will get a prize purse of $150,000 from a total pot of $500,000.\n\nWinners of each stage of the tour automatically get a place at the next stop.\n\nStages at the World Tour are open to any keen gamer that registers. Online registration for the first stop opens this weekend. Some pro-players are winning a spot at the tour destinations through qualifying events organised by CPL partners.\n\nFour-Kings staged a series of online Painkiller competitions to reveal the UK's top players of the PC game.\n\nA special elimination event in late December where Mr Foster and Mr Tracey proved their prowess at Painkiller. As part of their prize, they get a contract with Four-Kings Intel which is one of the UK’s few pro-gaming teams.\n\nThe movie of the tournament highlights were \"Professional gaming is here to stay and will only grow in popularity.\"\n", "smollm:1.7b": "The summary should be:\nTwo UK gamers are about to embark on a world tour as part of the most lucrative-ever global games tournament. The cash will be handed out over 10 separate competitions in a continent-hopping contest organized by the Cyberathlete Professional League. As part of their prize the pair will have their travel costs paid to ensure they can get to the different bouts. The CPL World Tour kicks off in mid-February and the first leg will be in Istanbul. All ten bouts of the tournament will be played throughout 2005, each one in a different country. At each stop $50,000 in prize money will be up for grabs. The winner of the grand final will get a prize purse of $150,000 from a total pot of $500,000. The winner of the world tour automatically gets a place at the next stop. Winners of each stage of the tour automatically get a place at the next stop. The world tour stops are open to any keen gamer that registers. Online registration for the first stop opens this weekend. Some pro-players are winning a spot at the tour destinations through qualifying events organized by CPL partners. Winners at these qualifiers get seeded higher in the elimination parts of each tournament. Mr Foster and Mr Tracey get the chance to attend the World Tour as members of the UK's Four-Kings gaming clan. Towards the end of 2004, Four-Kings staged a series of online Painkiller competitions to reveal the UK's top players of the PC game. The best eight players met face-to-face in a special elimination event in late December where Mr Foster and Mr Tracey proved their prowess at Painkiller. As part of their prize the pair also get a contract with Four-Kings Intel which is one of the UK's few pro-gaming teams. \"There are a lot of people who take gaming very seriously and support their local or national team with the same passion as any other sport,\" said Simon Bysshe who filmed the event for Four-Kings and Intel. More than 80,000 people have downloaded the movie of the tournament highlights. \"Professional gaming is here to stay and will only grow in popularity,\" he said.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Aaron Foster and David Treacy's tour. Let me read through it carefully.\n\nThe main points are that they're part of a global video game contest called the Cyberathlete Professional League World Tour (CPL) 2005. They won $1 million in prize money split over ten competitions, each in different countries. Travel costs cover their expenses too, so they don't have to worry about moving.\n\nEach stage gives away $50k plus a $15k grand prize winner. The grand prize is $150k from a $500k pot. They'll be joining four-Kings, and there are spots open for gamers. registration is online now, especially for Istanbul in February.\n\nSome top players qualify through competitions by December 2004. Winners get better placement in the tournament. Mr. Foster and Treacy join as members of the UK's Four-Kings clan. Their achievements include a big event last December where they won with $15,000, which was good for them.\n\nI need to make sure all key details are included: prize money, travel covered, competition structure, main team, registration info, and their join as a team.\n</think>\n\nAaron Foster and David Treacy will participate in the Cyberathlete Professional League World Tour 2005, winning $1 million in total prize money distributed over ten regional events. Travel costs are fully covered to ensure they can attend each event. Each stage awards $50k plus a $15k grand prize winner, with the grand final winner receiving $150k from a $500k pot. They will join Four-Kings gaming and their team as members of the UK's Four-Kings clans. registration for the first stop is now available online this weekend. Top players qualify through competitions in December 2004, with winners seeded higher in elimination rounds. Mr. Foster and Treacy will join as members of Four-Kings, and they won a regional event last December.", "tinyllama:1.1b": "Nel mese di febbraio ebbe inizio un tour mondiale con una somma di $1m di premi da assegnare a vincitori di ogni leg, tenendo a fianco $50,000 di premi ad entrambi gli eventi. L'evento era organizzato dall'Alleanza Professionale Giochi Liberi (CPL) e non si sarebbero disputati le stagioni 2004 ed il 2005, a causa della pandemia mondiale di COVID-19. Questi due gamers statunitensi erano stati selezionati per la prima leg del World Tour come vincitori della competizione online Four-Kings. Tutti gli altri giocatori che hanno partecipato ai qualificatori e sono stati convocati alla World Tour sono stati dichiarati campioni di un determinato Painkiller evento. La squadra di Intel, la quale era la sola pro-gaming squadra nazionale e non ha alcun costruttore, ha pagato $150,000 in premi per il suo giocatore. Questo World Tour è stato organizzato dall'Alleanza Professionale Giochi Liberi (CPL) e non si sarebbero disputati le stagioni 2004 ed il 2005, a causa della pandemia mondiale di COVID-19.", "tinydolphin:1.1b": " The top video gamers from the UK will embark on a world tour as part of the most lucrative-ever global games tournament. Two renowned players, Aaron Foster and David Treacy, have won the right to participate in this exclusive event, which promises $1 million in prize money across 10 separate competitions. The CPL World Tour will begin in mid-February with its first leg taking place in Istanbul, Turkey. Each stop on the tour will host $50,000 worth of prize money. In addition to enjoying the excitement of gaming competition, players will also benefit from winning the guaranteed $15,000 prize for each leg of the tournament. The winner of each stage automatically earns a spot at the next stop, and qualifying events will also be held for online gamers to secure spots in the elimination part of the tour.", "phi:2.7b": " Two UK gamers, Aaron Foster and David Treacy, are participating in a world tour as part of the most lucrative-ever global games tournament called Cyberathlete Professional League (CPL World Tour). The tour has 10 stops throughout Africa, Asia, and Europe with $1 million total prize money. Each stage offers $50,000 in prize money, and the champion for each leg gets $15,000. Winners of each stage automatically get a place at the next stop, and online registration is open to any serious gamer who registers. Some gamers can qualify by winning a spot through qualifying events organised by CPL partners, which increases their seeded chances in each tournament. The UK's Four-Kings gaming clan won a contract with Four-Kings Intel as part of their prize. More than 80,000 people have downloaded the movie of the event highlights. Professional gaming is becoming increasingly popular and will continue to grow in popularity.\n", "orca-mini:3b": " Two UK gamers are set to embark on a world tour as part of the most lucrative-ever global games tournament offering $1m in total prize money. Aaron Foster and David Treacy have won the right to take part in the tournament, which will be held over 10 separate competitions in a continent-hopping contest organized by the Cyberathlete Professional League. The CPL World Tour starts in mid-February and the first leg will be in Istanbul. Each leg will offer $50,000 in prize money, with the winner of the grand final getting a prize purse of $150,000 from a total pot of $500,000.", "hermes3:3b": "Video gamers Aaron Foster, David Treacy win world tour for $1m tournament, attending as UK's top Painkiller players.", "stablelm-zephyr:3b": "Two UK gamers, Aaron Foster and David Treacy, will participate in the Cyberathlete Professional League's (CPL) World Tour, which offers $1 million in total prize money across 10 competitions held in various countries between February and May 2005. Winners of each leg automatically qualify for the next stop, with the grand final featuring a winner-takes-all $150,000 prize from a $500,000 pot. As members of the UK's Four-Kings gaming clan, they secured their spots through online Painkiller competitions and have also been awarded contracts with Four-Kings Intel.", "chatgpt-4o-latest": "UK gamers Aaron Foster and David Treacy will compete in the Cyberathlete Professional League (CPL) World Tour, a global gaming tournament with a $1 million prize pool. The tour spans ten international competitions in 2005, starting in Istanbul, with each stop offering $50,000 in prizes. Winners of each stage qualify for the next, culminating in a grand final with a $150,000 top prize. Foster and Treacy earned their spots through the UK's Four-Kings gaming clan after excelling in Painkiller competitions. As part of their prize, they receive travel expenses and a contract with Four-Kings Intel, a professional gaming team. The event highlights the growing popularity of professional gaming.", "stablelm2:1.6b": "Two UK gamers, Aaron Foster and David Treacy, are set to embark on a world tour consisting of ten games tournaments organized by the Cyberathlete Professional League (CPL). The CPL World Tour features $1 million in total prize money across 5 continents, with the first leg starting in mid-February. At each stop, $100,0..\nThe world tour is open to all keen gamers and winners of each stage automatically qualify for the next stop. Pro-players win a spot through qualifying events organized by CPL partners. The UK's Four-Kings gaming clan has previously sponsored Foster and Treacy, giving them access as members. In addition to their prize, Foster and Treacy also receive an Intel contract from Four- Kings.", "granite3.1-dense:2b": "Two British gamers, Aaron Foster and David Treacy, are participating in a $1 million, continent-spanning video game tournament called the CPL World Tour, organized by the Cyberathlete Professional League. The tour consists of ten separate competitions held in different countries throughout 2005, with each leg offering $50,000 in prize money, and the grand final awarding $150,000 from a total pot of $500,000. Foster and Treacy, representing the UK's Four-Kings gaming clan, secured their spots by winning an online Painkiller competition staged by Four-Kings in late December 2004. As part of their participation, they receive travel expenses covered, a contract with Four-Kings Intel, and the opportunity to be part of the prestigious tour. The event has gained significant online traction, with over 80,000 downloads of the tournament highlights video.", "reference": "The tournament champion for each leg of the CPL World Tour will walk away with a $15,000 prize.Mr Foster and Mr Treacy get the chance to attend the World Tour as members of the UK's Four-Kings gaming clan.As part of their prize the pair also get a contract with Four-Kings Intel which is one of the UK's few pro-gaming teams.Two UK gamers are about to embark on a world tour as part of the most lucrative-ever global games tournament.Aaron Foster and David Treacy have won the right to take part in a tournament offering $1m in total prize money.The world tour stops are open to any keen gamer that registers.Winners of each stage of the tour automatically get a place at the next stop.Winners at these qualifiers get seeded higher in the elimination parts of each tournament.As part of their prize the pair will have their travel costs paid to ensure they can get to the different bouts."}