{"raw_text": "Tech helps disabled speed demons\n \n An organisation has been launched to encourage disabled people to get involved in all aspects of motorsport, which is now increasingly possible thanks to technological innovations.\n \n The Motorsport Endeavour Club left the starting grid yesterday at the Autosport International 2005 show at Birmingham's NEC, with several technologies to adapt vehicles on display.\n \n Motorcycle racer, Roy Tansley, from Derby developed his electronic sequential gear changer following an accident which resulted in part of his left leg being amputated. \"I needed to find a way of changing gear and generally you do that with your left leg,\" Mr Tansley told the BBC News website. \"In simple terms, I needed to invent a left foot - initially it was quite a Heath Robinson device.\" Mr Tansley had to argue his case to be allowed to continue competing with motorcycle racing's governing body, the Autocycle Union. \"At that time they wouldn't let any amputee race at all, but eventually they told me I could have a licence as long as I raced sidecars.\" Mr Tansley's invention, the Pro-Shift, is designed to work with Hewland gearboxes which are widely used in motorcycle racing. In addition to helping disabled riders to compete, Mr Tansley reckons that the Pro-Shift saves at least 20 seconds per lap when he competes in the Isle of Man TT. As a result, there has been considerable interest in the product from other riders keen to improve their performance. \"I'm not prejudiced, I'll sell to able-bodied people if I have to!\" he joked.\n \n Another exhibit on the Motorsport Endeavour stand is a Subaru Impreza rally car, adapted to accommodate a variety of disabilities. The vehicle belongs to ParaRallying, the world's only rally school for disabled drivers which is based in Lincolnshire.\n \n \"We use the latest technology supplied by an Italian company,\" said rally driver Dave Hawkins who runs the company. \"The cars have electronic throttles, electronic brakes, electronic clutches - we've yet to turn anybody away.\" Mr Hawkins - a paraplegic himself - says his customers have included right or left arm amputees, quadriplegics, people who have had strokes and a woman who had had all four limbs amputated. ParaRallying uses a Vauxhall Astra GSI with an automatic gearbox and manual Subaru Imprezas. The car on display is fitted with a 'duck clutch' - a switch on the gear stick used instead of the clutch pedal. It also has a second ring behind the steering wheel to operate the throttle and a hand operated brake bar.\n \n When Joy Rainey started competing in motorsport in 1974 she was continuing the family tradition - her father, Murray, is a former Australian Formula 3 champion.\n \n And it was Rainey Senior who modified a sports racer to accommodate his daughter's small stature so that she could take part in hill climbs. She uses an ordinary road car by putting extensions on the pedals, a cushion behind her back and raising the seat. \"But in a competition car you have to have everything right or you'll lose the balance of the car,\" she said. \"I bring everything back to me - steering wheel, steering column, gear lever and pedals.\" When she recently took part in the London to Sydney Marathon she shared the driving with her partner, Trevor, who now does the engineering work. He designed a system for their Morris Minor so that the adaptations could be totally removed in under a minute. The Motorsport Endeavour Club is hoping that putting such technologies on display will result in more disabled people becoming involved in all areas of the sport and at every level.\n", "llama3.2:1b": "A motorsport club has launched to encourage disabled people to get involved in racing, with technological innovations available to adapt vehicles. Motorcycle racer Roy Tansley developed an electronic sequential gear changer after a leg was amputated. The Pro-Shift is designed for use with Hewland gearboxes and can save up to 20 seconds per lap. A Subaru Impreza rally car at ParaRallying, the world's only rally school for disabled drivers, has been adapted to accommodate various disabilities.", "llama3.2:3b": "A new organisation, the Motorsport Endeavour Club, has been launched to encourage disabled people to participate in motorsports. Several technological innovations are being showcased, including an electronic sequential gear changer developed by motorcycle racer Roy Tansley after a leg amputation. The club also features adapted vehicles, such as a Subaru Impreza rally car that accommodates various disabilities. Other examples include Joy Rainey's modifications to her sports racer for smaller drivers and a system designed for her Morris Minor, which can be adjusted in under a minute.", "gemma2:2b": "An organization launched to promote participation of disabled individuals in motorsports by using technological innovations. Examples include an adapted motorcycle with an electronic gear changer, a rally car for disabled drivers with electronic controls, and modified cars for hill climbs. The technologies aim to help disabled racers compete on equal footing.  The organization aims to increase involvement across all levels of motorsport through such advancements. \n", "qwen2.5:0.5b": "Motorcycle racer Roy Tansley from Derby, who amputated his left leg, has developed an electronic sequential gear changer to make motorcycle racing more accessible for amputees. The technology allows him to change gears as he moves sidecars on motorcycles, potentially saving 20 seconds per lap compared to those competing in the Isle of Man TT. Another exhibit at the Motorsport Endeavour Club is a Subaru Impreza rally car adapted for disabled drivers like Dave Hawkins, who runs a ParaRallying rally school based in Lincolnshire. The car's electronic clutch and modifications are designed to accommodate a variety of disabilities, including those with smaller limbs, quadriplegia, strokes, and someone with all four limbs amputated.", "qwen2.5:1.5b": "The Motorsport Endeavour Club promotes integration of disabled individuals into motorsports through technological innovations, offering solutions like electronic gearboxes and adaptive vehicles for riders with various disabilities. The initiative aims to increase participation and performance among the disabled, drawing interest from able-bodied drivers as well.", "qwen2.5:3b": "Tech helps disabled speed demons\n\nAn organisation launched to encourage disabled participation in motorsports, now possible with technological innovations. Technologies like Roy Tansley's Pro-Shift electronic gear changer for amputees demonstrate how innovations aid competition. Another exhibit showcases a Subaru Impreza modified for various disabilities by ParaRallying, Lincolnshire-based school of disabled drivers. Joy Rainey uses adapted ordinary road cars, while the Motorsport Endeavour Club aims to showcase such technologies to increase involvement and participation among disabled individuals across all levels of motorsports.", "opencoder:1.5b": "Tech has helped disabled speed demons\n\nAn organisation has been launched to encourage disabled people to get involved in motorsport, which is now increasingly possible thanks to technological innovations.\n\nThe Motorsport Endeavour Club left the starting grid yesterday at the Autosport International 2005 show at Birmingham's NEC, with several technologies to adapt vehicles on display. \n\nMotorcycle racer, Roy Tansley, from Derby developed his electronic sequential gear changer following an accident which resulted in part of his left leg being amputated. \"I needed to find a way of changing gear and generally you do that with your left leg,\" Mr Tansley told the BBC News website. \"In simple terms, I needed to invent a left foot - initially it was quite a Heath Robinson device.\" Mr Tansley had to argue his case to be allowed to continue competing with motorcycle racing's governing body, the Autocycle Union. \n\n\"The At that time they wouldn't let any amputee race at all, but eventually they told me I could have a licence as long as I raced sidecars.\" Mr Tansley's invention, the Pro-Shift, is designed to work with Hewland gearboxes which are widely used in motorcycle racing. In addition to helping disabled riders to compete, Mr Tansley reckons that the Pro-Shift saves at least 20 seconds per lap when he competes in the Isle of Man TT. As a result, there has been considerable interest in the product from other riders keen to improve their performance.\n\nAnother exhibit on the Motorsport Endeavour stand is a Subaru Impreza rally car, adapted to accommodate a variety of disabilities. The vehicle belongs to ParaRallying, the world's only rally school for disabled drivers which is based in Lincolnshire.\n\n\"Dave Hawkins said he was going to share this experience with his customers having right or left arm amputees, quadriplegics, people who have had strokes and a woman who had had all four limbs amputated. ParaRallying uses a Vauxhall Astra GSI with an automatic gearbox and manual Subaru Imprezas. The cars on display are fitted with a 'duck clutch' - a switch on the gear stick used instead of the clutch pedal.\" Mr Hawkins - a paraplegic himself - says his customers have included right or left arm amputees, quadriplegics, people who have had strokes and a woman who had had all four limbs amputated. ParaRallying uses a Vauxhall Astra GSI with an automatic gearbox and manual Subaru Imprezas.\n\nWhen Joy Rainey started competing in motorsport in 1974 she was continuing the family tradition - her father, Murray, is a former Australian Formula 3 champion. \n\nAnd it was Rainey Senior who modified a sports racer to accommodate his daughter's small stature so that she could take part in hill climbs. She uses an ordinary road car by putting extensions on the pedals, a cushion behind her back and raising the seat. \"But in a competition car you have to have everything right or you'll lose the balance of the car,\" she said. \"I bring everything back to me - steering wheel, steering column, gear lever and pedals.\" When she recently took part in the London to Sydney Marathon she shared the driving with her partner, Trevor, who now does the engineering work. He designed a system for their Morris Minor so that the adaptations could be totally removed in under a minute. The Motorsport Endeavour Club is hoping that putting such technologies on display will result in more disabled people becoming involved in all areas of the sport and at every level.\n", "smollm:1.7b": "The summary should preserve key ideas, details, and relationships between them. Here's how you can do it:\n\n1. Identify the main idea: The text describes an organization that helps disabled people to get involved in motorsport, which is becoming more accessible due to technological innovations.\n2. Note the key terms: Motorsport Endeavour Club, ParaRallying, Subaru Impreza, Joy Rainey, and Hill climbs are important keywords related to the text.\n3. Identify the relationships between ideas: The organization helps disabled people participate in motorsport by providing adaptive technology, while ParaRallying modifies cars for accessibility. Joy Rainey's modifications allow her to compete at hill climbs. These relationships highlight how technological innovations can make motorsport more accessible to people with disabilities.\n4. Focus on the main idea: The summary should emphasize the organization's efforts to increase accessibility in motorsport, highlighting the key terms and relationships between them.\n5. Use concise language: Avoid using technical jargon or overly complex sentences that might confuse readers. Instead, use simple and clear language to convey the main ideas.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help the user summarize this text concisely while preserving key ideas and details. Let me read through the provided text carefully.\n\nFirst paragraph: It talks about an organization encouraging disabled people in motorsport. The Motorsport Endeavour Club is moving around Birmingham's NEC with various technologies on display, including a Pro-Shift motorcycle drivetrain developed by Roy Tansley from Derby. He needed to amputate his leg and found a way to change gear. His invention saves 20 seconds per lap.\n\nSecond paragraph: Another exhibit is the Subaru Impreza rally car used by ParaRallying, a disabled rally school in Lincolnshire. They use advanced tech with a duck clutch switch for the gear stick and an optional brake bar.\n\nThird paragraph: Joy Rainey started racing, her father was a Formula 3 champion, and her daughter modified a road bike to compete in hill climbs.\n\nFourth paragraph: The Motorsport Club is hoping these technologies will attract more disabled people into motorsport everywhere. There's mention of other schools like the Isle of Man TT.\n\nI should extract the main points without getting too detailed. Maybe include how the club supports disabled riders, introduce the Pro-Shift and the Subaru Impreza rally car, and talk about Joy Rainey's heritage.\n\nLet me structure this into a concise summary that includes each key element: the club's impact, Tansley's invention, ParaRallying's approach, Joy's background, and their aim to engage disabled athletes.\n</think>\n\nThe Motorsport Endeavour Club has launched an organization encouraging disabled people in motorsport. They've moved to Birmingham with various tech adapted vehicles, including a Pro-Shift drivetrain by Roy Tansley from Derby. Tansley developed the Pro-Shift for amputees and saved 20 seconds per lap on track. Another exhibit is a Subaru Impreza rally car by ParaRallying, a disabled rally school in Lincolnshire, using advanced tech like a duck clutch switch. Joy Rainey started motor racing as a family tradition, her father being a Formula 3 champion, and she modified a road car for hill climbs. The Motorsport Club aims to attract more disabled athletes through inclusive initiatives.", "tinyllama:1.1b": "The text describes various technological innovations, including Motor Sport Endavoir Club's Motorprix Endeavour Climate Ride vehicle, ParaRallying's adapted Subaru Imprecas for disabled drivers, and Joy Rainey's modified sports racecar to accommodate her small stature. The article also highlights the ParaRallying training program that adapts vehicles for disabled driving, as well as Joy Rainey and her husband Trevor's engineering work for the Morris Minor to achieve an instant removal of modifications. The Motor Sport Endavoir Club hopes to promote more disabled involvement in motor sport and at all levels by showcasing these technologies on display during the AutoSport International 2005 show held at Birmingham's NEC.", "tinydolphin:1.1b": " Tech helps disabled people become involved in motorsport, encouraging them to participate in various aspects of this exciting and competitive field. The club offers support and resources for those who wish to get involved, from adaptive equipment like electronic gear shifting systems to educational programs on the science behind racing. These initiatives aim to empower disabled individuals and facilitate their participation in motorsport events, races, and championships.", "phi:2.7b": " Technology innovations have allowed for disabled individuals to participate in motorsport, as showcased by the Motorsport Endeavour Club's demonstration of adaptive vehicles at Autosport International. One example is a motorcycle racer named Roy Tansley, who developed an electronic sequential gear changer after losing part of his left leg in an accident. The Pro-Shift device he created allowed him to continue racing with the help of a wheelchair. Another exhibit on display was a Subaru rally car that had been adapted to accommodate various disabilities. ParaRallying, a rally school for disabled drivers, uses the latest technology supplied by Italian company Auto Sportit to make their vehicles accessible. Joy Rainey, who competed in motorsport since 1974 and modified her father's sports racer to accommodate her small stature, also spoke about her experience and how important it is to have all aspects of a competition car designed with balance and adaptability in mind. The Motorsport Endeavour Club hopes that by showcasing these adaptive technologies at the Autosport International show, more disabled individuals will be encouraged to participate in motorsport at every level.\n", "orca-mini:3b": " Tech helps disabled speed demons compete and improve performance. A company has launched an initiative to encourage disabled people to participate in motorsport, which is now possible due to technological innovations. An Italian company supplies the latest technologies for adapting vehicles to enable disabled riders to compete. Roy Tansley, a motorcycle racer, developed his electronic sequential gear changer after an accident left him with part of his left leg amputated. He invented the Pro-Shift to work with Hewland gearboxes, which are widely used in motorcycle racing. The exhibit features a Subaru Impreza rally car adapted for various disabilities. Joy Rainey started competing in motorsport in 1974 and modified a sports racer to accommodate her small stature for hill climbs. She now uses an ordinary road car with extensions on the pedals, a cushion behind her back, and raises the seat. The Motorsport Endeavour Club promotes disability inclusion in motorsport by displaying technologies for adapting vehicles.", "hermes3:3b": "Tech enables disabled participation in motorsports through adapted vehicles and innovations like left-foot gear shifters, electric controls for various disabilities, and customised racing cars.", "stablelm-zephyr:3b": "A new organization, Motorsport Endeavour Club, has been launched to help disabled individuals participate in motorsports using technology innovations. At the Autosport International 2005 show, several adaptations were on display, such as Roy Tansley's electronic sequential gear changer and a Subaru Impreza rally car adapted for ParaRallying, a world-wide rally school for disabled drivers. These advancements aim to encourage more disabled individuals to become involved in the sport at every level.", "chatgpt-4o-latest": "An organisation, the Motorsport Endeavour Club, has been launched to encourage disabled people to participate in motorsport, aided by technological advancements. At the Autosport International 2005 show, various adaptive technologies were showcased. Motorcycle racer Roy Tansley developed the Pro-Shift, an electronic sequential gear changer, after losing part of his left leg, allowing him to continue competing and improving lap times. His invention has attracted interest from both disabled and able-bodied racers. ParaRallying, a rally school for disabled drivers, displayed a modified Subaru Impreza with advanced electronic controls, enabling people with various disabilities to drive. Founder Dave Hawkins, a paraplegic, has trained drivers with diverse impairments. Additionally, Joy Rainey, a motorsport competitor since 1974, has used custom modifications to accommodate her small stature, including removable adaptations for her Morris Minor. The Motorsport Endeavour Club aims to inspire more disabled individuals to engage in motorsport at all levels.", "stablelm2:1.6b": "A new organization, Motorsport Endeavour Club, promotes motorsports for disabled people using technological innovations to adapt vehicles. Roy Tansley developed a gear changer device following an accident that left him needing a prosthetic leg. The Pro-Shift, designed with Hewland gearboxes, can save at least 1/2 second per lap in the Isle of Man TT races, and there has been interest from other riders. ParaRallying offers Subaru Impreza rally cars adapted for various disabilities, which include amputees, stroke survivors, quadriplegics, and people with all limbs amputated. The Motorsport Endeavour Club aims to increase involvement in motorsports at every level for disabled individuals.", "granite3.1-dense:2b": "The Motorsport Endeavour Club, showcased at Autosport International 2005, aims to promote motorsport participation among disabled individuals through technological adaptations. Key exhibits include Roy Tansley's Pro-Shift, an electronic sequential gear changer for amputees racing sidecars, and ParaRallying's adapted Subaru Impreza, accommodating various disabilities like arm amputations, quadriplegia, stroke victims, and individuals with full limb amputation.\n\nRoy Tansley, a motorcycle racer from Derby, invented the Pro-Shift after an accident led to his left leg amputation. The device replaces the need for traditional gear shifting with a foot pedal, improving his race performance by at least 20 seconds per lap in Isle of Man TT competitions. Tansley is open to selling the product to able-bodied people if necessary.\n\nParaRallying, led by paraplegic rally driver Dave Hawkins, offers fully functional adapted cars for disabled drivers using advanced electronics. Their vehicles cater to right or left arm amputees, quadriplegics, stroke victims, and those with complete limb loss.\n\nJoy Rainey, a former Australian Formula 3 champion's daughter, competed in motorsport by modifying a sports racer for her petite size, adapting it to maintain balance during hill climbs. In recent years, she participated in the London to Sydney Marathon alongside her partner, Trevor, who designed a system to rapidly remove her car's adaptations.\n\nThe Motorsport Endeavour Club hopes that showcasing these technologies will inspire more disabled individuals to engage in motorsport at all levels.", "reference": "The Motorsport Endeavour Club is hoping that putting such technologies on display will result in more disabled people becoming involved in all areas of the sport and at every level.Motorcycle racer, Roy Tansley, from Derby developed his electronic sequential gear changer following an accident which resulted in part of his left leg being amputated.\"I needed to find a way of changing gear and generally you do that with your left leg,\" Mr Tansley told the BBC News website.Another exhibit on the Motorsport Endeavour stand is a Subaru Impreza rally car, adapted to accommodate a variety of disabilities.The Motorsport Endeavour Club left the starting grid yesterday at the Autosport International 2005 show at Birmingham's NEC, with several technologies to adapt vehicles on display.An organisation has been launched to encourage disabled people to get involved in all aspects of motorsport, which is now increasingly possible thanks to technological innovations.Mr Hawkins - a paraplegic himself - says his customers have included right or left arm amputees, quadriplegics, people who have had strokes and a woman who had had all four limbs amputated.Mr Tansley's invention, the Pro-Shift, is designed to work with Hewland gearboxes which are widely used in motorcycle racing.The car on display is fitted with a 'duck clutch' - a switch on the gear stick used instead of the clutch pedal.\"But in a competition car you have to have everything right or you'll lose the balance of the car,\" she said.In addition to helping disabled riders to compete, Mr Tansley reckons that the Pro-Shift saves at least 20 seconds per lap when he competes in the Isle of Man TT.She uses an ordinary road car by putting extensions on the pedals, a cushion behind her back and raising the seat."}