{"raw_text": "Cyber crime booms in 2004\n \n The last 12 months have seen a dramatic growth in almost every security threat that plague Windows PCs.\n \n The count of known viruses broke the 100,000 barrier and the number of new viruses grew by more than 50%. Similarly phishing attempts, in which conmen try to trick people into handing over confidential data, are recording growth rates of more than 30% and attacks are becoming increasingly sophisticated. Also on the increase are the number of networks of remotely controlled computers, called bot nets, used by malicious hackers and conmen to carry out many different cyber crimes.\n \n One of the biggest changes of 2004 was the waning influence of the boy hackers keen to make a name by writing a fast-spreading virus, said Kevin Hogan, senior manager in Symantec's security response group. Although teenage virus writers will still play around with malicious code, said Mr Hogan, 2004 saw a significant rise in criminal use of malicious programs. The financial incentives were driving criminal use of technology, he said. His comment was echoed by Graham Cluley, senior technology consultant from anti-virus firm Sophos. Mr Cluley said: \"When the commercial world gets involved, things really get nasty. Virus writers and hackers will be looking to make a tidy sum.\"\n \n In particular, phishing attacks, which typically use fake versions of bank websites to grab login details of customers, boomed during 2004. Web portal Lycos Europe reported a 500% increase in the number of phishing e-mail messages it was catching. The Anti-Phishing Working group reported that the number of phishing attacks against new targets was growing at a rate of 30% or more per month. Those who fall victim to these attacks can find that their bank account has been cleaned out or that their good name has been ruined by someone stealing their identity. This change in the ranks of virus writers could mean the end of the mass-mailing virus which attempts to spread by tricking people into opening infected attachments on e-mail messages. \"They are not an efficient way of spreading viruses,\" said Mr Hogan. \"They are very noisy and they are not technically challenging.\" The opening months of 2004 did see the appearance of the Netsky, Bagle and MyDoom mass mailers, but since then more surreptitious viruses, or worms, have dominated.\n \n Mr Hogan said worm writers were more interested in recruiting PCs to take part in \"bot nets\" that can be used to send out spam or to mount attacks on websites.\n \n In September Symantec released statistics which showed that the numbers of active \"bot computers\" rose from 2,000 to 30,000 per day. Thanks to these \"bot nets\", spam continued to be a problem in 2004. Anti-spam firms report that, in many cases, legitimate e-mail has shrunk to less than 30% of messages. Part of the reason that these \"bot nets\" have become so prevalent, he said, was due to a big change in the way that many viruses were created. In the past many viruses, such as Netsky, have been the work of an individual or group. By contrast, said Mr Hogan, the code for viruses such as Gaobot, Spybot and Randex were commonly held and many groups work on them to produce new variants at the same time. The result is that now there are more than 3,000 variations of the Spybot worm. \"That's unprecedented,\" said Mr Hogan. \"What makes it difficult is that they are all co-existing with each other and do not exist in an easy to understand chronology.\"\n \n The emergence of the first proper virus for mobile phones was also seen in 2004.\n \n In the past, threats to smart phones have been largely theoretical because the viruses created to cripple phones existed only in the laboratory rather than the wild. In June, the Cabir virus was discovered that can hop from phone to phone using Bluetooth short-range radio technology. Also released this year was the Mosquito game for Symbian phones which surreptitiously sends messages to premium rate numbers, and in November the Skulls Trojan came to light which can cripple phones. On the positive side, Finnish security firm F-Secure said that 2004 was the best-ever year for the capture, arrest and sentencing of virus writers and criminally-minded hackers. In total, eight virus writers were arrested and some members of the so-called 29A virus writing group were sentenced. One high-profile arrest was that of German teenager Sven Jaschen who confessed to be behind the Netsky and Sasser virus families. Also shut down were the Carderplanet and Shadowcrew websites that were used to trade stolen credit card numbers.\n", "llama3.2:1b": "Cyber crime boomed in 2004, with a significant growth in security threats such as viruses, phishing attempts, and botnets. The number of known viruses broke the 100,000 barrier, and new viruses grew by more than 50%. Phishing attacks increased to over 500% in June 2004, resulting in financial losses for individuals and companies. Botnets, networks of remotely controlled computers used for malicious activities, also became more prevalent. The emergence of mobile phone malware, such as the Cabir virus and the Skulls Trojan, was also notable. In contrast, anti-virus firms reported a significant decrease in the number of viruses attributed to professional hackers.", "llama3.2:3b": "The number of known viruses exceeded 100,000 in 2004 with a 50% increase in new viruses. Phishing attempts grew by over 30%, becoming increasingly sophisticated. Bot nets, used for cyber crimes, rose from 2,000 to 30,000 active computers per day. The financial incentives driving criminal use of technology led to a rise in mass-mailing viruses being replaced by more surreptitious worms and mobile phone viruses.", "gemma2:2b": "Cyber crime increased in 2004.  Virus count grew significantly, phishing attacks increased substantially, botnets were more prevalent for malicious activities, and mobile phone viruses emerged. Criminal use of technology is driving these changes, with a focus on financial incentives. Worm writers used \"bot nets\" to launch spam and attack websites. The Spybot worm's multiple variations are a prime example of this trend, making it difficult to manage the spread. Several virus writers were arrested in 2004, leading to legal actions against cyber criminals.  \n", "qwen2.5:0.5b": "In 2004, a significant growth in cybercrime was observed due to an increase in known viruses, phishing attempts, bot nets, and the emergence of new malware like Netsky, Bagle, and MyDoom. Many young virus writers took on more advanced tasks such as writing malicious programs for their own gain while old writers continued using simpler techniques. The emergence of the first virus for mobile phones also marked a shift in cybersecurity practices, with newer viruses exploiting new forms of communication. This year also saw an increase in arrests and sentencing of cyber criminals like Sven Jaschen.", "qwen2.5:1.5b": "### Summary\n\nCybercrime has risen dramatically in 2004, with a significant increase observed across various threats such as viruses, phishing attacks, botnets, spam, worms, mobile phone malware, and the growth of \"bot computers.\" The financial incentives for criminal activity have intensified, leading to an increased prevalence of sophisticated cybercrimes. The number of active \"bot computers\" rose from 2,000 to 30,000 per day in September 2004. Additionally, new threats emerged like Cabir viruses and Mosquito games that exploit Bluetooth technology, highlighting the evolving nature of malware.", "qwen2.5:3b": "Cyber crime boomed in 2004 with significant growth in viruses, phishing attempts, and botnets. The number of known viruses surpassed 100,000 with a more than 50% increase in new ones. Phishing attacks saw a 500% rise in intercepted emails. Malware is being used by criminals for financial gain. Worms now dominate spread methods over mass-mailing virus techniques, which are becoming less effective. The number of active \"bot computers\" rose from 2,000 to 30,000 daily, contributing to spam issues. Mobile viruses emerged in the form of Cabir and Skulls Trojan. In a positive note, Finland made notable progress in catching virus writers and shutting down websites used for hacking activities.", "opencoder:1.5b": "The text provided summarizes the following:\nCyber crime booms in 2004.\nThe growth of new viruses has exceeded 50% since the introduction of a virus writer's keystone program, the Boy Hacker.\nPhishing attacks have been gaining traction during 2004 and a significant rise in the rate of malicious use of programs. The economic incentives led to the increasing use of malicious programs and associated cybercrimes.\nIn particular, phishing attacks have had an unprecedented impact with large-scale spam messages being reported as e-mail messages caught by anti-spam techniques.\nThe rise of \"bot nets\" has contributed to a steady increase in malware usage in 2004. These are used primarily for mass mailing purposes due to their complexity and the potential for spreading across multiple networks.\nThe introduction of the Cabir virus has led to significant growth, making it difficult for researchers to identify its variations. The Mosquito game and Skulls Trojan have also been released, which are designed to disrupt phone functionality and potentially threaten premium rate services.\nFinally, the creation of so-called 29A viruses by some groups in 2004 has led to a more serious impact on smartphone users than any other virus writing group could achieve. The use of stolen credit card numbers, which was reported as high-profile charges, is also another area where anti-spam firms have reported a dramatic increase.\n", "smollm:1.7b": "", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text about cyber crimes in 2004. Let me read through it carefully.\n\nThe text talks about how cyber threats grew rapidly from 2003 to 2004. It mentions viruses breaking the 100,000 barrier and phishing rates increasing. There were also bot nets used by hackers. Kevin Hogan from Symantec noted that while teenagers still write viruses, the trend was moving towards criminals using tech.\n\nThen there's Graham Cluley from Sophos agreeing, saying financial incentives drove these crimes. Phishing attacks saw a 500% increase in emails caught by Lycos Europe, and their impact on bank accounts could be serious.\n\nHogan also points out that virus writers aren't efficient and noisy, but phishing is becoming more sophisticated. The opening months of 2004 had netsky, bagle, and mydoom mass mailers. He mentioned worm writers recruited PCs into bot nets, leading to a rise in bot computers from 2k to 30k per day.\n\nThe statistics show that these bot nets are still problematic because spam increased and legitimate emails shrinked. The first mobile virus was Cabir, and theMosquito game and Skulls Trojan were introduced this year, both used subtly.\n\nOverall, it's a year marked by increasing cyber threats, particularly with phishing and botnets becoming significant.\n</think>\n\nThe text highlights a major growth in cyber threats from 2003 to 2004. It notes an increase in known viruses reaching 100,000 and new viruses growing by over 50%, as well as phishing attacks showing increases of 30% or more per month. There was a rise in malicious networks like bot nets used by hackers.\n\nKevin Hogan from Symantec mentioned that while teenagers remain virus writers, the trend shifted towards criminals using tech. Phishing attacks saw a 500% increase in e-mail messages, and their impact on bank accounts could be severe. Graham Cluley agreed, noting financial incentives drove phishing.\n\nHogan noted that virus writers were noisy and less technically challenging, while phishing became sophisticated. The opening months of 2004 had netsky, bagle, and mydoom mass mailers, which led to a rise in bot computers per day. He also highlighted the emergence of worms like Spyingot and the first mobile virus, Cabir, and introduced theMosquito game for Symbian phones, along with Skulls Trojan.\n\nThe text showed that despite these changes, threats were mostly theoretical, while the past year saw significant increases in phishing attacks and botnets. F-Secure noted 2004 as a best year for virus capture, arrest, and sentencing. Mobile viruses like Cabir were discovered, and websites Carderplanet and Shadowcrew were shut down.\n\nOverall, the text describes the year as marked by growing cyber threats, particularly phishing and botnet activities.", "tinyllama:1.1b": "In 2004, the number of known virus families grew by more than 50%, along with bot net growth rates and attacks on e-mail and websites becoming increasingly sophisticated. The main reasons for this increase in cyber crime include the growing influence of online teenagers who write malicious programs and the growing influence of remote-controlled computers called bot nets used to carry out various crimes. A significant rise in criminal use of technology was seen, with financial incentives driving the spread of virus writers and hackers. In particular, phishing attacks continued to be a problem during 2004, as more people fall victims to these scams. The Anti-Phish Working Group reported a 30% increase in phishing e-mail messages that were caught by Web portal Lycos Europe, while the Anti-Phishing Working Group (APWG) reported an even higher rate of growth in mass mailings and bot nets, which were used to spread virusware. In addition, worms, or networked spamming servers, continued to become more efficient at spreading viruses and spam. The number of active \"bot computers\" also increased dramatically in 2004, with some estimates claiming that there are now over 3 million such machines. Overall, the rise in cyber crime showed no sign of abating in 2004, as virus writers and criminal hackers continued to wreak havoc on users' digital lives.", "tinydolphin:1.1b": " In summary, cyber crime has grown significantly in 2004. There have been more bot nets, malicious programs, phishing attacks, and worms than ever before. These threats affect computers globally, making it a growing concern for businesses and individuals alike.", "phi:2.7b": " In 2004, cyber crime saw a significant increase in almost all types of security threats, including viruses, phishing attempts, and bot nets. The financial incentives behind these crimes made them more prevalent. Phishing attacks, which involve tricking people into giving away confidential data, boomed during this time. Mass-mailing virus writers lost their influence to surreptitious worm creators who used \"bot nets\" for spam or website attacks. In September, the number of active bot computers rose from 2,000 to 30,000 per day. The emergence of viruses for mobile phones also became a concern. Despite this increase in cyber crime, 2004 was also seen as a good year for the arrest and sentencing of virus writers and hackers.\n", "orca-mini:3b": " In 2004, cybercrime grew significantly, with new threats such as worms and bot nets becoming more prevalent. Phishing attacks also increased in number and sophistication, posing a threat to individuals and businesses. The emergence of new viruses for mobile phones was also seen in the same year. To combat these threats, many virus writers were arrested and a crackdown on cybercrime took place.", "hermes3:3b": "2004 Cyber crime growth:\n* Over 100,000 known viruses\n* More than 50% increase in new viruses\n* Over 30% growth in phishing attempts\n* Increasing sophistication of attacks\n* Massive growth in remotely controlled networks ('bot nets') for cyber crimes.", "stablelm-zephyr:3b": "Cyber crime experienced significant growth in 2004, with known viruses reaching over 100,000 and new viruses growing by more than 50%. Phishing attacks increased by over 30%, and the number of bot nets using remotely controlled computers rose. Viruses began shifting from mass mailers to more sophisticated worms that recruit PCs to participate in \"bot nets\" for spam or attack websites. 2004 also saw the emergence of the first proper virus for mobile phones, with viruses like Cabir hopping between phones via Bluetooth technology. Despite this growth in criminal use of technology, 2004 was considered the best-ever year for capturing and punishing virus writers and hackers, with eight writers arrested and some members of the 29A virus writing group sentenced.", "chatgpt-4o-latest": "Cyber crime surged in 2004, with a sharp rise in security threats targeting Windows PCs. The number of known viruses exceeded 100,000, and new viruses increased by over 50%. Phishing attacks grew by more than 30% per month, becoming more sophisticated, while bot nets—networks of remotely controlled computers—were increasingly used for cyber crimes. The year saw a shift from amateur virus writers to financially motivated criminals, leading to a decline in mass-mailing viruses and a rise in stealthier worms. Spam remained a major issue, with legitimate emails dropping below 30% of total messages. Mobile phone threats also emerged, including the Cabir virus and malicious software like Mosquito and Skulls. However, 2004 also saw significant law enforcement successes, with multiple virus writers arrested and major cybercrime websites shut down.", "stablelm2:1.6b": "In recent months, there has been a significant increase in various types of cybercrime, including viruses, phishing attacks, and bot nets. The count of known viruses broke the barrier, with new ones growing by over 100%. Phishing attempts also increased at rates over 50%, as did the number of bot nets controlled by malicious hackers. Teenage virus writers were no longer making viruses; instead, criminals used technology to make a profit from their activities. Phishing attacks saw significant growth during the period of \"Cybercrime Boom in 2004,\" with web portals reporting a 50% increase in such e-mails. The first proper virus for mobile phones was also identified during this time. Overall, eight individuals were arrested and sentenced for their involvement in these cybercrimes, as well as two websites that traded stolen credit card numbers.", "granite3.1-dense:2b": "In 2004, cyber crime experienced significant growth in relation to Windows PCs. The number of known viruses surpassed 100,000, with phishing attempts rising by over 30%. Botnets, networks of remotely controlled computers, also increased, facilitating various cybercrimes. A shift occurred from teenage virus writers to criminals motivated by financial gain. Phishing attacks, particularly those using fake bank websites, saw a staggering 500% increase in Lycos Europe's caught emails and 30% monthly growth in the Anti-Phishing Working Group's reported attacks. These attacks led to identity theft or account compromise for victims.\n\nSymantec observed a decline in mass-mailing viruses, as they found surreptitious worms more effective. The count of active \"bot computers\" rose from 2,000 to 30,000 daily, contributing to spam proliferation. Anti-spam firms reported that legitimate emails accounted for less than 30% of messages. Virus creation methods changed; now, multiple groups collaborate on producing new variants simultaneously, leading to over 3,000 Spybot worm variations.\n\nThe first mobile phone virus, Cabir, was discovered in June, using Bluetooth technology to spread between phones. Other threats included the Mosquito game for Symbian phones and the Skulls Trojan in November, capable of crippling devices. On a positive note, 2004 was the best year yet for apprehending virus writers and hackers; eight were arrested, including members of the infamous 29A group, with one high-profile case being German teenager Sven Jaschen behind Netsky and Sasser viruses. Additionally, criminal websites Carderplanet and Shadowcrew were shut down.", "reference": "Part of the reason that these \"bot nets\" have become so prevalent, he said, was due to a big change in the way that many viruses were created.By contrast, said Mr Hogan, the code for viruses such as Gaobot, Spybot and Randex were commonly held and many groups work on them to produce new variants at the same time.One of the biggest changes of 2004 was the waning influence of the boy hackers keen to make a name by writing a fast-spreading virus, said Kevin Hogan, senior manager in Symantec's security response group.Mr Hogan said worm writers were more interested in recruiting PCs to take part in \"bot nets\" that can be used to send out spam or to mount attacks on websites.On the positive side, Finnish security firm F-Secure said that 2004 was the best-ever year for the capture, arrest and sentencing of virus writers and criminally-minded hackers.The emergence of the first proper virus for mobile phones was also seen in 2004.Although teenage virus writers will still play around with malicious code, said Mr Hogan, 2004 saw a significant rise in criminal use of malicious programs.In total, eight virus writers were arrested and some members of the so-called 29A virus writing group were sentenced.The count of known viruses broke the 100,000 barrier and the number of new viruses grew by more than 50%.The Anti-Phishing Working group reported that the number of phishing attacks against new targets was growing at a rate of 30% or more per month.This change in the ranks of virus writers could mean the end of the mass-mailing virus which attempts to spread by tricking people into opening infected attachments on e-mail messages.Virus writers and hackers will be looking to make a tidy sum.\"In June, the Cabir virus was discovered that can hop from phone to phone using Bluetooth short-range radio technology.\"They are not an efficient way of spreading viruses,\" said Mr Hogan.\"That's unprecedented,\" said Mr Hogan."}