{"raw_text": "Fast moving phone viruses appear\n \n Security firms are warning about several mobile phone viruses that can spread much faster than similar bugs.\n \n The new strains of the Cabir mobile phone virus use short-range radio technology to leap to any vulnerable phone as soon as it is in range. The Cabir virus only affects high-end handsets running the Symbian Series 60 phone operating system. Despite the warnings, there are so far no reports of any phones being infected by the new variants of Cabir.\n \n The original Cabir worm came to light in mid-June 2004 when it was sent to anti-virus firms as a proof-of-concept program. A mistake in the way the original Cabir was written meant that even if it escaped from the laboratory, the bug would only have been able to infect one phone at a time.\n \n However, the new Cabir strains have this mistake corrected and will spread via short range Bluetooth technology to any vulnerable phone in range. Bluetooth has an effective range of a few tens of metres. The risk of being infected by Cabir is low because users must give the malicious program permission to download on to their handset and then must manually install it. Users can protect themselves by altering a setting on Symbian phones that conceals the handset from other Bluetooth using devices. Finnish security firm F-Secure issued a warning about the new strains of Cabir but said that the viruses do not do any damage to a phone. All they do is block normal Bluetooth activity and drain the phone's battery. Anti-virus firm Sophos said the source code for Cabir had been posted on the net by a Brazilian programmer which might lead to even more variants of the program being created. So far seven versions of Cabir are know to exist, one of which was inside the malicious Skulls program that was found in late November. Symbian's Series 60 software is licenced by Nokia, LG Electronics, Lenovo, Panasonic, Samsung, Sendo and Siemens.\n", "llama3.2:1b": "Fast-moving phone viruses spread rapidly via short-range radio technology, affecting high-end Symbian Series 60 phones. The original Cabir worm was released in 2004 but had a flaw that allowed it to infect one device per transmission; new strains correct this error and spread via Bluetooth range of tens of meters. Users must give permission for the program to be downloaded and installed manually, and can protect themselves by altering settings on Symbian phones.", "llama3.2:3b": "Security firms warn about new strains of the Cabir mobile phone virus using Bluetooth technology to infect high-end handsets running Symbian Series 60 operating system with no reported damage, blocking normal Bluetooth activity and draining batteries.", "gemma2:2b": "Fast-spreading mobile phone viruses called Cabir are using Bluetooth technology to infect high-end Symbian phones. The new versions correct a previous flaw in the original virus, allowing it to spread quickly to multiple devices within range. These viruses do not cause direct damage but only block Bluetooth activity and drain battery life.  A programmer released the source code for Cabir, increasing potential for further variants to emerge. \n", "qwen2.5:0.5b": "Security firms warn about new mobile phone virus Cabir that can spread quickly through Bluetooth technology. The Cabir virus uses short-range radio technology to infect phones with a high risk of damage to battery usage.", "qwen2.5:1.5b": "Security firms warn of a faster-spreading mobile phone virus called Cabir, affecting only high-end Symbian phones, using Bluetooth instead of radio to spread; first found in mid-June 2004 but corrected in new strains; can infect non-welcome by requiring user permission and altering setting on handsets.", "qwen2.5:3b": "Fast-moving phone viruses appear, using short-range radio technology to spread rapidly via Bluetooth. The new strains of the Cabir virus affect high-end phones running Symbian Series 60 OS. Despite initial warnings, no infections have been reported. The original Cabir was discovered in mid-2004 and could only infect one phone at a time due to an error. New versions correct this flaw but still require user permission to download and manual installation. F-Secure warned of the risk, though Sophos noted these strains do not cause damage but block Bluetooth activity and drain batteries. The source code has been posted on the internet, potentially leading to more variants. Known variants include one in the Skulls program discovered in November. Symbian Series 60 software is licensed by multiple manufacturers including Nokia, LG Electronics, Lenovo, Panasonic, Samsung, Sendo, and Siemens.", "opencoder:1.5b": "Fast moving phone viruses appear\n\nSecurity firms are warning about several mobile phone viruses that can spread much faster than similar bugs.\n\nThere are so far no reports of any phones being infected by the new variants of Cabir.\nThe original Cabir worm came to light in mid-June 2004 when it was sent to anti-virus firms as a proof-of-concept program. However, this mistake has been corrected and will spread via short range Bluetooth technology to any vulnerable phone in range.\n\nBluetooth has an effective range of a few tens of metres. The risk of being infected by Cabir is low because users must give the malicious program permission to download on to their handset and then must manually install it.\n\nUsers can protect themselves by altering a setting on Symbian phones that conceals the handset from other Bluetooth using devices. \n\nFinnish security firm F-Secure issued a warning about the new strains of Cabir but said that the viruses do not do any damage to a phone. All they do is block normal Bluetooth activity and drain the phone's battery.\n\nAnti-virus firm Sophos said the source code for Cabir had been posted on the net by a Brazilian programmer which might lead to even more variants of the program being created. So far seven versions of Cabir are know to exist, one of which was inside the malicious Skulls program that was found in late November. Symbian's Series 60 software is licenced by Nokia, LG Electronics, Lenovo, Panasonic, Samsung, Sendo and Siemens.\n", "smollm:1.7b": "The summary should be:\n\n\"Security firms are warning about several mobile phone viruses that can spread much faster than similar bugs. The new strains of the Cabir mobile phone virus use short-range radio technology to leap to any vulnerable phone as soon as it is in range. Despite the warnings, there are so far no reports of any phones being infected by the new variants of Cabir. The original Cabir worm came to light in mid-June 2004 when it was sent to anti-virus firms as a proof-of-concept program. A mistake in the way the original Cabir was written meant that even if it escaped from the laboratory, the bug would only have been able to infect one phone at a time. However, the new Cabir strains have this mistake corrected and will spread via short range Bluetooth technology to any vulnerable phone in range. Bluetooth has an effective range of a few tens of meters. The risk of being infected by Cabir is low because users must give the malicious program permission to download on to their handset and then must manually install it. Users can protect themselves by altering a setting on Symbian phones that conceals the handset from other Bluetooth using devices. Finnish security firm F-Secure issued a warning about the new strains of Cabir but said that the viruses do not do any damage to a phone. All they do is block normal Bluetooth activity and drain the phone's battery.\"", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about fast-moving mobile phone viruses called Cabir. The user wants the summary only as plain text without explanations or any other formatting.\n\nFirst, I'll read through each paragraph carefully to identify the key points. \n\nThe first sentence introduces that Cabir is a mobile phone virus that spreads quickly. Then it mentions specific details like how the new strains use short-range radio for jumping between devices and target high-end Symbian devices running a particular OS.\n\nNext, there's information about the original Cabir, which appeared in 2004 and only affected one device at a time due to a mistake in its design. It then moves on to the newer Cabir strains with corrections, targeting anyone within Bluetooth range. This is important because they don't require manual installation and can be more easily spread.\n\nF-Secure warns about these viruses but says they don't damage phones. Instead, they block Bluetooth activity and drain the battery. Also, there are seven known versions of the virus, including one found in a programming error related to another programmer.\n\nSophos mentions that the source code was publicly available, which might lead to more variants being created. Nokia, LG, Lenovo, etc., license Symbian 60 software, so I should include that as well.\n\nI need to make sure all these points are covered concisely without adding any extra information. The summary should be clear and capture the essential details about Cabir's origin, how it spreads, current state of knowledge, warnings from security firms, and who is responsible.\n</think>\n\nFast-moving mobile phone viruses called Cabir appear, spreading quickly across devices. The new strains use short-range radio technology to jump between vulnerable phones instantly once in range. Targeting high-end Symbian devices with the Symbian Series 60 OS. \n\nOriginally introduced in June 2004 as a proof-of-concept program for an anti-virus firm, which could only infect one device. New Cabir strains correct this mistake and spread via short-range Bluetooth to any device within range. Bluetooth has a range of tens of meters, minimizing the risk.\n\nF-Secure warns about low infection risks but says the viruses block Bluetooth activity and drain battery. Users can protect by setting their Symbian phones to hide them from Bluetooth devices. Finnish firm issued a warning.\n\nSophos says the source code was publicly available, potentially leading to more Cabir variants. Seven known versions exist, including one found in programming errors related to another programmer. The virus is licensed by notable companies like Nokia and Samsung.", "tinyllama:1.1b": "Security firms are warning about a new type of mobile phone virus that can spread much faster than other strains, especially using short-range radio technology. The Cabir virus is said to affect high-end Symbian Series 60 phones only and has been found in several versions so far. While the original Cabir virus was originally intended as a proof-of-concept program, this new strain has it's bug corrected, meaning even infected devices will be able to spread the malicious program to any vulnerable phone in range. However, users must grant permission for the virus to download and manually install it on their phones, and they can protect themselves by altering a setting on their phones that conceals them from other Bluetooth using devices. The Source code of Cabir is said to lead to even more variants being created, so far there are just 7 known versions of the program. All versions of Symbian Series 60 software are licensed by Nokia, LG Electronics, Lenovo, Panasonic, Samsung, Sendo and Siemens.", "tinydolphin:1.1b": " Summary: New mobile phone worms have emerged, spreading through short-range Bluetooth technology and infecting high-end handsets running Symbian operating system. The virus only affects devices that are in range of the attacker's phone, but there are no reports of infections yet. Cabir and its variants come from a Brazilian programmer. Sophos and F-Secure have warned about potential damage to phones due to the malicious program.", "phi:2.7b": " Several mobile phone viruses, including the new Cabir strain, use short-range radio technology to spread quickly between vulnerable phones. These viruses affect high-end handsets running the Symbian Series \n", "orca-mini:3b": " Fast-moving phone viruses have emerged that can spread more quickly than similar bugs. The new strains of Cabir mobile phone virus use short-range radio technology to jump to any vulnerable phone as soon as it is within range. Despite warnings, there are no reports of any phones being infected by the new variants of Cabir. The original Cabir worm came out in mid-June 2004 and had a mistake that limited its spread. However, the new strains have the mistake corrected and can spread via short range Bluetooth technology to any vulnerable phone in range. Users can protect themselves by changing a setting on Symbian phones that hides their handset from other Bluetooth devices. All Cabir does is block normal Bluetooth activity and drain the phone's battery. The source code for Cabir has been posted on the net, and more variants might be created.", "hermes3:3b": "Cabir mobile phone viruses spread quickly via Bluetooth, infecting high-end Symbian Series 60 phones; new variants exist but low infection risk due to user permission requirement.", "stablelm-zephyr:3b": "Security firms have warned about fast-spreading Cabir mobile phone viruses, which use short-range radio technology to jump to any vulnerable phone in range. The new strains correct a mistake from the original Cabir, spreading through Bluetooth with an effective range of a few meters. Although Finnish firm F-Secure stated that the viruses only block normal Bluetooth activity and drain battery power without causing damage, users can protect themselves by hiding their Symbian phones from other Bluetooth devices' settings. The source code for Cabir has been posted online by a Brazilian programmer, potentially leading to more variants of the program being created. As of now, seven versions of Cabir exist, with one found inside the malicious Skulls program in November. Symbian's Series 60 software is licensed by major brands such as Nokia, LG Electronics, Lenovo, Panasonic, Samsung, Sendo, and Siemens.", "chatgpt-4o-latest": "Security firms warn of new Cabir mobile phone virus strains that spread rapidly via Bluetooth to vulnerable Symbian Series 60 phones. Unlike the original Cabir, which could only infect one phone at a time, the new variants can spread to any phone in range. However, infection requires user permission and manual installation. The virus does not damage phones but disrupts Bluetooth and drains the battery. Finnish firm F-Secure and anti-virus company Sophos caution that the virus's source code has been posted online, potentially leading to more variants. So far, seven versions exist, with one found in the Skulls malware. Symbian's software is used by major phone manufacturers, including Nokia, Samsung, and Siemens.", "stablelm2:1.6b": "Security firms warn about fast spreading mobile phone viruses like Cabir that utilize short-range radio technology to infect high-end phones with the Symbian Series operating system. The original Cabir worm was a proof-of-concept error; however, newer strains correct this mistake and spread via Bluetooth to any vulnerable phone in range. Users can protect themselves by adjusting settings on their Symbian phones or blocking access from malicious devices. As of now, no reports of phone infection exist but F-Secure warns about draining the battery. Cabir is not damaging to phones; instead, it merely hinders normal Bluetooth activity and battery drain. Sophis stated that a Brazilian programmer posted source code for Cabir, leading to possible more variants being created. So far, seven versions of Cabir are known, including one within the Skulls program found in November.", "granite3.1-dense:2b": "Security firms are alerting to new, more rapid-spreading variants of the Cabir mobile phone virus, targeting high-end Symbian Series 60 handsets. These new strains exploit short-range Bluetooth technology to infect nearby devices upon user permission and manual installation. Despite the warnings, no infections have been reported yet. The original Cabir's flaw, limiting infection to one device at a time, has been corrected. The risk remains low due to users needing to enable Bluetooth and manually install the virus. Users can safeguard themselves by changing Symbian settings to hide their devices from other Bluetooth devices. Both F-Secure and Sophos have issued warnings, with Sophos noting that the source code is publicly available, potentially leading to additional variants. Seven known versions of Cabir exist, one being part of the Skulls program discovered in late November.", "reference": "The new strains of the Cabir mobile phone virus use short-range radio technology to leap to any vulnerable phone as soon as it is in range.However, the new Cabir strains have this mistake corrected and will spread via short range Bluetooth technology to any vulnerable phone in range.Finnish security firm F-Secure issued a warning about the new strains of Cabir but said that the viruses do not do any damage to a phone.The Cabir virus only affects high-end handsets running the Symbian Series 60 phone operating system.Despite the warnings, there are so far no reports of any phones being infected by the new variants of Cabir.A mistake in the way the original Cabir was written meant that even if it escaped from the laboratory, the bug would only have been able to infect one phone at a time."}