{"raw_text": "File-swappers ready new network\n \n Legal attacks on websites that help people swap pirated films have forced the development of a system that could be harder to shut down.\n \n One site behind the success of the BitTorrent file-swapping system is producing its own software that avoids the pitfalls of the earlier program. A test version of the new Exeem program will be released in late January. But doubts remain about the new networks ability to ensure files being swapped are \"quality copies\".\n \n In late December movie studios launched a legal campaign against websites that helped people swap pirated movies using the BitTorrent network. The legal campaign worked because of the way that BitTorrent is organised. That file-sharing system relies on links called \"trackers\" that point users to others happy to share the file they are looking for. Shutting down sites that listed trackers crippled the BitTorrent network. One of the sites shut down by the legal campaign was suprnova.org which helped boost the popularity of the BitTorrent system by checking that trackers led to the movies or TV programmes they claimed to.\n \n Now the man behind suprnova.org, who goes by the nickname Sloncek, is preparing to release software for a new file-swapping network dubbed Exeem. In an interview with Novastream web radio, Sloncek said Exeem would combine ideas from the BitTorrent and Kazaa file-sharing systems. Like BitTorrent, Exeem will have trackers that help point people toward the file they want. Like Kazaa these trackers will be held by everyone. There will be no centrally maintained list. This, said Sloncek, should make the system less vulnerable to legal action aimed at stopping people swapping pirated movies and music. The Exeem software has been under development for a few months and is currently being tested by a closed group of users. An early public version of the software should be available before February. Sloncek said that currently only a Windows version of the software was in development. There were no plans for a Linux or Mac version. He said that costs of writing the software will be paid for by adverts appearing in the finished version of the program. Despite Suprnova administrator Sloncek's involvement with Exeem, the basic technology appears to have been developed by a firm called Swarm Systems that is based on Caribbean island Saint Kitts and Nevis.\n \n Users of the Exeem system will be able to rate files being swapped to help stop the spread of fake files, Sloncek told Novastream.\n \n Dr Johan Pouwelse, a researcher at the Delft University of Technology who studies peer-to-peer networks, said Exeem was the next evolution in file-sharing systems. But, he said, it would struggle to be as popular as BitTorrent and Suprnova because early versions were not taking enough care to make sure good copies of files were being shared. \"Exeem cannot prevent pollution,\" he said. \"The rating system in Exeem seems flawed because it is easy to insert both fake files and fake ratings,\" he said. Studies have shown that organisations working for record labels and movie studios have worked to undermine Kazaa by putting in fakes. By contrast moderators on Suprnova made sure files being shared were high quality. \"The moderators are the difference between having a system that works and one that's full of crap like Kazaa,\" he said. \"There is a fundamental tension between distribution and integrity,\" he said. Mr Pouwelse said that future versions of file-sharing systems are likely to incorporate some kind of distributed reputation system that lets moderators prove who they are to the network and rate which files are worth downloading. When big files were being shared moderation systems were key, said Mr Pouwelse. He added that the legal attacks on BitTorrent had driven people away from sites such as Suprnova but many users had simply migrated to other tracker listing sites many of which have seen huge increases in traffic. \"It's hard to compete with free,\" he said. No-one from the Motion Picture Association of America was immediately available for comment on the file-sharing development.\n", "llama3.2:1b": "Here is a summary of the text in plain text:\n\nBitTorrent and Kazaa file-swapping systems will be replaced by new Exeem software that avoids legal attacks and ensures files are \"quality copies\". The system combines ideas from both, with trackers helping users find desired content and no centralized list. Exeem has been under development for months and is currently being tested. An early public version is expected to be released in February. Despite developer Sloncek's involvement, costs will be paid through ads. Experts say the new system may struggle to compete with BitTorrent due to its flaws, such as ratings and fake files.", "llama3.2:3b": "A new file-swapping network called Exeem is being developed by Sloncek, the founder of suprnova.org, in response to legal attacks on BitTorrent-based websites. Exeem will use a decentralized tracker system like Kazaa, making it harder for authorities to shut down. The system will also have a rating feature to help identify high-quality files, but its effectiveness is uncertain. Experts say future versions of file-sharing systems may incorporate reputation systems and moderation tools to ensure integrity.", "gemma2:2b": "A new file-swapping system called Exeem is being developed after legal attacks shut down popular sites like Suprnova.  Exeem combines elements of BitTorrent and Kazaa, using trackers to direct users to files, aiming to reduce vulnerability to takedown by studios.  While Exeem's software is being tested and an early version will be released in February, its long-term success depends on the quality of shared files and a robust rating system to combat fake content. Research suggests that future file-sharing systems may incorporate distributed reputation systems for moderation and integrity. \n", "qwen2.5:0.5b": "New software called Exeem combines BitTorrent and Kazaa filesharing systems, but has faced legal battles. Users can rate files using a rating system based on quality to prevent fake or low-quality files from being shared. Dr. Johan Pouwelse at Delft University of Technology believes that Exeem will struggle compared to BitTorrent because it is not taking enough care to ensure good copies of files are being shared.", "qwen2.5:1.5b": "Legal attacks forced BitTorrent system, now developing new network Exeem that avoids legal threats. Exeem combines ideas from BitTorrent and Kazaa, using shared trackers instead of a central list to reduce vulnerability. Sloncek's software will be released in early 2006 with an emphasis on rating quality files for piracy prevention. Critics point out flaws in the rating system but consider it a step forward compared to earlier systems. Exeem faces competition from other tracker-listing sites that have seen increases due to reduced legal pressure.", "qwen2.5:3b": "File-swappers behind BitTorrent are developing Exeem, a new network aiming to avoid legal attacks by decentralizing tracker functionality. Sloncek, formerly of suprnova.org, plans to release Exeem in January, combining ideas from BitTorrent and Kazaa. Unlike BitTorrent, Exeem will use trackers distributed among users rather than centralized lists, potentially making it less vulnerable to legal action. Users can rate files to combat fake copies. However, Dr. Johan Pouwelse of Delft University suggests this system might struggle due to potential flaws in rating systems and a history of record labels sabotaging Kazaa by injecting fakes. Exeem is seen as the next evolution but faces challenges in gaining popularity due to its less rigorous file quality control compared to established networks like suprnova.org.", "opencoder:1.5b": "File-swappers ready new network\n\nLegal attacks on websites that help people swap pirated films have forced the development of a system that could be harder to shut down.\n\nOne site behind the success of the BitTorrent file-swapping system is producing its own software that avoids the pitfalls of the earlier program. A test version of the new Exeem program will be released in late January. But doubts remain about the new networks ability to ensure files being swapped are \"quality copies\".\n\nIn late December movie studios launched a legal campaign against websites that helped people swap pirated movies using the BitTorrent network. The legal campaign worked because of the way that BitTorrent is organised. That file-sharing system relies on links called \"trackers\" that point users to others happy to share the file they are looking for. Shutting down sites that listed trackers crippled the BitTorrent network. One of the sites shut down by the legal campaign was suprnova.org which helped boost the popularity of the BitTorrent system by checking that trackers led to the movies or TV programmes they claimed.\n\nNow, the man behind suprnova.org, who goes by the nickname Sloncek, is preparing to release software for a new file-swapping network dubbed Exeem. In an interview with Novastream web radio, Sloncek said Exeem would combine ideas from the BitTorrent and Kazaa file-sharing systems. Like BitTorrent, Exeem will have trackers that help point people toward the file they want. Like Kazaa these trackers will be held by everyone. There will be no centrally maintained list. This, said Sloncek, should make the system less vulnerable to legal action aimed at stopping people swapping pirated movies and music. The Exeem software has been under development for a few months and is currently being tested by a closed group of users. An early public version of the software should be available before February. Sloncek said that currently only a Windows version of the software was in development. There were no plans for a Linux or Mac version. He said that costs of writing the software will be paid for by adverts appearing in the finished version of the program. Despite Suprnova administrator Sloncek's involvement with Exeem, the basic technology appears to have been developed by a firm called Swarm Systems that is based on Caribbean island Saint Kitts and Nevis.\n\nUsers of the Exeem system will be able to rate files being swapped to help stop the spread of fake files. Dr Johan Pouwelse, a researcher at the Delft University of Technology who studies peer-to-peer networks, said Exeem was the next evolution in file-sharing systems. But, he said, it would struggle to be as popular as BitTorrent and Suprnova because early versions were not taking enough care to make sure good copies of files were being shared. \"Exeem cannot prevent pollution,\" he said. \"The rating system in Exeem seems flawed because it is easy to insert both fake files and fake ratings,\" he said. Studies have shown that organisations working for record labels and movie studios have worked to undermine Kazaa by putting in fakes. By contrast moderators on Suprnova made sure files being shared were high quality. \"The moderators are the difference between having a system that works and one that's full of crap like Kazaa,\" he said. \"There is a fundamental tension between distribution and integrity,\" he said. Mr Pouwelse said that future versions of file-sharing systems are likely to incorporate some kind of distributed reputation system that lets moderators prove who they are to the network and rate which files are worth downloading. When big files were being shared moderation systems were key, said Mr Pouwelse. He added that the legal attacks on BitTorrent had driven people away from sites such as Suprnova but many users had simply migrated to other tracker listing sites many of which have seen huge increases in traffic. \"It's hard to compete with free,\" he said. No-one from the Motion Picture Association of America was immediately available for comment on the file-sharing development.\n", "smollm:1.7b": "The summary is concise and focuses on the main ideas:\n\n1. A new BitTorrent-like system, Exeem, has been developed to help people swap pirated movies and TV shows.\n2. The Exeem system will use trackers that point users toward legitimate files, but there are concerns about how well these trackers work in practice.\n3. The legal campaign against BitTorrent had a significant impact on the development of Exeem, which was released late last year.\n4. Exeem is designed to be more secure than BitTorrent and Kazaa, but it still has some flaws that need to be addressed.\n5. The development of Exeem is likely to incorporate some kind of distributed reputation system to help users verify the identity of moderators and rate which files are worth downloading.\n6. The legal attacks on BitTorrent had driven people away from sites such as Suprnova, but many users have simply migrated to other tracker listing sites.\n7. No-one from the Motion Picture Association of America was available for comment on the development of Exeem.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text into plain text. Let me read through it carefully.\n\nFirst paragraph talks about new network advancements and how they've been hit by legal threats. They forced a system that's harder to shut down because people are trying to swap pirated films without proper quality checks.\n\nThen, there's a site behind BitTorrent's success that's creating its own software called Exeem. It'll be released in late January, but the legal campaign against trackers is still showing. The site suprnova.org helped boost BitTorrent by checking for good tracks, and now Sloncek, who used it, is developing Exeem with similar features.\n\nExeem uses trackers without a central list, making it less vulnerable to legal actions targeting pirated files. They're working on Windows-only code but plan for Linux and Mac later.\n\nUsers will rate files, which helps stop fake swaps. Experts mention issues like pollution in the rating system and differences between Suprnova (which was used by big companies) and Exeem. The legal attacks have drawn people away from BitTorrent and increased traffic on tracker sites.\n\nThere's some criticism of the current reputation systems in file-sharing. Future systems might use distributed reputation, which could be a solution but also has its own challenges.\n\nI should make sure to cover all these points without adding personal opinions or explanations. Just the key ideas and details.\n</think>\n\nThe text discusses advancements in file-swapping technologies, particularly BitTorrent-based systems, and the legal threats they face. It highlights a new system called Exeem, which combines features of BitTorrent and Kazaa, using trackers that function without a central list to reduce vulnerability to legal interventions. Users will rate swapped files to combat fake content. Experts note issues with the current rating system, especially regarding fake ratings, and criticize Suprnova for drawing traffic from its users. The document ends by suggesting future systems might use distributed reputation systems but acknowledges their complexities.", "tinyllama:1.1b": "The legal attacks on websites that help people swap pirated films have forced the development of a new network, ExeeM, which aims to make sure good copies are being shared while combating the spread of fake files. The system, in development for several months, is currently being tested by a closed group of users, and will be available before February. Exeem, developed by Swarm Systems, a firm based on Caribbean island Saint Kitts and Nevis, is aimed to combine ideas from BitTorrent's trackers with a decentralized system that ensures quality copies while dealing with fake files, which may be inserted easily. The Exeem software has been developed for Windows, but there are no plans to have Linux or Mac versions. Despite the involvement of Caribbean island Saint Kitts and Nevis in developing the technology, Exeem is expected to struggle to become as popular as BitTorrent due to early versions not taking enough care to ensure good copies. The decentralized system, which aims to rate files being shared by users, seems flawed due to organizations working for record labels and movie studios undermining Kazaa by putting in fake files, while moderators prove themselves on future versions of file-sharing systems.", "tinydolphin:1.1b": " The new file-swapping network Exeem aims to combine ideas from BitTorrent and Kazaa, creating a more stable alternative to current systems. It will have trackers that help users find quality copies of files. However, the developers say the system's reliability relies on the user following the tracker links rather than being able to verify who is behind them. The software is currently being tested by a closed group of users and an early public version could be released before February. The technology behind Exeem is from Saint Kitts and Nevis, but there is no guarantee that it will prove as popular as BitTorrent or Suprnova.", "phi:2.7b": " The BitTorrent system, popular for swapping pirated movies and music files, was disrupted by legal attacks. As a result, one of the original sites behind BitTorrent, suprnova.org, is developing a new software called Exeem that combines features from both BitTorrent and Kazaa. It has trackers that are held by everyone, making it less vulnerable to legal action. However, doubts remain about its ability to ensure the quality of files being swapped. The Exeem software is still in development but will be released before February with a free version funded by advertising. Users will also be able to rate the files being shared to avoid fake copies. Dr Johan Pouwelse from Delft University of Technology believes that Exeem is the next evolution, but its success depends on making sure good copies are shared. File-sharing systems like BitTorrent and Suprnova will continue to exist alongside new ones due to their popularity. The legal attacks on BitTorrent led to users migrating to other tracking sites that have experienced an increase in traffic.\n", "orca-mini:3b": " One site behind the success of the BitTorrent file-swapping system is producing its own software that avoids the pitfalls of the earlier program. A test version of the new Exeem program will be released in late January. But doubts remain about the new network's ability to ensure files being swapped are \"quality copies.\" In late December movie studios launched a legal campaign against websites that helped people swap pirated movies using the BitTorrent network. The legal campaign worked because of the way that BitTorrent is organised. That file-sharing system relies on links called \"trackers\" that point users to others happy to share the file they are looking for. Shutting down sites that listed trackers crippled the BitTorrent network. One of the sites shut down by the legal campaign was suprnova.org which helped boost the popularity of the BitTorrent system by checking that trackers led to the movies or TV programmes they claimed to. Now the man behind suprnova.org, who goes by the nickname Sloncek, is preparing to release software for a new file-swapping network dubbed Exeem. The Exeem software has been under development for a few months and is currently being tested by a closed group of users. An early public version of the software should be available before February. There were no plans for a Linux or Mac version. Sloncek said that costs of writing the software will be paid for by adverts appearing in the finished version of the program. Despite Suprnova administrator Slncek's involvement with Exeem, the basic technology appears to have been developed by a firm called Swarm Systems that is based on Caribbean island Saint Kitts and Nevis. Users of the Exeem system will be able to rate files being swapped to help stop the spread of fake files, Slncek told Novastream.", "hermes3:3b": "New file-swapping network (Exeem) being developed after legal attacks forced BitTorrent sites; avoids central tracker list which made them vulnerable to shutdowns.", "stablelm-zephyr:3b": "The development of a new file-swapping system, Exeem, has been forced by legal attacks on websites that helped people swap pirated films using BitTorrent. One site, Suprnova.org, was shut down by movie studios that launched a legal campaign against websites assisting with the sharing of pirated movies via the BitTorrent network. Now, Sloncek, who managed Suprnova.org, is preparing to release Exeem software which combines ideas from BitTorrent and Kazaa file-sharing systems. Unlike previous systems, Exeem will not maintain a centrally stored list of trackers, making it less vulnerable to legal action. Users of Exeem will be able to rate files being swapped to help stop the spread of fake files. However, Dr Johan Pouwelse, a researcher at Delft University of Technology studying peer-to-peer networks, said Exeem's rating system appears flawed and easy to manipulate with both fake files and fake ratings. Future versions of file-sharing systems are likely to incorporate some kind of distributed reputation system allowing moderators to prove their identities and rate which files are worth downloading.", "chatgpt-4o-latest": "Legal action against websites facilitating movie piracy has led to the development of Exeem, a new file-sharing network designed to be more resistant to shutdowns. Created by Sloncek, the former administrator of Suprnova.org, Exeem combines elements of BitTorrent and Kazaa, decentralizing tracker lists to avoid legal vulnerabilities. The software, developed by Swarm Systems, is currently in testing and will be ad-supported. However, experts like Dr. Johan Pouwelse warn that Exeem's rating system may be ineffective in preventing fake files, unlike Suprnova’s moderated approach. Despite legal crackdowns, many users have migrated to alternative tracker sites, maintaining high traffic levels.", "stablelm2:1.6b": "A new file-swapping network, Exeem, is being developed by a Caribbean firm after legal attacks forced the shutdown of existing networks like BitTorrent and Suprnova. Exeem avoids central control and relies on user-generated trackers to ensure files are of high quality. A software version will be released in late January, but there remain doubts about its ability to maintain this standard. The new network may struggle to replace popular systems like BitTorrent and Suprnova, which faced legal action due to pirated content sharing.", "granite3.1-dense:2b": "The creator of suprnova.org, a prominent BitTorrent tracker site, is developing a new file-swapping network called Exeem to evade legal actions targeting pirated movie and music sharing. Exeem combines elements from both BitTorrent and Kazaa systems, featuring decentralized trackers managed by all users instead of a central list, making it less susceptible to legal attacks. The software is under testing and an early public version is expected in February. Sloncek, the suprnova.org administrator, aims to release it for Windows initially, with plans for Linux and Mac versions potentially down the line.\n\nExperts like Dr. Johan Pouwelse from Delft University of Technology view Exeem as an evolution in file-sharing systems but acknowledge its limitations. They highlight that the rating system may be vulnerable to manipulation, allowing both fake files and ratings. Unlike Suprnova, where moderators ensured high-quality file sharing, Exeem might struggle with maintaining integrity due to this flaw.\n\nExperts predict future file-sharing systems will integrate distributed reputation mechanisms that enable moderators to prove their identity and rate the quality of shared files. The competition among tracker listing sites has seen users migrate from Suprnova and other targeted sites to new, less regulated platforms as \"it's hard to compete with free.\" No official response was available from the Motion Picture Association of America regarding this development.", "reference": "Sloncek said that currently only a Windows version of the software was in development.Mr Pouwelse said that future versions of file-sharing systems are likely to incorporate some kind of distributed reputation system that lets moderators prove who they are to the network and rate which files are worth downloading.In an interview with Novastream web radio, Sloncek said Exeem would combine ideas from the BitTorrent and Kazaa file-sharing systems.Like BitTorrent, Exeem will have trackers that help point people toward the file they want.But, he said, it would struggle to be as popular as BitTorrent and Suprnova because early versions were not taking enough care to make sure good copies of files were being shared.When big files were being shared moderation systems were key, said Mr Pouwelse.\"The rating system in Exeem seems flawed because it is easy to insert both fake files and fake ratings,\" he said.This, said Sloncek, should make the system less vulnerable to legal action aimed at stopping people swapping pirated movies and music.One of the sites shut down by the legal campaign was suprnova.org which helped boost the popularity of the BitTorrent system by checking that trackers led to the movies or TV programmes they claimed to.\"The moderators are the difference between having a system that works and one that's full of crap like Kazaa,\" he said.Users of the Exeem system will be able to rate files being swapped to help stop the spread of fake files, Sloncek told Novastream.\"Exeem cannot prevent pollution,\" he said.He said that costs of writing the software will be paid for by adverts appearing in the finished version of the program.One site behind the success of the BitTorrent file-swapping system is producing its own software that avoids the pitfalls of the earlier program."}