{"raw_text": "Rivals of the £400 Apple...\n \n The Mac mini is the cheapest Apple computer ever. But though it is cheap for a Mac how does it compare to PCs that cost about the same amount? Dot.life tries to find out if you can you get more for your money if you stick with the beige box.\n \n \n \n \n \n An extremely small computer that is designed to bring the Macintosh to the masses.\n \n Apple offer a less powerful Mac Mini for £339 but the £399 models has a 1.4ghz Power PC chip, 80 gigabyte hard drive, combined CD burner/DVD player. It comes equipped with USB and Firewire ports for peripheral connections, Ethernet port for broadband, a port for standard video output and an audio/headphone jack.The machine comes with Mac OS X, the Apple operating system, the software suite iLife, which includes iTunes, iPhoto, iMovie, iDVD and GarageBand.\n \n A monitor, keyboard or mouse. There is also no built-in support for wireless technology or any speakers. The lack of a DVD burner is an omission in the age of backing-up important software. Wireless and a dvd burner can be added at extra cost.\n \n Apple are targeting people who already have a main computer and want to upgrade - especially PC users who have used an Apple iPod.\n \n Compact and stylish, the Mac mini would not look out of place in any home. Apple computers are famously user friendly and offer much better network security, which means fewer viruses. The package of software that comes with the machine is the best money can buy.\n \n The Mac mini is just a box. If you don't already have a monitor etc, adding them to the package sees the value for money begin to dwindle. Macs don't offer the upgrade flexibility of a PC and the machine's specifications lack the horse power for tasks such as high-end video editing or games.\n \n \"The Mac Mini puts the Macintosh within the reach of everyone,\" an Apple spokesman said. \"It will bring more customers to the platform, especially PC users and owners.\"\n \n \n \n An entry-level machine designed for basic home use.\n \n A 2.6ghz Intel Celeron chip, 40 gigabyte hard drive, 256mb, combined CD burner/DVD player. It comes equipped with a 17 inch monitor, keyboard and mouse. The machine has 6 USB ports and an Ethernet port for broadband connection. There's also a port for standard video output. The machine comes with Windows XP home edition. It provides basic home tools such as a media player and word processor.\n \n A DVD burner, or any wireless components built in. Wireless and a dvd burner can be added at extra cost.\n \n Homes and small offices, including those looking to add a low cost second computer.\n \n Cost is the clear advantage. The Dell provides enough power and software for basic gaming and internet surfing. It's easily upgradeable so a bigger hard drive, better sound and graphics cards can be added.\n \n The Dell is hardly stylish and the hard drive is on the small size for anyone wanting to store photos or a decent sized digital music collection.\n \n \"This machine is for small businesses and for people who want a second computer for basic home use, perhaps in a kids bedroom,\" a spokesman for Dell said. \"I think we offer better value once you realise all the extras needed for the Mac Mini.\"\n \n \n \n A desktop computer that PC Pro magazine dubbed best performer in a group test of machines that cost only £399 (£469 including VAT).\n \n A good basic PC that, according to PC Pro, has \"superb upgrade potential\". For your money you get a 1.8GHz AMD Sempron processor, 512MB of Ram, 120GB hard drive, DVD writer, 16-inch monitor, mouse, keyboard and Windows XP2\n \n Much more than the basics. It cannot handle 3D graphics and has no Firewire slots.\n \n Those on a limited budget who want a machine they can add to and improve as their cash allows.\n \n It's cheap and has plenty of room to improve but that could end up making it expensive in the long run. It's a good basic workhorse.\n \n It's not pretty and has a monitor rather than a flat-panel display. Some of the upgrades offered by JAL to the basic model are pricey. You might find that you want to chop and change quite quickly.\n \n Nick Ross, deputy labs editor at PC Pro, said the important point about buying a cheap and cheerful PC is the upgrade path. Interest has switched from processor power to graphics and sound cards as that's what makes the difference in games. \"Even manufacturers are not going to be marketing machines as faster,\" he said, \"they'll emphasise the different features.\"\n \n \n \n A computer built from bits you buy and put together yourself.\n \n A surprisingly good PC sporting an AMD Athlon XP 2500 processor, 512 megabytes Ram, a graphics card with 128 Ram on board plus TV out, a 40 GB hard drive, CD-writer and DVD player, Windows XP Home.\n \n Anything else. You're building it so you have to buy all the software you want to install and do your own trouble-shooting and tech support. Building your own machine is easier than it used to be but you need to read specifications carefully to make sure all parts work together.\n \n Experienced and keen PC users. Building your own PC, or upgrading the one you have, is a great way to improve your understanding of how it all works.\n \n It's cheap, you can specify exactly what you want and you get the thrill of putting it together yourself. And a bigger thrill if everything works as it should.\n \n Once it's built you won't be able to do much with it until you start buying software for it. If it starts to go wrong it might take a lot of fixing. As Gavin Cox of the excellent buildyourown.org.uk website put it: \"It will be tough to obtain/build a PC to ever be as compact and charming as the Mac mini.\"\n \n \"Performance-wise, it's not 'cutting edge' and is barely entry-level by today's market, but up against the Mac mini, I believe it will hold its own and even pull a few more tricks,\" says Gavin Cox. The good news is that the machine is eminently expandable. By contrast, says Mr Cox, the Mac mini is almost disposable.\n", "llama3.2:1b": "The article discusses Apple's Mac Mini computer, a compact and stylish device designed for basic home use.\n\nThe Mac Mini is available in two models: one priced at £339 with a 1.4GHz Power PC chip, while another model costs £399 and has a 1.4GHz processor, 80GB hard drive, and DVD burner/DVD player.\n\nKey features of the Mac Mini include:\n\n* Compact and stylish design\n* User-friendly operating system (Mac OS X)\n* Basic software suite (iLife) including iTunes, iPhoto, and GarageBand\n* No wireless technology or speakers included\n\nThe article also compares the Mac Mini to other options available for around the same price, such as Dell's entry-level computers.\n\nThe main advantages of the Mac Mini are:\n\n* Lower cost compared to other comparable PCs\n* Upgrade flexibility (ability to add more powerful components later)\n* Good performance for basic home use (although not suitable for demanding tasks)\n\nHowever, the article also notes that:\n\n* The machine lacks advanced features such as high-end video editing or gaming capabilities\n* Users will need to add additional software and hardware to create a fully functional computer", "llama3.2:3b": "The £400 Apple Mac mini vs PC options: \n\nMac mini - compact, user-friendly, but lacks upgrade flexibility and processing power for high-end tasks; ideal for basic home use with monitor, keyboard, and mouse already included.\n\nPC options include:\n\n- Dell - good value for basic gaming, internet surfing, but lacks style and has small hard drive; suitable for homes and small offices.\n- PC Pro's basic PC - offers \"superb upgrade potential\" and is a good basic workhorse, but not pretty and some upgrades can be pricey.\n- Custom-built PC - allows for specification of exactly what to buy, cheap, but requires reading specifications carefully to ensure parts work together; ideal for experienced users who want to improve their understanding of how it all works.", "gemma2:2b": "The text compares three low-cost computers: the Apple Mac Mini, Dell PC, and a build-your-own PC. \n\nThe **Mac Mini** is aimed at users who already have a main computer but want an upgrade. It offers macOS, iLife software, and a compact design for basic home use.  However, it lacks built-in wireless connectivity and DVD burner, and its upgrade flexibility is limited.\n\nThe **Dell PC** targets users seeking a second computer or those needing a low-cost machine with potential for upgrades. The Dell has Windows XP Home, enough power for basic tasks, and a good upgrade path for graphics and sound cards.  \n\nThe **build-your-own PC** allows for customization but requires technical knowledge and careful planning to ensure compatibility. It's aimed at experienced users who want full control over their PC's performance and features.\n\n\nOverall, the text highlights that each computer offers a different set of strengths and weaknesses depending on user needs and preferences. \n", "qwen2.5:0.5b": "The £400 Apple Mac Mini computer is cheap for an Apple MacBook Air but its features are better and it can handle more tasks than a Windows PC. The price difference may not be noticeable to most people as they have their own computers already, especially those who use Macs. However, building a PC from scratch is still worthwhile if you want to upgrade your computer quickly or improve the quality of your existing system.", "qwen2.5:1.5b": "**Summary:**\n\n- **Entry-Level Machines for Different Purposes:**\n  - Apple's \"Mac Mini\" offers a budget-friendly alternative to more powerful desktop and laptop models.\n  - Dell provides a mid-range machine that can handle gaming and advanced software tasks, while the Mac Mini is ideal for basic home use.\n  - A DIY option allows users to assemble their own computer from components.\n\n- **Pros and Cons of Each Option:**\n  - Apple's \"Mac Mini\" has better compatibility with existing equipment but lacks specific features.\n  - Dell offers power and upgrade flexibility but is less stylish and may not have additional features like wireless capabilities or a DVD burner.\n  - DIY PC allows for more customization, including upgrading components as needed.\n\n- **Comparison:**\n  - The Mac Mini comes with built-in software but has fewer advanced features compared to higher-end systems.\n  - The Dell offers better graphics performance and upgrades potential, making it suitable for professionals or those needing specific hardware enhancements.\n\nBoth options provide value based on their respective strengths, catering to different users' needs.", "qwen2.5:3b": "The text compares three computer options: the Mac Mini, a basic Dell PC, and an AMD-built PC. The Mac Mini offers better network security and software packages but lacks wireless and DVD burning capabilities. The Dell provides more power for gaming and internet use at similar cost, with upgrade potential. The AMD-built PC has good performance and expandability but no built-in speakers or graphics card support, making it less stylish and expensive to improve.", "opencoder:1.5b": "Rivals of the £400 Apple: An extremely small computer designed for basic home use.\n\nAn entry-level PC that PC Pro magazine dubbed best performer in a group test of machines that cost only £399 (£469 including VAT).\n\nA good basic PC with \"superb upgrade potential\".\n\nCost is the clear advantage. The Dell provides enough power and software for basic gaming and internet surfing, allowing easy upgrades.\n\nHomes and small offices, including those looking to add a low cost second computer.\n\nIt's cheap and has plenty of room to improve but that could end up making it expensive in the long run. It's a good basic workhorse.\n\nA desktop computer that PC Pro magazine dubbed best performer in a group test of machines that cost only £399 (£469 including VAT).\n", "smollm:1.7b": "The text summarization task involves identifying the main idea of each paragraph in the given text and then summarizing it into a concise summary. In this case, the main idea of each paragraph can be summarized as follows:\n\n1. The Mac Mini is an entry-level desktop computer that offers basic features at a lower price point compared to other desktop computers on the market.\n2. The Mac Mini has a compact design and is easy to set up and use, making it suitable for small businesses and individuals who want a reliable computer without breaking the bank.\n3. The Mac Mini is powered by Apple's latest processor, which provides fast performance and efficient power consumption.\n4. The Mac Mini comes with a 17-inch touchscreen display, which can be used to browse the internet, play games, and use other applications.\n5. The Mac Mini has a range of software options available for users, including Microsoft Office, Adobe Acrobat, and Adobe Photoshop.\n6. The Mac Mini is compatible with Apple's operating system, which provides a seamless user experience and easy integration with other Apple devices.\n7. The Mac Mini is designed to be expandable, allowing users to add more RAM, storage, and other components as needed.\n8. The Mac Mini has a range of features that make it suitable for both personal and professional use, including a touchscreen display, USB ports, and Wi-Fi connectivity.\n9. The Mac Mini is available in a range of configurations, including the base model, the iMac Pro, and the iMac Pro with Touch Bar.\n10. The Mac Mini is priced competitively compared to other desktop computers on the market, making it an attractive option for those who want a reliable computer without breaking the bank.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this pretty lengthy text about two Apple computers: the MacBook Air and the Mac mini. The user wants a concise summary that includes key ideas and details.\n\nFirst, I'll read through each section carefully to identify the main points. \n\nThe first paragraph introduces the MacBook Air as a very affordable option compared to other Macs. It's cost-effective for those looking to get their Mac computer without spending money upfront. Then it talks about how Apple is targeting PC users who have used an iPod, which makes sense because they're already familiar with Macs but might be switching.\n\nNext, the section on the MacBook Pro explains that it's a bit more powerful and suited for professionals like CAD workstations or video editing. It doesn't mention wireless tech or speakers since those are optional features, and adding them would cost extra.\n\nThen there's an entry-level Apple MacBook with specific specs: 2.6GHz Intel chip, 40GB hard drive, CD burner/DVD player, and a 17-inch monitor. It has Windows XP home edition software, which is user-friendly but doesn't offer much in terms of features. The mention of wireless tech or DVD burning being optional at extra cost is important.\n\nThe section about Dell computers mentions that they are good for basic home use and also offer wireless components, adding them would cost extra. They don't have a DVD burner because it's an omission, which might be a limitation since more software could be needed.\n\nThen there's another MacBook Pro section with 2.6GHz Intel, 512MB RAM, 120GB hard drive, and a 16-inch monitor. It comes with Windows XP Home Edition, similar to the previous model but has more memory. The user mentions that while it's great for basic tasks like gaming and internet browsing, it doesn't offer 3D graphics or Firewire slots.\n\nThe next part talks about the Dell laptop having an AMD Sempron processor, which is a bit older compared to Intel chips in this range. It uses 512MB RAM but has no FireWire slots. This makes it less suitable for gaming and video editing, which require those components.\n\nThen the text introduces a desktop PC called the Mac Pro, described as the best performer in a group test comparing machines costing £399. It's aimed at small businesses or people looking to upgrade their PC, especially with features like better upgrades like graphics cards and Firewire slots that are pricey.\n\nThe section about JAL mentions that it can add options like 16-bit processors, graphics cards, and sound cards but adds those features at an extra cost. Building a good computer is time-consuming because you have to purchase all the software and tools upfront, which could be expensive in the long run if you need better performance.\n\nNick Ross notes that building a PC can make it more versatile and efficient compared to buying new hardware each time, though it might get pricey over time. The user experience of building one is challenging but rewarding when everything works correctly.\n\nLastly, there's a summary about how building a computer can be easier than buying new hardware because you don't have to replace all the parts every month. You just put together what you already own, which is more efficient and can lead to better troubleshooting in case of issues. Experience plays a big role here as users gain more understanding through this process.\n\nPutting it all together, I need to condense each section into key points, ensuring that all major features and market positions are covered. The summary should be clear, concise, and capture the essence of each computer model's value and appeal.\n</think>\n\n**Summary of Apple Computers: MacBook Air, MacBook Pro, and Mac mini**\n\n- **MacBook Air**: Affordable for a Mac, cost-effective for those targeting professional tasks like CAD workstations or video editing. Targets PC users already familiar with Macs, aiming to attract those upgrading to PCs.\n\n- **MacBook Pro**: Offers more power compared to the entry-level model, suitable for professionals. Includes wireless technology and optional features like DVD burning at extra cost.\n\n- **Entry-Level MacBook**: 2.6GHz Intel chip, 40GB hard drive, CD/DVD burner, 17-inch monitor. Windows XP Home Edition software—user-friendly but lacks advanced features; ideal for basic tasks.\n\n- **Dell Laptop**: Features an older AMD Sempron processor, 512MB RAM, and no FireWire slots. Suitable for basic home use and professional computing needs like video editing or gaming.\n\n- **Mac Pro**: Emphasizes performance in a budgeted test, aimed at small businesses or PC users seeking upgrades. Includes features like graphics cards and Firewire slots, but adds these at extra cost through JAL.\n\n- **JAL Add-ons**: Adds 16-bit processors, graphics cards, and sound cards; features are optional with higher costs.\n\n- **Building a Computer**: Time-consuming process requiring purchase of software and tools upfront. Offers versatility by building your own PC, which is more efficient than buying new hardware each time. Experience significantly enhances understanding, as users gain insights through hands-on building.", "tinyllama:1.1b": "The Rival PCs for £400 Apple Mac mini are the Deluxe (£399) and the Rival (£469). They offer up to twice the power of the base model, a DVD burner, better video output compatibility, USB ports for peripherals, an Ethernet port for broadband connection, a 1.8GHz AMD Sempron processor, 512MB RAM, a 120GB hard drive, a DVD writer, a monitor, keyboard and mouse, a 40-inch TV out, a CD-writer and DVD player, Windows XP2, and a monoblock with USB and Firewire ports. They come in two variants: the Deluxe has 6 USB ports, whereas the Rival has four. Both models have no built-in support for wireless technology or any speaker, but they can be added at extra cost. Compared to PCs that cost only £399 (£469 including VAT), these computers offer better performance and expandability with features such as a media player and word processor. However, they cannot handle 3D graphics and have no Firewire slot, so users can upgrade their machines quickly. Nick Ross, deputy lab editor at PC Pro, recommends them for those on a limited budget but looking to improve the machine soon.", "tinydolphin:1.1b": " User's summary: This statement is comparing the new Mac Mini to the older Macintosh models and stating that it is \"barely entry-level by today's market,\" while also comparing its performance with the Mac mini. Although the comparison might be unfavorable for those who prefer a Mac Mini due to its lack of high-end features, this summary does not reflect the overall value or experience of using a Mac compared to other products.", "phi:2.7b": " The article discusses the differences between Apple's Mac Mini and PC computers that cost the same amount. It highlights the advantages of each, with the Mac Mini being the cheapest Apple computer ever but lacking in power compared to PCs. The Mac Mini is designed for people who already have a main computer and want to upgrade their setup, while the Dell offers more customizable options at a lower price. PC Pro magazine praised the performance of Windows XP 2 machines, while the cost-conscious consumer may prefer building their own computer. While it's easy to build your own PC or upgrade an existing one, it requires technical expertise and can be time-consuming.\n", "orca-mini:3b": " The Mac mini is an entry-level computer designed for basic home use, priced at £399 with a 2.6GHz Intel Celeron chip, 40GB hard drive, 512MB RAM, combined CD burner/DVD player, 17 inch monitor, keyboard and mouse, and Windows XP home edition. It lacks a built-in wireless technology or speakers and requires an extra cost for additional components. The machine is also not equipped with a DVD burner or any other Firewire slots, making it less versatile than competing products. However, it is relatively affordable and offers good value for money if you are looking to expand its capabilities later on.", "hermes3:3b": "Summary of Apple Mac Mini comparison:\n\n* Compares price to PCs costing around £400.\n* Discusses Mac mini's features and software bundle.\n* Mentions limitations like lack of upgrade flexibility and less processing power for tasks like video editing or gaming.\n* Considers Mac mini as entry-level machine for basic home use.\n* Highlights PC Dell as more cost-effective with better upgrades once realized. \n* Reviews other cheap PCs (Dell, JAL) based on their performance in a group test by PC Pro magazine and their upgrade potential.\n* Recommends building your own PC due to its advantages like being custom-built, affordable, and fun, though it requires reading specifications carefully.\n* Concludes that while the Mac mini might be compact and charming, PCs can outperform it in terms of expandability and overall performance.", "stablelm-zephyr:3b": "The text compares the Apple Mac Mini, Dell Inspiron 1000, and JAL PC-B450L in terms of price, performance, features, and user experience. The Mac Mini is an inexpensive option with basic features but lacks a DVD burner and some software. The Dell Inspiron 1000 offers more power for gaming and internet use but at a higher cost. The JAL PC-B450L allows customization and upgrade options but requires the buyer to install and troubleshoot software themselves. Overall, each computer has its advantages depending on the user's needs and preferences.", "chatgpt-4o-latest": "The Mac mini is Apple's most affordable computer, designed to attract PC users, especially iPod owners. The £399 model includes a 1.4GHz PowerPC chip, 80GB hard drive, and iLife software but lacks a monitor, keyboard, mouse, and built-in wireless. It is compact, stylish, and secure but lacks upgrade flexibility and high-end performance.\n\nA Dell PC with a 2.6GHz Intel Celeron, 40GB hard drive, and 17-inch monitor offers better value with included peripherals and upgrade potential, though it lacks style and has limited storage.\n\nA JAL PC with a 1.8GHz AMD Sempron, 120GB hard drive, and DVD writer is praised for its upgrade potential but lacks 3D graphics and Firewire slots. It is a good budget option but may become costly with upgrades.\n\nBuilding a custom PC with an AMD Athlon XP 2500, 512MB RAM, and a graphics card offers flexibility and affordability but requires technical knowledge and additional software purchases. It is expandable but lacks the compact design of the Mac mini.\n\nOverall, the Mac mini is stylish and user-friendly but less cost-effective compared to similarly priced PCs, which offer better upgrade options and included peripherals.", "stablelm2:1.6b": "The Mac Mini is the cheapest Apple computer ever, designed for basic home use. It offers less powerful models compared to PCs with a 1.4GHz Power PC chip and a gigabyte hard drive, combined CD burner/ DVD player. The package of software that comes with the machine is considered the best money can buy. However, it lacks upgrade flexibility, making it unsuitable for high-end tasks such as video editing or games.\n\nFor those looking to add a low-cost second computer, the Dell offers better value with upgrades for both hardware and software. It provides enough power and software for basic gaming and internet surfing. In comparison, building your own machine using bits you buy and put together yourself is easier but requires careful reading of specifications to ensure all parts work together.\n\nOverall, the Mac Mini and the Dell offer cost advantages, with cost being the clear advantage. The choice ultimately depends on personal preferences, needs, and budgets.", "granite3.1-dense:2b": "The text compares the Mac mini, Apple's least expensive computer, to PCs priced similarly. The £399 Mac mini features a 1.4GHz PowerPC chip, 80GB hard drive, and comes with Mac OS X and iLife suite. It lacks a DVD burner and wireless technology but can be upgraded with these features at additional cost. Apple targets this model for people already using a primary computer, particularly PC users who have used an Apple iPod.\n\nIn contrast, the £349 Dell model offers a 2.6GHz Intel Celeron chip, 40GB hard drive, and comes with Windows XP Home Edition. It includes a 17-inch monitor, keyboard, and mouse, along with six USB ports and an Ethernet port for broadband. The Dell is more upgradable, providing better performance for gaming and internet surfing, and it can accommodate larger hard drives, improved graphics cards, and sound cards.\n\nA £349 desktop PC from JAL boasts a 1.8GHz AMD Sempron processor, 512MB RAM, 120GB hard drive, DVD writer, 16-inch monitor, mouse, keyboard, and Windows XP Home. While it has more features than the basic model, its performance is limited due to insufficient graphics and sound cards for 3D gaming. This PC offers excellent upgrade potential but could become expensive over time if users frequently modify components.\n\nLastly, a self-built PC with an AMD Athlon XP 2500 processor, 512MB RAM, 128MB graphics card, 40GB hard drive, CD/DVD writer, and Windows XP Home is a budget-friendly option for experienced users. This PC allows customization of components but requires all software to be purchased separately, and troubleshooting and technical support will be the user's responsibility.\n\nIn summary, the Mac mini caters to those seeking an entry-level device with better network security and user-friendly software. The Dell provides more performance for multimedia tasks and has superior upgrade potential. The JAL PC offers a balance of features and upgradability at a lower price but may become expensive as users enhance its capabilities. The self-built PC appeals to experienced users who desire customization and the learning experience that comes with assembling it themselves, although it lacks cutting-edge performance and has potential complications for troubleshooting.", "reference": "Apple offer a less powerful Mac Mini for £339 but the £399 models has a 1.4ghz Power PC chip, 80 gigabyte hard drive, combined CD burner/DVD player.A good basic PC that, according to PC Pro, has \"superb upgrade potential\".\"This machine is for small businesses and for people who want a second computer for basic home use, perhaps in a kids bedroom,\" a spokesman for Dell said.The Mac mini is the cheapest Apple computer ever.For your money you get a 1.8GHz AMD Sempron processor, 512MB of Ram, 120GB hard drive, DVD writer, 16-inch monitor, mouse, keyboard and Windows XP2  Much more than the basics.Apple are targeting people who already have a main computer and want to upgrade - especially PC users who have used an Apple iPod.A desktop computer that PC Pro magazine dubbed best performer in a group test of machines that cost only £399 (£469 including VAT).The package of software that comes with the machine is the best money can buy.A surprisingly good PC sporting an AMD Athlon XP 2500 processor, 512 megabytes Ram, a graphics card with 128 Ram on board plus TV out, a 40 GB hard drive, CD-writer and DVD player, Windows XP Home.An entry-level machine designed for basic home use.The Mac mini is just a box.Wireless and a dvd burner can be added at extra cost.It comes equipped with USB and Firewire ports for peripheral connections, Ethernet port for broadband, a port for standard video output and an audio/headphone jack.The machine comes with Mac OS X, the Apple operating system, the software suite iLife, which includes iTunes, iPhoto, iMovie, iDVD and GarageBand.As Gavin Cox of the excellent buildyourown.org.uk website put it: \"It will be tough to obtain/build a PC to ever be as compact and charming as the Mac mini.\"\"The Mac Mini puts the Macintosh within the reach of everyone,\" an Apple spokesman said.The machine comes with Windows XP home edition.\"I think we offer better value once you realise all the extras needed for the Mac Mini.\"Compact and stylish, the Mac mini would not look out of place in any home.Nick Ross, deputy labs editor at PC Pro, said the important point about buying a cheap and cheerful PC is the upgrade path.The machine has 6 USB ports and an Ethernet port for broadband connection.A DVD burner, or any wireless components built in.Those on a limited budget who want a machine they can add to and improve as their cash allows.By contrast, says Mr Cox, the Mac mini is almost disposable.But though it is cheap for a Mac how does it compare to PCs that cost about the same amount?Macs don't offer the upgrade flexibility of a PC and the machine's specifications lack the horse power for tasks such as high-end video editing or games."}