{"raw_text": "Format wars could 'confuse users'\n \n Technology firms Sony, Philips, Matsushita and Samsung are developing a common way to stop people pirating digital music and video.\n \n The firms want to make a system that ensures files play on the hardware they make but also thwarts illegal copying. The move could mean more confusion for consumers already faced by many different, and conflicting, content control systems, experts warned. They say there are no guarantees the system will even prevent piracy.\n \n Currently many online stores wrap up downloadable files in an own-brand control system that means they can only be played on a small number of media players. Systems that limit what people can do with the files they download are known as Digital Rights Management systems. By setting up the alliance to work on a common control system, the firms said they hope to end this current fragmentation of file formats. In a joint statement the firms said they wanted to let consumers enjoy \"appropriately licensed video and music on any device, independent of how they originally obtained that content\". The firms hope that it will also make it harder for consumers to make illegal copies of the music, movies and other digital content they have bought. Called the Marlin Joint Development Association, the alliance will define basic specifications that every device made by the electronics firms will conform to. Marlin will be built on technology from rights management firm Intertrust as well as an earlier DRM system developed by a group known as the Coral Consortium.\n \n The move is widely seen as a way for the four firms to decide their own destiny on content control systems instead of having to sign up for those being pushed by Apple and Microsoft. Confusingly for consumers, the technology that comes out of the alliance will sit alongside the content control systems of rival firms such as Microsoft and Apple. \"In many ways the different DRM systems are akin to the different physical formats, such as Betamax and VHS, that consumers have seen in the past,\" said Ian Fogg, personal technology and broadband analyst at Jupiter Research. \"The difference is that it is very fragmented,\" he said. \"It's not a two-horse race, it's a five, six, seven or even eight-horse race\" Mr Fogg said consumers had to be very careful when buying digital content to ensure that it would play on the devices they own. He said currently there were even incompatibilities within DRM families. Although initiatives such as Microsoft's \"Plays for Sure\" program could help remove some of the uncertainty, he said, life was likely to be confusing for consumers for some time to come.\n \n Shelley Taylor, analyst and author of a report about online music services, said the locks and limits on digital files were done to maximise the cash that firms can make from consumers. Apple's iTunes service was a perfect example of this, she said. \"Although iTunes has been hugely successful, Apple could not justify its existence if it did not help sell all those iPods,\" she said.\n \n She said rampant competition between online music services, of which there are now 230 according to recent figures, could drive more openness and freer file formats. \"It always works out that consumer needs win out in the long run,\" she said, \"and the services that win in the long run are the ones that listen to consumers earliest.\" Ms Taylor said the limits legal download services place on files could help explain the continuing popularity of file-sharing systems that let people get hold of pirated pop. \"People want portability,\" she said, \"and with peer-to-peer they have 100% portability.\" Cory Doctorow, European co-ordinator for the Electronic Frontier Foundation which campaigns for consumers on many cyber-rights issues, expressed doubts that the Marlin system would achieve its aims. \"Not one of these systems has ever prevented piracy or illegal copying,\" he said. He said many firms readily admit that their DRM systems are little protection against skilled attackers such as the organised crime gangs that are responsible for most piracy. Instead, said Mr Doctorow, DRM systems were intended to control the group that electronics firms have most hold over - consumers. \"The studios and labels perceive an opportunity to sell you your media again and again - the iPod version, the auto version, the American and UK version, the ringtone version, and so on.\"\n", "llama3.2:1b": "Sony, Philips, Matsushita, and Samsung are forming a joint venture called Marlin Joint Development Association to create a common system for controlling digital content. The goal is to prevent piracy by making files playable only on specific hardware. However, experts say this may lead to more confusion for consumers as they face conflicting content control systems from different companies.\n\nThe alliance aims to define basic specifications that devices made by the electronics firms will conform to, while allowing for some flexibility in how files can be used. This could make it harder for consumers to make illegal copies of music and other digital content they have purchased.\n\nWhile the alliance may help reduce fragmentation among file formats, experts say there are no guarantees it will prevent piracy or that users will not be confused by conflicting systems. The alliance is seen as a way for electronics firms to decide their own destiny on content control systems rather than being forced to use those recommended by companies like Apple and Microsoft.\n\nThe technology could lead to incompatibilities within DRM families, making it difficult for consumers to buy digital content across different devices. Companies like iTunes have already been successful despite their limits, suggesting that open file formats may be more effective in the long run.", "llama3.2:3b": "Firms such as Sony, Philips, Matsushita and Samsung are developing a common digital rights management system to prevent piracy. The system aims to ensure files play on compatible hardware but is unlikely to guarantee prevention of piracy. Industry experts warn that consumers will face confusion due to conflicting systems. Analysts believe the move is driven by firms' desire to maximize profits from digital content sales, while others argue that increased competition and consumer demand for portability could lead to more openness in file formats.", "gemma2:2b": "Sony, Philips, Matsushita, and Samsung are forming a group called Marlin to create a common digital content control system that will allow files to play on any device. This move could lead to more confusion for consumers who already face conflicting DRM systems from different companies.  The alliance hopes to make it harder for people to illegally copy their purchased media, but experts doubt it will be completely effective in preventing piracy. \n", "qwen2.5:0.5b": "Key ideas:\n- Four technology firms are developing a common system for digital music and video files.\n- The firm hopes it will allow consumers to enjoy \"appropriately licensed\" content from any device, independent of how they obtained it.\n- The technology would make it harder for users to copy or distribute unauthorized content.\n- Apple's iTunes service has been criticized as one example of a file-sharing system that lets people get hold of pirated music.\n- DRM systems are intended to protect consumers' rights over their personal and digital data, but some experts say they aren't always effective in preventing piracy.", "qwen2.5:1.5b": "Four tech giants Sony, Philips, Matsushita, and Samsung are forming a consortium aimed at creating a universal digital rights management system that prevents pirating but could confuse consumers. The move is meant to end fragmentation of content control systems used for downloadable files and make it harder for people to pirate purchased music and videos. However, experts warn there's no guarantee the new system will prevent piracy, and confusion for consumers remains possible.", "qwen2.5:3b": "Format wars could 'confuse users'\nTechnology firms Sony, Philips, Matsushita, and Samsung are creating a common system to stop digital music and video piracy. The goal is to ensure files play on specific devices but prevent unauthorized copying. Experts warn this move may cause confusion for consumers dealing with many conflicting DRM systems. Currently, online stores wrap content in their own DRM systems, limiting file use. The Marlin Joint Development Association aims to set basic specifications for all devices, built on Intertrust technology and Coral Consortium's earlier system. This could lead to the creation of a new fragmented ecosystem alongside existing DRM systems from competitors like Microsoft. Analysts suggest this may result in confusion for consumers buying digital content. Some argue that DRM locks are meant to maximize cash flow for firms, while others believe competitive pressures will encourage openness. Critics doubt the effectiveness of these systems and suggest they are mainly designed to control consumer access rather than prevent piracy.", "opencoder:1.5b": "Format wars could confuse users.\n\nTechnology firms Sony, Philips, Matsushita and Samsung are developing a common way to stop people pirating digital music and video. The firms want to make a system that ensures files play on the hardware they make but also thwarts illegal copying. The move could mean more confusion for consumers already faced by many different, and conflicting, content control systems, experts warned.\n\nThere are no guarantees the system will even prevent piracy. Currently many online stores wrap up downloadable files in an own-brand control system that means they can only be played on a small number of media players. Systems that limit what people can do with the files they download are known as Digital Rights Management systems. By setting up the alliance to work on a common control system, the firms hope to end this current fragmentation of file formats.\n\nIn a joint statement the firms said they wanted to let consumers enjoy \"appropriately licensed video and music on any device, independent of how they originally obtained that content\". The firms hope that it will also make it harder for consumers to make illegal copies of the music, movies and other digital content they have bought. Called the Marlin Joint Development Association, the alliance will define basic specifications that every device made by the electronics firms will conform to. Marlin will be built on technology from rights management firm Intertrust as well as an earlier DRM system developed by a group known as the Coral Consortium.\n\nThe move is widely seen as a way for the four firms to decide their own destiny on content control systems instead of having to sign up for those being pushed by Apple and Microsoft. Confusingly for consumers, the technology that comes out of the alliance will sit alongside the content control systems of rival firms such as Microsoft and Apple.\n\nIan Fogg, personal technology and broadband analyst at Jupiter Research said, \"The difference is that it is very fragmented,\" he said. \"It's not a two-horse race, it's a five, six, seven or even eight-horse race\" Mr Fogg said consumers had to be very careful when buying digital content to ensure that it would play on the devices they own.\n\nCory Doctorow, European co-ordinator for the Electronic Frontier Foundation which campaigns for consumers on many cyber-rights issues, expressed doubts that the Marlin system would achieve its aims. \"Not one of these systems has ever prevented piracy or illegal copying,\" he said, \"and the services that win in the long run are the ones that listen to consumers earliest.\" Shelley Taylor, analyst and author of a report about online music services, said the limits legal download services place on files could help explain the continuing popularity of file-sharing systems that let people get hold of pirated pop. \"People want portability,\" she said, \"and with peer-to-peer they have 100% portability.\" Mr Doctorow, European co-ordinator for the Electronic Frontier Foundation which campaigns for consumers on many cyber-rights issues, expressed doubts that the Marlin system would achieve its aims.\n", "smollm:1.7b": "Summarize the following text concisely, preserving key ideas and details:\nTechnology firms Sony, Philips, Matsushita and Samsung are developing a common way to stop people pirating digital music and video. Format wars could 'confuse users'", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Sony, Philips, Matsushita, and Samsung developing a technology to stop piracy. First, I'll read through all the key points to make sure I understand each part.\n\nThe main idea is that these tech firms are collaborating to create a system that prevents pirating digital music and video. They aim to fix issues like different content control systems found in various stores. The system they're building is called Marlin, which works on a common control system across all devices. This could lead to confusion for consumers because it's not being used by many existing services.\n\nI remember from the context that they want this system to let users use \"appropriately licensed\" files on any device without worrying about their original source. The firms are using InterTrust and Coral Consortium technologies as parts of this system. They also mentioned competitors like Microsoft and Apple, which adds to confusion for consumers because these companies are already involved with similar systems.\n\nAnother point is that the existing DRM systems in stores are too fragmented, causing issues for both users and customers. Apple and Microsoft have efforts to make their systems more secure against piracy, but the problem isn't just about security; it's also about how they manage different file formats.\n\nI should note the expert opinions: Fogg thinks consumers are confused because Marlin is alongside competing DRM systems. Taylor emphasizes that content limits come from firms selling their software, not freely choosing content control methods. Doctorow believes that even advanced DRM systems aren't enough to stop piracy, especially when skilled attackers can bypass them, and it's better for users to have their media available on multiple platforms rather than being limited.\n\nSo putting this all together, the summary should include the key points about the firms' collaboration, the system Marlin, its benefits for consumers, the competition from existing services, and the experts' perspectives on why this approach is challenging.\n</think>\n\nSony, Philips, Matsushita, and Samsung are collaborating to develop a technology called Marlin that ensures digital content can be played on any device without pirateware, aiming to eliminate current fragmentation in file formats. This system will unify file formats through a common control framework, potentially leading to confusion for consumers who already face competing DRM systems. Experts warn of the challenges this could pose, including increased confusion and uncertainty for users due to competition from existing services like iOS and macOS, which also use similar controls. The Marlin system aims to provide \"appropriately licensed content\" on any device but faces criticism for not effectively preventing piracy, especially with skilled attackers bypassing security measures. Experts highlight that while consumers want portability across devices, they still face legal restrictions, suggesting ongoing issues in digital rights management.", "tinyllama:1.1b": "The technology firm Sony, Philips, Matshita, and Samsung are working towards a system that ensures files can be played on specific media players, but it is still unclear if this will prevent piracy. The current fragmentation of file formats, known as Digital Rights Management (DRM), has led to confusion for consumer users, with different DRM systems affecting how files can be used or copied. The four firms aiming to create a common system will define basic specifications for every device they make, but the Marlin Joint Development Association is already working on its own DRM standard. Despite this, experts warn that current fragmentation of file formats may not prevent piracy as they are intended to control skillseters such as organized crime gangs responsible for most piracy. The digital music and video industry, with the support of the four firms, is aiming to create a \"five-six-seven-eight-horse race\" of different DRM systems that consumers need to be very careful about ensuring their files can be played on devices they own.", "tinydolphin:1.1b": " In summary, the Marlin Joint Development Association (JDA) is a consortium of electronics firms aiming to develop a common way for digital content distribution. By working together, the firms hope to stop pirating music and video by controlling how files are played on various devices. This joint effort could enable consumers to enjoy \"appropriately licensed\" video and music on any device, independent of the hardware it is originally made for. The firms behind the Marlin JDA include Sony, Philips, Matsushita, and Samsung.", "phi:2.7b": " Technology companies Sony, Philips, Matsushita, and Samsung are developing a common way to prevent piracy of digital music and video. The alliance aims to create a system that allows files to play on any device but also prevents illegal copying. However, experts warn this could confuse consumers who already have many different content control systems. There is no guarantee the system will work, and it may not even stop piracy completely. Marlin Joint Development Association plans to define basic specifications for devices made by these companies that will adhere to the new system. This move may allow the companies to make their own content control decisions instead of following those from rival firms like Apple and Microsoft. Confusion could arise as Marlin's technology sits alongside the digital control systems of other companies. Consumers need to be cautious when purchasing digital content to ensure it works on their devices. While initiatives like Microsoft's \"Plays for Sure\" program can help, there are still inconsistencies in DRM families. This confusion may be because these systems aim to maximize profits instead of providing a seamless experience for consumers. Many online music services have already created different file formats, making it difficult for consumers to keep track of what works on their devices. The constant competition between services may lead to more open and user-friendly file formats in the future. However, legal download services limit the portability of files, which is why file-sharing systems that allow piracy remain popular. Experts believe the key to success lies in listening to consumers' needs from the beginning rather than focusing on profits.\n", "orca-mini:3b": " Format wars and confusion could arise from Sony, Philips, Matsushita, and Samsung's joint development of a common way to stop people pirating digital music and video. The move aims to make it harder for consumers to make illegal copies of the content they have bought, but there are doubts about the system's effectiveness in preventing piracy. DRM systems are seen as fragmented and confusing for consumers, who may struggle to know which media players will play their downloaded files. The alliance between the electronics firms aims to define basic specifications that every device made by them will conform to, but there are concerns that rival firms like Apple and Microsoft may have a say in how the system is implemented. Some experts worry that the system could actually make it harder for consumers to enjoy legally bought content on their devices.", "hermes3:3b": "Format wars may cause confusion; 4 tech firms (Sony, Philips, Matsushita, Samsung) developing common DRM system to stop piracy and allow content play across devices.", "stablelm-zephyr:3b": "Technology companies Sony, Philips, Matsushita, and Samsung are developing a common system to stop digital piracy. The Marlin Joint Development Association aims to create a control system that ensures files can be played on their hardware while preventing illegal copying. However, experts warn this may lead to confusion for consumers due to the current fragmentation of content control systems. The alliance will define basic specifications for every device made by the participating companies and use technology from Intertrust and the Coral Consortium. This move allows the four firms to decide their own destiny on content control systems instead of signing up for those pushed by Apple and Microsoft.", "chatgpt-4o-latest": "Sony, Philips, Matsushita, and Samsung are collaborating to develop a unified Digital Rights Management (DRM) system to prevent digital piracy while ensuring compatibility across their devices. However, experts warn this could further confuse consumers already dealing with multiple, conflicting DRM systems. The Marlin Joint Development Association aims to standardize content control, but skepticism remains about its effectiveness in stopping piracy. Analysts argue that DRM primarily serves corporate interests by restricting consumer usage and maximizing profits, as seen with Apple's iTunes. Some believe that increasing competition among online music services may eventually lead to more open formats. Critics, including the Electronic Frontier Foundation, doubt DRM's ability to curb piracy, suggesting it mainly serves to repeatedly monetize content for consumers.", "stablelm2:1.6b": "Tech firms are working on a common system to combat piracy for digital music and video, as fragmentation of file formats continues. Sony, Philips, Matsushita, and Samsung aim to ensure files can be played on their hardware without legal copying issues. The Marlin Joint Development Association aims to define specifications that devices conform to, with technology from Intertrust and the Coral Consortium. This alliance could end content control system confusion for consumers; however, experts warn there are no guarantees it will prevent piracy.", "granite3.1-dense:2b": "Technology giants Sony, Philips, Matsushita (now part of Panasonic), and Samsung are forming the Marlin Joint Development Association to create a unified digital rights management (DRM) system for preventing piracy of music, videos, and other content. This alliance aims to ensure files play on their respective hardware while restricting illegal copying. The new DRM system, named Marlin, will set basic specifications that all devices made by these companies must adhere to, using technology from Intertrust and the Coral Consortium.\n\nExperts warn that this move could exacerbate consumer confusion due to the existing fragmentation of content control systems. Comparably, current DRM systems are likened to past physical formats like Betamax and VHS, with multiple vendors offering competing solutions. This fragmentation may persist even after adopting initiatives from dominant players like Microsoft (Plays for Sure) or Apple.\n\nCritics, including Ian Fogg of Jupiter Research and Shelley Taylor, analyst and author, argue that the primary purpose of these DRM systems is to maximize revenue for content providers rather than genuinely combating piracy. Cory Doctorow, European co-ordinator for the Electronic Frontier Foundation, doubts Marlin's ability to prevent piracy, citing that no existing DRM system has effectively stopped it. He contends that these systems primarily serve as tools to sell content in various formats to consumers.", "reference": "Instead, said Mr Doctorow, DRM systems were intended to control the group that electronics firms have most hold over - consumers.By setting up the alliance to work on a common control system, the firms said they hope to end this current fragmentation of file formats.He said many firms readily admit that their DRM systems are little protection against skilled attackers such as the organised crime gangs that are responsible for most piracy.Shelley Taylor, analyst and author of a report about online music services, said the locks and limits on digital files were done to maximise the cash that firms can make from consumers.\"Not one of these systems has ever prevented piracy or illegal copying,\" he said.In a joint statement the firms said they wanted to let consumers enjoy \"appropriately licensed video and music on any device, independent of how they originally obtained that content\".Ms Taylor said the limits legal download services place on files could help explain the continuing popularity of file-sharing systems that let people get hold of pirated pop.Confusingly for consumers, the technology that comes out of the alliance will sit alongside the content control systems of rival firms such as Microsoft and Apple.\"In many ways the different DRM systems are akin to the different physical formats, such as Betamax and VHS, that consumers have seen in the past,\" said Ian Fogg, personal technology and broadband analyst at Jupiter Research.The firms want to make a system that ensures files play on the hardware they make but also thwarts illegal copying.The move is widely seen as a way for the four firms to decide their own destiny on content control systems instead of having to sign up for those being pushed by Apple and Microsoft.The firms hope that it will also make it harder for consumers to make illegal copies of the music, movies and other digital content they have bought."}