{"raw_text": "What's next for next-gen consoles?\n \n The next generation of video games consoles are in development but what will the new machines mean for games firms and consumers? We may not know when they will be released, what they will be called or even what they will be able to do but one thing is certain - they are coming. Sony, Microsoft and Nintendo are all expected to release new machines in the next 18 months. The details of PlayStation 3, Xbox 2 (codename Xenon) and Nintendo's so-called Revolution are still to be finalised but developers are having to work on titles for the new machines regardless.\n \n \"We know maybe what the PS3 will do, but we can only guess,\" said Rory Armes, studio general manager for video game giant Electronic Arts in Europe. \"It's a horrendous effort in the first year,\" he admitted. Microsoft had delivered development kits to EA, said Mr Armes, but he said the company was still waiting on Sony and Nintendo to send kits. Although the details may not be nailed down, Mr Armes said EA was beginning to get a sense of the capabilities of the new machines. \"The rumours are that PlayStation 3 will have a little more under the hood [than Xbox 2],\" he said.\n \n \"Microsoft is obviously a software company first and foremost, while Sony has more experience in hardware. I think Sony will be able to push more into a box at cost.\"\n \n What is certain is that the new machines will provide great leaps in processing and graphical power. It is also likely that they will contain convergence technologies to make the machines more of an entertainment hub. At the Consumer Electronics Show in Las Vegas Microsoft boss Bill Gates said Xbox 2 would be part of his vision of the digital lifestyle. While short on detail, he painted a picture of a machine that would complement a PC and offer \"great video gaming but video gaming for a broader set of people, more communications, more media, more connectivity\". Sony is thought to have a similar vision for PS3 while Nintendo remain focused on a machine purely for games.\n \n Until it is clear precisely what the new machines can do, developers are working on a first round of titles to harness the new horsepower. Gary Dunn, development director at Codemasters, said the company had a central technology group which was at the forefront of preparing for the next generation of consoles. \"We are working on new libraries of effects. A lot of the major techniques are already out there and in use in PC gaming, such as pixel shaders and normal mapping.\"\n \n Mr Dunn said he expected the introduction of real-world physics to be a major part of the new consoles. \"We want to increase that level of immersion and realism in gaming to people can lose themselves in a game.\" In the first year at least, developers said gamers should not expect games which harness the full potential of the machines. Graphical spit and polish and better physics in line with the capabilities of current high-end graphics cards for PCs should be expected. Simon Gardner, president of Climax's Action Studio, said: \"It's definitely an exciting time. We want to give more freedom to the player. We want to give players an emotional connection to the characters they play. \"The environments will be much more believable and dramatic, growing and changing as you play. \"There will be a breadth of effects, more involving worlds to play in.\n \n \"It's a bit like being an artist and being given a bigger canvas and a smaller brush. We're being given more tools. \"For the average consumer, we can get things of a more filmic quality.\" Gerhard Florin, head of EA in Europe, said gamers should expect titles that blur the line between films and video games. Many will be sceptical - gamers were given similar predictions during the last transition of console hardware - but this time it would seem to be more likely. \"PS3 will provide graphics indistinguishable from movies,\" said Mr Florin. He said the distribution method for games would also change radically in the next round of consoles. \"A gamer could buy a starter disc for 10 euros. When he goes home he goes online and he could buy AI and levels as you go.\n \n \"It's much smarter if you can get levels as you go.\" Mr Armes warned that developers still had to learn how to tell stories effectively in the medium. \"In some ways we are trying to forget about the hardware, go in the opposite direction. We have been very bad at letting technology design our creativity. \"What we have to do as a company is start ignoring the technology and learning our craft in telling stories.\" Mr Gardner agreed: \"We can thrown more polygons around and have better AI but if it doesn't make for a better game then that's not very useful.\" Developers will certainly have the tools with the new machines, but how they employ them is still to be decided.\n", "llama3.2:1b": "next-gen consoles to be released in 18 months are expected from Sony, Microsoft, and Nintendo.\nthe details of what these consoles will be able to do are unclear.\ndevelopers are working on games that take advantage of improved processing power and graphical capabilities.\nit may take at least a year for some of the machines' features to become fully realized.\ndevelopment directors expect increased use of real-world physics in games, as well as more realistic graphics and gameplay mechanics.", "llama3.2:3b": "Next-generation consoles are in development by Sony, Microsoft, and Nintendo, expected to be released within 18 months. Details of capabilities and specs are still being finalized, but developers are working on titles for these new machines. The new consoles will offer significant processing and graphical power, as well as convergence technologies. Developers expect games with improved immersion, realism, and storytelling, with distribution methods that allow for digital downloads and online purchases.", "gemma2:2b": "New video game consoles from Sony, Microsoft, and Nintendo are in development and expected within the next 18 months.  Developers are working on titles for these new platforms despite uncertainties about their specific capabilities. These new consoles will offer significant leaps in processing power and graphical ability, potentially becoming entertainment hubs. Games will likely feature more realistic physics and immersive experiences. Developers believe a shift is taking place from purely gaming to filmmaking-style narratives with greater realism and visual fidelity.  The distribution method for games is expected to change drastically with downloadable content and subscription services. The focus will ultimately lie on crafting compelling stories that utilize the advancements in technology. \n", "qwen2.5:0.5b": "The next-generation video game consoles are in development, and their release time, title, and capabilities remain uncertain. Microsoft is expected to deliver the first Xbox 2 console development kits within the next year; Sony's PS3 is due for release sometime after 2015, while Nintendo's Revolution is still under development. Developers working on titles are beginning to test and develop games for the new machines, including those set in a more immersive digital world with graphical power similar to PC games.", "qwen2.5:1.5b": "The next-generation consoles are in development, though their release date, name, or capabilities remain uncertain. Sony, Microsoft, and Nintendo are expected to release new systems in about 18 months. Currently working on titles for these future consoles, developers focus on enhancing processing power and graphical capabilities while preparing for convergence technologies that make the machines into entertainment hubs. The PlayStation 3 is anticipated to offer more hardware performance compared to its predecessor Xbox 2. These new systems are expected to provide a broader range of entertainment options with improved real-world physics and immersive graphics, blurring the line between films and video games. As technology continues to advance, developers must adapt their storytelling techniques effectively without relying solely on the hardware capabilities.", "qwen2.5:3b": "The next generation of video games consoles—expected to be released by Sony, Microsoft, and Nintendo in the next 18 months—are anticipated to provide significant improvements in processing and graphical power. Developers are already preparing titles for these systems, though details regarding their capabilities remain unclear. Sony is expected to focus on hardware advancements, while Microsoft emphasizes software integration with other devices. The new consoles will likely feature convergence technologies for enhanced entertainment experiences, including more interactive environments and improved graphics quality. While developers aim to create games that maximize the machines' potential, initial releases are anticipated to offer polished visuals and enhanced physics simulations rather than full exploitation of these capabilities. There is also speculation about changes in game distribution methods, such as offering downloadable content instead of complete games at launch. Developers face a challenge in leveraging new technology without compromising their storytelling abilities, thus focusing on effective narrative development remains crucial for success with the next-gen consoles.", "opencoder:1.5b": "The next-generation video games consoles are in development, and what will they mean for gaming firms and consumers? We may not know when they will be released, what they will be called or even what they will be able to do but one thing is certain - they are coming.\n\nSony, Microsoft and Nintendo all expected to release new machines in the next 18 months. They are anticipated to have detailed specifications at a preliminary stage. It seems like they're all working towards reaching the full potential of each console. \n\nThe details of PlayStation 3, Xbox 2 (codename Xenon) and Nintendo's Revolution are still being finalized but developers are having to work on titles for the new machines regardless of their final release dates.\n\nRory Armes, a video game giant specializing in Electronic Arts in Europe, explained that it's an exciting time. He said that the introduction of real-world physics will certainly be a major part of the new consoles. \n\nGary Dunn, a developer at Codemasters, was interested in seeing more effects and technologies. This led to a broader range of games being produced which incorporate elements from the PC gaming environment.\n\nSimon Gardner, president of Climax's Action Studio, said that it’s definitely an exciting time for developers as they continue to experiment with new libraries of effects. \n\nAt present, many of the expectations made by Mr Armes and Mr Dunn seem unrealistic. They expect the introduction of real-world physics and more effects at a later stage but this is yet to be confirmed. The expectation is that games developed using the new consoles will have a breadth of effects, more involving worlds to play in.\n\nThe expected release dates for these consoles are predicted from Sony’s tech team's work with Microsoft and Nintendo. However, they do not say when it'll all be released but that they're aiming for a smooth transition from Xbox 2 (codename Xenon) and PS3 within the next 18 months.\n\nExpectations about the new machines' capabilities and graphical power will likely change as more games are developed using these consoles, with gamers expecting more complex simulations and 3D effects. Developers still have to work on titles which focus solely on older hardware technologies.\n", "smollm:1.7b": "The next generation of video games consoles are in development but what will the new machines mean for games firms and consumers? We may not know when they will be released, what they will be called or even what they will be able to do but one thing is certain - they are coming. Sony, Microsoft and Nintendo are all expected to release new machines in the next 18 months. The details of PlayStation 3, Xbox 2 (codename Xenon) and Nintendo's so-called Revolution are still to be finalised but developers are having to work on titles for the new machines regardless.\nThe rumours about the PS3 are a good example - it is likely that Sony will deliver more powerful hardware than the Xbox 2, but we may not know exactly what features it will have until it is released. Microsoft has already delivered development kits to EA, said Bill Gates, and codemasters is working on new libraries of effects. In the first year at least, developers said gamers should expect titles that blur the line between films and video games. For the average consumer, they would be able to buy a starter disc for 10 euros and go online to buy AI and levels as you went home.\nThe distribution method for games is also likely to change radically in the next round of consoles - developers will need to learn how to tell stories effectively in the medium. In some ways, we are trying to forget about the hardware and focus on our craft in telling stories. The next generation of consoles will undoubtedly bring new opportunities for game developers but it's too early to say what kind of impact they will have on the industry as a whole.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about the next-gen consoles in a concise way, focusing on key ideas and details. The user provided a detailed passage with examples from different companies like Sony, Microsoft, and Nintendo, discussing what's coming up.\n\nFirst, the main question is: What's next for next-gen consoles? I should capture that at the beginning. Then, I need to mention that the PS3, Xbox 2, and Nintendo's Revolution are expected by 2016, but details aren't known yet.\n\nI remember reading about Microsoft having a PC game library in their development kits, while Sony has experience with hardware, so they might push more graphical power. Nintendo is focused on gaming machines specifically for video games.\n\nThe text also talks about convergence technologies combining hardware and software, enhancing entertainment. Graphically, especially real-world physics and immersion are expected early on to make the players feel like they're part of a game.\n\nThere's a mention of Microsoft's vision with Xbox 2 integrating with PCs as a digital lifestyle, including media and connectivity. Sony is likely adopting similar approaches. Nintendo will focus solely on gaming machines.\n\nThe summary should highlight key points: release dates (2016), hardware vs software dominance, convergence tech, graphical advancements, and consumer reception of games evolving from films to games.\n</think>\n\nNext-gen consoles are expected to be developed by companies like Sony, Microsoft, and Nintendo, with the PS3, Xbox 2 (Xenon), and Nintendo's Revolution set for release by 2016. While their specific details are unknown, it is clear that hardware will dominate graphical power, while software will push video games into a more immersive, interactive realm. Convergence technologies, integrating hardware and software, promise enhanced entertainment. Graphically, immersion and realism will be key early on. Microsoft's vision for Xbox 2 includes gaming as a digital lifestyle with media integration. Sony is likely adopting similar approaches, while Nintendo focuses solely on gaming machines. The consumer reception favors evolving games from films to interactive experiences, aiming for immersive player engagement.", "tinyllama:1.1b": "The next generation of video games consoles is in development but what will the new machines mean for game developers and consumers? The details are not yet finalized, but the first round of titles being developed are focused on providing greater graphical power, including immersion and realism. Developers are working on titles that offer a breadth of effects, more involving worlds to play in, and films-quality graphics as they push for a wider range of effects, making for a better game experience overall. The new machines are expected to provide great leaps in processing and graphical power, which developers can use to make their games more immersive and believable. While there is still uncertainty about what the next generation of consoles will offer, developers are getting ready by working on titles that push for greater immersion and realism. The introduction of real-world physics is also expected in the first year at least, while graphical spit and polish, better physics, and more emotional connections with characters will also be expected.", "tinydolphin:1.1b": " The new gaming consoles are in development, and there are speculations about what games might look like and how they may work. However, we do know that Sony, Microsoft, and Nintendo are all expected to release new machines by the end of this year. These consoles will be powered by next-generation technology and have much greater processing capabilities compared to their predecessors.\n\nSony is rumored to be launching a machine known as PlayStation 3, while Microsoft's Xbox 2 (codename Xenon) is also expected to be released. Both companies are developing new machines that will be released in the next 18 months. In order to get a sense of what these new machines can do, it would be wise for developers to start working on titles for them without knowing exactly how they will look or what they will be able to do.\n\nNintendo is rumored to be releasing a machine called Revolution, which could offer more immersive gameplay and possibly include better graphics. However, the details are scarce at this time. As developers begin work on new games for these machines, it remains uncertain whether they will be able to push the boundaries of what can be achieved with the technology available today or if their designs will be constrained by hardware limitations.\n\nGiven the advancements in technology and the need for developers to experiment with new gameplay mechanics, it is likely that these new machines will provide great leaps in processing capabilities and graphical power. However, it is also true that the new machines may not offer a lot of entertainment value for casual gamers or may not appeal to fans of particular franchises.\n\nAs the new machines release, it is expected that we will begin to get a sense of how well they meet the expectations of consumers and whether they are worth the investment in technology. With the introduction of real-world physics and improved graphics technologies, developers are working on creating engaging new games that will have players invested in the storyline, characters, and levels.", "phi:2.7b": " The next generation of video games consoles are in development from Sony, Microsoft and Nintendo. Though the details haven't been finalized yet, developers are working on creating titles for these new machines that take advantage of the higher processing and graphical power they will provide. It's expected that these new consoles will offer convergence technologies to serve as an entertainment hub, similar to what Bill Gates has envisioned with Xbox 2. However, until it is clear precisely what the new machines can do, developers are preparing first-round games to harness the new horsepower. Games may not be at their full potential initially but will likely have better graphics and physics that are currently used in PC gaming. The introduction of real-world physics should also increase immersion in video games. There will also be more freedom for players to create emotional connections with characters and play in larger, more believable game environments. Developers will need to learn how to effectively tell stories in this new medium.\n", "orca-mini:3b": " Next-generation video games consoles are in development, and what they will mean for games firms and consumers is not yet clear. Sony, Microsoft, and Nintendo are all expected to release new machines within the next 18 months. These details may not be nailed down, but developers are already working on titles for the new machines regardless. The new machines will provide great leaps in processing and graphical power, and it is rumored that they will contain convergence technologies to make them more of an entertainment hub. Developers are expected to deliver games that blend filmic quality and emotional connection, with a breadth of effects, dynamic worlds, and personalized experiences. The distribution method for games may also change dramatically in the next round of consoles, with starter discs available for 10 euros, and gamers able to buy levels as they go. While developers are still learning how to tell stories effectively in the medium, the new machines offer a chance to push storytelling further.", "hermes3:3b": "Next-gen consoles development underway; expected to provide great leaps in processing power and graphical capabilities in next 18 months.", "stablelm-zephyr:3b": "Next-gen consoles from Sony, Microsoft, and Nintendo are in development, with expected releases within the next 18 months. The new machines will provide significant leaps in processing and graphical power, likely containing convergence technologies for a more entertainment hub function. Developers are working on titles for the new machines, but until the details are finalized, they are preparing for the introduction of the new consoles. Expectations include real-world physics, improved graphics indistinguishable from movies, and a shift in game distribution methods. The industry must also learn to tell stories effectively, focusing on creativity rather than relying solely on technology.", "chatgpt-4o-latest": "The next generation of video game consoles from Sony, Microsoft, and Nintendo is in development and expected within 18 months, though details remain uncertain. Developers are already working on titles despite incomplete specifications. Sony’s PlayStation 3 is rumored to be more powerful than Microsoft’s Xbox 2, while Nintendo remains focused on gaming rather than broader entertainment features. The new consoles will offer significant improvements in processing, graphics, and real-world physics, enhancing immersion and realism. Developers anticipate more film-like experiences and evolving game environments, though fully utilizing the hardware will take time. Digital distribution may change, allowing players to purchase game content incrementally. However, developers acknowledge the need to focus on storytelling rather than just technological advancements.", "stablelm2:1.6b": "The next generation of video game consoles is expected to be released by Sony, Microsoft, and Nintendo within the next few months. Although the specifics of these devices are yet to be determined, developers are already working on titles for the new machines. The upcoming consoles will provide great leaps in processing and graphical power, as well as contain convergence technologies to make them more entertainment hubs. Developers are working on first round of titles to harness the new horsepower, with real-world physics likely to be a major part of these devices in the first year at least. For consumers, this transition is expected to blur the line between films and video games, with many expecting PS3 to provide graphics indistinguishable from movies. The distribution method for games will also change radically, with gamers being able to buy starter discs online as they progress through levels.", "granite3.1-dense:2b": "Next-generation video games consoles from Sony, Microsoft (codename Xenon), and Nintendo are in development, anticipated for release within 18 months. Key features include enhanced processing and graphical power, convergence technologies to create entertainment hubs, and real-world physics for increased immersion. Developers like Electronic Arts, Codemasters, Climax's Action Studio, and EA Europe are preparing titles that leverage these capabilities. While full potential may not be realized immediately, gamers can expect improved graphics, better physics, and more engaging storytelling. The industry is moving towards a more cinematic gaming experience, with games potentially offering filmic quality graphics. Additionally, distribution methods may evolve to allow for purchasing game content incrementally, similar to software updates.", "reference": "Microsoft had delivered development kits to EA, said Mr Armes, but he said the company was still waiting on Sony and Nintendo to send kits.Although the details may not be nailed down, Mr Armes said EA was beginning to get a sense of the capabilities of the new machines.Mr Dunn said he expected the introduction of real-world physics to be a major part of the new consoles.Sony, Microsoft and Nintendo are all expected to release new machines in the next 18 months.Until it is clear precisely what the new machines can do, developers are working on a first round of titles to harness the new horsepower.The next generation of video games consoles are in development but what will the new machines mean for games firms and consumers?In the first year at least, developers said gamers should not expect games which harness the full potential of the machines.He said the distribution method for games would also change radically in the next round of consoles.Gary Dunn, development director at Codemasters, said the company had a central technology group which was at the forefront of preparing for the next generation of consoles.The details of PlayStation 3, Xbox 2 (codename Xenon) and Nintendo's so-called Revolution are still to be finalised but developers are having to work on titles for the new machines regardless.\"We know maybe what the PS3 will do, but we can only guess,\" said Rory Armes, studio general manager for video game giant Electronic Arts in Europe.\"PS3 will provide graphics indistinguishable from movies,\" said Mr Florin.What is certain is that the new machines will provide great leaps in processing and graphical power.Gerhard Florin, head of EA in Europe, said gamers should expect titles that blur the line between films and video games.\"It's much smarter if you can get levels as you go.\"When he goes home he goes online and he could buy AI and levels as you go.\"We want to increase that level of immersion and realism in gaming to people can lose themselves in a game.\"\"We are working on new libraries of effects."}