{"raw_text": "Latest Opera browser gets vocal\n \n Net browser Opera 8.0, due for official release at the end of next month, will be \"the most accessible browser on the market\", according to its authors.\n \n The latest version of the net browser can be controlled by voice command and will read pages aloud. The voice features, based on IBM technology, are currently only available in the Windows version. Opera can also magnify text by up to 10 times and users can create \"style sheets\", its developers say. This will enable them to view pages with colours and fonts that they prefer. But the browser does not yet work well with screen reader software often used by blind people, so its accessibility features are more likely to appeal to those with some residual vision. \"Our mission was always to provide the best internet experience for everyone,\" said Opera spokeswoman, Berit Hanson. \"So we would obviously not want to exclude disabled computer users.\"\n \n Another feature likely to appeal to people with low vision is the ability to make pages fit to the screen width, which eliminates the need for horizontal scrolling.\n \n The company points out that this will also appeal to anyone using Opera with a handheld device. The company says that features like voice activation are not solely aimed at visually impaired people. \"Our idea was to take a first step in making human-computer interaction more natural,\" said Ms Hanson. \"People are not always in a situation where they can access a keyboard, so this makes the web a more hands-free experience.\" Unlike commercially available voice recognition software, Opera does not have to be \"trained\" to recognise an individual voice. Around 50 voice commands are available and users will have to wear a headset which incorporates a microphone. The voice recognition function is currently only available in English. Opera is free to download but a paid-for version comes without an ad banner in the top right hand corner and with extra support. Opera began life as a research project - a spin-off from Norwegian telecoms company Telenor. Its browser is used by an estimated 10 million people on a variety of operating systems and a number of different platforms.\n", "llama3.2:1b": "Opera 8.0, due to be released next month, will allow users to control the browser with voice commands and read pages aloud. The feature is based on IBM technology and can magnify text by up to 10 times and create \"style sheets\" for improved page layout. The browser also has features such as screen reader compatibility and ability to make pages fit to the screen width. Opera aims to provide a natural interaction experience, including voice activation on handheld devices.", "llama3.2:3b": "Opera 8.0, set to release at the end of next month, will be the most accessible browser on the market with features such as voice control, text magnification, and adjustable screen width. Voice commands are available in English and do not require training, making human-computer interaction more natural for users who cannot access keyboards.", "gemma2:2b": "Opera 8.0, the latest version of the browser, will be available next month. It offers voice command control, text reading aloud, magnification up to 10 times, and customisable page styles.  Accessibility features are limited in their effectiveness for blind users. However, Opera aims to offer a more natural interaction with the web. Voice commands work with a microphone connected to a headset, though currently only in English. A paid version is available with no banner ad and additional support. \n", "qwen2.5:0.5b": "The latest version of the net browser, called Opera 8.0, has voice control capabilities that can read pages aloud using IBM technology. The developers say it will make web browsing more accessible to users with visual impairments, such as those who are blind or visually impaired. Although the browser is not yet fully functional, its accessibility features are likely to appeal to people with some residual vision and to people using Opera devices like a tablet or phone.", "qwen2.5:1.5b": "Opera's latest version, due for release in November, boasts voice control, text magnification, style sheet creation, and adaptive page size options, though accessibility features may appeal more to visually impaired users than those with low vision. Opera aims to improve human-computer interaction through natural user interfaces but does not offer commercial-level voice recognition software.", "qwen2.5:3b": "Latest Opera browser version 8.0, slated for release next month, will be the most accessible with voice control, text-to-speech, text magnification up to 10 times, and custom style sheets. Voice features are currently available only in Windows version, while screen reader compatibility is limited. Other accessibility features include text fitting to screen width suitable for low vision users and people using handheld devices. The browser aims to make human-computer interaction more natural with voice activation but requires a headset for speech recognition, which supports English only. Opera began as a research project by Telenor and is used on various operating systems and platforms by about 10 million people.", "opencoder:1.5b": "The latest opera browser is now going to be the most accessible for its users due to official release in the end of next month. The developers believe it will enable users to control their browser using voice commands, which are based on IBM technology. It has already been reported that accessibility features can enhance the user experience for people with visual impairments or those using devices with low vision. Another feature mentioned is the ability to enlarge text and adjust fonts in an easy way. The company also pointed out that users may not always have a keyboard, so it enhances a more hands-free internet experience. Unlike some popular voice recognition software, opera browser does not need training for its users to recognise individual voices. It's been used by approximately 1 million people worldwide. Users will also be able to download the browser free of any add-ons and there is extra support provided as part of an ad banner on the top right hand corner.\n", "smollm:1.7b": "The latest Opera browser gets vocal, Net browser Opera 8.0, will be \"the most accessible browser on the market\", according to its authors. The latest version of the net browser can be controlled by voice command and will read pages aloud. The voice features based on IBM technology are currently only available in the Windows version. Opera can also magnify text by up to 10 times and users can create \"style sheets\" which enable them to view pages with colours and fonts that they prefer. But the browser does not yet work well with screen reader software often used by blind people, so its accessibility features are more likely to appeal to those with some residual vision. Opera says that this will also appeal to people with low vision because it eliminates the need for horizontal scrolling. The company points out that this will also appeal to anyone using Opera with a handheld device. The company says that features like voice activation are not solely aimed at visually impaired people. \"Our idea was to take a first step in making human-computer interaction more natural,\" said Ms Hanson. \"People are not always in a situation where they can access a keyboard, so this makes the web a more hands-free experience.\" Unlike commercially available voice recognition software, Opera does not have to be \"trained\" to recognize an individual voice. Around 50 voice commands are available and users will have to wear a headset which incorporates a microphone. The voice recognition function is currently only available in English. Opera began life as a research project - a spin-off from Norwegian telecoms company Telenor. Its browser is used by an estimated 10 million people on a variety of operating systems and a number of different platforms.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the given text into one concise paragraph while preserving all key ideas. Let me start by reading through the original text carefully.\n\nThe main points are:\n\n1. Opera 8.0 is the latest browser released for net browsers.\n2. It's described as the \"most accessible browser on the market.\"\n3. It can be controlled via voice commands, which is currently limited to Windows versions.\n4. It reads pages aloud and magnifies text by up to 10 times.\n5. Users can create style sheets for preferences like colors and fonts.\n6. However, it's not fully compatible with screen readers, so accessibility features might appeal more to those with some residual vision.\n7. One feature is making pages fit the screen width without horizontal scrolling, which could be appealing to low vision users or those using a handheld device.\n8. The developers mention their aim was to make human-computer interaction more natural for people who can't access keyboards, like people who use mobile devices.\n9. Unlike commercial software, Opera doesn't require personalization; it automatically adapts and is free to download.\n10. It's accessible across various operating systems and platforms.\n\nNow, I need to combine these points into a coherent summary. I should make sure each key feature is included without adding extra information. Let me try putting them all together in my own words.\n\n\"Opera 8.0, the latest net browser, aims to be the most accessible on the market, using voice commands and reading pages aloud. It magnifies text up to ten times and allows style sheets for customization. However, its screen reader compatibility is limited, so it's more suited for those with some visual impairments. One unique feature is making content fit screen width without scrolling, appealing to low vision users or those using handheld devices. Unlike commercial software, Opera doesn't require personalization; it works automatically and is free to download.\"\n\nI think that covers all the main points without missing any crucial details.\n</think>\n\nOpera 8.0, the latest net browser, aims to be the most accessible on the market, leveraging voice commands for control, reading aloud features based on IBM technology, and magnifying text up to ten times with customizable stylesheets. However, its screen reader compatibility is limited, making it more suitable for those with some visual impairments. One unique feature is the ability to fit content to screen width without horizontal scrolling, appealing to low vision users or handheld device users. Unlike commercial software, Opera doesn’t require personalization; it works automatically and is free to download.", "tinyllama:1.1b": "Sparkling opera's latest browser, Opera 8.0, will be the most accessible option in the market thanks to its voice recognition feature that can read pages aloud. The browser also includes style sheets for those who want to customize their browsing experience and a handy screen reader software. The company claims it is not only aimed at visually impaired people but also those with handheld devices, making human-computer interaction more natural for everyone. Ahead of its official release on the end of next month, the browser has a voice recognition function that users can control through voice commands and comes with an ad-free version without an ad banner in the top right corner. Additionally, Opera is free to download but includes a paid-for version with extra support. The browser was created as a spin-off from Norwegian telecoms company Telenor and has been used by millions of users on a variety of operating systems and platforms.", "tinydolphin:1.1b": " The latest version of Opera, the most accessible web browser in the market, gets vocal capabilities, allowing users to control their favorite websites by voice command. With a new feature called 'style sheets', users can adjust the colors and layout of web pages they are viewing. This new feature will appeal to those with some residual vision. However, it won't work well with screen readers that are commonly used by people who are blind or visually impaired. A company spokeswoman emphasizes that Opera is always striving to provide the best internet experience for everyone, making this an attractive feature for those with low vision. The browser will be available in different languages and versions will launch with a free version without ads and a paid-for version that comes without an ad banner in the top right corner and offers extra support.", "phi:2.7b": " The latest version of the web browser, Opera 8.0, will be accessible to everyone with its voice control, text magnification, and style sheets features. These features are not only for visually impaired users but also for those using handheld devices or in situations where they cannot access a keyboard easily. However, it is important to note that the voice recognition function is currently available only in English and requires a headset with a microphone.\n", "orca-mini:3b": " Opera, the internet browser, is getting vocal with the release of Opera 8.0 at the end of next month. This version will be the most accessible browser on the market, according to its developers. It can be controlled by voice command and reads pages aloud, using IBM technology. However, screen reader software is not yet fully supported, so accessibility features are more likely to appeal to those with some residual vision. Opera can magnify text up to 10 times and create style sheets to enable users to view pages with colors and fonts they prefer. The browser also eliminates the need for horizontal scrolling, making it a more hands-free experience. Another feature that could be useful is the ability to make pages fit to the screen width, which can eliminate the need for horizontal scrolling. Unlike other voice recognition software, Opera does not require training to recognize an individual voice, and around 50 voice commands are available. However, users will have to wear a headset with a microphone to use the voice recognition function, and the feature is currently only available in English. Opera is free to download but has a paid-for version that comes without an ad banner in the top right hand corner and with extra support. Opera began as a research project spun off from a Norwegian telecoms company.", "hermes3:3b": "Opera 8.0 browser (upcoming release) allows voice control and reads pages aloud, enhancing accessibility for users with low vision and making web interaction more natural for all.", "stablelm-zephyr:3b": "The upcoming Opera 8.0 browser, set to release at the end of the month, aims to be the most accessible browser on the market, with voice command capabilities that read pages aloud using IBM technology. Its accessibility features, such as text magnification up to 10 times and customizable \"style sheets,\" are more suited for visually impaired users. However, the browser doesn't work well with screen reader software. A feature appealing to people with low vision is page fitting to screen width, eliminating horizontal scrolling. Opera's voice activation isn't solely targeted at visually impaired individuals; it seeks to make human-computer interaction more natural. The browser, available for free download, offers a paid version without an ad banner and extra support.", "chatgpt-4o-latest": "Opera 8.0, set for release next month, introduces voice control and text-to-speech features, making it highly accessible. These voice functions, based on IBM technology, are currently available only for Windows. The browser also allows text magnification up to 10 times and customizable style sheets for preferred colors and fonts. However, it does not yet work well with screen readers, making it more suitable for users with some vision. Other features include automatic page resizing to fit screen width, benefiting both visually impaired users and those on handheld devices. Voice activation, requiring a headset, offers hands-free browsing without prior voice training. Currently, it supports only English. Opera is free to download, with a paid version offering an ad-free experience and extra support. Originally a research project from Norwegian telecoms company Telenor, Opera now has around 10 million users across various platforms.", "stablelm2:1.6b": "Opera, set to release its 8.0 browser at the end of next month, aims to provide the most accessible internet experience for everyone with new features such Magnification (up to 2x), voice command control, screen magnification, and ability to make web pages fit to the screen width. These accessibility features are based on IBM technology, currently limited to Windows version, and do not work well with screen reader software. Despite this, Opera plans to appeal to blind people by emphasizing voice activation as a natural human-computer interaction tool.", "granite3.1-dense:2b": "Opera 8.0, launching in late April, introduces significant accessibility enhancements for users with low vision or visual impairment. Key features include voice command control and text-to-speech capabilities, allowing the browser to read pages aloud using IBM technology. Users can also magnify text up to ten times and customize appearance through \"style sheets.\" The browser avoids horizontal scrolling by fitting pages to screen width, benefiting both visually impaired individuals and those using handheld devices. Opera's voice recognition system, available in English, requires a headset with a microphone and supports around 50 commands without the need for individual training. Unlike commercial voice recognition software, it doesn't necessitate user-specific training. The company emphasizes that these features aim to make web interaction more natural and hands-free, catering to situations where keyboard access is inconvenient. Opera is free but offers an ad-banner-less premium version for a fee.", "reference": "Unlike commercially available voice recognition software, Opera does not have to be \"trained\" to recognise an individual voice.The latest version of the net browser can be controlled by voice command and will read pages aloud.The company says that features like voice activation are not solely aimed at visually impaired people.The voice recognition function is currently only available in English.But the browser does not yet work well with screen reader software often used by blind people, so its accessibility features are more likely to appeal to those with some residual vision.The voice features, based on IBM technology, are currently only available in the Windows version.\"Our mission was always to provide the best internet experience for everyone,\" said Opera spokeswoman, Berit Hanson.Around 50 voice commands are available and users will have to wear a headset which incorporates a microphone."}