{"raw_text": "Web radio takes Spanish rap global\n \n Spin the radio dial in the US and you are likely to find plenty of Spanish-language music. But what you will not find is much Spanish-language hip-hop.\n \n Hip-hop and rap are actually quite popular in the Spanish-speaking world, but local artists are having trouble marketing their work abroad. But now, a US company is bringing rap and hip-hop en espanol to computer users everywhere. Los Caballeros de Plan G are one of Mexico's hottest hip-hop acts. They have a devoted fan base in their native Monterrey. But most Mexican hip-hop fans, not to mention fans in most of the Spanish-speaking world, rarely get a chance to hear the group's tracks on the radio.\n \n \"You can't really just go on the radio and listen to hip-hop in Spanish... it's just not accessible,\" says Manuel Millan, a native of San Diego, California. \"It's really hard for the Spanish hip-hop scene to get into mainstream radio. You usually have a very commercialised sound and the groups are not really known around the country or around the world.\" Millan and two friends set out to change that - they wanted to make groups like Los Caballeros de Plan G accessible to fans globally.\n \n Mainstream radio stations were not going to play this kind of music, and starting their own broadcast station was economically impossible. So, Millan and his friends launched a website called latinohiphopradio.com. The name says it all: it is web-based radio, devoted to the hottest Spanish language rap and hip-hop tracks. The site, which is in both in English and Spanish, is meant to be easy to navigate. All the user has to do is download a media player. There are no DJs. It is just music streamed over the net for free. Suddenly, with the help of the website, Los Caballeros de Plan G are producing \"export quality\" rap.\n \n The web might be just the right medium for Spanish language hip-hop right now. The genre is in what Millan calls its \"infant stage\". But the production values are improving, and artists such as Argentina's Mustafa Yoda are pushing to make it better and better. Mustafa Yoda is currently one of the hottest tracks on latinohiphopradio.com. \"He's considered the Eminem of Argentina, and the Latin American hip-hop scene,\" Millan says. \"He really hasn't had that much exposure as far as anywhere in the world, but he's definitely the one to look out for as far as becoming the next big thing in the Spanish-speaking world.\" Currently, the Chilean group Makisa is also in latinohiphopradio.com's top 10, as is Cuban artist Papo Record. \"Every country's got it's own cultural differences and they try to put those into their own songs,\" Millan says. Latinohiphopradio.com has been up and running for a couple of months now. The site has listeners from across the Spanish speaking world. Right now, Mexico leads the way, accounting for about 50% of listeners. But web surfers in Spain are logging in as well - about 25% of the web station's traffic comes from there. That is not surprising as many consider Spain to be the leader in Spanish-language rap and hip-hop. Millan says that Spain is actually just behind the United States and France in terms of overall rap and hip-hop production. That might be changing, though, as more and more Latin American artists are finding audiences.\n \n But one Spaniard is still firmly in latinohiphopradio.com's top 10. His name is Tote King and Manuel Millan says that he is the hip-hop leader in Spain. On his track Uno Contra Veinte Emcees, or One Against 20 Emcees, Tote King shows he is well aware of that fact. \"It's basically him bragging that he's one of the best emcees in Spain right now,\" Millan says. \"And it's pretty much true. He has the tightest productions, and his rap flow is impeccable, it's amazing.\" Latinohiphopradio.com is hoping to expand in the coming year. Millan says they want to include more music and more news from the world of Spanish language hip-hop and rap.\n \n Clark Boyd is technology correspondent for The World, a BBC World Service and WGBH-Boston co-production.\n", "llama3.2:1b": "Web radio brings Spanish-language hip-hop globally by providing online access to local artists' work, bypassing traditional mainstream radio stations. Los Caballeros de Plan G, Mexico's hottest hip-hop act, have a devoted fan base in their country and abroad. A US company launched latinohiphopradio.com, a web-based platform featuring live music streaming with no DJs or commercialized sound. The site has gained popularity among Spanish-speaking users worldwide, including listeners from Spain, where it accounts for 25% of traffic.", "llama3.2:3b": "US company launches web radio station dedicated to Spanish-language hip-hop and rap, providing global access to local artists like Los Caballeros de Plan G and Mustafa Yoda, who are gaining international recognition despite initial commercialization barriers. The website, latinohiphopradio.com, allows users to stream music for free with no DJs, reaching listeners from across the Spanish-speaking world, with Mexico and Spain leading in terms of traffic.", "gemma2:2b": "A US company created web radio Latinohiphopradio.com to make Spanish-language rap and hip-hop accessible to fans globally.  The site broadcasts free music from artists like Los Caballeros de Plan G, Mustafa Yoda, Makisa, Papo Record, and Tote King, all of whom are gaining international recognition. The website is growing rapidly with listeners in Mexico and Spain as leaders in the genre. \n", "qwen2.5:0.5b": "Web radio brings Spanish-language music to computer users worldwide. Los Caballeros de Plan G have been popular in Mexico but are limited to local radio, so it's hard for others to listen to them there. A US company is bringing rap and hip-hop en español to computers everywhere. Los Caballeros de Plan G are a Mexican hip-hop group that has lots of fans in Mexico but little in other parts of the Spanish-speaking world. They plan to have quality music streaming on their website, which is free for users to download. They also want to bring news from different places around the world to computers as well.", "qwen2.5:1.5b": "A US company has created web radio that promotes Mexican hip-hop artists like Los Caballeros de Plan G to non-native English speakers globally.", "qwen2.5:3b": "Web radio platform latinohiphopradio.com has made it possible for fans across the Spanish-speaking world to access high-quality Spanish-language hip-hop music that would otherwise be unavailable on mainstream radio. Founded by Manuel Millan and his friends, this web-based station features tracks from popular artists like Los Caballeros de Plan G, Mustafa Yoda, Makisa, and Papo Record. The site aims to democratize access to these genres, which are currently in their \"infant stage,\" but with increasing production values and growing international recognition, including a strong following in Spain. Millan's team hopes to expand the platform by adding more music and news from the Spanish language hip-hop scene in the coming year.", "opencoder:1.5b": "The summary of the text would be: \n\nThe web-based radio platform offers Spanish-language hip-hop tracks which can now be accessed from all over the world. It is important to note that some Spanish-speaking fans might still not have access to it, as it's a new venture in the world of rap and hip-hop. However, with the help of latinohiphopradio.com, these enthusiasts are gradually moving towards a more accessible platform. The rise of web-based radio has seen artists such as Mustafa Yoda and Makisa also producing \"export quality\" tracks which could be enjoyed by a wider audience around the world.\n", "smollm:1.7b": "The summary should be concise and focus on the main ideas:\n\n1. A US company is bringing Spanish-language hip-hop to computer users worldwide.\n2. Local Mexican hip-hop artists are having trouble getting their music into mainstream radio.\n3. The US website latinohiphopradio.com is dedicated to Spanish language hip-hop and has a large following in the US.\n4. Millan says that one of the top 10 Spanish language hip-hop artists on latinohiphopradio.com is Tote King, who is known for his tight rap flow and impressive production skills.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help summarize this text about Spanish-language rap and hip-hop in the US. Let me read through it first.\n\nThe user provided a detailed passage discussing how the US market for Spanish rap and hip-hop music is fragmented. Local artists often don't promote their work abroad much, which makes marketing challenging. Then, a company called Los Caballeros de Plan G is launching a website to reach mainstream radio stations. The author talks about their effort to make this group's music accessible in the US, mentioning the technical aspects like streaming without DJ or DJ mixing.\n\nThey highlight that web can be ideal for this genre now because it's more accessible than traditional media. The genre is in the infant stage but production values are improving. Artists like Yoda and Makisa are doing well on their site. There's a mention of Spanish-speaking countries lagging behind in overall production, which might change as more artists find audiences.\n\nThe author also notes that while Spain leads with 50%, there are still growing Spanish language users, especially in Spain. The group is expanding online, and Clark Boyd from BBC World Service mentioned their tech expertise on the internet.\n\nI need to make sure I only include key ideas. So the main points would be:\n\n- US market for Spanish rap/hip-hop music is fragmented.\n- Local artists struggle to promote abroad.\n- Los Caballeros of Mexico are starting to reach mainstream radio through a website.\n- Web is ideal here; they use streaming.\n- Production values improving, artists like Yoda are doing well.\n- There's some lag in production overall but growing interest locally.\n\nI should avoid explanations and just provide concise points. Make sure it's plain text without any extra info.\n\nLet me structure this into a summary with the main ideas first, then add details as needed. I'll keep it short and make sure all key elements are included: the US market issue, the launch of the website by Los Caballeros, their use of streaming, improvements in production values, success of Yoda and Makisa, the genre being in infant stage but improving, Spanish-speaking countries' position overall, and Spain's growing user base.\n\nAlright, I think that covers everything without any extra fluff. Now, just put it all together as a summary.\n</think>\n\nThe US market for Spanish rap/hip-hop music is fragmented with local artists struggling to promote abroad, while Los Caballeros de Plan G from Mexico are reaching mainstream radio through their website. The genre is in its infant stage but production values improving; artists like Yoda and Makisa are doing well. Web is ideal here, using streaming without DJ or mixing. Spanish-speaking countries lagging overall but growing interest locally, with Spain leading at 50% traffic while Spanish users remain strong, though others like Spain and Mexico show growth. Clark Boyd's tech expertise on the internet highlights their success.", "tinyllama:1.1b": "The Web Radio takes Spanish rap global, and Los Caballeros de Plan G are the hotest hip-hopp act in the Spanish-speaking world. With their mainstream radio station launching a website to air web-based radio for free with no DJs or commercialization, it is now easy for fans globally to access their music. The website's top 10 tracks are led by Tote King, a Spanish rapper known for his impressive emceeing skills and production quality. With the expansion of Latinohiphopradiotv.com, Millan hopes to add more content and news from the world of Spanish languaage hip-hopp and rap.", "tinydolphin:1.1b": " To summarize:\n\nWeb radio takes Spanish rap global with Los Caballeros de Plan G's \"export quality\" hip-hop tracks at latinohiphopradio.com, and the platform has listeners across the Spanish speaking world, led by Mexico. The website caters to Spanish language hip-hop fans globally, allowing them access to groups like Los Caballeros de Plan G's music that may not be available in their local markets.", "phi:2.7b": " Web radio is bringing Spanish-language hip-hop to computer users around the world through a website called latinohiphopradio.com. This allows artists like Los Caballeros de Plan G, Mustafa Yoda, and Makisa to produce \"export quality\" rap that can be easily accessed by fans globally. The genre is currently in its \"infant stage,\" but the production values are improving with each artist pushing to make it better and better. Latinohiphopradio.com has been up and running for a couple of months now, and listeners from across the Spanish-speaking world are tuning in, with Mexico leading the way followed by Spain. One Spaniard is still firmly in latino hip-hop radio's top 10 as Tote King shows that he is one of the best emcees in Spain. The website wants to expand in the coming year to include more music and news from the world of Spanish language hip-hop and rap. \n", "orca-mini:3b": " Web radio takes Spanish rap global, as Los Caballeros de Plan G and Mustafa Yoda make their mark in the Spanish-speaking world.", "hermes3:3b": "Web radio for Spanish rap global<|end_of_text|><|begin_of_text|>1) US company brings hip-hop in Spanish to computer users; 2) helps Mexican groups like Los Caballeros de Plan G reach wider audience; 3) site latinohiphopradio.com has listeners from Spain and Mexico", "stablelm-zephyr:3b": "US company Latinohiphopradio.com launched a website offering web-based radio dedicated to Spanish-language rap and hip-hop tracks, helping artists like Los Caballeros de Plan G gain global exposure. While mainstream radio stations often ignore this genre, the website streams high-quality music for free without DJs, with listeners from across the Spanish-speaking world. Currently, Mexico leads as the main listener nation, but Spain and France are also significant in rap and hip-hop production. The website aims to expand and include more music and news about the Spanish language hip-hop and rap scene in the coming year.", "chatgpt-4o-latest": "Spanish-language hip-hop is popular in the Spanish-speaking world but struggles to gain mainstream radio play, especially abroad. To address this, Manuel Millan and his friends launched latinohiphopradio.com, a web-based radio station that streams Spanish rap and hip-hop globally. The site, available in English and Spanish, allows users to access music easily without DJs. Artists like Mexico’s Los Caballeros de Plan G, Argentina’s Mustafa Yoda, Chile’s Makisa, and Cuba’s Papo Record are gaining international exposure through the platform. Spain, considered a leader in Spanish-language hip-hop, contributes significantly to the genre, with artists like Tote King ranking among the top. The site has attracted listeners from Mexico, Spain, and beyond, and its founders plan to expand by adding more music and news about the Spanish hip-hop scene.", "stablelm2:1.6b": "Web radio expands access to Spanish-language hip-hop, with Los Caballeros de Plan G becoming popular among fans in Mexico and the Spanish-speaking world through their accessible tracks on Latinohiphopradio.com. This US-based company aims to make Spanish hip-hop more mainstream by streaming rap and hip-hop tracks over the internet for free without DJs. The site has listeners from across the Spanish-speaking world, with Mexico leading the way at about 25% of listeners.", "granite3.1-dense:2b": "A US company, led by Manuel Millan, has launched latinohiphopradio.com, a web radio dedicated to Spanish language rap and hip-hop. This platform addresses the gap in global accessibility for popular Spanish-language rap, as local artists struggle with limited exposure on mainstream radio. The site features no DJs, just high-quality music streamed over the internet for free. Notable acts like Los Caballeros de Plan G, Mustafa Yoda (considered Argentina's Eminem), Makisa, Papo Record, and Tote King are among its top artists. Latinohiphopradio.com caters primarily to Spanish-speaking countries, with Mexico leading as the most active listener base. Spain follows closely, accounting for about 25% of traffic, making it a significant player in Spanish rap production. The site aims to expand by including more music and news related to the genre in the coming year.", "reference": "Millan says they want to include more music and more news from the world of Spanish language hip-hop and rap.The name says it all: it is web-based radio, devoted to the hottest Spanish language rap and hip-hop tracks.\"You can't really just go on the radio and listen to hip-hop in Spanish... it's just not accessible,\" says Manuel Millan, a native of San Diego, California.His name is Tote King and Manuel Millan says that he is the hip-hop leader in Spain.Millan says that Spain is actually just behind the United States and France in terms of overall rap and hip-hop production.The web might be just the right medium for Spanish language hip-hop right now.\"It's really hard for the Spanish hip-hop scene to get into mainstream radio.That is not surprising as many consider Spain to be the leader in Spanish-language rap and hip-hop.\"He's considered the Eminem of Argentina, and the Latin American hip-hop scene,\" Millan says.But what you will not find is much Spanish-language hip-hop.Los Caballeros de Plan G are one of Mexico's hottest hip-hop acts.Hip-hop and rap are actually quite popular in the Spanish-speaking world, but local artists are having trouble marketing their work abroad.But most Mexican hip-hop fans, not to mention fans in most of the Spanish-speaking world, rarely get a chance to hear the group's tracks on the radio.\"It's basically him bragging that he's one of the best emcees in Spain right now,\" Millan says.The site has listeners from across the Spanish speaking world.But now, a US company is bringing rap and hip-hop en espanol to computer users everywhere.Mustafa Yoda is currently one of the hottest tracks on latinohiphopradio.com.Millan and two friends set out to change that - they wanted to make groups like Los Caballeros de Plan G accessible to fans globally."}