{"raw_text": "Junk e-mails on relentless rise\n \n Spam traffic is up by 40%, putting the total amount of e-mail that is junk up to an astonishing 90%.\n \n The figures, from e-mail management firm Email Systems, will alarm firms attempting to cope with the amount of spam in their in-boxes. While virus traffic has slowed down, denial of service attacks are on the increase according to the firm. Virus mail accounts for just over 15% of all e-mail traffic analysis by the firm has found.\n \n It is no longer just multi-nationals that are in danger of so-called denial of service attacks, in which websites are bombarded by requests for information and rendered inaccessible. Email Systems refers to a small UK-based engineering firm, which received a staggering 12 million e-mails in January. The type of spam currently being sent has subtlety altered in the last few months, according to Email Systems analysis. Half of spam received since Christmas has been health-related with gambling and porn also on the increase. Scam mails, offering ways to make a quick buck, have declined by 40%. \"January is clearly a month when consumers are less motivated to purchase financial products or put money into dubious financial opportunities,\" said Neil Hammerton, managing director of Email Systems. \"Spammers seem to have adapted their output to reflect this, focussing instead on medically motivated and pornographic offers, presumably intentionally intended to coincide with what is traditionally considered to be the bleakest month in the calendar,\" he said.\n", "llama3.2:1b": "Junk e-mails are up by 40% due to increased spam traffic. Email Systems reports that 90% of email is junk. Virus mail accounts for over 15%. Denial-of-service attacks, which include requests for information and rendering websites inaccessible, have increased. The type of spam received has shifted from virus mail to health-related messages (gambling and porn) and scam mails.", "llama3.2:3b": "Spam email traffic has increased by 40% with a total of 90% junk emails, according to Email Systems. Virus traffic is slowing down while denial of service attacks are on the rise. A small UK-based firm received 12 million spam emails in January, with half being health-related and gambling/porn spam increasing. Scam mails offering financial opportunities have declined by 40%.", "gemma2:2b": "Junk email traffic has increased by 40% reaching 90%.  Spam traffic now accounts for a significant portion of all email traffic. Virus emails are down, but denial-of-service attacks are on the rise.  Health-related spam has increased since Christmas and gambling and porn have become more prevalent. Scam mails offering quick wealth have declined.\n", "qwen2.5:0.5b": "Spam e-mails are increasing by 40%, putting about 90% of all email traffic as junk. Many people don't realize that spam emails have become more difficult to distinguish from legitimate ones, making it even harder for companies to manage and filter out junk e-mails. Spam includes things like fake news, scams, and phishing attempts, which the company says are not being detected and ignored by other systems. Neil Hammerton, managing director of Email Systems, states that January is one of the few months when people are less motivated to purchase financial products or put money into dubious opportunities.", "qwen2.5:1.5b": "Junk email volume rises 40%, reaching 90% of total e-mail traffic; denial of service attacks increase as virus traffic slows; spam content has changed recently, with health-related and gambling porn mail becoming more prevalent while scam mails have decreased by 40%.", "qwen2.5:3b": "Junk e-mails are increasing by 40%, making up 90% of all emails. Virus traffic has slightly decreased while denial-of-service attacks have risen. Email Systems reports that just over 15% of email traffic is from viruses. A UK engineering firm received 12 million spam emails in January, mostly related to health and pornography. Scam mails have declined by 40%, possibly because spammers are targeting medically motivated and pornographic offers during what is traditionally considered the bleakest month.", "opencoder:1.5b": "The rise of junk e-mail accounts has led to an increase in spam traffic, which has resulted in a 90% increase in total junk emails. The figures from Email Systems have found that denial-of-service (DoS) attacks are currently up by 40%. Virus mail traffic has slowed down according to the firm, but increased attacks according to the analysis. Websites are bombarded with requests for information and become inaccessible. Email Systems, a small UK-based engineering firm, has received a staggering 12 million e-mails in January. The type of spam being sent has subtly altered in recent months. Half of spam received since Christmas has been health-related with gambling and porn on the increase. Scam mails have declined by 40%. Consumers are less motivated to purchase financial products or put money into dubious financial opportunities, quoted by Neil Hammerton, managing director of Email Systems.\n", "smollm:1.7b": "The text above summarizes the main points from the given text:\n\n1. Junk e-mail traffic has increased by 40% since last year.\n2. The total amount of spam mail that is junk has risen to an astonishing 90%.\n3. Virus traffic has slowed down, but denial of service attacks are on the increase.\n4. Email Systems refers to a small UK-based engineering firm that received a staggering 12 million e-mails in January.\n5. The type of spam currently being sent has subtlety altered in the last few months.\n6. Half of spam received since Christmas has been health-related with gambling and porn on the increase.\n7. Scam mails, offering ways to make a quick buck, have declined by 40%.\n8. The text above summarizes the main points from the given text.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text. Let me read through it carefully.\n\nThe first paragraph mentions that email traffic has been rising, especially spam. The total spam is up by 40%, making it 90% junk. This alerts firms because their inbox is getting overwhelmed with too much spam.\n\nThen, Email Systems, an e-mail management firm, reported that over 12 million emails were received in January. They mentioned changes in the type of spam: health-related (gambling, porn), and scams are declining as people are less motivated to spend money or buy products at bad times.\n\nNeil Hammerton, their manager, says this is because people are less motivated around January, a traditionally blest time for spending. Spammers are adapting by focusing on medical offers and porn, which have increased in volume.\n\nI should keep only the key ideas without any explanations or formatting.\n</think>\n\n Junk e-mails on relentless rise  \nEmail traffic has surged with an increase in spam reaching 40%, totaling 90% as junk. Email Systems reported 12 million emails in January, with varying types of spam (health-related and porn) up by some amounts. Scams declined as people are less motivated during bad times like January.", "tinyllama:1.1b": "The amount of spam sent in January has increased, with health-related and pornographic mailings becoming more prominent compared to other types like scams or financial products. The e-mail management firm Email Systems has analyzed a massive influx of junk messages from multiple countries, resulting in a significant spike in denial of service attacks. In the past month, consumer motivation was lower than usual, prompting spammer adaptation to the change in consumer behavior. Despite this trend towards medical- and pornographic-based offers, Januaary is considered a less desirable time for e-mail marketing due to consumers' lack of motivation during the January sales period.", "tinydolphin:1.1b": " In recent years, junk email traffic has risen dramatically, putting major businesses under immense pressure to deal with this issue effectively. According to data from Email Systems, an e-mail management firm based in the UK, spam has increased by over 40%, causing havoc for companies that struggle to keep up with the influx of irrelevant and malicious messages.\n\nThe figures from Email Systems show that viruses make up just over 15% of all email traffic, while denial of service attacks have grown in popularity as well. This increase is attributed to an increase in multi-nationals being at risk of such attacks. Over 12 million emails were received in January by a small UK engineering firm, which was able to analyze and process the volume of spam sent over that time period.\n\nIn stark contrast, health-related scams have declined by half since Christmas, while scams offering ways to make quick bucks are on the rise. This shift could be attributed to consumers being less motivated to buy financial products or engage in risky investments during this season of low incomes.\n\nIn conclusion, the rise in junk email traffic has had a significant impact on businesses and individuals alike, with organizations struggling to cope with the volume of spam they receive on an daily basis.", "phi:2.7b": " Junk e-mails are increasing rapidly, with spam traffic up by 40%. The total amount of junk mail has reached 90%, causing concern for firms trying to deal with it. Virus traffic has slowed down, but denial of service attacks are on the rise according to email management firm Email Systems. They found that virus mail accounts for just over 15% of all e-mail traffic. Spammers have adapted their output in response to consumer behavior and now offer health-related and pornographic scams instead of financial products and dubious financial opportunities. \n", "orca-mini:3b": " The amount of junk e-mail has increased by 40%, reaching a total of 90% of all e-mail traffic. This is attributed to spam traffic slowing down but denial of service attacks, which are attacks on websites, increasing. Email Systems, a UK-based engineering firm, received over 12 million emails in January. The type of spam being sent has changed since Christmas, with half of spam being health-related and gambling and porn also on the rise. Scam mails offering financial opportunities have decreased by 40%.", "hermes3:3b": "E-mailed spam increasing by 40%, total to 90%; health-related spam up, financial/spam decline.", "stablelm-zephyr:3b": "E-mail spam traffic is up by 40%, reaching a total of 90% junk emails, according to email management firm Email Systems. While virus traffic has slowed down, denial of service attacks are increasing. Spam currently is half health-related, with gambling and porn on the rise, while scam mails have declined by 40%. Emailers have adapted their output to focus on offers related to medicine and pornography during traditionally slow purchasing months.", "chatgpt-4o-latest": "Spam e-mail traffic has risen by 40%, now making up 90% of all e-mails, according to Email Systems. While virus-related e-mails have decreased, denial of service attacks are increasing, affecting not just large corporations but also small businesses. A UK engineering firm received 12 million e-mails in January alone. Recent spam trends show a rise in health-related, gambling, and pornographic content, while scam e-mails have declined by 40%, likely due to lower consumer interest in financial schemes after Christmas. Spammers appear to be adjusting their tactics to align with seasonal consumer behavior.", "stablelm2:1.6b": "Rising spam email traffic accounts for 10% of all e-mail, with a total amount of junk mail reaching 90%. This alarming statistic comes from Email Systems, which warns that denial-of-service attacks are increasing due to the slowdown of virus mail and an increase in health-related and gambling/spyware content. Virus-related mail makes up approximately 25% of the total e-mail traffic analysis by the firm, with the last few months seeing half of spam emails being health-related. Scam mails have declined in proportion.", "granite3.1-dense:2b": "Spam emails have surged by 40%, now constituting 90% of total email traffic, according to Email Systems data. While virus mail accounts for 15% of all email traffic, denial-of-service attacks are on the rise. A UK engineering firm received 12 million spam emails in January alone. The nature of recent spam has shifted towards health-related content, gambling, and pornography, possibly aligned with consumers' reduced interest in financial scams during this typically gloomy month. Scam mails, targeting financial opportunities, have decreased by 40%.", "reference": "The figures, from e-mail management firm Email Systems, will alarm firms attempting to cope with the amount of spam in their in-boxes.Virus mail accounts for just over 15% of all e-mail traffic analysis by the firm has found.Email Systems refers to a small UK-based engineering firm, which received a staggering 12 million e-mails in January.While virus traffic has slowed down, denial of service attacks are on the increase according to the firm.The type of spam currently being sent has subtlety altered in the last few months, according to Email Systems analysis."}