{"raw_text": "Ask Jeeves joins web log market\n \n Ask Jeeves has bought the Bloglines website to improve the way it handles content from web journals or blogs.\n \n The Bloglines site has become hugely popular as it gives users one place in which to read, search and share all the blogs they are interested in. Ask Jeeves said it was not planning to change Bloglines but would use the 300 million articles it has archived to round out its index of the web. How much Ask Jeeves paid for Bloglines was not revealed.\n \n Bloglines has become popular because it lets users build a list of the blogs they want to follow without having to visit each journal site individually. To do this it makes use of a technology known as Really Simple Syndication (RSS) that many blogs have adopted to let other sites know when new entries are made on their journals. The acquisition follows similar moves by other search sites. Google acquired Pyra Labs, makers of the Blogger software, in 2003. In 2004 MSN introduced its own blog system and Yahoo has tweaked its technology to do a better job of handling blog entries. Jim Lanzone, vice president of search properties at Ask Jeeves in the US, said it did not acquire Bloglines just to get a foothold in the blog publishing world. He said Ask Jeeves was much more interested in helping people find information they were looking for rather than helping them write it.\n \n \"The universe of readers is vastly larger than the universe of writers,\" he said. Mr Lanzone said the acquisition would sit well with Ask's My Jeeves service which lets people customise their own web experience and build up a personal collection of useful links. \"Search engines are about discovering information for the first time and RSS is the ideal way to keep track of and monitor those sites,\" he said. It would also help drive information and entries from blogs to the portals that Ask Jeeves operates. There would be no instant sweeping changes to Bloglines, said Mr Lanzone. \"Our intent is to take our time to figure out the right business model not to try to monetise it right away,\" he said. Though Mr Lanzone added that Ask Jeeves would be helping organise the database of 300m blog entries Bloglines holds with its own net indexing technology. \"Being able to search the blogosphere as one corpus of information will be very useful in its own right,\" said Mr Lanzone. Rumours about the acquisition were broken by the Napsterization weblog which said it got the hint from Ask Jeeves insiders.\n", "llama3.2:1b": "Ask Jeeves has bought Bloglines and plans to use its 300 million archived articles to round out its index of the web, rather than changing or replacing the site itself. The acquisition follows similar moves by other search sites like Google and MSN, which have all improved their blog systems in recent years. Ask Jeeves' vice president said the aim is to help users find information rather than write it, and that the database will be organized with its own net indexing technology.", "llama3.2:3b": "Ask Jeeves buys Bloglines website, a popular platform for reading and sharing blogs, to improve web content handling and utilize its 300 million archived articles to enhance search capabilities. The acquisition aims to help users find information they're looking for rather than writing it, sitting well with Ask's existing My Jeeves service that allows customization of the web experience.", "gemma2:2b": "Ask Jeeves acquired Bloglines, a platform for aggregating and sharing blog content, to improve its search results and indexing capabilities. The company plans to use the 300 million articles archived by Bloglines to enhance its existing index of web information. While aiming to facilitate better user access to content, Ask Jeeves intends to respect the autonomy of Bloglines and will not immediately monetize the platform.  \n", "qwen2.5:0.5b": "Ask Jeeves has bought Bloglines, a website for managing and sharing blogs, to improve how it organizes and indexes the web's content. Bloglines now includes 300 million articles and is owned by Ask Jeeves, which is not planning to change its approach. Ask Jeeves believes this will help them reach a larger readership and provide better search functionality for users.", "qwen2.5:1.5b": "Ask Jeeves has acquired Bloglines, a website that provides users with a centralized platform to read, search, and share content from various blogs. The acquisition will enhance Ask's ability to index web content efficiently by leveraging 300 million articles already archived. Bloglines was popularized through RSS technology used for syndicating blog updates. This move follows similar acquisitions by other major search engines like Google and Yahoo in the blogging space, indicating an interest in providing a better information discovery experience rather than just creating or managing blogs themselves.", "qwen2.5:3b": "Ask Jeeves has acquired Bloglines to enhance its content management for web journals or blogs, integrating 300 million archived articles into its index. Bloglines' popularity stems from allowing users to follow desired blogs without individually visiting each site. This is facilitated by RSS technology adopted by many blogs. Ask Jeeves aims to integrate Bloglines without changing its functionality and intends to use the archive for better web content management, enhancing search capabilities while preserving Bloglines' user experience. The acquisition follows similar moves by other search engines like Google and Yahoo in acquiring blog-related technologies.", "opencoder:1.5b": "Ask Jeeves joined the web log market to improve content from blogs and journals. Bloglines, a massive site, became popular due to its flexibility for user-defined searches. The acquisition followed by the rise of RSS feeds and other search engines offered a better way for users to discover information. The acquisition also helped drive entries from blogs to the portals operated by Ask Jeeves. The universe of readers and writers has significantly evolved over time, with Bloglines serving as the cornerstone for this evolution. It is noteworthy that users can create a list of blogs they are interested in and the services provided allow easy access to information.\n", "smollm:1.7b": "The summary is concise, preserving key ideas and details:\n\n1. Ask Jeeves has bought Bloglines to improve its content management system.\n2. Bloglines is a popular web journal that allows users to build a list of blogs they want to follow without having to visit each individual blog site.\n3. The acquisition follows similar moves by other search sites, such as Google and Yahoo.\n4. Ask Jeeves did not acquire Bloglines just to get a foothold in the blogging world; it was more interested in helping people find information they were looking for rather than helping them write it.\n5. The company would use RSS technology to help users discover new blogs and build their own personal collection of useful links.\n6. The acquisition would sit well with Ask Jeeves' My Jeeves service, which allows users to customize their own web experience and build up a personal collection of useful links.\n7. Search engines are about discovering information for the first time and RSS is the ideal way to keep track of and monitor those sites.\n8. Bloglines holds 300 million blog entries with its own net indexing technology, which would be used by Ask Jeeves to organize and categorize the content.\n9. Being able to search the blogosphere as one corpus of information will be very useful in its own right for users.", "deepseek-r1:1.5b": "<think>\nAlright, I need to help the user summarize a given text concisely. Let me read through the query carefully.\n\nThe original text talks about Ask Jeeves acquiring Bloglines. It mentions that they're merging their services and aiming to index 300 million blog entries. They also highlight how RSS helps keep blogs accessible without needing individual journal visits. Asking Jeeves is focused on helping people find information rather than creating content, not just indexing.\n\nHmm, I should make sure the summary includes key points: Ask's intent was about information retrieval, their approach using RSS, size of data, and why they're taking it slow. Also, noting that other sites like Google and Msn have done similar acquisitions.\n\nI need to keep it concise without adding explanations or formatting. Just a clear summary in plain text. Let me structure the points: initial acquisition intent, main idea about indexing, the specific size of 300m entries, how they use RSS, and their focus on information retrieval rather than content creation.\n</think>\n\nAsk Jeeves aims to merge its services with Bloglines' platform, merging search capabilities while using RSS for easy access. They aim to index 300 million blog entries without changing the core purpose of providing a single point for information sharing.", "tinyllama:1.1b": "Ask Jeeves has acquired web log market Bloglines for a whopping $17.5 million to round out their index of the web and round up users' list of blogs they want to follow without having to visit each site individually. The acquisition follows similar moves by other sea-search sites, including Google, Pyra Lab, and MSN. The acquisiion is not aimed at getting a foothold in the blog publishing world but rather to help people find information they are looking for. Ask Jeeves intends to use Bloglines' RSS technology to create their personalized web experience and build up their collection of useful links, which they currently do through My Jeevies service. The acquisiion should not see any immediate changes to Bloglines, but instead help drive information and entries from blogs to Ask Jeeves' own portal services, where there would be no immediate sweeping changes.", "tinydolphin:1.1b": " The news is that Ask Jeeves has acquired Bloglines, a popular web journal archiver and aggregator. The acquisition follows similar moves by other search companies, as well as those in the publishing industry. Bloglines provides users with a way to organize and find content from various websites, which can be useful for discovering new information and personalizing their web experience. As part of the acquisition, Ask Jeeves will integrate the Bloglines archives into its own search engine, making it easier for users to find the information they need. The union between Ask Jeeves and Bloglines also suggests that the company is looking to expand its capabilities in the blog publishing world and use this new knowledge to improve their own My Jeeves service.", "phi:2.7b": " Ask Jeeves has purchased Bloglines, a popular web log market, to enhance content management and help users search for information from blogs using Really Simple Syndication (RSS). The company plans to use the 300 million archived articles on Bloglines' index to round out its own net indexing technology. The acquisition does not involve monetising Bloglines but rather helping people discover and manage their web experience, according to Ask Jeeves' Jim Lanzone.\n", "orca-mini:3b": " Ask Jeeves has bought the Bloglines website to improve its ability to handle content from web journals or blogs. The Bloglines site has become popular due to its ability to let users follow their favorite blogs without visiting each site individually and through a technology called Really Simple Syndication (RSS). Ask Jeeves plans to use the 300 million articles it has archived to round out its index of the web. While there will be no instant changes to Bloglines, Ask Jeeves will help organize the database of 300m blog entries it holds with its own net indexing technology. The acquisition follows similar moves by other search sites like Google, which acquired Pyra Labs, makers of the Blogger software, in 2003 and MSN introduced its own blog system and Yahoo has tweaked its technology to do a better job of handling blog entries.", "hermes3:3b": "Ask Jeeves acquires Bloglines, aiming to improve handling of web logs and RSS technology for content search.", "stablelm-zephyr:3b": "Ask Jeeves purchased Bloglines to enhance its handling of web journal or blog content. Bloglines gained popularity as a single platform for readers to read, search, and share their preferred blogs. The acquisition aligns with Ask Jeeves' My Jeeves service that enables users to customize their web experience and build personal link collections. Ask Jeeves plans to integrate its own technology to organize the 300 million archived articles in its index and improve searching capabilities across the blogosphere as a single corpus of information. Although there won't be immediate changes to Bloglines, Ask Jeeves intends to develop a suitable business model over time.", "chatgpt-4o-latest": "Ask Jeeves has acquired Bloglines to enhance its handling of blog content but does not plan immediate changes. Bloglines is popular for allowing users to follow multiple blogs in one place using RSS technology. The acquisition aligns with moves by other search companies like Google, MSN, and Yahoo. Ask Jeeves aims to improve blog search and integrate Bloglines with its My Jeeves service rather than enter blog publishing. The company will use Bloglines' 300 million archived articles to enhance its web index and refine its search capabilities. No immediate monetization plans were announced, and the acquisition was first hinted at by the Napsterization weblog.", "stablelm2:1.6b": "Ask Jeeves has acquired Bloglines to enhance content handling for web journals and blogs. Bloglines gained popularity by providing a central place for users to read, search, and share their interests in blogs. The acquisition will use Ask's 1 million articles archived in Bloglines to extend its index of the web. The value of Ask Jeeves' purchase was undisclosed. This follows similar moves by other search websites like Google and Yahoo. Jim Lanzone, vice president at Ask Jeeves, said they are not acquiring it solely for entering the blog publishing world; instead, they are more interested in assisting people find information. Mr. Lanzone mentioned that the acquisition will enable Ask Jeeves to discover new entries from blogs and help organize Bloglines' database with its net indexing technology.", "granite3.1-dense:2b": "Ask Jeeves has acquired Bloglines to enhance its content management capabilities, particularly for web journals or blogs. This acquisition allows users to read, search, and share their preferred blogs in one place, leveraging Really Simple Syndication (RSS) technology. Ask Jeeves plans to incorporate the 300 million articles archived by Bloglines into its existing index, rather than altering the user experience immediately. The acquisition aligns with Ask Jeeves' focus on facilitating information discovery for users, as opposed to encouraging blog writing. Vice President Jim Lanzone emphasized that the deal will complement Ask's My Jeeves service and improve the company's ability to organize and index blogs, ultimately benefiting its search portals. The exact purchase price remains undisclosed.", "reference": "Jim Lanzone, vice president of search properties at Ask Jeeves in the US, said it did not acquire Bloglines just to get a foothold in the blog publishing world.Ask Jeeves said it was not planning to change Bloglines but would use the 300 million articles it has archived to round out its index of the web.Though Mr Lanzone added that Ask Jeeves would be helping organise the database of 300m blog entries Bloglines holds with its own net indexing technology.There would be no instant sweeping changes to Bloglines, said Mr Lanzone.It would also help drive information and entries from blogs to the portals that Ask Jeeves operates.How much Ask Jeeves paid for Bloglines was not revealed.He said Ask Jeeves was much more interested in helping people find information they were looking for rather than helping them write it.Mr Lanzone said the acquisition would sit well with Ask's My Jeeves service which lets people customise their own web experience and build up a personal collection of useful links."}