{"raw_text": "Mobiles 'not media players yet'\n \n Mobiles are not yet ready to be all-singing, all-dancing multimedia devices which will replace portable media players, say two reports.\n \n Despite moves to bring music download services to mobiles, people do not want to trade multimedia services with size and battery life, said Jupiter. A separate study by Gartner has also said real-time TV broadcasts to mobiles is \"unlikely\" in Europe until 2007. Technical issues and standards must be resolved first, said the report. Batteries already have to cope with other services that operators offer, like video playback, video messaging, megapixel cameras and games amongst others. Bringing music download services based on the success of computer-based download services will put more demands on battery life.\n \n Fifty percent of Europeans said the size of a mobile was the most important factor when it came to choosing their phone, but more power demands tend to mean larger handsets. \"Mobile phone music services must not be positioned to compete with the PC music experience as the handsets are not yet ready,\" said Thomas Husson, mobile analyst at Jupiter research. \"Mobile music services should be new and different, and enable operators to differentiate their brands and support third generation network launches.\" Other problems facing mobile music include limited storage on phones, compared to portable players which can hold up to 40GB of music. The mobile industry is keen to get into music downloading, after the success of Apple's iTunes, Napster and other net music download services.\n \n With phones getting smarter and more powerful, there are also demands to be able to watch TV on the move. In the US, services like TiVo To Go let people transfer pre-recorded TV content onto their phones. But, the Gartner report on mobile TV broadcasting in Europe suggests direct broadcasting will have to wait. Currently, TV-like services, where clips are downloaded, are offered by several European operators, like Italy's TIM and 3. Mobile TV will have to overcome several barriers before it is widely taken up though, said the report.\n \n Various standards and ways of getting TV signals to mobiles are being worked on globally. In Europe, trials in Berlin and Helsinki are making use of terrestrial TV masts to broadcast compressed signals to handsets with extra receivers. A service from the Norwegian Broadcasting Corporation lets people watch TV programmes on their mobiles 24 hours a day. The service uses 3GP technology, one of the standards for mobile TV. But at the end of 2004, the European Telecommunications Institute (Etsi) formally adopted Digital Video Broadcasting Handheld (DVB-H) as the mobile TV broadcasting standard for Europe. Operators will be working on the standard as a way to bring real-time broadcasts to mobiles, as well as trying to overcome several other barriers. The cost and infrastructure needs to set up the services will need to be addressed. Handsets also need to be able to work with the DVB-H standard. TV services will have to live up to the expectations of the digital TV generation too, which expects good quality images at low prices, according to analysts. People are also likely to be put off watching TV on such small screens, said Gartner. Digital video recorders, like Europe's Sky+ box, and video-on-demand services mean people have much more control over what TV they watch. As a result, people may see broadcasting straight to mobiles as taking away that control. More powerful smartphones like the XDA II, Nokia 6600, SonyEricsson P900 and the Orange E200, offering web access, text and multimedia messaging, e-mail, calendar and gaming are becoming increasingly common. A report by analysts InStat/MDR has predicted that smartphone shipments will grow by 44% over the next five years. It says that smartphones will make up 117 million out of 833 million handsets shipped globally by 2009.\n", "llama3.2:1b": "Mobiles are not yet ready to replace portable media players, with concerns about size and battery life remaining. A study by Gartner predicts real-time TV broadcasts on mobiles is unlikely in Europe until 2007 due to technical issues and standards needed to be resolved. Battery life demands are also high for music download services. Focusing on new features like different user experience, support third generation network launches, and making operators differentiate their brands can help address these concerns. \n\nMobile TV broadcasting trials are underway, using various standards such as DVB-H and 3GP technology. The European Telecommunications Institute has adopted the standard for mobile TV in Europe. As demand grows, costs and infrastructure need to be addressed, particularly setting up services that work with the DVB-H standard. \n\nA study by analysts InStat/MDR predicts smartphone shipments will increase by 44% over five years, reaching 833 million handsets by 2009. Smartphones are becoming increasingly powerful and capable of handling more features like web access, text messaging, and multimedia capabilities, making them a viable alternative to traditional mobile media players.", "llama3.2:3b": "Mobiles are not ready to replace portable media players due to size and battery life limitations. A study by Jupiter found that people prioritize phone size over multimedia capabilities. Gartner's report suggests that real-time TV broadcasts on mobiles will be unlikely in Europe until 2007, citing technical issues and standards to resolve.", "gemma2:2b": "Mobile phones are not yet ready to fully replace portable media players in terms of music and TV services, according to two reports.  Obstacles include limited battery life, storage capacity on phones, and technical issues related to standards for broadcasting on mobile devices. While mobile TV is a possibility in the future, it faces challenges such as high cost of infrastructure and potential concerns about losing control over viewing habits. \n", "qwen2.5:0.5b": "Mobiles are not ready to be all-singing, all-dancing multimedia devices which will replace portable media players and offer music download services. While people do want to trade multimedia services with size and battery life, real-time TV broadcasts to mobiles in Europe have so far been \"unlikely.\" Batteries already need to cope with other services operators offer like video playback, video messaging, megapixel cameras, games etc. TV broadcasting needs to overcome several barriers before it is widely taken up through various standards globally.", "qwen2.5:1.5b": "Mobiles are not yet suitable for replacing portable media players as they face technical and standardization challenges, including limited battery life and storage capacity compared to traditional devices. The report suggests that bringing music downloads based on PC technology is impractical due to increased power demands, while real-time TV broadcasts in Europe are unlikely until 2007.", "qwen2.5:3b": "Mobiles are not yet ready to be all-singing, all-dancing multimedia devices capable of replacing portable media players as suggested by two reports. Despite moves to integrate music download services, issues with size and battery life hinder such integration. Gartner predicts real-time TV broadcasts to mobiles in Europe until 2007, requiring technical and standard resolution. Mobile phone music services should be new and different, emphasizing their unique features like video playback, camera functions, and game support. The industry is pushing for mobile TV broadcasting but faces challenges due to standards issues and infrastructure requirements. Analysts suggest that digital TV generation expectations may deter widespread adoption of mobile TV, while smartphone shipments are expected to grow significantly over the next five years, indicating a trend towards more powerful and multifunctional devices.", "opencoder:1.5b": "The summary of the text provided can be as follows:\n\nWhile mobiles 'not yet ready to be all-singing, all-dancing multimedia devices', despite moves to bring music download services to mobiles, people do not want to trade multimedia services with size and battery life. Despite technical issues and standards must be resolved first, real-time TV broadcasts to mobiles is \"unlikely\" in Europe until 2007. Batteries already have to cope with other services that operators offer, like video playback, video messaging, megapixel cameras and games amongst others. Bringing music download services based on the success of computer-based download services will put more demands on battery life. Despite various standards and ways of getting TV signals to mobiles, there are also challenges and barriers facing mobile music services.\n", "smollm:1.7b": "The summary is:\n\nMobiles are not yet ready to be all-singing, all-dancing multimedia devices which will replace portable media players, say two reports. Despite moves to bring music download services to mobiles, people do not want to trade multimedia services with size and battery life for real-time TV broadcasts with megapixel cameras and games amongst others. The technical issues and standards must be resolved first before mobile music services can be launched. Fifty percent of Europeans said the size of a mobile was the most important factor when it came to choosing their phone, but more power demands tend to mean larger handsets. \"Mobile phone music services must not be positioned to compete with the PC music experience as the handsets are not yet ready,\" said Jupiter research. Other problems facing mobile music include limited storage on phones, compared to portable players which can hold up to 40GB of music. The mobile industry is keen to get into music downloading, after the success of Apple's iTunes, Napster and other net music download services. In the US, services like TiVo To Go let people transfer pre-recorded TV content onto their mobiles 24 hours a day. A service from the Norwegian Broadcasting Corporation lets people watch TV programmes on their mobiles 24 hours a day. The Gartner report on mobile TV broadcasting in Europe suggests direct broadcasting will have to wait. Operators are working on the standard as a way to bring real-time broadcasts to mobiles, but they need to overcome several other barriers before mobile music services can be launched. Handsets also need to be able to work with the DVB-H standard for broadcasting. TV services will have to live up to the expectations of the digital TV generation too, which expects good quality images at low prices, according to analysts. People are likely to be put off watching TV on such small screens, said Gartner. More powerful smartphones like the XDA II, Nokia 6600, SonyEricsson P900 and the Orange E200, offering web access, text and multimedia messaging, e-mail, calendar and gaming are becoming increasingly common. A report by analysts InStat/MDR has predicted that smartphone shipments will grow by 44% over the next five years. It says that smartphones will make up 117 million out of 833 million handsets shipped globally by 2009.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about mobile phones and their future as audio streaming devices. The user provided a detailed passage with several points, and the output should be only the summary in plain text.\n\nFirst, I'll read through the text carefully. It starts by saying mobiles aren't media players yet but are not all-singing/moving dances yet either. Then it mentions that despite moving to music downloads, people don't trade multimedia services for size and battery life, referring to Jupiter's and Gartner's reports.\n\nNext, it talks about电池问题，电池已经面临其他服务的挑战。还提到移动音乐服务需要适应3G网络的推出。然后分析了 Europe 的情况，提到了价格和存储限制。\n\nThe text also mentions the global standard for mobile TV broadcasting is DVB-H, with Norwegian Broadcasting Corporation and Sky+ boxes as examples. There's a debate about quality and control over content.\n\nFinally, it lists some key smartphones like XDA II, Nokia 6600, SonyEricsson P900, Orange E200, which have web access, messaging, etc., and predicts their growth in the next five years.\n\nNow, I need to condense all these points into a concise summary. Make sure to capture the main ideas: mobiles as audio streaming devices, issues like battery life, standards for TV broadcasting, competitors like Apple's music services, and future smartphone developments.\n</think>\n\nMobile phones are poised to become audio streaming platforms, moving beyond media players but not replacing them yet. Despite efforts to integrate music downloads, users don't aim to trade multimedia services with size and battery life, as reports indicate.电池面临其他服务的挑战，需要适应3G网络。 Europe 此前面临价格和存储限制的问题。移动音乐服务需新意且支持3G，带来技术挑战。全球标准如DVB-H被欧洲采用， Norwegian Broadcasting Corporation和Sky+举例。用户对画面质量与控制权有担忧。全球趋势显示，移动电视已达到顶峰，未来可能继续增长，预测智能手机出口44%（预计2009年），占全球11700万_handset）。", "tinyllama:1.1b": "Mobiles, \"not media players yet,\" according to two reports, have not yet replaced portable media players with size and battery life in Europe. They also have technical issues that need to be resolved before bringing music download services based on the success of computer-based download services will put more demands on battery life. While European operators are trying to differentiate their brands by supporting third generation network launches, limited storage capacity on phone models is a major hurdle for mobile music. In contrast, TV services and handsets have high expectations due to the digital TV generation's expectations of high-quality images at low prices. The report predicts that smartphone shipments will grow significantly over the next five years, accounting for 117 million out of 833 million global mobile handsets by 2009.", "tinydolphin:1.1b": " Mobiles are not yet ready to replace portable media players with multimedia services, according to a recent set of reports. Despite the move towards multimedia devices, people want an alternative solution that is smaller, faster and more portable for their mobile entertainment needs. This has led researchers to suggest that there may not be a clear answer in the near future regarding whether mobile music downloads or TV broadcasting will dominate these markets.", "phi:2.7b": " Mobiles are not yet ready to replace portable media players due to limitations such as size, battery life, and technical issues related to real-time TV broadcasts. However, mobile music services have the potential to differentiate brands and support third generation network launches if they offer new and different experiences that don't compete with PC music. While the US is already experimenting with TV broadcasting through phones, there are still several barriers to widespread adoption in Europe. Digital video broadcasting handheld (DVB-H) has been chosen as the mobile TV broadcasting standard for Europe by the European Telecommunications Institute (Etsi). Operators will need to address issues such as cost and infrastructure to set up these services, while also improving handset capabilities to work with DVB-H. However, people may be put off watching TV on mobiles due to concerns over screen size, lack of control, and the availability of digital video recorders and video-on-demand services. The popularity of powerful smartphones like the XDA II, Nokia 66090, SonyEricsson P900, and the Orange E200 is increasing, with InStat/MDR predicting that smartphone shipments will grow by 44% over the next five years.\n", "orca-mini:3b": " Mobile phones are not yet fully developed to become all-singing, all-dancing multimedia devices that can replace portable media players. However, moves to bring music download services to mobiles have been met with a negative response from consumers who prioritize the size of a mobile over other factors when choosing their phone. Technical issues and standards need to be resolved before real-time TV broadcasts to mobiles can become widespread in Europe. Despite the success of computer-based download services, mobile music services must be different and supported by third generation network launches. Operators are keen to get into music downloading but with limited storage on phones, they must be prepared to sacrifice some features to make up for it. The mobile industry is also looking into ways to broadcast TV content to handsets through terrestrial TV masts or DVB-H standard. However, people's expectations of good quality images and control over what they watch on small screens may prevent them from embracing such services. Stronger smartphones like those with web access, text messaging, multimedia messaging, e-mail, calendar and gaming features are becoming increasingly common, making it difficult for operators to differentiate their brands and support third generation network launches.", "hermes3:3b": "Mobiles not ready as multimedia devices, technical issues & battery life hinder music downloads; mobile TV broadcasts unlikely until 2007 in Europe.", "stablelm-zephyr:3b": "Two reports say mobiles are not yet ready to replace portable media players, as people prefer larger devices for multimedia services. Jupiter Research suggests mobile music services should be new and different to support third generation networks, while Gartner states real-time TV broadcasts on mobiles are \"unlikely\" in Europe until 2007 due to technical issues and standards. The mobile industry wants to enter the music downloading market after Apple's success but faces limited storage capacity compared to portable players. Watching TV on the move is also challenging, with various barriers including cost, infrastructure, and small screen size. More powerful smartphones are becoming common, predicted to account for 117 million out of 833 million handsets shipped globally by 2009.", "chatgpt-4o-latest": "Mobiles are not yet ready to replace portable media players due to concerns over size, battery life, and storage limitations, according to reports by Jupiter and Gartner. While mobile music services are growing, they should not compete directly with PC-based downloads but instead offer unique experiences. Real-time mobile TV broadcasting in Europe is unlikely before 2007 due to technical and standardization challenges. Trials using terrestrial TV masts and technologies like DVB-H are underway, but cost, infrastructure, and handset compatibility remain obstacles. Additionally, small screens and the availability of digital video recorders may limit demand for mobile TV. Meanwhile, smartphones are becoming more powerful, with shipments expected to grow significantly, reaching 117 million units by 2009.", "stablelm2:1.6b": "Mobiles are not yet prepared to replace portable media players, as they face technical issues and standards issues before becoming all-singing, all-dancing multimedia devices. Battery life is compromised when integrating music download services. Size matters greatly for Europeans while choosing a phone. Operators must differentiate their brands and support third-generation network launches with mobile music services. The industry is focused on music downloading after the success of Apple's iTunes, Napster, etc., and there are demands to watch TV on the move. In Europe, trials using compressed signals from terrestrial TV masts or Norwegian broadcasting corporation services are underway for mobile TV broadcasting standards. However, overcoming barriers such Etsi's adopted DVB-H standard will be needed in setting up infrastructure and lowering costs. Meanwhile, people expect good quality images at low prices while using digital video recorders, like Sky+ box, and video-on-demand services to regain control over their TV watching experience.", "granite3.1-dense:2b": "Mobiles are not yet well-suited to replace portable media players for multimedia consumption, according to reports from Jupiter and Gartner. Key challenges include:\n\n1. Limited battery life due to existing service demands like video playback, messaging, high-resolution cameras, and games.\n2. Battery drain from music download services would further reduce mobile device performance.\n3. Insufficient storage capacity in mobile phones compared to portable players (up to 40GB).\n4. Technical issues and standardization needed for real-time TV broadcasts on mobiles, which is unlikely until 2007 in Europe.\n5. Batteries must accommodate various services offered by operators, such as video playback and megapixel cameras.\n6. Inadequate screen size to provide a satisfactory viewing experience for TV content.\n7. The digital TV generation expects high-quality images at low prices and control over their viewing experience, which mobile broadcasts may not fulfill.\n8. Powerful smartphones are gaining popularity but still make up only a fraction of total handset shipments.\n\nDespite these challenges, the mobile industry is eager to enter music downloading due to the success of services like iTunes and Napster. Meanwhile, trials for mobile TV broadcasting in Europe use terrestrial masts and 3GP technology, with DVB-H as the proposed standard. Addressing cost, infrastructure, and handset compatibility is crucial for successful implementation of real-time TV broadcasts on mobiles.", "reference": "The service uses 3GP technology, one of the standards for mobile TV.A service from the Norwegian Broadcasting Corporation lets people watch TV programmes on their mobiles 24 hours a day.\"Mobile phone music services must not be positioned to compete with the PC music experience as the handsets are not yet ready,\" said Thomas Husson, mobile analyst at Jupiter research.A separate study by Gartner has also said real-time TV broadcasts to mobiles is \"unlikely\" in Europe until 2007.Mobile TV will have to overcome several barriers before it is widely taken up though, said the report.Despite moves to bring music download services to mobiles, people do not want to trade multimedia services with size and battery life, said Jupiter.Various standards and ways of getting TV signals to mobiles are being worked on globally.But, the Gartner report on mobile TV broadcasting in Europe suggests direct broadcasting will have to wait.But at the end of 2004, the European Telecommunications Institute (Etsi) formally adopted Digital Video Broadcasting Handheld (DVB-H) as the mobile TV broadcasting standard for Europe.Digital video recorders, like Europe's Sky+ box, and video-on-demand services mean people have much more control over what TV they watch.In the US, services like TiVo To Go let people transfer pre-recorded TV content onto their phones.People are also likely to be put off watching TV on such small screens, said Gartner.TV services will have to live up to the expectations of the digital TV generation too, which expects good quality images at low prices, according to analysts."}