{"raw_text": "EU software patent law faces axe\n \n The European Parliament has thrown out a bill that would have allowed software to be patented.\n \n Politicians unanimously rejected the bill and now it must go through another round of consultation if it is to have a chance of becoming law. During consultation the software patents bill could be substantially re-drafted or even scrapped. The bill was backed by some hi-tech firms, saying they needed protections it offered to make research worthwhile.\n \n Hugo Lueders, European director for public policy at CompTIA, an umbrella organization for technology companies, said only when intellectual property was adequately protected would European inventors prosper. He said the benefits of the bill had been obscured by special interest groups which muddied debate over the rights and wrongs of software patents. Other proponents of the bill said it was a good compromise that avoided the excesses of the American system which allows the patenting of business practices as well as software. But opponents of the bill said that it could stifle innovation, be abused by firms keen to protect existing monopolies and could hamper the growth of the open source movement. The proposed law had a troubled passage through the European parliament. Its progress was delayed twice when Polish MEPs rejected plans to adopt it. Also earlier this month the influential European Legal Affairs Committee (JURI) said the law should be re-drafted after it failed to win the support of MEPs. To become law both the European Parliament and a qualified majority of EU states have to approve of the draft wording of the bill. The latest rejection means that now the bill on computer inventions must go back to the EU for re-consideration.\n", "llama3.2:1b": "The European Parliament has rejected a software patent bill, which will need to be revisited after consultation with interested parties and possibly substantially re-drafted or scrapped if it is not passed.", "llama3.2:3b": "The European Parliament has rejected a software patent bill, which is now likely to undergo further consultation and potentially be substantially re-drafted or scrapped. Proponents argue it provides necessary protections for inventors, while opponents warn of stifling innovation and abuse by firms. The bill's future is uncertain as it must go back to the EU for reconsideration after failing to win support from MEPs and being rejected twice by Polish MEPs.", "gemma2:2b": "The European Parliament rejected a bill that would have allowed software patents. This bill faces further consultation before it can be considered again. \n", "qwen2.5:0.5b": "The European Parliament rejected a software patent bill, leading to potential delays in its implementation as legislation passed through another round of consultations and could face re-evaluation.", "qwen2.5:1.5b": "The European Parliament has rejected a software patent bill, leading to potential revisions or scrapping if further consultations are required. This decision could delay the legislation's passage through the EU process.", "qwen2.5:3b": "EU software patent law faces rejection, must undergo another consultation round before becoming law. Initially backed by tech firms needing protections, it was opposed due to concerns over stifling innovation, abuse of existing monopolies, and hindering open source growth. The bill faced delays in the European Parliament due to Polish MEPs' rejection and criticism from the influential JURI committee. Now, both the European Parliament and a qualified majority of EU states need to approve the draft wording for it to become law.", "opencoder:1.5b": "The European Parliament has thrown out a bill that would allow software to be patented, the Politicians unanimously rejected the bill and now it must go through another round of consultation if it is to have a chance of becoming law. During consultation, the software patents bill could be substantially re-drafted or even scrapped. The bill was backed by some hi-tech firms saying they needed protections it offered to make research worthwhile. The proposal by European directors for public policy at CompTIA, an umbrella organization for technology companies, made the benefits of the law appear in a clear and compelling argument. The benefits had been obscured by special interest groups which muddied debate over the rights and wrongs of software patents. Other proponents argued it as a good compromise that avoided the excesses of the American system which allows the patenting of business practices as well as software. Opponents argued the bill could stifle innovation, be abused by firms keen to protect existing monopolies and could hamper the growth of the open source movement. The proposed law had faced considerable difficulties on both sides during its approval process. Despite the lack of support from MEPs, it was delayed twice when Polish MEPs rejected plans to adopt it. A recent decision led to a re-drafting meeting held by JURI, the European Legal Affairs Committee.\n", "smollm:1.7b": "The European Union has rejected a software patent bill, which would have allowed software to be patented, and it is currently in the process of being re-drafted or scrapped. The bill was backed by some high-tech firms, saying they needed protections it offered to make research worthwhile. However, other proponents of the bill said that it was a good compromise that avoided the excesses of the American system which allows the patenting of business practices as well as software. Opponents of the bill said that it could stifle innovation, be abused by firms keen to protect existing monopolies and hinder the growth of the open source movement. The proposed law had a troubled passage through the European parliament. Its progress was delayed twice when Polish MEPs rejected plans to adopt it. Also earlier this month the influential European Legal Affairs Committee (JURI) said the law should be re-drafted after it failed to win the support of MEPs. To become law both the European Parliament and a qualified majority of EU states have to approve of the draft wording of the bill. The latest rejection means that now the bill on computer inventions must go back to the EU for re-consideration.", "deepseek-r1:1.5b": "<think>\nAlright, let me try to figure out how to approach this. The user has given me a query where they want a summary of a specific text about EU software patent law. They provided some key details and want it in plain text without any explanations or formatting.\n\nFirst, I need to read through the provided text carefully. It starts by mentioning that the European Parliament (EPM) is throwing out a bill intended to allow software to be patented. Politicians agree with this rejection but mention that the law might not pass unless there's another round of consultation.\n\nLooking at the content, it mentions several points: the bill was backed by tech firms, the benefits were obscured due to special interest groups, and opponents argue it could hinder innovation and open source movement. There are also details about the EPM's recent delays in rejecting the law with Polish oppositions and a retraction from JURI.\n\nI should make sure to capture all these points concisely. The summary needs to include key ideas: the bill's fate, its benefits versus existing system issues, challenges like delays in rejection, and the opposing views about its impact on innovation and open-source movement.\n\nNow, structuring this into a concise summary without any extra information or explanations. I'll need to list each main point clearly but succinctly. Let me make sure not to miss any important details from the original text.\n\nI think that's all. Time to put it together in plain text.\n</think>\n\nThe European Parliament has rejected a bill intended to allow software to be patented, leading to another round of consultation if it passes. The bill was supported by tech companies but faces opposition due to concerns about intellectual property rights and their potential misguidance. Special interest groups may obscure debate over the law's benefits. Opponents argue the law could harm innovation and open-source movement, while supporters fear it might stifle research and development in the EU. Recent delays with Polish oppositions have delayed the bill's passage, risking its full consideration.", "tinyllama:1.1b": "Ahead of consultation, the European Parliament has rejected a proposed law aimed at allowing software patents. While some tech firms supported the initiative in favor of intellectual property, other stakeholders objected to its effects on research and innovation. The proposed bill would have allowed computer inventions to be patented, but its progress was blocked twice due to opposition from Polish MEPs who rejected plans to adopt it. A vote has since been taken, meaning that the law's future is uncertain in light of concerns over intellectual property being abused and stifling innovation. Opponents argued that software patents could stifle development of the open source movement, while supporters maintained that only when intellectual property was adequately protected would European inventors prosper. The re-drafter of the bill is set to go through another round of consultation before being submitted for approval by both Parliament and a qualified majority of EU states.", "tinydolphin:1.1b": " The European Parliament rejected a software patent bill, stating that it was not in line with their principles of intellectual property protection and the rights of innovators. The bill had received support from some tech companies, but it did not provide enough safeguards to ensure investment and innovation. Critics argued that patents should only be granted for business practices or software that was functional. A compromise was reached between these two camps, which involved providing a partial exemption from patent protection for business practices and software. However, opponents of the bill worried that it could stifle innovation and potentially lead to abuse of the system by companies keen to protect their existing monopolies. The law has been ongoing for two years, with some amendments made but not enough to guarantee the rights of all inventors. It is now back in a reconsideration process to determine whether it can become a law, given the concerns raised about its impact on innovation and fairness.", "phi:2.7b": " The EU software patent law has been rejected by politicians who believe it does not adequately protect intellectual property, hindering innovation and open source movement. It was supported by some technology firms but opposed by others who fear it could stifle innovation and be abused. The bill must now go through another round of consultation before becoming law.\n", "orca-mini:3b": " The European Parliament has rejected a bill that would have allowed software to be patented, and it may face revision or scrapping during consultation. Backers of the bill said it was necessary to protect intellectual property, while opponents argued it could stifle innovation and limit the growth of open source software. The proposed law faced obstacles in the European Parliament and was delayed twice when Polish MEPs rejected plans to adopt it. Now, the bill must be re-drafted and approved by both the European Parliament and a qualified majority of EU states before becoming law.", "hermes3:3b": "European Parliament rejects software patent bill.", "stablelm-zephyr:3b": "The European Parliament has voted against a software patents bill, leading to potential revisions or scrapping of the legislation. Some technology companies supported the bill, arguing that it would encourage research investments. However, opponents argued that it could stifle innovation and hamper the growth of the open source movement. The bill's progression was delayed twice within the European Parliament, requiring a re-consideration and possible revision before becoming law.", "chatgpt-4o-latest": "The European Parliament has rejected a bill that would have allowed software patents, requiring further consultation for any chance of becoming law. Supporters, including some tech firms, argued it provided necessary intellectual property protections, while opponents feared it would stifle innovation and harm the open-source movement. The bill faced multiple delays, including opposition from Polish MEPs and a call for re-drafting by the European Legal Affairs Committee. To become law, it must be approved by both the European Parliament and a qualified majority of EU states. The rejection means the bill must now return to the EU for reconsideration.", "stablelm2:1.6b": "The European Parliament rejected a bill allowing software to be patented, as it faces another round of consultation if it wants to become law. Politicians unanimously opposed the bill and it may even be scrapped or substantially revised during consultation. The proposal was supported by some tech firms but opposed by others who claimed it could stifle innovation and be abused by firms seeking existing monopolies. The bill faced opposition throughout its journey through the European Parliament, with Polish MEPs rejecting initial plans to adopt it and the influential European Legal Affairs Committee suggesting it should be re-drafted after failing to win support from MEPs. Both the European Parliament and a qualified majority of EU states need to approve the draft wording of the bill for it to become law.", "granite3.1-dense:2b": "The European Parliament has rejected a software patent bill, which would have enabled the protection of software as intellectual property. This decision, made unanimously by politicians, sends the legislation back for further consultation, potentially leading to significant revisions or even dismissal. Backers of the bill argued it was necessary for European inventors' prosperity and a better compromise than the American system. Opponents, however, contended that such patents could hinder innovation, be misused by corporations protecting monopolies, and impede open-source development. The bill faced delays due to disagreements within the European Parliament, with Polish MEPs rejecting adoption plans and the European Legal Affairs Committee (JURI) advising re-drafting. For the law to become effective, it must secure approval from both the European Parliament and a qualified majority of EU states.", "reference": "The European Parliament has thrown out a bill that would have allowed software to be patented.To become law both the European Parliament and a qualified majority of EU states have to approve of the draft wording of the bill.During consultation the software patents bill could be substantially re-drafted or even scrapped.Politicians unanimously rejected the bill and now it must go through another round of consultation if it is to have a chance of becoming law.Other proponents of the bill said it was a good compromise that avoided the excesses of the American system which allows the patenting of business practices as well as software.He said the benefits of the bill had been obscured by special interest groups which muddied debate over the rights and wrongs of software patents."}