{"raw_text": "Mobile networks seek turbo boost\n \n Third-generation mobile (3G) networks need to get faster if they are to deliver fast internet surfing on the move and exciting new services.\n \n That was one of the messages from the mobile industry at the 3GSM World Congress in Cannes last week. Fast 3G networks are here but the focus has shifted to their evolution into a higher bandwidth service, says the Global Mobile Suppliers Association. At 3GSM, Siemens showed off a system that transmits faster mobile data. The German company said data could be transmitted at one gigabit a second - up to 20 times faster than current 3G networks. The system is not available commercially yet, but Motorola, the US mobile handset and infrastructure maker, held a clinic for mobile operators on HSDPA (High Speed Downlink Packet Access), a high-speed, high bandwidth technology available now. Early HSDPA systems typically offer around two megabits per second (Mbps) compared with less than 384 kilobits per second (Kbps) on standard 3G networks.\n \n \"High-Speed Downlink Packet Access (HSDPA) - sometimes called Super 3G - will be vital for profitable services like mobile internet browsing and mobile video clips,\" according to a report published by UK-based research consultancy Analysys. A number of companies are developing the technology. Nokia and Canada-based wireless communication products company Sierra Wireless recently agreed to work together on High Speed Downlink Packet Access. The two companies aim to jointly market the HSDPA solution to global network operator customers.\n \n \"While HSDPA theoretically enables data rates up to a maximum of 14Mbps, practical throughputs will be lower than this in wide-area networks,\" said Dr Alastair Brydon, author of the Analysys report: Pushing Beyond the Limits of 3G with HSDPA and Other Enhancements. \"The typical average user rate in a real implementation is likely to be in the region of one megabit per second which, even at this lower rate, will more than double the capacity... when compared to basic WCDMA [3G],\" he added. Motorola has conducted five trials of its technology and says speeds of 2.9Mbps have been recorded at the edge of an outdoor 3G cell using a single HSDPA device. But some mobile operators are opting for a technology called Evolution, Data Optimised (EV-DO).\n \n US operator Sprint ordered a broadband data upgrade to its 3G network at the end of last year. We are \"expanding our network and deploying EV-DO technology to meet customer demand for faster wireless speeds,\" said Oliver Valente, Sprint's vice president for technology development, when the contract was announced. As part of $3bn in multi-year contracts announced late last year, Sprint will spend around $1bn on EV-DO technology from Lucent Technologies, Nortel Networks and Motorola that provides average data speeds of 0.3-0.5 megabits a second, and peak download rates of 2.4Mbps. MMO2, the UK-based operator with services in the UK, Ireland and Germany, has opted for technology based on HSDPA. Using technology from Lucent, it will offer data speeds of 3.6Mbps from next summer on its Isle of Man 3G network, and will eventually support speeds of up to 14.4Mbps. US operator Cingular Wireless is also adopting HSDPA, using technology from Lucent alongside equipment from Siemens and Ericsson.\n \n Siemens' plans for a one gigabit network may be more than a user needs today, but Christoph Caselitz, president of the mobile networks division at the firm says that: \"By the time the next generation of mobile communication debuts in 2015, the need for transmission capacities for voice, data, image and multimedia is conservatively anticipated to rise by a factor of 10.\" Siemens - in collaboration with the Fraunhofer German-Sino Lab for Mobile Communications and the Institute for Applied Radio System Technology - has souped up mobile communications by using three transmitting and four receiving antennae, instead of the usual one. This enables a data transmission, such as sending a big file or video, to be broken up into different flows of data that can be sent simultaneously over one radio frequency band. The speeds offered by 3G mobile seemed fast at the time mobile operators were paying huge sums for 3G licences. But today, instead of connecting to the internet by slow, dial-up phone connection, many people are used to broadband networks that offer speeds of 0.5 megabits a second - much faster than 3G. This means users are likely to find 3G disappointing unless the networks are souped up. If they aren't, those lucrative \"power users\", such as computer geeks and busy business people will avoid them for all but the most urgent tasks, reducing the potential revenues available to mobile operators. But one gigabit a second systems will not be available immediately. Siemens says that though the system works in the laboratory, it still has to assess the mobility of multiple-antennae devices and conduct field trials. A commercial system could be as far away as 2012, though Siemens did not rule out an earlier date.\n", "llama3.2:1b": "Mobile networks are seeking faster speeds through turbo boost technology. The Global Mobile Suppliers Association says fast 3G networks need to be upgraded into higher bandwidth services like mobile internet browsing and video streaming. HSDPA (High Speed Downlink Packet Access) is a key technology that enables data rates up to 14Mbps, but practical speeds will likely be lower in wide-area networks. Companies are working on developing High-Speed Downlink Packet Access, including partnerships with Siemens and Nokia, to meet the growing demand for faster mobile speeds.", "llama3.2:3b": "3G networks are seeking turbo boost by evolving into higher bandwidth services like HSDPA. Motorola is developing HSDPA technology with speeds up to 14Mbps and has conducted successful trials. Companies like Nokia and Sierra Wireless are also working on the technology. Meanwhile, US operators Sprint and MMO2 are adopting EV-DO technology for faster data speeds, while Siemens aims to develop a one-gigabit network by 2015.", "gemma2:2b": "Mobile networks need faster speeds for internet surfing and video streaming. 3G networks are being upgraded to achieve higher bandwidth with technologies like HSDPA, offering speeds up to 14Mbps but practical rates will likely be lower. EV-DO is another popular option. Operators are investing in these technologies to meet user demand. In the future, a one gigabit per second system may become more widely available but this technology is still under development and not yet commercially available. \n", "qwen2.5:0.5b": "Mobile networks aim for speed boost but have shifted focus towards HSDPA technology, expected to provide faster mobile internet surfing. HSDPA promises speeds of up to 4G per second while EV-DO is planned as a next-generation solution. Both technologies are used by operators such as Sprint and Cingular, with Siemens' mobile network systems shown to offer up to 20 times higher data transmission rates than current 3G networks.", "qwen2.5:1.5b": "Mobile networks aim for faster data transmission with higher bandwidth capabilities, moving from current 3G systems to next-generation technologies like HSDPA, EV-DO, and potential gigabit-capable systems in the future.", "qwen2.5:3b": "Mobile networks require faster speeds for internet surfing and new services. At the 3GSM World Congress, companies like Siemens showcased a system that transmits at up to one gigabit per second, significantly faster than current 3G networks (currently around 200 Kbps). High-Speed Downlink Packet Access (HSDPA) is another technology available now which can offer speeds of around two Mbps. Analysts predict the need for higher data transmission capacities will increase by a factor of ten by 2015, necessitating further improvements in mobile network capabilities. Companies like Nokia and Sierra Wireless are collaborating on HSDPA solutions. US operator Sprint uses EV-DO technology providing average data speeds of up to 2.4 Mbps, while UK-based MMO2 and Cingular Wireless adopt HSDPA for faster internet speeds. Despite these advancements, one gigabit per second systems won't be immediately available due to testing requirements.", "opencoder:1.5b": "The text provided is quite comprehensive and contains key points about mobile networks, their evolution into a higher bandwidth service, and the use of HSDPA technology. While summarizing it to keep only the main points, we can observe that:\n\n- Mobile networks seek turbo boost, which means they are looking for faster internet surfing on the move and exciting new services.\n- Fast 3G networks are here but the focus has shifted to their evolution into a higher bandwidth service.\n- Data rates up to a maximum of 14Mbps have been recorded at the edge of an outdoor 3G cell using a single HSDPA device. The typical average user rate in a real implementation is likely to be in the region of one megabit per second which, even at this lower rate, will more than double the capacity compared to basic WCDMA.\n- Motorola has conducted five trials of its technology and says speeds of 2.9Mbps have been recorded at the edge of an outdoor 3G cell using a single HSDPA device. Some mobile operators are opting for a technology called Evolution, Data Optimised (EV-DO).\n- Sprint ordered a broadband data upgrade to its 3G network at the end of last year and has spent around $1bn on EV-DO technology from Lucent Technologies, Nortel Networks and Motorola that provides average data speeds of 0.3-0.5 megabits a second.\n", "smollm:1.7b": "The article provides a summary of the main ideas from the text about mobile networks seeking turbo boost. The key points are:\n\n1. Mobile networks need to get faster if they want to deliver fast internet surfing on the move and exciting new services.\n2. HSDPA (High-Speed Downlink Packet Access) is one technology that can achieve higher data speeds, but it's not yet widely available.\n3. Motorola has developed a technology called EV-DO (Evolution Data Optimized), which uses HSDPA to offer faster data speeds.\n4. Siemens' plans for future mobile networks are likely to be more than 10 times faster than current 3G networks, but this is still some way off from the speeds offered by 5G networks.\n5. The article suggests that 3G networks may not be as fast as they seem and that mobile operators need to upgrade their networks if they want to offer fast internet services.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about 3G networks. Let me read through it first.\n\nSo, the main points are: Mobile networks seek turbo boost, specifically faster 3G networks. The 3GSM World Congress in Cannes last week mentioned that fast 3G is on the table but with a focus on higher bandwidth services like internet browsing and video. Siemens showcased a system transmitting data at gigabit per second, which is way faster than current 3G. Motorola had a HSDPA demo, which offers similar speeds but in a different technology package. The report by Analysis discussed how HSDPA could be crucial for profitable services.\n\nOther companies like Nokia and Sierra Wireless are working together on HSDPA. Mobile operators are using EV-DO and HSDPA, including Sprint, MMO2, Cingular wireless, Siemens, and Motorola. There's a call to upgrade networks beyond 3G with higher speeds, especially for voice, data, images, etc.\n\nThe summary needs to capture the key ideas: faster 3G needed, focus on bandwidth, main companies involved (Siemens, Motorola), other technologies like EV-DO, HSDPA usage by operators, impact on mobile operators and potential delays in commercialization.\n</think>\n\nFast 3G networks are essential for delivering high-speed internet browsing and video streaming. The move to higher bandwidth services will be crucial for profitable applications. Siemens has demonstrated a faster mobile data system at the 3GSM World Congress, enabling up to gigabit per second transmission speeds. Motorola is offering HSDPA, an advanced technology for even lower speeds but in a different format. Companies like Nokia and Sierra Wireless are working together on HSDPA, while others like Sprint and Cingular wireless are using EV-DO technology for faster networks. The call is to upgrade 3G networks beyond their current limitations, particularly for voice, data, images, and multimedia services. Mobile operators are adopting these technologies, with plans for significant speed increases. However, commercialization will take time, potentially as early as 2012.", "tinyllama:1.1b": "The mobile industry is rapidly evolving into a higher bandwidth service, known as High-Speed Downlink Packet Access (HSDPA). As the demand for faster internet surfing on the move increases, three companies are currently working together to develop HSDPA technology. One such company is Motorola, whose system uses transmitters with 384 kilobits per second (Kbps) of data, which is twice the theoretical maximum speed of current 3G networks. Other companies, such as Canada-based wireless communication products company Siewert Wirless and Germany's Analysys, are developing HSDPA technology for their respective markets. The European Commission has recommended that mobile operators should move to a high-speed network, with peak data speeds of at least 20 times faster than current 3G networks, to improve the profitability of services like mobile internet browsing and video clips. This will require multiple antennae, which could take several years for commercial systems to become available. However, Siewert Wirless claims it is already working on solutions.", "tinydolphin:1.1b": " In summary, high-speed downlink packet access (HSDPA) is a technology designed to boost mobile internet browsing speeds on 3G networks. This technology allows for faster data transmission rates, making the experience more enjoyable and appealing to power users. At the recent 3GSM World Congress in Cannes, Siemens revealed that its HSDPA system could be up to 20 times faster than current 3G networks. Additionally, a report from UK-based research consultancy Analysysys suggests that high-speed downlink packet access will become essential for profitable services like mobile internet browsing and mobile video clips in the coming years.", "phi:2.7b": " Mobile networks seek turbo boost by using high-speed downlink packet access (HSDPA) or super 3G technology to provide faster internet surfing on the go and new services. While HSDPA theoretically enables data rates up to 14Mbps, practical throughputs will be lower than this in wide-area networks. Motorola has conducted trials of its HSDPA technology with speeds of 2.9Mbps recorded at the edge of an outdoor 3G cell using a single device. Sprint ordered a broadband data upgrade to its 3G network and plans to use EV-DO technology from Lucent Technologies, Nortel Networks and Motorola to provide average data speeds of 0.3-0.5Mps and peak download rates of 2.4Mbps. MMO2 is also adopting HSDPA with technology from Lucent, offering speeds of 3.6-14.4Mps on its Isle of Man network. Siemens plans to use three transmitting and four receiving antennae in its one gigabit system, which will be tested and eventually released by \n", "orca-mini:3b": " Mobile networks seek turbo boost for faster internet surfing on the move and exciting new services. Third-generation mobile (3G) networks need to get faster if they are to deliver fast internet surfing on the move and exciting new services. That was one of the messages from the mobile industry at the 3GSM World Congress in Cannes last week. Fast 3G networks are here but the focus has shifted to their evolution into a higher bandwidth service, says the Global Mobile Suppliers Association. At 3GSM, Siemens showed off a system that transmits faster mobile data. The German company said data could be transmitted at one gigabit a second - up to 20 times faster than current 3G networks. The system is not available commercially yet, but Motorola, the US mobile handset and infrastructure player, held a clinic for mobile operators on HSDPA (High Speed Downlink Packet Access), a high-speed, high bandwidth technology available now. Early HSDPA systems typically offer around two megabits per second (Mbps) compared with less than 384 kilobits per second (Kbps) on standard 3G networks.", "hermes3:3b": "Mobile networks looking to enhance 3G speed for faster internet surfing and new services. Focus shifting from current fast 3G networks to higher bandwidth technologies like High Speed Downlink Packet Access (HSDPA) which offers speeds up to 2Mbps, compared to less than 384 Kbps on standard 3G networks.", "stablelm-zephyr:3b": "The mobile industry seeks a turbo boost for third-generation (3G) networks to improve fast internet surfing on the move and introduce new services. Fast 3G networks are here, but the focus is shifting towards their evolution into higher bandwidth services like High-Speed Downlink Packet Access (HSDPA). Companies like Nokia and Sierra Wireless are collaborating in developing this technology, which can reach data rates of up to 14Mbps. However, practical throughputs will be lower in wide-area networks, with an average user rate likely to be around 1 megabit per second. Mobile operators are also exploring technologies like Evolution Data Optimised (EV-DO) for faster wireless speeds. Companies like Siemens and Motorola have demonstrated their respective innovations but still need to assess mobility and conduct field trials before commercialization.", "chatgpt-4o-latest": "Third-generation (3G) mobile networks need to become faster to support high-speed internet and new services. At the 3GSM World Congress, industry leaders discussed evolving 3G into higher bandwidth services. Siemens demonstrated a system capable of transmitting data at one gigabit per second, though it is not yet commercially available. Meanwhile, Motorola promoted HSDPA (High Speed Downlink Packet Access), which offers significantly faster speeds than standard 3G. Companies like Nokia and Sierra Wireless are collaborating on HSDPA, which could provide real-world speeds of around one megabit per second. Some operators, like Sprint, are opting for EV-DO technology, while others, including MMO2 and Cingular Wireless, are adopting HSDPA. Siemens is also working on advanced mobile communication technologies that could deliver one gigabit per second by 2015. However, current 3G speeds are insufficient compared to broadband, and without improvements, mobile operators risk losing high-value users. While Siemens' high-speed system is still in the lab, commercial deployment could happen by 2012.", "stablelm2:1.6b": "Mobile networks need to improve their 3G networks for faster internet browsing and new services. The Global Mobile Suppliers Association recommends evolution into a higher bandwidth service. Siemens demonstrated a system that transmits faster mobile data; data could be transmitted at one gigabit a second, up to twice as fast than current 3G networks. High-speed downlink packet access (HSDPA) technology, sometimes called Super 3G, will be crucial for profitable services like mobile internet browsing and video clips. Nokia and Sierra Wireless are working together on HSDPA, with other companies developing the technology. However, one gigabit a second systems may not be commercially available immediately; they need to conduct field trials first before becoming commercially viable.", "granite3.1-dense:2b": "The mobile industry aims to enhance third-generation (3G) networks for faster data transmission to meet increasing user demands for high-speed internet browsing and streaming services. At the 3GSM World Congress in Cannes, Siemens demonstrated a system capable of transmitting one gigabit per second, 20 times faster than current 3G networks. However, this technology is not yet commercially available. Meanwhile, Motorola showcased High-Speed Downlink Packet Access (HSDPA), which offers data rates up to 14Mbps in theory but typically delivers around one megabit per second in real-world scenarios.\n\nSeveral companies are developing HSDPA, including Nokia and Sierra Wireless, who plan to jointly market the technology to network operators. Sprint has invested $1 billion in EV-DO from Lucent Technologies, Nortel Networks, and Motorola for average data speeds of 0.3-0.5 megabits per second and peak download rates of 2.4Mbps. In contrast, MMO2 will offer HSDPA with speeds of up to 14.4Mbps on its Isle of Man 3G network from next summer using Lucent's technology. US operator Cingular Wireless is also adopting HSDPA alongside equipment from Siemens and Ericsson.\n\nSiemens, in collaboration with the Fraunhofer German-Sino Lab for Mobile Communications and the Institute for Applied Radio System Technology, has created a system with three transmitting and four receiving antennae to boost data transmission capacity. This setup allows simultaneous transmission of multiple data flows over one radio frequency band, enabling faster file transfers and video streaming.\n\nBy 2015, the mobile industry anticipates that the demand for transmission capacities will rise by a factor of 10 for voice, data, images, and multimedia. Siemens estimates that their current technology can handle this increased load but is still conducting field trials to ensure optimal performance with multiple-antennae devices in motion. A commercial system based on these advancements could be available as early as 2012.\n\nWithout network enhancement, 3G would likely disappoint users accustomed to faster broadband speeds, potentially limiting revenue for mobile operators.", "reference": "The speeds offered by 3G mobile seemed fast at the time mobile operators were paying huge sums for 3G licences.The system is not available commercially yet, but Motorola, the US mobile handset and infrastructure maker, held a clinic for mobile operators on HSDPA (High Speed Downlink Packet Access), a high-speed, high bandwidth technology available now.Using technology from Lucent, it will offer data speeds of 3.6Mbps from next summer on its Isle of Man 3G network, and will eventually support speeds of up to 14.4Mbps.But some mobile operators are opting for a technology called Evolution, Data Optimised (EV-DO).At 3GSM, Siemens showed off a system that transmits faster mobile data.The German company said data could be transmitted at one gigabit a second - up to 20 times faster than current 3G networks.Siemens' plans for a one gigabit network may be more than a user needs today, but Christoph Caselitz, president of the mobile networks division at the firm says that: \"By the time the next generation of mobile communication debuts in 2015, the need for transmission capacities for voice, data, image and multimedia is conservatively anticipated to rise by a factor of 10.\"Siemens - in collaboration with the Fraunhofer German-Sino Lab for Mobile Communications and the Institute for Applied Radio System Technology - has souped up mobile communications by using three transmitting and four receiving antennae, instead of the usual one.Fast 3G networks are here but the focus has shifted to their evolution into a higher bandwidth service, says the Global Mobile Suppliers Association.Motorola has conducted five trials of its technology and says speeds of 2.9Mbps have been recorded at the edge of an outdoor 3G cell using a single HSDPA device.US operator Sprint ordered a broadband data upgrade to its 3G network at the end of last year.\"High-Speed Downlink Packet Access (HSDPA) - sometimes called Super 3G - will be vital for profitable services like mobile internet browsing and mobile video clips,\" according to a report published by UK-based research consultancy Analysys.Third-generation mobile (3G) networks need to get faster if they are to deliver fast internet surfing on the move and exciting new services."}