{"raw_text": "Virgin Radio offers 3G broadcast\n \n UK broadcaster Virgin Radio says it will become the first station in the world to offer radio via 3G mobiles.\n \n The radio station, in partnership with technology firm Sydus, will broadcast on selected 2G and high-speed 3G networks. Later this year listeners will be able to download software from the Virgin website which enables the service. James Cridland, head of new media at Virgin Radio, said: \"It places radio at the heart of the 3G revolution.\" Virgin Radio will be the first station made available followed by two digital stations, Virgin Radio Classic Rock and Virgin Radio Groove.\n \n Mr Cridland said: \"This application will enable anyone, anywhere to listen to Virgin Radio simply with the phone in their pocket. \"This allows us to tap into a huge new audience and keep radio relevant for a new generation of listeners.\" Saumil Nanavati, president of Sydus, said, \"This radio player is what the 3G network was built for, giving consumers high-quality and high-data products through a handset in their pocket.\" Virgin says an hour's listening to the station via mobile would involve about 7.2MB of data, which could prove expensive for people using pay as you download GPRS or 3G services. Some networks, such as Orange, charge up to £1 for every one megabyte of data downloaded. Virgin says radio via 2G or 3G mobiles is therefore going to appeal to people with unlimited download deals. There are 30 compatible handsets available from major manufacturers including Nokia and Samsung while Virgin said more than 14.9 million consumers across the globe can use the service currently.\n", "llama3.2:1b": "Virgin Radio will become the first station in the world to offer radio via 3G mobiles, with selected stations on 2G and high-speed 3G networks available for download from a website. The service allows listeners to tune into the station anywhere with a phone in their pocket.", "llama3.2:3b": "Virgin Radio will be the first station to offer radio via 3G mobiles, partnering with Sydus to broadcast on selected networks. Listeners will download software from the website to access the service. The launch marks a new era for radio, allowing anyone to listen anywhere with their phone. Virgin plans to expand to two digital stations later this year, but data usage and costs may be a concern for users.", "gemma2:2b": "Virgin Radio will offer radio broadcasts via 3G mobile networks, becoming the first station to do so. This new service allows listeners to download software to their phones and listen to the station, expanding its audience. The service uses a significant amount of data (7.2MB per hour), which may be costly for users with pay-as-you-go plans. \n", "qwen2.5:0.5b": "Virgin Radio will be the first station in the world to offer radio via 3G mobiles. The company plans to partner with technology firm Sydus, enabling it to broadcast on selected 2G and high-speed 3G networks later this year. Virgin Radio aims to provide a seamless user experience for listeners by enabling them to download software from its website, which enables the service. This application will enable anyone, anywhere to listen to Virgin Radio using their phone in their pocket. Saumil Nanavati, president of Sydus, said that 3G network revolutionized radio, and Virgin Radio's new app will give consumers high-quality and data-rich content through a handset in their pocket. Some networks charge up to £1 for every one megabyte of data downloaded, while others offer unlimited downloads for an hour's listening to the station via mobile. There are over 30 compatible handsets available from major manufacturers like Nokia and Samsung.", "qwen2.5:1.5b": "Virgin Radio will offer radio via 3G mobiles, partnering Sydus to broadcast on selected networks later this year, enabling downloads of software for the service through a website, following up on two digital stations and placing radio at the heart of the 3G revolution.", "qwen2.5:3b": "Virgin Radio will become the first global station to broadcast via 3G mobiles, partnering with Sydus. They plan to launch a software download that allows listeners to access their content on selected 2G and high-speed 3G networks this year. The service is expected to be used by anyone within range of compatible handsets, including those from major manufacturers like Nokia and Samsung. While using the service could involve significant data usage charges for pay-as-you-download plans, it will appeal to users with unlimited download deals. James Cridland, head of new media at Virgin Radio, highlighted the potential of this technology by placing radio at the heart of the 3G revolution, making it accessible anytime, anywhere through mobile devices.", "opencoder:1.5b": "Virgin Radio offers 3G broadcast\n\nUK broadcaster Virgin Radio says it will become the first station in the world to offer radio via 3G mobiles.\n\nThe radio station, in partnership with technology firm Sydus, will broadcast on selected 2G and high-speed 3G networks. Later this year listeners will be able to download software from the Virgin website which enables the service. James Cridland, head of new media at Virgin Radio, said: \"It places radio at the heart of the 3G revolution.\" Virgin Radio will be the first station made available followed by two digital stations, Virgin Radio Classic Rock and Virgin Radio Groove.\n\nMr Cridland said: \"This application will enable anyone, anywhere to listen to Virgin Radio simply with the phone in their pocket. This allows us to tap into a huge new audience and keep radio relevant for a new generation of listeners.\" Saumil Nanavati, president of Sydus, said, \"This radio player is what the 3G network was built for, giving consumers high-quality and high-data products through a handset in their pocket.\" Virgin says an hour's listening to the station via mobile would involve about 7.2MB of data, which could prove expensive for people using pay as you download GPRS or 3G services. Some networks, such as Orange, charge up to £1 for every one megabyte of data downloaded. Virgin says radio via 2G or 3G mobiles is therefore going to appeal to people with unlimited download deals. There are 30 compatible handsets available from major manufacturers including Nokia and Samsung while Virgin said more than 14.9 million consumers across the globe can use the service currently.\n", "smollm:1.7b": "Virgin Radio will become the first station in the world to offer radio via 3G mobiles, allowing listeners to download software that enables them to listen to the station on their mobile devices. The radio station is part of a partnership with technology firm Sydus, which has developed an application that allows users to access Virgin Radio through their mobile phones.\nVirgin Radio will be the first station made available for download on selected 2G and high-speed 3G networks later this year. Later this year listeners will be able to download software from the Virgin website that enables them to listen to the radio station on their mobile devices. James Cridland, head of new media at Virgin Radio, said: \"It places radio at the heart of the 3G revolution.\" Virgin Radio will be the first station made available for download on selected 2G and high-speed 3G networks later this year.\nVirgin says an hour's listening to the station via mobile would involve about 7.2MB of data, which could prove expensive for people using pay as you download GPRS or 3G services. Virgin says radio via 2G or 3G mobiles is therefore going to appeal to people with unlimited download deals. There are 30 compatible handsets available from major manufacturers including Nokia and Samsung while Virgin said more than 14.9 million consumers across the globe can use the service currently.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Virgin Radio becoming the first 3G radio station globally. Let me read through the text carefully.\n\nFirst, Virgin Radio is offering 3G broadcast in the UK. They'll partner with Sydus, a tech company, and use their networks for broadcasting. That means on selected 2G and high-speed 3G networks. I should note that they'll launch later this year, allowing listeners to download software from Virgin's website.\n\nJames Cridland is the head of new media at Virgin Radio. He says it places radio at the heart of the 3G revolution. They'll be the first followed by two digital stations: Virgin Radio Classic Rock and Virgin Radio Groove. So, the summary should mention this partnership, the launch date, and the two new stations.\n\nSaumil Nanavati from Sydus mentions that this application uses a phone to provide high-quality data products like radios. It's what 3G networks were built for, giving consumers a lot of data on their hand. They said an hour's listening would use about 7.2MB of data, which could be expensive if you pay as you download services.\n\nSome networks charge up to £1 per megabyte downloaded, which isn't great for those with unlimited deals. Virgin says they'll appeal to users who can use it indefinitely. There are 30 compatible handsets from major companies like Nokia and Samsung. Currently, 149 million people can use the service globally.\n\nWait, so I need to make sure all key points are included: 3G radio becoming global first, partnering with Sydus, using 2G and 3G, launch date, new stations, Cridland's statement, data usage, Sydus's product benefits, pricing, and current user base. Also, the 149 million users figure.\n\nI should structure it into a concise summary without any extra info or explanations, just plain text. Let me try putting it all together.\n</think>\n\n Virgin Radio is launching the first 3G-enabled radio station in the UK through its Sydus partnership with selected 2G and high-speed 3G networks. This initiative will be launched later this year, enabling listeners to download software from the Virgin website for seamless audio playback on mobile devices. James Cridland, the new media head of Virgin Radio, highlighted how this service places radio at the heart of the 3G revolution. The station will also feature two additional digital stations: Virgin Radio Classic Rock and Virgin Radio Groove. Saumil Nanavati from Sydus noted that this app leverages a phone for high-quality data products like radios, designed specifically for consumer convenience. While an hour's listening would require about 7.2MB of data, which could be costly with GPRS or 3G services, the service appeals to those with unlimited download deals. Currently, over 149 million people in the UK can use Virgin Radio via their devices.", "tinyllama:1.1b": "Virgin Radio's first step in offering radio on mobile networks is to offer its services via 3G broadband, making it the first radio station to do so. The service will be available to some 2G and high-speed 3G networks later this year, with the aim of reaching a new audience for Virgin Radio. The application being launched by the station partnership with Sydus will allow listeners to download songs and other content onto their handsets, meaning they can receive radio via mobile for less than £1 per megabyte. Virgin Radio is tapping into the potential of 3G networks to offer a new generation of consumers a high-quality radio experience without incurring monthly data charges. The station says that an hour's listening on its network will consume around 7.2MB of data, which could be costly for people with unlimited download deals. Virgin Radio has already set itself apart from other broadcasters by offering its services via high-speed networks, rather than slower mobile connections. Its partnership with Sydus will enable the launch of the service on 3G and more than 14.9 million consumer devices worldwide are currently compatible with it.", "tinydolphin:1.1b": " Virgin Radio, a UK radio station, is set to become the first station worldwide to offer its content via mobile data networks. This innovative approach combines Virgin Radio's extensive programming with cutting-edge technology from Syndus to deliver seamless and high-quality audio experiences on smartphones. The service will be made available in partnership with two digital stations, Virgin Radio Classic Rock and Virgin Radio Groove, as well as the first of several regional radio networks in the UK. By offering high-quality content through mobile devices, Virgin Radio aims to reach a new audience while staying relevant to its existing fan base.", "phi:2.7b": " Virgin Radio announces it will become the first station in the world to offer radio through 3G mobiles, partnering with technology firm Sydus. The radio station will broadcast on selected 2G and high-speed 3G networks, allowing listeners to download software from the Virgin website to listen to the service. Mr. James Cridland, head of new media at Virgin Radio, says this application taps into a huge new audience and keeps radio relevant for a new generation of listeners. Saumil Nanavati, president of Sydus, says that this radio player is what 3G networks were built for, giving consumers high-quality and high-data products through a handset in their pocket. Some networks charge up to £1 per megabyte of data downloaded. Virgin Radio says its radio via 2G or 3G mobiles is going to appeal to people with unlimited download deals. Currently, there are 30 compatible handsets available from major manufacturers including Nokia and Samsung, and over 14.9 million consumers across the globe can use the service.\n", "orca-mini:3b": " UK broadcaster Virgin Radio will become the first station in the world to offer radio via 3G mobiles, partnering with technology firm Sydus. The radio station will broadcast on selected 2G and high-speed 3G networks later this year, followed by digital stations Virgin Radio Classic Rock and Virgin Radio Groove. The application enables anyone, anywhere to listen to Virgin Radio simply with the phone in their pocket. It allows the station to tap into a huge new audience and keep radio relevant for a new generation of listeners. However, some networks charge up to £1 for every one megabyte of data downloaded, which could prove expensive for people using pay as you download GPRS or 3G services.", "hermes3:3b": "Virgin Radio to become first station offering 3G broadcasts, partnering with Sydus; allows mobile listening later this year.", "stablelm-zephyr:3b": "Virgin Radio will be the first station to offer radio via 3G mobiles, partnering with technology firm Sydus for broadcasts on selected 2G and 3G networks. Listeners can download software from Virgin's website later this year to enable the service. The move aims to tap into a new audience and keep radio relevant for a generation of listeners. An hour's listening would involve around 7.2MB of data, which could be expensive for those with pay-as-you-go GPRS or 3G services. Compatible handsets are available from major manufacturers like Nokia and Samsung, with more than 14.9 million consumers globally able to use the service currently.", "chatgpt-4o-latest": "Virgin Radio will become the first station to offer broadcasts via 3G mobile networks in partnership with Sydus. Listeners can download software from Virgin’s website to access the service, initially featuring Virgin Radio, followed by Virgin Radio Classic Rock and Virgin Radio Groove. The initiative aims to expand radio’s reach and relevance, leveraging 3G’s high-quality data capabilities. However, data costs could be high for users without unlimited plans, as an hour of listening consumes about 7.2MB. The service is currently compatible with 30 handsets from major manufacturers, reaching over 14.9 million users worldwide.", "stablelm2:1.6b": "Virgin Radio becomes first station worldwide to offer radio via 3G mobiles, partnering with Sydus. Selected 2G and high-speed 3G networks will broadcast selected content, with software download available on Virgin website soon. This app allows listeners anywhere to listen to Virgin Radio from their phones. Cost for an hour's listening could be expensive using pay-as-you-go services but is appealing for those with unlimited data plans. Major handset manufacturers have compatible models; over 9M global users can use this service currently.", "granite3.1-dense:2b": "Virgin Radio, in collaboration with Sydus, plans to be the world's first radio station to broadcast via 3G mobile networks. Listeners will download software from the Virgin website to access this service. James Cridland, head of new media at Virgin Radio, emphasized that this initiative positions radio within the 3G revolution. The digital stations, including Classic Rock and Groove, will follow suit. Saumil Nanavati, Sydus president, highlighted that the application aligns with 3G network capabilities for delivering high-quality data through handsets.\n\nApproximately 7.2MB of data is required for an hour's listening on mobile networks, which could be costly for users with limited data plans. However, over 14.9 million consumers globally can already use this service due to compatible devices from major manufacturers like Nokia and Samsung.", "reference": "James Cridland, head of new media at Virgin Radio, said: \"It places radio at the heart of the 3G revolution.\"UK broadcaster Virgin Radio says it will become the first station in the world to offer radio via 3G mobiles.Virgin Radio will be the first station made available followed by two digital stations, Virgin Radio Classic Rock and Virgin Radio Groove.Virgin says radio via 2G or 3G mobiles is therefore going to appeal to people with unlimited download deals.The radio station, in partnership with technology firm Sydus, will broadcast on selected 2G and high-speed 3G networks."}