{"raw_text": "Broadband set to revolutionise TV\n \n BT is starting its push into television with plans to offer TV over broadband.\n \n As a telecoms company, BT is moving to a content distribution strategy, Andrew Burke, chief of BT's new Entertainment unit told the IPTV World Forum. \"We want to be an entertainment facilitator,\" he said on the opening day of the London conference. The BBC is also trialling a service to play programmes over the net and has not ruled out offering it to non-licence fee payers overseas. The corporation's Interactive Media Player (iMP) is its first foray into broadband TV - known as IPTV (Internet Protocol TV).\n \n \"We see several opportunities for delivering the type of content that normally broadcasters find it difficult to get to viewers,\" said BT's Andrew Burke.\n \n With more people on broadband, and connection speeds increasing, telcos around the world are looking for new ways to make money from it. Increased competition between net service providers, encouraged by Ofcom, has eroded BT's position in the market. It is looking for a good return on its investment in the technology which has made broadband over ADSL a reality. It also sees delivering TV over broadband as a way of getting high-definition (HD) content to people sooner than they will be able to get it through conventional, regular broadcasts. The BBC's iMP has just finished successful technical trials and is set for much larger consumer trials later in 2005. Before it officially launches, the BBC must show the government how it offers value for money. Delivering programmes over broadband offers clear public value, says the BBC, because it gives people more control, and more choice.\n \n IPTV is a similar idea to VoIP services, like Skype. Both use broadband net connections to carry information, like video and voice, in packets of data instead of conventional means. Since it uses internet technology, IPTV could mean more choice of programmes, more, more interactivity, tailored programming, and more localised content outside of conventional satellite, digital cable, and terrestrial broadcasts.\n \n It is all part of the larger changing TV technology landscape and, like personal digital video recorders (PVRs), gives people much more control over TV. Broadcasters see IPTV and PVRs as both as a threat and an opportunity. The BBC recognises that TV over broadband is a reality and aims to innovate with it, said Rahul Chakkara, controller of BBCi's 24/7 interactive TV services. The iMP is based on peer-to-peer technology, and lets people download programmes the BBC owns the rights to for up to seven days after broadcast. \"IPTV enables us to take back that programme to our audience at different times,\" said Mr Chakkara.\n \n \"So we can tell our audience that that programme they paid for [via the licence fee], they can access it any time they want.\" It helps, said Mr Burke, that people are more au fait with terms like \"digital\", \"interactive\", now that digital TV reaches more than 56% of UK homes. According to Benoit Joly from broadband telecoms firm Thales, 30% of Europe cannot get satellite TV or digital TV. They could get IPTV though. Analysts say that IPTV will account for 10% of the digital TV market in Europe alone by the end of the decade. What needs to happen now, agree analysts, is for connection speeds to be bumped up to handle the service; 20Mbps connections would be ideal. BT does not see itself as a broadcaster of IPTV services, rather as an \"enabler\", said Mr Burke. Its strategy is a \"hybrid\" approach, he explained, where over-the-air conventional broadcasts are supplemented with content over broadband.\n \n Initially appealing to niche markets, like sports fans, it will widen out. But IPTV could be used for home-monitoring, \"pet cams\", localised news services, and local authority TV, too says BT. It even suggests that it could target those households in the UK that do not own a computer, 40% of the country.\n \n Broadband to them would not be about data and the net - that could come later for them - but about cheap phone calls and more choice of TV programmes. Home Choice already offers 10,000 hours of shows and channels, delivered over broadband to homes in London. With a broadband net subscription, you can also get your TV and phone service. Through content deals and partnerships, it offers satellite as well as terrestrial channels, and bespoke channels based on what viewers pick and choose from its catalogues. It aims to expand nationally, but is seeing a lot of success with what it offers its 15,000 subscribers now, and aims to double uptake as well as reach by the summer. Although still at a very early stage, IPTV is another application for broadband that underlines its growing prominence as a backbone network - another utility like electricity.\n", "llama3.2:1b": "BT is launching TV over broadband with plans to offer content distribution through a service called IPTV (Internet Protocol TV). The BBC is trialing the service and has not ruled out offering it to non-licence fee payers overseas, while also competing in the market for new ways to monetize broadband services. \n\nIPTV uses broadband net connections to carry information such as video and voice in packets of data instead of conventional means. It offers more choice of programmes, more interactivity, tailored programming, and more localised content outside of conventional satellite, digital cable, and terrestrial broadcasts.\n\nThe BBC's Interactive Media Player (iMP) is an example of IPTV technology that enables users to download programmes for up to seven days after broadcast. This allows users to access their favourite shows at different times. Analysts predict that IPTV will account for 10% of the digital TV market in Europe alone by the end of the decade, with a focus on delivering high-definition content and increased user control.\n\nBT sees IPTV as an opportunity to innovate with content distribution while also leveraging its existing broadband infrastructure. The service is part of BT's broader strategy to make money from broadband technology, which it has seen eroded due to increased competition in the market.", "llama3.2:3b": "BT plans to offer TV over broadband, using internet protocol technology (IPTV), with the BBC also trialling similar service. This could give more control and choice to viewers, with increased interactivity and localised content. BT sees IPTV as an opportunity to deliver high-definition content sooner than through conventional broadcasts. The company aims to provide a hybrid approach, supplementing over-the-air broadcasts with broadband content, and targets niche markets initially before widening out.", "gemma2:2b": "BT is entering the television market with plans to offer TV over broadband.  The company sees this technology as a way to compete with other internet service providers and deliver high-definition content sooner than traditional broadcasts. The BBC is also trialing a similar service called iMP, which could eventually be available to non-license fee payers overseas.  IPTV leverages internet technologies like peer-to-peer to provide viewers with more choice of programming, interactivity, and localized content.  While broadcasters are both excited about the opportunity presented by IPTV and cautious about its potential impact on traditional television formats, it is expected to disrupt the TV landscape significantly in the coming years. \n", "qwen2.5:0.5b": "Broadband TV will revolutionise TV in the future, allowing viewers to watch live events over the internet without traditional satellite or cable services. ITV and BBC are testing new services such as iMP, which uses peer-to-peer technology for on-demand video content. IPTV is similar to VoIP services but allows users to access a wider range of programming through the internet. BT is developing an innovative service called \"iMP\" that uses peer-to-peer technology to deliver live TV over broadband networks. This approach aims to improve choice, reduce costs and increase flexibility for viewers. The company's strategy is described as a hybrid offering, combining traditional broadcasting with on-demand video content delivered via the internet. It aims to expand its services nationally and offer higher data speeds in order to attract more users. ITV and BBC are currently testing their new services while BT works on developing an innovative service called \"iMP\".", "qwen2.5:1.5b": "Broadband revolutionizing TV: BT starts offering TV over broadband connections; increasing competition from other ISPs encourages telcos to seek new revenue streams. IPTV services using internet technology offer choice, interactivity, and local content outside traditional broadcast methods, aiming for high-definition video delivery sooner than regular broadcasts. With 30% of Europe unable to access satellite or digital television, more people on broadband networks, and increasing connection speeds, ISPs like BT are exploring ways to generate additional revenue from the growing demand for internet-based TV services.", "qwen2.5:3b": "Broadband set to transform TV with BT launching television services over internet protocol (IPTV). BT sees IPTV as an opportunity to offer more interactive content and high-definition programs faster than traditional broadcasts, using the BBC's Interactive Media Player (iMP) for trials. Competition from net service providers and declining market share have driven BT towards this strategy. The technology is seen as offering increased control over TV viewing, with potential applications like home monitoring and local news services. Analysts predict that IPTV could account for 10% of the digital TV market by decade's end. Initially targeting niche markets, IPTV aims to become more widespread, including reaching households without computers.", "opencoder:1.5b": "Broadband will revolutionise TV, changing how people access content and experiences on TV. As telecoms company BT, it's pushing the envelope with plans to offer TV over broadband. \n\n\"Looking for opportunities to deliver the type of content that is typically found on broadcasters difficult,\" BT's Andrew Burke said on the opening day of the London conference. \"We see several opportunities for delivering the type of content this platform can't get to viewers, like HD content earlier in 2005.\"\n\nThe BBC has just finished successful technical trials and is set to launch much larger consumer trials in 2005. With more people on broadband, and faster connection speeds, telcos around the world are anticipating new ways to make money from it. Increased competition between net service providers, driven by Ofcom, has eroded BT's position in the market.\n\nThe BBC recognises that TV over broadband is a reality and plans to innovate with it. It offers much more control, and more choice. Delivering programmes over broadband offers clear public value because it gives people more control over content and time before broadcast.\n\nIPTV, like VoIP services, uses broadband internet connections to carry information. Since it uses internet technology, IPTV could mean more choice of programmes, more interactivity, tailored programming, and more localised content outside of conventional broadcasting methods.\n\nIt’s all part of the larger changing TV landscape. It supports both as a threat and an opportunity. The BBC recognises that TV over broadband is a reality and aims to innovate with it.\n\nTV over broadband is a reality and wants to innovate with it. The BBC has seen successful technical trials and plans to expand its reach internationally.\n\nAs for the content, people are more accustomed to terms like \"digital\", \"interactive,\" because digital TV reaches more than 56% of UK homes. They could get IPTV though. Analysts say that broadband will account for 10% of the digital TV market in Europe alone by the end of the decade.\n\nBroadband to them would not be about data and the net - that could come later for them. But it's about cheap phone calls and more choice of TV programmes, right? The BBC promises this as its hybrid approach where conventional broadcasts are supplemented with content over broadband.\n\nThrough content deals and partnerships, it offers satellite as well as terrestrial channels based on what viewers pick and choose from its catalogues. It aims to expand nationally but is seeing a lot of success with what it offers its 15,000 subscribers now.\n\nHome Choice already offers 10,000 hours of shows and channels, delivered over broadband to homes in London. With a broadband subscription, you can also get your TV and phone service. As for the content, people are more inclined to use this as a backbone network - another utility like electricity.\n", "smollm:1.7b": "Broadband set to revolutionise TV", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Broadband revolutionizing TV, specifically focusing on BT and their new IPTV service. The user wants only the summary in plain text without explanations or any formatting.\n\nFirst, I'll read through the entire passage to understand the key points. It starts by mentioning BT is moving into TV using broadband (IPTV) over BT's iMP product. Andrew Burke says they want to be a content facilitator and mentions the BBC's efforts in offering IPTV over net and for non-licensing fee payers.\n\nThen, there's talk about increased competition from Net-friendly providers which is causing BT's position to wane. They're looking for revenue growth through IPTV. The BBC's iMP has successful trials and future plans with larger consumer trials. They explain IPTV as a VoIP-like service for content delivery over the net.\n\nAnother important part is how IPTV offers more choice, local programming, and interactivity compared to traditional TV services. It also touches on BT seeing IPTV as a new platform, acting as an intermediary between terrestrial services and IPTV.\n\nThe text mentions that while IPTV could target specific niches like sports fans, it's also applicable for home features such as pet cams or local news. However, not all users might have the right technology. It also talks about the potential of broadband to make IPTV accessible without net access initially.\n\nOverall, the main points are BT shifting TV into IPTV, their current strategy with iMP, the market's competition, and how this service can provide value beyond traditional broadcasting.\n</think>\n\nBroadband is transforming television by enabling content delivery over the internet. BT, a telecom giant, has started offering IPTV, integrating its Interactive Media Player (iMP) to deliver TV content via broadband. Andrew Burke stated they aim as a content facilitator and mention the BBC's efforts in IPTV trials. With increased competition, BT is seeking revenue through IPTV, targeting users with more choice and interactivity than conventional methods. IPTV offers flexibility over net connections, allowing for local and diverse programming. Current plans focus on homes and pet cams but may expand to other services like local authority TV.", "tinyllama:1.1b": "Ahead of its planned rollout in the UK, BT has started to offer \"broadband set\"-style TV over internet protocol (IPTV) to entice viewers who are not yet connected via a home broadband network. As a content facilitator for traditional broadcasters and non-telecoms players alike, BT hopes to become a one-stop shop for people looking for a better streaming experience than they can get from conventional television over-the-air (OTA) broadcasts. The company's plan is to offer high-definition (HD) content over broadband and to showcase the technology's potential value through public value tests that are scheduled to run later in 2005. IPTV also offers control over TV, more localized content outside of conventional satellite, digital cable, and terrestrial broadcasts, and enhanced interactive programming. The company sees IPTV as both a threat and an opportunity for change but acknowledges the need for faster connection speeds to handle the service, especially in Europe where only 56% of UK homes get a satellite or digital TV signal. As part of its larger changing TV technology landscape, BT aims to innovate with IPTV by giving people more control over TV and offering more customization options beyond traditional television over-the-air broadcasts.", "tinydolphin:1.1b": " The Broadband Set to Revolutionize TV: \n\nBroadband is set to revolutionize television by enabling the delivery of over-the-air (OTA) programs via broadband connections, an innovative concept that BT is introducing as part of its 'Interactive Media Player' (iMP). The iMP launches on October 15th, and will be available initially to a small number of users.\n\nThe iMP, which stands for Interactive Media Player, offers content delivery over broadband technology, known as IPTV (Internet Protocol TV). This service allows viewers to access programs directly through their web browsers, eliminating the need to have a cable or satellite subscription. Users can watch OTA television shows, movies, and other content over the internet, providing greater control and convenience compared to traditional broadcasting.\n\nThe primary reason behind this innovative concept is to offer high-definition (HD) content to viewers who may not have access to conventional, regular broadcasts. BT believes that IPTV will be a major driver of revenue for its Interactive Media Player service and could potentially attract customers who are more familiar with digital media consumption.\n\nThe iMP's primary competition will come from other telecom companies in the UK, such as Sky and Virgin Media. Both of these companies have entered the market with plans to offer TV over broadband, using traditional analogue television signals. While this approach is less convenient for consumers, it offers a cheaper way of delivering content to subscribers.\n\nIn comparison to satellite, digital cable, or terrestrial broadcasts, OTA television provides viewers with more control and convenience. Users can pause, rewind, and fast-forward through programs on their own, making it an attractive option for those who prefer a personalized viewing experience over conventional channels. Additionally, the iMP offers local content as well as international news and entertainment, providing a more diverse range of choices compared to traditional broadcasting.\n\nWhile initial iMP services will be available to a small number of users, the idea behind this innovative service is that it could lead to even greater accessibility and convenience for viewers in the future. As OTA television becomes more popular, BT expects to increase its investment in the technology and offer more channels to its customers over the internet.", "phi:2.7b": " BT is starting to offer TV over broadband. As a telecoms company, they want to be an entertainment facilitator. The BBC has also trialled this service and sees it as a way of getting high-definition content to people sooner than regular broadcasts can. IPTV uses internet technology to deliver programming, giving more control and choice to viewers. BT does not see itself as a broadcaster but rather as an enabler, using a hybrid approach with both over-the-air and broadband services. This is just the beginning of the changing TV landscape, where IPTV could become common in homes around Europe. However, better connection speeds are needed for this to happen.\n", "orca-mini:3b": " BT is launching a new push into television with plans to offer TV over broadband, using content distribution strategy. The BBC's iMP trial has been successful and will be tested on a larger scale later in 2005. The iMP offers programmes downloaded for seven days after broadcast and can reach people who cannot access satellite or digital TV. IPTV enables viewers to take back programmes they paid for, and BT sees itself as an enabler rather than a broadcaster of IPTV services. Broadband could be used for home monitoring, localised news services, and local authority TV. Content deals and partnerships offer satellite and terrestrial channels, as well as bespoke channels based on viewer choice. The iMP trial has been successful, and BT aims to double uptake and reach 15,000 subscribers by summer 2005. Although still at an early stage, IPTV is another application for broadband that highlights its growing prominence as a backbone network.", "hermes3:3b": "BT revolutionising TV with broadband; offering TV over broadband as telecoms company strategy.", "stablelm-zephyr:3b": "BT plans to offer TV over broadband, aiming to become an entertainment facilitator and capitalize on increased broadband usage and connection speeds. The BBC is also experimenting with broadcasting TV over the internet through their Interactive Media Player (iMP), which could lead to more interactive and localized content options. BT sees IPTV as a way to deliver high-definition content sooner than traditional broadcasts, while also offering broader control and choice to viewers. IPTV usage is expected to account for 10% of the digital TV market in Europe by the end of the decade, with connection speeds needing to increase to 20Mbps to support the service.", "chatgpt-4o-latest": "BT is entering the television market by offering TV over broadband, aiming to become an \"entertainment facilitator.\" The BBC is also exploring broadband TV with its Interactive Media Player (iMP), which allows users to download programs for up to seven days after broadcast. IPTV, similar to VoIP, delivers video content over the internet, providing more choice, interactivity, and localized programming. With broadband adoption increasing, telecom companies see IPTV as a way to generate revenue and deliver high-definition content faster than traditional broadcasts. Analysts predict IPTV will account for 10% of Europe's digital TV market by the end of the decade, but faster internet speeds are needed for optimal service. BT plans a hybrid approach, combining conventional broadcasts with broadband content, initially targeting niche markets like sports fans. IPTV could also serve non-computer-owning households by offering cheap phone calls and expanded TV options. Home Choice already provides broadband-based TV and phone services in London, with plans to expand. Though still in its early stages, IPTV highlights broadband's growing role as a key infrastructure, akin to electricity.", "stablelm2:1.6b": "BT plans to offer TV over broadband as a content distribution strategy, aiming to be an \"entertainment facilitator\". With more people on broadband and connection speeds increasing, telcos are seeking ways to profit from it. The BBC is trialling a service for playing programmes online and exploring offering it to non-licence fee payers overseas, including IPTV technology. This technology allows for high-definition content delivery, increased interactivity, tailored programming, and localised content outside traditional broadcasting methods. Analysts predict that around 15% of the European digital TV market will be dominated by IPTV by the end of the decade.", "granite3.1-dense:2b": "BT, a telecommunications company, is transitioning from a provider of traditional voice services to a content distributor by launching TV over broadband (IPTV) through its new Entertainment unit. The BBC is also developing an IPTV service called the Interactive Media Player (iMP), which allows users to access programs for up to seven days post-broadcast, leveraging peer-to-peer technology and providing greater control and flexibility.\n\nAs more people adopt broadband and connection speeds improve, telecom companies seek new revenue streams. IPTV offers several advantages over traditional broadcasts, such as enabling high-definition content delivery earlier to consumers due to its use of internet technology. This innovation allows for more interactivity, personalized programming, and localised content.\n\nAnalysts predict that IPTV will constitute 10% of the European digital TV market by the end of the decade, with 30% of Europe currently unable to receive satellite or digital terrestrial television but having access via IPTV. To fully realize its potential, improved connection speeds are needed—ideally, 20Mbps connections.\n\nBT's approach is a hybrid strategy that complements conventional over-the-air broadcasts with content delivered via broadband. This includes catering to niche markets like sports fans and expanding into services for households without computers (40% of the UK population). Home Choice already delivers 10,000 hours of TV shows and channels over broadband to subscribers in London and aims to expand nationally.\n\nBy offering home-monitoring, \"pet cams,\" localised news, and local authority TV through IPTV, BT highlights the versatility of broadband as a backbone network, comparable to utilities like electricity.", "reference": "With a broadband net subscription, you can also get your TV and phone service.The BBC recognises that TV over broadband is a reality and aims to innovate with it, said Rahul Chakkara, controller of BBCi's 24/7 interactive TV services.The corporation's Interactive Media Player (iMP) is its first foray into broadband TV - known as IPTV (Internet Protocol TV).It also sees delivering TV over broadband as a way of getting high-definition (HD) content to people sooner than they will be able to get it through conventional, regular broadcasts.According to Benoit Joly from broadband telecoms firm Thales, 30% of Europe cannot get satellite TV or digital TV.Broadband to them would not be about data and the net - that could come later for them - but about cheap phone calls and more choice of TV programmes.BT is starting its push into television with plans to offer TV over broadband.Delivering programmes over broadband offers clear public value, says the BBC, because it gives people more control, and more choice.It is all part of the larger changing TV technology landscape and, like personal digital video recorders (PVRs), gives people much more control over TV.It helps, said Mr Burke, that people are more au fait with terms like \"digital\", \"interactive\", now that digital TV reaches more than 56% of UK homes.But IPTV could be used for home-monitoring, \"pet cams\", localised news services, and local authority TV, too says BT.Analysts say that IPTV will account for 10% of the digital TV market in Europe alone by the end of the decade.BT does not see itself as a broadcaster of IPTV services, rather as an \"enabler\", said Mr Burke.They could get IPTV though.Since it uses internet technology, IPTV could mean more choice of programmes, more, more interactivity, tailored programming, and more localised content outside of conventional satellite, digital cable, and terrestrial broadcasts.Both use broadband net connections to carry information, like video and voice, in packets of data instead of conventional means."}