{"raw_text": "Chip maker backs net phone calls\n \n Rich Templeton, the head of giant chip maker Texas Instruments, has given his backing to the growing sector of Voice over Internet Telephony (Voip)\n \n Voip allows PC users, and in some cases those with just a broadband connection, to make telephone calls via the net. Mr Templeton said Voip would be the next major application to drive broadband connections into homes. Internet service provider Wanadoo has announced it is launching its own broadband telephony service in the UK.\n \n Subscribers to Wanadoo's broadband service will be able to use the service to make free evening and weekend calls to any UK landline, and free calls at any time to other Wanadoo users. The service will cost an extra £4 a month and will come with a free Livebox, the broadband hub which Wanadoo plans will be used in future to provide video-on-demand and home security services. The secondary phone line will mean customers can have an extra home phone number and will also provide wireless internet access around the home. Eventually the service will replace existing landline services as Wanadoo goes head to head with BT. \"Voice-over broadband is a key trend across Europe and is set to have a dramatic impact on the telecommunications industry, \" Eric Abensur, Wanadoo's chief executive told the BBC News website. Mr Templeton said he agreed. \"Voice-over-packet is going to be the second killer application after broadband internet access,\" he said. The world's largest maker of chips for mobile phones believes the technology will grow rapidly from the relatively small user base it has currently.\n \n Almost 83 million people have downloaded the software that powers the Skype Voip service, according to the net telephony firm's website. Skype lets people make free calls to other Skype users and also make low-cost calls to ordinary phone numbers. US firm Vonage also offers a Voip service, but one which lets people plug an ordinary phone into a broadband router to make calls. Bill Simmelink, general manager of TI's Voip business, said the technology would only take off when people were making net calls with the ease of making a normal call. \"It's not about the pipe, if you will, or the silicon per se, it's about the application,\" he said.\n \n \"We want to communicate freely, effortlessly and economically wherever we are.\" In a sign that Voip is seeping into the mainstream, giant ISP AOL announced on Tuesday that it had plans to launch a net-based phone service for some of its members within the month. Customers will continue to use their traditional phones, but they will plug them into adapters connected to their broadband source rather than the jack provided by the telephone company. Calls are received and placed just like on the old telephone network. \"We can help mass-market adoption of Voip,\" said AOL chief executive Jonathan Miller. \"We can utilise our national footprint. We can help the entire industry become well known.\"\n", "llama3.2:1b": "Texas Instruments' Rich Templeton has backed the growth of Voice over Internet Telephony (Voip) as a major application to drive broadband connections into homes, with internet service providers Wanadoo and AOL announcing plans to launch their own Voip services in the UK. Voip allows users to make telephone calls via the net, free evening and weekend calls to any UK landline, and free calls at any time to other WANadoo users. The technology will cost £4 a month and come with a free Livebox broadband hub for future video-on-demand and home security services.", "llama3.2:3b": "Rich Templeton, Texas Instruments head, backs Voice over Internet Telephony (Voip), calling it a key trend and a major application driving broadband connections into homes. Wanadoo is launching its broadband telephony service in the UK, offering free calls to other users, with some subscribers paying an extra £4 a month for secondary home phone numbers and wireless internet access.", "gemma2:2b": "Texas Instruments' CEO supports Voice over Internet Telephony (VoIP) as a significant next step for broadband adoption.  Wanadoo, a major internet service provider, offers its own VoIP service with free evening and weekend calls to landlines and other Wanadoo users. This offering is expected to replace traditional landline services eventually. The technology's growth is projected based on the increasing user base and widespread adoption of the Skype service.  AOL will also launch a net-based phone service, potentially facilitating wider adoption of VoIP as well. \n", "qwen2.5:0.5b": "Chipmaker backs Voice over Internet Telephony (VoIP) to drive broadband usage into homes. AOL plans to launch a net-based phone service for some of its members in the next month, allowing users to use their traditional phones and plug them into adapters connected to their broadband sources. VoIP is seen as a key trend across Europe and will have a significant impact on the telecommunications industry.", "qwen2.5:1.5b": "Texas Instruments backs growing sector of Voice over Internet Telephony (VoIP), predicting it will drive broadband into homes and replace traditional phone lines with a secondary home number offering internet access. AOL launches net-based phone service, while Wanadoo plans to offer free VoIP calls via broadband connection in the UK. VoIP is considered crucial for telecommunications industry's future and driven by rapid user growth among 83 million Skype users.", "qwen2.5:3b": "Chip maker Texas Instruments backs growing Voice over Internet Telephony (VoIP). Headed by Rich Templeton, VoIP is seen as next major application for broadband. Wanadoo launches UK service allowing free calls within network and to some landlines at additional cost. Telecoms giant BT faces competition from WANADDoo's services. Downloading software powering Skype allows free calls; Vonage offers cheaper international calls through traditional phones. AOL plans new VoIP service with members continuing to use traditional phones via adapters. Telecom executives view ease of use crucial for widespread adoption.", "opencoder:1.5b": "The text provided summarizes the following key points:\n\n1) Chip maker backs net phone calls.\n2) Rich Templeton, the head of giant chip maker Texas Instruments, has given his backing to the growing sector of Voice over Internet Telephony (Voip).\n3) Voip allows PC users to make telephone calls via the net. Mr Templeton said Voip would be the next major application to drive broadband connections into homes.\n4) Internet service provider Wanadoo has announced it is launching its own broadband telephony service in the UK. The service will cost an extra £4 a month and will come with a free Livebox, the broadband hub which Wanadoo plans will be used in future to provide video-on-demand and home security services.\n5) The world's largest maker of chips for mobile phones believes the technology will grow rapidly from the relatively small user base it has currently. \n6) Almost 83 million people have downloaded the software that powers the Skype Voip service, according to the net telephony firm's website. \n7) US firm Vonage also offers a Voip service, but one which lets people plug an ordinary phone into a broadband router to make calls.\n8) Bill Simmelink, general manager of TI's Voip business, said the technology would only take off when people were making net calls with the ease of making a normal call. \n9) In a sign that Voip is seeping into the mainstream, giant ISP AOL announced on Tuesday that it had plans to launch a net-based phone service for some of its members within the month.\n10) Customers will continue to use their traditional phones, but they will plug them into adapters connected to their broadband source rather than the jack provided by the telephone company. \n11) Calls are received and placed just like on the old telephone network. The technology is expected to be commercially viable and accessible for use in mainstream telecommunications.\n", "smollm:1.7b": "The summary is a concise overview of the text, preserving key ideas and details while omitting unnecessary information. It captures the main points of the text, including the importance of Voip, its applications, and the role of chip makers in driving this trend. The summary also highlights the significance of the UK's broadband infrastructure and the potential for Voip to become a mainstream technology.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text into a concise summary while preserving the key ideas and details. Let me read through it carefully.\n\nThe first part mentions that Texas Instruments, the chip maker, is supporting voice-over internet telephony (Voip) as it grows. They say Voip will be the next major application for broadband, which they believe will drive more homes to use these connections.\n\nWanadoo is introducing their own broadband telephony service in the UK. Subscribers can make free evening and weekend calls using a UK landline, with additional expenses of £4 per month and the inclusion of a Livebox (a broadband hub). This service also offers optional wireless internet and an extra home phone number.\n\nVoonage operates similarly but is based in the US. Their service allows users to plug their traditional phone into a broadband router for low-cost calls.\n\nTexas Instruments' executives, Eric Abensur, mentioned that Voip is a key trend across Europe and will significantly impact the telecom industry. They also called it the second killer application after broadband internet access.\n\nAnother company, AOL, announced plans to launch a net-based phone service in the UK within the next month. Their customers would use their traditional phones but plug them into adapters on a national network, making calls like before without the phone company's jack.\n\nVonage is also working on similar services. The overall message seems to be that Voip is becoming mainstream with wide usage and even replacing landline services.\n\nNow I need to condense this. Start by highlighting Texas Instruments backing Voip as part of their chip investment, mention how Voip will drive broadband adoption. Mention Wanadoo's service in the UK, its features, and how it's competing with existing services. Then introduce AOL, their plans for a similar service in the US.\n\nI should avoid any explanations or formatting. Just plain text summarizing all these points.\n</think>\n\nTexas Instruments has pledged to support voice-over internet telephony (Voip) as part of their investment in broadband adoption, believing it will drive more homes to use these connections. Voip, which allows users to make calls over the internet, is one of the next major applications for broadband services. Wanadoo, an internet service provider in the UK, is introducing its own broadband telephony service. Subscribers can make free evening and weekend calls to UK landlines at £4 extra per month, while also receiving a Livebox (a broadband hub) and using optional wireless internet. Their service includes an extra home phone number and offers home phone support. Vonage operates similarly in the US, providing low-cost calls through its broadband connection.\n\nTI executives noted that Voip is expected to be a key trend across Europe, with significant impact on the telecommunications industry. They also called Voip the second killer application after widespread internet access. AOL plans to launch a net-based phone service in the UK within the next month, allowing their members to use traditional phones connected to national broadband adapters for free calls, similar to previous services. Vonage is working on other net-based telephony solutions.\n\nTexas Instruments and Wanadoo are leading efforts towardVoip's mainstream adoption, while AOL aims to complement their network with a similar service. The overall message is that Voip is becoming increasingly prevalent as consumers adopt internet-based communication tools.", "tinyllama:1.1b": "Chip manufacturer Texas Instruments has given its backing to VoIP, or Voice over Internet Telephony, as a key development in broadband connectivity for PC users and in some cases those with just a broadband connection. The UK-based internet service provider WaNDDO is launching its own broadband telephoning service as well as offering free calls at any time to other members of the service, which it plans to use to provide video-on-demand and home security services. In addition, giant internet service provider AOL has announced a net-based téléphone service for its members within the next month, with the adoption of VoIP facilitated by their national footprint. The industry hopes that as more people adopt VoIP, the technology will grow rapidly and potentially become the second kill-off application after broadband internet access.", "tinydolphin:1.1b": " This text is providing a concise summary of the provided information in an easy-to-understand manner. The main points discussed are:\n1. Texas Instruments (TI) supports Voice over Internet Telephony (VoIP), which allows users to make phone calls via the internet without the need for landline or broadband services.\n2. Wanadoo, an ISP from the UK, has launched a broadband telephone service that will cost an extra £4 per month and use a free VoIP hub to provide video-on-demand and home security services.\n3. The new service will replace existing landline services as Wanadoo goes head-to-head with BT. \n4. VoIP is set to have a dramatic impact on the telecommunications industry and become the second killer application after broadband internet access, with almost 83 million people having downloaded Skype Voip.\n5. The world's largest chip manufacturer, Texas Instruments, supports voice-over broadband technology as it believes the trend will grow rapidly from a relatively small user base.", "phi:2.7b": " Texas Instruments' head, Rich Templeton, has supported Voice over Internet Telephony (Voip) as the next major application to drive broadband connections into homes. Wanadoo plans to launch its own Voip service in the UK for free evening and weekend calls to any UK landline and free calls at any time to other Wanadoo users. The secondary phone line will provide wireless internet access around the home, with an additional home phone number and a free Livebox. Eric Abensur, the CEO of Wanadoo, agreed that Voip is set to have a dramatic impact on the telecommunications industry. Almost 83 million people have downloaded Skype's software for Voip calls, allowing users to make free calls to other Skype users and low-cost calls to ordinary phone numbers. Vonage also offers a Voip service, but one where customers plug an ordinary phone into a broadband router to make calls. Bill Simmelink, general manager of TI'S Voip business, believes the technology will only take off when people find it easy to make net calls with the same ease as making normal calls. AOL plans to launch a Voip service for its members within the month, allowing them to plug their traditional phones into adapters connected to their broadband source.\n", "orca-mini:3b": " Chip maker backs net phone calls as Voip grows rapidly from small user base. Over 83 million people have downloaded the software that powers Skype Voip service, according to the net telephony firm's website. Skype lets people make free calls to other Skype users and also make low-cost calls to ordinary phone numbers. Rich Templeton, head of Texas Instruments, agrees with him and believes Voip will be the next major application to drive broadband connections into homes. AOL, a giant ISP, plans to launch a net-based phone service for some of its members within the month, utilising their national footprint and helping the entire industry become well known.", "hermes3:3b": "Texas Instruments head supports VoIP, predicting it to drive broadband usage; Wanadoo launches UK broadband telephony service with free evening/weekend calls and additional home phone number/wireless internet access.", "stablelm-zephyr:3b": "Rich Templeton, head of Texas Instruments, supports Voice over Internet Telephony (VoIP). VoIP allows PC users and those with broadband connections to make phone calls via the internet. Wanadoo is launching a broadband telephony service in the UK, allowing free calls during evenings and weekends to any landline and £4 extra per month for other Wanadoo users. The service includes a free Livebox and a secondary phone line for wireless internet access. AOL plans to launch a net-based phone service, where customers use traditional phones with adapters connected to their broadband source. VoIP is becoming more mainstream as giants like AOL seek to help mass-market adoption.", "chatgpt-4o-latest": "Texas Instruments CEO Rich Templeton supports the growth of Voice over Internet Protocol (VoIP), calling it the next major broadband application. Wanadoo is launching a UK broadband telephony service, offering free calls to UK landlines during evenings and weekends and free calls to other Wanadoo users. The service costs £4 per month and includes a Livebox hub for future video-on-demand and home security services. VoIP is expected to challenge traditional landlines, with Wanadoo competing directly with BT. Templeton and other industry leaders believe VoIP will significantly impact telecommunications. Skype has 83 million downloads, offering free calls between users and low-cost calls to regular phones, while Vonage provides VoIP through broadband routers. TI's VoIP head Bill Simmelink emphasizes ease of use as key to adoption. AOL plans to introduce a VoIP service, allowing users to connect traditional phones via broadband, aiming to drive mass-market adoption.", "stablelm2:1.6b": "Chip maker Texas Instruments' head, Rich Templeton, supports Voice over Internet Telephony (VoIP), predicting it will drive broadband connections into homes. Internet service provider Wanadoo is launching its VoIP service in the UK, allowing subscribers to make free evening and weekend calls to UK landlines, and free daytime calls to other Wanadoo users. Eric Abensur, WANadoo's CEO, says voice-over-broadband is a key trend driving the telecoms industry. Texas Instruments believes the technology will grow rapidly from its relatively small user base of currently around 1 million people who have downloaded VoIP software powering Skype.", "granite3.1-dense:2b": "Rich Templeton, head of Texas Instruments (TI), supports the rapid growth of Voice over Internet Telephony (VoIP) as a significant driver for broadband connections in homes. VoIP enables PC users and those with broadband to make phone calls via the internet. TI's vice president, Bill Simmelink, emphasizes that the technology will only succeed when users can communicate effortlessly and economically, regardless of location. Notable services include Skype, which boasts 83 million users, and Vonage, offering traditional phone plug-and-play VoIP.\n\nWanadoo, an internet service provider in the UK, has launched its own broadband telephony service for £4 per month, providing free evening and weekend calls to UK landlines and free calls to other Wanadoo users. This service will eventually replace existing landline services as Wanadoo competes with BT.\n\nAOL plans to introduce a net-based phone service for some members soon, allowing them to connect traditional phones to broadband sources for seamless communication. These announcements indicate that VoIP is gaining mainstream acceptance and could revolutionize the telecommunications industry by challenging traditional landline services.", "reference": "US firm Vonage also offers a Voip service, but one which lets people plug an ordinary phone into a broadband router to make calls.Rich Templeton, the head of giant chip maker Texas Instruments, has given his backing to the growing sector of Voice over Internet Telephony (Voip)  Voip allows PC users, and in some cases those with just a broadband connection, to make telephone calls via the net.Subscribers to Wanadoo's broadband service will be able to use the service to make free evening and weekend calls to any UK landline, and free calls at any time to other Wanadoo users.Internet service provider Wanadoo has announced it is launching its own broadband telephony service in the UK.Mr Templeton said Voip would be the next major application to drive broadband connections into homes.\"Voice-over-packet is going to be the second killer application after broadband internet access,\" he said.The service will cost an extra £4 a month and will come with a free Livebox, the broadband hub which Wanadoo plans will be used in future to provide video-on-demand and home security services.Skype lets people make free calls to other Skype users and also make low-cost calls to ordinary phone numbers.Almost 83 million people have downloaded the software that powers the Skype Voip service, according to the net telephony firm's website.\"We can help mass-market adoption of Voip,\" said AOL chief executive Jonathan Miller."}