{"raw_text": "Bad e-mail habits sustains spam\n \n The 'bad behaviour' of e-mail users is helping to sustain the spam industry, a new study has found.\n \n According to a survey conducted by security firm Mirapoint and market research company the Radicati Group, nearly a third of e-mail users have clicked on links in spam messages. One in ten users have bought products advertised in junk mail. Clicking on a link in a spam message can expose people to viruses and alert spammers to live e-mail accounts.\n \n The fact that one in ten e-mail users are buying things advertised in spam continues to make it an attractive business, especially given that sending out huge amounts of spam costs very little, the report concludes. \"This preliminary data is surprising and somewhat shocking to us,\" said Marcel Nienhuis, market analyst at the Radicati Group. \"It explains why e-mail security threats including spam, viruses and phishing scams continue to proliferate,\" he said, accusing users of \"bad e-mail behaviour\". Spammers are increasingly hooking into whatever happens to be flavour of the month, according to security firm Clearswift. It has recently seen a rise in the number of spam messages offering phoney Sony PSP giveaways. And, in perhaps a nod to the popularity of the American drama series Desperate Housewives, it has also seen a dramatic rise in junk mails purporting to give details of women looking for casual sex. But rather than finding a companion, users who click on such mail will find themselves redirected to porn sites, where they run the risk of downloading spyware on to their PC. Clearswift has seen a 180% rise in sex-related spam over the course of the last month. \"Without casting aspersions, those likely to respond to these kind of adverts will be invariably hoping that 'one thing leads to another' but aside from the fact that these mails are bogus, clicking on any link within a spam mail can lead to a whole host of unwanted problems,\" said Alyn Hockey, Clearswift's director of research.\n \n Sexually explicit terms make up 14% of security firm Sophos' top 50 word that spammers most commonly try to disguise in order to beat anti-spam filters. Spammers will deliberately misspell a word or use digits instead of letters in an attempt to by-pass anti-spam software, said Graham Cluley, senior technology consultant for security firm Sophos. \"The list of words most commonly hidden by the spammers from anti-spam software reveals that most spam is about the old favourites: money, drugs and sex,\" said Mr Cluley. But anti-spam filters can only be part of the solution to the menace of junk e-mail. \"People must resist their basic instincts to buy from spam mails. Spammers are criminals, plain and simple. If no-one responded to junk e-mail and didn't buy products sold in this way, then spam would be as extinct as the dinosaurs,\" he said.\n", "llama3.2:1b": "Nearly a third of email users have clicked on links in spam messages, leading to exposure to viruses and alerting spammers to live email accounts. One in ten users are buying products advertised in junk mail. Clicking on such emails can lead to unwanted problems like downloading spyware onto PCs. Sexually explicit terms make up 14% of spam attempts to disguise malware. Anti-spam filters only help, as most spam is about money, drugs, and sex.", "llama3.2:3b": "Nearly a third of email users have clicked on links in spam messages, and one in ten have bought products advertised in junk mail. Clicking on spam links exposes people to viruses and spammers' live e-mail accounts. Spammers use tactics like misspelling words or using digits instead of letters to bypass anti-spam filters, targeting topics like money, drugs, and sex. Security firms warn that resisting the urge to buy from spam emails is key to combating the issue.", "gemma2:2b": "Email users engage in harmful habits such as clicking links in spam emails and buying products advertised in them, contributing to the success of the spam industry. \n\nSpammers are increasingly using deceptive tactics like fake giveaways and exploiting popular themes to target their victims.  Clicking on links within these emails can lead to malware infections or redirect users to inappropriate websites.\n\nAlthough anti-spam software is used to detect and filter spam, user behavior plays a critical role in combating this problem. By avoiding impulse purchases and resisting spam's allure, users can help reduce the prevalence of junk email. \n", "qwen2.5:0.5b": "A new survey by security firm Mirapoint and Radicati Group found that nearly one-third of email users have clicked on links or purchased products advertised in spam messages, exposing them to viruses and alerting spammers to live e-mail accounts. Spammers are also increasingly targeting women looking for casual sex, and a 180% rise in sex-related spam over the last month has led to a 14% increase in sexually explicit terms used in anti-spam filters. Anti-spam software can only be part of the solution to the menace of junk e-mail, as spammers are criminals. Users must resist their basic instincts and respond to spam emails.", "qwen2.5:1.5b": "E-mail users' bad habits help sustain the spam industry by clicking on spam links or buying advertised products, which is encouraging spammers to continue sending spam at a low cost.", "qwen2.5:3b": "Bad email habits sustain the spam industry, with a third of users clicking on spam links and one in ten buying advertised products. This makes it an attractive business despite low costs for spammers. Users’ tendency to buy from spam continues to encourage its prevalence. Clearswift reports a significant rise in sex-related spam. Sophos found sexually explicit terms are commonly used by spammers to bypass filters, ranking as the top 14% of disguised words. Anti-spam filters can only be part of the solution; users must resist buying products advertised through spam emails.", "opencoder:1.5b": "\"Spam is a threat to e-mail users' safety and the industry's trust.\" The study has shown that only 3% of e-mail users click on links in spam messages, suggesting that users are reluctant to purchase things advertised in junk mails.\n\nE-mail security threats including viruses and phishing scams continue to make cybercriminals a top concern. It has seen an unprecedented rise in spam messages posing as Sony PSP giveaways, prompting users to look for companion women seeking casual sex. This report calls on us to reassure users that e-mail behaviours are not solely about buying products advertised in junk mail but also avoiding unwanted scams and phishing attacks.\n", "smollm:1.7b": "Bad email habits sustains spam", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving key ideas and details. Let me read through it carefully.\n\nThe first paragraph talks about how bad email habits help sustain spam. A survey showed nearly a third of users clicked on links in spam messages, with one out of ten buying products in junk mail. Clicking on links can expose people to viruses and alert spammers to live emails.\n\nNext, the report mentions that sending huge amounts of spam isn't expensive because 14% of users click on sex-related terms. This is often used to trick people into buying stuff they wouldn't otherwise buy from spam.\n\nThen, clearswift saw a rise in spam with links like Sony PSP giveaways and erotic messages. Users clicking on these redirected them to porn sites, risking spyware.\n\nSophos' Sophos top keywords were sexually explicit terms, as spammers tried to hide by misspelling or using digits. They used money, drugs, and sex as common terms. Anti-spam filters can't stop all spam.\n\nThe last point is that people need to resist spam purchases, as it's often a scam and if no one responds, spam dies out quickly.\n\nI should combine these points into a concise summary without explanations or formatting.\n</think>\n\nBad email habits sustain spam, a study found. Nearly a third of users click on spam links, with one in ten buying products in junk mail. This behavior exposes people to viruses and alerts spammers to their accounts. A report showed 14% of users clicked sex-related terms, often used to deceive. Clearswift saw increased sexual spam, redirecting users to porn sites. Sophos highlighted hidden words, using money, drugs, and sex. Anti-spam filters fail; people must resist buying from spam, as it's a scam that could disappear quickly.", "tinyllama:1.1b": "The \"bad habit\" of using e-mail to send unsolicited links and promotional materials is encouraging the growth of spam, according to a recent study by security firm Mirapoint and market research company Radicaci Group. The group has found that nearly one in ten users click on links included in spam messages, exposing themselves to virus attacks and potentially exposing e-mail accounts to hackers. This troubling trend continues to make anti-spam software an attractive business for spammers, especially given the low cost of sending large volumes of junk mail. Despite efforts by security firms and anti-spam filters, junks e-mails are still being sent regularly, contributing to a rising number of phishing scams and sexually explicit words commonly used in attempts to disguise links. In a nod to the popularity of drama series \"Desperate Housewives,\" spammers are increasingly linking to women looking for casual sex, which could lead users to unwanted porn sites. While spam is a growing concern, people must resist their instincts to buy from spam messages and instead resist the urge to click on links in junks e-mails.", "tinydolphin:1.1b": " Summarize the text by eliminating non-essential details and focus on key ideas: \n\nThe study conducted by security firm Mirapoint and market research company Radicati has found that nearly a third of e-mail users click on links in spam messages, leading to increased exposure to viruses and alerting spammers to live email accounts.\n\nThis preliminary data indicates that bad email habits sustain the spam industry, as one in ten users have purchased products advertised in junk mail and are buying things they've been sent via live email accounts.", "phi:2.7b": " The study by Mirapoint and Radicati Group shows that users who click on links in spam messages or buy products advertised in junk mail are helping to sustain the spam industry. Spammers use cheap methods like sending out large amounts of spam, which makes it an attractive business. This behavior is causing security threats like viruses and phishing scams to spread. Clearswift has seen a rise in sex-related spam and urges users not to click on any links in junk mail as it can lead to unwanted problems such as downloading spyware.\n", "orca-mini:3b": " E-mail users are helping sustain the spam industry by engaging in \"bad email behavior\", such as clicking on links in spam messages or buying products advertised in junk mail. Spammers use commonly misspelled words and digits to disguise their content, and people should resist responding to or buying from spam mails to effectively combat the menace.", "hermes3:3b": "E-mail users' bad habits (1/3 clicking on spam links, 10% buying advertised products) help sustain spam industry, study finds.", "stablelm-zephyr:3b": "A new study conducted by security firm Mirapoint and market research company Radicati Group reveals that bad email habits are contributing to the sustainability of the spam industry. Nearly a third of email users have clicked on links in spam messages, exposing them to viruses and alerting spammers to real email accounts. One in ten users have also bought products advertised in junk mail. Spammers are now exploiting various trends, such as phoney Sony PSP giveaways and Desperate Housewives-inspired casual sex offers, redirecting users to porn sites and risking spyware downloads on their computers. According to Sophos, 14% of the top 50 words spammers most commonly try to disguise in order to bypass anti-spam filters are related to money, drugs, and sex. Anti-spam filters only provide part of the solution; email users must resist buying products advertised in spam emails.", "chatgpt-4o-latest": "A study by security firm Mirapoint and the Radicati Group found that poor e-mail habits sustain the spam industry, with nearly a third of users clicking on spam links and one in ten purchasing advertised products. Clicking on spam links exposes users to viruses and alerts spammers to active accounts, making spam a profitable business due to its low costs. Security firm Clearswift reports a rise in spam exploiting popular trends, such as fake Sony PSP giveaways and sex-related content, which often lead users to porn sites and spyware risks. Spammers use disguised words to bypass filters, with money, drugs, and sex being common themes. Experts emphasize that anti-spam filters alone are insufficient and urge users to stop engaging with spam, as doing so would eliminate its profitability.", "stablelm2:1.6b": "A new study reveals that bad email habits sustain the spam industry. Nearly a third of users click on links in spam messages, and one in ten purchase items advertised in junk mail. Spammers capitalize on current trends to attract customers, posing risks for those who click on such links. Sex-related terms are common disguises used by spammers to bypass anti-spam software. Anti-spam filters can only help combat the issue, so users must resist buying from spam emails.", "granite3.1-dense:2b": "A study by Mirapoint and Radicati Group reveals that 30% of email users click on links in spam messages, while 10% purchase items advertised in junk mail, unknowingly aiding the spam industry. This behaviour, described as \"bad e-mail habits,\" persists despite the minimal cost for spammers to send large volumes of messages. Security firm Clearswift has observed a surge in sex-related spam and phony Sony PSP giveaway spam. These ads often redirect users to malicious websites, risking malware installation on their devices. Sexually explicit terms are 14% of Sophos' top 50 misused words by spammers to evade anti-spam filters, which primarily focus on money, drugs, and sex. Graham Cluley from Sophos warns that resisting the urge to buy from spam is crucial to combating this issue, as spam would vanish if people ceased responding.", "reference": "\"It explains why e-mail security threats including spam, viruses and phishing scams continue to proliferate,\" he said, accusing users of \"bad e-mail behaviour\".According to a survey conducted by security firm Mirapoint and market research company the Radicati Group, nearly a third of e-mail users have clicked on links in spam messages.The fact that one in ten e-mail users are buying things advertised in spam continues to make it an attractive business, especially given that sending out huge amounts of spam costs very little, the report concludes.The 'bad behaviour' of e-mail users is helping to sustain the spam industry, a new study has found.If no-one responded to junk e-mail and didn't buy products sold in this way, then spam would be as extinct as the dinosaurs,\" he said.Clicking on a link in a spam message can expose people to viruses and alert spammers to live e-mail accounts.Clearswift has seen a 180% rise in sex-related spam over the course of the last month.\"The list of words most commonly hidden by the spammers from anti-spam software reveals that most spam is about the old favourites: money, drugs and sex,\" said Mr Cluley."}