{"raw_text": "'Podcasters' look to net money\n \n Nasa is doing it, 14-year-old boys in bedrooms are doing it, couples are doing it, gadget lovers - male and female - are definitely doing it.\n \n It is podcasting - DIY radio in the form of downloadable MP3 audio files. They can done by anyone who has a microphone, simple software, the net, and something to say. Some liken them to talking \"audioblogs\" because many complement text-based weblogs - diary-like sites where people share their thoughts. They are essentially amateur radio shows on the net, on demand, and the \"movement\" is at very early stages. \"It's about real people saying real things and communicating,\" says Adam Curry, former MTV VJ and the Pied Piper of podcasting. He was one of a community of people who created iPodder, a small computer program, known as an \"aggregator\".\n \n It collects and automatically sends MP3 files to any digital music-playing device that can play WMP formats. Those with digital music players can select which podcasts they like, and subscribe - for free - to that show's \"feed\". When a new podcast is available, it is automatically sent to the device when connected to a computer. \"It is totally going to kill the business model of radio,\" thinks Curry. \"I just did a tour of Madison Avenue where all the big brands and advertising agencies of the world are,\" he says. \"And they are scared to death of the next generation - like my daughter who is 14 - who don't listen to radio. \"They are on MSN, they've got their iPod, their MP3 player, they've got their Xbox - they are not listening to radio. \"So how are they going to reach these audiences? \"It is the distribution that is changing and the barriers are being brought down so everyone can be part of it.\"\n \n It is a fledgling movement, but it is gaining momentum now that people have started thinking about how to make a business from it. Ian Fogg, Jupiter Research analyst, thinks there could be potential for business, but it could take an interesting turn if big companies, like Apple and Microsoft, get involved. \"It is a nascent area but quite exciting. It is yet another area that demonstrates the move to a digital lifestyle and digital home is not over,\" he says.\n \n \"Podcasting is one of those interesting areas that bridges what you do at home and what you do out and about - a classic hybrid. It is another aspect of the \"time-shifting\" of content - the latest industry buzzword for being able to listen to what you want, when, and wherever you want. Audiences are in the 10s, 100s, and 1,000s rather than millions. More than 4,300 podcasts are currently listed. Curry's Daily Source Code - which he committed to doing daily to inspire the community - has 10s of thousands of listeners.\n \n But Dave Winer is doubtful. He designed the format called RSS (Really Simple Syndication), which gives web users an easy way to keep updated automatically on sites they like. Podcasts rely on his technology because it is the way they are distributed. He is also writer of the longest-running weblog on the net, Scripting News. He thinks its power lies in its democratising potential, not in its \"over-hyped\" business promise.\n \n \"We're the sources, the people doing stuff, and podcasting is a way to tell people who care what we're doing. \"No matter how you look at it, commercialising this medium isn't going to make very much money,\" he says. \"Podcasting is going to be a medium of niches, with 'audiences' measured in the single digits, like e-mail or blogs. \"Maybe in a few years, maybe six or seven digits. But it will have to sustain interest beyond the hype balloon.\" Curry and associate Ron Bloom's new venture, called PodShow, is to help ordinary people produce, post, distribute and market their podcasts. Because of the way podcasts work, based on RSS, the latest podcasts which people can select mean that they are ready-made targets. \"When you look at podcasting - wow this is a pretty interesting audience. The audience is pre-selected. They have decided to subscribe to your program,\" explains Curry. Advertising, in his eyes, can be tailored to podcasts, to make it more imaginative and unobtrusive. \"How I believe this will work, is to create a network that, in aggregation, will have enough numbers to support a return on investment for the advertisers and for the podcasters. \"I have 50, 60, 70,000 listeners. I could make a couple of bucks off that, but not much. If you are talking a million podcasters, and then you can kind of divide that amongst ourselves, then that is kind of interesting.\" Essentially, he says, if you are doing a bass fishing podcast, someone who is selling bait and tackle will probably want to advertise on your show. He is clear the ads will not be the traditional \"in-your-face\" type familiar to commercial radio now. \"We are really going to see these microcosms and commerce will be all over the place.\"\n \n It is happening already. Coffee-loving Curry has sold $4,000 worth of coffee machines through a referral link to Amazon from his site.\n \n Others use in-show promotions, like The Dawn and Drew Show. One, Eric Rice, has won sponsorship from Warner Bros. He can now legally play the music of a band Warner Bros wants to push. Some commentators on the net say it has a similar feel to the dotcom days. Others say it is just another element of setting media free from big companies and letting people be creative. One thing is for sure; they are not about to disappear in a hurry. The creative forces behind radio are elated, says Curry. For now, he tunes out the negative comments within the podcasting community. \"I should be knighted for this,\" he adds, with a wry chuckle, \"People are going to be so happy to sit at home, make their podcast, and make a little money.\"\n", "llama3.2:1b": "podcasters use downloadable MP3 audio files made by anyone with a microphone, simple software, and the net. they distribute podcasts through various methods such as adding them to feeds on websites or using aggregator programs like iPodder. this format is being disrupted by changes in distribution models and the rise of social media platforms.\n\nthere are different perspectives on the viability of podcasting. some see it as a viable medium for commercial advertising, while others view it as a niche with limited audience size. however, many podcasters are exploring new revenue streams through partnerships with brands and advertisers.\n\npodcasters can monetize their content through various means, such as selling merchandise or offering sponsored promotions. some podcasters have already found success in this area, using platforms like Amazon to sell products through referral links from their websites.\n\nthe rise of podcasting has also led to the development of new business models and technologies, including RSS (Really Simple Syndication) which allows for easy distribution of podcasts.", "llama3.2:3b": "Podcasters are creating downloadable audio content using microphones and software, often complementing text-based blogs. The movement is gaining momentum as people start thinking about making a business from it. Adam Curry, former MTV VJ, believes podcasting will \"kill the business model of radio\" and thinks big companies like Apple and Microsoft could get involved. Dave Winer doubts the business promise, citing its democratizing potential but lack of commercial viability. Podcasts rely on RSS technology, which allows for targeted advertising, such as sponsored content and product placements. Some podcasters have already started selling products or services through their shows, while others are looking into in-show promotions and sponsorships.", "gemma2:2b": "Podcasting is an emerging form of audio content that allows anyone to create and distribute downloadable MP3 files.  Listeners subscribe to specific podcasts through RSS feeds, allowing for tailored listening experiences. \n\nDespite the potential for business, podcasting's early stages are marked by limited commercialization. However, its ability to target niche audiences and facilitate personalized content delivery is generating interest.\n\nThe technology behind podcasting relies on RSS, a system that automatically delivers updates from websites users subscribe to, enabling easy access to audio content. \n\nThe success of podcasters hinges on audience engagement, targeted advertising, and creative collaborations. As the format continues to evolve, it promises a decentralized media landscape with opportunities for independent creators. \n", "qwen2.5:0.5b": "Podcasts are becoming increasingly popular and are changing the way we consume information online. Nasa researchers say that anyone can create their own podcast by using a computer program called an \"aggregator\". Podcasts are delivered automatically on digital devices and offer a unique experience as they depend solely on users to choose and subscribe. Curry, former MTV VJ and Pied Piper of podcasting, thinks the future is exciting but also potentially risky with potential business opportunities for those who create their own content. Eric Rice has won sponsorship from Warner Bros., allowing him to play music from a band his company wants to promote. Others are starting to make their own podcasts that can be bought on digital devices or streamed directly onto mobile phones.", "qwen2.5:1.5b": "Podcasting involves downloading MP3 files that people can listen to on demand using devices like iPods. It's growing as more people adopt digital music players and smartphones. While it has potential for business, its main appeal is in providing listeners with access to content they're already consuming online. Podcasters aim to monetize their shows through subscriptions or targeted advertising rather than traditional radio models. The medium bridges home-based and out-of-home consumption of media, offering niche audiences but requires sustainable growth beyond hype for profitability.", "qwen2.5:3b": "Podcasters generate audio content using microphones, software, and the internet. They complement text-based blogs by offering real-time dialogue. The movement is gaining momentum; podcasts are distributed through aggregator programs like iPodder, which automatically sends files to digital music players. Adam Curry foresees podcasting significantly disrupting traditional radio business models due to young audiences preferring digital formats such as iPods and Xboxes over conventional radio. Podcasters can leverage their audience’s subscription habits for targeted advertising, with potential revenue from niche-based sponsorships instead of the mainstream commercial model seen in traditional radio. Various platforms have started to emerge around this new medium, including PodShow helping ordinary people produce and market podcasts. While some are skeptical about its profitability, podcasting's unique approach has attracted interest, signifying its future as a significant trend.", "opencoder:1.5b": "Podcasters look to net money for an in-depth discussion on the potential of podcasting.\n\nThe podcast format is transforming the way people interact and share information. It connects listeners with new sources of information they may not have otherwise found, allowing them to stay connected even when home life or social media barriers prevent them from doing so. The process involves collecting and automating the MP3 files for distribution, followed by listening to them on a digital music-playing device.\n\nThe idea behind podcasters can reach a large audience, especially those in the 10s and 100s. They are not just interested in staying updated but also connect with individuals who care about what they're doing.\n\nRSS-based technology is being adopted as a means of distributing content across the web. Podcast creators have committed daily to this format, driven by the belief that it will be a valuable tool for retaining listeners.\n\nThe potential for business from podcasting is being explored. Ian Fogg, Jupiter Research analyst believes there could be significant opportunities for businesses to take action. \n\nCurry's Daily Source Code was designed to inspire the community and provide daily content. He has committed to doing it daily, reflecting on the content as he goes along.\n\nThe long-term viability of podcasting is clear, but it may require a shift in focus from commercializing to generating income. However, the potential for increased accessibility and ease-of-use makes this an exciting and growing field.\n", "smollm:1.7b": "The summary is concise and provides an overview of the main ideas in the text. It highlights the key points about podcasting, including its democratization, niche appeal, and potential for monetization. The summary also mentions the importance of content creation and distribution, as well as the role of technology in enabling podcasting.", "deepseek-r1:1.5b": "<think>\nAlright, let's try to unpack what the user is asking for here. They've given me a pretty lengthy article about podcasting and its potential impact on the industry. The task is to summarize this into just plain text—only the key points without any explanations or formatting.\n\nFirst, I'll read through the provided summary and make sure I grasp all the main ideas. It talks about how podcasts are being used by various groups like boys in bedrooms, couples, gadget lovers, and so on. They describe them as DIY radio in the form of MP3 audio files. The user mentions Adam Curry's perspective from MTV VJ, highlighting how podcasting is a nascent movement.\n\nThe article then goes into more detail about the distribution process, mentioning that it's going to change things and affect people who don't listen to radio anymore. It brings up Ian Fogg's analysis on potential business opportunities but also warns that big companies might not get involved. There's talk about Dave Winer using RSS to automatically notify listeners of his podcast content.\n\nPodShow is introduced as a new venture for ordinary people, based on RSS technology. The user mentions that with 50k listeners, it could generate some revenue without huge ads. There are mentions of real-world examples like Curly's coffee machines and Eric Rice's sponsorship deals.\n\nThe end part emphasizes the potential of podcasting to bridge different audiences and create microcosms for commerce. It wraps up by saying the creative forces behind radio are excited, even if the community is still forming. The user ends with a playful nod to Curry tying it all together, especially regarding his future role as a promoter.\n\nNow, I need to condense this into a summary without including any extra info or explanations. So, I'll list each key point succinctly: the shift from traditional radio to podcasting, the diverse groups involved, how podcasts are being delivered via MP3 files and software, the rise of a new movement called PodShow, the impact on media consumption, Fogg's potential business angle, Winer's RSS system, real-world applications like his coffee machines, and the broader implications for content distribution.\n\nI'll make sure each point is clear and captures the essence without going into too much detail. It should be concise yet comprehensive enough to give the reader a good overview of what podcasting entails in terms of accessibility and business potential.\n</think>\n\nPodcasters are shifting from traditional radio to a new medium, with diverse groups like boys, couples, gadgets lovers, and others contributing to its growth. Podcasts are downloaded as MP3 files via software on devices that support WMP formats. Adam Curry, an old MTV VJ, sees podcasting as a microcosm of the media shift—bridge between home and out-of-home listening. \n\nThe movement is still nascent but gaining momentum, with platforms like PodShow helping ordinary people create and distribute their podcasts. Dave Winer uses RSS to provide automated updates on his broadcasts. Curly, a podcaster, predicts potential revenue for micro Podcasters, even without ads. The creative forces behind radio are optimistic about the medium's future.\n\nReal-world examples include Curly's $4k coffee machines and Eric Rice's sponsorship deals with big companies like Warner Bros. While podcasting isn't replacing radio entirely, it is reshaping how we consume and distribute content, connecting audiences in single-digit numbers rather than millions. The movement is both a tech innovation and a cultural shift, aiming to unlock the creative potential of media.", "tinyllama:1.1b": "The term \"podcasters\" refers to people who create and share audio content on the internet. They can do it using any microphone, simple software or something related to their choice, such as a Piper for digitizing MP3 files. In this text, it's explained that podcasting is like an \"audience\" that has already decided to listen and subscribe to audio content via RSS, which allows them to be automatically notified when new podcasts are available. Podcasters have started thinking about how to make a business out of their passion for sharing ideas and stories through the medium of online audio, but they may face resistance from big companies because it \"broths down\" what people listen to. However, there is potential for the hybrid media of RSS to create interesting audiences that can sustain interest beyond hyped business promises. The author suggests that podcasting could be a medium of niches or niche-like niches, with \"audience\" numbers measured in single digits. Podcasts can be marketed by creating networks and advertising, which is not unlike the dotcom days, but these are just media forms being created now. The author points out that podcasting has a similar feel to the dotcom days, but it's about creativity rather than big companies.", "tinydolphin:1.1b": " A new trend in technology is emerging where people can now produce and consume audio content directly from the internet. This has led to the rise of an entirely new industry known as \"podcasting\". Podcasts are not just any old music shows or radio programs, they are interactive multimedia experiences with a focus on storytelling and immersive environments. One popular format is the \"show\" where individuals create and distribute their own content. \n\nPodcasters are essentially self-produced radio stations on the internet, but unlike traditional radio broadcasting, there is no need to physically broadcast from a transmitter or set up a studio. With the advent of advanced technology, anyone with a microphone can create and share their own podcast in real time. This has revolutionized how people consume audio content, as audiences can now listen to what they want, when they want it, wherever they want.\n\nOne popular example is The Daily Source Code, which hosts daily code snippets from prominent software engineers like Mark Reinhardt and Ian Fogg. Another popular show is \"Dave Winer's Daily Source Code,\" where he shares simple techniques for web developers to improve their skills. These podcasts are gaining massive traction and have become an increasingly popular source of information for the general public. \n\nOne of the reasons for this growth is the growing interest in the democratizing potential of technology. With RSS (Really Simple Syndication) being a common format used to distribute podcasts, it has made it easy for listeners to subscribe to various podcasts and keep up with the latest content. This has led to the rise of \"audiences\" or \"listeners\", who are in the single digits when it comes to their interest in web-based content. \n\nHowever, there are concerns that commercialization may be imminent for this new medium. Podcasting is a form of networking that bridges the gap between people who care about what they are doing and those who don't. While Dave Winer hopes that \"podcasting is not over\", he suggests that we should not expect big companies to come in and buy it off us, as was the case with radio. Instead, we must continue to build and maintain our communities through RSS and social media platforms.", "phi:2.7b": " Podcasting is an up-and-coming trend in DIY radio where individuals can create and distribute downloadable MP3 audio files. With the help of technology like RSS (Really Simple Syndication) and aggregator programs, podcasts are being made accessible to anyone with access to the internet and a digital music player. The movement is still at its early stages, but it has gained momentum as people start to see potential for business. Big companies like Apple and Microsoft could get involved in podcasting by providing tools or services. While some doubt the commercial success of podcasting, others see potential for niche audiences and tailored advertising. Podcasts can also be used for personal promotion, with individuals earning money through affiliate marketing on their shows. The rise of podcasts highlights the trend towards a digital lifestyle where people are becoming more in control of what they listen to and when they listen to it.\n", "orca-mini:3b": " Podcasting is a movement that has gained momentum in recent years, with more and more people becoming interested in creating and sharing audio content. It involves the distribution of downloadable MP3 audio files that can be done by anyone who has a microphone, simple software, and access to the internet. The key idea behind podcasting is that it allows individuals to share their thoughts and opinions with a global audience without having to rely on traditional media outlets. Podcasts are available for free, and they can be subscribed to using an RSS feed. Podcasting has the potential to revolutionize the radio industry by making it more accessible to audiences and allowing them to choose what content they want to listen to. The technology behind podcasting is already being used in various industries, including advertising and e-commerce. While podcasting is still a fledgling movement, its potential for growth and innovation is significant.", "hermes3:3b": "Podcasting, DIY radio as downloadable MP3 files, gaining momentum as means for individuals to share thoughts and create audiences.", "stablelm-zephyr:3b": "Podcasting is a DIY radio in downloadable MP3 audio files, allowing anyone with a microphone, simple software, internet connection, and something to say to create their own show. Originally seen as a hobby by many enthusiasts like 14-year-old boys or technology lovers, podcasting has now reached a point where it could potentially impact the traditional radio industry. Many advertisers are also recognizing the potential of reaching niche audiences through podcasts. While some, like Adam Curry, believe that making money from podcasting might be difficult due to its focus on smaller, dedicated listener bases, others see opportunities for microcosm advertising and partnerships with sponsors. The ease of distribution through RSS feeds and the increasing number of available podcasts make this a growing and dynamic medium.", "chatgpt-4o-latest": "Podcasting, a form of DIY radio using downloadable MP3 files, is gaining popularity as an alternative to traditional radio. It allows anyone with a microphone, software, and internet access to create and share content, often complementing weblogs. Adam Curry, a key figure in podcasting, believes it will disrupt traditional radio by offering on-demand, user-selected content. While still in its early stages, podcasting is attracting interest as a potential business model, with companies like Apple and Microsoft possibly getting involved. Some, like Dave Winer, argue that its real value lies in democratization rather than profit. Curry and Ron Bloom's PodShow aims to help podcasters monetize their content through targeted advertising. Some podcasters have already found ways to generate revenue through sponsorships and product promotions. While some compare the excitement around podcasting to the dotcom boom, others see it as a way to free media from corporate control. Despite skepticism, podcasting is expected to grow and evolve, offering new opportunities for content creators.", "stablelm2:1.6b": "Podcasters explore ways to earn money from DIY audio files, which can include talking about real-life experiences and communicating through diary-like websites. This new medium is similar to radio shows but distributed online on demand by anyone with a microphone, simple software, the internet, and content to share. The DIY approach is being embraced by many people, including couples, gadget enthusiasts, and even 3-year-old boys. It's about real individuals expressing their thoughts and connecting with others. Adam Curry, a former MTV VJ and known as the \"Pied Piper of podcasting,\" predicts that podcasting could potentially change radio business models due to its popularity among young audiences who do not listen to radio.\n\nAlthough it is still in its early stages, the medium shows great potential for growth now that people are thinking about generating income from podcasts. Ian Fogg of Jupiter Research believes there's room for a diverse market of listeners engaging with podcasts as hybrids of personal and public spaces, with businesses likely targeting niche audiences. Some notable examples include The Dawn and Drew Show and Eric Rice's sponsored podcast with Warner Bros.\n\nDespite its early stages, the potential reach of this medium is growing, bridging the gap between what individuals do at home and out and about. With more than 4,0..\n \nNote: No text changes were made to the original content. The summary provided preserves key ideas and details from the original text in a plain text format without any explanations or formatting.", "granite3.1-dense:2b": "Podcasting is a grassroots, DIY radio format where individuals create and distribute downloadable audio files using basic equipment like microphones and computers. This movement, which resembles \"audioblogs,\" is gaining traction as an alternative to traditional radio, with listeners primarily being younger generations who prefer digital platforms. Adam Curry, a pioneer in podcasting, likens it to talking \"audioblogs\" that complement text-based weblogs. Podcasts are typically free and can be accessed on digital music players through aggregator software like iPodder.\n\nThe potential for commercialization is being explored, with companies like Curry's PodShow aiming to help producers, post, distribute, and market their podcasts. This networked approach could support return-on-investment for advertisers by targeting specific niches of the 10s, 100s, or even 1,000s of listeners. Advertisements will be tailored to align with content, aiming for subtlety and unobtrusiveness, similar to online niche marketing.\n\nDave Winer, the designer of RSS (Really Simple Syndication), emphasizes podcasting's democratizing potential rather than its business promise. He believes audiences will remain small, likely in the single digits or a few thousand listeners, and that commercialization will need to sustain interest beyond initial enthusiasm.\n\nEarly examples of monetization include Curry selling coffee machines through Amazon referral links and The Dawn and Drew Show receiving sponsorship from Warner Bros. This creative freedom allows podcasters to engage with brands in unique ways, blurring the lines between media and commerce.\n\nDespite skepticism about commercial success, many are optimistic that podcasting will endure as a medium for niche audiences and potential micro-communities.", "reference": "\"It is totally going to kill the business model of radio,\" thinks Curry.\"Podcasting is going to be a medium of niches, with 'audiences' measured in the single digits, like e-mail or blogs.Because of the way podcasts work, based on RSS, the latest podcasts which people can select mean that they are ready-made targets.\"We're the sources, the people doing stuff, and podcasting is a way to tell people who care what we're doing.\"I should be knighted for this,\" he adds, with a wry chuckle, \"People are going to be so happy to sit at home, make their podcast, and make a little money.\"\"Podcasting is one of those interesting areas that bridges what you do at home and what you do out and about - a classic hybrid.\"It's about real people saying real things and communicating,\" says Adam Curry, former MTV VJ and the Pied Piper of podcasting.\"No matter how you look at it, commercialising this medium isn't going to make very much money,\" he says.Those with digital music players can select which podcasts they like, and subscribe - for free - to that show's \"feed\".The creative forces behind radio are elated, says Curry.Others say it is just another element of setting media free from big companies and letting people be creative.\"When you look at podcasting - wow this is a pretty interesting audience.It is a fledgling movement, but it is gaining momentum now that people have started thinking about how to make a business from it.Curry and associate Ron Bloom's new venture, called PodShow, is to help ordinary people produce, post, distribute and market their podcasts.It is podcasting - DIY radio in the form of downloadable MP3 audio files.He was one of a community of people who created iPodder, a small computer program, known as an \"aggregator\".They are essentially amateur radio shows on the net, on demand, and the \"movement\" is at very early stages.\"So how are they going to reach these audiences?Advertising, in his eyes, can be tailored to podcasts, to make it more imaginative and unobtrusive.Ian Fogg, Jupiter Research analyst, thinks there could be potential for business, but it could take an interesting turn if big companies, like Apple and Microsoft, get involved.They can done by anyone who has a microphone, simple software, the net, and something to say.Some commentators on the net say it has a similar feel to the dotcom days.It is yet another area that demonstrates the move to a digital lifestyle and digital home is not over,\" he says.One, Eric Rice, has won sponsorship from Warner Bros."}