{"raw_text": "Cabs collect mountain of mobiles\n \n Gadgets are cheaper, smaller and more common than ever. But that just means we are more likely to lose them.\n \n In London alone over the past six months more than 63,000 mobile phones have been left in the back of black cabs, according to a survey. That works out at about three phones per cab. Over the same period almost 5,000 laptops and 5,800 PDAs such as Palms and Pocket PCs were left in licensed cabs. Even the great and good are not immune to losing their beloved gadgets. Jemima Khan reportedly left her iPod, phone and purse in a cab and asked for them to be returned to her friend who turned out to be Hugh Grant. As the popularity of portable gadgets has grown, and we trust more of our lives to them, we seem to be forgetting them in ever larger numbers. The numbers of lost laptops has leapt by 71% in the last three years.\n \n This has left Londoners, or those travelling by cab in the capital, as the world's best at losing laptops, according to the research by the Licensed Taxi Drivers Association and Pointsec, a mobile-data backup firm. More than twice as many laptops were left in the back of black cabs in London as in any of the nine other cities (Helsinki, Oslo, Munich, Paris, Stockholm, Copenhagen, Chicago and Sydney) where the research into lost and found gadgets was carried out. By contrast Danes were most adept at losing mobile phones being seven times more likely to leave it behind in a cab than travellers in Germans, Norwegians and Swedes. Top of the range phones can carry enormous amounts of data - enough to hold hundreds of pictures or thousands of contact details. Given that few people back up the data on their PC it is a fair bet that even fewer do so with the phone they carry around. You could be losing a fair chunk of your life in the back of that cab not least because many people collect numbers on their phone that they do not have anywhere else.\n \n Equally, phones let you navigate through contacts by name so many people have completely forgotten their friends' numbers and could not reconstruct them if they had to. This growing habit of losing gadgets explains the rise of firms such as Retrofone which lets people buy a cheap old-fashioned phone to replace the tiny, shiny expensive one they have just lost. Briton's growing love of phones has also led to the creation of the Mobile Equipment National Database that lets you register the unique ID number of your phone so it can be returned to you in the event of it being lost or stolen. According to statistics 50% of all muggings and snatch theft offences involve mobiles. Millions of gadgets are now logged in the database and organisations such as Transport For London regularly consult it when trying to re-unite folk with their phones and other gadgets. For the drivers, finding a mobile in the back of their cab is one of the more pleasant things many have found. The survey of what else has been left behind included a harp, a dog, a hamster and a baby.\n", "llama3.2:1b": "London cabs are losing large numbers of mobile phones and other items. \n\nOver 63,000 mobile phones were lost in London's black cabs over the past six months. More than 5,800 laptops were also left behind. This trend is similar to other cities where the research found that cabbies have a higher rate of losing these items compared to the general population.\n\nDanes are most likely to lose their top-of-the-range phones, which can carry hundreds of pictures or thousands of contact details. This habit explains why companies like Retrofone sell old-fashioned phones as replacements for lost smartphones.\n\nA Mobile Equipment National Database has been created in London to register phone numbers and track lost or stolen devices. Millions of gadgets are now logged into the database.", "llama3.2:3b": "63,000+ mobile phones, 5,000+ laptops, and other gadgets lost in London cabs over six months, with Londoners losing the most laptops (71% increase) and Danes leaving their phones behind seven times more often than others.", "gemma2:2b": "Over 63,000 mobile phones were left in London black cabs in six months, with laptops and PDAs also being common finds.  Lost gadgets are more prevalent now due to the increasing popularity of portable devices and their reliance on users.  Londoners have the highest rate of lost laptops in the world, while Danes have the highest rate of lost mobile phones. This trend often leads people to forget important contacts and data stored on their smartphones.  Solutions like Retrofone provide backup options for losing smartphones, and national databases aid in retrieving lost or stolen devices. \n", "qwen2.5:0.5b": "Cabs collect a large number of smartphones and laptops, and the trend towards personalization makes it even easier for people to lose their gadgets in cabs. In London alone, more than 63,000 mobile phones were left behind by cab drivers over six months, according to research from Licensed Taxi Drivers Association and Pointsec. The survey also found that laptops are often left behind as well, with almost a fifth of all laptops in the back of black cabs being left behind in licensed cabs. Among laptop-related issues, the London taxi industry was reported to be particularly careless, losing more than twice as many laptops compared to other cities such as Helsinki, Oslo, Munich, Paris, Stockholm, Copenhagen, Chicago and Sydney. Danes were most likely to lose a laptop, seven times more likely than Germans, Norwegians, Swedes and others. In the German city of Düsseldorf, 70% of all mobile devices are logged into a database for safekeeping, making it one of the most valuable possessions of drivers traveling in cabs.\nThe survey also found that many people collect numbers on their phones, leaving them at risk of missing out on their friends' contact details. The Mobile Equipment National Database was created to help drivers find lost items and is registered by Transport For London, which offers the service as part of its routine checks during muggings and thefts. According to statistics, 50% of all mobile devices were found in back-of-cab cabs, making them one of the most desirable belongings for taxi drivers.\nOverall, the survey highlighted that many people are increasingly careless with their personal belongings when traveling by cab.", "qwen2.5:1.5b": "Gadgets are being lost in black cabs worldwide at an alarming rate, including 63,000 mobile phones and laptops over six months. This trend is particularly pronounced in London, where drivers have become adept at finding returned items, with nearly half the muggings involving mobiles. The survey also noted odd discoveries like a harp, dog, hamster, and baby being left behind in cabs.", "qwen2.5:3b": "Gadgets like smartphones are increasingly lost due to their prevalence and portability. In London over six months, 63,000 mobile phones were left in cabs, with laptops also frequently misplaced. The study found that Londoners lost the most laptops (71% increase from three years ago), while Danes were worst at losing phones. Gadgets like smartphones contain significant amounts of personal data and contacts, making them easy to misplace. This has led to the rise of companies like Retrofone offering cheap old-fashioned phones and a Mobile Equipment National Database for lost gadgets. Muggings and thefts involving mobiles are common, with Transport For London using these databases to help recover lost devices. Cabbies often find lost gadgets in their cabs; some items found included a harp, dog, hamster, and baby.", "opencoder:1.5b": "\"Many people carry old devices with them when they're away. There's a growing trend in companies to replace lost gadgets with a new one, taking the idea further. Companies such as Retrofone aim to buy cheap phones that can be used instead of the expensive ones that are left behind due to theft or mugging. The Mobile Equipment National Database (MEPD) is a database that allows users to keep track of their phone's unique ID number so it can be returned if needed. It also shows what else has been left behind, including a dog, a hamster, and a baby.\" \n", "smollm:1.7b": "Cabs collect mountain of mobiles", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about lost gadgets and their impact on people's lives. Let me read through it carefully.\n\nThe first paragraph says cabs collect mountain of mobiles and gadgets are cheaper but also more likely to get lost. They mention a survey in London where over six months they found more than 63,000 phones and almost 5,800 PDAs like Palms. Each cab had about three phones on average.\n\nThen it talks about how as more people have gadgets, we lose them quickly. The number of lost laptops rose by 71% in the past three years. London was especially affected with over twice as many lost laptops compared to other cities.\n\nThey also compare gadget-loss rates across different countries and cities, noting that Danes are most at risk among those using gadgets. Phones are popular because they can hold a lot of data—hundreds or thousands—and it's hard to recover without their original numbers stored on the phone itself.\n\nFirms like Retrofone offer cheap phones as replacements for lost ones. Another database called Mobile Equipment National Database logs every gadget, helping organizations reunite people with missing stuff and keeping track in case of loss or theft. Drivers often find gadgets like phones, dogs, hamsters, or babies left behind.\n\nI need to condense this into a concise summary, preserving key points: mobile phones and gadgets are common but get lost more easily; London has seen high rates of lost laptops; Danes lose the most via phones; replacing lost gadgets with cheap phones isn't feasible without original data storage.\n</think>\n\nCabs collect numerous mobile devices, yet these gadgets often disappear rapidly. A survey shows over 63,000 phones and nearly 5,800 PDAs (like Palms) were left in cabs, averaging about three per vehicle over six months. LOST GADGETS RISE: Phone usage has surged, making them more likely to vanish. In London, lost laptops increased by 71% compared to the previous three years. The capital faced especially high rates of lost laptops, with Danes being the most at risk when gadgets were commonly used. Phones hold vast amounts of data—thousands or hundreds—but recovering original numbers is hard. Firms like Retrofone offer affordable phones as replacements. A database tracks gadgets, aiding organizations in reconnecting with missing items and maintaining records for loss or theft. Drivers often find lost gadgets like phones, dogs, hamsters, or babies, finding them a pleasant addition to their lives.", "tinyllama:1.1b": "The text emphasizes that while Londoners are among the world's best at losing laptops, they also lose mobile phones in increasing numbers, often leaving them behind in taxi cab backs. The survey finds that Danes have the most frequent misplaced phone habit while mobile phone ownership is growing rapidly globally and people are now registering their unique IDs on lost or stolen mobiles to help recover them when needed. In London, a mobile phone's unique ID number can be registered with mobile equipment database Moble Equipment National Database in case it gets lost or stolen.", "tinydolphin:1.1b": " Cabs collect mountain of mobiles, but they also lose them at an alarming rate. Over the past six months, in London alone, more than 63,000 mobile phones have been left in the back of black cabs, according to a survey. That works out at about three phones per cab. Compare that to back in the day when people had one phone for everyone, and it's no wonder why there are so many lost gadgets. The Licensed Taxi Drivers Association reports a 71% increase in laptops being left behind in cabins. In contrast, Danish people were most adept at losing mobile phones when they're traveling abroad, with seven times as many being left behind compared to passengers in Germany and Sweden. The higher rates of lost gadgets might be due to the high value of these items, or perhaps because people simply forget them on their desks or in their pockets during a taxi ride.", "phi:2.7b": " London cabs collect over 63,000 lost mobile phones per year, with laptops and PDAs also frequently forgotten in licensed cabs. The city has the highest rate of laptop loss out of nine cities surveyed by the Licensed Taxi Drivers Association and Pointsec. People forget their phones' unique ID numbers more often than any other item, leading to a rise in businesses that sell cheap old-fashioned phones to replace expensive ones. Organizations like Transport For London use a Mobile Equipment National Database to reunite lost or stolen mobile phone users with their devices. Other items found in cabs include a harp, dog, hamster and baby.\n", "orca-mini:3b": " Londoners are the worst at losing laptops, according to a survey of lost and found gadgets. More than twice as many laptops were left in the back of black cabs in London as in other cities. The popularity of portable gadgets has grown, and we trust more of our lives to them, but we seem to be forgetting them in ever larger numbers. Many people collect numbers on their phone that they do not have anywhere else, explaining the rise of firms such as Retrofone. Gadgets are cheaper, smaller and more common than ever, and we could be losing a fair chunk of our lives in the back of that cab due to our growing love of phones. The Mobile Equipment National Database lets you register the unique ID number of your phone so it can be returned to you if it is lost or stolen, and organizations such as Transport For London regularly consult it when trying to re-unite folk with their phones and other gadgets.", "hermes3:3b": "Mobiles left in cabs: 63k in 6 months (London alone), over 3 phones per cab. Laptops and PDAs also left in cabs.", "stablelm-zephyr:3b": "A survey revealed that over 63,000 mobile phones were left in black cabs in London in just six months, with Londoners being the world's best at losing laptops compared to other cities. Many people forget their gadgets or do not backup data on them, making it difficult and expensive to replace them. The Mobile Equipment National Database helps register unique phone IDs for easy return in case of theft or loss.", "chatgpt-4o-latest": "A survey found that over 63,000 mobile phones, along with thousands of laptops and PDAs, were left in London black cabs over six months, highlighting the growing trend of losing portable gadgets. Londoners were the worst at losing laptops, while Danes were most likely to forget their phones in cabs. As people store more personal data on their devices, losing them can mean losing important contacts and information. This has led to services like Retrofone, which offers cheap replacement phones, and the Mobile Equipment National Database, which helps reunite owners with lost devices. Transport For London and other organizations use the database to recover lost gadgets. Among the unusual items left in cabs were a harp, a dog, a hamster, and even a baby.", "stablelm2:1.6b": "In London, over 30% of mobile phones and 5,000 laptops were left in black cabs during the past six months, according to a survey. This trend is more prevalent than ever as portable gadgets' popularity has grown. Despite this loss, Londoners are considered the best at losing laptops due to research by the Licensed Taxi Drivers Association and Pointsec, a mobile-data backup firm. The study also revealed that Danes were most adept at losing mobile phones, with seven times more likely to leave it behind in a cab than travelers in Germany, Norway, and Sweden. This growing habit of losing gadgets is supported by firms such as Retrofone, which helps people buy affordable old-fashioned phones to replace the lost one. The love for phones has also led to the creation of the Mobile Equipment National Database that enables phone owners to register their unique ID number for return in case of loss or theft. According to statistics, 25% of all muggings and snatch theft offenses involve mobiles, which is why organizations like Transport For London use this database to reunite people with their phones and other gadgets.", "granite3.1-dense:2b": "Over 63,000 mobile phones, including high-end models, and an equivalent number of laptops and PDAs were left in London's black cabs over the past six months alone, according to a survey by the Licensed Taxi Drivers Association and Pointsec. This makes London the city with the highest incidence of lost laptops among nine studied cities, including Helsinki, Oslo, Munich, Paris, Stockholm, Copenhagen, Chicago, and Sydney. Danes are most prone to losing mobile phones in cabs, seven times more likely than Germans, Norwegians, or Swedes.\n\nThe loss of these devices is attributed to their increasing popularity and the growing reliance on them for personal information, such as contacts and data. Many people store extensive contact details on their phones without backup, risking significant data loss in case of theft. This trend has led to businesses like Retrofone offering cheap, old-fashioned phone replacements for those who've lost their expensive devices.\n\nAdditionally, 50% of muggings and snatch thefts involve mobile phones, with millions registered in the Mobile Equipment National Database. Organizations like Transport For London frequently consult this database to help recover stolen or misplaced gadgets. Surprisingly, cabbies also encounter less common items like harps, dogs, hamsters, and babies left behind in their vehicles.", "reference": "You could be losing a fair chunk of your life in the back of that cab not least because many people collect numbers on their phone that they do not have anywhere else.In London alone over the past six months more than 63,000 mobile phones have been left in the back of black cabs, according to a survey.Briton's growing love of phones has also led to the creation of the Mobile Equipment National Database that lets you register the unique ID number of your phone so it can be returned to you in the event of it being lost or stolen.That works out at about three phones per cab.By contrast Danes were most adept at losing mobile phones being seven times more likely to leave it behind in a cab than travellers in Germans, Norwegians and Swedes.More than twice as many laptops were left in the back of black cabs in London as in any of the nine other cities (Helsinki, Oslo, Munich, Paris, Stockholm, Copenhagen, Chicago and Sydney) where the research into lost and found gadgets was carried out.This growing habit of losing gadgets explains the rise of firms such as Retrofone which lets people buy a cheap old-fashioned phone to replace the tiny, shiny expensive one they have just lost.This has left Londoners, or those travelling by cab in the capital, as the world's best at losing laptops, according to the research by the Licensed Taxi Drivers Association and Pointsec, a mobile-data backup firm.Given that few people back up the data on their PC it is a fair bet that even fewer do so with the phone they carry around."}