{"raw_text": "T-Mobile bets on 'pocket office'\n \n T-Mobile has launched its latest \"pocket office\" third-generation (3G) device which also has built-in wi-fi - high-speed wireless net access.\n \n Unlike other devices where the user has to check which high-speed network is available to transfer data, the device selects the fastest one itself. The MDA IV, released in the summer, is an upgrade to the company's existing smartphone, the 2.5G/wi-fi MDA III. It reflects the push by mobile firms for devices that are like mini laptops. The device has a display that can be swivelled and angled so it can be used like a small computer, or as a conventional clamshell phone. The Microsoft Mobile phone, with two cameras and a Qwerty keyboard, reflects the design of similar all-in-one models released this year, such as Motorola's MPx. \"One in five European workers are already mobile - meaning they spend significant time travelling and out of the office,\" Rene Obermann, T-Mobile's chief executive, told a press conference at the 3GSM trade show in Cannes. He added: \"What they need is their office when they are out of the office.\" T-Mobile said it was seeing increasing take up for what it calls \"Office in a Pocket\" devices, with 100,000 MDAs sold in Europe already.\n \n In response to demand, T-Mobile also said it would be adding the latest phone-shaped Blackberry to its mobile range. Reflecting the growing need to be connected outside the office, it announced it would introduce a flat-fee £20 ($38) a month wi-fi tariff for people in the UK using its wi-fi hotspots. It said it would nearly double the number of its hotspots - places where wi-fi access is available - globally from 12,300 to 20,000.\n \n It also announced it was installing high-speed wi-fi on certain train services, such as the UK's London to Brighton service, to provide commuters a fast net connection too. The service, which has been developed with Southern trains, Nomad Digital (who provide the technology), begins with a free trial on 16 trains on the route from early March to the end of April. A full service is set to follow in the summer. Wi-fi access points will be connected to a Wimax wireless network - faster than wi-fi - running alongside the train tracks. Brian McBride, managing director of T-Mobile in the UK, said: \"We see a growing trend for business users needing to access e-mail securely on the move.\n \n \"We are able to offer this by maintaining a constant data session for the entire journey.\" He said this was something other similar in-train wi-fi services, such as that offered on GNER trains, did not offer yet. Mr Obermann added that the mobile industry in general was still growing, with many more opportunities for more services which would bear fruit for mobile companies in future. Thousands of mobile industry experts are gathered in Cannes, France, for the 3GSM which runs from 14 to 17 February.\n", "llama3.2:1b": "T-Mobile has released a new \"pocket office\" smartphone called MDA IV, which selects the fastest high-speed network for data transfer and features a display that can be swivelled and angled. The device also includes wi-fi capabilities and is designed as an alternative to laptops. T-Mobile reports that the \"Office in a Pocket\" concept has gained popularity among European workers, who spend significant time working remotely. To address this need, T-Mobile plans to add blackberry phones to its mobile range, and introduce a flat-fee wi-fi tariff for UK customers. The company is also installing high-speed wi-fi on train services.", "llama3.2:3b": "T-Mobile launches 'pocket office' device with built-in Wi-Fi and fast network selection, as demand for \"Office in a Pocket\" devices increases. The company also introduces a £20/month flat-fee Wi-Fi tariff in the UK, expands its hotspots globally, and installs high-speed Wi-Fi on certain train services to provide commuters with a fast net connection.", "gemma2:2b": "T-Mobile launched a pocket office device with built-in Wi-Fi and automatic network selection.  The company is seeing increasing demand for \"Office in a Pocket\" devices, especially among European workers who spend significant time travelling. T-Mobile responded by adding the latest Blackberry phone to its range and introducing a flat-fee £20 ($38) monthly Wi-Fi tariff for UK users.  To further cater to mobile office needs, T-Mobile is expanding its Wi-Fi hotspots globally and will offer high-speed wi-fi on select train services using Wimax technology. \n", "qwen2.5:0.5b": "T-Mobile introduces its new \"pocket office\" devices, featuring a built-in wi-fi and displaying as a mini laptop.\n\nIn response to rising demand among European workers who often work away from home or outside their offices, T-Mobile has launched three-generation (3G) devices with Wi-Fi connectivity that are designed to be used like a mini-laptop in the workplace. The device has features such as swiveling and angled displays, allowing it to look and function like a traditional desktop PC or laptop while maintaining some of the speed and comfort of a smartphone.\n\nAdditionally, T-Mobile is expanding its mobile range by adding a Blackberry device to its lineup. This upgrade includes a flat-fee monthly Wi-Fi tariff for UK subscribers and plans to increase hotspots globally from 12,300 to 20,000.\n\nT-Mobile has also announced the installation of Wi-Fi access points on certain train services in the UK, with a free trial period of up to 16 trains starting in early March and an official full service following in summer.", "qwen2.5:1.5b": "T-Mobile's \"pocket office\" device selects fastest available high-speed network, reflects demand for devices like mini laptops and all-in-one models, with plans to add Blackberry phone and Wi-Fi service on train lines in the UK. The company sees growth opportunities in mobile connectivity outside traditional offices.", "qwen2.5:3b": "T-Mobile introduces a third-generation pocket office device with built-in Wi-Fi that automatically selects the fastest network. It upgrades its existing smartphone and can be used as a small computer or phone. CEO Rene Obermann emphasizes the need for mobile offices, noting one in five European workers are always on-the-go. T-Mobile sells 100,000 MDAs in Europe and plans to add Blackberry phones. They also introduced a £20 monthly UK Wi-Fi tariff and will install high-speed Wi-Fi on certain train services using Wimax technology. CEO Brian McBride says this service provides secure access for business users throughout their journey, unlike other in-train Wi-Fi providers. Obermann states the mobile industry is still growing with many more opportunities for new services.", "opencoder:1.5b": "T-Mobile bets on 'pocket office'. It has launched its latest \"pocket office\" third-generation (3G) device which also has built-in wi-fi - high-speed wireless net access. The device selects the fastest one itself, reflecting the push by mobile firms for devices that are like mini laptops. Its MDA IV, released in the summer, is an upgrade to the company's existing smartphone, the 2.5G/wi-fi MDA III. It reflects the design of similar all-in-one models released this year, such as Motorola's MPx. The device has a display that can be swivelled and angled so it can be used like a small computer, or as a conventional clamshell phone. T-Mobile said it was seeing increasing take up for \"Office in a Pocket\" devices, with 100,000 MDAs sold in Europe already. As demand continues to grow, T-Mobile also introduced the latest phone-shaped Blackberry to its mobile range. The company announced it would introduce a flat-fee £20 ($38) a month wi-fi tariff for people in the UK using its wi-fi hotspots. It doubled the number of its hotspots - places where wi-fi access is available - globally from 12,300 to 20,000. T-Mobile also installed high-speed wi-fi on certain train services, such as the UK's London to Brighton service, to provide commuters a fast net connection too. The service began with a free trial on 16 trains on the route from early March to the end of April. A full service is set to follow in the summer. Wi-fi access points will be connected to a Wimax wireless network - faster than wi-fi - running alongside the train tracks.\n", "smollm:1.7b": "The summary is concise and objective, preserving key ideas and details while omitting unnecessary information. It provides a brief overview of the main points mentioned in the text, including the launch of new devices, expansion into third-generation phones, and the introduction of high-speed wi-fi connectivity on trains. The summary also highlights the company's efforts to provide mobile users with convenient access to their office from anywhere, at any time.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about T-Mobile's \"pocket office\" devices. The user provided a detailed passage and wants just the summary as plain text. Let me go through each paragraph step by step.\n\nFirst paragraph introduces T-Mobile's new pocket office devices. They have 3G connectivity with wi-fi fast net access. Unlike other devices, they don't need to switch networks; the device automatically picks the fastest one. It's an upgrade from their existing smartphone, MDA III.\n\nSecond paragraph talks about Rene Obermann, CEO of T-Mobile. He mentions that in Europe, 100,000 MDAs have been sold already. He also says that people moving between office and home are spending time outside, so they need this device for remote work or travel.\n\nThird paragraph introduces the Blackberry phone-shaped device. They're adding it to their mobile range with a £20 flat fee tiered per user, starting in the UK. This service will offer wi-fi access points connected to a Wimax network alongside train tracks, providing faster speeds on public transport.\n\nFourth paragraph mentions T-Mobile is installing high-speed Wi-Fi on specific London to Brighton services under Southern trains. These start with free trials and full service later. They aim to connect mobile users without leaving their homes, which others like GNER don't offer yet.\n\nFifth paragraph brings in expert Brian McBride from T-Mobile's UK office. He notes a growing trend for business users needing secure internet access on the move. They maintain a continuous data session, unlike other similar services that didn't offer this until now.\n\nNow, to summarize all of this succinctly without explanations or formatting. I'll include the key points: MDAs devices with automatic network selection, existing smartphone upgrade, increased demand for remote work, Blackberry phone-shaped device introduction, new Wi-Fi on public transport, and expert insights into business connectivity.\n</think>\n\nT-Mobile's new \"pocket office\" devices feature 3G 802.11n fast wireless net access built-in with automatic network selection. The MDA IV upgrade from the existing smartphone, MDA III, is designed for mini laptops or conventional clamshells. These devices offer wi-fi access via a display that swivels and angles. T-Mobile has sold 100,000 of these in Europe. In response to demand, they'll introduce the Blackberry phone-shaped device with a £20 flat fee tiered per user service. This will include a global Wi-Fi network on train tracks near British Rail services, starting free trials and offering twice the hotspot count as other services like GNER. Experts note T-Mobile is leading in remote work connectivity trends, maintaining data sessions continuously without leaving homes.", "tinyllama:1.1b": "The latest \"pocket office\" smartphone released by T-Mobile boasts built-in wi-fi and can access high-speed networks to transfer data wirelessly at fast speeds, as mentioned in the given text. The MDAs launched in the summer have built-in Qwerty keyboards and are designed to be like mini laptops while being used out of the office or as a conventional phone with two camera lenses, allowing users to take photos and videos when out and about. The company's CEO announced plans for flat-fee wi-fi tariffs for users around the world who access T-Mobile's mobile network hotspots. The train service offering high-speed wi-fi connectivity has been developed in collaboration with Nomad Digital, while a trial version of the service will begin on 16 trains on the London to Brighton route in March and April. The company also plans to install wi-fi on some train services by the summer, providing commuters with an extra fast net connection when out and about.", "tinydolphin:1.1b": " T-Mobile has introduced its latest pocket office third-generation (3G) device, the MDA IV, which can be used as a mini laptop or a conventional clamshell phone. The device features an excellent 2.5 inch high-resolution display and supports Qwerty keyboard technology for typing out emails and browsing the internet. Additionally, T-Mobile has been focusing on enhancing its mobile range by introducing high-speed wi-fi access on some train services, such as London to Brighton. The company is also investing in high-speed wi-fi on certain train routes to provide commuters with a faster and more convenient internet connection.", "phi:2.7b": " T-Mobile's new MDA IV 3G device has built-in Wi-Fi and selects the fastest network automatically. The company is responding to the growing trend for workers to be mobile and providing \"pocket office\" devices, with a flat-fee wi-fi tariff for its customers. It has also announced plans to install high-speed Wi-Fi on trains.\n", "orca-mini:3b": " T-Mobile has released a new smartphone called MDA IV which has built-in wi-fi and can select the fastest network to transfer data. Unlike other devices where the user needs to check which high-speed network is available, the device automatically selects the fastest one. The MDA IV is an upgrade to the company's existing smartphone, MDA III. It reflects the push by mobile firms for devices that are like mini laptops. T-Mobile plans to nearly double the number of its wi-fi hotspots globally from 12,300 to 20,000. The company is installing high-speed wi-fi on certain train services such as London to Brighton service to provide commuters a fast net connection too. T-Mobile plans to offer a free trial of wi-fi access on 16 trains on the route from early March to the end of April and will follow it with a full service in the summer. The mobile industry is still growing, and T-Mobile sees more opportunities for more services.", "hermes3:3b": "T-Mobile launches 'pocket office' 3G device with built-in Wi-Fi, targeting mobile European workers; plans £20/mo WiFi tariff and train Wi-Fi service.", "stablelm-zephyr:3b": "T-Mobile introduced its latest \"pocket office\" third-generation (3G) device with built-in Wi-Fi, the MDA IV, which can switch between the fastest available network and selects the fastest one itself for data transfer. The device has a swivel display that can be used as a small computer or conventional clamshell phone. T-Mobile reported 100,000 MDAs sold in Europe for \"Office in a Pocket\" devices. In response to demand, they announced adding Blackberry phones and introducing a flat-fee £20 ($38) a month Wi-Fi tariff for UK users with its hotspots. They also planned to install high-speed Wi-Fi on certain train services like London to Brighton route for commuters. T-Mobile's CEO highlighted the growing trend of business users needing secure mobile email access and said this was something other in-train Wi-Fi services didn't offer yet.", "chatgpt-4o-latest": "T-Mobile has launched the MDA IV, a 3G \"pocket office\" device with built-in wi-fi that automatically selects the fastest available network. The device, an upgrade to the MDA III, features a swivel display, Qwerty keyboard, and two cameras, resembling a mini laptop. T-Mobile's CEO highlighted the growing need for mobile office solutions, with 100,000 MDAs already sold in Europe. The company is also adding the latest Blackberry to its lineup and introducing a £20 monthly wi-fi tariff in the UK while expanding its global wi-fi hotspots from 12,300 to 20,000. Additionally, T-Mobile is installing high-speed wi-fi on certain train routes, starting with a free trial on London to Brighton trains, using a Wimax network for continuous connectivity. The company sees increasing demand for secure mobile email access and anticipates further growth in mobile services. The announcements were made at the 3GSM trade show in Cannes.", "stablelm2:1.6b": "T-Mobile has launched its latest \"pocket office\" device with built-in Wi-Fi, offering users a fast and automatic connection for data transfer. The MDA IV is an upgrade to T-Mobile's existing smartphone, the MDA III, and comes in response to growing demand for all-in-one devices like the Motorola MPx. The device has a swivelled and angled display that can be used as either a small computer or conventional clamshell phone. T-Mobile reports increased uptake for \"Office in a Pocket\" devices, with MDAs already sold in Europe. Additionally, T-Mobile will introduce a flat-fee £2 ($2) per month Wi-Fi tariff for users in the UK using its Wi-Fi hotspots and nearly double the number of its hotspots globally from 2010 to 2011.", "granite3.1-dense:2b": "T-Mobile introduces the MDA IV, an upgraded \"pocket office\" device featuring a built-in wi-fi and high-speed data selection capability, designed to mimic mini laptops. This device, with its swivelable display, Qwerty keyboard, and dual cameras, caters to mobile workers who spend considerable time outside the office. T-Mobile anticipates a demand for such \"Office in a Pocket\" devices, having already sold 100,000 MDAs in Europe. To meet this need, they plan to expand their Blackberry range and introduce a £20 ($38) monthly wi-fi tariff globally, increasing hotspots from 12,300 to 20,000.\n\nT-Mobile also plans to provide high-speed wi-fi on specific train services, like the London to Brighton route (initially a trial of 16 trains from early March to late April), through a Wimax wireless network running alongside train tracks. This service ensures constant data connectivity for business users during their commutes. T-Mobile's chief executive, Rene Obermann, highlighted the growing trend of mobile workers requiring secure e-mail access while traveling and emphasized that this offering surpasses existing in-train wi-fi services. With thousands of industry experts attending the 3GSM conference in Cannes, T-Mobile sees significant potential for further mobile service development.", "reference": "T-Mobile has launched its latest \"pocket office\" third-generation (3G) device which also has built-in wi-fi - high-speed wireless net access.Mr Obermann added that the mobile industry in general was still growing, with many more opportunities for more services which would bear fruit for mobile companies in future.Reflecting the growing need to be connected outside the office, it announced it would introduce a flat-fee £20 ($38) a month wi-fi tariff for people in the UK using its wi-fi hotspots.It also announced it was installing high-speed wi-fi on certain train services, such as the UK's London to Brighton service, to provide commuters a fast net connection too.In response to demand, T-Mobile also said it would be adding the latest phone-shaped Blackberry to its mobile range.He said this was something other similar in-train wi-fi services, such as that offered on GNER trains, did not offer yet.It said it would nearly double the number of its hotspots - places where wi-fi access is available - globally from 12,300 to 20,000.Wi-fi access points will be connected to a Wimax wireless network - faster than wi-fi - running alongside the train tracks.Unlike other devices where the user has to check which high-speed network is available to transfer data, the device selects the fastest one itself."}