{"raw_text": "California sets fines for spyware\n \n The makers of computer programs that secretly spy on what people do with their home PCs could face hefty fines in California.\n \n From 1 January, a new law is being introduced to protect computer users from software known as spyware. The legislation, which was approved by Governor Arnold Schwarzenegger, is designed to safeguard people from hackers and help protect their personal information. Spyware is considered by computer experts to be one of the biggest nuisance and security threats facing PC users in the coming year. The software buries itself in computers and can collect a wide range of information. At its worst, it has the ability to hijack personal data, like passwords, login details and credit card numbers. The programs are so sophisticated they change frequently and become impossible to eradicate.\n \n One form of spyware called adware has the ability to collect information on a computer user's web-surfing. It can result in people being bombarded with pop-up ads that are hard to close. In Washington, Congress has been debating four anti-spyware bills, but California is a step ahead. The state's Consumer Protection Against Spyware Act bans the installation of software that takes control of another computer. It also requires companies and websites to disclose whether their systems will install spyware. Consumers are able to seek up to $1,000 in damages if they think they have fallen victim to the intrusive software. The new law marks a continuing trend in California towards tougher privacy rights. A recent survey by Earthlink and Webroot found that 90% of PCs are infested with the surreptitious software and that, on average, each one is harbouring 28 separate spyware programs. Currently users wanting protection from spyware have turned to free programs such as Spybot and Ad-Aware.\n", "llama3.2:1b": "California introduces a new law to protect computer users from spyware, allowing fines for makers of such software if they fail to warn consumers about the potential risks or install spyware on user computers without consent.", "llama3.2:3b": "California introduces a law to protect computer users from spyware starting January 1, banning the installation of software that takes control of another computer and requiring companies to disclose whether their systems will install spyware. The law also sets fines of up to $1,000 in damages for victims. California's Consumer Protection Against Spyware Act marks a trend towards tougher privacy rights, as 90% of PCs are found to be infested with spyware.", "gemma2:2b": "California will enforce a new law against spyware beginning January 1st. This law holds manufacturers of spyware accountable with fines of up to $1,000 per victim if they install invasive software on computers without consent. The legislation bans the installation of spyware that takes control of another computer and requires companies to disclose whether their systems will install it.  \n", "qwen2.5:0.5b": "California enacts new law banning spyware, imposing fines for installing it.", "qwen2.5:1.5b": "California introduces fines for computer programs that secretly spy on users' PC activities. The new law bans spyware installation and requires disclosure of potential intrusive software, offering up to $1,000 in damages if a user believes they have been affected. This aligns with California's trend towards stronger privacy rights.", "qwen2.5:3b": "California introduces new laws against spyware, including fines up to $1,000 for installation of software that takes control of another computer or fails to disclose spyware installation. The law aims to protect users' personal information from hackers, focusing on adware that tracks web-surfing and hijacks data like passwords and credit card numbers. 90% of PCs in California are infested with up to 28 different types of spyware programs.", "opencoder:1.5b": "California sets fines for spyware.\n\nThe makers of computer programs that secretly spy on what people do with their home PCs could face hefty fines in California.\nFrom 1 January, a new law is being introduced to protect computer users from software known as spyware. The legislation, which was approved by Governor Arnold Schwarzenegger, is designed to safeguard people from hackers and help protect their personal information. Spyware is considered by computer experts to be one of the biggest nuisance and security threats facing PC users in the coming year. The software buries itself in computers and can collect a wide range of information. At its worst, it has the ability to hijack personal data, like passwords, login details and credit card numbers. The programs are so sophisticated they change frequently and become impossible to eradicate.\nOne form of spyware called adware has the ability to collect information on a computer user's web-surfing. It can result in people being bombarded with pop-up ads that are hard to close. In Washington, Congress has been debating four anti-spyware bills, but California is a step ahead. The state’s Consumer Protection Against Spyware Act bans the installation of software that takes control of another computer. It also requires companies and websites to disclose whether their systems will install spyware. Consumers are able to seek up to $1,000 in damages if they think they have fallen victim to the intrusive software. The new law marks a continuing trend in California towards tougher privacy rights. A recent survey by Earthlink and Webroot found that 90% of PCs are infested with the surreptitious software and that, on average, each one is harbouring 28 separate spyware programs. Currently users wanting protection from spyware have turned to free programs such as Spybot and Ad-Aware.\n", "smollm:1.7b": "California sets fines for spyware", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about California fines for spyware. Let me read through it carefully.\n\nThe first sentence says the makers of spy software get fines in California starting January 1st. That's an important point because it highlights the potential financial impact.\n\nThen, there's a new law introduced by Governor Schwarzenegger called the Consumer Protection Act. It aims to protect computer users from spyware. I should note that this is designed to prevent hackers and help protect personal info, which makes sense since they're talking about software doing stuff sneaky in PC systems.\n\nThe text explains how spyware can collect a lot of information like passwords and credit cards. The worst case is it hijacks their data, which could be really bad for them. Adware specifically is mentioned as a form that collects web surfing info through ads.\n\nCongress has been talking about bills in Washington, but California is ahead with its Consumer Protection Act. It's supposed to ban spyware software from running on another computer and require companies to disclose if their systems have it. Consumers can sue for up to $1k, which is a relief because of the fine mentioned.\n\nThe new law targets the installation of such software. There are free programs like Spybot and Ad-Aware that some users are using instead of paying more expensive options.\n\nI need to make sure I cover all these points in a concise summary without any extra information or explanations.\n</think>\n\nCalifornia introduces a new law targeting spyware software, which hides personal data like passwords and credit card numbers. The law bans installing such software on another computer and requires disclosure from companies and websites. Consumers can sue for up to $1k if they believe they were affected by this software. Free programs like Spybot and Ad-Aware are available instead of paying for more expensive options, with a 90% detection rate reported.", "tinyllama:1.1b": "In California, a new law will make it a crime for companies and websites to install software that takes control of another computer, in addition to banning the installation of software that secretly spies on users' personal information and activities. The Consumer Protection Against Spyware Act was approved by Governor Arnold Schwarzenegger and is designed to ensure that PC users can protect themselves from hackers and help protect their personal information. As a result, California sets fine for spyware installations that harbour more than 28 spyware programs, on average, per computer. The legislation is seen as an important step towards ensuring users' privacy rights in the coming year.", "tinydolphin:1.1b": " California has become a leader in protecting its residents from the malicious software known as spyware, which can be very harmful to their personal information and computer security. In an effort to keep users informed and protected from this type of intrusion, Governor Arnold Schwarzenegger recently signed a new law into effect that requires all websites and companies using the internet to disclose whether they use spyware on computers. This legislation is meant to provide more transparency for consumers in dealing with such software and help protect their personal data. The California Consumer Protection Against Spyware Act, which took effect on January 1st, requires all companies and websites offering products or services online to disclose whether they use spyware. Additionally, the law prohibits businesses from installing new software without warning consumers if it will take control of another computer, regardless of who originally installed it. This law marks a continuing trend in California towards tougher privacy rights for its residents.", "phi:2.7b": " A new law in California will fine makers of computer programs that secretly spy on home PCs starting 1 January. The legislation protects users from hackers, secures their personal information, and helps protect against intrusive software. \n \nAdware is a form of spyware that can collect personal data, including passwords, login details, and credit card numbers, causing pop-up ads that are hard to close. In Washington, four anti-spyware bills are being debated by Congress, while California has introduced the Consumer Protection Against Spyware Act, which bans the installation of software that takes control of another computer and requires companies and websites to disclose if their systems will install spyware. The law offers up to $1,000 in damages for consumers who fall victim to intrusive software, demonstrating a trend towards stronger privacy rights in California.\n", "orca-mini:3b": " California sets fines for spyware with its new law that prohibits the installation of spyware on computers. The law allows consumers to seek damages of up to $1,000 if they think they have been affected by spyware. This follows a trend in California towards stronger privacy rights. A survey conducted by Earthlink and Webroot found that 90% of computers are infected with spyware and that each one contains an average of 28 different spyware programs. Free programs like Spybot and Ad-Aware are used to protect users from spyware.", "hermes3:3b": "California fines for spyware (introduces protections against)\n  - Fines for spyware makers\n  - Disclosure requirement for installing intrusive software\n  - Up to $1000 in damages for consumers affected by spyware", "stablelm-zephyr:3b": "Starting from January 1, California introduced a new law aimed at protecting computer users from spyware. The legislation, approved by Governor Arnold Schwarzenegger, is designed to safeguard people from hackers and help protect their personal information from software considered one of the biggest security threats, spyware. The software buries itself in computers and can collect a wide range of information, including passwords, login details, and credit card numbers. A form of adware called spyware can also collect data on web-surfing users, resulting in pop-up ads that are hard to close. The new law requires companies and websites to disclose whether their systems will install spyware and offers consumers up to $1,000 in damages if they fall victim to intrusive software. This legislation marks a continuing trend towards tougher privacy rights in California. A recent survey found that 90% of PCs are infested with spyware, with an average of 28 separate programs on each infected computer. Consumers have been using free programs such as Spybot and Ad-Aware for protection against spyware.", "chatgpt-4o-latest": "California has enacted a law, effective January 1, to combat spyware, imposing fines on makers of programs that secretly monitor users' activities. Approved by Governor Arnold Schwarzenegger, the legislation aims to protect personal data from hackers. Spyware, a major security threat, can steal sensitive information like passwords and credit card details. A related form, adware, tracks web activity and triggers intrusive ads. While Congress debates anti-spyware bills, California's Consumer Protection Against Spyware Act bans unauthorized software installations and mandates disclosure by companies. Consumers can seek up to $1,000 in damages. A survey found 90% of PCs contain spyware, with users relying on free tools like Spybot and Ad-Aware for protection.", "stablelm2:1.6b": "California enforces fines for spyware by introducing a new law to protect computer users from software like spyware. Starting January 1st, the Consumer Protection Against Spyware Act will ban the installation of spyware taking control of another computer and require companies and websites to disclose if their systems will install it. The state's Consumer Protection Act allows up to $1,000 in damages for those affected by intrusive software. A survey found that 30% of PCs are infected with spyware, each having on average 2 separate spyware programs. Users can now use free programs like Spybot and Ad-Aware for protection from spyware.", "granite3.1-dense:2b": "California has enacted a law, approved by Governor Schwarzenegger, effective January 1st, to combat the growing threat of spyware on home PCs. This legislation, the Consumer Protection Against Spyware Act, prohibits software that takes control of computers and mandates disclosure if a company's system installs such spyware. Penalties for violators can reach up to $1,000 per infected computer. Spyware is highly sophisticated, capable of collecting sensitive data like passwords and credit card details, and often undetectable due to frequent updates. Washington is debating similar anti-spyware bills, but California leads the way in enforcing tougher privacy rights against this pervasive issue. A recent Earthlink and Webroot survey found that 90% of PCs are infected with an average of 28 spyware programs each. Users currently rely on free tools like Spybot and Ad-Aware for protection, underscoring the significance of California's new law in addressing this escalating privacy concern.", "reference": "From 1 January, a new law is being introduced to protect computer users from software known as spyware.One form of spyware called adware has the ability to collect information on a computer user's web-surfing.The state's Consumer Protection Against Spyware Act bans the installation of software that takes control of another computer.The software buries itself in computers and can collect a wide range of information.The makers of computer programs that secretly spy on what people do with their home PCs could face hefty fines in California.Spyware is considered by computer experts to be one of the biggest nuisance and security threats facing PC users in the coming year.Currently users wanting protection from spyware have turned to free programs such as Spybot and Ad-Aware."}