{"raw_text": "Progress on new internet domains\n \n By early 2005 the net could have two new domain names.\n \n The .post and .travel net domains have been given preliminary approval by the net's administrative body. The names are just two of a total of 10 proposed domains that are being considered by the Internet Corporation for Assigned Names and Numbers, Icann. The other proposed names include a domain for pornography, Asia, mobile phones, an anti-spam domain and one for the Catalan language and culture.\n \n The .post domain is backed by the Universal Postal Union that wants to use it as the online marker for every type of postal service and to help co-ordinate the e-commerce efforts of national post offices.\n \n The .travel domain would be used by hotels, travel firms, airlines, tourism offices and would help such organisations distinguish themselves online. It is backed by a New York-based trade group called The Travel Partnership. Icann said its early decision on the two domains was in response to the detailed technical and commercial information the organisations behind the names had submitted. Despite this initial approval, Icann cautioned that there was no guarantee that the domains would actually go into service. At the same time Icann is considering proposals for another eight domains. One that may not win approval is a proposal to set up a .xxx domain for pornographic websites. A similar proposal has been made many times in the past. But Icann has been reluctant to approve it because of the difficulty of making pornographers sign up and use it. In 2000 Icann approved seven other new domains that have had varying degrees of success. Three of the new so-called top level domains were for specific industries or organisations such as .museum and .aero. Others such as .info and .biz were intended to be more generic. In total there are in excess of 200 domain names and the majority of these are for nations. But domains that end in the .com suffix are by far the most numerous.\n", "llama3.2:1b": "The Internet Corporation for Assigned Names and Numbers (Icann) has given preliminary approval for two new internet domains: .post and .travel. The .post domain is backed by the Universal Postal Union to use as a postal online marker, while the .travel domain will be used by hotels, travel firms, airlines, and tourism offices.", "llama3.2:3b": "The Internet Corporation for Assigned Names and Numbers (Icann) has given preliminary approval to two new internet domains: .post and .travel, which aim to standardize online postal services and facilitate travel organizations' online presence, respectively.", "gemma2:2b": "Two new internet domains, .post and .travel, have received preliminary approval from Icann. The .post domain is backed by the Universal Postal Union, while the .travel domain will be used by travel organizations.  Icann has also considered other proposals for new domains, including a potential .xxx domain for pornography. \n", "qwen2.5:0.5b": "The Internet Corporation for Assigned Names and Numbers has approved two new top-level domains (TLDs): .post and .travel. These TLDs are backed by the Universal Postal Union to help with online shopping, postal services, and tourism. While Icann initially approved a domain for pornography, it cautioned that this may not actually go into service. There is one proposal in the works to create a new domain for pornographic websites but Icann has been hesitant due to difficulties in convincing users to sign up.", "qwen2.5:1.5b": "New internet domains, including .post (for postal services) and .travel (hotels/travel firms), have received preliminary approval from Icann, along with proposals for seven other domains. The .xxx domain for pornographic websites was approved but faces difficulties in sign-up and usage. Only 10 proposed domains are expected to be finalized, while over 200 total domains exist across the net.", "qwen2.5:3b": "By early 2005, two new internet domain names, .post and .travel, received preliminary approval from Icann out of ten proposed domains. The .post domain aims to serve as an online identifier for all postal services and e-commerce initiatives, supported by the Universal Postal Union (UPU). The .travel domain is backed by The Travel Partnership and would facilitate online branding for travel-related businesses. Despite initial approval, there's no guarantee these domains will be implemented due to Icann's caution. Other proposed domains include a pornographic .xxx domain and various generic or industry-specific ones like .museum, .aero, .info, and .biz. Since 2000, seven new top-level domains have been approved with varying levels of success; some are tied to specific industries, while others were meant for more general use.", "opencoder:1.5b": "By early 2005, the net had two new domain names: .post and .travel. The .post domain was approved by the Internet Corporation for Assigned Names and Numbers (Icann), which is a global network that assigns unique IP addresses to internet service providers. It was backed by the Universal Postal Union, allowing them to use it as an online marker for postal services.\n\nThe .travel domain would be used by businesses like hotels, travel firms, airlines, tourism offices, and helps such organizations distinguish themselves online. The domain is backed by a New York-based group called The Travel Partnership. Despite initial approval from the Icann, the domains were reconsidered due to technical issues faced by the hosting companies.\n\nThere are in excess of 200 domain names available in different categories like .com, .net, .org, etc. Some of them have been approved while others are still under consideration. The top-level domain (.com) is by far the most popular and dominates the internet.\n", "smollm:1.7b": "The summary is concise, preserving key ideas and details. It captures the main points of the text:\n- The two new internet domains proposed by the Universal Postal Union (UPU) and the International Telecommunication Union (ITU).\n- The technical and commercial information submitted by these organizations to Icann for consideration.\n- The decision on the two domains, with no guarantee that they would actually go into service.\n- The current status of the proposed eight new domains, including one for pornographic websites.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the given text concisely while preserving the key ideas and details. Let me read through it carefully first.\n\nThe main point is about progress on new internet domains by early 2005. It mentions that there could be two more net domains: .post and .travel. The rest of the proposed names include things like pornography, Asia, mobile phones, anti-spam, Catalan, etc.\n\nIt then goes into specifics. The .post domain is backed by the Universal Postal Union, which wants to use it as an online marker for postal services and help coordinate e-commerce efforts of national post offices. So I should note that .post is for postal services and helps integrate e-commerce.\n\nNext, the .travel domain is with The Travel Partnership, aiming to be used by hotels, airlines, etc., to help organizations distinguish themselves online. That makes sense as travel-related businesses need a distinct online presence.\n\nIcann's initial decision on these two domains is in response to detailed technical and commercial info from their names' holders. They have concerns that no domain will actually work, but they're considering more domains afterward. One concern was the .xxx domain for porn, which is tricky because people sign up and use it, so ensuring approval is difficult.\n\nIn 2000, Icann approved seven new domains, with some specific to industries like museums or airlines, others generic like .info or .biz. Overall, there are over 200 domains in excess of that, but most end with .com, which has been the biggest category.\n\nI need to make sure my summary is concise and captures all these points without going into too much detail about each proposal or context. Maybe start by stating the main progress towards net domain names in 2005, mention the two new domains, their purposes (postal and travel), their respective organizations backing them, and note that while some domains are pending approval but others like .com are major categories.\n\nI should structure it to first introduce the significant progress, then list the two main domains with specifics, explain who backs them, and then touch on the overall dominance of .com domains. Make sure each point is clear without getting too bogged down in details.\n</think>\n\nBy early 2005, the internet had made strides toward introducing new net domain names, significantly advancing the landscape for online resources. Two key domains were successfully approved: \n\n1. **.post** was given preliminary approval by the Internet Corporation for Assigned Names and Numbers (Icann). It's used as an online marker for postal services to facilitate e-commerce efforts of post offices.\n\n2. **.travel** was also given initial acceptance, aimed at helping travel-related businesses like hotels and airlines distinguish themselves online through the .travel domain, supported by The Travel Partnership.\n\nThe initiative had other proposals in consideration, with concerns about the successful acceptance of domains like .com due to their dominance as the most common top-level domains, despite some challenges ensuring approval. Seven new domains were approved in 2000, including specific ones for industries and others intended for generality. In total, over 200 domains were proposed, with many ending in .com.", "tinyllama:1.1b": "During early 2005, two new internet domains were given preliminary approval by Icann's administrative body. One of the proposed domains is a .post domain for online markers in every type of postal service and to help co-ordinate e-commerce efforts of national post offices. Another domain in contention is the .travel domain, which would be used by hotel, travel firm, airline, tourism office, and other organizations to distinguish themselves online. Despite early approval from Icann, there's no guarantee that these domains will go into service. The agency is currently considering proposals for eight new domains. One that may not receive approval is the .xxx domain for pornographic websites because it has been rejected in the past due to difficulty of making pornographers sign up and use it. In total, Icann has approved over 200 domains so far.", "tinydolphin:1.1b": " The Internet Corporation for Assigned Names and Numbers (ICANN) is currently considering two new domain names, including a proposed .post domain to be used as an online marker for every type of postal service and one for Catalan culture and language. These domain names are being considered by the organization based on detailed technical and commercial information provided by those behind them. However, without a clear indication that these domains will indeed become available, it's impossible to predict whether they will be approved or rejected.", "phi:2.7b": " By early 2005, two new internet domains had been proposed and given preliminary approval by Icann - .post for postal services and .travel for tourism organizations. Other proposals include a domain for pornography, Asia, mobile phones, anti-spam, Catalan language and culture, and several other generic and industry-specific domains. However, there is no guarantee that these new domains will go into service.\n", "orca-mini:3b": " Progress is being made on creating new internet domains. By early 2005, two new domain names could be added to the net's directory. The proposed domains include a domain for pornography and one for mobile phones. Other proposed domains include ones for travel agencies, an anti-spam domain, and a domain for Catalan culture and language. However, there is no guarantee that these domains will actually go into service. In 2000, Icann approved seven new top-level domains, including .museum and .aero, but others like .info and .biz have had varying degrees of success.", "hermes3:3b": "New internet domains:\n- .post (PUA-backed)\n- .travel (Travel Partnership-backed)", "stablelm-zephyr:3b": "In 2005, the Internet Corporation for Assigned Names and Numbers (ICANN) considered approving two new domain extensions: .post and .travel. The .post domain was backed by the Universal Postal Union for use with all types of postal services and e-commerce efforts. The .travel domain would be used by travel companies, airlines, hotels, and tourism offices to distinguish themselves online. ICANN cautioned that approval did not guarantee the domains' implementation. They also considered eight other proposed domains, one of which might not receive approval due to difficulties in getting pornographers to sign up for a .xxx domain extension. In 2000, ICANN approved seven new domains that had varying degrees of success.", "chatgpt-4o-latest": "By early 2005, two new internet domains, .post and .travel, could be introduced following preliminary approval by Icann. The .post domain, backed by the Universal Postal Union, aims to serve postal services and e-commerce coordination, while .travel, supported by The Travel Partnership, would help travel-related businesses distinguish themselves online. Icann's decision was based on detailed technical and commercial submissions, though final approval is not guaranteed. Additionally, Icann is reviewing eight other proposed domains, including .xxx for pornography, which has faced repeated rejection due to enforcement challenges. In 2000, Icann approved seven new domains with mixed success, including industry-specific (.museum, .aero) and generic (.info, .biz) domains. While over 200 domain names exist, .com remains the most widely used.", "stablelm2:1.6b": "The internet's administration body, Icann, considered approving .post and .travel as new internet domain names early on, backed by the Universal Postal Union and The Travel Partnership respectively. Despite preliminary approval, there is no guarantee these domains will go live. Icann is also evaluating eight more proposed domains, including one for pornography which has faced reluctance in previous approvals due to difficulty of obtaining sign-ups. Among over 200 proposed domain names, .com suffixes are the most numerous.", "granite3.1-dense:2b": "By early 2005, Icann, the internet's administrative body, had granted preliminary approval to two new top-level domain names: .post and .travel. The .post domain is supported by the Universal Postal Union for use as a digital marker for postal services and e-commerce coordination. The .travel domain aims to help travel companies, hotels, airlines, and tourism offices distinguish themselves online, backed by The Travel Partnership. Icann's decision was based on submitted technical and commercial information but cautioned that approval isn't guaranteed. Icann is also evaluating eight additional proposed domains, including a .xxx domain for adult content, which has faced historical rejection due to the challenges of enforcing pornography site sign-ups. Since 2000, Icann has approved seven new top-level domains, with .com being the most prevalent.", "reference": "By early 2005 the net could have two new domain names.The names are just two of a total of 10 proposed domains that are being considered by the Internet Corporation for Assigned Names and Numbers, Icann.In 2000 Icann approved seven other new domains that have had varying degrees of success.The other proposed names include a domain for pornography, Asia, mobile phones, an anti-spam domain and one for the Catalan language and culture.Icann said its early decision on the two domains was in response to the detailed technical and commercial information the organisations behind the names had submitted.Despite this initial approval, Icann cautioned that there was no guarantee that the domains would actually go into service.In total there are in excess of 200 domain names and the majority of these are for nations.The .post and .travel net domains have been given preliminary approval by the net's administrative body."}