{"raw_text": "Mobile multimedia slow to catch on\n \n There is no doubt that mobile phones sporting cameras and colour screens are hugely popular.\n \n Consumers swapping old phones for slinkier, dinkier versions are thought to be responsible for a 26% increase in the number of phones sold during the third quarter of 2004, according to analysts Gartner More than 167 million handsets were sold globally between July and September 2004, a period that, according to Gartner analyst Carolina Milanesi is \"seldom strong\". But although consumers have mobiles that can take and send snaps, sounds and video clips few, so far, are taking the chance to do so.\n \n In fact, the numbers of people not taking and sending pictures, audio and video is growing. Figures gathered by Continental Research shows that 36% of British camera phone users have never sent a multimedia message (MMS), up from 7% in 2003. This is despite the fact that, during the same period, the numbers of camera phones in the UK more than doubled to 7.5 million. Getting mobile phone users to send multimedia messages is really important for operators keen to squeeze more cash out of their customers and offset the cost of subsidising the handsets people are buying. The problem they face, said Shailendra Jain, head of MMS firm Adamind, is educating people in how to send the multimedia messages using their funky handsets.\n \n \"Also,\" he said, \"they have to simplify the interface so its not rocket science in terms of someone understanding it.\" Research bears out the suspicion that people are not sending multimedia messages because they do not know how to. According to Continental Research, 29% of the people it questioned said they were technophobes that tended to shy away from innovation. Only 11% regarded themselves as technically savvy enough to send a picture or video message. The fact that multimedia services are not interoperable across networks and phones only adds to people's reluctance to start sending them, said Mr Jain. \"They ask themselves: 'If I'm streaming video from one handset to another will it work?'\" he said. \"There's a lot of user apprehension about that.\"\n \n There are other deeper technical reasons why multimedia messages are not being pushed as strongly as they might. Andrew Bud, executive chairman of messaging firm Mblox, said mobile phone operators cap the number of messages that can be circulating at any one time for fear of overwhelming the system. \"The rate we can send MMS into the mobile network is fairly constant,\" he said. The reason for this is that there are finite capacities for data traffic on the second generation networks that currently have the most users.\n \n No-one wants to take the risk of swamping these relatively narrow channels so the number of MMS messages is capped, said Mr Bud. This has led to operators finding other technologies, particularly one known as Wap-push, to get multimedia to their customers. But when networks do find a good way to get multimedia to their customers, the results can be dramatic. Israeli technology firm Celltick has found a way to broadcast data across phone networks in a way that does not overwhelm existing bandwidth. One of the first firms to use the Celltick service is Hutch India, the largest mobile firm in the country. The broadcast system gets multimedia to customers via a rolling menu far faster than would be possible with other systems. While not multimedia messaging, such a system gets people used to seeing their phones as a device that can handle all different types of content. As a result 40% of the subscribers to the Hutch Alive, which uses Celltick's broadcast technology, regularly click for more pictures, sounds and images from the operator. \"Operators really need to start utilising this tool to reach their customers,\" said Yaron Toren, spokesman for Celltick. Until then, multimedia will be a message that is not getting through.\n", "llama3.2:1b": "Mobile phone users in 2004 were selling fewer than half of all smartphones due to lack of internet connectivity and limited multimedia capabilities.\n\nDespite having the ability to take and send photos, sounds, and videos, many people are not taking advantage of this feature, with 36% of British camera phone users never sending multimedia messages (MMS).\n\nOperators have tried to encourage more use by educating users on how to send MMS using their handsets. However, technical issues such as limited network capacity and the risk of overwhelming existing bandwidth have slowed down the adoption.\n\nSome operators are exploring alternative technologies, including Wap-push and broadcast systems that can handle multimedia data faster and with less interference from other networks.", "llama3.2:3b": "Mobile phone users are slow to use cameras and multimedia features despite having devices capable of sending photos, sounds, and video clips. According to analysts, 36% of British camera phone users have never sent an MMS, up from 7% in 2003. Operators face challenges educating users on how to send multimedia messages due to a lack of technical knowledge. Technical limitations such as network capacity constraints and interoperability issues also hinder the adoption of multimedia messaging.", "gemma2:2b": "Mobile phones with cameras and color screens are popular but many users do not send multimedia messages (MMS). This reluctance is due to lack of understanding how to use the technology, limited interoperability between networks and phones, and bandwidth limitations on existing 2G networks.  Operators are finding alternatives like Wap-push to overcome these challenges. Celltick's broadcasting system allows for a faster delivery of multimedia content without overwhelming bandwidth, leading to increased image sharing by subscribers. For operators, utilizing this technology is crucial to encourage adoption of multimedia messaging. \n", "qwen2.5:0.5b": "Mobile media use has been slow to catch on despite rising smartphone usage worldwide, which may be due to consumers' reluctance to send multimedia messages and technological challenges in making the service interoperable across networks and phones.", "qwen2.5:1.5b": "Mobile media adoption has grown significantly due to increasing phone capabilities but remains low among users. Key reasons include lack of knowledge about sending multimedia messages, technical barriers like interoperability and operator caps on MMS volume, leading operators to focus on other technologies like Wap-push for better mobile content delivery.", "qwen2.5:3b": "Mobile phones with cameras and color screens are hugely popular among consumers. Despite this, uptake of mobile multimedia services such as sending pictures, sounds, and video clips remains low, particularly in the UK where 36% of camera phone users have never sent an MMS. This is partly due to a lack of knowledge about how to send multimedia messages using handsets and concerns about interoperability across different networks. Additionally, mobile operators are hesitant to push multimedia services because they fear overwhelming their second-generation network systems. However, companies like Celltick offer solutions such as broadcast technology that can efficiently deliver content without overburdening existing bandwidth. Despite these challenges, the potential for widespread adoption of multimedia messaging is significant if operators could find a way to effectively implement and popularize such services.", "opencoder:1.5b": "The text provided emphasizes the growing popularity of mobile phones with cameras and colour screens, which have an immense potential for users. Consumers are likely to use smartphones for photo/ video sharing due to the increased demand for multimedia support. Nonetheless, despite this increased usage, the technology still faces technical hurdles that limit its widespread adoption. The text is aimed at summarizing what it's about, preserving key points but ignoring much of the detailed and intricate reasoning involved.\n", "smollm:1.7b": "Mobile multimedia slow to catch on", "deepseek-r1:1.5b": "<think>\nAlright, I've got this query where the user wants me to summarize a provided text concisely while preserving key ideas and details. They specified that the output should only be the summary in plain text without any explanations or formatting. \n\nFirst, I need to read through the text carefully to understand its main points. The text is about mobile phones and their use of multimedia features like cameras, color screens, and MMS (message sending services). It discusses how consumers are upgrading from older phones with basic features to newer ones that don't offer as many benefits.\n\nThe first sentence mentions that mobiles and cameras are popular, so I should note the increase in phone sales during Q3 2004. Then, it talks about consumer swapping of old phones for better versions, which led to a 26% surge in sold devices. \n\nNext, the text notes that while many people can use mobile phones, sending multimedia messages like pictures, sounds, and videos is still limited. It provides statistics: 36% of British camera phone users have never sent MMS before, up from 7% last year. But this trend isn't new to the UK; it's growing faster than expected. \n\nMr. Shailendra Jain highlights that even though the numbers are increasing for camera phones, the problem is that many users aren't equipped to send these messages. He mentions simplifying the interface and educating people on how to use their devices, which are key points here.\n\nAnother point is about interoperability of multimedia services across networks. The text states that mobile operators cap MMS traffic because second-gen networks have limited capacities, and this has led to users avoiding sending multimedia. Instead, they turn to other technologies like Wap-push. \n\nAdditionally, Celltick's broadcast system allows multimedia messages without overwhelming existing bandwidths, which is a positive development. This shows that even if you don't send MMS directly, using the broadcasting feature can make users use their phones for various content.\n\nLastly, operators are starting to utilize this broadcasting technology effectively, leading to increased usage of images and videos. The text ends with Yaron Toren suggesting that until now, MMS hasn't been getting through, which is a significant point.\n\nPutting it all together, the summary needs to capture the shift towards better mobile phones but also acknowledge the challenges in sending multimedia messages. I should make sure to include key statistics like the increase in mobile device sales and the percentage of users who haven't sent MMS yet. Also, highlighting the technical reasons behind this issue, such as limited network capacities and interoperability issues, will provide a comprehensive overview.\n\nI need to ensure that the summary is concise, avoiding unnecessary details while covering all main points. It should flow logically from the increase in mobile sales to the challenges with sending multimedia messages, leading into the solutions proposed by companies like Adamind and Celltick.\n</think>\n\nMobile phones are becoming more popular as users upgrade from older devices with basic features. Between July and September 2004, Gartner analyzed that approximately 167 million handsets were sold globally, with consumer mobiles seeing a 26% increase in sales during the third quarter of 2004. However, despite this, many users, particularly those using camera phones, are still struggling to send multimedia messages like pictures, sounds, or videos. A study by Continental Research found that 36% of British camera phone users had never sent an MMS (message sending service) before, up from 7% in 2003. Despite this trend growing faster than expected, many operators are still facing challenges with limited capacity for second-generation mobile networks and interoperability issues between multimedia services across networks.\n\nShailendra Jain, the head of MMS for Adamind, highlighted that despite advancements in user tech proficiency, there's a lack of understanding to send multimedia messages. He noted that users tend to be more comfortable with physical phone interfaces rather than digital ones, which requires educating consumers on how to use their devices effectively. Additionally, second-gen mobile networks have limited capacity, and this has led to users hesitating to send multimedia services, making it difficult for operators to capitalize on the potential gains.\n\nHowever, companies like Mblox, which operates messaging services, and Celltick, a company with a broadcast system, are exploring alternative solutions. While they don't use direct MMS, Celltick's broadcasting technology allows multimedia content to reach users without overwhelming network bandwidth. Operators like Hutch India are now using this technology more effectively, leading to increased usage of pictures, sounds, and images on their phones. These developments show that even with limitations in sending MMS directly, innovative solutions can be found to enhance user experience.", "tinyllama:1.1b": "In recent years, mobile phone users have been slow to embrace multimedia messages (MMS), with only one-third of consumers swapping old phone handsets for slimmer models capable of taking and sending pictures, sounds, and videos. However, the numbers of people not taking and sending multimedia messages are growing as operators struggle to send MMS at a steady rate due to limited capacities on second-generation networks. This has led to the development of new technologies like \"Wap-push,\" which can broadcast data across phone networks without overwhelming existing bandwidth, making it easier for operators to get multimedia to customers and boosting sales. Mobile operators need to start using this tool to reach their customers to overcome user apprehension about MMS messages.", "tinydolphin:1.1b": " The popularity of mobile phones with cameras and color screens has increased, but only by 26% in the third quarter of 2004 compared to 7.5 million in 2003. Despite this growth, there are still many users who haven't taken the opportunity to send multimedia messages (MMS). These individuals may not be familiar with how to use their handsets and the networks that support MMS messages. Therefore, operators need to educate these customers on how to send multimedia messages and make it more appealing for them to do so.", "phi:2.7b": " Mobile phones with cameras and screens are popular, but people have not been sending pictures, audio, or video messages. Only some camera phone users send them, which operators hope to increase by simplifying the interface. The problem is that some people don't know how to use their handsets, and there are technical issues with interoperability across networks. Operators also limit the number of multimedia messages to avoid overwhelming the system. However, some firms like Celltick have found ways to broadcast data quickly, which may help operators get people used to using their phones for all types of content.\n", "orca-mini:3b": " Mobile phones with cameras and color screens are popular, but few people are sending and receiving multimedia messages despite the growing number of camera phone users. Research shows that many people are technophobic and lack technical knowledge to send multimedia messages. Operators face challenges in making messaging services interoperable across networks and phones. Wap-push is one technology being used to get multimedia to customers, but it requires significant bandwidth. Other systems like Celltick's broadcast technology can reach customers faster. However, not all operators use these technologies. Many people still prefer to send text messages. Operators need to find ways to make messaging services more accessible and user-friendly for customers.", "hermes3:3b": "Mobile phones taking photos & videos less common; consumers swap old devices but don't send multimedia messages. Reasons include user apprehension due to technical issues and operators capping MMS capacity to prevent system overloading.", "stablelm-zephyr:3b": "Mobile phones with cameras and screens are popular, but people aren't using mobile multimedia as much as expected. Many people don't know how to send multimedia messages or fear technical issues. Operators limit the number of messages to prevent overload, leading them to use other technologies like Wap-push. However, a company called Celltick helps mobile networks display multimedia content without overwhelming bandwidth, and this technology is useful for operators to reach their customers.", "chatgpt-4o-latest": "Mobile phones with cameras and color screens are popular, driving a 26% increase in handset sales in Q3 2004. However, despite the rise in camera phone ownership, few users send multimedia messages (MMS). In the UK, 36% of camera phone users have never sent an MMS, up from 7% in 2003, due to lack of knowledge and complex interfaces. Many users are technophobic or unsure if messages will work across networks. Additionally, mobile operators cap MMS traffic to avoid overwhelming second-generation networks, limiting its adoption. Some operators are turning to alternative technologies like Wap-push and broadcast systems, such as Celltick’s service used by Hutch India, which familiarizes users with multimedia content. Until operators simplify MMS and improve delivery methods, multimedia messaging will struggle to gain traction.", "stablelm2:1.6b": "Mobile multimedia sales are slow due to consumers upgrading old phones and lack of user education on sending multimedia messages. UK camera phone users have not sent MMS in 20% of cases despite the growth of camera phones from 7 million to 7.5 million. Mobile operators limit message circulation as there are finite capacities for data traffic, leading to operators using Wap-push technology or alternative methods such as Celltick's broadcast system that delivers multimedia content faster than other systems without overwhelming existing bandwidth. Until these solutions become more widely adopted by operators, multimedia messages will remain a message not getting through.", "granite3.1-dense:2b": "Despite the surge in mobile phone sales due to camera capabilities, consumers are slow to adopt and use multimedia messaging services (MMS). In 2004, over 167 million handsets were sold globally, marking a significant increase but still weaker than other quarters. However, only 36% of British camera phone users had ever sent an MMS, up from 7% in 2003. This reluctance stems from technophobia and a lack of understanding of how to send multimedia messages, as 29% of people questioned by Continental Research identified themselves as such. Additionally, interoperability issues between networks and phones create user apprehension about sending MMS across different devices.\n\nMobile operators face challenges in overcoming these barriers. They must simplify the interface for sending multimedia messages and address network constraints due to finite data traffic capacities on second-generation networks. To tackle this, some operators are turning to alternative technologies like Wap-push. Israeli firm Celltick's cellular broadcast system has shown promise in efficiently delivering multimedia content without overwhelming existing bandwidth, with Hutch India using it to encourage subscribers to engage more frequently with their services. As a result, 40% of Hutch Alive subscribers access additional images, sounds, and videos from the operator through this method. The text concludes that operators must harness these tools to effectively reach their customers and promote multimedia usage on mobile devices.", "reference": "Getting mobile phone users to send multimedia messages is really important for operators keen to squeeze more cash out of their customers and offset the cost of subsidising the handsets people are buying.The problem they face, said Shailendra Jain, head of MMS firm Adamind, is educating people in how to send the multimedia messages using their funky handsets.Andrew Bud, executive chairman of messaging firm Mblox, said mobile phone operators cap the number of messages that can be circulating at any one time for fear of overwhelming the system.The fact that multimedia services are not interoperable across networks and phones only adds to people's reluctance to start sending them, said Mr Jain.Figures gathered by Continental Research shows that 36% of British camera phone users have never sent a multimedia message (MMS), up from 7% in 2003.Until then, multimedia will be a message that is not getting through.Research bears out the suspicion that people are not sending multimedia messages because they do not know how to.\"The rate we can send MMS into the mobile network is fairly constant,\" he said.While not multimedia messaging, such a system gets people used to seeing their phones as a device that can handle all different types of content.he said.But when networks do find a good way to get multimedia to their customers, the results can be dramatic.No-one wants to take the risk of swamping these relatively narrow channels so the number of MMS messages is capped, said Mr Bud."}