{"raw_text": "Broadband fuels online expression\n \n Fast web access is encouraging more people to express themselves online, research suggests.\n \n A quarter of broadband users in Britain regularly upload content and have personal sites, according to a report by UK think-tank Demos. It said that having an always-on, fast connection is changing the way people use the internet. More than five million households in the UK have broadband and that number is growing fast.\n \n The Demos report looked at the impact of broadband on people's net habits. It found that more than half of those with broadband logged on to the web before breakfast. One in five even admitted to getting up in the middle of the night to browse the web.\n \n More significantly, argues the report, broadband is encouraging people to take a more active role online. It found that one in five post something on the net everyday, ranging from comments or opinions on sites to uploading photographs. \"Broadband is putting the 'me' in media as it shifts power from institutions and into the hands of the individual,\" said John Craig, co-author of the Demos report. \"From self-diagnosis to online education, broadband creates social innovation that moves the debate beyond simple questions of access and speed.\" The Demos report, entitled Broadband Britain: The End Of Asymmetry?, was commissioned by net provider AOL. \"Broadband is moving the perception of the internet as a piece of technology to an integral part of home life in the UK,\" said Karen Thomson, Chief Executive of AOL UK, \"with many people spending time on their computers as automatically as they might switch on the television or radio.\" According to analysts Nielsen//NetRatings, more than 50% of the 22.8 million UK net users regularly accessing the web from home each month are logging on at high speed They spend twice as long online than people on dial-up connections, viewing an average of 1,444 pages per month. The popularity of fast net access is growing, partly fuelled by fierce competition over prices and services.\n", "llama3.2:1b": "Broadband fuels online expression by making it easy to upload content and have personal sites, with over a quarter of broadband users in Britain accessing the internet regularly due to fast web access. This shift has increased the frequency of on-line activities such as posting and browsing, leading to changes in net habits and the democratization of media.", "llama3.2:3b": "A quarter of broadband users in Britain regularly upload content and have personal sites. More than half log on to the web before breakfast, and one in five do so at night. Broadband encourages people to take a more active role online, with one in five posting something daily. Fast net access is changing how people use the internet and making it an integral part of home life.", "gemma2:2b": "Broadband internet access is increasing online expression, with many users regularly uploading content and engaging in active online participation.  Research shows that broadband use has become a significant part of daily life in the UK, where people are spending more time online than those on dial-up connections. This shift in internet usage has empowered individuals to express themselves and participate in various activities such as self-diagnosis and online education. \n", "qwen2.5:0.5b": "Broadband has transformed how we express ourselves online through increasing the use of personal websites and social media content. More than half of broadband users log on to the internet before breakfast, uploading comments or opinions. Fast broadband connections encourage more people to take a more active role in online activities such as blogging, photography and self-diagnosis.", "qwen2.5:1.5b": "Broadband usage encourages more internet expression among Britons, with over a quarter regularly uploading content; broadband transforms online habits from passive consumption to active participation; it increases social innovation by empowering individuals over institutions; high-speed connections are becoming an integral part of home life, leading to increased internet use and longer session times.", "qwen2.5:3b": "Broadband encourages more frequent online expression with one in five users posting daily. In Britain, a quarter of broadband users regularly upload content or have personal sites. Usage patterns show that nearly half use the internet before breakfast, including during the night. The Demos report suggests broadband empowers individuals by shifting media power from institutions to individuals. It enables new forms of social innovation such as self-diagnosis and online education. Broadband usage among UK net users is growing due to competition over prices and services; these users spend significantly more time on the internet, viewing an average of 1,444 pages per month.", "opencoder:1.5b": "Broadband fuels online expression. Fast web access is encouraging more people to express themselves online, research suggests. A quarter of broadband users in Britain regularly upload content and have personal sites, according to a report by UK think-tank Demos. More than five million households in the UK have broadband and that number is growing fast. Broadband is encouraging people to take a more active role online. Post something on the net everyday, ranging from comments or opinions on sites to uploading photographs. Broadband is putting the 'me' in media as it shifts power from institutions and into the hands of the individual.\n", "smollm:1.7b": "Broadband fuels online expression", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text about broadband and its impact on internet usage in the UK. Let me read through it carefully.\n\nThe first sentence says that fast web access is encouraging more people to express themselves online and a report from Demos in Britain found half of users upload content regularly with personal sites. So I should mention that 75% use online services at least once a day, have personal accounts, and over five million households have broadband.\n\nNext, it talks about how more than 5 million UK users have broadband and this is growing fast. They looked at net habits, and found that half of them logged in to the web before breakfast, one in five even got up late for browsing. It also mentions that more people are now taking an active role online through comments, photos, etc.\n\nThe report argues that broadband puts \"me\" online, shifting power from institutions to individuals. They mentioned something about self-diagnosis and online education, and stated that net access is moving the internet's perception into home life with regular users spending twice as long online as on dial-up, reading 1,444 pages a month.\n\nAlso, there was competition for fast net access due to price and services, which is why fast access is becoming more popular. The report is commissioned by AOL UK and has seen higher than 50% of net users using the internet at home monthly with high-speed access.\n\nI need to make sure the summary includes key points: Broadband fueling online expression, increased use cases, net habits like early morning browsing, active roles online, perspective shift from institutions, social innovation, moving internet into home life, faster usage, and competitive reasons.\n\nI should keep it concise without explanations or formatting. Just plain text.\n</think>\n\nBroadband is driving more people to engage with the internet online, as evidenced by a study by the UK thinktank Demos, which found that 75% of broadband users regularly upload content and have personal accounts. The report highlighted that over five million UK households use broadband, and faster net access is shifting power from institutions to individual users. More than half of these users log in before breakfast or even get up late for browsing. The study argues that broadband encourages a more active role online, such as taking notes, sharing comments, or uploading photos, which promotes social innovation. It also notes that 50% of UK net users spend twice as much online and read 1,444 pages monthly due to fast access. Additionally, faster internet is gaining popularity because of fierce competition for services.", "tinyllama:1.1b": "The research suggests that broadband has significantly transformed online expression for British people. More than half (28%) of those with broadband regularly browse the web before breakfast, with one in five logging on every day to share opinions or take part in online activity. The report argues that this shift towards a more active and informed online presence is driven by broadband access, which encourages people to upload content, post comments or even ring up for advice. According to analysts, around 52% of UK net users are logging on at high speed, spending twice as much time online as those using slower connections. The popularity of fast internet is driven by fierce competition over prices and services, with many people spending more time online than watching TV or listening to the radio.", "tinydolphin:1.1b": " The report by UK think tank Demos suggests that broadband fuels online expression with more than half of users regularly accessing the web before breakfast, one in five even admitting to getting up in the middle of the night to browse the net, while one in five posts something on the net everyday. These habits are encouraging people to express themselves online and giving them a voice, according to the research. The report's findings were published by Demos in their report titled \"Broadband Britain: The End of Asymmetry?\". \n\nBroadband has transformed how people use the internet, making it an integral part of daily life for many individuals in the UK. The report argues that broadband is encouraging people to take a more active role online by allowing them to express themselves and learn new skills. This shift from institutions to individual power is a significant change in the way people access information and communicate with each other, making broadband Britain's most influential internet service. AOL UK, which owns AOL in the UK, has commenced research on how the internet is transforming lives, by connecting homes to the internet at high speed. According to analyst Nielsen/NetRatings, more than 50% of UK net users are accessing the web from home with high-speed connections, spending twice as long online than those using dial-up connections. This rapid increase in internet usage is fueling fierce competition for price and services among service providers, leading to increased investment in broadband infrastructure.", "phi:2.7b": " More than five million households in the UK have broadband internet connection and it is changing how people use the web, including encouraging more individuals to express themselves online. One quarter of British broadband users regularly upload content and have personal sites, while one in five even go on the internet in the middle of the night. This is leading to a shift in power from institutions to the individual, with more people taking an active role online through activities such as posting comments or uploading photographs. Broadband Britain: The End Of Asymmetry? by UK think-tank Demos found that broadband users spend twice as long on the internet compared to dial-up users.\n", "orca-mini:3b": " The text reports that broadband is encouraging more people to express themselves online and has personal sites, with one in five posting something on the internet every day. Broadband creates social innovation and is moving the debate beyond simple questions of access and speed, according to a report by Demos. A quarter of broadband users in Britain regularly upload content and have personal sites, while more than half of those with broadband log on to the web before breakfast. The popularity of fast net access is growing, partly fueled by fierce competition over prices and services.", "hermes3:3b": "Broadband encourages online self-expression; up to 25% of UK broadband users regularly upload content online.", "stablelm-zephyr:3b": "Broadband is encouraging increased internet usage, with 25% of UK broadband users regularly uploading content or having personal sites. Fast connections are changing the way people use the internet, with more than half logging on before breakfast and one in five getting online at night. Broadband is also leading to greater individual involvement online, with many people posting daily on various platforms. This shift in power creates social innovation and moves the debate beyond access and speed concerns.", "chatgpt-4o-latest": "Broadband internet is encouraging more online expression, with a quarter of UK broadband users regularly uploading content and maintaining personal sites, according to a Demos report. The study found that broadband changes internet habits, with over half of users logging on before breakfast and one in five browsing at night. Broadband enables greater user participation, with one in five posting content daily. The report highlights broadband’s role in shifting media power to individuals, fostering social innovation, and integrating the internet into daily life. Over 50% of UK home internet users access the web at high speed, spending twice as long online as dial-up users. The growing popularity of broadband is driven by competition over prices and services.", "stablelm2:1.6b": "Broadband fuels online expression, with a quarter of Britons regularly uploading content due to faster internet speeds. The UK think tank Demos found that over half the people with broadband used the web before breakfast, and more than five million households have broadband. Broadband is changing how people use the internet, encouraging them to take an active role in online activities such..\nTo upload photographs or post something on the net daily. The report also suggests that broadband is shifting power from institutions into the hands of individuals and creating social innovation. According to analysts, more than 80% of UK net users access the web at high speed regularly.", "granite3.1-dense:2b": "Broadband usage in the UK is increasing, with more than half of broadband households logging on before breakfast and one in five waking during the night for internet browsing. The Demos report reveals that 25% of broadband users frequently create and share online content, such as comments or photos, transforming the internet from a passive resource to an active platform for individual expression. This shift empowers individuals to engage in various online activities, including self-diagnosis and education, beyond simple access and speed concerns. The report, commissioned by AOL, underscores broadband's integration into daily life, with users spending twice as much time online at high speeds compared to dial-up connections. This growth is driven by price competition, and analyst Nielsen//NetRatings confirms that over 50% of UK internet users log on from home for extended periods, viewing an average of 1,444 pages per month.", "reference": "More than five million households in the UK have broadband and that number is growing fast.The Demos report looked at the impact of broadband on people's net habits.More significantly, argues the report, broadband is encouraging people to take a more active role online.The Demos report, entitled Broadband Britain: The End Of Asymmetry?, was commissioned by net provider AOL.A quarter of broadband users in Britain regularly upload content and have personal sites, according to a report by UK think-tank Demos.Fast web access is encouraging more people to express themselves online, research suggests."}