{"raw_text": "New consoles promise big problems\n \n Making games for future consoles will require more graphic artists and more money, an industry conference has been told.\n \n Sony, Microsoft and Nintendo will debut their new consoles at the annual E3 games Expo in Los Angeles in May. These so-called \"next generation\" machines will be faster than current consoles, and capable of displaying much higher-quality visuals. For gamers, this should make for better, more immersive games. In a pre-recorded video slot during Microsoft's keynote address at the Game Developers Conference, held last week in San Francisco, famed director James Cameron revealed he is making a game in tandem with his next film - believed to be Battle Angel Alita. The game's visual quality would be \"like a lucid dream,\" said Mr Cameron. But numerous speakers warned that creating such graphics will require more artists, and so next generation console games will be much more expensive to develop. The first new console, Microsoft's Xbox 2, is not expected to reach the shops until the end of 2005. Games typically take at least 18 months to create, however, so developers are grappling with the hardware today.\n \n According to Robert Walsh, head of Brisbane-based game developer Krome Studios, next generation games will cost between $10-25m to make, with teams averaging 80 staff in size taking two years to complete a title. Such sums mean it will be difficult for anyone to start a new game studio, said Mr Walsh. \"If you're a start-up, I doubt that a publisher is going to walk in and give you a cheque for $10m, however good you are,\" he said. Mr Walsh suggested that new studios should make games for mobile phones and handheld consoles like the Sony PSP and the Nintendo DS, since they are cheaper and easier to create than console games.\n \n One developer bucking the trend towards big art teams is Will Wright, the creator of the best-selling The Sims games. The founder of California's Maxis studio surprised the conference with a world exclusive preview of his next game, Spore. Spore will allow players to experiment with the evolution of digital creatures. Starting with an amoeba-sized organism, the player will guide the physical development of their creature by selecting how its limbs, jaws and other body parts evolve.\n \n Eventually the creature will become capable of establishing cities, trading and fighting, and even building space ships. Advanced players will visit the home planets of creatures created by other Spore players. These worlds will be automatically swapped across the Internet. Mr Wright said that enabling players to devise and share their creatures would make them care more about the game. \"I don't want to put the player in the role of Luke Skywalker or Frodo Baggins - I want them to be George Lucas or Dr Seuss,\" explained Mr Wright. Few games have hinted at the scope of Spore, but Mr Wright explained that he has nevertheless kept his development team small by hiring expert programmers. Instead of employing lots of artists to create 3D models of the digital creatures, Spore generates and displays the creatures according to rules devised by the programmers. \"The thing I am coming away with [from the conference] is that next generation content is going to be really expensive, and creating it will drive the smaller players out of the market,\" said Mr Wright. \"I'd like to offer an alternative to that.\"\n \n New development tools will be another important aid in making next generation games, and dozens of companies demonstrated their latest products at the conference.\n \n Oxford-based Natural Motion launched Endorphin v2.0, which enables artists to direct a 3D 'virtual actor'. The actor is realistically modelled according to the laws of physics. Endorphin simulates how the actor falls down stairs, for instance, or crumples up after a gunshot. Artists can blend together these visual sequences, and include the results in their games. The process is much quicker than having an artist animate each movement by hand, and so lessens the need for larger art teams. Another British company aiming to reduce the workload of artists is Manchester start-up Genemation. Its latest tool, GenCrowd, enables artists to create unique, photo-realistic human faces for games involving lots of people. GenCrowd works by blending together elements of an in-built supply of stock faces of differing ages and ethnicities. The software can create up to 2,000 new heads an hour.\n \n One area not yet dominated by graphical blockbusters is mobile phone games. Even the latest phones are not as powerful as the consoles of a decade ago, so smaller teams of half a dozen people can still create complete games for the devices.\n \n The Game Developers Conference included a special two-day summit dedicated to creating mobile games. A niche attraction for a few dozen conference attendees when it began five years ago, GDC's Mobile summit this year drew several hundred delegates. Mobile games are a fast-growing sector because newer phones have better graphics and sound, and are thus more suitable for playing games. Furthermore, the adoption of mobile phones continues to spread across the world. It's predicted that by 2006 two billion people will own a mobile phone. The growing importance of mobile gaming was reflected by a keynote given by John Batter, general manager at EA Mobile. EA Mobile is a division of Electronic Arts, the biggest games publisher. Until recently Electronic Arts had been dismissive of games for phones. \"The last time you checked, EA wasn't in this business,\" Mr Batter admitted. But he said EA now planned on dominating the market by releasing mobile versions of its most popular franchises. EA plans to release up to 20 mobile games over the next 12 months. The first will be a version of its Need for Speed racing game, created by EA Mobile's 30-person development team. Mr Batter predicted that by 2006, mobile phones would be capable of running games of comparable quality to those on Sony's upcoming PSP handheld console.\n \n Owain Bennallack is the editor of Develop magazine.\n", "llama3.2:1b": "New consoles promise big problems in game development due to increased graphic requirements and higher costs for new teams.\n\nMicrosoft plans to release Xbox 2 by end of 2005, with games taking at least 18 months to create.\n\nGames will cost between $10-25 million to make, requiring teams of around 80 staff members with two years to complete a title.\n\nDevelopers are struggling to balance hardware capabilities and costs in game development.\n\nNew studios should consider creating mobile phone or handheld console games instead of high-end consoles.\n\nWill Wright's upcoming game Spore allows players to create digital creatures through a world-building system, reducing the need for expensive art teams.\n\nAdvanced tools will aid next generation game development, including pre-recorded video slot presentations and new tool demonstrations by dozens of companies.", "llama3.2:3b": "New consoles will require more graphic artists and money to develop, with costs ranging from $10-25m for a game. This may make it difficult for new studios to start, but some developers are finding ways to reduce costs, such as hiring smaller teams or using new development tools like Endorphin v2.0 and GenCrowd. The next generation of games will also be more expensive to develop due to their increased graphics quality.", "gemma2:2b": "Next-generation consoles will require more artists and money to create high-quality visuals. Game development costs are projected to rise significantly, limiting the number of studios that can start new projects.  While large teams remain essential for producing ambitious games, innovative approaches like Spore by Will Wright allow for smaller teams to achieve impressive results through programmer-designed simulation. New development tools such as Endorphin and GenCrowd aim to reduce the workload on artists by enabling more efficient creation of realistic animations and facial features. Mobile game development is experiencing rapid growth, with mobile phone gaming becoming a viable alternative for smaller studios.  Electronic Arts is focusing on developing high-quality mobile games based on popular franchises, aiming to dominate the market in the coming years. \n", "qwen2.5:0.5b": "New consoles promise big problems for gaming developers. Microsoft and Sony are expected to debut new consoles next year that will feature faster graphics and higher-quality visuals than current devices, potentially making games more immersive and expensive to develop. According to James Cameron's video slot during Microsoft's keynote address at the Game Developers Conference in San Francisco, he revealed a game called \"Battle Angel Alita\" which is expected to cost between $10-25m to make. For developers who are starting their own studios, creating games for mobile phones and handheld consoles like the Sony PSP or Nintendo DS would be cheaper and easier than traditional console gaming. Developers can also use tools such as Natural Motion's Endorphin v2.0 to create realistic 3D 'virtual actors' that blend together visual sequences to enhance gameplay.", "qwen2.5:1.5b": "New consoles promising big problems: More graphic artists and money required for next-gen gaming; Microsoft Xbox 2 delayed until Q4 2005, $10-25m cost per game studio challenging start-ups; games development tools crucial; mobile phone market growing rapidly as phones become more powerful.", "qwen2.5:3b": "New consoles promise big problems as they will require more graphic artists and significantly more money for development, according to industry conferences. James Cameron’s next film game promises high visual quality but developers warn it will be very costly. Microsoft's Xbox 2 is expected in late 2005, taking at least two years to develop with costs estimated between $10-25 million per project. Krome Studios’ Robert Walsh suggests smaller studios should focus on cheaper platforms like mobile phones and handheld consoles instead. Developer Will Wright of Spore uses new tools to reduce artist workload without compromising visual quality. Meanwhile, the Mobile Games Summit at GDC has grown in importance as it draws over 400 delegates focusing on creating games for smartphones, which are becoming more powerful with improved graphics and sound. EA Mobile’s John Batter sees potential in mobile gaming, predicting their franchises will be adapted into mobile formats by 2006.", "opencoder:1.5b": "The text provided is quite comprehensive and contains numerous key terms and ideas about new consoles, making games for future consoles, graphic artists, mobile phones, mobile games, and a new development tool GenCrowd.\n\nHowever, to summarize it would involve removing some details or focusing on the main points. Here's an attempt:\n\n\"The conference has been told that Microsoft and Nintendo will debut their new consoles at the annual E3 games Expo in Los Angeles in May.\"\n\n\"This implies that the conference is highlighting the upcoming consoles for Microsoft and Nintendo, which could offer players a glimpse into what future gaming technologies might look like.\"\n", "smollm:1.7b": "Develop magazine is a leading publication in the game development industry. It provides news, reviews, and insights into the latest developments in the field.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving key ideas and details. Let me read through it first.\n\nSo, the main points are:\n\n1. New consoles promise big problems but require more artists and money for development, as Sony, Microsoft, and Nintendo will be showing their new consoles at E3 in May.\n2. Microsoft's Xbox 2 is expected to arrive by end-2005, with games taking longer due to hardware constraints.\n3. James Cameron revealed his next Battle Angel game would look like a lucid dream, which isn't great for graphics but suggests high-quality visuals are needed.\n4. Krome Studios' Xbox 360 project will cost around $10-25 million and take two years with teams of 80 people.\n5. Will Wright created Spore, an RPG where creatures evolve into cities, using physics-based modeling rather than traditional art.\n6. Mobile games are growing because newer phones have better graphics and sound; EA plans to release mobile games soon.\n7. The conference had a mobile game summit focusing on creating games for mobile devices.\n\nI need to keep only the summary without any explanations or formatting. Let me structure it clearly, making sure all key points are included but in a concise way.\n\nFirst sentence: New consoles with big problems—more artists needed and more money. Consoles expected by end-2005, games take longer due to hardware constraints.\n\nSecond part: James Cameron's game looks good visually—needs more artists, so graphics will be expensive.\n\nThird part: Krome's project costs between $10-25m for 80 staff in two years. Will Wright uses physics-based modeling for Spore.\n\nFourth paragraph: Mobile games are growing with phones having better graphics; EA plans mobile games soon.\n\nFifth part: Editor of Develop magazine wrote about mobile games, mentioning the new consoles and upcoming games.\n\nI should keep it all together without any extra fluff.\n</think>\n\nNew consoles are expected to bring big challenges requiring more artists and money for development. Microsoft's Xbox 2 is set to arrive by end-2005, while games will take longer due to hardware constraints. James Cameron hinted at a visually stunning Spore game, emphasizing the need for extensive graphics work. Krome Studios plans a project costing between $10-25m with teams of 80 staff taking two years. Will Wright's Spore RPG uses physics-based modeling rather than traditional art. Mobile games are growing due to newer phones' improved graphics and sound; EA plans mobile games soon. Will O'Brien, editor of Develop magazine, highlighted the topic.", "tinyllama:1.1b": "In his video slot during Microsoft's keynote address at the GameDevelopers Conference, famous director James Cameron revealed that he is making a game in tandem with his next film - believed to be Battle Angel Alita. The game's visual quality will be like a \"lucid dream\" (described as an \"immersive experience\") and it requires more artists, as game developers are grappling with the hardware today. New console games will cost between $10-25m to make, with teams averaging 80 staff in size taking two years to complete a title. Next generation console games are expected to cost even more, since they are expensive to create. One of these companies, Oxford-based Natural Motion, has developed Endorphin v2.0, which enables artists to direct virtual actors according to laws of physics, while another company, Manchester-based GeneMaticion, is developing unique, photo-realistic human faces for games involving lots of people. Mobile phone games are also on the rise, with up to 20 mobile games planned by Electronic Arts in the next 12 months.", "tinydolphin:1.1b": " In summary, the consoles of today's video game industry will require more graphic artists and significantly more money in order to produce high-quality visuals. With major announcements like the next-generation consoles, the industry will be focused on creating more immersive games with faster development times. As for mobile gaming, it is predicted that by 2006 two billion people worldwide will own mobile phones, and it's EA Mobile's vision to dominate the market by releasing popular franchises on these devices.", "phi:2.7b": " The annual Game Developers Conference (GDC) highlights key issues in creating next generation consoles and games. New consoles will require more graphic artists and money, which means that game development will be expensive. However, smaller teams can still create mobile phone games because newer phones have better graphics and sound. EA Mobile plans on dominating the market by releasing mobile versions of its most popular franchises.\n", "orca-mini:3b": " New consoles promise big problems for game development, say industry experts. Games for next generation consoles will require more graphic artists and more money, they warn. Sony, Microsoft and Nintendo will debut their new consoles at the annual E3 games Expo in Los Angeles in May. These so-called \"next generation\" machines will be faster than current consoles, and capable of displaying much higher-quality visuals. However, creating such graphics will require more artists, and so next generation console games will be much more expensive to develop. The first new console, Microsoft's Xbox 2, is not expected to reach the shops until the end of 2005. Games typically take at least 18 months to create, however, so developers are grappling with the hardware today. According to Robert Walsh, head of Brisbane-based game developer Krome Studios, next generation games will cost between $10-25m to make, with teams averaging 80 staff in size taking two years to complete a title. These sums mean it will be difficult for anyone to start a new game studio, said Mr Walsh. \"If you're a start-up, I doubt that a publisher is going to walk in and give you a cheque for $10m, however good you are,\" he said. Mr Walsh suggested that new studios should make games for mobile phones and handheld consoles like the Sony PSP and the Nintendo DS, since they are cheaper and easier to create than console games. One developer bucking the trend towards big art teams is Will Wright, the creator of the best-selling The Sims games. The founder of California's Maxis studio surprised the conference with a world exclusive preview of his next game, Spore. Spore will allow players to experiment with the evolution of digital creatures. Starting with an amoeba-sized organism, the player will guide the physical development of their creature by selecting how its limbs, jaws and other body parts evolve. According to Robert Walsh, publisher Electronic Arts has already committed to publishing Spore, which is expected to be released in 2003. Will Wright explained that enabling players to devise and share their creatures would make them care more about the game. \"I don't want to put the player in the role of Luke Skywalker or Frodo Baggins - I want them to be George Lucas or Dr Seuss,\" said Mr Wright. Few games have hinted at the scope of Spore, but Mr Wright explained that he has nevertheless kept his development team small by hiring expert programmers. Instead of employing lots of artists to create 3D models of the digital creatures, Spore generates and displays the creatures according to rules devised by the programmers.", "hermes3:3b": "New consoles expected to require more graphic artists and increased funding for game development.", "stablelm-zephyr:3b": "The introduction of new consoles from Sony, Microsoft and Nintendo will require more graphic artists and larger budgets for game development, according to industry experts. Famed director James Cameron revealed he's creating a game in tandem with his next film, believed to be Battle Angel Alita, which he described as having visual quality \"like a lucid dream.\" However, developing such graphics will necessitate larger art teams and more expensive development costs for next generation console games. In contrast, mobile phone games are currently an area where smaller teams can create complete games due to the limitations of current technology.", "chatgpt-4o-latest": "The next generation of gaming consoles from Sony, Microsoft, and Nintendo will offer faster performance and higher-quality visuals, but developing games for them will require larger teams and significantly higher costs. Industry experts predict that next-gen games will cost between $10-25 million to develop, making it difficult for new studios to enter the market. Some developers, like Will Wright with his game Spore, are exploring alternative approaches by using advanced programming to reduce reliance on large art teams. New development tools, such as Natural Motion’s Endorphin and Genemation’s GenCrowd, aim to streamline game creation and reduce costs. Meanwhile, mobile gaming is rapidly growing, with companies like EA Mobile investing heavily in the sector, predicting that by 2006, mobile games will rival the quality of handheld consoles.", "stablelm2:1.6b": "New consoles promise big problems for game development as they require more graphic artists and money than current consoles. E3 games expo in Los Angeles in May will debut next generation machines that are faster and capable of displaying higher quality visuals. Developing these games will make them much more expensive, pushing smaller start-up studios out of the market. However, game developers like Will Wright are employing expert programmers instead of lots of artists to create digital creatures. New development tools such as Endorphin v2.0 and GenCrowd help lessen the need for larger art teams. Mobile phone games are growing due to better graphics and sound on newer phones and expanding worldwide adoption. Electronic Arts plans to dominate the market by releasing mobile versions of its popular franchises, predicting that by 2060, phones will be capable of running games comparable in quality to those on console devices.", "granite3.1-dense:2b": "The annual E3 games Expo in Los Angeles will see the debuts of new \"next-generation\" consoles from Sony, Microsoft, and Nintendo. These consoles promise superior performance and higher visual quality, potentially enhancing gaming experiences with more immersive graphics. However, creating such games will be significantly more expensive due to increased demand for skilled graphic artists and the need for advanced technologies.\n\nMicrosoft's Xbox 2 is expected to launch in late 2005, but developers are already facing challenges as they begin preparing for these consoles today. According to Robert Walsh of Krome Studios, developing next-generation games could cost between $10-25 million and require teams of around 80 people working for about two years per title. This financial burden makes it difficult for startups to enter the market, as they struggle to secure funding for such large projects.\n\nWill Wright, creator of The Sims, presented Spore, a game that allows players to design and evolve digital creatures, which will eventually establish civilizations and spacecraft. Despite its ambitious scope, Wright's team remains small due to the use of expert programmers for generating in-game creature models rather than employing numerous artists for 3D animations.\n\nTo address the high costs and resource requirements, developers are exploring new tools that reduce artist workload. Oxford-based Natural Motion introduced Endorphin v2.0, enabling artists to direct realistic physics-based virtual actors, while Manchester's Genemation showcased GenCrowd, a tool for generating photo-realistic human faces in batches of up to 2,000 per hour.\n\nWhile next-generation consoles dominate the market, mobile gaming presents an alternative avenue for game development due to its lower resource requirements and growing global user base. The Game Developers Conference's Mobile summit has observed a shift in industry sentiment towards mobile games, with EA Mobile now planning to release up to 20 mobile versions of popular Electronic Arts franchises by 2006, anticipating similar graphical capabilities as Sony's PSP handheld console.", "reference": "Mr Walsh suggested that new studios should make games for mobile phones and handheld consoles like the Sony PSP and the Nintendo DS, since they are cheaper and easier to create than console games.EA plans to release up to 20 mobile games over the next 12 months.Mr Batter predicted that by 2006, mobile phones would be capable of running games of comparable quality to those on Sony's upcoming PSP handheld console.Mr Wright said that enabling players to devise and share their creatures would make them care more about the game.The Game Developers Conference included a special two-day summit dedicated to creating mobile games.Mobile games are a fast-growing sector because newer phones have better graphics and sound, and are thus more suitable for playing games.EA Mobile is a division of Electronic Arts, the biggest games publisher.According to Robert Walsh, head of Brisbane-based game developer Krome Studios, next generation games will cost between $10-25m to make, with teams averaging 80 staff in size taking two years to complete a title.But numerous speakers warned that creating such graphics will require more artists, and so next generation console games will be much more expensive to develop.Even the latest phones are not as powerful as the consoles of a decade ago, so smaller teams of half a dozen people can still create complete games for the devices.Making games for future consoles will require more graphic artists and more money, an industry conference has been told.Such sums mean it will be difficult for anyone to start a new game studio, said Mr Walsh.Its latest tool, GenCrowd, enables artists to create unique, photo-realistic human faces for games involving lots of people.The founder of California's Maxis studio surprised the conference with a world exclusive preview of his next game, Spore.Few games have hinted at the scope of Spore, but Mr Wright explained that he has nevertheless kept his development team small by hiring expert programmers.New development tools will be another important aid in making next generation games, and dozens of companies demonstrated their latest products at the conference.\"The thing I am coming away with [from the conference] is that next generation content is going to be really expensive, and creating it will drive the smaller players out of the market,\" said Mr Wright.The first will be a version of its Need for Speed racing game, created by EA Mobile's 30-person development team.In a pre-recorded video slot during Microsoft's keynote address at the Game Developers Conference, held last week in San Francisco, famed director James Cameron revealed he is making a game in tandem with his next film - believed to be Battle Angel Alita.The game's visual quality would be \"like a lucid dream,\" said Mr Cameron.One area not yet dominated by graphical blockbusters is mobile phone games."}