{"raw_text": "Labour plans maternity pay rise\n \n Maternity pay for new mothers is to rise by £1,400 as part of new proposals announced by the Trade and Industry Secretary Patricia Hewitt.\n \n It would mean paid leave would be increased to nine months by 2007, Ms Hewitt told GMTV's Sunday programme. Other plans include letting maternity pay be given to fathers and extending rights to parents of older children. The Tories dismissed the maternity pay plan as \"desperate\", while the Liberal Democrats said it was misdirected.\n \n Ms Hewitt said: \"We have already doubled the length of maternity pay, it was 13 weeks when we were elected, we have already taken it up to 26 weeks. \"We are going to extend the pay to nine months by 2007 and the aim is to get it right up to the full 12 months by the end of the next Parliament.\" She said new mothers were already entitled to 12 months leave, but that many women could not take it as only six of those months were paid. \"We have made a firm commitment. We will definitely extend the maternity pay, from the six months where it now is to nine months, that's the extra £1,400.\" She said ministers would consult on other proposals that could see fathers being allowed to take some of their partner's maternity pay or leave period, or extending the rights of flexible working to carers or parents of older children. The Shadow Secretary of State for the Family, Theresa May, said: \"These plans were announced by Gordon Brown in his pre-budget review in December and Tony Blair is now recycling it in his desperate bid to win back women voters.\"\n \n She said the Conservatives would announce their proposals closer to the General Election. Liberal Democrat spokeswoman for women Sandra Gidley said: \"While mothers would welcome any extra maternity pay the Liberal Democrats feel this money is being misdirected.\" She said her party would boost maternity pay in the first six months to allow more women to stay at home in that time.\n \n Ms Hewitt also stressed the plans would be paid for by taxpayers, not employers. But David Frost, director general of the British Chambers of Commerce, warned that many small firms could be \"crippled\" by the move. \"While the majority of any salary costs may be covered by the government's statutory pay, recruitment costs, advertising costs, retraining costs and the strain on the company will not be,\" he said. Further details of the government's plans will be outlined on Monday. New mothers are currently entitled to 90% of average earnings for the first six weeks after giving birth, followed by £102.80 a week until the baby is six months old.\n", "llama3.2:1b": "Labour plans to increase maternity pay to nine months by 2007, rising from £1,400 to £2,000 per year. The move would give paid leave to new mothers and fathers, extending rights for parents of older children. \n\nThe proposals were announced by Trade and Industry Secretary Patricia Hewitt, who claims the government is committed to giving women a \"firm commitment\" on maternity pay. Conservatives have dismissed the plan as \"desperate\", while Liberal Democrats have criticized it as misdirected.\n\nMinisters will consult on other proposals that could allow fathers to take some of their partner's maternity pay or extend flexible working to carers and parents of older children. The government has assured taxpayers that the plans would be paid for by the state, not employers.", "llama3.2:3b": "Labour proposes to increase maternity pay to £1,400 per year, with paid leave extended to nine months by 2007. The plan also includes allowing fathers to receive some of their partner's maternity pay or extending flexible working rights to carers and parents of older children.", "gemma2:2b": "Labour announces plans to increase maternity leave to nine months by 2007. The plan involves extending paid leave from six to nine months and includes possibilities for fathers taking some of their partner's maternity leave or expanding flexible working rights for parents. Conservatives and Liberal Democrats have criticised the proposals, with Conservatives calling them \"desperate\" and Liberal Democrats saying they are misdirected. \n", "qwen2.5:0.5b": "Maternity pay has risen by £1,400 for new mothers as part of proposals announced by Patricia Hewitt, Trade and Industry Secretary. Maternity pay would be increased to 9 months from 26 weeks, extended to nine months by 2007, and given to fathers. The plan is described as \"desperate\" by the Tories while Liberal Democrats say it's misdirected. The Labour Party said they have already doubled maternity pay, but its plans for fathers' leave and flexible working rights are not mentioned. Women may be entitled to additional monthly income from their partners if mothers consent, with ministers consulting on other measures. The Conservatives plan to announce their proposals closer to the general election while the Liberal Democrats hope to boost maternity pay by boosting it in the first six months. David Frost, British Chambers of Commerce director general, warns that many small firms may be unable to afford the extra costs associated with new mother's leave.", "qwen2.5:1.5b": "The Trade and Industry Secretary Patricia Hewitt proposes increasing maternity pay from 13 weeks to 26 weeks by 2007 with an additional £1,400, extending it to nine months in 2007 and up to 12 months overall by the end of Parliament. The Tories dismiss the proposal as \"desperate\", while Liberal Democrats argue it is misdirected. Women would be allowed more time off for their partner's maternity leave and flexible working rights could be extended. The plans would be funded by taxpayers, not employers. However, small firms may be affected by increased recruitment costs and advertising expenses.", "qwen2.5:3b": "Maternity pay in Britain is set to rise from 6 months to 9 months by 2007 under new proposals announced by Trade and Industry Secretary Patricia Hewitt. This would increase paid leave to nine months, with an aim to extend it to full 12 months by the end of the next Parliament. Other proposals include allowing fathers to take some of their partner's maternity pay or leave period, as well as extending rights for parents of older children. While Labour faces criticism from the Conservative and Liberal Democrat parties, Hewitt assures that plans are funded by taxpayers rather than employers. However, business groups like the British Chambers of Commerce warn that small firms could be negatively affected. New mothers currently receive 90% of average earnings for the first six weeks after giving birth, followed by £102.80 a week until the baby is six months old.", "opencoder:1.5b": "The Labour plans maternity pay rise involve increasing paid leave to nine months from 2007. The Tories and the Liberal Democrats dismissed the maternity pay plan as \"desperate\" while it was misdirected by the Secretary of State for the Family, Patricia Hewitt. She said after consultation: \"We have already doubled the length of maternity pay, it was 13 weeks when we were elected. We have already taken up to 26 weeks. We will extend the pay to nine months by 2007 and aim to get it right up to the full 12 months by the end of the next Parliament.\" She said new mothers would already be entitled to the extra £1,400 if given leave at six months intervals. The Shadow Secretary was also working closely with Gordon Brown's pre-budget review in December to recycle their bid to win back women voters. The Conservatives announced their proposals closer to the General Election while Liberal Democrats warned of \"many small firms\" being crippled by the move.\n", "smollm:1.7b": "The Labour plans maternity pay rise is a key part of new proposals announced by the Trade and Industry Secretary Patricia Hewitt to increase paid leave for new mothers. The Labour Party has promised to extend maternity pay to nine months by 2007, allowing parents to take more time off work after giving birth. This would be in addition to the current six-month entitlement.\nThe Liberal Democrats have announced plans to allow fathers to take some of their partner's maternity pay or leave period, and extend the rights of flexible working to carers or parents of older children. The Shadow Secretary of State for the Family, Theresa May, has also announced her Labour Party's proposals in a pre-budget review, which included this plan.\nThe Liberal Democrats will announce their own plans closer to the General Election, with a focus on increasing maternity pay and boosting support for new mothers. While the Conservative Party would need to agree to fund these plans, they are likely to be paid for by taxpayers rather than employers. However, David Frost, director general of the British Chambers of Commerce, warned that many small firms could be \"crippled\" by the move, as they may struggle to afford the increased costs.\nThe Labour Party's proposals will be outlined on Monday, with a focus on increasing paid leave for new mothers and providing more support for carers.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about the maternity pay increase. Let me read through it carefully.\n\nSo, the main point is that the UK is planning to raise maternity leave from 6 weeks to 9 months for new mothers by 2007. The Trade and Industry Secretary, Patricia Hewitt, told a show she's already increased it to nine months because of the extra £1,400.\n\nBut wait, there are other plans too. She mentioned letting maternity pay go to fathers and giving them some rights to parents of older children. The Tories said it was desperate, while the Lib Dems thought it might be misdirected.\n\nShe also says the company will handle the payment from £12,086 to £14,754 over six months. That's a £1,400 increase. Minsters can now claim nine months instead of six weeks when they're elected.\n\nOther companies are being consulted about allowing fathers to take their partners' leave or extending rights for carers and older parents. The Lib Dems are calling it misdirected because the money might be used improperly.\n\nMs May, the lib Dem spokesperson, thinks the money is misused but wants more maternity pay in the first six months so women can stay at home longer. I should make sure to include all these points concisely without extra info.\n</think>\n\nThe UK plans to increase maternity leave from 6 weeks to 9 months for new mothers by 2007, resulting in £1,400 more per month during the first six weeks. This plan is part of broader proposals announced by Patricia Hewitt, emphasizing that mothers will receive nine months of leave instead of six weeks when elected. The increase comes at a time when other plans include fathers' rights and extensions for older parents. Lib Dems criticized these efforts as misdirected due to financial implications.", "tinyllama:1.1b": "The Trade and Industry Secretary Patricia Hewiitt announced new proposal plans that would raise the length of mother's leave from the current nine months to nine months starting by 2007, extending maternitay pay for new mothers and allowing fathers to take a part of their partner's leave period or extended rights of flexible working. The government plans to extend the right of caregivers and parents of older children to receive the same level of pay as new mothers in upcoming proposals. Liberal Democrats criticized the plans, saying that they would be \"misdirected\" and pointed out that taxpayers would fund these increases while small firms could be \"crippled\". The plans will be detailed on Monday.", "tinydolphin:1.1b": " In summary, Patricia Hewitt announced plans to raise maternity pay in the UK to £1,400 per month and extend rights to fathers and older children. The proposed increase would mean a doubling of maternity pay to nine months, while extending rights to parents of older children. Ms. Hewitt stated that she hopes to have this implemented by 2007 and will consult on other proposals concerning paternity leave and flexible working for parents. The plans are expected to be announced on Sunday with details outlined on Monday.", "phi:2.7b": " Maternity pay in the UK is set to increase from six months to nine months and receive a rise of £1,400 as part of new proposals announced by Patricia Hewitt, the Trade and Industry Secretary. The plans also include allowing fathers to take some of their partner's maternity pay or leave period and extending flexible working rights for carers or parents of older children. However, the Tory party has dismissed these plans as \"desperate\" while the Liberal Democrats have criticized them as a misdirection of funds. The extra maternity pay is expected to be paid for by taxpayers, not employers.\n", "orca-mini:3b": " Patricia Hewitt announces plans to increase maternity pay to £1,400 and extend rights to fathers and parents of older children. This would mean that nine months of maternity leave would be paid for at £1,400 and the full 12 months of leave would be extended to all mothers by the end of the next Parliament. The plans are part of a bid to win back women voters and other proposals include letting maternity pay be given to fathers and extending rights to parents of older children. However, David Frost warned that many small firms could be \"crippled\" by these plans.", "hermes3:3b": "Maternity pay to rise by £1400 to 9 months by 2007, according to Labour proposals.", "stablelm-zephyr:3b": "The Trade and Industry Secretary, Patricia Hewitt, announced that maternity pay for new mothers would rise by £1,400, increasing paid leave to nine months by 2007. This plan also includes providing maternity pay for fathers and extending rights to parents of older children. The Conservatives criticized the proposal as \"desperate,\" while Liberal Democrats believed the money was being misdirected. Ms. Hewitt assured that the plans would be funded by taxpayers, not employers, but warned that small firms could face financial difficulties due to the additional costs. Further details of the government's plans will be released on Monday.", "stablelm2:1.6b": "The Trade and Industry Secretary Patricia Hewitt has announced new proposals to increase maternity pay from 6 to 9 months, allowing paid leave up to nine months. Other plans include allowing maternity pay to fathers and extending rights for parents of older children. The Tories and Liberal Democrats criticize the plan as \"desperate\" and \"misdirected\", respectively. The proposal will be funded by taxpayers rather than employers, with the aim of reaching full 12-month pay by the end of the next Parliament. Currently, new mothers are entitled to a percentage of average earnings for the first six weeks after giving birth, followed by £1 per week until the baby is six months old.", "granite3.1-dense:2b": "Trade and Industry Secretary Patricia Hewitt announced plans to increase maternity pay for new mothers from 26 weeks (six months paid) to nine months by 2007, with an additional £1,400 per year. This extension aims to reach the full 12-month paid leave by the end of the next Parliament. Proposed changes also include allowing fathers to share their partner's maternity pay or take some leave, and extending flexible working rights to carers of older children. The Conservatives criticized these plans as \"desperate\" and misdirected, while the Liberal Democrats expressed concern about the misallocation of funds, preferring to boost maternity pay during the first six months instead. Fathers' involvement in paid maternity leave is also under consideration. The government plans to fund these enhancements through taxpayers, but the British Chambers of Commerce warned that small businesses might face financial strain due to increased recruitment and training costs.", "chatgpt-4o-latest": "Labour plans to increase maternity pay by £1,400, extending paid leave to nine months by 2007, with a goal of reaching 12 months in the next Parliament. Trade and Industry Secretary Patricia Hewitt announced that fathers might be allowed to take some maternity pay, and flexible working rights could be extended to parents of older children. The Conservatives criticized the plan as a recycled election tactic, while the Liberal Democrats argued the funds should be directed toward boosting pay in the first six months. The government emphasized that taxpayers, not employers, would fund the changes, but business leaders warned of potential financial strain on small firms. Further details will be announced on Monday.", "reference": "She said her party would boost maternity pay in the first six months to allow more women to stay at home in that time.She said new mothers were already entitled to 12 months leave, but that many women could not take it as only six of those months were paid.The Tories dismissed the maternity pay plan as \"desperate\", while the Liberal Democrats said it was misdirected.She said ministers would consult on other proposals that could see fathers being allowed to take some of their partner's maternity pay or leave period, or extending the rights of flexible working to carers or parents of older children.Liberal Democrat spokeswoman for women Sandra Gidley said: \"While mothers would welcome any extra maternity pay the Liberal Democrats feel this money is being misdirected.\"We will definitely extend the maternity pay, from the six months where it now is to nine months, that's the extra £1,400.\"Ms Hewitt said: \"We have already doubled the length of maternity pay, it was 13 weeks when we were elected, we have already taken it up to 26 weeks.Other plans include letting maternity pay be given to fathers and extending rights to parents of older children."}