{"raw_text": "Hewitt decries 'career sexism'\n \n Plans to extend paid maternity leave beyond six months should be prominent in Labour's election manifesto, the Trade and Industry Secretary has said.\n \n Patricia Hewitt said the cost of the proposals was being evaluated, but it was an \"increasingly high priority\" and a \"shared goal across government\". Ms Hewitt was speaking at a gender and productivity seminar organised by the Equal Opportunities Commission (EOC). Mothers can currently take up to six months' paid leave - and six unpaid. Ms Hewitt told the seminar: \"Clearly, one of the things we need to do in the future is to extend the period of payment for maternity leave beyond the first six months into the second six months. \"We are looking at how quickly we can do that, because obviously there are cost implications because the taxpayer reimburses the employers for the cost of that.\"\n \n Ms Hewitt also announced a new drive to help women who want to work in male dominated sectors, saying sexism at work was still preventing women reaching their full potential. Plans include funding for universities to help female science and engineering graduates find jobs and \"taster courses\" for men and women in non-traditional jobs. Women in full-time work earn 19% less than men, according to the Equal Opportunities Commission (EOC).\n \n The minister told delegates that getting rid of \"career sexism\" was vital to closing the gender pay gap.\n \n \"Career sexism limits opportunities for women of all ages and prevents them from achieving their full potential. \"It is simply wrong to assume someone cannot do a job on the grounds of their sex,\" she said. Earlier, she told BBC Radio 4's Today programme: \"What we are talking about here is the fact that about six out of 20 women work in jobs that are low-paid and typically dominated by women, so we have got very segregated employment. \"Unfortunately, in some cases, this reflects very old-fashioned and stereotypical ideas about the appropriate jobs for women, or indeed for men. \"Career sexism is about saying that engineering, for instance, where only 10% of employees are women, is really a male-dominated industry. Construction is even worse. \"But it is also about saying childcare jobs are really there for women and not suitable for men. Career sexism goes both ways.\"\n \n She added that while progress had been made, there was still a gap in pay figures. \"The average woman working full-time is being paid about 80p for every pound a man is earning. For women working part-time it is 60p.\" The Department for Trade and Industry will also provide funding to help a new pay experts panel run by the TUC.\n \n It has been set up to advise hundreds of companies on equal wage policies. Research conducted by the EOC last year revealed that many Britons believe the pay gap between men and women is the result of \"natural differences\" between the sexes. Women hold less than 10% of the top positions in FTSE 100 companies, the police, the judiciary and trade unions, according to their figures. And retired women have just over half the income of their male counterparts on average.\n", "llama3.2:1b": "Patricia Hewitt says Labour's election manifesto should include plans to extend paid maternity leave beyond six months. She also announced a new drive to help women in male-dominated sectors find jobs and education programs for girls in traditionally female careers.", "llama3.2:3b": "Patricia Hewitt calls for extending paid maternity leave beyond six months to combat \"career sexism\" which she says limits opportunities for women and prevents them from achieving full potential in the workforce. She also announces plans to help women enter traditionally male-dominated sectors with funding for universities, taster courses, and a new pay experts panel to advise companies on equal wage policies.", "gemma2:2b": "Patricia Hewitt calls for extending paid maternity leave beyond six months in Labour's manifesto and emphasizes the need to address \"career sexism\" that hinders women's progress. She notes the wage gap between men and women persists, with women earning significantly less than men in full-time work. To tackle this issue, the government will fund a panel to advise companies on equal wage policies and support women entering traditionally male-dominated fields through university programs and job training initiatives. \n", "qwen2.5:0.5b": "Patricia Hewitt argues for extending paid maternity leave beyond six months as part of Labour's election manifesto, noting that this would benefit mothers and women in male-dominated sectors, including higher-paying jobs like engineering and science. She emphasizes career sexism affecting all ages and preventing female work from reaching their full potential, stating it is \"wrong to assume someone cannot do a job on the grounds of their sex.\" She suggests gender pay gap solutions, such as funding for universities and \"taster courses\" in non-traditional jobs, to address this.", "qwen2.5:1.5b": "Labour's Trade and Industry Secretary Patricia Hewitt has called for extending paid maternity leave beyond six months, arguing it is an \"increasingly high priority\". She also announced plans to help women work in traditionally male-dominated sectors and end \"career sexism\", which she believes limits women's potential and contributes to the gender pay gap. The government will provide funding for universities to support female science and engineering graduates and men/female job taster courses.", "qwen2.5:3b": "Patricia Hewitt, Trade and Industry Secretary, supports extending paid maternity leave beyond six months as a \"shared goal across government.\" She announced plans for funding universities to help female graduates in STEM find jobs and offers \"taster courses\" for both genders in non-traditional roles. Hewitt emphasized the importance of tackling 'career sexism' by addressing gender pay gaps and work segregation, citing that women earn approximately 80p for every pound a man earns on average. The government will also establish a new pay experts panel to advise companies on equal wage policies.", "opencoder:1.5b": "Hewitt described 'career sexism' as a major issue facing Labour's election manifesto.\n\nThe plan to extend paid maternity leave beyond six months is promoted in the Trade and Industry Secretary's speech, while Patricia Hewitt mentions that the cost of these proposals is being evaluated - yet it is an \"increasingly high priority\" - and shared across government. Ms Hewitt is speaking at a seminar organized by the Equal Opportunities Commission (EOC).\n\nSpeaking to gender and productivity seminar hosted by the Equal Opportunities Commission, she discusses the importance of increasing the pay gap for maternity leave beyond the first six months into the second six months. She also highlights the need to close the gap as women of all ages can achieve their full potential from jobs that are low-paid.\n\nWhile progress had been made in various sectors, there is still a significant gap in pay figures. For men working full-time, their average wage is less than for female employees, suggesting more \"natural differences\" between the sexes. Women hold less than 10% of top positions in FTSE 100 companies - hence, they are not compensated at a higher rate.\n\nAccording to her statements, retired women have about half the income of their male counterparts on average, further reinforcing the disparity between men and women's pay.\n", "smollm:1.7b": "The summary is concise and objective, preserving key ideas and details while omitting unnecessary information. It provides a clear understanding of the main points discussed in the text without adding or taking away any information. The tone remains neutral and professional throughout the summary.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text into a concise summary that preserves key ideas and details. Let's start by reading through the entire passage carefully.\n\nThe first sentence mentions Patricia Hewitt criticizing 'career sexism.' It's good to note her criticism about gender pay equity. She plans to extend paid maternity leave beyond six months, which is important for future employment trends.\n\nIn a separate paragraph, she talks about evaluating proposals, emphasizing it as an increasing priority and a shared goal across government. She's presenting a talk at a seminar organized by the Equal Opportunities Commission (EOC), mentioning that mothers can take up to six paid leave periods with six unpaid. She explains the costs involved but stresses affordability due to potential expenses.\n\nShe also announces a drive to help women in non-traditional jobs, including \"taster courses\" for both men and women, aiming to fill gaps in workforce opportunities. There's a mention of pay差距 across sectors: women earn 19% less than men in science and engineering. The EOC figures show that while progress is made, there still exists significant pay differences.\n\nHewitt connects career sexism to the gender pay gap, explaining how it limits opportunities for all ages. She argues against stereotypical views on jobs and mentions the disparity between top positions held by women and top companies. She also points out the income gaps among retired women compared to their male counterparts.\n\nFinally, she highlights that there's still a pay gap despite progress, with women earning less than men in many sectors, though this may be due to natural differences. The Trade and Industry Department will provide funding for a pay experts panel by the TUC.\n\nI need to condense all these points into a coherent summary without adding personal opinions or explanations, just extracting the main ideas. I'll make sure to include key terms like 'career sexism,' 'paid maternity leave,' ' Equal Opportunities Commission,' and specifics about salary disparities.\n</think>\n\nPatricia Hewitt criticized 'career sexism' and plans to extend paid maternity leave beyond six months. A speech at the EOC seminar highlights cost evaluations, emphasizing it as an increasing priority. She announced a push for women in non-traditional jobs, including \"taster courses,\" aiming to fill workforce gaps. She noted a 19% pay gap between men and women in certain sectors, with retired women earning over half their income compared to men. Career sexism is linked to gender pay equity issues, where women often earn less due to stereotypical views on job opportunities. The Trade and Industry Department will fund a TUC-backed experts panel addressing pay disparities across different sectors.", "tinyllama:1.1b": "The Trade and Industry Secretary has stated that she plans to extend paid maternity leave beyond six months in the upcoming Labour's election manifesto, stating it as a shared goal across government. The proposed policy is aimed at addressing \"carriage sexism\" that restricts women from achieving their full potential in their chosen fields, particularly those related to the male-dominated industries mentioned by her. The EOC also announced plans for two new courses, funding for universities and additional support for female science and engineering graduates who wish to work in non-traditional jobs.", "tinydolphin:1.1b": " In a concise summary of the text provided, you can highlight the main points as follows:\n\n1. Patricia Hewitt, Labour's Trade and Industry Secretary, plans to extend paid maternity leave beyond six months should be prominent in the party's election manifesto.\n2. The cost of the proposed measures would be evaluated, and if approved, they would help women who work in male-dominated sectors by increasing their earning potential and reducing job opportunities for men.\n3. Hewitt also announced a new initiative to help women who aspire to work in non-traditional fields such as science and engineering, stating that sexism at work was still preventing them from reaching their full potential.\n4. The Department for Trade and Industry plans to provide funding for experts on equal wage policies, while the TUC aims to help women gain backpay after falling behind in earnings figures.", "phi:2.7b": " The text discusses how Patricia Hewitt plans to extend paid maternity leave beyond six months in Labour's election manifesto. She believes that this is an important issue that requires government attention and funding for universities. Additionally, she wants to encourage more women to work in male-dominated sectors such as science and engineering by providing job taster courses for men and women. She emphasizes the need to eliminate \"career sexism\" as it limits opportunities for women and prevents them from reaching their full potential. Women earn less than men in terms of full-time work, according to the EOC's findings, and they hold a smaller percentage of top positions in FTSE 100 companies.\n", "orca-mini:3b": " Hewitt calls for extension of paid maternity leave beyond six months in Labour's manifesto. EOC priority is gender productivity, with new funding for universities and \"taster courses\" for men and women in non-traditional jobs. Women earn 19% less than men, says TUC. Career sexism limits opportunities for women, according to Hewitt.", "hermes3:3b": "Patricia Hewitt calls for extended paid maternity leave beyond six months, highlighting career sexism as preventing women from reaching full potential and closing gender pay gap.", "stablelm-zephyr:3b": "Trade and Industry Secretary Patricia Hewitt advocated extending paid maternity leave beyond six months as a prominent feature in Labour's election manifesto. She also announced plans to support female workers in male-dominated sectors, including funding for universities to help women in science and engineering find jobs and \"taster courses\" for both men and women in non-traditional roles. Hewitt emphasized the need to eliminate \"career sexism\" to close the gender pay gap, stating that women are paid 19% less than men in full-time work. She added that progress had been made, but there was still a disparity in pay figures between men and women.", "stablelm2:1.6b": "Trade and Industry Secretary Patricia Hewitt suggests that Labour's election manifesto should prominently include plans to extend paid maternity leave beyond six months, as evaluating the cost of such proposals is a \"shared goal across government.\" Hewitt also addresses career sexism limiting opportunities for women in male-dominated sectors and announces funding for universities and \"taster courses\" for men and women in non-traditional jobs. The average woman working full-time earns 90p for every pound a man earns, according to the Equal Opportunities Commission.", "granite3.1-dense:2b": "Patricia Hewitt, Trade and Industry Secretary, emphasizes extending paid maternity leave beyond six months as a key priority for Labour's election manifesto. She stated that this proposal is an \"increasingly high priority\" and a shared goal across government, with cost implications being evaluated due to employer reimbursement by taxpayers. Hewitt also announced initiatives to combat career sexism in male-dominated sectors: funding for universities to assist female science and engineering graduates in finding jobs, and \"taster courses\" for men and women in non-traditional roles.\n\nHewitt highlighted that gender pay gap reduction is crucial for closing the 19% wage disparity between men and women, according to the Equal Opportunities Commission (EOC). She noted that while progress has been made, significant gaps persist: full-time women earn about 80p for every pound a man earns, and part-time women receive 60p. The Department for Trade and Industry will fund a pay experts panel by the TUC to advise companies on equal wage policies.\n\nHewitt stressed that career sexism limits opportunities for women of all ages and prevents them from reaching their full potential, regardless of whether jobs are traditionally associated with men or women. This issue also extends to segregated employment, with 10% of engineering employees being women and construction having even fewer female workers. EOC research indicates that many people believe the pay gap is due to inherent sex differences rather than systemic discrimination.", "chatgpt-4o-latest": "Patricia Hewitt, Trade and Industry Secretary, emphasized the need to extend paid maternity leave beyond six months, calling it a government priority despite cost concerns. Speaking at an Equal Opportunities Commission seminar, she also announced initiatives to help women enter male-dominated fields, including funding for female science and engineering graduates and job \"taster courses.\" Hewitt condemned \"career sexism\" as a major factor in the gender pay gap, noting that women in full-time work earn 19% less than men. She highlighted the persistence of job segregation and outdated stereotypes, affecting both men and women. The Department for Trade and Industry will fund a TUC-led panel to advise companies on equal pay policies. Research shows that many believe the gender pay gap stems from \"natural differences,\" with women holding less than 10% of top positions in major sectors and retired women earning significantly less than men.", "reference": "Ms Hewitt also announced a new drive to help women who want to work in male dominated sectors, saying sexism at work was still preventing women reaching their full potential.\"But it is also about saying childcare jobs are really there for women and not suitable for men.Earlier, she told BBC Radio 4's Today programme: \"What we are talking about here is the fact that about six out of 20 women work in jobs that are low-paid and typically dominated by women, so we have got very segregated employment.Women in full-time work earn 19% less than men, according to the Equal Opportunities Commission (EOC).The minister told delegates that getting rid of \"career sexism\" was vital to closing the gender pay gap.\"Career sexism limits opportunities for women of all ages and prevents them from achieving their full potential.\"Career sexism is about saying that engineering, for instance, where only 10% of employees are women, is really a male-dominated industry.Plans include funding for universities to help female science and engineering graduates find jobs and \"taster courses\" for men and women in non-traditional jobs.Plans to extend paid maternity leave beyond six months should be prominent in Labour's election manifesto, the Trade and Industry Secretary has said.\"The average woman working full-time is being paid about 80p for every pound a man is earning.For women working part-time it is 60p.\""}