{"raw_text": "Labour chooses Manchester\n \n The Labour Party will hold its 2006 autumn conference in Manchester and not Blackpool, it has been confirmed.\n \n The much trailed decision was ratified by Labour's ruling National Executive Committee in a break with the traditional choice of a seaside venue. It will be the first time since 1917 that the party has chosen Manchester to host the annual event. Blackpool will get the much smaller February spring conference instead in what will be seen as a placatory move.\n \n For years the main political parties have rotated between Blackpool, Bournemouth and Brighton. And the news the much larger annual conference is not to gather in Blackpool will be seen as a blow in the coastal resort. In 1998 the party said it would not return to Blackpool but did so in 2002. The following year Bournemouth hosted the event before the party signed a two year deal for Brighton to host the autumn conference.\n \n Colin Asplin, Blackpool Hotel Association said: \"We have tried very hard to make sure they come back to Blackpool. \"Obviously we have failed in that. I just hope Manchester can handle the crowds. \"It amazes me that the Labour Party, which is a working class party, doesn't want to come to the main working class resort in the country.\" The exact cost to Blackpool in terms of lost revenue for hotel accommodation is not yet known but it is thought that block bookings will be taken at the major Manchester hotels after the official announcement.\n", "llama3.2:1b": "Labour has chosen Manchester as its 2006 autumn conference venue, replacing Blackpool. This marks the first time since 1917 that Labour hosts its annual event in Manchester instead of Blackpool, which was previously chosen by all main political parties for several years.", "llama3.2:3b": "Labour Party chooses Manchester over Blackpool for 2006 autumn conference, marking a break from traditional seaside venues and a blow to the coastal resort's economy, with exact cost not yet known.", "gemma2:2b": "The Labour Party's 2006 autumn conference will be held in Manchester, breaking with tradition and a move away from seaside venues. Blackpool will host a smaller February conference instead. This decision impacts the coastal resort negatively, following years of shifting between various locations for party conferences. \n", "qwen2.5:0.5b": "The Labour Party plans to host its 2006 autumn conference in Manchester instead of Blackpool due to a break with their traditional choice of a seaside venue, as previously confirmed. This decision was made by the National Executive Committee rather than being a decision from the party's ruling members, likely indicating a desire for greater representation or change. Colleague Colin Asplin expressed hope that Manchester could handle the large crowds and added that it is surprising that Labour does not want to host there since they are working-class parties.", "qwen2.5:1.5b": "The Labour Party has chosen Manchester over Blackpool for its autumn conference, a decision breaking tradition since 1917. This move marks the first time Manchester will host the annual event, with Blackpool receiving the smaller February spring conference instead as part of efforts to placate disappointed party members who had previously requested returning to their hometowns.", "qwen2.5:3b": "Labour Party will hold its 2006 autumn conference in Manchester, breaking with tradition and choosing the city over Blackpool for the annual event. This marks the first time since 1917 that Labour has selected Manchester as the host venue. The decision was taken despite previous commitments to return to Blackpool. It is seen as a blow for Blackpool's tourism industry, which traditionally hosts both Labour's autumn and spring conferences. Colin Asplin of the Blackpool Hotel Association expresses disappointment but acknowledges it might be better that the conference does not return to Blackpool.", "opencoder:1.5b": "Labour has chosen Manchester.\nThe Labour Party has confirmed their decision to host its 2006 autumn conference in Manchester.\nManchester's decision to host the annual event has been seen as a result of the Labour Party’s ruling National Executive Committee which is debatable with the traditional choice of a seaside venue.\nIt will be the first time since 1927 that the party has chosen Manchester to host the annual event.\nThe party has also chosen Manchester for its larger February spring conference compared to Blackpool, which gets much smaller in what will be seen as a placatory move.\nThe main political parties have rotated between Blackpool, Bournemouth and Brighton. For years, it has been seen that the news about the annual conference is not to gather in Blackpool but does so in Brighton.\nIn 1998, the party signed a two year deal for Brighton to host the autumn conference.\nBlackpool Hotel Association stated: \"We have tried very hard to make sure they come back to Blackpool.\" It is definitely that they have failed in the effort. However, it is believed that they are hoping Manchester can handle the crowds as they want to maintain their reputation and gain competitive advantage in the country.\nThe cost of blackpool hotel accommodation is yet unknown but it seems to be taken at major Manchester hotels after official announcement.\n", "smollm:1.7b": "The Labour Party chooses Manchester as its 2006 autumn conference venue, and this decision is made without explanation or justification. The party has chosen Manchester for several years, and it is not surprising that they have chosen this location. However, the choice of Blackpool instead is a significant blow to the party's reputation in the coastal resort.\n\nThe Labour Party will hold its 2006 autumn conference in Manchester and not Blackpool, which means that the party has chosen to host the event in a different location than it did previously. This decision was made without explanation or justification, and it is clear that the party does not want to come back to Blackpool for this event.\n\nThe Labour Party has tried very hard to make sure they come back to Blackpool, but it seems that they have failed in their attempt. It is surprising that the party, which is a working class party, doesn't want to come to the main working class resort in the country and instead chooses to host the event at a different location.\n\nThe exact cost to Blackpool in terms of lost revenue for hotel accommodation is not yet known, but it is thought that block bookings will be taken at the major Manchester hotels after the official announcement. This means that Blackpool will likely lose some revenue from tourism and hospitality businesses in the city.", "deepseek-r1:1.5b": "<think>\nAlright, let me tackle this query step by step. The user has provided a text and wants a concise summary preserving key ideas. They specified to output only the summary in plain text without explanations or formatting.\n\nFirst, I need to read through the entire text carefully to identify the main points. The text is about Labour choosing Manchester for their autumn conference instead of Blackpool due to tradition. It mentions that Manchester was chosen since 1917 as the first time after a rotation from Blackpool and Bournemouth in previous years.\n\nI notice the details about Colin Asplin, the hotel association's statement, which highlights the failure in bringing participants back to Blackpool. The text also implies potential loss of revenue due to block bookings at Manchester hotels if the conference isn't held there.\n\nThe user emphasized conciseness, so I should avoid extra information and focus solely on the summary. I need to make sure all key points are included: Labour's decision in Manchester, the rationale behind it (traditional venue choice being replaced), the new venue for autumn, the switch from Blackpool in February, and the reasons why Blackpool is a significant issue despite previous hosting.\n\nI should structure this into a coherent paragraph, ensuring each point flows logically. I need to keep sentences clear and direct without any added explanations or formatting. The summary should be around 100-250 characters, so it needs to be concise but comprehensive.\n\nDouble-checking the details: Labour's decision in 2006, Manchester being first since 1917, Bournemouth hosting earlier, rotation from Blackpool and others, Asplin's statement about not returning to Blackpool despite trying, and potential revenue implications if Manchester isn't chosen. Making sure all these points are included succinctly.\n\nFinally, ensure that the summary is in plain text as requested without any markdown or formatting.\n</think>\n\nLabour will host its 2006 autumn conference in Manchester instead of Blackpool, marking the first time since 1917 after tradition's choice. This move raises concerns due to potential loss of revenue from major hotel bookings. Colin Asplin noted that while trying hard to bring participants back, they've failed, and Manchester is expected to handle crowds.", "tinyllama:1.1b": "Labour Party will hold its annual conference in Manchester rather than Blackpool. The choice to hold the event elsewhere, previously held in Blackpool and Brighton, has been confirmed by Labour's National Executive Committee. Despite a long history of alternating between the two coastal resorts, Labour chose Manchester as the venue for the 2006 autumn conference, which is the first time it has hosted since its last visit to Blackpool in 1917. The party has been criticized for not choosing Blackpool but opting for the smaller and less popular February spring conference instead. This is a blow to the coastal resort, and the news that Manchester will be the venue for the annual conference is seen as a placatory move by Labour. However, it is also not yet known how much lost revenues from hotel bookings will be suffered in terms of block bookings at major Manchester hotels.", "tinydolphin:1.1b": " In the UK, the Labour Party has decided to hold its autumn conference in Manchester instead of the traditional Blackpool location. This decision has been met with criticism by some local businesses and residents who feel that Manchester is a better choice for accommodation, conference space, and economic benefits. The main parties have been rotating their conferences between Blackpool, Bournemouth, and Brighton since 1998, but the Labour Party has chosen to leave Blackpool behind in favor of Manchester. This decision raises questions about how effectively the party has managed its resources in previous years and whether it will continue to prioritize securing its main base for future conferences.", "phi:2.7b": " Labour Party chooses Manchester over Blackpool for their autumn conference, a decision that goes against traditional practices and could have financial implications for Blackpool's tourism industry. The party has hosted conferences in other venues such as Bournemouth and Brighton before making a deal with Brighton for two years. Colin Asplin, the president of the Blackpool Hotel Association, expressed disappointment but hoped that Manchester would be able to accommodate the expected crowd. The exact cost for Blackpool is unknown at this time.\n", "orca-mini:3b": " The Labour Party will hold its 2006 autumn conference in Manchester instead of Blackpool, breaking with tradition of choosing a seaside venue. It will be the first time since 1917 that the party has chosen Manchester to host the annual event. Blackpool will get the smaller February spring conference instead. The decision was made by the ruling National Executive Committee and it is seen as a placatory move.", "hermes3:3b": "Labour chooses Manchester for 2006 autumn conference.", "stablelm-zephyr:3b": "The Labour Party has confirmed its 2006 autumn conference will be held in Manchester, breaking with traditional choices of seaside venues such as Blackpool and Bournemouth. It will be the first time since 1917 that the party chooses Manchester for the event, with Blackpool set to host a smaller spring conference instead. The decision is seen as a blow to Blackpool's tourism industry, although the exact cost to local hotels remains unknown.", "stablelm2:1.6b": "The Labour Party will hold its autumn conference in Manchester, a break from the usual seaside locations like Blackpool and Bournemouth. This is the first time since 1976 that Manchester has been chosen as the host city, despite previous attempts to return to Blackpool. Colin Asplin of the Blackpool Hotel Association expresses disappointment but hopes Manchester can handle the crowds. The exact cost for Blackpool in terms of lost revenue is unknown, but it's thought hotels will take block bookings in Manchester after the official announcement.", "granite3.1-dense:2b": "Labour's 2006 autumn conference will be held in Manchester, marking a departure from the traditional seaside venue of Blackpool and the first time since 1917. This decision was approved by the National Executive Committee. Blackpool, known for its annual conferences, will now host the smaller February spring event instead. The switch is seen as a setback for the coastal resort, which has hosted Labour events since 1998. Colin Asplin, from the Blackpool Hotel Association, expressed disappointment, emphasizing Manchester's ability to accommodate the anticipated crowds. The financial impact on Blackpool is yet to be determined, but it's expected that major Manchester hotels will likely benefit from increased bookings following the official announcement.", "chatgpt-4o-latest": "Labour's 2006 autumn conference will be held in Manchester instead of Blackpool, marking the first time since 1917 the city has hosted the event. The decision, confirmed by Labour's National Executive Committee, breaks with the tradition of seaside venues. Blackpool will instead host the smaller February spring conference, seen as a conciliatory move. Political parties have traditionally rotated between Blackpool, Bournemouth, and Brighton, and the decision is considered a blow to Blackpool, which previously lost and regained the event. Blackpool Hotel Association expressed disappointment, citing potential lost revenue, while Manchester is expected to handle the large crowds.", "reference": "The Labour Party will hold its 2006 autumn conference in Manchester and not Blackpool, it has been confirmed.For years the main political parties have rotated between Blackpool, Bournemouth and Brighton.In 1998 the party said it would not return to Blackpool but did so in 2002.And the news the much larger annual conference is not to gather in Blackpool will be seen as a blow in the coastal resort.Colin Asplin, Blackpool Hotel Association said: \"We have tried very hard to make sure they come back to Blackpool.It will be the first time since 1917 that the party has chosen Manchester to host the annual event."}