{"raw_text": "Women MPs reveal sexist taunts\n \n Women MPs endure \"shocking\" levels of sexist abuse at the hands of their male counterparts, a new study shows.\n \n Male MPs pretended to juggle imaginary breasts and jeered \"melons\" as women made Commons speeches, researchers from Birkbeck College were told. Labour's Yvette Cooper said she found it hard to persuade Commons officials she was a minister and not a secretary. Some 83 MPs gave their answers in 100 hours of taped interviews for the study \"Whose Secretary are You, minister\".\n \n The research team, under Professor Joni Lovenduski, had set out to look at the achievements and experiences of women at Westminster. But what emerged was complaints from MPs of all parties of sexist barracking in the Chamber, sexist insults and patronising assumptions about their abilities. Barbara Follet, one of the so-called \"Blair Babes\" elected in 1997, told researchers: \"I remember some Conservatives - whenever a Labour woman got up to speak they would take their breasts - imaginary breasts - in their hands and wiggle them and say 'melons' as we spoke.\" Former Liberal Democrat MP Jackie Ballard recalled a stream of remarks from a leading MP on topics such as women's legs or their sexual persuasion. And ex-Tory education secretary Gillian Shepherd remembered how one of her male colleagues called all women \"Betty\".\n \n \"When I said, 'Look you know my name isn't Betty', he said, 'ah but you're all the same, so I call you all Betty'.\" Harriet Harman told researchers of the sheer hostility prompted by her advancement to the Cabinet: \"Well, you've only succeeded because you're a woman.\" Another current member of the Cabinet says she was told: \"Oh, you've had a very fast rise, who have you been sleeping with?\" Even after the great influx of women MPs at the 1997 general election, and greater numbers of women in the Cabinet, female MPs often say they feel stuck on the edge of a male world.\n \n Liberal Democrat Sarah Teather, the most recent female MP to be elected, told researchers: \"Lots of people say it's like an old boys club. \"I've always said to me it feels more like a teenage public school - you know a public school full of teenagers.\" Prof Joni Lovenduski, who conducted the study with the help of Margaret Moran MP and a team of journalists, said she was shocked at the findings. \"We expected a bit of this but nothing like this extent. We expected to find a couple of shocking episodes.\" But she said there was a difference between the experiences of women before the 1997 intake and afterwards. This was mainly because there were more women present in Parliament who were not prepared to \"put up with\" the sexist attitudes they came across, Prof Lovenduski said. But she added: \"Some women, including the women who came in 1997, received extraordinary treatment and I am not convinced that if the number of women changed back to what it was before 1997 that things would not change back. \"What I think is shocking to the general public is that these things go on in the House of Commons.\" The interviews are to be placed in the British Library as a historical record.\n", "llama3.2:1b": "Women MPs endure sexist abuse from male counterparts, including juggling imaginary breasts and insults like \"melons\". Researchers found that 83 MPs complained about sexist treatment during taped interviews for their study \"Whose Secretary are You, minister\". Women MPs often feel isolated in the House of Commons due to patriarchal attitudes and patronizing assumptions. The study's lead researcher notes that some women received extraordinary treatment while others experienced the same level of abuse.", "llama3.2:3b": "Women MPs report sexist taunts from male colleagues, including comments about breasts and female abilities, which can make them feel unwelcome in the House of Commons.", "gemma2:2b": "Women MPs report experiencing sexist abuse from male colleagues, including taunts about their bodies and patronizing remarks about their abilities. These incidents were reported by multiple MPs across different parties, with examples given of imaginary breast movements and comments about women's sexual persuasion. Even after significant increases in female representation in Parliament, many women feel trapped within a predominantly male environment. \n", "qwen2.5:0.5b": "The article discusses reports from researchers about the experiences and complaints of women MPs at Westminster. They reveal that female MPs have faced sexist abuse, which they describe as \"shocking\" levels. Researchers found that male MPs had pretended to juggle imaginary breasts, made jokes about melons, and mocked female speech. Some MPs recounted receiving hostile remarks, while others described more positive interactions with their male counterparts. The study's findings were particularly shocking given the historical context of women entering Parliament in 1997, a time when sexist attitudes were prevalent. Women MPs found it challenging to distinguish themselves from male colleagues due to their positions and political roles. Some female MPs felt they had to adapt to the new environment, while others described their experiences as less intimidating compared to those of former Conservative members who came before them.", "qwen2.5:1.5b": "Women MPs face severe sexist taunts, including breast juggling and sexual namecalling, from male colleagues during debates at the UK Parliament, according to a recent study. Women MPs like Yvette Cooper found it challenging to convince officials they were ministers rather than secretaries, while Jackie Ballard recalled being called \"melons\" as she spoke on health topics. Former cabinet members faced hostility such as being asked if they were sleeping with others and receiving insults about their physical attributes. This was particularly prevalent in the 1997 general election period when more women entered Parliament but found themselves still in a traditional male-dominated environment. The study, conducted by Birkbeck College researchers under Professor Joni Lovenduski, aimed to explore female MPs' achievements and experiences at Westminster but revealed widespread sexist treatment that had persisted since the early 1990s.", "qwen2.5:3b": "Women MPs endure sexist abuse from male colleagues, including imitating breasts and making sexual slurs. The study by Birkbeck College found that such behavior persists despite more women being elected. Former MPs recall hostile environments, with some facing derogatory nicknames like \"Betty\" or allegations of improper relationships. Liberal Democrat Sarah Teather called it akin to an old boys' club. Researchers were shocked by the extent and intensity of the abuse. Despite a greater number of women in Parliament after 1997 general election, many female MPs still feel they are on the periphery. The interviews will be archived as historical records showing these enduring issues.", "opencoder:1.5b": "Women MPs relentlessly expose sexist accusations at the hands of their male counterparts, highlighting the intense and confrontational tone they feel when confronted with this controversial subject. They express their anger and frustration about the perceived lack of fairness or equality in representation in society, as well as the potential for stereotypes to escalate. The study also explores the experiences of women MP's during various legislative periods, revealing a range of issues related to gender and equality in politics.\n\nResearchers from Birkbeck College grapple with this complex subject and use it to examine the achievements and challenges of women at Westminster. They find that the practice of \"shocking\" levels of sexist abuse in the Chamber is not common or tolerated among MP's, despite their apparent representation as women. It also highlights the growing importance of respectful dialogue, where a woman's actions are perceived as more important than her gender.\n\nHowever, researchers also observe that the criticism and complaints raised by female MPs continue to surface even after the successful introduction of the 1997 general election. This reflects the broader expectations set by the MP's during their tenure in the House of Commons, which have been based largely on their understanding of equality and fairness.\n\nDespite this, female MPs often express resistance to change because they feel their representation as a women's representative is not just about gender but also aligns with their personal values and beliefs. They continue to cast a wider net by asking various questions about their abilities and potential, hoping to find common ground that supports their chosen role in the election process.\n\nFinally, the feeling of being stuck on the edge of a male world is reflected by female MPs who feel they are forced into a situation where they are not fully equipped to accept the male worldview. This shows how one's experiences may influence what their next steps should be in life or work.\n", "smollm:1.7b": "The text summary should preserve key ideas and details, including:\n\n1. The women MPs endured \"shocking\" levels of sexist abuse at the hands of their male counterparts.\n2. Male MPs pretended to juggle imaginary breasts and jeered \"melons\" as women made Commons speeches.\n3. Some 83 MPs gave their answers in 100 hours of taped interviews for the study \"Whose Secretary are You, minister\".\n4. The research team, under Professor Joni Lovenduski, had set out to look at the achievements and experiences of women at Westminster. But what emerged was complaints from all parties of sexist barracking in the Chamber, sexist insults and patronising assumptions about their abilities.\n5. Barbara Follet, one of the so-called \"Blair Babes\" elected in 1997, told researchers: \"I remember some Conservatives - whenever a Labour woman got up to speak they would take their breasts - imaginary breasts - in their hands and wiggle them and say 'melons' as we spoke.\"\n6. Former Liberal Democrat Sarah Teether, the most recent female MP to be elected, told researchers: \"Lots of people say it's like an old boys club. I've always said to me it feels more like a teenage public school - you know a public school full of teenagers.\"\n7. Prof Joni Lovenduski, who conducted the study with the help of Margaret Moran MP and a team of journalists, said she was shocked at the findings. \"We expected to find a couple of shocking episodes,\" she said. \"But I am not convinced that if the number of women changed back to what it was before 1997 that things would not change back.\"\n8. The interviews are to be placed in the British Library as a historical record.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about women MPs and the sexist taunts they endure. Let me read through it carefully.\n\nThe first paragraph talks about how women MPs suffer from sexist taunts at the hands of their male counterparts. It mentions a study showing that. Then, it goes into details of what happened in the interviews, who gave answers, etc., but I think I can just focus on the key points about abuse and the context of the study.\n\nThe next part describes how some Conservative MPs mocked women's breasts as \"melons\" when they spoke. It mentions Barbara Follet from 1997. Also, there are examples of other politicians, like Jackie Ballard, talking about female legs or sexual persuasion with male colleagues. This shows a pattern of sexism being expressed.\n\nThen it goes into Harriet Harman's observation that the hostility was due to their advancement in the Cabinet. She said they succeeded because women were advancing but felt stuck in a male-dominated world. Another MP mentioned she was told something about her rise without sleep, showing the pressure on female MPs.\n\nProf Joni Lovenduski explains that even with more women in the cabinet and Parliament, there's still a lot of stress for some. She notes that there are more people who don't feel ready to take on male roles but others do. This indicates systemic issues rather than just personal choice.\n\nThe end emphasizes that these events happen in the House of Commons and suggest they shouldn't be taken lightly by the public. The interviews will be used as a historical record, placed at the British Library.\n\nPutting it all together, I need to capture the key points: women MPs face sexism, there's abuse, specific examples like mockings, Harriet Harman's view on advancement, Prof Lovenduski's observations about systemic stress, and the importance of these events in historical records.\n\nI should make sure to include important details without getting into too much detail. Maybe focus on the main issues: abuse, the examples given, Harriet Harman's perspective, the study findings, and how it contributes to understanding societal norms.\n</think>\n\nWomen MPs face significant systemic sexism in Westminster, where their presence is often marginalised. A study revealed that women MPs endure sexist taunts at the hands of their male counterparts during speeches. Conservative politicians mocked women's breasts as \"melons\" when speaking, while other MPs engaged with their bodies or sexual persuasion through colleagues. Harriet Harman observed hostility from their advancement in the Cabinet, noting it stemmed from advancing as a woman. Prof Joni Lovenduski noted systemic stress on some MPs after gender diversity increases but highlighted differences before and after 1997. The interviews will serve as historical records at the British Library to reflect these issues, emphasizing that such events are crucial for understanding societal norms in Westminster.", "tinyllama:1.1b": "The women MPs described in the study revealed \"shocking\" levels of sexist abuse, taunts, and insults at the hands of their male counterparts, who were found to have no qualms about mocking or harassing female MPs. The findings came as part of a new study conducted by Professor Joni Lovenduskki, with journalist help, which included 100 hours of taped interviews given by women in the House of Commons for the purpose of looking at their experiences and achievements. While some women expressed satisfaction with their work, others revealed that they faced sexist abuse in the Chamber. One woman even said that she had been called \"Betty\" (a term commonly used to refer to a woman) by a prominent male MP who was in the chamber during her speech. The study also noted that previous research had shown women being under-represented in Parliament and receiving an extra dose of sexism, with some women revealing that they were subjected to \"shocking\" taunts from their male counterparts as they were given briefs for the day's proceedings. The study concluded that there was no evidence to suggest that things would change back to what they were before 1997.", "tinydolphin:1.1b": " Summarize this text using AI-generated text: \n\"The research team under Professor Joni Lovenduski found that women MPs face sexist taunts and abuse during their speeches in the House of Commons. The study, which examined the experiences and achievements of women at Westminster, revealed a shocking level of sexist harassment from both male and female MPs. Some 83 MPs gave their answers in 100 hours of taped interviews for the study. The research revealed that some male MPs pretended to juggle imaginary breasts and jeered \"melons\" as women made Commons speeches, while others claimed they could not understand the concept of gender equality.\"", "phi:2.7b": " The study by researchers at Birkbeck College reveals that women MPs experience \"shocking\" levels of sexist abuse from their male counterparts during speeches, with some MPs making comments about juggling imaginary breasts and referring to female MPs as \"melons\". Former Liberal Democrat MP Jackie Ballard recalls being called a \"Betty\" by her male colleague. Even after the increase in female representation at Westminster, many women MPs still feel like they are on the edge of a male-dominated world. The study highlights the need for more support and protection for women in Parliament.\n", "orca-mini:3b": " Women MPs reveal sexist taunts and abuse at the hands of their male counterparts in a new study. Female MPs say they endure shocking levels of sexist abuse at the hands of their male counterparts, including \"shocking\" levels of sexual insults and patronizing assumptions about their abilities. Some 83 MPs gave their answers in 100 hours of taped interviews for the study, \"Whose Secretary are You, minister?\". The research team, under Professor Joni Lovenduski, had set out to look at the achievements and experiences of women at Westminster but what emerged was complaints from MPs of all parties of sexist barracking in the Chamber, sexist insults and patronizing assumptions about their abilities. Barbara Follet, one of the so-called \"Blair Babes\" elected in 1997, told researchers: \"I remember some Conservatives - whenever a Labour woman got up to speak they would take their breasts - imaginary breasts - in their hands and wiggle them and say 'melons' as we spoke.\" Former Liberal Democrat MP Jackie Ballard recalled a stream of remarks from a leading MP on topics such as women's legs or their sexual persuasion. And ex-Tory education secretary Gillian Shepherd remembered how one of her male colleagues called all women \"Betty\".", "hermes3:3b": "Women MPs face severe sexist abuse, including comments about breasts and sexual advances, from male colleagues in parliament, according to study.", "stablelm-zephyr:3b": "A study by Birkbeck College reveals that women MPs face \"shocking\" levels of sexist abuse from their male counterparts, with some MPs pretending to juggle imaginary breasts and making sexist comments during speeches. The research team was initially set up to examine the achievements and experiences of women at Westminster but discovered widespread complaints of sexist behavior across all parties. Some female MPs feel they are still on the edge of a male-dominated world despite greater numbers of women in Parliament after the 1997 general election.", "stablelm2:1.6b": "Women MPs face \"shocking\" levels of sexual harassment from male counterparts during parliamentary speeches, according to a study by researchers at Birkbeck College. Compliments, insults, and patronizing assumptions about women's abilities were common among MPs of all parties, the study found. Some MPs recounted being called \"Betty,\" or having their names changed to match others' views. Despite this hostility, the number of female MPs in Parliament has increased since 2017 elections.", "granite3.1-dense:2b": "Women MPs face pervasive sexist abuse from their male counterparts, according to a study by researchers from Birkbeck College. During 100 hours of taped interviews for \"Whose Secretary are You, minister,\" participants shared accounts of imaginary breast juggling and \"melons\" jeering, as well as sexist insults and patronizing assumptions about their abilities. Notable examples include Labour's Yvette Cooper being mistakenly identified as a secretary, Barbara Follet having male colleagues simulate breast movements, Jackie Ballard encountering remarks on women's legs or sexual persuasion, and Gillian Shepherd being called \"Betty.\" Female MPs also report feeling marginalized within a male-dominated environment, likening Parliament to an old boys club or a teenage public school. Despite the increased number of women in Parliament since 1997, these sexist behaviors persist. The study's lead researcher, Professor Joni Lovenduski, expressed shock at the extent of the abuse but noted that some women's experiences improved due to their presence in Parliament. These findings will be documented as a historical record in the British Library.", "chatgpt-4o-latest": "A study by Birkbeck College reveals that women MPs face widespread sexist abuse from male colleagues in the House of Commons. Researchers found that male MPs mocked female MPs by making crude gestures and comments, such as pretending to juggle breasts and shouting \"melons\" during speeches. Labour's Yvette Cooper struggled to convince officials she was a minister rather than a secretary, while other MPs recalled sexist insults and patronizing attitudes. Barbara Follett described Conservative MPs making inappropriate gestures, and Jackie Ballard recalled persistent sexist remarks. Gillian Shepherd recounted a male colleague calling all women \"Betty\" because he saw them as interchangeable. Harriet Harman and other female MPs faced hostility and insinuations about their success being linked to their gender. Despite the increase in female MPs after 1997, many still feel excluded from a male-dominated environment. Liberal Democrat Sarah Teather likened Parliament to a \"teenage public school.\" Professor Joni Lovenduski, who led the study, was shocked by the extent of sexism, noting that while more women in Parliament have challenged these attitudes, the problem persists. The study's interviews will be archived in the British Library as a historical record.", "reference": "But she said there was a difference between the experiences of women before the 1997 intake and afterwards.Even after the great influx of women MPs at the 1997 general election, and greater numbers of women in the Cabinet, female MPs often say they feel stuck on the edge of a male world.This was mainly because there were more women present in Parliament who were not prepared to \"put up with\" the sexist attitudes they came across, Prof Lovenduski said.Male MPs pretended to juggle imaginary breasts and jeered \"melons\" as women made Commons speeches, researchers from Birkbeck College were told.Prof Joni Lovenduski, who conducted the study with the help of Margaret Moran MP and a team of journalists, said she was shocked at the findings.But she added: \"Some women, including the women who came in 1997, received extraordinary treatment and I am not convinced that if the number of women changed back to what it was before 1997 that things would not change back.Labour's Yvette Cooper said she found it hard to persuade Commons officials she was a minister and not a secretary.Women MPs endure \"shocking\" levels of sexist abuse at the hands of their male counterparts, a new study shows.And ex-Tory education secretary Gillian Shepherd remembered how one of her male colleagues called all women \"Betty\".Barbara Follet, one of the so-called \"Blair Babes\" elected in 1997, told researchers: \"I remember some Conservatives - whenever a Labour woman got up to speak they would take their breasts - imaginary breasts - in their hands and wiggle them and say 'melons' as we spoke.\""}