{"raw_text": "Lib Dems demand new inquiry\n \n A judge should look into the David Blunkett controversy as key questions remain unanswered, the Lib Dems say.\n \n Sir Alan Budd's inquiry linked the ex-home secretary to the speeding up of a visa claim by his ex-lover's nanny. But he could not say whether Mr Blunkett had treated the nanny as a special case or had used her as an example of immigration problems. Lib Dem spokesman Mark Oaten said the number of officials who had forgotten what happened was worrying. He told BBC News: \"I'm extremely concerned that 20 individuals appear to have forgotten what happened or more suspiciously are not prepared to say what happened. \"That must be bad for government, it must be bad for public confidence in the system.\"\n \n Mr Oaten said people would be mystified why Sir Alan's inquiry failed to uncover why processing of the visa application was speeded up. He said: \"There is a strong case for a judge-led judicial review of this because, of course, next time it happens it may not be about a nanny and their visa. It may be about something even more important than that. \"So we do need to understand what took place and who was involved.\" The Tories criticised the Lib Dem stance, saying Mr Oaten had initially said he accepted Mr Blunkett's word unless further evidence emerged. But Lib Dem officials say Mr Oaten was speaking when an inquiry was under way and was avoiding rushing to judgement.\n", "llama3.2:1b": "The Liberal Democrats demand a new inquiry into the David Blunkett controversy regarding his role in speeding up a visa claim for one of his ex-lovers' nannies. The inquiry, led by Sir Alan Budd, had initially ruled out any wrongdoing but Lib Dem spokesman Mark Oaten believes it was a mistake and that more questions need to be answered.", "llama3.2:3b": "Lib Dems demand a new judge-led inquiry into the David Blunkett controversy over visa claim processing, citing unanswered questions and concerns about public confidence in the system.", "gemma2:2b": "Lib Dems demand a judge-led judicial review into the David Blunkett controversy due to unanswered questions regarding visa processing. They express concern over the number of officials who have forgotten or refused to disclose details, which they believe damages government credibility.  They argue that this inquiry failed to uncover why the visa application was expedited, suggesting a need for further investigation and accountability. \n", "qwen2.5:0.5b": "Lib Dems demand new inquiry into David Blunkett visa application speed-up controversy", "qwen2.5:1.5b": "Lib Dems demand a judge-led inquiry into David Blunkett's handling of immigration visa application case, citing concerns about possible recurrences.", "qwen2.5:3b": "Lib Dems demand a judge-led judicial review into David Blunkett's controversy over the speeding up of a nanny's visa claim, citing concerns about potential misuse of authority and public confidence in government systems. They argue that Sir Alan Budd’s inquiry did not fully explain why processing was expedited and highlight worries that officials have forgotten or are covering up what occurred. Lib Dem spokesman Mark Oaten criticizes the lack of clarity from Budd's findings, suggesting a broader issue might be at stake beyond just an immigration case. The Tories criticized this stance, stating Oaten had initially accepted Blunkett’s word without further evidence and was merely avoiding rushing to judgment during an inquiry.", "opencoder:1.5b": "\"The Lib Dems demand new inquiry about speeding up visa processing by a nanny. However, the judge has been determined not to pursue it as there is strong, public case for a judicial review of this matter.\" - The BBC News reported on a news interview with Sir Alan Budd.\n", "smollm:1.7b": "The Lib Dems demand new inquiry into David Blunkett's handling of a visa claim by his ex-lover's nanny, citing concerns that the government failed to uncover key details about the incident. The Lib Dem spokesperson Mark Oaten said the number of officials who forgot what happened or used Mr Blunkett as an example of immigration problems was worrying and called for a thorough judicial review of the incident.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving key ideas and details. The user has given specific instructions: output only the summary as plain text without any explanations or formatting, just a single paragraph.\n\nFirst, I'll read through the text carefully to identify the main points. The key elements seem to be the demand for an inquiry into the David Blunkett controversy by theLib Dems, Sir Alan Budd's inquiry linking him to Mr Blunkett and his nanny, Mark Oaten's comments on the concerns about officials forgetting details, and the reaction from Tories criticizing Lib Dem stance.\n\nI need to condense this information without losing important details. I'll start with the Lib Dems' demand for an investigation into the controversy. Then mention Sir Alan's inquiry linking him to Mr Blunkett's case, particularly regarding his ex-lover's nanny. Oaten's concerns about officials forgetting details and the government's potential decline in public confidence. The critical reaction from the Tories questioning Lib Dem's openness.\n\nI should ensure that each point is clear and concise, avoiding any unnecessary jargon or explanations. I'll structure it into a coherent paragraph, making sure all major points are covered without being too wordy.\n</think>\n\nLib Dems demand an inquiry into the David Blunkett controversy. Sir Alan Budd's inquiry links him to Mr Blunkett's case, particularly regarding his ex-lover's nanny. Mark Oaten expressed concerns about officials forgetting details and government concern over public confidence in processing visa applications. The Lib Dems rejected his initial stance but highlighted ongoing investigations lacking clarity. The Tories criticized their openness, calling the situation concerning.", "tinyllama:1.1b": "The Lib Dem party has called for a new inquiry into the David Blunkett controversy, citing unresolved key questions that remain unanswered by Sir Alan Budd's previous investigation. The ex-home secretary, who led an attempt to fast-track a visa application for his former partner's elderly mother, has been criticized for his handling of the matter. While the judge is expected to look into whether Mr Blunkett treated the woman as a special case or used her as an example of immigration problems, Lib Dem officials have expressed concern over the lack of clarity about what happened during the process. The party has called on the government to set up a judicial review in order to better understand the circumstances surrounding the controversy and identify any issues that need to be resolved.", "tinydolphin:1.1b": " The Lib Dems demand a new investigation into the controversy involving David Blankett, a former Home Secretary. Sir Alan Budd's inquiry into his handling of the visa application process for his nanny's ex-lover was unable to identify any suspicious activity. According to Mark Oaten, spokesperson for the Lib Dem party, 20 officials out of 40 have failed to recall what transpired. This is worrisome for government and public confidence in the system as well as further inquires may be necessary to better understand how such decisions were made. The Tories criticized the Lib Dems' stance by suggesting Mr Oaten was only accepting Mr Blunkett's word until more evidence emerged, which he said during an inquiry but is now refusing to confirm.", "phi:2.7b": " The text is a news article about the controversy surrounding former Home Secretary David Blunkett, who was linked to the speeding up of a visa claim by his ex-lover's nanny. The Lib Dems are calling for an investigation into the matter as they believe key questions have not been answered and there may be more important cases in the future. The article also highlights concerns about confusion among officials and public confidence in the system.\n", "orca-mini:3b": " The Lib Dems demand a new inquiry into the David Blunkett controversy, citing Sir Alan Budd's inquiry as insufficient in uncovering the truth. They are concerned about the number of officials who have forgotten what happened or are suspicious of the nanny's visa application. A judge-led review is needed to understand what took place and who was involved, according to the Lib Dems.", "hermes3:3b": "Lib Dems call for new judge-led inquiry into David Blunkett controversy over forgotten visa claim details.", "stablelm-zephyr:3b": "The Liberal Democrats (Lib Dems) are calling for a new judge-led judicial review into the David Blunkett controversy, as key questions remain unanswered. Sir Alan Budd's initial inquiry focused on the speeding up of a visa claim by his ex-lover's nanny, but he was unable to determine whether Blunkett treated the nanny as a special case or used her as an example of immigration problems. Lib Dem Mark Oaten expressed concern about 20 officials forgetting what happened or not being willing to share their knowledge. He argued that a judge should review the situation to ensure transparency and prevent future mishandlings. The Tories criticized this stance, highlighting Oaten's previous acceptance of Blunkett's word without further evidence.", "stablelm2:1.6b": "The Liberal Democrats demand a new inquiry into the David Blunkett controversy due to unanswered questions. Judge should investigate, as Sir Alan Budd's inquiry linked ex-home secretary to speeding up of a visa claim by his ex-lover's nanny without determining whether he treated her as a special case or an example. Lib Dem Mark Oaten is concerned about officials forgetting or not being transparent about the issue. A judicial review may be necessary to understand what happened and who was involved, despite Tory criticism for initially accepting Blunkett's word unless evidence proved otherwise.", "granite3.1-dense:2b": "The Liberal Democrats are advocating for a new, judicial review into the David Blunkett visa controversy, citing unresolved issues and the recall of 20 officials who cannot provide clarity on whether Mr. Blunkett treated the nanny as an exception or used her to highlight immigration issues. They argue that understanding this incident is crucial for maintaining public trust in government systems, as it could set a precedent for similar high-stakes cases. The Conservatives counter that Lib Dem spokesman Mark Oaten had previously accepted Blunkett's account until new evidence emerged. However, the Liberal Democrats maintain that Oaten was speaking during an ongoing inquiry and was cautious about premature judgments.", "chatgpt-4o-latest": "The Liberal Democrats are calling for a judge-led inquiry into the David Blunkett controversy, arguing that key questions remain unanswered. Sir Alan Budd's inquiry linked Blunkett to the expedited visa processing for his ex-lover's nanny but could not determine if she was given special treatment. Lib Dem spokesman Mark Oaten expressed concern that many officials claimed to have forgotten details, undermining public confidence. He argued that a judicial review is necessary to clarify what happened and prevent similar issues in the future. The Tories criticized the Lib Dems for changing their stance, but Lib Dem officials defended Oaten, saying he had initially withheld judgment while the inquiry was ongoing.", "reference": "But Lib Dem officials say Mr Oaten was speaking when an inquiry was under way and was avoiding rushing to judgement.Lib Dem spokesman Mark Oaten said the number of officials who had forgotten what happened was worrying.Mr Oaten said people would be mystified why Sir Alan's inquiry failed to uncover why processing of the visa application was speeded up.The Tories criticised the Lib Dem stance, saying Mr Oaten had initially said he accepted Mr Blunkett's word unless further evidence emerged.He said: \"There is a strong case for a judge-led judicial review of this because, of course, next time it happens it may not be about a nanny and their visa."}