{"raw_text": "Labour targets 'hardcore truants'\n \n A fresh crackdown on persistent truants in England has been launched by Education Secretary Ruth Kelly.\n \n Serial truants make up one in 13 pupils. Previous initiatives brought 40,000 pupils back to school since 1997, according to official statistics. Parenting contracts, penalty notices and \"fast track\" prosecution systems have been used to tackle what has been a stubborn problem. It is thought that nearly half a million children skip school each day. Tories say Labour's previous success regarding the issue came because it tackled the easy part of the problem by reducing authorised absence, where parents are permitted to take children out of school. Such absences are often due to family holidays.\n \n However, serial truants avoid the classroom despite government schemes costing £885m. Those missing classes are more likely to become involved in crime as well as failing academically. Measures such as parenting contracts and penalty notices were adopted by most local education authorities last term and come into force in the remainder this term. In one local education authority alone 800 parents were warned they would receive a penalty notice unless their child's attendance improved. The tough stance paid off with just 24 issued, while attendance improved in 776 cases. Truancy has been reduced by 5% at the 128 worst hit schools through the government's Behaviour Improvement Programme. This is the equivalent of 200 pupils back in classes since September.\n \n The new measures come on top of national truancy sweeps - the sixth of which will take place on Monday. Police and education welfare officers patrol problem hotspots picking up truants and returning them to school. Held twice each year, in addition to routine local patrols, previous country-wide sweeps have apprehended 31,000 pupils dodging school. In almost 14,000 of those cases, the youngsters were accompanied by their parents. A Department for Education and Skills source said: \"Every day in school counts. \"It is clear form these figures that schools and local education authorities are now seizing the tools we have given them to improve school attendance and crack down hard on the very small numbers of pupils which account for almost half of the nation's truancy.\"\n", "llama3.2:1b": "Labour targets hardcore truants with a new crackdown on persistent absences in England. The target is 5% reduction in absenteeism at 128 worst-hit schools, equivalent to around 200 pupils returning to classes. Previous initiatives have brought 40,000 pupils back to school since 1997. Measures include parenting contracts and penalty notices, but are deemed inadequate due to high rates of involvement in crime and failing academically.", "llama3.2:3b": "Labour targets serial truants in England, with measures including parenting contracts, penalty notices, and prosecution systems. The initiative aims to reduce truancy rates, following previous initiatives that reduced authorized absences. Serial truants are more likely to become involved in crime and fail academically, while government schemes have cost £885m with limited success.", "gemma2:2b": "A new crackdown on persistent truants in England has been launched. Measures include parenting contracts, penalty notices, and \"fast track\" prosecution systems. These measures have already shown success in improving attendance, although some argue that previous successes were due to reducing authorized absences for family holidays.  The government aims to increase school attendance rates through these initiatives. \n", "qwen2.5:0.5b": "Labour has launched a crackdown on persistent serial truants in England, costing £885m. The measures include parenting contracts, penalty notices, and fast track prosecution systems. They aim to tackle a stubborn problem with over 40,000 pupils being sent back to school since 1997, according to official statistics. The government is taking tough measures to prevent children from skipping school, including warning parents about the consequences of skipping class for their child's attendance.", "qwen2.5:1.5b": "Labour has introduced a crackdown on persistent truants in England. This issue is thought to affect one in 13 children, with previous measures leading to fewer than 40,000 students returning to school since 1997. Government strategies include parenting contracts, penalty notices, and \"fast track\" prosecution systems, but only 24 out of 800 parents received penalty notices last term. The hard-line approach has resulted in a 5% reduction in truancy at the worst-performing schools, equivalent to 200 pupils returning to class since September. The new measures will join ongoing national sweeps that have apprehended over 31,000 students, including those accompanied by parents.", "qwen2.5:3b": "Labour targets 'hardcore truants' with crackdown. Education Secretary Ruth Kelly launched a new initiative focusing on persistent absences in England, aiming to bring 40,000 students back since 1997. Measures include parenting contracts and penalty notices, costing £885m. Serial truants avoid classes leading to increased crime and poor academic performance. Attendance improved at 128 schools by 5% through the Behaviour Improvement Programme. National sweeps apprehend around 31,000 pupils annually, with almost half being accompanied by parents. Labour emphasizes that every day in school counts.", "opencoder:1.5b": "\"Labour targets 'hardcore truants'. A fresh crackdown on persistent truants in England has been launched by Education Secretary Ruth Kelly. It is thought that nearly half a million children skip school each day, with some missing classes as well. Measures such as parenting contracts and penalty notices were adopted by most local education authorities last term and come into force in the remainder this term. The tough stance paid off with just 24 issued, while attendance improved in 776 cases. Truancy has been reduced by 5% at the 128 worst hit schools through the government's Behaviour Improvement Programme.\".\n", "smollm:1.7b": "The Labour government has launched a fresh crackdown on persistent truants in England, with new measures aimed at tackling the problem. The previous initiative brought 40,000 pupils back to school since 1997, according to official statistics. However, it is thought that nearly half a million children skip school each day.\n\nThe Labour government's previous success regarding the issue came because it tackled the easy part of the problem by reducing authorised absence, where parents are permitted to take children out of school. Such absences are often due to family holidays. In contrast, truancy is more complex and requires a deeper understanding of the underlying issues that lead students to drop out of school.\n\nThe new measures come into effect next term and will be applied to all local education authorities in England. The government's Behaviour Improvement Programme has been credited with reducing truancy by 5% at the 128 worst hit schools through its efforts to improve behaviour among pupils. This is the equivalent of 200 pupils back in classes since September.\n\nThe new measures come on top of national truancy sweeps - the sixth of which will take place next month. Police and education welfare officers patrol problem hotspots picking up truants and returning them to school. Held twice each year, in addition to routine local patrols, previous country-wide sweeps have apprehended 31,000 pupils dodging school. In almost 14,000 of those cases, the youngsters were accompanied by their parents.\n\nThe Labour government's source said: \"Every day in school counts. It is clear form these figures that schools and local education authorities are now seizing the tools we have given them to improve school attendance and crack down on the very small numbers of pupils which account for almost half of the nation's truancy.\"", "deepseek-r1:1.5b": "<think>\nOkay, I need to help the user by summarizing this text. The user provided a detailed paragraph about Labour's approach to tackling truants in England. They want only the summary as plain text without any explanations or formatting.\n\nFirst, I'll read through the entire text to understand the main points. The focus is on how Labour introduced new measures to tackle persistent truants. \n\nThe text mentions that truants are 1 in 13 pupils and that previous efforts brought back thousands of students over a decade. The government used various methods like parenting contracts, penalty notices, and fast tracks. However, truants avoid school despite these measures.\n\nNew measures were launched as part of Labour's campaign against the problem. They include stricter penalties for parents who supervise absences without family holidays, parenting contracts, and public awareness campaigns with patrols and parent reunions. Local authorities are expected to handle many cases, reducing truancy rates.\n\nThe figure from local data shows significant improvement—truancy reduced by 5% at worst schools, which is equivalent of 200 students back in school since 1997. It also notes that many children were accompanied by their parents during patrols, indicating the approach's effectiveness.\n\nI need to make sure the summary includes all key points without missing any significant details. I should keep it concise, avoiding any markdown or extra information.\n</think>\n\nLabour has launched new measures to tackle truants in England, reducing attendance by 5% at worst schools and improving truancy rates significantly.", "tinyllama:1.1b": "The British government has launched a new crackdown on persistent truancies by introducing \"fast-track\" processes, parenting contracts, and penalty notice policies aimed at reducing authorised absence. The new measures come on top of national truancy sweeps - the sixth since 1997 - that have resulted in more than 200 pupils returning to classes and an overall improvement in attendance of 5% at the 128 worst-hit schools, according to official statistics. The new measures will target a further 31,000 pupils who are serial truancies and are expected to result in nearly half a million children being back in school next term. The Labour government's previous initiatives to tackle the issue came because it tackled easy-to-fix authorised absence by reducing attendance by an average of 28% at primary schools and 30% at secondary schools since 1997. Parental responsibility was a major factor in this, with parents reportedly avoiding classes due to family holidays and costly penalties for absent children increasing their likelihood of becoming involved in crime.", "tinydolphin:1.1b": " The UK government has announced a fresh crackdown on persistent truants in England, with plans to introduce new measures including parenting contracts, penalty notices, and fast-track prosecution systems. These initiatives are aimed at tackling the issue of a stubborn problem: nearly half a million children skip school each day due to family holidays. The Education Secretary, Ruth Kelly, has announced that a fresh crackdown on persistent truants will be launched in 2010, with plans to target an area of the country where these problems are most prevalent. This initiative comes in addition to previous national truancy sweeps and is expected to result in a substantial number of truants being held by police and welfare officers.", "phi:2.7b": " Ruth Kelly has launched a new crackdown on persistent truants in England. The measures include parenting contracts, penalty notices, and \"fast track\" prosecution systems. These initiatives have been used to tackle stubborn truant problem, with previous efforts reducing authorised absence from school by 40,000 since 1997. The issue of truancy is significant, affecting nearly half a million children each day. Conservatives say that Labour's previous success in addressing the issue was due to reducing authorised absences for family holidays. However, serial truants avoid class despite government schemes costing £885m. Measures such as parenting contracts and penalty notices were adopted by most local education authorities last year and will be enforced this year. Police and education welfare officers patrol problem hotspots, apprehending truant children and returning them to school. National truancy sweeps have been held twice each year and have apprehended 31,000 pupils, with over 14,000 cases involving parental accompaniment. The Department for Education and Skills source said that every day in school counts and schools are using the tools provided to improve attendance and crack down on the small numbers of pupils responsible for almost half of truancy. \n", "orca-mini:3b": " The text reports on a new crackdown on persistent truants in England launched by Education Secretary Ruth Kelly. It mentions that serial truants make up one in 13 pupils and that previous initiatives brought 40,000 pupils back to school since 1997. Parenting contracts, penalty notices, and \"fast track\" prosecution systems have been used to tackle the issue of truancy which is a stubborn problem. It is suggested that nearly half a million children skip school each day, and measures such as parenting contracts and penalty notices were adopted by most local education authorities last term and come into force in the remainder this term. Tough measures paid off with just 24 issued, while attendance improved in 776 cases. Truancy has been reduced by 5% at the 128 worst hit schools through the government's Behaviour Improvement Programme.", "hermes3:3b": "Labour launches crackdown on persistent truants in England, focusing on serial absentees rather than authorised absences. New measures include parenting contracts, penalty notices, and fast track prosecution systems to reduce truancy by 5% at the worst-hit schools.", "stablelm-zephyr:3b": "Education Secretary Ruth Kelly launches a fresh crackdown on persistent truants in England, with serial truants making up one in 13 pupils. Previous initiatives have already brought back 40,000 pupils to school since 1997. Measures such as parenting contracts and penalty notices have been used, along with government schemes costing £885m. A tough stance has paid off, with just 24 penalty notices issued and attendance improving in 776 cases. Truancy has reduced by 5% at the 128 worst-hit schools through the government's Behaviour Improvement Programme.", "stablelm2:1.6b": "Education Secretary Ruth Kelly has launched a crackdown on persistent truants in England, aiming to reduce the number of one in every five primary school pupils who are serial truants. The previous initiatives by Labour reduced authorised absence and focused on tackling the easy part of the problem, leading to nearly half a million children skipping school daily. The new measures include parenting contracts and penalty notices from most local education authorities with a 5% reduction in attendance at worst-hit schools through the government's Behaviour Improvement Programme.", "granite3.1-dense:2b": "Education Secretary Ruth Kelly has initiated a new campaign against persistent, or \"hardcore,\" truants in England, focusing on children who make up one in 13 pupils. Previous efforts have resulted in 400,000 students returning to school since 1997 through measures like parenting contracts, penalty notices, and fast-track prosecutions. Despite these investments totaling £885m, nearly half a million children still skip classes daily.\n\nThese serial truants are more prone to involvement in crime and poor academic performance. The latest strategy involves stricter enforcement measures, already implemented in some local education authorities, such as warning parents of penalties for unimproved attendance. In one authority, 800 warnings led to only 24 issued penalties, demonstrating improved school attendance by 776 cases.\n\nFurthermore, national truancy sweeps have apprehended approximately 31,000 students since their inception in 2001, with nearly 14,000 accompanied by parents. The sixth such sweep is scheduled for this Monday, involving police and education welfare officers targeting problem hotspots to return truants to school.\n\nThe government emphasizes the importance of daily school attendance, stating that local education authorities are now effectively utilizing provided tools to reduce truancy by 5% at the worst-hit schools, equivalent to 200 pupils re-entering classes since September.", "chatgpt-4o-latest": "Education Secretary Ruth Kelly has launched a new crackdown on persistent truancy in England. Serial truants make up one in 13 pupils, and previous efforts have brought 40,000 students back to school since 1997. Despite government schemes costing £885m, many students still skip school, increasing their risk of academic failure and crime. Measures such as parenting contracts, penalty notices, and fast-track prosecutions have been widely adopted, with some local authorities seeing improved attendance. National truancy sweeps, involving police and education officers, have caught 31,000 pupils, nearly half accompanied by parents. The government emphasizes that tackling hardcore truants is crucial, as a small number of students account for almost half of all truancy cases.", "reference": "\"It is clear form these figures that schools and local education authorities are now seizing the tools we have given them to improve school attendance and crack down hard on the very small numbers of pupils which account for almost half of the nation's truancy.\"Police and education welfare officers patrol problem hotspots picking up truants and returning them to school.Previous initiatives brought 40,000 pupils back to school since 1997, according to official statistics.In one local education authority alone 800 parents were warned they would receive a penalty notice unless their child's attendance improved.Held twice each year, in addition to routine local patrols, previous country-wide sweeps have apprehended 31,000 pupils dodging school.A Department for Education and Skills source said: \"Every day in school counts.Tories say Labour's previous success regarding the issue came because it tackled the easy part of the problem by reducing authorised absence, where parents are permitted to take children out of school.Truancy has been reduced by 5% at the 128 worst hit schools through the government's Behaviour Improvement Programme."}