{"raw_text": "Protesters plan airport challenge\n \n Campaigners against the expansion of Britain's airports have begun challenging the government's plans in the High Court.\n \n BAA's expansion of Stansted Airport in Essex by building an extra runway is one of the most fiercely opposed plans. Opponents say the £2bn cost of the new runway could not be met unless cash from Heathrow and Gatwick was used. They said this is illegal under current rules and are trying to block the government from changing legislation. BAA are also owners of the airports at Heathrow and Gatwick. They have said they cannot raise the money needed for the Stansted upgrades from current landing charges. BAA also says it has attempted to involve communities in any future airport plans.\n \n Groups challenging the plans include Stop Stansted Expansion, Heathrow anti-noise campaigners HACAN Clearskies and the London boroughs of Hillingdon and Wandsworth. Their opponents are also likely to complain there was no public consultation before an extra runway was built at Luton Airport, or when it changed take-off and landing procedures at Heathrow. If the group wins, the government's future aviation plans outlined in last year's transport White Paper could be left in ruins.\n \n The campaigners will say the government did not adequately consider the building of new airports, such as one planned for the Isle of Sheppey east of London. Lord Hanningfield, leader of Essex County Council, told BBC Radio 4's Today programme: \"We are going to the High Court because we want a judge to rule there should be a proper inquiry. \"We want a judge to say there has been inadequate preparation, consultation and thought before the government came out with its Green Paper. \"Then there could be a proper debate nationally about where this extra capacity should go.\" He added: \"Politicians should not decide where runways should be.\" The Stansted expansion, apart from the building of the new runway, would also need to include new terminal buildings to deal with the projected 50m passengers who will use it every year.\n \n The airport is the hub of many of the no-frills airlines operating in the UK. But BAA has said it has attempted to involve communities in any future airport plans. At Heathrow, Gatwick, Edinburgh and Glasgow airports, BAA launched a series of consultations on blight to properties from the proposed expansion in September 2004, which will close next week. BAA is also offering to buy noise-hit properties for an index-linked, unblighted price. At Heathrow, BAA said it was working closely with all interested parties to see how the strict environmental, air quality and noise targets for a third runway can be met. At Gatwick, the company has written to homes and business likely to be affected by any extra runway.\n", "llama3.2:1b": "Protesters against Stansted Airport's expansion in Essex are challenging the government's plans to build an extra runway. Campaigners argue that the cost of building the new runway cannot be met without using money from Heathrow and Gatwick, which is illegal under current rules. They also claim that BAA has not consulted adequately with communities affected by the expansion.", "llama3.2:3b": "Protesters against airport expansion plans, including BAA's £2bn Stansted Airport upgrade, are challenging the government in the High Court over alleged illegality and lack of public consultation. Groups include Stop Stansted Expansion, HACAN Clearskies, and local councils, who claim the government did not adequately consider alternatives to new airports like one planned for the Isle of Sheppey.", "gemma2:2b": "Protesters are challenging the government's plan to expand Stansted Airport in the High Court, alleging that funding the project using money from other airports is illegal.  They argue for a public inquiry into the decision-making process. Groups including Stop Stansted Expansion and HACAN Clearskies are part of this challenge. The outcome could affect the government's future aviation plans outlined in their 2011 transport White Paper. BAA, owner of Heathrow and Gatwick airports, is involved with consultations on property blight due to expansion at all these airports.  \n", "qwen2.5:0.5b": "Campaigners against Stansted Airport expansion plan in Essex are challenging the government's plans in High Court. They argue that Heathrow and Gatwick airport expansion costs should be covered by current tax credits rather than cash from the government's budget. They also claim that BAA has not adequately considered building new airports such as those planned for East Yorkshire, London and Edinburgh. The campaigners plan to challenge the Green Paper on runways at Heathrow, Gatwick and Stansted. They are offering financial compensation for areas affected by extra capacity due to airport expansion.", "qwen2.5:1.5b": "Protesters in Britain challenge plans to expand airports at Stansted and Heathrow due to cost concerns and lack of public consultation, threatening future transport White Paper aviation policies.", "qwen2.5:3b": "Campaigners against airport expansions, particularly BAA's plans for Stansted Airport in Essex, have begun challenging these plans in the High Court. They claim that extending Heathrow and Gatwick airports to fund Stansted's expansion would violate current rules, which they argue are illegal without proper changes. The groups include Stop Stansted Expansion, HACAN, Clearskies, and London boroughs Hillingdon and Wandsworth. If successful, their challenge could invalidate the government’s aviation plans outlined in the 2008 transport White Paper. They oppose BAA's lack of public consultation on airport expansions such as Luton and are also against a proposed Stansted expansion, which would require new terminal buildings for up to 50 million annual passengers. While BAA claims it has consulted communities about future airport plans at other airports, critics argue these plans were not properly prepared or thought through before the government released its Green Paper.", "opencoder:1.5b": "The protesters challenge the government's plans in the High Court demanding an injunction on air traffic control to build an extra runway at Stansted Airport. BAA owners are also involved with the expansion, attempting to involve communities. The government has not adequately considered the building of new airports, including one planned for the Isle of Sheppey east of London. It is clear that a judge will have to rule out a proper inquiry before any changes to airport regulations can be made.\n", "smollm:1.7b": "The summary should capture the main points of the text:\n\n1. Protesters plan airport challenge\n2. BAA's expansion of Stansted Airport in Essex by building an extra runway is one of the most fiercely opposed plans\n3. Opponents say the £2bn cost of the new runway could not be met unless cash from Heathrow and Gatwick was used\n4. BAA are also owners of the airports at Heathrow and Gatwick\n5. They have said they cannot raise the money needed for the Stansted upgrades from current landing charges\n6. BAA will try to involve communities in any future airport plans\n7. The government's expansion plans outlined in last year's transport White Paper could be left in ruins if the campaigners win\n8. The campaigners will say the government did not adequately consider building new airports, such as one planned for the Isle of Sheppey east of London\n9. Lord Hanningfield, leader of Essex County Council, told BBC Radio 4's Today programme: \"We are going to the High Court because we want a judge to rule there should be a proper inquiry.\"\n10. The campaigners will say the government did not adequately prepare for the expansion and that it is unfair to taxpayers who have already paid for the extra runway\n\nThe summary should capture all key points of the text, including:\n\n1. Protesters plan airport challenge\n2. BAA's expansion of Stansted Airport in Essex by building an extra runway is one of the most fiercely opposed plans\n3. Opponents say the £2bn cost of the new runway could not be met unless cash from Heathrow and Gatwick was used\n4. BAA are also owners of the airports at Heathrow and Gatwick\n5. They have said they cannot raise the money needed for the Stansted upgrades from current landing charges\n6. BAA will try to involve communities in any future airport plans\n7. The government's expansion plans outlined in last year's transport White Paper could be left in ruins if the campaigners win\n8. The campaigners will say the government did not adequately consider building new airports, such as one planned for the Isle of Sheppey east of London\n9. Lord Hanningfield, leader of Essex County Council, told BBC Radio 4's Today programme: \"We are going to the High Court because we want a judge to rule there should be a proper inquiry.\"\n10. The campaigners will say the government did not adequately prepare for the expansion and that it is unfair to taxpayers who have already paid for the extra runway", "deepseek-r1:1.5b": "<think>\nOkay, so I've got this text about protesters planning to challenge the expansion of Britain's airports, specifically Stansted Airport in Essex. The user wants me to summarize it concisely, focusing on key ideas and details.\n\nFirst, I need to identify the main points. The article mentions that BAA (British Airline Association) is expanding Stansted Airport by adding a new runway. This is a highly opposed plan because of the £2 billion cost. They argue this is too expensive without using funds from existing airports like Heathrow and Gatwick.\n\nThe opponents are groups like Stop Stansted Expansion, HACAN Clearskies, Hillingdon and Wandsworth. Their main points include public consultation before the extra runway was built at Luton Airport and changes in take-off and landing procedures at Heathrow. They also say BAA is trying to involve communities in future plans but hasn't fully considered community input.\n\nLord Hanningfield from Essex County Council is quoted saying they're going to the High Court because of a proper inquiry based on adequate preparation, consultation, and thought by the government before their Green Paper was issued. He emphasizes that politicians shouldn't decide where runways should be built. \n\nAdditionally, the article notes that Stansted's expansion would require new terminal buildings for future passengers, especially at Heathrow. BAA has launched consultations in September 2004 on blight to properties from this expansion.\n\nI need to make sure I include all these key points: the main action (expansion of Stansted Airport), the opposition reasons (cost and funds), the actions by opponents, the leaders involved (Lord Hanningfield and BAA), and the broader implications about future aviation plans.\n</think>\n\nThe protesters plan an expansion challenge for Britain's Stansted Airport. BAA is adding a new £2 billion runway. Critics argue this is too costly without using Heathrow and Gatwick funds. Opponents include groups like Stop Stansted Expansion, HACAN Clearskies, Hillingdon, and Wandsworth. They oppose the plan due to public consultation at Luton Airport, changes in take-off procedures at Heathrow, and community involvement. Lord Hanningfield calls for a proper court inquiry based on adequate preparation and consultation. He warns politicians shouldn't decide runway locations. The expansion would require new terminal buildings for future passengers, particularly at Heathrow. BAA launched consultations in 2004 to address this plan.", "tinyllama:1.1b": "The protesters against the expansion of Britain's airports have begun chaçelenging the government's plans in the High Court. The BAA's proposed additional runway for Stansted Airport in Esssex has been fiercely opposed, with opponents calling on the government to change legislation and allow a proper consultation before any future airport plans were discussed. Initiatives by BAA at Heathrow and Gawood have also been criticized as attempts to involve communities in plans, but campaigners say that these measures should be scrapped entirely. The High Court will hear arguments about the government's plans for the Stansted expansion on December 2nd, with opponents warning that a successful court challenge could leave future aviation plans \"in ruins\".", "tinydolphin:1.1b": " The campaigners against expanding airports at Stansted Airport are set to take their challenge against government plans to the High Court. This comes after a battle between the BAA and opponents to block the expansion of Britain's airports. A decision in the case is expected by the end of October.", "phi:2.7b": " Protesters against Britain's airport expansion are challenging the government in court, claiming that their plan at Stansted Airport is illegal as it would require money from Heathrow and Gatwick airports. BAA, the owners of both Heathrow and Gatwick, have said they cannot raise the necessary funds for the new runway, leading to a legal battle over the future of airport expansion plans outlined in the transport White Paper. The campaigners are also planning to challenge Luton Airport's construction and changes at Heathrow, while opponents argue that there was no public consultation before these developments were made. If successful, the government's aviation plans could be affected, including the proposed Isle of Sheppey airport. There will be a debate over where new runways should go in Britain, with politicians not having the final say according to Lord Hanningfield, leader of Essex County Council. The expansion at Stansted Airport also involves building new terminal buildings for 50 million passengers per year.\n", "orca-mini:3b": " Protesters are challenging the government's plans to expand Britain's airports at Stansted Airport by building an extra runway. The campaigners say the cost of the new runway cannot be met unless cash from Heathrow and Gatwick is used, and that this is illegal under current rules. They also say they will challenge the government's future aviation plans outlined in last year's transport White Paper. If successful, the campaigners say the government's future aviation plans could be left in ruins.", "hermes3:3b": "Protesters challenge UK airport expansion plans in High Court. Opponents argue government's new runways are illegal under current rules, attempting to block them.", "stablelm-zephyr:3b": "Campaigners against the expansion of UK airports are challenging BAA's plan to build an extra runway at Stansted in the High Court, claiming it is illegal under current rules for the government to use funds from Heathrow and Gatwick to finance the £2bn cost. The groups opposing the plans include Stop Stansted Expansion, HACAN Clearskies and London boroughs of Hillingdon and Wandsworth. If successful, this challenge could leave the government's future aviation plans in disarray. Lord Hanningfield, leader of Essex County Council, has called for a proper inquiry into inadequate preparation and consultation before the Green Paper was released. BAA has attempted to involve communities in future airport plans across several airports but opponents argue that sufficient public consultation took place prior to Luton Airport's expansion or changes at Heathrow.", "stablelm2:1.6b": "Campaigners are challenging the government's plans for expanding Britain's airports in the High Court due to concerns over the cost of £2bn new runways at Stansted Airport. Opponents argue that cash from Heathrow and Gatwick is needed, which could not be obtained unless such funds were used. BAA is owners of Heathrow and Gatwick airports. They claim they cannot raise the necessary funds for upgrades from current landing charges and have tried to involve communities in future airport plans. Groups opposing the expansion include Stop Stansted Expansion, HACAN Clearskies, Hillingdon and Wandsworth London boroughs, and Heathrow anti-noise campaigners. If successful, it could potentially damage the government's future aviation plans outlined in last year's transport White Paper.", "granite3.1-dense:2b": "Campaigners opposing BAA's plans to expand Stansted Airport in Essex have initiated legal challenges against the government's proposed £2bn airport upgrade. They argue that using funds from Heathrow and Gatwick is illegal, as current rules prohibit such inter-airport transfers. The campaigners include Stop Stansted Expansion, HACAN Clearskies, and local boroughs of Hillingdon and Wandsworth. They also contend that there was insufficient public consultation for Luton's new runway and Heathrow's altered takeoff/landing procedures.\n\nThe campaigners aim to prevent the government from proceeding with its future aviation plans, as outlined in the 2019 transport White Paper. They emphasize that the government did not adequately consider building new airports like the proposed one on the Isle of Sheppey east of London.\n\nLord Hanningfield, Essex County Council leader, stated they are taking the government to the High Court to demand a proper inquiry into the preparation and consultation surrounding their Green Paper. He urged politicians not to decide where runways should be located. BAA has held consultations on properties potentially affected by expansion at Heathrow, Gatwick, Edinburgh, and Glasgow, offering to purchase these properties at fair market values without blight. The company is also working with impacted parties to meet environmental, air quality, and noise targets for a third runway at Heathrow.", "chatgpt-4o-latest": "Campaigners are challenging the UK government's airport expansion plans in the High Court, particularly opposing BAA's £2bn Stansted Airport expansion, arguing it is illegally funded by Heathrow and Gatwick revenues. Groups like Stop Stansted Expansion and HACAN Clearskies claim there was inadequate consultation and preparation, and they seek a judicial review. They also criticize the lack of public input on changes at Luton and Heathrow. If successful, the challenge could derail the government's aviation strategy. Essex County Council's leader calls for a national debate on airport expansion. BAA insists it has engaged communities and is offering compensation for noise-affected properties while consulting on environmental concerns at Heathrow and Gatwick.", "reference": "BAA also says it has attempted to involve communities in any future airport plans.BAA are also owners of the airports at Heathrow and Gatwick.BAA's expansion of Stansted Airport in Essex by building an extra runway is one of the most fiercely opposed plans.But BAA has said it has attempted to involve communities in any future airport plans.Their opponents are also likely to complain there was no public consultation before an extra runway was built at Luton Airport, or when it changed take-off and landing procedures at Heathrow.Opponents say the £2bn cost of the new runway could not be met unless cash from Heathrow and Gatwick was used.The Stansted expansion, apart from the building of the new runway, would also need to include new terminal buildings to deal with the projected 50m passengers who will use it every year.At Heathrow, BAA said it was working closely with all interested parties to see how the strict environmental, air quality and noise targets for a third runway can be met.At Gatwick, the company has written to homes and business likely to be affected by any extra runway."}