{"raw_text": "Profile: David Blunkett\n \n Before he resigned the position of home secretary on Wednesday, David Blunkett had been in charge of a substantial body of government portfolios including race, policing and immigration.\n \n His responsibilities in running the Home Office included civil emergencies, security, terrorism and expenditure. Named home secretary after the 2001 general election, Mr Blunkett had seen the focus on his office intensify. The attacks on the World Trade Center on 11 September 2001 heightened concern for security and immigration in particular. A Labour loyalist from a working class background Mr Blunkett, 57, had been unafraid of pushing for tough changes to Labour policy.\n \n Recently the issue of identity cards had provoked controversy with questions raised over cost and invasions of civil liberties. Mr Blunkett was also at the centre of a humiliating scandal involving the former immigration minister Beverly Hughes. Having received his full backing, Ms Hughes was forced to resign in April over abuses in the visa processing system, which she claimed to be unaware of. Mr Blunkett's own comments on immigration had prompted censure - he told refugees from Afghanistan and Kosovo to \"get back home\" to start rebuilding their countries. And he also urged people from ethnic minorities to develop a \"sense of belonging\" in Britain, telling them to speak English at home. Avoiding political correctness is second nature to the former home secretary, who spurns a metropolitan elite and \"airy fairy libertarians\" and earlier in the year coined the phrase \"liberati\", as an amalgam of \"glitterati\" and \"liberal\". Yet in January of this year he courted further controversy over his seemingly liberal reclassification of cannabis, from a Grade B to Grade C status drug .\n \n Before the recent furore, Mr Blunkett had always appeared more interested in politics than his personal life. Mr Blunkett told the Daily Telegraph in 2001 that he continued to wear his wedding ring, in spite of being a divorcee, as \"a useful way of ensuring that people don't casually think I am available\". He added: \"I am not available because I am just getting on with the job.\" Mr Blunkett entered Parliament for Sheffield Brightside in 1987, after first contesting the Sheffield Hallam seat in 1974. He is one of very few blind MPs, and was the first to reach the front bench and the Cabinet. His relaxed performances - with his guide dog by his side - at the despatch box, in the Labour Party's National Executive, and on the conference platform made it easy to forget his disability. Mr Blunkett himself described not being able to see as simply \"an inconvenience\". Using Braille for speeches, and briefed by his officials on tape, he also has a sharp tongue at times, and a pragmatic approach to politics.\n \n Mr Blunkett was schooled in Sheffield where he led the city council for seven years before entering the Commons. He chaired the Labour Party nationally, and was a unifying force in the 80s and 90s, shadowing health and education. In Tony Blair's first government Mr Blunkett was put in charge of education and employment, where he won big increases in funds for schools, while insisting on improved standards of literacy and numeracy. He was prepared to stand up to the teaching unions - which sometimes heckled his speeches - and his policy of charging university students for tuition fees was not popular. In the Labour Party he has been regarded as a loyal colleague, a conciliator who avoids factions, and a man whose humour and determination make him widely popular. There have been wry smiles as well. In 1999, his then guide dog Lucy threw up in the Chamber during the speech of his Tory opponent. Lucy was replaced by her half-sister, Sadie, a black Labrador-curly-coated retriever cross, in 2003 after nearly a decade by Mr Blunkett's side.\n", "llama3.2:1b": "David Blunkett served as home secretary before resigning on Wednesday. He held portfolios including race, policing and immigration. His tenure was marked by controversy over identity cards, immigration policy, and his comments on ethnic minorities. Blunkett was also embroiled in a scandal involving Beverly Hughes, former immigration minister. Despite his reputation for being \"airy fairy libertarian\" and \"liberati\", Blunkett's decisions were criticized as pushing for tough changes to Labour policy.", "llama3.2:3b": "David Blunkett is 57 and has been home secretary since the 2001 general election, with responsibilities including security, terrorism, and immigration. He was unafraid of pushing for tough changes to Labour policy, but also sparked controversy over issues like identity cards and immigration comments. A blind Labour politician who entered Parliament in 1987, Blunkett has a pragmatic approach to politics and is known for his humour and determination.", "gemma2:2b": "David Blunkett served as home secretary and had responsibilities including civil emergencies, security, terrorism, and expenditure.  He was known for his tough approach to policy changes and has been involved in controversies surrounding identity cards, immigration policies, and the resignation of former immigration minister Beverly Hughes.  Blunkett's candid remarks about refugees and ethnic minorities have sparked debate, but he is also known for avoiding political correctness. He has a pragmatic approach to politics and is unafraid of pushing for change. A former MP with a strong track record in education and employment, Blunkett has been praised as a unifying force in the Labour party. \n", "qwen2.5:0.5b": "David Blunkett held several important government portfolios such as race, policing and immigration, having been home secretary before the 2001 general election. He had experience with civil emergencies, security, terrorism, expenditure management, identity cards controversy, cannabis use, and former immigration minister Beverly Hughes. In July 2001, he was called to the House of Commons by then-Labour Prime Minister Tony Blair and became Home Secretary under Labour leader John Major.", "qwen2.5:1.5b": "David Blunkett resigned as Home Secretary over security and immigration concerns following the 9/11 attacks, despite being known for pushing tough Labour policy changes. He was originally appointed to run several government portfolios including race, policing, and immigration before taking up the position of home secretary in the wake of the 2001 general election. Blunkett faced controversy over identity cards, an immigration minister's abuses involving the visa processing system, and a reclassification of cannabis as a Grade C drug. He was also known for his pragmatic approach to politics, including avoiding political correctness and not seeing disability as a significant hindrance.", "qwen2.5:3b": "David Blunkett served as Home Secretary overseeing portfolios including race, policing and immigration. His tenure saw heightened attention post-9/11 for security and immigration. Blunkett supported tough policy changes but faced controversy over identity cards and immigration decisions. He resigned after a scandal involving former Immigration Minister Beverly Hughes. Known for his conservative stance on issues like identity cards and cannabis reclassification, Blunkett also revealed personal views that sometimes clashed with broader party lines. A blind Labour politician, he entered Parliament in 1987 and chaired the Labour Party nationally. His pragmatic approach made him popular within the party despite occasional controversy.", "opencoder:1.5b": "David Blunkett, a former home secretary, had several key roles at the Home Office. He held several responsibilities, including running government portfolios and securing policy-making. His main focus was on preventing abuses that could threaten security and public order in response to an 11th September attack, which prompted him to raise concerns over his role as a political figure. He also took steps to prevent potential abuse of his identity cards, particularly his visa processing system and the accusations about \"sense of belonging\" made by people from ethnic minorities.\n\nThe incident sparked controversy with questions about the cost of visas and the challenges faced in restoring public order. However, he also led a brave new world movement, which is remembered for its anti-immigration policies aimed at making countries safer for citizens. Despite his political correctness and perceived resistance to reclassification of cannabis, Mr Blunkett remained a key figure on this front during the year. He made a statement about his marriage ring as an available option for individuals seeking a simple way to connect with others without being judged by their disability.\n\nThe move into Parliament led to a shift in focus from politics to personal life, and he continued to wear his wedding ring as a means of preserving freedom. However, Mr Blunkett was also known for his tone of agitation, which added another layer of responsibility towards people's liberties.\n\nIn the 1980s, he served as the First Minister of the Labour Party, leading up to the election between 1974 and 1977. He met with a lot of applause, given his role as an independent figure in the fight for national security. His behaviour was noteworthy, especially due to his use of Braille to communicate during speeches.\n\nIn closing, Mr Blunkett's role at the Home Office was pivotal in serving as the country's leading adviser, providing valuable insights and supporting policy-making. Despite its challenges and controversies, he continued to make a difference, and his contributions continue to be recognized.\n", "smollm:1.7b": "The summary is concise and to the point, capturing the main ideas and key details of David Blunkett's profile as Home Secretary. The text highlights his responsibilities in running the Home Office, including civil emergencies, security, terrorism and expenditure. It also mentions his role in running the Home Office, including civil emergencies, security, terrorism and expenditure. The summary does not provide any explanations or reasoning processes, simply presenting the key points of the profile.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize David Blunkett's text into a concise summary that includes the key ideas and details. Let me read through the provided text carefully to identify what each section is about.\n\nFirst paragraph introduces him as home secretary before resigning and talks about his responsibilities. Then he gets involved in identity cards controversy, involving Beverly Hughes, which led to some controversy. There's also a part where he discusses immigration policies, including cannabis reclassification. \n\nHe has a personal life: wearing a wedding ring despite divorce, leading him to be known as \"just getting on with the job.\" His disability is described as not being just an inconvenience but something else. He was a schoolteacher in Sheffield and led the city council for seven years before becoming a member of the Labour Party.\n\nHe played various roles within Labour, including education and employment during Tony Blair's first government. There were policy issues about literacy and tuition fees. In 1999, he was involved with Lucy, his guide dog, causing wry smiles due to their personalities.\n\nNow, I need to condense all this into a summary without any extra details or explanations. The user wants only the summary as plain text without any explanations, formatting, or reasoning.\n\nI should start by mentioning his background and initial role. Then mention his responsibilities, identity cards issue,ney card controversy. Next, touch on immigration policies, including the cannabis change, and personal life aspects like disability and education roles in Labour. Also include some specific incidents with Lucy as a detail about his personal relationships.\n\nI need to make sure all key points are covered: his political involvement, personal life, identity issues, immigration policies, and notable events related to his disability.\n</think>\n\nDavid Blunkett was the former Home Secretary before resigning in 2001. He served under Tony Blair, leading Labour's education and employment policy that improved school funds but led to tensions with unions. His disability, described as more than an inconvenience, influenced his public persona. Beverly Hughes, former immigration minister, faced controversy over visa processing. Blunkett's personal life includes wearing a wedding ring despite divorce, being known for \"just getting on with the job,\" and guiding Labour in 1999 with Lucy, leading to wry smiles due to their personalities.", "tinyllama:1.1b": "Profile: David Blunkett\n\nBefore he resigned the position of home secretary on Wednesday, David Blunkett had been in charge of a substantial body of government portfolios including race, policing and immigration. Before the recent furore over his personal life, he had always appeared more interested in politics than his personal life.\n\nBefore the recent furore, Mr Blunkett had always appeared more interested in politics than his personal life. Mr Blunkett's responsibilites in running the Home Office included civil emergencies, security, terrorism and expendiutre. He also urged people from ethnic minorities to develop a \"sense of belonging\" in Britain, telling them to speak English at home.\n\nIn 1999, his then guide dog Lucy threw up during the speech of his Torie opponent. In 2003, his half-siester Sadie was replaced by her half-sister, Sadie, a black Labradoor-curly-coated retriever cross.", "tinydolphin:1.1b": " In 1987, David Blunkett joined the Sheffield Brightside electorate as one of very few blind MPs. Born on August 16, 1954, in Leeds, he was a member of Sheffield Brightside from 1987 until 2003 when he left to become shadow home secretary under Tony Blair. His tenure in the Cabinet included education, employment, and health, where he proposed increased funding for schools and higher education. During his tenure in the House of Commons, Blunkett was a key figure on Sheffield City Council and chaired the Labour Party from 1992 to 1997. Under Tony Blair's first government, he played a leading role in education policy, insisting on improvements in literacy and numeracy standards while pushing for funding increases for schools. Despite his blindness, Blunkett remains an effective representative of Sheffield Brightside and one of very few MPs to achieve an equal partnership with his guide dog, Lucy.", "phi:2.7b": " David Blunkett, the former home secretary, resigned from his position in 2003 due to personal reasons. During his time in office, he oversaw various government portfolios and was responsible for civil emergencies, security, terrorism, and immigration. He faced controversy over identity cards and the mishandling of the visa processing system by his former minister, Beverly Hughes. Blunkett also made headlines with his comments on immigration and cannabis reclassification. Despite being a blind MP, he maintained his personal life through his wedding ring and guide dog Lucy, whom he kept by his side until she threw up in the House of Commons.\n", "orca-mini:3b": " David Blunkett, who resigned as home secretary on Wednesday, was responsible for several government portfolios including race, policing and immigration. He had been in charge of the Home Office since the 2001 general election and was known for his tough stance on security and immigration issues. In 2003, he replaced his guide dog Lucy with Sadie, a black Labrador-curly-coated retriever cross, after nearly a decade by his side.", "hermes3:3b": "Summary: David Blunkett, former UK Home Secretary (1987-2001), held various government positions including home secretary post-2001 general election and was involved with immigration, race, policing, security, civil emergencies, expenditure, and identity cards issues. His pragmatic approach and humor made him a loyal Labour colleague despite controversies like calling refugees to get back home and changing cannabis classification from Grade B to Grade C drug status.", "stablelm-zephyr:3b": "David Blunkett resigned as home secretary amidst responsibilities for civil emergencies, security, terrorism, immigration, and expenditure at the Home Office. He was known for pushing for tough changes to Labour policy and faced controversies over issues like identity cards and his reclassification of cannabis status. A loyalist from a working-class background, Blunkett had a pragmatic approach to politics and was popular among colleagues for his humor and determination. Before entering Parliament, he chaired the Labour Party nationally, led the city council in Sheffield, and gained increases in education funds while insisting on improved literacy and numeracy standards.", "stablelm2:1.6b": "David Blunkett served as home secretary and held various portfolios including race, policing, and immigration. As the Home Office director, his responsibilities included civil emergencies, security, terrorism, and expenditure. Blunkett faced controversy over issues such NID cards, his comments on refugees, and the reclassification of cannabis. Despite being blind, he entered Parliament in 1983 and became one of only a few blind MPs. As education and employment minister under Tony Blair's first government, he won significant funding for schools while insisting on improved literacy and numeracy standards. Blunkett is known for his pragmatic approach to politics and humor, but has also been a unifying force in the Labour Party.", "granite3.1-dense:2b": "David Blunkett, a 57-year-old former home secretary and blind MP for Sheffield Brightside since 1987, was known for his unwavering commitment to his role and Labour Party. He oversaw extensive portfolios, including race, policing, immigration, civil emergencies, security, terrorism, and expenditure. Appointed in 2001 following the 9/11 attacks, Blunkett's tenure was marked by tough changes to Labour policy, such as increased security measures and controversial ideas like identity cards and cannabis reclassification.\n\nBlunkett faced criticism for his comments urging refugees to return home and ethnic minorities to adopt a sense of British belonging. He avoided political correctness, famously coining the term \"liberati\" (a blend of \"glitterati\" and \"liberal\"). Despite being divorced, he wore his wedding ring as a reminder of his availability for work rather than personal life.\n\nBlunkett's leadership began in Sheffield Brightside in 1987, following his initial election to Sheffield Hallam in 1974. He led the city council for seven years before entering Parliament and became Labour Party chairman. In Tony Blair's first government, he improved school funding while pushing for literacy and numeracy standards. Though controversial, his policy of charging university students for tuition fees was not popular.\n\nThroughout his career, Blunkett's disability went largely unnoticed due to his confident performances with his guide dog by his side. He used Braille for speeches and briefings on tape. His humorous nature and determination made him widely liked within the Labour Party. In 1999, his guide dog Lucy vomited in the House during an opposition speech, leading to her replacement by Sadie, a black Labrador-curly-coated retriever cross, in 2003.", "chatgpt-4o-latest": "David Blunkett, former UK home secretary, managed key government portfolios including race, policing, immigration, security, and terrorism. Appointed in 2001, his tenure saw heightened focus on security post-9/11. A Labour loyalist from a working-class background, he pushed for tough policy changes, including controversial identity cards and immigration remarks. He backed former immigration minister Beverly Hughes, who resigned over visa processing abuses. Blunkett, known for his blunt style, also reclassified cannabis from Grade B to C. A blind MP, he entered Parliament in 1987 and was the first to reach the Cabinet. Previously, he led Sheffield City Council, chaired the Labour Party, and served as education secretary, securing school funding while enforcing higher standards. Despite clashes with teaching unions over tuition fees, he remained a respected and pragmatic politician. His guide dogs, including Lucy and later Sadie, became notable companions during his career.", "reference": "Mr Blunkett was also at the centre of a humiliating scandal involving the former immigration minister Beverly Hughes.Mr Blunkett was schooled in Sheffield where he led the city council for seven years before entering the Commons.Named home secretary after the 2001 general election, Mr Blunkett had seen the focus on his office intensify.In Tony Blair's first government Mr Blunkett was put in charge of education and employment, where he won big increases in funds for schools, while insisting on improved standards of literacy and numeracy.A Labour loyalist from a working class background Mr Blunkett, 57, had been unafraid of pushing for tough changes to Labour policy.Mr Blunkett himself described not being able to see as simply \"an inconvenience\".Mr Blunkett entered Parliament for Sheffield Brightside in 1987, after first contesting the Sheffield Hallam seat in 1974.Before the recent furore, Mr Blunkett had always appeared more interested in politics than his personal life.Lucy was replaced by her half-sister, Sadie, a black Labrador-curly-coated retriever cross, in 2003 after nearly a decade by Mr Blunkett's side.Mr Blunkett told the Daily Telegraph in 2001 that he continued to wear his wedding ring, in spite of being a divorcee, as \"a useful way of ensuring that people don't casually think I am available\".Before he resigned the position of home secretary on Wednesday, David Blunkett had been in charge of a substantial body of government portfolios including race, policing and immigration.Mr Blunkett's own comments on immigration had prompted censure - he told refugees from Afghanistan and Kosovo to \"get back home\" to start rebuilding their countries."}