{"raw_text": "MPs quiz aides over royal income\n \n Senior officials at the two bodies generating private income for the Queen and Prince of Wales are to be questioned by MPs.\n \n Aides from the Duchy of Lancaster and Duchy of Cornwall will appear before the Commons Public Accounts Committee. It has been reported they could be questioned about Prince Charles' spending on Camilla Parker Bowles. But BBC correspondent Peter Hunt said they are not responsible for how money is spent and may be unable to answer. Duchy officials, who will appear before the committee on Monday, are only responsible for generating money. The Duchy of Lancaster provides the Queen's private income, while the Duchy of Cornwall provides Prince Charles' annual income. The Duchy of Cornwall is a 140,000-acre estate across 25 counties, and also includes residential properties, shops, offices, stocks and shares. It was set up in 1337 by King Edward III to provide income for successive heirs to the throne. It covers the cost of the prince's public and private life - neither Charles, nor William and Harry, receive taxpayers' money from the Civil List. However, the Prince of Wales did receive over £4m from government departments and grants-in-aid in 2003-4. The duchy last year generated almost £12m. The prince has voluntarily paid income tax - currently 40% - since 1993.\n", "llama3.2:1b": "MPs will quiz aides responsible for generating private income for the Queen and Prince of Wales over royal spending, including on Camilla Parker Bowles. Aides from the Duchy of Lancaster and Cornwall will appear before the Commons Public Accounts Committee.", "llama3.2:3b": "MPs will question aides from the Duchy of Lancaster and Duchy of Cornwall, including potential questions about Prince Charles' spending on Camilla Parker Bowles, over the generation of private income for the Queen and Prince of Wales. The Duchies are responsible only for generating money, not how it is spent, and officials may struggle to answer.", "gemma2:2b": "MPs will question officials from the Duchy of Lancaster and Duchy of Cornwall about private spending by Prince Charles. These officials generate income but not how money is spent, potentially limiting their ability to answer questions. The duchy covers Prince Charles' expenses, including both public and private life.  He receives no taxpayer funding from the Civil List. \n", "qwen2.5:0.5b": "Aides from the Duchy of Lancaster and the Duchy of Cornwall will appear before the Commons Public Accounts Committee to question Prince Charles' spending on Camilla Parker Bowles' royal income, but they are not responsible for how money is spent. The duchies provide the Queen's private income and Prince Charles'.", "qwen2.5:1.5b": "Members of Parliament will question aides related to the royal income, including Prince Charles' spending on Camilla Parker Bowles, while Duchy officials responsible for generating money for both the Queen and Prince of Wales could face questioning about their role and responsibilities.", "qwen2.5:3b": "MPs will question aides of Duchy of Lancaster and Duchy of Cornwall about potential Prince Charles spending on Camilla Parker Bowles. However, the duchies are responsible only for generating income and may not be able to fully answer questions. The Duchy of Cornwall provides annual income for Prince Charles, including income from an estate covering 140,000 acres in 25 counties, residential properties, shops, offices, stocks and shares. While the prince doesn't receive taxpayers' money from the Civil List, he did receive over £4m from government departments and grants-in-aid in 2003-4. Last year, the Duchy generated almost £12m. Charles has voluntarily paid income tax since 1993 at a rate of 40%.", "opencoder:1.5b": "The output text is quite long, hence here's a brief summary:\n\nSenior officials at the two bodies generating private income for the Queen and Prince of Wales are to be questioned by MPs. Aides from the Duchy of Lancaster and Duchy of Cornwall will appear before the Commons Public Accounts Committee and report on Prince Charles' spending on Camilla Parker Bowles, but they are not directly responsible for how money is spent. The Duchy of Lancaster provides Queen's private income, while the Duchy of Cornwall provides Prince Charles' annual income. It covers the cost of the prince's public and private life - neither Charles, nor William and Harry, receive taxpayers' money from the Civil List but the Prince of Wales did receive over £4m from government departments and grants-in-aid in 2003-4. The duchy last year generated almost £12m. The Prince has voluntarily paid income tax since 1993.\n", "smollm:1.7b": "The summary is concise, but it does not provide any additional information or explanations about the text. It only presents the main points and key ideas in a brief and clear manner.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about MPs quiz aides questioning officials related to royal income. Let me read through it carefully.\n\nFirst paragraph: MPs are assigning quiz aides to investigate income generated by UK MPs for the Queen and Prince of Wales. The senior officials from both bodies will be questioned by MPs. Interesting angle on public-private splitting, maybe targeting some reforms or something?\n\nSecond paragraph: They mention a specific group from the Duchy of Cornwall being questioned. Specifically about Peter Hunt saying they aren't responsible for how money is spent, maybe? But some of them are accountable for generating income. That makes sense because the Duchy deals with their own taxes and affairs.\n\nThird part: The Duchy of Lancaster provides income to the Queen, while the Duchy of Cornwall provides income to Prince Charles each year. Their property details are provided—140,000 acres in 25 counties, including stuff like residential homes, shops, offices, stocks, and shares. This sounds like a big estate that's been around for over a thousand years.\n\nFourth paragraph: The Duchy of Cornwall was set up by King Edward III to provide income for the next king (Charles II) after his death. They're responsible for taxes from the government and grants-in-aid in 2003-4, so they definitely handle money flow properly. They made over £12 million last year.\n\nFifth paragraph: The Prince of Wales has paid income tax since 1993 at 40%. That's a significant figure; maybe he's trying to show that the system is working or needs reforming? He also received money from various sources, which isn't directly related to public-private splitting but shows his financial stability.\n\nPutting it all together, I need to highlight the main points: MPs are questioning officials for income generation related to royal taxes, a specific group in Cornwall will be questioned, their responsibilities and how they manage finances. Also, some responsible, others not so much, given public interest issues.\n</think>\n\n MPs are assigning quiz aides to investigate income generated by UK MPs for the Queen and Prince of Wales, generating private income for them. Aides from the Duchy of Lancaster (Queen) and Duchy of Cornwall (Prince Charles) will be questioned before the Commons Public Accounts Committee. The Duchy of Cornwall is responsible for generating Prince Charles' income annually, providing a 140,000-acre estate across 25 counties with residential properties, shops, offices, stocks, shares, and public expenses. They were set up by King Edward III to fund successive monarchs' taxes since 1337. The Duchy generated over £12 million last year. The Prince of Wales has paid income tax at 40% from 1993 to the present.", "tinyllama:1.1b": "MPs to question senior officials at Duchy of Lancaster and Duchy of Cornwall over Queen's private income, which is managed by the Prince of Wales. Aides from the two bodies responsible for generating money are expected to appear before the Commons Public Accounts Committee on Monday. The Duchy of Lancaster generates annual public funds, while the Duchy of Cornwall provides Prince Charles' private income, including income from his estate's assets. This is overseen by the Prince of Wales and covers expenses associated with his royal duties as well as providing income for future generations. The prince voluntarily pays 40% tax since 1993.", "tinydolphin:1.1b": " Questioning senior officials at the Duchy of Lancaster and Duchy of Cornwall will be aired by MPs, according to a report from BBC correspondent Peter Hunt. This move seeks to unravel any possible misappropriation or abuse of funds generated through private income for Prince Charles. The investigation is part of the ongoing Commons Public Accounts Committee's efforts to scrutinize financial matters related to the royal family. The duchy generates private income for the Queen and Prince of Wales, and the aides from these bodies will be questioned by MPs.\n", "phi:2.7b": " Senior officials at the Duchy of Lancaster and Duchy of Cornwall will be questioned by the Commons Public Accounts Committee about private income for the Queen and Prince of Wales, including spending on Camilla Parker Bowles by Prince Charles. The duchies have been generating money since they were set up in \n", "orca-mini:3b": " MPs will question senior officials from the Duchy of Lancaster and Duchy of Cornwall, who are responsible for generating private income for the Queen and Prince of Wales. However, the aides may not be able to answer questions about Prince Charles' spending on Camilla Parker Bowles or the Duchy of Cornwall's annual income. The Duchy of Lancaster provides the Queen's private income, while the Duchy of Cornwall provides Prince Charles' annual income.", "hermes3:3b": "MPs to question aides over Queen, Prince of Wales's private income generating bodies.", "stablelm-zephyr:3b": "Senior officials from the Duchy of Lancaster and Duchy of Cornwall will be questioned by MPs, focusing on generating private income for the Queen and Prince of Wales respectively. While the Duchy of Lancaster provides the Queen's private income, the Duchy of Cornwall generates Prince Charles' annual income. The two estates cover the cost of the prince's public and private life and neither Charles nor William and Harry receive taxpayers' money from the Civil List. In 2003-04, the Prince of Wales received over £4m from government departments and grants-in-aid while the duchy generated almost £12m in that year. Since 1993, Prince Charles has voluntarily paid income tax at a rate of 40%.", "stablelm2:1.6b": "Senior officials involved in generating income for Queen and Prince Charles will be questioned by MPs, as aides from the Duchy of Lancaster and Cornwall could face scrutiny over Prince Charles' spending on Camilla Parker Bowles. However, BBC correspondent Peter Hunt clarifies that these aides are not responsible for how money is spent and might not be able to answer questions. The Duchy of Lancaster generates Queen's private income while the Duchy of Cornwall provides Prince Charles' annual income. Both duchies are significant sources of income for heirs to the throne, with the Duchy of Cornwall dating back to King Edward III. It covers Prince Charles' public and private life and last year generated almost £m.", "granite3.1-dense:2b": "MPs are set to question senior aides from the Duchy of Lancaster and Duchy of Cornwall, which generate private income for Queen Elizabeth II and Prince Charles, respectively. These officials will likely be asked about Prince Charles' spending on his wife, Camilla Parker Bowles. However, according to reports, they might not have direct responsibility for expenditures and may struggle to provide comprehensive answers. The Duchy of Lancaster supports the Queen's private income, while the Duchy of Cornwall, established in 1337, finances Prince Charles' public and private life. This 140,000-acre estate spans across 25 counties, encompassing properties, businesses, stocks, and shares. Despite not receiving taxpayer funds from the Civil List, the Duchy of Cornwall generated nearly £12 million in 2021. Prince Charles voluntarily pays income tax at a rate of 40% since 1993. In 2003-2004, he received over £4 million from government departments and grants-in-aid.", "chatgpt-4o-latest": "Senior officials from the Duchy of Lancaster and Duchy of Cornwall will be questioned by MPs about the private income of the Queen and Prince of Wales. While there is speculation about Prince Charles' spending on Camilla Parker Bowles, the officials are only responsible for generating income, not its expenditure. The Duchy of Lancaster funds the Queen’s private income, while the Duchy of Cornwall, a 140,000-acre estate established in 1337, provides Prince Charles' income. The estate covers his public and private expenses, as well as those of Princes William and Harry, without relying on the Civil List. In 2003-4, Charles received over £4m from government sources, and the Duchy generated nearly £12m last year. He has voluntarily paid 40% income tax since 1993.", "reference": "The Duchy of Lancaster provides the Queen's private income, while the Duchy of Cornwall provides Prince Charles' annual income.Aides from the Duchy of Lancaster and Duchy of Cornwall will appear before the Commons Public Accounts Committee.Duchy officials, who will appear before the committee on Monday, are only responsible for generating money.Senior officials at the two bodies generating private income for the Queen and Prince of Wales are to be questioned by MPs.The prince has voluntarily paid income tax - currently 40% - since 1993."}