{"raw_text": "Clarke to press on with ID cards\n \n New Home Secretary Charles Clarke has vowed to plough on with plans for ID cards despite a call for him to \"pause for thought\" from Charles Kennedy.\n \n The Lib Dem leader said David Blunkett's resignation was a \"good opportunity\" to question whether the legislation was necessary. But Mr Clarke said he had supported the plans when Mr Blunkett argued for them in Cabinet and he supported them now. \"ID cards are a means to creating a more secure society,\" he said. Mr Clarke acknowledged how the measure was introduced remained a matter for debate but he said legislation had already been \"significantly influenced\" by the recommendations of the Commons' home affairs committee.\n \n The issue would be debated in Parliament next Monday as scheduled he insisted. Earlier Mr Kennedy, whose party opposes the ID cards plan as \"deeply flawed\" said with Christmas coming up the new home secretary had time to think again. He told BBC Radio 4's Today programme that Mr Clarke had been reported to be less enthusiastic about ID cards than his predecessors. \"Wouldn't this be a good opportunity for a new home secretary, a new broom, to sweep clean in this respect and why do we need this legislation in the first place?\" he asked. Earlier this week the Tories announced they would back the government's plans although Michael Howard was forced to deny the shadow cabinet was split over its decision.\n \n They had decided to support the plans as the police said they would help fight terror, crime and illegal immigration. Among those reported to have serious reservations over the strategy were senior shadow cabinet members David Davis, Oliver Letwin and Tim Yeo. The chairman of the Bar Council, Guy Mansfield QC has warned there is a real risk that people on the \"margins of society\" would be driven into the hands of extremists. \"What is going to happen to young Asian men when there has been a bomb gone off somewhere? They are going to be stopped. If they haven't [ID cards] they are going to be detained.\"\n \n The Home Office says people will pay £85 for a passport and ID card together or a undecided fee for a separate ID card. The first cards would be issued in 2008 and when he was introducing the bill, Mr Blunkett suggested Parliament could decide in 2011 or 2012 whether to make it compulsory for everybody to own the cards, although not to carry them. The new bill will also create new criminal offences on the possession of false identity documents. And there will be civil penalties including a fine of up to £1,000 fine for people who fail to say they have moved house or changed other details and of up to £2,500 for failing to sign up if the cards become compulsory. The scheme will be overseen by a new independent watchdog.\n", "llama3.2:1b": "Charles Clarke has vowed to press on with plans for ID cards despite opposition from Charles Kennedy. Kennedy said he was hesitant due to concerns about the legislation's necessity. However, Clarke argued that ID cards are a means to create a more secure society and have supported them in Cabinet. The issue will be debated in Parliament next Monday as scheduled by Clarke.", "llama3.2:3b": "Charles Clarke vows to continue with ID card plans despite Lib Dem call to pause for thought, saying they are necessary for creating a more secure society, with Parliament set to debate the issue next Monday.", "gemma2:2b": "Home Secretary Clarke intends to continue with plans for national ID cards despite calls for pause. He believes the measure enhances security and cites support from the Commons' home affairs committee. Opposition leader Kennedy urges reconsidering the need for ID cards and suggests a fresh approach, while some Tory members have already pledged support. Concerns remain regarding potential misuse of ID and its impact on marginalized communities.  The scheme involves costs for cards, mandatory registration in 2008 (optional carrying), new criminal offenses for possession of false documents, civil penalties for non-compliance. \n", "qwen2.5:0.5b": "Charles Clarke vows ID card legislation despite cabinet disagreement. IDs are a way to create a safer society. The measure was introduced in 1986 but has been significantly influenced by Commons home affairs committee's report. ID cards can help fight crime and terrorism, but some people worry about people on the \"margins of society\" being targeted.", "qwen2.5:1.5b": "Clarke vows to continue ID card plans despite opposition from Charles Kennedy, citing Blunkett's resignation as an opportunity to question their necessity. Parliament next Monday will debate the issue.", "qwen2.5:3b": "Charles Clarke plans to proceed with ID card proposals despite Charles Kennedy's call for pause. Clarke supported the measures when David Blunkett advocated them in Cabinet and now supports them. ID cards aim to secure society, influenced by Home Affairs Committee recommendations. The issue will be debated in Parliament next Monday as scheduled. Opposition argues it could be a \"good opportunity\" to reconsider plans due to Christmas approaching. Concerns include risk of marginalised individuals being radicalized and civil penalties for not updating personal details or signing up if compulsory.", "opencoder:1.5b": "Clarke to press on with ID cards\n\nNew Home Secretary Charles Clarke has vowed to plough on with plans for ID cards despite a call for him to \"pause for thought\" from Charles Kennedy.\n\nThe Lib Dem leader said David Blunkett's resignation was a \"good opportunity\" to question whether the legislation was necessary. But Mr Clarke said he had supported the plans when Mr Blunkett argued for them in Cabinet and he supported them now. \"ID cards are a means to creating a more secure society,\" he said.\n\nMr Clarke acknowledged how the measure was introduced remained a matter for debate but he said legislation had already been \"significantly influenced\" by the recommendations of the Commons' home affairs committee. The issue would be debated in Parliament next Monday as scheduled he insisted.\n\nEarlier Mr Kennedy, whose party opposes the ID cards plan as \"deeply flawed\", told BBC Radio 4's Today programme that Mr Clarke had been reported to be less enthusiastic about ID cards than his predecessors. \"Wouldn't this be a good opportunity for a new home secretary, a new broom, to sweep clean in this respect and why do we need this legislation in the first place?\" he asked.\n\nEarlier this week the Tories announced they would back the government's plans although Michael Howard was forced to deny the shadow cabinet was split over its decision. They had decided to support the plans as the police said they would help fight terror, crime and illegal immigration. Among those reported to have serious reservations over the strategy were senior shadow cabinet members David Davis, Oliver Letwin and Tim Yeo. The chairman of the Bar Council, Guy Mansfield QC has warned there is a real risk that people on the \"margins of society\" would be driven into the hands of extremists.\n\nThe Home Office says people will pay £85 for a passport and ID card together or a undecided fee for a separate ID card. The first cards would be issued in 2008 and when he was introducing the bill, Mr Blunkett suggested Parliament could decide in 2011 or 2012 whether to make it compulsory for everybody to own the cards, although not to carry them. The new bill will also create new criminal offences on the possession of false identity documents. And there will be civil penalties including a fine of up to £1,000 fine for people who fail to say they have moved house or changed other details and of up to £2,500 for failing to sign up if the cards become compulsory. The scheme will be overseen by a new independent watchdog.\n", "smollm:1.7b": "Clarke to press on with ID cards despite calls for pause", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely while preserving key ideas and details. Let me read through it carefully.\n\nFirst paragraph introduces Charles Clarke as New Home Secretary, intending to push through ID cards despite being called \"pause for thought\" by his predecessor, Charles Kennedy. Lib Dem leader David Blunkett's resignation was a suggestion to consider if the legislation is necessary, but Clarke agreed with him, supporting the plans when he argued for them.\n\nNext, Clarke mentions that ID cards are meant to build a more secure society, acknowledging the debate over whether the measure should be introduced but noting it has already been influenced by recommendations from the Commons' home affairs committee. The debate will happen next Monday.\n\nEarlier, Kennedy, opposing ID cards due to their flawed plan, seemed willing to reconsider and suggested considering how ID cards would sweep clean in that context. There were concerns among senior cabinet members about issues like stopping young Asian men if they don't have ID cards, with some warning of people from society margins facing extremism.\n\nThe Home Office will charge £85 for a passport and ID card together or an undecided fee for separate cards. The plan includes making the cards compulsory, creating new criminal offences on false identity documents, civil penalties, etc., with a new watchdog overseeing them.\n\nNow, I need to extract key points: Clarke's intention despite Kennedy's pause, support when Blunkett argued, the role of the Home Office in charges and penalties, and the fears about extreme targeting of certain groups.\n\nI should combine these into a concise summary, making sure all main ideas are covered without unnecessary details.\n</think>\n\nClarke plans to push through ID cards despite being prompted by Kennedy's call. He supports the legislation after Mr. Blunkett's argument and acknowledged its introduction will remain debated. The Home Office will charge £85 for ID cards together or separately, with measures including false documents, civil penalties, and a new watchdog overseeing them. Concerns include targeting specific groups, particularly young Asian men, who may face extremism if they lack ID cards.", "tinyllama:1.1b": "The article describes that New Home Secretary Charles Clarke has vowed to plough on with plans for ID cards despite a call from Charles Kennedy for him to \"pause for thought\". He supports the legislation and has already supported it in Cabinet meetings, and will debate it next Monday as scheduled. Earlier this week, Home Office spokesperson Guy Mansfield QC announced that the Bar Council was concerned about people's access to ID cards, warning of real risks for those on the \"margin\" or marginalized groups. The Home Office has introduced new measures for criminal offenses related to the possession of false identity documents and penalties for not signing up the scheme.", "tinydolphin:1.1b": " ID cards are a means to create a more secure society and facilitate electronic identification of individuals, enabling seamless cross-border travel and commerce. Despite some concerns raised about the necessity of such legislation, Home Secretary Charles Clarke has vowed to press on with plans for ID cards. The plans were initially introduced by David Blunkett and supported by Charles Kennedy when he argued in Cabinet.\n\nID cards hold significant information about individuals and facilitate electronic identification through biometric technology. As a result of these measures, there are concerns that the cards could be misused to identify individuals or facilitate criminal activity. To address these concerns, the Home Office has introduced new civil penalties and an independent watchdog to oversee the rollout of ID cards. \n\nThe new home secretary, Charles Clarke, is determined to push through with the plans despite some critics questioning whether they are necessary. Clarke acknowledges that the measures were introduced by previous Home Office leaders, but he argues that legislation has already been \"significantly influenced\" by the recommendations of the Commons' home affairs committee.\n\nThe new bill will create new criminal offences on the possession of false identity documents, and there will be civil penalties including a fine of up to £1,000 for people who fail to say they have moved house or changed other details and of up to £2,500 for failing to sign up if the cards become compulsory. The scheme will also be overseen by a new independent watchdog.\n", "phi:2.7b": " Charles Clarke plans to continue with ID card legislation despite calls for him to \"pause for thought\" from former home secretary David Blunkett. Home Office Secretary has said that the plan is necessary in creating a more secure society, and that recent changes made to the bill were influenced by the recommendations of the Commons' home affairs committee. The issue will be debated in Parliament next week. Meanwhile, some senior shadow cabinet members have serious reservations over the strategy, while others are supporting it. The Home Office has said people can pay £85 for a passport and ID card together or £50-£65 for an ID card only. A separate ID card is not necessary.\n", "orca-mini:3b": " New Home Secretary Charles Clarke has vowed to plough on with plans for ID cards despite calls for him to \"pause for thought\" from Charles Kennedy and reservations from senior shadow cabinet members. The Lib Dem leader said David Blunkett's resignation was a \"good opportunity\" to question whether the legislation was necessary. Mr Clarke acknowledged how the measure was introduced remained a matter for debate but he said legislation had already been \"significantly influenced\" by the recommendations of the Commons home affairs committee. The issue would be debated in Parliament next Monday as scheduled, he insisted. Among those reported to have serious reservations over the strategy were senior shadow cabinet members David Davis, Oliver Letwin and Tim Yeo. The chairman of the Bar Council warned there was a real risk that people on the \"margins of society\" would be driven into the hands of extremists.", "hermes3:3b": "Charles Clarke continues ID card plans despite Lib Dem demand for pause. Clarke supports ID cards & claims legislation significantly influenced by home affairs committee's recommendations. Parliamentary debate scheduled next Monday.", "stablelm-zephyr:3b": "New Home Secretary Charles Clarke plans to push forward with ID card legislation despite calls from Lib Dem leader Charles Kennedy to \"pause for thought.\" Kennedy argues that David Blunkett's resignation is a good opportunity to question the necessity of the bill, but Clarke maintains his support for the plan, stating that ID cards create a more secure society. The issue will be debated in Parliament next Monday as scheduled, and while the Tories have announced their support for the government's plans, some senior shadow cabinet members have serious reservations. The Home Office proposes an £85 fee for both passport and ID card together or a separate undecided fee for just an ID card, with the first cards set to be issued in 2008. New criminal offenses and civil penalties will also be established under the scheme, overseen by an independent watchdog.", "stablelm2:1.6b": "New Home Secretary Charles Clarke plans to continue with ID card proposals despite calls from opposition leader Charles Kennedy and Lib Dem leader Charles Kennedy. Clarke supports plans when David Blunkett argued in Cabinet and now endorses them, citing the need for creating a more secure society. The bill will create new criminal offenses for possessing false identity documents, civil penalties, and mandatory ID cards with optional compulsory ownership. The scheme will be overseen by an independent watchdog.", "granite3.1-dense:2b": "New Home Secretary Charles Clarke remains committed to implementing ID card plans, dismissing calls from Lib Dem leader Charles Kennedy to pause or reconsider the initiative. Kennedy had seen Blunkett's resignation as an opportunity to question the necessity of the legislation, which he views as \"deeply flawed.\" Despite Kennedy's reservations and those expressed by some senior Conservatives, Clarke maintains that ID cards are crucial for enhancing societal security. The issue will be debated in Parliament next week as scheduled.\n\nThe proposed ID cards will cost £85 when purchased together with a passport or £130 if only an ID card is needed. They are expected to be issued from 2008, with a potential compulsory requirement for all citizens in the following years. The bill also introduces new criminal offenses for possessing false identity documents and imposes fines for failing to update personal information or sign up if compulsory. A separate independent watchdog will oversee the scheme, addressing concerns that vulnerable individuals might be exploited by extremist groups due to potential ID card-related stops and detentions.", "chatgpt-4o-latest": "New Home Secretary Charles Clarke has pledged to continue with ID card plans despite opposition from Lib Dem leader Charles Kennedy, who urged reconsideration following David Blunkett's resignation. Clarke reaffirmed his support, citing security benefits, while acknowledging ongoing debate on implementation. The issue will be debated in Parliament as scheduled. The Tories back the plan, believing it aids in combating terror, crime, and illegal immigration, though some senior members have reservations. Critics, including the Bar Council chairman, warn of potential discrimination. The Home Office plans to charge £85 for a passport and ID card, with the first cards issued in 2008. Parliament may decide by 2011 or 2012 whether to make them compulsory. The bill introduces penalties for failing to update details and new offences for possessing false identity documents, with oversight by an independent watchdog.", "reference": "Earlier Mr Kennedy, whose party opposes the ID cards plan as \"deeply flawed\" said with Christmas coming up the new home secretary had time to think again.New Home Secretary Charles Clarke has vowed to plough on with plans for ID cards despite a call for him to \"pause for thought\" from Charles Kennedy.The Home Office says people will pay £85 for a passport and ID card together or a undecided fee for a separate ID card.\"ID cards are a means to creating a more secure society,\" he said.The first cards would be issued in 2008 and when he was introducing the bill, Mr Blunkett suggested Parliament could decide in 2011 or 2012 whether to make it compulsory for everybody to own the cards, although not to carry them.He told BBC Radio 4's Today programme that Mr Clarke had been reported to be less enthusiastic about ID cards than his predecessors.But Mr Clarke said he had supported the plans when Mr Blunkett argued for them in Cabinet and he supported them now.If they haven't [ID cards] they are going to be detained.\"Mr Clarke acknowledged how the measure was introduced remained a matter for debate but he said legislation had already been \"significantly influenced\" by the recommendations of the Commons' home affairs committee."}