{"raw_text": "EU China arms ban 'to be lifted'\n \n The EU embargo on arms exports to China is likely to be lifted in the next six months despite US objections, UK Foreign Secretary Jack Straw has said.\n \n The 15-year-old ban was imposed in the aftermath of China's crackdown on protesters in Tiananmen Square. Mr Straw told a Commons select committee human rights concerns over China remained. But he said it was wrong to put China under the same embargo as countries such as Zimbabwe and Burma.\n \n In December, the EU pledged to work towards lifting the ban but said it was not ready to do so yet. The EU's move was welcomed at the time by Beijing, which described the embargo as a \"product of the Cold War\". German Chancellor Gerhard Schroeder and French President Jacques Chirac have repeatedly called for the embargo to be lifted. Britain has been more cautious on the issue, but on Wednesday Mr Straw said he also wanted it to end. \"I have long understood China's argument, that to lump them in with, say, Burma and Zimbabwe is not appropriate and I don't think it is,\" he told the joint committee on Strategic Export Controls. He said \"it is more likely than not\" that the ban would be lifted before Britain takes over the presidency of the EU from Luxembourg in July. But he said an EU code of conduct would prevent an increase in the number of arms being exported to the country. \"If it is lifted we will end up with as effective arms controls in relation to China as we have now.\"\n \n Mr Straw said the US government was suspicious of \"the motives of some other countries within the EU\" in wanting the ban lifted. But he said many of Washington's objections were based on a \"lack of information and understanding\" of how export control guidelines worked in EU countries. And \"intense discussions\" were taking place with US officials to convince them it was the right thing to do. Washington is thought to fear it would lead to a buying spree for arms that could be used by China to threaten its diplomatic rival Taiwan. US officials say they are not satisfied the mechanisms in the EU code of conduct are robust enough to prevent abuses. US Undersecretary of State John Bolton is meeting British officials this week to press the case for keeping the embargo.\n", "llama3.2:1b": "The EU's 15-year-old ban on arms exports to China is likely to be lifted in the next six months despite US objections, with UK Foreign Secretary Jack Straw saying that it was wrong to put China under a similar embargo as Zimbabwe and Burma. The EU has pledged to work towards lifting the ban but has not yet done so. China welcomed the move, describing it as a \"product of the Cold War\".", "llama3.2:3b": "EU likely to lift 15-year-old arms ban on China in next six months, despite US objections, with UK Foreign Secretary Jack Straw saying it's not fair to lump China in with countries like Zimbabwe and Burma, and a code of conduct will be put in place to prevent abuses.", "gemma2:2b": "The EU is likely to lift its 15-year-old arms embargo on China within the next six months despite US objections.  Mr. Straw, UK Foreign Secretary, believes it's inappropriate to apply the same embargo to China as countries with poor human rights records like Zimbabwe and Burma.  He said an EU code of conduct will ensure similar control mechanisms exist as before the lift. The US is skeptical about the motives behind lifting the embargo and its potential impact on Taiwan. \n", "qwen2.5:0.5b": "Key points:  \n- EU-China arms ban likely to be lifted soon despite US objections.\n- 15-year-old embargo imposed in aftermath of China's crackdown on protesters in Tiananmen Square.\n- UK Foreign Secretary Jack Straw believes EU would lift it, but not ready yet.  \n- EU pledges work towards lifting but still wants it ended.", "qwen2.5:1.5b": "The European Union's 15-year ban on arms exports to China could be lifted soon due to Britain's stance, despite objections from the United States. The EU has pledged to lift the ban but warns that an increase in arms exports is unlikely unless a code of conduct is established to prevent abuses. China sees the embargo as a Cold War relic, while the US worries it could lead to arms sales to Taiwan.", "qwen2.5:3b": "The EU's 15-year embargo on arms exports to China is expected to be lifted within the next six months, despite US objections. UK Foreign Secretary Jack Straw argues that lifting the ban aligns with China’s human rights concerns and should not place them in the same category as countries like Zimbabwe and Burma. The move is supported by German Chancellor Gerhard Schroeder and French President Jacques Chirac, while Britain has been more cautious. Straw believes an EU code of conduct will ensure effective controls on arms exports to China. However, US officials are concerned about potential abuse of export guidelines and want to maintain the embargo due to fears it could lead to increased arms purchases by China for use against Taiwan. Bolton is meeting with British officials to press this case.", "opencoder:1.5b": "The EU China arms ban 'to be lifted' is a likely outcome for lifting an arms embargo on exports from China in six months under US government opposition, given the context and intentions of various countries within EU. It's a challenge to lift this ban despite US concerns as it is against international humanitarian standards. The US Government is suspicious about other EU countries' motivations in wanting the ban lifted, as EU export control guidelines may be too stringent and could lead to abuses by China. Meanwhile, US officials are ready to hold this case for a more informed decision.\n", "smollm:1.7b": "The summary above captures the main ideas and key points from the original text, preserving the tone and style of the original while summarizing it concisely. The summary should include:\n\n1. The EU's arms export ban on China is likely to be lifted in the next six months despite US objections.\n2. The EU embargo was imposed in the aftermath of China's crackdown on protesters in Tiananmen Square.\n3. UK Foreign Secretary Jack Straw said a human rights concern over China remains, but he said it was wrong to put China under the same embargo as countries such as Zimbabwe and Burma.\n4. In December, the EU pledged to work towards lifting the ban but said it was not ready to do so yet. The EU's move was welcomed at the time by Beijing, which described the embargo as a \"product of the Cold War\". Germany Chancellor Gerhard Schroeder and French President Jacques Chirac have repeatedly called for the embargo to be lifted.\n5. Mr Straw said the EU code of conduct would prevent an increase in the number of arms being exported to China. If it is lifted, he said the EU will end up with as effective arms controls in relation to China as they now have.\n6. The US government is thought to fear it would lead to a buying spree for arms that could be used by China to threaten its diplomatic rival Taiwan. US officials say they are not satisfied the mechanisms in the EU code of conduct are robust enough to prevent abuses. US Undersecretary of State John Bolton is meeting British officials this week to press the case for keeping the embargo.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely while preserving key ideas and details. Let me read through it carefully.\n\nThe main points are:\n\n1. The EU is considering lifting an arms export ban from China in six months, despite US concerns.\n2. China's recent military protests led to the 15-year-old ban imposed on exports to the EU.\n3. The UK Foreign Secretary Jack Straw mentioned lifting the ban after the Chinese government pushed it, but US objections are still in place.\n4. Although the EU pledged to address this issue, they're not ready yet, so they might stick to the ban for now.\n5. China's approach is seen as similar to other countries like Zimbabwe and Burma, which are more open on arms control.\n6. Germany Chancellor and French President have repeatedly called for the ban to be lifted.\n7. Britain is cautious but wants the ban ended before EU leader takes over from Luxembourg in July.\n8. The EU would prevent increased arms exports, so reducing arms controls makes sense.\n\nI should condense this into a brief summary without too much detail. I'll mention that the EU is considering ending the ban, US concerns exist, China's policy aligns with other countries in the past, and the UK wants it to end soon.\n</think>\n\nThe EU is weighing whether to lift an arms export ban from China, despite US skepticism. The 15-year-old ban was imposed after Chinese protests, particularly in Tiananmen Square. The UK Foreign Secretary, Jack Straw, mentioned lifting the ban but acknowledged US objections. Despite this, the EU has pledged to address the issue but is not ready yet. While China's approach aligns with other countries like Zimbabwe and Burma for control, Britain is cautious and wants the ban ended before EU leadership shifts in July. The EU would limit arms exports, so reducing controls makes sense.", "tinyllama:1.1b": "The EU has been considering lifting its arms export ban to China, although US objections remain. UK Foreign Secretary Jack Strawhave said that it was not yet ready to lift the ban but hoped to do so before Britain takes over as president of the EU in July. The embargo was put in place after Chinese authorities cracked down on protesters in Tiananmen Square. EU officials have been debating how to strengthen the code of conduct regarding arms exports, with US representatives meeting British officials this week to discuss this issue. While US officials remain unsure about the mechanism used in the code of conduct, UK officials hope to convince Washington to lift the ban for China before taking over as EU chairperson.", "tinydolphin:1.1b": " The EU has announced that it will consider lifting its ban on arms exports to China, according to UK Foreign Secretary Jack Straw. However, he expressed concern about whether the code of conduct being put in place by the European Union can prevent abuses. He also stated that Britain has been more cautious on this issue and would want an EU code of conduct in place before lifting the ban.", "phi:2.7b": " The EU is likely to lift its arms export ban to China in six months, despite objections from the United States. This 15-year-old embargo was imposed due to human rights concerns over China's crackdown on protesters in Tiananmen Square. However, Jack Straw, UK Foreign Secretary, argues that it is wrong to put China under the same embargo as countries like Zimbabwe and Burma, as long as human rights concerns remain. Germany, France, and Britain have called for the ban to be lifted, with Mr. Straw also expressing his support. He believes an EU code of conduct will prevent a significant increase in arms exports to China. The US government is opposed due to its fear of Taiwan being threatened by Chinese-purchased weapons. However, Mr. Straw claims that many of Washington's objections are based on a lack of understanding and information about the EU's export control guidelines.\n", "orca-mini:3b": " The EU arms ban on China is likely to be lifted in the next six months, according to UK Foreign Secretary Jack Straw. The 15-year-old ban was imposed in the aftermath of China's crackdown on protesters in Tiananmen Square. Straw told a Commons select committee that it was wrong to put China under the same embargo as countries such as Zimbabwe and Burma. However, he said an EU code of conduct would prevent an increase in the number of arms being exported to China. The US government is suspicious of \"the motives of some other countries within the EU\" wanting the ban lifted. Straw said many of Washington's objections were based on a lack of information and understanding about how export control guidelines work in EU countries. He added that intense discussions were taking place with US officials to convince them it was the right thing to do. However, US Undersecretary of State John Bolton is meeting British officials this week to press the case for keeping the embargo.", "hermes3:3b": "EU likely to lift 15-year arms ban on China in next 6 months; opposed by US.", "stablelm-zephyr:3b": "The European Union's 15-year ban on arms exports to China is expected to be lifted within six months, according to UK Foreign Secretary Jack Straw. The ban was implemented following China's crackdown on protesters in Tiananmen Square but has been criticized by the US and other countries concerned about human rights abuses in the country. Straw argued that it was not appropriate to treat China the same as countries like Zimbabwe and Burma, and that a code of conduct would prevent an increase in arms exports. Despite the lifting of the ban, concerns over China's human rights record remain.", "stablelm2:1.6b": "The EU has pledged to work towards lifting an arms export ban on China, likely to be lifted within six months despite objections from the US. The 1-year-old ban was imposed over China's crackdown on protesters in Tiananmen Square but should not be compared with countries like Zimbabwe and Burma due to human rights concerns. In December, the EU agreed to work towards lifting the embargo, now said to be ready for removal. Beijing welcomed the embargo during Cold War times, while Germany and France have repeatedly called for its end. UK's Jack Straw believes it is wrong to put China under the same embargo as countries with weaker human rights records. The US fears a buying spree by China could threaten Taiwan, which has been pushing for lifting the ban.", "granite3.1-dense:2b": "EU China arms ban, imposed 15 years ago following China's Tiananmen Square crackdown, may be lifted within six months, according to UK Foreign Secretary Jack Straw. The EU has been encouraged by Germany and France to end the ban, which they view as a relic of the Cold War. Straw emphasized human rights concerns persist but argued China should not be placed under the same embargo as Zimbabwe and Burma. He expressed confidence that an EU code of conduct would maintain effective arms controls if the ban is lifted. The US opposes the lifting, citing fears of China misusing exported arms to threaten Taiwan. Intense discussions are underway to address Washington's concerns, with Undersecretary John Bolton meeting British officials to advocate for maintaining the embargo.", "chatgpt-4o-latest": "The EU is likely to lift its 15-year-old arms embargo on China within six months despite US objections, according to UK Foreign Secretary Jack Straw. The ban was imposed after China's Tiananmen Square crackdown, but Straw argued it was inappropriate to equate China with countries like Zimbabwe and Burma. While the EU pledged in December to work towards lifting the ban, it has not yet done so. France and Germany have strongly supported ending the embargo, while Britain has been more cautious but now favors its removal. Straw assured that an EU code of conduct would maintain effective arms controls. The US opposes the move, fearing it could enable China to threaten Taiwan, and doubts the EU's export control mechanisms. Washington is engaging in discussions with EU officials, with US Undersecretary of State John Bolton meeting British officials to advocate for keeping the embargo.", "reference": "Mr Straw said the US government was suspicious of \"the motives of some other countries within the EU\" in wanting the ban lifted.The EU embargo on arms exports to China is likely to be lifted in the next six months despite US objections, UK Foreign Secretary Jack Straw has said.But he said it was wrong to put China under the same embargo as countries such as Zimbabwe and Burma.He said \"it is more likely than not\" that the ban would be lifted before Britain takes over the presidency of the EU from Luxembourg in July.But he said an EU code of conduct would prevent an increase in the number of arms being exported to the country.In December, the EU pledged to work towards lifting the ban but said it was not ready to do so yet.\"If it is lifted we will end up with as effective arms controls in relation to China as we have now.\"US officials say they are not satisfied the mechanisms in the EU code of conduct are robust enough to prevent abuses."}