{"raw_text": "'Debate needed' on donations cap\n \n A cap on donations to political parties should not be introduced yet, the elections watchdog has said.\n \n Fears that big donors can buy political favours have sparked calls for a limit. In a new report, the Electoral Commission says it is worth debating a £10,000 cap for the future but now is not the right time to introduce it. It also says there should be more state funding for political parties and candidates should be able to spend more on election campaigning.\n \n There were almost £68m in reported donations to political parties in 2001, 2002 and 2003, with nearly £12m of them from individual gifts worth more than £1m. The rules have already been changed so the public can see who gives how much to the parties but the report says there are still public suspicions. The commission says capping donations would mean taxpayers giving parties more cash - something which would first have to be acceptable to the public and shown to work. \"While we are not in principle opposed to the introduction of a donation cap, we do not believe that such a major departure from the existing system now would be sensible,\" says its report. If there was to be a cap, it should be £10,000 - a small enough amount to make a difference but which would have banned £56m in donations between 2001 and 2003.\n \n Even without changes the commission does urge political parties to seek out more small-scale donations and suggests there should be income tax relief for gifts under £200. It also suggests increasing state funding for parties to £3m so help can be extended to all parties with at least two members in the House of Commons, European Parliament, Scottish Parliament, Welsh Assembly or Northern Ireland Assembly. And it suggests new ways of boosting election campaigning, seen as a way of improving voter turnout. All local election candidates should be entitled to a free mailshot for campaign leaflets, says the watchdog. And there should be a shift in the amount of money allowed to be spent at elections from a national level to a local level to help politicians engage better with voters.\n \n The report suggests doubling the money which can be spent by candidates, while cutting national spending limits from £20m to £15m. The commission also says the spending limits for general elections should cover the four months before the poll - as happens with other elections. Electoral Commission chairman Sam Younger said: \"There is no doubt that political parties have a vital role to play in maintaining the health of our democracy and for this they need to be adequately resourced. \"Our research has shown that people want to be more informed about party politics and that they want politicians to be more visible and accessible. \"The public are reluctant for the state to fund parties but at the same time are unhappy with large private donations.\" He called for a wider public debate on party funding to find the consensus needed for radical changes to the current system.\n", "llama3.2:1b": "A cap on donations to political parties is not necessary, according to the Electoral Commission's new report. The commission suggests that capping donations would require public acceptance and demonstration of its effectiveness. Instead, the commission recommends:\n\n* Increasing state funding for political parties by £3m\n* Allowing income tax relief for gifts under £200\n* Doubling the money that can be spent by candidates\n* Cutting national spending limits from £20m to £15m\n* Introducing local-level elections and reducing general election spending limits\n* Providing free mailshots for campaign leaflets\n* Shifting spending from national to local levels to improve engagement with voters.", "llama3.2:3b": "A £10,000 donation cap should be debated, but not introduced yet, the Electoral Commission says.\nThe commission urges more state funding and suggests new ways to boost election campaigning, including doubling candidate spending limits.\nIt also recommends reducing national spending limits from £20m to £15m and providing free mailshots for local election candidates.", "gemma2:2b": "A cap on political donations should not be implemented yet. The Electoral Commission recommends increasing state funding for parties, allowing candidates more spending flexibility in elections, and exploring alternative approaches like tax relief for small-scale donations.  The commission also suggests a wider public debate to find consensus on potential reforms. \n", "qwen2.5:0.5b": "A new report from the Electoral Commission suggests a cap on political party donations not being introduced yet, as it is currently not advisable. The commission believes that capping donations would make it easier to see who gives how much and ban more than £12m in donations between 2001 and 2003. Even without changes, the commission urges parties to seek out smaller donations, suggest income tax relief for gifts under £200, increase state funding for parties by £3m, and suggest new ways of boosting election campaigning. The report suggests doubling the money that can be spent on candidates while cutting national spending limits from £20 million to £15 million.", "qwen2.5:1.5b": "A cap on political party donations should not be introduced yet due to concerns and potential lack of public acceptance, despite some recommendations for reforming state funding and campaign spending limits.", "qwen2.5:3b": "A cap on political donations should not be introduced yet, according to the Electoral Commission. They suggest debating a £10,000 limit in the future but now is not the right time. The commission recommends more state funding and increasing tax relief for small gifts. It also proposes boosting election campaigning by providing free mailshots and shifting spending limits from national to local levels. While the current system should be improved with increased party resources and reduced spending caps, there are concerns about excessive private donations that could influence politics. The report suggests a public debate on how to address these issues effectively.", "opencoder:1.5b": "Aside from making key points succinctly, this summary doesn't address any of the concerns expressed in the original report: 'Debate needed' on donations cap, fearmakers banning large gifts, tax relief, local and national funding, and more.\n", "smollm:1.7b": "Debate needed on cap on donations to political parties", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text as per the instructions. Let me read through it carefully.\n\nThe main point is that there should be no introduction of a donation cap yet. There are fears about big donors buying political favors, which have sparked calls for limits. The report suggests setting a £10,000 cap, but it's not the right time. Instead, they recommend a small cap, like £10k, to see if that works without causing public confusion. It also mentions giving more state funding and allowing candidates to spend more on campaigning.\n\nI should make sure to capture all key points: no cap yet, fears about donations affecting parties negatively, report's suggestion for the cap, current findings about donations, recommended changes like £10k, income tax relief, increased state funding, free mailouts, and expanded spending limits. Also mention the need for public debate.\n\nLet me structure this into a concise summary.\n</think>\n\nA decision is needed on introducing a donation cap. Concerns that large donors might buy political favors have sparked calls for limiting donations. A report suggests setting a £10,000 limit but recommends instead a more modest amount to assess its effectiveness. It also advocates for increased state funding and more transparency in party operations, including campaign funding. Public opinion is crucial to ensure radical changes are feasible.", "tinyllama:1.1b": "The Electoral Commission suggests debating a £10,000 cap on donations to political parties in the future. The watchdog argues that taxpayers should not be compelled to hand over more cash to support parties, and it urges political parties to seek out more small-scale donations. Moreover, the Commission suggests increasing state funding for political parties, improving election campaigning, engaging better with voter's engagement at local elections, and doubling the amount of money allowed to be spent by candidates during elections. The report also suggests doubling national spending limits for general elections to cover four months before the poll, and reducing spendings limits from £20m to £15m for elections.", "tinydolphin:1.1b": " \"Debate needed\" on donations cap - The Electoral Commission has suggested that future donation caps should be debated by political parties and the general public, but now is not the right time to introduce them. In a new report, the Commission suggests limiting donations from £10,000 per year for political parties, with individual donations being capped at more than £1m. This would mean taxpayers giving parties more money, while still leaving room for public acceptance and the potential to work.", "phi:2.7b": " The Electoral Commission suggests not introducing a £10,000 cap on donations to political parties yet and recommends more state funding for parties and candidates as well as increased campaign spending limits at local level. There should also be income tax relief for gifts under £200. However, if there were to be a donation cap, it should be £10,000 with the public's acceptance of this major departure from the current system firstly.\n", "orca-mini:3b": " The report by the Electoral Commission recommends against introducing a cap on political donations, stating that it is not the right time to introduce such a major departure from the existing system. The report suggests that there should be more state funding for political parties and candidates should be able to spend more on election campaigning. It also urges political parties to seek out more small-scale donations and suggests increasing state funding for parties to £3m. If there is to be a cap, it should be £10,000, which would ban £56m in donations between 2001 and 2003. The report also suggests doubling the money which can be spent by candidates, while cutting national spending limits from £20m to £15m. The commission also recommends that general election spending limits should cover the four months before the poll.", "hermes3:3b": "Debate needed on introducing donation cap; Electoral Commission suggests not now, and proposes alternative solutions.", "stablelm-zephyr:3b": "The Electoral Commission has stated that a cap on political party donations should not be introduced yet, arguing that it is not the right time to make such a significant departure from the existing system. The report suggests that there should be more state funding for parties and increases in small-scale donations. It also proposes income tax relief for gifts under £200 and a shift towards local spending during elections to help politicians engage better with voters. A wider public debate on party funding is called for to find consensus on radical changes to the current system.", "stablelm2:1.6b": "The elections watchdog says there should be more discussions about introducing a donation cap for political parties, but it's not yet necessary. The Electoral Commission wants more state funding and smaller donations to boost political parties. They suggest a £1 million donation limit and increasing funding for all parties with at least two members in the House of Commons or European Parliament. The public is hesitant about large private donations while wanting more transparency on party finances.", "granite3.1-dense:2b": "The Electoral Commission, in its latest report, advocates for a cautious approach to introducing a £10,000 cap on political donations, deeming it premature due to public skepticism and the need for demonstrable success. The commission proposes alternative measures to address concerns about big donors influencing politics: increasing state funding for parties to £3m, offering income tax relief for small donations under £200, and boosting local campaign expenses through free mailshots for candidates. These changes aim to enhance transparency and accessibility of political parties without relying on taxpayer-funded large donations. The commission emphasizes the importance of party funding in maintaining democratic health and calls for a broader public debate to reach consensus on reforming the current system.", "chatgpt-4o-latest": "The Electoral Commission has stated that while a cap on political donations is worth debating, now is not the right time to introduce it. Concerns over large donations influencing politics have led to calls for a £10,000 cap, which would have restricted £56m in donations between 2001 and 2003. The commission argues that capping donations would require increased state funding, which must first gain public acceptance. It recommends political parties seek more small-scale donations and suggests tax relief for gifts under £200. The report also proposes increasing state funding to £3m to support smaller parties and enhancing election campaigning to boost voter engagement. It suggests allowing free mailshots for local candidates, shifting spending from national to local levels, and adjusting spending limits—doubling candidate spending while reducing national limits from £20m to £15m. The commission calls for a broader public debate on party funding to achieve consensus on potential reforms.", "reference": "It also says there should be more state funding for political parties and candidates should be able to spend more on election campaigning.A cap on donations to political parties should not be introduced yet, the elections watchdog has said.The commission says capping donations would mean taxpayers giving parties more cash - something which would first have to be acceptable to the public and shown to work.Even without changes the commission does urge political parties to seek out more small-scale donations and suggests there should be income tax relief for gifts under £200.There were almost £68m in reported donations to political parties in 2001, 2002 and 2003, with nearly £12m of them from individual gifts worth more than £1m.The rules have already been changed so the public can see who gives how much to the parties but the report says there are still public suspicions.In a new report, the Electoral Commission says it is worth debating a £10,000 cap for the future but now is not the right time to introduce it.The commission also says the spending limits for general elections should cover the four months before the poll - as happens with other elections."}