{"raw_text": "Child access laws shake-up\n \n Parents who refuse to allow former partners contact with their children could be electronically tagged under plans being considered by ministers. Curfews and community service orders were other options which could be used if court orders to allow parental access were defied, Lord Falconer said. The constitutional affairs secretary outlined some of the plans on Tuesday. He denied fathers' activists had forced the changes, telling the BBC \"there is a recognition that something is wrong\". Between 15,000 and 20,000 couples go to court to resolve access disputes each year, although in nine out of 10 separations there is no court intervention.\n \n Lord Falconer told BBC Radio 4's Today programme he hoped voluntary mediation could help solve disputes before they reached court. But he opposed compulsory mediation, saying that it would lead to many people taking part with the wrong attitude. Other plans include:\n \n \n  - Parenting plans to give advice on access arrangements, based on real-life examples that have worked in the past \n  - Extending in-court conciliation - more informal hearings before contested court cases \n  - Better access to legal, emotional and practical advice by telephone and internet \n  - Legal aid changes to give incentives for early resolution of disputes. \n  \n \n Judges can already jail parents who breach contact orders but that was a \"nuclear option\" which was rarely used as it was not seen as being in the child's interests, a spokesman said. The aim of the new legislation was to provide a \"medium range\" of penalties, such as fines, community service orders, compulsory anger management or parenting classes or curfews.\n \n Failure to comply with these measures could result in offenders being electronically tagged. On the possibility of tagging uncooperative parents, Lord Falconer said: \"Tagging may be going too far, but let's have a debate about that.\" Full details of the new powers will not be revealed until a bill is published \"in the next two weeks,\" a spokesman said.\n \n The government's proposals have met with disapproval from fathers' rights groups. John Ison, from the controversial group Fathers 4 Justice, said: \"It is very disappointing. What we have got is a cynical case of recycling existing legislation.\" Jim Parton, from Families Need Fathers, said the new proposals \"lacked compulsion\".\n \n \"We would like to see couples develop a plan and then have it as a source of a court order - then you know where you stand, you know what the minimum access is. \"Otherwise, you see people make agreements which then fall apart.\" Mr Parton said he had been told by Children's Minister Margaret Hodge there was not enough time to pass the bill through parliament before the general election, which is likely to take place in May.\n \n The Conservatives have called for an equal split between parents on access to be made law. Theresa May, shadow secretary for the family, told BBC Radio 4's Today programme that the government's plans were \"inadequate\" and were \"papering over the cracks of the current system\". She said a Conservative government would bring a \"radical reform\" of the family courts, as well as enforcing a \"legal presumption of co-parenting and compulsory mediation\". \"We want to make courts the last resort, rather than the first resort,\" she added. The government says children cannot simply be divided up \"like property\" when a marriage collapses. The Liberal Democrats have argued for flexibility in deciding access rules, rather than having \"rigid targets\".\n", "llama3.2:1b": "Parents who refuse contact with their children could face electronic tagging under new plans considered by ministers, including curfews and community service orders if court orders are not complied with. Voluntary mediation is also being explored to help resolve disputes before they reach court. Laws would aim to provide a \"medium range\" of penalties for breaching contact orders. Critics, including fathers' rights groups, say the proposals lack compulsion. The government has published plans but full details will be revealed in two weeks.", "llama3.2:3b": "Ministers consider plans to electronically tag parents who refuse contact with their children if court orders are defied, alongside other measures such as curfews and community service. Voluntary mediation is encouraged, but compulsory mediation is opposed. Other plans include parenting plans, extended in-court conciliation, better access to legal advice, and changes to legal aid to encourage early resolution of disputes.", "gemma2:2b": "The UK government is proposing new measures to address child access disputes after 15,000-20,000 couples seek court intervention each year.  Proposed options include electronic tagging for parents who defy court orders, parenting plan advice, extended in-court conciliation, improved legal aid access, and increased penalties like fines or community service. These measures aim to provide a \"medium range\" of consequences beyond jail time. Fathers' rights groups criticize these proposals as lacking in compulsion and insufficiently addressing family breakdown dynamics. The government plans to introduce legislation within the next two weeks. \n", "qwen2.5:0.5b": "Child access laws are being considered as parents refuse to allow former partners contact with their children. Lord Falconer is suggesting voluntary mediation and better advice on access arrangements but some plans to give judges more power to jail offenders who violate contact orders may also be put forward. The government has rejected the father rights groups' proposals that fathers can have a court order if they don't comply, while the Conservative party calls for an equal split between parents on access.", "qwen2.5:1.5b": "New child custody laws being considered by ministers include electronic tagging of parents who defy court orders to allow access with their children. Options also include curfews and community service orders if mediation fails. Lord Falconer denies that fathers' rights activists forced the changes but supports voluntary mediation as a solution. The government proposes medium-range penalties for non-compliance, such as fines or parenting classes, without mentioning tagging. Disagreement from parents' rights groups, including criticism of lack of compulsion and time to pass legislation before an election.", "qwen2.5:3b": "Child access laws are being reconsidered by ministers who propose electronic tagging for parents refusing contact with their children as an alternative to court intervention. Lord Falconer suggested other measures like parenting plans, extended conciliation, legal aid changes, and fines for breaching orders. However, the proposals have faced criticism from fathers' rights groups, leading to calls for compulsory mediation and a shift towards courts being seen more as a last resort rather than a first choice in family disputes.", "opencoder:1.5b": "Child Access Laws Shake-Up\n\nParents who refuse to allow former partners contact with their children could be electronically tagged under plans being considered by ministers. Curfews and community service orders were other options which could be used if court orders to allow parental access were defied, Lord Falconer said.\n\nThe Constitutional Affairs Secretary outlined some of the plans on Tuesday. He denied fathers' activists had forced the changes, telling the BBC \"there is a recognition that something is wrong\". Between 15,000 and 20,000 couples go to court to resolve access disputes each year, although in nine out of ten separations there is no court intervention.\n\nLord Falconer told BBC Radio 4's Today programme he hoped voluntary mediation could help solve disputes before they reached court. But he opposed compulsory mediation, saying that it would lead to many people taking part with the wrong attitude. Other plans include:\n\n- Parenting plans to give advice on access arrangements, based on real-life examples that have worked in the past \n- Extending in-court conciliation - more informal hearings before contested court cases \n- Better access to legal, emotional and practical advice by telephone and internet \n- Legal aid changes to give incentives for early resolution of disputes. \n\nJudges can already jail parents who breach contact orders but that was a \"nuclear option\" which was rarely used as it was not seen as being in the child's interests.\n\nThe aim of the new legislation was to provide a \"medium range\" of penalties, such as fines, community service orders, compulsory anger management or parenting classes or curfews. Failure to comply with these measures could result in offenders being electronically tagged.\n\nOn the possibility of tagging uncooperative parents, Lord Falconer said: \"Tagging may be going too far, but let's have a debate about that.\" Full details of the new powers will not be revealed until a bill is published \"in the next two weeks,\" a spokesman said.\n\nThe government's proposals have met with disapproval from fathers' rights groups. John Ison, from the controversial group Fathers 4 Justice, said: \"It is very disappointing. What we have got is a cynical case of recycling existing legislation. The new proposals \"lacked compulsion\".\n\nJim Parton, from Families Need Fathers, said the new proposals \"lacked compulsion\".\n \nThe Conservatives have called for an equal split between parents on access to be made law. Theresa May, shadow secretary for the family, told BBC Radio 4's Today programme that the government's plans were \"inadequate\" and were \"papering over the cracks of the current system\". She said a Conservative government would bring a \"radical reform\" of the family courts, as well as enforcing a \"legal presumption of co-parenting and compulsory mediation\".\n\nThe Liberal Democrats have argued for flexibility in deciding access rules, rather than having \"rigid targets\". The government says children cannot simply be divided up \"like property\" when a marriage collapses. The Liberal Democrats have argued for flexibility in deciding access rules, rather than having \"rigid targets\".\n", "smollm:1.7b": "The summary is:\n\n* A new law would give parents more time to resolve disputes before they reach court.\n* Parents who refuse to allow former partners contact with their children could be electronically tagged under plans being considered by ministers.\n* Curfews and community service orders were other options which could be used if court orders to allow parental access were defied, Lord Falconer said. The constitutional affairs secretary outlined some of the plans on Tuesday. He denied fathers' activists had forced the changes, telling the BBC \"there is a recognition that something is wrong\". Between 15,000 and 20,000 couples go to court to resolve access disputes each year, although in nine out of 10 separations there is no court intervention.\n* Lord Falconer told BBC Radio 4's Today programme he hoped voluntary mediation could help solve disputes before they reached court. But he opposed compulsory mediation, saying that it would lead to many people taking part with the wrong attitude. Other plans include: - Parenting plans to give advice on access arrangements, based on real-life examples that have worked in the past \n - Extending in-court conciliation - more informal hearings before contested court cases \n - Better access to legal, emotional and practical advice by telephone and internet \n - Legal aid changes to give incentives for early resolution of disputes. \n  \n The government's proposals have met with disapproval from fathers' rights groups. John Ison, from the controversial group Fathers 4 Justice, said: \"It is very disappointing. What we have got is a cynical case of recycling existing legislation.\" Jim Parton, from Families Need Fathers, said the new proposals \"lacked compulsion\".\n* The government's proposals have met with disapproval from fathers' rights groups. John Ison, from the controversial group Fathers 4 Justice, said: \"It is very disappointing. What we have got is a cynical case of recycling existing legislation.\" Jim Parton, from Families Need Fathers, said the new proposals \"lacked compulsion\".\n* The Conservatives have called for an equal split between parents on access to be made law. Theresa May, shadow secretary for the family, told BBC Radio 4's Today programme that the government's plans were \"inadequate\" and were \"papering over the cracks of the current system\". She said a Conservative government would bring a \"radical reform\" of the family courts, as well as enforcing a \"legal presumption of co-parenting and compulsory mediation\". \"We want to make courts the last resort, rather than the first resort,\" she added. The government says children cannot simply be divided up \"like property\" when a marriage collapses. The Liberal Democrats have argued for flexibility in deciding access rules, rather than having \"rigid targets\".", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text into plain text without any explanations or formatting. Let me read through it carefully.\n\nThe main topic is the child access laws shake-up. There are several key points:\n\n1. Parents who refuse parental contact could be tagged under new plans.\n2. Options like curfews and community service orders might be used if court orders to allow access are refused.\n3. Lord Falconer, the constitutional affairs secretary, said there's a recognition that something is wrong with current laws.\n4. There are plans including parenting advice, conciliation hearings, telephonic/online advice, legal aid incentives, and jail assignments for those who breach contact.\n5. Judges can already jail parents, but this was rare before.\n6. The new legislation aims for medium range penalties like fines or community service orders.\n7. Failure to comply could result in tags.\n8. fathers' rights groups oppose the plans: Ison says it's a cynical case of recycling old laws; Parton said it lacked compulsion.\n9. There was some debate about tagging uncooperative parents, and Falconer suggested it might be too far.\n10. The government plans have met disapproval from some groups: Ison was against, May said the plans are inadequate and they want equal splits between parents, while Parton in favor of more flexible rules.\n\nI need to make sure all these points are covered succinctly without any extra info or explanations.\n\nLet me structure it:\n\n1. Summarize the key issues: access laws, tagging options, parents' rights.\n2. Mention the new plans and their goals.\n3. Highlight the failed attempts in court orders and the existing penalties.\n4. Note the opposition from groups and the debate on tagging.\n5. Include any specific details about government actions or decisions.\n\nI should avoid adding my own interpretations or explanations beyond what's given, just summarize the essential points as plain text.\n</think>\n\nChild access laws are being reconsidered with new plans aimed at preventing abuse. Parents who refuse to allow parental contact could be tagged under various schemes by ministers. Options include curfews and community service orders if court decisions were thwarted. Falconer noted there's a recognition that some system is flawed. The aim is to provide medium range penalties, such as fines or community service orders.\n\nThese plans include parenting advice, conciliation hearings, telephonic/online advice, legal aid incentives, and jail assignments for those who breach contact. Judges can already assign parents to jail but this was rare before. However, the new legislation aims to ensure fairness by creating a balanced range of penalties.\n\nFalconer suggested tagging uncooperative parents might be too far-reaching, while there's ongoing debate about it. Fathers' rights groups oppose plans that were rejected and have criticized them for lacking compulsion. The government is also considering radical reforms for family courts, emphasizing fairness over being the first resort.", "tinyllama:1.1b": "In response to criticism from father's rights groups, the UK government has proposed several measures to tackle divorce-related child access disputes, including voluntary mediation, parenting plans, and more informal hearings before contested court cases. Child access laws were shaken up with plans to electronically tag uncooperative parents under the plans being considered by ministers. The Conservatives have called for an equal split between parents on access arrangements, while the Liberal Democrats advocate flexibility in determining child access rules, rather than having \"rigid targets\".", "tinydolphin:1.1b": " Child access laws shake-up: British politicians are considering electronic tagging of parents who defy court orders to allow their children contact with the other parent, or compulsory mediation for resolving disputes. The aim is to make it easier for fathers to be involved in their children's lives and avoid contested court cases that can leave parents in dispute for years. The measures are part of a broader shift towards greater cooperation between separated families, aimed at reducing conflict and child abduction.", "phi:2.7b": " Ministers are considering new laws to allow electronic tagging of parents who refuse to let their former partners see their children. Other options include curfews and community service orders. The proposals aim to resolve disputes before going to court by providing parenting plans and better access to advice. Judges can already jail disobedient parents but the government wants a \"medium-range\" of penalties, such as fines or anger management classes. However, some groups are critical of the proposals, calling for compulsory mediation and an equal split in access. The Conservatives want a radical reform of family courts and the introduction of a legal presumption of co-parenting.\n", "orca-mini:3b": " Child access laws could include electronic tagging for parents who refuse to allow former partners contact with their children under plans being considered by ministers. Ministers hope voluntary mediation and better access to legal, emotional, and practical advice will help solve disputes before they reach court. Jailing parents who breach contact orders is a \"nuclear option\" that is rarely used. The government's proposals have met with disapproval from fathers' rights groups. Theresa May, shadow secretary for the family, said the government's plans were \"inadequate\" and called for a radical reform of the family courts.", "hermes3:3b": "Child access laws may include electronic tagging for parents refusing contact with their children, and other penalties like fines, community service orders, compulsory classes etc., if they breach court orders.", "stablelm-zephyr:3b": "Lord Falconer outlined plans for parents who refuse to allow former partners contact with their children to potentially be electronically tagged under consideration by ministers. Other proposed measures include voluntary mediation, parenting plans, extending in-court conciliation, better access to legal and emotional advice, and legal aid changes to incentivize early dispute resolution. The aim is to provide a range of penalties such as fines, community service orders, compulsory anger management, or curfews for parents who defy court orders. Critics argue that the new proposals lack compulsion and fail to address existing issues in the system.", "stablelm2:1.6b": "Ministers are considering laws to electronically tag parents who refuse to allow contact with their children under child access laws. These plans aim to provide more penalties if parents breach contact orders such as fines, community service orders, compulsory anger management or parenting classes or curfews. Failure to comply could result in electronic tagging. The government's proposals have met disapproval from fathers' rights groups who argue the new legislation lacks compulsion and fails to address an unequal split between parents on access to be made law.", "granite3.1-dense:2b": "Ministers are considering new child access laws to address disputes between parents, including former partners. Proposed measures aim to provide a range of penalties beyond jail time, such as fines, community service, or tagging for non-compliance with court orders. These options include electronic tagging for uncooperative parents, curfews, compulsory anger management classes, and parenting programs based on successful past examples.\n\nLord Falconer, constitutional affairs secretary, highlighted the need to move away from jail time as a primary penalty, which is rarely used due to its perceived lack of benefit for children. He emphasized voluntary mediation and other alternatives like parenting plans, in-court conciliation, improved access to legal advice, and changes to legal aid to encourage early dispute resolution.\n\nHowever, these proposals have faced criticism from fathers' rights groups, who argue that they are merely recycling existing legislation without sufficient compulsion for couples to follow agreed-upon access plans. Critics also question the government's timeline for passing the bill before the general election in May.\n\nThe Conservatives have called for a legal presumption of equal shared parenting time, while the Liberal Democrats advocate for more flexible access rules. The Children's Minister has stated that there isn't enough time to pass the bill through parliament before the general election. Despite these objections, the government maintains that children should not be treated as divisible property when a marriage ends.", "chatgpt-4o-latest": "The UK government is considering new measures to enforce child access laws, including electronic tagging, curfews, and community service for parents who deny former partners access to their children. Lord Falconer outlined plans to encourage voluntary mediation and provide better legal and emotional support while avoiding compulsory mediation. Judges already have the power to jail parents who breach contact orders, but the new proposals aim to introduce intermediate penalties such as fines, anger management classes, and curfews. Fathers' rights groups criticized the proposals as insufficient, while the Conservatives called for a legal presumption of co-parenting and compulsory mediation. The Liberal Democrats advocated for flexibility in access arrangements rather than rigid targets. Full details of the legislation will be revealed in an upcoming bill.", "reference": "Curfews and community service orders were other options which could be used if court orders to allow parental access were defied, Lord Falconer said.\"We would like to see couples develop a plan and then have it as a source of a court order - then you know where you stand, you know what the minimum access is.Lord Falconer told BBC Radio 4's Today programme he hoped voluntary mediation could help solve disputes before they reached court.Jim Parton, from Families Need Fathers, said the new proposals \"lacked compulsion\".Other plans include:   - Parenting plans to give advice on access arrangements, based on real-life examples that have worked in the past - Extending in-court conciliation - more informal hearings before contested court cases - Better access to legal, emotional and practical advice by telephone and internet - Legal aid changes to give incentives for early resolution of disputes.Between 15,000 and 20,000 couples go to court to resolve access disputes each year, although in nine out of 10 separations there is no court intervention.She said a Conservative government would bring a \"radical reform\" of the family courts, as well as enforcing a \"legal presumption of co-parenting and compulsory mediation\".Theresa May, shadow secretary for the family, told BBC Radio 4's Today programme that the government's plans were \"inadequate\" and were \"papering over the cracks of the current system\".Parents who refuse to allow former partners contact with their children could be electronically tagged under plans being considered by ministers.Judges can already jail parents who breach contact orders but that was a \"nuclear option\" which was rarely used as it was not seen as being in the child's interests, a spokesman said.John Ison, from the controversial group Fathers 4 Justice, said: \"It is very disappointing."}