{"raw_text": "Visa decision 'every 11 minutes'\n \n Visa processing staff are sometimes expected to rule on an application every 11 minutes, MPs have said.\n \n Pressure was placed on staff to be efficient, rather than to do a thorough examination of an application, the Public Accounts Committee found. Every officer had an annual target of 8,000 applications - equivalent to 40 a day or one every 11 minutes. MPs want research into whether UK visa holders leave at the end of their stays, or vanish into the black market. Committee chairman Edward Leigh said: \"There is a worrying tension between quick processing and proper control over the visas issued. \"Entry clearance staff are expected to deal with a visa application in about 11 minutes which is surely too little time to look closely at the supporting documents. \"\n \n The committee's report also discussed the Romanian and Bulgarian visas scandal which led to the resignation of immigration minister Beverley Hughes last year. Committee members said the Home Office had been wrong to dismiss concerns from visa staff abroad who feared the system was being abused. Investigations carried out in the wake of Ms Hughes' resignation found more than 7,000 people had entered the UK under the business visa scheme for Romanian and Bulgarian \"entrepreneurs\". Mr Leigh said the Home Office should now consider removing those who had not set up a valid business. A Home Office spokesman said the system had been toughened and tightened since the investigation. He added \"that the traditional system of a dual decision making process for all pre-entry applications will be replaced by a single pre-entry check at post, which will be simpler and more robust against abuse than the current system\".\n", "llama3.2:1b": "Visa processing staff are expected to rule on an application every 11 minutes. The Public Accounts Committee found that this was often due to pressure to process applications quickly rather than thoroughly examining them. MPs want research into whether UK visa holders leave at the end of their stays or disappear into the black market.", "llama3.2:3b": "Visa processing staff are sometimes expected to make decisions every 11 minutes, with annual targets of 8,000 applications. The Public Accounts Committee found pressure to prioritize efficiency over thorough examination of applications. MPs want research into UK visa holders' departure patterns and potential misuse. A scandal involving Romanian and Bulgarian visas led to the resignation of an immigration minister and calls for tightening the system.", "gemma2:2b": "Visa processing staff are given targets of 8,000 applications per year, leading to quick processing times that may compromise thorough examinations. MPs are concerned about this tension between speed and thoroughness, particularly regarding visa holders' departure and potential illegal activities. The scandal involving Romanian and Bulgarian visas led to the resignation of the immigration minister, with investigations revealing a significant number of non-business related entries.  The Home Office has implemented stricter measures in response, including a simpler pre-entry check system. \n", "qwen2.5:0.5b": "Visa processing staff are expected to rule on an application every 11 minutes. MPs want research into whether UK visa holders leave at the end of their stays or vanish into the black market. The committee's report discusses a Romanian and Bulgarian visas scandal which led to the resignation of immigration minister Beverley Hughes last year. Home Office officials say the system has been toughened since the investigation was carried out.", "qwen2.5:1.5b": "UK visa processing staff must rule on applications every 11 minutes due to tight targets, leading some MPs to call for research into whether UK visa holders leave or enter illegally.", "qwen2.5:3b": "Visa processing staff are expected to examine an application every 11 minutes, leading to concerns about thoroughness. MPs want research into UK visa holders' departure patterns and those who may enter through black market channels. The Public Accounts Committee also addressed issues from the Romanian and Bulgarian visas scandal that led to Beverley Hughes's resignation, finding over 7,000 individuals entered under a business visa scheme for entrepreneurs without establishing valid businesses. The Home Office is now considering removing such individuals and has introduced stricter pre-entry checks at posts.", "opencoder:1.5b": "Visa processing staff are expected to rule on an application every 11 minutes. Each officer had an annual target of 8,000 applications - equivalent to 40 a day or one every 11 minutes.\n\nResearch into whether UK visa holders leave at the end of their stays, or vanish into the black market has been announced. The Public Accounts Committee found that Edward Leigh expressed concerns over the possible delay in entry clearance for staff who enter the UK using a business visa.\n\nThe Home Office's report indicated an increase in entries from businesses listed as \"entrepreneurs\" - a list of people whose businesses have not yet established a business, which he noted was an indicator of abuse. The Home Office should consider removing those who had not set up a valid business before deciding on whether to allow the visa application. \n\nThe Home Office has been hard hit by the double decision-making process for pre-entry applications and is considering a simpler system that will be more robust against abuse compared to the current one.\n", "smollm:1.7b": "Visa processing staff are sometimes expected to rule on an application every 11 minutes. Pressure was placed on staff to be efficient, rather than to do a thorough examination of an application, the Public Accounts Committee found. Every officer had an annual target of 8,000 applications - equivalent to 40 a day or one every 11 minutes. MPs want research into whether UK visa holders leave at the end of their stays, or vanish into the black market. Committee chairman Edward Leigh said: \"There is a worrying tension between quick processing and proper control over the visas issued.\" Entry clearance staff are expected to deal with a visa application in about 11 minutes which is surely too little time to look closely at the supporting documents. Mr Leigh said the Home Office had been wrong to dismiss concerns from visa staff abroad who feared the system was being abused. Investigations carried out in the wake of Ms Hughes' resignation found more than 7,000 people had entered the UK under the business visa scheme for Romanian and Bulgarian \"entrepreneurs\". Mr Leigh said the Home Office should now consider removing those who had not set up a valid business. A Home Office spokesman said the system had been toughened and tightened since the investigation. He added: \"that the traditional system of a dual decision making process for all pre-entry applications will be replaced by a single pre-entry check at post, which will be simpler and more robust against abuse than the current system\".", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving key ideas and details. Let me read through it carefully.\n\nThe first paragraph talks about Visa processing taking 11 minutes every time. MPs have criticized staff for being expected to handle applications quickly without thorough examination.\n\nNext, the Public Accounts Committee found that there was pressure on staff to be efficient rather than just process applications. They set annual targets of 8,000 applications per officer, which translates to about 40 applications a day or one every 11 minutes. MPs are interested in whether UK visa holders stay for their full length or disappear into the black market.\n\nEdward Leigh from the committee said there's a tension between quick processing and proper control. He mentions that entry clearance staff have expected less time per application, maybe too little to look closely at supporting documents.\n\nThen, the report discusses a scandal with Immigration Minister Beverley Hughes resigning. It found that about 7,000 people entered the UK under the business visa scheme from Romania and Bulgaria. Leigh noted the Home Office was wrong in dismissing staff's concerns earlier. They tightened the system since the investigation found more people had entered without proper support.\n\nI need to make sure I capture all these points: the processing time, the criticism of efficiency, the target numbers, the MPs' interest in visa status, and the findings about the Romanian and Bulgarian scam.\n\nLet me structure this into a concise summary.\n</think>\n\nVisa processing is expected to take 11 minutes per application, with MPs criticizing staff for being rushed rather than thoroughly examining documents. A report found annual targets of 8,000 applications, equating to 40 per day or one every 11 minutes. MPs want to know if UK visa holders stay long or vanish in the black market. The committee highlighted that staff are expected to handle an application in less time than proper scrutiny allows. A study on Romanian and Bulgarian scams revealed over 7,000 people entered via business visas from those countries. Home Office adjusted their system post-Beeverly Hughes' resignation, using a single pre-entry check for post applications instead of the current dual decision process.", "tinyllama:1.1b": "The House of Commons committee found that visa processing staff are expected to rule on an application every 11 minutes, causing pressure to be placed on them. Pressure was placed on staff to be efficient rather than conduct thorough examinations of applications, according to the Public Accounts Committee's findings, which called for research into whether UK visa holders leave at the end of their stays or vanish into the black market. Entry clearance staff are expected to deal with a visa application in about 11 minutes, causing worries that they are rushing through the system and abusing it. The Romanian and Bulgarian visas scandals that led to the resignation of immigration minister Bevely Hughes resulted in a more than 7,000 people being unable to enter the UK under the business visa scheme for Romanian and Bulgarian \"entrepreneurs\". Home Office officials have announced that they will review and improve the system after investigations discovered that more than 7,000 people had entered the country without setting up a valid business. The Home Office has stated that a new system of a dual decision-making process for all pre-entry applications will be implemented to ensure that the traditional system is no longer being abused.", "tinydolphin:1.1b": " The Home Office has been criticized for processing visa applications in an inefficient and unproductive manner. Inspections by the Public Accounts Committee found that 40% of officers are expected to process every application within a time frame of 11 minutes, which is equivalent to one application per 11 minutes. The committee's report also reveals that the visa processing system has been criticized for not providing proper control over the number of Romanian and Bulgarian visas being issued.\n\nThe committee recommended that Home Office staff be given more time to examine the supporting documents of visa applications, particularly when it comes to Romanian and Bulgarian business visas. The British public should also have better access to information about the status of their applications. Committee members expressed concerns over the tendency for officers to prioritize quick processing over thorough examination of the cases they handle.\n\nThe Home Office has assured that its immigration systems will be improved and more robust against abuse, following investigations into Romanian and Bulgarian visa scandals. The spokesman stated that the new system will require a pre-entry check to ensure that all applicants set up valid businesses before their visas are issued. This change in approach suggests a move away from the traditional single-decision-making process for all pre-entry applications and towards a more robust and effective approach to processing visa applications.", "phi:2.7b": " The Public Accounts Committee has found that Visa processing staff are expected to approve applications every 11 minutes, with an annual target of 8,000 applications. MPs want research into whether UK visa holders leave at the end of their stays or vanish into the black market. They also raised concerns about pressure being placed on staff to be efficient instead of thoroughly examining applications, and recommended changes to the system based on investigations into the Romanian and Bulgarian visas scandal. The Home Office has responded by stating that the traditional decision-making process will be replaced with a single pre-entry check at post for all applications. \n", "orca-mini:3b": " Visa processing staff are expected to make a decision on an application every 11 minutes, and have an annual target of 8,000 applications, equivalent to 40 applications per day or one every 11 minutes. There is pressure to be efficient rather than thorough in examining visa applications, and the committee wants research into whether UK visa holders leave the country or vanish into the black market after obtaining a visa. The report also mentioned the Romanian and Bulgarian visas scandal, where Home Office officials dismissed concerns from staff abroad who feared the system was being abused. Since the investigation, the Home Office has tightened the system and removed those who did not set up a valid business.", "hermes3:3b": "11-minute visa processing every; pressure to be efficient over thorough examination.", "stablelm-zephyr:3b": "Visa processing staff are reportedly expected to make decisions on applications every 11 minutes, with pressure focusing on efficiency rather than thorough examination. The Public Accounts Committee has raised concerns about whether UK visa holders leave or vanish into the black market at the end of their stays. The report also discussed a Romanian and Bulgarian visas scandal that led to the resignation of immigration minister Beverley Hughes last year, with committee members stating that the Home Office should consider removing those who did not set up a valid business. A Home Office spokesman said the system has been toughened and tightened since the investigation.", "stablelm2:1.6b": "Visa processing staff sometimes rule on an application every 8 minutes, according to MPs. This pressure leads to efficient but insufficient examination of documents due to limited time. The Romanian/Bulgarian visa scandal led to concerns dismissal by immigration minister, resulting in over 7,0.\nHome Office should consider removing non-established businesses in the business visa scheme for Romanian and Bulgarian entrepreneurs. The current system is being toughened and tightened against abuse with a single pre-entry check at post replacing the dual decision making process.", "granite3.1-dense:2b": "The Public Accounts Committee revealed that UK visa processing staff are under immense pressure to evaluate applications every 11 minutes, equivalent to one application per 11 minutes. This expectation is driven by annual targets of 8,000 applications per officer, which suggests a high volume of cases rather than thorough examination. Committee chairman Edward Leigh expressed concern about the tension between expeditious processing and proper control over issued visas. The committee also addressed the Romanian and Bulgarian visa scandal that resulted in Immigration Minister Beverley Hughes' resignation last year, where over 7,000 individuals entered the UK under the business visa scheme for Romanian and Bulgarian entrepreneurs without establishing valid businesses. The Home Office is now considering removing those who did not meet this requirement. In response to these issues, the government plans to replace the traditional dual decision-making process with a single pre-entry check at post, aiming to create a more robust system against abuse.", "chatgpt-4o-latest": "MPs have raised concerns that UK visa processing staff are pressured to prioritize efficiency over thorough examination, with each officer expected to process 8,000 applications annually—equivalent to one every 11 minutes. The Public Accounts Committee warned that this rapid processing could compromise proper control over visas. The committee also criticized the Home Office for ignoring concerns from visa staff about system abuse, particularly in the Romanian and Bulgarian visa scandal, which led to the resignation of immigration minister Beverley Hughes. Investigations revealed over 7,000 individuals entered the UK under a business visa scheme without establishing valid businesses. MPs urged the Home Office to consider removing those who misused the system. In response, the Home Office stated that visa processing has since been tightened, with a new single pre-entry check system replacing the previous dual decision-making process to enhance security and prevent abuse.", "reference": "Visa processing staff are sometimes expected to rule on an application every 11 minutes, MPs have said.Committee members said the Home Office had been wrong to dismiss concerns from visa staff abroad who feared the system was being abused.Committee chairman Edward Leigh said: \"There is a worrying tension between quick processing and proper control over the visas issued.\"Entry clearance staff are expected to deal with a visa application in about 11 minutes which is surely too little time to look closely at the supporting documents. \"A Home Office spokesman said the system had been toughened and tightened since the investigation."}