{"raw_text": "'No more concessions' on terror\n \n Charles Clarke says he has \"no desire\" to offer more concessions on his controversial anti-terror plans to get them on to the statute book.\n \n MPs voted in favour of the Prevention of Terrorism Bill after Mr Clarke agreed to key changes - but Labour's majority was reduced to 14. The Bill now faces opposition from peers angry at house arrest proposals. Lord Strathclyde, Tory leader in the Lords, said ministers should expect it to be \"substantially re-written\".\n \n The Bill proposes \"control orders\", which as well as house arrest could impose curfews, tagging or bans on telephone and internet use. They would replace current powers to detain foreign terror suspects without trial, which the law lords have ruled against.\n \n On Monday, MPs voted 272-219 in favour of the Bill after key concessions from Mr Clarke. The government earlier saw its 161-strong majority cut to just 14 as a cross-party amendment was narrowly rejected by the Commons despite the support of 62 Labour rebels. Mr Clarke won over critics by announcing he would introduce an amendment in the Lords to ensure the most controversial control order, amounting to house arrest, would be imposed by judges and not politicians. Lord Strathclyde warned ministers that they should \"prepare themselves for substantial rewriting of various aspects of the Bill\". \"They should consider far more seriously the use of intercept evidence in any trial and I think they should drop the most objectionable proposals, which are for house arrest.\"\n \n But Mr Clarke told BBC Radio 4's Today programme he believed the changes he had made to the Bill to win over critics in the Commons should be sufficient to satisfy colleagues in the Lords. \"No Bill goes through Parliament without detailed consideration being made, but I believe that what I announced yesterday will be sufficient to secure the agreement of the House of Lords,\" he said.\n \n \"I have no desire to make further so-called concessions on the Bill.\" Mr Clarke's proposed amendment will be debated by the Lords on Tuesday without having been considered by MPs. The debate is unlikely to result in a vote. Speaking after the Commons debate, shadow home secretary David Davies said the bill had been \"clearly very badly drawn-up\" and that the government was trying to rush it through too quickly. He said it would be possible to \"rescue\" the government and make the law \"tolerable\" by amending it in the Lords. \"The scope for miscarriages of justice is enormous,\" he told BBC News.\n \n Mark Oaten, for the Liberal Democrats, said Monday night's vote showed the government had \"lost the confidence of all sides of the House\". He said: \"They need to rethink the bill, and extend the power of a judge to decide on all control orders, build safeguards on evidence and create charges against suspects. \"Unless there is a major movement, this bill is doomed to fail.\"\n \n BBC News political editor Andrew Marr said: \"I think that this is a bill in deep trouble. It's been unravelling in the House of Commons - it may unravel further.\" The government wants the new bill to pass into law by 14 March, when the current powers expire.\n", "llama3.2:1b": "MPs voted in favour of the Prevention of Terrorism Bill with concessions from Charles Clarke, but Labour's majority was reduced and peers are unhappy about house arrest proposals. The Bill proposes control orders and restrictions on telephone use, replacing foreign detainees without trial. Lord Strathclyde says ministers should expect substantial rewriting of aspects of the bill due to opposition from peers.", "llama3.2:3b": "MPs voted 272-219 in favor of Charles Clarke's Prevention of Terrorism Bill after key concessions were made. The Bill proposes control orders that could include house arrest, curfews and internet bans. The government faces opposition from peers who want substantial changes to the bill, including reducing the power of politicians to impose control orders and increasing safeguards on evidence.", "gemma2:2b": "The Prevention of Terrorism Bill passed through the House of Commons but faces opposition from the Lords.  Controversial control orders, which include house arrest and curfews, are part of the bill's proposed measures to replace currently banned detention methods for suspected terrorists. Opposition comes from both the Labour party (rebels) and the opposition Conservative Party in the Lords, who will likely demand significant changes before it becomes law. The bill is facing potential delays due to these challenges. \n", "qwen2.5:0.5b": "Charles Clarke announced he would introduce amendments to the Bill after MPs voted against his plans. Lord Strathclyde warned that ministers should \"prepare themselves for substantial rewriting of various aspects of the Bill.\" His proposal was a 296-page bill with many additional clauses compared to the original draft, which had been approved by Commons but rejected by Lords.", "qwen2.5:1.5b": "Charles Clarke says he won't offer more concessions on his anti-terror Bill that was passed with a majority reduced to 14 due to opposition from peers over proposals for house arrest and other control orders that would replace detention without trial. This amendment is now expected to be \"substantially re-written\" by ministers, who also warned of concerns about using intercept evidence in trials and the controversial proposal for house arrest. The government hopes key changes will win agreement on its contentious measures from peers.", "qwen2.5:3b": "Charles Clarke refuses to make more concessions on his controversial anti-terror Bill, which has gained approval from MPs but faces opposition from peers upset over house arrest proposals. The Bill includes control orders that could impose curfews, tagging or bans on phone and internet use. Labour rebels supported a Commons amendment requiring judges rather than politicians to impose the most contentious controls, while Conservative Lord Strathclyde warned of significant changes needed in Lords. Clarke believes his recent amendments are sufficient for Lords approval but faces criticism from shadow Home Secretary David Davies and others who argue the Bill is poorly drafted and should be revised. The government aims to have the new law enacted by 14 March, yet concerns remain about its effectiveness and potential for miscarriages of justice.", "opencoder:1.5b": "The text summarizes that Mr Clarke had agreed to introduce an amendment to ensure the most controversial control order is imposed by judges and not politicians. The amendment was reviewed by both the Lords and the Commons but was narrowly rejected. The decision was announced in the BBC Radio 4's Today programme, which made it clear that it was only a draft amendment and further amendments would be considered if they met certain criteria. The government's confidence in the new bill has been reduced as it is likely to fail. Mark Oaten, who represents the Liberal Democrats, referred to the fact that the vote showed the government had \"lost the confidence of all sides of the House\". It also highlights the importance of the Bill and its potential effects on law enforcement.\n", "smollm:1.7b": "The summary should be concise and clear, preserving key ideas and details while omitting unnecessary information. Here is a possible summary:\n\n\"No more concessions on terror bills after Mr Clarke agrees key changes - but Labour's majority was reduced to 14.\"\n\nThis summary captures the main points of the text, including the key idea that the government has \"no desire\" to offer more concessions on its controversial anti-terror laws and the key details of the Bill, which proposes control orders and curfews. The summary is concise and clear, without adding unnecessary information or explanations.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about the proposed terror control bill. Let me read through each paragraph carefully.\n\nFirst paragraph talks about Charles Clarke and his no more concessions on the bill. MPs voted in favor of it afterClarke agreed on key changes but the Labour majority dropped to 14. The Bill now faces opposition from House of Lords leaders, Lord Strathclyde, who expected a rewrite. The Bill introduces control orders including house arrest, which would replace detention without trial.\n\nSecond paragraph details what the Bill does: \"control orders\" – both house arrest and other powers. They'd replace current detentions for terror suspects. Clarke's changes were enough to get the vote but led to the Lords' rejection in a narrow way.\n\nThird paragraph explains that Clarke won by announcing he'd introduce an amendment in the Lords for house arrest, ensuring judges, not politicians, make those decisions. He also warned about intercept evidence and called for reconsideration of House arrest proposals.\n\nFourth paragraph mentions Clarke's speech to BBC Today radio saying his changes would satisfy the Lords' detailed consideration. He believes the Bill should move through without extra concessions. Clarke said the bill was clearly drafted but they need to think again, possibly moving it in the Lords.\n\nFifth paragraph from David Davies: The government rushed through it too quickly and might fail because of potential miscarriages. They could rescue the law by amending the bill in the Lords. He warned about the scope for errors, suggesting a major shift is needed.\n\nSixth paragraph notes that the House of Commons was rolling against this bad proposal earlier this month but now they expect it to unravel further. The bill expires on March 14 and aims to be passed then.\n\nI need to make sure all key points are covered: Clarke's no more concessions, MPs voting in favor, Labour majority cut, opposition from Lords, control orders including house arrest, Clarke's proposal for House arrest by judges, Lord Strathclyde's warning, Clarke's speech,David Davies' concerns about rushed passage and possible missteps, Mark Oaten suggesting the bill needs reconsideration, BBC News noting deep trouble in Commons and need for change.\n\nI should keep it concise, just the main ideas without any extra details.\n</think>\n\nNo more concessions on the proposed terror control bill were discussed by Charles Clarke, who emphasized his desire to avoid additional concessions. MPs voted in favor of the Prevention of Terrorism Bill afterClarke agreed on key changes, but Labour's majority was reduced from 161 to 14. The bill now faces opposition from House of Lords leaders, Lord Strathclyde, who warned against its substantial rewrite due to house arrest proposals.\n\nClarke's amendments were enough to secure the vote but led to the Lords rejecting the plan in a narrow vote. He announced introducing an amendment to ensure house arrest decisions are made by judges, not politicians, while warning of intercept evidence and House arrest concerns. Clarke stated his changes would meet detailed consideration in the House of Lords, stating they were \"sufficient\" for that purpose.\n\nDavid Davies from the shadow home secretary noted the bill had been clearly drawn up but was being rushed through quickly, risking miscarriages of justice. He suggested rescuing the law by amending it in the House of Lords and creating safeguards on evidence to make the law more tolerable.\n\nMark Oaten from the Liberal Democrats argued the bill needed reconsideration, calling for a major movement and extending judge powers to address all control orders. The House of Commons had been rolling against this proposal, but now they expect it to unravel further with potential missteps if not rushed ahead.", "tinyllama:1.1b": "The article presents the summary of the Prevention of Terrorism Bill proposed by Charles Clarke after its passage in the House of Commons last week. The article highlights that MPs had voted in favor of the bill but that significant modifications were made to ensure the government's approval. It also discusses the revised proposals introduced by Clarke, including changes to the control order provisions and an agreement with peers to allow for further scrutiny of the legislation. The article concludes by noting that the bill still faces opposition from peer leaders who are angry at house arrest proposals and calls for more detail on the legislative process.", "tinydolphin:1.1b": " Charles Clarke has made no concessions on his controversial anti-terror plans and MPs have voted in favor of the Prevention of Terrorism Bill despite amendments proposed by rebels to place house arrest restrictions on foreign terror suspects without trial. The bill now faces opposition from peers who want a more substantial rewriting. The government has seen its 161-strong majority cut to just 14 after an amendment passed in the Commons allowed for house arrest to be imposed by judges. Critics argue that control orders, amounting to house arrest, should be introduced instead.", "phi:2.7b": " Charles Clarke refuses to make more concessions on anti-terrorism plan and vows to have control orders implemented by judges instead of politicians. MPs narrowly voted in favor of the Prevention of Terrorism Bill after key changes were made, but the government's majority was reduced to 14. The bill proposes \"control orders\" which can include house arrest, curfews, and banning phone use. Labour's majority was reduced even further, leading to an amendment being rejected by a narrow margin. Lord Strathclyde called for substantial re-writes of various aspects of the bill due to controversial proposals for house arrest. However, Clarke argued that changes made in the Commons were sufficient to satisfy his peers and predicted they would accept them. The Lords will debate the amendments Tuesday night without voting. Shadow home secretary Davies called it a \"clearly badly drawn up\" bill with room for improvement. He suggested that the government could salvage their plan by amending it in the Lords. Liberal Democrat Mark Oaten said the government had lost the confidence of all sides and needed to rethink the bill, extending judges' power on control orders and building safeguards on evidence. If not amended, the bill may fail to pass into law by March 14th.\n", "orca-mini:3b": " No more concessions on terror", "hermes3:3b": "Concessions rejected; anti-terror Bill faces opposition after MPs vote in favour; 'control orders' with house arrest, curfews etc. proposed instead of detaining suspects without trial.", "stablelm-zephyr:3b": "Charles Clarke states he has \"no desire\" to offer more concessions on anti-terror plans to get them onto the statute book. MPs voted in favor of the Prevention of Terrorism Bill after key changes; however, Lord Strathclyde warns that ministers should prepare for substantial rewriting of various aspects of the bill. The bill proposes control orders, which could include house arrest and bans on telephone and internet use. Despite opposition from peers, Mr. Clarke believes the changes he made to the bill will be sufficient to gain agreement in the House of Lords.", "stablelm2:1.6b": "UK Chancellor Charles Clarke announced he has no desire to offer further concessions on his anti-terrorism plans. The Prevention of Terrorism Bill is now facing opposition from peers due to house arrest proposals. Control orders will replace current powers for detaining foreign terror suspects without trial. Critics voted in favor of the bill after key concessions were made by Clarke, but the government saw its majority cut to 19 as a cross-party amendment was narrowly rejected by the Commons. The bill proposes \"control orders,\" which could impose curfews, tagging or bans on internet and telephone use. The most contentious control order is house arrest, proposed for implementation by judges instead.\n  \nShadow home secretary David Davies criticized the government's anti-terrorism measures, stating that the bill had been \"clearly very badly drawn- up\" and arguing that it should be revised before passing into law. Liberal Democrat MP Mark Oaten expressed concern about potential miscarriages of justice in the new system.", "granite3.1-dense:2b": "Charles Clarke, Home Secretary, has stated he won't make additional concessions on the controversial Prevention of Terrorism Bill. MPs supported the Bill after key changes were agreed upon, reducing Labour's majority to 14 (272-219). The Bill proposes \"control orders,\" which may include house arrest, curfews, tagging, or internet and phone bans, intended to replace current detention powers deemed unlawful by the law lords.\n\nDespite the government's 141-strong majority in the Commons, the cross-party amendment was narrowly rejected by 62 Labour rebels. Lord Strathclyde warned ministers to expect substantial rewriting and criticized house arrest proposals. Clarke introduced an amendment for judicial imposition of the most controversial control order, aiming to secure House of Lords approval.\n\nHowever, opposition from peers remains strong, with shadow home secretary David Davies and Liberal Democrats Mark Oaten criticizing the bill's flaws and potential for miscarriages of justice. The government seeks to pass the new law by 14 March, when current detention powers expire.", "chatgpt-4o-latest": "Home Secretary Charles Clarke refuses to make further concessions on the controversial Prevention of Terrorism Bill, despite opposition. The bill, which introduces \"control orders\" including house arrest, curfews, and internet bans, passed the Commons with a reduced majority after Clarke agreed to judicial oversight for house arrest. However, the Lords, led by Tory Lord Strathclyde, plan to rewrite key aspects, particularly opposing house arrest. Critics, including shadow home secretary David Davies and Liberal Democrat Mark Oaten, argue the bill is rushed and flawed, warning of potential miscarriages of justice. BBC political editor Andrew Marr suggests the bill is in serious trouble, with the government aiming to pass it by 14 March before current anti-terror laws expire.", "reference": "On Monday, MPs voted 272-219 in favour of the Bill after key concessions from Mr Clarke.But Mr Clarke told BBC Radio 4's Today programme he believed the changes he had made to the Bill to win over critics in the Commons should be sufficient to satisfy colleagues in the Lords.\"No Bill goes through Parliament without detailed consideration being made, but I believe that what I announced yesterday will be sufficient to secure the agreement of the House of Lords,\" he said.The Bill now faces opposition from peers angry at house arrest proposals.MPs voted in favour of the Prevention of Terrorism Bill after Mr Clarke agreed to key changes - but Labour's majority was reduced to 14.Speaking after the Commons debate, shadow home secretary David Davies said the bill had been \"clearly very badly drawn-up\" and that the government was trying to rush it through too quickly.\"I have no desire to make further so-called concessions on the Bill.\"Mr Clarke won over critics by announcing he would introduce an amendment in the Lords to ensure the most controversial control order, amounting to house arrest, would be imposed by judges and not politicians.BBC News political editor Andrew Marr said: \"I think that this is a bill in deep trouble.The government wants the new bill to pass into law by 14 March, when the current powers expire."}