{"raw_text": "'More to do' on adult literacy\n \n The government will only hit its target for improving adult maths and literacy skills if courses are made more attractive, a report says.\n \n The National Audit Office praised ministers for reaching the benchmark of 750,000 adults in England gaining basic qualifications by this year. But a target of 1.5 million more by 2010 needed \"creative\" ideas. Some 26 million adults lack maths or English skill levels expected of school-leavers.\n \n According to the report, \"more than half\" the qualifications achieved were by learners aged 16 to 18. These are defined as \"adults\" by the government for the purpose of compiling these figures. Normally adults are defined as being aged over 19. The number of these people gaining qualifications was \"rising slowly\". Auditor General Sir John Bourn said: \"Higher levels of literacy and numeracy will benefit England both socially and economically. \"More people will have the opportunity to live richer lives.\" In 2001, the government launched the Get On scheme - aimed at reducing illiteracy and innumeracy. Sir John said \"substantial progress\" had been made since, adding that this was \"only the beginning\". The government and its partners would \"need to be creative and responsive\". Some £3.7bn will be spent on implementing the programme by 2006. The report recommends gathering more details on the educational needs of areas, so courses can be set to meet local demand. Existing adult learners could use their \"enthusiasm, commitment and local knowledge\" to attract other people. The Department for Education and Skills could also use more \"personalised learning\" and work with voluntary groups, councils and employers.\n \n It should also assess adult learners' progress \"at frequent intervals\", the report adds. When the government announced it had reached its 2004 target earlier this month, Prime Minister Tony Blair said it was \"only the start of the journey\". An estimated 5.2 million adults have worse literacy than that expected of 11 year olds, while 14.9 million have numeracy skills below this level. This is thought to cost the UK economy hundreds of millions of pounds each year. The qualifications achieved by those taking part in the government's scheme range up to GCSE equivalents. Get On's participation target has been set at 2.25 million by 2010, with an interim figure of 1.5 million by 2007. Education minister Ivan Lewis said: \"We will continue to use creative ways of involving people with the lowest skill levels and the report shows that our efforts are gathering pace.\" Shadow Education Secretary Tim Collins said: \"This is the third report in two days to highlight Labour's failure to ensure young people acquire the necessary levels of literacy and numeracy for their working life. \"Employers and business leaders have repeatedly voiced concern over the number of school-leavers without these basic skills, but all the government have offered is more talk.\" Liberal Democrat education spokesman Phil Willis added: \"Far too little has been done to enable adult learners to fit learning into their busy lives.\"\n", "llama3.2:1b": "The report suggests that the UK government needs to make courses for improving adult literacy more attractive and appealing to adults. The National Audit Office praised ministers for reaching the 750,000 target of adults gaining basic qualifications by this year, but warned that a new target of 1.5 million may not be achievable without creative ideas. \n\nThe report notes that many adults lack maths or English skill levels expected of school-leavers and that the number of these people gaining qualifications has been rising slowly. The government is currently spending £3.7bn on implementing the Get On scheme, which aims to reduce illiteracy and innumeracy.\n\nThe report recommends gathering more details on educational needs for areas where progress may be needed, using existing adult learners' enthusiasm and commitment to attract others, and assessing progress at frequent intervals. The target of 2.25 million by 2010 was set with an interim figure of 1.5 million by 2007.", "llama3.2:3b": "The National Audit Office says a target for 1.5 million adults in England gaining basic qualifications by 2010 needs \"creative\" ideas. Currently, only 26 million adults lack maths or English skill levels expected of school-leavers, with most achieving qualifications being from those aged 16-18. The government will spend £3.7bn on the Get On scheme to improve adult literacy and numeracy skills.", "gemma2:2b": "A report by the National Audit Office praises the government's progress in improving adult literacy and math skills. However, it highlights the need for increased engagement and creativity to meet the ambitious 1.5 million target by 2010. The report suggests prioritizing personalized learning, utilizing local knowledge, and adapting courses to meet specific needs. It also emphasizes the importance of frequent progress assessments for effective support of adult learners.  The government faces criticism over its inadequate response to the issue of adult illiteracy and innumeracy despite acknowledging it as a significant problem. \n", "qwen2.5:0.5b": "The government aims to improve adult maths and literacy skills by making courses more attractive. However, only 1.5 million additional adults are expected to gain these qualifications by 2010 compared to the target of 750,000 adults in England gaining basic qualifications by this year. Some adults lack enough math or English skills necessary for school-leavers.\n\nThe government plans to increase literacy and numeracy skills among adult learners using a series of schemes aimed at reducing illiteracy and learning difficulties. An estimated 5.2 million adults have worse literacy than expected, while 14.9 million have numeracy skills below this level. This costs the UK economy thousands of millions each year.\n\nThe government aims to provide targeted interventions by assessing progress over time and using more creative ways of involving people with lower levels of literacy and numeracy skills in education.", "qwen2.5:1.5b": "The National Audit Office praised ministers for reaching 750,000 adults in England gaining basic qualifications by 2010, but noted that higher levels of literacy and numeracy are needed. About 26 million adults lack required skills, with some 45% achieving these through vocational education. The government aims to reach a target of 1.5 million more by 2010 with \"creative\" ideas, spending £3.7 billion over three years on improving literacy and numeracy among adults aged 16-18. Local needs should be assessed to meet course demand, and existing adult learners' enthusiasm can attract others. The Get On scheme has reached a target of 2.25 million by 2010 with an interim figure of 1.5 million by 2007, but progress was still needed.", "qwen2.5:3b": "The government will only meet its target for improving adult literacy and numeracy skills if courses are made more attractive. A National Audit Office report praises the 750,000 adults in England who gained basic qualifications by 2010 but notes a need for \"creative\" ideas to reach an additional 1.5 million by 2010. The majority of these qualifications were achieved by learners aged 16-18, considered \"adults\" by government definitions. The report suggests more detailed educational needs assessments and encourages local enthusiasm and commitment from existing adult learners. It recommends using personalized learning methods and collaborating with voluntary groups, councils, and employers to attract new participants. While the Get On scheme aimed at reducing illiteracy has made substantial progress, further creative and responsive approaches are needed to achieve full potential benefits in social and economic areas.", "opencoder:1.5b": "The government aims to improve literacy and numeracy skills for all adults by making educational opportunities more attractive. The National Audit Office praised ministers for reaching the benchmark of 750,000 adults in England gaining basic qualifications as this year. However, a target of 1.5 million more by 20 years needed \"creative\" ideas. Most adults have already obtained expected levels of literacy and numeracy. However, higher levels of literacy and numeracy will benefit the country both socially and economically. The government has been using creative ways to involve people with lower skill levels. The Department for Education and Skills aims to work towards personalised learning and collaborating with voluntary groups, councils and employers. An estimated 5.2 million adults have worse literacy than that expected of 11 year olds, while 14.9 million have numeracy skills below this level. The scheme will cost the UK economy hundreds of millions of pounds each year. The aim is to make education accessible to all children as young as age.\n", "smollm:1.7b": "The summary should be concise and objective. It should preserve key ideas and details from the original text while omitting unnecessary information. The goal is to provide a clear and accurate overview of the main points without adding personal opinions or interpretations.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about adult literacy and maths. The user wants a concise summary, so I should focus on the key points.\n\nFirst, it's about how the government plans to improve adult skills by making courses more attractive. They aim for 750,000 adults in England, but they need \"creative\" ideas to reach 1.5 million by 2010. There are 26 million adults without basic skills expected of school leavers.\n\nThe report mentions that half the qualified adults are 16-18-year-olds as defined here. The rise is slow, and higher levels of literacy can benefit both socially and economically. They launched the Get On scheme in 2001, achieving \"substantial progress,\" but it's still a start. The government needs to be creative and responsive.\n\nThere will be £3.7 million spent on this program by 2006. The report suggests gathering more data on educational needs for local areas so courses can meet demand. Existing learners can use their enthusiasm, commitment, and local knowledge to attract others. They'll assess progress regularly, like every year. Without the Get On scheme, literacy is worse than expected, affecting the economy by hundreds of millions a year.\n\nAdult learners could earn up to GCSE level. The government's target was 2.25 million in 2010, but that's an interim figure; real progress might be lower. Education Minister Ivan Lewis emphasized using creative methods with low-skilled adults, aligning with Labour's failure so far.\n\nI should include all these points but keep it concise. Make sure to note the target numbers, definitions of age groups, progress made, and the need for creativity.\n</think>\n\nMore to do with adult literacy aims to improve skills by making courses more attractive, according to a report. The UK government targets 750,000 adults in England to gain basic qualifications by this year but needs \"creative\" ideas to reach the higher target of 1.5 million more by 2010. Some 26 million adults lack essential skills expected of school leavers. A report highlights that half the qualified adults are aged 16-18, and their earning potential rises slowly. Higher literacy/numeracy levels benefit both economy and society. The Get On scheme launched in 2001 shows substantial progress but remains a starting point. £3.7 million will fund this program by 2006. The report recommends assessing learners' progress regularly, such as every year. Without the Get On scheme, literacy is far behind expectations. Education Minister Ivan Lewis said creativity with low-skilled adults is key to achieving goals. Shadow Secretary Tim Collins called for more personalized learning and collaboration with voluntary groups and employers.", "tinyllama:1.1b": "The Ministry of Education and Skills in England reached its target of improving adult literacy and numeracy skills by this year, with 26 million individuals having acquired these skills or above. Despite this progress, the government plans to use \"creative\" ideas for improving these skills further, such as gathering more detailed information on local educational needs, personalizing learning, and assessing adult learners' progress at frequent intervals. Around one-fifth of adults in England lack basic literacy or numeracy skills, with most of them unable to acquire either skill level expected of school-leavers. This is estimated to cost the UK economy millions of pounds each year. The government's efforts to improve these skills are being praised as \"more than half\" achieved this year, but only 14.9 million have numeracy skills below those expected of school-leavers.", "tinydolphin:1.1b": " The report highlights the need for more targeted and creative approaches in improving the literacy and numeracy skills of adults, particularly those who are at risk. A significant proportion of these individuals lack the necessary qualifications by this year's benchmark. Some 26 million adults in England lack basic maths or English skills, according to the National Audit Office report. The goal of achieving 1.5 million more learners before 2010 is seen as an ambitious target for many. To reach it, the government needs to make more effective use of its existing programmes and consider implementing new ones that cater specifically to the educational needs of local areas. It should also assess adult learners' progress at frequent intervals to determine their progress in meeting the required standard. The findings reinforce the importance of investing in personalized learning, as well as exploring innovative ways to engage and retain these individuals in their quest for success.", "phi:2.7b": " The text summarizes a report by the National Audit Office that praises the UK's progress in improving adult literacy and numeracy skills, but calls for more creative ideas and personalised learning. It also highlights the government's goal of reaching 1.5 million adults by 2010, which is yet to be achieved.\n", "orca-mini:3b": " The government will only reach its target for improving adult literacy if courses are made more attractive, a report said. The National Audit Office praised ministers for reaching the benchmark of 750,000 adults in England gaining basic qualifications by this year, but a target of 1.5 million more by 2010 needed \"creative\" ideas. Some 26 million adults lack maths or English skill levels expected of school-leavers. More than half the qualifications achieved were by learners aged 16 to 18, defined as adults by the government for the purpose of compiling these figures. The number of these people gaining qualifications was \"rising slowly\", but the report said substantial progress had been made since 2001 when the government launched the Get On scheme, aimed at reducing illiteracy and innumeracy. Sir John Bourn, the Auditor General, said higher levels of literacy and numeracy would benefit England both socially and economically. More people would have the opportunity to live richer lives. The government and its partners would need to be creative and responsive. Existing adult learners could use their enthusiasm, commitment and local knowledge to attract other people. The Department for Education and Skills could also use more personalized learning and work with voluntary groups, councils and employers. It should also assess adult learners' progress \"at frequent intervals\". When the government announced it had reached its 2004 target earlier this month, Prime Minister Tony Blair said it was \"only the start of the journey\". An estimated 5.2 million adults have worse literacy than that expected of 11 year olds, while 14.9 million have numeracy skills below this level. This is thought to cost the UK economy hundreds of millions of pounds each year. The qualifications achieved by those taking part in the government's scheme range up to GCSE equivalents. Get On's participation target has been set at 2.25 million by 2010, with an interim figure of 1.5 million by 2007. Education minister Ivan Lewis said: \"We will continue to use creative ways of involving people with the lowest skill levels and the report shows that our efforts are gathering pace.\" Shadow Education Secretary Tim Collins said: \"This is the third report in two days to highlight Labour's failure to ensure young people acquire the necessary levels of literacy and numeracy for their working life. Employers and business leaders have repeatedly voiced concern over the number of school-leavers without these basic skills, but all the government have offered is more talk.\" Liberal Democrat education spokesman Phil Willis added: \"Far too little has been done to enable adult learners to fit learning into their busy lives.\"", "hermes3:3b": "Adult literacy improvement target requires 'creative' ideas, report says.\nGovernment reached 750k adults gaining basic qualifications but wants 1.5m more by 2010.\nCurrently, 26m adults lack maths or English skill levels expected of school-leavers.\nReport suggests gathering local demand details for courses & utilizing adult learners' enthusiasm to attract others.\n£3.7bn will be spent on implementing the programme by 2006.", "stablelm-zephyr:3b": "A report by the National Audit Office highlights that despite reaching the target of 750,000 adults in England gaining basic qualifications by this year, the government aims for 1.5 million more by 2010. More than half of these qualifications were achieved by learners aged 16 to 18. The Get On scheme, launched in 2001, has contributed to substantial progress; however, £3.7 billion will be spent on implementing the program by 2006. The report recommends gathering details on educational needs in areas to adapt courses locally and involving existing adult learners, as well as using personalized learning and collaborating with voluntary groups, councils, and employers. Prime Minister Tony Blair emphasized that the government's progress is only the start of the journey, addressing the significant numbers of adults with lower literacy and numeracy skills than expected for school leavers, which may cost the UK economy hundreds of millions each year.", "stablelm2:1.6b": "The UK government aims to improve adult literacy and numeracy by making courses more attractive. A National Audit Office report recommends gathering more information on educational needs, so local courses can meet demand and existing adult learners can attract new people. The Department for Education should also provide personalized learning opportunities and work with voluntary groups, councils, and employers. The government's Get On scheme has a participation target of 2 million by 2007 with an interim figure of 1.5 million in 2006. An estimated 5.2 million adults have worse literacy than expected for year olds and 9 million have numeracy skills below this level, costing the economy hundreds of millions each year.", "granite3.1-dense:2b": "The National Audit Office report indicates that the UK government must enhance adult literacy and numeracy courses to meet its target of 1.5 million additional learners by 2010. Currently, 26 million adults lack basic skills expected of school-leavers. The majority of these qualifications are obtained by individuals aged 16 to 18, who are defined as \"adults\" for statistical purposes. Substantial progress has been made since the 2001 launch of the Get On scheme, which aims to reduce illiteracy and innumeracy. The report recommends tailoring courses to local needs, leveraging adult learners' enthusiasm, commitment, and local knowledge for outreach. It suggests assessing progress more frequently, utilizing personalized learning, collaborating with voluntary groups, councils, and employers, and improving communication with adult learners to fit education into their busy schedules. Despite these recommendations, critics argue that Labour has failed to address the issue effectively, with persistent concerns from employers about insufficiently skilled school-leavers and limited progress in helping adults acquire necessary literacy and numeracy skills for their working lives.", "chatgpt-4o-latest": "The government has met its target of 750,000 adults in England gaining basic qualifications but needs more creative approaches to reach 1.5 million by 2010. A report by the National Audit Office highlights that over half of these qualifications were earned by 16- to 18-year-olds, classified as adults for statistical purposes, while progress among those over 19 remains slow. The Get On scheme, launched in 2001, has made progress, but millions still lack basic literacy and numeracy, costing the UK economy significantly. The report recommends tailoring courses to local needs, using existing learners to attract others, and collaborating with voluntary groups and employers. The government plans to spend £3.7bn on the program by 2006 and aims for 2.25 million participants by 2010. Critics argue that more needs to be done to ensure young people and adults acquire essential skills for work and daily life.", "reference": "An estimated 5.2 million adults have worse literacy than that expected of 11 year olds, while 14.9 million have numeracy skills below this level.The government will only hit its target for improving adult maths and literacy skills if courses are made more attractive, a report says.Some 26 million adults lack maths or English skill levels expected of school-leavers.Education minister Ivan Lewis said: \"We will continue to use creative ways of involving people with the lowest skill levels and the report shows that our efforts are gathering pace.\"Existing adult learners could use their \"enthusiasm, commitment and local knowledge\" to attract other people.The National Audit Office praised ministers for reaching the benchmark of 750,000 adults in England gaining basic qualifications by this year.Shadow Education Secretary Tim Collins said: \"This is the third report in two days to highlight Labour's failure to ensure young people acquire the necessary levels of literacy and numeracy for their working life.Get On's participation target has been set at 2.25 million by 2010, with an interim figure of 1.5 million by 2007.According to the report, \"more than half\" the qualifications achieved were by learners aged 16 to 18.But a target of 1.5 million more by 2010 needed \"creative\" ideas.Normally adults are defined as being aged over 19."}