{"raw_text": "UK's 'useless' quangos under fire\n \n The UK has 529 quangos financed with billions of pounds of taxpayers' cash - many of which are useless or duplicate each other's efforts, a report claims.\n \n Essential Guide to British Quangos 2005 author Dan Lewis said at least 111 of the appointed bodies had been set up since Labour won power in 1997. He urged a limit on the number of quangos that could be set up by any individual government department. Tories and Lib Dems welcomed the report and called for a \"slimming down\".\n \n Conservative deregulation spokesman John Redwood said: \"The research endorses our policy of destroying unwanted and unnecessary quangos, and slimming down the rest.\n \n \"A Conservative government will axe 162 quangos, as part of its drive for more efficient and more accountable government.\" Lib Dem spokesman Ed Davey meanwhile said instead of the \"bonfire of quangos\" New Labour had promised, there had been an \"explosion\" of them. \"For over two decades, under both Tory and Labour governments, these unaccountable agencies have mushroomed. \"Liberal Democrats would abolish many, merge others, and make any that remain properly accountable.\" Labour representatives were unavailable for comment. The quango guide follows last year's government-commissioned Gershon Report which recommended significant cuts in bureaucracy across the public sector.\n \n Mr Lewis wants a public inquiry into regional development agencies which cost £1.8bn a year - cash he says which \"appears to be almost entirely wasted\". As well as a departmental limit on quangos he also wants a statutory five-year limit on any such body with executive powers. He also listed what he dubbed the nine \"most useless quangos\". They were the British Potato Council, the Milk Development Council, the Energy Savings Trust, Agricultural Wages Committees, the Wine Standards Board, the Westminster Foundation for Democracy, the Football Licensing Authority, Investors in People UK and the Economic and Social Research Council. Mr Lewis branded the existence of the 60-employee Potato Council, set up in 1997 to research and promote overseas potato markets, \"surprising\". He said the £80m spent annually on the Energy Savings Trust, which promotes renewable energy, would be better spent on eight million boiler jackets for British homes.\n \n And he argued it was \"absurd\" to charge farmers for Agricultural Wages Committees, which set working and wage standards in the industry, when many were prepared to take advantage of immigrant labour prepared to work for £1 an hour. \"If a football team can afford to pay £27m for Wayne Rooney, why should the taxpayer - not all of whom like football - be forced to fund the Football Licensing Authority to the tune of over £1.1m a year?\" Mr Lewis asked. The report is published by the Efficiency in Government Unit - a joint effort by right of centre think tanks the Economic Research Council and the Centre for Policy Studies. It says before a new public body is set up, an assessment should be made whether its proposed role is already carried out by an existing charity or other private organisation.\n", "llama3.2:1b": "UK's quangos are being criticized for their inefficiency and duplication, with some costing billions of pounds of taxpayers' cash each year. A report claims that at least 111 quangos have been set up since Labour won power in 1997, many of which have no clear role or accountability. The government has promised to slim down the number of quangos over the next few years, including axing 162 and merging others. Key quangos being targeted include the British Potato Council, the Wine Standards Board, and the Football Licensing Authority.", "llama3.2:3b": "UK has 529 quangos, many of which are useless or duplicate efforts, a report claims. Tories and Lib Dems welcome the report, calling for \"slimming down\". Labour representatives were unavailable for comment. The report suggests creating a limit on quangos per department and proposes abolishing some, merging others.", "gemma2:2b": "The UK has 529 quangos funded with taxpayer money that some describe as ineffective or redundant. A report highlights the existence of these bodies, their funding, and suggests potential reductions. Conservative politicians support limiting the number of quangos created by government departments. The report also points to specific quangos deemed inefficient or unnecessary. It calls for a public inquiry into regional development agencies due to excessive spending and proposes an end to many quangos. \n", "qwen2.5:0.5b": "The UK has 529 quangos under fire as many are useless or duplicate each other's efforts.", "qwen2.5:1.5b": "The UK has 529 quangos costing billions of pounds, many being inefficient duplicates; Labour and Conservatives want fewer.", "qwen2.5:3b": "The UK has 529 quangos funded with billions of pounds annually, many deemed useless or redundant, according to a report by Dan Lewis from the Essential Guide to British Quangos 2005. Conservative and Liberal Democrats welcomed the findings, calling for reductions in their number. The report suggests imposing limits on both the creation of new bodies within departments and existing quangos with executive powers. Dan Lewis lists nine \"most useless quangos,\" including the British Potato Council, the Energy Savings Trust, Agricultural Wages Committees, and the Football Licensing Authority. He argues that regional development agencies, which cost £1.8 billion annually, are largely ineffective. The report advocates for a public inquiry into these bodies and calls for making any remaining quangos accountable.", "opencoder:1.5b": "UK's 'useless' quangos under fire\n\nThe UK has 529 quangos financed with billions of pounds of taxpayers' cash - many of which are useless or duplicate each other's efforts, a report claims.\n\nEssential Guide to British Quangos 2005 author Dan Lewis said at least 111 of the appointed bodies had been set up since Labour won power in 1997. He urged a limit on the number of quangos that could be set up by any individual government department. Tories and Lib Dems welcomed the report and called for a \"slimming down\".\n\nConservative deregulation spokesman John Redwood said: \"The research endorses our policy of destroying unwanted and unnecessary quangos, and slimming down the rest.\n\n\"A Conservative government will axe 162 quangos, as part of its drive for more efficient and more accountable government.\" Lib Demspeaker Ed Davey meanwhile said instead of the \"bonfire of quangos\" New Labour had promised, there had been an \"explosion\" of them. \"For over two decades, under both Tory and Labour governments, these unaccountable agencies have mushroomed. \"Liberal Democrats would abolish many, merge others, and make any that remain properly accountable.\" Labour representatives were unavailable for comment.\n\nThe quango guide follows last year's government-commissioned Gershon Report which recommended significant cuts in bureaucracy across the public sector.\n", "smollm:1.7b": "The UK has 529 quangos financed with billions of pounds of taxpayers' cash - many of which are useless or duplicate each other's efforts, a report claims. Essential Guide to British Quangos 2005 author Dan Lewis said at least 111 of the appointed bodies had been set up since Labour won power in 1997. He urged a limit on the number of quangos that could be set up by any individual government department. Tories and Lib Dems welcomed the report and called for a \"slimming down\".\nThe report claims essential services such as the British Potato Council, which promotes overseas potato markets, are wasteful because they are not properly funded or managed. The report also criticizes the Energy Savings Trust, set up in 1997 to promote renewable energy, for charging farmers for Agricultural Wages Committees, which set working and wage standards in the industry, when many were prepared to take advantage of immigrant labour prepared to work for £1 an hour.\nThe report concludes that before a new public body is set up, an assessment should be made whether its proposed role is already carried out by an existing charity or other private organization.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about UK's useless quangos. Let me read through it carefully.\n\nThe text starts by talking about the \"useless\" quangos under the UK government. They're financed with taxpayer money and are being used by various departments. There's a report mentioning 529 quangos, which is a lot.\n\nDan Lewis from the Essential Guide says he saw at least 111 bodies set up since Labour won power in 1997. He wants to limit these to fewer than 60 because they're redundant or duplicate efforts.\n\nLib Dems and Tories are welcoming this report and calling for a simplification, maybe shrinking the number of quangos each department handles.\n\nJohn Redwood from the Conservative government said they'll axe 162 quangos as part of their efficiency drive. Lib Dem Ed Davey is even worse, saying over two decades saw these useless agencies mushroom up until New Labour's switch to unaccountable ones.\n\nMr Lewis lists specific quangoes like the British Potato Council and Energy Savings Trust, calling them surprising because he spends £1.8 million annually on it versus only £80 million for other projects. He argues farmers aren't being paid enough for their wages.\n\nHe suggests charging farmers for these committees when they could use the money elsewhere to save taxpayer money.\n\nThe report is from Efficiency in Government Unit, involving right-wing think tanks and published after a new government set up something. The main points are about limits on quangos per department, reducing funding, and the impact of government policies on efficiency and accountability.\n</think>\n\nThe UK's \"useless\" quangoes under scrutiny include 529 bodies financed with taxpayer money, many of which are redundant or duplicate efforts. A report indicates at least 111 departments since Labour won power in 1997 were established. Dan Lewis calls for limiting these to fewer than 60, as they are deemed unnecessary. Lib Dems and Tories call for simplification, urging a reduction in the number of quangos each department handles.\n\nConservative John Redwood aims to axe 162 quangoes, while Lib Dem Ed Davey criticizes New Labour's move to eliminate agricultural wages committees due to redundant efforts by Conservative firms. Mr Lewis emphasizes funding cuts but argues that charging farmers for these committees is absurd, as existing charities like the British Potato Council should handle their costs. He suggests allocating £1.8 million annually to Energy Savings Trust, which promotes renewable energy, instead of spending £80 million on boiler jackets.\n\nThe report, published by the Efficiency in Government Unit, follows a new government and cites research findings: limiting quangoes per department, restricting funding limits for each department with executive powers, and reducing the number of useless agencies. It calls for audits to see if existing charities or private organizations already handle proposed functions.", "tinyllama:1.1b": "The UK's \"useless\" quangoes are under fire following the publication of a report that has criticized over 100 government departments for wasting billions in taxpayer cash while simultaneously duplicating efforts with similar titles. The report found that \"quango\" bodies have been set up since Labour's landmark election win in 1997, but were found to be \"surprisingly few\" and had become increasingly unpopular under the Tories. Key recommendations include a public inquiry into regional development quangoes and limits on departmental quangoes with executive powers as well as a statutory five-year limit on any such body's existence. The report, authored by Dan Lewis of the Efficiency in Government Unit, highlights nine \"most useless\" quangos, including the British Potato Council, Westminster Foundation for Democracy, and the Football Licensing Authority. Despite this, it has been argued that the taxpayer should be expected to bear the costs of existing charities or private organizations rather than new government bodies.", "tinydolphin:1.1b": " Summary: UK quangos are wasteful and duplicative, with over £1 billion being spent annually on organizations not serving a particular purpose. A report suggests reducing the number of quangos to save taxpayers money. There are nine most useless quangos listed by author Dan Lewis.", "phi:2.7b": " The UK has numerous government-funded organizations known as quangos (quasi-autonomous non-governmental organizations) that are being criticized for their ineffectiveness and duplication of efforts. A report suggests that at least 111 of these quangos have been created since Labour came to power in 1997, with at least 111 of them still operating today. Conservative and Liberal Democrat politicians support the report's recommendations for a limit on the number of quangos established by individual government departments. However, some argue that the increase in quangos is necessary to promote more efficient and accountable governance. The report recommends a public inquiry into regional development agencies, which are responsible for allocating billions of pounds in funding, due to what the author claims is wasteful spending. The report also highlights nine quangos as particularly useless or unnecessary, including the British Potato Council, the Milk Development Council, and the Energy Savings Trust.\n", "orca-mini:3b": " The UK has 529 quangos financed with billions of pounds of taxpayers' cash - many of which are useless or duplicate each other's efforts, a report claims. At least 111 of the appointed bodies have been set up since Labour won power in 1997, and a Conservative government would axe 162 quangos, as part of its drive for more efficient and more accountable government. A Liberal Democrat spokesman called for a slimming down of the rest. The nine most useless quangos were the British Potato Council, the Milk Development Council, the Energy Savings Trust, Agricultural Wages Committees, the Wine Standards Board, the Westminster Foundation for Democracy, the Football Licensing Authority, Investors in People UK and the Economic and Social Research Council. The report suggests before a new public body is set up, an assessment should be made whether its proposed role is already carried out by an existing charity or other private organisation.", "hermes3:3b": "UK has 529 'useless' quangos funded with taxpayer money, report says; calls for limit on setup and slimming down of existing ones.", "stablelm-zephyr:3b": "A report has claimed that the UK has 529 quangos financed with billions of pounds of taxpayers' cash, many of which are useless or duplicate each other's efforts. Author Dan Lewis recommends a limit on the number of quangos set up by any individual government department and a statutory five-year limit on any such body with executive powers. He also calls for a public inquiry into regional development agencies and lists the nine most useless quangos. Conservative and Liberal Democrat parties welcome the report's recommendations to reduce bureaucracy and slim down quangos.", "stablelm2:1.6b": "A report claims that at least 1/4 of the UK's quangos, financed with billions of pounds of taxpayer money, are useless or duplicate each other's efforts. The Conservative-led government plans to reduce the number of quangos through a \"slimming down\" initiative. Labour representatives were unavailable for comment regarding this report.", "granite3.1-dense:2b": "UK's extensive network of 529 quangos, established since Labour took power in 1997 and financed with billions of taxpayer funds, faces criticism for being largely unnecessary or duplicative. Author Dan Lewis, in his book \"Essential Guide to British Quangos 2005,\" highlights that at least 111 quangos could be abolished without significant loss of purpose. He proposes limiting the number of quangos each government department can create and advocates for a public inquiry into regional development agencies, costing £1.8 billion annually.\n\nLewis identifies nine \"most useless\" quangos, including the British Potato Council, Energy Savings Trust, Agricultural Wages Committees, Football Licensing Authority, and Economic and Social Research Council. He argues that £80 million spent annually on the Energy Savings Trust would be better allocated for energy-saving measures like boiler jackets, while farmers should not have to pay for Agricultural Wages Committees when they could benefit from cheaper immigrant labor.\n\nBoth Conservative and Liberal Democrat representatives support the report's findings, calling for a \"bonfire of quangos\" or \"slimming down.\" The Conservatives pledge to eliminate 162 quangos, while the Lib Dems advocate for abolition, merger, and accountability improvements. Labour representatives remain unavailable for comment on the matter.", "chatgpt-4o-latest": "A report claims that the UK has 529 taxpayer-funded quangos, many of which are unnecessary or duplicate efforts. Author Dan Lewis highlights that at least 111 were created since Labour took power in 1997 and calls for limits on their establishment. The Conservatives and Liberal Democrats support reducing quangos, with the Tories pledging to abolish 162 and the Lib Dems advocating for mergers and greater accountability. Lewis also calls for a public inquiry into regional development agencies, which cost £1.8bn annually, and proposes a five-year limit on executive quangos. He identifies nine \"most useless\" quangos, including the British Potato Council and the Energy Savings Trust, arguing that their funding could be better allocated. The report, published by the Efficiency in Government Unit, suggests assessing whether new public bodies duplicate existing private or charitable efforts before their creation.", "reference": "Essential Guide to British Quangos 2005 author Dan Lewis said at least 111 of the appointed bodies had been set up since Labour won power in 1997.They were the British Potato Council, the Milk Development Council, the Energy Savings Trust, Agricultural Wages Committees, the Wine Standards Board, the Westminster Foundation for Democracy, the Football Licensing Authority, Investors in People UK and the Economic and Social Research Council.Mr Lewis branded the existence of the 60-employee Potato Council, set up in 1997 to research and promote overseas potato markets, \"surprising\".Lib Dem spokesman Ed Davey meanwhile said instead of the \"bonfire of quangos\" New Labour had promised, there had been an \"explosion\" of them.He urged a limit on the number of quangos that could be set up by any individual government department.Conservative deregulation spokesman John Redwood said: \"The research endorses our policy of destroying unwanted and unnecessary quangos, and slimming down the rest.Mr Lewis wants a public inquiry into regional development agencies which cost £1.8bn a year - cash he says which \"appears to be almost entirely wasted\".The UK has 529 quangos financed with billions of pounds of taxpayers' cash - many of which are useless or duplicate each other's efforts, a report claims.\"A Conservative government will axe 162 quangos, as part of its drive for more efficient and more accountable government.\""}