{"raw_text": "Howard unveils Tory asylum plans\n \n Tory plans to cut immigration to the UK are not racist and will make the asylum system fairer for genuine refugees, Michael Howard has said.\n \n As his party set out detailed asylum reform plans, Mr Howard said they would help smash people smuggling gangs. There would be an annual limit on asylum and all claims would be processed overseas. Some charities say the plans would put refugees' lives at risk if they were turned away once quotas were filled.\n \n Tony Blair said Labour would set out workable plans for tackling immigration abuse in the next few weeks and attacked the Tory plans. \"By cutting the number of front-line immigration staff at our borders, they will actually make the problem worse,\" said Mr Blair. Liberal Democrat chairman Matthew Taylor said there needed to be a quick, fair and firm asylum system. But he said it was \"absolutely disgusting\" to propose a system which could turn away genuine refugees. The Conservatives say there is little risk of this happening as demand for asylum will be considered when quotas are set.\n \n In a speech in London on Monday, Mr Howard said: \"It's not racist, as some people to claim, to talk about controlling immigration far from it.\" He said that coming from an immigrant family himself he recognised that \"firm but fair\" immigration controls were essential for good community relations.\n \n \n  - Withdrawing from the 1951 United Nations Convention on refugees, which obliges countries to accept people being persecuted on the basis of need, not numbers \n  - Introduce laws to allow the immediate removal of asylum seekers whose claims were clearly unfounded because they came from safe countries or had destroyed documents \n  - Detain asylum seekers without documents so people whose identity was not known were not able to move freely around the UK - a worry for \"national security\" \n  - Stop considering asylum applications inside the UK and instead take people from United Nations refugee agency camps. Anyone applying for asylum would be taken to new centres close to their countries of origin. \n  \n \n The Tories also want quotas for those seeking work permits through an Australian-style points system and those wanting to join families in the UK.\n \n Mr Howard said nearly 160,000 people were settling in the UK every year - the size of a city like Peterborough. The plans would help achieve a \"substantial reduction\" in immigration, he said, although he could not predict a figure. He said that only two out of 10 asylum seekers had their claims accepted under the current \"unfair and inhumane\" system.\n \n \"We need to break the link between arriving in Britain and claiming asylum,\" Mr Howard said. \"By breaking that link we can smash the criminal gangs at the heart of the trade in people smuggling.\"\n \n But the UN refugees agency is worried the policy sends the wrong message to poorer countries which receive the bulk of refugees. And a spokesman for European Justice and Home Affairs Commissioner Franco Frattini said the plans would contravene EU asylum policy, which meant the UK could not simply refuse to hear an asylum case. Refugee Council Chief Executive Maeve Sherlock called the plans \"dangerous, ill thought-out and hugely irresponsible\". Lives could be put at risk if refugees were turned away once the quotas were filled, she warned. Commission for Racial Equality chairman Trevor Phillips said asylum applications were down 40% and economic migration down about 10%.\n \n He did not think Mr Howard intended to centre the debate about race. But he warned that some campaigners could use his words to hint the policy was about keeping out people of a different colour or culture. Mr Howard called that suggestion \"disgraceful\".\n", "llama3.2:1b": "Howard unveils Tory asylum plans, saying they are fairer and would help smash people smuggling gangs, cutting immigration to 160,000 per year. He claims it is not racist and prioritizes genuine refugees' lives over those turned away. The plans involve limiting asylum applications, immediate removal of unfounded cases, and a points system for work permits.", "llama3.2:3b": "Tory asylum plans unveiled, aiming to cut immigration and make the system fairer for genuine refugees. The plans include:\n- Annual limit on asylum\n- All claims processed overseas\n- Quotas for work permits and family reunification\n- Withdrawing from the 1951 United Nations Convention on refugees\n- Laws allowing immediate removal of unfounded claims\n- Detaining asylum seekers without documents\n\nLabour, Liberal Democrats, charities, and some officials express concerns that the plans could put refugees' lives at risk if quotas are filled.", "gemma2:2b": "The Conservative party plans to reduce immigration by implementing quotas, processing asylum claims overseas, and removing individuals with unfounded claims quickly.  Charities argue these policies could endanger refugees by denying them their right to asylum. Critics point out the policy could further exacerbate racial tensions within society. \n", "qwen2.5:0.5b": "Howard announces Tory asylum reforms aimed at breaking the link between arrival in Britain and claiming asylum, but faces criticism from EU refugee agency officials for sending wrong messages to poorer countries.", "qwen2.5:1.5b": "Michael Howard, leader of the Conservative Party, criticizes Labour's plans to reduce immigration and reform asylum procedures, arguing they are not racist but aim to make the system fairer for genuine refugees by reducing reliance on quotas and processing claims overseas. He also proposes scrapping the 1951 United Nations Convention on refugees and introducing stricter controls to prevent illegal migration, particularly from countries considered safe or those who present false documents. This includes detaining asylum seekers without documentation, taking them out of the UK for a while, and considering asylum applications only after quotas are filled abroad. The reforms also include allowing immediate removal of those with unfounded claims and creating points-based systems for work permits and family reunification. However, some critics worry about potential risks to refugees' lives if they are turned away based on quotas, and there is concern over the impact on poorer countries hosting large numbers of refugees and contravening EU asylum policy.", "qwen2.5:3b": "Michael Howard, then-Tory leader, announced plans for tighter UK immigration controls and asylum reforms, including annual limits on asylum applications and processing them overseas. He claimed these measures would combat human trafficking but faced criticism from Labour and Lib Dems. The Conservatives proposed laws to remove unfounded claims and detain individuals without documents for security reasons. However, the UN refugees agency was concerned about potential adverse effects on poorer countries accepting refugees. Critics like Maeve Sherlock of the Refugee Council argued that asylum seekers could face risk if quotas were filled. Trevor Phillips of the Commission for Racial Equality pointed out a drop in asylum applications and economic migration. Howard defended his stance against racism, stressing fair and firm immigration controls essential for good community relations.", "opencoder:1.5b": "Howard unveils Tory asylum plans\n\nTory plans to cut immigration to the UK are not racist and will make the asylum system fairer for genuine refugees, he said.\n\nAs his party set out detailed asylum reform plans, he said they would help smash people smuggling gangs. There would be an annual limit on asylum and all claims would be processed overseas. Some charities say the plans would put refugees' lives at risk if they were turned away once quotas were filled.\n\nTony Blair said Labour would set out workable plans for tackling immigration abuse in the next few weeks and attacked the Tory plans. \"By cutting the number of front-line immigration staff at our borders, they will actually make the problem worse,\" he explained. Liberal Democrat chairman Matthew Taylor said it was \"absolutely disgusting\" to propose a system which could turn away genuine refugees. The Conservatives say there is little risk of this happening as demand for asylum will be considered when quotas are set.\n\nIn a speech in London on Monday, Howard said: \"It's not racist, as some people to claim, to talk about controlling immigration far from it.\" He recognized that coming from an immigrant family himself he understood that \"firm but fair\" immigration controls were essential for good community relations.\n\nWithdraw from the 19th United Nations Convention on refugees, which obliges countries to accept people being persecuted on the basis of need, not numbers. Introduce laws to allow the immediate removal of asylum seekers whose claims were clearly unfounded because they came from safe countries or had destroyed documents. Stop considering asylum applications inside the UK and instead take people from United Nations refugee agency camps. Anyone applying for asylum would be taken to new centres close to their countries of origin.\n\nThe Tories also want quotas for those seeking work permits through an Australian-style points system and those wanting to join families in the UK.\n\nMr Howard said nearly 160,000 people were settling in the UK every year - the size of a city like Peterborough. The plans would help achieve a \"substantial reduction\" in immigration, he said, although he could not predict a figure. He said that only two out of ten asylum seekers had their claims accepted under the current \"unfair and inhumane\" system.\n\n\"We need to break the link between arriving in Britain and claiming asylum,\" Mr Howard said. \"By breaking that link we can smash the criminal gangs at the heart of the trade in people smuggling.\"\n\nBut the UN refugees agency is worried the policy sends the wrong message to poorer countries which receive the bulk of refugees. And a spokesman for European Justice and Home Affairs Commissioner Franco Frattini said the plans would contravene EU asylum policy, which meant the UK could not simply refuse to hear an asylum case. Refugee Council Chief Executive Maeve Sherlock called the plans \"dangerous, ill thought-out and hugely irresponsible\". Lives could be put at risk if refugees were turned away once the quotas were filled, she warned.\n\nHe did not think Mr Howard intended to centre the debate about race. But he warned that some campaigners could use his words to hint the policy was about keeping out people of a different colour or culture. Mr Howard called that suggestion \"disgraceful\". \n\nThe key takeaways from this summary are that Howard unveils a radical approach to asylum, which challenges the current system's fair and unbiased nature, but also ensures equal opportunities for all citizens in the UK.\n", "smollm:1.7b": "The summary is:\n\n* Howard unveils Tory asylum plans, which will make the asylum system fairer for genuine refugees and reduce immigration to the UK.\n* The plans will help smash people smuggling gangs by cutting off the supply of new arrivals.\n* There will be an annual limit on immigration and all claims will be processed overseas.\n* Some charities say the plans would put refugees' lives at risk if they were turned away once quotas were filled.\n* Tony Blair says Labour would set out workable plans for tackling immigration abuse in the next few weeks, but said it was \"absolutely disgusting\" to propose a system which could turn away genuine refugees.\n* The Conservatives say there is little risk of this happening as demand for asylum will be considered when quotas are set.\n* Mr Howard says he would withdraw from the 1951 United Nations Convention on refugees, which obliges countries to accept people being persecuted on the basis of need, not numbers. He said that coming from an immigrant family himself he recognized that \"firm but fair\" immigration controls were essential for good community relations.\n* The plans will help achieve a \"substantial reduction\" in immigration and would help break the link between arriving in Britain and claiming asylum.\n* Mr Howard said nearly 160,000 people are settling in the UK every year - the size of a city like Peterborough.\n* The plans would help achieve a \"substantial reduction\" in immigration and would help break the link between arriving in Britain and claiming asylum.\n* But the UN refugees agency is worried the policy sends the wrong message to poorer countries which receive the bulk of refugees. And a spokesman for European Justice and Home Affairs Commissioner Franco Frattini said the plans would contravene EU asylum policy, which meant the UK could not simply refuse to hear an asylum case.\n* Refugee Council Chief Executive Maeve Sherlock called the plans \"dangerous, ill thought-out and hugely irresponsible\". Lives could be put at risk if refugees were turned away once the quotas were filled, she warned.\n* Mr Howard said that some campaigners could use his words to hint the policy was about keeping out people of a different colour or culture. But he warned that such suggestion would be \"disgraceful\".", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely. Let's see what's important here.\n\nThe main points are that Michael Howard is bringing up his immigration policies. He's saying they're not racist and will make the system fairer for refugees. There are plans about limiting asylum applications, especially turning off people without documents so as not to lose their identity.\n\nOther key points include Tony Blair rejecting these policies, criticizing the system. The Liberal Democrat chairman says it needs a quick, firm system but is not much of a joke. Conservatives don't have any risk since they'll set out plans soon. They also want workable immigration controls and family joining.\n\nThe document mentions specific actions like denying asylum without documents, stopping applications inside the UK, and targeting poorer countries by sending incorrect claims. Also, Howard didn't intend to center race but warned about some people using his words negatively.\n\nI need to condense all that into a clear summary without losing any important details.\n</think>\n\nHoward is presenting immigration policies aimed at improving fairness for refugees. He claims they are not racist and will streamline the system to reduce racial inequality. Plans include limiting asylum applications, especially denying those without documents, so individuals with unclear identities cannot move freely. He also rejected previous approaches, criticizing the lack of a fair asylum system in poorer countries. Conservatives want workable immigration controls, while those joining families aim for a unified approach. Howard emphasized that race won't be the focus but warned against some people using his words negatively.", "tinyllama:1.1b": "In his speech announcing the Conservative Party's immigration reform plans, UK Prime Minister David Cameron has said that the party would cut immigration to the UK by halving the current limit on asylum seekers and introducing a points system for determining work permit applications. The plans aim to tackle \"firm but fair\" immigration controls, promising an \"absolutely disgustic\" approach in dealing with asylum seekers. However, some campaigners have suggested that the policy is about keeping out people of different cultures or races and Mr Cameron has replied by stating that the party does not intend to center their debate around race. Instead, they aim to reduce immigration by half while considering a \"substantial reduction\" in numbers. The plan includes withdrawing from the UN Convention on Refugees and introducing laws allowing for the immediate removal of asylum seekers with clear evidence that they have come from safe countries or whose identity had not been proven. Asylum applications would also be taken inside UK and people seeking work permit access would use a points system. The plan could see some campaigners use the debate about race as disgraceful, but Mr Cameron has dismissed the suggestion.", "tinydolphin:1.1b": " Here is an equivalent summary: The Conservatives are planning immigration reform, stating they will end quotas on immigrants and allow people with valid asylum claims to stay in the UK without fear of being sent back. This would help make the asylum system fairer for genuine refugees, while breaking the link between arriving and claiming asylum will send a strong message about the importance of borders. However, some critics argue that this may lead to an increase in asylum seekers, which could potentially put people at risk if their claims are refused.", "phi:2.7b": " Michael Howard, leader of the Conservative Party, defended their plans to cut immigration and reform the asylum system by stating it is not racist and will make it fairer for genuine refugees. The proposed reforms include an annual limit on asylum claims and processing all claims overseas. However, some charities have expressed concerns that these changes could put refugees' lives at risk if they are turned away once quotas are filled. Tony Blair has criticized the Tory plans as making the problem worse by cutting the number of front-line immigration staff at borders. The Liberal Democrats have called for a quick, fair and firm asylum system. However, it is unacceptable to propose a system that could turn away genuine refugees, they argue. Mr Howard believes that controlling immigration far from racist, having come from an immigrant family himself. He sees the need for \"firm but fair\" immigration controls as essential for good community relations. The Conservatives plan to withdraw from the United Nations Convention on Refugees and introduce laws allowing immediate removal of asylum seekers whose claims were clearly unfounded. They also propose detaining asylum seekers without documents, citing national security concerns. Mr Howard supports taking asylum seekers from refugee camps in their countries of origin instead of processing them within the UK. He believes that almost 160,000 people are settling in the UK every year and these reforms will help reduce immigration. The Tories also want to implement a points system for work permits and family reunification. While Mr Howard cannot predict how many immigrants would be affected by the changes, he does believe it will lead to a significant reduction. He believes that only two out of 10 asylum seekers had their claims accepted under the current system. The proposed reforms seek to break the link between arriving in Britain and claiming asylum, which Mr Howard sees as being controlled by criminal gangs involved in people smuggling. However, the United Nations Refugee Agency is concerned about sending the wrong message to poorer countries that receive a majority of refugees. Additionally, European Union policy requires the UK to hear all asylum cases and Mr Howard's proposals could contravene this. Maeve Sherlock, Chief Executive of the Refugee Council, warns that turning away genuine refugees once quotas are filled could be dangerous. Trevor Phillips, Chief Executive of the Commission for Racial Equality, notes that there has been a significant decrease in both economic migration and asylum applications. He does not believe Mr Howard's comments about race being behind the reforms. However, he cautions that some campaigners may use these remarks to imply that the policy is discriminatory. Mr Howard rejects this suggestion as \"disgraceful\". The Refugee Council warns that turning away refugees could put their lives at risk if quotas are full.\n", "orca-mini:3b": " Tory asylum plans would cut immigration, limit asylum claims and make the system fairer for genuine refugees, says Michael Howard. Plans would also allow for the immediate removal of asylum seekers whose claims were clearly unfounded because they came from safe countries or had destroyed documents, detain asylum seekers without documents, stop considering asylum applications inside the UK and take people from UN refugee agency camps.", "hermes3:3b": "Tory asylum plans:\n- Cut annual immigration limit\n- Process all asylum claims abroad\n- Propose withdrawing from 1951 UN Convention on refugees\n- Introduce laws for immediate removal of unfounded asylum seekers\n- Detain asylum seekers without documents\n- Stop considering asylum applications inside UK and take them from refugee agency camps near their origin countries", "stablelm-zephyr:3b": "Tory plans to cut immigration in the UK, presented by Michael Howard, claim they will make the asylum system fairer for genuine refugees and help defeat people smuggling gangs. The annual limit on asylum will be implemented along with overseas processing for all claims. Despite concerns that the plans could turn away genuine refugees, Howard argues it is not racist to control immigration. Critics, however, argue that such a system may put refugees' lives at risk if they are turned away once quotas reach capacity. The Tories also propose quotas for work permits and family reunions through an Australian-style points system. While the UN Refugee Agency expresses concerns about the policy's impact on poorer countries receiving the majority of refugees, Howard states that breaking the link between arriving in Britain and claiming asylum will help defeat people smuggling gangs.", "stablelm2:1.6b": "Former UK government leader Michael Howard revealed Tory plans to reform asylum system, stating they would make the system fairer for genuine refugees and help destroy people-smuggling gangs. The new plan includes an annual limit on asylum claims, processing overseas, and detaining those without documents. Critics argue that this could put refugees' lives at risk if they are turned away once quotas are filled. Tory plans to curb immigration are not considered racists by Howard, as he recognizes the importance of firm but fair immigration controls for good community relations. Some 1 in 4 asylum seekers' claims are accepted under the current \"unfair and inhumane\" system. The UN refugee agency expresses concern about a policy that may send mixed messages to countries receiving more refugees.", "granite3.1-dense:2b": "Michael Howard, leading the Conservative Party, announced comprehensive asylum reforms aimed at reducing immigration to the UK. The plans include annual limits on asylum applications, processing claims overseas, and detaining undocumented asylum seekers for security reasons. Howard emphasized that these measures are not racist but essential for maintaining fairness in the system. He cited the presence of nearly 160,000 annual immigrants as a significant issue to address.\n\nKey elements of the Conservative plan involve:\n- Withdrawing from the 1951 United Nations Convention on refugees, which mandates accepting persecuted individuals regardless of numbers.\n- Implementing laws for immediate removal of clearly unfounded claims from safe countries or those with destroyed documents.\n- Establishing detention centers for asylum seekers without identification documents to prevent free movement within the UK.\n- Shifting application processes from UK borders to international refugee agency camps, ensuring applicants are taken directly to their countries of origin.\n\nThe plan also proposes quotas for work permit seekers through an Australian-style points system and family reunification requests. Howard asserted that these changes would help break the link between arriving in Britain and claiming asylum, thereby undermining people smuggling networks. However, critics argue that such measures could jeopardize refugee lives if quotas are exhausted, with organizations like the UN Refugees Agency expressing concern over potential negative consequences for countries hosting refugees.\n\nCritics include Labour leader Tony Blair, who claimed the Conservative approach would worsen border control issues; Liberal Democrat chairman Matthew Taylor, who advocated for a swift, fair, and resolute asylum system without turning away genuine refugees; and Maeve Sherlock of the Refugee Council, warning that lives could be at risk if refugees were turned away once quotas were reached.", "chatgpt-4o-latest": "Michael Howard defended Tory immigration plans, stating they were not racist and aimed to make the asylum system fairer while combating people smuggling. The proposals included withdrawing from the 1951 UN Refugee Convention, setting annual asylum limits, processing claims overseas, detaining asylum seekers without documents, and only accepting refugees from UN camps. The Tories also proposed quotas for work permits and family reunification. Howard argued the reforms would significantly reduce immigration and break the link between arriving in Britain and claiming asylum. Critics, including Tony Blair, the UN refugee agency, and charities, warned the plans could endanger refugees and violate EU asylum policies. Some feared the rhetoric could be misused to promote racial exclusion, though Howard rejected such claims.", "reference": "As his party set out detailed asylum reform plans, Mr Howard said they would help smash people smuggling gangs.Tory plans to cut immigration to the UK are not racist and will make the asylum system fairer for genuine refugees, Michael Howard has said.\"We need to break the link between arriving in Britain and claiming asylum,\" Mr Howard said.And a spokesman for European Justice and Home Affairs Commissioner Franco Frattini said the plans would contravene EU asylum policy, which meant the UK could not simply refuse to hear an asylum case.In a speech in London on Monday, Mr Howard said: \"It's not racist, as some people to claim, to talk about controlling immigration far from it.\"The plans would help achieve a \"substantial reduction\" in immigration, he said, although he could not predict a figure.Mr Howard said nearly 160,000 people were settling in the UK every year - the size of a city like Peterborough.He said that only two out of 10 asylum seekers had their claims accepted under the current \"unfair and inhumane\" system.Liberal Democrat chairman Matthew Taylor said there needed to be a quick, fair and firm asylum system.But he said it was \"absolutely disgusting\" to propose a system which could turn away genuine refugees.- Withdrawing from the 1951 United Nations Convention on refugees, which obliges countries to accept people being persecuted on the basis of need, not numbers - Introduce laws to allow the immediate removal of asylum seekers whose claims were clearly unfounded because they came from safe countries or had destroyed documents - Detain asylum seekers without documents so people whose identity was not known were not able to move freely around the UK - a worry for \"national security\" - Stop considering asylum applications inside the UK and instead take people from United Nations refugee agency camps."}