{"raw_text": "New 'yob' targets to be unveiled\n \n Fifty new areas getting special help to fight anti-social behaviour in England and Wales will be named on Thursday.\n \n Ten areas have already had access to special prosecutors and local experts and the government is now expanding the crackdown to more towns and cities. Details of how many anti-social behaviour orders (Asbos) were used in the last year are also being published. Labour sees nuisance behaviour as a key election issue but critics claim the record is at best patchy. A year ago, ministers launched their anti-social behaviour plan and Thursday's figures offer a progress check. They will say that in the past year more than 2,600 anti-social behaviour orders were issued by the courts - more than double the total used in the previous four years.\n \n Police have also closed 150 crack houses and issued more than 400 dispersal orders, breaking up groups of youths in public places. The 50 new pilot areas to get special attention will also receive extra government funding. Exeter and Cardiff are among cities who have voiced interest in being involved.\n \n Prime Minister Tony Blair is also expected to announce new measures to strengthen the use of Asbos and fixed penalty notices. There are still concerns that some areas of the country are not using the powers properly.\n \n He is expected to say that the new figures were heartening but he would not rest until similar action was taken in all areas of the country where it was needed. \"We have not defeated this problem by any means, but shown together what can be done,\" he will say. Mr Blair this week defended the shake-up of the licensing laws, saying it was right to focus on troublemakers rather than treating everybody as a potential drunken nuisance.\n \n Ministers also boast of record police numbers and are speeding up plans to put in place 25,000 community support officers (CSOs). But researchers from Leeds University warned that CSOs could undermine traditional bonds between police officers and communities. More work needed to be done on clarifying the role of different agencies and how they linked together before CSOs, they argued in a the study. Critics of the government say it has announced more than 20 initiatives to tackle nuisance behaviour when the real focus should be on good policing. Home Office Minister Hazel Blears also revealed this week that \"about a third\" of Asbos were breached - with some people jailed and others not.\n", "llama3.2:1b": "Fifty new areas in England and Wales will receive special help to fight anti-social behavior, including access to prosecutors and experts, and the government will publish details of anti-social behaviour orders used in the past year. Additionally, police have closed 150 crack houses and issued dispersal orders, with 400 more being issued this year. The new pilot areas will also get extra funding.", "llama3.2:3b": "Fifty new areas in England and Wales will receive special help to fight anti-social behavior, including 10 already identified as well as additional funding for Exeter and Cardiff. The government has issued over 2,600 anti-social behavior orders in the past year, more than double the previous four years. Prime Minister Tony Blair plans to announce new measures to strengthen Asbos and fixed penalty notices, despite concerns about their effective use.", "gemma2:2b": "Fifty new areas will receive special help to fight anti-social behavior. 2,600 ASBOs were issued last year, more than double the previous four years. Police closed 150 crack houses and issued more than 400 dispersal orders.  The government is expanding its crackdown using Asbos, fixed penalty notices, and increased funding for targeted pilot areas. Prime Minister Tony Blair will announce new measures to strengthen these powers. Some researchers express concerns about the role of CSOs and the effectiveness of the overall strategy. Critics point out that the government has launched more than 20 initiatives but should focus on good policing.  About a third of ASBOs are breached, with some individuals jailed or not. \n", "qwen2.5:0.5b": "The new areas called \"yob\" in England and Wales have received special attention to fight anti-social behavior, which will be named on Thursday. Ten areas have already had access to special prosecutors and local experts, but the government is expanding the crackdown to more towns and cities with details of anti-social behavior orders issued in the last year.\n\nPolice are also closing 150 crack houses and issuing over 400 dispersal orders, breaking up groups of youths in public places. Exeter and Cardiff have expressed interest in being involved, and a further 50 pilot areas will receive extra government funding.\n\nThe prime minister is expected to announce new measures for the use of Asbos and fixed penalty notices. There are still concerns about some areas not using them properly.\n\nMinisters are also boosting police numbers and speeding up plans for community support officers (CSOs). However, researchers from Leeds University argue that CSOs could undermine traditional police-bond relationships by working with different agencies and linking together before implementing CSOs.\n\nCritics of the government say more efforts should be made to tackle nuisance behavior rather than placing all the blame on policing alone.", "qwen2.5:1.5b": "Fifty new areas will receive special attention for fighting anti-social behavior, following an increase in help for 10 cities since the government launched its plan last year. Figures show that more than 2,600 anti-social behavior orders have been issued over the past year, a significant rise from previous years. The measures include extra funding and better law enforcement, with police closing 150 crack houses and issuing dispersal orders to break up public youth groups. Prime Minister Tony Blair plans to announce new strong action against Asbos and fixed penalty notices, emphasizing continued need for proper implementation across the country. Critics argue that some areas are not using these powers effectively and that more research is needed on clarifying CSO roles before their full implementation.", "qwen2.5:3b": "New 'yob' targets will be announced, including 50 additional areas receiving special help to combat anti-social behavior in England and Wales. The government has expanded its crackdown to more towns and cities. Figures showing over 2,600 anti-social behavior orders issued in the last year are being published. Labour sees nuisance behavior as a key election issue but critics argue the record is patchy. Police have closed 150 crack houses and issued over 400 dispersal orders. Exeter and Cardiff expressed interest in participating. Prime Minister Tony Blair plans to strengthen Asbo use and fixed penalty notices, stating that more action needs to be taken nationwide despite not defeating the issue completely. Ministers boast of increasing police numbers and accelerating CSO deployment but researchers warn it could undermine community ties. Home Office data shows about a third of Asbos are breached, with some leading to imprisonment.", "opencoder:1.5b": "New 'yob' targets to be unveiled\n\nFifty new areas getting special help to fight anti-social behaviour in England and Wales will be named on Thursday.\n\nTen areas have already had access to special prosecutors and local experts and the government is now expanding the crackdown to more towns and cities.\n\nDetails of how many anti-social behaviour orders (Asbos) were used in the last year are also being published. Labour sees nuisance behaviour as a key election issue but critics claim the record is at best patchy.\n\nA year ago, ministers launched their anti-social behaviour plan and Thursday's figures offer a progress check. They will say that in the past year more than 2,600 anti-social behaviour orders were issued by the courts - more than double the total used in the previous four years.\n\nPolice have also closed 150 crack houses and issued more than 400 dispersal orders, breaking up groups of youths in public places. The 50 new pilot areas to get special attention will also receive extra government funding. Exeter and Cardiff are among cities who have voiced interest in being involved.\n\nPrime Minister Tony Blair is also expected to announce new measures to strengthen the use of Asbos and fixed penalty notices. There are still concerns that some areas of the country are not using the powers properly.\n\nHe is expected to say that the new figures were heartening but he would not rest until similar action was taken in all areas of the country where it was needed. \"We have not defeated this problem by any means, but shown together what can be done,\" he will say. Mr Blair this week defended the shake-up of the licensing laws, saying it was right to focus on troublemakers rather than treating everybody as a potential drunken nuisance.\n\nMinisters also boast of record police numbers and are speeding up plans to put in place 25,000 community support officers (CSOs). But researchers from Leeds University warned that CSOs could undermine traditional bonds between police officers and communities. More work needed to be done on clarifying the role of different agencies and how they linked together before CSOs, they argued in a the study.\n\nCritics of the government say it has announced more than 20 initiatives to tackle nuisance behaviour when the real focus should be on good policing. Home Office Minister Hazel Blears also revealed this week that \"about a third\" of Asbos were breached - with some people jailed and others not.\n", "smollm:1.7b": "The summary is concise, preserving key ideas and details while omitting unnecessary information. The main points are:\n\n1. New 'yob' targets to be unveiled: A total of 50 new areas will receive special attention from the government in the coming year. These areas have already had access to special prosecutors and local experts and the government is now expanding its crackdown on anti-social behaviour.\n2. Ten areas have already had access to special prosecutors and local experts: The previous four years saw 100 new Asbos issued, but this time the number has increased by 50%. This indicates a more effective use of resources in tackling nuisance behaviour.\n3. Labour sees nuisance behaviour as a key election issue: The government's anti-social behaviour plan is seen as a key election issue and Labour will need to demonstrate its effectiveness in tackling this problem if it wants to win the next general election.\n4. Police have closed 150 crack houses and issued more than 400 dispersal orders: The police are taking action against groups of youths who engage in nuisance behaviour, breaking up larger groups into smaller ones that are easier to disperse.\n5. New measures will be introduced to strengthen the use of Asbos and fixed penalty notices: The government is introducing new measures to strengthen its anti-social behaviour strategy, including more funding for community support officers and better coordination between police forces.\n6. Prime Minister Tony Blair is expected to announce new measures to tackle nuisance behaviour: The prime minister will be announcing a range of initiatives to address the problem of nuisance behaviour, including additional police numbers and CSOs.\n7. Researchers from Leeds University warned that CSOs could undermine traditional bonds between police officers and communities: The researchers argued that CSOs could erode trust in police and undermine the effectiveness of community policing if not managed carefully.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about new efforts in England and Wales related to anti-social behaviour. Let me read through the user's query first.\n\nThe original text talks about 50 new areas being given special help to fight anti-social behaviour. Ten of these have already had access to prosecutors and local experts. The government is expanding their crackdown to more towns and cities, and details on how many Asbos were used last year are published. Labour sees nuisance behaviour as a key issue but critics find the record incomplete.\n\nThe text mentions that a year ago, the ministers launched this plan and that figures show more than double the orders from the previous four years. Police have closed 150 crack houses and issued 400 dispersal orders, breaking up youths in public spaces. Exeter and Cardiff are among those interested.\n\nPrime Minister Tony Blair is expected to announce new Asbos measures and fixed penalty notices. Concerns remain about areas not using these powers effectively. He'll emphasize that while the figures are positive, actions need to be taken nationwide.\n\nThe text also states that there are plans for 25,000 CSOs, but researchers warn they might undermine police-community links. Critics argue that efforts in nuisance handling aren't reflecting proper focus on good policing.\n\nNow, I need to condense this into a concise summary. I'll keep the key areas: target areas, existing info, figures from last year, efforts by police and government, and the ministers' statements about future measures. I'll make sure not to include any explanations or formatting.\n</think>\n\nFifty new local areas in England and Wales are being given special help to combat anti-social behaviour. Ten of these regions already have access to prosecutors and local experts. The government is expanding enforcement efforts across towns and cities, with detailed records from last year's anti-social behaviour orders published. Labour sees nuisance behaviour as a major issue but criticizes the record for being incomplete. A year ago, ministers launched this plan, which they've now used data to show more than double the orders issued since the previous four years. Police have closed 150 crack houses and issued 400 dispersal orders, breaking up youths in public places. Exeter and Cardiff are interested in these pilot areas. Prime Minister Tony Blair expects new measures for Asbos and penalty notices, emphasizing that while figures show progress, nationwide enforcement is needed. He will stress the need to take action where it's required. The government has plans to set up 25,000 community support officers but warned researchers that CSOs might weaken police-community connections. Critics argue that efforts in tackling nuisance behaviour aren't properly focused on police improvement.", "tinyllama:1.1b": "The UK government has unveiled fifty new areas getting special help to fight anti-social behavior in England and Wales, with access to special prosecutors and local expertise being named on Thursday. The ten areas were already receiving access to Asbos issued by the courts, although this will now be expanded to more towns and cities. Labour sees the plan as a \"patchy\" one, criticizing the record of previous ministers launching anti-social behavior plans. Police will receive extra government funding to improve policing in pilot areas, with Prime Minister Tony Blair expected to announce new measures such as increased use of Asbos and fixed penalty notices. Ministers have defended their shake-up of licensing laws as necessary but may face resistance due to concerns about drug-takers being overlooked while police are focused on troublemakers. The government has also announced a record 25,000 community support officers (CSOs), but researchers from Lee's University warn that CSOs could undermine traditional policing bonds between officers and communities. Meanwhile, Home Office Minister Hazel Blears revealed that about three-quarters of Asbos were breached, with some people jailed and others not receiving punishments.", "tinydolphin:1.1b": " In summary, the government announced the naming of fifty new areas for extra support from special prosecutors and local experts in England and Wales, to tackle anti-social behavior. Details of how many Asbos were used in the last year will also be published on Thursday along with an update on crackdown efforts in other areas. The minister is expected to announce new measures to strengthen the use of Asbos and fixed penalty notices by introducing a \"heartening but not yet perfect system.\" He also defended the license laws shake-up, stating that it was important to focus on troublemakers rather than treating everybody as potential nuisances.", "phi:2.7b": " On Thursday, 50 new areas in England and Wales will receive special attention for fighting anti-social behaviour as the government expands its crackdown to more towns and cities. The crackdown includes providing access to local experts and prosecutors, and using anti-social behavior orders (Asbos) to break up groups of youths. Despite concerns that some areas are not using the powers properly, Prime Minister Tony Blair is expected to announce new measures to strengthen the use of Asbos and fixed penalty notices. Police have also cracked down on nuisance behaviour by closing 150 crack houses and issuing more than 400 dispersal orders. More police officers and community support officers (CSOs) are being trained, but there are concerns about the impact of CSOs on traditional bonds between the police and communities.\n", "orca-mini:3b": " New areas in England and Wales will get special help to combat anti-social behavior, including increased funding and access to prosecutors and experts. More than 2,600 anti-social behavior orders (Asbos) were issued by the courts last year, double the total used in the previous four years. More than 400 dispersal orders were issued, breaking up groups of young people in public places. Prime Minister Tony Blair is expected to unveil new measures for stronger use of Asbos and fixed penalty notices, but concerns remain about the lack of action in some areas.", "hermes3:3b": "New 'yob' areas named, additional ASBOs & dispersal orders published; expansion to fight anti-social behaviour in England/Wales.", "stablelm-zephyr:3b": "Fifty new areas in England and Wales will receive special help to combat anti-social behavior, expanding on the existing ten pilot areas. The government is also publishing details on the number of anti-social behavior orders used last year (over 2,600). Prime Minister Tony Blair plans to announce measures to strengthen Asbos and fixed penalty notices, addressing concerns that some areas are not using these powers effectively. Meanwhile, a study by Leeds University warns that community support officers could undermine traditional police-community relationships, and Home Office Minister Hazel Bleals reveals that about a third of Asbos were breached.", "stablelm2:1.6b": "The UK government will unveil 50 new areas targeting anti-social behavior in England and Wales, expanding the crackdown to more towns and cities. The number of ASBOs issued by courts in the last year is double the previous four years' total, with police also closing crack houses and issuing dispersal orders. Exeter, Cardiff, and other cities are interested in new pilot areas receiving extra funding. Prime Minister Tony Blair will announce new measures to strengthen ASBOs and fixed penalty notices due to concerns that some areas don..", "granite3.1-dense:2b": "The UK government will unveil 50 new areas, primarily towns and cities in England and Wales, as part of an expanded anti-social behavior initiative. These regions will receive additional funding and special support from prosecutors and local experts. In the past year, over 2,600 anti-social behavior orders (Asbos) were issued, more than doubling the previous four-year total. Police have also closed 150 crack houses and dispersed over 400 youth groups in public places. Prime Minister Tony Blair is expected to announce new measures to enhance Asbo usage and fixed penalty notices. Despite progress, concerns remain about uneven implementation across the country. Researchers from Leeds University caution that community support officers (CSOs) might weaken police-community relationships, necessitating further clarification of their roles. Critics argue the government has introduced numerous initiatives without adequately focusing on improved policing. About one-third of Asbos were breached, with some individuals jailed and others not.", "chatgpt-4o-latest": "The UK government is expanding its crackdown on anti-social behaviour by naming 50 new areas in England and Wales to receive special support, including extra funding and access to special prosecutors. Over the past year, more than 2,600 anti-social behaviour orders (Asbos) were issued—more than double the total from the previous four years—along with 150 crack house closures and 400 dispersal orders. Prime Minister Tony Blair is expected to announce further measures to strengthen Asbos and fixed penalty notices, emphasizing that while progress has been made, more action is needed nationwide. The government also highlights record police numbers and plans for 25,000 community support officers (CSOs), though researchers warn CSOs could weaken traditional police-community ties. Critics argue that repeated initiatives focus too much on new measures rather than effective policing, and concerns remain over the enforcement of Asbos, with about a third being breached.", "reference": "Details of how many anti-social behaviour orders (Asbos) were used in the last year are also being published.The 50 new pilot areas to get special attention will also receive extra government funding.Fifty new areas getting special help to fight anti-social behaviour in England and Wales will be named on Thursday.They will say that in the past year more than 2,600 anti-social behaviour orders were issued by the courts - more than double the total used in the previous four years.He is expected to say that the new figures were heartening but he would not rest until similar action was taken in all areas of the country where it was needed.A year ago, ministers launched their anti-social behaviour plan and Thursday's figures offer a progress check.Critics of the government say it has announced more than 20 initiatives to tackle nuisance behaviour when the real focus should be on good policing.Ministers also boast of record police numbers and are speeding up plans to put in place 25,000 community support officers (CSOs)."}