{"raw_text": "Ministers deny care sums 'wrong'\n \n Ministers have insisted they are committed to free personal care for the elderly despite research suggesting the cost of the policy was under-estimated.\n \n A report by the Fraser of Allander Institute says the decision to push ahead with the flagship policy was based on flawed research. Deputy Health Minister Rhona Brankin has pledged to study the research. SNP Holyrood leader Nicola Sturgeon said the public needed reassurance that the care programme was secure.\n \n The rise in costs stems from a series of mistakes in the research used by the \"care development group\" of Scottish Executive experts who prepared the original costings, according to findings published in the Quarterly Economic Commentary of Strathclyde University's Fraser of Allander Institute. \"Dubious\" assumptions about improving health expectancy could drive the cost of the policy up by another £130m by 2022, the report warned.\n \n It was carried out by husband and wife economist team Jim and Margaret Cuthbert. But Ms Brankin told BBC Radio Scotland: \"We don't think we got our sums wrong. \"Obviously we will examine the findings of this new report, along with figures from our own research that we have already commissioned. \"We will look in great detail at any contribution to this, because we need to be sure we can provide free personal care and nursing care for our older people into the future. \"And we are absolutely committed to doing that.\"\n \n But the Scottish National Party called on ministers to reassure people that enough funding is in place to support the free personal care policy. Ms Sturgeon said that while she had no reason to doubt the executive's support for the policy, there were questions which needed to be answered and, if necessary, sums redone. She said: \"Serious concerns have been raised and there are questions which need to be answered by the Scottish Executive. \"We need to know that the money is there, not just for this year or next year, but into the future so that older people, and those who are looking forward to older age, can rest assured that their personal care needs will be met.\"\n", "llama3.2:1b": "Ministers deny under-estimating the cost of free personal care for the elderly despite a report suggesting it may be higher than estimated. The cost is linked to flawed research by a \"care development group\" of Scottish Executive experts. Deputy Health Minister Rhona Brankin has pledged to study the research, while Nicola Sturgeon called for reassurance that funding is in place.", "llama3.2:3b": "Ministers deny under-estimating costs of free personal care policy, despite research suggesting flawed assumptions drove cost increase by £130m.", "gemma2:2b": "Ministers deny underestimating costs of free personal care for the elderly. Research suggests the policy may need more funding due to flawed initial research assumptions. Ministers intend to study the report and confirm funding is available for future years. The Scottish National Party calls for assurances about funding.  They ask for concrete answers to questions regarding long-term financial guarantees for the program. \n", "qwen2.5:0.5b": "In response to research suggesting the cost of free personal care was under-estimated, Scottish ministers refuse to commit fully to free personal care for the elderly. A report by the Fraser of Allander Institute claims a flawed research used by \"care development group\" experts led to an increase in costs. The current estimate for the policy is £130 million per year by 2022, but this will rise as more accurate data is obtained from further research. Scottish National Party officials urge ministers to explain the funding situation and address concerns about future care needs, while also emphasizing that free personal care should be a priority for older people.", "qwen2.5:1.5b": "Ministers deny cost of free personal care policy was under-estimated despite research suggesting it could rise by £130m by 2022. The decision has led to concerns about funding for the elderly. Ministers pledged to study the report and reassured that they are committed to providing free personal care for older people.", "qwen2.5:3b": "Ministers insist they remain committed to free elderly personal care despite a Fraser of Allander Institute report suggesting initial cost estimates were flawed. The institute's research indicates the policy could incur additional £130m by 2022 due to assumptions about improving health expectancy. Deputy Health Minister Rhona Brankin pledged to study the findings, while SNP leader Nicola Sturgeon called for reassurance from ministers on funding stability for the care programme into the future.", "opencoder:1.5b": "Ministers have insisted they are committed to free personal care for the elderly despite research suggesting the cost of the policy was under-estimated. It was carried out by husband and wife economist team Jim and Margaret Cuthbert. But Ms Brankin told BBC Radio Scotland: \"We don't think we got our sums wrong.\" Clearly, we will examine the findings of this new report, along with figures from our own research that we have already commissioned. We are absolutely committed to doing that. But the Scottish National Party called on ministers to reassure people that enough funding is in place to support the free personal care policy.\n", "smollm:1.7b": "The summary should preserve key ideas and details:\n\n1. The article discusses the decision to push ahead with the free personal care policy despite research suggesting it was under-estimated.\n2. A report by a Fraser of Allander Institute says the decision to push ahead with the policy was based on flawed research.\n3. Deputy Health Minister Rhona Brankin has pledged to study the research.\n4. The rise in costs stems from a series of mistakes in the research used by the \"care development group\" of Scottish Executive experts who prepared the original costings.\n5. Dubious assumptions about improving health expectancy could drive up the cost of the policy up by another £130m by 2022, the report warned.\n6. Ms Brankin told BBC Radio Scotland that she will examine the findings of this new report, along with figures from her own research that she has already commissioned.\n7. She is absolutely committed to providing free personal care and nursing care for our older people into the future.\n8. There are questions which need to be answered and, if necessary, sums redone.\n9. Ms Sturgeon said that while she had no reason to doubt the executive's support for the policy, there were concerns which needed to be addressed by the Scottish Executive. She said: \"Serious concerns have been raised and there are questions which need to be answered by the Scottish Executive.\"", "deepseek-r1:1.5b": "<think>\nAlright, let me tackle this query. The user has given a detailed text about ministers denying care sums 'wrong' and wants it summarized concisely with key ideas and details preserved. They specifically asked for plain text without explanations or formatting.\n\nFirst, I need to read through the provided text carefully to extract the main points. The text discusses two main issues: the ministers' denial of care costs being 'wrong' and another report suggesting flawed research leading to high costs.\n\nI notice that the report is from the Fraser of Allander Institute at Strathclyde University, indicating a specific policy on free personal care for the elderly. The key points are:\n- Ministers insist they're committed despite flawed research.\n- A study by Dr. Rhona Brankin has pledged to review the research.\n- Nicola Sturgeon from SNP Holyrood said the public needed reassurance about funding security.\n- Jim and Margaret Cuthbert's team did the initial cost analysis, but Brankin believes assumptions are questionable.\n- The report warns of potential increased costs by £130m over 2022 if research is flawed.\n- They'll review findings and ensure future funding for care.\n\nNow, I need to condense this into a summary. It's important to include all the main points without getting too detailed. Also, since it's plain text, I should avoid any markdown or special formatting. The user wants only the summary as plain text, so I'll make sure to keep it concise and accurate.\n\nI should structure the summary to first mention the ministers denying 'wrong' care sums. Then, introduce the report from the Fraser Institute pointing out flawed research leading to high costs. Mention Dr. Brankin's commitment to researching and Sturgeon's assurance of funding security. Highlight that while they believe their initial assumptions were wrong, they're reviewing everything. Also, note the team's role and any potential increases in costs.\n\nI need to ensure clarity and maintain a logical flow: problem (ministers' stance), research findings (report), commitment from Brankin, Sturgeon's assurance, the team's contribution, review process, funding security, and possible future costs.\n\nFinally, I'll make sure each key point is covered succinctly without adding extra information that wasn't in the original text. That way, the summary is accurate and maintains all critical details.\n</think>\n\nMinisters deny 'wrong' care sums despite flawed research. A report from the Fraser of Allander Institute highlights flawed research leading to high costs, claiming potential increases by £130m by 2022 if assumptions are incorrect. Dr. Rhona Brankin has pledged to review the research and Sturgeon assures funding security for future care. Jim and Margaret Cuthbert's initial analysis was flawed but they will review findings and ensure secure funding for older people.", "tinyllama:1.1b": "A report by the Frazer of Allander Institute has found that research used by Scottish Executive expert's team for the care development group was riddled with flawed assumptions about improving health expectancy, resulting in an inflated estimate of personal care costs. This is despite ministers insisting they are committed to providing free personal care and nurse care for older people into the future. The ministers, who also called on the Scottish National Party (SNP) to reassure people that enough funding is available, have pleaded for more research to be conducted before releasing a new report, which has been commissioned by husband-and-wife economists Jim and Margaret Cuhtbert. The latest findings from the team of Scottish experts will also be examined during ministers' review of the policy to ensure it supports funding for free personal care and nurses care into the future. However, SNP MP Ms Nicola Sturgeon has called for ministers to reassure people that enough money is in place to support the policy and has said that while she had no reason to doubt the executive's commitment to free personal care, there were questions that needed to be answered and, if necessary, sums redone.", "tinydolphin:1.1b": " The Ministers have been accused of mismanaging a £130 million care sum for the elderly. A report by the Fraser of Allander Institute has revealed flawed research used to calculate this cost. According to findings, the original estimate was too low and the actual cost could be as much as £130 million higher than anticipated. The report warns that if the costs continue to increase, it will put significant strain on the current funding.", "phi:2.7b": " Research suggests cost of free personal care for elderly in Scotland was under-estimated. Deputy Health Minister Rhona Brankin has pledged to study flawed research used by the Scottish Executive's \"care development group\". The rise in costs stems from \"dubious\" assumptions about improving health expectancy, which could drive up the cost of the policy by £130m by 2022. Ms Brankin stated that she did not think they got their sums wrong and would examine the new report and commissioned figures to provide free personal care for older people into the future. The Scottish National Party called on ministers to reassure people that enough funding is in place to support the policy, and questions needed to be answered by the executive if necessary. SNP Holyrood leader Nicola Sturgeon said they needed reassurance that the care programme was secure and that more information was required.\n", "orca-mini:3b": " Ministers have denied that their decision to provide free personal care for the elderly was based on flawed research, despite a report by the Fraser of Allander Institute saying the cost of the policy was under-estimated. The rise in costs is due to mistakes in the research used by the \"care development group\" of Scottish Executive experts who prepared the original costings. The report suggests that another £130m will be needed by 2022, and the Scottish National Party called on ministers to reassure people that enough funding is in place to support the policy.", "hermes3:3b": "Ministers insist on free elderly care despite underestimated cost research findings.", "stablelm-zephyr:3b": "Ministers maintain commitment to free personal care for the elderly despite research suggesting the cost may be under-estimated. A report by the Fraser of Allander Institute indicates that mistakes in the original research by the \"care development group\" of Scottish Executive experts led to an over-estimation of costs. Deputy Health Minister Rhona Brankin pledges to study the research and reassure the public that funding is secure for the future. The Scottish National Party calls on ministers to provide further assurance about long-term funding for the policy.", "chatgpt-4o-latest": "Ministers have reaffirmed their commitment to free personal care for the elderly despite a report from the Fraser of Allander Institute suggesting the policy's costs were underestimated. The report, by economists Jim and Margaret Cuthbert, claims flawed research led to miscalculations, with costs potentially rising by £130m by 2022 due to incorrect assumptions about health expectancy. Deputy Health Minister Rhona Brankin defended the government's calculations but pledged to review the findings. SNP leader Nicola Sturgeon urged ministers to reassure the public that sufficient funding is in place, emphasizing the need for long-term financial security for the policy.", "stablelm2:1.6b": "Ministers deny care sums based on flawed research. A report by Fraser of Allander Institute suggests that the decision to advance a free elderly care policy was based on mistakes in the original cost estimates by Scottish Executive experts. The rise in costs is attributed to \"dubious\" assumptions about improving health expectancy, driving up the cost by another ££m by the report's findings. However, Deputy Health Minister Rhona Brankin will study the research. SNP Holyrood leader Nicola Sturgeon urges ministers to provide reassurance that enough funding supports the free personal care policy for future elderly care needs.", "granite3.1-dense:2b": "Ministers maintain their commitment to free personal care for the elderly, despite a report from the Fraser of Allander Institute suggesting underestimation of policy costs. The study, conducted by Jim and Margaret Cuthbert, indicates potential additional £130m expenses due to flawed assumptions about enhancing health expectancy. Deputy Health Minister Rhona Brankin plans to review the findings alongside existing research, emphasizing their dedication to funding the care program. However, SNP Holyrood leader Nicola Sturgeon calls for reassurance that sufficient funds are allocated to support the policy indefinitely, addressing concerns raised by the report's findings.", "reference": "Ministers have insisted they are committed to free personal care for the elderly despite research suggesting the cost of the policy was under-estimated.But the Scottish National Party called on ministers to reassure people that enough funding is in place to support the free personal care policy.\"We will look in great detail at any contribution to this, because we need to be sure we can provide free personal care and nursing care for our older people into the future.A report by the Fraser of Allander Institute says the decision to push ahead with the flagship policy was based on flawed research.Ms Sturgeon said that while she had no reason to doubt the executive's support for the policy, there were questions which needed to be answered and, if necessary, sums redone.The rise in costs stems from a series of mistakes in the research used by the \"care development group\" of Scottish Executive experts who prepared the original costings, according to findings published in the Quarterly Economic Commentary of Strathclyde University's Fraser of Allander Institute."}