{"raw_text": "Blunkett row should end - Blair\n \n Prime Minister Tony Blair said it was time to draw a line under the controversy surrounding David Blunkett.\n \n The Tories and the Lib Dems have called for a second inquiry into the fast-tracking of a visa application for Mr Blunkett's ex-lover's nanny. Sir Alan Budd found a \"chain of events\" linked Mr Blunkett to Leoncia Casalme's indefinite leave to remain application. At the end of his Middle East trip, Mr Blair said he still admired Mr Blunkett and thought his integrity was intact.\n \n On Tuesday Sir Alan said the application for leave to remain in the UK made by Kimberly Quinn's nanny was processed in 52 days, 120 days faster than the average. But he could not find evidence to show whether Mr Blunkett's intervention was intended to give special help for his then lover's nanny - or if he was raising the case as an example of poor departmental performance. In his first comments since Sir Alan's announcement, Mr Blair told BBC News he had not yet read the report in detail. But told BBC News: \"As far as I'm concerned, we have drawn a line under that.\"\n \n Asked if Mr Blunkett could return to frontline politics at some point, he replied: \"I have made my admiration for David very clear and it remains. \"He's been a tremendous colleague, he's done a great job for us, first as home secretary then as education secretary. The future is something we will have to approach in the future.\" The prime minister shrugged off claims from Conservative leader Michael Howard that he led a \"grubby government\". He said Mr Blunkett's integrity remained intact: \"He was the person first of all who asked for this inquiry to be set up. He accepted that what he originally thought had happened had not happened, he said. \"But I think Sir Alan Budd also accepted there wasn't some conspiracy or cover-up and I just think a line should be drawn under now and we should move on.\"\n \n Earlier, Mr Howard said: \"There does need to be another inquiry, a judge-led inquiry. There were so many questions that weren't answered.\" There was \"deceit at the heart of government\" which was not limited to the visa affair, he argued. Lib Dem home affairs spokesman Mark Oaten also said there was \"a strong case for a judge-led judicial review\".\n \n He said: \"Next time it happens it may not be about a nanny and their visa. It may be about something even more important than that.\" Mr Blunkett quit as home secretary last week after being told in advance of Sir Alan's findings. In a statement, the ex-home secretary said he accepted the inquiry's findings. He said he had told the truth throughout and had raised the nanny case as an example of unacceptable backlogs in the system.\n", "llama3.2:1b": "Blunkett row should end - Blair", "llama3.2:3b": "Tony Blair said it was time to end controversy surrounding David Blunkett, amid calls for another inquiry into a visa application process for Blunkett's ex-lover's nanny, with the Prime Minister stating his admiration for Blunkett and dismissing claims of government deceit.", "gemma2:2b": "Tony Blair says it is time to move on from the controversy surrounding David Blunkett. The prime minister states that a second inquiry into Blunkett's involvement in his ex-lover's nanny visa application is unnecessary, and he believes Blunkett’s integrity remains intact.  Conservative leader Michael Howard calls for another inquiry and claims there was deceit at the heart of government. Liberal Democrat home affairs spokesman Mark Oaten also supports a judge-led judicial review. \n", "qwen2.5:0.5b": "Bluntly end Blunkett row with Blair: \"We have drawn a line under that. \" Blair also stressed that the new government will \"move on\" from the Blunkett scandal, citing Sir Alan's statement that he is not going to open another inquiry into the case. He also emphasized that Blunkett was the first person who asked for an inquiry to be set up, and that his integrity remains intact.", "qwen2.5:1.5b": "Prime Minister Tony Blair says it is time to end the controversy surrounding David Blunkett, who has been cleared of any involvement in a visa application for his ex-lover's nanny. Blair praised Blunkett's integrity and stated that he still admires him despite the incident. The Prime Minister emphasized the importance of moving on from the issue as there are \"deceit at the heart of government\" with the focus shifting to more significant matters.", "qwen2.5:3b": "Prime Minister Tony Blair announced that it was time to end controversy surrounding David Blunkett by stating his admiration for Blunkett remains intact. Despite Sir Alan Budd finding a \"chain of events\" linking Blunkett to Leoncia Casalme's visa application, Blair maintained that Blunkett's integrity is not compromised and urged moving forward from the matter without another inquiry. However, critics including Michael Howard and Mark Oaten called for a judge-led judicial review, citing deceit within government beyond this case.", "opencoder:1.5b": "Prime Minister Tony Blair said it was time to draw a line under the controversy surrounding David Blunkett. The Tories and the Lib Dems have called for a second inquiry into the fast-tracking of a visa application for Mr Blunkett's ex-lover's nanny, Sir Alan Budd found a \"chain of events\" linked Mr Blunkett to Leoncia Casalme's indefinite leave to remain application. At the end of his Middle East trip, Mr Blair admired Mr Blunkett and thought his integrity was intact. On Tuesday Sir Alan said the application for leave to remain in the UK made by Kimberly Quinn's nanny was processed in 52 days, 120 days faster than the average. But he could not find evidence to show whether Mr Blunkett's intervention was intended to give special help for his then lover's nanny - or if he was raising the case as an example of poor departmental performance. In his first comments, Mr Blair told BBC News he had not yet read the report in detail. But explained: \"As far as I'm concerned, we have drawn a line under that.\" Asked if Mr Blunkett could return to frontline politics at some point, he replied: \"I have made my admiration for David very clear and it remains. He's been a tremendous colleague, he's done a great job for us, first as home secretary then as education secretary. The future is something we will have to approach in the future.\" Earlier, Mr Howard said: \"There does need to be another inquiry, a judge-led inquiry. There were so many questions that weren't answered.\" There was \"deceit at the heart of government\" which was not limited to the visa affair, he argued. Lib Dem home affairs spokesman Mark Oaten also said there was \"a strong case for a judge-led judicial review\". He said: \"Next time it happens it may not be about a nanny and their visa. It may be about something even more important than that.\" Mr Blunkett quit as home secretary last week after being told in advance of Sir Alan's findings. In a statement, the ex-home secretary said he accepted the inquiry's findings. He said he had told the truth throughout and had raised the nanny case as an example of unacceptable backlogs in the system.\n", "smollm:1.7b": "Prime Minister Tony Blair said it was time to draw a line under the controversy surrounding David Blunkett.\n\nThe Tories and the Lib Dems have called for a second inquiry into the fast-tracking of a visa application for Mr Blunkett's ex-lover's nanny. Sir Alan Budd found a \"chain of events\" linked Mr Blair to Leoncia Casalme's indefinite leave to remain application. At the end of his Middle East trip, Mr Blair said he still admired Mr Blair and thought his integrity was intact.\n\nOn Tuesday, Sir Alan said the application for leave to remain in the UK made by Kimberly Quinn's nanny was processed in 52 days, 120 days faster than the average. But he could not find evidence to show whether Mr Blunkett's intervention was intended to give special help for his then lover's nanny - or if he was raising the case as an example of poor departmental performance. In his first comments since Sir Alan's announcement, Mr Blair told BBC News that he had not yet read the report in detail. But told BBC News: \"As far as I'm concerned, we have drawn a line under that.\"\n\nAsked if Mr Blunkett could return to frontline politics at some point, he replied: \"I have made my admiration for David very clear and it remains. He's been a tremendous colleague, he's done a great job for us, first as home secretary then as education secretary. The future is something we will have to approach in the future.\"\n\nEarlier, Mr Howard said: \"There does need to be another inquiry, a judge-led inquiry. There were so many questions that weren't answered.\" There was \"deceit at the heart of government\" which was not limited to the visa affair, he argued. Lib Dem home affairs spokesman Mark Oaten also said there was \"a strong case for a judge-led judicial review\".\n\nHe said: \"Next time it happens it may not be about a nanny and their visa. It may be about something even more important than that.\" Mr Blunkett quit as home secretary last week after being told in advance of Sir Alan's findings. In a statement, the ex-home secretary said he accepted the inquiry's findings. He said he had told the truth throughout and had raised the nanny case as an example of unacceptable backlogs in the system.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize the provided text concisely while preserving the key ideas and details. The user wants only the summary in plain text without any explanations or formatting. Let me read through the text carefully.\n\nThe main points are about David Blunkett and his ex-lover's nanny. Prime Minister Tony Blair says it's time to review the controversy, calling for a second inquiry. Lib Dems and Tories have requested this. Sir Alan Budd found a chain of events linking Blunkett to Leoncia Casalme's leave. The application for leave to remain was 120 days faster than average but no evidence of special help for his nanny.\n\nMr Blair dismissed the claims from Michael Howard that he led \"grubby government\" by stating Blunkett's integrity and having already made it clear that what happened didn't happen. Lib Dems leader Mark Oaten said a judge-led review is needed, especially regarding other issues. Mr Blunks left as home secretary after Sir Alan's findings were known.\n\nI need to capture all these points without any extra details. Make sure the summary flows logically and includes the main actions: Blair calling for an inquiry, contributions by different parties, Lib Dems' stance on the inquiry, Blair dismissing claims from Howard, Oaten's support, and Blunks' decision.\n\nLet me structure it concisely:\n1. Blair calls for a second inquiry into Blunks' case.\n2. Lib Dems and Tories ask for this inquiry.\n3. Sir Alan found a chain linking Blunks to Casalme.\n4.application was faster by 120 days.\n5.Blanks left government as home secretary after Sir Alan's findings.\n\nMake sure each point is clear and the summary doesn't include any unnecessary details like dates or specific statements from officials beyond their relevance here.\n</think>\n\nBlanksett Row should end - Blair  \nPrime Minister Tony Blair said it was time to draw a line under the controversy surrounding David Blunks' ex-lover's nanny. The Tories and Lib Dems have called for a second inquiry into this matter, with Sir Alan Budd finding a chain of events linking Blunks to Leoncia Casalme's indefinite leave application. His middle east trip led Blair to praise his integrity, but the average processing time was 120 days faster than usual. However, there was no evidence linking his involvement to special help for his then lover's nanny or poor department performance. Blair dismissed claims from Michael Howard that he led a \"grubby government.\" Lib Dems home affairs spokesman Mark Oaten supported this by saying a judge-led review is needed, especially regarding other issues. Mr Blunks quit as home secretary last week after Sir Alan's findings were known in advance. In a statement, he accepted the inquiry's findings and raised the nanny case as an example of unacceptable backlogs.", "tinyllama:1.1b": "Preserving key ideas and details, the output only summarizes: The Prime Minister Tony Blair affirms that the controversy surrounding David Blunkett's visa application for his ex-lover's nanny should come to an end. Referring to the Tories and Lib Dems' call for a second inquiry into the case, the PM declares he \"still admires\" Mr Blunkett but concedes that there was a \"chain of events\" linked to the visa application. On Tuesday, Blair said his admiration towards Blunkett had not changed despite Sir Alan Budd finding evidence to show a better performance than the average in the Department for Work and Pensions's handling of Mr Blunkett's case. The PM also dismissed claims from opposition leaders that he led a \"grubby\" government, stating that Blunkett's integrity remained intact, but adding a reminder that there was a strong case for a judge-led judicial review into the case.", "tinydolphin:1.1b": " Prime Minister Tony Blair has ruled out revisiting the controversy surrounding David Blunkett and his ex-lover's visa application. He made this statement during a meeting with members of the Conservative Party, emphasizing that it was time to move on from this matter. The Tories and the Lib Dems have called for a second inquiry into the fast-tracking of Blunkett's nanny application, but Sir Alan Budd has found a \"chain of events\" linked Mr. Blunkett to Leoncia Casalme's indefinite leave to remain application. As a result of this inquiry, Mr. Blair stated that he still admired Mr. Blunkett and believed his integrity remained intact. However, on Tuesday, Sir Alan reported that the application for leave to remain in the UK made by Kimberly Quinn's nanny was processed in 52 days, 120 days faster than the average. As a result, the timeline of the entire case has been extended significantly. However, it remains unclear whether Mr. Blunkett's intervention was intended to give special help for his then lover's nanny - or if he was raising the case as an example of poor departmental performance. In his first comments since Sir Alan's announcement, Mr. Blair said that he had not yet read the report in detail and would not comment on it until he has fully read the report. However, he assured BBC News that he has made his admiration for David Blunkett and his integrity clear.", "phi:2.7b": " Blunkett row should end - Blair \n\nPrime Minister Tony Blair has announced that it is time to put this controversy behind them and move on from the fast-tracking of a visa application for David Blunkett's ex-lover's nanny. The Conservatives and Liberal Democrats have called for another inquiry, but the former Home Secretary admitted he had not read Sir Alan Budd's findings in detail yet. Blair said that as long as there was no evidence to suggest any wrongdoing on his part or that of the department, he believed it was time to move past this issue.\n", "orca-mini:3b": " The text summarizes the events surrounding David Blunkett and his involvement in a visa application for his ex-lover's nanny. It ends by stating that Prime Minister Tony Blair believes it is time to draw a line under the controversy and move on.", "hermes3:3b": "Blair calls for end to Blunkett controversy, stating it should draw to a close and move on from allegations about Mr. Blunkett's intervention in visa application for his ex-lover's nanny.", "stablelm-zephyr:3b": "Prime Minister Tony Blair ended the controversy surrounding David Blunkett by stating that it was time to draw a line under it. Sir Alan Budd's fast-tracking of a visa application for Mr. Blunkett's ex-lover's nanny sparked calls for a second inquiry from Tories and Lib Dems. While Sir Alan found no evidence to suggest Mr. Blunkett's intervention was intended to help his former lover, Blair maintained his admiration for Blunkett and believed his integrity remained intact. Conservative leader Michael Howard argued for a judge-led inquiry, while Lib Dem home affairs spokesman Mark Oaten suggested a judicial review.", "chatgpt-4o-latest": "Prime Minister Tony Blair called for an end to the controversy surrounding David Blunkett, despite opposition demands for a second inquiry into the fast-tracking of a visa for Blunkett's ex-lover's nanny. An inquiry by Sir Alan Budd found a link between Blunkett and the visa approval but no clear evidence of intentional favoritism. Blair defended Blunkett’s integrity and expressed admiration for him, suggesting he could return to politics in the future. Conservative leader Michael Howard and Lib Dem spokesman Mark Oaten insisted on a judge-led inquiry, citing broader concerns about government integrity. Blunkett resigned as home secretary but maintained he had acted truthfully, citing the case as an example of systemic inefficiencies.", "stablelm2:1.6b": "Prime Minister Tony Blair ends the controversy surrounding David Blunkett after Sir Alan Budd found no evidence suggesting Blunkett's intervention gave special help for his then lover's nanny or that he was raising the case as an example of poor departmental performance. Blunkett quit as home secretary after being told in advance of Sir Alan's findings, and he accepted the inquiry's findings. He admitted to telling the truth throughout and raised the nanny case as an example of unacceptably long backlogs in the system. Tory leader Michael Howard and Lib Dem home affairs spokesman Mark Oaten support another inquiry, possibly a judge-led one, for the visa affair and other issues related to deceit at the heart of government.", "granite3.1-dense:2b": "Prime Minister Tony Blair stated that the controversy surrounding David Blunkett has been resolved, emphasizing his admiration for Blunkett's integrity and service as home secretary and education secretary. The inquiry by Sir Alan Budd revealed a 52-day expedited processing of Leoncia Casalme's visa application for her ex-lover's nanny, Kimberly Quinn, which was significantly faster than the average. However, Sir Alan could not definitively prove whether Blunkett's intervention was intentionally beneficial to his lover or an indicator of poor departmental performance.\n\nConservative leader Michael Howard and Lib Dem home affairs spokesman Mark Oaten called for a judge-led inquiry, citing \"deceit at the heart of government\" and concerns about potential future misuse of this process for more critical matters. Blunkett resigned as home secretary following Sir Alan's findings but acknowledged his role in raising the nanny case to highlight systemic backlogs.", "reference": "At the end of his Middle East trip, Mr Blair said he still admired Mr Blunkett and thought his integrity was intact.He said Mr Blunkett's integrity remained intact: \"He was the person first of all who asked for this inquiry to be set up.Prime Minister Tony Blair said it was time to draw a line under the controversy surrounding David Blunkett.Mr Blunkett quit as home secretary last week after being told in advance of Sir Alan's findings.He said: \"Next time it happens it may not be about a nanny and their visa.On Tuesday Sir Alan said the application for leave to remain in the UK made by Kimberly Quinn's nanny was processed in 52 days, 120 days faster than the average.Earlier, Mr Howard said: \"There does need to be another inquiry, a judge-led inquiry.But he could not find evidence to show whether Mr Blunkett's intervention was intended to give special help for his then lover's nanny - or if he was raising the case as an example of poor departmental performance.Lib Dem home affairs spokesman Mark Oaten also said there was \"a strong case for a judge-led judicial review\".The Tories and the Lib Dems have called for a second inquiry into the fast-tracking of a visa application for Mr Blunkett's ex-lover's nanny."}