{"raw_text": "Kilroy launches 'Veritas' party\n \n Ex-BBC chat show host and East Midlands MEP Robert Kilroy-Silk has said he wants to \"change the face of British politics\" as he launched his new party.\n \n Mr Kilroy-Silk, who recently quit the UK Independence Party,said \"our country\" was being \"stolen from us\" by mass immigration. He told a London news conference that Veritas - Latin for \"truth\" - would avoid the old parties' \"lies and spin\". UKIP leader Roger Knapman says he was glad to see the back of Mr Kilroy-Silk.\n \n Mr Kilroy-Silk promised a \"firm but fair\" policy on immigration and said they hoped to contest most seats at the forthcoming general election. He said Veritas would also announce detailed policies on crime, tax, pensions, health and defence over the next few weeks. And he announced the party would be holding a leadership election. On Thursday he is due to announce which constituency he will run in at the next general election - that will come amid speculation he has his sights set on Defence Secretary Geoff Hoon's Ashfield seat. He was joined in the new venture by one of UKIP's two London Assembly members, Damien Hockney who is now Veritas' deputy leader. UKIP's chairman Petrina Holdsworth has said the group will just be a parody of the party the men have left.\n \n Mr Kilroy-Silk announced his decision to quit UKIP at a public meeting in Hinckley, Leicestershire last week. It came after months of tension as he vied unsuccessfully for the leadership of that party. He said he was ashamed to be a member of a UKIP whose leadership had \"gone AWOL\" after the great opportunity offered by its third place at last June's European elections. \"While UKIP has turned its back on the British people, I shall not,\" he said. \"I will be standing at the next general election. I shall be leading a vigorous campaign for the causes I believe in. \"And, unlike the old parties, we shall be honest, open and straight.\"\n \n Mr Hockney also left UKIP saying Mr Kilroy-Silk would \"deliver better\" as the leader of a Eurosceptic party. A spokesman for UKIP called on Mr Hockney to quit the London Assembly. The party asserts that Mr Hockney \"has a moral obligation, if not a legal one\" to stand down. Its leader, Roger Knapman, has said he is glad to see the back of Mr Kilroy-Silk. \"He has remarkable ability to influence people but, sadly, after the [European] election it became clear that he was more interested in the Robert Kilroy-Silk Party than the UK Independence Party so it was nice knowing him, now 'goodbye',\" he said. UKIP officials also argue Mr Kilroy-Silk has not been \"straightforward\" in attacking the party he once wanted to lead.\n \n This is just what the Europhiles pray for. As the main Eurosceptic party, UKIP should try to resolve its differences with Kilroy to show a united front and give the UK public a serious political voice against Europe. Having multiple parties with the same view point just splits the vote further.\n \n Thank goodness that Kilroy-Silk has gone - now UKIP at least has a chance in the election!\n \n It is very sad to see the cause of Britain regaining its proper relationship with Europe damaged by this split within UKIP. Robert Kilroy-Silk could have a lot to offer. Instead we have a split party and a damaged cause. Under the present electoral system, people must work together, and small parties have no hope of representation. Last summer, UKIP achieved a major advance, partly and only partly due to Kilroy-Silk. It is a great shame this has been dissipated in in-fighting.\n \n UKIP has a wide platform of policies, not just withdrawal from the EU. This Kilroy-Silk conveniently ignores in the comments surrounding the launch of his own party. Neither the English Democrats nor the New Party were interested in letting him join them and take over their leadership speaks volumes. Veritas is the beginning of the end for Kilroy-Silk.\n \n If he believes in truth and democracy then he and the two assembly members should resign and force a by-elections to stand on their own platform rather than this backdoor approach to politics of being elected for one party then defecting to another.\n \n So UKIP was good enough for him to lead, not good enough for him to follow!\n \n Interesting that a party committed to plain speaking should have a Latin name!\n \n Every opinion poll points to an overwhelming anti-Europe feeling in this country. Kilroy-Silk could be on the verge of something huge if he can broaden his appeal beyond this one issue. He is an extremely able communicator with years of political experience. We wants quality schools, top hospitals, clean and efficient public transport, punishments that fit the crime, limited asylum, a purge on bureaucracy and less taxes. It needs courage and honesty, two qualities sadly lacking in our politicians. Kilroy-Silk may just have those very qualities. Recruit the right colleagues, Robert, and your time may have come!\n \n Well if you cannot get enough limelight being an ordinary MP then go out and start up your own Party. It's all flash and no real policy here\n \n Let's hope this is the start of both UKIP and Kilroy-Silk slipping into obscurity.\n \n Veritas? The name will doom it. But perhaps I am wrong for surely all modern schoolchildren will understand it since they do still learn Latin in the classroom do they not? The whole essence of what RKS represents is Euroscepticism, so explain to me how the too-twee label of Veritas symbolises that?\n", "llama3.2:1b": "Robert Kilroy-Silk launches party 'Veritas' amid controversy over leadership and immigration policies. He promises a \"firm but fair\" approach on immigration, detailed policies, and a potential contest in next year's general election. UKIP leader Roger Knapman expresses relief Kilroy-Silk is leaving the party. Veritas will run for defense secretary Geoff Hoon's Ashfield seat amid speculation Kilroy-Silk aims to challenge him. The new party has been criticized for its Euroscepticism, with some questioning the use of a Latin name and accusing Kilroy-Silk of being too divisive in his views on immigration and Europe.", "llama3.2:3b": "Robert Kilroy-Silk launches new party called Veritas, which he claims will \"change the face of British politics\" and avoid \"lies and spin\". He promises a firm but fair policy on immigration, detailed policies on various issues, and a leadership election. UKIP leader Roger Knapman says he is glad to see Mr Kilroy-Silk go, as he feels his departure could help UKIP regain its focus.", "gemma2:2b": "Robert Kilroy-Silk launched a new party called Veritas after leaving UKIP. He has stated his party's intention to compete in the upcoming general election.  UKIP leadership has reacted negatively, expressing concerns over Kilroy-Silk's motives and actions. Former UKIP members have joined him, including Damien Hockney. While some see this as a split that hinders UKIP's cause, others believe it offers an alternative voice on Euroscepticism. \n", "qwen2.5:0.5b": "Robert Kilroy-Silk launches a new party called \"Veritas\", aiming to break away from British politics and tackle issues such as immigration, crime, taxation, pensions, health, and defense. He promises a \"firm but fair\" approach, while maintaining the idea of an \"older\" party that could contest seats in future elections. The party will be led by Damien Hockney, who has already left UKIP. Kilroy-Silk's new party is expected to face stiff competition from other parties, including UKIP and the New Party. The Europhiles' hope for a united front against British politics through this new party proves counterproductive, as the existing parties are not strong enough to lead and can only progress by defecting to another party. Kilroy-Silk's campaign is seen as a potential threat to UKIP, which has been accused of overpromising and acting independently. The name \"Veritas\" could be seen as a symbol for Euroscepticism rather than the party itself.", "qwen2.5:1.5b": "Robert Kilroy-Silk launches \"Veritas\" party aiming to change British politics, contesting general election seats and opposing UKIP. However, some critics see this as a split within UKIP rather than a new movement.", "qwen2.5:3b": "Robert Kilroy-Silk has launched his new Eurosceptic party, 'Veritas', following his departure from the UK Independence Party (UKIP). He claims he wants to \"change the face of British politics\" and promises a policy focused on immigration control. Kilroy-Silk announced that Veritas would avoid the old parties' \"lies and spin\". After months of tension with the party, Kilroy-Silk quit UKIP over its leadership's decision not to continue after their third-place finish in the European elections. He is now aiming for a seat at the next general election under his own banner alongside one of UKIP’s London Assembly members. Critics argue that splitting UKIP into multiple parties could weaken the Eurosceptic cause, and Kilroy-Silk’s presence may just be too little too late given the widespread anti-EU sentiment in opinion polls. Some see potential for him to offer a fresh perspective on issues like education, healthcare, and taxes, but others question his ability to remain honest and effective as an elected politician.", "opencoder:1.5b": "This summary preserves the key ideas and details about the launch of 'Veritas' party by Robert Kilroy-Silk. It also highlights some of his personal experiences, comments, and criticisms. The focus is on retaining the essence of the original speech while making use of language that is appropriate in today's political context.\n", "smollm:1.7b": "The Latin name \"Veritas\" has been used by many notable figures throughout history, including philosophers, scientists, and politicians. It's a name that conveys a sense of truthfulness, honesty, and integrity. In the context of UKIP, it could be seen as a nod to the party's commitment to these values.\n\nRegarding the \"too-twee label\" of Veritas, I think you're misunderstanding the significance of this label in the context of UKIP. While it may not be a perfect fit for all parties or politicians, it does reflect the party's Eurosceptic stance and its willingness to challenge traditional political norms.\n\nIn fact, the use of Latin names by politicians has been a common practice throughout history, particularly among intellectuals and academics. This is because Latin was once a lingua franca, used as a common language for scholars across Europe. As such, it's seen as a symbol of intellectualism, sophistication, and refinement.\n\nSo, while the use of Latin names by politicians may not be universally popular or without controversy, in the context of UKIP, it could be seen as a nod to the party's commitment to these values and its willingness to challenge traditional political norms.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the text about Robert Kilroy-Silk and his new party called Veritas. Let's read through it carefully.\n\nFirst, it mentions Robert launched a party as a \"change the face of British politics.\" That's clear from his statement.\n\nHe said that his country was being stolen from us by mass immigration, which is a key point. He also promised a fair and open immigration policy, contesting seats, announcing a leadership election in the upcoming election.\n\nHe announced his decision at a meeting in Hinckley last week after months of fighting for UKIP. He's ashamed to be a UKIP member because UKIP's leadership was AWOL when he took over. He stands at the next general election and is leading a campaign focused on his beliefs.\n\nHe also mentioned that the party will adopt policies on crime, tax, pensions, health, and defense, which is good news for the public.\n\nMr. Hockney, who joined as deputy leader, said Mr. Kilroy-Silk would deliver better and is a Eurosceptic party leader. However, UKIP says it's more of a parody.\n\nIt mentions that this split within UKIP has caused a damaged political cause but also shows potential for unity if members can work together.\n\nThe text ends with a strong call to action for Robert to go back to EU politics, implying that without him, UKIP is now facing the wrong voters. It's sad how the party has become so divided and damaged, suggesting it needs more unity among its ranks.\n\nSo, in summary, I need to capture Robert's goal of changing British politics, his campaign policies, the potential for unity with his new party, and the split within UKIP's impact on the political landscape.\n</think>\n\nRobert Kilroy-Silk aims to change British politics by launching Veritas. He promised a fair immigration policy, contesting seats, and an election leadership. Mr. Hockney joined as deputy leader of Veritas, who was previously a London Assembly member for UKIP chair. UKIP sees this split as a potential unity move but faces political damage due to its divided platform. Robert's goal is hopeful if he can work with his new party to achieve unity and address EU issues.", "tinyllama:1.1b": "The text conveys a summary of Kilroy launches 'Veritas' party. Kilroy-Silk has left UKIP and announced plans for a new party, which will be holding a leadership election and announcing detailed policies on crime, tax, pensions, health, defections over the next few weeks. The party is expected to have a Latin name as Veritas, but the article highlights the importance of plain speaking and emphasizes that Kilroy-Silk has an ability to influence people's opinions with his remarks. However, despite having multiple parties with similar views and being committed to anti-European sentiment, the article concludes that UKIP still has a chance in the upcoming election due to the unity of their viewpoint against Europe. Despite this, it is disappointing to see Kilroy and his party's split within UKIP, causing damage to Britain regaining its proper relationship with Europe and an overwhelming anti-European sentiment among the population. Overall, Kilroy's new party Veritas may succeed or fail based on how it appeals to the anti-European sentiment in this country.", "tinydolphin:1.1b": " This statement seems to imply that the party's name, \"Veritas,\" may signal a shift towards becoming more Eurosceptic or \"Brexit\"-aligned. However, there is no mention of this in the text provided, and the concept of Euroscepticism and Brexit have been widely debated by political commentators. Therefore, the statement seems to be an assumption based on a simplified perception of the party's ideology and its possible alignment with certain movements or groups within British politics.", "phi:2.7b": " Robert Kilroy-Silk has launched his new party called Veritas which means truth in Latin. He wants to change the face of British politics and believes that old parties are lying and spinning. He will contest most seats at the next general election and will announce detailed policies on immigration, crime, tax, pensions, health, and defence over the next few weeks. On Thursday he is due to announce which constituency he will run in at the next general election—that will come amid speculation that he has his sights set on Defence Secretary Geoff Hoon's Ashfield seat. One of UKIP's two London Assembly members, Damien Hockney, has joined Veritas as its deputy leader. Mr Kilroy-Silk is leaving UKIP after months of tension with the party's leadership and says he will be honest, open, and straight in his new venture. UKIP officials have called on him to quit the London Assembly. The split within UKIP could damage its cause by creating a fragmented vote for Eurosceptic parties.\n", "orca-mini:3b": " Kilroy-Silk launches 'Veritas' party with promise of truth and democracy, but will it be enough for voters?", "hermes3:3b": "Robert Kilroy-Silk launches new party 'Veritas', aiming to change British politics with truth and opposing mass immigration.", "stablelm-zephyr:3b": "Robert Kilroy-Silk, a former BBC chat show host and East Midlands MEP, launched his new party called Veritas (Latin for \"truth\"). Kilroy-Silk left UKIP after months of tension and announced his decision to run in the upcoming general election with the party. He promised a \"firm but fair\" policy on immigration and detailed policies on crime, tax, pensions, health, and defense over the next few weeks. Veritas will also hold a leadership election, and Damien Hockney, one of UKIP's two London Assembly members, joined as the deputy leader. Critics argue that Kilroy-Silk should focus on resolving differences within UKIP rather than launching his own party, which splits the vote and damages the cause of regaining Britain's proper relationship with Europe.", "chatgpt-4o-latest": "Robert Kilroy-Silk, former BBC host and UKIP member, launched a new political party, Veritas, aiming to \"change the face of British politics\" with a focus on immigration, crime, tax, pensions, health, and defense. He left UKIP after failing to secure its leadership, criticizing its direction. Veritas' deputy leader is Damien Hockney, another UKIP defector. UKIP leaders dismissed Kilroy-Silk, accusing him of self-interest and damaging the Eurosceptic cause. Public reaction was mixed, with some seeing potential in his leadership while others viewed Veritas as a doomed vanity project that would split the anti-EU vote. Critics questioned his commitment to democracy and the party's Latin name, while supporters believed he could be a significant political force if he broadened his appeal.", "stablelm2:1.6b": "East Midlands MEP Robert Kilroy-Silk has launched his new party called \"Veritas,\" which aims to change the face of British politics and avoid old parties' lies and spin. Kilroy-Silk left the UK Independence Party, citing mass immigration as a stolen country. Veritas promises a \"firm but fair\" policy on immigration, with detailed policies on other issues such Grafton's crime, tax, pensions, health, and defense to be announced in the coming weeks. The party will hold a leadership election and plans to contest most seats at the upcoming general election. Kilroy-Silk aims to run for a seat at the next general election, possibly aiming for Geoff Hoon's Ashfield seat. Party UKIP is called a \"parody\" of Veritas by its chairman Petrina Holdsworth.", "granite3.1-dense:2b": "Robert Kilroy-Silk, a former BBC chat show host and East Midlands MEP, has established the 'Veritas' party, vowing to \"change the face of British politics\" by focusing on immigration, honesty, and straightforwardness. He recently left UK Independence Party (UKIP) due to perceived inaction from its leadership following their strong performance in the 2014 European elections. Kilroy-Silk pledged a \"firm but fair\" policy on immigration and detailed plans for crime, tax, pensions, health, and defense over the next few weeks. He announced a leadership election and revealed he aims to contest most seats in the upcoming general election, with speculation pointing to Defence Secretary Geoff Hoon's Ashfield seat.\n\nUKIP officials view Veritas as a parody of their party, citing Kilroy-Silk's uncooperative behavior and his focus on his new venture over UKIP's goals. They have called for Damien Hockney to resign from the London Assembly, stating he has a moral obligation to do so.\n\nThe launch of Veritas is met with mixed reactions. Supporters see it as an opportunity for a unified Eurosceptic voice in British politics, while critics argue that Kilroy-Silk's departure weakens UKIP and may lead to further fragmentation among pro-European parties. Some believe Veritas' Latin name is misaligned with its anti-EU stance, while others view it as a chance for Kilroy-Silk to broaden his appeal beyond Euroscepticism.\n\nKilroy-Silk's communication skills and political experience are acknowledged by some, who believe he could attract support from those seeking quality public services and less bureaucracy. However, others criticize the move as a distraction from UKIP's potential for significant impact under his leadership.", "reference": "UKIP officials also argue Mr Kilroy-Silk has not been \"straightforward\" in attacking the party he once wanted to lead.Mr Hockney also left UKIP saying Mr Kilroy-Silk would \"deliver better\" as the leader of a Eurosceptic party.\"He has remarkable ability to influence people but, sadly, after the [European] election it became clear that he was more interested in the Robert Kilroy-Silk Party than the UK Independence Party so it was nice knowing him, now 'goodbye',\" he said.Its leader, Roger Knapman, has said he is glad to see the back of Mr Kilroy-Silk.UKIP leader Roger Knapman says he was glad to see the back of Mr Kilroy-Silk.Thank goodness that Kilroy-Silk has gone - now UKIP at least has a chance in the election!Ex-BBC chat show host and East Midlands MEP Robert Kilroy-Silk has said he wants to \"change the face of British politics\" as he launched his new party.\"While UKIP has turned its back on the British people, I shall not,\" he said.Mr Kilroy-Silk announced his decision to quit UKIP at a public meeting in Hinckley, Leicestershire last week.This Kilroy-Silk conveniently ignores in the comments surrounding the launch of his own party.Veritas is the beginning of the end for Kilroy-Silk.And he announced the party would be holding a leadership election.Mr Kilroy-Silk promised a \"firm but fair\" policy on immigration and said they hoped to contest most seats at the forthcoming general election.Instead we have a split party and a damaged cause.The party asserts that Mr Hockney \"has a moral obligation, if not a legal one\" to stand down.UKIP's chairman Petrina Holdsworth has said the group will just be a parody of the party the men have left.Interesting that a party committed to plain speaking should have a Latin name!As the main Eurosceptic party, UKIP should try to resolve its differences with Kilroy to show a united front and give the UK public a serious political voice against Europe.It's all flash and no real policy here  Let's hope this is the start of both UKIP and Kilroy-Silk slipping into obscurity.Mr Kilroy-Silk, who recently quit the UK Independence Party,said \"our country\" was being \"stolen from us\" by mass immigration.A spokesman for UKIP called on Mr Hockney to quit the London Assembly.Kilroy-Silk may just have those very qualities."}