{"raw_text": "MP's shock at long lost daughter\n \n Labour MP Stephen Pound has told of his shock and his joy on learning he fathered a daughter when he was \"out of control\" during the \"wild\" 1960s.\n \n Lucy, 36, tracked down Mr Pound after her birth mother told her he was known as \"Precious\" at school. Despite being told he was a \"nutter who died at sea\" she found a reference to Mr Pound on Friends Reunited. Lucy's mother kept her pregnancy secret and had her adopted at four weeks. Mr Pound found out about it last year. That happened when Lucy wrote to his Parliamentary office saying she believed he was her father.\n \n Mr Pound, who is now married with two other teenage children, said: \"I was a nutter and I was a sailor but I wasn't dead.\" He said his first reaction was to wonder if he was victim of a \"set-up\" but he then realised all the dates fitted. \"It was a pretty horrible thing with a pretty happy ending. I felt guilt in the marrow of my bones,\" said the Ealing North MP. \"I don't blame Lucy's mother. I was pretty much out of control. I was 18 when she was conceived. It was a different time - it was pretty wild.\"\n \n Mr Pound says he rang Lucy as soon as he got her letter, they met up and have been in contact ever since. Describing that first meeting at London's King Cross station, he said: \"The earth went from under my feet ... We were walking across the Euston Road and I took her arm to take her across and there was an immediate connection. \"We were finishing each other sentences.\" Lucy, who was adopted by a family from Essex, wants to remain anonymous for the sake of her adoptive father and her children. Mr Pound said his wife Maggie had been fully supportive and their two children Emily, 16, and Pelham, 14 were pleased to have an older sister.\n", "llama3.2:1b": "Labour MP Stephen Pound was shocked to learn he fathered a daughter named Lucy when he was out of control during the 1960s. He had kept her adoption secret for four years. The discovery happened after he found out about Lucy's birth mother and began contacting her, resulting in an instant connection with his granddaughter at King Cross station.", "llama3.2:3b": "Labour MP Stephen Pound found out he was the father of a daughter Lucy, 36, when she contacted him after tracing him on Friends Reunited. He was 18 at the time of her conception and was \"out of control\" during the 1960s. He initially thought it was a setup but later confirmed the dates matched. They met up in London's King Cross station and had an immediate connection, with Pound saying his wife and children were supportive and happy for Lucy to become their sister.", "gemma2:2b": "Stephen Pound, a Labour MP, learned he fathered a daughter in the 1960s when he was \"out of control\". Lucy, his daughter, tracked him down after her birth mother revealed he was known as \"Precious\" at school.  Lucy's adoptive family kept her pregnancy secret and she was adopted at four weeks. Mr Pound learned about her existence last year, leading to a reconciliation with his daughter.  They met in London, where an immediate connection developed. Lucy, who has chosen to remain anonymous, wants to protect the well-being of her adoptive father and children. Her birth father's wife is supportive. Their two other children are pleased to have a new sister. \n", "qwen2.5:0.5b": "Stephen Pound, MP for Ealing North, was shocked by the birth of a child who he believed to be his daughter Lucy when she was just 3 weeks old. He had never formally informed his wife Maggie that Lucy was a girl. When he learned about it in the early years of their marriage, he felt guilty and wondered if Lucy's mother was setting him up on purpose. He found the story interesting and decided to tell Lucy that he was her father at a friend's reunion. The couple later wrote to his Parliamentary office and were informed about their daughter Lucy, who is now an 18-year-old girl with two adopted parents.", "qwen2.5:1.5b": "Labour MP Stephen Pound discovered he was a biological father in his 20s after meeting his long-lost daughter at age 36 on the eve of her seventh birthday. Lucy, now 36, tracked him down through Friends Reunited, despite being raised by an Essex family as someone named \"Precious.\" Mr. Pound initially doubted his identity due to a childhood reference and subsequent experiences in the 'wild' 1960s, but later confirmed it was true after writing Lucy's letter with her adoptive father knowing nothing about their relationship. The couple has been in contact since then; Lucy wants to remain anonymous for privacy reasons.", "qwen2.5:3b": "Labour MP Stephen Pound revealed his shock and joy upon learning he is a long-lost daughter's biological father from the 'wild' 1960s. His daughter Lucy, now 36, discovered him through Friends Reunited after finding a reference to him at school, where she was known as \"Precious.\" Despite being told Pound was dead and a \"nutter,\" Lucy's mother kept her pregnancy secret and had her adopted shortly after birth. Pound, who is married with two children of his own, confirmed the dates matched their memories. He initially wondered if he was set up but later realized all details aligned. After confirming Lucy's identity via correspondence, they met at King Cross station where an immediate connection formed. While the couple has been in contact since, Lucy prefers to remain anonymous for her adoptive father and his children's sake. Pound's wife Maggie is supportive, and their two children are pleased about having a new sister.", "opencoder:1.5b": "\"MP's shock at long lost daughter\"\n", "smollm:1.7b": "The text is concise because it summarizes the main points without including unnecessary details or explanations. The key ideas are:\n\n1. MP's shock at long lost daughter: Stephen Pound was shocked by his discovery that he fathered a daughter when he was \"out of control\" during the 1960s.\n2. Lucy, 36: The text mentions Lucy, the daughter who was born to Mr Pound and his wife, but does not provide more information about her background or family.\n3. Tracked down MP after birth mother told him he was known as \"Precious\" at school: The text explains that Mr Pound found out about his father's identity when Lucy wrote to him saying she believed he was her father.\n4. Long-lost daughter: The text emphasizes the shock and joy on Mr Pound's part when he learned that his daughter was fathered by someone else.\n5. Labour MP Stephen Pound: The text mentions Stephen Pound, a Labour MP who is now married with two other teenage children.\n6. Shock at long lost daughter: The text summarizes the main idea of the text, which is that Mr Pound was shocked and surprised by his discovery that he fathered a daughter when he was \"out of control\" during the 1960s.\n7. Lucy's mother kept her pregnancy secret: The text explains that Mr Pound's wife, Maggie, kept the pregnancy a secret from him until she told him about it last year.\n8. Long-lost daughter: The text emphasizes the shock and joy on Mr Pound's part when he learned that his daughter was fathered by someone else.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely. Let me read through it carefully.\n\nThe text starts with Labour MP Stephen Pound talking about his shock when he found out he was the father of Lucy after \"learning\" that he was \"nutter and sailor\" but realized it wasn't a setup. He then meets Lucy, describes their meeting at King Cross station, where they shared sentences, and Lucy's thoughts on her father and children wanting to remain anonymous.\n\nI should focus on the key points: his shock upon learning his daughter, the details of how he met her, the emotional aspects of their moment, and the implications for Lucy's family.\n</think>\n\nStephen Pound, a Labour MP, was initially struck by discovering he had a daughter. After months of uncertainty, he learned that he was \"nutter and sailor,\" which left him in shock but also with joy upon finding out his true identity. He met Lucy at London's King Cross station, sharing sentences together, and noted her adoption from Essex. Despite being adopted, she wanted to remain anonymous for her father's children.", "tinyllama:1.1b": "In shock after finding out about his long-lost daughter, Labour MP Stephen Pound expresses his delight at finding out about his biological relationship with a teenage girl who tracked him down after discovering a reference to her in Friendly Reunion. Despite being known as \"Precious\" during his 1960s years of excess and self-destruction, he was shocked when Lucy, now married with two children aged 12 and 8, wrote to him about his alleged relationship with her. Initially hesitant but eventually persuaded by Lucy's empathy and understanding, Pound realised all the dates fitted and \"was pretty much out of control\" at the time he was conceived. Despite being disorientated by his \"wild\" 1960s, he became more aware of his biological relationship with a teenager when they met after Lucy's mother revealed their shared past to her. The couple has remained anonymous for the sake of Pound's wife Maggie and their two children.", "tinydolphin:1.1b": " MP Stephen Pound shocked at discovering he is the biological father of a teenage girl. The surprise realization stemmed from Lucy, who discovered her birth mother, was a \"nutter\" in her teens and had her adopted by an adopted family. Despite being told that Mr. Pound died at sea, Lucy's mother kept her pregnancy private. Upon finding out about the child, Mr. Pound realized he had been involved with her conception. The relationship between Mr. Pound and Lucy has been strained since their first encounter in London's King Cross Station.", "phi:2.7b": " MP Stephen Pound learned he fathered a daughter named Lucy when he was \"out of control\" during the 1990s. Despite being adopted at four weeks old, Lucy tracked down Mr Pound after her birth mother told her he was known as 'Precious' in school. She found out about him on Friends Reunited. Mr Pound said his first reaction was to wonder if he was victim of a \"set-up\" but then realized all the dates fitted and felt guilty for being a \"nutter\". He has been in contact with Lucy ever since, describing their first meeting at London's King Cross station as having an immediate connection.\n", "orca-mini:3b": " MP Stephen Pound discovered he was the father of a daughter when he was \"out of control\" during the 1960s, and his shock at finding out led him to meet the woman he fathered the child with. He says he feels guilty for being responsible for another person's child, but he admires the strength of the woman who gave birth to him.", "hermes3:3b": "Labour MP discovers long-lost daughter, who was born during 1960s when he was 'out of control'.", "stablelm-zephyr:3b": "Labour MP Stephen Pound discovered he fathered a daughter, Lucy, during the 1960s after she tracked him down using Friends Reunited. Her birth mother kept her pregnancy secret and had her adopted at four weeks; Mr. Pound found out last year when Lucy wrote to his Parliamentary office believing she was his daughter. He described feeling \"guilt in the marrow of [his] bones\" for being a \"nutter who died at sea.\" Pound has been in contact with Lucy, her adoptive father and two children are supportive of this revelation.", "chatgpt-4o-latest": "Labour MP Stephen Pound was shocked and overjoyed to learn he had a daughter, Lucy, 36, from a relationship in the \"wild\" 1960s. Lucy, adopted at four weeks, tracked him down after her birth mother revealed his school nickname. Initially told he had died at sea, she found him through Friends Reunited and wrote to his Parliamentary office. Pound, now married with two teenage children, initially suspected a set-up but soon accepted the truth. He felt deep guilt but was happy to reconnect. They met at King's Cross, felt an immediate bond, and have stayed in contact. Lucy wishes to remain anonymous for her adoptive family's sake, while Pound's wife and children have been supportive.", "stablelm2:1.6b": "Labour MP Stephen Pound shockingly learned he was fathering a daughter in 1980 when he was \"out of control\" during the \"wild\" period. After her birth mother revealed him as \"Precious\" at school, Lucy was adopted by someone from Essex. When Lucy wrote to his office claiming she believed they were related, Pound found out and reached out to her. They have been in contact since. Despite feeling guilt, he admires Lucy's adoptive father and children for supporting the relationship.", "granite3.1-dense:2b": "Labour MP Stephen Pound, now 63, was shocked to discover he fathered a daughter during the 1960s when he was \"out of control\" and described as a \"nutter.\" Lucy, 36, learned about her biological father from her birth mother's story that Mr Pound was known as \"Precious\" at school. Despite being told he had died at sea, she found a reference to him on Friends Reunited. Lucy's mother kept her pregnancy secret and had her adopted at four weeks. Last year, Mr Pound learned of Lucy's identity through a letter from her Parliamentary office. Upon receiving the news, he felt initial guilt and wondered if it was a set-up. However, he soon realized the details matched his wild 1960s lifestyle.\n\nMr Pound, married with two other teenage children, met Lucy at King Cross station after she wrote to his office. They immediately connected, and their first meeting was marked by a strong bond. Lucy, who now lives anonymously for her adoptive father's sake and her own children's, expressed no regrets about seeking her biological father. Mr Pound's wife Maggie supported the reunion, and their two children, Emily (16) and Pelham (14), were happy to have an older sister.", "reference": "Mr Pound, who is now married with two other teenage children, said: \"I was a nutter and I was a sailor but I wasn't dead.\"I was 18 when she was conceived.It was a different time - it was pretty wild.\"Lucy, 36, tracked down Mr Pound after her birth mother told her he was known as \"Precious\" at school.He said his first reaction was to wonder if he was victim of a \"set-up\" but he then realised all the dates fitted.I was pretty much out of control.Despite being told he was a \"nutter who died at sea\" she found a reference to Mr Pound on Friends Reunited.Labour MP Stephen Pound has told of his shock and his joy on learning he fathered a daughter when he was \"out of control\" during the \"wild\" 1960s."}