{"raw_text": "Peace demo appeal rejected\n \n Peace protestors have lost a landmark appeal over police actions in stopping an anti-war demonstration days after the start of the Iraq war.\n \n They had appealed against a High Court decision that it was not unlawful for police to forcibly turn protestors away near RAF Fairford, Glos, in 2003. The police had also sought to overturn a breach of human rights ruling arising from the same case. Sitting on Wednesday, three Appeal Court judges dismissed both appeals. They were challenging decisions by two judges in the High Court in February this year. It followed action by police, when three coachloads of people were searched and detained on the way to RAF Fairford and forced to return to London under police escort. The demonstrators appealed against a finding by Lord Justice May and Mr Justice Harrison that it was not unlawful for the police to turn the passengers away.\n \n The police were urging Lord Chief Justice and Lord Justices Clarke and Rix to overturn the ruling that they had breached the protestors' human rights by detaining them in the coaches. Craig Mackey, assistant chief constable of Gloucestershire Police, said: \"We have always considered that our responses were proportionate and all our decisions on the day were based on intelligence.\" He said no one on the coaches accepted responsibility for items found on the coaches including body armour, a smoke bomb and five shields. \"Given these circumstances, and the fact that RAF Fairford, and other military installations in the UK, had been the scene of increasingly destructive disorder in the weeks preceding this incident, the police commander on the ground made the decision to turn back the coaches. \"From day one we have vigorously defended this decision, which was made out of a genuine concern that if the coaches were allowed to proceed it would have resulted in disorder and criminal damage at RAF Fairford.\" Fairford Coach Action, representing more than 80 people who appealed against the police actions, say they are prepared to take their case to the European Court of Human Rights. Their action is supported by Amnesty International and Liberty.\n", "llama3.2:1b": "Peace protestors' appeal over police actions in stopping an anti-war demonstration at RAF Fairford is rejected by three Appeal Court judges.\n\nThe protestors appealed against a High Court decision that it was not unlawful for police to forcibly turn them away near the airbase, as they sought to overturn decisions made by two judges in February this year regarding human rights breaches.", "llama3.2:3b": "Peace protestors lost an appeal over police actions during a 2003 anti-war demonstration in which coaches were stopped, searched, and escorted back to London; the ruling upheld that police had breached human rights by detaining passengers without proof they were carrying prohibited items; the police argued their response was proportionate due to concerns of potential disorder at RAF Fairford.", "gemma2:2b": "A landmark appeal challenging the legality of police actions against anti-war protesters at RAF Fairford in 2003 was rejected by the Appeal Court. The court upheld a High Court decision that police were justified in turning back coaches filled with protestors, claiming it was to prevent potential disorder and criminal activity.  The protestors plan to appeal to the European Court of Human Rights. \n", "qwen2.5:0.5b": "Three appeal judges rejected a challenge by police authorities, arguing that turning off protesters back in RAF Fairford did not violate human rights. The protest group called on Chief Justice and Justices Clarke and Rix to overturn their ruling, saying the protestors accepted responsibility for items found during their detention. They claim they are prepared to take the case to the European Court of Human Rights and Amnesty International, citing evidence including a shield that was damaged by a smoke bomb, five shields, and a body armor vest.", "qwen2.5:1.5b": "Peace protesters lost appeal over anti-war demonstration incident involving police detentions near RAF Fairford in England. Three judges dismissed both appeals regarding the 2003 High Court decision on police actions, stating that no one accepted responsibility for items found on coaches and citing intelligence concerns about potential disorder at military installations. The police defended their decision to turn back protesters despite the appeal, which is now facing legal challenges at the European Court of Human Rights.", "qwen2.5:3b": "Peace protestors lost a landmark appeal in rejecting police actions that forcibly turned back an anti-war demonstration near RAF Fairford in 2003. The appeals were against a High Court decision stating it was not unlawful for the police to detain demonstrators, as well as a human rights ruling arising from this case. Three Appeal Court judges dismissed both appeals based on findings by two judges who ruled previously that no illegal actions occurred. Police argued their decisions respected protestors' human rights and were necessary given prior disturbances at military installations. The protestors, represented by Fairford Coach Action, are prepared to pursue the matter further through the European Court of Human Rights, with support from Amnesty International and Liberty.", "opencoder:1.5b": "The text provided does not contain any specific information that could be used to summarize it in a concise manner. The text discusses various legal aspects related to peace and demonstrations, but it lacks any initial points or key messages about the protestors' actions against the police. To preserve the key details, this task would require a more detailed understanding of the text and its context.\n", "smollm:1.7b": "The summary should be: Peace protest appeal rejected", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text into a concise summary. First, I'll read through the entire paragraph carefully to understand the main points.\n\nThe key elements are that a peace protest appeal was rejected in 2003 against police actions stopping an anti-war demonstration at RAF Fairford. The police faced two appeals: one from the High Court ruling not violating human rights, and another from a human rights court. The judges dismissed both appeals this year, challenging decisions made in February 2003. They pointed out that the police's detaining demonstrators on coaches was a violation of their rights, urging higher courts to overturn these rulings.\n\nI should make sure all important details are included: dates, locations, key figures like Craig Mackey, human rights groups involved, and the overall outcome. I'll structure the summary to include the main events without going into too much detail, keeping it clear and focused on the decisive actions and outcomes.\n</think>\n\nPeace protest appeal rejected: 2003 police actions at RAF Fairford sparked debate over human rights. Three appeals were dismissed by judges in February, opposing detaining demonstrators on coaches for potential human rights breaches. Craig Mackey called the decision 'profound.' The demonstration's detentions were criticized as a violation of police' rights, urging higher courts to overturn rulings. Protests from 80 people appealing are supported by Amnesty and Liberty groups.", "tinyllama:1.1b": "A landmark appeal filed by peace protestors has been rejected by a High Court, after the police stopped an anti-war demonstration near RAF Fairford in 2003. The three Appeal Court judges ruled that it was not unlawful for the police to forcefully turn the passengers of coaches away from the base, and dismissed both appeals. The protestors had filed an appeal against a High Court ruling in February this year, citing breaches of human rights by the police in detaining people on their way to the airfield, and turning them back under police escort. The police, who argued that their actions were proportionate and based on intelligence, said they had considered all options but rejected the protestors' claims for damages and injuries. The police commissioner said the decision not to continue the case to an ECHR hearing was made by Commander in charge of the base on the day. Peace protesters will now take their case to the European Court of Human Rights, supported by Amnesty International and Liberty.", "tinydolphin:1.1b": " Peace protestors argue that a landmark appeal against a High Court ruling was denied due to police actions in stopping an anti-war demonstration at RAF Fairford, Glos, in 2003. The decision to stop them has been overturned by three judges of the Appeal Court, which ruled that it was not unlawful for police to forcibly turn them away. Following this decision, protestors argue that they were denied human rights violations and are seeking to challenge the ruling's overturning in a higher court.", "phi:2.7b": " In 2003, peace protestors lost a landmark appeal over police actions in preventing an anti-war demonstration near RAF Fairford, Glos, before the start of the Iraq war. The police had turned them away from the area, causing three coaches to return to London under police escort. The protestors had appealed against a High Court decision that it was not unlawful for the police to stop and search the passengers. Three Appeal Court judges dismissed both appeals. \nThe protestors were appealing against a ruling by Lord Justice May and Mr Justice Harrison that the police did not breach their human rights by detaining them in the coaches. The three Coach Action protestors said they would take the case to the European Court of Human Rights, with Amnesty International and Liberty supporting them. The police argued that their decision was made to avoid disorder and criminal damage at RAF Fairford.\n", "orca-mini:3b": " Peace protestors have lost a landmark appeal over police actions in stopping an anti-war demonstration days after the start of the Iraq war. The police had sought to overturn a breach of human rights ruling arising from the same case. Sitting on Wednesday, three Appeal Court judges dismissed both appeals. They were challenging decisions by two judges in the High Court in February this year. It followed action by police, when three coachloads of people were searched and detained on the way to RAF Fairford and forced to return to London under police escort. The demonstrators appealed against a finding by Lord Justice May and Mr Justice Harrison that it was not unlawful for the police to turn the passengers away. The police were urging Lord Chief Justice and Lord Justices Clarke and Rix to overturn the ruling that they had breached the protestors' human rights by detaining them in the coaches. Craig Mackey, assistant chief constable of Gloucestershire Police, said: \"We have always considered that our responses were proportionate and all our decisions on the day were based on intelligence.\" He said no one on the coaches accepted responsibility for items found on the coaches including body armour, a smoke bomb and five shields. \"Given these circumstances, and the fact that RAF Fairford, and other military installations in the UK, had been the scene of increasingly destructive disorder in the weeks preceding this incident, the police commander on the ground made the decision to turn back the coaches. \"From day one we have vigorously defended this decision, which was made out of a genuine concern that if the coaches were allowed to proceed it would have resulted in disorder and criminal damage at RAF Fairford.\" Fairford Coach Action, representing more than 80 people who appealed against the police actions, say they are prepared to take their case to the European Court of Human Rights. Their action is supported by Amnesty International and Liberty.", "hermes3:3b": "Peace demo appeal rejected\nPeac protestors lost appeal against High Court decision not unlawful for police to forcibly turn away demonstrators near RAF Fairford during Iraq war in 2003, and also dismissed police bid to overturn human rights breach ruling.", "stablelm-zephyr:3b": "Peace protestors lost a landmark appeal regarding police actions during an anti-war demonstration near RAF Fairford, Glos, in 2003. They had appealed against a High Court decision that it was not unlawful for police to forcibly turn protestors away and overturn a breach of human rights ruling. Three Appeal Court judges dismissed both appeals, maintaining the original decision by two judges in the High Court. The police argued that their actions were proportionate and in response to increasing destructive disorder at military installations in the UK before the incident. Fairford Coach Action, representing over 80 people who appealed against the police actions, may take their case to the European Court of Human Rights.", "chatgpt-4o-latest": "Peace protestors lost an appeal against a High Court ruling that police acted lawfully in stopping an anti-war demonstration near RAF Fairford in 2003. The police also failed to overturn a ruling that they had breached protestors' human rights by detaining them in coaches. The court upheld both previous decisions. Police justified their actions based on intelligence and concerns over potential disorder, citing items found on the coaches such as body armor and a smoke bomb. Protestors, supported by Amnesty International and Liberty, plan to take their case to the European Court of Human Rights.", "stablelm2:1.6b": "Peace protestors lose appeal over anti-war demonstration stoppage: High Court ruling stood after police forcibly turned away demonstrators near RAF Fairford, Gloucestershire. Three Appeal Court judges dismissed both appeals, overturning a High Court decision made in February this year regarding the police's actions. More than 100 people were searched and detained on their way to RAF Fairford during a protest; the demonstrators claimed that they were denied human rights by the detaining officers. The police insisted that their actions were proportionate and well-founded.", "granite3.1-dense:2b": "Peace protesters lost a High Court appeal regarding police actions in 2003 that prevented them from reaching an anti-war demonstration near RAF Fairford, Gloucestershire, during the start of the Iraq war. The Appeal Court dismissed their challenges to decisions made by two High Court judges in February, affirming that it was lawful for police to turn away protesters and detain them in coaches. The demonstrators appealed a ruling that the police's actions were not unlawful, and also sought to overturn a breach of human rights. Police maintained their responses were proportionate, citing intelligence indicating potential disorder at RAF Fairford due to previous incidents. They argued turning back the coaches prevented criminal damage. Despite this, more than 80 protesters, represented by Fairford Coach Action and supported by Amnesty International and Liberty, plan to appeal to the European Court of Human Rights.", "reference": "They had appealed against a High Court decision that it was not unlawful for police to forcibly turn protestors away near RAF Fairford, Glos, in 2003.Fairford Coach Action, representing more than 80 people who appealed against the police actions, say they are prepared to take their case to the European Court of Human Rights.It followed action by police, when three coachloads of people were searched and detained on the way to RAF Fairford and forced to return to London under police escort.The police were urging Lord Chief Justice and Lord Justices Clarke and Rix to overturn the ruling that they had breached the protestors' human rights by detaining them in the coaches.\"Given these circumstances, and the fact that RAF Fairford, and other military installations in the UK, had been the scene of increasingly destructive disorder in the weeks preceding this incident, the police commander on the ground made the decision to turn back the coaches.Peace protestors have lost a landmark appeal over police actions in stopping an anti-war demonstration days after the start of the Iraq war."}