{"raw_text": "Retirement age could be scrapped\n \n The \"myth that ageing is a barrier\" to contributing to society needs to be \"exploded\", the work and pensions minister has said.\n \n This was why the government was considering scrapping the retirement age entirely, Alan Johnson said. It was also committed to \"stamping out\" age discrimination and would outlaw it, he told a conference on ageing. All three parties have been wooing older voters with both the Tories and Lib Dems pledging higher pensions.\n \n Mr Johnson told Age Concern's Age Agenda in London the government was \"seriously considering\" introducing pensions based on residency rather than national insurance contributions. This idea has been adopted by the Lib Dems as policy, while the Tories have pledged to boost pensions by restoring the link between earnings and pensions. Mr Johnson's speech comes after he last week unveiled plans to find a consensus on how to reform the country's pension system. This would be based on a series of principles including tackling pensioner poverty and fairer pensions for women, he said. Speaking at the London conference he said: \"Generalised stereotypes of people past state pension age as dependant, incapable and vulnerable are a particularly pernicious form of age discrimination\".\n \n The government wanted to tackle this by moving to a culture where retirement ages were \"increasingly consigned to the past\". \"We're sweeping them away entirely for people under 65, and we're giving those above that age a right to request to work past 65 which their employers will have to engage with seriously. \"And the review in 2011, which will look at whether it is time to sweep retirement ages away entirely, is to be tied to evidence ... showing that retirement ages are increasingly outmoded\". Mr Johnson said his department had a long-term aspiration of moving towards an 80% employment rate. This would involve an extra one million older people joining the work force, he said.\n", "llama3.2:1b": "The government is considering scrapping the retirement age entirely and instead introducing pensions based on residency rather than national insurance contributions. The policy aims to \"stamp out\" age discrimination and increase pension levels for those above 65, who can request to work past 65. A review in 2011 will examine whether retirement ages need to be scrapped completely.", "llama3.2:3b": "The UK government is considering scrapping the retirement age entirely and introducing pensions based on residency rather than national insurance contributions. The work and pensions minister says this will help tackle pensioner poverty and fairer pensions for women, as well as reduce age discrimination by moving away from stereotypes of people past state pension age being incapable and vulnerable.", "gemma2:2b": "The UK government is considering abolishing the retirement age and tackling age discrimination. They plan to implement residency-based pensions, bolster pension payouts, and promote continued workforce participation of older adults.  Their aim is to shift away from outdated retirement age norms and encourage employment among seniors. \n", "qwen2.5:0.5b": "A government official emphasized that elderly individuals should not be regarded as \"dependant\" or \"vulnerable\" because they are past state pension age. The move aims to increase retirement ages and reduce working restrictions for those over 65 years old.", "qwen2.5:1.5b": "The government plans to scrap the retirement age entirely for those under 65 and allow workers above that age to request to continue working past 65. The aim is to shift attitudes towards aging as a barrier and stamp out age discrimination by adopting policies based on residency rather than national insurance contributions, boosting pensions through higher earnings-linked pension reforms, and promoting a culture where retirement ages are increasingly seen as outdated.", "qwen2.5:3b": "Retirement age could be scrapped, with the government considering eliminating it entirely and introducing pensions based on residency rather than national insurance contributions. This aligns with policies from both the Tories and Lib Dems, who are also pledging higher pensions. The government aims to stamp out age discrimination and promote a culture where retirement ages are increasingly obsolete, proposing that employees over 65 have the right to request continued employment. A review is underway to determine if retirement ages should be eliminated entirely, with a focus on evidence showing they are outdated. The goal includes moving towards an 80% employment rate for older people, involving one million additional individuals joining the workforce.", "opencoder:1.5b": "The government's stance on ageing is crucial for society and needs to be highlighted as it \"exploded\". The discussion revolves around the idea that retirement ages are becoming increasingly outlandish compared to current standards. It calls for a change in how people are entitled to their retirement benefits. The government aims to reduce the barriers associated with aging, and to achieve this goal by introducing new policies and regulations that aim to create more equitable distribution of retirement funds. It also seeks to increase employment rates while preserving human equality and fairness in its approach.\n", "smollm:1.7b": "The summary should preserve key ideas and details while omitting unnecessary information:\n\n1. The \"myth that ageing is a barrier\" to contributing to society needs to be \"exploded\".\n2. The work and pensions minister has said.\n3. This was why the government was considering scrapping the retirement age entirely, Alan Johnson said.\n4. It was also committed to \"stamping out\" age discrimination and would outlaw it, he told a conference on ageing.\n5. All three parties have been wooing older voters with both the Tories and Lib Dems pledging higher pensions.\n6. The government is \"seriously considering\" introducing pensions based on residency rather than national insurance contributions. This idea has been adopted by the Lib Dems as policy, while the Tories have pledged to boost pensions by restoring the link between earnings and pensions.\n7. Mr Johnson told Age Concern's Age Agenda in London the government was \"seriously considering\" introducing pensions based on residency rather than national insurance contributions.\n8. The government wanted to tackle this by moving to a culture where retirement ages are \"increasingly consigned to the past\".\n9. This is tied to evidence showing that retirement ages are increasingly outmoded.\n10. Mr Johnson said his department had a long-term aspiration of moving towards an 80% employment rate.\n\nThe summary should preserve key ideas and details while omitting unnecessary information:", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about the government considering scrapping the retirement age. Let me start by reading through the provided text carefully.\n\nFirst, it mentions that the idea of a retirement barrier being a problem is outdated and needs to be exploded. The work and pensions minister, Alan Johnson, has said this. \n\nThen, he talks about the government's consideration of scrapping the retirement age entirely at a conference on aging. This was because they wanted to address issues with older voters, especially the Tories and Lib Dems who are pushing higher pensions.\n\nMr. Johnson also mentioned that the Lib Dems have already adopted the idea of using residency payments instead of national insurance contributions for pensions. The Tories, however, are pledged to boost pensions by tying pensions directly to earnings. He emphasized this because he wants to bring together all parties and strike a consensus on pension reforms, which should focus on tackling pensions for those in poverty and making pensions fairer especially for women.\n\nAdditionally, Mr. Johnson mentioned that he's about to unveil plans to change the retirement age system to be increasingly tied to past experience. This would mean people under 65 are consigned to their current ages, while those over 65 have a right to work beyond that age, which employers will need to engage with more seriously. There was also a review in 2011 aiming to test if this is the time to scrap retirement ages entirely, based on evidence showing they're increasingly outdated.\n\nLastly, he said there's a concern that people over 65 are treated as dependents, incapable, and vulnerable—generalised stereotypes of past pensioners. He warns against these perceptions as a form of age discrimination.\n\nPutting this all together, the summary should capture the main points: Johnson supports scrapping the retirement age, Lib Dems have moved to residency-based pensions, Tories aim for higher national insurance, they want a unified approach across parties, and there's concern about stereotyping older workers. \n\nI need to make sure I include all key points without getting too detailed. Maybe structure it by stating that the government is considering scrapping retirement age as outdated, mentioning Lib Dems' stance on residency-based pensions, Tories' focus on linking pensions to earnings, unified approach aimed at 80% employment rate, and the societal concern about stereotypes of older workers.\n</think>\n\nThe government is considering scrapping the retirement age as an outdated barrier that poses issues for contributing society. Alan Johnson has stated this and supports scrapping the age system entirely, particularly targeting Lib Dems who have adopted residency-based pensions. The Tories aim to boost pensions by linking them directly to earnings and seek a unified approach across all parties to tackle pensioner poverty and fairness. There's also a concern about treating older workers as dependents, incapable, and vulnerable, raising issues of age discrimination.", "tinyllama:1.1b": "In response to the ageing population and arguments around the retirement age, the Work and Pensions Minister Alan Johnson has proposed scrapping it altogether. The government is considering removing the requirement for individuals to begin receiving state pension contributions based on their residual earnings rather than employer contributions. This idea is a part of the Prime Minister's manifesto commitment to tackle penalties against older people, where they have been told that their pension ages are \"incrasingly consigned\" to the past. Johnson also announced plans for reforming the country's pension system based on principles such as abolishing retirement poverty and ensuring fairer pennsions for women. The minister proposed a review to be held in 2011, which would examine whether retirement ages need to be completely removed. This aspiration is part of the government's long-term vision to boost employment rates among older citizens and achieve an 80% participation rate by the end of the century.", "tinydolphin:1.1b": " The government announced its intention to scrap the retirement age altogether for workers aged 65 and above, as part of their commitment to \"stamp out\" age discrimination and ensure that individuals contribute more to society as they mature. This move would address concerns over a perceived barrier to contributing to society and would see older workers benefit from continued employment opportunities. The review in 2011, which will look at whether retirement ages are outmoded, is set to be tied to evidence suggesting that these age groups are increasingly becoming a part of the workforce.", "phi:2.7b": " The government is considering scrapping the retirement age entirely and has pledged to outlaw age discrimination while promising higher pensions for all three parties are trying to woo older voters. They want to tackle stereotypes of pensioners as dependent and vulnerable and move towards a culture where retirement ages are \"increasingly consigned to the past\". A review in 2011 will examine whether it is time to do away with retirement ages entirely, tied to evidence that they are becoming outdated. The government's long-term aspiration is for an 80% employment rate among older people, which would involve one million more over 60s joining the workforce.\n", "orca-mini:3b": " The government is considering scrapping the retirement age entirely and replacing it with a system based on residency rather than national insurance contributions. The Lib Dems have proposed this idea, while both the Tories and Labour are promising to boost pensions by restoring the link between earnings and pensions. The minister for work and pensions, Alan Johnson, has spoken out against age discrimination and said he wants to move towards an 80% employment rate. He says his department is committed to this goal and wants to see an extra one million older people join the workforce.", "hermes3:3b": "Retirement age may be scrapped to combat aging as barrier to contributing to society.", "stablelm-zephyr:3b": "The UK government is considering scrapping the retirement age and introducing pensions based on residency rather than national insurance contributions. The work and pensions minister, Alan Johnson, stated that the \"myth\" of ageing being a barrier to contributing to society needs to be \"exploded.\" The government aims to move away from retirement ages and increase employment rates among people over 65 by giving those above 65 the right to request working past 65, which employers must consider. A review in 2011 will examine whether retirement ages should be eliminated entirely based on evidence showing that they are increasingly outmoded.", "chatgpt-4o-latest": "The government is considering scrapping the retirement age to challenge stereotypes about ageing and promote workforce participation, according to Work and Pensions Minister Alan Johnson. He emphasized the need to combat age discrimination and proposed pensions based on residency rather than national insurance contributions. The government aims to phase out retirement ages, allowing those over 65 to request continued employment, with a 2011 review assessing the feasibility of eliminating retirement ages entirely. Johnson also outlined plans to reform pensions, focusing on reducing pensioner poverty and ensuring fairer pensions for women, while targeting an 80% employment rate, including one million more older workers.", "stablelm2:1.6b": "The government considers scrapping the retirement age entirely to eliminate societal barriers and address age discrimination. Work and pensions minister Alan Johnson revealed that all three parties are targeting older voters with higher pensions. The proposal for a \"pensions based on residency\" system has been adopted by the Liberal Democrats as policy, while the Conservatives pledge to boost pensions by restoring the link between earnings and pensions. A review is underway to consider whether retirement ages should be entirely removed. The UK aims for an increased employment rate among older people, which could involve around one million additional older people joining the workforce.", "granite3.1-dense:2b": "The UK government is contemplating scrapping the retirement age entirely to challenge the notion that aging impedes societal contribution. Work and Pensions Minister Alan Johnson emphasized this at a conference in London, where he also pledged to outlaw age discrimination. The government is exploring pension models based on residency rather than national insurance contributions, with the Lib Dems already adopting this idea as policy and the Conservatives proposing to re-link pensions to earnings. Johnson's plans aim to address pensioner poverty and ensure fairer pensions for women, with a proposed 2011 review tied to evidence demonstrating that current retirement ages are outdated. The government aspires to boost the employment rate of older adults by one million, potentially leading to retirement age elimination for those under 65 and allowing seniors over 65 to work past 65 if their employers agree.", "reference": "Mr Johnson told Age Concern's Age Agenda in London the government was \"seriously considering\" introducing pensions based on residency rather than national insurance contributions.This was why the government was considering scrapping the retirement age entirely, Alan Johnson said.Speaking at the London conference he said: \"Generalised stereotypes of people past state pension age as dependant, incapable and vulnerable are a particularly pernicious form of age discrimination\".\"And the review in 2011, which will look at whether it is time to sweep retirement ages away entirely, is to be tied to evidence ... showing that retirement ages are increasingly outmoded\".The government wanted to tackle this by moving to a culture where retirement ages were \"increasingly consigned to the past\".It was also committed to \"stamping out\" age discrimination and would outlaw it, he told a conference on ageing."}