{"raw_text": "Jowell rejects 'Las Vegas' jibe\n \n The Secretary of State for Culture, Media and Sport, Tessa Jowell, has hit out at critics of the Gambling Bill.\n \n She told the Guardian newspaper there would be no \"Las Vegas-style\" super-casinos, as rumoured in the press. Meanwhile Labour backbencher Stephen Pound labelled casino-related regeneration schemes \"a pile of pants\". The MP for Ealing North claimed the legislation would encourage a mafia-like culture of vice and corruption, in an interview on BBC Radio 4. \"You look at some of the people who are involved...they aren't in there to regenerate Blackpool. They are in it to fill their boots,\" Mr Pound told the Today programme. \"I just really think that we have made a terrible mistake here. And over all of it hangs the shadow of the men in the chalk-stripe suits with names that rhyme with spaghetti,\" he said.\n \n Ms Jowell complained of the \"scale of misrepresentation\" in the media over the bill in her interview with the newspaper, her first since the bill was launched. The culture secretary said a four year consultation period had produced a consensus on the need to \"protect children and the vulnerable\" in a swiftly changing sector. Ms Jowell insisted: \"We have a good track record for extracting planning gain in this country, for instance in social housing.\" And continued: \"We can be proud to have one of the lowest rates of problem gambling in the world. I intend to keep it that way.\" Ms Jowell will set out her position when the Bill is debated in the Commons on Monday. In prime minister's questions last week Tony Blair assured Parliament that 90% of the bill was about tightening up the regulation of the gambling industry.\n", "llama3.2:1b": "Tessa Jowell rejects criticism from critics of the Gambling Bill, which she claims will be implemented through a four-year consultation period and aim to protect children and vulnerable individuals. Labour MP Stephen Pound also disagrees, labeling it as a \"mafia-like culture\" that encourages vice and corruption.", "llama3.2:3b": "Tessa Jowell rejects criticism of the Gambling Bill, saying there would be no \"Las Vegas-style\" super-casinos as proposed by some media outlets. Labour MP Stephen Pound calls casino-related regeneration schemes a \"pile of pants\", accusing them of encouraging a mafia-like culture and corruption. Jowell counters that the four-year consultation period has produced a consensus on protecting children and vulnerable people, citing a good track record in planning gain and low rates of problem gambling.", "gemma2:2b": "Tessa Jowell denies rumors of \"Las Vegas-style\" casinos, defending the Gambling Bill as a measure to protect children and vulnerable groups. Critics, including Stephen Pound, accuse the bill of fostering corruption and vice, comparing it unfavorably to mafia-like practices.  Jowell emphasizes a consensus around protecting vulnerable populations from the rapid changes in the gambling industry. \n", "qwen2.5:0.5b": "Jowell criticizes the Gambling Bill, claiming it would not regulate casino-related schemes like those mentioned by Labour backbencher Stephen Pound. She also claims the Culture Secretary is making a \"terrible mistake\" in the media and the Government has a good track record for extracting planning gains in social housing. Jowell will present her position when she discusses the bill in Parliament's Commons on Monday.", "qwen2.5:1.5b": "Tessa Jowell, Secretary of State for Culture, Media and Sport, dismisses casino-related legislation as \"Las Vegas-style\" super-casinos and accuses Labour backbencher Stephen Pound of promoting a mafia-like culture due to misleading media coverage. She argues there has been insufficient public consultation on the Gambling Bill and insists it will not harm children or vulnerable individuals, maintaining one of the lowest rates of problem gambling in the world despite concerns about potential corruption. Jowell intends to present her position during Monday's Commons debate.", "qwen2.5:3b": "Jowell rejects 'Las Vegas' jibe, stating there would be no \"Las Vegas-style\" super-casinos in the Gambling Bill. Labour MP Stephen Pound criticizes the legislation, claiming it could lead to a mafia-like culture of vice and corruption. Jowell criticized media misrepresentation, emphasizing the bill aims to protect children and vulnerable individuals in a rapidly changing gambling sector. She asserts that Britain already has one of the lowest rates of problem gambling globally and plans to maintain this status. The Bill will be debated in the Commons on Monday.", "opencoder:1.5b": "Jowell rejects 'Las Vegas' jibe: A criticism of the Gambling Bill by Tessa Jowell, Secretary of State for Culture, Media and Sport. The Secretary mentioned there would be no \"Las Vegas-style\" super-casinos as rumoured in the press. Meanwhile, Labour backbencher Stephen Pound labelled casino-related regeneration schemes as a pile of pants. The MP for Ealing North said the legislation would encourage a mafia-like culture of vice and corruption, while his interview on BBC Radio 4 suggested a \"pile of pants\". Ms Jowell, with its four year consultation period producing a consensus on the need to protect children and the vulnerable sector, said over all it might have caused a shadowy image in her life. The media overturned her perspective by arguing about problems gambling.\n", "smollm:1.7b": "The Secretary of State for Culture, Media and Sport (SCCM) Tessa Jowell rejects the \"Las Vegas-style\" super-casinos proposed in the Gambling Bill, which would have allowed for the construction of casinos with a high level of regulation. She has also rejected rumours that the legislation would encourage a mafia-like culture of vice and corruption among casino operators. In her interview on BBC Radio 4, Tessa Jowell claimed that the legislation would not allow for such a culture to develop. Instead, she said that the bill was designed to protect children and vulnerable individuals from the negative consequences of gambling. She also insisted that the consultation period had produced a consensus on the need to protect these groups from the negative effects of gambling. In her statement before the House of Commons on Monday, Tessa Jowell will set out her position on the Gambling Bill, which is expected to be debated in the next few days.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely. Let me read through it carefully.\n\nThe main points are Jowell rejecting a gambling bill. She told The Guardian and pointed out no Las Vegas-style casinos would be built because rumors said they were. Then she compared some schemes to \"a pile of pants,\" saying they're just bad ideas that encourage mafia culture, corruption, and corruption-related issues. There was also mention of some people in the schemes not being for regeneration but just part of their bootlegging. Jowell also pointed out that the Bill didn't protect children or vulnerable groups, led to low rates of gambling problems, and her team will discuss it in the Commons on Monday.\n\nI need to make sure I include all these key points without going into too much detail. Maybe start with Jowell's rejection, then mention the gambling bill's proposed changes, the criticisms about bad regimens, her focus on vulnerable groups and gambling issues, and her decision to present her view.\n</think>\n\nJowell rejects the gambling bill, stating that no Las Vegas-style casinos would be built. She called them \"a pile of pants,\" criticizing schemes for encouraging corruption and mafia culture. Jowell focused on protecting children and vulnerable groups, highlighting low gambling rates as a problem. Her team will discuss the bill in the Commons next Monday.", "tinyllama:1.1b": "In a sharply worded interview with the Guardian newspaper, Secretary of State for Culture, Media, and Sport Teessa Jowell criticized critics of the Gambling Bill by stating that there would be no \"LaS Vegas-style\" super-casinos as rumored in the press, while Labour backbencher Stephen Pound called such schemes a \"pile of pants\". While Jowell pointed out the need to protect children and vulnerable people in a rapidly changing sector, she said she would defend her government's past record for extracting planning gain in social housing. In an interview on BBC Radio 4, Jowell insisted that the bill was not about encouraging a mafia-like culture of vice or corrupting Blackpool as claimed by Labour MP Stephen Pound. The Bill aims to regulate gambling in Britain to prevent problem gambling and improve the industry's transparency and regulatory practices, according to the text provided.", "tinydolphin:1.1b": " Tessa Jowell has hit back at critics, claiming there would be no \"Las Vegas-style\" super-casinos and instead argued for more investment in her home town of Blackpool to regenerate its image. The Secretary of State for Culture, Media and Sport made the comments during a BBC Radio 4 Today interview, where he criticized the Gambling Bill as promoting \"mafia-like\" culture of vice and corruption. Pound's accusations are aimed at the £10bn bill, which will regulate online gambling and allow local authorities to control gambling in their areas. Jowell insisted that the measures will protect vulnerable groups, with a four-year consultation period ensuring fairness for all.\n", "phi:2.7b": " Tessa Jowell, Secretary of State for Culture, Media and Sport, has dismissed criticism of the Gambling Bill as \"Las Vegas-style\" and claims it will protect children and vulnerable individuals while still allowing for responsible gambling. Labour MP Stephen Pound called it a mistake and said it would lead to corruption and vice in regeneration schemes. Jowell argues that media misrepresentation of the bill is not accurate and cites the country's low rate of problem gambling as evidence of its success. She intends to defend the bill when it is debated in the Commons.\n", "orca-mini:3b": " Tessa Jowell, the Secretary of State for Culture, Media and Sport, rejected criticism of the Gambling Bill as rumored in the press, saying there would be no \"Las Vegas-style\" super-casinos. She also accused Labour backbencher Stephen Pound of promoting a mafia-like culture of vice and corruption in the sector. Ms Jowell said she was proud of the UK's track record in extracting planning gain from social housing, and that the country had one of the lowest rates of problem gambling in the world. She also defended the bill as necessary to protect children and vulnerable people.", "hermes3:3b": "Tessa Jowell rejects criticism calling Gambling Bill \"Las Vegas-style\", claims press misrepresentation and highlights four year consultation period to protect children and vulnerable, while Stephen Pound calls casino regeneration schemes a mistake.", "stablelm-zephyr:3b": "Tessa Jowell, Secretary of State for Culture, Media and Sport, rejected criticisms of the Gambling Bill, stating there would be no \"Las Vegas-style\" super-casinos and casino-related regeneration schemes won't encourage a mafia-like culture of vice and corruption. She complained about the \"scale of misrepresentation\" in the media over the bill and expressed confidence in their track record for social housing and low problem gambling rates. The Bill will be debated in the Commons.", "chatgpt-4o-latest": "Tessa Jowell, Secretary of State for Culture, Media and Sport, defended the Gambling Bill against criticism, denying claims that it would lead to \"Las Vegas-style\" super-casinos. Labour MP Stephen Pound criticized casino-related regeneration schemes, warning of potential corruption. Jowell condemned media misrepresentation and emphasized the bill's focus on protecting vulnerable individuals. She highlighted the UK's low problem gambling rates and stressed the importance of responsible regulation. Prime Minister Tony Blair also assured Parliament that the bill primarily aimed to tighten gambling industry regulations. Jowell will present her stance when the bill is debated in the Commons.", "stablelm2:1.6b": "Secretary of State for Culture, Media and Sport Tessa Jowell denies rumors of \"Las Vegas- style\" super-casinos in the Gambling Bill and criticizes critics as misrepresenting the legislation's intentions to protect vulnerable individuals and maintain low rates of problem gambling.", "granite3.1-dense:2b": "Tessa Jowell, Secretary of State for Culture, Media and Sport, refutes claims of \"Las Vegas-style\" super-casinos in the Gambling Bill. She asserts that a four-year consultation resulted in consensus on safeguarding children and vulnerable individuals within the sector. Jowell highlights the UK's strong track record in extracting planning gain for social housing and maintaining low problem gambling rates, emphasising her commitment to preserving this status.\n\nIn contrast, Labour MP Stephen Pound criticizes the legislation as potentially fostering a mafia-like culture of vice and corruption, arguing that those involved are primarily motivated by personal gain rather than community regeneration. He expresses concern about the influence of organized crime in such projects.\n\nPrime Minister Tony Blair, in prime minister's questions, assured Parliament that 90% of the bill focuses on tightening regulation within the gambling industry.", "reference": "Ms Jowell complained of the \"scale of misrepresentation\" in the media over the bill in her interview with the newspaper, her first since the bill was launched.The Secretary of State for Culture, Media and Sport, Tessa Jowell, has hit out at critics of the Gambling Bill.Ms Jowell will set out her position when the Bill is debated in the Commons on Monday.In prime minister's questions last week Tony Blair assured Parliament that 90% of the bill was about tightening up the regulation of the gambling industry.They are in it to fill their boots,\" Mr Pound told the Today programme.She told the Guardian newspaper there would be no \"Las Vegas-style\" super-casinos, as rumoured in the press."}