{"raw_text": "Defiant hunts put ban to the test\n \n Thousands of hunt supporters have been out on the first day of hunting in England and Wales after the ban on hunting with dogs came into force.\n \n The Countryside Alliance called on hunt supporters to meet as normal, but vowed to stay within the law. Although hunting with dogs is now a criminal offence, exercising hounds, chasing a scent trail and flushing out foxes to be shot are still legal. One anti-hunt protester was taken to hospital after a violent clash in Kent.\n \n The man suffered facial injuries after an incident involving a group of men at the end of the East Kent Hunt, near Ashford. In Wiltshire, police arrested four men under the new law suspected of hunting with dogs. The group, from South Wales and Ireland, have been released on bail but police say they may face prosecution under new poaching laws.\n \n It is believed more than 270 hunts went out on Saturday, just one day after the ban came in.\n \n They were greeted by big crowds in many areas of the country, with actor Jeremy Irons and former minister Kate Hoey among the supporters. Anti-hunt groups - such as the League Against Cruel Sports - deployed 100 monitors at hunts to check for illegal activity.\n \n Mike Hobday, from the league, said video evidence of the law being broken was to be passed onto police. \"Our evidence suggests that most hunts did operate within the law, many meeting and promptly going home and others peacefully exercising their hounds or drag hunting. \"However, we have received reports of what we believe is clearly illegal activity by a number of hunts across Britain.\" BBC correspondent Simon Hall at Postbridge on Dartmoor in the West Country said 2,000 people had turned out to welcome the hunt.\n \n And the BBC's Sarah Mukherjee, with the Beaufort Hunt in Badminton, Gloucestershire said several hundred people had gathered on foot to see the hunt, with 150 on horseback. Tom Heap, BBC rural affairs correspondent, said it appeared that hunstman had, for now, been sticking to the new rules. And while there was big turnout in support of the hunts on Saturday, he said it remains to be seen if the level of backing can be maintained.\n \n Before riding out with the hunt, former minister Kate Hoey told crowds: \"We will prevail and this law will have to be overturned.\" Judith Moritz, in Melton Mowbray, said anti-hunt activists were out to monitor the four hunts operating in that part of Leicestershire, but were outnumbered by large crowds of followers. The Countryside Alliance said the meets would show the new law was \"impossibly difficult to determine\" and open to different interpretations.\n \n Chief executive Simon Hart said: \"There has been hunting in England for 700 years. This [ban] may take two or three years, perhaps two or three months, to unpick. \"It will be nothing more than a temporary break in normal service, as broadcasters say.\" Conservative family spokeswoman Theresa May said if the party was in government again it would make sure the law was repealed. Suffolk Chief Constable Alastair McWhirter, the Association of Chief Police Officers' spokesman on rural policing, told the BBC the law would be enforced, although the police would not break up hunts. The Attorney General Lord Goldsmith has so far not issued any instructions to police on how they should deal with any hunters who do violate the law. He said he would consult the director of public prosecutions and the police \"in the near future\" to decide what measures to take on hunting prosecutions.\n", "llama3.2:1b": "Thousands of people went out for hunts in England and Wales after a ban on hunting with dogs came into effect. Despite this, various forms of hunting were still allowed, including flushing out foxes to be shot and exercising hounds. \n\nProtesters clashed with anti-hunt groups at some locations, with one man suffering facial injuries in an incident involving men at the end of the East Kent Hunt. Police arrested four men suspected of hunting with dogs in Wiltshire, but they may face prosecution under new poaching laws.\n\nThe ban was announced on Saturday and marked the first day it took effect. Thousands turned out to support the hunts, with actor Jeremy Irons and former minister Kate Hoey attending.\n\nVideo evidence of the law being broken is expected to be passed onto police, although some protesters believe this may not lead to prosecution. The Countryside Alliance said the new law would \"have to be overturned\" by the hunt organizers.", "llama3.2:3b": "Thousands of hunt supporters took part in hunts across England and Wales after a ban on hunting with dogs came into force, defying laws which criminalise the activity while still allowing exercising hounds and flushing out foxes for shooting. Anti-hunt protesters clashed with hunters in Kent, while police arrested four men suspected of hunting with dogs in Wiltshire. The Countryside Alliance called the law \"impossibly difficult to determine\" and vowed to stay within the law.", "gemma2:2b": "Hunt supporters have been meeting for hunts despite a ban on hunting with dogs, with more than 270 hunts taking place across England and Wales. Anti-hunt groups have been monitoring hunts, and some arrests have been made for suspected illegal hunting. While the Countryside Alliance believes the ban will take time to overturn, police are enforcing the law. The Attorney General has not yet issued specific instructions on how to handle hunters who violate the law. \n", "qwen2.5:0.5b": "Hundreds of thousands of hunts have gone out in England and Wales since the ban on dogs’ use in hunting was implemented, according to the Countryside Alliance. Many supporters were asked to meet as normal but not to exercise hounds, chase scent trails or shoot foxes, and a man suffered facial injuries after a violent clash at an East Kent hunt. More than 270 hunts have gone out on Saturday, one day after the ban came in. Anti-hunt protesters are deployed by monitors to check for illegal activity. Mike Hobday from the league against hunting says evidence suggests most hunts were operating within the law but there is no evidence of clearly illegal activity. Hunsman has stuck with the new rules, and supporters are showing up even without the new laws.", "qwen2.5:1.5b": "Thousands gather in support of hunts after ban comes into effect, but anti-hunt groups monitor for illegal activity; many believe new law will be difficult to enforce and will remain a temporary measure.", "qwen2.5:3b": "Thousands of hunt supporters attended the first day of hunting in England and Wales after a ban went into effect, despite it being illegal. The Countryside Alliance urged support but vowed compliance with the law. Violent clashes occurred during protests. Over 270 hunts operated as planned, met by both supporters and monitors who reported potential violations. Despite initial enthusiasm, maintaining public backing remains uncertain. The ban is expected to be temporary and controversial; legal uncertainty persists regarding enforcement.", "opencoder:1.5b": "This is a condensed summary of the provided text, preserving key ideas and details while excluding specified features such as explanations, formatting, reasoning process.\n", "smollm:1.7b": "The summary is concise, preserving key ideas and details while omitting unnecessary information. The main points are:\n\n1. Defiant hunts put ban to test: Thousands of hunt supporters have been out on the first day of hunting in England and Wales after the ban on hunting with dogs came into force.\n2. Countryside Alliance calls on hunt supporters to meet as normal, but vows to stay within the law: Although hunting with dogs is now a criminal offence, exercising hounds, chasing a scent trail and flushing out foxes to be shot are still legal. One anti-hunt protester was taken to hospital after a violent clash in Kent.\n3. Thousands of hunts went out on Saturday: It is believed more than 270 hunts went out on Saturday, just one day after the ban came into force.\n4. Countryside Alliance deployed monitors to check for illegal activity by hunts: The league against cruel sports and the BBC's Sarah Mukherjee reported that many hundred people had gathered on foot to see the hunt, with 150 on horseback. Tom Heap, BBC rural affairs correspondent, said it appeared that hunters had, for now, been sticking to the new rules.\n5. Before riding out with the hunt, former minister Kate Hoey told crowds: \"We will prevail and this law will have to be overturned.\" Judith Moritz in Melton Mowbray, Leicestershire, said anti-hunt activists were out to monitor the four hunts operating in that part of Leicestershire, but were outnumbered by large crowds of followers.\n6. Chief executive Simon Hart says: \"There has been hunting in England for 700 years. This [ban] may take two or three years, perhaps two or three months, to unpick. It will be nothing more than a temporary break in normal service, as broadcasters say.\"\n7. Suffolk chief constable Alastair McWhirter, the Association of Chief Police Officers' spokesman on rural policing, told the BBC the law would be enforced: \"We will consult the director of public prosecutions and the police 'in the near future' to decide what measures to take on hunting prosecutions.\"\n8. The Attorney General Lord Goldsmith has so far not issued instructions to police on how they should deal with any hunters who do violate the law. He said he would consult the director of public prosecutions and the police \"in the near future\" to decide what measures to take on hunting prosecutions.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about a dog hunting ban in England and Wales. Let me read through it carefully.\n\nSo, first, thousands of hunt supporters went out for the first day after the ban came into effect. That's key information. The Countryside Alliance was hopeful but vowed to stick to law. \n\nThen, some people were still allowed to use hounds legally. Even if they go for a chase or flush foxes, it's illegal. But they're still inside the law. There was a protester taken to hospital, which is important because it shows both sides faced challenges.\n\nIn Kent, a man was injured in a conflict with men there. That adds some tension about the new law and its impact on local communities.\n\nThe police released four men under new rules from South Wales and Ireland. They're being released, but they might be facing prosecution too. The anti-hunt groups set up monitors to check for issues. \n\nThere were over 270 hunts that day, just one after the ban. The fans were big in many places with notable people like Jeremy Irons and Kate Hoey. Anti-hunt measures included using video evidence.\n\nThe BBC reports on thousands showing off, with a mention of Tom Heap saying they're sticking to rules. The Countryside Alliance said it was difficult to prove hunting happened before the ban, even if you check videos. \n\nThey also mentioned some areas had 200 people or so gathered, and others were on horseback. Theresa May from the Conservative Party is pushing for the law to go back. Others like Mike Hobday spoke about checking evidence against hunts.\n\nOverall, it's a mix of excitement for hunting with the legal challenges facing dog owners in England and Wales.\n</think>\n\nThousands of hunt supporters joined their dogs for the first day of hunting on landlocked England and Wales after the ban on dog hunting became effective. The Countryside Alliance was hopeful but vowed to stick to law. Despite legal loopholes, such as chasing hounds or flushing foxes, hunting with dogs remains within the law. A man in Kent faced injuries in a violent clash involving men there, while police arrested four men suspected of hunting with dogs from South Wales and Ireland.\n\nIn Kent, over 270 hunts went out on Saturday, the first day after the ban, with 150 on horseback. The BBC reported thousands gathered to welcome the hunt, including Jeremy Irons and Kate Hoey. Anti-hunt groups used video evidence of legal activity. Mike Hobday suggested most hunts were within law but noted reports of illegal activity elsewhere.\n\nThe law for dog hunting is still unclear in England, potentially taking two or three months to unfold. Conservative family spokeswoman Theresa May wants the law reversed if she's re-elected. Suffolk Chief Constable Alastair McWhirter said the law will enforce, though police won't break up hunts.\n\nLaw enforcement has so far not issued instructions for hunters who violate the law. They will consult public prosecutions' director and police in the near future.", "tinyllama:1.1b": "The country-wide ban on hunting with dogs came into force on Saturday, prompting protests from hunts supporters who are using their legal right to exercise their hounds for a celebration of the new poaching law. In some areas of England and Wales, thousands of hunts supporters gathered to welcome the ban's implementation, with violent clashes reported in Kent. Several hunts are said to have been out on the first day of hunting, prompting anti-hunting groups to launch a protest under the country's new poaching laws. The Attorney General has yet to issue any instructions to police on how they should deal with the law's enforcement, while opposition parties and the Conservative family member have expressed support for its repeal.", "tinydolphin:1.1b": " A total of 270 hunts went out on Saturday, according to the Countryside Alliance. This is just one day after a new law prohibiting hunting with dogs was introduced in England and Wales. The ban includes all types of hunting, including foxhunting and rabbit-hunting.", "phi:2.7b": " Thousands of hunt supporters gathered in England and Wales for the first day of hunting after the ban on hunting with dogs came into force. Hunting with dogs is still legal, but exercising hounds, chasing a scent trail, and flushing out foxes to be shot are banned. An anti-hunt protester was taken to the hospital with facial injuries after a violent clash in Kent. The Countryside Alliance called for supporters to meet as normal while staying within the law. Four suspects have been arrested for suspected poaching under new laws. The ban has faced criticism from animal rights groups, but supporters of hunting have gathered on Saturday to welcome it.\n", "orca-mini:3b": " Defiant hunts put ban to the test as thousands go out on first day, while some hunts exercise hounds, chase a scent trail and flush out foxes to be shot, with some reports of illegal activity by some hunts across Britain. The Countryside Alliance calls for hunt supporters to meet as normal but vows to stay within the law, with former minister Kate Hoey saying anti-hunt activists are out to monitor the four hunts operating in Leicestershire, but are outnumbered by large crowds of followers. The country's top police officer also tells the BBC that hunting prosecutions will be enforced, but some hunt managers vow they will continue their activities despite the ban.", "hermes3:3b": "Hunt supporters defy ban, thousands attend hunts after starting date; anti-hunt protesters monitor for possible violations, while some hunts claim they're operating within new rules.", "stablelm-zephyr:3b": "Thousands of hunt supporters gathered in England and Wales for defiant hunts on the first day of the ban on hunting with dogs, which now poses as a criminal offense. The Countryside Alliance urged hunters to meet as usual but vowed to abide by the law. Hunting with dogs is prohibited; however, exercising hounds, chasing scent trails, and flushing out foxes to be shot remain legal. One anti-hunt protester was hospitalized following a violent clash in Kent, while police arrested four men suspected of hunting with dogs in Wiltshire. Many hunts were conducted legally, but some engaged in illegal activity, leading to concerns over the interpretation of the new law. The Countryside Alliance stated that it would take two or three years for the ban on hunting with dogs to be repealed.", "chatgpt-4o-latest": "Thousands of hunt supporters gathered across England and Wales on the first day of the hunting ban, with many staying within the law by exercising hounds or drag hunting. Some incidents occurred, including a violent clash in Kent that left an anti-hunt protester injured and the arrest of four men in Wiltshire under the new law. Over 270 hunts took place, drawing large crowds, including public figures like Jeremy Irons and Kate Hoey. Anti-hunt groups monitored hunts for illegal activity, with some evidence of violations reported. The Countryside Alliance argued the law was difficult to enforce and predicted it would eventually be overturned. Police stated they would enforce the law but would not break up hunts, while the Attorney General had yet to issue specific instructions on prosecutions.", "stablelm2:1.6b": "Thousands of hunters staged their first day after England and Wales' ban on hunting with dogs was implemented, though exercising hounds, chasing scent trails, and flushing out foxes for potential shoot are still legal. The Countryside Alliance urged supporters to attend meetings while staying within the law, but noted that enforcing the new criminal status might take longer than anticipated (two or three months). In Wiltshire, police arrested four men suspected of hunting with dogs, who have been released on bail but may face prosecution under new poaching laws. Anti-hunt groups deployed monitors to check for illegality and captured video evidence of possible illegal activities by hunts across Britain. The ban was met by large crowds in many areas of the country, but it remains uncertain if the level.\n  \nWhile before the ban, there were over 200 hunts that took place each year, now only one or two hunts might go out per week due to the new rules. A former minister mentioned \"we will prevail\" and hoped that the law would be overturned. Chief executive Simon Hart stated that enforcing the ban might take longer than anticipated. Conservative family spokesperson Theresa May mentioned if the party was in government again they would make sure the law is repealed.", "granite3.1-dense:2b": "On the first day following England and Wales' ban on hunting with dogs, thousands of hunt supporters participated in hunts, greeted by large crowds. Despite the law making hunting with dogs a criminal offense, exercising hounds, chasing scent trails, and flushing out foxes remain legal activities. An incident in Kent resulted in an anti-hunt protester being hospitalized with facial injuries after a violent altercation during the East Kent Hunt near Ashford. Four men from South Wales and Ireland were arrested under new poaching laws for suspected hunting, but have since been released on bail and may face prosecution.\n\nThe Countryside Alliance encouraged supporters to adhere to the law while maintaining their meetings as usual, emphasizing that enforcing the ban would be challenging due to its historical context. Critics of hunting, such as the League Against Cruel Sports, deployed 100 monitors to observe potential illegal activities and plan to submit video evidence to police for potential prosecutions if found guilty.\n\nFormer minister Kate Hoey vowed that the ban would be overturned, while Conservative family spokeswoman Theresa May pledged to repeal it if her party returned to power. Suffolk Chief Constable Alastair McWhirter stated that police would enforce the law but not disrupt hunts. The Attorney General Lord Goldsmith has yet to provide instructions for enforcing the ban, intending to consult the director of public prosecutions and the police before making a decision on prosecution measures.", "reference": "Thousands of hunt supporters have been out on the first day of hunting in England and Wales after the ban on hunting with dogs came into force.Mike Hobday, from the league, said video evidence of the law being broken was to be passed onto police.The Countryside Alliance said the meets would show the new law was \"impossibly difficult to determine\" and open to different interpretations.And while there was big turnout in support of the hunts on Saturday, he said it remains to be seen if the level of backing can be maintained.The Countryside Alliance called on hunt supporters to meet as normal, but vowed to stay within the law.And the BBC's Sarah Mukherjee, with the Beaufort Hunt in Badminton, Gloucestershire said several hundred people had gathered on foot to see the hunt, with 150 on horseback.In Wiltshire, police arrested four men under the new law suspected of hunting with dogs.Before riding out with the hunt, former minister Kate Hoey told crowds: \"We will prevail and this law will have to be overturned.\"Conservative family spokeswoman Theresa May said if the party was in government again it would make sure the law was repealed.\"Our evidence suggests that most hunts did operate within the law, many meeting and promptly going home and others peacefully exercising their hounds or drag hunting.BBC correspondent Simon Hall at Postbridge on Dartmoor in the West Country said 2,000 people had turned out to welcome the hunt."}