{"raw_text": "EU referendum question unveiled\n \n The question to be asked in the referendum on the EU Constitution has been unveiled by the government.\n \n It will be: \"Should the United Kingdom approve the treaty establishing a constitution for the European Union?\" The constitution will be incorporated into UK law if there is a yes vote in the referendum, expected in 2006. Critics say the constitution is a further step towards a federal Europe, but advocates say it ensures effective operation of the enlarged 25-state EU. \"If we reject this treaty, Britain will be isolated and weak in Europe,\" said Foreign Secretary Jack Straw, who along with the rest of the Cabinet, will back a \"yes\" vote.\n \n Patriots by definition wanted the UK to be prosperous at home and strong and influential abroad, Mr Straw said. \"Our role as a leading member of the EU is a crucial part of securing that.\"\n \n Conservative shadow foreign secretary Michael Ancram said the referendum question \"seems straightforward\". But he accused the government of trying to confuse the issue by putting the EU referendum question in the same bill as the ratification of the constitution, when they should be treated as \"two separate issues\". Despite this \"underhand trick,\" the referendum bill stood \"no chance of becoming law before the election,\" he added. \"This is Tony Blair's cheap gesture to the pro-constitution lobby while he runs scared of a debate on Europe he knows he cannot win.\" Neil O'Brien, director of anti-constitution group Vote No, said: \"The reality is that the government doesn't want to discuss the EU constitution ahead of the election because they know it is extremely unpopular with voters and with business.\"\n \n The UK Independence Party said: \"If the government believes that a No vote would mean that we should leave the European Union, they should just ask us if we want to leave the EU. Then we can be out of it and better off much sooner.\"\n \n Liberal Democrat leader Charles Kennedy, who backs the constitution, said he expected the referendum would come in the first half of next year. He told BBC Radio 4's Today programme: \"The sooner we get on with this, the better.\" He said the question sounded \"very neutral\" and \"balanced,\" adding it would enable the argument \"to be enjoined fairly and squarely on both sides\". Green MEP Caroline Lucas welcomed Tony Blair's \"courage in keeping his word\" on holding a referendum. But she added: \"This treaty is a flawed document that will make the EU less accountable, less sustainable, and less just.\"\n \n Mr Blair signed the constitution at a ceremony in Rome in November, but had already made it clear the issue would be put to voters in a referendum. That promise came after sustained pressure from opposition parties. Jack Straw, who argues the constitution reflected a \"British vision for Europe\" and gives \"national governments a stronger grip\", has said the referendum could be held in spring 2006. But in an interview with the Financial Times, Mr Blair refused to be pinned down to that date, saying Britain would hold a poll \"some time in 2006 but when, I don't know\". The paper said the prime minister \"claimed ignorance\" of when other countries were planning to hold their referendums.\n", "llama3.2:1b": "The United Kingdom government has unveiled a question for the upcoming EU referendum on the constitution: \"Should the UK approve the treaty establishing a constitution for the European Union?\" The constitution will be incorporated into UK law if approved, and critics say it may lead to a federal Europe. The government backs a yes vote, while opponents fear Britain would become isolated and weak in Europe.", "llama3.2:3b": "The UK government has unveiled the referendum question on the EU Constitution: \"Should the United Kingdom approve the treaty establishing a constitution for the European Union?\" Critics say it is a step towards federal Europe, while advocates see it as ensuring effective EU operation. The government backs a \"yes\" vote, with Foreign Secretary Jack Straw stating that rejection would leave Britain isolated and weak in Europe.", "gemma2:2b": "The UK government will hold a referendum on whether to approve a new European Union constitution, set to be incorporated into British law if there is a yes vote.  Critics argue that the constitution moves towards federal Europe, while proponents claim it ensures effective EU operation.  The referendum question reads \"Should the United Kingdom approve the treaty establishing a constitution for the European Union?\" Conservative shadow foreign secretary Michael Ancram opposes this, claiming confusion over the issues and the government attempting to bypass a proper debate by combining the issue with ratification.  Anti-constitution group Vote No argues that the government is avoiding the subject due to its unpopularity with voters. The UK Independence Party calls for an outright vote on EU membership. Liberal Democrat leader Charles Kennedy expects the referendum to take place in the first half of 2006, while Green MEP Caroline Lucas welcomes the move and criticizes the constitution's flaws. Prime Minister Tony Blair signed the document in Rome but has promised a referendum, refusing to fix a date and claiming ignorance about other countries' plans for referendums.  \n", "qwen2.5:0.5b": "Key points:\n\n- EU referendum question unveiled: UK voted yes on EU Constitution\n- Critics want constitution incorporated into UK law, advocates see as effective\n- Britain seen as 'provinces' in Europe with British vision for EU\n- UK Independence Party backing Yes vote: No doubt Blair will hold referendum  \n- Liberal Democrats supporting Yes vote: They'd prefer a \"yes\" to a No  \n- Green MEP Caroline Lucas welcomed early voting deadline: Vote now, not later", "qwen2.5:1.5b": "The UK government has unveiled its referendum question regarding whether the country should approve the EU Constitution treaty. A \"yes\" vote could lead to incorporation into British law, while critics see it as a move towards federal Europe. Prime Minister Tony Blair supports a \"yes\" vote and aims for early 2006 elections; opponents fear the issue is being overshadowed by an upcoming general election.", "qwen2.5:3b": "The UK government has unveiled a referendum question about approving the EU Constitution. It asks if Britain should approve the treaty establishing a constitution for the European Union. A yes vote will incorporate the constitution into UK law, expected by 2006. Critics argue it could lead to federal Europe, while advocates say it ensures EU effectiveness. Foreign Secretary Jack Straw supports the \"yes\" side, saying it's crucial for Britain's role in Europe. Critics like Michael Ancram and Neil O'Brien contest this and suggest a delayed referendum is likely. The UK Independence Party calls for an outright decision on leaving the EU instead of voting on the constitution. Liberal Democrat Charles Kennedy expects a 2006 poll, while Green MEP Caroline Lucas opposes the treaty as unaccountable and unjust. Prime Minister Tony Blair has promised a referendum but refuses to specify a date.", "opencoder:1.5b": "The question to be asked in the EU referendum on the EU constitution has been unveiled by the government. It will be \"Should the United Kingdom approve the treaty establishing a constitution for the European Union?\" The constitution will be incorporated into UK law if there is a yes vote in the referendum, expected in 2006. Critics say the constitution is furthering towards a federal Europe but advocates say it ensures effective operation of the enlarged 25-state EU. If we reject this treaty, Britain will be isolated and weak in Europe, said Foreign Secretary Jack Straw who along with the rest of the Cabinet, backs a \"yes\" vote.\n \nPatriots argue that the UK is prosperous at home and strong and influential abroad, Mr Straw said. The reality is that our role as a leading member of the EU is crucial for securing that. As for the referendum question, despite the \"underhand trick,\" it stands \"no chance of becoming law before the election\". Despite this \"underhand trick,\" the referendum bill stood \"no chance of becoming law before the election\".\n \nThe UK Independence Party supported the government's belief in a No vote would mean they should leave the European Union. The party said they were going to ask voters if they want to leave the EU, which can lead to better off much sooner.\n \nLiberal Democrat leader Charles Kennedy backed the constitution but he also expected the referendum to come in the first half of next year. He told BBC Radio 4's Today programme: \"The sooner we get on with this, the better\".\n \nHe said the question sounded neutral and balanced, and that to be put to voters in a referendum could enable the argument to be enjoined fairly and squarely on both sides.\n \nGreen MEP Caroline Lucas supported Tony Blair's courage in keeping his word. But she added: \"This treaty is a flawed document that will make the EU less accountable, less sustainable, and less just.\"\n \nMr Blair signed the constitution at a ceremony in Rome in November but had already made it clear the issue would be put to voters in a referendum. That promise came after sustained pressure from opposition parties.\n", "smollm:1.7b": "The summary should include:\n\n1. Key ideas and details: The question being asked in the referendum, the EU constitution, and the government's position on it.\n2. No explanations or justifications: The text does not provide any explanations or justifications for the government's position on the EU constitution. It simply presents the facts as they are.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about the EU referendum question. Let me read through it carefully.\n\nThe question is about whether the UK should approve a treaty for the European Union's constitution in 2006. The constitution will be part of UK law if the referendum goes yes. Critics say it would make a federal Europe, while advocates argue it ensures better EU operations.\n\nThe summary needs to capture key points: who backs each side (Straw and Ancram), what each thinks about the bill, the opposition's stance, etc. I should avoid any explanations or formatting.\n\nSo, breaking it down:\n\n- The referendum question is unveiled.\n- Question: Should the UK approve a constitution treaty for EU?\n- The proposed year is 2006 for the referendum.\n- Critics worry it would isolate the UK and make it weak in Europe.\n- Advocates believe it enhances EU operations.\n- Foreign Secretary Jack Straw says if they vote yes, they'll support it. He's against it because Britain would be isolated.\n- Michael Ancram thinks it's straightforward but avoids confusing the issue by putting it together with the constitution ratification bill.\n- The UK Independence Party suggests if they think leaving the EU is bad, they should just leave and be out sooner.\n- The Liberal Democrat leader Charles Kennedy expects the referendum in June 2006. He believes it's a good idea for national sovereignty.\n- Tony Blair promised to vote on the constitution but hasn't set a specific date yet.\n- Green MEP Caroline Lucas supports Blair's courage, criticizing the treaty's flaws.\n\nI need to make sure all these points are included concisely without extra info or explanations.\n</think>\n\nThe referendum question regarding the UK's approval of a EU constitution for 2006 was unveiled. Critics argue it might create a federal Europe, while advocates claim it enhances EU operations. Jack Straw backs a \"yes\" vote, fearing isolation, while Michael Ancram views the bill as straightforward but avoids confusion by combining it with constitutional ratification. The UK Independence Party suggests leaving the EU if they view it negatively. The Liberal Democrat leader expected the referendum in June 2006, believing it would strengthen national sovereignty. Tony Blair promised a referendum but hasn't set a date yet. Caroline Lucas supports Blair's courage but criticizes the treaty for flaws.", "tinyllama:1.1b": "The question to be asked in the EU referendum on the constitution has been unveiled by the government with a view to approving the treaty establishing a constitution for the European Union. The constitution will be incorporated into UK law if there is a \"yes\" vote in the referendum, which is expected to happen in 2006. Critics say that the constitution is aimed at further enlarging the EU and that it ensures effective operation of the proposed constitutional treaty. Patriots will support the referendum question and it has been accused by critics as a \"cheap gesture\" and a \"double-handed trick\", with the bill for the constitution passing to vote before the 2006 election. The UK Independence Party is against the constitution, while the Liberal Democrats believe that the referendum will enable the argument to be enjoyed fairly and squarely on both sides. Green MEP Caroline Lucas is supportive of Tony Blair's promise, but expects a \"brussels vision for europe\" to be put to voters in a referendum. The prime minister has been quoted as saying Britain would hold a poll \"some time in 2006\", while the Financial Times reports that other countries have already decided when they will hold their referendums.", "tinydolphin:1.1b": " EU Referendum Question: Should the United Kingdom approve the treaty establishing a constitution for the European Union? \n\nThe question unveiled by the government, which is expected to be: \"Should the United Kingdom approve the treaty establishing a constitution for the European Union?\" This will be asked in the referendum on the EU Constitution, which will be held in 2006. The constitution will be incorporated into UK law if there is a yes vote in the referendum. Critics believe this step towards a federal Europe ensures effective operation of the enlarged 25-state EU. However, advocates argue that it is a further step towards a closer relationship with the European Union.", "phi:2.7b": " The UK government has unveiled a referendum question for voters to decide whether or not to approve the treaty establishing a constitution for the European Union (EU) in 2006. Critics argue that it is another step towards federal Europe, while advocates say it ensures effective operation of the enlarged EU. Foreign Secretary Jack Straw supports the referendum and believes that rejecting the treaty would isolate and weaken Britain in Europe. Conservative shadow foreign secretary Michael Ancram questions why the question has been included in a bill with the ratification of the constitution when they should be treated as two separate issues. Despite this, the bill is unlikely to become law before the election. The referendum bill is opposed by groups like Vote No who believe the government doesn't want voters to debate it before the election. UKIP supports leaving the EU altogether, while Liberal Democrat leader Charles Kennedy backs the constitution and expects the referendum to take place in the first half of next year. Caroline Lucas, a Green MEP, praises Tony Blair for keeping his promise on holding a referendum but criticizes the constitution as flawed and less accountable, sustainable, and just.\n", "orca-mini:3b": " The UK government unveiled the question to be asked in the referendum on the EU Constitution, which is \"should the United Kingdom approve the treaty establishing a constitution for the European Union?\". The treaty will be incorporated into UK law if there is a yes vote in the referendum, expected to take place in spring 2006. While some critics argue that the constitution is a step towards a federal Europe, others say it ensures effective operation of the enlarged 25-state EU. The government's move to put the EU Constitution question in the same bill as the ratification of the treaty was seen as an underhand trick by Prime Minister Tony Blair. Despite this, the referendum bill stood no chance of becoming law before the election. Neil O'Brien, director of anti-constitution group Vote No, said: \"The reality is that the government doesn't want to discuss the EU constitution ahead of the election because they know it is extremely unpopular with voters and with business.\" The UK Independence Party supported a \"no\" vote but warned that leaving the EU would be better off. Liberal Democrat leader Charles Kennedy backed the constitution but believed the referendum would come in the first half of next year. Jack Straw, who argued that the constitution reflected a \"British vision for Europe\" and gave \"national governments a stronger grip,\" said the referendum could be held in spring 2006. However, Prime Minister Tony Blair refused to be pinned down to", "hermes3:3b": "EU referendum question asks whether UK should approve treaty establishing European Union constitution, expected to be held in 2006.", "stablelm-zephyr:3b": "The European Union (EU) referendum question has been unveiled by the UK government: \"Should the United Kingdom approve the treaty establishing a constitution for the European Union?\" The constitution would be incorporated into UK law if there is a yes vote in the referendum, expected in 2006. Critics argue it's a step towards federal Europe, while advocates say it ensures effective operation of the 25-state enlarged EU. Liberal Democrat leader Charles Kennedy expects the referendum to take place in the first half of next year.", "chatgpt-4o-latest": "The UK government has unveiled the question for the referendum on the EU Constitution: \"Should the United Kingdom approve the treaty establishing a constitution for the European Union?\" A \"yes\" vote would incorporate the constitution into UK law, with the referendum expected in 2006. Supporters, including Foreign Secretary Jack Straw, argue it strengthens the UK's role in Europe, while critics see it as a step toward a federal EU. Conservative Michael Ancram accused the government of manipulating the process, while anti-constitution groups claim the government is avoiding debate due to public opposition. The UK Independence Party suggested a direct vote on EU membership instead. Liberal Democrat leader Charles Kennedy supported the referendum, calling the question neutral, while Green MEP Caroline Lucas criticized the treaty as flawed. Prime Minister Tony Blair, who signed the constitution in Rome, has committed to the referendum but has not confirmed an exact date.", "stablelm2:1.6b": "The UK government has revealed the question for a referendum on the EU Constitution: \"Should the United Kingdom approve the treaty establishing a constitution for the European Union?\" If approved, the constitution will be incorporated into UK law if there is a yes vote in the referendum. Critics argue that it represents further steps towards a federal Europe, while advocates say it ensures effective operation of the enlarged EU state. The government's intention is to hold the referendum alongside the ratification of the constitution bill, which would then become part of UK law. However, Conservative shadow foreign secretary Michael Ancram accuses the government of confusing voters by including the two issues together. If rejected, critics say it could isolate and weaken Britain in Europe. Proponents argue that it reflects a \"British vision for Europe\" and strengthens national governments' grip on decision-making.", "granite3.1-dense:2b": "The UK government has revealed the question for its upcoming EU constitution referendum: \"Should the United Kingdom approve the treaty establishing a constitution for the European Union?\" A \"yes\" vote would incorporate the constitution into UK law, potentially isolating Britain if it rejects the treaty and weakening its influence in Europe. Critics argue this strengthens the EU's federal structure, while proponents claim it ensures efficient management of the enlarged 25-state union. Foreign Secretary Jack Straw emphasized the importance of the UK's leading role in the EU for national prosperity and influence abroad.\n\nOpposition figures, such as Conservative shadow foreign secretary Michael Ancram and UK Independence Party leader Nigel Farage, criticize the government's strategy of bundling the referendum question with the constitution ratification bill. They claim this is an attempt to confuse voters and avoid a debate on the unpopular treaty. Meanwhile, supporters like Liberal Democrat leader Charles Kennedy anticipate the referendum occurring in the first half of 2006, viewing it as a fair platform for both sides' arguments.\n\nCritics, including Greens and Vote No campaign director Neil O'Brien, argue that the government avoids direct EU debates due to the treaty's unpopularity among voters and businesses. Tony Blair signed the constitution in November 2003 but has refused a specific referendum date, only stating it would happen \"some time in 2006,\" according to a Financial Times interview, suggesting uncertainty about other countries' referendums.", "reference": "The question to be asked in the referendum on the EU Constitution has been unveiled by the government.The constitution will be incorporated into UK law if there is a yes vote in the referendum, expected in 2006.Jack Straw, who argues the constitution reflected a \"British vision for Europe\" and gives \"national governments a stronger grip\", has said the referendum could be held in spring 2006.But he accused the government of trying to confuse the issue by putting the EU referendum question in the same bill as the ratification of the constitution, when they should be treated as \"two separate issues\".Liberal Democrat leader Charles Kennedy, who backs the constitution, said he expected the referendum would come in the first half of next year.Neil O'Brien, director of anti-constitution group Vote No, said: \"The reality is that the government doesn't want to discuss the EU constitution ahead of the election because they know it is extremely unpopular with voters and with business.\"The UK Independence Party said: \"If the government believes that a No vote would mean that we should leave the European Union, they should just ask us if we want to leave the EU.Mr Blair signed the constitution at a ceremony in Rome in November, but had already made it clear the issue would be put to voters in a referendum.Conservative shadow foreign secretary Michael Ancram said the referendum question \"seems straightforward\".\"If we reject this treaty, Britain will be isolated and weak in Europe,\" said Foreign Secretary Jack Straw, who along with the rest of the Cabinet, will back a \"yes\" vote."}