{"raw_text": "'Nuclear dumpsite' plan attacked\n \n Plans to allow foreign nuclear waste to be permanently stored in the UK have been branded \"deeply irresponsible\" by the Liberal Democrats.\n \n The government has confirmed intermediate level waste (ILW) that was to have been shipped back to its home countries will now be stored in the UK. The cash raised will go towards the UK's nuclear clean-up programme. But Lib Dem Norman Baker accused ministers of turning Britain into a \"nuclear dumpsite\".\n \n Under current contracts, British Nuclear Fuels should return all but low level waste, but none has ever been sent back. In future, only highly-radioactive waste will be sent back to its country of origin, normally Germany or Japan, under armed guard. Intermediate waste from countries such as Japan, Germany, Spain, Italy, Switzerland and Sweden will be stored permanently in the UK. At the moment, this waste is stored at Sellafield, in Cumbria, in the form of glass bricks, untreated liquid waste or solid material in drums. In a statement, the Department of Trade and Industry said the new policy meant there would be a \"sixfold reduction in the number of waste shipments to overseas countries\". And it said highly-radioactive waste would be returned to its home country sooner, ensuring there would be no overall increase in radioactivity.\n \n Trade Secretary Patricia Hewitt said the new arrangements, revealed in a Commons written statement, would raise up to £680m for Britain's nuclear clean-up programme, under the new Nuclear Decommissioning Agency. But the move has been criticised by environmental groups and the Liberal Democrats. Mr Baker, the Lib Dem environment spokesman, said: \"I have been warning for months that this would happen and raised it with government several times. But now our worst fears have been confirmed. \"Once again Britain's environmental and health needs are being ignored in policies driven by the Treasury and DTI. \"This is a terrible attempt to offload some of the £48bn cost of cleaning up nuclear sites. \"The Energy Act was supposed to help Britain clean up, but in order to pay for it we are becoming a nuclear dumpsite. \"The nuclear industry is an economic, social and environmental millstone that hangs around Britain's neck.\"\n", "llama3.2:1b": "Plans by the UK government to store intermediate-level nuclear waste in the country have been criticized as \"deeply irresponsible\" by the Liberal Democrats. The plans would involve storing highly-radioactive waste from countries such as Germany and Japan permanently in the UK, while returning low-level waste to its home countries under armed guard.", "llama3.2:3b": "Liberal Democrats criticize the UK government's decision to permanently store foreign nuclear waste, branding it \"deeply irresponsible\" and turning Britain into a \"nuclear dumpsite\". The policy aims to raise £680m for the nuclear clean-up programme.", "gemma2:2b": "The UK government plans to store foreign intermediate level nuclear waste permanently in the country.  This will raise significant funding for the UK’s nuclear clean-up programme. The Liberal Democrats criticize the decision, calling it \"deeply irresponsible\" and arguing that the move will turn the UK into a “nuclear dumpsite.” \n", "qwen2.5:0.5b": "Plans to allow foreign nuclear waste to be permanently stored have been branded \"deeply irresponsible\" by the Liberal Democrats. Under current contracts, British Nuclear Fuels should return all but low-level waste, but none has ever been sent back. In future only highly radioactive waste will be sent back under armed guard. Intermediate waste from countries such as Japan, Germany, Spain, Italy, Switzerland and Sweden will be stored permanently in the UK.", "qwen2.5:1.5b": "Plans allowing foreign nuclear waste to be stored permanently in the UK have been criticized by the Liberal Democrats as turning Britain into a \"nuclear dumpsite\". The government has confirmed storing ILW will now go to the UK instead of being returned, but none has ever been sent back. Only highly-radioactive waste from countries such as Japan, Germany, Spain, Italy, Switzerland, and Sweden will be stored permanently in the UK under armed guard, reducing shipments by sixfold. It raises up to £680m for Britain's nuclear clean-up program under the new Nuclear Decommissioning Agency. Environmental groups and Lib Dems have criticized this move.", "qwen2.5:3b": "Liberal Democrats criticize plans allowing foreign nuclear waste storage in the UK, branding it irresponsible. The government will now store intermediate level waste permanently in the country instead of shipping it back to its home countries, which will generate £680m for the UK’s nuclear clean-up program. However, critics argue this move could lead to a sixfold reduction in waste shipments to overseas countries and does not address overall radioactivity concerns, potentially turning Britain into a \"nuclear dumpsite.\" The Liberal Democrats warn that environmental and health needs are being overlooked in favor of cost-cutting measures by the Treasury and Department of Trade and Industry.", "opencoder:1.5b": "\"The government has confirmed intermediate level waste (ILW) that was to have been shipped back to its home countries will now be stored in the UK. The cash raised will go towards the UK's nuclear clean-up programme. However, it is branded \"deeply irresponsible\" by the Liberal Democrats and a \"nuclear dumpsite\". The Lib Dem Norman Baker accused ministers of turning Britain into a nuclear dumpsite under current contracts, but this was never the case in practice. In future, only highly-radioactive waste will be sent back to its country of origin, normally Germany or Japan, under armed guard. Intermediate waste from countries such as Japan, Germany, Spain, Italy, Switzerland and Sweden will be stored permanently in the UK.\".\n", "smollm:1.7b": "Nuclear dumpsites have been the subject of controversy in the UK, with concerns raised about the safety and environmental impact of storing radioactive waste permanently on British soil. The government has announced plans to allow foreign nuclear waste to be stored in the UK, but critics argue this would lead to a \"nuclear dumpsite\" scenario where the UK becomes a hub for radioactive waste storage globally.\n\nThe Liberal Democrats have been particularly vocal about their concerns, accusing the government of turning Britain into a \"nuclear dumpsite\". They point out that the UK has already hosted several international nuclear waste shipments, and that the new policy would lead to further shipments from countries such as Japan, Germany, Spain, Italy, Switzerland and Sweden.\n\nThe Liberal Democrats also argue that the new policy would raise up to £680 million for the Nuclear Decommissioning Agency (NDA), which is responsible for decommissioning nuclear power plants and disposing of radioactive waste. They point out that this would be a significant increase in costs, and that it would divert resources away from other important areas such as renewable energy and climate change mitigation.\n\nThe government has defended its decision to allow foreign nuclear waste storage, arguing that the UK's nuclear industry is already well-established and that there are no plans to build new nuclear power plants in the near future. However, critics argue that this would be a short-term solution that would ultimately lead to more long-term problems.\n\nOverall, the controversy surrounding the government's plans to allow foreign nuclear waste storage in the UK highlights the need for greater transparency and accountability in the nuclear industry, as well as the importance of ensuring that safety and environmental concerns are taken seriously.", "deepseek-r1:1.5b": "<think>\nOkay, so I've got this text about a nuclear dumpsite plan by the UK government. The user wants me to summarize it concisely, focusing on key ideas and details.\n\nFirst, I need to read through the provided text carefully. It starts by calling the plan \"deeply irresponsible\" because of the criticism from the Liberal Democrats. Then, it mentions that intermediate nuclear waste (ILW) is being shipped back to the UK now. The government has confirmed this, and the funds will go towards their clean-up program.\n\nBut the Lib Dems objectify this by accusing ministers of turning Britain into a dumpsite. They argue that under current contracts, only some waste goes back but not all. So far, none has been sent back yet. In the future, they'll send back highly-radioactive waste to Germany or Japan, and intermediate waste from other countries like Spain, Italy, etc., will be kept in the UK.\n\nThe Department of Trade and Industry (DTI) says this is a sixfold reduction in shipments. They also plan for high-level waste to return sooner. Trade Secretary Patricia Hewitt points out that this could cost up to £680 million under new plans. But environmental groups and Lib Dems are skeptical, calling it a mistake because Britain is being pushed into a nuclear dumpsite by the financial and trade bodies.\n\nThey argue that the nuclear industry should play its role, not just clean up. The energy law was supposed to help but now they're paying for it by making Britain a dumpsite. They highlight how much the UK has spent on cleaning nuclear sites, saying this is a big loss.\n\nSo, the key points are: criticism from Lib Dems about turning Britain into a dumpsite; confirmation of ILW storage in the UK with funds for clean-up; concerns that future waste goes back to home countries with higher levels; government's claims of a sixfold reduction and promise of more efficient clean-ups. But critics say it's ignoring health and environmental needs.\n\nI need to condense this into a summary without explanations, just plain text. I'll include the main points about the criticism, the action taken, the criticisms from Lib Dems, and the implications for the nuclear industry.\n</think>\n\nThe UK government's plan to allow foreign nuclear waste to be stored in the UK has faced criticism from the Liberal Democrats, calling it a \"deeply irresponsible\" move. The government confirmed that intermediate-level waste (ILW) will now be stored in the UK and aims to raise funds for its nuclear clean-up program. Environmental groups and Lib Dems objectify this by accusing ministers of turning Britain into a nuclear dumpsite, claiming the plan to return some waste back to home countries would be forced. The Department of Trade and Industry stated it would reduce shipments by sixfold, with high-level waste eventually returning sooner. However, the energy law was intended to help clean up but has now been used to fund this push, potentially costing £680 million under new plans. Critics argue this ignores health and environmental needs while highlighting Britain's role as a nuclear millstone.", "tinyllama:1.1b": "The government has announced plans to allow foreign nuclear waste to be stored in the UK permanently, under new contracts with British Nuclear Fuels. The policy will result in a sixfold reduction in the number of shipments to overseas countries and return highly-radioactive waste to its home country sooner. The government's plan has been criticized by environmental groups and the Liberal Democrats, who accused ministers of turning Britain into a \"nuclear dumpsite\". The policy is expected to raise up to £680m for the UK's nuclear clean-up programme, but will also offload some of the estimated £48bn cost of cleaning up nuclear sites.", "tinydolphin:1.1b": " The government announced plans to allow foreign nuclear waste to be permanently stored in the UK under a new policy named 'Nuclear Dump Site'. This plan has been met with criticism from both the Liberal Democrats and the environment group, who believe it will be detrimental to Britain's clean-up efforts and its environmental and health needs. The plan involves storing high-level nuclear waste that would otherwise be sent back to countries like Germany or Japan. It will only allow low-level waste to be stored in the UK under these arrangements. However, no actual shipping of waste has taken place yet.", "phi:2.7b": " The UK government has announced plans to permanently store foreign nuclear waste in the country, which has been criticized as \"deeply irresponsible\" by the Liberal Democrats. Under current contracts, British Nuclear Fuels are supposed to return all but low-level waste, but none has been sent back. The new policy means only highly-radioactive waste will be sent back to its home country and intermediate waste from other countries will be stored permanently in the UK. This will raise up to £680m for Britain' nuclear clean-up programme. Environmental groups and the Liberal Democrats have criticized the move, saying it will result in a \"terrible attempt\" to offload some of the cost of cleaning up nuclear sites and turn Britain into a \"nuclear dumpsite.\"\n", "orca-mini:3b": " The UK government has announced plans to allow foreign intermediate level waste to be permanently stored in the country, with the proceeds going towards its nuclear clean-up programme. However, this move has been criticized by environmental groups and the Liberal Democrats, who argue that it is a deeply irresponsible policy that turns Britain into a \"nuclear dumpsite\". Under the new arrangements, only highly radioactive waste will be sent back to its country of origin, usually Germany or Japan, but under armed guard. British Nuclear Fuels should return all but low level waste, but none has ever been sent back. In future, only intermediate level waste from countries such as Spain, Italy, Switzerland, and Sweden will be stored permanently in the UK. The UK's nuclear clean-up programme is estimated to cost up to £48 billion, and the government says it will raise £680 million through these new arrangements. However, environmental groups and the Liberal Democrats remain critical of the move.", "hermes3:3b": "UK plans to store foreign nuclear waste permanently attacked; Liberal Democrats call plan 'deeply irresponsible', accusing government of turning UK into a \"nuclear dumpsite\".", "stablelm-zephyr:3b": "The UK government has decided to allow intermediate-level foreign nuclear waste to be permanently stored in the country, raising up to £680 million for the nuclear clean-up program. The Liberal Democrats have criticized this decision, with Norman Baker accusing ministers of turning Britain into a \"nuclear dumpsite.\" Currently, low level waste is not returned to its origin, but highly-radioactive waste will now be sent back under armed guard. Environmental groups and the Liberal Democrats continue to oppose the decision, arguing that it ignores Britain's environmental and health needs and offloads the cost of cleaning up nuclear sites onto taxpayers.", "chatgpt-4o-latest": "Plans to store foreign intermediate-level nuclear waste permanently in the UK have been criticized as \"deeply irresponsible\" by the Liberal Democrats. The government confirmed that instead of returning this waste to its countries of origin, it will be kept in the UK, generating up to £680m for nuclear clean-up efforts. While highly-radioactive waste will still be sent back to countries like Germany and Japan, intermediate waste from several nations will remain in the UK. The Department of Trade and Industry claims this will reduce waste shipments and expedite the return of highly-radioactive material without increasing overall radioactivity. However, critics, including Lib Dem spokesman Norman Baker, argue that the move prioritizes financial concerns over environmental and public health, effectively turning Britain into a \"nuclear dumpsite.\" Environmental groups also oppose the decision, viewing it as an attempt to offset the high cost of nuclear site clean-up.", "stablelm2:1.6b": "Plans for foreign nuclear waste storage in the UK have been criticized by Liberal Democrats as \"deeply irresponsible\". Instead, intermediate level waste will be stored permanently in the UK under a policy to return only highly-radioactive waste. Critics argue this turns Britain into a \"nuclear dumpsite\" and ignores environmental concerns, while trade Secretary Patricia Hewitt says it raises funds for nuclear clean-up through the new Nuclear Decommissioning Agency.", "granite3.1-dense:2b": "Plans for storing foreign nuclear waste, including intermediate level waste from countries like Japan and Germany, in the UK have been harshly criticized by the Liberal Democrats as \"deeply irresponsible\" and a step towards turning Britain into a \"nuclear dumpsite.\" The government has confirmed this new policy, which will store this waste permanently in the UK. This decision aims to reduce waste shipments to overseas countries by sixfold and raise up to £680m for the UK's nuclear clean-up programme under the Nuclear Decommissioning Agency. However, environmental groups and the Liberal Democrats, led by Norman Baker, argue that this move ignores Britain's environmental and health needs, driven instead by the Treasury and DTI to cover the £48bn cost of nuclear site decommissioning.", "reference": "The government has confirmed intermediate level waste (ILW) that was to have been shipped back to its home countries will now be stored in the UK.Plans to allow foreign nuclear waste to be permanently stored in the UK have been branded \"deeply irresponsible\" by the Liberal Democrats.Trade Secretary Patricia Hewitt said the new arrangements, revealed in a Commons written statement, would raise up to £680m for Britain's nuclear clean-up programme, under the new Nuclear Decommissioning Agency.Under current contracts, British Nuclear Fuels should return all but low level waste, but none has ever been sent back.Intermediate waste from countries such as Japan, Germany, Spain, Italy, Switzerland and Sweden will be stored permanently in the UK.And it said highly-radioactive waste would be returned to its home country sooner, ensuring there would be no overall increase in radioactivity.In a statement, the Department of Trade and Industry said the new policy meant there would be a \"sixfold reduction in the number of waste shipments to overseas countries\".\"The nuclear industry is an economic, social and environmental millstone that hangs around Britain's neck.\""}