{"raw_text": "Visa row mandarin made Sir John\n \n The top civil servant at the centre of the David Blunkett visa affair has been knighted in the New Year Honours.\n \n Sir John Gieve was Home Office permanent secretary during the saga which ended with Mr Blunkett quitting. He and other civil servants were criticised for failing to recall how the visa for Mr Blunkett's ex-lover's nanny came to be fast-tracked. The outgoing head of the troubled Child Support Agency Doug Smith also earns an honour in the New Year's list. Mr Smith, 57, whose retirement was announced by Work and Pensions Secretary Alan Smith in November, is made a Commander of the Order of Bath.\n \n Both men were giving evidence to a Commons committee on the computer difficulties facing the agency, which left thousands of single parents without any maintenance payments, when the announcement was made. The knighting of Sir John, 54, will be received with astonishment by opposition politicians.\n \n The Liberal Democrats said it \"beggared belief\" he and fellow officials could not remember how Leoncia Casalme's application for indefinite leave to remain went from Mr Blunkett's office to the head of the Immigration and Nationality Department. Meanwhile, the Conservatives accused officials of a \"collective failure\" of memory. But Sir Alan Budd, who led an inquiry into the affair, said he had no reason to believe anyone involved had deliberately withheld information.\n \n Downing Street defended the decision to honour both men, with a spokesperson saying: \"You have to look at their whole career.\" Sir John was made permanent secretary in April 2001 following a Civil Service career which dates back to 1974. He has also worked in the Treasury and the Department of Employment. A Department for Work and Pensions spokeswoman said of Mr Smith's honour: \"The award reflects all that he has achieved in a Civil Service career, principally in the Inland Revenue, spanning over 40 years - not just his role as chief executive of the Child Support Agency.\n \n \"In his career he has personally led a number of successful major change programmes.\" Mr Smith is set to stay on at the CSA until March. Less controversial will be the knighthoods for Derek Wanless and Mike Tomlinson, who undertook major government reviews on health and education respectively. Former NatWest chief executive Mr Wanless, 57, has delivered not one but two major reports on the NHS. Ex-chief inspector of schools Mr Tomlinson, 62, has recommended replacing A-Levels and GCSEs with a new diploma system in a shake-up of the exams system.\n", "llama3.2:1b": "Visa row mandarin Sir John Gieve was knighted in the New Year Honours for his role during the David Blunkett visa affair.\n\nSir John, 54, was home office permanent secretary during the saga which ended with Mr Blunkett quitting.\n\nBoth men were given evidence to a Commons committee on computer difficulties facing the Child Support Agency.", "llama3.2:3b": "Sir John Gieve, former Home Office permanent secretary, was knighted for his long civil service career, including as head of the Immigration and Nationality Department during the David Blunkett visa affair. Doug Smith, outgoing Child Support Agency chief executive, also received a Commander of the Order of Bath honour.", "gemma2:2b": "Sir John Gieve, former Home Office permanent secretary involved in the David Blunkett visa scandal, was knighted. Doug Smith, outgoing head of the Child Support Agency, was made a Commander of the Order of Bath. Downing Street defended these honors, citing their long and successful careers. Derek Wanless received a knighthood for his work on the NHS reviews, and Mike Tomlinson for his education reform suggestions. \n", "qwen2.5:0.5b": "The New Year Honors were given to Sir John Gieve and Doug Smith in recognition for their role in overseeing the David Blunkett visa affair, which resulted in Mr Blunkett leaving his position as permanent secretary at the Home Office and the Child Support Agency. Both men were knighted under the New Year's list and received a Commander of the Order of Bath.", "qwen2.5:1.5b": "Sir John Gieve, former Home Office permanent secretary during Blunkett's visa scandal, receives knighthood in New Year Honours; Sir Alan Budd dismisses claims about official memory lapses in child support agency inquiry.", "qwen2.5:3b": "The New Year Honours include Sir John Gieve, former Home Office permanent secretary involved in David Blunkett's visa affair, being knighted. Doug Smith, 57, made Commander of the Order of Bath for his work with the Child Support Agency. Both were criticised over their memory regarding a fast-tracked visa application and faced questioning from Commons committee members. While Downing Street defended their honours, critics argue officials should have remembered the incident. The knighthoods are also given to Derek Wanless and Mike Tomlinson for their contributions in healthcare and education reviews.", "opencoder:1.5b": "Visa row mandarin made Sir John\n\nThe top civil servant at the centre of the David Blunkett visa affair has been knighted in the New Year Honours.\n\nSir John Gieve was Home Office permanent secretary during the saga which ended with Mr Blunkett quitting. He and other civil servants were criticised for failing to recall how the visa for Mr Blunkett's ex-lover's nanny came to be fast-tracked. The outgoing head of the troubled Child Support Agency Doug Smith also earns an honour in the New Year's list.\n\nMr Smith, 57, whose retirement was announced by Work and Pensions Secretary Alan Smith in November, is made a Commander of the Order of Bath.\n\nBoth men were giving evidence to a Commons committee on the computer difficulties facing the agency, which left thousands of single parents without any maintenance payments, when the announcement was made. The knighting of Sir John, 54, will be received with astonishment by opposition politicians.\n\nThe Liberal Democrats said it \"beggared belief\" he and fellow officials could not remember how Leoncia Casalme's application for indefinite leave to remain went from Mr Blunkett's office to the head of the Immigration and Nationality Department. Meanwhile, the Conservatives accused officials of a \"collective failure\" of memory.\n\nDowning Street defended the decision to honour both men, with a spokesperson saying: \"You have to look at their whole career.\" Sir John was made permanent secretary in April 2001 following a Civil Service career which dates back to 1974. He has also worked in the Treasury and the Department of Employment.\n", "smollm:1.7b": "Sir John Gieve was Home Office permanent secretary during the David Blunkett visa affair. He and other civil servants were criticized for failing to recall how the visa for Mr Blunkett's ex-lover's nanny came to be fast-tracked. The outgoing head of the troubled Child Support Agency Doug Smith also earns an honor in the New Year's list. Both men were giving evidence to a Commons committee on the computer difficulties facing the agency, which left thousands of single parents without any maintenance payments, when the announcement was made. The knighting of Sir John, 54, will be received with astonishment by opposition politicians.\nThe Liberal Democrats said it \"beggar belief\" he and fellow officials could not remember how Leoncia Casalme's application for indefinite leave to remain went from Mr Blunkett's office to the head of the Immigration and Nationality Department. Meanwhile, the Conservatives accused officials of a \"collective failure\" of memory. But Sir Alan Budd, who led an inquiry into the affair, said he had no reason to believe anyone involved had deliberately withheld information.\nDowning Street defended the decision to honour both men, with a spokesperson saying: \"You have to look at their whole career.\" Sir John was made permanent secretary in April 2001 following a Civil Service career which dates back to 1974. He has also worked in the Treasury and the Department of Employment. A Department for Work and Pensions spokeswoman said of Mr Smith's honour: \"In his career he has personally led a number of successful major change programmes.\"\nSir Alan Wanless and Mike Tomlinson, who undertook major government reviews on health and education respectively, have both received knighthoods in the New Year's list. Sir Alan Wanless has delivered not one but two major reports on the NHS, while Mr Tomlinson has recommended replacing A-Levels and GCSEs with a new diploma system in a shake-up of the exams system.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Sir John Gieve and Sir Alan Budd being knighted for their work on the David Blunkett visa issue. Let me read through it carefully.\n\nThe top civil servant was knighted in New Year Honours. Sir John Gieve had a similar role during the saga that ended with Mr Blunkett quitting. He and other officials faced criticism for not recalling how the visa application became fast-tracked. There were also mentions of Doug Smith, outgoing head of Child Support Agency, who received an honour too.\n\nSome key points: Sir John was 54 and will be surprised by opposition politicians. His knighting is expected to draw attention. The Liberal Democrats accused officials of not remembering Leoncia Casalme's application. On the other hand, Conservatives said they had a \"collective failure\" in their memory. Mr Alan Budd, involved in an inquiry, said no one deliberately hid information.\n\nDowning Street said the decision was justified with a spokesperson mentioning Sir John's long career and major change programmes. The knighthoods for Derek Wanless and Mike Tomlinson were less controversial, with former NatWest CEO and ex-schools inspector respectively. They delivered reports on NHS and exams system changes.\n\nI need to make sure I include all these points but keep it concise without explanations. Let me structure the summary by highlighting Sir John's role, his knighting, the controversy regarding his recall, the incoming Mr Smith's status, the debate between Lib Dems and Contras, and the contributions of the other two officials.\n</think>\n\nSir John Gieve was knighted in New Year Honours for his role in the David Blunkett visa saga. Sir John, 54, is expected to receive attention from opposition politicians due to his knighting. His knighthood was made after a long career and significant change programmes. criticism of officials for not recalling key facts about Leoncia Casalme's application. Mr. Alan Smith, former Work and Pensions Secretary, received an honour as Commander of the Order of Bath due to his retirement. The debate between Lib Dems and Contras centered on memory failures among officials. Derek Wanless was knighted for major NHS reports, while Mike Tomlinson was awarded for his health education reforms. Former NatWest CEO and former chief executive. Ex-inspector respectively. Their contributions were less controversial.", "tinyllama:1.1b": "The former permanent secretary and chief executive at the Department for Work and Pensions, Sir John Gieve, and the head of Inland Revenue, Doug Smith, have both been knighted in the New Year Honours list with a Commander of the Order of Bath honour. Both men were members of a committee investigating the Computer-Aided Drafting (CAD) system used by the agecare department of the UK government's Child Support Agency (CSA), but their lack of memory was criticised during the scandal. However, senior civil servants have been hailed for recalling how the visa for Mr Blunkett's nanny came to be fast-tracked. The decision to honour both men has been defended by Downing Street, while the Conservatives have accused officials of a collective failure in memory. The knighthoods for Derrek Waanless and Mike Tomlinson were handed out in the New Year Honours list, with their reports on health and education respectively being key points of attention.", "tinydolphin:1.1b": " The New Year Honours list includes significant awards for notable individuals, including the knighthood of Sir John Gieve, Home Office permanent secretary during the David Blunkett visa affair, and Doug Smith, who was Chief of the Child Support Agency at the time. Both men are given honours in recognition of their roles during this controversy.", "phi:2.7b": " Sir John Gieve, the former Home Office permanent secretary during the David Blunkett visa affair, was knighted in the New Year Honours list for his contributions to the Civil Service. The top civil servant at the centre of the scandal is set to receive an honour for his long career which includes time spent in the Treasury and Department of Employment.\n", "orca-mini:3b": " Sir John Gieve, former Home Office permanent secretary during the David Blunkett visa affair, has been knighted in the New Year Honours. Doug Smith, head of the Child Support Agency, also earns an honor. Both were given knighthoods for their contribution to public service. The Liberal Democrats criticized the decision, saying it \"beggared belief\" that officials could not remember how a visa for Leoncia Casalme's nanny was fast-tracked. However, Sir Alan Budd, who led an inquiry into the affair, said he had no reason to believe anyone involved had deliberately withheld information. The Conservatives accused officials of a \"collective failure\" of memory.", "hermes3:3b": "Sir John Gieve knighted for failing to recall Visa affair during his role as Home Office permanent secretary. Also, Child Support Agency's former CEO Doug Smith made Commander of the Order of Bath for his career.", "stablelm-zephyr:3b": "Sir John Gieve, who was Home Office permanent secretary during the David Blunkett visa affair, was knighted in the New Year Honours. He and other civil servants were criticized for failing to recall how the visa for Mr. Blunkett's ex-lover's nanny came to be fast-tracked. Doug Smith, former head of the Child Support Agency, also earned an honor as a Commander of the Order of Bath. Both men were giving evidence to a Commons committee when they found out about their knighthoods. Downing Street defended the decision to honour both men, arguing that it considered their entire careers.", "chatgpt-4o-latest": "Sir John Gieve, the former Home Office permanent secretary involved in the David Blunkett visa affair, has been knighted in the New Year Honours, despite criticism over his failure to recall details of the fast-tracked visa for Mr. Blunkett's ex-lover's nanny. Doug Smith, outgoing head of the Child Support Agency, was also honoured. Opposition politicians expressed astonishment, with the Liberal Democrats and Conservatives criticizing officials' lack of memory. However, an inquiry found no evidence of deliberate withholding of information. Downing Street defended the honours, citing the recipients' long civil service careers. Less controversial knighthoods were awarded to Derek Wanless and Mike Tomlinson for their contributions to health and education reforms.", "stablelm2:1.6b": "Sir John Gieve, Home Office permanent secretary during the visa affair involving David Blunkett, was knighted in the New Year Honours List due to his role as an expert witness on parliamentary committees. Meanwhile, Doug Smith, outgoing head of Child Support Agency and Alan Smith's former retirement announcement target, was made a Commander of the Order..\nBoth politicians and critics expressed astonishment at Sir John and Smith's knighthoods. However, Sir Alan Budd, who led an inquiry into the affair, said no one involved deliberately withheld information. Downing Street defended the honors, stating that recipients have demonstrated excellence throughout their careers.\nThe details mentioned above are key to understanding the context of the text but condensed without explanations or reasoning processes.", "granite3.1-dense:2b": "Sir John Gieve, former Home Office permanent secretary during the David Blunkett visa affair, has been knighted in the New Year Honours. The affair involved the fast-tracking of a visa for the nanny of Mr. Blunkett's ex-lover, which Gieve and other civil servants were criticized for not recalling. This decision is expected to provoke astonishment from opposition parties, with the Liberal Democrats calling it \"beggaring belief\" and the Conservatives accusing officials of a \"collective failure.\"\n\nDoug Smith, the outgoing head of the Child Support Agency (CSA), has also been honored as a Commander of the Order of Bath. His career spans over 40 years, primarily in the Inland Revenue and as CSA chief executive. Both men were testifying before a Commons committee about computer issues causing thousands of single parents to miss maintenance payments when their knighthoods were announced.\n\nDowning Street defended the decisions, emphasizing the recipients' entire careers. Other notable honorees include Derek Wanless and Mike Tomlinson, who have undertaken major government reviews on health and education, respectively, after years of experience in various roles within the public sector.", "reference": "A Department for Work and Pensions spokeswoman said of Mr Smith's honour: \"The award reflects all that he has achieved in a Civil Service career, principally in the Inland Revenue, spanning over 40 years - not just his role as chief executive of the Child Support Agency.Sir John Gieve was Home Office permanent secretary during the saga which ended with Mr Blunkett quitting.Sir John was made permanent secretary in April 2001 following a Civil Service career which dates back to 1974.Mr Smith, 57, whose retirement was announced by Work and Pensions Secretary Alan Smith in November, is made a Commander of the Order of Bath.Former NatWest chief executive Mr Wanless, 57, has delivered not one but two major reports on the NHS.The top civil servant at the centre of the David Blunkett visa affair has been knighted in the New Year Honours.\"In his career he has personally led a number of successful major change programmes.\"The Liberal Democrats said it \"beggared belief\" he and fellow officials could not remember how Leoncia Casalme's application for indefinite leave to remain went from Mr Blunkett's office to the head of the Immigration and Nationality Department."}