{"raw_text": "Housing plans criticised by MPs\n \n \"Irreversible environmental damage\" will be caused by government plans to build more than one million homes in south-east England, MPs have warned.\n \n \"Sustainable communities\" were being promoted without a real understanding of what \"sustainable\" means, the Environmental Audit Committee said. It said issues like energy needs and transport were not properly addressed. Deputy Prime Minister John Prescott said the report was completed before new initiatives were announced. He said: \"We are working across government, especially with our colleagues at Defra, to create cleaner, safer and greener communities, while protecting and enhancing the environment.\"\n \n The report said there was far too little attention paid to many environmental issues, including water, even though supplies in parts of the South East are already too low. Regulations designed to ensure energy-efficient buildings are too lax, and builders routinely flout them anyway, it said.\n \n Financing for improving transport was around one-twentieth of what would be required. The report was a stinging rebuke for the government and especially John Prescott's department, BBC environment correspondent Richard Black said. Chairman of the Environmental Audit Committee Peter Ainsworth MP, said: \"The government's housing policy is an alarming example of disjointed thinking in an areas where joined-up policy is crucial. \"I accept the need to improve housing supply but, as things stand, the principal beneficiary of housing growth will be property developers, with the environment we all depend on being the principal loser.\" Points raised in the report included:\n \n \n  - No proposals to further increase housing supply should be taken forward without strong supporting evidence. \n  - The government should recognise shortcomings of the Treasury's Barker Review, which said 140,000 new homes a year were needed in Britain. \n  - The government should consider a \"national spatial framework\" for England such as those already in place in Scotland and Wales. \n  - The Office of the Deputy Prime Minister should maximise brown field development and housing densities. \n  - Measures to encourage improved energy efficiency for existing homes should be considered - including reduced stamp duty for homes that achieve set standards and a clear timetable for achieving zero-emissions homes. \n  - The government should make clear how it intends to measure its success at creating sustainable communities. \n  \n \n Conservative local government spokeswoman Caroline Spelman said: \"There is now growing evidence that John Prescott's buildings programme is environmentally unsustainable, leaving a concrete scar across the face of rural England.\"\n", "llama3.2:1b": "MPs have criticised government plans for building over 1 million homes in south-east England, citing irreversible environmental damage and lack of attention to key issues. The Environmental Audit Committee reported that sustainable communities were not adequately promoted and energy needs and transport were poorly addressed. Regulating builders' energy-efficient practices was also deemed insufficient.", "llama3.2:3b": "MPs warn of irreparable environmental damage from government plans to build over 1 million homes in south-east England, citing lack of attention to environmental issues such as energy needs and transport. The report also criticizes financing for transport improvements and lax regulations on energy-efficient buildings.", "gemma2:2b": "The Environmental Audit Committee criticized government plans for building one million homes in southeast England, stating they will cause irreversible environmental damage due to insufficient attention to energy needs, transport, and water resources. The report found lax regulations on energy efficiency and lack of sufficient funding for improvements to transportation infrastructure. It also suggested alternative approaches such as a national spatial framework, increased brownfield development, and measures like reduced stamp duty for energy-efficient homes. \n", "qwen2.5:0.5b": "Key points from the text:\n\n  * MPs warned that government plans to build more than one million homes in south-east England are causing irreparable environmental damage.\n  * Sustainable communities were promoted without proper consideration for what \"sustainable\" means. Issues like energy needs and transport were not properly addressed.\n  * Deputy Prime Minister John Prescott said the report was completed before new initiatives were announced, saying he would work across government to create cleaner, safer, and greener communities while protecting and enhancing the environment.\n  * The report showed that many environmental issues, including water supplies in parts of the South East, had not been adequately addressed.\n  * Funding for improving transport was around one-tenth of what was required. The report called for stronger support to energy-efficient buildings and builders flouting regulations.\n  * The government should consider a \"national spatial framework\" for England, as well as measures to encourage improved energy efficiency in homes.\n  * Measures should be made clear how the government intends to measure its success at creating sustainable communities.\n\nIn summary: MPs warned about environmental damage caused by government plans to build more than one million homes in south-east England, highlighting issues like water and energy needs. They recommended stronger funding for transport improvements and measures to address green building standards.", "qwen2.5:1.5b": "Environmental concerns over proposed housing developments criticized by MPs. The report calls for stricter energy efficiency regulations and improved transport infrastructure funding while urging caution in expanding housing supply without strong evidence to ensure environmental sustainability.", "qwen2.5:3b": "MPs criticised government plans to build over one million homes in south-east England, citing irreversible environmental damage. The Environmental Audit Committee warned about poor understanding and addressing issues like energy needs and transport. The report highlighted insufficient attention to water supplies and lax building regulations. It criticized inadequate financing for improving transport. Key recommendations include no further housing supply without strong evidence, recognizing the Treasury's Barker Review shortcomings, considering a national spatial framework, maximizing brownfield development, encouraging improved energy efficiency in existing homes, and clearly measuring success in creating sustainable communities. Conservative MP Caroline Spelman added that John Prescott’s building program appeared environmentally unsustainable.", "opencoder:1.5b": "Housing plans criticized by MPs have sparked concerns about future environmental damage caused by government programs to build more than one million homes in south-east England. The report highlights issues related to sustainable development, including energy efficiency and transport needs. It calls for improvements in housing supply, while also acknowledging the need for a national spatial framework. Initiatives like a \"national spatial framework\" are crucial as they aim to create cleaner, safer and greener communities while protecting against climate change. Measures to promote energy-efficient homes, such as reduced stamp duty and a clear timetable for achieving zero-emissions homes, have also been suggested. The government has highlighted the need for clear measures to measure its success in creating sustainable communities.\n", "smollm:1.7b": "The summary above captures the main points and key ideas from the original text without adding or changing them. The focus is on the overall tone, style, and content of the text, rather than its specific details or arguments.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text into just plain text without any explanations or formatting. Let me read through it carefully.\n\nThe main points are about the housing plans being criticized by MPs in south-east England. They're saying these plans will cause irreversible environmental damage because of their construction of over a million homes. \n\nNext, there's mention of the Environmental Audit Committee questioning the government's understanding of what \"sustainable\" means and issues like energy needs and transport not being properly addressed. A deputy PM, John Prescott, was supposed to oversee this report but didn't finish it before new initiatives were announced.\n\nThe report found far too little attention on many environmental problems, especially water, even though South East England's supplies are low. Regulations are lax for energy-efficient buildings, and builders often break these rules. Funding for transport was also insufficient compared to what's needed.\n\nAnother criticism is from Richard Black, who called the report a rebuke to the government and particularly Prescott's department. The chair of the Audit Committee, Peter Ainsworth, pointed out that the housing policy seems disjointed in areas where coordinated policies are crucial. He thinks it's an alarming example of disjointed thinking. He also mentioned that while there might be gains for property developers, the environment is a loser.\n\nThere are several points raised in the report: no further housing proposals should come without strong evidence; the government needs to acknowledge shortcomings from the Treasury's Barker Review, which wanted 140,000 homes annually; considering a national spatial framework like Scotland and Wales. The office of the Deputy Prime Minister should maximize brown field development and homes with higher densities; measures for improving energy efficiency in homes should include reduced stamp duty and a clear timeline for zero-emission homes; and the government needs to outline how they plan to measure success in creating sustainable communities.\n\nConservative MP Caroline Spelman criticized that John Prescott's buildings program is environmentally unsustainable, leaving a \"concrete scar\" in rural England. The user also provided more points from the summary than I did before, but the key ones are these criticisms of housing policies and their environmental impacts.\n\nI need to make sure the summary captures all these points concisely, focusing on the main issues without going into too much detail.\n</think>\n\nHousing plans in south-east England are criticized by MPs for causing irreversible environmental damage due to the construction of over a million homes. The Environmental Audit Committee questioned the government's understanding of sustainability and highlighted issues like energy needs and transport that weren't fully addressed, while highlighting the lack of adequate regulations against builders. A deputy PM mentioned he was supposed to oversee this report but missed it before new initiatives were announced. The report noted insufficient funding for transport and low supply in parts of the region. It was rebuked by Richard Black, criticizing the government's disjointed approach, while Peter Ainsworth criticized the housing policy as an example of poor thinking in places needing coordinated policies. The report also highlighted shortcomings from the Treasury's Barker Review and suggested a \"national spatial framework.\" Key points included no further housing proposals without strong evidence; acknowledging the need for action on the Barker Review; considering a national spatial plan like Scotland and Wales; maximizing brown field development and higher densities; improving energy efficiency measures with stamp duty reduction and clear timelines to zero-emission homes; and outlining success metrics for sustainable communities.", "tinyllama:1.1b": "The Environmental Audit Committee criticized plans to build more than one million homes in south-east England, calling for strict regulation and attention to environmental issues, including water, despite supply levels being already too low. The report said finances for improving transport were around 1/20th of what would be required, while builder flooding routine buildings was deemed a major issue. The government's housing policy was also criticized as an example of \"disjointed thinking\" in areas where joined-up policy is crucial and with no proposal to further increase housing supply taken forward despite the lack of supportive evidence. The report highlighted the need for strong supporting evidence, the shortcoming of the Treasury's Barker Review on housing supply, a national spatial framework, measures to encourage improved energy efficiency for existing homes and an end to stamp duty for houses that achieve set standards, a clear timetable for achieving zero-emissions homes.", "tinydolphin:1.1b": " The report criticizes the government plans for building more than one million homes in south-east England. It suggests that these plans should be sustainable communities, meaning they should promote a cleaner, safer environment and protect natural resources. However, the report notes that current policies focus too much on energy efficiency without sufficient attention being given to water and other environmental issues. The Environmental Audit Committee also questions how the government plans to measure its success in creating sustainable communities.", "phi:2.7b": " A summary of the text is:\n\nThe text reports on the criticism of the British government's housing plans by MPs. They claim that the plans will cause irreversible environmental damage and ignore many important issues such as energy and transport. The deputy prime minister denies the report and says they are working to create cleaner, safer and greener communities. The report also criticises the lack of attention to water, building regulations and financing for transport in the government's policy.\n", "orca-mini:3b": " Housing plans criticized by MPs for causing irreversible environmental damage and promoting sustainable communities without a real understanding of what \"sustainable\" means. Issues like water and transport are not properly addressed, while builders routinely flout energy-efficient regulations. The government's housing policy is an alarming example of disjointed thinking in areas where joined-up policy is crucial.", "hermes3:3b": "Environmental damage from one mn homes in SE England warned by MPs; insufficient attention to water, energy efficiency & transport.", "stablelm-zephyr:3b": "MPs have criticized government plans to build over one million homes in south-east England, warning that it will cause \"irreversible environmental damage\". The Environmental Audit Committee claims that sustainable communities are being promoted without a proper understanding of the term and issues like energy needs and transport aren't being addressed adequately. The report also points out that there's insufficient attention to environmental issues such as water and regulations for energy-efficient buildings are too lax, often ignored by builders. Financing for improving transport is significantly low compared to what would be required. Chairman of the Environmental Audit Committee, Peter Ainsworth MP, acknowledges the need for housing growth but argues that currently, property developers will benefit at the expense of the environment and all depend on it.", "chatgpt-4o-latest": "MPs have warned that government plans to build over a million homes in south-east England could cause \"irreversible environmental damage.\" The Environmental Audit Committee criticized the lack of understanding of sustainability, inadequate attention to energy and transport needs, and weak regulations on energy efficiency. The report highlighted insufficient water supplies and underfunded transport improvements. Committee chairman Peter Ainsworth called the policy \"disjointed,\" benefiting developers while harming the environment. Recommendations included requiring strong evidence before increasing housing supply, addressing flaws in the Barker Review, adopting a national spatial framework, prioritizing brownfield development, and promoting energy efficiency. Deputy Prime Minister John Prescott defended the plans, citing new initiatives, but critics, including Conservative spokeswoman Caroline Spelman, argued the program was environmentally unsustainable.", "stablelm2:1.6b": "MPs criticize government plans for over one million homes in South-East England due to \"irreversible environmental damage\", lack of sustainability and insufficient attention on important environmental issues. The Environmental Audit Committee urged addressing energy needs and transport without understanding what sustainable means. Key recommendations include supporting housing supply, increasing energy efficiency, national spatial frameworks, maximizing brown field development, and clear success metrics for creating sustainable communities.", "granite3.1-dense:2b": "MPs criticize the government's plan to construct over one million homes in southeast England as likely causing \"irreversible environmental damage.\" The Environmental Audit Committee finds insufficient attention to critical environmental factors, such as water supply and energy needs. They highlight weak regulations for energy efficiency and underfunded transport improvements. Deputy Prime Minister John Prescott attributes the report's completion before new initiatives were announced. MPs, led by chairman Peter Ainsworth, call for stronger housing supply evidence, reconsideration of the Treasury's Barker Review, and implementation of a national spatial framework. Proposed measures include maximizing brown field development, encouraging energy-efficient improvements through stamp duty reductions, and establishing clear sustainability success metrics. Conservative spokeswoman Caroline Spelman asserts that the program is environmentally unsustainable, leaving a \"concrete scar\" on rural landscapes.", "reference": "The report was a stinging rebuke for the government and especially John Prescott's department, BBC environment correspondent Richard Black said.Deputy Prime Minister John Prescott said the report was completed before new initiatives were announced.- The government should recognise shortcomings of the Treasury's Barker Review, which said 140,000 new homes a year were needed in Britain.He said: \"We are working across government, especially with our colleagues at Defra, to create cleaner, safer and greener communities, while protecting and enhancing the environment.\"\"Sustainable communities\" were being promoted without a real understanding of what \"sustainable\" means, the Environmental Audit Committee said.The report said there was far too little attention paid to many environmental issues, including water, even though supplies in parts of the South East are already too low.Conservative local government spokeswoman Caroline Spelman said: \"There is now growing evidence that John Prescott's buildings programme is environmentally unsustainable, leaving a concrete scar across the face of rural England.\"It said issues like energy needs and transport were not properly addressed."}