{"raw_text": "MPs' murder sentence concern\n \n Murder sentences should not be reduced automatically simply because of a guilty plea, says a new MPs' report.\n \n The influential Commons home affairs committee was responding to sentencing guidelines issued this summer. The MPs also call for tougher sentences for crimes committed under the influence of drink or drugs. They say the influence of drugs and alcohol should be introduced as an aggravating factor when judges and magistrates sentence offenders. Committee chairman John Denham said drugs of alcohol were sometimes used as an excuse.\n \n \"The committee believes that these arguments should be rejected by sentencers and that being under their influence should instead be an aggravating factor.\" At present judges, when sentencing murderers to the mandatory life sentence, can reduce the tariff - the minimum term they must serve - if the defendant pleads guilty. But although they are spared the ordeal of a trial many murder victims' relatives are unhappy. In July this year Amanda Champion's killer, James Ford, pleaded guilty to her murder and was jailed for at least 15 years - it would have been longer had he denied the charge.\n \n Amanda's uncle, Lewis Champion, told the BBC News website Ford did not deserve any credit for his plea, saying: \"Nothing at all is worth taking five years off a murder sentence.\" MPs criticised Home Secretary David Blunkett last year for introducing last-minute rules allowing reduced sentences for murderers who pleaded guilty.\n \n The measures passed into law virtually unnoticed after Mr Blunkett introduced them at a late stage of the Criminal Justice Bill.\n \n As a result, says the committee, the government may need to re-legislate to \"remove ambiguity\" over how murderers should be sentenced. It is also calling on the senior judge in England and Wales, Lord Woolf, to abandon draft guidelines he proposed in September to reduce sentences of murderers who plead guilty. The committee said the plans had not reflected the \"public disquiet\" expressed over the possibility of significantly reduced prison terms for murderers. Lord Woolf's Sentencing Guidelines Council (SGC) caused further controversy by suggesting a one third discount off sentences for early guilty pleas in all types of crime. As a result murderers who face a 15-year tariff could get five years knocked off if they give themselves up to the police.\n \n Mr Denham believes the SGC should reconsider its proposals to reflect Parliament's wish that murder should be treated as a separate and especially grave category of offence. He said: \"We want to see sentencers advised that in the case of murder, reduction in sentence for a guilty plea should not normally be granted in addition to reductions for other mitigating circumstances.\" But a spokesman for the Home Office defended the proposals. He said: \"By making express provision for murder tariffs in the Criminal Justice Act, Parliament sent a clear signal that it expects murder to be treated differently to other offences. \"We stand by the provisions in the Act that cover guilty plea discounts, which have potential benefits for victims and witnesses of avoiding the trauma of a trial.\"\n \n Shadow home secretary David Davis echoed criticisms of the way Mr Blunkett introduced the murder tariff rules. \"There is genuine concern about potential reductions in murder sentences - such action sends out the wrong signals to violent criminals and completely undermines the government's claim to be tough on crime,\" he said. But Liberal Democrat spokesman Mark Oaten warned the MPs' committee that binding judges too much might look like political interference. \"The danger of having a prescriptive approach is that whilst every murder is awful, it is also different,\" he told BBC News.\n", "llama3.2:1b": "MPs' report calls for tougher sentences for crimes committed under influence of drink or drugs. The influential Commons home affairs committee states that these factors should be considered as aggravating circumstances in sentencing, not reduced automatically due to a guilty plea. MPs also want sentencers advised against reducing sentence for murderers simply because they plead guilty.", "llama3.2:3b": "MPs say murder sentences should not be reduced automatically due to guilty pleas, and call for tougher sentences for crimes committed under the influence of drink or drugs, with the influence being considered an aggravating factor. The committee criticizes the government's introduction of last-minute rules allowing reduced sentences for murderers who pleaded guilty, and calls on the senior judge in England and Wales to abandon proposed draft guidelines that would reduce sentences by up to a third for early guilty pleas.", "gemma2:2b": "An MP report criticizes automatic sentence reductions for guilty pleas in murder cases. They argue that drug and alcohol influence should be an aggravating factor, not a mitigating one. The report criticizes the government's recent rule changes allowing reduced sentences for murderers who plead guilty and calls for a re-legislative approach to clarify sentencing procedures. It also criticizes Lord Woolf's proposed guidelines that could lead to significant sentence reductions for early guilty pleas, urging him to reconsider his proposals.  The report urges the Sentencing Guidelines Council to rethink its recommendations and emphasizes the gravity of murder cases requiring separate and stricter punishments than other offenses. \n", "qwen2.5:0.5b": "MPs believe their proposal for tougher sentences for offenders who plead guilty to crimes involving drugs and alcohol should not be automatically reduced just because they are guilty; instead, such cases should be considered as aggravating factors when sentencing judges and magistrates decide on the sentences of murderers. They suggest that drug use or drinking should now be seen as an additional factor rather than a way to excuse the defendant's guilt.", "qwen2.5:1.5b": "MPs criticized home secretary for allowing murderers who plead guilty to receive reduced sentences in summer and called for stricter punishments including adding drug/alcohol influence as aggravating factors when sentencing.", "qwen2.5:3b": "MPs' report emphasizes that murder sentences should not be automatically reduced for guilty pleas and calls for tougher penalties for crimes influenced by drugs or alcohol. The Commons home affairs committee condemns last-minute rules allowing reduced sentences for murderers who plead guilty introduced by Home Secretary David Blunkett, which they argue do not reflect public sentiment. They also criticize Lord Woolf’s sentencing guidelines council for suggesting a one-third discount off sentences for early guilty pleas in all types of crime. MPs propose removing ambiguity over how murderers should be sentenced and urge Lord Woolf to abandon his plans. Shadow home secretary David Davis criticizes the introduction, while Liberal Democrat spokesman Mark Oaten warns against political interference.", "opencoder:1.5b": "The key ideas and details in the provided text are as follows: \n\n1. Murder sentences should not be reduced automatically simply because of a guilty plea.\n2. The influence of drugs and alcohol should be introduced as an aggravating factor when judges and magistrates sentence offenders.\n3. The increased sentence for murderers who plead guilty is part of a broader issue related to sentencing in the criminal justice system.\n4. There is concern about potential reductions in murder sentences - this action sends out the wrong signals to violent criminals and completely undermines the government's claim to be tough on crime. \n5. The Shadow home secretary David Davis has criticized the way Mr Blunkett introduced the murder tariff rules, but it also calls for a rethinking of the sentencing guidelines system.\n", "smollm:1.7b": "The key ideas and details in this text are:\n\n1. The report by the Commons home affairs committee on sentencing guidelines for murderers.\n2. The criticism of the government's sentencing guidelines, which they say should not be reduced automatically simply because a guilty plea has been given.\n3. The introduction of tougher sentences for crimes committed under the influence of drugs or alcohol.\n4. The MPs' call for stricter sentencing guidelines to include drug-related and alcohol-related aggravations as an additional factor in sentencing murderers.\n5. The criticism that the government's sentencing guidelines are not clear enough, and that they should be more specific about how sentences should be reduced.\n6. The opposition of the Shadow home secretary David Davis to the introduction of murder tariffs in the Criminal Justice Act.\n7. The opposition of Liberal Democrat Mark Oaten to the MPs' committee's report on sentencing guidelines for murderers.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about MPs' murder sentences concerns. Let me read through it carefully.\n\nOkay, the first point says that MPs don't want automatically reducing sentences just because of a guilty plea. That makes sense because maybe the defendant could have done something else instead.\n\nThen there's the Commons home affairs committee responding to sentencing guidelines from this summer. They're calling for more tough sentences on crimes influenced by alcohol or drugs. They mention introducing these as an aggravating factor when sentencing.\n\nThere's some history with Amanda Champion and John Denham, who said drugs of alcohol are used as an excuse. This affects how the judge handles guilty pleas.\n\nThe committee agrees that sentencers should reject such arguments and make them an aggravating factor instead. The court may reduce sentences for those who plead guilty without trial because they're being tried anyway.\n\nThey criticize the Home Secretary for recent rules, saying they were introduced late in the Criminal Justice Bill. This means the government might need to change how they sentence murderers now.\n\nThe committee also says that the existing guidelines are not clear about reducing sentences due to guilt. They want the government to adjust them and avoid ambiguity.\n\nThere's a call from Lord Woolf of the SGC to abandon draft guidelines, possibly cutting sentences by a third for early guilty pleas in various crimes. This could affect anyone facing a harsh sentence.\n\nThe Home Office defended their rules, explaining that reducing sentences is fair to victims and witnesses. They hope this helps reduce pain during trial.\n\nShadow home secretary David Davis said MPs' committee has concerns about reducing sentences being seen as political interference, possibly affecting judges too much.\n\nLiberal Democrat spokesman Mark Oaten warned that strict guidelines might make it seem like the government is controlling crime, which isn't good for public trust in law enforcement.\n\nPutting this all together, I need to capture the main points: MPs don't want automatic reductions, committee focuses on tough sentences and introducing drug influences as factors, there was criticism of recent rules, need for re-legislaton, concerns with draft guidelines, and opposing views. The Home Office is trying to make it fair but faces criticism from the government.\n</think>\n\nMPs' murder sentence concern  \nThe MPs have called for a more nuanced approach to sentencing, emphasizing that reducing sentences automatically based on guilt is problematic.  \n\nThe Commons home affairs committee has responded to summer sentencing guidelines, calling for tougher sentences on crimes influenced by alcohol or drugs and proposing that these should be considered as aggravating factors when determining sentences.  \n\nJohn Denham, chairman of the committee, stated that sentencers should reject such arguments and treat guilty pleas as mitigating circumstances rather than separate issues.  \n\nAmanda Champion's case, involving James Ford, was a key example where a guilty plea led to a longer sentence. The committee criticized Home Secretary David Blunkett for recent rules introduced late in the Criminal Justice Bill.  \n\nThe government may need to re-legislate to remove ambiguity about how murderers should be sentenced, as currently unclear guidelines might create confusion.  \n\nA speech by the Home Office's Home Secretary defended the proposals, noting that making express provision for murder tariffs in the Act reflects Parliament's expectation of treating it separately and heavily.  \n\nShadow home secretary David Davis echoed criticism regarding potential reductions in sentences, while Liberal Democrat spokesman Mark Oaten warned against overreach with strict guidelines. The committee seeks a prescriptive approach to avoid political interference, risking judicial independence.", "tinyllama:1.1b": "In response to sentencing guidelines issued this summer, the influential Commons home affairs committee called for greater emphasis on drug use and alcohol as aggravating factors in murder cases. The MPs' report criticized the Home Office's decision to allow reduction in sentence for guilty pleas in murder cases, stating that it sends out \"unwarranted signals\" about treatment of violent criminals. The committee emphasized the importance of having a fairer and more consistent approach to sentencing for murder victims' relatives, urging the Home Office to reconsider their proposed measures. While some lawmakers criticized the government's decision to introduce guidelines allowing reduced prison terms for murderers who plead guilty, others called for greater emphasis on drug use and alcohol in assessing these cases.", "tinydolphin:1.1b": " To be more specific, the text states:\n\n\"Murder sentences should not be reduced automatically simply because of a guilty plea, says a new MPs' report. The influential Commons home affairs committee was responding to sentencing guidelines issued this summer.\"\n\nThe question is about whether the report concludes that murder sentences cannot or should not be reduced due to guilty pleas. The answer provided above correctly addresses the main issue of the text.", "phi:2.7b": " The Commons home affairs committee has called for tougher sentences for crimes committed under the influence of drugs or alcohol and for these factors to be introduced as aggravating factors in sentencing offenders. MPs believe that being under their influence should instead be an aggravating factor when judges and magistrates sentence offenders, rather than a mitigating factor that can result in reduced prison terms. The committee also criticized Home Secretary David Blunkett for introducing last-minute rules allowing reduced sentences for murderers who plead guilty, stating that this may require re-legislation to remove any ambiguity over how murderers should be sentenced.\n", "orca-mini:3b": " The report states that murder sentences should not be reduced automatically simply because of a guilty plea and calls for tougher sentences for crimes committed under the influence of drugs or alcohol. MPs criticized Home Secretary David Blunkett for introducing last-minute rules allowing reduced sentences for murderers who pleaded guilty, and called on the senior judge in England and Wales to abandon draft guidelines he proposed in September to reduce sentences of murderers who plead guilty. The committee also wants the government to re-legislate to \"remove ambiguity\" over how murderers should be sentenced.", "hermes3:3b": "MPs oppose automatic reduction in murder sentences due to guilty pleas, calling for aggravating factor of drug/alcohol influence when sentencing offenders.", "stablelm-zephyr:3b": "MPs have rejected sentencing guidelines that suggested reducing murder sentences automatically for guilty pleas. The Commons home affairs committee highlighted that drugs and alcohol should be introduced as an aggravating factor when sentencing offenders. They called for tougher sentences for crimes committed under the influence of substances, stating that being under their influence should be considered an aggravating factor instead of a mitigating circumstance. The government may need to re-legislate to remove ambiguity over how murderers should be sentenced.", "chatgpt-4o-latest": "MPs argue that murder sentences should not be automatically reduced for guilty pleas and call for tougher penalties for crimes committed under the influence of drugs or alcohol. The Commons home affairs committee criticizes existing sentencing guidelines and urges that intoxication be considered an aggravating factor. Concerns have been raised over reduced sentences, particularly after James Ford received a 15-year term instead of a longer one for Amanda Champion’s murder. MPs also criticize Home Secretary David Blunkett for introducing last-minute rules allowing sentence reductions for guilty pleas, which passed with little scrutiny. The committee calls for legislative clarification and urges Lord Woolf to abandon proposed guidelines that could significantly reduce murder sentences. While the Home Office defends the provisions, arguing they benefit victims by avoiding trials, critics, including Shadow Home Secretary David Davis, warn that such reductions send the wrong message to criminals. However, Liberal Democrat Mark Oaten cautions against overly rigid sentencing rules, arguing that each murder case is unique.", "stablelm2:1.6b": "A report by influential MPs has sparked concerns about sentencing guidelines for murderers, stating that automatically reducing sentences due to guilty pleas should not occur. The committee urges introducing drug and alcohol influence as an aggravating factor when determining sentencing for offenders. At present, judges can reduce the minimum sentence if a defendant pleads guilty for murder cases but these reductions apply to all mitigating factors. The MPs are calling for stricter sentences for crimes committed under the influence of drugs or alcohol. Last year, Home Secretary David Blunkett introduced rules allowing reduced sentences for murderers who pleaded guilty; however, critics argue that such measures were implemented at late stages in criminal justice bills. In response, the committee called on Lord Woolf to abandon proposed guidelines suggesting a one-third discount off sentences for early guilty pleas in all types of crime. The committee suggests that murder should be treated as a separate and especially grave category of offense.", "granite3.1-dense:2b": "An influential UK parliamentary report by the Commons home affairs committee argues against reducing murder sentences automatically due to guilty pleas. The MPs propose that judges and magistrates should consider being under the influence of drugs or alcohol as an aggravating factor, rather than a mitigating one, which could lead to shorter terms. This stance contrasts with current guidelines allowing reduced sentences for murderers who plead guilty. The committee chairman, John Denham, expressed disapproval of using substance use as an excuse and emphasized that offenders should not benefit from it.\n\nThe report criticizes Home Secretary David Blunkett for introducing last-minute rules allowing reduced sentences for guilty murder pleas, which became law unnoticed. The committee suggests the government may need to re-legislate to clarify how murderers should be sentenced and urges Lord Woolf, head of England and Wales' senior judiciary, to reconsider his proposed draft guidelines that could result in significant reductions for early guilty pleas across all crimes.\n\nThe committee's proposal aims to reinforce the public's disapproval of potentially lenient sentences for murderers, treating murder as a unique and severe offense. However, a Home Office spokesperson defended the current provisions in the Criminal Justice Act, stating that Parliament intended to differentiate treatment for murder from other crimes. Shadow home secretary David Davis echoed concerns about potential reductions in murder sentences, arguing such actions would send the wrong signals to violent offenders and undermine the government's claims of being tough on crime.\n\nLiberal Democrat spokesman Mark Oaten warned against imposing overly prescriptive sentencing guidelines, cautioning that while every murder is severe, each case is distinct and should be treated individually.", "reference": "Murder sentences should not be reduced automatically simply because of a guilty plea, says a new MPs' report.MPs criticised Home Secretary David Blunkett last year for introducing last-minute rules allowing reduced sentences for murderers who pleaded guilty.He said: \"We want to see sentencers advised that in the case of murder, reduction in sentence for a guilty plea should not normally be granted in addition to reductions for other mitigating circumstances.\"He said: \"By making express provision for murder tariffs in the Criminal Justice Act, Parliament sent a clear signal that it expects murder to be treated differently to other offences.Amanda's uncle, Lewis Champion, told the BBC News website Ford did not deserve any credit for his plea, saying: \"Nothing at all is worth taking five years off a murder sentence.\"\"There is genuine concern about potential reductions in murder sentences - such action sends out the wrong signals to violent criminals and completely undermines the government's claim to be tough on crime,\" he said.They say the influence of drugs and alcohol should be introduced as an aggravating factor when judges and magistrates sentence offenders.Shadow home secretary David Davis echoed criticisms of the way Mr Blunkett introduced the murder tariff rules.At present judges, when sentencing murderers to the mandatory life sentence, can reduce the tariff - the minimum term they must serve - if the defendant pleads guilty.It is also calling on the senior judge in England and Wales, Lord Woolf, to abandon draft guidelines he proposed in September to reduce sentences of murderers who plead guilty.In July this year Amanda Champion's killer, James Ford, pleaded guilty to her murder and was jailed for at least 15 years - it would have been longer had he denied the charge."}