{"raw_text": "'No-one can define new hunt ban'\n \n The new law banning hunting with dogs is \"so poorly drafted\" no-one can define the offence, pro-hunt MPs say.\n \n The accusation came after it emerged a Devon man had been told he could use his four dogs to \"chase away unwanted animals\" from his farm. Because he did not intend to kill deer or foxes it was not hunting. Lib Dem MP Lembit Opik said ministers had invented a new category of hunting - chasing away - and asked how police were supposed to interpret the rules.\n \n North Devon landowner Giles Bradshaw was put in touch with the Middle Way Group, of which Mr Opik is a co-chairman, after he had been in contact with the rural affairs ministry, Defra. He had asked whether his technique of using his four dogs to frighten off deer and foxes would be outlawed under the Hunting Act. Mr Bradshaw was initially told it was an offence - prompting him to complain. The Middle Way group also said Mr Bradshaw would be put in a position where he would have to buy a rifle to shoot animals that would have previously gone free. In a later conversation Mr Bradshaw was told that according to Defra's lawyers chasing away unwanted animals was \"not in fact hunting as described in the Hunting Act 2004 therefore you would not be committing an offence\".\n \n Mr Opik said: \"Hunting with dogs and flushing are not defined in the Hunting Act. \"Now Defra have also invented a completely new category of hunting - 'chasing away' which isn't even covered by the Act. \"However, all these activities involve the use of dogs to chase wild mammals. \"How is the village bobby who sees a group of people with dogs supposed to distinguish between illegal hunting, exempt hunting, drag hunting, unintentional hunting, a hunt exercising hounds or simply chasing away?\" Tory MP Peter Luff, another co-chairman of Middle Way, said that the legislation was \"so poorly drafted nobody appears able to properly define the offence\".\n \n \"It is no wonder the government desperately wants to move on from this disastrous law. However, I seriously doubt the countryside will be that accommodating.\" Mike Hobday, of the League Against Cruel Sports, said: \"There is no confusion, it is a matter of simple common sense. \"If Mr Bradshaw is setting his dogs to chase wild animals then he is hunting them and that will be a criminal offence. \"If all the dogs are doing is barking at the deer, then nobody can define that as hunting.\"\n", "llama3.2:1b": "A new law banning hunting with dogs in England is being criticized for its poorly drafted nature, with some MPs saying it cannot be defined. A Devon man was told he could use his four dogs to chase away unwanted animals from his farm, but this is not considered an offense under the Hunting Act of 2004. However, experts say that this technique involves \"chasing away\" and is therefore not covered by the law. Critics argue that it will be difficult for police to distinguish between legitimate hunting and simply using dogs to chase wild animals.", "llama3.2:3b": "A new law banning hunting with dogs has been described as \"poorly drafted\" and unclear in its definition of the offense, making it difficult for authorities to distinguish between legal and illegal activities. Pro-hunt MPs argue that the law now includes a category of \"chasing away unwanted animals\", which is not explicitly covered by the act.", "gemma2:2b": "A new law banning hunting with dogs is causing confusion because it lacks clear definitions for what constitutes illegal hunting.  Proponents argue that the act's undefined terms leave enforcement ambiguous and raise concerns about police interpreting the laws correctly.   Critics suggest the legislation is poorly drafted, making it difficult to enforce and resulting in confusion about what activities are legal. \n", "qwen2.5:0.5b": "No-one has defined new hunt ban. The new law banning hunting with dogs is so poorly drafted no-one can define the offence.", "qwen2.5:1.5b": "Debates over new dog-hunting laws in England have sparked accusations of poorly drafted legislation. MPs claim it's impossible to define what constitutes legal or illegal hunting with dogs under the new ban. This has led to confusion among farmers and rural affairs ministers, as some argue their practices fall outside existing definitions. The controversy underscores concerns about how vaguely defined laws can impact everyday activities in a countryside accustomed to specific hunting regulations.", "qwen2.5:3b": "Pro-hunt MPs claim the new law banning hunting with dogs is poorly drafted, unable to define what constitutes an offense. A Devon landowner was told he could use his dogs to chase away unwanted animals without breaking the law, but this interpretation contradicted earlier information from DEFRA lawyers who said it would be considered chasing away and not illegal hunting under the Hunting Act 2004. Proponents argue the legislation is so poorly drafted that no one can define what constitutes an offense, leading Tory MP Peter Luff to say nobody appears able to properly define the offence. Mike Hobday from the League Against Cruel Sports disputes these interpretations, stating it's a matter of simple common sense; chasing wild animals with dogs is hunting and illegal.", "opencoder:1.5b": "The text provides extensive information about the law banning hunting with dogs, but it does not explicitly state or explain any of the key details required for a concise and simple summary.\n\nIn general, the idea here is to summarize the main topic. The text presupposes that a person can \"define\" something if there's some way they can demonstrate that definition accurately reflects what the thing is intended to represent. However, it does not provide any information or detail on the purpose of the law, its scope, or its effectiveness in regulating hunting with dogs.\n", "smollm:1.7b": "The new law banning hunting with dogs is poorly drafted because it does not clearly define what constitutes \"hunting\" under the Hunting Act 2004. The key idea of the text is to summarize the main points and ideas without including any additional information or explanations. This summary should preserve the original meaning and tone of the text, while omitting any supporting details or analysis.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about the new hunt ban in England. The user provided a detailed passage, but they want only the summary without any explanations or formatting.\n\nFirst, I'll read through each paragraph carefully to identify key points. The main issue is a new law banning hunting with dogs. Pro-hunt MPs are concerned because it's so poorly drafted that no one can define the offense, which could lead to confusion and enforcement problems.\n\nThen, the story shows how the law was introduced after someone told a Devon man he could use his four dogs to chase away unwanted animals. This wasn't hunting as intended, so the villagers were initially confused and complaining about the law's unclear rules. The middle way group tried to help by connecting with local authorities but faced legal challenges.\n\nThere are two main parties involved: pro-hunt MPs who called it poorly drafted and introduced a new category of hunting 'chasing away' which isn't covered in the act. Another MP, Lembit Opik, questioned why police were supposed to interpret such rules. The village bobby wanted them exempt from legal issues but also set up groups like drag hunting or hunting with hounds.\n\nTory MP Peter Luff criticized the bill for not properly defining the offense and the potential confusion it could cause. Mike Hobday said it's a simple matter of common sense—chasing wild animals is hunting, so it should be criminal.\n\nPutting this all together, I need to condense these points into a clear summary that captures both the issue and the underlying dynamics.\n</think>\n\nThe new hunt ban in England has sparked confusion due to a poorly drafted law, with pro-hunt MPs accusing it of causing trouble. A Devon man was told he could use four dogs to chase away unwanted animals from his farm, but this wasn't considered hunting. The Middle Way group tried to help by connecting with local authorities but faced legal challenges. Pro-hunt MPs questioned why police were supposed to interpret the rules and called for an exemption. Another MP, Lembit Opik, argued that hunting with dogs was not defined in the law. Tory MP Peter Luff criticized the bill, calling it poorly drafted and confusing. Mike Hobday supported his view, stating it's a matter of common sense, explaining why the law might cause confusion.", "tinyllama:1.1b": "The new law banning hunting with dogs is incomprehensibly poorly drafted, leaving unclear whether it's being defined as a crime or not. MPs have expressed doubt over whether certain hunt activities such as \"chaasing away\" or \"flushing\" would fall under the Hunting Act. The Midlde Way group and Torpy MP Peter Luff both voiced concerns that the legislation was so poorly written they were unable to properly define the offence. Although the government aims to move on from this law, it is still unclear how the countryside will react to its unconventional definition of \"hunting\".", "tinydolphin:1.1b": " The Hunting Act of 2004 has created confusion in the field of animal welfare and hunting laws, as Defra has recently added new categories to the definition of hunting. In response, Lib Dem MP Lembit Opik questions how police will interpret the rules. North Devon landowner Giles Bradshaw was put in touch with the Middle Way Group after he had been in contact with Defra regarding the use of four dogs for \"chasing away\" animals. Mr Opik questions whether this activity falls under the definition of hunting and how police can distinguish between different types of hunting activities.", "phi:2.7b": " The new law banning hunting with dogs is poorly drafted. This leads to confusion about what constitutes hunting or chasing away unwanted animals. This has left landowners like Giles Bradshaw uncertain about their rights and has prompted a debate in Parliament. The government has been accused of inventing a new category of hunting that is not covered by the Hunting Act. The League Against Cruel Sports argues that if someone is setting dogs to chase wild animals, it is considered hunting and is illegal.\n", "orca-mini:3b": " The text discusses a new law banning hunting with dogs and how it is poorly drafted, resulting in confusion for police and landowners. MPs from the pro-hunt party say this new category of hunting is not covered by the law and lacks clear definition. The text also mentions a Devon man who was told he could use his dogs to \"chase away unwanted animals\" from his farm as he did not intend to kill deer or foxes. The Middle Way Group, led by Lembit Opik, says the government invented a new category of hunting called \"chasing away,\" which is not covered by the existing law. Mr Bradshaw was told that according to Defra's lawyers, chasing away unwanted animals is not considered hunting as described in the Hunting Act 2004, so he would not be committing an offense. The text ends with the suggestion that the government should move on from the flawed law and the League Against Cruel Sports expressing concern over the lack of clarity in the law.", "hermes3:3b": "New hunting with dogs ban poorly drafted, causing undefined offense; pro-hunt MPs argue government invented new 'chasing away' category, making police interpretation unclear.", "stablelm-zephyr:3b": "A new law banning hunting with dogs is criticized by pro-hunt MPs, claiming it's poorly drafted and confusing, as it's difficult to define the offence. A Devon man was initially told his four dog method of \"chasing away unwanted animals\" from his farm would be outlawed but later clarified that it wasn't considered hunting under the Hunting Act 2004. Lib Dem MP Lembit Opik argues the new law creates a confusing category of hunting, while Tory MP Peter Luff adds that the legislation is poorly drafted and cannot be properly defined.", "chatgpt-4o-latest": "Pro-hunt MPs argue that the new hunting ban is poorly drafted and lacks clear definitions, making it difficult to enforce. A Devon farmer, Giles Bradshaw, was initially told his practice of using dogs to chase away deer and foxes was illegal but later informed by Defra that it was not considered hunting under the Hunting Act 2004. Lib Dem MP Lembit Opik criticized the law for creating a vague new category of \"chasing away\" and questioned how police could distinguish between different forms of hunting. Tory MP Peter Luff also condemned the legislation as unclear. Meanwhile, the League Against Cruel Sports insisted there was no confusion, stating that if dogs are set to chase wild animals, it constitutes hunting and is illegal.", "stablelm2:1.6b": "A new law banning hunting with dogs is poorly drafted, according to pro-hunt MPs, making it impossible for anyone to define the offense. This is evident from a case in Devon where a landowner was told he could use his four dogs to chase away unwanted animals without intending to kill deer or foxes. The MPs have accused ministers of inventing a new category of hunting and asked how police are supposed to interpret the rules. North Devon owner Giles Bradshaw has been put in contact with the Middle Way Group, which is associated with Lembit Opik as a co-chairman, after he asked whether his dog's technique would outlaw under the Hunting Act. He was initially told it was an offense, leading him to complain. Later, he was informed that chasing away unwanted animals, according to Defra's lawyers, \"is not in fact hunting as described in the Hunting Act.\" All these activities involve using dogs to chase wild mammals without killing them. Tory MP Peter Luff and Mike Hobday of the League Against Cruel Sports also agree with this view, with Hobstead saying that there is no confusion about what constitutes a hunt.", "granite3.1-dense:2b": "Pro-hunt MPs argue that the new law banning hunting with dogs is poorly drafted and indefinable, causing confusion among law enforcement. A Devon landowner, Giles Bradshaw, sought clarification from Defra regarding his use of four dogs to chase away deer and foxes from his farm, which he did not intend to kill. Initially, Defra's rural affairs ministry deemed this activity an offence under the Hunting Act 2004. However, after further communication with Middle Way Group co-chairmen Lembit Opik and Peter Luff, it was revealed that chasing away unwanted animals is not explicitly covered by the act. This ambiguity has left police uncertain about how to interpret and enforce the law, exacerbating tensions between pro-hunt and anti-hunt groups. The League Against Cruel Sports maintains that if dogs are used to chase wild animals, it constitutes hunting, a criminal offence.", "reference": "Mr Opik said: \"Hunting with dogs and flushing are not defined in the Hunting Act.In a later conversation Mr Bradshaw was told that according to Defra's lawyers chasing away unwanted animals was \"not in fact hunting as described in the Hunting Act 2004 therefore you would not be committing an offence\".\"If Mr Bradshaw is setting his dogs to chase wild animals then he is hunting them and that will be a criminal offence.\"How is the village bobby who sees a group of people with dogs supposed to distinguish between illegal hunting, exempt hunting, drag hunting, unintentional hunting, a hunt exercising hounds or simply chasing away?\"\"If all the dogs are doing is barking at the deer, then nobody can define that as hunting.\"The new law banning hunting with dogs is \"so poorly drafted\" no-one can define the offence, pro-hunt MPs say.He had asked whether his technique of using his four dogs to frighten off deer and foxes would be outlawed under the Hunting Act.Because he did not intend to kill deer or foxes it was not hunting."}