{"raw_text": "Faith schools citizenship warning\n \n Schools must improve the quality of citizenship lessons - or social cohesion and democracy will suffer, says the education watchdog.\n \n Independent faith schools were singled out by Ofsted chief, David Bell, for not doing enough to promote the \"wider tenets of British society\". Mr Bell said Muslim, Jewish and Evangelical Christian schools must be \"intolerant of intolerance\". Diversity \"certainly must not mean segregated or separate\", he said. Mr Bell's speech called for a much greater effort in all types of schools to teach citizenship - with an accompanying survey showing that young people knew little about politics and had no enthusiasm to find out more.\n \n Badly-taught citizenship lessons have previously been criticised by Mr Bell, and in a speech to the Hansard Society, he warned that it was failing to pass on an understanding of democracy, public service and shared values. He highlighted his particular concern for citizenship in the growing number of independent faith schools - which he said included about 100 Muslim, 100 Evangelical Christian and 50 Jewish schools.\n \n Mr Bell expressed concern about schools which did not teach children enough about a \"common heritage\" and needed to do more to promote principles of mutual tolerance and social inclusion. \"I worry that many young people are being educated in faith-based schools, with little appreciation of their wider responsibilities and obligations to British society,\" said Mr Bell. The Ofsted chief said his forthcoming annual report would make particular reference to Muslim schools. \"Many must adapt their curriculum to ensure that it provides pupils with a broad general knowledge of public institutions and services in England and helps them to acquire an appreciation of and respect for other cultures in a way that promotes tolerance and harmony.\" Mr Bell said such questions of religion and cultural identity were \"tricky issues\". But he argued that \"we must not allow our recognition of diversity to become apathy in the face of any challenge to our coherence as a nation\". \"I would go further and say that an awareness of our common heritage as British citizens, equal under the law, should enable us to assert with confidence that we are intolerant of intolerance, illiberalism and attitudes and values that demean the place of certain sections of our community, be they women or people living in non-traditional relationships,\" said Mr Bell.\n", "llama3.2:1b": "Faith schools must improve citizenship lessons and promote British society's \"wider tenets\" to prevent social cohesion and democracy from suffering. Ofsted chief David Bell expressed concern that some independent faith schools are not teaching sufficient about shared values and principles of mutual tolerance.", "llama3.2:3b": "Ofsted chief David Bell warned independent faith schools to improve citizenship lessons, saying they must promote \"wider tenets of British society\" and tolerate intolerance. A survey found young people know little about politics and have no enthusiasm for learning more. Bell expressed concern about Muslim, Jewish, and Evangelical Christian schools not teaching children about a common heritage and promoting mutual tolerance.", "gemma2:2b": "Independent faith schools must improve their citizenship lessons to promote British society's values and diversity. Ofsted chief David Bell argues that these schools aren't doing enough to teach students about democracy, public service, and shared values, and needs to incorporate \"common heritage\" into the curriculum. He cites concerns about Muslim, Jewish, and Evangelical Christian schools in particular, urging them to adapt their curriculums for wider knowledge of British society and respect for different cultures. \n", "qwen2.5:0.5b": "Schools must improve citizenship lessons. Independent faith schools were singled out by Ofsted chief David Bell as not promoting \"wider tenets of British society\". He called for more efforts in all types of schools to teach citizenship, with an accompanying survey showing young people knew little about politics and needed more information on shared values. Mr Bell expressed concern about schools that did not teach enough about a common heritage and the need for more promotion of principles of mutual tolerance and social inclusion.", "qwen2.5:1.5b": "Independent faith schools face warnings from education watchdog about inadequate citizenship lessons promoting intolerance, lacking understanding of democracy, public service, and shared values among young people.", "qwen2.5:3b": "Schools must improve citizenship lessons to prevent social cohesion and democracy decline, warns Ofsted chief David Bell. He criticized independent faith schools for not promoting British society's wider aspects, urging all types of schools to teach more about politics and shared values. Bell highlighted his concern over poorly-taught citizenship in growing numbers of independent faith schools, including Muslim, Evangelical Christian, and Jewish schools. He stressed the need for teaching a common heritage, mutual tolerance, and social inclusion, and warned that young people are often unaware of their responsibilities to British society. Bell argued that acknowledging diversity does not mean segregation but instead should promote understanding and respect for other cultures, asserting intolerance towards attitudes demeaning certain communities.", "opencoder:1.5b": "The text discusses the importance of improving the quality of citizenship lessons in schools to promote social cohesion and democracy while addressing concerns about diversity and inclusivity. It also highlights the need for respectful practices in faith-based schools, emphasizing the role of tolerance and understanding shared values. The key point is not only about passing on knowledge but also about ensuring fairness and equality across a diverse range of communities.\n", "smollm:1.7b": "The summary is concise and focuses on key ideas:\n\n1. The importance of teaching citizenship in schools to promote social cohesion and democracy.\n2. The criticism that many independent faith schools do not teach citizenship well, which can lead to a lack of understanding of democratic values and principles.\n3. The concern about the education system failing to provide students with a broad general knowledge of public institutions and services in England.\n4. The need for schools to promote tolerance and harmony among different religious and cultural groups.\n5. The importance of promoting an appreciation of and respect for other cultures, including those that are not Christian or Muslim.\n6. The criticism that some independent faith schools do not teach citizenship well, which can lead to a lack of understanding of democratic values and principles.\n7. The need for schools to promote social cohesion and democracy in the face of increasing diversity and religious differences.", "deepseek-r1:1.5b": "<think>\nAlright, let me break down how I approached this task. The user provided a detailed text about Faith schools and Ofsted's concerns, specifically regarding citizenship lessons and their impact on social cohesion and democracy. They wanted a concise summary that preserved key ideas and details.\n\nFirst, I read through the entire text to understand the main points. It seems like Ofsted is concerned with the quality of citizenship education, particularly in independent faith schools. They've single out these schools as a group by principal David Bell, who has strict guidelines against tolerance. He mentions issues like segregation and intolerance towards different faith communities.\n\nI need to summarize the key elements: Ofsted's stance on faith schools not teaching citizenship well, Bell's comments about tolerance being a double-edged sword, the criticism of badly-taught lessons, the importance of mutual respect in education, the focus on religion and culture, Bell's emphasis on not allowing apathy when dealing with diverse communities, and Mr. Bell's final thoughts on understanding British society.\n\nI had to ensure that each main point was clearly highlighted without unnecessary details. I wanted the summary to be concise yet comprehensive, capturing both the specific issues with faith schools and Bell's broader vision of education principles. \n\nFinally, I made sure there were no explanations or formatting, just plain text summarizing everything as per the user's instructions.\n</think>\n\nOfsted heads call for better citizenship in faith schools  \nIndependent faith schools were single-lined by Ofsted’s chief, David Bell. He called them \"intolerant of intolerance,\" urging a greater effort to teach mutual respect and tolerance across all school types. He warned about failing to educate young people on democracy, public service, and shared values. Bell emphasized the need for faith-based schools to include a diverse curriculum that fosters understanding of public institutions and services, and he stressed that coherence is vital in national identity despite cultural differences. He also criticized his approach for ignoring the common heritage of British citizens while acknowledging the risks if tolerance is not exercised with care.", "tinyllama:1.1b": "The Education Watchdog has issued a warning about the quality of citizenship lessons in independent faith schools. In his speech to the Hansard Society, David Bell called for greater efforts in all types of schools to teach citizenship as an integral part of pupils' education. He warned that without better citizenship instruction, social cohesion and democratic values are at risk in British society. Independent faith schools were singled out by Ofsted chief David Bell as \"intoleraent of intoleraent\", with the chairman expressing his particular concern for citizenship lessons in these institutions. The Education Watchdog has called for more attention to be paid to promoting shared values and principles, particularly among Muslim, Jewish and Evaungelical Christian schools.", "tinydolphin:1.1b": " Faith schools have a responsibility to improve the quality of citizenship lessons, according to Ofsted's chief David Bell. The education watchdog says it is essential that independent faith schools do more to promote \"wider tenets of British society\". This requires tackling issues such as democracy, politics and public service knowledge, he suggests. \n\nIndependent faith schools are singled out by Ofsted's chief for not doing enough to promote these values. Mr Bell cites the importance of promoting tolerance and understanding among young people in his speech to the Hansard Society. He warns that failing to teach citizenship well can lead to a lack of enthusiasm for finding out more about politics, public service and shared values. \n\nBadly-taught citizenship lessons have been criticised by Ofsted before. The organization warns that it is failing to pass on an understanding of democracy, public service, and shared values in independent faith schools. In a recent speech to the Hansard Society, Mr Bell has urged these schools to do more to promote these values. He believes that they should be teaching children about their wider responsibilities and obligations to British society. \n\nMr Bell emphasizes that many young people are being educated in faith-based schools with little appreciation of their wider heritage. This, he argues, is a significant issue for the future of the United Kingdom as a whole. The education watchdog suggests that it would be good if more attention was given to these schools in the upcoming annual report from Ofsted. \n\nIn conclusion, faith schools are expected to improve their citizenship lessons by promoting democracy, politics and public service knowledge among their pupils. This must include an emphasis on a common heritage and mutual tolerance. The education watchdog urges these schools to be more proactive in teaching about British society in order to promote understanding and respect for other cultures.", "phi:2.7b": " The education watchdog, Ofsted, has called for schools, including independent faith schools, to improve the quality of citizenship lessons. The watchdog's chief, David Bell, argued that teaching about democracy and shared values was essential. He expressed concern about schools that did not teach children enough about a \"common heritage\" and urged Muslim, Jewish, and Evangelical Christian schools in particular to be intolerant of intolerance. Mr Bell also called for more education on these topics in all types of schools.\n", "orca-mini:3b": " The text discusses the need for schools, including those belonging to specific faiths, to improve their citizenship lessons to promote social cohesion and democracy. This is because Ofsted chief David Bell worries that poorly taught citizenship lessons are failing to pass on an understanding of democracy, public service and shared values. He singles out independent faith schools, especially Muslim, Jewish, and Evangelical Christian ones, for not doing enough to promote tolerance and mutual respect. Mr Bell calls for a much greater effort in all types of schools to teach citizenship, arguing that an appreciation of British culture and values is essential for young people to understand their responsibilities as citizens. He also expresses concern about schools that do not teach pupils enough about their wider responsibilities and obligations to British society.", "hermes3:3b": "Faith schools warned about citizenship quality; Ofsted calls for better teaching of democracy, mutual tolerance, shared values, and broader knowledge to promote social cohesion.", "stablelm-zephyr:3b": "Ofsted chief David Bell warns that independent faith schools must improve citizenship lessons to promote social cohesion and democracy. He highlights that young people have limited knowledge about politics and lack enthusiasm to learn more. Bell expresses concern about schools lacking a \"common heritage\" and not teaching principles of mutual tolerance and social inclusion. His upcoming annual report will specifically focus on Muslim schools, urging them to adapt their curriculums to provide pupils with a broad general knowledge of public institutions and services in England while promoting tolerance and harmony.", "chatgpt-4o-latest": "Schools must improve citizenship lessons to support social cohesion and democracy, warns Ofsted chief David Bell. He criticizes independent faith schools, including Muslim, Jewish, and Evangelical Christian institutions, for not sufficiently promoting British societal values. Bell stresses that diversity should not lead to segregation and calls for better education on democracy, public service, and shared values. He expresses concern that faith-based schools may not adequately teach mutual tolerance and social inclusion. His upcoming report will highlight the need for Muslim schools to broaden their curriculum to foster respect for other cultures. Bell insists that recognizing diversity should not lead to apathy and emphasizes the importance of a common British heritage that rejects intolerance and illiberalism.", "stablelm2:1.6b": "The text discusses a warning from education watchdog Ofsted about the quality of citizenship lessons provided by independent faith schools. These schools are criticized for not adequately promoting wider British society and its values, including tolerance and mutual respect. The author highlights concerns that young people in these schools lack knowledge of politics and have little enthusiasm to learn more. They suggest that poorly taught citizenship lessons have previously been criticized by the same author, and encourage greater effort from all types of schools to teach citizenship.", "granite3.1-dense:2b": "Ofsted chief David Bell warns that faith schools, including Muslim, Jewish, and Evangelical Christian institutions, are underperforming in teaching citizenship effectively. He emphasizes the need for these schools to foster mutual tolerance, social inclusion, and an understanding of British society's broader tenets. Bell's concerns stem from a survey showing young people's limited knowledge about politics and a lack of interest in learning more. His upcoming annual report will highlight issues with Muslim faith schools specifically. He argues that neglecting these areas could threaten social cohesion and democracy, as children lack appreciation for their wider responsibilities and obligations to British society. Bell stresses the importance of promoting a common heritage and shared values to counter intolerance and demeaning attitudes towards certain community sections.", "reference": "Mr Bell said Muslim, Jewish and Evangelical Christian schools must be \"intolerant of intolerance\".\"I worry that many young people are being educated in faith-based schools, with little appreciation of their wider responsibilities and obligations to British society,\" said Mr Bell.He highlighted his particular concern for citizenship in the growing number of independent faith schools - which he said included about 100 Muslim, 100 Evangelical Christian and 50 Jewish schools.Mr Bell said such questions of religion and cultural identity were \"tricky issues\".Mr Bell expressed concern about schools which did not teach children enough about a \"common heritage\" and needed to do more to promote principles of mutual tolerance and social inclusion.Independent faith schools were singled out by Ofsted chief, David Bell, for not doing enough to promote the \"wider tenets of British society\"."}