{"raw_text": "Escaped prisoner report ordered\n \n First Minister Jack McConnell has ordered a report on the decision to allow a paranoid schizophrenic knife attacker to go on a visit unguarded.\n \n Michael Ferguson, 36, escaped after being allowed out of the high-security Carstairs unit. The SNP's Nicola Sturgeon has demanded to know who was responsible for signing off the leave. The Scottish Executive said ministers would be notified but it would \"not be common practice\" to sign approval. An executive spokesman said the health department and the state hospital itself would work together on preparing the report. Ministerial responsibility for Carstairs rests with Rhona Brankin, the deputy health minister. Ms Brankin said: \"The first minister has called for a review of what has happened, we need to talk to the state hospital and we need to reflect on this.\" Ms Sturgeon has written to Mr McConnell asking for clarification on the move to allow the prisoner out. She said questions must be answered about his escape, if the public is to be reassured about safety. Police are still searching for Ferguson, who failed to return after a trip to East Kilbride on Monday.\n \n The Scottish National Party's parliamentary leader argued that under the law, authorisation of Ferguson's leave of absence would have come directly from ministers. She said: \"The Scottish Executive seemed to indicate yesterday that the escape of Mr Ferguson was a matter for Carstairs. \"However, my understanding is that, under the mental health legislation, the decision to grant this patient - and any restricted patient - leave of absence, would have required direct and specific authorisation by Scottish ministers.\" She added: \"I have written to the first minister today asking for confirmation of that fact. I have also asked him to confirm which minister would routinely take decisions of this nature and what information they are based on. \"This is not an attempt to apportion blame, but to ensure a better understanding of the decision making process in such important and sensitive cases.\"\n \n Police said Ferguson posed a danger to the public. BBC Scotland political correspondent Glenn Campbell said the first minister had ordered an urgent report into the situation. He said: \"We understand from the executive that in this case no individual minister signed off the approval for Michael Ferguson to be released unescorted from Carstairs. \"The executive concedes that it is up to Scottish ministers, they have a legal responsibility for approving this sort of leave, but they say routinely it is specialised officials that make that decision and simply inform ministers that they have taken it. \"But at that stage presumably ministers can ask hard questions and can ask for reassurances that the patient is not a serious danger to the public or that any risk has been minimised.\" Scottish Conservative leader, David McLetchie, said earlier it was \"almost beyond belief that this has been allowed to happen\".\n \n The executive spokeswoman said the recommendation for leave was agreed by a psychiatric advisor \"in conjunction with officials on behalf of ministers\". She said: \"Ministers were told of that, notified of it, but it would not be common practice for them to sign it off. \"They do have statutory responsibility, but the common practice has been that people who work with the patient and have the best knowledge about risk would make that decision.\" Ferguson, who slashed a man in a doctors' surgery in Coatbridge in 1994, had been out to see his fianc&#233;e Annabella Holmes, 47, whom he met when she was a patient at the high security complex in South Lanarkshire. He is described as being 5ft 9ins tall, slim, with blond hair, blue eyes and a fair complexion. Ferguson was wearing a black jacket, grey jeans, black jumper and black shoes when he was last seen. He has multiple fading tattoos on his left hand and a very faded tear tattoo under his left eye. Ms Holmes is not missing but there have been no sightings of Ferguson since Monday. Strathclyde Police asked anyone who spots Ferguson to contact Sergeant Keith McDonald on\n \n .\n", "llama3.2:1b": "Here is a concise summary of the text:\n\nMichael Ferguson, 36, escaped from the high-security Carstairs unit in Glasgow after being allowed out without supervision. His escape was ordered by First Minister Jack McConnell's report, which has been requested by Nicola Sturgeon and other ministers. Ferguson had recently visited his fiancée Annabella Holmes, who is also a patient at the same facility. The Scottish Executive says that ministers would have approved Ferguson's leave of absence due to his mental health status, but not because he was a \"serious danger\" to the public.\n\nThe report will examine what happened and identify those responsible for approving Ferguson's escape. Police are searching for him after it was discovered that he had been released unguarded.", "llama3.2:3b": "First Minister Jack McConnell ordered a report on the decision to allow a paranoid schizophrenic knife attacker, Michael Ferguson, to go on a visit unguarded. The escape led to demands for accountability from SNP leader Nicola Sturgeon and criticism from Scottish Conservative leader David McLetchie. A psychiatric advisor's recommendation was made in conjunction with officials, but it is unclear who signed off the approval for Ferguson's leave of absence. Police are still searching for Ferguson, who poses a danger to the public.", "gemma2:2b": "Michael Ferguson, a paranoid schizophrenic with a history of violence, escaped from Carstairs high-security prison and remains at large. First Minister Jack McConnell ordered a report on the decision to allow his unescorted leave from prison. The Scottish Executive acknowledges that ministers have legal responsibility for approving such releases but generally rely on specialist officials to make this decision after consulting with them. Nicola Sturgeon has demanded clarification on the process, seeking confirmation of who authorized the release and what information informed the decision. Police are searching for Ferguson, who poses a potential danger to public safety. \n", "qwen2.5:0.5b": "First Minister Jack McConnell ordered a report on the decision to allow a paranoid schizophrenic knife attacker (Michael Ferguson) to go on a visit unguarded. The SNP's Nicola Sturgeon demanded information about the responsible party, the state hospital and the health department. Police are searching for Ferguson, who failed to return after visiting Carstairs on Monday. Mr. Ferguson posed a danger to the public, while the executive said regularly specialist officials make decisions in cases like this.", "qwen2.5:1.5b": "First Minister Jack McConnell ordered an investigation into allowing a paranoid schizophrenic knife attacker, Michael Ferguson, to visit Carstairs unit unescorted due to his mental instability, leading Nicola Sturgeon demanding clarification about the decision. Ferguson escaped from Carstairs, slashing a doctor in 1994, and was seen wearing black jacket, jeans, jumper, and shoes after visiting fiancée Annabella Holmes. Police are searching for him, posing a threat to public safety.", "qwen2.5:3b": "First Minister Jack McConnell ordered an inquiry into allowing Michael Ferguson, a paranoid schizophrenic knife attacker with a history of violence, unescorted visits from the Carstairs unit in Scotland's security system. Nicola Sturgeon demanded accountability, arguing that authorisation should have come directly from ministers under mental health legislation. Rhona Brankin noted the first minister was calling for a review and said they would work together with the state hospital to prepare the report. The Scottish National Party’s parliamentary leader highlighted this was not common practice, as the decision likely required direct authorization by ministers. Ferguson escaped on a visit unescorted and is still at large, prompting renewed scrutiny of security measures. Police believe he posed a danger but are searching for him, while David McLetchie from the Scottish Conservative party criticized the incident as \"almost beyond belief.\"", "opencoder:1.5b": "Escaped prisoner report ordered.\n\nFirst Minister Jack McConnell has ordered a report on the decision to allow a paranoid schizophrenic knife attacker to go on a visit unguarded. \n\nMichael Ferguson, 36, escaped after being allowed out of the high-security Carstairs unit. The SNP's Nicola Sturgeon has demanded to know who was responsible for signing off the leave.\n\nThe Scottish Executive said ministers would be notified but it would \"not be common practice\" to sign approval. An executive spokesman said the health department and the state hospital itself would work together on preparing the report. Ministerial responsibility for Carstairs rests with Rhona Brankin, the deputy health minister.\n\nMs Brankin said: \"The first minister has called for a review of what has happened, we need to talk to the state hospital and we need to reflect on this.\" Ms Sturgeon has written to Mr McConnell asking for clarification on the move to allow the prisoner out. She said questions must be answered about his escape, if the public is to be reassured about safety.\n\nPolice are still searching for Ferguson, who failed to return after a trip to East Kilbride on Monday. \n\nThe Scottish National Party's parliamentary leader argued that under the law, authorisation of Ferguson's leave of absence would have come directly from ministers. She said: \"The Scottish Executive seemed to indicate yesterday that the escape of Mr Ferguson was a matter for Carstairs. However, my understanding is that, under the mental health legislation, the decision to grant this patient - and any restricted patient - leave of absence, would have required direct and specific authorisation by Scottish ministers.\" She added: \"I have written to the first minister today asking for confirmation of that fact. I have also asked him to confirm which minister would routinely take decisions of this nature and what information they are based on. This is not an attempt to apportion blame, but to ensure a better understanding of the decision making process in such important and sensitive cases.\"\n\nThe executive concedes that it is up to Scottish ministers, they have a legal responsibility for approving this sort of leave, but they say routinely it is specialised officials that make that decision and simply inform ministers that they have taken it. \"But at that stage presumably ministers can ask hard questions and can ask for reassurances that the patient is not a serious danger to the public or that any risk has been minimised.\" \n\nScottish Conservative leader, David McLetchie, said earlier it was \"almost beyond belief that this has been allowed to happen\". The executive spokeswoman said the recommendation for leave was agreed by a psychiatric advisor \"in conjunction with officials on behalf of ministers\". She said: \"Ministers were told of that, notified of it, but it would not be common practice for them to sign it off. \"They do have statutory responsibility, but the common practice has been that people who work with the patient and have the best knowledge about risk would make that decision.\" \n\nFerguson, who slashed a man in a doctors' surgery in Coatbridge in 1994, had been out to see his fianc&#233;e Annabella Holmes, 47, whom he met when she was a patient at the high security complex in South Lanarkshire. He is described as being 5ft 9ins tall, slim, with blond hair, blue eyes and a fair complexion. \n\nFerguson has multiple fading tattoos on his left hand and a very faded tear tattoo under his left eye. Ms Holmes is not missing but there have been no sightings of Ferguson since Monday. Strathclyde Police asked anyone who spots Ferguson to contact Sergeant Keith McDonald on . \n", "smollm:1.7b": "The summary should be:\n\nEscaped after being allowed out of the high-security Carstairs unit. Michael Ferguson, 36, escaped after being allowed out of the high-security Carstairs unit. The SNP's Nicola Sturgeon has demanded to know who was responsible for signing off the leave. The Scottish Executive said ministers would be notified but it would \"not be common practice\" to sign approval. An executive spokesman said the health department and the state hospital themselves would work together on preparing the report. Ministerial responsibility for Carstairs rests with Rhona Brankin, the deputy health minister. Ms Sturgeon has written to Mr McConnell asking for confirmation of that fact. She also asked him to confirm which minister would routinely take decisions of this nature and what information they are based on. This is not an attempt to apportion blame, but to ensure a better understanding of the decision making process in such important and sensitive cases. Police said Ferguson posed a danger to the public. BBC Scotland political correspondent Glenn Campbell said the first minister had ordered an urgent report into the situation. He said: \"We understand from the executive that in this case no individual minister signed off the approval for Michael Ferguson to be released unescorted from Carstairs. But at that stage, presumably ministers could ask hard questions and can ask for reassurances that the patient is not a serious danger to the public or that any risk has been minimized.\" Scottish Conservative leader David McLetchie said earlier it was \"almost beyond belief\" that this has been allowed to happen.\n", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text concisely while preserving the key ideas and details. Let me read through it carefully first.\n\nThe first part is about a prisoner being allowed out after a visit, ordered by the First Minister. It mentions Michael Ferguson's escape, the SNP wanting to know who signed off the leave, the Scottish Executive not authorizing it all the time, and some officials discussing how to address this decision-making process.\n\nThen there are two opposing groups: one from the Scottish National Party arguing that ministerial responsibility should lie with ministers directly approving leave, while another group is skeptical, questioning if such authority is direct or indirect. They also mention that police have concerns about public safety regarding Ferguson's actions.\n\nThe executive's statement supports their earlier view but points out that ministers might ask questions and seek reassurance from officials who assess risk.\n\nFinally, there are quotes from the First Minister and another leader discussing the implications of this decision, with some speculation about whether it's within a reasonable timeframe or not.\n\nI need to make sure I capture all these elements: the decision made, why it was made, who is involved (ministers, police), expert opinions, and the broader context of public safety. Also, ensure that the summary doesn't include any explanations beyond what's needed.\n\nLet me structure this into a concise summary without any extra words or formatting.\n</think>\n\nThe Scottish Government has ordered a decision on allowing Michael Ferguson, a paranoid schizophrenic knife attacker, for an unguarded visit. First Minister Jack McConnell has requested a review of this decision, which involves the SNP demanding clarity on the authorizing this leave and concerns about public safety. The Scottish Executive is not the sole authority, with the SNP arguing that ministerial responsibility should lie with ministers granting such leave directly. While the executive's view is that ministers often involve officials in assessing risk before deciding to authorize, there is skepticism among some experts who question if the decision is direct or indirect. Police have noted Ferguson’s potential danger and have asked help from Strathclyde Police to report any sightings. The discussion highlights a complex issue of public safety and authority, with mixed opinions on how this decision impacts the timeline and nature of such cases.", "tinyllama:1.1b": "The Scottish National Party's parliamentary leader, Glen Campbell, has called for an urgent review into the decision-making process in cases where individuals escape from high-security facilities like Carstairs. The SNP's Nicola Sturgeon has demanded to know who was responsible for signing off Michael Ferguson's leave of absence and asked whether ministerial responsibility for the move lies with Rhona Brankin, deputy health minister. An executive spokeman wrote to Sturgeon asking for clarification on the decision to allow the prisoner to go on a visit without prior approval from ministers. The first minister has written to MSPs seeking more information on Ferguson's escape and whether under the law, authorisation of his leave was granted directly by ministers or via Carstairs. The Scottish Executive secretary indicated that Ferguson's leave was approved by a psychiatric adviser but advised officials notified by him to inform ministers before granting permission. The SNP leader said it was \"almost beyond belief\" that Ferguson has escaped from the high-security facility and called for an urgent review into the situation. Ministerial responsibility lies with Rhona Brankin, deputy health minister, according to an executive speaker. BBC Scotland political correspondent Glen Campbell reportedly asked whether routine officials are held accountable for approving such leave of absence or it's the responsibility of Scottish ministers. The Scottish Conservative leader, David McLean, criticized the \"common practice\" of allowing prisoners to leave facilities without prior authorization by ministers, calling for a review into the matter. Ferguson is suspected of being involved in multiple attacks on his way out of the Carstairs unit and was caught after escaping from the facility on Monday.", "tinydolphin:1.1b": " Carstairs visitor report ordered by First Minister Jack McConnell under new guidelines from the Scottish Executive, with decisions made by specialized officials. The decision to release Michael Ferguson unguarded without formal authorisation came after the incident in East Kilbride. Michael Ferguson was escaping Carstairs voluntarily when he failed to return and was later caught by police.", "phi:2.7b": " In response to the incident with paranoid schizophrenic killer Michael Ferguson, First Minister Jack McConnell has ordered a report on the decision to allow him to go on an unescorted visit. Scottish National Party's parliamentary leader Nicola Sturgeon is demanding to know who was responsible for signing off Ferguson's leave of absence, while police are searching for his whereabouts and Ms. Brankin, the deputy health minister, has said that ministerial responsibility for Carstairs rests with her. Ms. Sturgeon has also written a letter to Mr. McConnell asking for clarification on the move, and she wants to know who signed off on Ferguson's leave of absence and what information they used to make the decision. The Scottish Executive spokesman has said that ministers will be notified but it is not common practice for them to sign such approvals, and an executive-run hospital would work with the state hospital to prepare the report. Michael Ferguson escaped from Carstairs after being allowed out on a visit unescorted, and while police have located his fiancée Annabella Holmes, who was also at Carstairs with him, he is still at large. The public has expressed concerns about safety and Ms. Sturgeon believes that an urgent review of the situation is needed to restore public confidence in the decision-making process for cases like Ferguson's.\n", "orca-mini:3b": " First Minister orders report into prisoner's escape, Michael Ferguson was released unguarded after being allowed out of high-security Carstairs unit. Scottish National Party demands answers from the government. Psychiatric advisor and officials agreed the patient could leave, but it was not routine for ministers to sign off the leave. Scottish Conservatives call for an inquiry into the incident.", "hermes3:3b": "Report ordered on paranoid schizophrenic prisoner's unguarded visit escape", "stablelm-zephyr:3b": "First Minister Jack McConnell ordered a report on allowing a paranoid schizophrenic knife attacker, Michael Ferguson, to visit unguarded. The escape occurred after the health department and state hospital would typically work together on approving the leave. The Scottish Executive mentioned that ministers were notified but it's not common practice for them to sign off approval. Answers are needed on who was responsible, the decision-making process in similar cases, and whether Ferguson posed a public danger. Police continued searching for him.", "chatgpt-4o-latest": "First Minister Jack McConnell has ordered a report on the decision to allow Michael Ferguson, a paranoid schizophrenic knife attacker, to leave the high-security Carstairs unit unguarded. Ferguson escaped after a visit to East Kilbride, prompting SNP's Nicola Sturgeon to demand accountability for the decision. The Scottish Executive stated that while ministers have legal responsibility for such approvals, specialized officials typically make the decisions and inform ministers afterward. Deputy Health Minister Rhona Brankin confirmed a review is underway. Sturgeon has written to McConnell seeking clarification on the approval process. Police have warned that Ferguson poses a danger to the public and are actively searching for him. Ferguson, who was convicted of a knife attack in 1994, was visiting his fiancée when he escaped. Authorities have urged the public to report any sightings.", "stablelm2:1.6b": "First Minister Jack McConnell orders a report on the decision to release mentally ill attacker Michael Ferguson without proper authorization. SNP demands answers from ministers, as police search for Ferguson after he escaped from Carstairs unit. Under mental health legislation, decisions regarding leave must be specifically authorized by Scottish ministers. No individual minister signed off the approval for this case; instead, it was agreed upon by a psychiatric advisor in collaboration with officials on behalf  of ministers. Ministerial responsibility for Carstairs resides with deputy health minister Rhona Brankin. Questions need to be answered about safety and whether the public can be reassured about the situation.", "granite3.1-dense:2b": "First Minister Jack McConnell has ordered a review following the unauthorized visit of paranoid schizophrenic prisoner Michael Ferguson, 36, from high-security Carstairs unit. Ferguson escaped while visiting his fiancée, Annabella Holmes, in East Kilbride on Monday and is still at large. The Scottish Executive stated that ministers were notified but not typically involved in signing off such leave due to the involvement of specialized hospital staff with patient risk knowledge. Nicola Sturgeon, leader of the Scottish National Party, has demanded clarification from McConnell on this decision-making process and its implications for public safety. Ferguson, who previously attacked a man with a knife in 1994, is described as having blond hair, blue eyes, and multiple tattoos. Strathclyde Police have asked the public to report any sightings of Ferguson.", "reference": "The Scottish Executive said ministers would be notified but it would \"not be common practice\" to sign approval.She said: \"The Scottish Executive seemed to indicate yesterday that the escape of Mr Ferguson was a matter for Carstairs.He said: \"We understand from the executive that in this case no individual minister signed off the approval for Michael Ferguson to be released unescorted from Carstairs.Ms Brankin said: \"The first minister has called for a review of what has happened, we need to talk to the state hospital and we need to reflect on this.\"Police said Ferguson posed a danger to the public.She said: \"Ministers were told of that, notified of it, but it would not be common practice for them to sign it off.\"They do have statutory responsibility, but the common practice has been that people who work with the patient and have the best knowledge about risk would make that decision.\"\"The executive concedes that it is up to Scottish ministers, they have a legal responsibility for approving this sort of leave, but they say routinely it is specialised officials that make that decision and simply inform ministers that they have taken it.Scottish Conservative leader, David McLetchie, said earlier it was \"almost beyond belief that this has been allowed to happen\".An executive spokesman said the health department and the state hospital itself would work together on preparing the report.The executive spokeswoman said the recommendation for leave was agreed by a psychiatric advisor \"in conjunction with officials on behalf of ministers\".First Minister Jack McConnell has ordered a report on the decision to allow a paranoid schizophrenic knife attacker to go on a visit unguarded."}