{"raw_text": "Councils 'must find Gypsy sites'\n \n Ministers are telling councils to find more sites for travellers, amid continuing rows concerning a string of unauthorised encampments.\n \n Councils are also to be given stronger powers to move on illegal settlements by Gypsy communities on rural land. More money is to be given to councils to develop official caravan parks, said housing minister Yvette Cooper. In November, MPs urged ministers to make councils create sites because 3,500 travellers have no place to stop. Ms Cooper said an annual scheme to refurbish existing traveller sites would now be extended to consider council bids for new stopping places. That scheme has paid out £25m in four years, with £8m available for 2005.\n \n \"There are two major problems in the planning system at the moment concerning Gypsy and traveller sites,\" said Ms Cooper. \"Firstly, local authorities are not identifying enough appropriate locations either for private or public sites. And secondly, they do not have enough powers to deal swiftly with development on inappropriate sites. \"The result is that there are too many developments on inappropriate sites, causing tensions and difficulties for both the neighbouring communities and the Gypsies and travellers. \"That is why we are consulting on a new obligation on local authorities to identify more appropriate sites, as well as new powers to take immediate action if the development is in the wrong place and cannot be tolerated in even the short-term because of risk to local amenity and the environment.\" Under the new regulations, expected to be in force in the spring, officials will be able to serve \"temporary stop notices\" aimed at preventing works on a site before a council has had chance to obtain a full legal ban. Many MPs with rural constituencies, particularly in eastern England, have been pressing the government to create stronger enforcement powers, saying villagers are suffering because of the legal delays in removing illegal encampments.\n \n Andrew Ryder, of the Traveller Law Reform Coalition, said: \"We welcome talk about an obligation on councils to identify land for Gypsies and travellers, so long as it is a real obligation as opposed to a recommendation which could be and was easily ignored. \"New accommodation proposals for travellers need to be backed up with decent funding and intervention by the government when councils attempt to dodge their responsibilities towards travellers, as they often do. \"Living on the side of the road or being worn down by planning appeals, legal action and eviction is no one's idea of fun.\" In their November report, MPs from the committee scrutinising the Office for the Deputy Prime Minister, responsible for housing, said most illegal traveller encampments were caused by a lack of places to stop. Numerous communities and councils were paying for lengthy and expensive evictions against travelling communities, said the MPs. In turn, the problems had worsened because councils were reluctant to voluntarily provide sites because of resistance from residents. Two of the most controversial traveller sites - Cottenham in Cambridgeshire and Minety in Wiltshire - remain embroiled in an ongoing legal battle.\n", "llama3.2:1b": "Councils are being asked to find more sites for Gypsy travelers, with stronger powers given to move on illegal settlements and more funding provided for official caravan parks. An annual scheme to refurbish existing sites will also be extended to consider council bids for new sites. Local authorities face problems in identifying suitable locations and having enough enforcement powers to deal with development.", "llama3.2:3b": "Ministers are urging councils to find more sites for travellers amid controversy over unauthorised encampments, and will give them stronger powers to move on illegal settlements. The government will also provide more money for official caravan parks and refurbish existing sites.", "gemma2:2b": "Ministers are encouraging councils to find new sites for Gypsy travelers and give them stronger powers to remove illegal encampments.  A new scheme will help fund such projects, and officials will be able to issue \"temporary stop notices\" if unauthorized development continues. \n", "qwen2.5:0.5b": "Councils must find more Gypsy sites for travellers, while councils face legal challenges over illegal encampments on rural land. Stronger powers to move onto illegal settlements are proposed by ministers. Councils will receive extra money to develop official caravan parks and new areas for visitors. MPs urged the government to create more Gypsy and traveller sites using a new obligation. Temporary stop notices for council proposals would allow officials to intervene before developers begin work on land. Councils face challenges in evicting residents, but MPs say they are not being refused funding.", "qwen2.5:1.5b": "Ministers urge councils to find more Gypsy/Trovan sites, with plans for stronger powers, money for new caravans, £25m refurbishment scheme extended. Conflict over encampments continues.", "qwen2.5:3b": "Councils are being told to find more sites for travellers amid rows over unauthorised encampments. Ministers want councils given stronger powers to move illegal settlements, with £8m of funding available for new official caravan parks. Housing minister Yvette Cooper said local authorities must identify more appropriate locations and have enough powers to deal swiftly with inappropriate developments. MPs urged this in November, saying 3,500 travellers have no place to stop. The government is consulting on a new obligation requiring councils to identify suitable sites as well as new enforcement powers to prevent illegal encampments. Critics say many encampments are caused by lack of legal places to stay and that voluntary provision is resisted due to resident opposition.", "opencoder:1.5b": "Councils must find Gypsy sites\n\nMinisters are telling councils to find more sites for travellers amid continuing rows concerning a string of unauthorised encampments.\n\nCouncils also to be given stronger powers to move on illegal settlements by Gypsy communities on rural land. More money is to be given to councils to develop official caravan parks, said housing minister Yvette Cooper.\n\nIn November, MPs urged ministers to make councils create sites because 3,500 travellers have no place to stop. Ms Cooper said an annual scheme to refurbish existing traveller sites would now be extended to consider council bids for new stopping places. That scheme has paid out £25m in four years, with £8m available for 2005.\n\n\"There are two major problems in the planning system at present concerning Gypsy and traveller sites,\" said Ms Cooper. \"Firstly, local authorities are not identifying enough appropriate locations either for private or public sites. And secondly, they do not have enough powers to deal swiftly with development on inappropriate sites.\" The result is that there are too many developments on inappropriate sites, causing tensions and difficulties for both the neighbouring communities and Gypsies and travellers.\n\nThat's why we are consulting on a new obligation on local authorities to identify more appropriate sites, as well as new powers to take immediate action if the development is in the wrong place and cannot be tolerated in due course because of risk to local amenity and the environment. Under the new regulations, expected to be in effect in the spring, officials will be able to serve \"temporary stop notices\" aimed at preventing works on a site before a council has had chance to obtain a full legal ban.\n\nAndrew Ryder, of the Traveller Law Reform Coalition, said: \"We welcome talk about an obligation on councils to identify land for Gypsies and travellers, so long as it is a real obligation as opposed to a recommendation which could be easily ignored. \"New accommodation proposals for travellers need to be backed up with decent funding and intervention by the government when councils attempt to dodge their responsibilities towards travellers, as they often do. \"Living on the side of the road or being worn down by planning appeals, legal action and eviction is no one's idea of fun.\" In their November report, MPs from the committee scrutinising the Office for the Deputy Prime Minister, responsible for housing, said most illegal traveller encampments were caused by a lack of places to stop. Numerous communities and councils were paying for lengthy and expensive evictions against travelling communities, said the MPs. In turn, the problems had worsened because councils were reluctant to voluntarily provide sites because of resistance from residents. Two of the most controversial traveller sites - Cottenham in Cambridgeshire and Minney in Wiltshire - remain embroiled in an ongoing legal battle.\n", "smollm:1.7b": "The summary is concise and objective, capturing the main points of the text without adding or subtracting any information. It includes key ideas such as:\n\n1. Councils are being given stronger powers to move on illegal settlements by Gypsy communities.\n2. More money is to be given to councils to develop official caravan parks.\n3. The government is consulting on a new obligation on local authorities to identify more appropriate sites for Gypsies and travellers.\n4. New powers will be given to officials to take immediate action if the development is in the wrong place and cannot be tolerated in even the short-term because of risk to local amenity and the environment.\n5. The government is welcoming talk about an obligation on councils to identify land for Gypsies and travellers, so long as it is a real obligation as opposed to a recommendation which could be and was easily ignored.\n6. Living on the side of the road or being worn down by planning appeals, legal action and eviction is no one's idea of fun.\n7. Most illegal encampments were caused by a lack of places to stop.\n8. The problems had worsened because councils were reluctant to voluntarily provide sites because of resistance from residents.\n9. Two of the most controversial encampments - Cottenham in Cambridgeshire and Minety in Wiltshire - remain embroiled in an ongoing legal battle.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help the user by summarizing a given text concisely while preserving key ideas and details. The original query provided is quite detailed, so my summary should be a quick, clear version without explanations or extra information.\n\nFirst, I'll read through the text carefully. It talks about councils needing more Gypsy and Traveller sites, especially on rural land. There's mention of Ms Yvette Cooper saying they'd give stronger powers to move illegal settlements and allocate more funds for caravan parks. She also discussed a £25m scheme that's been partially implemented.\n\nI should note the main issues: insufficient locations, lack of power to handle problematic areas, leading to many incorrect developments. The goal is to prevent this by giving councils more sites or stronger powers, including temporary notices and new regulations.\n\nAlso, there are MPs emphasizing the need for these measures because of legal delays in evictions, which makes traveling more frustrating. Specific cases like Tottenham and Cambridge are mentioned as problematic areas.\n\nI'll make sure to include all these points concisely without adding personal opinions or extra details. The summary should flow logically from the main issue to the solutions and their implications.\n</think>\n\n\"Councils are urging the government to increase the number of Gypsy and Traveller sites on rural land, particularly in unauthorised areas. Housing minister Yvette Cooper has proposed stronger powers for councils to move illegal settlements and allocate more funding for caravan parks. She introduced a £25m scheme that's partially implemented but faced criticism for over-saturation with incorrect developments. The government aims to address this by giving councils more locations, stronger power to handle problematic sites, and introducing temporary stop notices. MPs are calling for legal action due to delays in evictions from traveller encampments on rural land, which worsens tensions between communities. Two controversial sites remain in dispute.\"", "tinyllama:1.1b": "Following a series of unauthorized encampments, council leaders have been told to find more sites for travelers amid ongoing disputes concerning the number of unauthorized settlements. In November, MPs called for councils to develop official caravan parks and consider official traveler sites following widespread protests. The housing minister is now proposing an extension of council bid schemes and new powers to force development on unapproved sites while warning that legal delays in removing encampments are causing suffering for villages, particularly in eastern England. In response to the issue, councils will be required to identify more suitable locations for sites and strengthen funding and intervention by the government when they attempt to evade their responsibilities towards travelers.", "tinydolphin:1.1b": " The summary text is: Governments are discussing finding more Gypsy and traveller sites, as there have been numerous unauthorized encampments in rural areas. Councils are encouraged to develop official caravan parks. More money will be given for councils to build or improve existing sites. An external scheme is to consider council bids for new traveler sites. The issue is related to local authorities not identifying and developing appropriate locations, as well as inappropriate development on inappropriate sites causing tensions and difficulties for the communities involved. The government has announced that it will introduce temporary stop notices to prevent works on a site before a council has obtained a full legal ban.", "phi:2.7b": " The government has urged councils to find more sites for travellers, giving them stronger powers to move on illegal settlements by Gypsy communities on rural land. More money is also being given to councils to develop official caravan parks. A new regulation will require local authorities to identify more appropriate sites and have the power to take immediate action if a site cannot be tolerated due to risk to local amenity and the environment. MPs from the committee scrutinising the Office for the Deputy Prime Minister are calling for better funding and intervention by the government when councils ignore their responsibilities towards travellers, leading to prolonged legal battles over controversial traveller sites.\n", "orca-mini:3b": " Councils are being encouraged by the government to find more sites for Travellers, with Ministers giving them stronger powers to move illegal encampments. More money is also being provided for councils to develop official caravan parks. An annual scheme to refurbish existing Traveller sites has been extended, and officials will be able to issue temporary stop notices to prevent works on a site before a council has had chance to obtain a full legal ban. There are concerns about Traveller encampments in some areas, with MPs calling for stronger enforcement powers to deal with illegal sites.", "hermes3:3b": "Councils must find additional Gypsy site locations; more powers granted for dealing with unauthorised settlements, extra funding for official caravan parks.", "stablelm-zephyr:3b": "The UK government is urging councils to find more sites for travellers, as continuing disputes over unauthorised encampments strain relationships between neighbouring communities and Gypsy/traveller populations. Housing Minister Yvette Cooper announced that local authorities will be given stronger powers to remove illegal settlements by Gypsy communities on rural land. Additionally, an annual scheme refurbishing existing traveller sites will now extend to considering council bids for new stopping places. The government is consulting on a new obligation for local authorities to identify suitable locations and increase swift action powers if development is deemed detrimental to local amenity or the environment. Critics argue that funding and intervention are necessary to support councils in fulfilling their responsibilities towards travellers and to combat resistance from residents.", "chatgpt-4o-latest": "Ministers are urging councils to find more sites for Gypsies and travellers to address ongoing disputes over unauthorised encampments. Councils will receive stronger powers to move illegal settlements and additional funding to develop official caravan parks. Housing minister Yvette Cooper announced an extension of a scheme to refurbish and create new sites, with £8m available in 2005. She highlighted two key issues: councils failing to identify suitable locations and lacking powers to swiftly address inappropriate developments, which cause tensions with local communities. New regulations will allow officials to issue \"temporary stop notices\" to halt site developments before legal action is completed. MPs, particularly from rural areas, have pushed for stronger enforcement, citing delays in removing illegal encampments. Andrew Ryder of the Traveller Law Reform Coalition welcomed the obligation for councils to provide sites but stressed the need for proper funding and government intervention. MPs previously reported that most illegal encampments result from a lack of designated stopping places, with councils reluctant to provide sites due to local opposition. Legal battles continue over controversial sites in Cambridgeshire and Wiltshire.", "stablelm2:1.6b": "Housing Minister Yvette Cooper has ordered local authorities to find more Gypsy and traveller sites as tensions rise over unauthorised encampments. Councils will also have stronger powers to move on illegal settlements, with an annual scheme to refurbish existing sites now being extended to include new ones. The aim is to identify more appropriate locations for both private and public sites, while local authorities are given new powers to swiftly deal with development on inappropriate sites. Officials will be able Cited: \"temporary stop notices\" that can prevent works on a site before a council has chance to obtain a full legal ban.", "granite3.1-dense:2b": "Ministers are directing councils to identify more suitable locations for Gypsy encampments, addressing the issue of 3,500 travellers lacking a designated stopping place. This move aims to tackle tensions and environmental concerns caused by unauthorized settlements on rural lands. The government plans to strengthen councils' powers to swiftly halt inappropriate developments, including the introduction of \"temporary stop notices\" before full bans can be imposed. These new regulations are expected to be implemented in spring. Councils will also receive additional funding for developing official caravan parks and refurbishing existing traveller sites. This decision is a response to MPs' calls for stronger enforcement due to lengthy legal processes delaying evictions and causing distress for both affected communities and Gypsies.", "reference": "In November, MPs urged ministers to make councils create sites because 3,500 travellers have no place to stop.Ms Cooper said an annual scheme to refurbish existing traveller sites would now be extended to consider council bids for new stopping places.\"There are two major problems in the planning system at the moment concerning Gypsy and traveller sites,\" said Ms Cooper.Numerous communities and councils were paying for lengthy and expensive evictions against travelling communities, said the MPs.More money is to be given to councils to develop official caravan parks, said housing minister Yvette Cooper.Under the new regulations, expected to be in force in the spring, officials will be able to serve \"temporary stop notices\" aimed at preventing works on a site before a council has had chance to obtain a full legal ban.In their November report, MPs from the committee scrutinising the Office for the Deputy Prime Minister, responsible for housing, said most illegal traveller encampments were caused by a lack of places to stop.Andrew Ryder, of the Traveller Law Reform Coalition, said: \"We welcome talk about an obligation on councils to identify land for Gypsies and travellers, so long as it is a real obligation as opposed to a recommendation which could be and was easily ignored."}