{"raw_text": "Hatfield executives go on trial\n \n Engineering firm Balfour Beatty and five railway managers are to go on trial for manslaughter over the Hatfield rail crash in 2000.\n \n Four people died when a section of rail broke and a high speed train derailed. Balfour Beatty's railway maintenance arm was in charge of the upkeep of the line at Hatfield, Hertfordshire. Balfour Beatty managers Anthony Walker and Nicholas Jeffries, and Railtrack managers Alistair Cook, Sean Fugill and Keith Lea all face individual charges. All five men, along with four others, are also accused of breaches of health and safety laws. Balfour Beatty Rail Maintenance faces a corporate manslaughter charge. It is expected the trial could last as long as a year. The accident, on 17 October 2000, happened when the London to Leeds express came off the tracks at 115 mph, when it was derailed by a cracked section of rail. The accident on the East Coast Main Line sparked major disruption. The overall responsibility for the line was Railtrack's - the company that has now become Network Rail. Those who died in the accident were Steve Arthur, 46, from Pease Pottage, West Sussex; Peter Monkhouse, 50, of Headingley, Leeds; Leslie Gray, 43, of Tuxford, Nottingham; and Robert James Alcorn, 37, of Auckland, New Zealand.\n", "llama3.2:1b": "Hatfield executives, including Balfour Beatty managers Anthony Walker and Nicholas Jeffries, are on trial for manslaughter related to the 2000 Hatfield rail crash that killed four people. The crash occurred when a section of rail broke and a high-speed train derailed. Alistair Cook, Sean Fugill, Keith Lea, Balfour Beatty managers Anthony Walker and Nicholas Jeffries, and Railtrack managers are also facing individual charges for breaches of health and safety laws.", "llama3.2:3b": "Engineering firm Balfour Beatty and five railway managers are to go on trial for manslaughter over the Hatfield rail crash in 2000. The accident killed four people and is attributed to a cracked section of rail caused by Balfour Beatty's maintenance arm. The five managers face individual charges, including breaches of health and safety laws, while Balfour Beatty faces a corporate manslaughter charge.", "gemma2:2b": "Balfour Beatty, a railway maintenance firm, and five Railtrack managers face trial for manslaughter in connection with the Hatfield rail crash that killed four people in 2000. The charges stem from a cracked section of rail causing the train to derail at high speed, leading to major disruptions on the East Coast Main Line.  \n", "qwen2.5:0.5b": "Key ideas:\n- Hatfield rail crash in 2000\n- Four people died in the crash\n- Balfour Beatty, Railtrack, and Network Rail are accused of manslaughter\n- The trial is expected to last as long as a year\nSummary: A major rail accident occurred in 2000 at the Hatfield station on the East Coast Main Line. Four people were killed when a section of track broke and derailed, leading to an 115 mph derailment on the main line between London and Leeds. The trial is expected to last as long as a year and the accident caused major disruption to the rail network.", "qwen2.5:1.5b": "Four railway executives face manslaughter charges following a Hatfield rail crash in 2000 where a section of track broke and derailed a high-speed train, killing four people.", "qwen2.5:3b": "Hatfield rail crash victims: Four died when a section of track broke, causing a high-speed train derailment in October 2000. Five executives (Balfour Beatty's Anthony Walker and Nicholas Jeffries, Railtrack's Alistair Cook, Sean Fugill, and Keith Lea) are to face manslaughter charges along with four others for breaching health and safety laws. Balfour Beatty Rail Maintenance is charged with corporate manslaughter. The trial could last a year. Overall responsibility was attributed to Railtrack, now Network Rail. Victims: Steve Arthur (46), Peter Monkhouse (50), Leslie Gray (43), Robert James Alcorn (37).", "opencoder:1.5b": "Hatfield executives go on trial for manslaughter over the Hatfield rail crash in 2002.\n\nThe company Balfour Beatty and five railway managers are accused of a murder while riding a high speed train.\n\nThree of the five men, along with four others, are also accused of breaching health and safety laws. It is expected that the trial could last as long as a year. The accident happened on 17 October 2002, when the London to Leeds express came off the tracks at 115 mph.\n", "smollm:1.7b": "The Hatfield rail crash in 2000 resulted in the deaths of four people and injuries to five others. The incident was caused by a section of rail breaking and derailing, leading to the derailment of a high-speed train. The railway maintenance arm of Balfour Beatty, along with Railtrack managers Anthony Walker, Nicholas Jeffries, Alistair Cook, Keith Lea and Keith Lea, were all accused of breaches of health and safety laws. In addition, four other individuals were also charged with manslaughter: Alistair Cook, who was the Railtrack manager at the time; Sean Fugill, who was the Railtrack manager in charge of the upkeep of the line at Hatfield; Keith Lea, who was the Railtrack manager at the time; and Andrew Humberstone, who was a member of the Railtrack management team. All five men were accused of breaches of health and safety laws, which led to the derailment of the train. The overall responsibility for the line was attributed to Railtrack's - the company that has since become Network Rail. Those who died in the accident were Steve Arthur, 46, from Pease Pottage, West Sussex; Peter Monkhouse, 50, of Headingley, Leeds; Leslie Gray, 43, of Tuxford, Nottingham; and Robert James Alcorn, 37, of Auckland, New Zealand.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely while preserving key ideas and details. Let me read through it first.\n\nThe article talks about Hatfield executives going on trial because of a 2000 rail accident. Engineering firm Balfour Beatty is involved, including four managers and five railway managers accused of manslaughter. The accident happened when a high-speed train from London to Leeds derailed due to a cracked rail section. It caused massive disruption both in the UK and caused the majority of the line to be closed for maintenance.\n\nSo, the key points are: Hatfield's executives on trial, Balfour Beatty involved with 4-5 managers each facing charges, the accident details (speed limit, rail section), cause of the accident affecting both sides, and the company Railtrack which handles maintenance now is Network Rail. Four people died.\n\nI should condense this into a summary that includes all these elements without too much explanation or formatting.\n</think>\n\nHatfield executives are on trial for manslaughter after a 2000 rail accident involving Balfour Beatty engineering firm, including four railway managers and five others accused of manslaughter. The accident occurred when a high-speed train from London to Leeds derailed due to a cracked rail section, causing severe disruption in the UK and closing most of the line for maintenance by Railtrack, which is now Network Rail. Four individuals died in the crash.", "tinyllama:1.1b": "Haifa City Council approves the construction of a new public market in Jaffa.\n\nThe Council approved on Tuesday (25 May) the project to build a new public market in Jaffa after approving the draft plan submitted by urban planner Amir Gordin, which involves the construction of a 6,000-square-meter market, including two underground levels. The market would cover an area of more than 15,000 square meters and would be built on the site where the existing market was destroyed in a 2016 fire. The project is part of plans to revitalize the center of Jaffa, which has been largely neglected for decades. The market will serve as a platform for small businesses to sell their products directly to customers, offering a more accessible and affordable market experience than traditional shops in the area. This new public market is just one of several initiatives aimed at revitalizing Jaffa's downtown area, which is also home to historic buildings, vibrant street art, and an eclectic mix of cultures.", "tinydolphin:1.1b": " The Hatfield rail crash in 2000 resulted in the deaths of four people, along with injuries to five others. As a result of this tragic accident, engineering firm Balfour Beatty and its railway maintenance arm, Railway Maintenance Company (RMC), are now facing charges for manslaughter. The prosecution is aiming for the guilty verdicts against both companies. \n\nFifteen individuals, including the managers involved in the upkeep of the London to Leeds Express, are also being accused of breaches of health and safety laws. In addition, charges have been brought against Balfour Beatty Rail Maintenance as well, facing a corporate manslaughter charge. This is due to the fact that the company was operating at the time of the crash, which caused massive disruption on the East Coast Main Line. The overall responsibility for the situation rests with Railtrack, who became Network Rail following the derailment.\n\nThe people affected by this accident are already known. Steve Arthur from Pease Pottage, West Sussex; Peter Monkhouse, 50, of Headingley, Leeds; Leslie Gray, 43, of Tuxford, Nottingham; and Robert James Alcorn, 37, of Auckland, New Zealand. The accident was so significant that it led to disruption on the entire East Coast Main Line. This is a significant issue for Network Rail, as they are now responsible for maintaining and operating the entire railway network in England.", "phi:2.7b": " A trial is underway for manslaughter charges against five railway managers and the engineering firm Balfour Beatty over the Hatfield rail crash in 2000. Four people died when a section of train track broke, leading to the death of four others as well. The overall responsibility for the line was held by Railtrack, which has now become Network Rail.\n", "orca-mini:3b": " The text reports on the trial of five railway managers from Balfour Beatty and five railway managers from Railtrack, along with four others, for manslaughter and breaches of health and safety laws over the Hatfield rail crash in 2000.", "hermes3:3b": "Hatfield rail crash trial\n- Balfour Beatty, railway managers, & four others accused of manslaughter & health/safety breaches\n- Four died when broken rail caused train derailment in 2000\n- Balfour Beatty Rail Maintenance faces corporate manslaughter charge", "stablelm-zephyr:3b": "Balfour Beatty and five railway managers are on trial for manslaughter in the Hatfield rail crash in 2000, which resulted in four deaths and major disruption. The firms responsible include Balfour Beatty's railway maintenance arm and Railtrack managers. They face charges of health and safety breaches as well as corporate manslaughter.", "chatgpt-4o-latest": "Balfour Beatty and five railway managers are on trial for manslaughter over the 2000 Hatfield rail crash, which killed four people when a high-speed train derailed due to a broken rail. Balfour Beatty was responsible for maintaining the track, and its managers, along with Railtrack executives, face individual charges and health and safety violations. Balfour Beatty Rail Maintenance also faces a corporate manslaughter charge. The trial could last up to a year. The accident caused major disruption on the East Coast Main Line, and Railtrack, now Network Rail, had overall responsibility for the line. The victims were Steve Arthur, Peter Monkhouse, Leslie Gray, and Robert James Alcorn.", "stablelm2:1.6b": "Five executives from engineering firm Balfour Beatty are set to go on trial for manslaughter over the Hatfield rail crash in October 1994. Four people died when a train derailed due to a cracked section of rail maintained by Balfour Beatty's railway maintenance arm at Hatfield, Hertfordshire. The company faces a corporate manslaughter charge alongside four others accused of health and safety breaches. The trial is expected to last one year.", "granite3.1-dense:2b": "Balfour Beatty executives and five Railtrack/Network Rail managers are set to stand trial for manslaughter and health and safety breaches following the Hatfield rail disaster in 2000. Four individuals died when a high-speed train derailed due to a broken section of rail on the East Coast Main Line at 115 mph. The deceased were Steve Arthur, Peter Monkhouse, Leslie Gray, and Robert James Alcorn. Balfour Beatty Rail Maintenance faces a corporate manslaughter charge. The trial is anticipated to last over a year.", "reference": "Engineering firm Balfour Beatty and five railway managers are to go on trial for manslaughter over the Hatfield rail crash in 2000.Balfour Beatty Rail Maintenance faces a corporate manslaughter charge.Balfour Beatty's railway maintenance arm was in charge of the upkeep of the line at Hatfield, Hertfordshire.The accident, on 17 October 2000, happened when the London to Leeds express came off the tracks at 115 mph, when it was derailed by a cracked section of rail.The overall responsibility for the line was Railtrack's - the company that has now become Network Rail."}