{"raw_text": "Falconer rebuts 'charade' claims\n \n Concessions on a bill which critics claim would allow euthanasia \"through the back door\" were not a political ploy, the lord chancellor has said.\n \n Ministers have been accused of panic in offering last minute changes to the Mental Capacity Bill amid chaotic scenes in the Commons on Tuesday. Lord Falconer said it was fair to criticise the late timing of the offer. He said the changes provided a solution to a very difficult issue but some MPs argue the situation is still unclear.\n \n The bill allows people to give somebody the power of attorney to make decisions on their behalf if they become too ill to decide for themselves. Ministers insist the plans would not change laws on euthanasia and would improve safeguards. Critics fear it could allow \"killing by omission\" through withdrawing treatment, including food and fluids.\n \n Tony Blair said he would do everything he could to meet concerns about the bill. But changes to the bill must not overturn the law set when a court ruled that doctors could withdraw artificial feeding and hydration from Hillsborough coma victim Tony Bland. \"It is important we don't end up in the situation where doctors and consultants are confused about the law and may lay themselves open to prosecution in circumstances where no sensible person would want that to happen,\" he said.\n \n On Tuesday, the government saw off a backbench attempt to force changes to the bill by 297 votes to 203, despite rebellion by 34 Labour MPs. The revolt was also reduced by news that Lord Falconer had promised the Catholic archbishop of Cardiff to strengthen safeguards in the bill. But that only came after MPs bombarded Constitutional Affairs Minister David Lammy with a barrage of requests for him to read the letter as they complained they had been left in the dark. Eventually, he was hurriedly handed the letter to read out five minutes before the crunch votes, prompting claims of a shambles. The deputy speaker later said the debate had not been handled as it should have been.\n \n Lord Falconer says there will be amendments when the bill goes to the House of Lords. He told BBC News: \"We have given a commitment to put into the bill a clause that says that nothing in the bill authorises any act where the motive of the person authorising the decision is to end life. \"The motive has got to be to end suffering.\" He denied the concessions were a \"political manoeuvre\" forced by panic about the rebellion. It was inevitable that minds became more focused as the bill went through Parliament but the result was a \"sensible solution\", he said. \"I don't think it is something to be embarrassed about. These issues are not easy to deal with,\" he went on. BBC political editor Andrew Marr said Mr Lammy was \"waste deep in quicksand and sinking fast\" after his performance. But Lord Falconer praised his minister for an \"excellent job\". Former Conservative leader Iain Duncan Smith, one of the chief critics of the plans, condemned the debate as a \"charade\" and complained the promises of changes to the bill were vague.\n", "llama3.2:1b": "The lord chancellor, Michael Fallon, has denied that concessions on the Mental Capacity Bill would have allowed euthanasia \"through the back door.\" He says they provided a solution to a difficult issue and some MPs disagree. The bill allows people to give someone power of attorney if they become too ill to make decisions for themselves. Critics fear it could allow \"killing by omission\" due to withdrawing treatment.\n\nTony Blair has expressed concerns that the changes may not be sufficient, citing court rulings on euthanasia and doctor-patient confidentiality. He opposes allowing \"killing by omission.\" The government won a 297-203 vote in the Commons but was reduced in opposition.\n\nLord Falconer says there will be amendments to the bill when it goes to the House of Lords and that he did not make concessions for political reasons, rather because minds became more focused on the issue as it went through Parliament.", "llama3.2:3b": "Lord Chancellor John Falconer denies that concessions on a euthanasia bill were made for political reasons, calling them a \"sensible solution\" to a difficult issue. The bill allows people to give someone power of attorney but critics fear it could lead to \"killing by omission\". Tony Blair says he will do everything to address concerns and Lord Falconer has promised to strengthen safeguards in the bill before its House of Lords vote.", "gemma2:2b": "Lord Falconer defends concessions in the Mental Capacity Bill that critics say could allow euthanasia by omission. While conceding the late timing was unfair, he argues the amendments offer a solution to a complex issue. The bill allows for power of attorney over someone's life-sustaining decisions if they become incapacitated.  Tony Blair and Lord Falconer address concerns about potential legal ambiguity and prosecution risks.  A backbench rebellion was overcome by promises from Lord Falconer to strengthen safeguards, but the process was criticized as shambolic. Despite these criticisms, Lord Falconer defends the bill's final form and emphasizes the need for safeguards against improper use of power of attorney. Critics remain unconvinced, with Iain Duncan Smith characterizing the debate as a “charade”. \n", "qwen2.5:0.5b": "Lord Falconer argues that the concession on the Mental Capacity Bill was not a political ploy but was part of a solution to an issue that needed addressing. He says some MPs are concerned about the bill's impact, especially the risk of \"killing by omission.\" Lord Falconer believes that if changes are made to the bill, they should not overturn the law established when a court ruled doctors could withdraw artificial feeding and hydration from Tony Bland.", "qwen2.5:1.5b": "Lord Falconer disputes claims that concessions on a Mental Capacity Bill meant euthanasia could be approved via omission, instead claiming they offered solutions to difficult issues while some MPs remain unclear about their implications. The bill allows people to give others power of attorney over decisions related to end-of-life care but is criticized for potentially allowing \"killing by omission\" and concerns that it would lead to confusion with current euthanasia laws. Tony Blair pledged not to overturn the court ruling on Hillsborough coma victim Tony Bland's feeding, emphasizing clarity in legal interpretation despite resistance from MPs who feared a \"charade\".", "qwen2.5:3b": "Lord Falconer denied claims that concessions on the Mental Capacity Bill allowing euthanasia through the back door were a political maneuver. While some MPs argue the situation is still unclear, he claimed the changes provide a solution to a difficult issue. Tony Blair emphasized the importance of maintaining existing laws and avoiding confusion among healthcare professionals. Despite opposition, the government managed to pass the bill with support from 297 votes against 203 votes. Lord Falconer promised amendments in the House of Lords, stating that no act would authorize ending life unless the motive is to alleviate suffering. Critics like Iain Duncan Smith described the debate as a \"charade,\" while former Conservative leader David Lammy's performance was criticized for being vague and ineffective.", "opencoder:1.5b": "Falconer rebuts 'charade' claims\n\nMinisters have been accused of panic in offering last minute changes to the Mental Capacity Bill amid chaotic scenes in the Commons on Tuesday. Critics fear it could allow \"killing by omission\" through withdrawing treatment, including food and fluids.\n\nTony Blair said he would do everything he could to meet concerns about the bill. But changes to the bill must not overturn the law set when a court ruled that doctors could withdraw artificial feeding and hydration from Hillsborough coma victim Tony Bland. \"It is important we don't end up in the situation where doctors and consultants are confused about the law and may lay themselves open to prosecution in circumstances where no sensible person would want that to happen,\" he said.\n\nThe bill allows people to give somebody the power of attorney to make decisions on their behalf if they become too ill to decide for themselves. Ministers insist the plans would not change laws on euthanasia and would improve safeguards. But changes to the bill must not overturn the law set when a court ruled that doctors could withdraw artificial feeding and hydration from Hillsborough coma victim Tony Bland.\n", "smollm:1.7b": "The summary should be:\nOutput only the summary as plain text—no explanations, no formatting, no reasoning process. The key ideas are preserved in the original text, but the tone and style have been changed to make it concise and clear.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely while preserving the key ideas and details. Let me read through it carefully.\n\nThe first paragraph talks about Falconer rebuts the 'charade' claims by the government, which criticized the bill allowing euthanasia through back door.\n\nThen, it mentions that ministers were accused of panic offering changes to the Mental Capacity Bill quickly amid chaotic scenes in the Commons. Falconer said it was fair to criticize the late timing and suggested changes would solve a difficult issue but some MPs say more is needed.\n\nNext part explains the bill allows people to make decisions for their own behalf if they're too ill, insisting no law change affects euthanasia but critics worry about \"killing by omission.\" Tony Blair said he'd do everything he can to meet concerns, but changes mustn't overturn the Hillsborough ruling. There was a backbench attempt that failed, partly because Falconer promised safeguards. However, when MPs asked for reading the letter, it wasn't handled properly.\n\nFalconer mentioned amendments would happen in the House of Lords and told BBC News, \"we've given a commitment to prevent acts where the authorising person ends life.\" He denied concessions as a political maneuver but pointed out that minds focus more on the bill's passage. Finally, he praised Lammy for his work.\n\nI need to condense this into one coherent summary without explanations or formatting. I should include key points like Falconer rebuffing claims, the timing of changes, the nature of the bill, the issue with Hillsborough ruling, the backbench failure, and Falconer's positivity about Lammy.\n</think>\n\nThe lord chancellor refutes claims that mental capacity acts were allowed to bypass medical judgment in the Mental Capacity Bill. ministers were accused of offering changes quickly amid chaotic Commons scenes, while Falconer criticized the late timing and suggested solutions but highlighted unclear issues.Tony Blair expressed concerns about the bill's potential for \"killing by omission.\" There was a backbench attempt that failed partly due to Falconer's promise of safeguards. However, the MPs' criticism of Lammy led to a mishmash, with Falconer acknowledging Lammy's work and saying the debate lacked deliberation.", "tinyllama:1.1b": "In response to criticism that the Menatal Capacity Bill was being rushed through Parliament without adequate consultation with medical professionals, Lord Falconer rebuffed claims that the bill would allow euphanasia \"through the back door\" by providing amendments that ensure a \"sensible solution\" can still be implemented if necessary. He emphasized that the proposed changes are just \"a sensible step to address the difficulties that were caused by the chaos of the last moment.\" The deputy speaker of the House of Lords later apologized for the way the debate was handled, admitting that it had not been handled as it should have been. Despite this, Lord Falconer reiterated his support for the bill and promised to make amendments to ensure it can still be implemented in cases where necessary.", "tinydolphin:1.1b": " The summary conveys that the government has agreed to amend the Mental Capacity Bill by allowing people to give permission for others to make decisions on their behalf, but critics argue it allows euthanasia. This comes after a group of Conservative MPs and others tried to force changes to the bill but were unsuccessful due to the rebellion by 34 Labour MPs. The government later read a letter from the Archbishop of Cardiff and offered amendments, which were then rejected by the deputy speaker in the absence of proper procedures. Some critics argue that this shows there is still confusion over the bill and its potential impact on people's rights to make their own decisions.", "phi:2.7b": " The text summarizes a conversation between Lord Chancellor Lord Falconer and BBC News about the Mental Capacity Bill that has been criticized for potentially allowing euthanasia \"through the back door.\" Lord Falconer defends the concessions made to address concerns, stating that they provide a solution to a difficult issue while still respecting existing laws on euthanasia. He also notes that the bill strengthens safeguards against such actions. The article concludes with Iain Duncan Smith criticizing the debate as a charade and calling for clearer promises of changes to the bill.\n", "orca-mini:3b": " The text reports on the lord chancellor's response to criticism of the government's mental capacity bill. It includes details about the concessions made to the bill and the claims made by MPs and religious leaders regarding the bill.", "hermes3:3b": "Falconer disputes 'euthanasia through back door' claims about late changes to Mental Capacity Bill, insisting it provides safeguards and is not political ploy.", "stablelm-zephyr:3b": "The lord chancellor, Lord Falconer, has responded to accusations that concessions on the Mental Capacity Bill allow euthanasia \"through the back door.\" Critics fear the changes could enable \"killing by omission\" by withdrawing treatment, including food and fluids. The bill allows people to grant power of attorney to someone else to make decisions for them if they become too ill to decide themselves. Lord Falconer assured that the amendments made would not authorize any acts where the motive was to end life, stressing that the motives must only be to reduce suffering. Despite opposition from some Labour MPs and concerns from former Conservative leader Iain Duncan Smith, who called the debate a \"charade,\" the government saw off an attempt to force changes to the bill by 297 votes to 203. Lord Falconer has promised amendments when the bill goes to the House of Lords.", "chatgpt-4o-latest": "Lord Chancellor Lord Falconer defended last-minute concessions to the Mental Capacity Bill, denying they were a political ploy amid criticism that the bill could allow euthanasia by omission. The bill grants power of attorney for medical decisions if a person becomes incapacitated, with ministers insisting it does not change euthanasia laws but enhances safeguards. Critics fear it could permit withdrawal of treatment, including food and fluids. Tony Blair pledged to address concerns while ensuring legal clarity for doctors. Despite a Labour rebellion, the government defeated an amendment attempt. A late promise to strengthen safeguards, revealed just before key votes, led to accusations of chaos. Falconer assured amendments in the House of Lords, emphasizing that decisions must aim to end suffering, not life. He rejected claims of panic, calling the outcome a \"sensible solution,\" while critics, including Iain Duncan Smith, dismissed the debate as a \"charade.\"", "stablelm2:1.6b": "The Lord Chancellor stated that the concessions on the Mental Capacity Bill were not a political ploy but instead aimed to provide solutions for a difficult issue. Critics fear that the proposed bill could allow \"killing by omission,\" such as withdrawing treatment like food and fluids, when it comes to euthanasia. The bill grants individuals the power of attorney to make decisions if they become too ill to decide themselves. However, the plans do not alter the laws regarding euthanasia but improve safeguards. Critics believe that this could allow killing through omission by withholding treatment. Despite Labour MPs' attempts to force changes to the bill, the government succeeded in avoiding them with a vote of 5-4. Lord Falconer promised to make amendments when the bill goes to the House of Lords, stating that nothing in the bill authorizes any act where the motive is ending life. He denied these concessions were forced by panic about a rebellion. Former Conservative leader Iain Duncan Smith called the debate a \"charade\" and criticized vague promises for changes to the bill.", "granite3.1-dense:2b": "Lord Falconer refuted accusations that recent concessions on the Mental Capacity Bill, which has been criticized for potentially enabling euthanasia, were politically motivated or a panic response. The controversial bill allows individuals to appoint others to make decisions if they lose mental capacity. Ministers insist these changes will not alter laws on euthanasia but aim to enhance safeguards and prevent \"killing by omission\" through withdrawing treatment, such as food and fluids.\n\nDespite Tuesday's chaotic scenes in the Commons, where 34 Labour MPs rebelled against the government, Lord Falconer promised stronger safeguards to the Catholic archbishop of Cardiff. This came after MPs' demands for Constitutional Affairs Minister David Lammy to read a letter regarding the changes. The rebellion was reduced following Lammy's reading, but the debate was criticized as chaotic by some observers.\n\nLord Falconer assured BBC News that amendments would be made when the bill is considered in the House of Lords, including a clause stating that no act within its provisions should aim to end life—only to alleviate suffering. He dismissed concerns as unfounded and emphasized that focusing on these complex issues was inevitable during Parliament's deliberations. Critics like Iain Duncan Smith condemned the process as a \"charade\" due to perceived vague promises of reforms.", "reference": "Concessions on a bill which critics claim would allow euthanasia \"through the back door\" were not a political ploy, the lord chancellor has said.Tony Blair said he would do everything he could to meet concerns about the bill.It was inevitable that minds became more focused as the bill went through Parliament but the result was a \"sensible solution\", he said.Lord Falconer said it was fair to criticise the late timing of the offer.Lord Falconer says there will be amendments when the bill goes to the House of Lords.The revolt was also reduced by news that Lord Falconer had promised the Catholic archbishop of Cardiff to strengthen safeguards in the bill.He told BBC News: \"We have given a commitment to put into the bill a clause that says that nothing in the bill authorises any act where the motive of the person authorising the decision is to end life.\"It is important we don't end up in the situation where doctors and consultants are confused about the law and may lay themselves open to prosecution in circumstances where no sensible person would want that to happen,\" he said.He said the changes provided a solution to a very difficult issue but some MPs argue the situation is still unclear.On Tuesday, the government saw off a backbench attempt to force changes to the bill by 297 votes to 203, despite rebellion by 34 Labour MPs."}