{"raw_text": "School sport 'is back', says PM\n \n Tony Blair has promised that \"sport is back\" as a priority for schools.\n \n The prime minister launched a £500m initiative to allow school sports clubs in England to provide up to three hours of extra activity a week by 2010. \"It's an important part of education and it's an important part of health,\" Mr Blair said. But the Conservatives say government proposals - which include two hours' PE within school for 75% of pupils by 2006 - are unrealistic.\n \n The latest move is aimed at encouraging more diversity in sport, with activities such as yoga and Tai Chi being options. Launching the initiative, Mr Blair completed an agility course and shot basketball hoops with students from the all-girl Waverley Sports College in Southwark, south London. He said: \"You've got to bring back school sport. It's got to be done differently than it was 30 or 40 years ago. It's still very, very important.\"\n \n Earlier, Education Secretary Charles Clarke told BBC News there were at least three areas which needed \"a coherent framework\" and \"dedicated funding\". These were training for PE teachers, establishing more specialist schools and the development of partnerships for activities such as inter-school competitions. He added the government had originally pledged \"for every pupil to get at least two hours of high-quality physical education\" a week. The proportion was currently at 62%, and the government was hoping this would rise to 85% by 2008 and 100% by 2010. The money for the initiative will come from a new £500m fund.\n \n The £500m move will also increase the number of specialist sport colleges from 350 to 400. But the Conservatives warned of rising obesity levels and said that since only a third of children do two hours of sport a week currently, the government is promising something it cannot guarantee. Shadow spokesman for sport Hugh Robertson said: \"I suspect the correct way to tackle it is to look at the other end of the spectrum and try to enable the clubs - which is where the real passion for sport exists - to deliver the school sport offer.\" He said more emphasis should be put on traditional sports, saying that an \"anti-competitive sport agenda\" had been pursued in recent years. Martin Ward, of the Secondary Heads Association, said members did not like \"ring-fenced funds\" and that it should be up to the schools themselves to decide how to spend their money.\n", "llama3.2:1b": "School sport is returning to England after a £500m initiative was launched by Prime Minister Tony Blair in 2005 with the goal of providing 75% of pupils with two hours of PE per week by 2006. The plan includes two hours of physical education (PE) for all students, increasing from the current 62%.", "llama3.2:3b": "Tony Blair has launched a £500m initiative to increase school sports clubs' activities by 2010, aiming for at least 85% of pupils getting two hours of PE per week by 2008, with plans to include yoga and Tai Chi options. The Conservatives say the proposals are unrealistic and that more emphasis should be put on traditional sports.", "gemma2:2b": "Prime Minister Tony Blair announced a £500 million initiative to encourage more school sports participation in England. The program aims to provide extra activities for children, including yoga and Tai Chi. The government plans to increase PE teaching time and funding for specialist sport schools, but some believe these measures are unrealistic and overly broad. Conservative critics suggest focusing on established sports is a more effective approach than introducing new programs. \n", "qwen2.5:0.5b": "School sport is back as a priority for UK education, with government funding of £500m to allow sports clubs in schools to provide up to three hours of extra activity per week by 2010. While Prime Minister Tony Blair promises an increase in school physical activity, Conservatives argue the scheme includes only two hours' PE and could lead to healthier students, warning it might not be enough to combat obesity levels and other issues with traditional sports programs.", "qwen2.5:1.5b": "Tony Blair announces school sports initiative worth £500m aimed at encouraging more diversity in sport and promoting physical education, including yoga and Tai Chi as options. The plan aims to provide up to three hours of extra activity a week for all children by 2010 and improve training and partnerships in PE. This follows Education Secretary Charles Clarke's earlier commitment to ensure every child gets two hours of high-quality physical education weekly by 2010.", "qwen2.5:3b": "Tony Blair has launched a £500m initiative to provide school sports clubs with up to three hours of extra activity per week by 2010 in England, emphasizing sport's role in education and health. The government aims for at least two hours of PE per pupil by 2006, though the Conservatives argue this is unrealistic given current participation rates (only a third currently). Blair promoted diversity in sports options such as yoga and Tai Chi. The new initiative will increase specialist sports colleges from 350 to 400. Conservative opposition argues that government proposals are unachievable due to rising obesity levels, while some head teachers suggest schools should decide how to use their allocated funds rather than receiving ring-fenced grants.", "opencoder:1.5b": "Schools 'are back' as a priority for schools, as promised by PM Tony Blair. The government has raised funds for increased sport facilities and partnerships, aiming at encouraging more diversity in sport with yoga and Tai Chi options.\n\nThe focus on sport continues despite rising obesity levels and other challenges. The government's promises will be tested under the guidance of shadow speaker Hugh Robertson, who insists it is necessary to tackle the problem from an all-out strategy perspective. Additionally, it seeks the assistance of specialist sports colleges, increasing the range of opportunities for clubs to provide extra activity. The initiative also raises questions about the wider focus on education, focusing more on traditional sports than competitive sports in recent years.\n", "smollm:1.7b": "The summary is concise and clear, preserving key ideas and details from the original text. The main points are:\n\n1. Tony Blair has promised that \"sport is back\" as a priority for schools.\n2. The prime minister launched a £500m initiative to allow school sports clubs in England to provide up to three hours of extra activity a week by 2010.\n3. The initiative aims to encourage more diversity in sport, with activities such as yoga and Tai Chi being options.\n4. Launching the initiative, Mr Blair completed an agility course and shot basketball hoops with students from the all-girl Waverley Sports College in Southwark, south London.\n5. He said: \"You've got to bring back school sport. It's got to be done differently than it was 30 or 40 years ago.\"\n6. The government had originally pledged \"for every pupil to get at least two hours of high-quality physical education a week\" a week. The proportion is currently at 62%, and the government is hoping this will rise to 85% by 2008 and 100% by 2010.\n7. The money for the initiative will come from a new £500m fund.\n8. The initiative will also increase the number of specialist sport colleges from 350 to 400. But the Conservatives warned of rising obesity levels and said that since only a third of children do two hours of sport a week currently, the government is promising something it cannot guarantee.\n9. Shadow spokesman for sport Hugh Robertson said: \"I suspect the correct way to tackle it is to look at the other end of the spectrum and try to enable the clubs - which is where the real passion for sport exists - to deliver the school sport offer.\" He said more emphasis should be put on traditional sports, saying that an \"anti-competitive sport agenda\" had been pursued in recent years.", "deepseek-r1:1.5b": "<think>\nAlright, so I have this query where the user wants me to summarize a text concisely. Let's break down what they need.\n\nFirst, they provided a detailed news article about Tony Blair, the UK PM, announcing a £500 million initiative for schools to expand their sports programs. The key points here are that this initiative is supposed to provide up to three hours of extra activity per week by 2010 and that it's being met with some criticism from the Conservatives.\n\nI need to extract the main ideas. The PM says \"sport is back\" as a priority for schools, launching a £500m plan. He mentions activities like yoga and Tai Chi as options. He even did an agility course and hoop shooting with students in Southwark's Waverley Sports College. The initiative aims to bring more diversity into sports by contrasting it with past practices.\n\nThen, the user wants the summary only in plain text without any explanations or formatting. I have to make sure I capture all these elements accurately without adding any extra details or reasoning.\n\nI should keep it concise but include all the critical points: the announcement from Blair, the funding amount, the target timeframe, what the initiative includes (like new sports and specific activities), and the opposition from the Conservatives. Also, mentioning the number of specialist schools being expanded and the government's goals for sport participation over time.\n\nLet me structure this into a clear, concise paragraph that covers all these aspects without unnecessary fluff.\n</think>\n\nTony Blair announced a £500 million initiative in 2010 to expand school sports programs by providing up to three hours of extra activity per week, aiming to preserve and enhance the importance of school sport for students. The initiative includes activities like yoga and Tai Chi, with Mr. Blair completing an agility course and hoop shooting during student involvement. However, critics argue that the government's proposed two-hour PE for 75% of pupils in 2006 is unrealistic. The initiative aims to encourage more diverse sports and reduce reliance on traditional methods, contrasting with past practices. It also seeks funding from a new £500 million package, intended to increase school sport diversity.", "tinyllama:1.1b": "L'iniziativa di Tony Blair per ricominciare \"il gioco tra gli alunni\" è stata promossa dopo la presentazione del progetto di iniziativa £500m di finanziamento, che prevede lo spostamento delle attività sportive degli alunni dallo studio allo specifico \"eurostile di sport\" all'attività incentrata su corsi e sport specializzati. La prima volta per l'iniziativa è stata promossa dalla Convenzione di Londra (London Conference), ma il governo propose uno svariato programma di attivitá sportiva, tra cui due ore di sport, basketball e hocheviroli, con 16.000 scuole. Il nuovo progetto di finanziamento (£500m) impegna più di un terzo delle attività sportive degli alunni a una durata massima di tre ore all'anno. La Convenzione sostiene che \"l'espressione 'gioco tra gli alunni' è veramente un termine da eliminare perché ci si aspettava che si presentasse come una tesi\" e che lo slogan da usare fosse \"il gioco in casa degli alunni\". La Convenzione dichiara che il progetto di finanziamento del governo, più di un terzo delle attività sportive degli alunni, è una priorità per gli scuole.", "tinydolphin:1.1b": " The UK government announced plans to increase school sports participation by introducing a new £500m fund and increasing specialist sport colleges from 350 to 400, with plans to create 1,000 more in total. Tony Blair pledged that \"sport is back\" as a priority for schools. The Conservatives claim the government's proposals are unrealistic and suggest spending on PE will be limited to two hours per week until 2006. Critics argue that the funding for the initiative should go towards improving traditional sports rather than introducing new ones.", "phi:2.7b": " Tony Blair promised £500m to provide more sports activities for school students. The initiative aims to encourage more diversity in sport, with options such as yoga and Tai Chi. Education Secretary Charles Clarke said there was a need for dedicated funding for PE teachers, specialist schools, and inter-school competitions. The government wants to ensure that at least two hours of high-quality physical education are provided per week to every pupil by 2010.\n", "orca-mini:3b": " Tony Blair promised that school sports clubs would receive up to three hours of extra activity a week by 2010 as part of a £500m initiative. The initiative aims to encourage more diversity in sport, with activities such as yoga and Tai Chi being options. Education Secretary Charles Clarke told BBC News there were three areas requiring a \"coherent framework\" and \"dedicated funding\": training for PE teachers, establishing more specialist schools, and developing partnerships for inter-school competitions. The government pledged to ensure that at least two hours of high-quality physical education was provided for every pupil, which currently stands at 62%. By 2008, the proportion should rise to 85% and by 2010, it should be 100%. The £500m move will increase the number of specialist sport colleges from 350 to 400. However, the Conservatives warned of rising obesity levels and said that only a third of children do two hours of sport a week currently, which the government cannot guarantee. The Conservatives also warned of an \"anti-competitive sport agenda\" in recent years. Martin Ward, of the Secondary Heads Association, said ring-fenced funds should be allocated to schools themselves to decide how to spend their money.", "hermes3:3b": "PM promises 'school sport is back', $500m initiative launched for extra activities in English schools by 2010.", "stablelm-zephyr:3b": "The UK Prime Minister, Tony Blair, has launched a £500 million initiative aimed at promoting school sports in England. By 2010, this program will provide an additional three hours of physical activity per week for students attending school sports clubs. This move is intended to make sport a priority again and to encourage more diverse activities such as yoga and Tai Chi within the educational framework. The Education Secretary, Charles Clarke, highlighted three areas that require a coherent framework: training for PE teachers, establishing more specialist schools, and developing partnerships for inter-school competitions. By 2008, the government aims for at least 62% of students to have two hours of high-quality physical education per week, rising to 85% by 2010 and 100% by 2020. The initiative will fund these programs through a new £500 million fund, increasing the number of specialist sport colleges from 350 to 400. However, critics, such as the Conservative party's Shadow Spokesperson for Sport Hugh Robertson, argue that traditional sports should be emphasized and question the government's ability to guarantee the increased focus on school sports due to obesity levels and limited current participation rates among children.", "chatgpt-4o-latest": "Tony Blair announced a £500m initiative to prioritize school sports in England, aiming to provide up to three extra hours of activity per week by 2010. The plan includes increasing PE participation, diversifying sports options, and expanding specialist sports colleges. Education Secretary Charles Clarke emphasized the need for teacher training, specialist schools, and inter-school partnerships, with a goal of 100% of pupils receiving two hours of PE weekly by 2010. However, Conservatives criticized the plan as unrealistic, citing rising obesity and low current participation rates. They argued for greater support for sports clubs and traditional competitive sports, while school leaders expressed concerns over restricted funding.", "stablelm2:1.6b": "Prime Minister Tony Blair has announced a £m initiative allowing school sports clubs in England to provide an extra three hours of activity per week from 2013. This follows previous pledges by Mr. Blair, who emphasized the importance of sports education in both health and education. The Conservative party, however.\nargues that government proposals are unrealistic. As part of the initiative, opportunities will be expanded, with activities such as yoga and Tai Chi offered. Schools must establish more specialist schools for PE teachers, improve funding, and create partnerships for inter-school competitions. Currently, only 5% of students receive two hours of high-quality physical education per week.\nThe initiative aims to raise this proportion to 80%. The money will come from a new £m fund established by the government. This initiative will also lead to an increase in the number of specialist sport colleges from 20 to 20. However, Conservatives worry about rising obesity levels and suggest that only half of children currently meet the required sports criteria.", "granite3.1-dense:2b": "Prime Minister Tony Blair has reinstated school sports as a top priority, launching a £500m initiative to extend school sports club activities by three hours weekly by 2010. This aims to promote diversity in sports, including yoga and Tai Chi. The government plans to ensure at least two hours of high-quality physical education per week for all pupils, currently 62%, by 2008 and 100% by 2010. This funding will expand specialist sport colleges from 350 to 400 and support training for PE teachers and inter-school competitions.\n\nHowever, the Conservatives criticize these proposals as unrealistic and warn of rising obesity concerns, given that only a third of children currently meet the recommended sport participation levels. They argue that focusing on traditional sports clubs within schools is more effective than ring-fencing funds for specific activities.", "reference": "He said: \"You've got to bring back school sport.The prime minister launched a £500m initiative to allow school sports clubs in England to provide up to three hours of extra activity a week by 2010.Shadow spokesman for sport Hugh Robertson said: \"I suspect the correct way to tackle it is to look at the other end of the spectrum and try to enable the clubs - which is where the real passion for sport exists - to deliver the school sport offer.\"But the Conservatives warned of rising obesity levels and said that since only a third of children do two hours of sport a week currently, the government is promising something it cannot guarantee.\"It's an important part of education and it's an important part of health,\" Mr Blair said.The £500m move will also increase the number of specialist sport colleges from 350 to 400.He said more emphasis should be put on traditional sports, saying that an \"anti-competitive sport agenda\" had been pursued in recent years.Tony Blair has promised that \"sport is back\" as a priority for schools."}