{"raw_text": "Anti-terror plan faces first test\n \n Plans to allow Home Secretary Charles Clarke to place terror suspects under house arrest without trial are set for their first real test in Parliament.\n \n Tories, Lib Dems and some Labour MPs are poised to vote against the plans. Mr Clarke says the powers are needed to counter terror threats. Opponents say only judges, not politicians, should be able to order detention of UK citizens. The government is expected to win Wednesday's vote in the Commons, but faces a battle in the House of Lords.\n \n The Prevention of Terrorism Bill was published on Tuesday. It proposes \"control orders\", which would mean house arrest in the most serious cases, and curfews, electronic tagging and limits on telephone and internet access for other suspects.\n \n The two opposition parties are particularly worried that the control orders would initially be imposed on the say-so of the home secretary, rather than a judge. Tory shadow home secretary David Davis warned of the potential for miscarriages of justice, like the Guildford Four - for which Tony Blair recently apologised - as a result of the pressure on politicians to lock up terror suspects. \"Those pressures would be much more for a politician than they would on a judge and that's why we have serious concerns abut that approach,\" he told BBC Radio 4's Today programme.\n \n Mr Clarke says he does not intend to use the house arrest powers now - even for the 11 current terror detainees. He also said that any decision he made would be reviewed by a judge within seven days. The foreign terror suspects currently detained are mostly held at London's Belmarsh prison. They are held under laws which the Law Lords have ruled break human rights rules - and which are due to expire on 14 March.\n \n The new powers, designed to replace the existing laws and meet the Law Lords' concerns, would apply to British as well as foreign terror suspects. Critics say that giving politicians the power to deprive UK citizens of their freedom is the biggest attack on civil liberties for 300 years. Opposition MPs are also angry they will have only two days - Wednesday and next Monday - to debate the new plans before they pass to the House of Lords. But the government says the existing powers run out soon so must be replaced urgently.\n \n In a rare move, the Tories and Lib Dems have jointly tabled a motion opposing the new bill, saying the house arrest plans are \"excessive\". It argues decisions should be taken on a higher standard of proof and the plan \"wrongly infringes the right to liberty\" by failing to bring terrorists to trial where there is evidence. Mr Davis told Today: \"It gives a minister, for the first time in modern history, the right to detain without trial, without showing the evidence and indeed, in some respects, almost the allegation against the individual concerned.\"\n \n He questioned why there was \"such a rush\" to introduce the legislation when Mr Clarke had indicated he was not planning to use the house arrest powers straight away. Liberal Democrat home affairs spokesman Mark Oaten said: \"We believe it should be the judge that takes decisions, not politicians.\" Mr Clarke said the security services and police backed his measures and it would be \"rash and negligent\" to ignore their advice. Nobody should doubt that terrorists at home and abroad wanted to attack the UK and its interests, he argued.\n", "llama3.2:1b": "Anti-terror plan faces first test in Parliament.\n\nThe Prevention of Terrorism Bill proposes new powers for Home Secretary Charles Clarke, including control orders which would mean house arrest without trial. Opponents say only judges should be able to order detention of UK citizens. The government expects to win Wednesday's vote but faces a battle in the House of Lords and Tory opposition parties warn of potential miscarriages of justice.", "llama3.2:3b": "Tories, Lib Dems and some Labour MPs oppose plans allowing Home Secretary Charles Clarke to place terror suspects under house arrest without trial. The government expects to win Wednesday's vote in the Commons but faces a battle in the House of Lords. Critics say the plan infringes civil liberties, particularly giving politicians the power to deprive UK citizens of their freedom.", "gemma2:2b": "A new bill to allow Home Secretary Charles Clarke to detain terror suspects without trial is being debated in Parliament. The bill proposes \"control orders,\" which would include house arrest for serious cases, curfews, electronic monitoring, and limited phone and internet access. Opposition parties are concerned about the power of politicians to detain citizens, saying it could lead to miscarriages of justice. The government argues the new powers are necessary due to expiring human rights laws and that the existing system is flawed.  Conservative and Liberal Democrat opposition parties have jointly tabled a motion opposing the bill, arguing for higher standards of proof and greater emphasis on trial before detention. \n", "qwen2.5:0.5b": "Key ideas:\n\n- Home Secretary Charles Clarke plans house arrest for terror suspects without trial.\n- Tories, Lib Dems, and Labour MPs are opposed to the plan, calling it necessary for counter-terrorism.\n- The government hopes to win a vote in Parliament but faces a battle in the House of Lords.\n- Control orders (house arrest) would apply to UK citizens, those held at Belmarsh prison, and foreign suspects.\n- Critics argue this creates an \"attack on civil liberties\" and is excessive compared to trial-and-error law enforcement methods.", "qwen2.5:1.5b": "The Prevention of Terrorism Bill allowing Home Secretary Charles Clarke to detain terror suspects without trial faces its first test in Parliament. Conservatives, Liberal Democrats, and some Labour MPs oppose the bill, while opponents worry about potential miscarriages of justice due to politicians' pressure. The government expects a Commons victory but faces opposition in the House of Lords regarding whether house arrest should be imposed on the home secretary's say-so rather than a judge. Critics argue giving politicians power to deprive citizens of freedom is the biggest attack on civil liberties since 17th-century England.", "qwen2.5:3b": "Plans for allowing Home Secretary Charles Clarke to place terror suspects under house arrest without trial are set to face their first test in Parliament. Tories, Lib Dems, and some Labour MPs are expected to vote against these plans, with concerns over whether only judges or politicians should order detention of UK citizens. The Prevention of Terrorism Bill proposes control orders for house arrest and curfews/electronic tagging. Critics argue that giving politicians the power to deprive UK citizens of their freedom is a significant infringement on civil liberties. While the government predicts winning Commons approval, it faces challenges in securing Lords support due to limited debate time. Opponents fear this could lead to miscarriages of justice similar to past cases and infringe upon individual rights.", "opencoder:1.5b": "Anti-terror plan faces first test\n\nPlans to allow Home Secretary Charles Clarke to place terror suspects under house arrest without trial are set for their first real test in Parliament.\n\nTories, Lib Dems and some Labour MPs are poised to vote against the plans. Mr Clarke says the powers are needed to counter Terror threats. Opponents say only judges, not politicians, should be able to order detention of UK citizens. The government is expected to win Wednesday's vote in the Commons, but faces a battle in the House of Lords.\n\nThe Prevention of Terrorism Bill was published on Tuesday. It proposes \"control orders\", which would mean house arrest in the most serious cases, and curfews, electronic tagging and limits on telephone and internet access for other suspects.\n\nThe two opposition parties are particularly worried that the control orders would initially be imposed on the say-so of the home secretary, rather than a judge. Tory shadow home secretary David Davis warned of the potential for miscarriages of justice, like the Guildford Four - for which Tony Blair recently apologised - as a result of the pressure on politicians to lock up terror suspects. \"Those pressures would be much more for a politician than they would on a judge and that's why we have serious concerns abut that approach,\" he told BBC Radio 4's Today programme.\n\nMr Clarke says he does not intend to use the house arrest powers now - even for the 11 currentterror detainees. He also said that any decision he made would be reviewed by a judge within seven days. The foreign terror suspects currently detained are mostly held at London's Belmarsh prison. They are held under laws which the Law Lords have ruled break human rights rules - and which are due to expire on 14 March.\n\nThe new powers, designed to replace the existing laws and meet the Law Lords' concerns, would apply to British as well as foreign terror suspects. Critics say that giving politicians the power to deprive UK citizens of their freedom is the biggest attack on civil liberties for 300 years. Opposition MPs are also angry they will have only two days - Wednesday and next Monday - to debate the new plans before they pass to the House of Lords. But the government says the existing powers run out soon so must be replaced urgently.\n\nIn a rare move, the Tories and Lib Dems have jointly tabled a motion opposing the new bill, saying the house arrest plans are \"excessive\". It argues decisions should be taken on a higher standard of proof and the plan \"wrongly infringes the right to liberty\" by failing to bring terrorists to trial where there is evidence. Mr Davis told Today: \"It gives a minister, for the first time in modern history, the right to detain without trial, without showing the evidence and indeed, in some respects, almost the allegation against the individual concerned.\"\n", "smollm:1.7b": "The summary of the text is: The anti-terror plan faces first test in Parliament. Tories, Lib Dems and some Labour MPs are poised to vote against the plans. Mr Clarke says the powers are needed to counter terror threats. Opponents say only judges, not politicians, should be able to order detention of UK citizens. The government is expected to win Wednesday's vote in the Commons, but faces a battle in the House of Lords.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving key ideas and details. Let me read through the provided text carefully.\n\nFirst, there's a mention of the anti-terror plan testing in Parliament, specifically allowing Home Secretary Clarke to place suspects under house arrest without trial. The Tories, Lib Dems, and Labour MPs are against it, with Clarke promising its success. However, opponents worry about being imposed on the home secretary's words instead of judges.\n\nThe Bill is called \"Prevention of Terrorism,\" proposing control orders in serious cases, curfews, electronic tagging, and limits on accessing information for others. The opposition, especially the Tory shadow Home Secretary David Davis, is worried that this could lock down the home secretary rather than a judge, leading to potential miscarriages of justice.\n\nClarke won't use the house arrest powers now; he said any decision would be reviewed within seven days. Foreign suspects are held at Belmarsh, where laws have been controversial as they break human rights. The new plan is supposed to apply to both UK and foreign terror suspects but will expire on March 14. Opposition MPs are angry with only two days to debate it in the House of Lords.\n\nThe government fears this could overstep civil liberties by allowing politicians to deprivation without trial, which is a big issue for 300 years. They've formed a motion opposing the bill, arguing decisions should be based on stronger proof and that they wrongly infringe liberty by ignoring police advice. They also want urgent action as existing laws run out.\n\nSo I need to condense this into a summary that includes key points: the plan's test in Parliament, opposition reactions, details about control orders, home secretary concerns, restrictions on justice, debate deadline, government's criticism of overstepping liberties, opposing speech, and their opposition.\n\nI should make sure not to include unnecessary details and focus only on the main elements. Let me structure it step by step.\n</think>\n\nThe anti-terror plan is being tested in Parliament to allow Home Secretary Clarke to place terror suspects under house arrest without trial. The Tories, Lib Dems, and Labour MPs are against this plan, while opponents worry it might restrict justice for politicians rather than judges. The Prevention of Terrorism Bill proposes control orders: house arrest in serious cases, curfews, electronic tagging, and restrictions on telephone and internet access. Opposition, especially the Tory shadow Home Secretary David Davis, fears pressuring politicians to lock up suspects with control orders, fearing legal issues like the Guildford Four case. Clarke will not use house arrest powers now, and his decisions will be reviewed within seven days. Foreign suspects are held at Belmarsh, where laws break human rights. The new plan expires on March 14, but opposition MPs argue only two days will allow debate in the House of Lords. The government is concerned this could overstep civil liberties, arguing politicians should take decisions without trial and ignoring police advice. They have a motion opposing the bill, highlighting the need for stronger proof and calling it a mistake to ignore police guidance. They emphasize urgent action as existing laws expire.", "tinyllama:1.1b": "The anti-terrorism plan presented by Home Secretary Charles Clarke will undergo its first real test in Parliament, where opposition MPs plan to vote against it. The plans involve the imposition of house arrest for terror suspects without trial, a power designed to counter terror threats, which is expected to face opposition from both Torries and Labour MPs who oppose using judge's or politician's judgment as a basis for detaining UK citizens. Opposition MPs argue that the government should be more cautious in implementing such powers, considering the precedent set by the Guildford Four case where politicians arbitrarily locked up suspects without trial, bringing miscarriage of justice. The current powers expire on March 14th but lawmakers must debate and pass the new plans by Wednesday and next Monday before they can be implemented urgently. Liberal Democrats question whether using house arrest powers as a sole justification for detaining UK citizens would be wrongly infiring the right to liberty, while Torries and Labour MPs oppose the use of decision-making power based on what is not shown.", "tinydolphin:1.1b": " The Prevention of Terrorism Bill, which aims to allow Home Secretary Charles Clarke to place terror suspects under house arrest without trial, is set for its first test in Parliament. Critics argue that giving politicians the power to deprive UK citizens of their freedom is the biggest attack on civil liberties for 300 years. The bill would apply to British as well as foreign terror suspects. Opponents say only judges, not politicians, should be able to order detention of UK citizens. In a rare show of unity, Tories and Lib Dems have jointly tabled a motion opposing the new bill, arguing that decisions should be taken on a higher standard of proof and the plan \"wrongly infringeses the right to liberty\" by failing to bring terrorists to trial where there is evidence.", "phi:2.7b": " Anti-terror plan faces first test in Parliament as Tories, Lib Dems and some Labour MPs are poised to vote against the plans. The bill proposes control orders, which would mean house arrest in serious cases, curfews, electronic tagging, and limits on telephone and internet access for other suspects. Critics say that giving politicians the power to deprive UK citizens of their freedom is the biggest attack on civil liberties for 300 years. Opposition MPs are angry they will have only two days to debate the new plans before they pass to the House of Lords. The government says the existing powers run out soon and must be replaced urgently.\n", "orca-mini:3b": " The Prevention of Terrorism Bill faces its first real test in Parliament, with plans for house arrest of terror suspects facing opposition from some Tories, Lib Dems, and Labour MPs. The government is expected to win Wednesday's vote in the Commons but faces a battle in the House of Lords. The two opposition parties are particularly worried that the control orders would initially be imposed on the say-so of the home secretary, rather than a judge. The foreign terror suspects currently detained are mostly held at London's Belmarsh prison. Critics say giving politicians the power to deprive UK citizens of their freedom is the biggest attack on civil liberties for 300 years.", "hermes3:3b": "Anti-terror controls set for parliamentary test; opposition parties worry about politicians ordering house arrest without judge's consent, fearing miscarriages of justice.", "stablelm-zephyr:3b": "The Prevention of Terrorism Bill, proposing \"control orders\" and other measures for terror suspects under house arrest, faces potential opposition from Tories, Lib Dems, and some Labour MPs in Parliament. Home Secretary Charles Clarke asserts that the powers are necessary to counter terrorism threats, but opponents argue that only judges should have the authority to order detention of UK citizens. The bill will be debated in the Commons and then face a challenge in the House of Lords. Critics claim that granting politicians the power to deprive individuals of freedom is a significant threat to civil liberties.", "chatgpt-4o-latest": "Plans to allow Home Secretary Charles Clarke to place terror suspects under house arrest without trial face opposition from the Tories, Lib Dems, and some Labour MPs, who argue that only judges should have such authority. The Prevention of Terrorism Bill proposes \"control orders\" including house arrest, curfews, and electronic tagging. Critics warn of potential miscarriages of justice and an unprecedented attack on civil liberties. Clarke insists the powers are necessary for national security and would be reviewed by a judge within seven days. The government is expected to win the Commons vote but faces resistance in the House of Lords. Opposition MPs criticize the rushed debate and argue that decisions should be based on stronger evidence. Clarke maintains that security services support the measures, emphasizing the ongoing terror threat.", "stablelm2:1.6b": "The first test of a proposed anti-terror plan is scheduled for Parliament, where Conservatives, Lib Dems, and some Labour MPs are expected to vote against allowing Home Secretary Charles Clarke to house arrest terror suspects without trial. The Prevention of Terrorism Bill proposes \"control orders\" in serious cases, curfews, electronic tagging, and limits on telephone and internet access for other suspects, initially imposed by the home secretary. Critics argue that this undermines civil liberties; however  the government plans to pass the bill into law. The current foreign terror detainees mostly held at Belmarsh prison are due to expire on March.", "granite3.1-dense:2b": "The Prevention of Terrorism Bill, introduced by Home Secretary Charles Clarke, faces a crucial test in Parliament as it seeks to authorize \"control orders\" for terror suspects, including house arrest without trial. This proposal is opposed by the Conservatives, Liberal Democrats, and some Labour MPs who argue that only judges should have the power to detain citizens due to concerns about potential miscarriages of justice. Critics claim these measures represent a significant erosion of civil liberties for 300 years. Opposition parties are concerned that politicians, rather than judges, would initially decide on detention, citing the Guildford Four case as an example of such risks. Despite Clarke's assurance that he won't use these powers immediately and each decision will be reviewed by a judge within seven days, opponents remain skeptical about the implications for individual rights. The government aims to win the vote in the Commons but faces a battle in the House of Lords.", "reference": "Mr Clarke says he does not intend to use the house arrest powers now - even for the 11 current terror detainees.Plans to allow Home Secretary Charles Clarke to place terror suspects under house arrest without trial are set for their first real test in Parliament.Mr Clarke says the powers are needed to counter terror threats.He questioned why there was \"such a rush\" to introduce the legislation when Mr Clarke had indicated he was not planning to use the house arrest powers straight away.The new powers, designed to replace the existing laws and meet the Law Lords' concerns, would apply to British as well as foreign terror suspects.In a rare move, the Tories and Lib Dems have jointly tabled a motion opposing the new bill, saying the house arrest plans are \"excessive\".The two opposition parties are particularly worried that the control orders would initially be imposed on the say-so of the home secretary, rather than a judge.It proposes \"control orders\", which would mean house arrest in the most serious cases, and curfews, electronic tagging and limits on telephone and internet access for other suspects.Opposition MPs are also angry they will have only two days - Wednesday and next Monday - to debate the new plans before they pass to the House of Lords.Mr Clarke said the security services and police backed his measures and it would be \"rash and negligent\" to ignore their advice."}