{"raw_text": "Blair rejects Iraq advice calls\n \n Tony Blair has rejected calls for the publication of advice on the legality of the Iraq war amid growing calls for an investigation.\n \n The prime minister told his monthly press conference the matter had been dealt with by the Attorney General. Earlier, Conservative MP Michael Mates joined calls for a probe into claims Lord Goldsmith's statement to Parliament was drawn up at Number 10. Mr Blair said the statement was a \"fair summary\" of Lord Goldsmith's opinion.\n \n \"That's what he (Lord Goldsmith) said and that's what I say. He has dealt with this time and time and time again,\" Mr Blair told his monthly news conference in Downing Street. He refused to answer further questions on the issue, saying it had been dealt with \"literally scores of times and the position has not changed\". Lord Goldsmith has denied being \"leaned on\" and says the words written were his.\n \n The government refuses to publish his advice on the legality of the war - saying such papers have always been kept confidential. Mr Mates, who is a member of the Commons intelligence and security committee and was part of the Butler inquiry into pre-war intelligence, told the BBC on Friday: \"That, as a general rule, is right, but it's not an absolute rule.\" He said there had been other occasions when advice had been published, most recently regarding Prince Charles's marriage plans. The government could not pick and choose when to use the convention, he said.\n \n Mr Mates added: \"We discovered that there were two or three occasions in the past when law officers' advice to the government has been published. \"And this may be one of those special occasions... when it would be in the public interest to see the advice which the attorney general gave to the prime minister.\" This is argument was rejected by Mr Blair, who said: \"Firstly, we haven't broken the precedent, and secondly Peter Goldsmith has made his statement and I have got absolutely nothing to add to it.\" In a book published this week, Philippe Sands QC, a member of Cherie Blair's Matrix Chambers, says Lord Goldsmith warned Tony Blair on 7 March 2003 that the Iraq war could be illegal without a second UN resolution sanctioning military action.\n \n But a short statement about Lord Goldsmith's position was presented in a written parliamentary answer on 17 March 2003 - just before a crucial Commons vote on the military action. Mr Sands' book suggests it was actually written by Home Office Minister Lord Falconer and Downing Street adviser Baroness Morgan. Former minister Clare Short, who resigned from the government over the Iraq war, said it was the same statement that was earlier shown to the cabinet as it discussed military action. She told the BBC the full advice should have been attached, according to the ministerial code.\n \n \"My view is we need the House of Lords to set up a special committee, summon the attorney, get all the papers out, look at exactly what happened,\" she said. The Conservatives and Liberal Democrats say they want the publication of the full legal advice given by the Attorney General. On Thursday, Lord Goldsmith said his statement had not been \"written by or at Number 10\". \"In my parliamentary answer on March 17 2003, I explained my genuinely held independent view, that military action was lawful under the existing Security Council resolutions,\" he said.\n", "llama3.2:1b": "Tony Blair has rejected calls for the publication of advice on the legality of the Iraq war, citing that such papers are confidential. He claims the matter has been dealt with by Attorney General Peter Goldsmith and that his statement was factual. The government refuses to publish Goldsmith's advice due to a convention requiring confidentiality. This is despite the existence of other occasions when law officers' advice on this subject had been published.", "llama3.2:3b": "Tony Blair rejects calls for publication of advice on Iraq war legality amid growing demand for investigation into Lord Goldsmith's statement.", "gemma2:2b": "Tony Blair has refused calls for publication of legal advice regarding the Iraq war, arguing it was previously dealt with by Attorney General and no change in position exists. Conservative MP Michael Mates argues that precedent allows publication of such advice, citing cases where it was published for Prince Charles' marriage. \nPhilippe Sands QC's book claims Lord Goldsmith warned Blair about legality before a crucial vote in parliament, prompting calls for the release of full legal advice. Clare Short criticizes the government's handling of the situation and suggests an inquiry by the House of Lords to ensure transparency. \nLord Goldsmith states his parliamentary answer on March 17 2003 reflects his independent view on military action being lawful under existing Security Council resolutions, while denying being \"leaned on\".  \n", "qwen2.5:0.5b": "Tony Blair rejected calls for the publication of advice on Iraq's legality and said Lord Goldsmith's statement about his actions had been dealt with by the Attorney General in previous times. He claimed there were no special occasions when law officers' advice had been published. The government maintains they will not publish the full legal advice provided by the Attorney General, but Blair argues it is their right to keep it confidential and believes Lord Goldsmith's statement was his original opinion on the matter.", "qwen2.5:1.5b": "Blair rejects calls for Iraq war legality advice to be published amid criticism of Lord Goldsmith's statement and former MP calls for a parliamentary investigation. Blair defends his Attorney General's \"fair summary\" while refusing to publish the full legal advice, maintaining it had been previously handled \"literally scores of times.\" Conservative MP Mates argues for publishing past law officer advisories when relevant, citing previous instances like Prince Charles's marriage plans. Lord Goldsmith denies being \"leaned on,\" stating he has dealt with similar statements multiple times.", "qwen2.5:3b": "Tony Blair has rejected calls for publication of legal advice on Iraq war, stating it had been dealt with by Attorney General. Michael Mates called for an investigation, citing Lord Goldsmith's statement to Parliament as drawn up at Number 10. However, the government maintains confidentiality and refuses to publish papers. Critiques suggest the advice should have been made public more transparently; Blair disagreed, stating there was no precedent change. Former minister Clare Short calls for a special committee to look into the matter. Lord Goldsmith insists his statement was not written by Number 10, maintaining it reflected his independent view.", "opencoder:1.5b": "Blair rejects Iraq advice calls.\n\nTony Blair has rejected calls for the publication of advice on the legality of the Iraq war amid growing calls for an investigation.\n\nThe prime minister told his monthly press conference the matter had been dealt with by the Attorney General. Earlier, Conservative MP Michael Mates joined calls for a probe into claims Lord Goldsmith's statement to Parliament was drawn up at Number 10. Mr Blair said the statement was a \"fair summary\" of Lord Goldsmith's opinion.\n\nMr Blair refused to answer further questions on the issue, saying it had been dealt with \"literally scores of times and the position has not changed\". Lord GoldSmith has denied being \"leaned on\" and says the words written were his. \n\nThe government refuses to publish his advice on the legality of the war - saying such papers have always been kept confidential.\n\nMr Mates, who is a member of the Commons intelligence and security committee and was part of the Butler inquiry into pre-war intelligence, told the BBC on Friday: \"That, as a general rule, is right, but it's not an absolute rule.\" He said there had been other occasions when advice had been published, most recently regarding Prince Charles's marriage plans. The government could not pick and choose when to use the convention, he said.\n\nMr Mates added: \"We discovered that there were two or three occasions in the past when law officers' advice to the government has been published. And this may be one of those special occasions... when it would be in the public interest to see the advice which the attorney general gave to the prime minister.\" This is argument was rejected by Mr Blair, who said: \"Firstly, we haven't broken the precedent, and secondly Peter Goldsmith has made his statement and I have got absolutely nothing to add to it.\"\n\nIn a book published this week, Philippe Sands QC, a member of Cherie Blair's Matrix Chambers, says Lord GoldSmith warned Tony Blair on 7 March 2003 that the Iraq war could be illegal without a second UN resolution sanctioning military action.\n\nBut a short statement about Lord GoldSmith's position was presented in a written parliamentary answer on 17 March 2003 - just before a crucial Commons vote on the military action. Mr Sands' book suggests it was actually written by Home Office Minister Lord Falconer and Downing Street adviser Baroness Morgan. Former minister Clare Short, who resigned from the government over the Iraq war, said it was the same statement that was earlier shown to the cabinet as it discussed military action. She told the BBC the full advice should have been attached, according to the ministerial code.\n\n\"My view is we need the House of Lords to set up a special committee, summon the attorney, get all the papers out, look at exactly what happened,\" she said. The Conservatives and Liberal Democrats say they want the publication of the full legal advice given by the Attorney General. On Thursday, Lord GoldSmith said his statement had not been \"written by or at Number 10\". \"In my parliamentary answer on March 17 2003, I explained my genuinely held independent view, that military action was lawful under the existing Security Council resolutions,\" he said.\n", "smollm:1.7b": "The summary is:\n\nTony Blair rejects calls for an investigation into the legality of the Iraq war and refuses to answer questions about his advice on the matter. He says that Lord Goldsmith's statement has been dealt with by the Attorney General, but does not say what happened next. The prime minister said that Lord Goldsmith had written a fair summary of his position, saying it was based on \"what he said and what I said\".\n\nThe government refuses to publish its advice on the legality of the war - saying such papers have always been kept confidential. Mr Mates, who is a member of the Commons intelligence and security committee and was part of the Butler inquiry into pre-war intelligence, told the BBC on Friday: \"That, as a general rule, is right, but it's not an absolute rule.\" He said there had been other occasions when law officers' advice to the government has been published. The government could not pick and choose when to use the convention, he said.\n\nMr Mates added: \"We discovered that there were two or three occasions in the past when law officers' advice to the government has been published. And this may be one of those special occasions... when it would be in the public interest to see the advice which the attorney general gave to the prime minister.\" This is argument was rejected by Mr Blair, who said: \"Firstly, we haven't broken the precedent, and secondly Peter Goldsmith has made his statement and I have got absolutely nothing to add to it.\" In a book published this week, Philippe Sands QC, a member of Cherie Blair's Matrix Chambers, says Lord Goldsmith warned Tony Blair on 7 March 2003 that the Iraq war could be illegal without a second UN resolution sanctioning military action.\n\nBut a short statement about Lord Goldsmith's position was presented in a written parliamentary answer on 17 March 2003 - just before a crucial Commons vote on the military action. Mr Sands' book suggests it was actually written by Home Office Minister Clare Short, who resigned from the government over the Iraq war, and Downing Street adviser Baroness Morgan.\n\nFormer minister Clare Short said it was the same statement that was earlier shown to the cabinet as it discussed military action. She told the BBC the full legal advice should have been attached, according to the ministerial code.", "deepseek-r1:1.5b": "<think>\nAlright, let me break down what the user is asking for here. They want a summary of a text about Blair rejecting Iraq advice calls and some diplomatic actions by Goldsmith. Hmm, okay.\n\nFirst, I need to read through the provided text carefully to extract the key points. The main arguments are about Blair refusing to publish advice on the Iraq war's legality and the stance of Lord Goldsmith. \n\nI notice that Blair specifically mentioned referring to the attorney general's advice as \"a fair summary.\" That seems like a crucial point because it highlights Blair's refusal to provide detailed legal information. I should make sure to include that.\n\nThen, there are mentions of Mates from the Commons committee and his comments on when advice was published. He emphasized that such statements were often made at Number 10 rather than Downing Street, which adds historical context. This is important because it shows the patterns in diplomatic interactions.\n\nLord Goldsmith's denial and the specific instances where he spoke about King Charles's marriage are also key points. It's essential to mention these because they illustrate the internal conflict within British intelligence regarding public statements.\n\nFinally, Sands' book provides an interesting perspective by suggesting that the statement could have been produced by a private official like Baroness Morgan or Falconer, rather than the traditional government outlets. This offers a different viewpoint on the issue and ties in some external sources.\n\nPutting it all together, I need to condense this into a concise summary that includes Blair's refusal, Mates' observations, Goldsmith's denial, the specific cases involving King Charles, and Sands' analysis of the possibility of private production.\n</think>\n\nBlair has refused to publish advice on the legality of the Iraq war, specifically refusing calls for guidance from UK intelligence. His monthly press conference stated that the matter had been dealt with by the Attorney General, while Goldsmith denied being \"leaned on\" and suggested his statements were drawn at Number 10 rather than Downing Street.", "tinyllama:1.1b": "Tony Blair rejected calls for the publication of advice given by Lord Goldsmith on the legality of the Iraq war amid growing calls for an investigation, stating that it had been dealt with \"literally scores of times and the position has not changed\". This came after Michael Mateus, a member of the Commons Intelligence and Security Committee and one of Tony Blair's private members, accused the government of not publishing his advice. However, Blair refused to give an explanation for the government's decision not to publish the full legal advice given by Lord Goldsmith.", "tinydolphin:1.1b": " Blair rejects Iraq advice calls, claims publication would be in public interest \n\nTony Blair has rejected calls for the publication of advice on the legality of the Iraq war amid growing demands for an investigation. In a statement published earlier this month, Michael Mates expressed his disagreement with the Attorney General's opinion. However, Prime Minister Tony Blair argued that the statement was a fair summary of Lord Goldsmith's opinion. In response to increasing pressure to release the full legal advice given by the attorney general, Mr. Blair maintained his stance, stating that it had been dealt with \"literally scores of times and the position has not changed\". He also refuted suggestions that publication would be in the public interest, asserting that it could only happen when it is in the public's best interest to see what was said.", "phi:2.7b": " Tony Blair has rejected calls for an investigation into the legality of the Iraq war. The Attorney General dealt with a statement made by Lord Goldsmith regarding the war's legality and Mr Blair has stated that it is his position on the matter, which has been dealt with \"scores\" of times. The government refuses to publish Lord Goldsmith's advice as he has kept such papers confidential in the past. However, there have been instances where law officers' advice was published, most recently regarding Prince Charles's marriage plans. MP Michael Mates is calling for a probe into Lord Goldsmith's statement. Mr Sands QC says that Lord Goldsmith warned Tony Blair of the potential illegality of the Iraq war on March 7th, 2003. A short statement about Lord Goldsmith's position was presented in a written parliamentary answer on March 17th, just before a crucial Commons vote on the military action. The full legal advice given by the Attorney General has not been published and former minister Clare Short has called for it to be attached to the statement as per the ministerial code. Conservative and Liberal Democrat parties are also calling for the publication of the full legal advice.\n", "orca-mini:3b": " Blair rejects calls for Iraq advice to be published, saying there has been no breach of the law or precedent by not publishing Lord Goldsmith's statement on the legality of the Iraq war. However, he is facing growing demands for an investigation into claims that his advisers were \"leaned on\" to change their opinion and for the publication of all legal advice given to the government. The government has refused to publish the advice, saying it is confidential, but some MPs believe there may be other occasions when law officers' advice to the government has been published and this could be one of those special occasions.", "hermes3:3b": "Tony Blair rejects calls for publishing Iraq war advice advice publication despite growing demand for investigation and Conservative MP Michael Mates' suggestion that it might be one of the special occasions where law officers' advice could be published in public interest.", "stablelm-zephyr:3b": "Tony Blair has consistently rejected calls to publish advice on the legality of the Iraq war amid increasing demands for an investigation. He stated that the matter had been dealt with multiple times by Attorney General Lord Goldsmith, and refused to provide further information or comments on the issue. Conservative MP Michael Mates argued that there may be instances when legal advice is published, but not in this case since it would be in the public interest. A book suggests that Lord Goldsmith warned Blair that the war could be illegal without a second UN resolution sanctioning military action, and that a similar statement was presented just before a crucial Commons vote on military action. However, Blair emphasized that they hadn't broken any precedent, and the government's stance is that such papers have always been confidential.", "chatgpt-4o-latest": "Tony Blair rejected calls to publish legal advice on the Iraq war, insisting the matter had been addressed by Attorney General Lord Goldsmith. Amid growing demands for an investigation, Blair maintained that Goldsmith's statement to Parliament was a fair summary of his opinion. Conservative MP Michael Mates argued that legal advice had been published in other cases and suggested this instance warranted transparency. A book by Philippe Sands QC claimed Goldsmith initially warned Blair that the war might be illegal without a second UN resolution, but a later statement—allegedly influenced by Downing Street—presented a different stance. Former minister Clare Short and opposition parties called for full disclosure, but Blair and Goldsmith denied any undue influence, with Goldsmith asserting his statement reflected his independent legal view.", "stablelm2:1.6b": "Tony Blair rejects publication of advice about the legality of the Iraq war due to calls for an investigation. The Attorney General has been involved in numerous decisions on the matter. The government maintains that such papers are confidential. Conservative MP Michael Mates suggests there have been other occasions when advice was published, including on Prince Charles' marriage plans. Philippe Sands QC's book reveals that Lord Goldsmith warned Blair about the legality of the war on 7 March. Former minister Clare Short urges a special House of Lords committee to investigate. Lord Goldsmith disputes claims that he was \"leaned on\". The Conservative and Liberal Democratic parties demand publication of the full legal advice.", "granite3.1-dense:2b": "Tony Blair has refused to publish legal advice given by Attorney General Lord Goldsmith regarding the legality of the 2003 Iraq War, despite growing calls for an investigation into whether the statement was prepared at Number 10. Conservative MP Michael Mates and former minister Clare Short have called for a probe due to concerns that the advice was not independently formulated but influenced by government officials. Blair maintains that Lord Goldsmith's parliamentary statements were fair summaries of his opinions, which have not changed over time. Philippe Sands, in a recent book, claims Lord Goldsmith warned Blair about potential war illegality without the second UN resolution but limited the advice to a brief written statement presented before a crucial Commons vote on military action. Sands and Short argue that full legal advice should have been made available, according to ministerial code. The Conservatives and Liberal Democrats support publication of the complete legal counsel given by Lord Goldsmith.", "reference": "Mr Blair said the statement was a \"fair summary\" of Lord Goldsmith's opinion.On Thursday, Lord Goldsmith said his statement had not been \"written by or at Number 10\".Former minister Clare Short, who resigned from the government over the Iraq war, said it was the same statement that was earlier shown to the cabinet as it discussed military action.But a short statement about Lord Goldsmith's position was presented in a written parliamentary answer on 17 March 2003 - just before a crucial Commons vote on the military action.This is argument was rejected by Mr Blair, who said: \"Firstly, we haven't broken the precedent, and secondly Peter Goldsmith has made his statement and I have got absolutely nothing to add to it.\"\"That's what he (Lord Goldsmith) said and that's what I say.Lord Goldsmith has denied being \"leaned on\" and says the words written were his.In a book published this week, Philippe Sands QC, a member of Cherie Blair's Matrix Chambers, says Lord Goldsmith warned Tony Blair on 7 March 2003 that the Iraq war could be illegal without a second UN resolution sanctioning military action.Mr Sands' book suggests it was actually written by Home Office Minister Lord Falconer and Downing Street adviser Baroness Morgan.Mr Mates added: \"We discovered that there were two or three occasions in the past when law officers' advice to the government has been published."}