{"raw_text": "Security papers 'found in street'\n \n An inquiry is under way after files containing security details about the Pakistani president's visit to London were found by a member of the public.\n \n The files are believed to contain detailed security arrangements for Gen Pervez Musharraf's visit this week, including police codes. Scotland Yard said the policing operation had been reviewed. A spokesman said President Musharraf's safety had not been compromised, as the papers had been handed in promptly. \"We cannot discuss who was responsible for the documents, only that they contained the policing arrangements for the official visit,\" said the spokesman.\n \n The papers are believed to have been found by a member of the public in a street in Mayfair and given to the Mirror newspaper. The police spokesman said the newspaper handed the report over on Monday. The force's Directorate of Professional Standards is investigating the circumstances surrounding the loss of the documents, he said. Gen Musharraf held talks with Tony Blair on Monday. He arrived in Britain on Sunday night after flying from the United States, where he met President George W Bush. He is due to visit the Pakistani community in Manchester on Tuesday afternoon.\n", "llama3.2:1b": "Papers containing security details about Pakistan's president Pervez Musharraf's visit to London were found by a member of the public and handed over to the Mirror newspaper. The police have reviewed the files, but the identity of the person responsible for losing them has not been disclosed. Scotland Yard is investigating how the papers were lost, with General Musharraf's safety not being compromised due to the incident.", "llama3.2:3b": "Security papers containing detailed security arrangements for Pakistani president Gen Pervez Musharraf's visit to London were found by a member of the public and handed over to the Mirror newspaper. The papers included police codes, but President Musharraf's safety was not compromised as they were turned in promptly. Scotland Yard is reviewing policing operations and investigating the loss of the documents after the incident during Gen Musharraf's official visit to Britain.", "gemma2:2b": "Security documents about President Musharraf's visit to London were found by a member of the public and given to the Mirror newspaper. Scotland Yard is reviewing the situation and has stated that President Musharraf’s safety hasn’t been compromised. The police are investigating who lost the documents. \n", "qwen2.5:0.5b": "Key points:\n\n  * Security papers found at a London event\n  * Police code details for Gen Pervez Musharraf's visit\n  * Files believed to contain policing arrangements\n  * Found by a member of the public, given to Mirror newspaper\n  * Scottish Yard reviewed but no specific person responsible mentioned\n  * Force's Directorate of Professional Standards is investigating circumstances", "qwen2.5:1.5b": "Security papers containing details about Pakistan's president's upcoming trip to London were found by a passerby in Mayfair and handed over to the Mirror newspaper on Monday. The papers are believed to include security arrangements, including police codes, for Gen Musharraf's visit. The force is investigating the circumstances surrounding the loss of the documents.", "qwen2.5:3b": "Security papers containing detailed arrangements for Pakistan's president Pervez Musharraf's London visit were found by a member of the public and handed to the Mirror newspaper. The documents included police codes and are believed to have been lost during an official visit. Scotland Yard reported that President Musharraf’s safety was not compromised as they were returned promptly. The Directorate of Professional Standards is investigating how the papers came to be lost, which reportedly happened in Mayfair. Gen Musharraf had previously met with Tony Blair and George W Bush before arriving in Britain on Sunday night. He is scheduled to visit Manchester's Pakistani community on Tuesday afternoon.", "opencoder:1.5b": "Security papers found in street contain detailed security arrangements for a public visit by Gen Pervez Musharraf, including information about Pakistan's President's London visit. The documents are handed over promptly and do not discuss who was responsible or why certain actions were carried out. The papers are given to the Mirror newspaper in a safe location. The investigation into the loss of the documents is ongoing by a police department specialist. Gen Musharraf meets with Tony Blair on Monday, and he returns to the United States on Sunday night after flying back to Britain.\n", "smollm:1.7b": "Security papers found in street by member of public: Security details for Pakistani president's visit to London were leaked to newspaper. Police investigation into who was responsible for the documents and their contents revealed that they contained policing arrangements for official visit. The police spokesperson said President Musharraf's safety had not been compromised as the papers had been handed in promptly. \"We cannot discuss who was responsible for the documents, only that they contained the policing arrangements for the official visit,\" said the spokesman.\n", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text into a concise summary. Let me read through it carefully.\n\nThe first sentence mentions security papers found in street. That's straightforward. The second part talks about an inquiry after files were found by a public member. It explains that the documents contain details about Gen Musharraf's visit and include police codes. Scotland Yard reviewed the operation, but they didn't discuss who did it. The Mirror newspaper handed the report over on Monday.\n\nThe third paragraph discusses the findings in Mayfair, where a public member found them. The spokesperson says President Musharraf was safe because they were handed in promptly. A spokesman from the police said the documents contain policing arrangements for his visit. He met with Tony Blair and then is visiting Manchester.\n\nSo, to summarize concisely: They found security papers in Mayfair containing documents about Gen Musharraf's visit to London, which were delivered by a newspaper. The papers indicated specific police actions taken. The incident was part of an inquiry into Musharraf's safety.\n</think>\n\nThe security papers, believed to contain details of Gen Musharraf's visit to London, were found in Mayfair and handed over by the Mirror newspaper on Monday. A spokesperson said the documents contained specific police arrangements for the visit.", "tinyllama:1.1b": "Key Ideas: The documents containing security details about Gen Pervez Musharraf's official visit to London were reportedly found by a member of the public and handed over to the Mirror newspaper. The papers contain policing arrangements, which have not been explained or discussed in detail, indicating they are sensitive and potentially compromising information. The inquiry is under way as a precautionary measure.", "tinydolphin:1.1b": " This text is about a recent security incident involving a journalist who found out that the security details for Gen Pervez Musharraf's visit to London have been \"found in the street\". The police say they are reviewing the situation but don't want to discuss specific individuals involved.", "phi:2.7b": " A member of the public found security papers about Gen Pervez Musharraf's London visit and gave them to the Mirror newspaper. The police are investigating who lost the files but say President Musharraf's safety was not compromised as they were handed in promptly. Scotland Yard is reviewing the policing operation for his visit.\n", "orca-mini:3b": " Security papers containing details about Pakistan's president's visit to London were found by a member of the public and handed over to the Mirror newspaper. The police reviewed the policing operation for Gen Pervez Musharraf's safety, and it was not compromised as he arrived in Britain with the files.", "hermes3:3b": "Security papers about Pakistani president's visit found in street. Inquiry launched over lost documents containing police codes and security arrangements.", "stablelm-zephyr:3b": "Summary: Security papers containing detailed arrangements for Pakistani President Gen Pervez Musharraf's London visit were found by a member of the public in Mayfair. The documents, which also included police codes, were handed to the Mirror newspaper and sparked an investigation by the force's Directorate of Professional Standards. Scotland Yard confirmed that President Musharraf's safety had not been compromised as the papers were promptly reported.", "chatgpt-4o-latest": "An inquiry is underway after security files detailing arrangements for Pakistani President Pervez Musharraf's visit to London were found in the street by a member of the public. The documents, which included police codes, were handed to the Mirror newspaper and then given to the police. Scotland Yard reviewed the security operation and stated that Musharraf's safety was not compromised. The Directorate of Professional Standards is investigating the loss. Musharraf, who arrived in Britain after visiting the U.S., met with Tony Blair and is scheduled to visit the Pakistani community in Manchester.", "stablelm2:1.6b": "Files containing security details about the Pakistani president's visit to London were found by a member of the public; believed to contain detailed security arrangements for Gen Pervez Musharraf's upcoming visit, including police codes. No safety was compromised as the papers were handed over promptly; President Musharraf's safety was not at risk. The papers were found in Mayfair street and given to the Mirror newspaper. Police are investigating who lost them, with President Musharraf meeting Tony Blair and discussing meetings with George W Bush in the US before arriving in Britain. Gen Musharraf is scheduled to visit the Pakistani community in Manchester on Tuesday afternoon.", "granite3.1-dense:2b": "Security documents pertaining to Pakistani President Gen Pervez Musharraf's upcoming London visit, containing police codes and security arrangements, were discovered by a public member in Mayfair and reported to the Mirror newspaper. The files are believed to have been lost, sparking an investigation by Scotland Yard's Directorate of Professional Standards into the incident. Despite the loss, Musharraf's safety is assured as the policing operation has been reviewed, and his security details remain intact for his scheduled meetings with Tony Blair and a Pakistani community event in Manchester on Tuesday.", "reference": "The police spokesman said the newspaper handed the report over on Monday.\"We cannot discuss who was responsible for the documents, only that they contained the policing arrangements for the official visit,\" said the spokesman.A spokesman said President Musharraf's safety had not been compromised, as the papers had been handed in promptly.The files are believed to contain detailed security arrangements for Gen Pervez Musharraf's visit this week, including police codes.An inquiry is under way after files containing security details about the Pakistani president's visit to London were found by a member of the public."}