{"raw_text": "Howard 'truanted to play snooker'\n \n Conservative leader Michael Howard has admitted he used to play truant to spend time with his school friends at a snooker hall.\n \n Mr Howard said his time at Jack's Snooker Hall in Llanelli in the 1950s had not done him \"any lasting damage\". But he told the Times Educational Supplement that truancy was \"very bad\" and said \"firm action\" was needed. Mr Howard also called for a return to O-levels and more classroom discipline.\n \n Mr Howard eventually left Llanelli Grammar School - and the snooker hall - to go to Cambridge University. He said: \"I don't think it's done me any lasting damage. Nor has it made me a snooker world champion. \"There might have been some occasions when we left early of an afternoon.\n \n \"I'm just being honest. I think truancy is a very bad thing and that firm action should be taken to deal with it.\" Another player who has failed to win snooker's world championship - Jimmy \"the Whirlwind \" White - has previously admitted missing lessons, instead spending his days in smoky halls. \"Tony Meo [another player] and me used to spend all of our spare time there,\" Mr White said, \"We loved the game and the atmosphere. \"School went out of the window. I went for a while and then started taking time off.\" Mr Howard's fellow Welshman Ray Reardon - known by his fellow professionals as \"Dracula\" - won the snooker world championship six times, having left school at 14 to work as a miner. And Terry Griffiths, like Mr Howard from Llanelli, won the tournament in 1979. It is not known whether the two of them ever clashed cues at Jack's.\n", "llama3.2:1b": "Michael Howard, a Conservative leader, admitted to truancing to play snooker and spend time with friends at a local hall. He said he didn't think it did him \"any lasting damage\" but called for more classroom discipline. Howard left school at 15 to attend Cambridge University.", "llama3.2:3b": "Michael Howard admitted to playing truant to spend time with friends at a snooker hall in the 1950s, calling it \"very bad\" and advocating for firm action against truancy. He left school for Cambridge University after leaving the hall.", "gemma2:2b": "Michael Howard admitted to truancy while attending a snooker hall in his youth. He now advocates for stricter disciplinary measures and traditional O-level education. Notable professional players like Jimmy White and Ray Reardon, who did not excel in academics but achieved success in snooker, provide counter examples. \n", "qwen2.5:0.5b": "Conservative politician Michael Howard admitted truancy while at snooker hall to spend time with school friends and called for stricter action against the issue.", "qwen2.5:1.5b": "Michael Howard admitted he truanted snooker during school years but regrets it now and calls for stricter discipline measures. He left school to pursue his passion later.", "qwen2.5:3b": "Conservative leader Michael Howard admitted he used to play truant to spend time at a snooker hall in Llanelli during the 1950s. While he claimed it did not harm him, he advocated for firm action against truancy and called for O-levels and better classroom discipline. Howard left school to attend Cambridge University but noted there were occasions when they would leave early in the afternoon. Other players like Jimmy \"the Whirlwind\" White also mentioned their time at snooker halls led them to miss lessons, although they never became world champions. Welsh professionals Ray Reardon and Terry Griffiths both won the championship despite leaving school earlier.", "opencoder:1.5b": "Constituting a summary, Howard 'tranted to play snooker' with Mr Howard’s remarks about truant times, his time at Jack's Snooker Hall and the negative impacts he faced on society. He also mentioned that Mr Howard left Llanelli Grammar School and returned to Cambridge University, suggesting that he was no longer a part of Llanelli. He also said he felt that firm action should be taken to deal with truancy.\n", "smollm:1.7b": "The summary above should be concise and preserve key ideas and details:\n\n1. Howard 'truanted to play snooker'\n2. Conservative leader Michael Howard has admitted he used to play truant to spend time with his school friends at a snooker hall.\n3. Mr Howard said his time at Jack's Snooker Hall in the 1950s had not done him \"any lasting damage\". But he told the Times Educational Supplement that truancy was \"very bad\" and said \"firm action\" was needed.\n4. Mr Howard also called for a return to O-levels and more classroom discipline.\n5. Mr Howard eventually left Llanelli Grammar School - and the snooker hall - to go to Cambridge University. He said: \"I don't think it's done me any lasting damage. Nor has it made me a snooker world champion.\" There might have been some occasions when we left early of an afternoon.\n6. I'm just being honest. I think truancy is a very bad thing and that firm action should be taken to deal with it.\n7. I used to spend my days in smoky halls. I loved the game and the atmosphere. School went out of the window. I went for a while and then started taking time off.\n8. The two of them ever clashed cues at Jack's?", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Mr. Michael Howard who used to play snooker as a truant. Let me read through it carefully.\n\nFirst, Howard says he played truant in snooker hall for his school friends back in the 1950s. He claims that his time there didn't cause any lasting damage, which is interesting because I know some people use truancy to keep busy. But Mr. Howard also admitted that truancy was very bad and that he needed more firm action. That makes sense; sometimes even good intentions can lead to problems.\n\nHe mentions leaving Llanelli Grammar School after school in 1958. There, he played snooker, but he eventually left for Cambridge University. He said it wasn't doing him any harm and he doesn’t think he’ll win a snooker world championship. That's quite a contrast. I wonder why people might say he didn’t win. Maybe because he was busy with truancy?\n\nAnother player, Jimmy White, who failed to win the championship, admitted missing lessons instead of going to snooker hall. He used to spend his time there and loved the game. I remember seeing some stories about him in school, maybe he was really into it.\n\nMr. Howard's fellow Welshman, Ray Reardon, won the world title at 14 after working as a miner. I think that's not true because when I looked up, Ray was actually a sportsman, but his career path is a bit off. Terry Griffiths from Llanelli also won in 1979, so maybe they had some interactions? But the text doesn't mention it.\n\nSo putting this all together, Howard was busy for good, which led to a lot of negative consequences. He's leaving Cambridge because he didn't do anything wrong, even though he played snooker. Other players have missed games because of this truancy thing, and some are still serious about their sports careers, like Ray Reardon.\n\nI should make sure I capture the main points: Howard's truancy history, his actions at snooker hall, his decision to leave for university, his opinions on truancy being bad, and other players' experiences. Also, mention that he didn't win a championship but others did.\n</think>\n\nHoward 'truanted to play snooker' after playing it as a truant back in the 1950s at Llanelli Grammar School. He claims his time there didn’t cause lasting damage, yet he admits truancy was bad and urged more action. He left Cambridge University after leaving school in 1958 to study snooker at university, believing it wasn’t doing him any harm. Despite this, he doesn’t think he’ll win a championship or leave behind legacy. Other players like Jimmy White had similar experiences of missing games due to truancy, while Ray Reardon and Terry Griffiths are serious about their sports careers, with Reardon winning at 14 after mining.\n\n**Summary:**\n\n- Howard used snooker as a truant in the 1950s.\n- He claims his time there didn’t cause harm but admitted truancy was bad.\n- Howard left Cambridge for school in 1958 and stayed busy, not winning a championship.\n- Jimmy White missed games due to truancy.\n- Ray Reardon won snooker at 14 after mining.\n- Terry Griffiths also won in 1979, but their careers differ.\n\nHoward's story reflects negative consequences of truancy leading to long-term issues.", "tinyllama:1.1b": "Conservative leader Michael Howard has admitted using to play truancy as a school friend at a snooker hall in the 1950s. He admitted that his time there was not doing him any lasting damage and that firm action was needed, adding that classroom discipline should be improved. The Conservative leader left Llanellli Grammar School for Cambridge University after failing to win the snooker world championship as well as Jimmy \"the Whirlwind\" White, who admitted missing lessons, and Ray Reardon winning the snooker championship six times. Terry Griffiths won the tournament in 1979 without having had to miss school.", "tinydolphin:1.1b": " Based on this text, it appears that Howard Truet was a truant and used to play snooker with his school friends at a local snooker hall called Jack's. This practice likely did not have any long-lasting effects or led to significant academic issues. Mr. Howard said that truancy should be frowned upon, as it might negatively impact one's future education and personal growth. He also mentioned that he once left school at 14 to work in a mining field but later returned to complete his education. The snooker hall Jack's, where Howard Truet was truant, likely offered an environment where students could socialize and learn, similar to the experience Mr. Howard had there.", "phi:2.7b": " Michael Howard, a Conservative leader, admitted to playing truant to spend time with his school friends at a snooker hall when he was younger. He said it didn't have any lasting negative impact on him but called for firm action against truancy. Mr Howard also suggested returning to O-levels and more classroom discipline. Other players in the sport, such as Jimmy \"the Whirlwind\" White, had previously admitted missing lessons to play snooker. Ray Reardon and Terry Griffiths were other successful snooker players who left school at a young age to pursue their passion for the game.\n", "orca-mini:3b": " In the 1950s, Michael Howard was truant from school to spend time with his friends playing snooker at a local hall. He later went on to attend Cambridge University but admitted that truancy was a bad thing and called for firm action to be taken against it. Another player, Jimmy White, has also spoken about missing lessons and spending time playing snooker instead.", "hermes3:3b": "Sum of key points:\nHoward truanted to play snooker in 1950s, admitted truanting was bad and called for action against it.", "stablelm-zephyr:3b": "Conservative leader Michael Howard admitted to playing truant as a teenager to spend time at a snooker hall. He stated that his time at Jack's Snooker Hall in Llanelli, Wales, in the 1960s did not harm him and revealed that he does not think it made him a snooker world champion. Despite this, Howard emphasized that truancy is \"very bad\" and called for firm action to address it. He advocated for a return to O-levels and increased classroom discipline. The text also mentioned other professional players who skipped school to focus on their snooker careers, including Jimmy \"The Whirlwind\" White, Ray Reardon (\"Dracula\"), and Terry Griffiths.", "chatgpt-4o-latest": "Michael Howard admitted he played truant in the 1950s to visit Jack's Snooker Hall in Llanelli but said it caused him no lasting harm. However, he condemned truancy as \"very bad\" and called for firm action against it, along with a return to O-levels and stricter classroom discipline. Howard later left Llanelli Grammar School for Cambridge University. Snooker players Jimmy White and Tony Meo also skipped school to play, while Welsh champions Ray Reardon and Terry Griffiths had different paths to success. It is unclear if Howard and Griffiths ever played against each other at Jack's.", "stablelm2:1.6b": "Conservative leader Michael Howard admitted to truanting during his time at Jack's Snooker Hall in Llanelli, spending time with friends instead. He believes it didn.. . However, he later called for firm action and a return to O-levels. Howard eventually left school to attend Cambridge University, where he stated that truancy was \"very bad\" and \"firm action\" should be taken. A fellow Welsh player Ray Reardon won the snooker world championship six times, and Terry Griffiths also won once. It's unclear if they ever played together at Jack's.", "granite3.1-dense:2b": "Conservative leader Michael Howard revealed in an interview with The Times Educational Supplement that during his time at Llanelli Grammar School in the 1950s, he occasionally truanted to visit a local snooker hall, Jack's. Although he acknowledged it didn't cause him \"any lasting damage,\" Howard emphasized that truancy is detrimental and advocated for stricter measures against it. He also called for a return to O-levels and increased classroom discipline. Notable snooker players who skipped school in favor of the sport include Jimmy \"the Whirlwind\" White, Ray Reardon (\"Dracula\"), and Terry Griffiths (both from Llanelli). Despite their success as world champions, they left school early to pursue professional careers or mining jobs.", "reference": "Mr Howard said his time at Jack's Snooker Hall in Llanelli in the 1950s had not done him \"any lasting damage\".Mr Howard eventually left Llanelli Grammar School - and the snooker hall - to go to Cambridge University.Conservative leader Michael Howard has admitted he used to play truant to spend time with his school friends at a snooker hall.Mr Howard's fellow Welshman Ray Reardon - known by his fellow professionals as \"Dracula\" - won the snooker world championship six times, having left school at 14 to work as a miner.\"Tony Meo [another player] and me used to spend all of our spare time there,\" Mr White said, \"We loved the game and the atmosphere.And Terry Griffiths, like Mr Howard from Llanelli, won the tournament in 1979.Nor has it made me a snooker world champion."}