{"raw_text": "Short attacks US over tsunami aid\n \n Former Cabinet minister Clare Short has criticised the US-led tsunami aid coalition, saying the UN should be leading efforts.\n \n President Bush has announced that an alliance of the US, India, Australia and Japan will co-ordinate a humanitarian drive. But Ms Short said the effect of the parallel coalition would be to undermine the UN. She said only the UN had the \"moral authority\" to lead the relief work. Ms Short resigned as international development secretary over the Iraq war. \"I think this initiative from America to set up four countries claiming to co-ordinate sounds like yet another attempt to undermine the UN when it is the best system we have got and the one that needs building up,\" she said. \"Only really the UN can do that job,\" she told BBC Radio Four's PM programme. \"It is the only body that has the moral authority. But it can only do it well if it is backed up by the authority of the great powers.\" Ms Short said the countries involved could not boast good records on their response to major disasters. The US was \"very bad at coordinating with anyone\" and India had its own problems, Ms Short said. \"I don't know what that is about but it sounds very much, I am afraid, like the US trying to have a separate operation and not work with the rest of the world through the UN system,\" she added.\n", "llama3.2:1b": "Clare Short criticizes US-led tsunami aid coalition, saying UN should lead efforts; resigns as international development secretary over Iraq war. She claims US efforts would undermine UN's \"moral authority\".", "llama3.2:3b": "Clare Short criticizes the US-led tsunami aid coalition, saying only the UN should lead relief efforts due to its moral authority. The US alliance, involving the US, India, Australia, and Japan, undermines the UN's effectiveness, according to Short, who claims the US has poor coordination skills and India faces internal issues.", "gemma2:2b": "Clare Short criticizes the US-led tsunami aid coalition for undermining the UN's role and suggests that only the UN has the moral authority to lead relief efforts.  She believes the US, along with other countries like India, are poorly equipped to coordinate such a response, comparing it to their past record in handling international disasters. \n", "qwen2.5:0.5b": "Former Cabinet minister Clare Short criticized the US-led tsunami aid coalition, saying only the UN had moral authority. She advised an alliance of four countries instead.", "qwen2.5:1.5b": "Former UK Cabinet minister Clare Short criticizes US-led tsunami aid coalition as undermining UN's role in humanitarian efforts. Ms. Short suggests only the UN should lead relief operations due to its moral authority, while calling for US and other nations' involvement flawed.", "qwen2.5:3b": "Former Cabinet minister Clare Short criticised the US-led tsunami aid coalition, suggesting the UN should lead efforts instead. She claimed the new alliance undermined the UN's role. Short expressed concern about the UN’s credibility due to countries like the US and India having poor disaster response records. She argued that only the UN has the moral authority to lead relief work, which needs strengthening.", "opencoder:1.5b": "\"Short attacks US over tsunami aid. Former Cabinet minister Clare Short has criticized the US-led tsunami aid coalition. President Bush announced an alliance of the US, India, Australia, and Japan will co-ordinate a humanitarian drive for which Ms Short opposed. She said that the parallel coalition would undermine the UN and only the UN had the moral authority to lead the relief work. She resigned as international development secretary over the Iraq war. I think this initiative from America could set up four countries to coordinate sounds like another attempt to undermine the UN when it is the best system we have got and the one that needs building up, she said. It was the only body with the moral authority to do it well if backed up by the authority of the great powers. The countries involved could not be sure about their response to major disasters.\"\n", "smollm:1.7b": "The summary above is concise and objective, capturing the main ideas and key points from the original text. The writer has used clear language to convey the essential information without adding or removing any details. The tone remains neutral and informative, providing a factual account of the topic.", "deepseek-r1:1.5b": "<think>\nAlright, so the user has given me this text about Clare Short and her criticism of the US-led tsunami aid project. They want me to summarize it concisely, preserving key ideas and details.\n\nFirst, I need to identify the main points. The summary should be in plain text without any explanations or formatting. No mention of reasoning or anything else, just the essence.\n\nLooking at the original text, it talks about Clare Short criticizing the US-led project, saying the UN should lead. She also mentions her resignation as international development secretary and quotes her from BBC Radio Four's PM program.\n\nI need to make sure I include all these elements: the critique of US aid, her resignation, references to the UN, and specific criticisms from the US, India, and Japan involved in the alternative coalition.\n\nWait, is there anything else? The text doesn't mention other countries beyond the four mentioned, so maybe that's it. Also, the user emphasized preserving details like \"co-ordinate a humanitarian drive\" and specific examples from each country's performance on disasters.\n\nI should structure this into a concise summary without getting too wordy. Keep it clear and to the point, making sure all key elements are included as mentioned.\n</think>\n\nClare Short criticized the US-led tsunami aid project, stating that the UN should lead efforts, while saying the parallel coalition from the US, India, Australia, and Japan would undermine the UN. She resigned as international development secretary and shared quotes from her BBC Radio Four interview, including her criticism of the US's poor coordination with others and India's challenges.", "tinyllama:1.1b": "Sentence 1: Short attacks US over Tsunaim aid\n\nBased on Sentence 2: President Bush has announced that an allliance of the US, India, Australia and Japan will co-ordinate a humanitarian drive. This initiative from America to set up four countries claiming to co-ordinate sounds like yet another attempt to undermine the UN when it is the best system we have got and the one that needs building up. The US can only do it well if supported by the authority of the great powers, but Ms Short said India had its own problems which the US was \"very bad at coordinating with\".\n\nSentence 3: The US-led tsunaim aid coalition sounds like yet another attempt to undermine the UN.", "tinydolphin:1.1b": " Former Minister Clare Short has criticized the US-led tsunami aid coalition, saying that the UN should be in charge of coordinating humanitarian efforts instead of relying on other countries. She also questions whether the proposed alliance between the US, India, Australia, and Japan would undermine the UN's leadership in this area. Short claims that the joint effort from America could lead to a disorganized response to disasters.", "phi:2.7b": " Clare Short, former Cabinet minister, criticizes the US-led tsunami aid coalition for undermining the United Nations (UN), calling for the UN to lead the relief efforts. She says only the UN has moral authority and can do the job well with backing from the great powers. The countries involved in the humanitarian drive have bad records on disaster response.\n", "orca-mini:3b": " The former UK cabinet minister Clare Short criticized the US-led tsunami aid coalition, saying the UN should be leading efforts. She also expressed concern that the coalition would undermine the UN's authority.", "hermes3:3b": "Clare Short criticizes US-led tsunami aid coalition, arguing for UN leadership and moral authority in relief efforts.", "stablelm-zephyr:3b": "A former Cabinet minister, Clare Short, criticized the US-led tsunami aid coalition, arguing that the UN should be leading efforts. She claimed that the involvement of multiple countries would undermine the UN's authority and ability to lead relief work. Short emphasized that only the UN has the moral authority to coordinate such efforts and needs support from the great powers involved.", "chatgpt-4o-latest": "Clare Short criticized the US-led tsunami aid coalition, arguing that the UN should lead relief efforts. She claimed the alliance of the US, India, Australia, and Japan undermines the UN, which she believes has the moral authority to coordinate aid. Short, who resigned over the Iraq war, stated that the US has a poor record of coordination and suggested the initiative was an attempt to bypass the UN. She emphasized that only the UN, backed by major powers, could effectively manage disaster response.", "stablelm2:1.6b": "Former minister Clare Short criticized the US-led tsunami aid coalition, stating that the United Nations should lead relief efforts. President Bush announced an alliance including the US, India, Australia, and Japan for humanitarian assistance but warned it would undermine the UN's authority if only one body leads the work. Ms. Short emphasized that only the UN has moral authority to coordinate relief work due to its backing by great powers, despite countries involved having poor records on disaster response.", "granite3.1-dense:2b": "Former UK international development secretary Clare Short criticizes the U.S.-led tsunami aid coalition, arguing that only the United Nations should lead relief efforts due to its moral authority. She asserts that this parallel initiative by the US, India, Australia, and Japan undermines the UN and may indicate a U.S. attempt to bypass global coordination through the UN system. Short cites concerns about the other coalition members' disaster response records, suggesting that the U.S. might be pursuing an independent operation rather than collaborating within the UN framework.", "reference": "But Ms Short said the effect of the parallel coalition would be to undermine the UN.She said only the UN had the \"moral authority\" to lead the relief work.The US was \"very bad at coordinating with anyone\" and India had its own problems, Ms Short said.Ms Short said the countries involved could not boast good records on their response to major disasters.Former Cabinet minister Clare Short has criticised the US-led tsunami aid coalition, saying the UN should be leading efforts."}