{"raw_text": "Mandelson warning to BBC\n \n The BBC should steer away from \"demonising\" ex-Downing Street media chief Alastair Campbell, Peter Mandelson has said.\n \n The European commissioner and former Labour minister was speaking amid claims that Mr Campbell is part of a Labour \"dirty tricks\" campaign. That charge was denied by Mr Mandelson, who said the Tories were afraid of Mr Campbell's campaigning skills. He warned the BBC that attacking Mr Campbell had brought it trouble before. That was a reference to the Hutton inquiry following a BBC story claiming Downing Street \"sexed up\" Iraq's weapons of mass destruction dossier.\n \n The affair prompted the resignation of BBC chairman Gavyn Davies, director-general Greg Dyke and reporter Andrew Gilligan. Labour has attracted media criticism for using new freedom of information laws to dig up information about Tory leader Michael Howard's past.\n \n Mr Mandelson, a former Labour communications director, told BBC Radio 4's Today programme: \"I understand why the Tories will be gunning for Alastair Campbell because they fear his campaigning skills. \"What I understand less is why the BBC should be joining with the Tories in driving that agenda. \"In my experience of these things, parties which shout about dirty tricks and the like tend to do so because they fear a direct hit in some vulnerable part of their political anatomy. \"I suggest the BBC concentrates on the issues and helps the public to understand the policies and the choices that are at stake in the election rather than engages in the process politics, the trivialisation of the campaign. \"I think the BBC would be much better advised to leave all this stuff well alone, concentrate on the issues as I say, not resume their demonisation of Alastair Campbell - we all know where that led before.\"\n \n Mr Campbell is acting as an adviser for Labour, which denies engaging in personal campaigning. Conservative co-chairman Liam Fox said Mr Campbell's return and Labour poster plans attacking Mr Howard - recently withdrawn from the party's website - were a sign of \"abusive politics\". \"The government, despite the fact that they would say want to go forward, not back, seem intent on talking about history rather than their own record or even more importantly, about the future,\" he said on Sunday. Labour peer Baroness Kennedy, who is chairing the Power Inquiry into political disengagement, said people already thought politicians engaged in dirty tricks. \"This feeling of distrust is going to be enlarged if this campaigning on all sides is conducted in the way that it looks as if it just might,\" she said.\n", "llama3.2:1b": "Mandelson warns BBC to avoid demonizing Alastair Campbell amid claims of a Labour campaign and advises the BBC to focus on issues rather than engaging in process politics.", "llama3.2:3b": "BBC should not demonise ex-Downing Street media chief Alastair Campbell, according to Peter Mandelson, who warns that attacking him brought trouble for the BBC before, citing the Hutton inquiry incident.", "gemma2:2b": "Peter Mandelson criticizes BBC for demonizing Alastair Campbell and warns against repeating past mistakes after a previous BBC story about Downing Street's Iraq dossier led to resignations. He advises the BBC to focus on policy and issues rather than engaging in campaign politics.  He argues that both parties are employing \"dirty tricks\" tactics as a means of avoiding direct confrontation, and suggests they instead concentrate on their platforms for the election. \n", "qwen2.5:0.5b": "BBC should steer away from demonising Alastair Campbell. Mr Mandelson warned that attacking him would bring trouble to the BBC.", "qwen2.5:1.5b": "Peter Mandelson warns BBC not to demonize ex-Downing Street media chief Alastair Campbell amid accusations of a Labour dirty tricks campaign and calls for the broadcaster to focus on issues rather than engage in process politics.", "qwen2.5:3b": "Peter Mandelson warned the BBC against demonizing ex-Downing Street media chief Alastair Campbell, citing its troubles following the Hutton inquiry. He explained that parties often criticize their opponents' use of dirty tricks when they fear direct attacks. Mandelson advised the BBC to focus on issues rather than engaging in process politics and criticized the BBC for previously attacking Campbell. He also noted Labour's criticism of Michael Howard but denied using \"dirty tricks,\" with Conservative co-chairman Liam Fox criticizing what he saw as abusive political campaigning. Baroness Kennedy added that public distrust already exists, suggesting such campaigns could further erode trust.", "opencoder:1.5b": "The BBC should steer away from \"demonising\" Alastair Campbell, Peter Mandelson has said.\n \nThe European commissioner and former Labour minister were speaking amid claims that Mr Campbell is part of a Labour \"dirty tricks\" campaign. That charge was denied by Mandelson, who said the Tories fear it had to do with Mr Campbell's campaigning skills. He warned the BBC that attacking him had brought trouble before, which he referred to as the Hutton inquiry following a BBC story claiming Downing Street \"sexed up\" Iraq's weapons of mass destruction dossier.\n\nThe affair sparked disapproval of the BBC chairman Gavyn Davies, director-general Greg Dyke and reporter Andrew Gilligan. Labour has attracted media criticism for using new freedom of information laws to dig up information about Tory leader Michael Howard's past.\n\nMr Mandelson told the Today programme: \"I understand why the Tories will be gunning for Alastair Campbell because they fear his campaigning skills. I don't understand why the BBC should be joining with the Tories in driving that agenda, let alone doing anything to interfere with it. It seems a direct and simple attack on someone's campaign without taking into account the implications of what the Tories are trying to achieve from Alastair Campbell, which is dirty tricks.\"\n\nMr Campbell is acting as an adviser for Labour, who denies engaging in personal campaigning. Conservative co-chairman Liam Fox said Mr Campbell's return and Labour poster plans attacking him were a sign of \"abusive politics\". He also said people already thought politicians engaged in dirty tricks - a tactic used by opponents to provoke opposition.\n", "smollm:1.7b": "The summary should preserve key ideas and details:\n- The BBC should avoid demonizing Alastair Campbell, Peter Mandelson warned.\n- The European commissioner and former Labour minister was speaking amid claims that Mr Campbell is part of a Labour \"dirty tricks\" campaign.\n- The reference to Downing Street's sexed up Iraq weapons dossier was denied by Mr Mandelson.\n- The affair prompted the resignation of BBC chairman Gavyn Davies, director-general Greg Dyke and reporter Andrew Gilligan.\n- Labour has attracted media criticism for using new freedom of information laws to dig up information about Tory leader Michael Howard's past.\n- The reference to \"dirty tricks\" campaigners was not denied by Mr Mandelson.\n- The BBC should concentrate on the issues rather than engage in demonization of Alastair Campbell or other politicians, Labour peer Baroness Kennedy said.\n- The government, despite its claims that they would say want to go forward, seem intent on talking about history rather than their own record or more importantly, about the future.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the text given by Mandelson to Peter Campbell for BBC Radio 4's Today programme. Let me read through the entire query carefully first.\n\nThe main points are: Mandelson warned the BBC against demonizing Alastair Campbell, pointing out that it could lead to trouble because of Labour's \"dirty tricks.\" He also mentioned the Hutton inquiry, which tied Campbell's role in Iraq's weapons of mass destruction with his controversial campaign. \n\nThen, he talks about Labour's criticism for using new laws to dig up old information about Michael Howard, the current Tory chair. They're concerned about \"abusive politics\" and the government's focus on history rather than their own actions or future.\n\nMandelson suggests that the BBC should avoid demonizing Campbell and instead focus on understanding the issues and policies involved in the election. He also mentions that Labour's use of dirty tricks could lead to distrust, which is expected to increase if they continue this tactic.\n\nI need to condense all these points into a clear summary without adding anything else. The output should be plain text only, no explanations or formatting.\n</think>\n\nThe BBC should avoid demonizing Alastair Campbell and instead focus on the issues surrounding his campaign, rather than continuing the controversy over Labour's claims of \"dirty tricks.\"", "tinyllama:1.1b": "The BBC should avoid being a part of a Labour \"dirty trick\" campaign by steering clear of ex-Downing Street media chief Alastair Campbell's expertise, European commissioner and former Labour minister Peter Mandelson warned in a press statement. Mandelson said that attacks on his former colleague were part of an attempt to \"bring him down\", suggesting the BBC should refrain from engaging in personal campaigning or engaging in \"trivia-lisations\" of party policies and choices during the election. He also criticised the resignation of BBC chairman Gavyn Davies, director-general Greg Dyke and report editor Andrew Gilligan, whom he accused of using new freedom of information laws to dig up information about Michael Howard's past. Mandelson reiterated that Labour should not engage in dirty trick politics or personal campaigning, stressing that people already had a \"negative attitude\" towards politicians with such tactics. He also called on the BBC to avoid joining forces with the party and instead help the public better understand the policies and choices during the election.", "tinydolphin:1.1b": " BBC should steer clear of demonizing ex-Downing Street media chief Alastair Campbell, Peter Mandelson warned. The European commissioner and former Labour minister claimed the Tories would be afraid of Mr. Campbell's campaigning skills. This charge was denied by Mr. Mandelson, who stated that the Tories were afraid of Mr. Campbell's campaigning abilities. He further alleged that attacking Mr. Campbell could have brought the BBC into trouble during the Hutton inquiry. The affair concerning Downing Street and weapons of mass destruction led to the resignation of BBC chairman Gavyn Davies, director-general Greg Dyke, and reporter Andrew Gilligan. In response to this controversy, the Labour party has distanced itself from Mr. Campbell's involvement in their political campaigns.", "phi:2.7b": " Peter Mandelson warns against \"demonising\" Alastair Campbell and suggests the BBC should concentrate on the issues rather than engaging in trivial politics. Labour's use of new freedom of information laws has brought them criticism, but they deny involvement in \"dirty tricks.\" Mr. Campbell is acting as an adviser for Labour, who denies engaging in personal campaigning. Conservative co-chairman Liam Fox criticizes this and says it's a sign of abusive politics. Labour peer Baroness Kennedy agrees with the public's distrust of politicians, saying that this feeling will be amplified if campaigning on all sides is conducted poorly.\n", "orca-mini:3b": " Alastair Campbell's return to Labour and the party's poster plans attacking Michael Howard are being criticized by some as signs of \"abusive politics.\" Peter Mandelson, a former Labour minister, warned the BBC against attacking Campbell, saying it had brought trouble before. The affair prompted the resignation of BBC chairman Gavyn Davies, director-general Greg Dyke, and reporter Andrew Gilligan. Labour has attracted media criticism for using new freedom of information laws to dig up information about Tory leader Michael Howard's past.", "hermes3:3b": "BBC should avoid demonising Alastir Campbell, warns Peter Mandelson; avoids joining Tories' dirty tricks campaign claims against Labour's media adviser.", "stablelm-zephyr:3b": "Peter Mandelson warns the BBC against attacking Alastair Campbell, former Downing Street media chief, and labels the Tories' fear of his campaigning skills as a reason for the BBC to avoid engaging in \"demonising\" him. He suggests that instead of focusing on trivial politics, the BBC should concentrate on presenting issues and policies during elections. The controversy follows Labour's use of freedom of information laws to dig up information about Tory leader Michael Howard's past, which led to several high-profile resignations at the BBC.", "chatgpt-4o-latest": "Peter Mandelson warned the BBC against \"demonising\" former Downing Street media chief Alastair Campbell amid claims that Campbell was involved in a Labour \"dirty tricks\" campaign. Mandelson denied the allegations, arguing that the Conservatives feared Campbell's campaigning skills. He cautioned the BBC, referencing the fallout from the Hutton inquiry, which led to resignations at the BBC after a report on the Iraq weapons dossier. Mandelson urged the BBC to focus on policy issues rather than political tactics. Meanwhile, Conservative co-chairman Liam Fox criticized Labour's approach as \"abusive politics,\" while Baroness Kennedy warned that such campaigning could deepen public distrust in politicians.", "stablelm2:1.6b": "Peter Mandelson warns the BBC against \"demonising\" ex-Downing Street media chief Alastair Campbell, amid claims he's part of a Labour \"dirty tricks\" campaign. Mandelson says Tories are afraid of Campbell's skills and compares the situation to the Hutton inquiry following an alleged Downing Street manipulation of Iraq's weapons dossier. He advises the BBC to focus on election issues rather than getting involved in politics and trivializing the campaign, noting that parties often accuse others of dirty tricks when they fear a direct hit. Labour has faced criticism for using freedom of information laws to dig up information about opponents' past.", "granite3.1-dense:2b": "Peter Mandelson, European commissioner and former Labour minister, advised the BBC against \"demonizing\" ex-Downing Street media chief Alastair Campbell. This warning stems from claims that Campbell is part of a Labour \"dirty tricks\" campaign, which Labour denies, citing their use of new freedom of information laws to expose Tory leader Michael Howard's past. Mandelson cited the Hutton inquiry as a precedent for the BBC's potential harm when engaging in such political attacks, leading to the resignations of several high-ranking BBC officials following a story about Iraq's weapons dossier. He urged the BBC to focus on issues and help inform the public about policy choices rather than participating in \"trivialization\" of the campaign. Conservative co-chairman Liam Fox criticized Campbell's return as an adviser and Labour poster plans, labeling it a sign of \"abusive politics.\" Meanwhile, Labour peer Baroness Kennedy expressed concern that this heightened campaigning could exacerbate public distrust in politicians.", "reference": "Mr Mandelson, a former Labour communications director, told BBC Radio 4's Today programme: \"I understand why the Tories will be gunning for Alastair Campbell because they fear his campaigning skills.That charge was denied by Mr Mandelson, who said the Tories were afraid of Mr Campbell's campaigning skills.He warned the BBC that attacking Mr Campbell had brought it trouble before.The European commissioner and former Labour minister was speaking amid claims that Mr Campbell is part of a Labour \"dirty tricks\" campaign.Mr Campbell is acting as an adviser for Labour, which denies engaging in personal campaigning.The BBC should steer away from \"demonising\" ex-Downing Street media chief Alastair Campbell, Peter Mandelson has said.Conservative co-chairman Liam Fox said Mr Campbell's return and Labour poster plans attacking Mr Howard - recently withdrawn from the party's website - were a sign of \"abusive politics\"."}