{"raw_text": "Howard rejects BNP's claim\n \n Tory leader Michael Howard has dismissed claims that his immigration policy was \"moving onto the turf\" of the British National Party (BNP).\n \n BNP leader Nick Griffin told the Independent he expected some BNP voters to switch to the Tories over the issue. But Mr Howard said he rejected the idea that the Tories and BNP appealed to the same voting instincts. Asked if he would welcome BNP voters he told the BBC: \"I don't want anybody to vote for these extremist parties\". He added, on BBC Radio 4's Today programme: \"If you want good community relations in this country...then you have to have firm, fair immigration controls.\"\n \n The Tories have promised an upper limit on the number of people allowed into Britain with the slogan: \"It's not racist to impose limits on immigration\". All parties are stepping up campaiging in the run-up to the general election, widely expected to be called for 5 May. Labour has unveiled its own \"points system\" for ensuring migrants who want to work in the UK have skills that are required, but have rejected immigration quotas. The Liberal Democrats have warned both parties against \"pandering to prejudice\".\n \n Mr Griffin told the Independent the Tories' plans were \"a definite move onto our turf\". He said: \"I quite freely accept that on a nationwide basis, the Tories will con enough people to make a significant hole in our vote.\" Asked whether he was comfortable with the perception that the Conservatives and the BNP appeal to the same voting instincts, Mr Howard told the BBC: \"I reject that entirely\". He said he found BNP's policies \"abhorrent\" but he said the UK had to take a different approach to immigration, which he said was out of control. \"The government doesn't want to limit it in any way, we do, there's a legitimate difference between us there which we can discuss in a calm, rational and reasonable way,\" he said. He again rejected newspaper speculation that his own father entered Britain illegally.\n", "llama3.2:1b": "Howard rejects BNP claims of Tory policy appealing to same voting instincts\nBNP leader Nick Griffin had stated that some BNP voters would switch to the Tories over immigration issue\nTory MP Michael Howard rejects idea that Tories and BNP appeal to same voting instincts, saying \"I don't want anybody to vote for these extremist parties\"\nTories have proposed an upper limit on immigration with slogan \"It's not racist to impose limits on immigration\"", "llama3.2:3b": "Michael Howard rejects claims that the Tories are moving into BNP territory, saying the parties appeal to different voting instincts, and stating that firm immigration controls are necessary for good community relations, contradicting Labour's \"points system\" and the Liberal Democrats' warnings against pandering to prejudice.", "gemma2:2b": "Michael Howard denies that his immigration policy aligns with the BNP's views. He claims his policies are separate and advocates for firm controls on immigration while rejecting the idea of welcoming BNP voters. Labour proposes a points system for migrants, while the Liberal Democrats warn against pandering to prejudice. The BNP leader believes this could lead to a significant portion of their vote. \n", "qwen2.5:0.5b": "Michael Howard dismissed claims that the Tories' immigration policy was \"moving onto\" the British National Party (BNP). While BNP leader Nick Griffin expected some BNP voters to switch to the Conservatives, Howard said he didn't reject the idea of switching as BNP and Tories appealed to different voting instincts. The UK government is stepping up efforts for a national limit on immigration and warned against \"pandering to prejudice\".", "qwen2.5:1.5b": "Tory leader Michael Howard dismisses claims by BNP leader Nick Griffin that the Tories are moving into the BNP's voting territory, stating they appeal to different instincts despite offering similar immigration policies. Howard says the UK should take a more controlled approach to immigration while rejecting BNP policies as \"abhorrent.\"", "qwen2.5:3b": "Howard rejects BNP's claim of appealing to similar voters. Despite claims from BNP leader Nick Griffin suggesting some BNP supporters might switch to the Tories over immigration issues, Howard denies this notion, stating he wants no extremist parties in power. He emphasizes firm, fair immigration controls and supports community relations. However, he finds BNP policies abhorrent and disagrees with their perception of appealing to similar voters. Howard advocates for a different approach on immigration compared to the government's out-of-control stance.", "opencoder:1.5b": "Howard rejects BNP's claim.\nTory leader Michael Howard has dismissed claims that his immigration policy was \"moving onto the turf\" of the British National Party (BNP).\nBNP leader Nick Griffin told the Independent he expected some BNP voters to switch to the Tories over the issue. But Mr Howard said he rejected the idea that the Tories and BNP appealed to the same voting instincts.\nAsked if he would welcome BNP voters he told the BBC: \"I don't want anybody to vote for these extremist parties\". He added, on BBC Radio 4's Today programme: \"If you want good community relations in this country...then you have to have firm, fair immigration controls.\"\nTories have promised an upper limit on the number of people allowed into Britain with the slogan: \"It's not racist to impose limits on immigration\". All parties are stepping up campaiging in the run-up to the general election, widely expected to be called for 5 May. Labour has unveiled its own \"points system\" for ensuring migrants who want to work in the UK have skills that are required, but have rejected immigration quotas.\nLiberal Democrats have warned both parties against \"pandering to prejudice\".\nMr Griffin told the Independent the Tories' plans were \"a definite move onto our turf\". He said: \"I quite freely accept that on a nationwide basis, the Tories will con enough people to make a significant hole in our vote.\" Asked whether he was comfortable with the perception that the Conservatives and the BNP appeal to the same voting instincts, Mr Howard told the BBC: \"I reject that entirely\". He said he found BNP's policies \"abhorrent\" but he said the UK had to take a different approach to immigration, which he said was out of control. \"The government doesn't want to limit it in any way, we do, there's a legitimate difference between us there which we can discuss in a calm, rational and reasonable way,\" he said. He again rejected newspaper speculation that his own father entered Britain illegally.\n", "smollm:1.7b": "Summarizing the text: The BNP is seen as more extreme than the Tories on immigration issues. The BNP claims to be moving onto its \"turf\" while the Tories are seen as being too lenient towards immigrants who want to work in the UK, which they claim appeals to different voting instincts.", "deepseek-r1:1.5b": "<think>\nOkay, I have to summarize the given text into a concise summary. Let me read through it carefully first.\n\nSo, Howard is rejecting BNP's claim about their immigration policy being onto BNP's turf. They've dismissed claims that BNP and Tories share similar voting instincts. The Tories promised an upper limit on immigrants with the slogan \"It's not racist to impose limits.\" But both parties are stepping up campaigging for immigration, particularly leading up to May's election.\n\nI need to capture the key points: Howard dismisses BNP's stance, the quote about being onto their turf, the fact that the Tories didn't accept that and instead had a different approach. Also, highlight that while the Tories are committed to limits with the new slogan, they're not comfortable with BNP appealing on the same basis.\n\nI should make sure to include who is rejecting whom, the specific policies mentioned, and the stance of each party towards immigration controls.\n</think>\n\nHoward has dismissed claims that his immigration policy aligns with those of BNP's \"tantric\" approach. Both parties are stepping up campaigging for better immigration controls, particularly in a bid to win the general election in May.", "tinyllama:1.1b": "Presenting the following text as plain text with no explanations or formatting:\n\nHoward rejects BNP's claim\n\nTory leader Michael Howard has dismissed claims that his immigration policy was \"moving onto the turf\" of the British National Party (BNP). BNP leader Nick Griffin told the Independent he expected some BNP voters to switch to the Tories over the issue. But Howard said he rejected the idea that the Tories and BNP appealed to the same voting instincts. Asked if he would welcome BNP voters, he replied: \"I don't want anybody to vote for these extremist parties.\" Howard said he found BNP's policies \"abhorrent but we do need to take a different approach to immigration which is out of control\". He again rejected newspaper speculation that his own father entered Britain illegally.", "tinydolphin:1.1b": " A British man named Howard has expressed his belief about the immigration policy of the Tory party, stating that it is not moving onto the turf of the BNP. The leader of the Conservative Party, Michael Howard, dismissed these claims by saying that the Tories' immigration policy doesn't appeal to any particular group in society. Instead, Mr. Howard argues that his policies are aimed at people who want to work hard and contribute to their communities. This statement comes as a response to the increasing prevalence of extremist parties in British politics, such as the BNP. The Tories' immigration policy is expected to be a significant topic for discussion in the upcoming general election, with both parties vying for votes by promising different ways to handle the issue of immigration.", "phi:2.7b": " The text says that Conservative leader Michael Howard dismissed claims that his immigration policy was similar to the British National Party's (BNP) and did not want BNP voters to join his party. All parties are campaigning in the run-up to an election, but Labour has a points system for migrants while the Liberal Democrats warn against prejudice. The BNP leader says the Tories' plans are on their turf, but Mr Howard rejects that idea. He says he finds BNP's policies \"abhorrent\" and wants to limit immigration, which is out of control. He denies his father ever entered Britain illegally.\n", "orca-mini:3b": " Tory leader Michael Howard dismissed BNP claims saying he rejects their immigration policy as \"out of control\". He welcomed \"good community relations\" but wants \"firm, fair immigration controls\". He also promised an upper limit on immigration with the slogan \"It's not racist to impose limits on immigration\", though rejected any government quotas. Tory plans, he said, are a step away from BNP policies, while he finds them \"abhorrent\".", "hermes3:3b": "Howard rejects BNP's claim that Tories moving towards same voting instincts on immigration policy.", "stablelm-zephyr:3b": "Tory leader Michael Howard dismissed the BNP's claim that their immigration policy was appealing to the same voting instincts as the Conservatives. He stated that he doesn't want BNP voters to vote for extremist parties and emphasized the importance of firm, fair immigration controls for good community relations in the UK. The Tories have promised an upper limit on immigration with the slogan \"It's not racist to impose limits,\" while Labour unveiled its own \"points system\" for migrants working in the UK. The Liberal Democrats warned against parties pandering to prejudice. BNP leader Nick Griffin acknowledged that the Tories were moving onto their turf but clarified that they both wanted to address immigration differently, leading to a legitimate difference between the two parties.", "chatgpt-4o-latest": "Tory leader Michael Howard dismissed claims that his immigration policy aligned with the British National Party (BNP). BNP leader Nick Griffin suggested some BNP voters might switch to the Tories, but Howard rejected any similarity between the parties, stating he did not want votes from extremist groups. He emphasized the need for firm but fair immigration controls to maintain good community relations. The Tories proposed an immigration cap, while Labour introduced a points-based system without quotas, and the Liberal Democrats warned against pandering to prejudice. Griffin claimed the Tories were encroaching on BNP territory, but Howard rejected this, calling BNP policies \"abhorrent\" while insisting immigration needed better regulation. He also denied speculation that his father had entered Britain illegally.", "stablelm2:1.6b": "Tory leader Michael Howard denies claims of appealing to the same voting instincts as the BNP. Despite BNP's leader Nick Griffin expecting some voters to switch to Tories due to immigration policy, Howard rejects this notion. All parties are increasing campaigning ahead of the general election with Labour unveiling its own points system for required skills while Liberal Democrats warn against party pandering to prejudice. The BNP sees Tory plans as a move onto their turf, but Howard finds BNP policies abhorrent and believes a different approach is needed for out-of-control immigration control.", "granite3.1-dense:2b": "Tory leader Howard refutes BNP claims that the Conservative Party's immigration policy is aligning with theirs. Howard emphasizes the need for firm, fair immigration controls and denies any similarity in voting instincts between Tories and BNP. He stated that welcoming BNP voters is unacceptable and that the Tory slogan, \"It's not racist to impose limits on immigration,\" reflects this stance. Howard criticized BNP policies as abhorrent but argued for more stringent control of immigration due to its perceived out-of-control status. In contrast, BNP leader Nick Griffin asserted that Tory policies would erode their voter base. Labour and the Liberal Democrats are campaigning differently on immigration: Labour proposes a points system for skilled workers, while the Lib Dems caution against pandering to prejudice. Howard also dismissed Griffin's assertion that Tories were moving towards BNP policies.", "reference": "But Mr Howard said he rejected the idea that the Tories and BNP appealed to the same voting instincts.BNP leader Nick Griffin told the Independent he expected some BNP voters to switch to the Tories over the issue.Tory leader Michael Howard has dismissed claims that his immigration policy was \"moving onto the turf\" of the British National Party (BNP).Asked whether he was comfortable with the perception that the Conservatives and the BNP appeal to the same voting instincts, Mr Howard told the BBC: \"I reject that entirely\".Asked if he would welcome BNP voters he told the BBC: \"I don't want anybody to vote for these extremist parties\".Mr Griffin told the Independent the Tories' plans were \"a definite move onto our turf\"."}