{"raw_text": "Tories opposing 24-hour drinking\n \n The Tories say plans to extend pub opening times should be put on hold until binge drinking is under control, despite backing a law change last year.\n \n Spokesman David Davis said ministers had failed to make his party aware of concern among senior police that plans would cause more anti-social behaviour. Notts police chief Steve Green said innocent people would suffer. But Culture Secretary Tessa Jowell said a delay would be \"disastrous\" and she accused the Tories of opportunism. The government would go ahead with the changes which would give police more power to tackle excessive drinking, she added. Earlier chief constable Green questioned how his officers would be able to practically apply powers allowing them to shut down problem premises. \"If you look at the Market Square in Nottingham, if a fight takes place which licensed premises do you go and lay the responsibilty at the door of?\" he asked on BBC Radio 4's World at One programme.\n \n He warned that if drinking establishments were allowed to open until three or four in the morning the police would have to take officers off day shifts in order to do their job effectively at night. Earlier this year the Royal College of Physicians said it opposed the plan to extend drinking hours when there was already an \"epidemic\" of binge drinking. Minister Richard Caborn said the government was tackling the causes and the symptoms of the problem by allowing more powers to close down problem premises. It is hoped that allowing pubs and clubs to stay open longer will stagger closing times and end the current situation where drinkers spill on to the streets all at once. Earlier Tony Blair defended the plans against criticism from one of his own backbenchers.\n \n \"My view of this is very clear: we should have the same flexibility that other countries have and then we should come down really hard on those who abuse that freedom and don't show the responsibility,\" he told MPs. \"The law-abiding majority who want the ability, after going to the cinema or theatre say, to have a drink at the time they want should not be inconvenienced, we shouldn't have to have restrictions that no other city in Europe has, just in order to do something for that tiny minority who abuse alcohol, who go out and fight and cause disturbances. \"To take away that ability for all the population - even the vast majority who are law abiding - is not, in my view, sensible.\" This week a judge claimed easy access to drink was breeding \"urban savages\" and turning town centres into no go areas. Judge Charles Harris QC made his remarks as he sentenced three men for assaults carried out while drunk and high on drugs after a night out.\n", "llama3.2:1b": "Tories are opposing plans to extend pub opening times due to concerns about binge drinking. The Culture Secretary says the government would proceed with the changes despite opposition, citing the need to tackle excessive drinking. However, senior police officials have expressed concerns that extended opening hours would lead to more anti-social behavior and be ineffective in addressing the problem.", "llama3.2:3b": "Tories oppose 24-hour drinking plans due to concerns about anti-social behavior, citing the need for police to effectively enforce new powers to shut down problem premises. The government will proceed with the changes despite opposition from the Tory party.", "gemma2:2b": "Tories oppose extending pub opening times due to concerns about increased anti-social behavior. The government plans to push forward with the change, giving police more power to shut down problem premises.  The Royal College of Physicians opposes the plan due to an existing \"epidemic\" of binge drinking.  However, Prime Minister Tony Blair defends the changes, claiming they will allow law-abiding citizens greater flexibility and that those who abuse alcohol should be held accountable. \n", "qwen2.5:0.5b": "The Tories oppose 24-hour drinking plans, arguing that extending pub hours would cause more anti-social behavior among police. Tessa Jowell of the Culture Secretary's office says a delay is \"disastrous\" and accuses the Tories of opportunism. Culture Secretary Tessa Jowell said allowing pubs and clubs to stay open longer will help stave off alcohol-related problems, while Tony Blair defended the plans against criticism from one of his own backbenchers.", "qwen2.5:1.5b": "The Tory opposition opposes extending pub opening times due to concerns about binge drinking, citing police and public safety issues. The government argues the measure is needed to improve law enforcement in dealing with excessive drinking.", "qwen2.5:3b": "The Tories oppose extending pub opening times, citing concerns about increased anti-social behavior due to binge drinking, which they claim has not been adequately controlled despite last year's law change. Culture Secretary Tessa Jowell argues against delaying the changes, stating they are needed for police to effectively tackle excessive alcohol consumption. Police chiefs like Steve Green warn that such changes could lead to a shortage of night-time police officers and potentially harm innocent people. Meanwhile, opponents argue that extending opening hours could cause drinkers to congregate on streets instead of confined spaces, leading to public disturbances. Critics also point out the issue is more about dealing with both problem premises and problematic individuals rather than restricting drinking for all.", "opencoder:1.5b": "Tories opposing 24-hour drinking\n\nThe Tories argue that it's unethical to allow pub opening times to be extended until binge drinking is under control, despite backing a law change last year.\n\nSpokesman David Davis said ministers had failed to make his party aware of concern among senior police that plans would cause more anti-social behaviour. Notts police chief Steve Green said innocent people would suffer. But Culture Secretary Tessa Jowell argued a delay would be \"disastrous\" and she accused the Tories of opportunism.\n\nThe government has made its move on extending pub opening times while binge drinking is under control, which gives police more power to tackle excessive drinking.\n\nBefore he questioned the chief constable Green's officers ability to apply powers allowing them to shut down problem premises, he asked a question. If you look at the Market Square in Nottingham, if a fight takes place which licensed premises do you go and lay the responsibility at the door of?\n\nHe warned that if drinking establishments were allowed to open until three or four in the morning, the police would have to take officers off day shifts in order to do their job effectively at night. Earlier this year the Royal College of Physicians said it opposited.\n\nThe government has tackled the causes and the symptoms of the problem by allowing more powers to close down problem premises, which is hoped will stagger closing times and end the current situation where drinkers spill on to the streets all at once.\n\nIn a defense-heard speech by Tony Blair, he defended the plans against criticism from one of his own backbenchers. \"My view of this is very clear: we should have the same flexibility that other countries have and then we should come down really hard on those who abuse that freedom and don't show the responsibility,\" he told MPs.\n", "smollm:1.7b": "The Tories opposing 24-hour drinking is the main idea of this text, but it's not very clear or concise. Here's how you could summarize it:\n\n\"Tories say plans to extend pub opening times should be put on hold until binge drinking is under control.\"", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely while preserving the key ideas and details. Let me read through it first.\n\nThe main points are about the Tories opposing extending pub opening hours and plans to hold back, despite supporting a law change last year. There's mention of police concerns and issues like anti-social behavior.\n\nI'll start by noting that the Tories are against holding back pub hours. They want to keep things going until controls are met. Then, I should include their statement from David Davis about ministers not knowing the police' worries. \n\nNext, Spokesman Green mentioned issues with routine officers handling shifts when pubs close early. The Culture Secretary Tessa Jowell criticized the Tories for being opportunistic and that the government would go ahead with changes. She also added that pubs staying open longer is a staggered approach to control drinking.\n\nThen there's a mention of the Royal College of Physicians opposing extending pub hours due to an epidemic, but the minister said they're addressing the problem by allowing more powers to close problem places. \n\nEarlier, Richard Caborn defended the plans by supporting closing down abuse without restrictions. Tony Blair was mentioned as defending similar ideas.\n\nAlso, there's a judge's opinion about drunk driving causing urban issues and making towns into danger zones. \n\nI should structure this summary clearly, ensuring all these points are covered concisely without any explanations or formatting.\n</think>\n\nThe Tories oppose plans to extend pub opening hours, which they say should be put on hold until controlling anti-social behavior is achieved. Spokesman David Davis highlighted that ministers failed to alert senior police about the risk of increased anti-social behavior if pubs close early. Police Chief Steve Green warned that innocent people would suffer, while Culture Secretary Tessa Jowell criticized the Tories for being opportunistic and hoped pub stays longer would reduce the need for officers to shift shifts at night.\n\nRichard Caborn defended the plan by allowing more powers to close problem places, aiming to control drunk behavior through better management. Earlier, Tony Blair defended similar ideas. A judge noted drunk driving could cause urban problems and turn towns into danger zones.", "tinyllama:1.1b": "The text, consisting of two sentences in total, summarizes the statement by David Davis, minister for culture, universities and sport, who opposes an extension to pub opening hours that would tackle anti-social behavior caused by excessive drink drinking. The article highlights concerns from senior police officers, but the government is confident in its approach to address binge drivers spilling onto streets. However, opposition MPs criticize the decision and question if extending pub opening hours will also impact police work and force them off day shift during peak hours. In response to this criticism, the minister defends the plans against demands from one of his backbenchers while highlighting the benefits that come with having \"flexibility\" and a stronger stance on those who abuse it.", "tinydolphin:1.1b": " The Conservatives announced plans to extend pub opening times, but the criticism has increased from some within their own ranks. The idea was supported by police chiefs who feared excessive drinking could lead to more anti-social behavior and even violent incidents. The government announced that pubs would be allowed to remain open until three or four in the morning in a bid to tackle this issue. Critics argue that if pubs stay open later, there will be a risk of public order problems and police officers taking off day shifts to do their jobs effectively. The Royal College of Physicians, which opposes the plan, has also expressed concerns over the potential for more binge drinking. This decision is expected to be made by the end of this month.", "phi:2.7b": " The Tories are against extending pub opening times until midnight, despite supporting a law change last year to extend hours in certain cases. They claim the government has not addressed their concerns about increased anti-social behavior from extended drinking hours. Police chiefs also worry that innocent people will suffer if new rules go ahead. However, culture secretary Tessa Jowell believes delaying these changes would be \"disastrous.\" The government plans to move forward with the proposed laws giving police more power to tackle excessive drinking. Chief Constable Green of Nottingham expressed concerns about how his officers could effectively enforce the new laws in place of current restrictions on closing times. This follows a debate over the impact of extended pub hours, with concerns raised by medical professionals and law enforcement agencies alike.", "orca-mini:3b": " The government plans to extend pub opening times should be postponed until binge drinking is under control, according to the Tories. They argue that ministers have failed to inform them of concerns among senior police over the plan's impact on public safety. Notts police chief Steve Green raised concerns about innocent people being hurt by excessive alcohol consumption. However, Culture Secretary Tessa Jowell said a delay would be \"disastrous\" and accused the Tories of opportunism. The government plans to give police more power to tackle excessive drinking, but officers may struggle to apply the new powers due to lack of resources.", "hermes3:3b": "Tories oppose 24-hour drinking extensions until binge control; opposes but concerns anti-social behaviour, lack of practical police power.", "stablelm-zephyr:3b": "The Tories are opposing the extension of pub opening times, stating that plans should be put on hold until binge drinking is under control. They express concerns from senior police that the plans would cause more anti-social behavior, with Culture Secretary Tessa Jowell accusing them of opportunism. The government plans to go ahead with the changes, hoping that allowing pubs and clubs to stay open later will help stagger closing times and reduce spillover onto streets. Minister Richard Caborn believes they are tackling the causes and symptoms of excessive drinking. Critics argue that easy access to alcohol is breeding \"urban savages\" and turning town centers into no-go areas.", "chatgpt-4o-latest": "The Tories argue that plans to extend pub opening hours should be delayed until binge drinking is under control, despite previously supporting the law change. Spokesman David Davis criticized the government for not informing them of police concerns about increased anti-social behavior. Nottingham police chief Steve Green warned that longer hours would strain police resources and make enforcement difficult. Culture Secretary Tessa Jowell dismissed the Tory opposition as opportunistic and insisted the changes would give police more power to tackle excessive drinking. The government believes staggered closing times will reduce street disturbances. Prime Minister Tony Blair defended the plan, arguing that responsible drinkers should not be penalized for the actions of a minority. Critics, including a judge, warn that easy access to alcohol is fueling violence and disorder in city centers.", "stablelm2:1.6b": "Tories oppose extending pub opening hours, citing concern among police about increased anti-social behavior, despite supporting a law change last year. Culture Secretary Tessa Jowell argues that delaying the changes would be \"disastrous,\" accusing the Tories of opportunism. The government plans to grant more power to close problem premises and tackle excessive drinking, while earlier this year the Royal College of Physicians opposed the plan due to an ongoing binge drinking epidemic. Some critics argue that delaying the changes may take away ability from law-abiding citizens.", "granite3.1-dense:2b": "Tories, led by Culture Secretary Tessa Jowell, oppose extending pub opening times to combat binge drinking. They argue that such changes would hinder police effectiveness, as officers would need to work longer day shifts to cover night duties. Nottingham's chief constable, Steve Green, expressed concerns about practical application of new powers to shut down problem premises and the potential for increased anti-social behavior in areas like Market Square. The government supports these changes, aiming to stagger closing times and reduce crowded street spills from bars. However, critics, including former prime minister Tony Blair, argue that restricting all citizens' late-night drinking opportunities is not sensible, given the vast majority are law-abiding. Judge Charles Harris QC recently linked easy access to alcohol with urban violence and transformed town centers into no-go zones due to drunkenness.", "reference": "The government would go ahead with the changes which would give police more power to tackle excessive drinking, she added.He warned that if drinking establishments were allowed to open until three or four in the morning the police would have to take officers off day shifts in order to do their job effectively at night.Earlier this year the Royal College of Physicians said it opposed the plan to extend drinking hours when there was already an \"epidemic\" of binge drinking.Earlier chief constable Green questioned how his officers would be able to practically apply powers allowing them to shut down problem premises.Spokesman David Davis said ministers had failed to make his party aware of concern among senior police that plans would cause more anti-social behaviour.Notts police chief Steve Green said innocent people would suffer.The Tories say plans to extend pub opening times should be put on hold until binge drinking is under control, despite backing a law change last year.Minister Richard Caborn said the government was tackling the causes and the symptoms of the problem by allowing more powers to close down problem premises."}