{"raw_text": "Correction agency plans dropped\n \n Plans to create a single correctional agency for Scotland have been scrapped.\n \n The Scottish Executive will not now merge the Scottish Prison Service with local authority social work criminal justice departments. The National Correctional Agency would have provided a 'one-stop' justice system but has been abandoned in the wake of stiff opposition. Instead, Scottish councils and the prison service will be compelled to work more closely to cut reoffending. The plan was to ensure offenders were monitored by the same body during and after prison, preventing many from being lost in the system and helping more of them to stop reoffending.\n \n Scotland's reoffending rate is high, with more than 60% of prisoners reconvicted within two years of release from jail. This is leading to an ever-expanding prison population and the executive wants to tackle the problem. Ministers thought merging the prison service with the council-controlled criminal justice social work departments, which provide community sentences, might have provided an answer. However, following a consultation on the idea, Justice Minister Cathy Jamieson has decided to drop the plans. Instead, Ms Jamieson will change the law to help produce a closer working relationship between both elements of the justice system.\n \n She will announce the move in her Criminal Justice Plan on Monday, aiming to \"break down the barriers between what happens in prison and what happens in the community\". The new measures will place a new statutory duty on the SPS to work with local authorities and others in area partnerships. A national advisory board on offender management will also be created to advise Ms Jamieson on the SPS's role and performance in reducing reoffending. The minister said: \"Better joint working will help prisons play a much stronger role in ending reoffending behaviour and in particular help address the revolving door of reoffending that sees offenders entering prison for short periods during which little is done to address the behaviour that brought them there. \"Communities who are paying the price for this reoffending - both in terms of crime and in terms of prison costs - expect better. \"It costs the taxpayer £35,000 a year to provide each prison place and that cost is increasing. \"Taxpayers who suffer the consequences of crime also end up paying for keeping those people in prison. \"Therefore, as we continue to invest in the service, it is only right that we seek to ensure that that service becomes more accountable to the public it serves, to ministers and to parliament.\"\n", "llama3.2:1b": "The Scottish Executive has scrapped plans to merge the Scottish Prison Service with local authority social work criminal justice departments. Instead, they will focus on working more closely with councils to reduce reoffending rates. The plan was aimed at ensuring offenders were monitored during prison and after release, but ministers have decided against it due to opposition from Justice Minister Cathy Jamieson.", "llama3.2:3b": "Plans to create a single correctional agency for Scotland have been scrapped. Instead, Scottish councils and the prison service will work closer together to cut reoffending rates. A new statutory duty on the prison service will be introduced, along with a national advisory board to advise on offender management. The goal is to \"break down barriers\" between prisons and communities to address high reoffending rates, which cost taxpayers £35,000 per year per prison place.", "gemma2:2b": "Plans to create a single correctional agency in Scotland have been dropped due to opposition. The Scottish Executive will instead focus on improving collaboration between local councils and the prison service to reduce reoffending rates. A new statutory duty will require the SPS to work closely with local authorities, and a national advisory board will advise Ms Jamieson on reducing reoffending behavior.  \n", "qwen2.5:0.5b": "A Scottish government has decided not to merge the Scottish Prison Service with local authority social work criminal justice departments. Instead, they will work more closely together to cut reoffending, as Scotland's reoffending rate is high, and there are 60% of prisoners who go back to prison after release from jail within two years.\nThe new law would allow the SPS to work with local authorities, such as councils and local government, in creating a more effective system. A national advisory board on offender management will also be created to provide advice to the minister.", "qwen2.5:1.5b": "The Scottish government has scrapped plans for a single correctional agency and instead aims to strengthen collaboration between local councils and the prison system to reduce reoffending.", "qwen2.5:3b": "Correction agency plans for Scotland have been scrapped. The Scottish Executive will instead focus on improving collaboration between local councils and the prison service to reduce reoffending rates. Previously, a National Correctional Agency would have merged the Scottish Prison Service with local authority criminal justice departments. High reoffending rates, exceeding 60% within two years of release, are a concern, leading to this change in strategy. Instead, new laws will promote closer cooperation between prison staff and community services, establishing an advisory board to oversee performance in reducing recidivism. The goal is to make the correctional system more accountable to public expectations and taxpayers.", "opencoder:1.5b": "The Correction agency plans dropped.\n\nPlans to create a single correctional agency for Scotland have been scrapped. \n\nScottish Executive will not now merge the Scottish Prison Service with local authority social work criminal justice departments. The National Correctional Agency would have provided a 'one-stop' justice system but has been abandoned in the wake of stiff opposition. Instead, Scottish councils and the prison service will be compelled to work more closely to cut reoffending.\n\nThe plan was to ensure offenders were monitored by the same body during and after jail, preventing many from being lost in the system and helping more of them to stop reoffending. \n\nScotland's reoffending rate is high, with more than 60% of prisoners reconvicted within two years of release from jail. This is leading to an ever-expanding prison population and the executive wants to tackle the problem.\n\nMinisters thought merging the prison service with the council-controlled criminal justice social work departments, which provide community sentences, might have provided an answer. However, following a consultation on the idea, Justice Minister Cathy Jamieson has decided to drop the plans. Instead, Ms Jamieson will change the law to help produce a closer working relationship between both elements of the justice system.\n\nShe will announce the move in her Criminal Justice Plan on Monday, aiming to \"break down the barriers between what happens in prison and what happens in the community\". The new measures will place a new statutory duty on the SPS to work with local authorities and others in area partnerships. A national advisory board on offender management will also be created to advise Ms Jamieson on the SPS's role and performance in reducing reoffending. \n\nThe minister said: \"Better joint working will help prisons play a much stronger role in ending reoffending behaviour and in particular help address the revolving door of reoffending that sees offenders entering prison for short periods during which little is done to address the behaviour that brought them there. \"Communities who are paying the price for this reoffending - both in terms of crime and in terms of prison costs - expect better. \"Taxpayers who suffer the consequences of crime also end up paying for keeping those people in prison. \"Therefore, as we continue to invest in the service, it is only right that we seek to ensure that that service becomes more accountable to the public it serves, to ministers and to parliament.\"\n", "smollm:1.7b": "The summary should be: Correction agency plans dropped.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text into a concise summary. Let me read through the passage carefully.\n\nThe main points are: The Scottish government dropped plans for a single correctional agency by merging the prison service with local social work departments. They introduced a 'one-stop' system but it was abandoned after opposition from the Scottish Executive. Instead, they'll focus on closer working between the prison and local authorities to reduce reoffending.\n\nThe statistics say over 60% of prisoners are reconvicted within two years. This is causing an expanding prison population. The ministers thought merging might help, but the consultation decision made them drop it. Instead, their Criminal Justice Plan will change the law. Ms Jamieson will start working on ensuring a closer relationship between prison and authorities.\n\nShe'll announce this move on Monday. They want better joint working so more offenders stay in the community. Communities are expected to pay for prison costs, which is another reason why it's important to invest in accountability. Taxpayers must also consider the costs associated with holding those in prison.\n\nSo I need to capture all these key points: merging plan abandoned; focus on closer cooperation; statistics showing high reoffending; change in law; aim for better working relationship; and the reasons taxpayers might be concerned.\n</think>\n\nThe Scottish government has dropped plans for a merged correctional agency. Instead, they will focus on tighter collaboration between prison services and local authorities to reduce reoffending. The combined social work and prison departments were seen as an answer but eventually abandoned after opposition from the Scottish Executive. Ms. Cathy Jamieson will change the law to create a closer working relationship. The aim is for better joint working so more offenders stay in the community, addressing the \"revolving door\" of reoffending. Taxpayers pay for prison placement costs and holding offenders in, which highlights the need for accountability from public officials.", "tinyllama:1.1b": "According to the given text, the Scottish Executive has scrapped plans to create a single correctional agency for Scotland. The reason for this decision is the stiff opposition to the plan, which was to create a \"one-stop\" justice system by merging the Scottish Prison Service with local authority social work criminal justice departments. The new measures announced by Minister for Justice Cathy Jamieson aim to break down the barriers between what happens in prison and what happens in the community, and will create a statutorily duty on the Scottish Prison Service to work more closely with local authorities and other partners in area networks. The Minister has also announced changes to the law that will help promote joint working between the SPS and local authority criminal justice departments to reduce reoffending, including creating a new advisory board on offender management. These measures aim to address the problem of high reoffending rates by ensuring closer collaboration between prison services and the community, while also seeking to ensure more accountability for the service.", "tinydolphin:1.1b": " A plan has been scrapped to create a single correctional agency for Scotland. The National Correctional Agency will now have to work more closely with local authority social work criminal justice departments. Instead of merging the Scottish Prison Service and the local authority department, it was decided that councils and the prison service would work together more closely to prevent many from being lost in the system and help more of them to stop reoffending. The plan was aimed at reducing reoffending rates and improving public safety in Scotland.", "phi:2.7b": " Correction agency plans have been dropped, with the Scottish Executive scrapping plans to merge the Scottish Prison Service and local authority social work criminal justice departments. Instead of a \"one-stop\" justice system, Scottish councils and the prison service will be compelled to work more closely to cut reoffending rates. The plan was to ensure offenders were monitored by the same body during and after prison, preventing many from being lost in the system and helping more of them to stop reoffending. Scotland's high reoffending rate has led to an ever-expanding prison population. However, changing the law will help produce a closer working relationship between both elements of the justice system. Better joint working will help prisons play a stronger role in ending reoffending behavior and reducing costs for taxpayers who suffer from crime.\n", "orca-mini:3b": " Scotland's correctional agency plan has been dropped due to stiff opposition and a desire to work more closely between the prison service and local authority criminal justice departments. The Scottish Executive wants to tackle reoffending rates by creating a national correctional agency that would monitor offenders throughout their imprisonment and community sentences. However, plans were scrapped following a consultation and changes will be made to the law to improve joint working between the prison service and local authorities. A new national advisory board on offender management will also be created to advise the minister on the SPS's role in reducing reoffending.", "hermes3:3b": "Correction agency plans scrapped for Scotland.\nSingle correctional agency (National Correctional Agency) not merged with local authority social work criminal justice departments.\nScotland's reoffending rate high, leading to expanded prison population.\nJustice Minister Cathy Jamieson to change law for closer working relationship between prison and community sentences elements of the justice system.", "stablelm-zephyr:3b": "Plans to create a single correctional agency for Scotland have been abandoned due to stiff opposition. The Scottish Executive will now force Scottish councils and the prison service to work closely together to reduce reoffending. Instead of merging the Scottish Prison Service with local authority social work criminal justice departments, Justice Minister Cathy Jamieson will change the law to foster better collaboration between both elements of the justice system. A national advisory board on offender management will be created to advise Ms. Jamieson on reducing reoffending rates, which are currently at over 60%.", "chatgpt-4o-latest": "Plans to merge the Scottish Prison Service with local authority social work criminal justice departments into a single correctional agency have been abandoned due to strong opposition. Instead, the Scottish Executive will introduce legal changes to improve collaboration between prisons and councils to reduce reoffending. With over 60% of prisoners reconvicted within two years, the government aims to address the growing prison population by ensuring better coordination between prison and community services. Justice Minister Cathy Jamieson will introduce measures requiring the SPS to work with local authorities and establish a national advisory board on offender management. She emphasized the need for better joint efforts to break the cycle of reoffending, reduce crime, and manage rising prison costs, ensuring greater accountability to the public.", "stablelm2:1.6b": "Plans for a single correctional agency in Scotland have been abandoned, with Scottish councils and the prison service now required to work closely together to reduce reoffending. The National Correctional Agency was initially envisioned as providing a \"one-stop\" justice system but faced opposition from local authorities. Instead of merging the prison service and council-controlled criminal justice social work departments, Justice Minister Cathy Jamieson will create new statutory duties for both entities to work more collaboratively in area partnerships and advisory boards. This approach aims to break down barriers between the prison and community systems, reduce recidivism rates, and help address the revolving door of reoffending.", "granite3.1-dense:2b": "The Scottish government has abandoned plans for a unified correctional agency due to opposition. Instead, the Scottish Prison Service (SPS) will collaborate closely with local councils to reduce reoffending rates. Over 60% of prisoners are reconvicted within two years of release, contributing to a growing prison population and high costs for taxpayers. Justice Minister Cathy Jamieson will introduce new measures in her Criminal Justice Plan on Monday, including:\n1. A statutory duty for the SPS to work with local authorities and community partnerships.\n2. Creation of a national advisory board on offender management to advise Jamieson on SPS's performance in reducing reoffending.\n3. Enhancing the SPS's role in preventing reoffending by addressing the \"revolving door\" issue, where offenders enter prison for brief periods without proper behavioral change intervention.\nJamieson emphasized that these changes aim to make the prison service more accountable to the public and reduce taxpayer expenses associated with incarceration.", "reference": "The Scottish Executive will not now merge the Scottish Prison Service with local authority social work criminal justice departments.Instead, Scottish councils and the prison service will be compelled to work more closely to cut reoffending.Ministers thought merging the prison service with the council-controlled criminal justice social work departments, which provide community sentences, might have provided an answer.The minister said: \"Better joint working will help prisons play a much stronger role in ending reoffending behaviour and in particular help address the revolving door of reoffending that sees offenders entering prison for short periods during which little is done to address the behaviour that brought them there.\"Communities who are paying the price for this reoffending - both in terms of crime and in terms of prison costs - expect better.The plan was to ensure offenders were monitored by the same body during and after prison, preventing many from being lost in the system and helping more of them to stop reoffending.She will announce the move in her Criminal Justice Plan on Monday, aiming to \"break down the barriers between what happens in prison and what happens in the community\".\"It costs the taxpayer £35,000 a year to provide each prison place and that cost is increasing."}