{"raw_text": "Blair's hope for Blunkett return\n \n The events leading to David Blunkett's resignation must not \"swept under the carpet\", the Tories have warned.\n \n On Wednesday Tony Blair said he hoped the former home secretary would serve again in government in the future. Mr Blunkett quit in December after a probe linked him to the visa application of his ex-lover's nanny. Mr Blair said he left \"without a stain on his character\" but Tory Dominic Grieve branded the way Mr Blunkett's office operated as \"scandalous\". Mr Blair told BBC Radio 4's Today programme: \"I know David very well and I believe him to be a man of real integrity and real ability and I was very sad for him as to what happened.\"\n \n He said Mr Blunkett still had an immense amount to offer the country but he was not making any \"guarantees or definitive statements\" about future jobs. But shadow attorney general Mr Grieve said: \"While I don't rule out the possibility that Mr Blunkett may return as a minister, I don't think it's something that can simply be brushed under the carpet.\" Senior Labour backbencher Martin O'Neill, who chairs the Commons trade committee, said he believed the prime minister would want one of his \"praetorian guard\" - a reference to the elite body guard of Roman emperors - back alongside him. But colleague Ian Gibson, who chairs the science and technology committee, said there was a \"question mark\" as to whether Mr Blunkett could serve at cabinet level again.\n", "llama3.2:1b": "David Blair hopes former Home Secretary David Blunkett will return to government in the future after his resignation in December amid a scandal surrounding visa applications linked to his ex-lover's nanny.", "llama3.2:3b": "Tony Blair hopes David Blunkett will return to government in the future, but Tory Dominic Grieve warns that the scandal surrounding Blunkett's resignation cannot be swept under the carpet.", "gemma2:2b": "Tony Blair expressed hope for David Blunkett's return to government but acknowledged his resignation due to a visa scandal. Dominic Grieve criticized Blunkett's office operation.  Blair believes Blunkett has integrity and ability, but offered no guarantees. Mr. Grieve believes Blunkett may return as a minister, while Martin O'Neill thinks the prime minister would have him close. Ian Gibson questioned his cabinet level potential. \n", "qwen2.5:0.5b": "David Blair wants former Home Secretary David Blunt to stay in government, but Tory Party leader Lord Grieve says it is \"swept under the carpet\". Tony Blair told Today he believed Blunt was a man of integrity and \"not guilty until proven guilty\", though Lord Grieve said ministers were not making promises or guarantees about future jobs. Senior Labour backbencher Martin O'Neill believes prime minister Theresa May would want a praetorian guard in Blunt's place, while Ian Gibson doubts whether he could serve at cabinet level again.", "qwen2.5:1.5b": "David Blunkett resigned after an investigation found he improperly handled a nanny's visa application for his ex-partner. Tony Blair hopes Blunkett returns to cabinet but warns of potential scandals; Conservative Dominic Grieve doubts Blunkett can return due to past misconduct and the possibility of future investigations.", "qwen2.5:3b": "The Tories warn against ignoring David Blunkett's resignation probe. Tony Blair expressed hope for Blunkett’s future in government despite criticisms from Dominic Grieve. Labour figures support his return, though some doubt if he can be a cabinet minister again.", "opencoder:1.5b": "Blair's hope for Blunkett return\n\nThe events leading to David Blunkett's resignation must not have been swept under the carpet by the Tories' warning. Tony Blair said he hoped the former home secretary would serve again in government in the future, leaving Mr Blunkett at a disadvantage in the race.\n\nHe quit December after a probe linked him to the visa application of his ex-lover's nanny, marking a departure from his formal duties as a home secretary. Mr Blair was \"without a stain on his character\" but Dominic Grieve branded the office operation as \"scandalous\". He told Today programme: \"I know David very well and believe him to be a man of real integrity and real ability. I am so sad for him about what happened.\"\n\nHe offered a large sum to ensure his return, but there were definite promises about future jobs, referring to the elite body guard of Roman emperors. But senior Labour backbencher Martin O'Neill, who chairs the Commons trade committee, believes he would have another side to the prime minister's offer if Mr Blunkett could serve as a cabinet-level figure. However, Ian Gibson, chairing the science and technology committee, suggested a \"question mark\" regarding his potential service.\n", "smollm:1.7b": "The summary is concise, preserving key ideas and details while omitting explanations, formatting, and reasoning processes. The main points of the text are:\n\n1. Blair's hope for Blunkett return: Blair expressed his hope that David Blunkett would return to government in the future.\n2. Events leading to David Blunkett's resignation: On Wednesday, Tony Blair said he hoped the former home secretary would serve again in government in the future. Mr Blunkett quit in December after a probe linked him to the visa application of his ex-lover's nanny. Mr Blair told BBC Radio 4's Today programme: \"I know David very well and I believe him to be a man of real integrity and real ability and I was very sad for him as to what happened.\"\n3. He said David Blunkett still had an immense amount to offer the country but he was not making any \"guarantees or definitive statements\" about future jobs: While Blair believed that Mr Blunkett may return as a minister, he did not rule out the possibility of Mr Blunkett serving at cabinet level again.\n4. The prime minister would want one of his praetorian guard back alongside him: The prime minister would want to have one of his \"praetorian guard\" - a reference to the elite body guard of Roman emperors - back alongside him as a member of the government. However, colleague Ian Gibson said there was a question mark about whether Mr Blunkett could serve at cabinet level again.\n\nThe summary captures the main points of the text while omitting explanations, formatting, and reasoning processes. The key ideas and details are preserved in the concise and clear language used to summarize the text.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help the user summarize this text concisely while preserving key ideas and details. Let me read through the provided text carefully.\n\nThe main point is about David Blunkett's resignation and his potential return. The user wants a summary in plain text without explanations or formatting, just the summary.\n\nFirst, I'll note that Blair mentions his hope for Blunkett's return but says he left it unresolved. The Tories suspect him of not doing justice. Then there are details about Grieve calling it a scandal and O'Neill suggesting a shadow attorney general to check on his future role in cabinet.\n\nI should capture the key events: Blair's statement, Grieve's comment, O'Neill's suggestion, and Gibson's uncertainty.\n\nI'll make sure to include all these points without going into too much detail. The summary needs to be concise but cover all crucial elements from the original text.\n</think>\n\nThe text discusses David Blunkett's resignation following his wife's vacation leave, with Tony Blair expressing hope for his return as a prime minister. The Tories suspect him of lacking integrity and justice. Dominic Grieve criticized his office's behavior, while senior Labour backbencher Martin O'Neill suggested that a shadow attorney general could assess his potential cabinet role again.", "tinyllama:1.1b": "The Prime Minister has warned that David Blunkett's resignation, following an investigation linking his former love interest's visa application, should not be \"swiped under the carpet\", warning that a future return to power would not be possible if he does not regain his position in government. However, Labour backbencher Martin O'Neill believes Mr Blunkett could possibly be recalled as part of the prime minister's \"praetorian guard\" who should be a potential cabinet minister. Gibson and Grieve are both optimistic about Mr Blunkett's prospects for future jobs in the government.", "tinydolphin:1.1b": " Blair's hope for Blunkett return has been warned by Tories, with Tony Blair stating he hopes David Blunkett will serve again in government. The former home secretary resigned after a probe linked him to the visa application of his ex-lover's nanny. Blair said he left without any stain on his character, and praised Mr Blunkett for being \"an incredibly serious man.\" However, Tory MP Dominic Grieve warned that \"the way his office operated was scandalous.\"\n\nThe events leading to Blunkett's resignation had a profound impact on Blair's political future. He left without a stain on his character, but some critics believed the way Mr Blankett's office operated was scandalous.", "phi:2.7b": " The text discusses the resignation of former Home Secretary David Blunkett and expresses differing opinions on his future in government. While the prime minister hopes for his return, the Tories believe he should not be ignored. Labour backbenchers are open to the possibility, but there is uncertainty as to whether he can hold a cabinet position again.\n", "orca-mini:3b": " Tony Blair hopes David Blunkett will return to government in the future but warns against sweeping his resignation under the carpet.", "hermes3:3b": "David Blunkett potential return; Tony Blair opposes Tories warning Blunkett's office operation may be scandalous, hopes he returns without stain on character.", "stablelm-zephyr:3b": "Tony Blair expressed hope that former home secretary David Blunkett could return to government in the future, despite his resignation due to controversy surrounding his office's operations. Tory Dominic Grieve warned against sweeping the issue under the carpet, while other MPs speculated about potential roles for Blunkett in future administrations.", "chatgpt-4o-latest": "Tony Blair expressed hope that David Blunkett could return to government despite his resignation over a visa application controversy. Blair defended Blunkett’s integrity, stating he left without a stain on his character. However, Tory Dominic Grieve criticized the handling of Blunkett’s office as \"scandalous\" and warned against dismissing the issue. While Blair acknowledged Blunkett’s abilities, he made no guarantees about his future role. Labour MP Martin O’Neill suggested Blair would want Blunkett back, but Ian Gibson questioned whether he could serve at the cabinet level again.", "stablelm2:1.6b": "Tories warn not to overlook events leading to David Blunkett's resignation; Tony Blair hoped he would return to government in future; Blunkett left due to probe involving his ex-lover's nanny's visa application. Tory Dominic Grieve criticized the way office operated, while Labour backbencher Martin O'Neill supports a possible position for Blunkett; shadow attorney general Mr Grieve doesn Hinkett may return as a minister but doesn't think it can be ignored, while colleague Ian Gibson raises uncertainty about whether Blunkett could serve at cabinet level again.", "granite3.1-dense:2b": "Tony Blair expressed hope that former home secretary David Blunkett would return to government, emphasizing his integrity and abilities. Blunkett resigned in December due to a probe linking him to an ex-lover's nanny visa application. In contrast, Conservative Dominic Grieve criticized Mr. Blunkett's office as \"scandalous,\" cautioning against trivializing the issue. While Labour figures like Martin O'Neill and Ian Gibson suggested Blunkett could rejoin the praetorian guard or serve at cabinet level, respectively, there's a lingering doubt expressed by Ian Gibson about his suitability for such positions.", "reference": "Mr Blair said he left \"without a stain on his character\" but Tory Dominic Grieve branded the way Mr Blunkett's office operated as \"scandalous\".But shadow attorney general Mr Grieve said: \"While I don't rule out the possibility that Mr Blunkett may return as a minister, I don't think it's something that can simply be brushed under the carpet.\"But colleague Ian Gibson, who chairs the science and technology committee, said there was a \"question mark\" as to whether Mr Blunkett could serve at cabinet level again.He said Mr Blunkett still had an immense amount to offer the country but he was not making any \"guarantees or definitive statements\" about future jobs."}