{"raw_text": "New rules tackle 'sham weddings'\n \n New rules on marriage for foreign nationals living in the UK are coming into force.\n \n From Tuesday, most non-EU citizens will need Home Office approval to marry. The Home Office says the new rules are aimed at reducing the number of sham marriages, of which there are estimated to be up to 15,000 a year. But immigrants' group the Joint Council for the Welfare of Immigrants (JCWI) says the rules breach human rights law and it may mount a legal challenge. When the changes were unveiled last year, immigration minister Des Browne said: \"Our aim is to avoid unnecessary disruption of genuine marriages, while providing firm controls to prevent abuse.\" Under the previous regulations anybody wishing to get married in the UK only had to produce evidence they had been resident in the country for a week and give 15 days notice of the wedding at the local register office.\n \n But from Tuesday all non-EU nationals, apart from citizens of Switzerland, Liechtenstein, Iceland or Norway, intending to wed in the UK must either obtain a visa allowing them to get married before they enter the country or apply for a Home Office 'certificate of marriage approval'. To get a certificate, costing £135, applicants will have to send proof that they have a legal right to be in the UK. Those without a settled status, such as asylum seekers awaiting a decision on their application, will have no right to marry in the UK.\n \n Once they have the necessary documentation, those subject to immigration controls wishing to get married in England or Wales must register their intention to marry at one of 76 specially-designated register offices. They can, however, marry at the register office or church of their choice. Rhian Beynon of the JCWI said the new rules were \"not proportionate\" and \"discriminatory\".\n \n \"These rules means in some cases the Home Secretary is going to be a marriage registrar of last resort. \"We're currently taking a legal opinion on this. We'll be looking for people whose right to marry is breached and we'll be looking at taking a case on this to the Human Rights Court,\" Ms Beynon said. The new rules have also been called into question by the parliamentary Joint Committee on Human Rights. In a report published last July the cross-party committee stated there was a \"significant risk\" the new procedures were incompatible with the right to marry because they introduced restrictions which were \"disproportionate\". The committee believed the new laws might be incompatible with the Human Rights Act on the grounds of religion, belief and nationality, the report added.\n \n Over the last year immigration service operations against marriages of convenience have been stepped up resulting in a growing number of convictions. In January 25 people who took part in a sham marriage network based in Leicester were jailed for a total of 35 years. And last November Samuel Amoah, a Belgian national who set up two sham weddings for couples who wanted to remain in the UK, was jailed for three years. Several other cases are currently going through the courts. The role of registrars who under the Asylum and Immigration Act 1999 were obliged to report suspected sham marriages to the Home Office, has been key in many prosecutions. Registrars' spokesman, Mark Rimmer, said they welcomed the new marriage regulations and believed they would be an significant deterrent. \"They will effectively remove most of the blatant cases. Certainly those who are illegals in this country, of which we had quite a few, will no longer be getting married,\" Mr Rimmer said. Mr Rimmer, the service director for registrations of marriages at Brent Council in north-west London, said he did not consider the new law to be an infringement of civil liberties. \"It may be seen to be far more draconian than it has been but certainly it's still not as difficult to marry in the UK than it is to marry, for example, in Holland, Germany or France. \"I think it's a proportionate response by government to what was a very large problem,\" Mr Rimmer said.\n", "llama3.2:1b": "New rules on marriage for foreign nationals living in the UK require Home Office approval and come into force from Tuesday. The rules aim to reduce sham marriages, with estimated 15,000 a year being up to this point. However, immigration group JCWI says the new rules breach human rights law and may mount a legal challenge. The requirements include obtaining a visa or certificate of marriage approval before entering the country, applying for a Home Office \"certificate of marriage approval\" which costs £135 and requires proof of a legal right to be in the UK, and registering with register offices in England or Wales.", "llama3.2:3b": "New rules on marriage for foreign nationals living in the UK are coming into force from Tuesday. Most non-EU citizens will need Home Office approval to marry, with visa requirements or 'certificate of marriage approval' needed before entering the country. Applicants must also prove legal right to be in the UK and register their intention to marry at a specially-designated office. Critics say the rules breach human rights law and may mount a legal challenge.", "gemma2:2b": "New rules require non-EU foreign nationals seeking marriage in the UK to obtain Home Office approval before marrying.  These new requirements aim to address sham marriages and are deemed necessary by the Home Office, but face criticism from immigrant groups who see it as violating human rights law. The Joint Committee on Human Rights has also expressed concerns about the potential impact on religious freedom and nationality. Despite this criticism, the new regulations have been praised for their effectiveness in deterring sham marriages and have led to increased convictions of those involved in these practices. \n", "qwen2.5:0.5b": "New UK marriage rules aim to reduce number of sham marriages but will also risk infringing human rights.", "qwen2.5:1.5b": "New marriage rules aimed at reducing sham marriages come into effect; immigrants' group challenges new regulations on human rights grounds. New requirements for non-EU citizens intending to marry in the UK, including visa or Home Office approval needed, as well as registration of intent at designated register offices before obtaining marital license. Immigration minister claims they aim to prevent abuse while avoiding disruption of genuine marriages. However, critics argue the rules are discriminatory and disproportionate, particularly for asylum seekers without settled status.", "qwen2.5:3b": "New rules on marriage for non-EU citizens entering the UK are now in effect, requiring them to obtain Home Office approval before they marry. The aim is to reduce sham marriages estimated at up to 15,000 annually, though this has led to legal challenges from immigrant groups who argue it breaches human rights law. Under previous regulations, applicants only needed residency for a week and notice at the local register office. Now, they must either have a visa or apply for a certificate of marriage approval costing £135, which requires proof of legal right to be in the UK. The new rules aim to prevent abuse but face criticism from groups like the Joint Council for the Welfare of Immigrants (JCWI), who say they are not proportionate and discriminatory. Legal challenges have been mounted, with concerns raised about the procedures potentially conflicting with human rights laws. While some see it as a deterrent against sham marriages, others argue that the new measures still make marrying in the UK easier than elsewhere.", "opencoder:1.5b": "New rules tackle 'sham weddings'\n\nThe Home Office has introduced new rules governing the application of visa-free non-EU citizens for marriage in the UK. These rules aim to reduce the number of sham marriages, which are limited to up to 15,000 per year. However, the rules are designed to prevent abuse and legal challenge from violations of human rights.\n\nThe changes were unveiled on Tuesday, a day before the last national union visit, and the Home Office Minister Des Browne said: \"We aim to avoid unnecessary disruption of genuine marriages while providing firm controls to prevent abuse. This will ensure that everyone has a fair chance of getting married in the UK.\" \n\nImmigrants' group within the Joint Council for the Welfare of Immigrants (JCWI) also stated it was against their law to break through any rules related to marriage in the UK, even if they were based on nationality, belief or religion.\n\nApplicants wishing to get married in the UK need to provide evidence that they have been living in the country for at least a week and will give 15 days notice of the wedding at the local register office. Those without a settled status who are awaiting a decision on their application will not be able to marry in the UK.\n\nSham weddings where registered intention to get married are restricted to those whose right to marry is breached and they are sent to the Home Office for approval. For those with an approved intention, they can register their intention at one of 76 specially-designated register offices or attend church of their choice. The Home Secretary of the UK House has been appointed by a marriage registrar of last resort.\n\nThe rules have also been called into question by the parliamentary Joint Committee on Human Rights. The report from a cross-party committee indicates there could be a significant risk to the new procedures if they are incompatible with the Human Rights Act, because they introduced restrictions that were disproportionate.\n\nFinally, over the past year, many cases related to sham weddings have been settled by the Home Office, including a case against a marriage network based in Leicester. In addition, several other cases in court have also been cleared, suggesting that the new laws are an effective deterrent for inappropriate marriage applications.\n", "smollm:1.7b": "The new rules on marriage for foreign nationals living in the UK are coming into force from Tuesday. From Tuesday, most non-EU citizens will need Home Office approval to marry. The Home Office says the new rules are aimed at reducing the number of sham marriages, of which there are estimated to be up to 15,000 a year. But immigrants' group the Joint Council for the Welfare of Immigrants (JCWI) says the rules breach human rights law and it may mount a legal challenge. When the changes were unveiled last year, immigration minister Des Browne said: \"Our aim is to avoid unnecessary disruption of genuine marriages, while providing firm controls to prevent abuse.\"\nThe new rules on marriage for non-EU citizens are not proportional because they introduce restrictions which are \"disproportionate\" and \"discriminatory\". The Home Office says the new laws will be an significant deterrent. Registrars' spokesman Mark Rimmer said they welcomed the new marriage regulations and believed they would be an significant deterrent. Mr Rimmer, the service director for registrations of marriages at Brent Council in north-west London, said he did not consider the new law to be an infringement of civil liberties. He thinks it's a proportionate response by government to what was a very large problem.\nThe new rules on marriage for foreign nationals living in the UK are coming into force from Tuesday. From Tuesday, all non-EU citizens, apart from citizens of Switzerland, Liechtenstein, Iceland or Norway, intending to wed in the UK must either obtain a visa allowing them to get married before they enter the country or apply for a Home Office 'certificate of marriage approval'. To get a visa, costing £135, applicants will have to send proof that they have a legal right to be in the UK. Those without a settled status, such as asylum seekers awaiting a decision on their application, will have no right to marry in the UK.\nThe new rules on marriage for non-EU citizens are not proportional because they introduce restrictions which are \"disproportionate\" and \"discriminatory\". The Home Office says the new laws will be an significant deterrent. Registrars' spokesman Mark Rimmer said they welcomed the new marriage regulations and believed they would be a significant deterrent. Mr Rimmer, the service director for registrations of marriages at Brent Council in north-west London, did not consider the new law to be an infringement of civil liberties. He thinks it's a proportionate response by government to what was a very large problem.\nThe new rules on marriage for foreign nationals living in the UK are coming into force from Tuesday. From Tuesday, all non-EU citizens, apart from citizens of Switzerland, Liechtenstein, Iceland or Norway, intending to wed in the UK must either obtain a visa allowing them to get married before they enter the country or apply for a Home Office 'certificate of marriage approval'. To get a visa, costing £135, applicants will have to send proof that they have a legal right to be in the UK. Those without a settled status, such as asylum seekers awaiting a decision on their application, will have no right to marry in the UK.\nThe new rules on marriage for non-EU citizens are not proportional because they introduce restrictions which are \"disproportionate\" and \"discriminatory\". The Home Office says the new laws will be an significant deterrent. Registrars' spokesman Mark Rimmer said they welcomed the new marriage regulations and believed they would be a significant deterrent. Mr Rimmer, the service director for registrations of marriages at Brent Council in north-west London, did not consider the new law to be an infringement of civil liberties. He thinks it's a proportionate response by government to what was a very large problem.\nThe new rules on marriage for foreign nationals living in the UK are coming into force from Tuesday. From Tuesday, all non-EU citizens, apart from citizens of Switzerland, Liechtenstein, Iceland or Norway, intending to wed in the UK must either obtain a visa allowing them to get married before they enter the country or apply for a Home Office 'certificate of marriage approval'. To get a visa, costing £135, applicants will have to send proof that they have a legal right to be in the UK. Those without a settled status, such as asylum seekers awaiting a decision on their application, will have no right to marry in the UK.\nThe new rules on marriage for non-EU citizens are not proportional because they introduce restrictions which are \"disproportionate\" and \"discriminatory\". The Home Office says the new laws will be an significant deterrent. Registrars' spokesman Mark Rimmer said they welcomed the new marriage regulations and believed they would be a significant deterrent. Mr Rimmer, the service director for registrations of marriages at Brent Council in north-west London, did not consider the new law to be an infringement of civil liberties. He thinks it's a proportionate response by government to what was a very large problem.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text about new marriage rules in the UK in just plain text without any explanations. Let me read through the text carefully.\n\nThe main points are: The UK has introduced rules for non-EU citizens living outside certain countries who wish to marry. These rules require Home Office approval from Tuesday onwards. For those not from EU, if they're not settled, they have to either get a visa or apply for a certificate of marriage approval costing £135. Once they meet the requirements, people in England or Wales can register their intention to marry at 76 special offices where they can choose where to marry.\n\nThe text also mentions that the previous rules required a week's residency and 15 days notice. The Home Secretary aims to reduce sham marriages but has concerns about human rights being breached. The JCWI, which handles immigrants, is concerned and thinks this could lead to legal challenges. There were cases of people caught in sham weddings facing long sentences like 35 years or three years for Samuel Amoah.\n\nThe new rules are also questioned by a parliamentary committee, saying they might be incompatible with the right to marry, especially regarding religion and nationality. Registerations for marriages have been increased due to more Asylum service operations, but some of these are about people who shouldn't get married in the first place.\n\nI need to condense this into a concise summary without adding any explanations or formatting. I'll make sure to include all key points: new rules from Tuesday, requirements for non-EU citizens, visa or certificate process, the impact on legal rights and human rights, examples of convictions, the role of registrars, concerns about compliance with human rights laws, increased Asylum service operations leading to more convictions.\n\nLet me piece this together in my own words, making sure it's clear and covers all important aspects without getting too detailed.\n</think>\n\nThe UK has introduced new marriage rules for non-EU citizens living outside Switzerland, Liechtenstein, Iceland, or Norway. From Tuesday, these individuals must obtain Home Office approval to marry, which replaces the previous requirement of a week of residency and 15 days notice. Those not in a settled status, like asylum seekers, need special certificates costing £135 and can register their intent to marry at 76 designated offices, allowing them to choose their destination church or place.\n\nThe new rules aim to reduce \"sham marriages\" but worry about human rights breaches by the Joint Council for the Welfare of Immigrants (JCWI). Despite claims of legal challenges, cases involving people who shouldn't marry were convicted. The Home Secretary seeks opinions from a legal team and believes these rules might conflict with the right to marry in certain areas.\n\nRegisterations have increased due to Asylum service, leading to many convictions, especially those of couples planning to remain in the UK, while some are about unauthorized marriages. The new regulations are seen as a more comprehensive approach than previous ones, though critics worry they may be too restrictive, with some noting they're less difficult than marriage laws elsewhere.", "tinyllama:1.1b": "New rules on marriage are coming into force in the UK, affecting non-EU citizens who wish to wed, with Home Office approval required for some and certificate of marriage approval required for others. The new rules aim to prevent unnecessary disruptions and abuses of legitimate marriages. Under the previous regulatory regime, non-EU nationals were only allowed to get married in the UK if they had been resident there for a week or given 15 days' notice of their wedding at the local register office. With these new rules, all non-EU citizens and those with Swiss, Liechtenstein, Isle of Man, or Norwegian citizenship who intend to wed in the UK must obtain a visa allowing them to do so. Those without settled status will need to apply for a Home Office certificate showing they have legal right to marry in the UK. While not proportionate, the new marriage rules are seen as necessary to prevent immigration abuses and protect citizens' rights. The Human Rights Act, as outlined in the report by the Joint Committee on Human Rights, is also invoked when assessing the compatibility of these new procedures with fundamental human rights, including freedom of religion, belief, and nationality.", "tinydolphin:1.1b": " The Home Office has introduced new rules that will make it more difficult for non-EU citizens to get married in the UK. Under these rules, immigrants will need Home Office approval before they can marry, which applies to both sham and genuine marriages. Non-citizens will need this approval in order to legally get married in England or Wales, except for those with settled status who can do so at a specially designated register office or church. However, anyone seeking a marriage certificate must now apply directly to the Home Office, regardless of their immigration status, which could lead to some people not being able to marry if they don't have the correct paperwork. The new rules come into effect on Tuesday and will be closely scrutinized by human rights groups, who believe they are an infringement on the right to marry.", "phi:2.7b": " New rules for foreign nationals wanting to get married in the UK require them to obtain a visa and apply for a certificate of marriage approval from the Home Office. Non-EU citizens, except those from Switzerland, Liechtenstein, Iceland or Norway, must register their intention to marry at one of 76 designated offices before getting married in England or Wales. The Joint Council on Human Rights has criticized these rules as discriminatory and incompatible with the right to marry and human rights law. Immigration service operations against sham marriages have been stepped up resulting in several convictions. Registrars play a key role in detecting and prosecuting cases of suspected sham marriages. The new marriage regulations are seen by some as a necessary deterrent, while others argue that they infringe on civil liberties. Overall, the aim is to prevent sham marriages without overly restricting legitimate ones.\n", "orca-mini:3b": " New rules on marriage for foreign nationals living in the UK will come into force from Tuesday. These rules require all non-EU citizens except those from Switzerland, Liechtenstein, Iceland or Norway to obtain a visa or apply for a Home Office certificate of marriage approval if they wish to marry in the country. To get this certification, applicants have to send proof that they have a legal right to be in the UK. Individuals without settled status, such as asylum seekers waiting for a decision on their application, will have no right to marry in the UK under the new regulations. Before they can marry at a specially designated register office, applicants must register their intention to marry and choose their preferred church or register office. The Joint Committee on Human Rights has called these new rules into question, stating that they may be incompatible with the right to marry and the Human Rights Act.", "hermes3:3b": "New rules on marrying foreign nationals require Home Office approval, aimed at reducing sham marriages; non-EU citizens must have legal right to be in UK for marriage approval.", "stablelm-zephyr:3b": "New rules for marriage in the UK for foreign nationals starting from Tuesday. Most non-EU citizens need Home Office approval to marry to reduce estimated 15,000 sham weddings per year. Immigration minister Des Browne says the new rules are to avoid unnecessary disruption and prevent abuse. Previously, residency for only a week was required, and notice of wedding at local register office was given for 15 days. Foreigners will either need a marriage visa or certificate of marriage approval from Home Office, with certain exceptions like citizens of Switzerland, Liechtenstein, Iceland, or Norway. Immigration controls will require those marrying in England or Wales to register their intention at one of 76 designated offices. Some have criticized the new rules as too restrictive and discriminatory.", "chatgpt-4o-latest": "New UK marriage rules for non-EU nationals take effect, requiring Home Office approval to curb an estimated 15,000 sham marriages annually. Non-EU citizens, except those from Switzerland, Liechtenstein, Iceland, or Norway, must obtain a visa or a £135 certificate proving legal UK residency. Asylum seekers without settled status cannot marry. Critics, including the Joint Council for the Welfare of Immigrants (JCWI) and a parliamentary committee, argue the rules are discriminatory and may breach human rights laws. Authorities have intensified crackdowns on sham marriages, leading to multiple convictions. Registrars support the new regulations, seeing them as a strong deterrent, while officials argue the measures are proportionate compared to other European countries.", "stablelm2:1.6b": "New rules requiring non-EU nationals intending to marry in the UK to obtain Home Office approval aim to reduce sham marriages and will take effect from Tuesday. Applicants must either get a visa allowing them to marry before entering the country or apply for a £1 certificate of marriage approval. Those without settled status, such LAC (low-AD/low-CV) applicants, will not have the right to marry in the UK. The rules have been criticized by the JCWI and the parliamentary Joint Committee on Human Rights as being \"not proportionate\" and potentially breaching human rights law.", "granite3.1-dense:2b": "New regulations for foreign nationals intending to marry in the UK, effective Tuesday, aim to curb sham marriages, estimated at 15,000 annually. These changes require non-EU applicants, excluding Switzerland, Liechtenstein, Iceland, or Norway, to either obtain a visa before entry or apply for Home Office certificate of marriage approval (£135) with proof of legal UK residence. Only those without settled status, such as asylum seekers, will be prevented from marrying in the UK under these rules.\n\nImmigrants' rights groups, including the Joint Council for the Welfare of Immigrants (JCWI), argue that the new regulations violate human rights laws and may challenge them in court. The JCWI claims the rules are \"not proportionate\" and \"discriminatory,\" with Home Secretary potentially becoming a marriage registrar of last resort for those affected.\n\nThe parliamentary Joint Committee on Human Rights has raised concerns that the new procedures might be incompatible with the right to marry due to disproportionate restrictions based on religion, belief, and nationality. Despite these criticisms, immigration service operations against sham marriages have intensified, leading to recent convictions of 25 individuals in Leicester, with sentences totaling 35 years, and a three-year jail term for Samuel Amoah, a Belgian national who organized two sham weddings.\n\nRegistry office spokesmen welcome the new regulations, believing them to be an effective deterrent against blatant sham marriage cases. They argue that, while potentially more stringent than in some other countries like Holland or Germany, these rules are still a proportionate response to a significant problem.", "reference": "New rules on marriage for foreign nationals living in the UK are coming into force.The Home Office says the new rules are aimed at reducing the number of sham marriages, of which there are estimated to be up to 15,000 a year.\"These rules means in some cases the Home Secretary is going to be a marriage registrar of last resort.Rhian Beynon of the JCWI said the new rules were \"not proportionate\" and \"discriminatory\".But from Tuesday all non-EU nationals, apart from citizens of Switzerland, Liechtenstein, Iceland or Norway, intending to wed in the UK must either obtain a visa allowing them to get married before they enter the country or apply for a Home Office 'certificate of marriage approval'.Mr Rimmer, the service director for registrations of marriages at Brent Council in north-west London, said he did not consider the new law to be an infringement of civil liberties.Registrars' spokesman, Mark Rimmer, said they welcomed the new marriage regulations and believed they would be an significant deterrent.In a report published last July the cross-party committee stated there was a \"significant risk\" the new procedures were incompatible with the right to marry because they introduced restrictions which were \"disproportionate\".The role of registrars who under the Asylum and Immigration Act 1999 were obliged to report suspected sham marriages to the Home Office, has been key in many prosecutions.We'll be looking for people whose right to marry is breached and we'll be looking at taking a case on this to the Human Rights Court,\" Ms Beynon said.From Tuesday, most non-EU citizens will need Home Office approval to marry.The new rules have also been called into question by the parliamentary Joint Committee on Human Rights."}