{"raw_text": "Clarke defends terror detentions\n \n The home secretary has defended his decision not to release foreign terror suspects despite a legal ruling their detention breached human rights laws.\n \n House of Lords law lords ruled against the detention measures last week. They said it was wrong to have one set of laws for foreign suspects and another for British suspects. New Home Secretary Charles Clarke said he would carefully consider the ruling and would return to Parliament early in the new year with proposals.\n \n He insisted that he would not be rushed into judgement but would examine the law lords' findings in detail. \"My duty is to look at first of all the security of this country and in so doing to consider very carefully the precise legal measures that there are.\" Mr Clarke's comments came in response to an emergency question from Liberal Democrat constitutional affairs spokesman David Heath. Mr Heath said the judgement contained \"unprecedented condemnation and could not have been more unequivocal\". He said he accepted the difficult balance between the nation's security and human rights but questioned why the home office had made \"no contingency plans for the present circumstances\".\n \n \"These detainees should be prosecuted and tried. Simply renewing the present deeply unsatisfactory legislation is not an option.\" Shadow home secretary David Davis said it was not possible to overstate the importance of the judgment and urged the government to move as fast as \"competently possible\" to sort the problem out in the interests of natural justice. \"If you do, we will give you every support.\" The law lords' ruling came on Charles Clarke's first day as home secretary last Thursday following David Blunkett's resignation. In a statement on the same day, Mr Clarke said: \"I will be asking Parliament to renew this legislation in the New Year. \"In the meantime, we will be studying the judgment carefully to see whether it is possible to modify our legislation to address the concerns raised by the House of Lords.\"\n \n But the government was widely criticised for insisting the detentions would continue following the ruling last week. Lord Bingham - a senior law lord - said the rules were incompatible with the European Convention on Human Rights as they allowed detentions \"in a way that discriminates on the ground of nationality or immigration status\" by justifying detention without trial for foreign suspects, but not Britons. Lord Nicholls of Birkenhead, in his ruling, said: \"Indefinite imprisonment without charge or trial is anathema in any country which observes the rule of law.\" The detainees took their case to the House of Lords after the Court of Appeal backed the Home Office's powers to hold them without limit or charge. The government opted out of part of the European Convention on Human Rights concerning the right to a fair trial in order to bring in anti-terrorism legislation in response to the 11 September attacks in the US.\n", "llama3.2:1b": "The home secretary, Charles Clarke, defended his decision not to release foreign terror suspects despite a legal ruling that their detention breached human rights laws. The House of Lords law lords ruled against the detention measures and criticized the government for insisting on continuing the detentions despite the ruling. Clarke said he would carefully consider the ruling and return to Parliament in January with proposals.", "llama3.2:3b": "Home Secretary Charles Clarke defends his decision not to release foreign terror suspects despite a House of Lords ruling that their detention breached human rights laws, saying he will carefully consider the findings and propose new measures for Parliament's review. The judgment was \"unprecedented condemnation\" and called into question why the Home Office made no contingency plans for the present circumstances.", "gemma2:2b": "The home secretary defended his decision to continue detaining foreign terror suspects despite a House of Lords ruling that their detention breached human rights laws. He stated he would consider the law lords' findings, but also intends to renew existing legislation in the new year. Several politicians and legal experts criticized this stance, highlighting the ruling's condemnation of discriminatory detention practices and its incompatibility with international human rights standards. \n", "qwen2.5:0.5b": "A home secretary defended his decision not to release British foreign terror suspects despite legal rulings that their detention breached human rights laws. He emphasized considering law lords' findings carefully, but admitted he would examine them thoroughly and could not rush into a judgment.", "qwen2.5:1.5b": "Home Secretary Charles Clarke defends decision not to release foreign terror suspects despite legal ruling breach of human rights, stating he will carefully consider the ruling and return proposals early next year. Criticism arises over insistence detentions would continue following ruling last week. Lord Bingham criticizes rules as incompatible with European Convention on Human Rights, allowing indefinite detention without trial for foreigners but not British citizens. The government opted out of part of the convention to pass anti-terrorism legislation.", "qwen2.5:3b": "The home secretary defended his decision not to release foreign terror suspects despite a House of Lords ruling that their detention breached human rights laws. The law lords criticized the unequal treatment of foreign and British suspects. Clarke stated he would carefully consider the findings, proposing new legislation for parliament's review. Critics, including David Heath and David Davis, argued for prosecution or immediate reforms, while Lord Bingham and Lord Nicholls emphasized the incompatibility with the European Convention on Human Rights. Clarke announced plans to renew legislation but will study the Lords' judgment first.", "opencoder:1.5b": "Clarke defends terror detentions and his defence made by House of Lords law lords against the detention measures last week. He said it was wrong to have one set of laws for foreign suspects and another for British suspects. \"My duty is to look at first of all the security of this country and in so doing to consider very carefully the precise legal measures that there are,\" he explained.\n\nMr Clarke's comments came in response to an emergency question from Liberal Democrat constitutional affairs spokesman David Heath. The judgement contained \"unprecedented\" and could not have been more unequivocal. He said he accepted the difficult balance between the nation's security and human rights but questioned why the home office had made \"no contingency plans for the present circumstances\". The law lords' ruling came on Charles Clarke's first day as home secretary last Thursday following David Blunkett's resignation.\n\nThe law lords' ruling was aimed at clarifying the balance between the country's security and human rights, and to ensure that no controversial provisions about foreign suspects can be imposed without precedent. It was part of a broader initiative aiming to maintain order amidst any potential abuses by the people.\n\nHowever, the government was widely criticized for insisting on the detentions continuing following the ruling last week. Lord Bingham - senior law lord - referred to the rules as incompatible with the European Convention on Human Rights due to the rule of law against indefinite imprisonment without charge or trial for foreign suspects who justified their detention without trial by justifying retention without any trial.\n\nHowever, Lord Nicholls of Birkenhead said that \"Indefinite imprisonment without charge or trial is anathema in any country which observes the rule of law.\" The detainees took their case to the House of Lords after the Court of Appeal backed the Home Office's powers to hold them without limit or charge.\n\nThe government opted out of part of the European Convention on Human Rights concerning the right to a fair trial. In response to the 11 September attacks in the US, the government introduced anti-terrorism legislation, which it called \"the rule against terrorism\". This allowed detentions under the country's security system and justified their detention by justifying its retention without any trial.\n\nIn conclusion, the home secretary defended his decision not to release foreign terror suspects despite a legal ruling their detention breach human rights laws. He insisted that he would not be rushed into judgement but would examine the law lords' findings in detail. His comments came from an emergency question and was part of a broader initiative aimed at maintaining order amidst potential abuses.\n", "smollm:1.7b": "The summary should be:\nClarke defends terror detentions\nThe home secretary has defended his decision not to release foreign terror suspects despite a legal ruling their detention breached human rights laws.\nHouse of Lords law lords ruled against the detention measures last week. They said it was wrong to have one set of laws for foreign suspects and another for British suspects. New Home Secretary Charles Clarke said he would carefully consider the ruling and would return to Parliament early in the new year with proposals.\nHe insisted that he would not be rushed into judgment but would examine the law lords' findings in detail. \"My duty is to look at first of all the security of this country and in so doing to consider very carefully the precise legal measures that there are.\" Mr Clarke's comments came in response to an emergency question from Liberal Democrat constitutional affairs spokesman David Heath.\nMr Heath said the judgment contained \"unprecedented condemnation\" and could not have been more unequivocal. He said he accepted the difficult balance between the nation's security and human rights but questioned why the home office had made \"no contingency plans for the present circumstances\".\n\"These detainees should be prosecuted and tried,\" David Davis, a shadow home secretary, said in a statement on the same day. \"Simply renewing the present deeply unsatisfactory legislation is not an option.\" The law lords' ruling came on Charles Clarke's first day as home secretary last Thursday following David Blunkett's resignation. In a statement on the same day, Mr Clarke said: \"I will be asking Parliament to renew this legislation in the New Year.\n\"In the meantime, we will be studying the judgment carefully to see whether it is possible to modify our legislation to address the concerns raised by the House of Lords.\" The government was widely criticized for insisting the detentions would continue following the ruling last week. Lord Bingham, a senior law lord, said the rules were incompatible with the European Convention on Human Rights as they allowed detention without charge or trial for foreign suspects, but not Britons.\nLord Nicholls of Birkenhead, in his ruling, said: \"Indefinite imprisonment without charge or trial is anathema in any country which observes the rule of law.\" The government opted out of part of the European Convention on Human Rights concerning the right to a fair trial in order to bring in anti-terrorism legislation.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Clarke defending terror detentions. Let me read through it again and figure out the key points.\n\nFirst, the text mentions that Clarke defended not releasing foreign terror suspects despite a ruling that their detention breached human rights laws. That's an important point because it shows he was willing to take that stance.\n\nThen, there's some context about the House of Lords law lords ruling against the detention measures last week. They argued that using one set of laws for British and foreign suspects is unfair. I should note that part because it discusses differing legal systems and human rights concerns.\n\n Clarke then insists on carefully considering the ruling and plans to return early in Parliament, avoiding rushing the judgment. His words are about examining the findings instead of jumping to conclusions. This shows his decision-making process beyond just complying with the law.\n\nThe response comes from David Heath, who agreed with the government's stance but questioned why the Home Office had not made contingency plans. He mentioned a difficult balance between security and human rights, so it's important to highlight that trade-off.\n\n Clarke also has an emergency question on his first day, asking Parliament to renew legislation, while the government is criticized for backing detentions even after the ruling. This part is about the opposition's push against the detention measures.\n\nAdditionally, Lord Bingham criticized the rules as incompatible with European law, which adds another layer of human rights concerns. Lord Nicholls agreed that indefinite imprisonment without charge is a problem in countries with legal frameworks.\n\nThe detainees took their case through the Court of Appeal before being granted without charge. The government opted out of some parts of the EU convention to include anti-terror legislation, which is significant because it affects international human rights issues.\n\nPutting this all together, I need to make sure my summary captures Clarke's stance, the ruling by House of Lords, his decision process, Heath's response, and the opposition's criticism. It should be concise, just key points without too much detail.\n</think>\n\nClarke defended against the detention ruling while advocating for a careful evaluation, asserting he would return to Parliament early next year. The Home Secretary also criticized the government for supporting detentions despite House of Lords ruling against them, emphasizing the need for contingency plans and international human rights issues.", "tinyllama:1.1b": "Clairke defends terror detention measures, insisting that he will carefully examine the Home Office's legal measures and consider their impact on national security before deciding whether to continue the practice or revise them. The government is widely criticized for insisting that the detentions would remain in place after the court ruling in favour of the Home Office's powers, despite unprecedented condemnation from Liberal Democrats and constitutional affairs speaker David Heath. The Home Secretary, Charles Clarke, defends his decision to keep the detention measures in place and vows to oversee parliamentary debate over the issue as soon as possible.", "tinydolphin:1.1b": " Clarke defends terror detentions, stating that despite being against human rights laws, his predecessor had done similar and that there would be no need for British suspects to be held without charge or trial under his regime. He emphasizes that this decision will not happen in haste.", "phi:2.7b": " Following a legal ruling that the detention of foreign terror suspects breached human rights laws, Home Secretary Charles Clarke defended his decision not to release them. He said he would carefully consider the law lords' findings and examine the precise legal measures needed to balance national security and human rights. The government was criticised for insisting on continuing detentions despite the ruling.\n", "orca-mini:3b": " Clarke defends terror detentions, says he will carefully consider the ruling and propose new laws early in the New Year.", "hermes3:3b": "Clarke defends detaining foreign terror suspects despite human rights law breach, will consider Parliament proposal early next year.", "stablelm-zephyr:3b": "The UK's Home Secretary, Charles Clarke, defended his decision not to release foreign terror suspects despite a legal ruling that their detention breached human rights laws. The House of Lords law lords had ruled against the detention measures last week, stating that it was wrong to have one set of laws for foreign suspects and another for British suspects. New Home Secretary Clarke said he would carefully consider the ruling and would return to Parliament early in the new year with proposals. He insisted that his duty was first to look at the security of the country while considering the precise legal measures available.", "chatgpt-4o-latest": "Home Secretary Charles Clarke defended the continued detention of foreign terror suspects despite a House of Lords ruling that it breached human rights laws. The law lords criticized the policy for discriminating based on nationality and called indefinite detention without trial unacceptable. Clarke stated he would carefully review the ruling and present proposals to Parliament in the new year but would not rush his decision. Critics, including opposition politicians, urged the government to find a fairer solution and prosecute the detainees instead. The government had previously opted out of parts of the European Convention on Human Rights to implement anti-terrorism measures after the 9/11 attacks.", "stablelm2:1.6b": "UK home secretary Charles Clarke has defended his decision not to release foreign terror suspects despite a ruling by House of Lords that their detention breaches human rights laws. Clarke will return with proposals early in the new year, considering the security and legal measures required while also addressing concerns raised by the House of Lords. The government faced criticism for insisting that detentions would continue following the ruling.", "granite3.1-dense:2b": "Home Secretary Charles Clarke defended his decision not to release foreign terror suspects, despite a House of Lords ruling that their detention breached human rights laws. The law lords criticized the discriminatory treatment of foreign detainees versus British ones and deemed indefinite imprisonment without charge or trial as incompatible with the rule of law. Clarke pledged to reassess the legislation and present proposals to Parliament early in 2004, emphasizing his duty to ensure national security while considering legal measures carefully. Opposition figures criticized the government's persistence in detaining suspects without trial, urging swift action for natural justice. Clarke had initially planned to renew the legislation but now seeks potential modifications to address the Lords' concerns. The controversy stems from Britain's opting out of specific provisions of the European Convention on Human Rights to enact anti-terrorism measures post-9/11, leading to disparate treatment of foreign and domestic terror suspects.", "reference": "The law lords' ruling came on Charles Clarke's first day as home secretary last Thursday following David Blunkett's resignation.New Home Secretary Charles Clarke said he would carefully consider the ruling and would return to Parliament early in the new year with proposals.House of Lords law lords ruled against the detention measures last week.Lord Bingham - a senior law lord - said the rules were incompatible with the European Convention on Human Rights as they allowed detentions \"in a way that discriminates on the ground of nationality or immigration status\" by justifying detention without trial for foreign suspects, but not Britons.Lord Nicholls of Birkenhead, in his ruling, said: \"Indefinite imprisonment without charge or trial is anathema in any country which observes the rule of law.\"The home secretary has defended his decision not to release foreign terror suspects despite a legal ruling their detention breached human rights laws.In a statement on the same day, Mr Clarke said: \"I will be asking Parliament to renew this legislation in the New Year.But the government was widely criticised for insisting the detentions would continue following the ruling last week.They said it was wrong to have one set of laws for foreign suspects and another for British suspects."}