{"raw_text": "Voters 'reject EU by two to one'\n \n British voters would reject the European constitution by two to one, according to a poll posing the question the government will put to the country.\n \n The Daily Telegraph poll suggests that 45% of people would vote against the constitution and 24% in favour. However the YouGov poll, which questioned 1,943 British adults online, found 25% did not know how they would vote if forced to decide tomorrow. Only 51% of those polled had made up their minds about the constitution. Another 7% said they would not vote at all. The poll is believed to be the first to pose the question which the government has chosen for the upcoming referendum, expected in 2006. The constitution will be incorporated into UK law if there is a yes vote.\n \n Ballot papers in the poll will ask: \"Should the United Kingdom approve the treaty establishing a constitution for the European Union?\" The government unveiled the question which will be asked earlier in the week.\n \n The treaty was signed by all 25 current EU members in Rome last October and is due to come into force in November 2006, providing it is ratified by all member states - several of which will hold a referendum. Critics say the constitution is a further step towards a federal Europe, but advocates say it ensures effective operation of the enlarged 25-state EU. \"If we reject this treaty, Britain will be isolated and weak in Europe,\" said Foreign Secretary Jack Straw, after the question was unveiled. Mr Straw, along with the rest of the Cabinet, will back a \"yes\" vote. Meanwhile, Conservative shadow foreign secretary Michael Ancram said the referendum question \"seems straightforward\". But he accused the government of trying to confuse the issue by putting the EU referendum question in the same bill as the ratification of the constitution, when they should be treated as \"two separate issues\".\n", "llama3.2:1b": "British voters would reject the European constitution by two to one, according to a poll. The poll found 45% opposed and 24% in favor. A smaller percentage said they didn't know or wouldn't vote (7%). Over 50% of those polled had made up their minds about the constitution.", "llama3.2:3b": "British voters would reject the European constitution by two to one, according to a poll suggesting 45% would vote against and 24% in favour. The poll was conducted by YouGov and will ask: \"Should the United Kingdom approve the treaty establishing a constitution for the European Union?\" The government has chosen this question for an upcoming referendum expected in 2006, which would make the constitution part of UK law if voted in.", "gemma2:2b": "A poll suggests British voters would reject the European Union constitution by a two-to-one margin. 45% oppose it and 24% support it.  Many respondents remain undecided (25%) or do not plan to vote. The UK government will hold a referendum on the question \"Should the United Kingdom approve the treaty establishing a constitution for the European Union?\" in 2006, with a yes vote leading to its incorporation into UK law if ratified. Critics and supporters have different opinions about the constitution's implications. \n", "qwen2.5:0.5b": "A British poll found that 45% would vote against an amendment to the European Union Constitution while 24% would support it. Only 51% knew how they would vote if forced to decide on this. The ballot papers will ask, \"Should the United Kingdom approve a treaty establishing a constitution for the European Union?\"", "qwen2.5:1.5b": "British voters are expected to reject the European Constitution by a two-to-one margin, with 45% opposing and only 24% supporting it. Another 7% will abstain or refuse to vote altogether due to lack of information. The referendum, which includes a question about ratifying the constitution, is set for 2006.", "qwen2.5:3b": "British voters would reject a proposed European Constitution with 45% against and 24% in favor, according to polls. The government plans to hold a referendum on whether to approve the treaty establishing a European Union's constitution by November 2006. Support for approval is at 51%, with 7% undecided or not planning to vote. Critics view it as moving Europe towards federalism, while supporters argue it ensures effective operation of the EU. Foreign Secretary Jack Straw supports the \"yes\" vote, citing potential isolation if rejected. Conservative opposition criticizes conflating the referendum on constitution approval with ratification issues.", "opencoder:1.5b": "Voters would reject EU by two to one. The poll suggests that 45% of people vote against the constitution and 24% in favour. Only 51% made up their minds about the constitution. Another 7% said they would not vote at all, according to the YouGov poll which questioned 1,943 British adults online. The poll is believed to be the first to pose the question which the government has chosen for the upcoming referendum.\n", "smollm:1.7b": "The summary is: The British voters would reject the European constitution by two to one.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text. Let me read through it carefully first.\n\nThe text is about a British referendum concerning the European Constitution. It mentions that voters rejected the EU by two to one in a poll. Then there's more detailed data from different polls: The Daily Telegraph and YouGov. \n\nFrom the Daily Telegraph, 45% said they'd vote against it, 24% for, but some didn't know yet. The YouGov poll, which is more comprehensive with 1,943 participants, found that only 51% were certain about voting, 7% didn't know, and another 5% said they wouldn't vote at all. Plus, the poll is the first to ask this question for the upcoming referendum in 2006.\n\nThe constitution will be included in UK law if there's a yes vote. Ballot papers are asking if Britain should approve the treaty that would establish the EU constitution. The government introduced this question earlier in the week.\n\nThe treaty was signed by all 25 EU members, which is set to happen by November 2006, and it needs ratification by all member states. Critics think it's a step towards a federal Europe, while advocates believe it helps the enlarged EU operate effectively. The Foreign Secretary Jack Straw said if they reject the treaty, Britain would be isolated and weak in Europe.\n\nMr. Ancram, the Conservative shadow foreign secretary, thinks the question is straightforward but worries the government might confuse things by putting it alongside the constitutional ratification bill.\n\nAlright, so I need to condense all this into a summary. Let me make sure I include the key points: rejection of the EU by 2-1 margin, different polls with varying results and uncertainties, the role of the treaty, the government's move introducing the question, and the balance between pros and cons for the UK.\n\nI should structure it clearly without using any markdown or explanations. Just plain text.\n</think>\n\nThe British referendum on the European Constitution is expected to see a 2-to-1 rejection in a poll. Key details include: 45% against, 24% for, with uncertainty in some responses, and only 51% certain about voting. The YouGov poll found 51% certain, 7% unsure, and 5% said they wouldn't vote. The EU treaty, signed by all 25 EU members starting in October, will come into force in November 2006. Critics argue it could lead to a federal Europe, while advocates believe it supports the enlarged EU's effective operation. The government will ask if Britain should approve the treaty, and Mr. Jack Straw claims the question will likely be yes, opposing the urea.", "tinyllama:1.1b": "The British public has been asked to reject the European Constitution by two to one according to a poll published on November 12. The poll poses the question whether the government's proposed referendum will take place, while also asking if Britons would vote in favour of or against the constitution, which is expected to come into force in November 2006. While voters have already spoken out against the EU constitution and a yes vote is expected by the cabinet and other government figures, the poll suggests that a majority of Britons would vote against it. The question, \"Should the United Kingdom approve the treaty establishing a constitution for the European Union?\" is due to be put to voters in an upcoming referendum.", "tinydolphin:1.1b": " The poll suggests that 45% of British voters would reject the European constitution and only 24% would vote for it. However, a YouGov poll conducted online found that only 51% of those polled had made up their minds about whether to vote or not. \n\nThe UK government has chosen this referendum question for the EU constitution referendum. The treaty will be incorporated into UK law if the UK votes \"yes\" in November 2006. This is significant because it means that if approved, it will become effective in November 2006 and provide new rules for the operation of the enlarged 25-state EU, which includes several European countries. \n\nDoubts have been raised about the integrity of the constitution, especially among some groups who are more concerned with enlargement. Some critics argue that the constitution is a further step towards a federal Europe. However, supporters say it ensures effective operation of the EU.\n\nThe UK government has chosen to back a \"yes\" vote, while the rest of the Cabinet supports a \"no\" vote. This suggests division within the government over the issue of the constitution and the future of the UK in Europe.", "phi:2.7b": " A majority of British voters would reject the European Constitution by two to one according to a poll. The Daily Telegraph reported that 45% of respondents said they would vote against it and 24% in favour. However, YouGov's online poll showed that 25% were unsure about their decision. Only 51% had made up their minds while 7% did not intend to vote at all. A similar question will be asked on ballot papers before the referendum in 2006, which is expected to ratify the treaty establishing a constitution for the European Union if approved by voters. The government has supported the proposal, but some critics argue that it represents further centralization of power within Europe.\n", "orca-mini:3b": " British voters would reject the European constitution by a two-to-one margin according to a poll. The Daily Telegraph poll found 45% of people would vote against the constitution and 24% in favor, while another 25% did not know how they would vote. Only 51% of those polled had made up their minds about the constitution. If Britain votes yes, it will become a member of the European Union.", "hermes3:3b": "British voters likely reject European constitution by 2:1, according to poll; 45% against, 24% in favour.", "stablelm-zephyr:3b": "A poll shows British voters would reject the European constitution by a two-to-one margin. 45% said they would vote against it and 24% in favor. 25% did not know how they would vote if forced to decide tomorrow, while 51% had made up their minds about the constitution. The government is expected to hold the referendum in 2006, and the constitution will be incorporated into UK law if there is a yes vote. Critics argue that it is a step towards a federal Europe, while advocates say it ensures effective operation of the enlarged 25-state EU.", "chatgpt-4o-latest": "A poll suggests British voters would reject the European constitution by a two-to-one margin, with 45% opposed and 24% in favor, while 25% remain undecided. The YouGov survey of 1,943 adults is the first to use the government's official referendum question. The treaty, signed by all 25 EU members, must be ratified by each state to take effect in November 2006. Supporters argue it ensures the EU's effective operation, while critics see it as a step toward a federal Europe. Foreign Secretary Jack Straw supports a \"yes\" vote, warning rejection would weaken Britain in Europe. Conservative Michael Ancram criticized the government for linking the referendum question with the constitution's ratification in the same bill.", "stablelm2:1.6b": "British voters are expected to reject the European Union's constitution by a two-to-one margin according to a poll. However, only 25% know how they will vote if given the chance in a referendum set for June 6th. The UK's ballot papers will ask \"Should the United Kingdom approve the treaty establishing a constitution for the European Union?\" Meanwhile, Foreign Secretary Jack Straw and Conservative shadow foreign secretary Michael Ancram have differing opinions on the matter.", "granite3.1-dense:2b": "British voters are expected to reject the European Union's proposed constitution by a margin of two to one, according to preliminary polling. The Daily Telegraph poll indicates 45% opposition and 24% support, while YouGov finds 25% undecided. Only 51% have formed their opinions, with 7% not intending to vote. The government plans to present the constitution as a treaty for the UK's approval in an upcoming 2006 referendum. Critics argue it strengthens European federalism, while supporters claim it enhances EU efficiency. Foreign Secretary Jack Straw advocates a \"yes\" vote, asserting rejection would isolate Britain. Conservative shadow foreign secretary Michael Ancram criticizes the government for conflating the constitution ratification and referendum questions in a single bill, deeming it misleading.", "reference": "British voters would reject the European constitution by two to one, according to a poll posing the question the government will put to the country.The Daily Telegraph poll suggests that 45% of people would vote against the constitution and 24% in favour.But he accused the government of trying to confuse the issue by putting the EU referendum question in the same bill as the ratification of the constitution, when they should be treated as \"two separate issues\".The constitution will be incorporated into UK law if there is a yes vote.Another 7% said they would not vote at all.\"If we reject this treaty, Britain will be isolated and weak in Europe,\" said Foreign Secretary Jack Straw, after the question was unveiled."}