{"raw_text": "Terror detainees win Lords appeal\n \n Detaining foreign terrorist suspects without trial breaks human rights laws, the UK's highest court has ruled.\n \n In a blow to the government's anti-terror measures, the House of Lords law lords ruled by an eight to one majority in favour of appeals by nine detainees. Most of the men are being indefinitely held in Belmarsh prison, south London. The law lords said the measures were incompatible with European human rights laws. The men will stay behind bars while ministers decide how to react. The ruling creates a major problem for Charles Clarke on his first day as home secretary following David Blunkett's resignation. The Liberal Democrats say Mr Clarke should use the fact he is new to the job to take issue with a law established by his predecessor, David Blunkett. Belmarsh prison has been dubbed Britain's Guantanamo Bay by civil rights campaigners opposed to the use of emergency anti-terror laws.\n \n The detainees took their case to the House of Lords after the Court of Appeal backed the Home Office's powers to hold them without limit or charge. The government opted out of part of the European Convention on Human Rights concerning the right to a fair trial in order to bring in anti-terrorism legislation in response to the 11 September attacks in the US. Any foreign national suspected of links with terrorism can be detained or can opt to be deported. However those detained cannot be deported if this would mean persecution in their homeland.\n \n On Thursday, senior law lord Lord Bingham said the rules were incompatible with the European Convention on Human Rights as they allowed detentions \"in a way that discriminates on the ground of nationality or immigration status\". Lord Nicholls of Birkenhead, in his ruling, said: \"Indefinite imprisonment without charge or trial is anathema in any country which observes the rule of law. \"It deprives the detained person of the protection a criminal trial is intended to afford.\"\n \n He said the weakness for the government's case was that it was trying to justify detention without trial for foreign suspects - but not for British suspects. Lord Hoffmann said: \"The real threat to the life of the nation, in the sense of a people living in accordance with its traditional laws and political values, comes not from terrorism but from laws such as these.\" But Lord Walker of Gestingthorpe, the one law lord to oppose the appeal, said the anti-terror laws contained important safeguards against oppression.\n \n In a statement, detainee 'A' in Woodhill Prison said: \"I hope now that the government will act upon this decision, scrap this illegal 'law' and release me and the other internees to return to our families and loved ones.\" The case was heard by a panel of nine law lords rather than the usual five because of the constitutional importance of the case. Ben Emmerson QC, representing seven of the detainees, said the men had already been in custody for nearly three years. He said they had been given no idea when, if ever, they would be released, had never been formally interviewed and there was no prospect they would ever be put on trial. When the men were first held, they took their cases to the Special Immigration Appeals Commission (SIAC). The commission ruled on 30 July, 2002 that the anti-terror act unjustifiably discriminated against foreign nationals as British people could not be held in the same way. But that ruling was later overturned by the Court of Appeal who said there was a state of emergency threatening the life of the nation.\n", "llama3.2:1b": "The UK's House of Lords has ruled that detaining foreign terrorist suspects without trial breaks human rights laws, citing incompatibility with European human rights laws. Nine detainees are being held indefinitely at Belmarsh prison and will face an appeal against their detention. The ruling creates a problem for Home Secretary Charles Clarke on his first day as home secretary following David Blunkett's resignation. Detainees took their case to the House of Lords after the Court of Appeal backed the government's powers to hold them without limit or charge.", "llama3.2:3b": "Terror detainees win Lords appeal, ruling detaining foreign suspects without trial breaks human rights laws. Most are being held indefinitely in Belmarsh prison; the ruling creates a problem for Charles Clarke as Home Secretary. The government opted out of part of the European Convention on Human Rights to bring in anti-terror legislation, allowing indefinite detention or deportation of foreign nationals suspected of terrorism links.", "gemma2:2b": "The UK's House of Lords ruled that detaining foreign terrorist suspects without trial violates human rights laws and is incompatible with European human rights conventions.  This decision overturns previous rulings which allowed indefinite detention of such individuals and creates legal challenges for the new Home Secretary, Charles Clarke, who must now decide on a response to this ruling. The case was brought by nine detainees held in Belmarsh Prison and highlights concerns about potential discrimination against foreign nationals under anti-terrorism laws. \n", "qwen2.5:0.5b": "The UK House of Lords ruled that indefinite detention and deportation were incompatible with European human rights laws, which broke Britain's anti-terror measures. Detainees will remain in Belmarsh prison while ministers decide how to react. The government opted out of part of the European Convention on Human Rights concerning the right to a fair trial in response to 11 September attacks in the US.", "qwen2.5:1.5b": "The House of Lords ruled that indefinite detention without trial for terror suspects violates European human rights laws, leading to their release and prompting Charles Clarke to consider reversing his predecessor's anti-terrorism measures.", "qwen2.5:3b": "Terror detainees won an appeal at the House of Lords, ruling that holding suspects without trial or charge breaches human rights laws. The decision creates problems for Charles Clarke as it conflicts with his predecessor's established law. Belmarsh prison is likened to Guantanamo Bay by civil rights campaigners due to its indefinite detention practices. The Court of Appeal had previously supported government powers to detain suspects indefinitely. The Lords ruled that such measures are incompatible with the European Convention on Human Rights, finding them discriminatory based on nationality or immigration status. Senior judges highlighted the unlawfulness of indefinite imprisonment without trial and urged the government to amend anti-terror laws.", "opencoder:1.5b": "Terror detainees win Lords appeal.\nIn a blow to anti-terror measures, the House of Lords law lords decided on an 8-to-one majority in favor of appeals from nine detainees. The most men are being held in Belmarsh prison, south London, indefinitely. The law lords argued that European human rights laws were incompatible with this case as they could not tolerate the use of emergency anti-terrorism legislation to bring in new laws.\nThe ruling creates a major problem for Charles Clarke on his first day as home secretary following David Blunkett's resignation. The Liberal Democrats have stated that Mr Clarke should make an exception to European human rights norms, taking a law established by his predecessor into account.\nThe prison has been dubbed Britain's Guantanamo Bay in response to the use of emergency anti-terrorism laws opposed by the European Convention on Human Rights. Despite these restrictions, those detained can still be held indefinitely for a trial without charge or imprisonment provided they are not charged with any criminal offense.\nOn Thursday, senior law lord Lord Bingham said the rules were incompatible with the European Convention on Human Rights as they allowed detentions \"in a way that discriminates on the ground of nationality or immigration status\". However, Lord Nicholas, who ruled against this case, argued that indefinite imprisonment without charge or trial is anathema in countries adhering to international law.\nThe main challenge for the government's case was that it was trying to justify detention without trial for foreign suspects - but not for British suspects. The anti-terror laws contained important safeguards against human rights abuses such as human trafficking and exploitation.\nIn a statement, the detainee 'A' in Woodhill Prison said: \"I hope now that the government will act upon this decision, scrap this illegal 'law' and release me and the other internees to return to our families and loved ones.\" The case was heard by a panel of nine law lords rather than the usual five because of the powerful but constitutional importance of the case. Ben Emmerson QC, representing seven of the detainees, said the men had already been in custody for nearly three years. He said they had been given no idea when, if ever, they would be released, had never been formally interviewed and there was no prospect they would ever be put on trial.\nThe anti-terror act unjustifiably discriminated against foreign nationals as British people could not be held in the same way, but it’s important to note that the Court of Appeal ruled on 30 July, 2002 that the anti-terror act should be seen as a state of emergency threatening the life of the country.\n", "smollm:1.7b": "The summary is:\n\nTerror detainees win Lords appeal\n\nIn a blow to the government's anti-terror measures, the UK's highest court has ruled. Most of the men are being indefinitely held in Belmarsh prison, south London. The law lords said the measures were incompatible with European human rights laws. The men will stay behind bars while ministers decide how to react.\n\nThe ruling creates a major problem for Charles Clarke on his first day as home secretary following David Blunkett's resignation. The Liberal Democrats say Mr Clarke should use the fact he is new to the job to take issue with a law established by his predecessor, David Blunkenthal. Belmarsh prison has been dubbed Britain's Guantanamo Bay by civil rights campaigners opposed to the use of emergency anti-terror laws.\n\nOn Thursday, senior law lord Lord Bingham said the rules were incompatible with the European Convention on Human Rights as they allowed detentions \"in a way that discriminates on the ground of nationality or immigration status\". Lord Nicholls of Birkenhead, in his ruling, said: \"Indefinite imprisonment without charge or trial is anathema in any country which observes the rule of law. It deprives the detained person of the protection a criminal trial is intended to afford.\"\n\nThe real threat to the life of the nation comes not from terrorism but from laws such as these, Lord Walker of Gestingthorpe said. But Lord Walker of Gestingthorpe said the anti-terror laws contained important safeguards against oppression.\n\nIn a statement, detainee 'A' in Woodhill Prison said: \"I hope now that the government will act upon this decision, scrap this illegal 'law' and release me and the other internees to return to our families and loved ones.\" The case was heard by a panel of nine law lords rather than the usual five because of the constitutional importance of the case.\n\nWhen the men were first held, they took their cases to the Special Immigration Appeals Commission (SIAC). The commission ruled on 30 July, 2002 that the anti-terror act unjustifiably discriminated against foreign nationals as British people could not be held in the same way. But that ruling was later overturned by the Court of Appeal who said there was a state of emergency threatening the life of the nation.\n\nThe summary is concise and to the point, preserving key ideas and details while omitting unnecessary information.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text into a concise summary preserving key ideas and details. The user has provided a detailed legal case involving British authorities detaining foreign terrorism suspects without trial breaks. They mentioned the House of Lords ruling, the implications for Charles Clarke, the use of prisons named after Guantanamo Bay by civil rights advocates, and some specific legal aspects like the European Convention on Human Rights.\n\nFirst, I should identify the main points from the text. The key elements seem to be:\n\n1. UK government is considering holding foreign terrorism suspects without trial or charge.\n2. The House of Lords made an eight-to-one ruling in favor of appeals by nine detainees.\n3. These men will stay behind bars while ministers decide how to react.\n4. The ruling violates European human rights laws, preventing indefinite detention based on nationality or immigration.\n5. Belmarsh prison is referred to as \"Britain's Guantanamo Bay.\"\n6. Retaining the case involves a panel of nine law lords instead of five due to its constitutional importance.\n7. Detainees have already been in custody for over three years without formal trials.\n8. The anti-terror legislation contains safeguards against oppression, though they might not apply here.\n\nNow, I should structure this into a clear summary, making sure all key points are included without adding any extra information or explanations. I'll keep the language simple and avoid any markdown formatting as per the user's request.\n\nI need to make sure the summary is concise, so I'll focus on the most significant parts: the government's decision, the House of Lords ruling, the circumstances surrounding the detention, the impact onClarke's role, the prison name reference, and the structure with nine law lords involved. Each sentence should flow naturally into the next without being too wordy.\n\nI also need to ensure that all specific legal terms are included correctly: \"European Convention,\" \"indefinite imprisonment,\" \"prison,\" \"SIAC,\" etc. I'll double-check for any inaccuracies or alternative interpretations of these terms in case they were not entirely clear from the original text.\n\nFinally, I'll read through the summary to ensure it captures all important details without being redundant and that it's free of any unnecessary explanations or formatting. This should result in a comprehensive yet concise summary as required.\n</think>\n\nThe UK government is considering holding foreign terrorism suspects without trial without charge due to concerns over human rights law. The House of Lords ruled eight to one in favor of appeals by nine detainees, most held at Belmarsh Prison, south London. Detainees will remain in prison while ministers decide how to respond. Clarke, former home secretary and new home office head, faces challenges with a nine-lawlord panel holding the case for nearly three years without formal trials, which previously required five lawlords. The decision contradicts European human rights laws, prohibiting indefinite detention of British people. Belmarsh is named \"Britain's Guantanamo Bay.\" Retaining the case leads to nine law lords involved, despite its constitutional importance. Detainees have already been in custody for nearly three years without trials, facing potential persecution if released.", "tinyllama:1.1b": "In response to a recent decision by House of Lord's law lords, 9 detained suspects have won their appeal against detention without trial due to the government's anti-terror measures. The measures were approved by a vote in favor of appeal by all nine law lords despite European human rights laws being incapped in part of the legislation. This decision creates a major problem for home secretary Charles Clarke following his first day in office, where he was criticized by civil rights campaigners who opposed the use of emergency anti-terrorism laws. The Home Office's powers to detain foreign national suspected of terrorist links were challenged after the 11 September attacks, allowing detention or deportation on grounds of nationality or immigration status. However, on Thursday, senior law lord Lord Binns ruled that indefinite imprisonment without charge or trial is anathema in any country that observes the rule of law and deprives detained persons of protection against criminal trials. The weakness for government's case was that it was trying to justify detention without trial for foreign suspects, but not for British suspects. However, the case was finally heard by a panel of nine law lords rather than the usual five, due to the constitutional importance of the case. When the men were first held in Belmarsh prison, they had taken their cases to SIAC, where they took their cases further and won an emergency appeal against detention without trial. The government has now appealed this ruling by the House of Lord's law lords, which is expected to result in a major decision on detention without trial in the coming months.", "tinydolphin:1.1b": " In response to the release of detainees from Belmarsh prison last week, the Home Office has announced plans for further detention without trial in anticipation of future terrorist incidents. This move comes after the House of Lords ruled that some sections of the Emergency Regulations are unconstitutional and violate European human rights laws. Critics argue that this approach to combating terrorism diverges from standard legal procedure, and creates a significant risk of abuse and discrimination against non-British citizens. The Home Office has defended its position by stating that the measures are necessary for preventing imminent danger to the country. However, some civil rights campaigners have called on the government to use this opportunity to reassess the entire anti-terrorist regime and refine it in line with international standards.", "phi:2.7b": " The UK's highest court ruled by an eight to one majority in favour of nine detainees' appeals, stating that the government's anti-terrorism measures were incompatible with human rights laws and required changes. The men will stay in prison while the government decides how to react, creating a problem for Charles Clarke on his first day as home secretary. The ruling also raises concerns about similar treatment for British citizens under these anti-terror laws.\n", "orca-mini:3b": " Terror detainees win Lords appeal, UK's highest court rules against Home Office anti-terror measures, which indefinitely hold foreign terrorist suspects without trial and deprive them of protection of a criminal trial. Detaining suspects for years without charge or trial breaks human rights laws, says the House of Lords law lords by a majority of 8 to 1. The government's anti-terrorism measures are incompatible with European human rights laws, say law lords. Laws allow indefinite imprisonment of suspects without trial or charge, but only for foreign nationals, and discriminate against them as British citizens can be deported if it means persecution in their homeland. Detainees have not been released, say lawyers; they have been in custody for nearly three years without any idea when or if they will be released. The government should scrap illegal laws and release the internees, say lawyers.", "hermes3:3b": "Detainees of terrorist suspicion win appeal against indefinite detention without trial, violating human rights laws according to UK's highest court.", "stablelm-zephyr:3b": "The UK's highest court ruled that detaining foreign terrorist suspects without trial breaks human rights laws, affecting anti-terror measures and creating a problem for new home secretary Charles Clarke. The ruling states that detention without charge or trial is incompatible with European human rights laws, as it discriminates on the ground of nationality or immigration status. Detainees will remain in custody while ministers decide how to react.", "chatgpt-4o-latest": "The UK's highest court ruled that detaining foreign terrorist suspects without trial violates human rights laws. In an eight-to-one decision, the House of Lords law lords sided with nine detainees, most held indefinitely in Belmarsh prison. The ruling challenges the government's anti-terror measures, creating a dilemma for new Home Secretary Charles Clarke. The government had opted out of parts of the European Convention on Human Rights to justify detentions post-9/11, allowing foreign suspects to be held indefinitely or deported unless facing persecution. Senior law lords criticized the law for discriminating based on nationality and undermining the rule of law, while one law lord defended it as a safeguard against oppression. The detainees, held for nearly three years without trial or formal interviews, hope for their release. The ruling overturns a previous Court of Appeal decision that upheld the detentions due to a national emergency.", "stablelm2:1.6b": "The UK's highest court ruled that detaining foreign terrorist suspects without trial breaks human rights laws, making the government's anti-terror measures incompatible with European human rights laws. The House of Lords voted eight to one in favor of appeals by nine detainees being held indefinitely at Belmarsh prison. They will stay behind bars while ministers decide their future. Charles Clarke is now faced with addressing this issue as home secretary following David Blunkett's resignation. The ruling creates controversy, with civil rights campaigners calling it \"Britain's Guantanamo Bay.\" Detainees argue that they have been denied a fair trial and cannot be deported if it would mean persecution in their homeland.", "granite3.1-dense:2b": "The UK's highest court, the House of Lords, has unanimously ruled (eight to one) in favor of nine foreign terror suspects held without trial at Belmarsh prison since 2001. The law lords deemed these detentions incompatible with European human rights laws, including the right to a fair trial. This decision creates significant challenges for new Home Secretary Charles Clarke upon taking office following David Blunkett's resignation. Civil rights campaigners have dubbed Belmarsh \"Britain's Guantanamo Bay.\"\n\nThe detainees, mostly held since 2001, argued that the government's anti-terror measures discriminate based on nationality and immigration status. The Court of Appeal initially supported the Home Office's detention powers following the 9/11 attacks in the US. However, senior law lords emphasized that indefinite imprisonment without charge or trial is unlawful and denies individuals the protections of a criminal trial.\n\nLord Bingham highlighted the incompatibility with the European Convention on Human Rights due to discriminatory detention practices, while Lord Nicholls criticized the government for not applying similar restrictions to British suspects. Despite one law lord (Lord Walker) finding safeguards against oppression within the laws, the majority ruled in favor of the detainees' appeal.\n\nThe detainees expressed hope that this decision would lead to their release and restoration to their families. The case was heard by a nine-member panel due to its constitutional significance. The Special Immigration Appeals Commission initially ruled against the discriminatory detention practices but was later overturned by the Court of Appeal based on national security concerns.", "reference": "The law lords said the measures were incompatible with European human rights laws.But Lord Walker of Gestingthorpe, the one law lord to oppose the appeal, said the anti-terror laws contained important safeguards against oppression.Lord Nicholls of Birkenhead, in his ruling, said: \"Indefinite imprisonment without charge or trial is anathema in any country which observes the rule of law.On Thursday, senior law lord Lord Bingham said the rules were incompatible with the European Convention on Human Rights as they allowed detentions \"in a way that discriminates on the ground of nationality or immigration status\".He said the weakness for the government's case was that it was trying to justify detention without trial for foreign suspects - but not for British suspects.Lord Hoffmann said: \"The real threat to the life of the nation, in the sense of a people living in accordance with its traditional laws and political values, comes not from terrorism but from laws such as these.\"In a blow to the government's anti-terror measures, the House of Lords law lords ruled by an eight to one majority in favour of appeals by nine detainees.The case was heard by a panel of nine law lords rather than the usual five because of the constitutional importance of the case.Detaining foreign terrorist suspects without trial breaks human rights laws, the UK's highest court has ruled.But that ruling was later overturned by the Court of Appeal who said there was a state of emergency threatening the life of the nation."}