{"raw_text": "Blair to face MPs amid feud talk\n \n Tony Blair faces his first prime minister's questions of 2005 after a week of renewed speculation about his relationship with Gordon Brown.\n \n Meanwhile, the chancellor is leaving Britain on a high-profile tour of Africa to highlight poverty issues. But before doing so, he insisted he still trusted Mr Blair, despite claims to the contrary in a new book. Labour MPs have warned against disunity and Tory leader Michael Howard may well take up the theme in the Commons. The Tories have already accused the prime minister and his chancellor of behaving like \"schoolboys squabbling in a playground\".\n \n Michael Howard is likely to want to capitalise further on the spat when he goes head-to-head with the prime minister in the Commons. At a campaign poster launch on Tuesday, Mr Brown was joined by Alan Milburn, who Mr Blair controversially put in charge of election planning in place of the chancellor.\n \n Later this week the prime minister is due to set out the themes of his party's next election manifesto, which for the past two polls have been drawn up by the chancellor. Mr Brown, meanwhile, is visiting Tanzania, Mozambique and Kenya to highlight the plight of many Africans hit by Aids, war and famine - issues which Mr Blair has also spoken out on. The prime minister and chancellor faced backbench discontent at Monday's meeting of the Parliamentary Labour Party over claims made in journalist Robert Peston's new book. Mr Blair told MPs and peers: \"I know from everyone here, in Cabinet and government, nothing is going to get in the way of a unified Labour Party with a unified position and winning the third term people desperately need.\" Labour's Paul Flynn said the pair had had a \"scorching\" from MPs.\n \n On Tuesday, Deputy Prime Minister Mr Prescott told BBC News: \"They told us very clearly, it was the troops telling the leaders: get in line.\" The new book claims Mr Prescott hosted a dinner in November 2003 where the prime minister told Mr Brown he would stand down before the next election because he had lost trust over the Iraq war. Mr Blair then changed his mind in June 2004, after Cabinet allies intervened and amid suspicion the chancellor was manoeuvring against him, writes Mr Peston. In Mr Peston's book Mr Brown is alleged to have told the prime minister: \"There is nothing you could ever say to me now that I could ever believe.\"\n", "llama3.2:1b": "Tony Blair faces questions from MPs amid speculation about his relationship with Gordon Brown and a feud between them.\n\nLabour MPs are concerned about disunity in Labour, while the Tories accuse Blair and Brown of behaving like schoolboys. The prime minister is set to unveil party's election manifesto later this week.\n\nBlair defended his position and said he trusts Brown, despite allegations made by journalist Robert Peston.", "llama3.2:3b": "Tony Blair will face MPs for PMQs after a week of speculation about his relationship with Gordon Brown, amid claims in a new book and warnings from Labour MPs against disunity. The chancellor is leaving on a high-profile Africa tour while Mr Blair prepares to set out the party's election manifesto themes.", "gemma2:2b": "Tony Blair faces Prime Minister's questions following renewed speculation about his relationship with Gordon Brown. The chancellor is on a tour of Africa, while Labour MPs express concern over possible disunity and Tory leader Michael Howard will likely capitalize on the situation in the Commons.  Both Blair and Brown have faced accusations of political maneuvering from their respective parties and within the Labour party itself. Mr. Prescott also reportedly claimed that the prime minister told the chancellor to stand down before the next election but later changed his mind. \n", "qwen2.5:0.5b": "Tony Blair faces his first questions from MPs this week amid renewed speculation about their relationship with Gordon Brown. Blair claims he still trusts him despite claims to the contrary in a new book and suggests Labour MPs are looking for a \"unified Labour Party\" as he visits Africa next week. The Tories accuse the prime minister and chancellor of behaving like \"schoolboys squabbling in a playground,\" while Labour leader Michael Howard is expected to press his case further on how they handled their relationship in the past.", "qwen2.5:1.5b": "Tony Blair faces MPs as he prepares for the 2005 general election following a week of speculation about his relationship with Gordon Brown. The chancellor, currently touring Africa, has insisted on meeting with Mr Blair despite claims in a new book. Labour MPs warn against disunity, and Conservative leader Michael Howard may take up the theme in the Commons. Meanwhile, Prime Minister David Cameron is expected to outline themes for the next election manifesto, which was previously drawn up by Chancellor George Osborne.", "qwen2.5:3b": "Tony Blair faces his first PMQs in 2005 amid renewed speculation about his relationship with Gordon Brown. Meanwhile, Chancellor Gordon Brown tours Africa for poverty issues and insists he still trusts Blair despite a new book suggesting otherwise. Labour MPs warned against disunity while Tory leader Michael Howard may exploit the rift. Blair's next election manifesto is expected to be influenced by Brown, who has visited several African countries highlighting poverty issues. Backbenchers have expressed dissatisfaction over claims in Robert Peston’s book alleging that Blair had considered stepping down before his 2005 election and suggesting he no longer trusted Brown.", "opencoder:1.5b": "Blair to face MPs amid feud talk\n\nTony Blair faces his first prime minister's questions of 2005 after a week of renewed speculation about his relationship with Gordon Brown. Meanwhile, the chancellor is leaving Britain on a high-profile tour of Africa to highlight poverty issues. But before doing so, he insisted he still trusted Mr Blair, despite claims to the contrary in a new book. Labour MPs have warned against disunity and Tory leader Michael Howard may well take up the theme in the Commons. The Tories have already accused the prime minister and his chancellor of behaving like \"schoolboys squabbling in a playground\". At a campaign poster launch on Tuesday, Mr Brown was joined by Alan Milburn, who Mr Blair controversially put in charge of election planning in place of the chancellor. Later this week, the prime minister is due to set out the themes of his party's next election manifesto, which for the past two polls have been drawn up by the chancellor. Mr Brown, meanwhile, is visiting Tanzania, Mozambique and Kenya to highlight the plight of many Africans hit by Aids, war and famine - issues which Mr Blair has also spoken out on. The prime minister and chancellor faced backbench discontent at Monday's meeting of the Parliamentary Labour Party over claims made in journalist Robert Peston's new book. Mr Blair told MPs and peers: \"I know from everyone here, in Cabinet and government, nothing is going to get in the way of a unified Labour Party with a unified position and winning the third term people need it now.\" Labour's Paul Flynn said the pair had had a \"scorching\" from MPs.\n", "smollm:1.7b": "The summary should be concise and clear, without any unnecessary details or explanations. The key ideas and key points of the text are preserved in the summary.", "deepseek-r1:1.5b": "<think>\nOkay, so the user has given a text and wants it summarized concisely while preserving key ideas and details. They specifically asked for plain text without any explanations or formatting. \n\nLooking at the provided response, it's already well-structured with main points highlighted. The summary includes the Prime Minister Blair facing questions, his upcoming tour of Africa, the role of Labour MPs warning against disunity, and the interaction between Blair and Chancellor Brown.\n\nI need to make sure that every major point is included without adding any extra information or explanations. The user emphasized preserving key ideas and details, so I should avoid losing any important nuances from the original text. Also, it's crucial to ensure that only the summary is provided in plain text as per their instruction.\n</think>\n\nBlair faces his first prime minister's questions of 2005 after a week of speculation over his relationship with Gordon Brown. Meanwhile, Chancellor Tony Brown tours Africa to highlight poverty issues but remains loyal to Blair despite accusations of disunity. Labour MPs warn against disunity and suggest the Tory leader Michael Howard will join the Commons. Blair has hinted at further exploiting the tension between himself and his Chancellor during a Labour campaign event. Brown is visiting African countries to address Aids, war, and famine. Blair told Labour MPs: \"I know nothing in this government can hinder a united Labour Party with unity for the third term.\" Mr. Brown will host a dinner in 2003 where Blair said he would exit before election if unsure about Iraq's war.", "tinyllama:1.1b": "Concise summary of a week-long political tussle involving Tony Blair, Michael Howard, and Gordon Brown in the House of Commons following fresh revelations about their relationship. The prime minister denies rumors of his trusting Gordon Brown for fears of disunity and Mr Howard is likely to use the prime minister's next election manifesto as a platform for future campaigning against the party's top priority, Aids, war, famine, and other African issues. Meanwhile, Labour MPs call for unity and the chancelloor's involvement in setting the next Labour Party's manifestos to be revised due to the new book by journalist Robert Peston, with claims that Mr Blair contradicted his own statements about trusting Brown.", "tinydolphin:1.1b": " The UK government has faced backlash after it emerged that Prime Minister Tony Blair faces his first-ever prime minister's questions of 2005 amid feud rumors with former Chancellor Gordon Brown. Speculations surrounding their relationship have intensified following the release of Tony Blair's book, \"Faith.\" The political turmoil has also prompted Labour MPs to warn against disunity in an effort to capitalize on the existing disagreements between the two leaders.\n\nThe questioning will take place amidst tensions surrounding the UK's response to the Iraq war and the ongoing crisis in Africa. Michael Howard, leader of the Conservative Party, is expected to face off with Tony Blair in the Commons during his visit to Britain. This rivalry may come at a crucial time for the Tories, who have accused Brown of behaving like \"schoolboys\" when he insists that the prime minister and chancellor are still supportive despite claims made in the author's new book.\n\nBrown's visit to Africa coincides with Tony Blair's upcoming plans for his party's next election manifesto, which is expected to focus on addressing the issues faced by many Africans affected by poverty and famine. The prime minister's visit highlights the need for unity in British politics amid rumors of infighting within his administration.", "phi:2.7b": " The text reports on Tony Blair's first Prime Minister's Questions since a feud with Gordon Brown and his subsequent visit to Africa. It also mentions the controversy surrounding the claims made in Robert Peston' new book, which alleges that Michael Howard may use this as an opportunity to criticize Mr. Blair's leadership.\n", "orca-mini:3b": " Blair faces PMQs as feud talk resurfaces. The chancellor is leaving Africa on a high-profile tour to highlight poverty issues, while the prime minister and chancellor faced backbench discontent at a meeting of the Parliamentary Labour Party over claims made in a new book.", "hermes3:3b": "Tony Blair faces MPs questions amidst feud speculations over his relationship with Gordon Brown.", "stablelm-zephyr:3b": "Tony Blair faces prime minister's questions in 2005 amid renewed speculation about his relationship with Gordon Brown. Michael Howard may capitalize on the spat between the two leaders, while Brown highlights poverty issues during a tour of Africa. The Tories accuse the Prime Minister and Chancellor of behaving like \"schoolboys squabbling in a playground.\" Brown and Blair have spoken out on issues such as Aids, war, and famine in Africa. The pair faced backbench discontent over claims made in journalist Robert Peston's new book.", "chatgpt-4o-latest": "Tony Blair faces his first prime minister's questions of 2005 amid renewed speculation about tensions with Chancellor Gordon Brown. Brown, departing for a high-profile Africa tour, insisted he still trusted Blair despite claims in a new book suggesting otherwise. Labour MPs warned against party disunity, while Tory leader Michael Howard is expected to exploit the situation in the Commons. The book alleges Blair initially planned to step down before the next election but changed his mind, leading to further strain with Brown. Labour MPs expressed frustration at a party meeting, urging unity ahead of the election.", "stablelm2:1.6b": "Tony Blair faces PMQ after speculation about his relationship with Gordon Brown, while Labour MPs warn against disunity in response to a new book which claims Brown would stand down before next election due to loss of trust in Iraq war. Meanwhile, the chancellor is on a high-profile tour of Africa to address poverty issues and insists he trusts both Blair and Brown despite accusations from a book. Tory leader Michael Howard may capitalize on the spat during his Commons debates with both leaders. The themes of Labour's upcoming election manifesto are being discussed by the prime minister and his chancellor, while Brown visits Tanzania, Mozambique, and Kenya to address African struggles such  as Aids, war, and famine. The new book alleges Brown told Blair he would stand down due to loss of trust over Iraq war in November, after which Blair changed mind in June amid suspicions from Cabinet allies.", "granite3.1-dense:2b": "Tony Blair faces his first 2005 Prime Minister's Questions due to renewed speculation about his relationship with Gordon Brown, following revelations in a new book by journalist Robert Peston. The book claims Blair had considered resigning as prime minister before the next election due to trust issues arising from the Iraq War, but changed his mind after intervention from Cabinet allies and suspicions of Brown's alleged maneuvers. Despite this, Labour MPs warn against disunity, with Deputy Prime Minister John Prescott stating that MPs and cabinet members have expressed unwavering support for a unified party position. Meanwhile, Chancellor Gordon Brown is embarking on an African tour to address poverty issues, despite claims of a rift within the Labour Party. Tory leader Michael Howard may exploit this spat during his questioning of Blair in the Commons.", "reference": "The new book claims Mr Prescott hosted a dinner in November 2003 where the prime minister told Mr Brown he would stand down before the next election because he had lost trust over the Iraq war.In Mr Peston's book Mr Brown is alleged to have told the prime minister: \"There is nothing you could ever say to me now that I could ever believe.\"At a campaign poster launch on Tuesday, Mr Brown was joined by Alan Milburn, who Mr Blair controversially put in charge of election planning in place of the chancellor.Mr Blair then changed his mind in June 2004, after Cabinet allies intervened and amid suspicion the chancellor was manoeuvring against him, writes Mr Peston.On Tuesday, Deputy Prime Minister Mr Prescott told BBC News: \"They told us very clearly, it was the troops telling the leaders: get in line.\"The prime minister and chancellor faced backbench discontent at Monday's meeting of the Parliamentary Labour Party over claims made in journalist Robert Peston's new book.Mr Brown, meanwhile, is visiting Tanzania, Mozambique and Kenya to highlight the plight of many Africans hit by Aids, war and famine - issues which Mr Blair has also spoken out on."}