{"raw_text": "Tories unveil quango blitz plans\n \n Plans to abolish 162 quangos have been unveiled by the Conservatives as part of their effort to show how government red tape can be cut.\n \n Six government units would also be scrapped under proposals which the Tories say would save more than £4.3bn. Among the targets are strategic health authorities and the new fair access regulator for universities. Tory frontbencher John Redwood said Britain needed a slimmer government and lower taxes to be competitive.\n \n The plans would abolish regional assemblies and other regional bodies, such as boards tackling industrial development and housing. Their powers would be returned to elected local councils or national government. The Tories say the strategic health authorities are not needed as it is better that local people, rather than officials, run hospitals and surgeries.\n \n Announcing the plans, Mr Redwood said: \"Mr Blair has forgotten the interests of taxpayers, and has broken the pledges he made. \"Far from improving public services, spending taxpayers' money on quangos has led only to more bureaucrats, more regulation and higher taxes.\" His party leader, Michael Howard, argued a change in direction was needed to get a grip on spending. \"Labour are creating Two Britains: the Britain of the forgotten majority and bureaucratic Britain,\" he said. \"In the real world, people are working harder just to stand still. They've seen their pensions knocked for six. \"They're being squeezed by extra taxes. The forgotten majority are paying the price of bureaucratic Britain.\" The government has announced plans to cut 100,000 civil servants as part of its efficiency drive. The Liberal Democrats have said they would cut the number of Whitehall departments to make sure money reaches frontline services.\n", "llama3.2:1b": "The Conservatives unveiled plans to abolish 162 quangos and scrap six government units as part of their efforts to reduce red tape and lower taxes. These plans include cutting regional assemblies, boards for industrial development, and housing, with powers returning to elected local councils or national government. The move is seen as a step towards reducing bureaucracy and improving public services.", "llama3.2:3b": "Conservatives unveil plans to abolish 162 quangos to reduce government red tape and save £4.3bn. Six units would be scrapped, including strategic health authorities and university regulator. Tory frontbencher John Redwood argues for a slimmer government to be competitive with lower taxes, while Michael Howard says Labour is creating \"bureaucratic Britain\".", "gemma2:2b": "The Conservative Party unveiled a plan to abolish 162 quangos and save over £4.3 billion by streamlining government. These plans include abolishing regional assemblies and strategic health authorities, returning powers to local councils or national government.  The Tories argue that this will result in a slimmer government and lower taxes, making Britain more competitive. \n", "qwen2.5:0.5b": "The Conservatives plan to abolish 162 quangos and return powers of strategic health authorities and new fair access regulator for universities, saving more than £4.3bn in costs.", "qwen2.5:1.5b": "Conservatives propose abolishing 162 quangos and slashing £4.3bn in government spending, including strategic health authorities and universities' fair access regulator, as part of a bid to reduce red tape and lower taxes for competitiveness.", "qwen2.5:3b": "Tories propose abolishing 162 quangos and scrapping six government units to save over £4.3bn, aiming to reduce government red tape. Proposed changes include returning regional bodies' powers to local councils or national government. Tories argue against strategic health authorities as they believe locals should run hospitals and surgeries. Frontbencher John Redwood criticizes Labour for creating more bureaucracy and higher taxes, advocating for a slimmer government and lower taxes. The party also plans to cut 100,000 civil servants, while the Liberal Democrats aim to reduce Whitehall departments to ensure funds reach frontline services.", "opencoder:1.5b": "Tories unveil quango blitz plans. Six government units are scrapped under proposals which Tories say would save more than £4.3bn. The strategic health authorities are not needed as it is better that local people, rather than officials, run hospitals and surgeries. Mr Redwood said: \"Mr Blair has forgotten the interests of taxpayers, and has broken the pledges he made. Far from improving public services, spending taxpayers' money on quangos has led only to more bureaucrats, more regulation and higher taxes.\" The party leader, Michael Howard, argued a change in direction was needed to get a grip on spending.\n", "smollm:1.7b": "The summary should be:\n\"Tories unveil quango blitz plans to abolish 162 quangos, scrap strategic health authorities and reduce regional bodies.\"", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text into just a summary with plain text and no explanations or formatting. Let me read through it first.\n\nThe article talks about the Conservatives proposing plans to abolish 162 quangos, which are likely government units. They mention cutting more than £4.3 million in costs as part of their effort to reduce bureaucracy. The targets include strategic health authorities and a new university access regulator. \n\nRedwood, a Tory frontbencher, is criticized for recommending lower taxes and making Blair's promises on taxpayer interests seem broken. He argues that spending on quangos has caused more bureaucrats and higher taxes than intended.\n\nThe government plans to cut 100,000 civil servants due to efficiency needs. The Liberal Democrats plan to reduce the number of Whitehall departments for better allocation of money to frontline services.\n\nSo, I should capture all these points concisely in plain text without any extra info.\n</think>\n\nSummaries of the text:\n\nCorporation Unveals Quango Blitz Plans: The Conservatives have unveiled plans to abolish 162 quangos, aiming to reduce government bureaucracy and cut costs. They plan to eliminate more than £4.3 million through reforms that save money while targeting strategic health authorities and a new university access regulator.\n\nJohn Redwood criticized the government's move, calling for lower taxes and questioning Blair's promises. He argued that spending on quangos led to more bureaucrats and higher taxes.\n\nThe government will cut 100,000 civil servants as part of an efficiency drive. The Liberal Democrats aim to reduce Whitehall departments to ensure funds reach frontline services.", "tinyllama:1.1b": "The Conservatives unveil plans to abolish 162 government units and save $4.3bn by scrapping strategic health authorities, fair access regulators for universities, and regional assemblies. The proposals aim to create a slimmer government, lower taxes, and improve public services while breaking promises made during the Blair government's reign. Announcing the plans, John Redwood, frontbencher of the Conservative Party, said: \"The Blair government has broken the pledges they made on taxpayers' money and has allowed the bureaucracized quangoes to control our lives,\" while Michael Howard, party leader, called for a change in direction in order to get back on track with spend.", "tinydolphin:1.1b": " Conservatives unveil plans to abolish 162 quangos and remove some key responsibilities from government bodies. This announcement comes in response to pressure for a slimmer government, with Tory leader John Redwood suggesting Britain needs to reduce taxes in order to remain competitive. The proposals would mean the removal of several important quangos, including strategic health authorities and the new fair access regulator for universities. The Conservatives also plan to abolish regional assemblies and other regional bodies that are not essential for local services. This move could save the government around £4.3bn in red tape costs and reduce the number of bureaucrats responsible for running hospitals, GP surgeries, and schools.", "phi:2.7b": " The Conservative Party unveiled proposals to abolish 162 quangos, including regional assemblies and strategic health authorities, in order to reduce government red tape and save over £4.3bn. Tory frontbencher John Redwood believes that a slimmer government and lower taxes are needed for Britain to be more competitive, while Liberal Democrat leader Michael Howard criticizes the creation of bureaucratic Britain. The government has also announced plans to cut 100,000 civil servants as part of its efficiency drive.\n", "orca-mini:3b": " The Conservatives propose to abolish 162 quangos and scrap six government units, including strategic health authorities and fair access regulators for universities. They argue that local people running hospitals and surgeries is better than officials. John Redwood, a Tory frontbencher, said the Tories need a slimmer government and lower taxes to be competitive. The Liberal Democrats also support cutting the number of Whitehall departments to ensure money reaches frontline services.", "hermes3:3b": "Conservatives propose abolishing 162 quangos and 6 gov units to save over £4.3bn, returning powers back to local councils or national govt.", "stablelm-zephyr:3b": "The Conservatives have unveiled plans to abolish 162 quangos, saving over £4.3bn and cutting government red tape. Six government units will also be scrapped, including strategic health authorities and the fair access regulator for universities. The party believes that a slimmer government and lower taxes will make Britain more competitive. This comes as the government plans to cut 100,000 civil servants and reduce Whitehall departments to prioritize frontline services.", "chatgpt-4o-latest": "The Conservatives have announced plans to abolish 162 quangos and six government units, aiming to cut red tape and save over £4.3bn. Targets include strategic health authorities and the fair access regulator for universities, with powers returning to local councils or national government. John Redwood criticized Labour for increasing bureaucracy and taxes, while Michael Howard warned of a growing divide between ordinary citizens and bureaucratic Britain. The government has already planned to cut 100,000 civil servants, and the Liberal Democrats propose reducing Whitehall departments to improve frontline services.", "stablelm2:1.6b": "The Conservatives revealed plans to abolish six government units and target strategic health authorities to save more than £4.3bn. These proposals aim to reduce regional assemblies and other bodies, which would return their powers to elected local councils or national government. Tory MP John Redwood argues that removing quangos will improve public services and reduce bureaucratic spending, while Labour claims it is merely creating two Britains - one of the forgotten majority and bureaucratic Britain - with higher taxes and increased civil servants.", "granite3.1-dense:2b": "The Conservatives have proposed a quango (quasi-governmental organization) elimination plan, targeting 162 such bodies and saving over £4.3bn. These include strategic health authorities, the fair access regulator for universities, regional assemblies, and boards addressing industrial development and housing. The Tories argue that local councils or national government should assume these responsibilities to reduce bureaucracy, lower taxes, and enhance competitiveness. They claim Prime Minister Blair has neglected taxpayer interests by excessive spending on quangos, leading to more bureaucracy, regulation, and higher taxes. Tory frontbencher John Redwood emphasized the need for a leaner government to help the forgotten majority struggling with lower living standards due to increased taxes and reduced pension values. The Conservatives also support cutting 100,000 civil servants as part of their efficiency drive. The Liberal Democrats have similarly vowed to reduce Whitehall departments to ensure public spending reaches frontline services more effectively.", "reference": "Six government units would also be scrapped under proposals which the Tories say would save more than £4.3bn.Tory frontbencher John Redwood said Britain needed a slimmer government and lower taxes to be competitive.The Tories say the strategic health authorities are not needed as it is better that local people, rather than officials, run hospitals and surgeries.\"Labour are creating Two Britains: the Britain of the forgotten majority and bureaucratic Britain,\" he said.The government has announced plans to cut 100,000 civil servants as part of its efficiency drive.Their powers would be returned to elected local councils or national government.The Liberal Democrats have said they would cut the number of Whitehall departments to make sure money reaches frontline services."}