{"raw_text": "Iraqis win death test case probe\n \n The family of an Iraqi civilian allegedly killed by UK troops have won a challenge against the government's refusal to order a full inquiry.\n \n The High Court ruled on Tuesday that Baha Mousa's death in British custody in Iraq fell within the European Convention on Human Rights. And the judges paved the way for an independent inquiry by saying previous investigations were inadequate. But judicial reviews into five other deaths in southern Iraq were ruled out. Their families will be appealing against the judgement.\n \n The families' solicitor Phil Shiner described it as \"a historic day for human rights and the rule of law in the UK\". Father-of-two Mr Mousa, 28, a hotel receptionist, was arrested with eight men seized at a hotel in Basra in September 2003. He was allegedly beaten to death while in the custody of the Queen's Lancashire Regiment. The Iraqi families' lawyer argued that failing to adequately investigate the death breached the European Convention on Human Rights.\n \n Ministry of Defence lawyers argued the UK-controlled area of southern Iraq was outside European jurisdiction. But Lord Justice Rix and Mr Justice Forbes ruled that UK jurisdiction could extend to a UK-run prison, but did not apply \"to the total territory of another state\". They said as Mr Mousa was in custody when he died, his case came within the UK's jurisdiction. The other five Iraqis did not die in custody, so their cases had to fail, they said.\n \n And it was difficult to say that the investigation which had already occurred \"has been timely, open or effective\", the judges said. After the ruling Carla Ferstman, legal director of the human rights organisation Redress, said: \"It is not enough for the military to investigate behind closed doors. \"There must be an effective public investigation by an independent official body. Only such an investigation could reveal what really happened and who might be responsible.\" Other allegations involving British soldiers included the shooting of an Iraqi police commissioner and the shooting of four Iraqi civilians in May 2003. Both sides were granted permission to appeal.\n \n Prime Minister Tony Blair's official spokesman said: \"Obviously we will need to study this detailed judgment. I would point out, however, that a separate criminal case is currently being considered by the army prosecuting authority. \"I can't say anything further for obvious reasons. The MoD are considering whether to appeal.\" But former British Commander Colonel Bob Stewart said : \"Anyone at the top [of the military] will be saddened by the verdict that has taken place but will say: 'If there's a case to answer, let's have it out. Because we don't want people thinking that British soldiers beat up civilians and get away with it',\" he said. \"The Ministry of Defence does everything in its power to try to prove we act ethically and properly under the rules of war.\"\n", "llama3.2:1b": "Iraqis win challenge against UK government over Baha Mousa's death in custody, High Court ruling that his death fell within European Convention on Human Rights. Judges found that previous investigations were inadequate. Five other deaths in southern Iraq were ruled out due to jurisdictional concerns. Families will appeal against the verdict.", "llama3.2:3b": "UK High Court rules Iraqis' death case falls within European Convention on Human Rights, paving way for independent inquiry; five other deaths ruled out due to lack of evidence; families plan to appeal against the judgement.", "gemma2:2b": "An Iraqi civilian’s death while in custody of UK troops has been ruled as a case falling under European human rights law, paving the way for an independent inquiry.  Five other deaths in Iraq were not included in the ruling, and their families will appeal. The court found that investigating the death was insufficient. \n", "qwen2.5:0.5b": "Iraqi families' lawyers won a challenge against the UK's refusal to order an independent inquiry into the deaths of 5 Iraqis, who were allegedly killed by British troops in southern Iraq. The High Court ruled that Mr Mousa's death was within the European Convention on Human Rights and an independent inquiry was needed. However, other families' appeals for a full inquiry were dismissed.", "qwen2.5:1.5b": "A legal challenge against the UK government's refusal to investigate an Iraqi death case was won by the families of Baha Mousa and five other Iraqis killed by British troops. The High Court ruled that while a full inquiry into Mousa's death is necessary, investigations into the other deaths were deemed inadequate. The ruling paves the way for a public investigation but does not include all cases.", "qwen2.5:3b": "Iraqi families won a High Court case against the UK government's refusal to order a full inquiry into Baha Mousa's death, an Iraqi civilian allegedly killed by British troops. The court ruled that Mousa's death fell within the European Convention on Human Rights and paved the way for an independent investigation. However, judicial reviews into five other deaths in southern Iraq were ruled out as they did not occur while the victims were in custody. The Ministry of Defence argued UK jurisdiction only applied to UK-controlled areas but Rix and Forbes judges disagreed. Legal director Carla Ferstman emphasized the need for a public inquiry by an independent official body. Other allegations involving British soldiers include shooting Iraqi police commissioner and civilians, with both sides granted permission to appeal. Prime Minister Tony Blair's spokesman said they would study the judgment while former Commander Colonel Bob Stewart stated it was important that any case be heard in court.", "opencoder:1.5b": "Iraqis win death test case probe\n\nThe family of an Iraqi civilian allegedly killed by UK troops has won a challenge against the government's refusal to order a full inquiry. The High Court ruled on Tuesday that Baha Mousa's death in British custody in Iraq fell within the European Convention on Human Rights. The judges paved the way for an independent inquiry by saying previous investigations were inadequate. However, the judicial reviews into five other deaths in southern Iraq were ruled out and their families will be appealing against the judgement. The families' solicitor Phil Shiner described it as a historic day for human rights and the rule of law in the UK. Mr Mousa, 28, a hotel receptionist, was arrested with eight men seized at a hotel in Basra in September 2003. He was allegedly beaten to death while in the custody of the Queen's Lancashire Regiment. The Iraqi families' lawyer argued that failing to adequately investigate the death breach the European Convention on Human Rights.\n \nMinistry of Defence lawyers argued the UK-controlled area of southern Iraq was outside European jurisdiction. But Lord Justice Rix and Mr Justice Forbes ruled that UK jurisdiction could extend to a UK-run prison, but did not apply as \"to the total territory of another state\". They said as Mr Mousa was in custody when he died, his case came within the UK's jurisdiction. The other five Iraqis did not die in custody, so their cases had to fail, they said.\n \nIt was difficult to say that the investigation which had already occurred \"has been timely, open or effective\", the judges said. After the ruling Carla Ferstman, legal director of the human rights organisation Redress, said: \"It is not enough for the military to investigate behind closed doors. There must be an effective public investigation by an independent official body. Only such an investigation could reveal what really happened and who might be responsible.\" Other allegations involving British soldiers included the shooting of an Iraqi police commissioner and the shooting of four Iraqi civilians in May 2003. Both sides were granted permission to appeal.\n \nPrime Minister Tony Blair's official spokesman said: \"Obviously we will need to study this detailed judgment. I would point out, however, that a separate criminal case is currently being considered by the army prosecuting authority. However, I can't say anything further for obvious reasons. The MoD are considering whether to appeal.\" But former British Commander Colonel Bob Stewart said : \"Anyone at the top of the military will be saddened by the verdict that has taken place but will say: 'If there's a case to answer, let's have it out. Because we don't want people thinking that British soldiers beat up civilians and get away with it\". The Ministry of Defence does everything in its power to try to prove we act ethically and properly under the rules of war.\n", "smollm:1.7b": "Summarize the text concisely, preserving key ideas and details:\n\nIraqis win death test case probe by the UK government after ruling on Baha Mousa's death. The European Convention on Human Rights was violated in the case. Five other Iraqis' deaths were ruled out as not falling within the European Convention. The UK government is required to investigate each case and determine whether it falls within the European Convention, but this does not apply to the total territory of another state.\n\nThe ruling applies only to cases involving British soldiers. It does not address the issue of whether the UK government has a duty to investigate all cases that occur in its territory. The MoD is currently considering whether to appeal against the ruling. The UK government will say it would like to study the ruling before making any decisions, but Colonel Stewart said: \"If there's a case to answer, let's have it out.\"\n\nThe European Convention on Human Rights was violated in the case of Baha Mousa's death. Five other Iraqis' deaths were ruled out as not falling within the European Convention. The UK government is required to investigate each case and determine whether it falls within the European Convention, but this does not apply to the total territory of another state.\n\nThe ruling applies only to cases involving British soldiers. It does not address the issue of whether the UK government has a duty to investigate all cases that occur in its territory. The MoD is currently considering whether to appeal against the ruling. The UK government will say it would like to study the ruling before making any decisions, but Colonel Stewart said: \"If there's a case to answer, let's have it out.\"", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Iraqis winning a death test case probe. The user wants only the summary as plain text without explanations or any formatting.\n\nFirst, I'll read through the entire paragraph carefully. It's about an Iraqi civilian killed by UK troops, and the Iraqi families are winning a challenge against the UK government not ordering a full inquiry. \n\nThe High Court ruled that Baha Mousa's death was within the European Convention on Human Rights. They made it possible for an independent investigation to proceed. But other five deaths in southern Iraq were ruled out because their investigations were inadequate. Their families will appeal.\n\nPhil Shiner described it as a historic day, and the father-of-two is 28, working as a hotel receptionist. He was beaten while in British custody with eight men from a Basra hotel.\n\nThe Ministry of Defence argued that UK troops controlled southern Iraq, which was outside European jurisdiction, but could extend to UK-run prisons. However, it didn't apply to the total territory. Mr Mousa died while in custody, so his case fit within the UK's jurisdiction.\n\nJudges said the investigation had been timely and effective. They concluded that military investigations need to be open. But there were other British soldiers involved too: shooting an Iraqi police commissioner and four civilians in May 2003.\n\nBoth sides were granted appeals. The Prime Minister's official spokesman said they'll study the decision, mention a separate criminal case by the army, but military leaders are upset about the verdict and want it out as evidence.\n\nNow, I need to condense this into a concise summary. I should include key points: who won the challenge, the criteria for the inquiry, the judges' rulings on other deaths, the legal issues around investigations, and the implications of the ruling.\n</think>\n\nThe Iraqi family of Baha Mousa won a challenge against UK government refusal to conduct a full inquiry into his death. The High Court ruled that Mousa's death fell within European Human Rights rules, allowing an independent investigation. However, five other deaths in southern Iraq were denied due to inadequate investigations. Their families will appeal the ruling.\n\nMousa, 28, worked as a hotel receptionist while beaten and detained by British troops in Basra in 2003. The UK military argued that their controlled area of Iraq was outside European jurisdiction but could extend to UK-run prisons. Mousa died while detained, so his case fit within the UK's jurisdiction.\n\nJudges found that the previous investigation had been timely and effective. They concluded that military investigations must be open. Other British soldiers, including those involved in shooting an Iraqi police commissioner and four civilians, were also included in appeals.", "tinyllama:1.1b": "In a landmark case, an Iraqi family whose civilian allegedly died while in British custody in Iraq won a probing inquiry into his death by a UK High Court. The court's judgment ruled that an investigation conducted behind closed doors was adequate and could proceed with the families of other detainees seeking an independent inquiry to be held outside European jurisdiction. The judge, Lord Justice Rixton and Mr Justice Forbes, said the Iraqi courts had previously failed to investigate the death in custody and that the military's investigation did not reveal anything untoward. The British government has been forced to consider appealing and will need to study the detailed judgment. The MoD may appeal but former British Commander Colonel Bob Stewart suggested it would be \"shameful\" if there was a case to answer. The families of other detainees are seeking an independent inquiry into deaths in southern Iraq.", "tinydolphin:1.1b": " The High Court ruled on Tuesday that Baha Mousa's death in British custody in Iraq had fallen within the European Convention on Human Rights. This means his family can now seek a full inquiry into what happened to him, rather than being denied justice through judicial reviews or inadequate investigations. However, judicial reviews of five other similar cases have been ruled out, and their families will need to appeal against the court's ruling.", "phi:2.7b": " The family of an Iraqi civilian whose death was allegedly caused by UK troops has won a legal challenge against the government's refusal to conduct a full inquiry into his death, as per the European Convention on Human Rights. While ruling in their favor, the court did not grant an independent investigation for five other deaths in Iraq but allowed judicial reviews to continue. \n", "orca-mini:3b": " The Iraqi family of a civilian allegedly killed by UK troops has won a challenge against the government's refusal to order a full inquiry. The High Court ruled that the European Convention on Human Rights applies to the UK's jurisdiction in southern Iraq, paving the way for an independent inquiry by saying previous investigations were inadequate. However, judicial reviews into five other deaths in southern Iraq were ruled out, and the families will appeal against the judgement.", "hermes3:3b": "Iraqi family wins death probe challenge, High Court rules Baha Mousa's death fell within ECHR, paving way for independent inquiry but not other deaths involving UK troops.", "stablelm-zephyr:3b": "An Iraqi family won a key victory against the UK government's refusal to investigate the death of their relative, Baha Mousa, allegedly killed by British troops in Iraq. The High Court ruled that his death fell within the European Convention on Human Rights and paved the way for an independent inquiry, stating previous investigations were inadequate. Five other deaths in southern Iraq were ruled out, with their families planning to appeal. This ruling is considered a \"historic day for human rights and the rule of law in the UK,\" according to the family's solicitor. Prime Minister Tony Blair's official spokesman mentioned that they would study the judgment while the Ministry of Defence considers whether to appeal.", "chatgpt-4o-latest": "The UK High Court ruled that the death of Iraqi civilian Baha Mousa in British custody fell under the European Convention on Human Rights, paving the way for an independent inquiry. The court found previous investigations inadequate but rejected judicial reviews for five other deaths, as they did not occur in custody. Mousa, a hotel receptionist, was allegedly beaten to death by British troops in 2003. The Ministry of Defence argued that UK jurisdiction did not extend to Iraq, but the judges ruled that it applied to UK-run facilities. Human rights groups called for an independent public investigation. The UK government is considering an appeal, while a separate criminal case is ongoing. Military officials emphasized their commitment to ethical conduct.", "stablelm2:1.6b": "Iraqi family wins death inquiry case against UK troops; High Court ruled Baha Mousa's death within European Convention on Human Rights, paving the way for an independent inquiry. Five other deaths in southern Iraq will be appealed, with judicial reviews into those cases ruled out. Other allegations involving British soldiers include shootings of an Iraqi police commissioner and four civilians.", "granite3.1-dense:2b": "Iraqi families have won a legal battle for an independent inquiry into their relatives' deaths allegedly caused by UK troops. The High Court ruled that Baha Mousa's beating death in British custody during a 2003 arrest in Iraq violated the European Convention on Human Rights, paving the way for such an investigation. Previous investigations were deemed inadequate by the judges. However, appeals are planned for five other cases where victims did not die in custody. The ruling was hailed as a significant step for human rights and rule of law in the UK. The families' legal team argued that insufficient investigations breached international human rights standards. Judges found that UK jurisdiction applied to UK-run prisons, but not to the entire territory of another state. This decision emphasizes the need for transparent, independent public inquiries into such incidents to ensure accountability and truthfulness. The Ministry of Defence is considering an appeal and a separate criminal case against those responsible is being reviewed by the army prosecuting authority.", "reference": "They said as Mr Mousa was in custody when he died, his case came within the UK's jurisdiction.And it was difficult to say that the investigation which had already occurred \"has been timely, open or effective\", the judges said.The High Court ruled on Tuesday that Baha Mousa's death in British custody in Iraq fell within the European Convention on Human Rights.The other five Iraqis did not die in custody, so their cases had to fail, they said.Ministry of Defence lawyers argued the UK-controlled area of southern Iraq was outside European jurisdiction.The Iraqi families' lawyer argued that failing to adequately investigate the death breached the European Convention on Human Rights.He was allegedly beaten to death while in the custody of the Queen's Lancashire Regiment.But former British Commander Colonel Bob Stewart said : \"Anyone at the top [of the military] will be saddened by the verdict that has taken place but will say: 'If there's a case to answer, let's have it out.The family of an Iraqi civilian allegedly killed by UK troops have won a challenge against the government's refusal to order a full inquiry.Because we don't want people thinking that British soldiers beat up civilians and get away with it',\" he said.But judicial reviews into five other deaths in southern Iraq were ruled out."}