{"raw_text": "Burglar defence guidelines issued\n \n Householders who injure or even kill intruders are unlikely to be prosecuted - providing they were acting \"honestly and instinctively\", new guidelines say.\n \n The law also protects those who use \"something to hand\" as a weapon. The leaflet, published by police and prosecutors, aims to combat confusion about current legislation, which lets people use \"reasonable force\". The guidance, relating to England and Wales, follows a recent decision by ministers not to change the law. Doing what you \"honestly and instinctively\" believed was necessary would be the strongest evidence of acting lawfully, the guidance said.\n \n And the law protects those who use \"something to hand\" as a weapon, said the leaflet published jointly by the Crown Prosecution Service (CPS) and Association of Chief Police Officers (ACPO).\n \n As a general rule, the more extreme the circumstances and fear felt, the more force can be used lawfully in self-defence, it said, adding that householders do not have to wait to be attacked before defending themselves. But knocking someone unconscious then killing them or hurting them further, or setting a trap for an intruder without involving the police were given as examples of \"excessive and gratuitous\" force. The Tories have called for a change in the law so householders are only prosecuted if they use \"grossly disproportionate\" force. Their demands have been backed by former Metropolitan Police Commissioner Sir John Stevens. Tory frontbencher Patrick Mercer is now pursuing the proposal through a private member's bill in Parliament.\n \n The government instead mounted a publicity campaign to clear up public uncertainty after a review concluded no law change was necessary. Home Secretary Charles Clarke said: \"I believe in that old adage 'an Englishman's home is his castle'. That's exactly what should be the case and I believe the current law provides that.\" An \"informal trawl\" of CPS records found 11 people had been prosecuted after attacking intruders in the past 15 years, five of whom were convicted. They included a man who laid in wait for a burglar on commercial premises in Cheshire, before beating him up, throwing him into a pit and setting him on fire.\n \n A CPS spokesperson said the figures were not definitive because prosecutions are not listed according to whether they were committed by a householder on an intruder. In one of Britain's highest profile cases, Norfolk farmer Tony Martin was jailed for life for murdering 16-year-old burglar Fred Barras, in 1999. The conviction was later reduced to manslaughter on appeal and the sentence cut to five years. Mr Martin was freed from prison in July 2003. The guidance published on Tuesday, said the police had a duty to investigate all incidents involving a death or injury. In cases involving householders attacking intruders prosecutors and police were \"determined\" they would be dealt with \"as swiftly and as sympathetically as possible\", it said.\n", "llama3.2:1b": "Burglar defence guidelines issued by the Crown Prosecution Service (CPS) in England and Wales aim to clarify current legislation on using force in self-defence, stating that householders who use \"reasonable force\" or act instinctively will not be prosecuted. The guidelines also acknowledge that those who use a weapon as a means of defense are protected, unless they cause extreme harm or death, which is considered \"excessive and gratuitous\".", "llama3.2:3b": "Householders who use reasonable force in self-defense are unlikely to be prosecuted if they acted honestly and instinctively, according to new guidelines issued by the Crown Prosecution Service and Association of Chief Police Officers. The law protects those using objects found in their possession as weapons. Extreme circumstances and fear can justify more force, but excessive or gratuitous force is not acceptable. Only a few people have been prosecuted for attacking intruders in the past 15 years, with most cases resulting in convictions being reduced on appeal.", "gemma2:2b": "Householders who defend themselves against intruders are likely not prosecuted if they acted honestly and instinctively.  The law protects those using \"something to hand\" as a weapon, and the amount of force used can vary based on the circumstances and fear felt. The guidelines explain that knocking someone unconscious then killing them is considered excessive force. The government maintains that the current law provides protection for homeowners and conducted a review concluding no change was needed. Prosecutions have occurred in cases involving homeowner attacks on intruders, though these are not always recorded to distinguish their nature. \n", "qwen2.5:0.5b": "Burglars who injure or kill intruders are unlikely to face prosecution, according to new guidelines published by the police and prosecutors. The leaflet aims to combat confusion about current legislation that allows people to use \"reasonable force\" when defending themselves from an intruder. It states that those using \"something to hand\" as a weapon may still be held responsible for their actions if they were acting \"honestly and instinctively\". Householders can defend themselves if the circumstances are extreme enough, but it's not always necessary to use \"grossly disproportionate\" force in self-defense.", "qwen2.5:1.5b": "New guidelines issued by law enforcement aim to clarify self-defense laws, emphasizing that injuries inflicted during defense are unlikely to result in prosecution if justified through honesty and instinct. The leaflet also clarifies the protection of using \"something to hand\" as a weapon, while cautioning against excessive force or traps without police involvement. However, prosecutions remain possible for individuals found guilty of grossly disproportionate force.", "qwen2.5:3b": "Burglar defence guidelines have been issued stating that homeowners who injure or kill intruders acting in self-defense, provided they acted “honestly and instinctively,” are unlikely to face prosecution. The leaflet from police and prosecutors aims to clarify current legislation which allows for reasonable force usage. Householders do not need to wait for an attack; however, excessive and gratuitous use of force is prohibited. The government has maintained the status quo without changing the law after a review concluded no changes were necessary. Homeowners who have attacked intruders in self-defense include those who used extreme measures like setting up traps or causing severe harm. Recent cases such as Norfolk farmer Tony Martin’s conviction for manslaughter on appeal following the murder of a burglar highlight the balance between protecting property and preventing abuse of force. The guidance also emphasizes that all incidents involving deaths or injuries require police investigation, with prosecutors committed to swift and sympathetic handling of such cases.", "opencoder:1.5b": "The law in place now states that when someone is found intentionally causing harm to an intruder, the individual will be prosecuted. The new guidelines, which outline these punishments, focus on ensuring a lawful response is given in instances where the householders may otherwise be compelled to act out their intentions.\n\nFollowing the decision by the Crown Prosecution Service (CPS) and the Association of Chief Police Officers (ACPO), the law now allows individuals who intentionally harm an intruder without resorting to \"reasonable force\" - essentially, a physical action such as stabbing, kicking, or throwing. The guidance further details how such acts would be counted in fines, which if not properly enforced could lead to unnecessary criminal charges.\n\nFurther, there are specific examples of excessive and gratuitous force mentioned in the guidance, where individuals who intentionally harm someone while avoiding law enforcement actions were charged with it. The Tories have also raised concerns about whether this change needs to be implemented strictly based on perceived risks or if their collective needs can outweigh any potential benefits.\n\nThe government's approach has been to raise public awareness and foster dialogue on law enforcement, to monitor the effectiveness of the law in combating intruders, to ensure it remains legal and effective. The guidance also highlights how the law might be used to improve public safety by providing a deterrent for unnecessary assaults or harmings.\n\nA notable CPS case, which highlighted the necessity of increased law enforcement in combating intruders, was a case involving a 16-year-old burglar who was found killing him before he could be attacked. After being released from prison and charged with murder, they were eventually sent to court where the charge was dismissed as a manslaughter.\n\nIn conclusion, the new guidelines and accompanying examples demonstrate that the law needs to be refined to create a more lawful environment for intruder behavior. This is a step towards ensuring law enforcement continues to operate effectively against intruders, while also improving public safety and community engagement.\n", "smollm:1.7b": "The summary is:\n\n* Burglar defence guidelines issued by the Householders who injure or even kill intruders are unlikely to be prosecuted - providing they were acting \"honestly and instinctively\" and using reasonable force.\n* The law protects those who use \"something to hand\" as a weapon, which means householders can defend themselves without needing police permission.\n* The leaflet aims to combat confusion about current legislation by explaining the law in plain language.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text aboutlarvation defense guidelines. Let me read through the user's query again to make sure I understand what they're asking for.\n\nThey provided a text that seems quite detailed but is pretty technical. The task is to create a concise summary, only the key ideas and details. It should be plain text without any explanations or formatting. \n\nFirst, I'll try to break down each section of the original text to identify the main points. \n\nThe first sentence talks about the new guidelines forlarvation defense. Householders who hurt or killed intruders aren't automatically prosecuted unless they acted \"honestly and instinctively.\" That's a key point.\n\nNext, it mentions the protection against using something as a weapon, specifically mentioning leaflets published by police and prosecutors. The guidance covers England and Wales but didn't change the law, which is interesting. They aimed to combat confusion about legal provisions, like allowing reasonable force. So I need to include that part.\n\nThen, it says that the general rule is that using force should be lawful if done \"honestly and instinctively,\" and householders don't have to wait until being attacked before defending themselves. Examples given are knocking someone unconscious to kill them or setting traps without police involvement. This seems important for understanding the scope of the guidance.\n\nAnother point from this section is about the policy change by the Tories, calling for a law that only uses \"grossly disproportionate\" force as prosecution. Their demands were supported by Sir John Stevens and their opponent in Parliament, Patrick Mercer. This adds context about the political aspect driving the proposal.\n\nAfter that, there's an overview of the government's approach after a review, which said no change was needed because existing law already provided that. They had a campaign to clarify things. An example given is a Norfolk farmer who was convicted for murdering a 16-year-old but later re-cded on appeal.\n\nSo putting it all together, I need to make sure the summary includes:\n- The new guidelines forlarvation defense.\n- Protection against using weapons as a weapon.\n- Examples of legal uses.\n- A push for policy change by the government.\n- The campaign to educate the public and examples from cases like Tony Martin.\n\nI should structure it in a way that's concise but covers all these points without getting bogged down. I'll aim to mention honesty, instinct, examples of lawful use, and the political push from the Tories.\n\nAlso, ensuring that the summary is clear and uses simple language without any markdown or extra formatting. Just plain text with key phrases highlighted if necessary. \n\nI need to make sure I don't miss any important details like the number of prosecutions in examples, or specific figures. Maybe mention 11 prosecutions out of 15 years and others like Tony Martin's case.\n\nAlright, let me try drafting a summary that captures all these elements.\n</think>\n\nThe government issued new guidelines forlarvation defense, emphasizing honesty and instinct in protecting householders from prosecution. The law now protects those using \"something to hand\" as a weapon, with examples of legal uses including knocking someone unconscious or setting traps. There's a push for policy change by the Tories, calling for a law that only uses \"grossly disproportionate\" force. Householders have faced 11 prosecutions in 15 years, including one man who was beaten before being tackled and set on fire. A campaign to educate public uncertainty after a review concluded no law change was needed, with examples like Tony Martin's life imprisonment for murdering a 16-year-old.", "tinyllama:1.1b": "A newly released guide from UK law enforcement agencies and prosecutors suggests that the current legal guidelines regarding self-defense against intruders should not be changed, as householders do not have to wait for an attack before defending themselves. The guidance notes that there are exceptional circumstances where force can be used, such as in self-defense or to prevent an immediate threat. However, the leaflet also warns that householders should avoid using excessive and gratuitous force in these situations, as they may then be prosecuted for murder or manslaughter. The guidelines are intended to help protect those who use \"reasonable\" force in such situations.", "tinydolphin:1.1b": " The law currently protects people who are trying to defend themselves against intruders by using something that is designed for their use, such as a brick or stone. However, some believe this protection may be too broad, which is why a draft bill has been proposed in Parliament that would restrict the use of \"reasonable force\" in self-defense. The government's current policy does not provide enough protection for householders who are attacked, and critics say it encourages unnecessary use of force by intruders.", "phi:2.7b": " The new guidelines issued by police and prosecutors in England and Wales protect people who use \"reasonable force\" to defend themselves against burglars, as long as they acted honestly and instinctively. This includes those using something they have on hand to fight back. Excessive and gratuitous use of force will not be tolerated, according to the guidance. The government has not changed the law but instead launched a publicity campaign to clarify confusion around current legislation. Few prosecutions have been made in the past 15 years under the current law, but prosecutors still consider every case carefully. A former Metropolitan Police Commissioner has backed the call for a change in the law to protect householders from prosecution if they use \"grossly disproportionate\" force.\n", "orca-mini:3b": " Burglar defence guidelines issued, providing householders with legal protection if they use reasonable force in self-defense, provided they act honestly and instinctively. The law also protects those who use something to hand as a weapon. Householders do not have to wait to be attacked before defending themselves. The government launched a publicity campaign to clarify public uncertainty after a review concluded no law change was necessary. Figures show that 11 people were prosecuted for attacking intruders in the past 15 years, with five of them being convicted. A CPS spokesperson said the figures were not definitive because prosecutions were not listed according to whether they were committed by a householder on an intruder. In one of Britain's highest profile cases, Norfolk farmer Tony Martin was jailed for life for murdering 16-year-old burglar Fred Barras in 1999.", "hermes3:3b": "Burglar defence guidelines:\n- No prosecution if acting 'honestly and instinctively'\n- Law allows using reasonable force for self-defence\n- Householders can use something to hand as weapon\n- Excessive and gratuitous force may lead to prosecution", "stablelm-zephyr:3b": "New guidelines from the UK police and prosecutors' association clarify that homeowners using \"reasonable force\" against intruders, who injure or kill them in self-defense, will not face prosecution, provided they act honestly and instinctively. The law also protects those who use items as weapons. These guidelines apply to England and Wales, where ministers recently decided against changing the existing law regarding the use of force in self-defense. Homeowners do not have to wait for an attack before defending themselves, but using excessive or gratuitous force—like killing or seriously hurting intruders without involving the police—is prohibited. The government chose not to change the law after a review, opting instead for a public awareness campaign following several high-profile cases where people were prosecuted for attacking burglars.", "chatgpt-4o-latest": "Householders in England and Wales who injure or kill intruders are unlikely to be prosecuted if they act \"honestly and instinctively,\" according to new guidelines from police and prosecutors. The law allows the use of \"reasonable force\" and protects those who use objects at hand as weapons. The guidance clarifies that extreme fear justifies greater force but warns against excessive actions like setting traps or attacking an unconscious intruder. The government decided against changing the law despite calls from the Conservative Party for more protection for householders. Instead, a publicity campaign was launched to address public confusion. An informal review found 11 prosecutions in 15 years, with five convictions, including high-profile cases like Tony Martin's. The police must investigate all incidents involving injury or death, but authorities aim to handle such cases swiftly and sympathetically.", "stablelm2:1.6b": "New guidelines issued by police and prosecutors protect householders from prosecution if they injure or kill intruders acting \"honestly and instinctively.\" The strongest evidence of lawful action comes from using something like a weapon, leaflet published by police and prosecutors aims to combat confusion about current legislation permitting reasonable force. The guideline follows a recent ministerial decision not to change the law despite calls for householders to be prosecuted unless they use \"grossly disproportionate\" force. Five people were prosecuted in 2013 after attacking intruders, including Norfolk farmer Tony Martin who was jailed for life and later reduced on appeal. Police and prosecutors must investigate all incidents involving a death or injury, they said.", "granite3.1-dense:2b": "Burglar defence guidelines for England and Wales state that homeowners can use reasonable force, including lethal means, against intruders without fear of prosecution if they act honestly and instinctively. The law allows the use of \"something to hand\" as a weapon. The more extreme the circumstances and fear felt, the greater the permissible force. Examples of excessive or gratuitous force include knocking out an intruder, causing further harm, setting traps without police involvement, and employing grossly disproportionate measures. Despite concerns from opposition parties and former police officials for a more lenient law, the government maintains current legislation provides adequate protection for householders' castles. An informal review found 11 prosecutions in 15 years, with five convictions. The CPS emphasizes investigating all death or injury incidents involving homeowners and attacking intruders promptly and sympathetically.", "reference": "And the law protects those who use \"something to hand\" as a weapon, said the leaflet published jointly by the Crown Prosecution Service (CPS) and Association of Chief Police Officers (ACPO).In cases involving householders attacking intruders prosecutors and police were \"determined\" they would be dealt with \"as swiftly and as sympathetically as possible\", it said.The Tories have called for a change in the law so householders are only prosecuted if they use \"grossly disproportionate\" force.Doing what you \"honestly and instinctively\" believed was necessary would be the strongest evidence of acting lawfully, the guidance said.The guidance published on Tuesday, said the police had a duty to investigate all incidents involving a death or injury.A CPS spokesperson said the figures were not definitive because prosecutions are not listed according to whether they were committed by a householder on an intruder.The leaflet, published by police and prosecutors, aims to combat confusion about current legislation, which lets people use \"reasonable force\".The law also protects those who use \"something to hand\" as a weapon.But knocking someone unconscious then killing them or hurting them further, or setting a trap for an intruder without involving the police were given as examples of \"excessive and gratuitous\" force."}