{"raw_text": "Woolf murder sentence rethink\n \n Plans to give murderers lighter sentences if they plead guilty have been watered down.\n \n There was an outcry three months ago when the Sentencing Guidelines Council - led by Lord Woolf - published its proposals for England and Wales. It had suggested judges should reduce sentences by a third for murderers who confessed at the earliest opportunity. But that has now been changed to one-sixth, with no reduction for those killers given a \"whole life tariff\". At the time Lord Woolf, the Lord Chief Justice, had said the one third reduction would only be in extraordinary circumstances - for example, if people gave themselves up before their crime had even been detected. The guidelines were to recognise the need to spare victims and witnesses the trauma of going to court where possible, by allowing lighter sentences for guilty pleas and co-operation, he said.\n \n But director of the Victims of Crime Trust, Norman Brennan, accused Lord Woolf of having an \"arrogant contempt for victims of crime and the law-abiding public\". The National Association of Probation Officers said the move would be \"political suicide\". In revised proposals from the Sentencing Guidelines Council (SGC), the section on murder said possible reductions would have to be \"weighed carefully\" by a judge so they did not lead to \"an inappropriately short sentence\". Where it was appropriate to reduce the minimum term having regard to a plea of guilty, the maximum reduction would be one sixth, and should never exceed five years, it said.\n \n In a statement issued on Wednesday Lord Woolf said: \"I have no doubt that being able to call on the diverse backgrounds and experiences of all those that serve on the SGC has vastly improved the final guidelines. \"I am confident, as a result, that judges will be better placed to deliver sentences which are effective both as punishments and deterrents to offending and reoffending.\" Director of Public Prosecutions, Ken Macdonald QC, who sits on the SGC, said the principle of discounting sentences to offenders for early guilty pleas is set down by parliament. \"What the new guideline on reduced sentences for guilty pleas does is increase the chances of convicting the guilty by bringing clarity to this process. \"It represents a tougher regime than existed previously, because the discount is automatically reduced if a guilty plea is not made at the first available opportunity,\" he said.\n", "llama3.2:1b": "Woolf murder sentence rethink plans have been watered down, with judges now allowed to reduce sentences one-sixth for murderers who plead guilty early on. This change was initially set at one-third, but Lord Woolf later changed it to reflect the need to spare victims and witnesses from going to court. The revised guidelines allow for \"weighed careful\" reductions in murder cases, with a maximum reduction of five years.", "llama3.2:3b": "Plans to give murderers lighter sentences for early guilty pleas have been modified from reducing sentences by one-third to one-sixth of the original term, with no reduction for those given a \"whole life tariff\". The revised proposal still aims to spare victims and witnesses the trauma of court proceedings but has faced criticism from some groups.", "gemma2:2b": "The Sentencing Guidelines Council revised its proposal for lighter sentences in murder cases. While the initial proposal suggested a third reduction for guilty pleas, it was changed to one-sixth reduction with no reduction for those receiving a \"whole life tariff\". The revised guidelines emphasize careful weighing of sentence reductions by judges and restrict maximum reductions to five years.  \n", "qwen2.5:0.5b": "Lord Woolf's plan for lighter sentences in murder cases has been watered down and revised: A third of the death penalty for murderers will be given up to judges. But there are those who accuse Lord Woolf of being arrogant about victims or law-abiding citizens, while others fear it could lead to political suicide.\n\nIn response, Norman Brennan, director of the Victims of Crime Trust, accused Lord Woolf of having an \"arrogant contempt for victims of crime and the law-abiding public.\" Director of Public Prosecutions Ken Macdonald QC defended the new guidelines, saying they increase the chance that offenders will be convicted by bringing clarity to sentencing.", "qwen2.5:1.5b": "Plans to give murderers lighter sentences have been watered down from one-third reduction to one-sixth for guilty pleas or cooperation without an early confession. The change has been criticized by victims' groups and law enforcement professionals, with Lord Woolf saying it should be \"weighed carefully\" to avoid unfairly shortening sentences.", "qwen2.5:3b": "Plans to give murderers lighter sentences if they plead guilty have been revised down from one-third to one-sixth. Initially proposed by Lord Woolf's Sentencing Guidelines Council, the new guidelines acknowledge the need to spare victims and witnesses trauma while still allowing for reduced sentences for early guilty pleas. The council emphasized that reductions should be \"weighed carefully\" by judges to avoid inappropriately short sentences. Lord Woolf defended the revised guidelines, stating they improve judge sentencing effectiveness as punishments and deterrents. Ken MacDonald QC of the Director of Public Prosecutions noted these new guidelines increase conviction chances by providing clarity on early guilty plea discounts, which are now reduced if not made promptly.", "opencoder:1.5b": "\"On reducing sentences for murderers who confess at an early opportunity, we have increased the chances of convicting them. This means that in certain situations, it might be necessary to wait until the crime has been detected before pleading guilty. But this is not a time-consuming process as much as it is a crucial one to prevent innocent people from being put on trial. The SGC guidelines are designed to be inclusive and allow a lighter sentence for any case that necessitates it, therefore giving those who need it more time to address their case.\"\n", "smollm:1.7b": "The summary should preserve key ideas and details:\n\n1. The text describes the plans to give murderers lighter sentences if they plead guilty.\n2. There was an outcry three months ago when the Sentencing Guidelines Council - led by Lord Woolf - published its proposals for England and Wales. It had suggested judges should reduce sentences by a third for murderers who confessed at the earliest opportunity.\n3. The text mentions that there was an outcry, but it does not provide details about what specifically was outraged or how many people were upset.\n4. The text describes the plans to give murderers lighter sentences if they plead guilty. It also mentions that there was an outcry three months ago when the Sentencing Guidelines Council - led by Lord Woolf - published its proposals for England and Wales.\n5. The text states that there was an \"arrogant contempt\" for victims of crime and the law-abiding public. It does not provide details about what specific actions or attitudes were being criticized.\n6. The text mentions that the revised proposals from the Sentencing Guidelines Council (SGC) would have to be \"weighed carefully\" by a judge so they did not lead to \"an inappropriately short sentence\". It also states that where it was appropriate to reduce the minimum term having regard to a plea of guilty, the maximum reduction would be one sixth.\n7. The text mentions that Lord Woolf is confident that being able to call on the diverse backgrounds and experiences of all those that serve on the SGC has vastly improved the final guidelines. It does not provide details about what specific actions or attitudes were being praised or criticized.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about the Woolf murder sentence proposals in England and Wales. Let me read through it carefully.\n\nFirst, the text talks about plans to reduce sentences for murderers if they confess. Previously, it was a third reduction, but now it's one-sixth with no reduction for those given a whole life tag. That makes sense because \"whole life tariff\" probably means they don't get longer sentences even if they repeat the crime.\n\nLord Woolf, the Chief Justice, had said that the three-third would be in extraordinary circumstances, like not being able to flee or something. Now, he's acknowledging the need for victims and witnesses to have help. The Guidelines Council supports this because it focuses on minimizing the impact on victims and witnesses by giving them lighter sentences.\n\nNorman Brennan from the Victims of Crime Trust said Lord Woolf seems contemptuous towards victims and law enforcement. He thinks the move is like political suicide. That's a strong point showing the criticism against the proposal.\n\nThe revised guidelines mention that reductions can be up to one-sixth, but it shouldn't lead toappropriately short sentences. So, the maximum reduction is five years. They have to weigh carefully when giving reductions and don't want harsh sentences for repeat offenders.\n\nKen Macdonald QC from Public Prosecutions said this change aligns with parliament's principles of reducing sentences for guilty pleas. He emphasized clarity and effectiveness in penalties and deterrence. The move was a toughening rather than a softening, which is different from past practices.\n\nPutting it all together, the summary needs to capture the changes in sentence guidelines, criticism from both sides, and how this reflects on the overall justice system.\n</think>\n\nThe revised proposals for England and Wales regarding murderers' sentences aim to reduce them by one-sixth of their minimum terms if they confess. This change eliminates a previous three-third reduction but does not apply to those given a \"whole life tariff,\" meaning they will not receive longer sentences even after repeating the crime. Lord Woolf, the Chief Justice, previously had dismissed this idea as part of extraordinary circumstances. The Guidelines Council acknowledges the need for victims and witnesses to have support during the trial. Norman Brennan from the Victims of Crime Trust criticized the proposal for being overly political, suggesting it could encourage repeat offenders without adequate consequences. The revised rules allow reductions up to one-sixth but should not result in inappropriate short sentences. Ken Macdonald QC, chair of the Public Prosecutions, noted that this move reflects a tougher regime than before, as reductions are automatically reduced if guilty pleas are delayed.", "tinyllama:1.1b": "The Sentencing GuideLines Council has been revised with new guidelines that reduce sentences for murderers who plead guilty. The previous proposals suggested a reduction of three-quarters or one-third for such defendants. However, this has now been reduced to one-sixth, allowing for fewer severe punishments and greater flexibility in sentencing practices. While the proposal was welcomed by victim advocates and prosecutors alike, it has been criticized by some legal experts as a compromise of justice and an oversimplification of a complex crime. Lord Woolf acknowledged that the new proposals are better suited to addressing sentencing practices and ensuring fairness for those who plead guilty. The director of Public Prosecutions, Ken Macdonald QC, also emphasized the importance of clarifying these processes in order to maximize conviction rates.", "tinydolphin:1.1b": " Summary: The Sentencing Guidelines Council (SGC) has revised its proposed murder guidelines to reduce the minimum term for guilty pleas and increase the sentencing range for those who commit murder without a \"whole life tariff\". Prior to these revisions, judges could consider granting less severe sentences in some cases. In the revised proposals, they would have to weigh carefully and be \"weighted carefully\" before making a decision on the sentencing range. The maximum reduction for guilty pleas would be one-sixth of the minimum term and should never exceed five years.", "phi:2.7b": " The revised Sentencing Guidelines Council proposals suggest judges can give lighter sentences for murder when the killer pleads guilty and it does not involve a whole life tariff. However, there will be no reduction of one-third as initially suggested by Lord Woolf three months ago. This decision was met with criticism from various groups, including victims' trust and probation officers who believed that the guidelines would lead to shorter sentences for guilty pleas and cooperation. In response, the SGC introduced a new section in their revised proposals where any possible reduction in sentence must be carefully considered by the judge to avoid an inappropriately short sentence. The maximum reduction is now one-sixth and should not exceed five years, which was suggested as a way to balance reducing the chance of convicting the guilty while ensuring that justice is still served for victims and law-abiding citizens. Lord Woolf commented that he has no doubt that having diverse perspectives has helped improve the final guidelines, leading him to be confident that judges will have more effective sentences in place as punishments and deterrents to offending and reoffending.\n", "orca-mini:3b": " The proposal to give murderers lighter sentences if they plead guilty has been changed to one-sixth reduction, with no reduction for those killers given a \"whole life tariff\". This move has been criticized by victims' rights groups and probation officers. The revised guidelines state that the maximum reduction should never exceed five years, and judges will be required to weigh carefully any reductions for those who plead guilty. The director of public prosecutions praised the revised guidelines, saying they allow judges to deliver more effective sentences.", "hermes3:3b": "Revised Woolf murder sentencing guidelines reduce one-third reduction for guilty pleas, now suggesting a one-sixth reduction (max 5yrs) with careful weighing by judges to avoid \"inappropriately short sentences\".", "stablelm-zephyr:3b": "The Sentencing Guidelines Council, led by Lord Woolf, has revised plans to provide murderers with lighter sentences if they confess guiltily. Originally, judges would reduce sentences by one third for those who pleaded guilty early; however, this has been decreased to a sixth reduction and may not exceed five years. Critics argue that the move will result in \"political suicide,\" while proponents maintain that it will improve the likelihood of convicting murderers by providing clarity in the sentencing process.", "chatgpt-4o-latest": "Plans to reduce murder sentences for early guilty pleas have been scaled back following public outcry. Initially, the Sentencing Guidelines Council, led by Lord Woolf, proposed a one-third reduction, but this has been revised to one-sixth, with no reduction for whole-life sentences. Critics, including the Victims of Crime Trust, condemned the original proposal as too lenient. The revised guidelines emphasize careful judicial consideration to prevent excessively short sentences, capping reductions at five years. Lord Woolf defended the changes, stating they improve sentencing effectiveness. Director of Public Prosecutions Ken Macdonald QC noted that the new guidelines clarify the process and create a stricter regime by reducing discounts for delayed guilty pleas.", "stablelm2:1.6b": "Lord Woolf's proposal to reduce murder sentences by a third for early confessors was watered down; there is no longer a third reduction for those given \"whole life tariffs.\" The Sentencing Guidelines Council revised proposals now require careful consideration of possible reductions by judges, with the maximum one-sixth reduction being limited to 1-5 years. Victims and witnesses would be spared court trauma through lighter sentences for guilty pleas and cooperation. Lord Woolf acknowledges improvement in guidelines from diverse SGC members but emphasizes effective sentencing as a deterrent.", "granite3.1-dense:2b": "Plans for lighter murder sentences for early confessions were revised by the Sentencing Guidelines Council, led by Lord Woolf. Initially proposed as a third reduction, it has now been limited to one-sixth, with no reduction for those receiving \"whole life tariffs\". The change was met with criticism from victims' groups and some council members, who argued it could lead to inappropriately short sentences. Lord Woolf defended the new guidelines, asserting they provide better clarity for judges to deliver effective and deterrent sentences. The Director of Public Prosecutions emphasized that this practice aligns with parliamentary intentions, as guilty pleas must be made at the first available opportunity for sentence reductions to apply.", "reference": "In revised proposals from the Sentencing Guidelines Council (SGC), the section on murder said possible reductions would have to be \"weighed carefully\" by a judge so they did not lead to \"an inappropriately short sentence\".The guidelines were to recognise the need to spare victims and witnesses the trauma of going to court where possible, by allowing lighter sentences for guilty pleas and co-operation, he said.Director of Public Prosecutions, Ken Macdonald QC, who sits on the SGC, said the principle of discounting sentences to offenders for early guilty pleas is set down by parliament.Where it was appropriate to reduce the minimum term having regard to a plea of guilty, the maximum reduction would be one sixth, and should never exceed five years, it said.At the time Lord Woolf, the Lord Chief Justice, had said the one third reduction would only be in extraordinary circumstances - for example, if people gave themselves up before their crime had even been detected.\"What the new guideline on reduced sentences for guilty pleas does is increase the chances of convicting the guilty by bringing clarity to this process."}