{"raw_text": "'Few ready' for information act\n \n Thousands of public bodies are ill-prepared for the Freedom of Information Act, due to come into force next month, because of government failures, say MPs.\n \n From next month anyone will have the power to demand information from a range of public bodies - from Whitehall departments to doctors' surgeries. But an all-party committee said it was \"not confident\" many would be ready. It blamed the Department for Constitutional Affairs for a \"lack of consistent leadership\".\n \n The Act comes into effect in England, Wales and Northern Ireland, on 1 January while similar measures are being brought in at the same time in Scotland. It provides the public with a right of access to information held by about 100,000 public bodies, subject to various exemptions.\n \n But the government department responsible for implementing the change suffered from an \"unusually high turnover\" of staff within the department, which had \"seriously interfered\" with its work, said the Constitutional Affairs Select Committee. It said, despite four years of preparations, some local authorities and parts of the health sector were still not ready. The DCA had \"failed\" to provide early guidance on technical matters and shown a \"lack of consistent leadership\", the MPs found. Committee chairman Alan Beith said: \"The DCA has had four years to prepare for freedom of information, but with less than a month to go it appears that some bodies may not be well enough prepared. \"Our report shows that in the past support and guidance from the DCA, which has overall responsibility for guiding the public sector through the process of implementation for the freedom of information regime, has been lacking.\" A spokesman for the DCA said: \"The DCA has provided - and will continue to provide - strong, clear leadership. \"It has delivered a simple, liberal fees regime, guidance on the Act which has been widely praised, and expert networks of staff working on freedom of information implementation.\"\n", "llama3.2:1b": "Thousands of public bodies in England, Wales, Northern Ireland, and Scotland are unprepared for the Freedom of Information Act due to government failures. An all-party committee found that the Department for Constitutional Affairs failed to provide consistent leadership and guidance, despite four years' preparations. The Act will come into effect on January 1, giving citizens a right of access to information held by public bodies, subject to exemptions.", "llama3.2:3b": "Thousands of public bodies in England, Wales, and Northern Ireland are not prepared for the Freedom of Information Act, set to come into effect January 1, due to government failures. The Department for Constitutional Affairs' lack of consistent leadership and high staff turnover have hindered preparations, with some local authorities and parts of the health sector still unready despite four years of preparation.", "gemma2:2b": "Public bodies in England, Wales, and Northern Ireland are unprepared for the upcoming Freedom of Information Act due to governmental failures.  The Department for Constitutional Affairs (DCA) is blamed for a lack of consistent leadership and an unusually high turnover of staff, resulting in limited guidance and support for local authorities and healthcare sectors. Despite four years of preparation, some bodies remain unready for implementation. \n", "qwen2.5:0.5b": "**Summary:** MPs warn that many public bodies won't have access to information under the Freedom of Information Act as scheduled for next month. An all-party committee finds the DCA's leadership is insufficient, despite a four-year preparation period.\n\nDoes this summary accurately convey the key points of the given text? Yes, it does.\nWould you like me to expand on or summarize the text for a more detailed explanation?", "qwen2.5:1.5b": "A Freedom of Information Act that should have been implemented in England, Wales, Northern Ireland, and Scotland next month is not ready due to a lack of consistent leadership by the Department for Constitutional Affairs (DCA) and four years of inadequate preparation.", "qwen2.5:3b": "Thousands of public bodies are unprepared for the Freedom of Information Act coming into force next month due to government failures, say MPs from an all-party committee. The Act grants citizens access to information held by about 100,000 public bodies, subject to exemptions. While similar measures have been introduced in Scotland, England, Wales, and Northern Ireland will adopt it on January 1st. However, the Department for Constitutional Affairs' high staff turnover and lack of consistent leadership hindered preparations, resulting in some local authorities and health sectors still being unprepared despite four years of preparation. MPs criticized DCA's failure to provide early guidance on technical matters and its inconsistent leadership. The DCA denied these accusations, stating they have provided strong leadership and praised guidance on the Act.", "opencoder:1.5b": "Few ready for information act\n\nThousands of public bodies are ill-prepared for the Freedom of Information Act due to come into force next month. Government failures blame departments like Department for Constitutional Affairs, leading a lack of consistent leadership. An all-party committee said it was \"not confident\" many would be ready. The department responsible for implementing the change suffered from an unusually high turnover within the department, which had \"seriously interfered\" with its work. However, despite four years of preparations, some local authorities and parts of the health sector were still not ready. Despite preparedness, it was found that in the past support and guidance from the DCA has been lacking.\n", "smollm:1.7b": "Fewer than 100,000 public bodies are ready for the Freedom of Information Act because of government failures. The Department for Constitutional Affairs (DCA) is responsible for implementing the change in England, Wales and Northern Ireland, but it suffered from an unusually high turnover of staff within the department, which interfered with its work. The DCA had failed to provide early guidance on technical matters and showed a lack of consistent leadership, the MPs found.\nThe committee said that some local authorities and parts of the health sector were still not ready for the change because they lacked sufficient resources or expertise. The DCA had failed to provide adequate support and guidance from the outset, which contributed to the difficulties in implementing the Freedom of Information Act.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text concisely while preserving key ideas and details. Let me read through it carefully.\n\nThe main points are about the Freedom of Information Act not being ready due to government failures. MPs point out that thousands of bodies are underprepared because of failed efforts. The act comes into effect in England, Wales, Northern Ireland, Scotland at the same time as implementation starts. It gives 100k bodies access to information with exemptions.\n\nThe DCA, responsible for the act, had high turnover and failed leadership. Local authorities and health sectors still weren't ready. MPs called it not confident, blaming DCA for lack of consistent leadership, especially in technical matters and missing guidance.\n\nBeith says DCA has four years to prepare but only a month left—some bodies aren't well-prepared. The DCA provides clear guidance with fees and expert networks. The DCA hasn't had the support it needed before.\n</think>\n\nFew ready for information act  \nThousands of public bodies are underprepared due to government failures, according to MPs. The Freedom of Information Act comes into effect in England, Wales, Northern Ireland, and Scotland on January 1st, similar measures starting at the same time in Scotland. The act grants access to information held by about 100,000 bodies, with exemptions. However, the Department for Constitutional Affairs (DCA) had high staff turnover and failed leadership, lacking guidance on technical matters and lack of consistent leadership. MPs found it not confident many were ready. The DCA provided clear guidance but hasn't had the needed support before.", "tinyllama:1.1b": "Leaders in the UK government's Department for Constitutional Affairs (DCA) have failed to provide consistent leadership for preparing public bodies for the new Freedom of Information Act, which is set to come into effect in January. The DCA suffered from an unusually high turnover of staff within the department within four years of implementation, causing significant delays and interfering with its work, according to a report by an all-party parliamentary group (MPs). Despite four years of preparations, some local authorities and parts of the health sector were still not ready for the freedom of information (FOI) regime. The MPs suggested that the DCA has failed in providing early guidance on technical matters and lacked consistent leadership. The report highlighted issues such as a lack of support and guidance from the DCAFront for preparing public bodies for the FOI regime, which will allow the public to demand information from more than 100,000 public bodies. The government department has suffered from a \"lack of consistent leadership\" in its implementation, according to the report, which found that some local authorities and parts of the health sector were still not ready for the FOI regime. However, a DCAFront spokesperson said that the DCA had provided a simple, liberal fee structure, guidance on the Act which has been widely praised, and expert networks of staff working on freedom of information implementation.", "tinydolphin:1.1b": " The Freedom of Information Act, due to come into force next month, is expected to provide citizens with new access rights to public information. However, many organizations are not ready for this change, according to a recent all-party committee report. Some local authorities and healthcare providers are still not prepared, while others have encountered technical issues that delayed their readiness. The report points out that the Department for Constitutional Affairs (DCA), which is in charge of implementing the Act, has had less than a month to prepare. Committee chairman Alan Beith said he believes the DCA has been \"failing\" in its preparations, and that early guidance on technical matters was not provided or shown adequate consistency. The report also highlights that some public bodies may be ill-prepared for the new regime, which applies to England, Wales, and Northern Ireland.", "phi:2.7b": " Thousands of public bodies in England, Wales, and Northern Ireland are not prepared for the Freedom of Information Act, due to government failures. The Act gives citizens the right to access information held by over 100,000 public bodies. However, a committee found that the Department for Constitutional Affairs (DCA) had an unusually high turnover of staff, which interfered with its work. Despite four years of preparations, some local authorities and parts of the health sector were still not ready. The DCA was criticized for lack of consistent leadership. However, it has provided support and guidance to public bodies, including a simple fees regime and expert networks.\n", "orca-mini:3b": " The Freedom of Information Act comes into force in England, Wales and Northern Ireland next month, but some public bodies are not prepared for the change. The Department for Constitutional Affairs has faced problems with staffing turnover, causing delays in implementation. Some local authorities and parts of the health sector still need to prepare. The DCA has provided guidance and support, but some bodies may not be well enough prepared.", "hermes3:3b": "FOI Act prep lacking; gov dept (DCA) blamed for high staff turnover interfering with implementation, inconsistent leadership leading MPs to doubt many public bodies' readiness by next month.", "stablelm-zephyr:3b": "Thousands of public bodies in the UK are unprepared for the Freedom of Information Act, set to launch next month, due to government failures. The Act grants the public a right to access information held by approximately 100,000 public bodies, but the Department for Constitutional Affairs (DCA) has been criticized for lacking consistent leadership and providing insufficient guidance during its four-year preparation period. Despite this, the DCA claims it has provided strong, clear leadership and praised guidance on the Act. Some local authorities and parts of the health sector remain unready for the upcoming launch.", "chatgpt-4o-latest": "Thousands of public bodies are unprepared for the Freedom of Information Act, set to take effect next month, due to government failures, according to MPs. The Act grants the public access to information from around 100,000 public bodies, but an all-party committee expressed doubts about their readiness, blaming the Department for Constitutional Affairs (DCA) for inconsistent leadership. High staff turnover in the DCA hindered preparations, and despite four years of planning, some local authorities and health sector bodies remain unready. The committee criticized the DCA for failing to provide early technical guidance. Committee chairman Alan Beith highlighted the lack of sufficient support, while a DCA spokesman defended the department’s efforts, citing clear leadership, a liberal fees regime, and expert networks.", "stablelm2:1.6b": "MPs claim thousands of public bodies are not prepared for the Freedom of Information Act due to government failures, with the Department for Constitutional Affairs blamed for a lack of consistent leadership. The Act, set to become effective in England, Wales, and Northern Ireland on January 1st, grants access to information held by public bodies subject to exemptions. Some local authorities and parts of the health sector are still not ready despite four years of preparation.", "granite3.1-dense:2b": "An all-party committee expressing concern over the Department for Constitutional Affairs' (DCA) readiness to implement the Freedom of Information Act in England, Wales, Northern Ireland, and Scotland, noted significant issues. Despite four years of preparation, some public bodies, including local authorities and parts of the health sector, remain unprepared due to an \"unusually high turnover\" within the DCA and a lack of consistent leadership. The committee criticized the DCA for insufficient early guidance on technical matters. In response, the DCA asserts that it has offered clear leadership, delivered praised guidance, and maintained expert networks for implementation.", "reference": "Committee chairman Alan Beith said: \"The DCA has had four years to prepare for freedom of information, but with less than a month to go it appears that some bodies may not be well enough prepared.\"Our report shows that in the past support and guidance from the DCA, which has overall responsibility for guiding the public sector through the process of implementation for the freedom of information regime, has been lacking.\"Thousands of public bodies are ill-prepared for the Freedom of Information Act, due to come into force next month, because of government failures, say MPs.A spokesman for the DCA said: \"The DCA has provided - and will continue to provide - strong, clear leadership.\"It has delivered a simple, liberal fees regime, guidance on the Act which has been widely praised, and expert networks of staff working on freedom of information implementation.\"From next month anyone will have the power to demand information from a range of public bodies - from Whitehall departments to doctors' surgeries."}