{"raw_text": "Regiments' group in poll move\n \n A regiments' campaign group is to target nine marginal Labour seats at the General Election.\n \n Save the Scottish Regiments will also field a candidate against Armed Forces Minister Adam Ingram in East Kilbride. The group, which is unhappy at defence merger plans, is endorsing opposition candidates in nine seats. The marginals are Aberdeen South, Dumfriesshire, Dundee East and West, South West Edinburgh, Ochil, Stirling, East Renfrewshire and Western Isles. The campaigners unveiled a huge poster featuring Black Watch soldiers fighting the war in Iraq before they announced their election plans.\n \n Former Scots Guardsman Allan Hendry will challenge Mr Ingram. The group said it is well organised, with 350 volunteers, and will be announcing at least one other candidate later. It added that it can only be stopped from inflicting serious damage on Labour if the government reverses its plan to merge the six Scottish regiments.\n \n Scotland's only Conservative MP Peter Duncan said the Save the Scottish Regiments had done a \"superb job\" in fighting against defence cuts. He added: \"Their actions have reflected the pride that most people in this country have in our troops, and have shown a steely determination to make Labour pay for their betrayal. \"I have been honoured to speak at their rallies throughout Scotland.\" Scottish National Party leader Alex Salmond said it had received a \"big boost\" from the campaign's decision to endorse SNP candidates in four marginal seats.\n \n \"Labour's arrogance has been their undoing. In trying to get rid of Scotland's historic regiments, Labour MPs will end up being scrapped themselves,\" he said. However, Labour MP George Foulkes said the campaigners would not make any difference to the outcome of the election and would not win the argument. \"A serving soldier knows that what Labour is proposing is right,\" he said. As well as their election move, Save the Scottish Regiments will join other campaigners at a rally in London in the spring. Defence Secretary Geoff Hoon announced last year that Scotland's regiments would be combined into a single unit. The move was part of overall Army reforms.\n", "llama3.2:1b": "Here is a concise summary of the text:\n\nSave the Scottish Regiments campaign group has endorsed opposition candidates in nine Labour marginal seats, including Aberdeen South and Ochil. The group aims to stop the defence merger plans by highlighting the government's treatment of Scotland's regiments. Former Scots Guardsman Allan Hendry will challenge Adam Ingram, while Peter Duncan praises their efforts as a \"superb job\".", "llama3.2:3b": "A group called Save the Scottish Regiments is targeting 9 marginal Labour seats and fielding candidates against Labour MPs, including Armed Forces Minister Adam Ingram, over defence merger plans. The campaign has unveiled posters featuring Black Watch soldiers fighting in Iraq and claims to be well-organised with 350 volunteers.", "gemma2:2b": "Save the Scottish Regiments will target nine Labour marginal seats, endorse opposition candidates, and field a candidate against Armed Forces Minister Adam Ingram. The group opposes defense merger plans and believes their efforts could hinder Labour's electoral success.  Their campaign includes endorsements from political figures, including Peter Duncan (Conservative MP) and Alex Salmond (SNP leader).  Labour MPs argue that the campaign will have minimal impact on election outcomes. \n", "qwen2.5:0.5b": "Regiments' campaign group is targeting nine Labour marginal seats and will field a candidate against Adam Ingram, endorsed by opposition candidates. They unveiled a poster featuring Black Watch soldiers fighting the war in Iraq before announcing their election plans.\n\nThe Scottish National Party leader Alex Salmond praised Save the Scottish Regiments for fighting against defence cuts. The group's actions reflect pride in Scotland's regiments and show determination to make Labour pay for its betrayal, with SNP MPs Peter Duncan and George Foulkes calling it a victory.", "qwen2.5:1.5b": "Regimental groups field candidates against Labour MPs for marginal seats, including Save the Scottish Regiments' candidate Allan Hendry vs Adam Ingram in East Kilbride. The campaign is aimed at reversing defence merger plans and defending historic regiments.", "qwen2.5:3b": "A regiments' campaign group aims to target nine marginal Labour seats and challenge Armed Forces Minister Adam Ingram in East Kilbrine over defence merger plans. Save the Scottish Regiments, featuring 350 volunteers, will endorse opposition candidates in Aberdeen South, Dumfriesshire, Dundee East and West, South West Edinburgh, Ochil, Stirling, East Renfrewshire, and Western Isles. The group is led by former Scots Guardsman Allan Hendry who will contest Adam Ingram. If Labour does not reverse the plan to merge six Scottish regiments, the campaign could inflict serious damage on Labour. The Save the Scottish Regiments received a boost from endorsing SNP candidates in four marginal seats and have announced at least one more candidate. While some politicians praised their efforts, others dismissed them as inconsequential. The group also plans to participate in rallies with other campaigners in London this spring.", "opencoder:1.5b": "The Regiments' Campaign Group is to target nine marginal Labour seats at the General Election. The group, which is unhappy with the progress made on defence merger plans, has supported opposition candidates in nine seats. The campaigners unveiled a huge poster featuring Black Watch soldiers fighting the war in Iraq before they announced their election plans. The former Scots Guardsman Allan Hendry challenges Mr Ingram and the group is well-organized and can only be stopped from inflicting serious damage if the government reverses its plan to merge six regiments. Scotland's National Party leader Alex Salmond received a \"big boost\" from the campaign's decision to endorse SNP candidates in four marginal seats, as Labour MPs will end up being scrapped themselves, but he also said the campaigners would not make any difference to the outcome of the election and would not win the argument. The Save the Scottish Regiments has also joined other campaigners at a rally in London for further support.\n", "smollm:1.7b": "The summary above is concise and to the point, preserving key ideas and details from the original text while omitting unnecessary information. It aims to provide a brief overview of the main points made in the text without adding any new information or explanations.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about a campaign group targeting certain seats in the Scottish general election. Let me read through it carefully.\n\nThe text mentions a campaign group focused on nine marginal Labour seats: Aberdeen South, Dumfriesshire, Dundee East and West, South West Edinburgh, Ochil, Stirling, East Renfiance, Western Isles. They're unhappy with defence merger plans but are endorsing opposition candidates in these areas.\n\nThen there's a mention of Allan Hendry challenging Mr. Ingram, who is the Armed Forces Minister. The group is well-organized with 350 volunteers and will announce another candidate later. It also says stopping the campaign would require reversing Scotland's plan to merge six regiments into one.\n\nThere are quotes from Peter Duncan and Alex Salmond praising the effort of Save the Scottish Regiments in fighting against defence cuts, reflecting pride among most people in Scotland in their troops. The group has received support for SNP candidates in four marginal seats too.\n\nA previous Labour MP, George Foulkes, said that while the campaign is a big boost for them, it won't change the election outcome and wouldn't win the argument. Another MP, Geoff Hoon, mentioned that serving soldiers know what Labour plans are right.\n\nThe group will rally at a London spring event after their election move. Defence Secretary Geoff Hoon revealed that Scotland's regiments were merged into one unit as part of army reforms last year.\n\nI need to condense this into a concise summary without any explanations or formatting, just plain text.\n</think>\n\nA campaign group targeting nine marginal Labour seats in the Scottish general election is unhappy with defence merger plans but ends up endorsing opposition candidates. They will announce another candidate later and are considering stopping efforts if Scotland's regiments merge, reflecting pride in their troops' service. Peter Duncan praised their efforts for fighting defence cuts, while Save the Scottish Regiments will rally at a London event after their election move.", "tinyllama:1.1b": "A group of soldiers who oppose the government's plan to merge six Scottish regimental units has made plans to target nine marginal Labour seats in the General Election. The Save the Scottish Regiment campaigners announced their election plans, endorsing opposition candidates in nine seats. These include the marginal Aberdeen South, Dumfriesshire, Dundee East and West, South West Edinburgh, Ochil, Stirling, East Renfrewshire, and Western Isles. The campaigners also announced they will be announcing at least one other candidate later this week, who is yet to be named. Save the Scottish Regiment has received a \"big boost\" from its decision to endorse SNP candidates in four marginal seats, but Labour MP George Foulkes said this would not make a difference to the outcome of the election and that their campaigners will not win the argument. The group's Edinburgh-based headquarters have unveiled a poster featuring Black Watch soldiers fighting the war in Iraq before announcing they will be running at least one candidate later on.", "tinydolphin:1.1b": " The text you provided describes a political movement aimed at ending the government's plan to merge six Scottish regiments. The group, Save the Scottish Regiments, is well organized and has 350 volunteers. It has gained significant attention for its efforts to expose the government's policies and stand up for the importance of Scotland's troops.", "phi:2.7b": " A group called Save the Scottish Regiments is running for nine seats in an election and also endorsing opposition candidates against Armed Forces Minister Adam Ingram. They are unhappy about defence merger plans and plan to use their resources to influence the outcome of the election. They have announced that they will be holding rallies to increase public awareness of their cause.\n", "orca-mini:3b": " The text reports on a campaign group called Save the Scottish Regiments, which is targeting nine marginal Labour seats at the General Election. The group is unhappy with defence merger plans and is backing opposition candidates in nine seats. The campaigners unveiled a huge poster featuring Black Watch soldiers fighting the war in Iraq before launching their election plans. The group has well-organized volunteers and can only be stopped from inflicting serious damage on Labour if the government reverses its plan to merge the six Scottish regiments. Scotland's only Conservative MP Peter Duncan praised the campaign's decision to endorse SNP candidates in four marginal seats, while Labour MP George Foulkes said the campaigners would not make any difference to the outcome of the election and would not win the argument.", "hermes3:3b": "Save Scottish Regiments group to target 9 marginal Labour seats at Gen Election, backing opposition candidates in those areas and announcing a candidate against Armed Forces Minister Adam Ingram.", "stablelm-zephyr:3b": "The group Save the Scottish Regiments plans to target nine marginal Labour seats at the General Election, including nine seats where they are endorsing opposition candidates. They are unhappy with defence merger plans and will challenge Armed Forces Minister Adam Ingram in East Kilbride. The group has 350 volunteers and aims to reverse the government's plan to merge six Scottish regiments. Former Scots Guardsman Allan Hendry will join the campaign, alongside their endorsement of SNP candidates in four marginal seats. Labour MP George Foulkes believes that the campaigners will not make a difference in the election outcome but Save the Scottish Regiments disagrees, arguing that it is vital to halt the plan or risk inflicting serious damage on the Labour party.", "chatgpt-4o-latest": "A campaign group, Save the Scottish Regiments, is targeting nine marginal Labour seats in the General Election to oppose defence merger plans. They will also field a candidate against Armed Forces Minister Adam Ingram. The group, with 350 volunteers, is endorsing opposition candidates and plans to announce more candidates. Conservative MP Peter Duncan praised their efforts, while SNP leader Alex Salmond welcomed their support for SNP candidates. Labour MP George Foulkes dismissed their impact. The campaigners will also join a rally in London. The merger plan, announced by Defence Secretary Geoff Hoon, aims to consolidate Scotland’s regiments into a single unit as part of broader Army reforms.", "stablelm2:1.6b": "A regiment's campaign group aims to target nine marginal Labour seats during the General Election. Save the Scottish Regiments will endorse opposition candidates in these nine seats, including Aberdeen South, Dumfriesshire, Dundee East and West, South West Edinburgh, Ochil, Stirling, East Renfrewshire, and Western Isles. The group, unhappy with defense merger plans, also endorsed SNP candidates in four other seats. Former Scots Guardsman Allan Hendry will challenge Armed Forces Minister Adam Ingram in the East Kilbride election. The Save the Scottish Regiments said it has volunteers and will announce at least one more candidate later; if the government reverses its plan to merge six Scottish regiments, the group can inflict serious damage on Labour.", "granite3.1-dense:2b": "Save the Scottish Regiments, an advocacy group for preserving six Scottish regiments due to defence merger plans, is running candidates in nine marginal Labour seats at the General Election: Aberdeen South, Dumfriesshire, Dundee East and West, South West Edinburgh, Ochil, Stirling, East Renfrewshire, and Western Isles. The group's leader, former Scots Guardsman Allan Hendry, will challenge Armed Forces Minister Adam Ingram in East Kilbride. With 350 volunteers, Save the Scottish Regiments aims to disrupt Labour's plans by endorsing opposition candidates and rallying support for their cause. They have received backing from the SNP, with party leader Alex Salmond praising their efforts as a \"big boost.\" Conversely, Labour MP George Foulkes dismisses their impact on the election outcome. The group plans to collaborate with other campaigners at an upcoming London rally and is expected to announce more candidates soon. Defence Secretary Geoff Hoon announced last year that Scotland's regiments would be merged into a single unit as part of broader Army reforms.", "reference": "As well as their election move, Save the Scottish Regiments will join other campaigners at a rally in London in the spring.Scotland's only Conservative MP Peter Duncan said the Save the Scottish Regiments had done a \"superb job\" in fighting against defence cuts.Save the Scottish Regiments will also field a candidate against Armed Forces Minister Adam Ingram in East Kilbride.A regiments' campaign group is to target nine marginal Labour seats at the General Election.In trying to get rid of Scotland's historic regiments, Labour MPs will end up being scrapped themselves,\" he said.However, Labour MP George Foulkes said the campaigners would not make any difference to the outcome of the election and would not win the argument.It added that it can only be stopped from inflicting serious damage on Labour if the government reverses its plan to merge the six Scottish regiments.\"A serving soldier knows that what Labour is proposing is right,\" he said."}