{"raw_text": "Row over 'police' power for CSOs\n \n The Police Federation has said it strongly opposes giving Community Support Officers (CSOs) the power to detain suspects for up to 30 minutes.\n \n The powers - piloted in six areas - were extended to all police forces in England and Wales on Thursday. The federation said CSOs do not have the experience, training and safety equipment to deal with \"potentially confrontational\" situations. But the government said the move would help police \"build safe communities\". Police Federation chairman Jan Berry said civilian officers should act as \"eyes and ears\" for the police.\n \n \"They should not be placed in potentially confrontational situations - which detaining someone clearly is,\" she said. CSOs can now use reasonable force to detain suspects for up to 30 minutes while they wait for police officers to arrive. The powers will be granted by chief constables of local forces. Ms Berry said this \"dramatically changes\" their original purpose - to be a visible presence combating low-level crime and anti-social behaviour. She said more powers would mean more paperwork and less time on the street.\n \n But Home Office minister Hazel Blears defended the move saying it would give the civilian officers \"just that little bit of edge\". She denied their role was changing and said the new powers would not take them away from the streets.\n \n \"The powers that we are bringing in are things that they need to do when they are out patrolling,\" she said. The Home Office has produced its own report on CSOs which it describes as \"encouraging\". Ms Blears said the study shows CSOs are \"making a real difference\" in the fight against crime. But the report also showed that the public is having difficulties distinguishing between a civilian officer and a proper officer.\n \n Shadow home secretary David Davis said the research appeared to acknowledge that CSOs were having no discernible effect on crime figures.\n \n \"While the answer is a lot more real police, the government wants to recruit 25,000 people who can't arrest anyone,\" he said. BBC home affairs correspondent Danny Shaw said the research is inconclusive. There are about 3,500 CSOs in England and Wales but the government intends to have 25,000 on the streets by 2008 at a cost of £50m. They already have powers to hand out fines for a wide range of offences. The Serious Organised Crime and Police Bill proposes extra powers to search suspects, enforce licensing offences, direct traffic and deter begging.\n", "llama3.2:1b": "Police Federation opposes giving CSOs power to detain suspects for up to 30 minutes.\n\nCSOs were given extended powers in six areas but will now be handed more authority by local chief constables.\n\nThe government has agreed to grant CSOs the ability to use reasonable force to detain suspects while waiting for police arrival, with the aim of \"building safe communities\".\n\nHome Office minister Hazel Blears defends the move, stating that civilian officers need additional powers when on patrol.\n\nA BBC report shows mixed results, with some indicating a lack of effect from CSOs.", "llama3.2:3b": "Police Federation opposes giving Community Support Officers power to detain suspects for 30 minutes. Government defends move as helping build safe communities, while research suggests CSOs may have no effect on crime figures.", "gemma2:2b": "The Police Federation opposes giving Community Support Officers (CSOs) the power to detain suspects for 30 minutes.  The government says this will aid police in building safe communities. The move grants CSOs more authority but their role is not changing, according to the Home Office. There's debate on whether the new powers have an impact on crime rates and public perception of these officers. The government plans to increase the number of CSOs to 25,000 by 2008 at a cost of £50 million.  \n", "qwen2.5:0.5b": "The police power has been extended to Community Support Officers (CSOs) in England and Wales. CSOs do not have the experience, training or safety equipment to deal with \"potentially confrontational\" situations. However, the government says this will help build safe communities. Police Federation chairman Jan Berry said civilian officers should act as \"eyes and ears\". The powers will be granted by chief constables of local police forces. While it changes their purpose, more powers would mean more paperwork and less time on the streets. Home Office minister Hazel Blears defended the move saying it gave the civilians \"just that little bit of edge\". While they are making a real difference in fighting crime, the government wants to recruit 25,000 people who can't arrest anyone.", "qwen2.5:1.5b": "The Home Office is expanding Community Support Officers (CSOs) in England and Wales to grant them the power to detain suspects for up to 30 minutes while waiting for police officers to arrive. This move has sparked controversy as some argue CSOs lack the necessary training, equipment, and experience needed for \"potentially confrontational\" situations. However, Home Office minister Hazel Blears defends the change, stating it will give civilian officers a \"little bit of edge.\" The expansion is part of a broader effort to increase numbers of civil service police but has also raised concerns about whether these officers are having an effect on crime statistics.", "qwen2.5:3b": "The Police Federation opposes extending detention powers to Community Support Officers (CSOs), citing their lack of experience, training, and safety equipment for potentially confrontational situations. However, the government argues that this will help police build safe communities. CSOs can now detain suspects for up to 30 minutes while waiting for regular officers. This change is seen as a dramatic shift from original purposes, including increased paperwork and reduced street time. The Home Office defends the move, stating it would give civilian officers more authority to combat crime. Critics like Shadow Home Secretary David Davis argue that this doesn't effectively reduce crime figures and warn of potential misuse due to unclear distinction between CSOs and regular police.", "opencoder:1.5b": "Row over 'police' power for CSOs\n\nThe Police Federation has strongly opposed giving Community Support Officers (CSOs) the power to detain suspects for up to 30 minutes.\n\nThe federation said that the powers were extended to all police forces in England and Wales on Thursday. The move would help \"build safe communities\". The chairman of the Federation Jan Berry stated, \"civilian officers should act as 'eyes and ears' for the police.\"\n\nThey should not be placed in potentially confrontational situations - which detaining someone clearly is,\" she said. CSOs can now use reasonable force to detain suspects for up to 30 minutes while they wait for police officers to arrive.\n\nThe powers will be granted by chief constables of local forces. The government changed their purpose to be a visible presence combating low-level crime and anti-social behaviour. This \"dramatically changes\" their original purpose - to be a visible presence combating crime and anti-social behaviour.\n\nMore powers would mean more paperwork and less time on the street, which the Home Office minister Hazel Blears defended. She denied they were changing their role and said the new powers would not take them away from the streets.\n\nThe report by the Home Office shows that CSOs are making a real difference in the fight against crime. The public is having difficulties distinguishing between a civilian officer and a proper officer, which he said, \"making a real difference\" in the fight against crime.\n\nShadow home secretary David Davis said the research appeared to acknowledge that CSOs were having no discernible effect on crime figures.\n\nThe BBC reported by Danny Shaw said that the research is inconclusive. About 3,500 CSOs are in England and Wales but the government has agreed to have 25,000 officers on the streets by a cost of £50m.\n\nThey already have powers to hand out fines for a wide range of offences proposed by the Serious Organised Crime and Police Bill. The proposal includes extra powers to search suspects, enforce licensing offences, direct traffic and deter begging.\n", "smollm:1.7b": "The summary is concise and objective, preserving the key ideas and details from the original text while omitting any explanations or justifications. It provides a clear and neutral overview of the main points in the text without adding personal opinions or biases.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the given text about the police Federation's stance on CSOs having up to 30-minute detention. First, I should read through the entire paragraph carefully to understand the key points.\n\nThe main issues are that the Police Federation is opposing giving CSOs extra power, specifically detaining suspects for up to 30 minutes in potentially tough situations. They extended these powers from six police areas across England and Wales on Thursday to all forces there. The federation claims that CSOs don't have the experience or safety equipment for such detentions, but the government sees it as a help for \"building safe communities.\"\n\nThe chairman of the Federation, Jan Berry, argues against this power. She says CSOs should act like an \"eyes and ears\" by waiting for police to arrive. This change in their role will make them more visible in combat, helping to reduce crime. However, Blears defended the move, saying it would give civilians some extra edge but not take them away from the streets.\n\nThe report produced by Home Office is seen as encouraging CSOs to do what they're supposed to do. It highlights that CSOs are making a real difference in crime fighting but also pointing out that public perception might be off because of the change. \n\nDavid Davis, the shadow home secretary, thinks there's more to consider about the research findings and wants to recruit 25,000 officers on the streets by 2008. The bill they're pushing involves extra powers for search, licensing, traffic control, and begging deterrence.\n\nSo, I need to condense all this into a concise summary. Make sure to include key points about the opposition from the Police Federation, the government's stance, the report's findings, and the public reaction or concerns around the situation.\n</think>\n\nThe Police Federation strongly opposes CSOs being given up to 30-minute detentions in difficult situations. They extended this power from six areas across England and Wales on Thursday to all forces there, stating they lack the experience, training, and safety equipment for such detentions. The government defended the move, arguing it would help build safer communities by positioning CSOs as visible combatants. Jan Berry criticized the power, advocating for civilians to act as \"eyes and ears,\" emphasizing their role in reducing crime through surveillance. A report from Home Office highlights CSOs' benefits but also reveals public confusion about their new purpose. David Davis questions research on whether CSOs have any effect, while Danny Shaw noted inconclusive evidence and the cost of recruiting 25,000 officers on the street by 2008.", "tinyllama:1.1b": "The Police Federation has sharply criticized the government's decision to extend the powers of Community Support Officers (CSOs) to all police forces in England and Wales, claiming that they do not have the necessary experience, training, or equipment to handle \"potentially confrontational\" situations. The Federation said CSOS should not be placed in positions of power over law enforcement, citing potential for abuse by civilians. Home Office minister Hazel Blears has defended the powers, stating that they will make civilian officers more visible on the streets while also improving law and order. However, a shadow home secretary contends that CSOs' lack of effectiveness in reducing crime figures is not conclusive. The government plans to recruit 25,000 extra police on the street by 2008 at a cost of £50m.", "tinydolphin:1.1b": " Police Federation (PF) has expressed strong concerns about the proposed Community Support Officer (CSO) powers in England and Wales, particularly for situations where the use of force is required to maintain safety and order. The CSOs are not well-equipped to handle \"potentially confrontational\" incidents and have proposed alternative methods for dealing with these situations such as informing the police of their presence and waiting for assistance before detaining suspects. The police federation believes that CSOs should continue to focus on patrolling tasks instead of having the authority to detain suspects. This suggests a shift in the original purpose of Community Support Officers, which was meant to be a visible presence combating low-level crime and anti-social behaviour. However, the Home Office has defended the move by claiming that the new powers would not change the role of CSOs on the streets. Chief Constables are expected to decide whether these powers can be used effectively within their local areas based on their experience, training, and safety equipment.", "phi:2.7b": " The Police Federation opposes giving Community Support Officers (CSOs) the power to detain suspects for up to 30 minutes due to lack of experience, training, and safety equipment. CSOs can now use reasonable force to detain suspects until police officers arrive, with powers granted by chief constables in local forces. However, some believe that this will lead to more paperwork and less time on the street. The Home Office defends the move as giving a \"little bit of edge\" to civilian officers who are already making a real difference in the fight against crime. Some public confusion exists about distinguishing CSOs from proper officers. A report produced by the Home Office suggests that CSOs are having no discernible effect on crime figures, and this research is inconclusive due to the presence of approximately 3,500 CSOs in England and Wales with the government's intention of recruiting 25,000 more at a cost of £50 million.\n", "orca-mini:3b": " The Police Federation opposes giving Community Support Officers (CSOs) the power to detain suspects for up to 30 minutes. However, the government says the move will help police build safe communities. CSOs do not have the experience, training, and safety equipment to deal with potentially confrontational situations, according to the federation. The powers were extended to all police forces in England and Wales on Thursday. Home Office minister Hazel Blears defended the move, saying that the new powers would give civilian officers \"just that little bit of edge\". However, the report suggests that CSOs are having no discernible effect on crime figures. Shadow home secretary David Davis said the research appears to acknowledge that CSOs are having no effect on crime figures.", "hermes3:3b": "Row over CSO power to detain suspects for up to 30 minutes; Police Federation opposes it, fearing more confrontations and less time on the street. Government supports move, arguing it would give civilian officers 'just that little bit of edge' in building safe communities.", "stablelm-zephyr:3b": "The Police Federation opposes giving Community Support Officers (CSOs) the power to detain suspects for up to 30 minutes, stating that they lack experience, training, and safety equipment to handle potentially confrontational situations. CSOs can currently use reasonable force to detain suspects until police arrive. Home Office minister Hazel Bleaks defends the move, arguing that it provides civilian officers with \"just a little bit of edge.\" A report by the Home Office on CSOs states that they are making a difference in fighting crime but also acknowledges public confusion between CSOs and regular police officers. The government plans to increase the number of CSOs to 25,000 by 2008 at a cost of £50 million, with proposed extra powers including searching suspects, enforcing licensing offenses, directing traffic, and deterring begging.", "chatgpt-4o-latest": "The Police Federation opposes granting Community Support Officers (CSOs) the power to detain suspects for up to 30 minutes, arguing they lack the necessary training, experience, and equipment for potentially confrontational situations. Despite this, the government extended these powers to all police forces in England and Wales, claiming it would help build safer communities. Police Federation chairman Jan Berry warned that this change shifts CSOs' original role and could lead to more paperwork and less street presence. Home Office minister Hazel Blears defended the move, insisting it would enhance their effectiveness without altering their role. A government report found CSOs are making a difference, though the public struggles to distinguish them from regular officers. Shadow home secretary David Davis criticized the initiative, arguing it does not impact crime rates and that more real police officers are needed. The government plans to increase CSO numbers to 25,000 by 2008 at a cost of £50m, with additional powers proposed under the Serious Organised Crime and Police Bill.", "stablelm2:1.6b": "The Police Federation opposes granting Community Support Officers (CSOs) the power to detain suspects within 5 minutes due to their lack of experience, safety equipment, and ability to handle potentially confrontational situations. However, the CSO powers were extended to all police forces in England and Wales, with chief constables granting the use of reasonable force. The new powers will allow CSOs up to 5 minutes to detain suspects while waiting for police officers to arrive. Home Office minister Hazel Blears defended the move stating that it would give civilian officers \"just that little bit of edge.\" Although inconclusive research exists on the effectiveness of CSOs in fighting crime, the government intends to have more than 3,000 CSOs on the streets by 2018 with an additional £5m budget.", "granite3.1-dense:2b": "The Police Federation opposes granting Community Support Officers (CSOs) the authority to detain suspects for up to 30 minutes due to concerns over their inexperience, insufficient training, and lack of safety equipment for potentially confrontational situations. This extension of powers from six areas to all police forces in England and Wales was approved by the government to enhance community policing efforts. CSO chairman Jan Berry argues that civilian officers should serve as \"eyes and ears\" rather than engaging in detentions, which she believes would reduce their time on patrol due to increased paperwork.\n\nIn contrast, Home Office minister Hazel Blears defends the move, asserting it will provide CSOs with a \"little extra edge\" while on duty and emphasizes that this does not diminish their street presence. The government aims to increase CSO numbers to 25,000 by 2008 at a cost of £50m, enabling them to execute additional tasks such as handing out fines for various offenses, enforcing licensing, directing traffic, and combating begging.\n\nHowever, critics like shadow home secretary David Davis argue that recent research indicates CSOs have minimal impact on crime reduction, suggesting the government's focus should be on hiring more trained police officers instead of expanding a workforce with limited powers. The Serious Organised Crime and Police Bill further proposes additional authorities for CSOs, which have already been granted powers to issue fines for various offenses.", "reference": "The Police Federation has said it strongly opposes giving Community Support Officers (CSOs) the power to detain suspects for up to 30 minutes.Police Federation chairman Jan Berry said civilian officers should act as \"eyes and ears\" for the police.She said more powers would mean more paperwork and less time on the street.But the government said the move would help police \"build safe communities\".\"The powers that we are bringing in are things that they need to do when they are out patrolling,\" she said.Ms Blears said the study shows CSOs are \"making a real difference\" in the fight against crime.She denied their role was changing and said the new powers would not take them away from the streets.Shadow home secretary David Davis said the research appeared to acknowledge that CSOs were having no discernible effect on crime figures.The federation said CSOs do not have the experience, training and safety equipment to deal with \"potentially confrontational\" situations."}