{"raw_text": "Councils prepare to set tax rises\n \n Council tax in Scotland is set to rise by an average of about 4% in the coming year, BBC Scotland has learned.\n \n Authorities will decide final figures on Thursday when projected increases will be more than twice the rate of inflation, which is currently 1.6%. The finance minister has urged councils to limit increases but they have warned that they will struggle to maintain services unless funding is increased. They say much additional government money is for new initiatives. Scottish Finance Minister, Tom McCabe MSP, said: \"Last week in parliament I announced an additional £419m for core expenditure to local government in Scotland. \"That's a 5.5% increase and sits against an inflation rate of 1.6%, so I think we have quite rightly said to councils this year that we would at the very least ask them to exercise restraint.\" Mr McCabe is also looking for local authorities to become more efficient and save money in coming years. He told BBC Radio Scotland's Sunday Live programme: \"Here in Scotland we have 32 councils who all have their own individual collection systems for council tax, they have their own payroll systems and their own human resource systems.\n \n \"We think there has to be opportunities there for rationalisation and using the money saved to reinvest in frontline services.\" The councils' umbrella organisation Cosla, which provided BBC Scotland with the indicative figures for next year, warned that councils would face a continuous struggle to maintain services. Mr McCabe has promised them about £8.1bn next year. \"However, most of the increase is targeted to new initiatives and councils will experience difficulties in maintaining core services,\" a Cosla spokesman said. Cosla says that it is willing to work with the executive on finding efficiency savings but that these will not be enough to maintain services. They say the funding plans for the next three years will see councils lose more of the share of public spending. The Conservatives accuse the Scottish Executive of using the council tax to raise funds because it is too afraid to raise income tax.\n \n The Tory finance spokesman, Brian Monteith MSP, said: \"Its a form of disguise... yet again we see that council tax is being used as a way of passing on costs. \"Scared of actually using its three pence income tax that it could put up, what we've seen over the years is more and more burdens being put onto local authorities and the council tax payer having to pick up the bill.\" There are also warnings that unless funding to councils is increased in the next few years then services may have to be reduced. Linda Knox, Director of the Scottish Local Authority Management Centre at Strathclyde University, said: \"With this current settlement the increase is slowing. At the same time, the burdens on councils are greater than they were. \"The settlement figures don't include pay increases and the executive is also requiring a substantial figure - in the area of £325m - in efficiency savings across the settlement period.\" Education will be protected from any cuts but Linda Knox says this will mean other services will suffer. She said: \"In practice, that will mean a 4-5% cut for other services. On the face of it the settlement looks like an increase of about 9.7% but by the time you take into account other factors its probably only about 1% in real terms.\"\n", "llama3.2:1b": "Council tax in Scotland is set to rise by an average of around 4% in the coming year, with projected increases exceeding twice the rate of inflation. Finance minister Tom McCabe has urged councils to limit rises but warns they will struggle to maintain services unless funding is increased. Local authorities have also called for more efficiency savings and have received a £8.1bn allocation for next year, which they say will be insufficient to cover core service losses. Conservative critics accuse the Scottish Executive of using council tax as a way to raise funds without raising income tax.", "llama3.2:3b": "Council tax in Scotland is set to rise by an average of 4% next year, more than twice the rate of inflation. Finance Minister Tom McCabe has urged councils to exercise restraint, but they warn that funding is insufficient to maintain services unless additional money is provided. Cosla says most increases are for new initiatives, with councils struggling to save enough to maintain core services.", "gemma2:2b": "Scottish council tax is expected to rise by an average of 4%, double the rate of inflation, leading to financial strain for local authorities. The finance minister urges councils to exercise restraint and find efficiencies but acknowledges funding constraints. Councils are allocated a higher overall budget, but most of this increase will go towards new initiatives rather than core services. Critics accuse the Scottish government of using council tax as a means to avoid raising income taxes, and warn that insufficient funding for councils may lead to service cuts. \n", "qwen2.5:0.5b": "Council tax in Scotland is set to rise by around 4%, with additional funding expected for new initiatives. Councils are struggling to maintain services due to high costs and rising rates of inflation, necessitating rationalization and efficiency measures. Cosla, the umbrella organisation for councils, warned that council taxes would face a continuous struggle to maintain services in coming years. The Tory finance spokesman criticized the use of council tax as a way to pass on costs and urged increased funding for local authorities. Councils are also facing higher pay increases and require substantial savings across their settlement period. The current settlement shows only about 1% increase in real terms, with other factors reducing it further.", "qwen2.5:1.5b": "Scottish councils' council tax rise is set at around 4%, higher than inflation, with funding promised for core services but likely to see further cuts due to increased efficiency savings and greater burden on councils.", "qwen2.5:3b": "Council tax in Scotland is set to rise by about 4%, more than twice the rate of inflation (1.6%). Scottish Finance Minister Tom McCabe has promised £8.1bn next year, but most increases are targeted at new initiatives rather than core services. Councils are expected to struggle with funding unless they can become more efficient and save money, despite Mr McCabe's calls for restraint. Cosla warns that councils will continue to face challenges in maintaining services. Conservatives argue that using council tax funds is merely an attempt by the Scottish Executive to avoid raising income tax. The increase may slow down but it still represents a significant burden on local authorities. Education is protected from cuts, but other services are expected to suffer real-term reductions of 4-5%.", "opencoder:1.5b": "The key ideas and details found in the given text are as follows:\n\n1. The output is summarized as plain text, without explanations or formatting.\n2. The output preserves the key idea: councils prepare to set tax rises.\n3. The output contains the author's statements by finance ministers, authorities, and the Scottish Finance Minister.\n4. The output talks about the future funding plan for the next three years.\n5. The output warns that unless funds are increased in the next few years, services will have to be reduced.\n6. The output also highlights the importance of education from any cuts but insists this will mean other services will suffer.\n", "smollm:1.7b": "Councils prepare to set tax rises", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving the key ideas and details. Let me start by reading through the entire query carefully to understand all the important points.\n\nThe main topic is Scottish councils preparing for increased tax rises. The BC Scotland report mentioned a £419m increase in core expenditure at a 5.5% inflation rate, so they'll need to limit increases. The Scottish Finance Minister, Tom McCabe, urged councils to stay conservative but also suggested making authorities more efficient and cutting costs. The Cosla umbrella organization warned of the challenges, saying funding might not be enough. There are warnings about raising funding in the next few years for council services.\n\nI should capture all these key points: the increase in tax, inflation rate, the council's actions like limiting increases and efficiency efforts, Cosla's concerns about sustainability, and the Conservative Party's view on council tax being a form of disguised spending.\n\nNow, I need to condense this into a few sentences. Let me outline the main points:\n\n1. Tax rises set for Scotland.\n2. Increase is £419m with 5.5% inflation, so they'll have to limit increases.\n3. Minister urges councils to save money but may still face pressure unless funding changes.\n4. Councils use their funds for other services, which might reduce them if more cuts occur.\n5. Conservative Party thinks council tax is a way to pass on costs without proper revenue.\n\nI should ensure each of these points is covered concisely without getting bogged down in extra details. I'll make sure the language is clear and straightforward, focusing on the main ideas without mentioning specifics like specific areas or exact figures beyond what's provided.\n</think>\n\n Scottish councils are set to experience increased tax rises this year, with £419 million projected, an increase of 5.5% over inflation. Councils must limit these rises unless funding is increased. Scottish Finance Minister Tom McCabe urged councils to save money but also suggested efficiency and cost-saving measures. However, concerns about funding sustainability raised concerns that core services might struggle without more cuts. The Conservative Party views council tax as a form of disguised spending, often used for public spending bypassing local authorities.", "tinyllama:1.1b": "The Scottish government is preparing to raise council tax by an average of 4%, according to BBC Scotland, as projected increases will be twice the rate of inflation. Authorities have warned that they would struggle to maintain services unless funding was increased and said that additional money for new initiatives is needed. The Scottish Finance Minister, Tom McCabe MSP, announced that an additional £419m for core expenditure in 2018-19 would be available from government funds. This will help local authorities reinvest in frontline services but the Conservative party has accused the government of using council tax as a way to raise funds, citing evidence that it is too afraid to increase income tax. The Tories financial spokesperson, Brian Monteith MS, stated that council tax is being used as a way of passing on costs and that unless funding to councils is increased in the next few years services may have to be reduced. The Scottish Local Authority Management Centre director, Linda Knox, said that the current settlement figures do not include pay increases and the executive is also requiring substantial efficiency saving across the settlement period. Education will be protected from any cuts but other services are expected to suffer due to a 4-5% cut in funding, according to Linda Knox.", "tinydolphin:1.1b": " The Scottish Executive has announced plans to increase Council Tax rises for Scotland's councils by an average of 4% in 2018, according to BBC Scotland. This decision will be met with significant criticism from local authority chiefs and the Conservatives, who argue that the executive is using the council tax as a way to raise funds without actually raising income tax. The Tories accuse the Scottish Executive of using the council tax to raise funds because it's too afraid to raise income tax. The new increases are set to take effect in March 2018 and will increase Council Tax by an average of about 4% for the coming year, as reported by BBC Scotland on Thursday.", "phi:2.7b": " The council tax in Scotland is set to rise by an average of about 4% in the coming year, which will be more than twice the rate of inflation. Scottish Finance Minister, Tom McCabe MSP, has urged councils to limit increases but they have warned that they will struggle to maintain services unless funding is increased. Mr McCabe has promised an additional £8.1bn next year and Cosla says that it is willing to work with the executive on finding efficiency savings but these will not be enough to maintain services. The Tory finance spokesman, Brian Monteith MSP, says that council tax is being used as a way of passing on costs because the Scottish Executive is too afraid to raise income tax. There are also warnings that unless funding to councils is increased in the next few years then services may have to be reduced. Linda Knox, Director of the Scottish Local Authority Management Centre at Strathclyde University, says that education will be protected from any cuts but this will mean other services will suffer.\n", "orca-mini:3b": " Councils are preparing to set tax rises in Scotland, with an average increase of about 4% expected next year. This is more than twice the rate of inflation, which is currently 1.6%. The Scottish Finance Minister has urged councils to limit increases but they have warned that they will struggle to maintain services without additional funding. They say much extra money is for new initiatives, and some Tory politicians accuse the Scottish Executive of using the council tax to raise funds because it is too afraid to raise income tax. Education will be protected from any cuts, but other services are expected to suffer.", "hermes3:3b": "Scotland sets average 4% tax rise for council councils, despite inflation rate at 1.6%.", "stablelm-zephyr:3b": "Councils in Scotland are expected to raise council tax by around 4% next year, more than double the rate of inflation. Finance minister Tom McCabe MSP has urged councils to limit increases but warned that they would struggle to maintain services without increased funding. The Scottish Government plans to invest £419m in local government and encourage rationalization and efficiency savings. However, concerns have been raised that this will not be enough to maintain existing services, leading to possible service reductions in the future. Education will remain protected from cuts.", "chatgpt-4o-latest": "Council tax in Scotland is set to rise by an average of 4%, more than twice the inflation rate of 1.6%. Despite a £419m increase in core funding, councils warn they will struggle to maintain services as much of the additional money is allocated to new initiatives. Finance Minister Tom McCabe urges councils to exercise restraint and seek efficiency savings, suggesting rationalization of administrative systems. Cosla, representing councils, argues that efficiency savings alone will not suffice and that councils are losing their share of public spending. The Conservatives accuse the Scottish Executive of using council tax to raise funds instead of increasing income tax. Experts warn that without increased funding, services may be cut, with non-education services facing reductions of 4-5%. In real terms, the funding increase is estimated to be only about 1%.", "stablelm2:1.6b": "Scotland's council tax is set to rise by an average of 4%, according to BBC Scotland. Authorities will decide final figures on Thursday, with projected increases exceeding the rate of inflation (currently 1.6%). The finance minister has urged councils to limit increases but warned that funding must be increased for services. Scottish Finance Minister Tom McCabe says local authorities should become more efficient and save money in future years. Cosla, the councils' umbrella organisation, warns councils will face continuous struggles to maintain services with funding plans for the next three years reducing councils' share of public spending. Councils will experience difficulties maintaining core services unless funding is increased.", "granite3.1-dense:2b": "Councils in Scotland are expected to approve a 4% average rise in council tax for the coming year, surpassing inflation's rate of 1.6%. This decision follows a £419m increase in core expenditure for local government by Scottish Finance Minister Tom McCabe. Councils anticipate difficulties maintaining services due to insufficient funding and new initiatives' requirements, with most of the next-year's budget allocated to these projects. Cosla, representing 32 councils, warns of a continuous struggle to maintain core services, despite receiving £8.1bn for the year. The Conservatives criticize the Scottish Executive for using council tax as an alternative to raising income tax, arguing it's a way to avoid higher taxes while passing costs onto local authorities and residents. Additionally, the current funding settlement could lead to a 4-5% reduction in other services if efficiency savings aren't achieved.", "reference": "The councils' umbrella organisation Cosla, which provided BBC Scotland with the indicative figures for next year, warned that councils would face a continuous struggle to maintain services.The finance minister has urged councils to limit increases but they have warned that they will struggle to maintain services unless funding is increased.\"However, most of the increase is targeted to new initiatives and councils will experience difficulties in maintaining core services,\" a Cosla spokesman said.Council tax in Scotland is set to rise by an average of about 4% in the coming year, BBC Scotland has learned.There are also warnings that unless funding to councils is increased in the next few years then services may have to be reduced.\"That's a 5.5% increase and sits against an inflation rate of 1.6%, so I think we have quite rightly said to councils this year that we would at the very least ask them to exercise restraint.\"They say the funding plans for the next three years will see councils lose more of the share of public spending.\"Scared of actually using its three pence income tax that it could put up, what we've seen over the years is more and more burdens being put onto local authorities and the council tax payer having to pick up the bill.\"He told BBC Radio Scotland's Sunday Live programme: \"Here in Scotland we have 32 councils who all have their own individual collection systems for council tax, they have their own payroll systems and their own human resource systems.The Tory finance spokesman, Brian Monteith MSP, said: \"Its a form of disguise... yet again we see that council tax is being used as a way of passing on costs."}