{"raw_text": "Whitehall shredding increasing - Tories\n \n Civil servants have drastically stepped up the shredding of official documents, figures compiled by the Tories suggest.\n \n Some government departments had doubled the number of documents being shredded ahead of the Freedom of Information Act's implementation on 1 January. Departments for defence, environment and trade, which had all increased file destruction, said they were following rules governing public records. But the Tories want the information commissioner to investigate. The Freedom of Information Act will for the first time give members of the public access to government records previously kept secret for 30 years. But BBC Political Correspondent James Hardy said the prospect of outsiders poking their noses into the inner workings of Whitehall appeared to be causing jitters among the mandarins.\n \n Liberal Democrat Alan Beith - who chairs the select committee which monitors the Department of Constitutional Affairs - said if the claims were true, Whitehall was \"acting entirely against the spirit of the new Act\". \"Both the information commissioner and the select committee will have to keep this issue under very close scrutiny.\" Fellow Lib Dem Norman Baker said the episode painted an \"unflattering picture of the inner workings of government\". \"It is clear that the government's initial enthusiasm for open government has turned to self-serving cynicism.\" Dr Julian Lewis, the Conservative spokesman for the Cabinet Office, said he had discovered a huge acceleration in shredding from a series of parliamentary answers.\n \n The Department of Work and Pensions destroyed nearly 37,000 files last year - up 22,000 on four years ago when the Act was passed. The number of files destroyed by the Ministry of Defence and the departments of Environment, Food and Rural Affairs and Trade and Industry has also risen dramatically. Dr Lewis has called for an investigation by the information commissioner Richard Thomas. Earlier this week, Mr Thomas said he was looking into Cabinet Office orders telling staff to delete e-mails more than three months old. He said he \"totally condemned\" the deletion of e-mails to prevent their disclosure under freedom of information laws coming into force on 1 January.\n \n Government guidance said e-mails should only be deleted if they served \"no current purpose\", Mr Thomas said. A Cabinet Office spokeswoman said the move was not about the new laws or \"the destruction of important records\". The Freedom of Information Act will cover England, Wales and Northern Ireland from next year. Similar measures are being brought in at the same time in Scotland. It provides the public with a right of access to information held by about 100,000 public bodies, subject to various exemptions.\n", "llama3.2:1b": "Whitehall shredding is increasing significantly due to government departments' efforts to meet the Freedom of Information Act's deadline. The Tories want an investigation into the claims. Some departments have doubled their file destruction, and some are deleting emails more than three months old. The information commissioner has been briefed on the issue and will keep it under close scrutiny.", "llama3.2:3b": "Civil servants have dramatically increased shredding of official documents ahead of the Freedom of Information Act's implementation. The number of files destroyed has risen significantly in departments such as Defence, Environment and Trade, with some doubling their file destruction rates. Tories want an investigation by the information commissioner into whether these actions are against the spirit of the new act.", "gemma2:2b": "Government departments are shredding an increasing number of documents ahead of the Freedom of Information Act's implementation. The Tories call for investigations into this behavior, citing it as going against the spirit of the Act.  The act will give members of the public access to previously secret government records for 30 years. Concerns about potential information leaks are prompting increased file destruction. \n", "qwen2.5:0.5b": "Whitehall is using government departments to dramatically increase their shredding of official documents before the Freedom of Information Act comes into effect on January 1st. Some departments have doubled the number of documents being shredded ahead of the act, while others are following rules governing public records. The Tories want the information commissioner to investigate, and the Lib Dems suspect Whitehall is acting against the spirit of the new act. The department of Work and Pensions destroyed nearly 37,000 files last year - up 22,000 on four years ago when the Act was passed.", "qwen2.5:1.5b": "Whitehall has increased shredding of documents for the Freedom of Information Act implementation, sparking concerns among civil servants and politicians. The Tories want an investigation into Whitehall's actions following claims that it is disregarding the new law's requirements. The measure comes as government departments have doubled their shred rate ahead of the act's implementation on January 1st, with defense, environment, and trade departments leading the charge. This appears to be a reaction to the prospect of the public gaining access to previously confidential records under the act.", "qwen2.5:3b": "Whitehall shredding has increased significantly ahead of the Freedom of Information Act’s implementation on January 1st, figures suggest. Departments like Defence, Environment and Trade have doubled their document destruction, claiming compliance with rules governing public records. However, this appears to be a concern for the Tories, who want the information commissioner to investigate, citing potential breach of spirit of the new law. Liberal Democrats claim Whitehall is acting against the new Act’s intentions, viewing it as cynical self-serving behavior. Government guidance requires emails to be kept if they serve any current purpose; however, some departments have been deleting emails more than three months old. The Information Commissioner Richard Thomas is looking into these practices. Similar measures are in place across Scotland.", "opencoder:1.5b": "Whitehall shredding increasing - Tories\n \nCivil servants have drastically stepped up the shredding of official documents, figures compiled by the Tories suggest. Some government departments had doubled the number of documents being shredded ahead of the Freedom of Information Act's implementation on 1 January. Departments for defence, environment and trade, which had all increased file destruction, said they were following rules governing public records.\n\nBut the Tories want the information commissioner to investigate. The Freedom of Information Act will for the first time give members of the public access to government records previously kept secret for 30 years.\n\nBBC Political Correspondent James Hardy said the prospect of outsiders poking their noses into the inner workings of Whitehall appeared to be causing jitters among the mandarins. Liberal Democrat Alan Beith - who chairs the select committee which monitors the Department of Constitutional Affairs - said if the claims were true, Whitehall was \"acting entirely against the spirit of the new Act\".\n\nThe Department of Work and Pensions destroyed nearly 37,000 files last year - up 22,000 on four years ago when the Act was passed. The number of files destroyed by the Ministry of Defence and the departments of Environment, Food and Rural Affairs and Trade and Industry has also risen dramatically.\n\nDr Julian Lewis, the Conservative spokesman for the Cabinet Office, said he had discovered a huge acceleration in shredding from a series of parliamentary answers. The government's initial enthusiasm for open government has turned to self-serving cynicism. \n\nThe Department of Work and Pensions called for an investigation by the information commissioner Richard Thomas. Earlier this week, Mr Thomas said he was looking into Cabinet Office orders telling staff to delete e-mails more than three months old. He said he \"totally condemned\" the deletion of e-mails to prevent their disclosure under freedom of information laws coming into force on 1 January.\n\nGovernment guidance said e-mails should only be deleted if they served \"no current purpose\". A Cabinet Office spokeswoman said the move was not about the new laws or \"the destruction of important records\". The Freedom of Information Act will cover England, Wales and Northern Ireland from next year. Similar measures are being brought in at the same time in Scotland. It provides the public with a right of access to information held by about 100,000 public bodies, subject to various exemptions.\n", "smollm:1.7b": "The summary is:\n\n* Whitehall has increased the shredding of official documents, which is increasing the secrecy around government records and potentially violating the Freedom of Information Act (FOIA).\n* The Tories have been accused of acting against the spirit of the FOIA by destroying public records.\n* The Select Committee on Constitutional Affairs will need to keep a close eye on the situation.\n* The information commissioner has called for an investigation into the government's actions, which could lead to further secrecy and potential abuse of power.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about documents being shredded and the implications for different parties. First, I should read through each paragraph carefully to understand the key points.\n\nThe first section talks about the Tory Party increasing document shredding after January 1. They doubled the number of documents before the Act starts. defense, environment, and trade departments increased their file destruction according to the rules. Tories want the information commissioner to investigate them. The Freedom of Information Act gives people access to records for a decade now, but it's causing concerns about accessing government secrets.\n\nNext, the Liberal Democrats say that if the claims are true, Whitehall is acting against the new act. They plan an investigation with others, and there's some criticism of government openness. Another Democrat mentions another issue from parliamentary answers, which accelerated document destruction.\n\nThe third section shows actual numbers: Work and Pensions deleted 37k files last year, up from four years ago. DEFEND and other departments have seen a jump in destruction too. The Information Commissioner is looking into e-mails deletion orders to prevent disclosure on January 1. Guidance says emails should only be deleted if no current purpose.\n\nI need to make sure I include all the main points: the Tory increase, their investigation plan, the act's public records access, criticism of government work, and specific examples from other departments and policies.\n</think>\n\nThe document discusses the increasing activity of document shredding by government departments in response to the Freedom of Information Act. Key points:\n\n1. **Tories Increase Document Shredding**: They doubled document destruction before January 1 with the act's implementation. defence, environment, and trade departments increased their file destruction under rules.\n\n2. **Tories Want Investigative Action**: The information commissioner is requesting an investigation to prevent unauthorized disclosure of public records.\n\n3. **Freedom of Information Act**: The act now gives the public access to government records for 30 years, causing concerns about accessing secrets.\n\n4. **Liberal Democrat Concerns**: They criticized the new act's promotion of open government and suggested self-serving cynicism in its initial enthusiasm.\n\n5. **Other Parties' Activity**: The information commissioner is looking into e-mails deleted over three months old due to Cabinet Office orders.\n\n6. **Numbers and Initiatives**: Government departments like Work and Pensions destroyed nearly 37,000 files last year. defence, environment, and trade also saw significant increases in document destruction.\n\nThe summary captures the main dynamics: increased shredding by Tory parties, their investigation plans, the act's impact on public access, criticism of government openness, and specific examples from other sectors.", "tinyllama:1.1b": "The Whitehall shrouded in secrecy due to significant increases in file destruction from Department for Work and Pensions (DWP) and Ministry of Defence (MoD), as well as departments such as Environment, Food & Rural Affairs and Trade & Industry. The Information Commissioner Richard Thomas is reportedly looking into allegations that officials were ignoring departmental guidelines when shrinking files beyond the three-month limit. The Freedom of Information Act has been in operation since January 2019, but concerns over Whitehall's records are not new. Liberal Democrats Norman Baker and Alan Beith expressed concern over how information was being handled under the new laws, while former Conservative cabinet minister Dr Julian Lewis claimed there was an \"unflatterness\" with regard to the inner working of government. The Department for Work and Pensions destroyed 36,817 files, up from a total of 20,549 in 2018, and the MoD destroyed 36,582, up from 19,891 in 2018. The Information Commissioner has announced he will investigate Cabinet Office orders telling staff to delete e-mails more than three months old.", "tinydolphin:1.1b": " The Whitehall shredding has grown significantly, according to figures provided by the Conservatives. The Tories have seen a significant increase in the amount of shredded documents being released for inspection under the new Freedom of Information Act. Some departments are having their work doubled, with civil servants double-shredding files to keep them hidden from the public.\n\nWhitehall officials said they've stepped up shredding efforts ahead of the implementation of the new law, which requires government departments to disclose certain types of information. This follows a rise in file destruction figures for some departments, with the Department of Work and Pensions increasing its output by nearly 37,000 files on top of the four-year increase. The Ministry of Defence and Environment, Food and Rural Affairs, and Trade and Industry have also seen substantial increases in their shredding efforts.\n\nHowever, Dr. Julian Lewis, a Conservative spokesman for the Cabinet Office, has accused government officials of recklessness with public records. He claims that a significant amount of destruction has been occurring at an unhealthy rate. Dr. Lewis has urged the information commissioner, Richard Thomas, to investigate these practices, calling them \"cruel and self-serving.\"\n\nThe Tories have also introduced similar changes in Scotland, Wales, and Northern Ireland. The new law will extend its reach into England from 1 January, covering about 100,000 public bodies. Similar measures are being brought in at the same time for Scotland, Wales, and Northern Ireland. This policy aims to ensure that all important information is available and accessible to the public without requiring a person to disclose it.", "phi:2.7b": " Whitehall has increased their file destruction leading up to the implementation of the Freedom of Information Act on January 1st. The Department for Defence, Environment and Trade have all reportedly doubled the number of documents being shredded ahead of the law's implementation. However, this increase in shredding is causing concern among government officials as it appears they are acting against the spirit of the new Act. The information commissioner has been asked to investigate these claims by the Liberal Democrat Alan Beith who chairs the committee which monitors the Department of Constitutional Affairs. Both the information commissioner and the select committee will need to keep this issue under close scrutiny, according to Alan Beith. This situation is unflattering as it suggests that government officials are not supportive of the new Act's principles. The Cabinet Office spokesman has discovered a significant increase in file destruction from parliamentary answers and wants an investigation by the information commissioner. Additionally, there have been reports of Cabinet Office orders to delete e-mails more than three months old. The Department of Work and Pensions destroyed nearly 37,000 files last year, which is up 22,000 on records from four years ago. Similarly, the Ministry of Defence has destroyed many files, and other departments such as the Environment, Food and Rural Affairs, and Trade and Industry have also increased their destruction. Dr Julian Lewis has called for an investigation by the information commissioner in response to these reports. The freedom of information Act will come into force on January 1st, giving members of the public access to government records previously kept secret.\n", "orca-mini:3b": " The text reports that civil servants have increased the amount of official documents they shredded before the Freedom of Information Act came into force in January, and some departments have doubled the number of files being destroyed. Liberal Democrat Alan Beith and Conservative Norman Baker are critical of this behavior, calling it \"self-serving cynicism\" by the government. The Department of Work and Pensions destroyed nearly 37,000 files last year, up from 22,000 four years ago when the Freedom of Information Act was passed. Dr. Julian Lewis, a Conservative spokesman for the Cabinet Office, has called for an investigation by the information commissioner Richard Thomas. The government is accused of deleting e-mails to prevent their disclosure under freedom of information laws coming into force on January 1, and this move is not related to the new laws or \"the destruction of important records.\"", "hermes3:3b": "Tories: Government departments increasing shredding of official documents ahead of Freedom of Information Act implementation.", "stablelm-zephyr:3b": "Civil servants have increased document shredding ahead of the Freedom of Information Act implementation on January 1st, according to figures compiled by the Tories. Some government departments doubled their document destruction rates, citing adherence to public record rules. The Tories want the information commissioner to investigate claims that Whitehall is acting against the spirit of the new act. The Freedom of Information Act grants members of the public access to previously secret government records for the first time in 30 years; however, this increased transparency has raised concerns among civil servants and leading politicians who are calling for investigations into document destruction practices.", "chatgpt-4o-latest": "Civil servants have significantly increased the shredding of official documents ahead of the Freedom of Information Act's implementation on 1 January, according to figures compiled by the Tories. Some government departments, including defence, environment, and trade, have doubled file destruction, claiming adherence to public records rules. The Tories are calling for an investigation by the information commissioner. Critics, including Liberal Democrats Alan Beith and Norman Baker, argue this undermines the spirit of the new law, which grants public access to previously secret government records. Conservative spokesman Dr Julian Lewis highlighted a sharp rise in document destruction, with the Department of Work and Pensions alone destroying nearly 37,000 files last year. The information commissioner, Richard Thomas, is also investigating Cabinet Office orders to delete e-mails older than three months, condemning such actions if intended to evade disclosure. The government insists the deletions are unrelated to the new law. The Freedom of Information Act will apply to England, Wales, and Northern Ireland, with similar measures in Scotland, covering around 100,000 public bodies with certain exemptions.", "stablelm2:1.6b": "According to figures compiled by the Tories, civil servants have significantly increased shredding of official documents. Some government departments doubled the number of files being destroyed before the Freedom of Information Act's implementation on January 1st. However, the information commissioner is investigating these claims as the act allows members of the public access to previously secret government records for the first time. The act aims to encourage open government and transparency in UK institutions but has reportedly turned into \"self-serving cynicism,\" according BCC Political Correspondent James Hardy.", "granite3.1-dense:2b": "Tories have reported a significant increase in document shredding by civil servants ahead of the Freedom of Information Act's implementation on 1 January 2023. Departments like Defence, Environment, Trade, and Food & Rural Affairs have reportedly doubled their file destruction rates to comply with public records rules. This action has raised concerns among political figures, including Liberal Democrats Alan Beith and Norman Baker, who criticize it as contrary to the spirit of open government.\n\nThe Department of Work and Pensions destroyed nearly 37,000 files in 2022, up by 22,000 from four years prior when the Act was passed. Similar trends are observed in other departments. Conservative spokesman Dr Julian Lewis has called for an investigation by the information commissioner, Richard Thomas, due to the apparent disregard for preserving records.\n\nThomas has already begun investigating Cabinet Office orders directing staff to delete e-mails over three months old, which he condemns as an abuse to prevent disclosure under the new Act. The Freedom of Information Act will grant public access to government records previously kept secret for 30 years across England, Wales, and Northern Ireland (later extending to Scotland). It covers approximately 100,000 public bodies with various exemptions.", "reference": "The Freedom of Information Act will for the first time give members of the public access to government records previously kept secret for 30 years.Government guidance said e-mails should only be deleted if they served \"no current purpose\", Mr Thomas said.He said he \"totally condemned\" the deletion of e-mails to prevent their disclosure under freedom of information laws coming into force on 1 January.Some government departments had doubled the number of documents being shredded ahead of the Freedom of Information Act's implementation on 1 January.Dr Lewis has called for an investigation by the information commissioner Richard Thomas.A Cabinet Office spokeswoman said the move was not about the new laws or \"the destruction of important records\".But the Tories want the information commissioner to investigate.Departments for defence, environment and trade, which had all increased file destruction, said they were following rules governing public records.Liberal Democrat Alan Beith - who chairs the select committee which monitors the Department of Constitutional Affairs - said if the claims were true, Whitehall was \"acting entirely against the spirit of the new Act\"."}