{"raw_text": "Research fears over Kelly's views\n \n Scientists have expressed concerns that new education secretary Ruth Kelly's religious views could hamper vital scientific research.\n \n Ms Kelly, who is Catholic, is reported to be \"pro-life\" and has opposed embryo research. Medical Research Council Professor Nancy Rothwell said Ms Kelly's views mattered as she was responsible for training future scientists. The Department for Education and Skills would not comment on the concerns.\n \n A spokeswoman said: \"It is not news that Ms Kelly is a Catholic but we are not going into any details on this.\" But she added that claims Ms Kelly was in charge of a £1bn university research budget were not true. It was down to the Higher Education Funding Council and the research councils to decide on universities' research allocations. British law is open to the cloning of human embryos to create stem cells, master cells that can develop into all the body's tissue types. This cloning activity is not permitted for reproductive purposes - only for research into new disease treatments. However, it is controversial because it involves the destruction of embryos.\n \n Professor Rothwell, who is also vice-president of research at Manchester University, told the Times Higher Education Supplement it would worry her \"a great deal\" if ministers were anti-stem cell. She said: \"The views of ministers in the DfES do matter as they are responsible for training the next generation of scientists. \"You can't have a higher education policy that is at odds with the government's science policy.\" Head of developmental genetics at the National Institute of Medical Research, Professor Robin Lovell-Badge, said he had witnessed the confused situation in the US where many religious groups opposed the practice. He said: \"If someone as senior as Ruth Kelly is not going to favour stem cell research we will end up with a similarly schizophrenic system in this country. It is very worrying.\" But fertility expert Lord Winston said he thought it was \"rather good\" ministers held ethical views. Concerns have also been raised by \"pro-choice\" organisations that Ms Kelly's views might affect sex education policy in schools.\n \n Family Planning Association chief executive, Anne Weyman, said teaching pupils about contraception and abortion were key. \"Young people must be informed about all the issues within sexual health, which include contraception and abortion. \"I think it is very important that the government maintains its commitment to the teenage pregnancy strategy.\" Currently, individual schools devise their own sex education policies based on a framework provided by the DfES. Ms Kelly has not set out her detailed views on either issue yet, but has said she intends to put parents first in education policy. This would include the quality of teaching, classroom discipline and academic standards in schools, she said.\n", "llama3.2:1b": "Scientists express concerns over Ruth Kelly's religious views that could hinder scientific research. She is a Catholic who opposes embryo research due to her \"pro-life\" stance and was responsible for training future scientists. However, it is unclear if this affects funding decisions or policy on human embryos.\n\nConcerns include:\n\n* Kelly's views could harm scientific research\n* Stem cell research is permitted only for disease treatment, not reproductive purposes\n* Kelly may be influenced by government science policy\n\nExperts weigh in with differing opinions:\n* Some (e.g. Rothwell) worry about Kelly's influence due to her role in training future scientists\n* Others (e.g. Lovell-Badge) express concern about the potential for conflicting policies and schizophrenia-like systems in a country where religious views clash with government science policy.", "llama3.2:3b": "Scientists express concerns that Education Secretary Ruth Kelly's religious views may hinder scientific research, particularly stem cell research. Kelly is reported to be pro-life and has opposed embryo research. Experts worry about her potential influence on education policy, including sex education, and the impact on training future scientists.", "gemma2:2b": "Ruth Kelly's Catholic beliefs about life are causing concern among scientists who believe they may hinder scientific research training. Some experts fear a clash between government science policies and Kelly's views on stem cell research and reproductive purposes.  There is also concern that her ethical views may affect sex education policy in schools, with some organizations pushing for a more comprehensive approach. \n", "qwen2.5:0.5b": "The UK government is concerned that research secretary Ruth Kelly's Catholic beliefs could hinder vital scientific discoveries. Kelly is known for opposing embryo research and training scientists who train future doctors. The Department for Education and Skills wouldn't comment on this. Kelly was reported to be \"pro-life\" but her views were not part of the research budget. Professor Nancy Rothwell said that Kelly's views mattered, as she was responsible for training future scientists.", "qwen2.5:1.5b": "Kelly's Catholic views raise concerns about potential anti-science policies under her tenure as Education Secretary, including opposition to embryonic stem cell research. The Department for Education maintains that these claims are unfounded and unrelated to its budget allocations or policy areas such as sex education.", "qwen2.5:3b": "Scientists have expressed concerns that Ruth Kelly's pro-life religious views might hinder scientific research, particularly embryonic stem cell research. These fears are heightened as Ms Kelly is Catholic and has opposed embryo research training for future scientists. Despite the Department of Education and Skills not commenting on these concerns, there are doubts about her role in managing a £1bn university research budget. However, British law allows cloning human embryos for research purposes only. Critics worry that religious views could lead to conflicts with government science policies.", "opencoder:1.5b": "Researchers have expressed concerns over Kelly's views. Ms Kelly, Catholic, is reported to be \"pro-life\" and has opposed embryo research. She was responsible for training future scientists, but her views did not directly contribute to the development of scientific research. The Department for Education and Skills would not comment on these concerns because they involve sensitive topics like religion.\nHowever, there have been discussions about British law regarding the creation of stem cells and the use of embryos in research. The Higher Education Funding Council and the research councils are responsible for deciding on universities' research allocations. Scientists argue that the benefits of cloning human embryos cannot be compromised for research purposes because of their potential to lead to new disease treatments, which can increase patient outcomes.\nMeanwhile, professors at Manchester University have pointed out concerns about the Higher Education Supplement's policies regarding stem cell research. They cautioned against \"wasting resources\" by opposing stem cell research as it contradicts the government's science policy.\nConcerns also arise from the pro-choice initiatives sparked by Ms Kelly's views on sex education in schools. The expert opinion of Lord Winston suggested that Ms Kelly’s view could affect sex education policy in schools, although he did not detail her specific views.\nMeanwhile, a family planning association chief executive, Anne Weyman, said teaching pupils about contraception and abortion were key. \"Young people must be informed about all the issues within sexual health, which include contraception and abortion. I think it is very important that the government maintains its commitment to the teenage pregnancy strategy.\"\nCurrently, individual schools devise their own sex education policies based on a framework provided by the Department for Education and Skills. Despite concerns about privacy and safety, Ms Kelly has not set out her detailed views yet, but has said she intends to put parents first in education policy.\n", "smollm:1.7b": "Research fears over Ruth Kelly's views on stem cell research have been expressed by scientists who are concerned that her religious beliefs could hamper vital scientific research. Ms Kelly, who is Catholic, has opposed embryo research and is reported to be \"pro-life\". Medical Research Council Professor Nancy Rothwell said Ms Kelly's views mattered as she was responsible for training future scientists. The Department for Education and Skills would not comment on the concerns.\nA spokeswoman said: \"It is not news that Ms Kelly is a Catholic but we are not going into any details on this.\" But she added that claims Ms Kelly was in charge of a £1bn university research budget were not true. It was down to the Higher Education Funding Council and the research councils to decide on universities' research allocations. British law is open to the cloning of human embryos to create stem cells, master cells that can develop into all the body's tissue types. This cloning activity is not permitted for reproductive purposes - only for research into new disease treatments. However, it is controversial because it involves the destruction of embryos.\nA spokeswoman for the Higher Education Funding Council said: \"It would worry her a great deal if ministers were anti-stem cell.\" She added that Ms Kelly's views on stem cell research did matter as she was responsible for training the next generation of scientists. You can't have a higher education policy that is at odds with the government's science policy.\nYou can see that this summary does not include any information about the specific details of the text, such as key ideas or supporting evidence. It only presents the main points in a concise and clear manner.", "deepseek-r1:1.5b": "<think>\nAlright, let me try to figure this out. The user wants a concise summary of a provided text. They specified that only the summary should be plain text without any explanations or formatting. So, I need to extract the main points from the given text.\n\nFirst, I'll read through the text carefully to identify the key sections. The text is about research fears related to Ruth Kelly's religious views and their potential impact on scientific research. \n\nThe first paragraph mentions concerns expressed by scientists that Kelly's Catholic views might hinder research, particularly since she's pro-life and opposed embryo research. It also notes that the Department of Education and Skills won't comment, but other details aren't confirmed.\n\nNext, there's a statement from a spokesperson saying they don't have more info on her stance but adding that claims about budget allocations weren't true because it was handled by the Higher Education Funding Council. There's also mention of cloning embryos for stem cells or master cells and that this is against reproductive purposes, though controversially.\n\nAnother section talks about professors' opinions in The Times Higher Education Supplement. Professor Rothwell expresses regret if ministers opposed stem cell research and criticizes the US situation with religious groups opposing it. However, the user's perspective from Manchester University shows a lack of concern, while others worry about the impact on fertility education policies.\n\nLastly, Anne Weyman emphasizes the importance of curriculum in schools, urging the government to maintain commitment to teenage pregnancy strategies and promote science education without favoring stem cell research.\n\nPutting this all together, I need to condense the main points into a clear summary. The user probably needs this for quick reference or to communicate the key issues without reading the entire article. So, I'll focus on the conflicting views between scientists and religious groups about Kelly's stance on stem cell research and their implications for scientific research and education policies.\n</think>\n\n科学家对 Ruth Kelly 教授宗教观点的担忧  \n科学家对英国首相鲁宾•凯利（Ruth Kelly）教区主义的担忧  \n凯利是教徒，被认定为\"安息日\"（pro-life），反对胚胎学研究。  \n英国健康研究委员会（Medical Research Council, Professor Nancy Rothwell）表示，凯利的教区主义对未来科学家至关重要。  \n英国教育大臣办公室（The Department for Education and Skills）没有置评，但曾暗示其可能对此表示担忧。  \n一位发言人表示：“我们并不知道凯利是教徒，但我们不透露更多信息。”但她说 claimings of £1亿的大学研究预算中政府反对胚胎学研究的指控不属实。这是由英国高等教育基金委员会（Higher Education Funding Council）和各校研究委员会决定分配科研预算的地方。  \n教授教授说：“如果政府的科学政策与中国教区主义有分歧，那么高教育政策也将存在这种矛盾。”  \n牛津大学生命科学研究研究所（Manchester University Research)主任罗宾•洛维拉•比格（Robin Lovell-Badge）表示：他见过美国许多教派强烈反对胚胎学研究。他说：“如果凯利的政府不支持干细胞研究，我们将在英国也出现类似情况。这非常令人担忧。”  \n fertility专家Lord Winston 表示，对“选择性”组织可能影响中学性别教育政策。  \n凯利是家庭计划（Family Planning Association）首席执行官，强调性别教育课程中应教授 contraception与排泄生殖腺的相关知识。“年轻人必须了解性健康中的所有问题，包括避孕和排泄生殖腺。”她说：“我认为，政府应当坚决维护 teenagepregnancy战略。”  \n当前，各学校根据英国教育大臣办公室提供的框架（由英国首相凯利负责制定）自主设计教育政策。她表示，目前她对两方面的具体观点一无所知，但明确表示将强调在学校教学中重视教学质量、班级纪律和学术标准，并优先考虑 parents 的输入。", "tinyllama:1.1b": "Scientists have expressed concerns that new Education Secretary Ruth Kelly's religious views could hinder vital scientific research, particularly on issues like embryonic stem cell research or contraception/abortion education for young people. The Department for Education and the Science and Technology Committee of Parliament both declined to comment, but a British law allows the closure of human embryos for research purposes only if reproduction is not involved. Professor Nancy Rothwell, Head of Developmental Gene Therapy at the National Institute of Medical Research in London, expressed concerns about the DfES's science policy, saying \"if someone as senior as Ruth Kelly is not going to favor stem cell research we will end up with a similarly schizophrenic system in this country. It is very worrying.\" Ms Kelly has yet to set out her detailed views on controversial issues like contraception and abortion education for young people, but her spokesperson said the Department for Education and Science would not comment on \"specific details\" on any future policies.", "tinydolphin:1.1b": " In summary, the text discusses concerns over Ruth Kelly's views regarding scientific research due to her \"pro-life\" stance. It also raises questions about the government's policies on sex education. The article highlights that the Family Planning Association is concerned about teaching sex education in schools and claims that individuals' rights should be protected.", "phi:2.7b": " Scientists have expressed concerns that new education secretary Ruth Kelly's religious beliefs may negatively impact scientific research. Ms. Kelly is reportedly \"pro-life\" and opposed to embryo research, which could affect future scientists' training. The DfES would not comment on the issue. A spokesperson for the DfES stated that claims of Ms. Kelly having control over a £1bn university research budget were not accurate. However, it was important to note that British law allows cloning human embryos for medical research purposes only and not for reproductive purposes. Professor Nancy Rothwell is concerned about Ms. Kelly's views as she is responsible for training the next generation of scientists. The DfES must ensure its science policy aligns with the government's higher education policy, which could be at odds if religious beliefs conflict with scientific advancements such as stem cell research. If Ms. Kelly does not favor stem cell research, it would lead to a similarly conflicted system in the UK. Professor Robin Lovell-Badge warns that the US experienced a similar situation due to conflicting religious groups' views on stem cells. However, fertility expert Lord Winston believes having ethical beliefs is beneficial. Concerns have also been raised about Ms. Kelly's potential impact on sex education policy in schools. Pro-choice organizations are worried her beliefs may affect teaching young people about contraception and abortion. Currently, individual schools determine their own sex education policies based on a framework provided by the DfES. Ms. Kelly has not set out her specific views yet, but she intends to prioritize parents' concerns in education policy. This includes improving teaching quality, classroom discipline, and academic standards in schools. The FPA supports including sex education in schools but believes it is important for young people to be informed about all issues related to sexual health, including contraception and abortion.\n", "orca-mini:3b": " The text discusses concerns raised by scientists over Ruth Kelly's religious views and her potential impact on vital scientific research. The summary highlights the key ideas and details of the text, including Ms Kelly's religious views and the controversy surrounding embryo research. It also mentions concerns about potential conflicts with government policy on education and science, as well as the ethical implications of stem cell research.", "hermes3:3b": "Kelly's Catholic religious views cause scientists' concerns over potential hindrance to scientific research, especially embryo research and stem cell research.", "stablelm-zephyr:3b": "Scientists are concerned that Ruth Kelly's Catholic religious views could hinder vital scientific research. As the new Education Secretary, Ms. Kelly is reported to be \"pro-life\" and has opposed embryo research. Her views are considered important as she is responsible for training future scientists. Professor Nancy Rothwell, vice-president of research at Manchester University, expressed her worry about a potential conflict between higher education policy and government's science policy. Concerns have also been raised by pro-choice organizations regarding Ms. Kelly's stance on sex education policy in schools.", "chatgpt-4o-latest": "Scientists are concerned that Education Secretary Ruth Kelly's Catholic, pro-life stance could hinder scientific research, particularly on stem cells. Professor Nancy Rothwell emphasized the importance of ministers' views in shaping science education. While the Department for Education and Skills declined to comment, it clarified that university research funding decisions were made by independent councils. Experts fear Kelly's position could lead to a conflicted policy similar to the U.S., where religious opposition affects research. Additionally, pro-choice groups worry her views might influence sex education, though Kelly has not detailed her stance, stating her priority is parents' interests in education.", "stablelm2:1.6b": "Religious views of new education secretary Ruth Kelly could hinder scientific research due to her \"pro-life\" stance and opposition to embryo research. While British law permits cloning for stem cell research, Kelly's views may conflict with government policy. Some experts worry about a potentially schizophrenic system in the country if Kelly is against stem cell research, while others argue that her stance won..\n  \nTo recap, here are some essential points:\n\n1) Ruth Kelly, who is Catholic and pro-life, has raised concerns regarding her religious views on scientific research.\n2) As a new education secretary, her views matter as they're responsible for training future scientists. \n3) The Department for Education and Skills would not comment on the issues.\n4) British law permits cloning of human embryos for stem cell research but is opposed for reproductive purposes.\n5) Critics worry that if ministers are against stem cell research, we will end up with a similar situation in the UK.\n6) Concerns have also been raised by pro-choice organizations about how Kelly's views might affect sex education policy in schools.", "granite3.1-dense:2b": "Scientists express concern that Education Secretary Ruth Kelly's Catholic, pro-life views may obstruct scientific research, particularly stem cell research using human embryos for medical advancements. This research is permitted but controversial due to the destruction of embryos. Notable scientists, like Nancy Rothwell and Robin Lovell-Badge, worry that ministerial opposition could lead to a fragmented education system similar to the U.S., where religious groups often oppose stem cell research. They emphasize the importance of training future scientists with aligned policies. Pro-choice advocates also express apprehension about potential impacts on sex education, which includes teaching contraception and abortion. Kelly has stated she aims to prioritize parental involvement in schools but hasn't detailed her stance on these specific issues yet.", "reference": "Medical Research Council Professor Nancy Rothwell said Ms Kelly's views mattered as she was responsible for training future scientists.Ms Kelly has not set out her detailed views on either issue yet, but has said she intends to put parents first in education policy.It was down to the Higher Education Funding Council and the research councils to decide on universities' research allocations.Ms Kelly, who is Catholic, is reported to be \"pro-life\" and has opposed embryo research.Concerns have also been raised by \"pro-choice\" organisations that Ms Kelly's views might affect sex education policy in schools.He said: \"If someone as senior as Ruth Kelly is not going to favour stem cell research we will end up with a similarly schizophrenic system in this country.Professor Rothwell, who is also vice-president of research at Manchester University, told the Times Higher Education Supplement it would worry her \"a great deal\" if ministers were anti-stem cell.Scientists have expressed concerns that new education secretary Ruth Kelly's religious views could hamper vital scientific research.A spokeswoman said: \"It is not news that Ms Kelly is a Catholic but we are not going into any details on this.\"But she added that claims Ms Kelly was in charge of a £1bn university research budget were not true."}