{"raw_text": "Blair pledges unity to Labour MPs\n \n Tony Blair has sought to reassure Labour backbenchers that nothing will stand in the way of the party's bid for a third term in power.\n \n Mr Blair was speaking to MPs amid fresh rumours of a rift with Gordon Brown. A new book says the prime minister went back on a pledge to Mr Brown to stand down before the next general election. The chancellor has said he is focused on winning the poll and is due to join election supremo Alan Milburn for a Labour poster launch this week. Mr Blair told the Parliamentary Labour Party (PLP) on Monday: \"I know from everyone here, in Cabinet and government, nothing is going to get in the way of a unified Labour Party with a unified position and winning the third term people desperately need.\" The prime minister and his chancellor arrived within seconds of each other and seemingly in good spirits at the start of the meeting which lasted around an hour. A new book, Brown's Britain by Sunday Telegraph journalist Robert Peston, says Mr Blair went back on a pledge to make way for Mr Brown after Cabinet allies intervened in June 2004.\n \n It has caused a new wave of concern among Labour MPs gearing up to defend their seats in an election, widely expected to be held in May, and several members are understood to have lined up to express their discontent at the PLP meeting. Health Secretary John Reid earlier warned that Labour members would not easily forgive anybody fuelling damaging speculation. He told BBC News: \"Those who co-operate or inspire these books, in my view, have to know that, whatever the short-term political or personal advantage that they think they might secure, they always do it by damaging the record, the unity and the re-election chances of the Labour Party and the government.\" Mr Blair on Sunday dismissed claims of broken promises, saying: \"I've dealt with this six months ago. I said then you don't do deals over jobs like this - you don't.\"\n \n In a separate BBC interview, Mr Brown said he and the prime minister would not be distracted by \"gossip\". \"It's very important that we all do what we can in a unified way to ensure the election of a Labour government,\" he said.\n \n On Monday, Mr Blair's spokesman said: \"The prime minister is determined that he will get on with the business of government because he believes that what people want.\" Mr Brown says he discussed the election campaign with Mr Blair on Saturday and promised to play his part.\n \n Mr Peston said the pair had \"mutual animosity and contempt\". Mr Blair had decided in November 2003 he would quit because he felt he had lost voters' trust because of the Iraq war.\n \n He had then changed his mind in June 2004, following intervention from Cabinet allies and suspicion that the chancellor was manoeuvring against him. Mr Brown allegedly said he could no longer believe anything Mr Blair told him. Conservative co-chairman Liam Fox likened the two men to \"self-obsessed schoolboys\". Liberal Democrat parliamentary chairman Matthew Taylor said their personal ambition was \"getting in the way of good government\". Ex-Labour leader Neil Kinnock said Mr Blair and Mr Brown could only deal with the media frenzy by continuing to say they would not allow a row to damage Labour or British interests. He told BBC Radio Five Live that Mr Brown would never encourage any kind of insurrection or coup.\n", "llama3.2:1b": "Tony Blair has pledged unity to Labour MPs amid rumors of a rift with Gordon Brown, despite new book claims he broke his pledge to stand down before the next election. Blair said he will get on with government business because people want it, while Brown has promised to play his part in the election campaign. The two leaders had \"mutual animosity and contempt\" according to Robert Peston's book, which suggests their relationship is strained.", "llama3.2:3b": "Tony Blair reassured Labour MPs that nothing will stop the party's bid for a third term, amid rumors of a rift with Gordon Brown and allegations of broken promises. Brown's Britain claims Blair went back on his pledge to step down in favor of the chancellor.", "gemma2:2b": "Tony Blair reassured Labour MPs about unity in their bid for reelection, despite recent reports suggesting a rift with Gordon Brown. Blair addressed MP concerns raised by a new book that alleges a broken promise concerning his resignation. Meanwhile, Brown emphasized his commitment to working towards the election and dismissed rumors of \"gossip\".  Both politicians have reiterated they are focused on winning the upcoming elections for the Labour party and their shared goal of securing another term in power. \n", "qwen2.5:0.5b": "In his address on Monday, Prime Minister Tony Blair pledged unity among Labour MPs and promised to win the third term in government. On Tuesday, Blair's spokesman said he was determined to get on with his business of government because he believes that what people want. However, they had a difference of opinion about an ongoing article in the Sunday Telegraph which claimed that Gordon Brown had broken promises. Blair dismissed claims of broken deals and insisted that \"gossip\" is \"very important.\"", "qwen2.5:1.5b": "Tony Blair reassures Labour MPs about third term plans amid concerns over potential breach of promise and election posturing, with Gordon Brown allegedly trying to distract from gossip.", "qwen2.5:3b": "Tony Blair has reassured Labour backbenchers he will ensure unity for the party's third term in power amid speculation about his relationship with Gordon Brown, who is focused on winning the election. A new book claims Blair went back on a pledge to step down before an expected May general election, causing concern among Labour MPs. Blair dismissed these claims as old news and said he had addressed the issue six months prior. Meanwhile, both leaders emphasize their commitment to unity in government despite personal differences.", "opencoder:1.5b": "Blair pledges unity to Labour MPs\n\nTony Blair has sought reassurance from backbenchers as they seek to secure the government's third term.\n\nMr Blair was speaking with MPs during fresh reports about a potential rift between Gordon Brown and other key figures in the party, including Alan Milburn. The Prime Minister went on: \"I'm certain that whatever happens will be a matter of public trust.\"\n\nA new book by Robert Peston points out that Mr Blair went back on a pledge to Mr Brown due to his presence at the next general election. The chancellor has indicated he's focused on winning the poll and is expected to join election supremo Alan Milburn.\n\nIn the PLP meeting, concerns were raised among Labour MPs. Health Secretary John Reid warned that these members would not easily forgive anybody contributing to damaging speculation. They also expressed their discontent at Mr Blair’s meeting which lasted around an hour.\n\nA new book by Sunday Telegraph journalist Robert Peston notes that Mr Blair went back on a promise after Cabinet allies intervened in June 2004. The Prime Minister and his chancellor, meanwhile, met within seconds of each other, showing good spirits at the start.\n\nIn their separate interviews with Mr Brown, Mr Liam Fox and Liberal Democrat parliamentary chairman Matthew Taylor argue the party's ambition is \"getting in the way of a unified government\" as they both compared Mr Blair and Mr Brown's past behaviour. The ex-Labour leader Neil Kinnock branded Mr Blair and Mr Brown unable to deal with the constant pressure from the media.\n\nLastly, on Monday, Mr Peston said he had \"mutual animosity and contempt.\" He was angry about the Iraq war that preceded him, as was also expressed in a BBC interview. Following this, Mr Blair announced he would quit because he felt he had lost voters' trust because of the conflict.\n", "smollm:1.7b": "The summary is:\n\n* Blair pledged unity to Labour MPs in an effort to reassure them and prevent a rift between the party and Gordon Brown from damaging their chances at re-election.\n* The prime minister sought to reassure Labour backbenchers that nothing would stand in the way of his bid for a third term in power, but he also acknowledged that Mr Brown's actions had caused concern among Labour MPs.\n* A new book by Robert Peston suggests that Blair went back on a pledge to make way for Mr Brown after Mr Brown intervened in June 2004 and broke off the Labour party's unity talks with him. This has caused a new wave of concern among Labour MPs, who are said to be lining up to express their discontent at the PLP meeting.\n* The prime minister and his chancellor have been seen as having mutual animosity and contempt towards each other, which may have contributed to the rift between them.\n* Mr Blair's spokeswoman said that the two men had \"mutual animosity and contempt\" towards each other.\n* Mr Brown allegedly said he could no longer believe anything Mr Blair told him because of the Iraq war, but this was not a new development in their relationship.\n* The prime minister and his chancellor have been seen as having personal ambition that may be getting in the way of good government.\n* Liberal Democrat leader Matthew Taylor said that Mr Blair and Mr Brown could only deal with the media frenzy by continuing to say they would not allow a row to damage Labour or British interests. He told BBC Radio Five Live that Mr Brown would never encourage any kind of insurrection or coup.\n* Former Labour leader Neil Kinnock said that Mr Blair and Mr Brown could only deal with the media frenzy by continuing to say they would not allow a row to damage Labour or British interests. He told BBC Radio Five Live that Mr Brown would never encourage any kind of insurrection or coup.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Tony Blair's speech to the Labour MPs. Let me read through it carefully.\n\nSo, the main points are: Tony Blair is pledge unity for Labour, reminding them nothing will stop a third term in power. He mentions Prime Minister Gordon Brown is back on a previous pledge, which was to stand down before the next election. There was a book suggesting he'll back Brown again after six years or so. The meeting between Blair and Brown took an hour, and they were approaching each other.\n\nSome sources say they were in good spirits at first. They've caused some concern among Labour MPs because they're lining up to protest. Health Secretary John Reid is warning that members won't easily forgive anyone, just because of the books they write. He believes damaging the Labour Party or government chances for election will cause problems.\n\n Blair dismissed claims of broken promises by saying he's been dealing with jobs since six months ago and not planning deals with companies in jobs-related issues. Brown discussed the campaign with Blair on Saturday and promised to play his role. They have mutual animosity, similar to schoolboys, but Blair said they could only handle the media's chaos.\n\nBlair decided to quit because of the Iraq war in 2003, changed his mind in June 2004 after intervention from allies and suspected against him. He's now leading into another election with Alan Milburn.\n\nI need to condense this into a concise summary without any extra information. Focus on the main events: Blair's speech, mention of Brown back on an old pledge, the meeting details, the books' impact, personal attitudes towards each other, and the concerns about their actions causing problems.\n</think>\n\nTony Blair addressed Labour MPs, promising unity for their third term in power, while reminding them that nothing will prevent a united Labour Government. His prime ministerian brother Gordon Brown is back on a previous pledge to stand down before the next general election, though sources suggest he might backtrack after six years. The meeting was brief but approached with positivity. However, members are lining up to protest, fearing damaging Labour or British interests. Health Secretary John Reid warns that accountability might fail, while Mr. Blair promised to handle the media's chaos. Blair initially lost trust in Brown due to the Iraq war and changed his mind after political pressure from allies, signaling a potential clash of interests with Brown.", "tinyllama:1.1b": "The Prime Minister, Tony Blair, has expressed his confidence that the Labour Party will win the upcoming General Election with a unified position and without the need for major changes to their policies or election strategy, despite being confronted with damaging allegations from books titled \"Brown's Britain\" by Sunday Telegram journalist Robert Peston. In a meeting with Labour MPs shortly before Parliament is due to launch its election campaign, Blair reassured them that nothing would stand in the way of a unified Labour Party and victory in May. Despite these assurances, Labour MPs are understandably worried about the damage caused by speculation that the party will be damaged by allegations that Blair changed his mind regarding quitting the party after losing votes' trust because of the Iraq war. Conservative leader Liam Fox called the Prime Minister and Liberal Democrat leader Matthew Taylor \"self-obsessed schoolboy\" for their personal ambitions, which were \"getting in the way of good government.\"", "tinydolphin:1.1b": " Blair pledges unity to Labour MPs, urging them to \"re-elect the government with a unified position\" as they prepare for an expected electoral challenge from the Conservatives and the Liberal Democrats. The prime minister emphasizes his commitment to securing a third term in power, which is a central tenet of their Labour Party's campaign. In response to rumors about a rift between Mr. Brown and Mr. Blair, the prime minister reassures that they are both focused on winning the election and being \"united\" for the job at hand. He calls on all members to prioritize securing Labour's victory and avoid causing any damage to their reputation or re-election chances.", "phi:2.7b": " Tony Blair reassured Labour MPs that nothing will get in the way of their bid for a third term in power, despite recent rumours of a rift with Gordon Brown. Mr Blair has denied breaking his pledge to make way for Mr Brown and is focused on winning the election. However, this news has caused concern among Labour MPs who are gearing up to defend their seats in an upcoming general election. Health Secretary John Reid has warned that those fuelling damaging speculation will face consequences. The book \"Brown's Britain\" by Sunday Telegraph journalist Robert Peston suggests Mr Blair went back on his promise after intervention from Cabinet allies, causing a new wave of concern among Labour members. Despite this, Mr Brown says he and Mr Blair are not distracted by gossip. Mr Blair has reiterated that he wants to focus on the election campaign and believes it's important for people to have faith in their government.\n", "orca-mini:3b": " Blair pledges unity to Labour MPs, vows to win third term in power.", "hermes3:3b": "Tony Blair tries to assure Labour MPs of unified support for third term, despite rumors of rift with Gordon Brown over broken pledge to make way for chancellor in the future.", "stablelm-zephyr:3b": "Tony Blair sought to reassure Labour backbenchers that a unified party would win the crucial third term they desperately need, amidst fresh rumors of a rift with Gordon Brown. Blair addressed the concerns within the Parliamentary Labour Party (PLP), stating that nothing would stand in the way of their goal for power. The fresh controversy stems from a new book, \"Brown's Britain\" by Robert Peston, suggesting Blair went back on a pledge to make way for Brown after Cabinet allies intervened in June 2004. Both Blair and Brown appeared at the PLP meeting in good spirits, with Brown emphasizing that they would not be distracted by gossip as they focused on winning the election. Conservative co-chairman Liam Fox likened their rivalry to \"self-obsessed schoolboys,\" while ex-Labour leader Neil Kinnock emphasized that both men must maintain a united front for the sake of party interests and British national goals.", "chatgpt-4o-latest": "Tony Blair reassured Labour MPs that party unity would not be compromised in their bid for a third term, amid fresh speculation of a rift with Gordon Brown. A new book claims Blair reneged on a promise to step down for Brown, causing concern among MPs. Blair dismissed the claims, emphasizing party unity, while Brown insisted they would not be distracted by \"gossip.\" Health Secretary John Reid warned against fueling damaging speculation. Reports suggest Blair initially planned to resign in 2003 but changed his mind in 2004 due to Cabinet pressure and suspicions about Brown's intentions. Opposition figures criticized their rivalry, while former Labour leader Neil Kinnock urged them to focus on party and national interests.", "stablelm2:1.6b": "Prime Minister Tony Blair assures Labour MPs that nothing will hinder their third term bid, despite rumors of rift with Gordon Brown over the pledge to stand down before the next election. A new book claims Brown went back on a pledge made by Blair. Health Secretary John Reid warns that damaging speculation could damage the Labour Party's record and unity for an upcoming election.", "granite3.1-dense:2b": "Tony Blair addressed Labour MPs, reassuring them that no internal issues will hinder the party's pursuit of a third term in power. This statement comes amid rumors of a potential rift between Blair and Chancellor Gordon Brown, as reported in Robert Peston's book \"Brown's Britain.\" The book claims that Blair reneged on his pledge to step down before the next general election due to intervention from Cabinet allies. Despite these tensions, both Blair and Brown expressed unity during a recent PLP meeting, with Brown emphasizing the importance of a unified campaign. Health Secretary John Reid warned against undermining the party's chances through such speculation. In response to the allegations, Blair dismissed claims of broken promises, stating he had addressed this six months ago and that personal deals should not influence political appointments. Brown, in a separate BBC interview, vowed that Labour would remain united for the election. Ex-Labour leader Neil Kinnock noted that Blair and Brown must manage media speculation without fostering internal strife.", "reference": "Mr Brown allegedly said he could no longer believe anything Mr Blair told him.Ex-Labour leader Neil Kinnock said Mr Blair and Mr Brown could only deal with the media frenzy by continuing to say they would not allow a row to damage Labour or British interests.Mr Brown says he discussed the election campaign with Mr Blair on Saturday and promised to play his part.In a separate BBC interview, Mr Brown said he and the prime minister would not be distracted by \"gossip\".A new book, Brown's Britain by Sunday Telegraph journalist Robert Peston, says Mr Blair went back on a pledge to make way for Mr Brown after Cabinet allies intervened in June 2004.Mr Blair told the Parliamentary Labour Party (PLP) on Monday: \"I know from everyone here, in Cabinet and government, nothing is going to get in the way of a unified Labour Party with a unified position and winning the third term people desperately need.\"A new book says the prime minister went back on a pledge to Mr Brown to stand down before the next general election.\"It's very important that we all do what we can in a unified way to ensure the election of a Labour government,\" he said.On Monday, Mr Blair's spokesman said: \"The prime minister is determined that he will get on with the business of government because he believes that what people want.\"Mr Blair was speaking to MPs amid fresh rumours of a rift with Gordon Brown."}