{"raw_text": "Blair and Brown criticised by MPs\n \n Labour MPs have angrily criticised Tony Blair and Gordon Brown amid renewed reports of a rift between the two men.\n \n A meeting of the Parliamentary Labour Party saw a succession of normally loyal members warn that feuding could jeopardise Labour's election hopes. The PM insisted nothing would derail Labour's campaign, despite a new book saying he has upset his chancellor by backing out of a pledge to stand aside. Mr Brown will again be in the public eye at the party's new poster launch. In what the party had hoped would be perceived as a show of unity, he is due to line up alongside Alan Milburn - the man controversially appointed as the party's election supremo - and deputy leader John Prescott for the event in London on Tuesday. Relations between Mr Brown and Mr Milburn are widely reported to be cool ever since Mr Blair brought the latter back into the Cabinet to run Labour's election campaign, a role successfully carried out by Mr Brown in both 1997 and 2001.\n \n Mr Blair told the Parliamentary Labour Party on Monday: \"I know from everyone here, in Cabinet and government, nothing is going to get in the way of a unified Labour Party with a unified position and winning the third term people desperately need.\"\n \n The prime minister and his chancellor arrived within seconds of each other for the meeting of the PLP and were seemingly in good spirits as it started. New speculation about the state of their relationship was sparked by claims in Brown's Britain, by Sunday Telegraph journalist Robert Peston, which suggested Mr Blair went back on a pledge to make way for Mr Brown. Labour's Paul Flynn said Mr Blair and Mr Brown had a \"scorching\" from MPs adding: \"It was a Parliamentary Labour Party meeting like no other.\"\n \n Backbencher Stephen Pound said some MPs had threatend to expose those fuelling the reports if Mr Blair and Mr Brown did not \"stop this nonsense, this poisonous briefing\". Lord Campbell-Savours, a former MP, challenged Mr Brown to deny reports that he had told the prime minister he did not believe anything he said. Mr Prescott said MPs were entitled to complain about discipline after reading recent press reports.\n \n \"They told us very clearly, it was the troops telling the leaders: get in line,\" he told BBC Radio 4's Today on Tuesday. Mr Prescott said there were occasional disagreements in any government. But he argued Mr Blair and Mr Brown could work successfully together and had produced a strong economy and better public services.\n \n The new book claims Mr Prescott hosted a dinner in November 2003 where the prime minister told Mr Brown he would stand down before the next election because he had lost trust over the Iraq war. He had then changed his mind in June 2004, following intervention from Cabinet allies and suspicion that the chancellor was manoeuvring against him, writes Mr Peston. Mr Prescott said there was a dinner but the discussions were confidential. \"Of course as a waiter for 10 years I have a professional ability here,\" he joked. Mr Blair has insisted he has done no deals over the premiership while Mr Brown says he will not let \"gossip\" distract him from helping a unified election campaign. The Conservatives say the two men are behaving like squabbling schoolboys and the Liberal Democrats claim personal ambition is obstructing good government.\n", "llama3.2:1b": "Labour MPs criticized Tony Blair and Gordon Brown amid reports of a rift between them. A meeting of the Parliamentary Labour Party was tense, with some members warning that feuding could jeopardize Labour's election hopes.\n\nBrown will appear in a party event in London on Tuesday, alongside Alan Milburn, his election supremo. Relations between Brown and Milburn are reported to be cool since Blair brought Milburn back into Cabinet.\n\nBlair said he knew nothing would get in the way of Labour's campaign, despite claims that he backed out of a pledge to stand aside for Brown. \n\nThe Prime Minister and Chancellor arrived quickly at each other during the meeting, with some MPs warning that the two men should \"get in line\".", "llama3.2:3b": "Labour MPs criticise Blair and Brown amid reports of a rift between them, with some warning that feuding could jeopardise Labour's election hopes. A new book claims Blair backed out of a pledge to stand aside for Brown, sparking anger from the chancellor. Brown will launch a poster campaign alongside Milburn despite strained relations with him since their appointment in 2005.", "gemma2:2b": "Labour MPs voiced concerns about the relationship between Tony Blair and Gordon Brown, which they believe may damage Labour's chances in the upcoming election.  A meeting of the Parliamentary Labour Party saw MPs expressing dissatisfaction and demanding Mr. Blair and Mr. Brown stop fueling tensions. The two men have been publicly facing accusations from a new book regarding their interactions leading to speculation about a rift in their relationship. \n", "qwen2.5:0.5b": "Labour MPs criticized Tony Blair and Gordon Brown amid renewed reports of a rift, with a meeting between the Parliamentary Labour Party setting up for their new poster launch in London on Tuesday. Blair insisted no changes would derail Labour's campaign. The PM insisted nothing could jeopardise Labour's election hopes despite a book saying he had upset his chancellor by backing out of a pledge to stand aside. Brown will again be in the public eye at the party's poster launch, while PMs Paul Flynn and Alan Milburn are due to line up alongside Mr Brown and Mr Prescott for the event. The new book claims Blair and Brown were involved in an affair with MPs back in 2003, but Labour has claimed they did not have such a relationship.", "qwen2.5:1.5b": "Labour MPs criticized Tony Blair and Gordon Brown over reports of political rift, with PM insisting unity would help secure their third-term hopes despite new book claims he backed out of election pledge to stand aside. Brown will lead party poster launch alongside Milburn. Former MP challenges Brown's credibility regarding alleged dinner discussing prime minister stepping down.", "qwen2.5:3b": "Labour MPs have criticized Tony Blair and Gordon Brown amid reports of a rift between them, despite the PM insisting nothing will derail Labour's campaign. A book suggests that Mr Blair went back on his pledge to make way for Mr Brown. The PLP meeting saw some MPs warn about potential fallout, while others defended the leaders' unity. Mr Brown is set to appear with Alan Milburn at a poster launch in London, despite strained relations between them since Mr Blair brought Mr Milburn into the Cabinet for the election campaign. MPs have called on Mr Blair and Mr Brown to stop reports of feuding. Mr Prescott insists disagreements are normal in any government, arguing that Mr Blair and Mr Brown can work together successfully.", "opencoder:1.5b": "Blair and Brown have criticized the Labour Party in public, with Tony Blair criticising Gordon Brown. After a renewed report of a rift between them, the Prime Minister and the chancellor prepare for an election campaign that would be unpopular if it goes poorly.\n\nDuring a meeting at the government house, warning that feuding could potentially jeopardise future elections, the PM insists nothing is done. The PM continues to argue about a new book that claims he has upset his chancellor by backing out of a pledge to stand aside, even though this was made clear later in the campaign.\n\nMr Blair says his behaviour on the PLP has been nothing compared to what has happened before with Mr Brown. He says it's a time for political unity and healthy government.\n\nThe prime minister and chancellor are now at their set points and continue to make promises that have yet to be met, which is a testament to Mr Brown's calm and determination he has led in the election campaign.\n\nIn discussions about state-of-the-art relations between Mr Brown and Mr Milburn, Mr Blair insists on a clear, uncontested show of unity. Moreover, Mr Prescott agrees with this assertion that it's a legitimate position for both sides to hold after reading recent press reports from Britain.\n\nThe PLP continues to raise doubts, while critics challenge the Prime Minister's claims about making way for Mr Brown in November 2003, where he said he would stand down before the next election. But they also argue that Mr Prescott is a waiter for decades and has a professional ability here.\n\nIt remains to be seen what insights or interpretations Mr Blair and Mr Brown might have on the state of their relationship and how they can work together in an increasingly polarised world. It's a time for good government, not just a political one.\n", "smollm:1.7b": "The summary should be:\n\nTony Blair and Gordon Brown have been criticized by Labour MPs, who said they had broken a promise to stand aside in the election campaign. The PM insisted nothing would derail Labour's election hopes, despite a new book saying he has upset his chancellor by backing out of a pledge to stand aside. Mr Brown will again be in the public eye at the party's new poster launch on Tuesday. In what the party had hoped was perceived as a show of unity, he is due to line up alongside Alan Milburn - the man controversially appointed as the party's election supremo - and deputy leader John Prescott for the event.\n\nThe PM told the Parliamentary Labour Party meeting that he knew from everyone there, in Cabinet and government, nothing was going to get in the way of a unified Labour Party with a unified position and winning the third term people desperately needed. Mr Blair and Mr Brown had a \"scorching\" from MPs adding: \"It was a Parliamentary Labour Party meeting like no other.\"\n\nBackbencher Stephen Pound challenged Mr Blair and Mr Brown to deny reports that they had told the prime minister he did not believe anything he said. Mr Prescott said MPs were entitled to complain about discipline after reading recent press reports. The new book claims Mr Prescott hosted a dinner in November 2003 where the prime minister told him he would stand down before the next election because he had lost trust over the Iraq war. He had then changed his mind in June 2004, following intervention from Cabinet allies and suspicion that the chancellor was manoeuvring against him, writes Mr Peston.\n\nMr Prescott said there was a dinner but the discussions were confidential. \"Of course as a waiter for 10 years I have a professional ability here,\" he joked. Mr Blair has insisted he has done no deals over the premiership while Mr Brown says he will not let \"gossip\" distract him from helping a unified election campaign. The Lib Dems say the two men are behaving like squabbling schoolboys and the Liberal Democrats claim personal ambition is obstructing good government.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Blair and Brown as Labour MPs. Let me read through it again to make sure I understand the key points.\n\nFirst, the main issue is between Tony Blair and Gordon Brown, two leading Labour MPs. They have been disagreeing, which has caused worries among the Parliamentary Labour Party members. The meeting had a succession of loyal members warning that their conflict might throw off Labour's election prospects. The PM said he wasn't worried about this move, even though a new book suggested he back out of a pledge to stand aside.\n\nOn Tuesday, Brown is up in the news for the new poster launch because he's lining up with Milburn and Prescott. Relations between Brown and Milburn have been good since Blair brought Milburn into the cabinet again. This was successful both times, 1997 and 2001, leading to better government.\n\nBlair told the PLP that a united Labour Party is crucial for winning the third term, emphasizing unity and getting the votes he needs. The new book adds more context about Blair's challenges with the prime minister and his support for Brown over the premiership. There were some speculations about their relationship before, including in Britain.\n\nAlso mentioned are mentions of other MPs like Stephen Pound and Lord Campbell-Savours, who challengeBrown on reports that Blair didn't believe what Brown said. They have concerns about disciplinary issues after reading recent press reports. Mr. Prescott suggested he could complain about discipline when reading these reports. He also brings up that there were occasional disagreements in any government.\n\nIn the new book, it's mentioned that Blair's prime minister tried hosting a dinner in 2003 where he told Brown he'd stand down before next election because of his loss in Iraq. He later changed his mind after Cabinet allies and evidence suggesting the Chancellor was against him started happening. So he said there was such a dinner, but discussions were confidential. It also says Blair insists he didn't do any deals over the premiership, while Brown says he won't let gossip distract him.\n\nThe Conservatives and Liberal Democrats seem to think these two are like schoolboys or personal issues, suggesting they're misbehaving in government work.\n\nSo putting this all together, the summary needs to include the main conflict between Blair and Brown, the new posters for their event, the context around their relationship since Blair's return into the cabinet, Blair's statement about unity, the book's context with Blair facing challenges, mentions of other MPs challenging Brown, and some details about a potential dinner debate in 2003.\n\nI should make sure to capture all these points without getting too detailed on every little thing. The summary needs to be concise, focusing only on the key ideas while preserving the important details.\n</think>\n\nThe key points of the text are:\n\n1. **Conflict Between Blair and Brown**: Two leading Labour MPs, Tony Blair and Gordon Brown, have been disagreeing since renewed reports emerged, which has created concerns for the Parliamentary Labour Party.\n\n2. **New Poster Launch**: Mr. Brown is set to participate in a new event where he will line up alongside Alan Milburn and deputy leader John Prescott for a poster launch on Tuesday. Relations between Brown and Milburn are reported as cool following Blair's return into the cabinet in 1997 and 2001.\n\n3. **PM Statement**: Mr. Blair emphasized in a meeting that unity is crucial for Labour's election campaign, advocating for a united position to win the third term.\n\n4. **Book Context**: A new book suggests that Mr. Blair faced challenges with his prime minister, including a dinner where he told Brown he'd stand down before the next election due to losing trust over Iraq in 2003. There was later confusion after intervention from allies, and discussions were confidential.\n\n5. **Other Influences**: The text mentions other figures like Stephen Pound and Lord Campbell-Savours challenging Mr. Brown on reports of Blair's lack of belief in his statements, who have concerns about disciplinary issues following recent press reports.\n\n6. **Group Dynamics**: The Conservative and Liberal Democrats appear to view these two as misbehaving or personal issues in government work, suggesting they may be lacking in good governance.", "tinyllama:1.1b": "A meeting of the Parliamentary Labour Party (PLP) saw a succession of MPs warn that Tony Blair and Gordon Brown are upsetting Labour's election prospects, with some threatening to expose those who fuelled controversial reports about the former prime minister's alleged plans for the leadership. The PM is due to attend the party's new poster launch alongside Alan Milburn, a man he appointed as party chief in 2007, and John Prescott, the deputy leader. The latest book claims that Blair hosted a dinner at which Brown changed his mind on standing down before the next election, but the PM has denied reports of discord with his chancellor. A meeting between Labour MPs also saw speculation about the state of their relationship sparked by accusations in Brown's Britain book that Blair may have gone back on a promise made to make way for Brown as party leader, and threatens to expose those fueling the claims if the PM and his chancellor do not \"stop this non-sensical briefing\". The Lib Dems claim personal ambition and squabbling schoolboy behavior are holding up good government.", "tinydolphin:1.1b": " Blair and Brown criticized by MPs, as they continue to distance themselves from each other amid renewed scrutiny of their relationship. This comes as new reports indicate Tony Blair's decision to step down from the position of Labour leader in favor of his deputy John Prescott.", "phi:2.7b": " Labour MPs have criticised Tony Blair and Gordon Brown amid reports of a rift between them. Relations between the two were reportedly cool after Mr Brown was brought back into Cabinet to run Labour' s election campaign, but he has repeatedly denied any personal deals over the premiership. MPs are concerned that feuding could jeopardise Labour's election hopes.\n", "orca-mini:3b": " Blair and Brown criticized by MPs as Labour's unity is threatened by reports of rift between the two leaders.", "hermes3:3b": "Tony Blair and Gordon Brown criticised by MPs for potential rift, despite PM's insistence that nothing will derail Labour's campaign.", "stablelm-zephyr:3b": "Labour MPs have criticized Tony Blair and Gordon Brown amid reports of a rift between them. A meeting of the Parliamentary Labour Party saw several loyal members warn that feuding could jeopardize Labour's election hopes. Despite this, the PM insisted nothing would derail their campaign. The prime minister and chancellor appeared in good spirits during the meeting of the PLP, which sparked new speculation about their relationship. Backbencher Stephen Pound said some MPs threatened to expose those fueling the rumors if Blair and Brown did not \"stop this nonsense, this poisonous briefing.\"", "chatgpt-4o-latest": "Labour MPs have criticised Tony Blair and Gordon Brown over reports of a rift between them, warning that their feud could harm Labour’s election chances. A new book claims Blair reneged on a pledge to step aside for Brown, fueling speculation about tensions. Despite this, Blair insisted Labour remains unified. Brown appeared alongside Alan Milburn and John Prescott in a show of unity, though tensions with Milburn persist. MPs expressed frustration, with some threatening to expose those fueling divisions. Prescott acknowledged disagreements but defended Blair and Brown’s record. The Conservatives and Liberal Democrats criticised the infighting, calling it damaging to governance.", "stablelm2:1.6b": "Labour MPs have criticized Tony Blair and Gordon Brown amid reports of a rift between them, potentially jeopardizing Labour's election chances. A meeting of the Parliamentary Labour Party saw members warn that feuding could derail Labour's campaign. The PM insisted Labour would go ahead, despite a new book suggesting he upset his chancellor by backing out of a pledge to stand aside. Brown will also be in the public eye at a party event due to come up next week. Alan Milburn is reportedly not getting on well with Brown and was appointed as the party's election supremo. Relations between Mr Brown and Mr Milburn have been reported to be cool since Milburn took on the role of running Labour's election campaign, successfully carried out by Brown in both 2005 and 2..\nThe PM reassured the Parliamentary Labour Party: \"I know from everyone here, in Cabinet and government, nothing is going to get in the way of a unified Labour Party with a unified position and winning the third term people desperately need.\" New speculation about the state of their relationship arose following claims in Brown's Britain that Mr. Blair went back on a pledge to make way for Mr. Brown. Backbencher Stephen Pound demanded that if Blair and Brown did not stop these reports, they would expose those fueling them. The Conservatives and Liberal Democrats are accusing the two men of behaving like squabbling schoolboys and obstructing good government, respectively.", "granite3.1-dense:2b": "Labour MPs have criticized Tony Blair and Gordon Brown during a Parliamentary Labour Party meeting, expressing concerns that their feuding could harm the party's election prospects. A new book by Sunday Telegraph journalist Robert Peston suggests Blair reneged on his promise to step aside before the next election due to trust issues over the Iraq war. This has sparked tension between Blair and Brown, with some MPs threatening to expose sources of these reports if the issue isn't addressed. Despite this, both Blair and Brown maintain that their disagreements won't hinder Labour's campaign efforts. The party plans a joint event for its new poster launch in London, with Brown expected to appear alongside other key figures like Alan Milburn and John Prescott. Critics, including Conservative Party members, portray Blair and Brown as engaging in petty behavior that impedes effective governance.", "reference": "Labour's Paul Flynn said Mr Blair and Mr Brown had a \"scorching\" from MPs adding: \"It was a Parliamentary Labour Party meeting like no other.\"Relations between Mr Brown and Mr Milburn are widely reported to be cool ever since Mr Blair brought the latter back into the Cabinet to run Labour's election campaign, a role successfully carried out by Mr Brown in both 1997 and 2001.The new book claims Mr Prescott hosted a dinner in November 2003 where the prime minister told Mr Brown he would stand down before the next election because he had lost trust over the Iraq war.Backbencher Stephen Pound said some MPs had threatend to expose those fuelling the reports if Mr Blair and Mr Brown did not \"stop this nonsense, this poisonous briefing\".Mr Blair has insisted he has done no deals over the premiership while Mr Brown says he will not let \"gossip\" distract him from helping a unified election campaign.But he argued Mr Blair and Mr Brown could work successfully together and had produced a strong economy and better public services.New speculation about the state of their relationship was sparked by claims in Brown's Britain, by Sunday Telegraph journalist Robert Peston, which suggested Mr Blair went back on a pledge to make way for Mr Brown.Mr Prescott said there was a dinner but the discussions were confidential.Mr Prescott said there were occasional disagreements in any government."}