{"raw_text": "Howard taunts Blair over splits\n \n Tony Blair's feud with Gordon Brown is damaging the way the UK is governed, Tory leader Michael Howard has claimed in a heated prime minister's questions.\n \n Mr Howard asked: \"How can they fight crime when they are fighting each other?\" That question was later unveiled as the headline for new Tory campaign posters. But Mr Blair dismissed the talk of splits and said people's priorities at the next elections would be on the economic successes achieved by Labour. \"He can stick up whatever he likes on billboards about something in a book but what the public will concentrate on are the low mortgages, low inflation, low unemployment that we delivered and that he failed to,\" he said. The chancellor is currently on a high-profile tour of Africa to highlight new anti-poverty plans. But before doing so, he insisted he still trusted Mr Blair, despite claims to the contrary in a new book.\n \n Brown's Britain, by Robert Peston, says there is mutual animosity between the two men. It claims Mr Blair said in November 2003 he would stand down as prime minister before the next election. But he went back on his pledge after support from Cabinet allies and suspicion that Mr Brown was manoeuvring against him, it says.\n \n Mr Peston's book claimed that Mr Brown told Mr Blair: \"There is nothing you could ever say to me now that I could ever believe.\" Mr Blair directly denied that quote on Wednesday. He again insisted there could be no deals about the premiership but twice declined directly to say whether or not he had offered to quit.\n \n The Tory leader countered that such agreements had been struck twice at dinners with the chancellor. He declared: \"He is the deals on meals prime minister. No wonder the chancellor is not a happy eater.\" He continued: \"How can there be discipline in schools when there is no discipline in government, how can they clean up our hospitals when they don't clean up their act?\" Mr Blair said he would not respond to \"tittle tattle in books\" and promised to hail Labour's record on the economy, waiting lists and law and order \"from now until polling day\". Later at their poster launch Tory co-chairman Liam Fox said his party would exploit opportunities to show how \"juvenile\" the prime minister and chancellor were.\n \n Labour staged a show of unity at its own poster launch on Tuesday, where Mr Brown was joined by Alan Milburn, who Mr Blair controversially put in charge of election planning in place of the chancellor. But Liberal Democrat leader Charles Kennedy told BBC News: \"The government is clearly split at the top. This kind of cosmetic exercise does not persuade anybody.\" Later this week Mr Blair is expected to outline the direction of his party's next election manifesto. The prime minister and chancellor faced backbench discontent at Monday's meeting of the Parliamentary Labour Party over claims made Mr Peston's book.\n", "llama3.2:1b": "Howard taunts Blair over splits with Tony Blair criticizing Howard for fighting crime while also fighting each other, while Blair dismisses the idea of splits as a priority concern. The two have differing views on how to address issues like poverty and crime. \n\nBrown's Britain claims that there is mutual animosity between the two men, and Robert Peston's book says that Brown threatened to stand down from office after their initial meeting in 2003. However, Blair denies these quotes.", "llama3.2:3b": "Michael Howard claims that Tony Blair's feud with Gordon Brown is damaging UK governance, calling them \"unfit\" to fight crime together. Blair denies the allegations in a new book, saying he trusts Brown despite their animosity. The two leaders exchanged jabs during Prime Minister's Questions and a poster launch, with Howard accusing Blair of lacking discipline.", "gemma2:2b": "Howard accuses Blair and Brown of fighting each other, harming governance.  Blair dismisses talk of splits, focusing on economic achievements.  Brown denies animosity in a new book, while Blair denies any offers to resign.  The Tories claim deals between Blair and Brown happened at dinners, calling for public discipline and contrast with their unity efforts.  \n \nKennedy sees the government's unity effort as superficial. The prime minister will soon outline his party’s next manifesto. \n", "qwen2.5:0.5b": "Tory leader Michael Howard accuses Gordon Brown of being too close to Blair in a prime ministers' questions session. Blair denies any role in splits, but says he is focusing on winning over voters by delivering low mortgage rates and high unemployment. The Tory leader now plans a poster launch for Labour's manifesto.", "qwen2.5:1.5b": "Tony Blair faces internal strife with Gordon Brown, leading to political tensions that undermine government effectiveness and unity. Tories accuse Labor of mutual animosity; Blair denies such allegations. Blair emphasizes focus on economic achievements while Brown campaigns abroad for poverty reduction. Tories express disapproval over alleged agreements between Blair and Brown during meetings.", "qwen2.5:3b": "Tory leader Michael Howard accused Tony Blair and Gordon Brown of damaging UK governance by fighting among themselves, with Howard citing new Tory campaign posters questioning their ability to tackle crime. Despite this criticism, Blair dismissed suggestions of a split between them, highlighting Labour’s economic achievements like low mortgage rates, inflation, unemployment, and improved law enforcement records. Robert Peston's book claimed that in 2003, Blair had promised to resign before the next election but later changed his mind due to support from Cabinet allies and suspicion about Brown's intentions. Brown denied the quote, while Blair insisted he hadn't offered any deal for leadership. Howard further criticized their discord by claiming they lacked discipline, leading Fox of the Conservative Party to suggest exploiting this as an opportunity. Labor staged a show of unity but Kennedy from the Liberal Democrats maintained that the party was internally divided. Blair is set to outline his party's election manifesto shortly.", "opencoder:1.5b": "\"The rise of anti-competition legislation in schools, and its impact on employment and unemployment rates, have led to a growing concern about the potential misuse of public funds for illicit schemes. It has also raised concerns about the government's ability to effectively regulate and control foreign investment, which is becoming increasingly apparent with the development of the National Debt.\" - Mr Peston\n", "smollm:1.7b": "The summary should be:\n\nTony Blair's feud with Gordon Brown is damaging the way the UK is governed, Tory leader Michael Howard has claimed in a heated prime minister's questions. Tony Blair accused Gordon Brown of fighting each other and said his party would concentrate on economic successes achieved by Labour before the next election. The chancellor is currently on a high-profile tour of Africa to highlight new anti-poverty plans but before doing so, he insisted he still trusted Mr Blair, despite claims to the contrary in a new book.\n\nThe key points are:\n\n1. Tony Blair's feud with Gordon Brown is damaging the way the UK is governed.\n2. Tory leader Michael Howard has claimed in a heated prime minister's questions that there is mutual animosity between the two men.\n3. Mr Howard denied that quote on Wednesday but he again insisted there could be no deals about the premiership but twice declined directly to say whether or not he had offered to quit.\n4. The Tory leader countered that such agreements had been struck twice at dinners with the chancellor.\n5. Mr Blair said he would not respond to \"tittle tattle in books\" and promised to hail Labour's record on the economy, waiting lists and law and order from now until polling day.\n6. Later at their poster launch, Tony Blair was joined by Alan Milburn who Mr Blair put in charge of election planning in place of the chancellor. But Liberal Democrat leader Charles Kennedy told BBC News: \"The government is clearly split at the top.\"", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text as concisely as possible while preserving key ideas and details. Let me start by reading through the entire query carefully.\n\nThe first paragraph introduces a conflict between Tony Blair and Gordon Brown in their relationship with Michael Howard, the Tory leader. This is affecting UK governance. Then, Mr. Howard asks a question about crime fighting when fighting each other, which gets covered as the headline for campaign posters. However, Blair dismisses this talk, focusing on economic successes from Labour.\n\nMr. Blair mentions a tour of Africa highlighting anti-poverty plans but still trusting Blair despite claims in a book. Brown's Britain by Robert Peston notes mutual animosity between them, claiming Blair would have stood down before the next election if he were to go back on his pledge after support from allies and suspicion. He told Blair that there was nothing he could say now that he could believe.\n\nMr. Peston's book contradicted Blair's claim of declining to believe in Blair's previous statements, while Blair deny that quote. Mr. Blair then counters by saying deals are struck twice at dinners with the chancellor. He claims discipline issues don't exist in schools without government discipline. But Blair insists no deals will be offered and will not respond to \"tittle tattle in books,\" promising economic policies for polling day.\n\nLater, Labour united on their poster launch, featuring Alan Milburn as election planning head despite Blair's controversial role. Kennedy on BBC News says the top leadership is split, and this doesn't sway anyone. Then, Blair talks about his manifesto direction and has Monday's meeting where they back out of backbench support.\n\nSo, to summarize the key points: The conflict between Blair and Brown over their relationship with Howard affects UK governance. Blair dismisses claims of splits, focusing on economic achievements from Labour. The tour of Africa for policies shows Blair still trusting Blair but not fully supporting his previous statements. The book by Peston challenges Blair's belief in Blair's past policies. In a united launch at the next election, Brown is part of Labour despite Blair's controversial role.\n\nNow, I need to create a summary that includes these elements without adding explanations or formatting.\n</think>\n\nBlair and Brown are in conflict over their relationship with Howard, affecting UK governance.Howard questioned if crime could be fought while fighting each other, which drew attention for campaign posters. However, Blair dismissed the notion of splits, focusing on Labour's economic successes. The Blair-tuned tour of Africa highlights his support for anti-poverty plans but still trusts Blair despite claims of not fully believing in his past policies. In a book, Brown claims Blair could have stood down if he returned from support from allies, though Blair denies this. Blair counters that deals were struck twice at dinners with the chancellor and criticizes the political inconsistency in leadership. Labour united on their poster launch, featuring Alan Milburn as election planning head despite Blair's controversial role.", "tinyllama:1.1b": "The following text summarizes the main points from a news article in full:\n\nHoward tauntss Blair over splitts (Headline)\nTony Blair's feud with Gordon Brown damaging the way the UK is governed, Prime Minister's Questions leader Michael Howard has claimed. In a new Tory campaign poster, which he later admitted would be used in upcoming elections, he said people priorities at the next elections will be on the economic successes achieved by Labour. \"He can stick up whatever he like on billboards about something in a book but what the public will concentrate on are low mortgages, low inflation, low unemployment that we delivered and that he failed to,\" Brown said in a new book. However, before doing so, Brown claimed there was animosity between them. In an interview with Robert Peaton, the author claims that Brown told him in November 2003 he would stand down as prime minister before the next election. But, after support from Cabinet allies and suspicion that Brown was trying to manipulate against him, he declined to say whether or not he had offered to quit. In the article, Howard again denied Brown's claim that he told him there could be no deal over the Prime Minister's post. He said Brown directly contradicted his own claim by stating, \"There is nothing you could ever say to me now that I could ever believe.\" Both leaders have faced criticism from opposition parties ahead of next year's general election.", "tinydolphin:1.1b": " The Prime Minister, Tony Blair, is having a tough time with his rival, Labour leader, Gordon Brown, as their feuding has damaged how the UK is being governed. In a heated exchange during a prime minister's questions, Mr Howard taunted Mr Brown over their squabbles, accusing him of fighting crime rather than focusing on the government's economic successes. The question by Michael Howard was later revealed as the headline for new Tory campaign posters. However, Mr Blair dismissed the suggestion that splits are affecting his priorities and dismissed claims made in a book by Robert Peston about their relationship. The chancellor is currently on a high-profile tour of Africa to highlight new anti-poverty plans, while Brown's Britain by Robert Peston suggests there is mutual animosity between the two men.", "phi:2.7b": " Michael Howard criticized Tony Blair's feud with Gordon Brown for damaging UK governance, but Blair dismissed it as people would focus on economic successes. Peston's book claims that Mr Blair considered resigning before the election, but he denied saying so. The two leaders agreed to disagree, and Mr Peston claimed that Brown had told him that he could never trust Blair again. However, Mr Howard said there were deals struck between them at dinners. Mr Blair promised not to respond to tittle-tattle in books but would highlight Labour's accomplishments in his manifesto. At a Tory campaign launch, Liam Fox criticized the prime minister and chancellor for being \"juvenile.\" Labour staged its own poster launch later that day with Alan Milburn, who was chosen by Blair as election chairman in place of the chancellor. However, the Liberal Democrats' Charles Kennedy said the government's split at the top would not be addressed by cosmetic exercises. Mr Blair is expected to outline his party's manifesto for the next election on Tuesday.\n", "orca-mini:3b": " Michael Howard criticized Tony Blair and Gordon Brown's feud, saying it is damaging the way the UK is governed. He mentioned that the public will focus on low mortgages, low inflation, and low unemployment achieved by Labour during their tenure. However, Blair denied these claims and reiterated that there was no deal between him and Brown regarding the premiership.", "hermes3:3b": "Howard criticizes UK gov splits, asks how crime fighting can occur when leaders fight each other.", "stablelm-zephyr:3b": "Tory leader Michael Howard accused Tony Blair of damaging UK governance due to the feud with Gordon Brown. He questioned how the duo could focus on crime reduction when they were fighting each other. The conflict between Blair and Brown was discussed in a new book by Robert Peston, which claimed that Blair considered standing down as prime minister before the next election but changed his mind after support from Cabinet allies. During the poster launch for their party, Liberal Democrat leader Charles Kennedy mentioned that the government appears to be split at the top. Later, Howard faced backbench discontent over claims made in Peston's book during a meeting of the Parliamentary Labour Party.", "chatgpt-4o-latest": "Michael Howard accused Tony Blair and Gordon Brown's feud of harming UK governance during a heated Prime Minister's Questions. Howard mocked their rivalry, using it as a Tory campaign slogan, while Blair dismissed the claims, emphasizing Labour's economic successes. A new book, *Brown's Britain*, alleged deep animosity between Blair and Brown, including a broken promise by Blair to step down. Blair denied key quotes from the book but avoided directly confirming or denying past resignation offers. Howard ridiculed Blair over alleged secret deals, questioning the government's discipline. Labour attempted to show unity, but critics, including Liberal Democrat leader Charles Kennedy, dismissed it as superficial. Blair is set to outline Labour's election manifesto amid internal party tensions.", "stablelm2:1.6b": "Tory leader Michael Howard claims that Tony Blair's feud with Gordon Brown is damaging UK governance, while Blair denies any splits and focuses on economic successes from Labour. The disagreement also appears in campaign posters for the next elections. In Robert Peston's book, Brown accused Blair of standing down before the next election due to pledges made by support from Cabinet allies, suspicion that Brown was attempting to maneuver against Blair, and Brown's statement \"there is nothing you could say to me now that I could ever believe.\" Both Blair and Brown deny these claims. Tory leader Howard taunts Blair over splits in a heated prime minister's questions session.", "granite3.1-dense:2b": "Michael Howard, Tory leader, criticized Blair and Brown's alleged feud during a heated prime minister's questions, questioning how they can effectively address crime while fighting amongst themselves. This became the headline for new Tory campaign posters. Blair dismissed these claims, emphasizing Labour's economic achievements: low mortgages, inflation, and unemployment rates. Robert Peston's book, \"Brown's Britain,\" suggests animosity between the two, with Blair reportedly promising to step down before the next election in 2003 but reversing that decision due to support from Cabinet allies and suspicions about Brown's intentions. Blair denied this quote but acknowledged no formal deals about succession at dinner meetings. The Tory party plans to highlight perceived disunity in the Labour government, while Labour staged a united front at their own poster launch. Liberal Democrat leader Charles Kennedy observed that the split is evident, and Blair's credibility may be questionable due to this.", "reference": "It claims Mr Blair said in November 2003 he would stand down as prime minister before the next election.Mr Peston's book claimed that Mr Brown told Mr Blair: \"There is nothing you could ever say to me now that I could ever believe.\"Labour staged a show of unity at its own poster launch on Tuesday, where Mr Brown was joined by Alan Milburn, who Mr Blair controversially put in charge of election planning in place of the chancellor.The prime minister and chancellor faced backbench discontent at Monday's meeting of the Parliamentary Labour Party over claims made Mr Peston's book.But Mr Blair dismissed the talk of splits and said people's priorities at the next elections would be on the economic successes achieved by Labour.But before doing so, he insisted he still trusted Mr Blair, despite claims to the contrary in a new book.Mr Blair directly denied that quote on Wednesday.Later at their poster launch Tory co-chairman Liam Fox said his party would exploit opportunities to show how \"juvenile\" the prime minister and chancellor were.Later this week Mr Blair is expected to outline the direction of his party's next election manifesto.Mr Blair said he would not respond to \"tittle tattle in books\" and promised to hail Labour's record on the economy, waiting lists and law and order \"from now until polling day\"."}