{"raw_text": "Defection timed to hit tax pledge\n \n With impeccable and precisely-calculated timing, Tory defector Robert Jackson and his new Labour bosses have attempted to overshadow Michael Howard's latest announcement on taxation and spending.\n \n With just about everyone in Westminster now working towards a May general election, Mr Howard is eager to map out some clear and distinctive policies aimed at finally shifting the Tories' resolutely depressing poll showings. The big idea is his £35bn savings on waste and bureaucracy which Mr Howard has pledged to plough back into public services and tax cuts. And it was virtually certain his pledge on tax cuts was meant to be the core message from his interview on the BBC One's Breakfast with Frost programme. He and his shadow Chancellor Oliver Letwin have been edging towards an announcement on this front for some months now, but without any concrete pledges. But Mr Howard announced that, of the £35bn he has earmarked from savings, £12bn will be used to plug Labour's claimed financial black hole with any left over going to tax cuts in Mr Letwin's first budget. He would not be precise, but there are already suggestions he is set to announce lifting the threshold on income tax and reforming or abolishing inheritance tax. But he did, for the first time, say there would be such tax cuts.\n \n \"At this election, people will have a clear choice between Mr Blair who will waste more and tax more and the Conservative party which will give value for money and tax less\". It is the Tories' attempt to open that famed \"clear blue water\" between them and the Labour party and return to a traditional Tory agenda that will both reassure the middle England voters who have abandoned him and appeal to core Conservative voters. So it is a pretty safe bet to assume that, when Robert Jackson finally decided to jump ship and swim over to the Labour benches, his new masters decided to time the announcement for the greatest possible impact. Mr Howard, however, was dismissive. \"These things happen from time to time. There are disagreements between Robert Jackson and me.\n \n \"The election is not going to be decided on what Robert Jackson did,\" he added. And that is certainly true. The election will be decided on \"the economy stupid\". Other issues like the Iraq war and the \"trust\" thing will also play a major part. But it is the economy that will probably be the greatest influence over the way people finally vote. And many on the Tory benches have been crying out for Mr Howard to get back onto the old Tory tax cuts agenda. Mr Howard knows that risks accusations that, as a result, he would slash public services, so he has attempted to shoot that fox first. With polls suggesting voters would rather any government cash surpluses were spent on schools and hospitals before tax cuts, he has suggested that is exactly what he will do. Whether this will finally be enough to shift those polls remains to be seen.\n", "llama3.2:1b": "Tory defector Robert Jackson and Labour bosses have attempted to overshadow Michael Howard's announcement with a clear economic message. Howard has pledged £35bn in savings to return tax cuts and public services, aiming to improve the Tories' poll showings. However, the timing of the announcement is seen as strategic by Howard, who wants to maximize its impact before May's general election. His shadow Chancellor Oliver Letwin will lead an announcement on taxation, which may include lifting income tax thresholds and reforming or abolishing inheritance tax.", "llama3.2:3b": "Tory leader Michael Howard announces £35bn savings from waste and bureaucracy, with £12bn to be used to plug Labour's financial black hole and £3bn for tax cuts in his first budget. Defector Robert Jackson's timing is seen as an attempt to overshadow the announcement. Howard defends his approach, saying it will give \"value for money\" and \"tax less\", aiming to reassure middle England voters and appeal to core Conservatives.", "gemma2:2b": "Robert Jackson's defection coincides with Michael Howard's announcement of £35bn savings for tax cuts and increased public service funding.  Howard aims to use this opportunity to highlight a clear choice between the Conservatives' traditional agenda and Labour's \"waste more, tax more\" approach. While a potential tax cut announcement is expected, many believe the election will ultimately be decided by the economy. \n", "qwen2.5:0.5b": "Tory defector Robert Jackson and his new Labour bosses are timing their potential £35bn budget cut announcement for May's general election. The Tories hope this will open up a \"clear blue water\" between them and Labour, returning to traditional Tory policies like tax cuts. However, the Prime Minister is dismissive of Jackson’s decision.", "qwen2.5:1.5b": "Tory defector Robert Jackson's £35bn savings announcement aims to boost Labour, while Michael Howard suggests potential tax cuts in return for promises on spending and school funding. This timing reflects the upcoming election and the need to emphasize a \"clear blue water\" between Tories and Labour, as voters seek value-for-money and lower taxes.", "qwen2.5:3b": "Tory defector Robert Jackson timed his move to the Labour benches closely with Michael Howard’s announcement of £35bn savings from waste and bureaucracy, earmarked for public services and tax cuts during a May general election. Key details include plans for £12bn to plug Labour’s financial black hole, potential tax cuts such as lifting income tax thresholds and reforming/abolishing inheritance tax. Jackson aimed to signal a shift towards traditional Tory policies like value-for-money spending and lower taxes compared to Labour's promises of increased public services funding. Howard dismissed the timing of Jackson's defection, stating he is not deciding the election. Focus remains on the economy with polls suggesting preference for surplus funds on schools and hospitals rather than tax cuts.", "opencoder:1.5b": "The text describes a scenario where Robert Jackson, now a Labour candidate for the next General Election, was trying to take steps to ensure his position in power on taxing and spending. He was initially reluctant due to his financial investment, but quickly realized that he had promised to cut down on tax breaks and reform taxation. After several months of negotiations and negotiations with his boss, Mr Howard announced a plan for cutting the income tax and making the inheritance tax more flexible, which will give him a bigger chunk of the tax-free money. He also suggested reducing public services spending and making it a tax break. However, he was not satisfied with these suggestions, as they were based on vague promises to other voters. Ultimately, Mr Howard's announcement set a precedent for future tax plans and helped shape the Labour government.\n", "smollm:1.7b": "The summary above captures the main ideas of the text:\n\n1. Defection timed to hit tax pledge: The article highlights the key idea of a Tory defector, Robert Jackson, and his Labour bosses attempting to overshadow Michael Howard's latest announcement on taxation and spending.\n2. With impeccable and precisely-calculated timing: The article emphasizes that Mr Howard's announcement was carefully planned to maximize its impact, with no room for error or explanation.\n3. Defection timed to hit tax pledge: The text suggests that the key idea of a Tory defector is their plan to use tax savings to reduce waste and bureaucracy, which would be used to fund Labour's promised £35bn on taxation and spending cuts.\n4. With virtually no clear policy announcements: The article notes that Mr Howard has not made any specific promises or policy announcements, leaving the public with a sense of uncertainty about what he will actually do.\n5. Defection timed to hit tax pledge: The text suggests that Mr Howard's announcement was set up to be announced on Labour Day (May 6th), which would allow him to capitalize on the party's traditional focus on taxation and spending cuts.\n6. With no clear policy announcements: The article emphasizes that the key idea of a Tory defector is their plan to use tax savings to reduce waste and bureaucracy, rather than making any specific promises or policy announcements.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text into a concise summary while preserving key ideas and details. The user provided specific instructions: output only the summary in plain text without explanations or any formatting. So, my task is just to extract the main points from each paragraph.\n\nFirst, I'll read through the first paragraph carefully. It mentions that there's a political race between Tony Blair and Michael Howard for the May general election. The focus is on their tax policies. Tory defectors like Robert Jackson are trying to overshadow Howard's announcement about taxation and spending.\n\nNext, the second paragraph talks about Howard planning significant tax cuts. He has £35 billion from savings, with part of it intended to plug Labour's financial deficit due to inheritance taxes. He also hinted at lifting income tax as a first step but dismissed detailed plans from others.\n\nThe third paragraph introduces Mr. Jackson's decision and his new team trying to time Howard's announcement for maximum impact. Howard is critical of their discussions, suggesting the election isn't decided by their tax cut agenda but on other issues like Iraq and public services.\n\nI'll need to make sure each summary point captures what's important without getting bogged down in details that aren't essential. Let me check each paragraph again to ensure I haven't missed any key points. The summary should be clear and concise, reflecting the main events about the election between Blair and Howard regarding their tax policies.\n</think>\n\nThe election for May general elections is a race between Tony Blair and Michael Howard. Howard is planning significant tax cuts with £35 billion savings, aiming to address public services and inheritance taxes. He hinted at lifting income tax but dismissed detailed plans. Meanwhile, Harold Taylor Jackson's new Labour team plans to time Howard's announcement on maximum impact. Howard criticizes their discussions, stating the election isn't decided by their tax cut agenda but on other issues like Iraq and public services.", "tinyllama:1.1b": "Ahead of May's general election, Prime Minister Tony Blair has launched a new policy campaign to counterbalance the Labour party's reputation for waste and tax burdens by promising significant tax cuts in his upcoming budget. The plan is based on the Torie's commitment to \"waste\" - meaning spending more than they earn. To achieve this, the government has announced plans to save £35bn over 10 years through waste and burducracies, which will be used to plug Labour's claimed financial black hole with any left-over income tax and reform/abolish inheritance tax. However, as Robert Jackson, an influential figure in the Conservative party, suggests, this campaign is not enough to win votes. The economy will ultimately determine the election outcome, while many on the Torie's benches have been crying out for Howard to restore his \"clear blue water\" policy of cutting taxes.", "tinydolphin:1.1b": " This text provides an overview of a political situation where Robert Jackson (an influential Tory MP) is expected to defect from the Conservatives to join Labour under Michael Howard's leadership. The timing of this announcement, combined with rumored policy changes within Mr. Howard's party, could have significant implications on the upcoming general election. The text highlights key details, such as a new Labour pledge on tax cuts and a departure from Tory ideology. This information suggests that political dynamics could shift significantly following this event, possibly influencing voters' decisions in the election.", "phi:2.7b": " Robert Jackson's defection from the Conservatives led to a timing of Michael Howard's announcement of tax cuts. The £35bn savings plan aims to cut waste and bureaucracy, with £12bn going towards plugging Labour's claimed financial black hole and implementing tax cuts. Mr. Letwin is set to announce tax cuts in his first budget, such as lifting the threshold on income tax or reforming inheritance tax. It's a safe bet that Mr. Jackson's defection was timed for maximum impact in an effort to shift the Tories' poll showings. While the election will be decided by the economy, other issues like the Iraq war and trust will also have an influence over how people vote. However, it is likely that the Tories' traditional agenda of tax cuts will continue to appeal to voters, but with Mr. Howard's attempt to cut public services in response to accusations from his party leaders may be risky.\n", "orca-mini:3b": " Tory defector Robert Jackson timed his defection to hit Labour's tax pledge announcement for maximum impact, but Michael Howard dismissed it as just \"differences between us\". The election is not decided on Jackson's actions, but on the economy and other issues like Iraq and trust. The Tories want to return to a traditional tax cuts agenda and have announced £12bn in savings to plug Labour's black hole and £35bn in tax cuts for voters. However, lifting the threshold on income tax and reforming or abolishing inheritance tax is being suggested.", "hermes3:3b": "Robert Jackson's defect timed with tax pledge announcement to overshadow Michael Howard's plans.", "stablelm-zephyr:3b": "In a May general election, Michael Howard aims to present clear policies after facing pressure from defected Tory Robert Jackson and his new Labour bosses. Their goal is to distance the Tories from their recent poor poll showings by emphasizing tax cuts and financial responsibility. However, the decision to highlight this issue now raises questions about timing and its impact on voter perception. The election's ultimate deciding factor may still be the economy, other major issues, or public service priorities.", "chatgpt-4o-latest": "Tory defector Robert Jackson and Labour strategically timed his defection to overshadow Michael Howard’s tax and spending announcement. Howard, aiming to improve poor Tory poll standings ahead of a likely May election, pledged £35bn in savings from waste and bureaucracy, with £12bn allocated to cover Labour’s financial shortfall and the remainder for tax cuts. He hinted at raising the income tax threshold and reforming inheritance tax, emphasizing a choice between Labour’s higher taxes and Tory efficiency. Jackson’s defection was likely timed for maximum disruption, but Howard dismissed its significance, asserting the election will be decided on economic issues. Howard seeks to reassure voters by prioritizing public services before tax cuts, but it remains uncertain if this will improve Tory poll numbers.", "stablelm2:1.6b": "Tory defector Robert Jackson and Labour are attempting to overshadow Michael Howard's announcement on taxation and spending in the run-up to a May general election. Howard plans to use £1bn in savings from waste and bureaucracy for public services and tax cuts, with any remaining funds allocated towards tax cuts. He is expected to announce lifting the income tax threshold and potentially reforming or abolishing inheritance tax. The aim is to return to a traditional Tory agenda, appealing to both Conservative and core Conservative voters. Howard acknowledges accusations that he would slash public services but aims to spend surpluses on schools and hospitals before tax cuts. Whether this will shift polls remains to be seen as the election's greatest influence may come from the economy.", "granite3.1-dense:2b": "Tory defector Robert Jackson's timing in joining Labour coincides with Michael Howard's tax pledge announcement during his interview on BBC One's Breakfast with Frost programme. Howard pledged £35bn in savings from waste and bureaucracy, with £12bn allocated to close Labour's financial gap and the remainder for potential tax cuts in his first budget. These measures aim to provide a clear contrast to Labour, emphasizing value for money and lower taxes. Howard asserted that voters would have to choose between him and Labury's Prime Minister Tony Blair, with the Conservatives offering better economic management and less taxation. Despite Jackson's defection, Howard maintains that the election will primarily hinge on the economy, alongside issues like Iraq and trust. This pledge strives to address criticisms of past Tory policies that might have led voters to abandon the party, while acknowledging the significance of the economy in determining their voting decisions.", "reference": "But he did, for the first time, say there would be such tax cuts.\"At this election, people will have a clear choice between Mr Blair who will waste more and tax more and the Conservative party which will give value for money and tax less\".So it is a pretty safe bet to assume that, when Robert Jackson finally decided to jump ship and swim over to the Labour benches, his new masters decided to time the announcement for the greatest possible impact.The big idea is his £35bn savings on waste and bureaucracy which Mr Howard has pledged to plough back into public services and tax cuts.\"The election is not going to be decided on what Robert Jackson did,\" he added.But Mr Howard announced that, of the £35bn he has earmarked from savings, £12bn will be used to plug Labour's claimed financial black hole with any left over going to tax cuts in Mr Letwin's first budget.And many on the Tory benches have been crying out for Mr Howard to get back onto the old Tory tax cuts agenda.With just about everyone in Westminster now working towards a May general election, Mr Howard is eager to map out some clear and distinctive policies aimed at finally shifting the Tories' resolutely depressing poll showings.Mr Howard knows that risks accusations that, as a result, he would slash public services, so he has attempted to shoot that fox first.Mr Howard, however, was dismissive."}