{"raw_text": "'Best person' for top legal job\n \n The \"best person for the job\" should be appointed lord chancellor, and not necessarily a lawyer or MP, the courts minister has told MPs.\n \n Under reforms, the post of lord chancellor is to be stripped of its judicial functions. \"The lord chancellor...no more needs to be a lawyer than the Secretary of Health needs to be a doctor,\" said courts minister Christopher Leslie. The Constitutional Reform Bill was entering its second reading on Monday. Mr Leslie said: \"The prime minister should be able to appoint the best person for the job whether they sit in the House of Lords or the House of Commons.\" Under the reforms, the Law Lords will also be replaced as the UK's highest legal authority by a Supreme Court and judges will be appointed by an independent panel rather than ministers.\n \n In December the Lords rejected a plea by current Lord Chancellor Lord Falconer that the holder of the job should not necessarily be a lawyer or a peer. The peers voted by 229 to 206 to say in law that lord chancellors must also be peers. The debate was carried over from the last Parliamentary session, but with an impending general election time is crucial for the government to get the Bill passed. Mr Leslie said it was irrelevant whether the post was called Secretary of State for Constitutional Affairs or Lord Chancellor. He said: \"What matters most is...whether it is reformed so that the post holder no longer has those conflicting duties. \"It is no longer appropriate for a government minister to have such unfettered discretion in the appointment of judges.\"\n \n Shadow attorney general Dominic Grieve criticised the government on its plans to change what he said was an \"exceptional institution,\" providing a \"champion of the independence of the judiciary\". The government had initially proposed to take this institution and \"smash it to pieces,\" Mr Grieve said. Convention should be \"nurtured and celebrated,\" but the government distrusted and disliked it instead. He warned that unless ministers backed down over the lord chancellor remaining a member of the House of Lords, the government would have \"great difficulty\" in getting the Bill through Parliament. Former Cabinet minister Douglas Hogg, whose father and grandfather served as lord chancellor, said the Bill was \"largely unnecessary, bureaucratic and expensive\". But the Tory MP for Sleaford and North Hykeham admitted the lord chancellor's role and office \"cannot be frozen in aspic\".\n", "llama3.2:1b": "The Lord Chancellor is to be reformed, with the post stripped of judicial functions. The courts minister has stated that any future appointments should not require a lawyer or peer, and that ministers can no longer have unfettered discretion over judges' appointments. The reform aims to \"nurture and celebrate\" the independence of the judiciary.", "llama3.2:3b": "The UK government plans to reform the post of Lord Chancellor by stripping it of judicial functions and appointing a non-lawyer or MP, with judges being appointed by an independent panel. The reforms aim to address concerns about conflicting duties and ministerial discretion. The Conservative Party faces opposition from critics who argue that the changes will undermine the independence of the judiciary.", "gemma2:2b": "The Constitutional Reform Bill proposes to remove the judicial functions of the Lord Chancellor. The government argues that this reform is necessary to allow the appointment of the \"best person\" for the job, regardless of whether they are a lawyer or MP.  The bill also plans to replace the Law Lords with a Supreme Court and independent judges panel to appoint new judges. Shadow attorney general Dominic Grieve criticizes the reforms and former Cabinet minister Douglas Hogg believes the bill is unnecessary. \n", "qwen2.5:0.5b": "Under new reforms, a Lord Chancellor will no longer sit in the House of Lords but be appointed by an independent panel. The Lord Chancellor is to retain judicial functions but will not need to be a lawyer or peer. This will change the position of the Prime Minister, who now has this role but cannot appoint the Lord Chancellor.", "qwen2.5:1.5b": "The \"best person for the job\" should be appointed Lord Chancellor rather than lawyer or MP. The reforms aim to remove judicial functions from the post, replace Law Lords with a Supreme Court, and appoint judges independently of ministers. MPs must ensure ministerial discretion over judge appointments remains limited. The Bill is expected to pass before an upcoming general election.", "qwen2.5:3b": "The Lord Chancellor position is to be reformed under Constitutional Reform Bill, with judicial functions being removed. The post should ideally be filled by someone who does not need to be a lawyer or an MP, according to courts minister Christopher Leslie. Under the reforms, Law Lords will no longer hold the UK's highest legal authority and judges will instead be appointed by an independent panel rather than ministers. However, critics argue that this change would remove protections for the judiciary. MPs are divided on whether the Lord Chancellor should remain a member of the House of Lords. Former Cabinet minister Douglas Hogg believes the reforms are unnecessary, bureaucratic, and expensive.", "opencoder:1.5b": "The summary is as follows:\n\n1. The best person for the top legal job should be appointed Lord Chancellor.\n2. Under reforms, the post of Lord Chancellor is to be stripped of its judicial functions.\n3. The Supreme Court decision on Monday by Christopher Leslie, which introduced the Constitutional Reform Bill, says the prime minister can appoint the best person for the job whether they sit in the House of Lords or the House of Commons.\n4. Under the reforms, the Law Lords will also be replaced as the UK's highest legal authority by an independent panel.\n5. In December, Lord Chancellor Lord Falconer rejected a plea from the current Lord Chancellor to not appoint someone who is not necessarily a lawyer or a peer for a post that should no longer have those conflicting duties.\n6. The debate over this decision came from last Parliamentary session but with a crucial election time for the government to get the Bill passed.\n7. Mr Leslie said it was irrelevant whether the post was called Secretary of State for Constitutional Affairs or Lord Chancellor.\n8. Today, what matters most is not necessarily who has those conflicting duties but rather who can be appointed as the best person for the top legal job.\n9. Domino's Dominic Grieve criticized the government's plans to change what he said was an \"exceptional institution.\"\n10. The government had initially proposed to take this institution and \"smash it to pieces,\" Mr Grieve said.\n11. Convention should be \"nurtured and celebrated,\" but the government distrusted and disliked it instead, complaining that they would have great difficulty in getting the Bill through Parliament.\n12. Former Cabinet minister Douglas Hogg said the Bill was \"largely unnecessary, bureaucratic and expensive\".\n13. But the Tory MP for Sleaford and North Hykeham admitted his role and office \"cannot be frozen in anticipation of aspic elections\", suggesting it is not necessary. \n\nThe main point of this summary is to preserve the key ideas and details from the given text while summarizing it concisely.\n", "smollm:1.7b": "The \"best person\" for top legal job is appointed by the prime minister. The prime minister should appoint a lawyer or peer, but not necessarily one who sits in the House of Lords. The prime minister should also ensure that the lord chancellor does not have judicial duties. The prime minister's role as head of government and chief executive means they must make decisions about appointments to key positions, including the lord chancellor.\nThe \"best person\" for the job is no longer a lawyer or peer, but rather someone who has demonstrated exceptional ability in their field. This is because the prime minister needs to ensure that the lord chancellor does not have conflicting duties and responsibilities. The prime minister must also consider whether the lord chancellor will be able to provide effective leadership and guidance to the judiciary.\nThe shadow attorney general Dominic Grieve criticized the government's plans to change what he said was an \"exceptional institution,\" providing a \"champion of the independence of the judiciary.\" The government had initially proposed to take this institution and \"smash it to pieces,\" Mr Grieve said, but the prime minister has since backed down over this issue.\nThe prime minister's role as head of government and chief executive means they must make decisions about appointments to key positions, including the lord chancellor. The prime minister's power is significant because they have the ability to appoint someone who sits in the House of Lords or the House of Commons. This means that the prime minister has a great deal of control over the appointment process.\nThe prime minister should ensure that the lord chancellor does not have judicial duties, but rather provide guidance and leadership to the judiciary. The prime minister's role as head of government and chief executive means they must consider whether the lord chancellor will be able to provide effective leadership and guidance to the judiciary.\nThe shadow attorney general Dominic Grieve criticized the government's plans to change what he said was an \"exceptional institution,\" providing a \"champion of the independence of the judiciary.\" The prime minister had initially proposed to take this institution and \"smash it to pieces,\" Mr Grieve said, but the prime minister has since backed down over this issue.\nThe prime minister's role as head of government and chief executive means they must make decisions about appointments to key positions, including the lord chancellor. The prime minister's power is significant because they have the ability to appoint someone who sits in the House of Lords or the House of Commons. This means that the prime minister has a great deal of control over the appointment process.\nThe prime minister should ensure that the lord chancellor does not have judicial duties, but rather provide guidance and leadership to the judiciary. The prime minister's role as head of government and chief executive means they must consider whether the lord chancellor will be able to provide effective leadership and guidance to the judiciary.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about the new legal appointments. First, I should read through it carefully to understand the main points.\n\nThe text starts by talking about appointing someone who isn't necessarily a lawyer or MP for the top law job. The Prime Minister (MP) told MPs that Lord Chancellor shouldn't have to be a lawyer. Then there are reforms in place where the lord chancellor position is stripped of its judicial functions. I remember reading about constitutional reform bills, so that's part of it.\n\nThe Bill will now involve the House of Lords as the highest legal authority, replacing the Prime Minister and other ministers with judges from the Supreme Court or through an independent panel. This makes sense because the government wants to strengthen judicial independence.\n\nThen there are some criticisms. Shadow attorney general Dominic Grieve called out the previous law enforcement body, which is supposed to be championing judiciary independence. The government initially wanted to take it apart but now plans to \"nurture and celebrate\" them instead of just ignoring their role. The previous Bill was seen as unnecessary and expensive by some, but the summary mentions it's largely outdated.\n\nFinally, there are quotes from Mr. Leslie about the flexibility in appointments, emphasizing that judges shouldn't have those unfettered duties. It seems like a tough pill to crack because ministers might resist downplaying who they're calling.\n\nI need to make sure I capture all these points: appointing Lord Chancellor without judicial functions, reforms removing judicial responsibilities, criticisms of the previous law enforcement body, and the overall stance on judicial independence.\n</think>\n\nThe \"best person for the job\" should be appointed as Lord Chancellor, not necessarily a lawyer or MP. The Prime Minister (MP) has stated that the lord chancellor position is no longer required to hold a legal role beyond what the Queen needs in the Royal Services. Under constitutional reform plans, the Lord Chancellor will become part of the Supreme Court's highest authority, replaced by judges appointed through an independent panel rather than ministers. criticism of former law enforcement body Dominic Grieve highlights concerns over independence. Mr. Leslie emphasized that appointments should reflect judicial independence, and the government is crucial in getting this bill passed at a crucial time for Parliament. The Bill was largely seen as unnecessary and bureaucratic by some Tories but is now being debated again. Former Cabinet minister Douglas Hogg noted the lord chancellor's importance to the political landscape. Overall, the reforms aim to strengthen judicial independence while challenging current political priorities.", "tinyllama:1.1b": "The courts minister has expressed his support for replacing the Lord Chancellor with a Supreme Court judge as the country's highest legal authority, stating that current Lord Chancellor Lord Falconer must not necessarily be a lawyer or a peer. He also believes it is \"no longer appropriate\" for a government minister to have unfettered discretion in appointing judges. The debate over the \"best person for the job\" has been brought up again, as the government plans to change what the government calls an \"exceptional institution\" by smashing it to pieces if it cannot agree on the Lord Chancellor's role and office. Meanwhile, former Cabinet minister Douglas Hogg claims that the Bill is buraucracical and expensive, but admits the lord chancellor's role and office cannot be frozen in aspic.", "tinydolphin:1.1b": " The best person for the job of Lord Chancellor should be appointed by the Prime Minister, not necessarily a lawyer or MP. This is according to the UK's courts minister Christopher Leslie, who believes that this would make it easier for the government to achieve its goal of restructuring the judiciary. Currently, the role of Lord Chancellor is held by lawyers and MPs, with the Prime Minister having discretion on the person appointed to the post. The Constitutional Reform Bill is being introduced in Parliament this week to review these roles and potentially redefine what a top legal job should look like.", "phi:2.7b": " The Constitutional Reform Bill proposes to remove judicial functions from the post of lord chancellor, allowing the government to appoint someone not necessarily a lawyer or an MP. The court minister has stated that \"the prime minister should be able to appoint the best person for the job.\" The bill aims to reform the appointment process and create an independent panel to select judges. Shadow attorney general Dominic Grieve criticized the government's plans, stating that the role of the lord chancellor is \"exceptional\" and must remain as a member of the House of Lords. Former Cabinet minister Douglas Hogg believes the Bill is unnecessary but acknowledges the need for change.\n", "orca-mini:3b": " The text summarizes that the best person for the job of lord chancellor should not necessarily be a lawyer or an MP, and that the Constitutional Reform Bill was entering its second reading. The minister said that the prime minister should be able to appoint the best person for the job, and that the post of lord chancellor should be reformed so that the holder no longer has conflicting duties. MPs debated whether the post should be called Secretary of State for Constitutional Affairs or Lord Chancellor, but what mattered most was whether it was reformed. The Shadow attorney general criticized the government's plans to change what he said was an \"exceptional institution,\" providing a \"champion of the independence of the judiciary.\"", "hermes3:3b": "Appoint best person (not just lawyer or MP) for lord chancellor role under reforms, which strip judicial functions and replace Law Lords with Supreme Court.", "stablelm-zephyr:3b": "The UK courts minister, Christopher Leslie, has stated that the position of Lord Chancellor should no longer be limited to a lawyer or an MP. The Constitutional Reform Bill proposes stripping the role of its judicial functions and replacing it with a Supreme Court and judges appointed by an independent panel. This change aims to allow the prime minister to appoint the best person for the job regardless of their political affiliation. While the idea has been met with criticism from some, like shadow attorney general Dominic Grieve, others support the reform as an improvement that will protect the independence of the judiciary.", "chatgpt-4o-latest": "The courts minister, Christopher Leslie, stated that the lord chancellor should be the \"best person for the job\" and not necessarily a lawyer or MP. Under proposed reforms, the role will lose its judicial functions, and judges will be appointed by an independent panel rather than ministers. The reforms also include replacing the Law Lords with a Supreme Court. The House of Lords previously voted to require the lord chancellor to be a peer, despite opposition from Lord Falconer. With a general election approaching, the government is pushing to pass the Constitutional Reform Bill. Critics, including Shadow Attorney General Dominic Grieve, argue that the changes undermine judicial independence, while former minister Douglas Hogg called the reforms unnecessary and costly but acknowledged the role must evolve.", "stablelm2:1.6b": "The Lord Chancellor position should not require a lawyer or MP but could potentially appoint someone who is the best person for the job, according to Courts Minister Christopher Leslie. The current position of Lord Chancellor will lose its judicial functions under reforms, with judges being appointed by an independent panel instead of ministers. Former Cabinet minister Douglas Hogg suggests that the bill may be \"largely unnecessary, bureaucratic and expensive.\" However, former Secretary of State for Constitutional Affairs Dominic Grieve argues it undermines an \"exceptional institution,\" which he claims should be championed and celebrated.", "granite3.1-dense:2b": "Under proposed constitutional reforms, the position of Lord Chancellor will transition from a judicial role to one focused on governance. Courts Minister Christopher Leslie stated that the prime minister should appoint the best person for the job, regardless of whether they are an MP or a lord. This change aims to eliminate conflicts of interest, as the Lord Chancellor would no longer need to be a lawyer or a peer. Previously, peers voted 229 to 206 in favor of maintaining these requirements. The reforms also propose replacing the Law Lords with a Supreme Court and having judges appointed by an independent panel instead of ministers.\n\nCritics, including Shadow Attorney General Dominic Grieve, argue that these changes threaten the independence of the judiciary, which they view as an \"exceptional institution.\" They warn that continued membership of Lord Chancellor in the House of Lords could hinder the passage of the Constitutional Reform Bill. Former Cabinet Minister Douglas Hogg expressed skepticism about the necessity and costs of these reforms, yet acknowledged the need for evolution in the lord chancellor's role and office.", "reference": "Mr Leslie said it was irrelevant whether the post was called Secretary of State for Constitutional Affairs or Lord Chancellor.He warned that unless ministers backed down over the lord chancellor remaining a member of the House of Lords, the government would have \"great difficulty\" in getting the Bill through Parliament.The \"best person for the job\" should be appointed lord chancellor, and not necessarily a lawyer or MP, the courts minister has told MPs.Former Cabinet minister Douglas Hogg, whose father and grandfather served as lord chancellor, said the Bill was \"largely unnecessary, bureaucratic and expensive\".In December the Lords rejected a plea by current Lord Chancellor Lord Falconer that the holder of the job should not necessarily be a lawyer or a peer.\"The lord chancellor...no more needs to be a lawyer than the Secretary of Health needs to be a doctor,\" said courts minister Christopher Leslie.Under reforms, the post of lord chancellor is to be stripped of its judicial functions.The peers voted by 229 to 206 to say in law that lord chancellors must also be peers."}