{"raw_text": "Kilroy-Silk quits 'shameful' UKIP\n \n Ex-chat show host Robert Kilroy-Silk has quit the UK Independence Party and accused it of betraying its supporters.\n \n The MEP said he was ashamed to have joined the party, which he labelled as a \"joke\". He plans to stand in the next general election but refused to confirm he is setting up a new political party called Veritas - Latin for truth. UKIP leader Roger Knapman said he would \"break open the champagne\", adding: \"It was nice knowing him, now 'goodbye'.\" However, he did say the ex-chat show host had been \"quite useful initially\". \"He has remarkable ability to influence people but, sadly, after the (European) election it became clear that he was more interested in the Robert Kilroy-Silk Party than the UK Independence Party so it was nice knowing him, now 'goodbye',\" Mr Knapman told BBC Radio 4's Today programme. Mr Knapman rejected the idea Mr Kilroy-Silk posed a threat to UKIP and queried why he had failed to confirm rumours he was starting a new political party.\n \n Mr Kilroy-Silk explained his reasons to his East Midlands constituents at a meeting in Hinckley, Leicestershire. His decision came as UKIP officials began a process which could have triggered Mr Kilroy-Silk's expulsion. It marks the end of his membership of UKIP after just nine months. It began with a flood of publicity which helped UKIP into third place in last June's European elections but became dominated by rancour as he tried to take over the party leadership.\n \n Mr Kilroy-Silk accused his fellow UKIP MEPs of being content with growing fat \"sitting on their backsides\" in Brussels. He told BBC News 24: \"I tried to change the party, I nagged all the way through the summer to do things, to get moving because I thought it was criminal what they were doing, it was a betrayal.\" Mr Kilroy-Silk also told Sky News there was \"masses of support\" for him to form a new party - something he has yet to confirm will happen.\n \n UKIP won 12 seats and 16.1% of the vote at the European elections on the back of its call for the UK to leave the European Union In his speech, Mr Kilroy-Silk says the result offered UKIP an \"amazing opportunity\" but the party's leadership had done nothing and \"gone AWOL\". There were no policies, no energy, no vision and no spokespeople, he said. \"The party is going nowhere and I'm embarrassed with its allies in Europe and I'm ashamed to be a member of the party,\" said Mr Kilroy-Silk.\n \n He said his conviction in Britain's right to govern itself had not changed. He would continue that campaign outside UKIP when he contested the general election in an East Midlands constituency. Reports of his new party plans have prompted a formal complaint to UKIP's disciplinary committee for bringing the party into \"disrepute\". On Thursday, the party challenged Mr Kilroy-Silk to stand down as an MEP so voters can get a genuine UKIP candidate.\n", "llama3.2:1b": "Kilroy-Silk quits UKIP, accuses party of betrayal, plans to run in next election; UKIP officials begin expulsion process; Kilroy-Silk rejects allegations of bringing the party into disrepute; says he will continue campaigning outside of UKIP.", "llama3.2:3b": "Robert Kilroy-Silk quits UKIP and accuses it of betraying its supporters, saying he was ashamed to be a member. He plans to contest the next general election in his East Midlands constituency but refuses to confirm whether he is setting up a new party called Veritas.", "gemma2:2b": "Robert Kilroy-Silk left UK Independence Party after nine months, accusing it of betraying its supporters and failing to act on its campaign promise for Brexit.  He plans to run in the next general election as an independent candidate. UKIP leader Roger Knapman responded that Kilroy-Silk's departure is \"goodbye,\" but acknowledges his influence while remaining dismissive about his new political party. The former MEP cited lack of action from UKIP leadership after its successful European election performance and expressed personal shame over the party's current state. \n", "qwen2.5:0.5b": "UKIP has disbanded after Kilroy-Silk quit its leadership and accused it of betraying its supporters. He plans to run for election but refused to confirm he is running for a new political party called Veritas. Robert Kilroy-Silk's ex-chat show host, who had been part of UKIP for nine months, now denies he was responsible for UKIP's downfall. He said the party's decision to disband was due to its \"masses of support\" and its leadership not taking action on a major issue.", "qwen2.5:1.5b": "Robert Kilroy-Silk has quit UK Independence Party over accusations of betrayal and leaving behind plans for a new political party called Veritas. He was critical of UKIP's leadership, calling them \"sitting on their backsides\" and offering support for another party to form. His decision came as he tried to take over the party but failed to confirm it would happen or provide policies.", "qwen2.5:3b": "Ex-chat show host Robert Kilroy-Silk has quit UK Independence Party (UKIP) over its perceived betrayal of supporters and mismanagement. He claims he was initially useful but later became more focused on forming his own party, dubbed \"Robert Kilroy-Silk Party.\" Despite this, UKIP leader Roger Knapman expressed disappointment and hinted at possible expulsion processes against Kilroy-Silk, who had joined just nine months ago. Kilroy-Silk criticized the MEPs for being inactive in Brussels and accused the leadership of lacking policies, vision, and energy. He vowed to continue his campaign outside UKIP in the next general election under a potential new party called Veritas (Latin for truth). UKIP officials are considering expelling him or challenging him to step down as an MEP.", "opencoder:1.5b": "Kilroy-Silk, a UK Independence Party (UKIP) quitter who admitted to publicly criticizing the party's supporters and opposing it, has been indubitable on a sensitive platform about his behaviour.\n\nRobert Kilroy-Silk, branded as a \"joke\" by the MEP, has indicated he is going against the policy of starting a new political party called Veritas. Mr Knapman, a former Ukip leader who said he would break the champagne, suggested that he had been more interested in the Robert Kilroy-Silk Party than the UK Independence Party.\n\nKilroy-Silk's behaviour at the European elections and his conviction have sparked an argument between UKIP and its peers. He has refused to confirm any new political party plans, leaving the platform feeling like an insurrection. His supporters are indifferent towards any form of government change and he has made it clear he will continue that campaign outside Ukip when he faces a general election.\n\nHowever, as per the statements made by the BBC and Sky News, Mr Kilroy-Silk's decision to stay in his current role doesn't mean he is leaving the party. It marks the end of his membership with UKIP and suggests he can no longer influence people. The party's leader, Roger Knapman, has stated that he will \"break open the champagne\". This leads us into a future where Ukip may not get another seat in the European Union until he reaffirms his position as a true candidate.\n", "smollm:1.7b": "The summary is concise and preserves key ideas and details:\n\n1. Kilroy-Silk quits 'shameful' UKIP\n2. Ex-chat show host Robert Kilroy-Silk has quit the UK Independence Party (UKIP)\n3. He plans to stand in the next general election but refuses to confirm he is setting up a new political party called Veritas - Latin for truth\n4. UKIP leader Roger Knapman says he would \"break open the champagne\", adding: \"It was nice knowing him, now 'goodbye',\" but did not say whether Mr Kilroy-Silk posed a threat to UKIP and queried why he had failed to confirm rumours he was starting a new political party called Veritas - Latin for truth\n5. Mr Kilroy-Silk explained his reasons to his East Midlands constituents at a meeting in Hinckley, Leicestershire\n6. His decision came as UKIP officials began a process which could have triggered Mr Kilroy-Silk's expulsion from the party after just nine months\n7. He accused his fellow UKIP MEPs of being content with growing fat \"sitting on their backsides\" in Brussels\n8. He told BBC News 24: \"I tried to change the party, I nagged all the way through the summer to do things, to get moving because I thought it was criminal what they were doing, it was a betrayal.\"\n9. UKIP won 12 seats and 16.1% of the vote at the European elections on the back of its call for the UK to leave the European Union\n10. Mr Kilroy-Silk says his conviction in Britain's right to govern itself has not changed\n11. He would continue that campaign outside UKIP when he contests the general election in an East Midlands constituency\n12. Reports of his new party plans have prompted a formal complaint to UKIP's disciplinary committee for bringing the party into \"disrepute\"", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Robert Kilroy-Silk quitting the UK Independence Party and some details around his actions. Let me read through it again.\n\nHe's leaving UKIP, which is interesting because he was once an MEP there. He called it a joke, but apparently he's not happy with that. His future plans include running for the next general election. I should note that he wants to stand in the next general election and isn't confirming if he'll set up Veritas.\n\nI also need to mention Roger Knapman, his former UKIP leader, saying he was a \"useful initial\" but now he's considering joining another party. He didn't confirm his departure from UKIP just yet.\n\nThe meeting with East Midlands constituents is important because it happened right after joining the party, so maybe there were some events or interactions there that show his motivations.\n\nUKIP lost the European elections but had a chance to strengthen their base and they faced criticism for not having policies. They have no spokespeople or energy, which makes sense why they didn't succeed in advancing.\n\nHe accused his fellow MEPs of being content with how they're handling things in Brussels. He said he tried to change the party by nags all summer, but it's unclear if that worked.\n\nHis conviction hasn't changed, so he'll continue his campaign outside UKIP. People are upset about the new party plans and the lack of support for him at home.\n\nI should make sure to cover all these points: his departure from UKIP, his reasons, his future actions, the impact on other members, the EU elections, and the internal dynamics with his party members.\n\nLet me structure this into a concise summary without adding any explanations or formatting.\n</think>\n\nRobert Kilroy-Silk has announced his departure from the UK Independence Party (UKIP), where he accused it of being a joke and expressed plans to run for the next general election. He remains an MEP, but his future may be uncertain as he seeks confirmation about setting up a new political party, Veritas. Meanwhile, former UKIP leader Roger Knapman has acknowledged his influence but hinted at possible changes in party leadership following the EU elections. Kilroy-Silk criticized his fellow UKIP MEPs for being \"content with their status quo\" in Brussels and stressed his conviction in Britain's governance principles. His departure from UKIP was a significant event, marking the end of nine months and highlighting internal dynamics within the party.", "tinyllama:1.1b": "Kilroy-Silk quit the UK Independence Party (UKIP) after announcing plans to launch a new political party, Veritas, which he described as a \"joke\". The former chat show host had been an effective member of the party during its European elections campaign. His decision was influenced by the lack of success and chaos within the party, but his reasons have sparked concerns for a possible future split.", "tinydolphin:1.1b": " In the following text, I will provide a brief summary of the provided information:\n\n- Robert Kilroy-Silk resigned from UK Independence Party after joining in 2015.\n- Kilroy-Silk quit the party as it was \"shameful\" and failed to unite its supporters.\n- He plans to stand in the next general election but has not yet confirmed whether he will start a new political party called Veritas.\n- UKIP leader Roger Knapman said he would \"break open the champagne\" over Kilroy-Silk's departure, adding that it was nice knowing him initially.\n- The MEP accused the UKIP leadership of betraying its supporters and becoming a joke in the process.\n- The party's membership had become dominated by rancour as he tried to take over the party leadership, but there is no confirmation on his new political party plans yet.", "phi:2.7b": " Robert Kilroy-Silk, an ex-chat show host who joined UKIP in 2014, has quit the party and accused it of betraying its supporters. He plans to run for re-election in the next general election with a new political party called Veritas, which means truth in Latin. UKIP's leader, Roger Knapman, said he would break open the champagne but did not confirm the formation of a new political party. Kilroy-Silk resigned after nine months due to growing rancour within the party and claims that its leaders have been content with \"sitting on their backsides\" in Brussels. He accused his fellow UKIP MEPs of being unproductive and said he had support from constituents for starting a new party. UKIP won 12 seats at the European elections but did not offer any policies or leadership, leading Kilroy-Silk to quit. There have been reports of him starting a new political party, prompting a formal complaint by UKIP's disciplinary committee. He plans to contest the general election in an East Midlands constituency with his new party. \n", "orca-mini:3b": " Kilroy-Silk quits UKIP, accusing it of betraying its supporters and launching a new political party called Veritas, which means \"truth\" in Latin. He accused his fellow UKIP MEPs of being content with growing fat \"sitting on their backsides\" in Brussels and said there was \"masses of support\" for him to form a new party. UKIP won 12 seats and 16.1% of the vote at the European elections, but its leadership had done nothing and \"gone AWOL\", according to Kilroy-Silk. His conviction in Britain's right to govern itself had not changed, and he would continue that campaign outside UKIP when he contested the general election in an East Midlands constituency. Reports of his new party plans have prompted a formal complaint to UKIP's disciplinary committee for bringing the party into \"disrepute\".", "hermes3:3b": "Kilroy-Silk leaves UKIP, calling it 'shameful' and accusing party of betrayal. He quit after nine months, claiming no policies or energy within the party.", "stablelm-zephyr:3b": "Robert Kilroy-Silk, former chat show host and ex-member of UKIP, has quit the party and accused it of betraying its supporters. He claimed UKIP was a \"joke\" and described his own decision to leave as being \"ashamed\". Kilroy-Silk criticized the party's lack of direction and policies, saying it was dominated by rancor and he wanted to form a new party focused on Britain's right to govern itself. While UKIP leader Roger Knapman thanked Kilroy-Silk for his initial contributions, he also confirmed that Kilroy-Silk had been \"quite useful initially.\"", "chatgpt-4o-latest": "Robert Kilroy-Silk has resigned from the UK Independence Party (UKIP), calling it a \"joke\" and accusing it of betraying its supporters. He expressed regret for joining the party and criticized its leadership for lacking vision and action. Kilroy-Silk, who had attempted to take over UKIP's leadership, hinted at forming a new political party but did not confirm it. UKIP leader Roger Knapman dismissed his departure, stating Kilroy-Silk had been more focused on himself than the party. Kilroy-Silk accused UKIP MEPs of complacency and claimed there was strong support for his potential new party. His resignation follows UKIP's success in the European elections, where it won 12 seats, but he argued the party had squandered its opportunity. UKIP officials had begun proceedings that could have led to his expulsion, and they have now challenged him to resign as an MEP so a true UKIP representative can take his place.", "stablelm2:1.6b": "Ex-chat show host Robert Kilroy-Silk has left the UK Independence Party (UKIP) and accused them of betraying supporters. Kilroy-Silk will stand in the next general election but hasn..\nReasons for his departure include accusations that he was more interested in starting a new political party rather than focusing on UK Independence Party tasks, such as lobbying in Brussels. Despite this, UKIP leader Roger Knapman said they would \"break open the champagne\" and remember Kilroy-Silk as a \"useful initially.\" \n\nKilroy-Silk's decision to quit came after an extended period of tension within UKIP due to his efforts to take over the party leadership. He accused fellow UKIP MEPs of contentment while sitting on their backsides in Brussels.\n\nIn his speech, Kilroy-Silk said that UKIP's leadership had failed to deliver any policies, energy or vision and no spokespeople; instead, they vanished \"going AWOL\". Mr. Kilroy-Silk also claimed that his conviction in Britain's right to govern itself has not changed. He will continue this campaign outside UKIP when he contests the general election in an East Midlands constituency.\n\nKilroy-Silk's decision to leave has prompted a formal complaint from UKIP against him, stating that it brought the party into disrepute due to his new party plans. However, Mr Kilroy-Silk refused to confirm whether or not Veritas would become a factored entity; he merely said there was \"masses of support\" for his idea.", "granite3.1-dense:2b": "Robert Kilroy-Silk, formerly an MEP for UK Independence Party (UKIP), has resigned from the party, expressing shame and accusing it of betrayal. He claims UKIP's leadership is complacent in Brussels, lacking policies, energy, vision, and spokespeople despite their significant European election victory (12 seats and 16.1% of the vote). Kilroy-Silk aims to contest the upcoming general election from an East Midlands constituency, advocating for Britain's right to self-governance. Despite rumors of forming a new party called Veritas (Latin for truth), he has not confirmed this. UKIP leader Roger Knapman acknowledged his initial influence but stated that Kilroy-Silk became more focused on his own \"Robert Kilroy-Silk Party.\" The party has filed a formal complaint against Kilroy-Silk for bringing disrepute, challenging him to step down as an MEP.", "reference": "Mr Knapman rejected the idea Mr Kilroy-Silk posed a threat to UKIP and queried why he had failed to confirm rumours he was starting a new political party.\"He has remarkable ability to influence people but, sadly, after the (European) election it became clear that he was more interested in the Robert Kilroy-Silk Party than the UK Independence Party so it was nice knowing him, now 'goodbye',\" Mr Knapman told BBC Radio 4's Today programme.On Thursday, the party challenged Mr Kilroy-Silk to stand down as an MEP so voters can get a genuine UKIP candidate.\"The party is going nowhere and I'm embarrassed with its allies in Europe and I'm ashamed to be a member of the party,\" said Mr Kilroy-Silk.Mr Kilroy-Silk also told Sky News there was \"masses of support\" for him to form a new party - something he has yet to confirm will happen.The MEP said he was ashamed to have joined the party, which he labelled as a \"joke\".Ex-chat show host Robert Kilroy-Silk has quit the UK Independence Party and accused it of betraying its supporters.UKIP won 12 seats and 16.1% of the vote at the European elections on the back of its call for the UK to leave the European Union In his speech, Mr Kilroy-Silk says the result offered UKIP an \"amazing opportunity\" but the party's leadership had done nothing and \"gone AWOL\".Mr Kilroy-Silk accused his fellow UKIP MEPs of being content with growing fat \"sitting on their backsides\" in Brussels."}