{"raw_text": "UKIP candidate suspended in probe\n \n Eurosceptic party UKIP have suspended a candidate for allegedly suggesting the criminally insane should be killed.\n \n John Houston, 54, was due to stand in the East Kilbride seat in Lanarkshire at the next election. But he was suspended after his reported views, including the return of the British Empire, were sent to two Scottish newspapers. UKIP spokesman Mark Croucher said those who selected Mr Houston knew nothing of his views. The episode comes at a difficult time for UKIP, soon after the high-profile departure of MEP Robert Kilroy-Silk. Mr Houston is alleged to have said that the organs of the criminally insane should be \"made available to law-abiding members of the community\" and proposed the legalisation of drugs and the sex trade. The document reportedly said: \"We're looking for the resurrection of the British Empire. \"The problems for the human race - environmental and others - can only be dealt with on a global scale, and that calls for a radical alliance of the English-speaking nations, which they are uniquely able to do.\" Mr Croucher said the main issue would be that Mr Houston's reported views had been presented as UKIP policy, which they were not. He said they might have been submissions to a committee working on the party's manifesto, but would not have been matched to Mr Houston when he was standing to become a candidate. He told BBC News: \"He appears to have said these things. We have suspended him as a member and as a candidate. \"By all accounts none of this was mentioned at his selection meeting. \"It is simply a distraction from the task in hand, the EU constitution, not individual idiocies.\" Mr Houston was quoted in the Herald newspaper saying: \"I feel UKIP have over-reacted and overshot the runway.\"\n \n Peter Nielson, who is UKIP Scotland chairman, said he had suspended Mr Houston on Friday night. \"He will remain suspended while the matter is being investigated and then we will decide if and what further action will be taken.\" He said that any evidence would be looked into and Mr Houston may be interviewed by the party. He added: \"I can't comment too much at the moment, I have one version from him but I haven't seen the papers yet.\"\n", "llama3.2:1b": "UKIP candidate John Houston has been suspended for allegedly suggesting that organs of the criminally insane should be made available to law-abiding members of the community. He also proposed the legalization of drugs and the sex trade as part of a radical alliance with English-speaking nations. The suspension comes after his views were reported in two Scottish newspapers, which the party believes were not officially endorsed by Houston.", "llama3.2:3b": "UKIP suspends candidate John Houston after he allegedly suggested killing people with criminal insanity and proposed legalization of drugs and sex trade in a document sent to Scottish newspapers.", "gemma2:2b": "UKIP candidate John Houston has been suspended for allegedly suggesting the criminally insane should be killed. His comments were sent to newspapers and reportedly included proposals about drug legalization and the sex trade, alongside a desire for the resurrection of the British Empire.  Mr. Houston denies that his views represent UKIP policy. The party is currently embroiled in controversy after Robert Kilroy-Silk's departure. \n", "qwen2.5:0.5b": "UKIP suspended a candidate due to reportedly suggesting the criminally insane should be killed, while a Westminster Council member was suspended because he had reported views that were not part of his EU manifesto.", "qwen2.5:1.5b": "UKIP has suspended a candidate over alleged comments suggesting criminally insane people should be killed and promoting British imperialism, following Robert Kilroy-Silk's departure. John Houston was suspended after being reported to Scottish newspapers for his views on organ donation, drug legalization, and the sex trade. The party denies that Mr Houston endorsed these policies and suspends him pending investigation.", "qwen2.5:3b": "UKIP candidate John Houston, 54, was suspended after allegedly suggesting the criminally insane should be killed and proposing legalisation of drugs and sex trade. The incident occurred during UKIP's probe when his views were sent to Scottish newspapers. This comes amid difficulties for UKIP following the departure of MEP Robert Kilroy-Silk. Houston is alleged to have supported the resurrection of the British Empire and a global alliance among English-speaking nations. UKIP spokesman Mark Croucher confirmed that no one knew about Houston's views at his selection meeting, arguing they were not part of UKIP policy but possible committee submissions. Suspended indefinitely, Houston may face further action after investigation by UKIP Scotland chairman Peter Nielsen.", "opencoder:1.5b": "The key idea in this summary is to focus on the suspension of John Houston for allegedly suggesting the criminally insane should be killed, while keeping the rest of the text as simple and clear as possible. The text provided is a condensed summary of the original text, removing any extra explanations or formatting.\n", "smollm:1.7b": "The UKIP candidate suspended in probe is accused of suggesting the criminally insane should be killed. The alleged views were sent to two Scottish newspapers. UKIP spokesman Mark Croucher said those who selected Mr Houston knew nothing of his views. The episode comes at a difficult time for UKIP, soon after the high-profile departure of MEP Robert Kilroy-Silk. UKIP candidate John Houston is accused of suggesting the criminally insane should be killed. He allegedly said that the organs of the criminally insane should be \"made available to law-abiding members of the community\" and proposed the legalisation of drugs and the sex trade. The document reportedly said: \"We're looking for the resurrection of the British Empire. \"The problems for the human race - environmental and others - can only be dealt with on a global scale, and that calls for a radical alliance of the English-speaking nations, which they are uniquely able to do.\" UKIP candidate John Houston is accused of suggesting the criminally insane should be killed. He allegedly said that the organs of the criminally insane should be \"made available to law-abiding members of the community\" and proposed the legalisation of drugs and the sex trade. The main issue would be that Mr Houston's reported views had been presented as UKIP policy, which they were not. He said they might have been submissions to a committee working on the party's manifesto, but would not have been matched to Mr Houston when he was standing to become a candidate. He told BBC News: \"He appears to have suggested these things. We have suspended him as a member and as a candidate.\" By all accounts none of this was mentioned at his selection meeting. It is simply a distraction from the task in hand, the EU constitution, not individual idiocies. UKIP candidate John Houston is accused of suggesting the criminally insane should be killed. He allegedly said that the organs of the criminally insane should be \"made available to law-abiding members of the community\" and proposed the legalisation of drugs and the sex trade. The main issue would be that Mr Houston's reported views had been presented as UKIP policy, which they were not. He said they might have been submissions to a committee working on the party's manifesto, but would not have been matched to Mr Houston when he was standing to become a candidate. He told BBC News: \"I can't comment too much at the moment, I have one version from him but I haven't seen the papers yet.\"", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text about a UKIP candidate being suspended in a probe. Let me read through it carefully.\n\nThe first sentence mentions that Eurosceptic party UKIP has suspended a candidate for allegedly suggesting the criminally insane should be killed. The candidate is John Houston, who was due to run in an election seat. But he was suspended after his views were reported by two Scottish newspapers. I'm not too familiar with the specifics of this case, but it seems like the issues are about the criminal insane and drug laws.\n\nThen there's a mention of Mr. Croucher, UKIP's spokesman, saying that none of Mr. Houston's views were policy, so they were just distractions. He told BBC News, saying he suspended him as a candidate and that any evidence would be looked into later.\n\nMr. Nielson, the chairman of UKIP Scotland, also mentioned suspending Houston on Friday night. He said that if there's evidence, they'll investigate further. I'm not sure about his stance or what specific actions will happen now. He doesn't see the papers yet, which makes me think he might be waiting for more information.\n\nI need to keep only the summary in plain text without explanations or formatting. So, I should capture all key points: the suspension, the reasons (reputations of the party and the issues with the candidates), the report from Mr. Croucher about Houston's views, and Mr. Nielson's decision to suspend him while investigating.\n\nI also need to make sure that my summary accurately reflects each point mentioned in the text without adding any extra information or interpretation beyond what's necessary.\n</think>\n\nJohn Houston was suspended by UKIP after his reported views were sent to Scottish newspapers. The suspension came after two reports highlighted issues with drug abuse and the sex trade, which were later alleged to be part of Houston's claims. Mr. Croucher, the party's spokesman, dismissed Houston as a distraction from their manifesto and said he would suspend him as both a candidate and while investigating further. Peter Nielson, UKIP Scotland chairman, suspended Houston on Friday night, stating plans for evidence investigation and potential interviews with him.", "tinyllama:1.1b": "The UKIP candidate John Houston was suspended after his reported views included proposing that criminals be killed for their insanity, suggesting the legalization of drugs and the sex trade. He was due to stand in the East Kilbridie seat in Lanarkshire, but he was suspended by UKIP after his alleged views were sent to two Scottish newspapers. The party issued a statement saying that Mr Houston's \"main issue\" was a possible resurrection of the British Empire and he proposed radical changes such as legalizing drugs and organ-harvesting for law-abiding citizens. The suspension came at a difficult time for UKIP, who were soon after the high-profile departure of Robert Kilroy-Silk, following allegations of drug dealing and organ-harvesting. UKIP chairman Peter Nielson said that Mr Houston was suspended \"while the matter is being investigated\" and would be interviewed by the party if any evidence emerged.", "tinydolphin:1.1b": " In summary, the text mentions that a UKIP candidate was suspended for allegedly suggesting that the criminal insane should be killed and that he made comments on the return of the British Empire. The main reason for suspending him is that it appears his statements were presented as party policy during a campaign.", "phi:2.7b": " A UK Independence Party (UKIP) candidate has been suspended for allegedly suggesting that the criminally insane should be killed and proposing policies such as legalising drugs and the sex trade. UKIP spokesperson Mark Croucher said they knew nothing of his views, which were reported to two Scottish newspapers. The episode comes at a difficult time for UKIP after a high-profile departure of an MEP.\n", "orca-mini:3b": " UKIP candidate John Houston has been suspended after he reportedly suggested the criminally insane should be killed and proposed the legalization of drugs and the sex trade. His reported views were presented as UKIP policy, which they were not, and he may have made submissions to a committee working on the party's manifesto but not matched to him when he was standing to become a candidate.", "hermes3:3b": "UKIP suspends candidate John Houston over comments suggesting criminally insane should be killed, with additional views on British Empire resurrection and drug legalization.", "stablelm-zephyr:3b": "A UKIP candidate named John Houston was suspended after he expressed controversial views about the criminally insane, suggesting their organs should be available to law-abiding members of society. His views also included the legalization of drugs and the sex trade. UKIP spokesman Mark Croucher stated that these views were not representative of the party's policy and were likely submissions for a committee working on the manifesto but weren't matched to Houston when he was selected as a candidate. Peter Nielson, UKIP Scotland chairman, suspended Houston and will decide further action after an investigation.", "chatgpt-4o-latest": "UKIP has suspended candidate John Houston after reports surfaced that he suggested the criminally insane should be killed and advocated for the return of the British Empire. Houston, who was set to stand in East Kilbride, allegedly made controversial statements on organ donation, drug legalization, and the sex trade. UKIP spokesman Mark Croucher emphasized that Houston’s views were not party policy and that those who selected him were unaware of them. The suspension comes at a challenging time for UKIP, following the departure of MEP Robert Kilroy-Silk. UKIP Scotland chairman Peter Nielson stated that Houston will remain suspended while the matter is investigated. Houston criticized the party’s response, calling it an overreaction.", "stablelm2:1.6b": "UKIP candidate John Houston has been suspended for allegedly suggesting that mentally ill people should be killed in a political speech reportedly submitted to two Scottish newspapers. The East Kilbride seat in Lanarkshire is set for an election, although Houston was suspended before it could take place. UKIP spokesman Mark Croucher says the views were not representative of their party's stance and could have been submissions to a committee working on the manifesto. No evidence has been presented against him yet. Mr. Houston denies any wrongdoing and claims that UKIP over-reacted.", "granite3.1-dense:2b": "UKIP, a UK-based eurosceptic political party, has suspended candidate John Houston, 54, following the publication of his alleged views in two Scottish newspapers. These views, reportedly submitted to a committee working on the party's manifesto, include advocating for the resurrection of the British Empire and proposing the legalization of drugs and the sex trade, as well as suggesting the use of criminally insane individuals' organs for law-abiding citizens. Houston was set to run in the East Kilbride seat at the upcoming election. UKIP spokesman Mark Croucher stated that those involved in his selection were unaware of these views, emphasizing that they should not be associated with UKIP policy. UKIP Scotland chairman Peter Nielson confirmed Houston's suspension and stated he would remain suspended until the investigation concludes, potentially leading to further disciplinary action based on evidence.", "reference": "Peter Nielson, who is UKIP Scotland chairman, said he had suspended Mr Houston on Friday night.UKIP spokesman Mark Croucher said those who selected Mr Houston knew nothing of his views.He said they might have been submissions to a committee working on the party's manifesto, but would not have been matched to Mr Houston when he was standing to become a candidate.He said that any evidence would be looked into and Mr Houston may be interviewed by the party.Mr Croucher said the main issue would be that Mr Houston's reported views had been presented as UKIP policy, which they were not.Mr Houston was quoted in the Herald newspaper saying: \"I feel UKIP have over-reacted and overshot the runway.\"Mr Houston is alleged to have said that the organs of the criminally insane should be \"made available to law-abiding members of the community\" and proposed the legalisation of drugs and the sex trade.Eurosceptic party UKIP have suspended a candidate for allegedly suggesting the criminally insane should be killed."}