{"raw_text": "Boothroyd calls for Lords speaker\n \n Betty Boothroyd has said the House of Lords needs its own Speaker and that peers should lead the way on reforming the upper chamber.\n \n Baroness Boothroyd, who was the first woman to be Commons Speaker, said she believed Tony Blair initiated reforms without a clear outcome in mind. \"Now we have to take care of it ourselves and make the best of it,\" she told the BBC's Breakfast with Frost. In 1999 Labour removed all but 92 of the Lords' 750 hereditary peers. That was billed as the first stage of reform of the institution. The lord chancellor hinted further reforms could be unveiled in the next Labour manifesto.\n \n \"I think we need to look very carefully at the relationship between the Lords and the Commons,\" Lord Falconer told BBC1's Breakfast With Frost. \"How it interacts with the Commons is a very, very important issue. \"We need to address the issue in the manifesto, but you will have to wait for when the manifesto comes.\" The lord chancellor currently has the role of House of Lords speaker. He is also head of the judiciary and a member of the Cabinet as constitutional affairs secretary.\n \n Lady Boothroyd said she believed it was unacceptable for the lord chancellor to have the role of Speaker. \"I would really like to see a Speaker of the House of Lords,\" she said. \"I don't go for the idea of somebody - a lord chancellor - who is head of the judiciary, a senior Cabinet minister and Speaker of the Lords. \"I want somebody there who is going to look after that House and do a job there.\n", "llama3.2:1b": "Betty Boothroyd calls for a new Speaker and believes peers should lead on reforming the upper chamber. Tony Blair initiated reforms without clear outcome in mind, but now it's up to parliament to address the issue. The lord chancellor holds both judiciary and Cabinet positions, and Boothroyd wants someone who is solely responsible for the House of Lords.", "llama3.2:3b": "Betty Boothroyd calls for the House of Lords to have its own Speaker, citing concerns about the current arrangement with Lord Chancellor. She believes the lord chancellor's multiple roles create conflict of interest and undermine the independence of the upper chamber.", "gemma2:2b": "Betty Boothroyd advocates for an independent speaker in the House of Lords. She believes Tony Blair's reforms without a clear plan were incomplete, and calls for peers to take charge of reform.  Lord Falconer agrees with Boothroyd about the need for reform and addressing the relationship between the Houses of Commons and Lords but notes that details will be revealed in the upcoming Labour manifesto. Lady Boothroyd specifically objects to the Lord Chancellor holding this dual role and wishes for an independent Speaker to manage the House. \n", "qwen2.5:0.5b": "Key points:\n- Baroness Boothroyd says the House of Lords needs its own Speaker.\n- Baroness Boothroyd believes Tony Blair initiated reforms without clear outcome, calling for further action.\n- Lord Falconer suggests Lords and Commons should work together on reform.\n- Lady Boothroyd is against a lord chancellor having the Speaker role.\n- The current Lord Chancellor holds the position of House of Lords Speaker.", "qwen2.5:1.5b": "Baroness Boothroyd calls for the establishment of a separate Lords Speaker and believes reforming the House of Lords should be led by peers in their manifesto.", "qwen2.5:3b": "Betty Boothroyd calls for a Speaker for the House of Lords, advocating reforms and criticizing Tony Blair's lack of clear outcome in 1999 when Labour removed most hereditary peers. She believes Lord Falconer’s current role as both House of Lords speaker and head of judiciary is problematic, suggesting a need for a dedicated individual to focus solely on the work of the upper chamber.", "opencoder:1.5b": "\"Boothroyd calls for Lords speaker. In 1999, Baroness Boothroyd, who was a Commons Speaker, felt Tony Blair was initiating reforms without any clear outcome in mind. \"Now we have to take care of it ourselves and make the best of it,\" she said. She told the BBC's Breakfast with Frost that 92 out of the 750 hereditary Lords peers were removed for reforming the institution. That bill was labeled as the first stage of the reforms proposed by the House of Lords.\"\n", "smollm:1.7b": "The summary above captures the main ideas in the text:\n\n1. The speaker for the House of Lords needs to be appointed by the House of Commons, not the other way around as Baroness Betty Boothroyd has said.\n2. Tony Blair initiated reforms without a clear outcome in mind and removed all but 92 of the Lords' 750 hereditary peers. This was billed as the first stage of reform of the institution.\n3. The House of Lords needs to be looked after by someone who is not a member of the judiciary, as Lord Falconer has said.\n4. Lady Betty Boothroyd believes it is unacceptable for the lord chancellor to have the role of Speaker. She wants someone there who is going to look after that House and do a job there.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely while preserving key ideas and details. Let me read through it carefully.\n\nBoothroyd calls for a separate Speaker, not just from the Lords. Peers should lead reform efforts in the upper chamber. There's mention of Baroness Boothroyd being the first woman as Commons Speaker. She criticized Tony Blair without an intended outcome, citing Labour's 1999 reforms removing many hereditary peers.\n\nLord Falconer suggested addressing this issue in the manifesto waiting for it to be revealed. The lord chancellor is currently the House of Lords speaker and head of judiciary with Cabinet responsibilities.\n\nBoothroyd opposed having the lord chancellor as Speaker and wants a new Speaker dedicated to the House of Lords.\n</think>\n\nBoothroyd calls for a separate Speaker, not just from the Lords. Peers should lead reform efforts in the upper chamber. There's mention of Baroness Boothroyd being the first woman as Commons Speaker. She criticized Tony Blair without an intended outcome, citing Labour's 1999 reforms removing many hereditary peers. Lord Falconer suggested addressing this issue in the manifesto waiting for it to be revealed. The lord chancellor is currently the House of Lords speaker and head of judiciary with Cabinet responsibilities. Boothroyd opposed having the lord chancellor as Speaker and wants a new Speaker dedicated to the House of Lords.", "tinyllama:1.1b": "Betty Boothroyd argues for the establishment of a Speaker in the House of Lords, noting Tony Blair's initiative without a clear outcome in mind. She suggests further reforms could be unveiled in future manifestos, but cautions against appointing Lord Falconer to the role of speaker until the next Labour manifesto is released. Lady Boothroyd believes that the lord chaNCelloR should not hold the role of Speaker, as it would be an \"unacceptable\" appointment for someone holding the judiciaRy and Cabinet posts simultaneously.", "tinydolphin:1.1b": " Ladies and gentlemen, I am Dolphin, here to provide you with an overview of the text provided. The text discusses the recommendation for a new Speaker for the House of Lords by Betty Boothroyd. Boothroyd has stated that the House of Lords should have its own Speaker, and that peers should take charge on reforms for reforming the upper chamber. Baroness Boothroyd claims Tony Blair initiated reforms without a clear outcome in mind, but she feels it's time to take care of it themselves. In 1999, Labour removed all but 92 of the Lords' hereditary peers, making reform an essential part of their first stage of reform. The lord chancellor hints at further reforms in future Labour manifestos, hinting that they may involve addressing the relationship between the Commons and the Lords. Lady Boothroyd also believes the current House of Lords speaker is not suitable for the role, suggesting someone from outside the judiciary or Cabinet should take up the position.", "phi:2.7b": " The article discusses Betty Boothroyd's call for the House of Lords to have its own Speaker, stating that Tony Blair initiated reforms without a clear outcome in mind and that further changes could be made in the next Labour manifesto. Lady Boothroyd believes it is unacceptable for the lord chancellor to hold the role of Speaker and would prefer someone who is solely focused on looking after the house.\n", "orca-mini:3b": " Betty Boothroyd called for the House of Lords to have its own Speaker and peers to lead the way on reforming the upper chamber. The Lord Chancellor currently holds the role of House of Lords speaker, and it was billed as the first stage of reform in 1999 when Labour removed all but 92 hereditary peers. Lady Boothroyd believed it was unacceptable for the lord chancellor to have the role of Speaker and wanted a Speaker of the House of Lords.", "hermes3:3b": "Betty Boothroyd calls for House of Lords Speaker, believes upper chamber needs reform.", "stablelm-zephyr:3b": "Baroness Betty Boothroyd calls for a separate House of Lords Speaker, suggesting peers should lead reforms. She criticizes Tony Blair's undefined reform goals and urges addressing the relationship between the Lords and Commons in future manifestos. Lady Boothroyd believes it is unsuitable for the current Lord Chancellor to hold both roles as House of Lords speaker and head of judiciary.", "chatgpt-4o-latest": "Betty Boothroyd has called for the House of Lords to have its own Speaker and for peers to lead reform efforts. She criticized Tony Blair’s reforms as lacking a clear outcome and emphasized the need for the Lords to take responsibility for further changes. In 1999, Labour reduced the number of hereditary peers, with further reforms hinted at for the next manifesto. Lord Falconer stressed the importance of defining the Lords' relationship with the Commons. Boothroyd opposed the lord chancellor holding multiple roles, including Speaker, and advocated for a dedicated Speaker to oversee the Lords' affairs.", "stablelm2:1.6b": "Betty Boothroyd proposes having a separate House of Lords Speaker to address concerns about the relationship between the two chambers. Baroness Boothroyd believes Tony Blair initiated reforms without a clear outcome, so it's up to peers to lead the reform effort in the next Labour manifesto. Lord Chancellor has both role of Speaker and judicial position due to inheritance from her husband, sparking debate on appropriate appointment for House of Lords. Lady Boothroyd prefers a dedicated Speaker to oversee the chamber.", "granite3.1-dense:2b": "Baroness Betty Boothroyd advocates for a separate Speaker for the House of Lords, arguing that current Lord Chancellor David Laws should not hold this role due to his other responsibilities as head of the judiciary and Cabinet member for constitutional affairs. Boothroyd believes the Lords need its own leader to oversee reforms initiated by Tony Blair in 1999, which removed most hereditary peers. She emphasizes the importance of addressing the interaction between the Lords and Commons in future Labour manifestos.", "reference": "The lord chancellor currently has the role of House of Lords speaker.\"I don't go for the idea of somebody - a lord chancellor - who is head of the judiciary, a senior Cabinet minister and Speaker of the Lords.Lady Boothroyd said she believed it was unacceptable for the lord chancellor to have the role of Speaker.\"I think we need to look very carefully at the relationship between the Lords and the Commons,\" Lord Falconer told BBC1's Breakfast With Frost.Betty Boothroyd has said the House of Lords needs its own Speaker and that peers should lead the way on reforming the upper chamber.\"I would really like to see a Speaker of the House of Lords,\" she said."}