{"raw_text": "Civil servants in strike ballot\n \n The UK's biggest civil service union is to ballot its 290,000 members on strikes in protest at government plans to extend their pension age to 65.\n \n The Public and Commercial Services Union will co-ordinate any action with up to six other public sector unions. Unions have already earmarked 23 March for a one-day strike which could involve up to 1.4 million UK workers. The government says unions will be consulted before any changes are made to the pension system.\n \n PCS leader Mark Serwotka warned there could be further walkouts unless there was a government rethink.\n \n \"For a government that lectures everyone on choice - choice on public service, choice on this and choice on that - isn't it ironic that they're saying to public sector workers there is no choice,\" he said. \"If you want the pension you were promised when you started you must work for an extra five years - that is working until people drop. \"In the 20th century, it's completely unacceptable.\" BBC correspondent Stephen Cape said the combined unions represented \"a formidable force\" which could embarrass the government in the run-up to the General Election. A stoppage involving civil servants, in particular, could seriously disrupt or close government departments, agencies and museums, he said.\n \n Opposition to raising the retirement age is \"one thing all the unions are agreed on\", our correspondent added. Unison's 800,000 workers, the Transport and General Workers' Union's 70,000 and Amicus' 20,000 are among those being balloted about a 23 March walkout. Deputy Prime Minister John Prescott held a private meeting with senior union figures on Thursday night. Our correspondent said that he understood no deal had been offered in that meeting but that there was room for further negotiations. There was \"some possibility\" of the strike action being avoided, he added.\n", "llama3.2:1b": "The Public and Commercial Services Union (PCS) is balloting its 290,000 members on strikes in protest against government plans to extend their pension age to 65. The union, along with six other public sector unions, will coordinate any action with up to six other unions. A one-day strike on March 23 could involve up to 1.4 million UK workers and could lead to further walkouts unless there is a government rethink of the pension system or consulting process. The PCS has warned that it may call for more strikes if there are no changes made.", "llama3.2:3b": "The UK's Public and Commercial Services Union will ballot its 290,000 members on strikes against plans to extend the pension age to 65. The unions have planned a one-day strike for March 23 involving up to 1.4 million workers. PCS leader Mark Serwotka warned of further action unless the government reconsiders. Deputy Prime Minister John Prescott met with senior union figures, but no deal was offered.", "gemma2:2b": "The UK's biggest civil service union is planning a strike ballot due to government plans to raise the retirement age to 65. The PCS union will co-ordinate with other public sector unions on a one-day strike on March 23rd. Unions are opposing this move and the government is expected to engage in further negotiations.  \n", "qwen2.5:0.5b": "A UK government plans to extend pension age from 60 to 65 for civil servants, and workers will vote if they agree. Some unions are protesting against it. Civil servant unions are in a tough spot: they have to choose between striking and not. The union leader says there should be \"no choice\" for civil servants.", "qwen2.5:1.5b": "The Public and Commercial Services Union is organizing a 23 March one-day strike by 1.4 million UK workers protesting against plans to extend pension age to 65, warning that further walkouts could disrupt public services. The government has said it will consult unions before making changes to the pension system. This marks the largest civil service strike in history and poses a significant threat to government operations if carried out.", "qwen2.5:3b": "UK's biggest civil service union PCS plans to ballot its 290,000 members on potential strikes due to government plans to extend pension age to 65. The Public and Commercial Services Union will coordinate with up to six other public sector unions in a one-day strike planned for March 23 involving potentially over 1.4 million UK workers. PCS leader Mark Serwotka warns of further walkouts if the government does not reconsider plans. Unions have already expressed opposition, with Deputy Prime Minister John Prescott meeting with union figures privately. The potential disruption highlights the combined unions' significant influence ahead of the General Election.", "opencoder:1.5b": "The UK's biggest civil service union is to ballot its 290,000 members on strikes in protest at government plans to extend their pension age to 65. The government says unions will be consulted before any changes are made to the pension system. The Public and Commercial Services Union will co-ordinate any action with up to six other public sector unions. Unions have already earmarked 23 March for a one-day strike which could involve up to 1.4 million UK workers. The leader of the union, Mark Serwotka warned that there could be further walkouts unless there was a government rethink. \"For a government that lectures everyone on choice - choice on public service, choice on this and choice on that - isn't it ironic that they're saying to public sector workers there is no choice,\" he said. \"If you want the pension you were promised when you started you must work for an extra five years - that is working until people drop.\" The BBC correspondent Stephen Cape said the combined unions represented a formidable force which couldAttrsack the government in the run-up to the General Election. A stoppage involving civil servants, in particular, could seriously disrupt or close government departments, agencies and museums.\n", "smollm:1.7b": "The UK's biggest civil service union is to ballot its 290,000 members on strikes in protest at government plans to extend their pension age to 65. The Public and Commercial Services Union will co-ordinate any action with up to six other public sector unions. Unions have already earmarked 23 March for a one-day strike which could involve up to 1.4 million UK workers. The government says unions will be consulted before any changes are made to the pension system.\nPCS leader Mark Serwotka warned there could be further walkouts unless there was a government rethink. \"For a government that lectures everyone on choice - choice on public service, choice on this and choice on that - isn't it ironic that they're saying to public sector workers there is no choice,\" he said. If you want the pension you were promised when you started you must work for an extra five years - that is working until people drop. In the 20th century, it's completely unacceptable.\"\nThe combined unions represented \"a formidable force\" which could embarrass the government in the run-up to the General Election. A stoppage involving civil servants, in particular, could seriously disrupt or close government departments, agencies and museums, he said. Opposition to raising the retirement age is one thing all the unions are agreed on\", our correspondent added.\nThere was \"some possibility\" of the strike action being avoided, he added. There was \"some possibility\" of the strike action being avoided, but there was no guarantee that this would happen. The government had offered a deal to the unions in the meeting with senior union figures on Thursday night, but it is unclear what form this might take.\nThe UK's biggest civil service union is to ballot its 290,000 members on strikes in protest at government plans to extend their pension age to 65. The Public and Commercial Services Union will co-ordinate any action with up to six other public sector unions. Unions have already earmarked 23 March for a one-day strike which could involve up to 1.4 million UK workers. The government says unions will be consulted before any changes are made to the pension system.\nPCS leader Mark Serwotka warned there could be further walkouts unless there was a government rethink. \"For a government that lectures everyone on choice - choice on public service, choice on this and choice on that - isn't it ironic that they're saying to public sector workers there is no choice,\" he said. If you want the pension you were promised when you started you must work for an extra five years - that is working until people drop. In the 20th century, it's completely unacceptable.\"\nThe combined unions represented \"a formidable force\" which could embarrass the government in the run-up to the General Election. A stoppage involving civil servants, in particular, could seriously disrupt or close government departments, agencies and museums, he said. Opposition to raising the retirement age is one thing all the unions are agreed on\", our correspondent added.\nThere was \"some possibility\" of the strike action being avoided, but there was no guarantee that this would happen. The government had offered a deal to the unions in the meeting with senior union figures on Thursday night, but it is unclear what form this might take.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text into one concise paragraph without any extra explanations or formatting. First, I'll read through the entire text to understand the main points.\n\nThe UK's largest civil service union is responsible for ballot papers on strikes in protest against extending pension age to 65. They're coordinating with up to six other unions, and by March, they could have thousands of workers striking. The government plans to consult on any changes. PCS leader Mark Serwotka says there might be further walkouts unless the government rethink.\n\nThe combined unions, including Public and Commercial Services, Transport and General Workers, Amicus, are voting on a possible strike or walkout from March 23rd. These groups have 1.4 million workers in strikes. The BBC said this could disrupt government departments, causing concern for the election. The meeting with the deputy prime minster didn't reach an agreement but showed there's space to negotiate further.\n\nI need to capture all these points concisely. I'll mention the unions, their coordination, the potential strike or walkout date, the consultation process by the government, and the opposition's concerns about pension age increases.\n</think>\n\nThe UK's largest civil service union is responsible for ballot papers on strikes against extending pension age to 65. They coordinate with up to six other unions, risking thousands of workers striking by March when they could meet up to 1.4 million workers. The government plans to consult changes to the pension system. The Public and Commercial Services Union, along with others, will vote on a potential strike or walkout from March 23rd, involving over 1.4 million workers. A stoppage could disrupt government departments and worry about the election for the General Election, as opposition unions oppose raising retirement ages.", "tinyllama:1.1b": "The UK's biggest civil service union, the Public and Commercial Services Union (PCS), is to ballot its 290,000 members for strikes in protest at government plans to extend their retirement age to 65. The PCS will co-ordinate any action with six other public sector unions and up to 1.4 million UK workers are expected to participate. PCs leader Mark Servock warns that the government's lecture on choice \"for a government that lectures everyone on choice\" could lead to further walkouts unless there is a government retention of penalties. The combined unions represent an influential force, which could embarrass the government in the run-up to the upcoming General Election, according to BBC correpsondent Stephen Cape. Oposition to raising the retirement age is \"one thing all union leaders are agreed on,\" he added. Union officials say that the strike action would be avoided if there was a deal, and that further negotiations could still occur. The Transport and General Workers' Union (TGWU), Amicus, and Unison are among those being balloted about a 23 March walkout, with more strikes expected. Negotiations have taken place and there is room for future discussions, according to our correspondent.", "tinydolphin:1.1b": " The Civil Service Union (CPS) has voted in favor of a one-day strike ballot, with up to 1.4 million UK workers potentially affected by potential walkouts on March 23. Unions have been cooperating with the PCS leadership to plan any future action. The government's pension age extension plan has left many public sector employees unsatisfied and frustrated. While the union negotiations will continue, it seems inevitable that some form of strike or walkout will happen as a result of this decision.", "phi:2.7b": " The UK's biggest civil service union will ballot its 290,000 members on strikes in protest at government plans to extend their pension age to 65. Unions have already earmarked 23 March for a one-day strike which could involve up to 1.4 million UK workers. Mark Serwotka warned that there could be further walkouts unless there was a government rethink. The combined unions represent a formidable force and could seriously disrupt or close government departments, agencies, and museums if they were involved in the strike action. Opposition to raising the retirement age is one thing all the unions are agreed on. There may be some possibility of avoiding the strike through negotiations.\n", "orca-mini:3b": " The UK's biggest civil service union is planning strikes with Public and Commercial Services Union, co-ordinating with six other public sector unions to protest against government plans to extend their pension age to 65. Unions have already set a one-day strike on March 23, which could affect up to 1.4 million UK workers. The Deputy Prime Minister held a private meeting with senior union figures on Thursday night but no deal was offered, and there is some possibility of the strike action being avoided.", "hermes3:3b": "Civil service UK union ballots members for strikes over plan to extend pension age to 65.", "stablelm-zephyr:3b": "The UK's largest civil service union, PCS, is balloting its 290,000 members on potential strikes against government plans to extend pension age to 65. The Public and Commercial Services Union will coordinate strikes with up to six other public sector unions, potentially involving 1.4 million workers in a one-day strike on 23 March. PCS leader Mark Serwotka warns of further walkouts unless the government rethinks its decision. While opposition to raising the retirement age is unanimous among all unions, there is some possibility that strike action could be avoided, according to Deputy Prime Minister John Prescott.", "chatgpt-4o-latest": "The UK's largest civil service union, the PCS, is balloting 290,000 members on strike action against government plans to raise their pension age to 65. Up to six other public sector unions may coordinate action, with a one-day strike planned for 23 March that could involve 1.4 million workers. PCS leader Mark Serwotka criticized the government for removing choice and warned of further strikes unless policies change. A mass walkout could disrupt government operations and embarrass the government before the General Election. Deputy Prime Minister John Prescott met union leaders, but no deal was reached, though negotiations may continue, potentially averting the strike.", "stablelm2:1.6b": "The biggest civil service union in the UK is balloting members to potentially strike over plans to extend pension age. The Public and Commercial Services Union will coordinate with other unions, aiming for a one-day strike involving up to 1.4 million workers. If not avoided, this could disrupt or close government departments, agencies, and museums. Unions have already planned a March strike, with Civil Service workers representing a \"formidable force\" that could embarrass the government in upcoming elections. Opposition is strong against raising retirement age.", "granite3.1-dense:2b": "The UK's largest civil service union, PCS with 290,000 members, is set to vote on strikes in opposition to the government's plan to extend public sector pensions to age 65 by one day, scheduled for 23 March. This potential strike could involve up to 1.4 million UK workers across various departments and agencies. Unions coordinating with PCS include Unison (800,000), T&G (70,000), and Amicus (20,000). The government has pledged to consult unions before implementing changes, but union leaders argue that this is insufficient. PCS leader Mark Serwotka criticized the government's lack of choice for public sector workers, emphasizing the unfairness of extending work until retirement age. Deputy Prime Minister John Prescott met with union representatives on Thursday, but no deal was offered, leaving room for further negotiations to prevent the strike.", "reference": "BBC correspondent Stephen Cape said the combined unions represented \"a formidable force\" which could embarrass the government in the run-up to the General Election.The UK's biggest civil service union is to ballot its 290,000 members on strikes in protest at government plans to extend their pension age to 65.The government says unions will be consulted before any changes are made to the pension system.The Public and Commercial Services Union will co-ordinate any action with up to six other public sector unions.PCS leader Mark Serwotka warned there could be further walkouts unless there was a government rethink.Unions have already earmarked 23 March for a one-day strike which could involve up to 1.4 million UK workers."}