{"raw_text": "Conservative MP defects to Labour\n \n A Conservative MP and former minister has defected to Labour.\n \n Robert Jackson, 58, MP for Wantage in Oxfordshire, said he was disillusioned with the party's leadership and its \"dangerous\" views on Europe. Prime Minister Tony Blair declared himself \"delighted\", saying Mr Jackson would be warmly welcomed by Labour MPs. Mr Jackson, who has clashed with his leaders over tuition fees and Europe in the past, served as higher education minister between 1987 and 1990. In a letter to his constituency chairman he wrote: \"It is in the country's best interest that Tony Blair rather than Michael Howard should form the next government.\" While saying he admired Mr Blair's \"courageous\" leadership of the country, he bitterly criticised the Conservatives stance on Europe. \"The Conservative Party's hostility to Europe has now hardened to the point at which it advocates the unilateral denunciation of Britain's treaty obligations,\" he wrote.\n \n Mr Blair said Mr Jackson was a \"decent, fair-minded and dedicated public servant... who will be warmly welcome by Labour MPs and members\". \"As he rightly says, [the Conservatives] have learned nothing from their two election defeats and are, if anything, drifting further rightwards,\" he added. A spokesman for Michael Howard said Mr Jackson's views on policy issues were \"very different\" from those of the party leadership. \"He believes students should pay tuition fees, that Tony Blair should not be criticised over his handling of the Iraq war and that more powers should be given to Europe,\" the spokesman said. He added that it was not surprising Mr Jackson had chosen to leave the Conservatives. Mr Jackson is due to stand down at the next election. He is the third Conservative MP to defect to Labour since 1997.\n", "llama3.2:1b": "A Conservative MP, Robert Jackson, defected to Labour. He cited dissatisfaction with the party's leadership and views on Europe as reasons for his departure. Prime Minister Tony Blair welcomed him warmly, stating he was a \"decent, fair-minded and dedicated public servant\". Jackson criticized Michael Howard's stance on policy issues. Jackson is due to stand down at the next election, making him the third Conservative MP to defect since 1997.", "llama3.2:3b": "Conservative MP Robert Jackson, 58, has defected to Labour amid disaffection with party leadership and its views on Europe. He cited a desire for \"courageous\" leadership under Tony Blair over Michael Howard's conservative stance on Europe.", "gemma2:2b": "Robert Jackson, a former Conservative MP and minister, defected to Labour. He criticized the Conservatives' stance on Europe and its leadership under Michael Howard. Prime Minister Tony Blair welcomed Jackson into the Labour party. This move follows the recent defection of two other Conservative MPs to Labour. \n", "qwen2.5:0.5b": "A Conservative MP Robert Jackson, 58, has defected to Labour. He criticized the Conservatives' stance on Europe and clashed with their leadership over tuition fees. His views were \"very different\" from those of the party leadership. Mr Jackson is expected to stand down at the next election.", "qwen2.5:1.5b": "A Conservative MP, Robert Jackson, has defected to the Labour Party after becoming disillusioned with its leadership and views on Europe. Tony Blair welcomed his defection, praising him as a \"decent\" and \"dedicated public servant.\" Jackson believes in tuition fees for students but opposes unilateral denunciation of treaty obligations towards Europe. This follows three other Conservative MPs defecting to Labour since 1997.", "qwen2.5:3b": "Conservative MP Robert Jackson, 58, has defected to Labour after becoming disillusioned with his party's leadership and stance on Europe. Serving as higher education minister between 1987 and 1990, he criticized the Conservatives' hardline views on Europe. In a letter, Jackson endorsed Tony Blair over Michael Howard for forming the next government. Prime Minister Blair welcomed Jackson warmly, praising him as a dedicated public servant. Jackson's stance on tuition fees, Iraq war criticism, and European powers aligns with Labour's policies, explaining his defection despite disagreement over leadership. This marks the third Conservative MP to defect to Labour since 1997.", "opencoder:1.5b": "Conservative MP has defected to Labour, a party that values freedom of expression and education but opposes major European powers. The former Conservative MP, Robert Jackson, said during his term as a chairman of the Oxfordshire constituency, he was discontented with the party's stance on Europe and its challenges. He expressed support for universalism and freedom from state interference but criticized the party's \"dangerous\" views. He supported government policies that promote peace and equality and helped to stabilize Europe during the 1980s. During a letter to his constituency chairman, he wrote: \"Tony Blair has shown great courage in his years as a leader of the Conservative Party. He would rather form the next government than Tony Howard.\" While grumbling about Mr Blair's \"courageous\" leadership, he criticized the conservative stance on European affairs. He criticized its \"unilateral denunciation of Britain's obligations to students and citizens\". He added that the party has learned nothing from their two election defeats and is likely drifting further rightward in government politics. In an interview with The Independent, Mr Jackson praised Mr Blair's \"courageous\" leadership and expressed his \"dedication\", \"a good example of what it means to be a dedicated public servant.\" He was also elected the third Conservative MP to vote in the election.\n", "smollm:1.7b": "Conservative MP and former minister defected to Labour, while Prime Minister Tony Blair declared himself \"delighted\" by the former MP's decision. The former leader of the party had previously served as higher education minister between 1987 and 1990. In a letter to his constituency chairman, he wrote: \"It is in the country's best interest that Tony Blair rather than Michael Howard should form the next government.\" While saying he admired Mr Blair's \"courageous\" leadership of the country, he bitterly criticized the Conservatives stance on Europe. \"The Conservative Party's hostility to Europe has now hardened to the point at which it advocates the unilateral denunciation of Britain's treaty obligations,\" he wrote.\n\nMr Blair said Mr Jackson was a \"decent, fair-minded and dedicated public servant... who will be warmly welcome by Labour MPs and members\". He added that Mr Jackson's views on policy issues were \"very different\" from those of the party leadership. He believes students should pay tuition fees, that Tony Blair should not be criticized over his handling of the Iraq war and that more powers should be given to Europe.\n\nMr Jackson is due to stand down at the next election. He is the third Conservative MP to defect to Labour since 1997.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about a conservativeMP who defected to Labour. First, I'll read through the text carefully.\n\nThe main points are that a former Conservative MP has left Labour, which started when Tony Blair was PM. Robert Jackson is the MP, 58 in Wantage, Oxfordshire. He's disillusioned with the party and thinks their leaders have dangerous views on Europe, especially after Blair and Michael Howard have criticized them.\n\nMr Jackson served as higher ED from 1987-1990. In a letter to his chairman, he said it's the country's best interest for Blair or Howard to form the next government, not one of them. He also criticized Conservatives' stance on Europe and praised Michael Howard but didn't agree with Blair.\n\nThe Conservative Party is said to be hostile to Europe too, opposing Britain's treaties. Their leaders should acknowledge these obligations, whereas Blair and Jackson have been more critical recently.\n\nJacksonian MP is about the third in Labour since 1997. He's leaving now, which shows a trend.\n\nNow, I need to make sure all key points are included: Jackson defected, his background, opinions on Blair and Howard, their criticism, the Conservative stance against Europe, and the context of Labour leadership.\n</think>\n\nA former Conservative MP, Robert Jackson, who is the MP for Wantage in Oxfordshire, has defected to Labour. He was disillusioned with the party's leadership, particularly its \"dangerous\" views on Europe, influenced by Tony Blair's positive remarks and Michael Howard's criticism. Jackson served as a higher education minister from 1987 to 1990 and expressed support for Blair over Howard in a letter to his constituency chairman. He criticized the Conservatives' stance on Europe and praised Michael Howard but expressed disappointment with Blair. Now, he is due to stand down at the next election, marking the third Conservative MP to defect to Labour since 1997.", "tinyllama:1.1b": "A former Conservative minister who has previously clashed with his party's leadership over tuition fees and Europe, Robert Jackson, has announced his defection to Labour in a letter to his constituency chairman. He praised Tony Blair for \"courageously\" standing by the country, but criticized the Conservatives' hostility to Europe as hardening into a staunch position. Mr Jackson left the Conservative Party in 1997 after losing a leadership election, and was elected MP for Oxfordshire's Waunake constituency in 2001. He was later appointed higher education minister between 1987 and 1990. In a letter to his constituency chairman, Mr Jackson wrote: \"It is in the country's best interest that Tony Blair rather than Michael Howard should form the next government.\" Despite expressing frustration with the party's leadership on Europe, Mr Jackson also criticized the Conservatives for being \"drift[ing] further rightwards\" during his time as leader. However, a spokesperson for Mr Howard said Mr Jackson's views were significantly different from those of the party's current leadership and should not be considered in evaluating his defection. The letter marks Mr Jackson's third exit from the Conservative Party since 1997.", "tinydolphin:1.1b": " This statement informs us about a notable event where a Conservative MP, Robert Jackson, has decided to defect to the Labour Party. The reason behind this move was his dissatisfaction with the political views and policies of the Conservatives. He had previously been serving as the higher education minister during the time of Prime Minister Tony Blair. In his letter to his constituency chairman, Mr. Jackson criticized the Conservatives' stance on Europe, stating that it is hardening their position and advocating for a unilateral denunciation of Britain's treaty obligations. This move has further strengthened Labour's grip in the electoral race.", "phi:2.7b": " Robert Jackson, a former Conservative MP and minister who defected to Labour in protest against the party's \"dangerous\" views on Europe.\n", "orca-mini:3b": " A former Conservative minister and higher education minister has defected to Labour, criticizing the party's views on Europe and its leadership under Prime Minister Tony Blair. Robert Jackson wrote in a letter that he was disillusioned with the Conservatives' stance on Europe and praised the leadership of Tony Blair. He also clashed with his leaders over tuition fees and Europe in the past. Mr. Blair welcomed Mr. Jackson to Labour, saying he admired his \"courageous\" leadership of the country. However, a spokesman for Michael Howard said Mr. Jackson's views on policy issues were different from those of the party leadership. It is not surprising that he has chosen to leave the Conservatives and join Labour, where he will stand down at the next election.", "hermes3:3b": "Conservative MP Robert Jackson defects to Labour, citing disillusion with party leadership and Europe stance.", "stablelm-zephyr:3b": "A Conservative MP named Robert Jackson, who was 58 years old and represented Wantage in Oxfordshire, decided to switch to the Labour party because he wasn't happy with his current party's leadership and their thoughts about Europe. The Prime Minister, Tony Blair, said that Jackson would be welcomed warmly by the Labour members. Jackson had some disagreements before with his party on subjects like tuition fees and European matters. This is the third time a Conservative MP chose to join Labour since 1997.", "chatgpt-4o-latest": "Conservative MP Robert Jackson has defected to Labour, citing disillusionment with his party's leadership and its \"dangerous\" stance on Europe. A former higher education minister, Jackson praised Tony Blair's leadership and criticized the Conservatives' hostility toward Europe. Blair welcomed Jackson, calling him a dedicated public servant, while a spokesman for Conservative leader Michael Howard noted Jackson's differing views on tuition fees, the Iraq war, and European integration. Jackson, who will stand down at the next election, is the third Conservative MP to defect to Labour since 1997.", "stablelm2:1.6b": "Conservative MP Robert Jackson, who served as higher education minister between 2000-2005, has defected to Labour. Jackson expressed disillusionment with the party's leadership and \"dangerous\" views on Europe. He cited Prime Minister Tony Blair's welcome in Labour as he is expected to stand down at the next election. Critics of Jackson's defection point to his differences with leaders over tuition fees and stance on Europe, with Michael Howard noting that his views on policy issues are different from the party leadership.", "granite3.1-dense:2b": "Robert Jackson, a 58-year-old Conservative MP for Wantage in Oxfordshire and former higher education minister, has defected to Labour due to dissatisfaction with the party's leadership and its stance on Europe. Jackson, who served as higher education minister from 1987 to 1990, criticized the Conservatives for their hardened hostility towards Europe, advocating unilateral denunciation of Britain's treaty obligations. Prime Minister Tony Blair welcomed Jackson, praising his courageous leadership and expressing confidence that Labour would welcome him warmly. In contrast, Michael Howard's spokesperson noted Jackson's divergence from party policy on tuition fees, Iraq war criticism, and European integration. This defection marks Jackson's third as a Conservative MP since 1997, making him the third such defector to Labour.", "reference": "Mr Blair said Mr Jackson was a \"decent, fair-minded and dedicated public servant... who will be warmly welcome by Labour MPs and members\".Prime Minister Tony Blair declared himself \"delighted\", saying Mr Jackson would be warmly welcomed by Labour MPs.He added that it was not surprising Mr Jackson had chosen to leave the Conservatives.Mr Jackson, who has clashed with his leaders over tuition fees and Europe in the past, served as higher education minister between 1987 and 1990.Robert Jackson, 58, MP for Wantage in Oxfordshire, said he was disillusioned with the party's leadership and its \"dangerous\" views on Europe.Mr Jackson is due to stand down at the next election."}