{"raw_text": "MPs issued with Blackberry threat\n \n MPs will be thrown out of the Commons if they use Blackberries in the chamber Speaker Michael Martin has ruled.\n \n The £200 handheld computers can be used as a phone, pager or to send e-mails. The devices gained new prominence this week after Alastair Campbell used his to accidentally send an expletive-laden message to a Newsnight journalist. Mr Martin revealed some MPs had been using their Blackberries during debates and he also cautioned members against using hidden earpieces.\n \n The use of electronic devices in the Commons chamber has long been frowned on. The sound of a mobile phone or a pager can result in a strong rebuke from either the Speaker or his deputies. The Speaker chairs debates in the Commons and is charged with ensuring order in the chamber and enforcing rules and conventions of the House. He or she is always an MP chosen by colleagues who, once nominated, gives up all party political allegiances.\n", "llama3.2:1b": "MPs will be thrown out of the Commons if they use Blackberries in the chamber. Speaker Michael Martin has ruled that the devices can be used as phones, pagers, and to send emails. MPs had previously been using their Blackberries during debates, but this is now banned due to potential disruption.", "llama3.2:3b": "MPs will be ejected from the Commons for using Blackberries in the chamber due to Speaker Michael Martin's rule. The use of electronic devices has long been discouraged in the chamber.", "gemma2:2b": "MPs are prohibited from using Blackberries in the House of Commons chamber. Speaker Michael Martin ruled this after concerns were raised about MPs using them during debates and for personal communication via hidden earpieces.  His decision comes following a recent incident where Alastair Campbell's Blackberry sent an expletive-laden message to a journalist, highlighting the growing concern over electronic device usage in the House of Commons. \n", "qwen2.5:0.5b": "MPs will be thrown out of the Commons if they use Blackberries because they can't communicate during debates. The Speaker has warned MPs to avoid using Blackberries in the chamber and cautioned them against using hidden earpieces.", "qwen2.5:1.5b": "Members of Parliament will be ejected from the Commons if they use Blackberries, which can also serve as phones, pagers, or email communicators. This rule applies to those with Blackberry devices who engage in inappropriate behavior during debates or violate rules by using hidden earpieces. The MP responsible for enforcing these rules is Michael Martin.", "qwen2.5:3b": "MPs will be ejected from the Commons if they use Blackberries during debates. These £200 handheld devices can function as phones, pagers, or send emails. This became apparent after Alastair Campbell accidentally sent an offensive message via his Blackberry to a journalist on Newsnight. Speaker Michael Martin warned MPs against hidden earpieces and has previously ruled out the use of electronic devices in the chamber due to noise issues. The use of such gadgets is frowned upon in the Commons, with mobile phones or pagers leading to immediate reprimands from the Speaker. The Speaker chairs debates and ensures order in the chamber, giving up all party allegiances once elected.", "opencoder:1.5b": "The output for this text would be:\n\nMPs issued with Blackberry threats are likely to be thrown out of the Commons if they use Blackberries in the chamber Speaker Michael Martin has ruled.\n\nDuring these debates, some £200 handheld computers can serve as a phone, pager or to send emails. Alastair Campbell used his device to send an expletive-laden message to a Newsnight journalist, and Mr Martin revealed that MPs had indeed been using their Blackberries during the debate.\n\nThe use of electronic devices in the Commons chamber has always been criticized. The sound of mobile phones or paggers can provoke strong rebuttals from either the Speaker or his deputies. The Speaker chairs the Common meetings and is charged with maintaining order in the House and enforcing rules and conventions agreed upon by the members of the community.\n\nMPs are chosen based on their experience and their reputation in politics, which means they may not always adhere to party policies but who knows what else they can do for the betterment of democracy.\n", "smollm:1.7b": "MPs will be thrown out of the Commons if they use Blackberries in the chamber Speaker Michael Martin has ruled. MPs will be thrown out of the Commons if they use Blackberries in the chamber Speaker Michael Martin has ruled. The £200 handheld computers can be used as a phone, pager or to send e-mails. The devices gained new prominence this week after Alastair Campbell used his to accidentally send an expletive-laden message to a Newsnight journalist. Mr Martin revealed some MPs had been using their Blackberries during debates and he also cautioned members against using hidden earpieces.\n \n The use of electronic devices in the Commons chamber has long been frowned on. The sound of a mobile phone or a pager can result in a strong rebuke from either the Speaker or his deputies. The Speaker chairs debates in the Commons and is charged with ensuring order in the chamber and enforcing rules and conventions of the House. He or she is always an MP chosen by colleagues who, once nominated, gives up all party political allegiances.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about MPs using Blackberries in the Commons. Let me read through it carefully.\n\nFirst sentence says MPs are being threatened with being thrown out of the Commons if they use Blackberries. That's pretty clear. So that's one key point: MP's might get ejected if they use Blackberries.\n\nNext, they can be used as a phone, pager, or to send emails. Oh, and these devices were new this week because Alastair Campbell accidentally sent an expletive-laden message to a journalist. That's another important detail—Alastair Campbell was on blackberries, which was a sensitive moment.\n\nThen, the Speaker of the Commons, Michael Martin, has ruled that if they use Blackberries in the chamber, it could result in a strong rebuke by either the Speaker or his deputies. So that's about consequences for the Speaker and their colleagues.\n\nHe also warned members against using hidden earpieces—those are devices like the ones on Blackberries used to hear whispers. So that adds another layer of caution.\n\nLastly, the text notes that long-standing rules against electronic devices in the Commons have changed because of this incident. The sound from mobile phones or pagers can get strong rebuke by the Speaker, and hidden earpieces aren't allowed anymore. This suggests there's been a shift towards more cautious behavior despite existing regulations.\n\nPutting it all together, I need to capture these key points concisely in plain text without explanations or formatting.\n</think>\n\nMPs may face consequences if they use Blackberries in the Commons due to potential rebuke from the Speaker and colleagues. The devices can be used as a phone, pager, or for sending emails. Alastair Campbell's incident involving expletive-laden messages adds sensitivity. Michael Martin has ruled that their use could result in strong rebuke and hidden earpieces are discouraged. This reflects changes to regulations against electronic devices in the Commons.", "tinyllama:1.1b": "MPs are warned against using Blackberries in the Commons chamber after Speaker Michael Martin ruled that they can be used to send e-mails or make phone calls, as well as being used as a phone. MPs were reminded that any devices used in the House of Commons should not interfere with the proper conduct of debate, and can be subjected to disciplinary action if found guilty of breaking this rule. The use of electronic devices is considered to be unsuitable in the chamber as they are often distracting and can disrupt the flow of debates. The speaker himself warned MPs against using hidden earpieces that may also cause rebukes, as he is responsible for keeping the chamber orderly and free from disruptions.", "tinydolphin:1.1b": " The use of electronic devices in the Commons chamber has long been frowned on due to concerns about their potential for disruptive behavior and unintended consequences on the proceedings. This policy has been enforced by Speaker Michael Martin, who is responsible for leading and maintaining order within the House of Commons. MPs have been warned against using hidden earpieces or Blackberries in the chamber, and they are under a strict ban from using their devices during debates. If a member is found to be using an electronic device in a way that disrupts the proceedings or compromises the sanctum of the Commons, they may face severe consequences, including being removed from the chamber.", "phi:2.7b": " MPs are banned from using Blackberries in the Commons chamber due to concerns about disrupting parliamentary debates. The devices can be used as phones, pagers, and for sending e-mails, but some MPs have been caught using them during speeches. This is seen as a breach of House rules and conventions, which require order and decorum.\n", "orca-mini:3b": " MPs will be expelled from the Commons if they use Blackberries during debates. The devices can be used as phones, pagers, or to send e-mails. An MP was recently caught using one of these devices in an inappropriate manner. The Speaker rules against the use of electronic devices during debates. The use of mobile phones and pagers has been frowned upon for years in the Commons chamber. The Speaker is responsible for maintaining order in the chamber and ensuring adherence to the rules and conventions of the House. He or she must be an MP who has given up all political party affiliations once nominated.", "hermes3:3b": "Blackberries banned in UK MPs' chamber", "stablelm-zephyr:3b": "MPs warned they'll be thrown out of the Commons if they use Blackberries during debates, after Speaker Michael Martin revealed some members had been using the handheld computers. The devices, which can also send emails and serve as phones, gained notoriety this week when Alastair Campbell accidentally sent a profanity-laden message to a Newsnight journalist via his Blackberry. Since the use of electronic devices in the chamber is prohibited, any sound from mobile phones or pagers could lead to a rebuke from the Speaker or deputies. The Speaker's role is to maintain order and enforce rules in the Commons while being an elected MP themselves.", "chatgpt-4o-latest": "MPs will be expelled from the Commons if they use Blackberries in the chamber, Speaker Michael Martin has ruled. The £200 devices, which function as phones, pagers, and email senders, gained attention after Alastair Campbell accidentally sent an expletive-laden message. Some MPs had been using Blackberries during debates, prompting Martin to also warn against hidden earpieces. Electronic devices have long been discouraged in the Commons, where the Speaker enforces order and parliamentary rules.", "stablelm2:1.6b": "MPs could be expelled from the House if they use Blackberries during parliamentary debates as per Speaker Michael Martin's ruling. These devices can function like phones, pagers, and e-mailed. The ban on electronic devices in the Commons chamber has been frowned upon due to the sound of a mobile phone or pager. Alastair Campbell accidentally sent an expletive-filled message using his Blackberry during a debate. MP use of hidden earpieces is discouraged as per Speaker Martin's cautionary remarks. As the Chairperson of debates, Speaker Martin ensures order and enforces parliamentary rules and conventions among MPs who give up political allegiances upon being nominated by colleagues.", "granite3.1-dense:2b": "Speaker Michael Martin has prohibited MPs from using Blackberries during Commons debates due to concerns over disruptions and potential misuse. This ban follows a recent incident where Alastair Campbell accidentally sent an offensive message on his Blackberry while engaged in a debate. The Speaker, who chairs the chamber and maintains order, has also expressed concern about MPs using hidden earpieces with these devices. The use of electronic gadgets in the Commons has traditionally been discouraged, as their operation can cause disturbances during proceedings.", "reference": "MPs will be thrown out of the Commons if they use Blackberries in the chamber Speaker Michael Martin has ruled.The use of electronic devices in the Commons chamber has long been frowned on.The Speaker chairs debates in the Commons and is charged with ensuring order in the chamber and enforcing rules and conventions of the House.The £200 handheld computers can be used as a phone, pager or to send e-mails."}