{"raw_text": "Talks aim to avert pension strike\n \n Talks aimed at averting a series of national strikes over pensions reforms will take place this weekend.\n \n Five public sector unions will hold private talks with Deputy Prime Minister John Prescott at Labour's spring conference in Gateshead. They want the government to withdraw regulations - due to be introduced in weeks - which would raise the pension age for council workers from 60 to 65. Up to 1.4m workers could take part in a strike already earmarked for 23 March. However, all sides are anxious to avoid a major confrontation in the run up to the general election, said BBC labour affairs correspondent Stephen Cape. In four days, Britain's biggest union Unison will start balloting 800,000 local government workers on strikes. Other public sector unions have pledged to follow. It is just weeks before new regulations are introduced to raise the pension age of local government workers.\n \n The five unions meeting Mr Prescott want the government to withdraw these regulations. This would allow months of tough negotiations to follow, said our correspondent. But a spokesman for Mr Prescott warned that the changes to the local government pension scheme would have to go ahead in April. Privately ministers believe this will be the \"less painful\" option, our correspondent added. The Public and Commercial Services Union (PCS) will co-ordinate any industrial action with up to six other public sector unions. PCS leader Mark Serwotka warned last week that there could be further walkouts unless there was a government rethink. \"For a government that lectures everyone on choice - choice on public service, choice on this and choice on that - isn't it ironic that they're saying to public sector workers there is no choice,\" he said. \"If you want the pension you were promised when you started you must work for an extra five years - that is working until people drop. \"In the 20th century, it's completely unacceptable.\"\n \n Unison's 800,000 workers, the Transport and General Workers' Union's 70,000 and Amicus' 20,000 are among those being balloted about a 23 March walkout. Mr Prescott held a private meeting with senior union figures last week. It is understood no deal was offered in that meeting but there was room for further negotiations.\n", "llama3.2:1b": "Public sector unions will hold talks with Deputy Prime Minister John Prescott at Labour's spring conference this weekend to discuss pension reforms. The government has introduced regulations raising the pension age from 60 to 65, which could lead to up to 1.4m workers striking on March 23.", "llama3.2:3b": "Public sector unions to hold talks with Deputy Prime Minister John Prescott over pension reforms, aiming to avoid strikes and raise the pension age of local government workers from 60 to 65, up to 1.4m workers could take part in a strike on March 23.", "gemma2:2b": "Public sector unions plan to strike over pension reforms. They will meet Deputy Prime Minister John Prescott this weekend to discuss withdrawing the regulations raising the pension age. The unions want a month of talks before any action, while government officials are considering moving forward with the changes in April. Unison is planning a strike for March 23rd and other unions have pledged support. Unions argue that these changes are unfair and contradict the idea of employee choice.  \n", "qwen2.5:0.5b": "The five public sector unions will hold private talks with Deputy Prime Minister John Prescott at Labour's spring conference in Gateshead, aiming to withdraw regulations raising the pension age for council workers from 60 to 65. Some unions are also considering a march on the General Election with up to 1.4m workers taking part. Private negotiations could take place during April following changes to local government pensions and private talks between unions are in their early stages. There is significant opposition to raising the pension age, with a spokesman for Mr Prescott warning that the change will have to go ahead in April.", "qwen2.5:1.5b": "Five public sector unions will meet Deputy Prime Minister John Prescott to discuss withdrawing proposed pension age regulations, aiming to prevent national strikes over the reforms. Talks are expected to take place this weekend and may include Unison ballots starting on March 23rd. The government plans to introduce new regulations raising the pension age for local government workers in April, resulting in potential industrial action from unions, including the PCS which has pledged support with other public sector groups.", "qwen2.5:3b": "Talks aimed at averting pension strikes over proposed regulations to raise the pension age from 60 to 65 are scheduled this weekend. Five public sector unions will meet Deputy Prime Minister John Prescott during Labour's spring conference, seeking withdrawal of these regulations. If not agreed, up to 1.4 million workers could strike on March 23rd. All sides aim to avoid confrontation before the general election. Unions want months of negotiations but ministers insist changes must proceed in April. Public and Commercial Services Union will coordinate strikes by up to six other unions if there's no government reconsideration. Unison, T&GU, and Amicus are balloting their members on a March 23rd walkout. A private meeting last week with Prescott offered no deal but left room for further negotiations.", "opencoder:1.5b": "The talks aim to averting national strikes over pension reform will take place this weekend. Five public sector unions will hold private talks with Deputy Prime Minister John Prescott at Labour's spring conference in Gateshead. They want the government to withdraw regulations which would raise the pension age for council workers from 60 to 65. Workers could participate in a strike already earmarked for 23 March, but all sides are anxious to avoid a major confrontation in the run up to the general election. The BBC labourness correspondent Stephen Cape said in four days, Britain's biggest union Unison will start balloting 800,000 local government workers on strikes. Other public sector unions have pledged to follow. The Public and Commercial Services Union (PCS) leader Mark Serwotka warned last week that there could be further walkouts unless there was a government rethink. A government that lectures everyone on choice - choice on public service, choice on this and choice on that - isn't it ironic that they're saying to public sector workers there is no choice, \"If you want the pension you were promised when you started you must work for an extra five years - that is working until people drop. In the 20th century, it's completely unacceptable.\" The Transport and General Workers' Union's 70,000 worker and Amicus' 20,000 are among those being balloted about a 23 March walkout.\n", "smollm:1.7b": "The text above summarizes the main points of the original text, preserving key ideas and details. The summary should be concise and clear, without adding or changing the meaning of the original text.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely while preserving key ideas and details. The user wants only the summary as plain text without any explanations or formatting.\n\nFirst, let's read through the provided text carefully. It's about pension reforms aimed at avoiding strikes. There are several unions involved in a meeting with Prime Minister John Prescott. Five unions will hold private talks on March 26th, targeting the upcoming strike on pension age for council workers from 60 to 65 years.\n\nI should note that up to 1.4 million workers might strike by March 23rd and mention that both sides are trying to avoid a major confrontation before the general election. The BBC's Labour affairs correspondent, Stephen Cape, provided this info. Additionally, Unison will be voting on strikes starting in three days for some local government workers.\n\nOther unions like the Public and Commercial Services Union (PCS) have their own plans, including coordinating industrial actions with up to six other unions. PCS leader Mark Serwotka expressed concerns about potential walkouts unless there's a government change, questioning the fairness of the proposals.\n\nI need to capture all these points in a concise summary without adding any extra details or explanations. The summary should be clear and include all critical elements from the original text.\n</think>\n\nPension reforms aim to prevent strikes over age increases for council workers. Five unions will hold private talks with Prime Minister John Prescott on March 26th, targeting a strike planned for March 23rd. Up to 1.4 million workers could strike then. Both sides are preparing to avoid major confrontation before the general election. Unison is voting on strikes for some local government workers starting in three days. PCS will vote on walking out for others.", "tinyllama:1.1b": "The government is preparing to negotiate regulatory changes in the local government sector, which would affect millions of workers, and has announced plans to withdraw these regulations from April. In recent weeks, five public sector unions have called for the government to withdraw these regulatory changes but have pleaded with them to postpone strike action until after the general election. Meanwhile, the Public and Commercial Services Union (PCS) is leading a private union-led campaign of industrial action and has threatened further walkouts unless there is a government retention of the proposed changes. The five unions are cooperating with up to six other public sector union groups, while Unison's 800,000 workers have staged ballots about a potential 23 March strike.", "tinydolphin:1.1b": " The text you provided talks about the upcoming talks aimed at averting a pension strike by national workers. These talks are being held between five public sector unions and the UK government's Deputy Prime Minister, John Prescott, to address a regulation that would increase the pension age for local government workers from 60 to 65. All sides want to avoid a major confrontation in the run up to the general election, as this could affect future pension reforms.", "phi:2.7b": " Talks between public sector unions and Deputy Prime Minister John Prescott aim to avoid a national pension strike, which would see up to 1.4 million workers taking part in a 23 March protest due to regulations raising the pension age from 60 to 65. The five unions want the government to withdraw these regulations but officials believe they must go ahead in April. Privately, ministers believe this will be the \"less painful\" option for local government workers who would have to work an extra five years to receive their promised pensions.\n", "orca-mini:3b": " Talks will take place this weekend between five public sector unions and the Deputy Prime Minister John Prescott, aimed at averting a series of national strikes over pensions reforms. The government wants to raise the pension age for council workers from 60 to 65, affecting up to 1.4m workers. Unison, the biggest union, has already begun balloting its 800,000 local government workers on strike, and other public sector unions have pledged to follow. However, all sides are anxious to avoid a major confrontation in the run up to the general election. The unions want the government to withdraw the regulations that would raise the pension age, allowing months of tough negotiations to follow. Ministers believe this will be the \"less painful\" option.", "hermes3:3b": "Talks to prevent pension strikes over raising council worker pension ages start this weekend.\nFive public sector unions will meet Deputy PM John Prescott, aiming to halt regulation introduction which would raise age from 60 to 65.\nUp to 1.4m workers could strike on March 23 if no agreement is reached.", "stablelm-zephyr:3b": "Five public sector unions will hold private talks with Deputy Prime Minister John Prescott to avoid national strikes over proposed pension age increases. Up to 1.4 million workers could participate in a strike scheduled for 23 March, but all parties are keen to prevent a confrontation before the general election. The Public and Commercial Services Union (PCS) will coordinate industrial action with six other unions; however, PCS leader Mark Serwotka warned of potential further walkouts if there isn't a government rethink. Unison is balloting its 800,000 workers on possible strikes, alongside those from the Transport and General Workers' Union and Amicus.", "chatgpt-4o-latest": "Talks will be held this weekend between five public sector unions and Deputy Prime Minister John Prescott to prevent national strikes over pension reforms. The unions oppose new regulations set to raise the pension age for council workers from 60 to 65 and are demanding their withdrawal. Up to 1.4 million workers could strike on 23 March, with Unison balloting 800,000 members and other unions planning to follow. Ministers insist the changes must proceed in April, believing this to be the least disruptive option. PCS leader Mark Serwotka criticized the lack of choice for workers, warning of further strikes unless the government reconsiders. Prescott previously met union leaders without offering a deal, but further negotiations remain possible.", "stablelm2:1.6b": "Talks will occur this weekend to prevent national strikes over pension reforms. Five public sector unions are negotiating with Deputy Prime Minister John Prescott at the Labour conference, aiming to withdraw proposed regulations raising the pension age for council workers from 65 to 70 years old. Up to 1.4 million workers could participate in a strike already planned for March; however, avoiding major confrontation during the election period is crucial. Unison will start balloting local government workers on strikes, followed by other public sector unions. The proposed changes must proceed in April, as ministers believe it's the \"least painful\" option.", "granite3.1-dense:2b": "This weekend, five public sector unions will engage in private talks with Deputy Prime Minister John Prescott at Labour's spring conference in Gateshead to prevent a national pensions strike. The unions seek the withdrawal of government-proposed regulations that would increase the pension age for local government workers from 60 to 65, potentially involving up to 1.4 million employees in strike action on March 23rd. These talks aim to avoid a major confrontation ahead of the general election. If no agreement is reached, other unions will initiate ballots for strikes, with Unison set to begin balloting 800,000 local government workers within four days. The Public and Commercial Services Union (PCS) will coordinate any industrial action with up to six other public sector unions. PCS leader Mark Serwotka emphasized the need for a government rethink, describing the proposed changes as \"completely unacceptable\" since they force workers to extend their careers beyond retirement age. Prescott's spokesperson indicated that while negotiations continue, the regulatory changes are expected to proceed in April as the less painful option.", "reference": "The five unions meeting Mr Prescott want the government to withdraw these regulations.They want the government to withdraw regulations - due to be introduced in weeks - which would raise the pension age for council workers from 60 to 65.It is just weeks before new regulations are introduced to raise the pension age of local government workers.But a spokesman for Mr Prescott warned that the changes to the local government pension scheme would have to go ahead in April.Other public sector unions have pledged to follow.Mr Prescott held a private meeting with senior union figures last week.Five public sector unions will hold private talks with Deputy Prime Minister John Prescott at Labour's spring conference in Gateshead.The Public and Commercial Services Union (PCS) will co-ordinate any industrial action with up to six other public sector unions."}