{"raw_text": "Stalemate in pension strike talks\n \n Talks aimed at averting national strikes over pension reforms have ended without agreement after 90 minutes.\n \n Five public sector unions met Deputy Prime Minister John Prescott at the Labour spring conference in Gateshead. They want the government to withdraw regulations - due to be introduced in weeks - which would raise the pension age for council workers from 60 to 65. Up to 1.4 million workers could take part in strikes earmarked for 23 March. Discussions will resume next week.\n \n A spokesman for Unison, Britain's biggest union, said after Saturday's meeting: \"At least we are still talking.\" All sides are anxious to avoid a major confrontation in the run up to the general election, said BBC labour affairs correspondent Stephen Cape. In four days, Unison will start balloting 800,000 local government workers on strikes. Other public sector unions have pledged to follow. The five unions which met Mr Prescott want the government to withdraw these regulations. This would allow months of tough negotiations to follow, said our correspondent. But a spokesman for Mr Prescott warned that the changes to the local government pension scheme would have to go ahead in April.\n \n Privately ministers believe this will be the \"less painful\" option, our correspondent added. The Public and Commercial Services Union (PCS) will co-ordinate any industrial action with up to six other public sector unions. PCS leader Mark Serwotka warned last week that there could be further walkouts unless there was a government rethink. \"For a government that lectures everyone on choice - choice on public service, choice on this and choice on that - isn't it ironic that they're saying to public sector workers there is no choice,\" he said. \"If you want the pension you were promised when you started you must work for an extra five years - that is working until people drop. \"In the 20th century, it's completely unacceptable.\"\n \n Unison's 800,000 workers, the Transport and General Workers' Union's 70,000 and Amicus' 20,000 are among those being balloted about a 23 March walkout. Mr Prescott held a private meeting with senior union figures last week. It is understood no deal was offered in that meeting but there was room for further negotiations.\n", "llama3.2:1b": "The talks between the government and public sector unions on pension reforms have ended without an agreement after 90 minutes of negotiations. The five main unions (Unison, Britain's biggest union, Transport and General Workers' Union, Amicus, and the Public and Commercial Services Union) met Deputy Prime Minister John Prescott at the Labour spring conference in Gateshead. The meeting aimed to resolve the dispute over a proposed pension age increase for council workers from 60 to 65. Discussions are set to resume next week.", "llama3.2:3b": "Talks between public sector unions and Deputy Prime Minister John Prescott over pension reform regulations ended without agreement after 90 minutes. The unions, who represent up to 1.4 million workers, want the government to withdraw regulations increasing the pension age for council workers from 60 to 65. Discussions will resume next week; a strike is planned for 23 March.", "gemma2:2b": "Talks on pension reform have stalled, leaving the possibility of national strikes looming. Public sector unions representing over one million workers are demanding the government withdraw regulations raising the pension age, potentially leading to strikes on March 23rd. Despite talks with Deputy Prime Minister John Prescott, agreement remains elusive.  Union leaders have stated their willingness to continue negotiating but remain firm in their stance against the proposed pension reforms.  \n", "qwen2.5:0.5b": "The UK government is still negotiating with five public sector unions to avoid a pension strike. The strikes would be carried out on 23 March, and are expected to take several weeks before they can end. The talks ended after 90 minutes without an agreement. The strikes involve council workers from up to 1.4 million UK workers. Unison is hoping for the changes to go ahead in April, but the government is still pushing for the pension age to be raised and other reforms.", "qwen2.5:1.5b": "Public sector unions have failed to reach agreement on pension reform strikes, with talks ending after an hour of negotiation between five unions and Deputy Prime Minister John Prescott at the Labour conference. Talks will resume next week as public sector workers prepare for potential March 23rd strike action. The government is considering delaying changes to local pensions but unions are pushing back against this plan.", "qwen2.5:3b": "Stalemate in pension strike talks ended after Deputy Prime Minister John Prescott met five public sector unions in Gateshead. They sought to prevent strikes over proposed pension reforms, which would raise the pension age from 60 to 65 for council workers and could involve up to 1.4 million participants on March 23rd. Despite initial talks ending without agreement, all sides aim to avoid confrontation ahead of the general election. Unions will continue negotiations or industrial action if changes are not made by April. PCS leader Mark Serwotka criticized this decision as unfair, contrasting it with government rhetoric about choice for public sector workers.", "opencoder:1.5b": "Summarizing the text:\n\nA public sector union has discussed measures aimed at averting national strikes over pension reform, which ended without agreement. They met at the Labour spring conference on Tuesday and discussed the changes to the government's pension age scheme. The unions are now anxious about a potential major election run up due to tough negotiations with the government. A private meeting was held between the senior figures of the union and other public sector unions. Unions agree that no deal was discussed but there is room for further negotiation. Meanwhile, ministers of the Public and Commercial Services Union (PCS) are considering a rethink in the future when it comes to choosing who gets a pension from workers or what industries can be made more accessible.\n", "smollm:1.7b": "The summary should preserve the key ideas and details of the original text, including:\n\n1. The main points of the text: Stalemate in pension strike talks, Talks aimed at averting national strikes over pension reforms, Five public sector unions met Deputy Prime Minister John Prescott at the Labour spring conference in Gateshead, Discussions will resume next week.\n2. Key details: The five public sector unions that met Mr Prescott wanted the government to withdraw regulations - due to be introduced in weeks - which would raise the pension age for council workers from 60 to 65. Up to 1.4 million workers could take part in strikes earmarked for 23 March.\n3. The key points of the text: At least we are still talking, all sides are anxious to avoid a major confrontation in the run up to the general election, said our correspondent. In four days, Unison will start balloting 800,000 local government workers on strikes. Other public sector unions have pledged to follow. The Public and Commercial Services Union (PCS) will co-ordinate any industrial action with up to six other public sector unions. PCS leader Mark Serwotka warned last week that there could be further walkouts unless there was a government rethink. \"For a government that lectures everyone on choice - choice on public service, choice on this and choice on that - isn't it ironic that they're saying to public sector workers there is no choice,\" he said. \"If you want the pension you were promised when you started you must work for an extra five years - that is working until people drop.\" In the 20th century, it's completely unacceptable.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the given text concisely while preserving key ideas and details. The user provided a detailed news article about a pension strike talks and several unions involved. My task is to extract the main points without adding any extra information.\n\nFirst, I'll read through the article carefully to identify the main events and details. It starts by mentioning that the pension strike talks ended without agreement after 90 minutes, with five unions meeting at the Labour Spring conference in Gateshead.\n\nNext, it states that these unions want the government to withdraw regulations regarding the pension age for council workers from 60 to 65. They plan to hold strikes up until March 23rd, and discussions will resume next week. Then, there's a mention of Unison's spokesman saying \"at least we are still talking,\" which suggests they're still discussing some changes.\n\nThe BBC reporter notes that this might cause tension for the upcoming general election, with other unions following suit. The Transport and General Workers' Union (TGWU) and Amicus will be part of the ballot for the walkout on March 23rd. Additionally, Mr. Prescott's private meeting with his senior figures last week was noted as a point where no deal was reached, but there were more talks possible.\n\nI need to make sure the summary captures all these key points without getting bogged down in details that aren't crucial for understanding the overall situation. I'll focus on the main events: the lack of agreement after 90 minutes, the unions' demands regarding pension age, the planned strikes, the timing and participants involved, the reports from various unions about their plans to vote, and the mention of President Prescott's meeting but not specifics beyond no deal there.\n\nI should also note that the move is seen as a \"less painful\" option compared to others. The Transport and General Workers' Union is included in the walkout ballot, along with others mentioned. No mention of government changes yet for the pension scheme, which will happen in April.\n\nPutting it all together, I'll structure the summary by first mentioning that the strike talks ended without agreement, then detail the unions meeting, their demand for pension age changes and strikes, the timing, and participants. Then, include the report from Unison's spokesperson, the election-related tension, the voters' plans, and President Prescott's meeting findings.\n\nI need to ensure the language is clear and concise, avoiding any unnecessary fluff. I'll make sure each point flows logically into the next while preserving all essential details about the situation.\n</think>\n\nThe pension strike discussions concluded without agreement after 90 minutes at a Labour Spring conference in Gateshead. Five public sector unions met with Prime Minister John Prescott to demand changes to pension regulations, proposing a 60-year old council worker's pension aged from 60 to 65. Up to 14 million workers could engage in strikes on March 23, and discussions resumed next week. Unison's spokesperson echoed the meeting, stating at least they were still talking. Unison plans to vote for a walkout on March 23, with voters from TGWU, Transport and General Workers' Union (TGWU), and Amicus. The Transport and General Workers' Union will also participate. President Prescott mentioned no deal was reached in his meeting last week but hinted more talks might be possible.", "tinyllama:1.1b": "The stalemate in ongoing talks aimed at averting national strikes over the pension reform has ended, and five public sector union leaders met with UK Deputy Prime Minister John Prescott at a Labour spring conference in Gateshead. The meeting discussed regulations due to be introduced in weeks that would raise the penision age for council workers from 60 to 65. However, all sides are concerned about avoiding major confrontations before the general election. As part of negotiations, Unison's 800,000 local government workers will begin balloting on industrial action within two weeks. Union leaders have warned that a government-imposed retention could be another possible option to endorsed by up to six other public sector union leaders.", "tinydolphin:1.1b": " The pension strike talks between five public sector unions and the Labour government have ended without an agreement, as they aimed to avoid nationwide strikes over pension reforms. \n\nThe talks were scheduled for 90 minutes but broke down, with up to 1.4 million workers taking part in potential strikes slated for March 23. The spokesman for Unison, Britain's largest union, said at least they are still talking. All sides are anxious to avoid a major confrontation leading up to the general election.\n\nBallots will be taken by workers across various public sector unions and a group of experts from the UK's Co-operative Bank is now reviewing these proposals, which would raise the pension age for council workers in England to 65 from 60. Local government staff could take part in strikes within four days if a deal cannot be reached by the end of February.\n\nPrivately, ministers believe that this will be the \"less painful\" option and would mean that future pension reforms can proceed as planned. However, workers from other public sector unions have urged for more negotiations to follow before any such changes are made. \n\nPCS (Public and Commercial Services Union), which is coordinating industrial action with six other public sector unions, warned that further walkouts are possible unless there is a government rethink on pension reforms. The transport workers' union, Transport and General Workers' Union (TGWU), has also called for an extension of the current transition period for pension contributions from 2018 to 2024.", "phi:2.7b": " Talks aimed at averting national strikes over pension reforms have ended without agreement after 90 minutes. Five public sector unions are against the government's regulations raising the pension age from 60 to 65, which could lead to up to 1.4 million workers participating in potential strikes on March 23rd. Discussions will resume next week, but the government believes the changes should go ahead despite the union's opposition. The PCS union will coordinate any industrial action with six other public sector unions and warns there may be further walkouts if the government does not re-think its position.\n", "orca-mini:3b": " Talks aimed at averting national strikes over pension reforms ended without agreement after 90 minutes between five public sector unions and the government. The unions want the government to withdraw regulations, due to be introduced in weeks, which would raise the pension age for council workers from 60 to 65. Up to 1.4 million workers could take part in strikes, announced by Unison in four days. However, a spokesman for John Prescott warned that the changes to the local government pension scheme would have to go ahead in April.", "hermes3:3b": "Pension strike talks end without agreement\nNational strikes over pension reforms raise risk, as talks between unions and deputy prime minister John Prescott fail to reach an agreement after 90 minutes meeting.", "stablelm-zephyr:3b": "Negotiations between the government and five public sector unions, including Unison, over pension reforms have ended without agreement. The unions want the regulations due to be introduced soon, which would raise the pension age for council workers from 60 to 65, to be withdrawn. This could lead to up to 1.4 million workers participating in strikes scheduled for 23 March. Discussions will resume next week. Ministers believe this will be a less painful option, and negotiations can follow. Unison will start balloting its 800,000 local government workers on potential strikes starting 23 March. Other unions, such as the Transport and General Workers' Union and Amicus, are also balloting their members for possible strike action.", "chatgpt-4o-latest": "Talks between five public sector unions and Deputy Prime Minister John Prescott over pension reforms ended without agreement after 90 minutes. The unions oppose government regulations set to raise the pension age for council workers from 60 to 65 and are planning strikes on 23 March, potentially involving 1.4 million workers. Unison will begin balloting 800,000 local government workers, with other unions expected to follow. While discussions will continue next week, the government insists the changes must take effect in April. PCS leader Mark Serwotka criticized the lack of choice for workers, warning of further strikes unless the government reconsiders. A previous private meeting between Prescott and union leaders yielded no deal but left room for further negotiations.", "stablelm2:1.6b": "Five public sector unions met Deputy Prime Minister John Prescott to discuss pension reforms, but talks ended without agreement after minutes were read. The unions requested the government withdraw regulations introducing a 65-year-old retirement age for council workers, which would affect up to 1.4 million workers. Strikes are planned for March if no deal is reached. Union leaders are concerned about avoiding major confrontation during the general election. Ministers believe a 60-year-old age adjustment will be less painful. Unison will begin balloting local government workers for strikes in four days.", "granite3.1-dense:2b": "Talks between five public sector unions and Deputy Prime Minister John Prescott at the Labour conference in Gateshead have concluded without an agreement after 90 minutes. The unions demand the government withdraw pension age increase regulations from council workers, which could lead to up to 1.4 million strikes on 23 March. Discussions will reconvene next week. Unison, the largest union, expressed satisfaction with at least continuing talks. Ministers privately believe implementing these changes in April would be less painful and more acceptable to workers, as it maintains the pension promised when they started their careers. However, unions like PCS, led by Mark Serwotka, warned of potential further walkouts unless the government reconsiders its stance on extended work terms for adequate pensions. Unison, TGWU, and Amicus are among 800,000 workers being considered for a strike on that date.", "reference": "The five unions which met Mr Prescott want the government to withdraw these regulations.They want the government to withdraw regulations - due to be introduced in weeks - which would raise the pension age for council workers from 60 to 65.Five public sector unions met Deputy Prime Minister John Prescott at the Labour spring conference in Gateshead.Mr Prescott held a private meeting with senior union figures last week.Other public sector unions have pledged to follow.But a spokesman for Mr Prescott warned that the changes to the local government pension scheme would have to go ahead in April.PCS leader Mark Serwotka warned last week that there could be further walkouts unless there was a government rethink.The Public and Commercial Services Union (PCS) will co-ordinate any industrial action with up to six other public sector unions.A spokesman for Unison, Britain's biggest union, said after Saturday's meeting: \"At least we are still talking.\""}