{"raw_text": "CSA chief who 'quit' still in job\n \n The head of the \"failing\" Child Support Agency widely reported to have resigned three months ago is still at the helm of the troubled organisation.\n \n Doug Smith's departure was announced by Work Secretary Alan Johnson on 17 November as MPs grilled him over the agency's poor performance. His \"resignation\" was referred to by both Tory and Lib Dem leaders during that day's prime ministers questions. Officials now say he did not resign but will move on under civil service rules.\n \n Mr Smith's departure was reported widely at the time as his shouldering the blame for the failings of the Child Support Agency. In January the MPs who make up the Commons Work and Pensions Committee published a highly critical report into the \"failing\" agency noting the chief executive \"has now left\" and hoping \"the new leadership will bring a fresh approach to what is a failing organisation\".\n \n On that day's Today programme Mr Johnson was asked why Mr Smith had been allowed to resign rather than be sacked. He replied: \"The chief executive decided it was time to move on, there is a new chief executive coming in.\" It now emerges that the widespread belief Mr Smith, made Commander of the Order of the Bath in the New Year honours, had left, was wrong. A Department for Work and Pensions spokeswoman confirmed Mr Smith was still in post and that he would continue in the job until a replacement was found. \"No date was ever given for Doug Smith's departure,\" she said adding that the post had been advertised.\n \n Tory work and pensions spokesman David Willetts said families affected by CSA failings would wonder why Mr Smith was still in his job three months after his departure was announced. The CSA has been surrounded by controversy since its introduction in 1993 to assess and enforce child support payments by absent parents.\n \n The work and pensions committee launched their inquiry into the CSA's performance after it became clear that, despite the introduction of a simpler system of calculating maintenance payments for new cases in 2003, a backlog of claims was still building up. It is currently chasing outstanding payments of more than £720m, while a further £947m has been designated as \"unrecoverable\". The MPs found American IT giant EDS' £456m system was \"nowhere near being fully functional and the number of dissatisfied, disenchanted and angry customers continues to escalate\".\n \n In November, when he surprised MPs and the watching media by announcing Mr Smith's departure, Mr Johnson said: \"I should tell you that Doug has decided that now is the time to stand aside and to allow a new chief executive to tackle the challenges ahead. \"Doug has exceeded the four years that senior civil servants are now expected to remain in a particular post. \"So Doug believes that we have reached the natural breakpoint at which he can hand over the reins.\" Lib Dem Sir Archy Kirkwood, who chairs the Commons work and pensions committee, said that when Mr Johnson had announced Mr Smith was going he got the \"clear impression\" the CSA chief was retiring though it had since emerged that was not the case, and he may be seeking new employment opportunities.\n \n He added his committee was \"duty bound\" to allow the work and pensions secretary to get new management into place in the CSA and it would be \"premature\" to say anything further on the issue at the moment. But committee member and Tory MP Nigel Waterson said he was \"amazed\" Mr Smith was still in his job. \"When Mr Smith and the secretary of state came to give evidence, we were led to believe he was going shortly,\" he said. \"Even if he was working out three months notice, he should have been clearing his desk by now.\" Asked on Thursday about Mr Smith's position Mr Johnson told BBC Radio 4's World at One he thought it was a \"non-story\". He added that he had been absolutely open when he announced Mr Smith's departure to the select committee and how people chose to interpret it was a \"different thing\". \"The major issue is have we got a new chief executive coming into this very important agency as quickly as possible and have we gone through the right selection process to make sure we've got the right people,\" he added.\n", "llama3.2:1b": "Doug Smith, CSA chief, remains in job despite initial report of resignation, with Work Secretary Alan Johnson saying he was allowed to leave due to \"time to move on\". The CSA has been struggling since its introduction in 1993, with a backlog of claims and unrecoverable payments of over £1.7 billion. Smith's departure was reported widely after the Work and Pensions Committee published a critical report.", "llama3.2:3b": "Child Support Agency (CSA) chief Doug Smith was reported to have resigned three months ago, but is still in his job under civil service rules. His departure was initially announced by Work Secretary Alan Johnson as Mr Smith taking early retirement after four years in a senior post. However, it now emerges that the announcement was not a formal resignation and he will continue in his role until a replacement is found.", "gemma2:2b": "Doug Smith, head of the Child Support Agency (CSA), has not resigned but will remain in his position until a replacement is found. Despite announcing his departure three months ago, Smith's move is now confirmed as not being a resignation but a transition under civil service rules. The CSA remains troubled, facing criticism for its backlog of unpaid child support claims and the use of an IT system by EDS that has been less than fully functional. \n", "qwen2.5:0.5b": "Doug Smith, who had been the head of the Child Support Agency, has left the job but will be replaced by a new chief executive under civil service rules. The work and pensions committee announced Mr Smith was staying on after announcing his resignation in November 2018.", "qwen2.5:1.5b": "The head of Child Support Agency who resigned in November 2014 has been confirmed still working there, despite earlier reports suggesting his departure was based on being \"too old\" for a senior position. Doug Smith's resignation announcement sparked criticism of the agency's poor performance but new evidence suggests he did not leave voluntarily. The Department for Work and Pensions confirms Smith is still in post until a replacement is found.", "qwen2.5:3b": "CSA head Doug Smith, widely reported to have resigned three months ago, remains in his position despite poor performance reports. His departure was announced by Work Secretary Alan Johnson but it emerged that he did not resign and will move on under civil service rules. The work and pensions committee questioned the situation, with Tory MP Nigel Waterson expressing surprise at Smith's continued employment. Despite ongoing controversies, including a £456m IT system failure, officials confirm Smith is still in post until a replacement is found.", "opencoder:1.5b": "The Chief Structured Support Agency employee who quit still in the job, with the head of the agency reported to leave three months ago is still at the helm of the organization.\n\nDoug Smith's departure was announced on 17 November by a work and private sector leader during a Prime Minister question period. His \"resignation\" was referred to by both former Tory and Liberal Democrats during that day's prime ministers questions. The news was reported widely, but officials now note he did not formally resign.\n\nThe report highlights Mr Smith's departure as his performance in the organisation, with the agency chief executive \"has left,\" hoping for a fresh start under Civil Service rules.\n\nIn January, the same committee made a critical report into the failed agency, noting that they had announced the agency's poor performance. Despite the introduction of a simpler system to calculate maintenance payments, the backlog of claims was still building up. It is currently chasing outstanding payments at a high rate, with additional funds designated as \"unrecoverable\".\n\nFaces the same issues faced by the CSA in 1993 and a similar backdrop to its introduction this year, the Tories and Lib Dems sought new employment opportunities when Mr Johnson sparked an argument questioning the legitimacy of Doug Smith's departure.\n\nIn November, when he shocked the media and suggested a replacement, Mr Johnson said: \"I should tell you that Doug has decided that now is the time to stand aside and to allow a new chief executive to tackle the challenges ahead. \"Doug has exceeded the four years that senior civil servants are expected to remain in a post. \"So Doug believes that we have reached the natural breakpoint at which he can hand over the reins.\" Lib Dem Sir Archy Kirkwood, who chairs the work and pension committee, said he was \"amazed\" by Mr Smith's departure but added it as a possible reason for his current role.\n\nIt is also noted that the department's IT company EDS' system faced difficulties in operation, a complaint escalated due to dissatisfaction with the number of dissatisfied customers. The committee member and former Tory MP Nigel Waterson said he was \"amazed\" by Mr Smith's departure but added it as a different perspective on the matter.\n\nThe arguments are likely influenced by various factors such as the nature of the issues, the extent of the disparity between staff in the agency and those in mainstream society, and other potential conflicts between the two groups. The CSA's failure to address this discrepancy could potentially lead to a new chief executive becoming a focal point for future employment.\n", "smollm:1.7b": "Summarize the following text concisely, preserving key ideas and details:\nThe head of the \"failing\" Child Support Agency widely reported to have resigned three months ago is still at the helm of the troubled organisation.\nOutput only the summary as plain text—no explanations, no formatting, no reasoning process.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to create a summary of the given text about Doug Smith leaving CSA. Let me read through it carefully.\n\nFirst, it says the chief of the failing Child Support Agency resigned three months ago but is still in charge. That's a key point—keeping the same job despite resigning from leadership. Then, on 17th November, Alan Johnson announced Doug Smith was leaving due to poor performance. The heads of the work and pensions committee criticized him, thinking he should have been sacked. But the official announcement said Doug is still there.\n\nThe government's press release says Doug left but didn't resign under civil service rules. He's still in office until a replacement is found. There were rumors that Mr Smith had left, but it seems they were incorrect. Some called him Commander of the Order of the Bath. Now, Lib Dem MP Sir Archy Kirkwood thinks he might have taken other jobs or has no idea.\n\nMr Johnson told Nigel Waterson from BBC radio that it's not a priority to change the leadership right away. He mentioned the agency is still struggling and there were concerns about new management. The committee was busy trying to pick the best person for the job but hasn't made any decisions yet.\n\nSo, I need to condense this into a summary with key points: Doug Smith's resignation announcement, his continued role, government's stance, rumors versus official info, public perception of his position, and future plans. Make sure to include dates, names, main issues like resignation, leadership changes, and the committee's expectations.\n</think>\n\nDoug Smith, previously acting as the chief executive of Child Support Agency, announced his resignation on 17th November after the agency's performance was criticized by MPs. However, according to civil service rules, Doug did not resign but proceeded with new leadership. The work and pensions committee is investigating the agency's challenges, targeting a £720m backlog and £947m unrecoversable payments. The committee is currently evaluating candidates for Mr Smith's successor. Publicly, there have been rumors that Mr Smith might take other jobs or have no clear idea about his current role, while official sources claim he remains in office until a replacement is found.", "tinyllama:1.1b": "The head of Child Support Agency, Doug Smith, whose departure was reported by Work Secretary Alan Johnson on 17 November as MPs grilled him over the agency's poor performance, will be moving on under civil service rules after his \"resignation\" was referred to by both Torry and Lib Dem leaders during Prime Ministers Questions. However, a Department for Work and Pensions spokewoman confirmed that Smith will continue in his job until a replacement is found. The work and pensions committee launched an inquiry into the CSAs performance after it became clear that despite a new system of calculating maintenance payment for new cases in 2003, a backlog of claims was still building up. It's unclear if Smith will be seeking any new employment opportunities while the work and pensions committee is \"duty bound\" to allow the current secretary to get new management into place in the CSAs.", "tinydolphin:1.1b": " The summary of the text provides a brief overview of the headline, stating that the \"failing\" Child Support Agency (CSA) chief who quit recently was allegedly still in post despite being reported to have resigned three months ago. This implies that the chief executive, Doug Smith, is still working at the helm of the troubled organization. The headline was written by a user named Dolphin and does not contain any explanation or reasoning process about the reasons behind the summary.", "phi:2.7b": " Doug Smith, the head of the failing Child Support Agency, is still in his position despite being widely reported to have resigned three months ago. His departure was announced on November 17th by Work Secretary Alan Johnson as MPs grilled him over the agency's poor performance. Although Mr Smith left the role for personal reasons, a spokeswoman for the Department for Work and Pensions confirmed that he was still in post until a replacement is found. The controversy surrounding the CSA continues with an ongoing backlog of claims and dissatisfaction among customers due to the American IT system used by EDS. While the work and pensions committee launched an inquiry into the agency's performance, it has since emerged that Mr Smith may be seeking new employment opportunities. Sir Archy Kirkwood, chairing the committee, said they were duty-bound to allow a new chief executive to take over, but Mr Waterson, a Tory MP, expressed surprise at Mr Smith still being in his job and suggested he should have cleared his desk by now. However, Work Secretary Alan Johnson has dismissed any concerns about Mr Smith's position as a \"non-story.\"\n", "orca-mini:3b": " The Child Support Agency's head of the troubled organisation, Doug Smith, has not actually resigned but will move on under civil service rules according to officials. He is still in post and will continue to work until a replacement is found. The Tory work and pensions committee launched an inquiry into the CSA's performance after its introduction in 1993 and has been chasing outstanding payments of more than £720m, while a further £947m has been designated as \"unrecoverable\". The MPs found American IT giant EDS' £456m system was \"nowhere near being fully functional\" and the number of dissatisfied, disenchanted and angry customers continues to escalate. The committee chairman, Sir Archy Kirkwood, said when Mr Johnson had announced Mr Smith was going he got the \"clear impression\" the CSA chief was retiring though it has since emerged that was not the case, and he may be seeking new employment opportunities. The Commons Work and Pensions Committee has been duty bound to allow the work and pensions secretary to get new management into place in the CSA and it will be \"premature\" to say anything further on the issue at the moment.", "hermes3:3b": "Child Support Agency head still in job despite reported resignation, contrary to announced departure three months ago.", "stablelm-zephyr:3b": "CSA chief Doug Smith, reported to have resigned three months ago, is still in his job according to a Department for Work and Pensions spokeswoman. Smith's departure was widely believed to be due to shouldering blame for the agency's failings, but officials now say he did not resign and will move on under civil service rules. The CSA has faced controversy since its introduction in 1993 to assess and enforce child support payments by absent parents. It is currently dealing with a backlog of claims worth over £720m and a further £947m designated as \"unrecoverable.\"", "chatgpt-4o-latest": "Doug Smith, head of the troubled Child Support Agency (CSA), was widely reported to have resigned in November, but he remains in his position. Work Secretary Alan Johnson had announced Smith's departure amid criticism of the CSA's poor performance, leading many, including MPs, to believe he had stepped down. However, officials now clarify that Smith did not resign but will leave under civil service rules once a replacement is found. The CSA has faced ongoing issues, including a backlog of claims and an ineffective IT system, with MPs criticizing its failures. Opposition politicians question why Smith is still in his role despite the earlier announcement. Johnson downplayed the situation, emphasizing the priority of appointing a new chief executive.", "stablelm2:1.6b": "Head of Child Support Agency, Doug Smith, resigned three months ago but is still in position due to civil service rules. Despite similar performance issues, his departure was not confirmed by him. The CSA has been surrounded by controversy since its introduction in 2003. Recent MPs published a critical report into the agency's failure. Tory MP David Willetts criticizes Smith for remaining in job while family members face consequences of CSA issues. Work and Pensions Committee launched inquiry due to backlog of claims but no new CEO has been introduced yet.", "granite3.1-dense:2b": "Despite being widely reported as having resigned, Child Support Agency (CSA) Chief Doug Smith remains in his position. Work Secretary Alan Johnson announced his departure on 17 November, stating it was time for a new leader to address the agency's struggles. However, officials now confirm that Smith did not resign but will continue in his role until a replacement is appointed. This news has caused confusion and concern among MPs, who had been led to believe he would step down soon after his announcement. The CSA, introduced in 1993 for child support enforcement, has faced significant criticism, including a £720 million backlog of outstanding payments and a large unrecoverable amount. The committee overseeing the agency questioned Johnson about Smith's resignation, expecting a new leader to take charge promptly. Johnson maintains that Smith is still in his post and that the selection process for the replacement is proceeding as planned.", "reference": "Lib Dem Sir Archy Kirkwood, who chairs the Commons work and pensions committee, said that when Mr Johnson had announced Mr Smith was going he got the \"clear impression\" the CSA chief was retiring though it had since emerged that was not the case, and he may be seeking new employment opportunities.Tory work and pensions spokesman David Willetts said families affected by CSA failings would wonder why Mr Smith was still in his job three months after his departure was announced.But committee member and Tory MP Nigel Waterson said he was \"amazed\" Mr Smith was still in his job.A Department for Work and Pensions spokeswoman confirmed Mr Smith was still in post and that he would continue in the job until a replacement was found.Mr Smith's departure was reported widely at the time as his shouldering the blame for the failings of the Child Support Agency.In November, when he surprised MPs and the watching media by announcing Mr Smith's departure, Mr Johnson said: \"I should tell you that Doug has decided that now is the time to stand aside and to allow a new chief executive to tackle the challenges ahead.On that day's Today programme Mr Johnson was asked why Mr Smith had been allowed to resign rather than be sacked.Doug Smith's departure was announced by Work Secretary Alan Johnson on 17 November as MPs grilled him over the agency's poor performance.He added that he had been absolutely open when he announced Mr Smith's departure to the select committee and how people chose to interpret it was a \"different thing\".\"No date was ever given for Doug Smith's departure,\" she said adding that the post had been advertised.Asked on Thursday about Mr Smith's position Mr Johnson told BBC Radio 4's World at One he thought it was a \"non-story\"."}