{"raw_text": "MPs tout Lords replacement plan\n \n A group of MPs has tried to raise the pressure on Tony Blair over reform to the House of Lords by publishing a detailed blueprint for change.\n \n The cross-party group has unveiled a draft bill proposing a smaller second chamber in which 70% of members would be elected. MPs and peers have failed to agree on reform since 1999 when 600 hereditaries lost their seats. The group says it can win support for removing the last 92 hereditaries. The government postponed plans to remove the remaining hereditary peers because they said they were unlikely to succeed after opposition in the Lords. Tony Blair has argued. there needs to be consensus on reforms. There have been suggestions there will be proposals for changing at least the powers of the Lords in Labour's manifesto.\n \n But the all-party group, including Tories Ken Clarke and Sir George Young, Labour's Robin Cook and Tony Wright and Liberal Democrat Paul Tyler, is confident its plan would win support from a \"large majority\". And they list former Conservative leader William Hague and former Labour leader Neil Kinnock as supporters of the plans. The group says the British public and a clear majority of MPs support replacing the Lords with a largely-elected second chamber. Their plan would see the House of Lords being renamed the Second Chamber of Parliament, and its members would be known as MSCPs.\n \n There would be 385 MSCPs, including 270 elected members, 87 appointed members and 16 bishops. They would serve for between 12 and 14 years. Mr Cook said holding elections for MSCPs on the same day as those for MPs might help motivate the electorate and increase voter turnout. He added: \"Over the last year I have seen many statements from senior figures of this government insisting the public must have the right of choice. \"What could be more important than a choice of the people who sit in our Parliament?\"\n \n The group believes pressure is growing for change and the government's current position is unsustainable. It wants all three main parties to include a commitment to a \"largely democratic\" second chamber in their manifestos. Mr Clarke said the issue \"went to the heart of reforming the health of the British political system\". And Mr Tyler said the prime minister's view that there was no agreement on the shape of the future of the Lords was flawed. \"The problem, I think, in the prime minister's mind is there doesn't appear to be a consensus that includes him,\" he said. \"We are providing a consensus\". The Elect the Lords Campaign said the draft bill was an important contribution to the debate. \"We believe this draft bill is detailed enough to form the basis of closer parliamentary scrutiny,\" said co-ordinator Peter Facey. \"In lieu of any other such clear proposals, the government must permit that to happen.\"\n", "llama3.2:1b": "A group of MPs has proposed a plan to replace the House of Lords with a second chamber in which 70% of members would be elected. The plan aims to win support from a majority of MPs and the public, including former Conservative leader William Hague and Labour leader Neil Kinnock. A draft bill outlines the changes, including 385 Members of the Second Chamber (MSCPs) serving for between 12-14 years.", "llama3.2:3b": "A cross-party group of MPs has published a draft bill proposing a smaller second chamber with 70% elected members, with a total of 385 members including bishops and appointed officials. The plan would rename the House of Lords as the Second Chamber of Parliament and serve for 12-14 years. The group believes it can win support from a \"large majority\" of MPs and that pressure is growing for change, saying the government's current position is unsustainable.", "gemma2:2b": "A cross-party group of MPs has proposed a plan to replace the House of Lords with an elected second chamber. The plan would see 70% of members elected, with remaining appointments for bishops and appointed individuals.  The group argues their plan is supported by a large majority of both the public and MPs. They are pushing for this plan to be included in Labour’s manifesto, along with a commitment to a largely democratic second chamber from all main parties. The group emphasizes that their proposal offers a more clear consensus than Tony Blair's approach to reform. \n", "qwen2.5:0.5b": "A cross-party group has unveiled a draft bill proposing a smaller second chamber in the House of Lords, with 70% elected. The bill aims to win support for removing hereditary peers and replacing the remaining hereditary Lords. The bill would rename the first chamber as the Second Chamber of Parliament, and provide MSCPs serving for between 12 and 14 years. The group believes this would lead to a larger majority in both House of Commons. They list former Conservative leader William Hague and former Labour leader Neil Kinnock as supporters of the plan.", "qwen2.5:1.5b": "A group of MPs has unveiled a blueprint for reforming the House of Lords, proposing 70% elected members and renaming it as MSCPs. The plan aims to replace hereditary peers with largely-elected second chamber representatives, seeking support from both Conservatives and Labour and even former Prime Minister Tony Blair. The proposal includes 270 elected MPs, 87 appointed members, 16 bishops, and a total of 385 MSCPs for 12-14-year terms to replace the Lords as a largely democratic second chamber.", "qwen2.5:3b": "A group of MPs has published a blueprint for reforming the House of Lords with a smaller chamber where 70% of members would be elected. The proposal aims to remove all hereditary peers and rename the chamber as the Second Chamber of Parliament, consisting of 385 members including 270 elected, 87 appointed, and 16 bishops, who would serve for 12-14 years. Currently, MPs have failed to agree on reform since 1999 when hereditary peers lost their seats. The cross-party group believes its plan would gain broad support from the public and a majority of MPs, including prominent figures like William Hague and Neil Kinnock who support the idea. They argue that holding elections for these members on the same day as those for MPs could motivate voters and increase turnout. The group calls for all three main parties to include a commitment to such reforms in their manifestos.", "opencoder:1.5b": "\"MPs tout Lords replacement plan\n\nA group of MPs has tried to raise the pressure on Tony Blair over reform to the House of Lords by publishing a detailed blueprint for change.\n\nThe cross-party group has unveiled a draft bill proposing a smaller second chamber in which 70% of members would be elected. \n\nMPs and peers have failed to agree on reform since 19,996 when 600 hereditaries lost their seats.\n\nThe government postponed plans to remove the remaining hereditary peers because they said they were unlikely to succeed after opposition in the Lords. \n\nTony Blair has argued. there needs to be consensus on reforms. There have been suggestions there will be proposals for changing at least the powers of the Lords in Labour's manifesto.\"\n\nHowever, it is crucial to acknowledge that the group believes pressure is growing for change and the current position is unsustainable. They want all three main parties to include a commitment to a \"largely democratic\" second chamber in their manifestos.\n", "smollm:1.7b": "The summary above captures the main ideas and key details from the original text. It provides a concise overview of the main points, including the key arguments, key figures, and the overall tone of the text. The summary is not an interpretation or explanation of the text, but rather a factual representation of the information presented in the original text.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about MPs trying to get Tony Blair's changes in the Lords. Let me read through it carefully.\n\nFirst, the group of MPs tried to pressure Tony Blair by publishing a detailed blueprint for reform. They're proposing a smaller second chamber with 70% elected members instead of 92 hereditaries. They say this can win support because they're a cross-party group including various parties like Tories and Labour. They mention that removing the last 92 heritages would be good, but the government is hesitant to remove them after opposition in the Lords.\n\nThe MPs believe their plan will get a \"large majority.\" They list some people who support it, like William Hague and Neil Kinnock from Labour. The group wants the House of Lords renamed as the Second Chamber of Parliament with elected MSCPs. These have 385 members, including elected ones, appointed, and bishops.\n\nI need to make sure I include all the key points: the cross-party effort, the reform proposal, the proposed changes in chamber composition, their plans for electing MSCPs, and the support from various parties. Also, note that removing last 92 heritages isn't feasible because of opposition.\n\nI should structure this into a concise summary without any extra details or explanations. Just plain text with the main ideas.\n</think>\n\nA cross-party group of MPs has submitted a detailed blueprint for reform in the Lords, proposing a smaller second chamber with 70% elected members instead of the 92 heritages removed. They aim to support removing the last 92 heritages but face opposition from government plans. The proposed Second Chamber would have 385 elected MSCPs, including elected and appointed members. Their goal is a \"large majority\" support, supporting William Hague and Neil Kinnock, while renaming the House of Lords as the Second Chamber of Parliament.", "tinyllama:1.1b": "The all-party group has proposed a smaller second chamber in which 70% of members will be elected, with the House of Lord being renamed the Second Chamber and its members known as MSCPs. The cross-party group believes that holding elections for MSCPs on the same day as MPs might help motivate voters and increase turnout. The group claims pressure is growing for change, citing a lack of consensus among main parties to include a \"large majority\" in their manifestos. They call for all three main parties to commit to a more democratic second chamber in their manifestos.", "tinydolphin:1.1b": " A group of MPs called the Elect the Lords Campaign has proposed a new system for the House of Lords in Britain. The proposal is to reduce the number of members from 70% to 65%, with 70% becoming elected peers and the rest appointed by the monarch or other bodies. This reform would make it easier to remove some hereditary peers and improve democracy at the expense of others.\n\nThe group, led by Ken Clarke (a former Conservative MP) and Robin Cook (a Labour MP), includes notable figures like William Hague, Neil Kinnock, Tony Wright, and George Young. They argue that the current system is unworkable and needs to be replaced with a more democratic second chamber. This bill has the support of a large majority of British voters and many MPs, and it could also increase turnout in future elections. The Elect the Lords Campaign hopes that if other parties follow suit, the government will consider this reform as well.", "phi:2.7b": " MPs publish blueprint for reforming the House of Lords by creating a smaller second chamber with 70% elected members and removing the remaining 92 hereditary peers. The plan is backed by cross-party group and former leaders from both Labour and Conservative parties. Pressure for reform has been growing, but the government has postponed plans to remove all hereditary peers. The group hopes their proposal will provide a basis for closer parliamentary scrutiny.\n", "orca-mini:3b": " MPs and peers have failed to agree on reform since 1999 when 600 hereditaries lost their seats. A cross-party group has unveiled a draft bill proposing a smaller second chamber in which 70% of members would be elected. The House of Lords would be renamed the Second Chamber of Parliament, and its members would be known as MSCPs. There would be 385 MSCPs, including 270 elected members, 87 appointed members, and 16 bishops. The government has postponed plans to remove the remaining hereditary peers because they said they were unlikely to succeed after opposition in the Lords. Tony Blair has argued there needs to be consensus on reforms. There have been suggestions that there will be proposals for changing at least the powers of the Lords in Labour's manifesto. But the all-party group, including Tories Ken Clarke and Sir George Young, Labour's Robin Cook and Tony Wright, and Liberal Democrat Paul Tyler, is confident its plan would win support from a \"large majority\". The group says the British public and a clear majority of MPs support replacing the Lords with a largely-elected second chamber. Their plan would see the House of Lords being renamed the Second Chamber of Parliament, and its members would be known as MSCPs. There would be 385 MSCPs, including 270 elected members, 87 appointed members, and 16 bishops.", "hermes3:3b": "Group of MPs publishes plan for smaller elected House of Lords, hoping to gain majority support and pressure Tony Blair to agree on reforms.", "stablelm-zephyr:3b": "A group of MPs published a plan to reform the House of Lords, proposing a smaller second chamber with 70% elected members called MSCPs (Members of the Second Chamber of Parliament). The group believes this change would be supported by the British public and a clear majority of MPs. The draft bill includes details on how the new chamber would be named and its composition, serving between 12 to 14 years. They believe pressure for change is growing and that consensus among all three main parties is essential for reforming the political system.", "chatgpt-4o-latest": "A cross-party group of MPs has proposed a detailed plan to reform the House of Lords, advocating for a smaller, largely elected second chamber. Their draft bill suggests renaming it the Second Chamber of Parliament, with 385 members, including 270 elected representatives, 87 appointed members, and 16 bishops, serving terms of 12 to 14 years. The group, which includes senior politicians from multiple parties, argues that public and parliamentary support exists for replacing the Lords with a more democratic body. They believe the government's reluctance to act is unsustainable and urge all major parties to commit to reform in their manifestos. Tony Blair has insisted on consensus before proceeding, but the group contends that a broad agreement already exists. The Elect the Lords Campaign supports the draft bill as a solid foundation for further parliamentary scrutiny.", "stablelm2:1.6b": "A group of MPs proposes a smaller House of Lords with elected members representing 25% of the members, aiming to win support for removing last hereditary peers. The plan would rename the chamber as the Second Chamber of Parliament and involve elected, appointed, and bishop members serving for between two and four years. Critics believe this proposal addresses concerns about the health of the British political system and seeks a consensus on reform among all three main parties.", "granite3.1-dense:2b": "A cross-party group of MPs, including Ken Clarke, George Young (Tories), Robin Cook (Labour), Tony Wright (Liberal Democrat), and Paul Tyler, has published a detailed blueprint for reforming the House of Lords. The plan proposes transforming the chamber into a largely-elected body with 385 members, consisting of 270 elected, 87 appointed, and 16 bishops. These members would serve for 12 to 14 years, renewing on the same day as MP elections to boost voter turnout. The group argues this proposal enjoys support from a significant majority of MPs and the public, and aims to persuade all major parties to commit to a democratically-elected second chamber in their manifestos. They believe the government's current stance on Lords reform is unsustainable due to lack of consensus. The group is confident their plan can garner substantial support, with former leaders William Hague and Neil Kinnock endorsing it.", "reference": "Their plan would see the House of Lords being renamed the Second Chamber of Parliament, and its members would be known as MSCPs.The group says the British public and a clear majority of MPs support replacing the Lords with a largely-elected second chamber.The cross-party group has unveiled a draft bill proposing a smaller second chamber in which 70% of members would be elected.A group of MPs has tried to raise the pressure on Tony Blair over reform to the House of Lords by publishing a detailed blueprint for change.The Elect the Lords Campaign said the draft bill was an important contribution to the debate.The government postponed plans to remove the remaining hereditary peers because they said they were unlikely to succeed after opposition in the Lords.But the all-party group, including Tories Ken Clarke and Sir George Young, Labour's Robin Cook and Tony Wright and Liberal Democrat Paul Tyler, is confident its plan would win support from a \"large majority\".And Mr Tyler said the prime minister's view that there was no agreement on the shape of the future of the Lords was flawed.\"The problem, I think, in the prime minister's mind is there doesn't appear to be a consensus that includes him,\" he said.The group says it can win support for removing the last 92 hereditaries.There would be 385 MSCPs, including 270 elected members, 87 appointed members and 16 bishops."}