{"raw_text": "Hague's six-figure earnings shown\n \n The rewards of leaving front-bench politics are shown in the latest annual register of members' interests.\n \n The register shows former Tory leader William Hague earning up to £820,000 on top of his MPs' salary, much of it from speaking fees. His former shadow chancellor Michael Portillo makes up to £560,000 a year - partly because of speeches and TV work. Ex-health secretary Alan Milburn earned up to £85,000 from speeches, articles and advice while not in the Cabinet.\n \n Mr Milburn was away from the frontbench for just more than a year between stepping down as health secretary and becoming Labour's election supremo. His declared interests include £20,000 from newspaper articles and fees of up to £35,000 for four speeches. He also commanded a salary of between £25,000 and £35,000 for being on investment company Bridgepoint Capital's European advisory committee. His time out of office will, however, have lost him his £71,433 minister's salary. Mr Hague's work outside Parliament included two one-man shows, which with other speaking fees netted him up to £480,000. He also earned up to £195,000 for a weekly column in the News of the World, and between £5,000 and £10,000 for presenting BBC'2's Have I Got News for You. Mr Hague was also paid an undisclosed amount for the newspaper serialisation of his biography of William Pitt the Younger and up to £135,00 for work as an adviser to various companies.\n \n Former Defence Secretary Michael Portillo makes some of his money as a non-executive director of BAE Systems. He is to stand down as an MP at the next election. And former Foreign Secretary Robin Cook was paid between £45,001 and £50,000 for the paperback edition of his book about his resignation from government. His declared income of up to £205,000 also includes payments for being a consultant to the Tote and for his regular column in the Guardian newspaper. The register also shows former Home Office Minister Ann Widdecombe declaring a £100,000 advance for her third and fourth novels. She also received up to £30,000 for acting as the Guardian's agony aunt and between £5,001 and £10,000 for appearing on ITV's Celebrity Fit Club. David Blunkett has become a paid adviser to Indepen Consulting Limited now he is not home secretary - he helps them with seminars about the relationship between government and business. He earns between £5,001and £10,000 for the work.\n \n Tony Blair's entry confirms that King Abdullah of Jordan paid for him to fly from a holiday in Egypt to official discussions - and for a sightseeing tour to Wadi Rum. Tory leader Michael Howard's only fresh entry is a Christmas hamper from the Sultan of Brunei. He also declares a trip to Mexico last year to address executives of News International, and helicopter and private jet travel paid for by supporters. Liberal Democrat leader Charles Kennedy registered donations to his office from supporters, a free ticket to last year's Bafta awards and rent from a single-bedroom flat in London. The register only contains new information for December 2004 - but Monday saw the publication of the annual review of the register, with the year's details. The payments are shown in bands of up £5,000, making it difficult to calculate the exact earnings.\n", "llama3.2:1b": "Former Tory leader William Hague earns up to £820,000 from speaking fees and interests including a £71,433 minister's salary.\n\nMichael Portillo makes up to £560,000 per year from speeches, TV work, and newspaper articles.\n\nAlan Milburn earns up to £85,000 per year from speeches, articles, advice, and investments.\n\nWilliam Hague also receives payments for two one-man shows and a weekly column in the News of the World.\n\nMichael Portillo stands down as an MP at the next election due to his time out of office.", "llama3.2:3b": "William Hague earned up to £820,000 from speaking fees, Michael Portillo made up to £560,000 a year, Alan Milburn earned up to £85,000 from speeches and articles, while Tony Blair was paid by King Abdullah for flights and tours. Ann Widdecombe declared a £100,000 advance for her novels, David Blunkett earns between £5,001 and £10,000 for seminars.", "gemma2:2b": "Several former MPs earned significant income outside of parliament. William Hague earned up to £820,000 from speaking engagements and media work. Michael Portillo made up to £560,000 as a non-executive director and for TV appearances. Alan Milburn earned between £20,000 to £35,000 from articles and speeches while out of cabinet. Robin Cook's earnings included book sales and consulting fees. David Blunkett earns money advising on government business. Tony Blair received funds for travel.  \n", "qwen2.5:0.5b": "Former Tory leader William Hague received top-paid members' interests of £820,000 plus his MPs salary and more from speaking fees. Former shadow chancellor Michael Portillo earned up to £560,000 for speeches, TV work, newspaper articles, and investment company Bridgepoint Capital's European advisory committee. Alan Milburn also received payments of £85,000 from speeches, articles, and advice while not in the Cabinet. Mr Hague's time out from office will lose him his minister's salary and his two one-man shows earn £480,000 each. Tony Blair's King Abdullah of Jordan paid him to fly to official discussions and for a sightseeing tour. Charles Kennedy registered donations from supporters, flew and had free tickets to Bafta awards, and rented a single-bedroom flat in London.", "qwen2.5:1.5b": "Former politicians earn significant incomes from speaking engagements and consultancy work outside their official roles. Key figures earning upwards of £820, 000 include William Hague, Michael Portillo, and Alan Milburn. Tony Blair's annual income is confirmed, with occasional travel expenses for international meetings. Other notable entries include former Home Secretary Ann Widdecombe and former Foreign Secretary Robin Cook.", "qwen2.5:3b": "The latest annual register of members' interests shows significant income for former politicians, including William Hague earning up to £820,000, Michael Portillo £560,000, and Alan Milburn £85,000. These figures are mainly from speaking fees and media work. Other notable figures include ex-Home Office Minister Ann Widdecombe, who earned up to £100,000 for her novels and acting as the Guardian's agony aunt; former Defence Secretary Michael Portillo earning some income as a non-executive director of BAE Systems; and David Blunkett earning between £5,001 and £10,000 for his role as an adviser to Indepen Consulting Limited. Tony Blair also received payments from King Abdullah of Jordan, while Michael Howard had donations from supporters and free tickets to events. Charles Kennedy declared rent from a London flat. Payments are shown in bands up to £5,000, making exact earnings difficult to calculate.", "opencoder:1.5b": "Hague's six-figure earnings shown.\n\nThe register shows former Tory leader William Hague earning up to £820,000 on top of his MPs' salary, much of it from speaking fees.\n\nHis former shadow chancellor Michael Portillo makes up to £560,000 a year - partly because of speeches and TV work.\n\nEx-health secretary Alan Milburn earned up to £85,000 from speeches, articles and advice while not in the Cabinet.\n\nMr Milburn was away from the front-bench for just more than a year between stepping down as health secretary and becoming Labour's election supremo.\n\nHis declared interests include £20,000 from newspaper articles and fees of up to £35,000 for four speeches. He also commanded a salary of between £25,000 and £35,000 for being on investment company Bridgepoint Capital's European advisory committee. His time out of office will, however, have lost him his £71,433 minister's salary.\n\nMr Hague's work outside Parliament included two one-man shows, which with other speaking fees netted him up to £480,000.\n\nHe also earned up to £195,000 for a weekly column in the News of the World, and between £5,000 and £10,000 for presenting BBC'2's Have I Got News for You. Mr Hague was also paid an undisclosed amount for the newspaper serialisation of his biography of William Pitt the Younger and up to £135,00 for work as an adviser to various companies.\n\nFormer Defence Secretary Michael Portillo makes some of his money as a non-executive director of BAE Systems. He is to stand down as an MP at the next election. And former Foreign Secretary Robin Cook was paid between £45,001 and £50,000 for the paperback edition of his book about his resignation from government.\n\nHis declared income of up to £205,000 also includes payments for being a consultant to the Tote and for his regular column in the Guardian newspaper. The register also shows former Home Office Minister Ann Widdecombe declaring a £100,000 advance for her third and fourth novels. She also received up to £30,000 for acting as the Guardian's agony aunt and between £5,001 and £10,000 for appearing on ITV's Celebrity Fit Club.\n\nTony Blair's entry confirms that King Abdullah of Jordan paid for him to fly from a holiday in Egypt to official discussions - and for a sightseeing tour to Wadi Rum. Tory leader Michael Howard's only fresh entry is a Christmas hamper from the Sultan of Brunei. He also declares a trip to Mexico last year to address executives of News International, and helicopter and private jet travel paid for by supporters. Liberal Democrat leader Charles Kennedy registered donations to his office from supporters, a free ticket to Bafta awards and rent from a single-bedroom flat in London.\n\nThe annual review of the register, with the year's details. The payments are shown in bands of up £5,000, making it difficult to calculate the exact earnings.\n", "smollm:1.7b": "The rewards of leaving front-bench politics are shown in the latest annual register of members' interests.\n\nThe register shows former Tory leader William Hague earning up to £820,000 on top of his MPs' salary, much of it from speaking fees. His former shadow chancellor Michael Portillo makes up to £560,000 a year - partly because of speeches and TV work. Alan Milburn earned up to £85,000 from speeches, articles and advice while not in the Cabinet.\n\nMr Milburn was away from the frontbench for just over a year between stepping down as health secretary and becoming Labour's election supremo. His declared interests include £20,000 from newspaper articles and fees of up to £35,000 for four speeches. He also commanded a salary of between £25,000 and £35,000 for being on investment company Bridgepoint Capital's European advisory committee. His time out of office will, however, have lost him his £71,433 minister's salary.\n\nMr Milburn was away from the frontbench for just over a year between stepping down as health secretary and becoming Labour's election supremo. His declared interests include £20,000 from newspaper articles and fees of up to £35,000 for four speeches. He also commanded a salary of between £25,000 and £35,000 for being on investment company Bridgepoint Capital's European advisory committee. His time out of office will, however, have lost him his £71,433 minister's salary.\n\nFormer Defence Secretary Michael Portillo makes some of his money as a non-executive director of BAE Systems. He is to stand down as an MP at the next election. And former Home Office Minister Ann Widdecombe declared a £100,000 advance for her third and fourth novels. She also received up to £30,000 for being an agony aunt.\n\nDavid Blunkett has become a paid adviser to Indepen Consulting Limited now he is not home secretary - he helps them with seminars about the relationship between government and business. He earns between £5,001 and £10,000 for the work. The register only contains new information for December 2004 - but Monday saw the publication of the annual review of the register, with the year's details.\n\nTony Blair's entry confirms that King Abdullah of Jordan paid for him to fly from a holiday in Egypt to official discussions - and for a sightseeing tour to Wadi Rum. Tory leader Michael Howard's only fresh entry is a Christmas hamper from the Sultan of Brunei. He also declares a trip to Mexico last year to address executives of News International, and helicopter and private jet travel paid for by supporters. The register only contains new information for December 2004 - but Monday saw the publication of the annual review of the register, with the year's details.\n\nThe payments are shown in bands of up £5,000, making it difficult to calculate the exact earnings.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text about various MPs and their earnings from the \"Lessons of Leadership\" register. Let me start by reading through all that information again carefully.\n\nFirst, the text talks about the concept that leaving front-bench politics can lead to better leadership opportunities. It then goes into details about some members' salaries, highlighting who is earning more or less when they leave their positions on the committee.\n\nThe list includes several MPs with different figures:\n\n1. William Hague was mentioned at £820k plus his MP salary and speaking fees.\n2. Michael Portillo made up to £560k for speeches and TV work.\n3. Alan Milburn earned up to £85k from speeches, articles, and advice.\n4. Mr. Milburn left for almost a year before becoming supremo, losing his minister's salary.\n5. Mr. Hague had some speaking fees and earnings from a column on News of the World.\n6. He also received a subscription fee for his biography and £195k as an advisory role.\n7. Mr. Portillo was paid as a non-executive director at BAE Systems.\n8. Michael Cook got £45,000 to £50,000 from a paperback book on his resignation.\n9. Ann Widdecombe received up to £30k for consulting and her column in the Guardian.\n10. David Blunkett was paid £5k to £10k for Seminars at Indepen Consulting.\n\nNext, Tony Blair's entry is about him flying from Egypt to discussions but also seeing a tour of Wadi Rum. Tory leader Michael Howard had a Christmas hamper and went on a trip to Mexico to address News International executives.\n\nLiberal Democrat leader Charles Kennedy donated money to his office, got a free ticket for Bafta, and rented a flat in London. The register only starts in 2004 with new information being published each year. Salaries are shown in bands of £5k, making it hard to get exact numbers.\n\nI need to condense all this into a concise summary, capturing the main points about the earnings from the register and how they relate to leadership and personal achievements.\n</think>\n\nThe text discusses the concept that front-bench politicians may earn more when leaving office for leadership roles. It lists MPs with varying salaries from 2004's registry, highlighting Michael Portillo as a significant contributor earning up to £560k. William Hague had earnings of up to £820k, including speaking fees and a column in News of the World. Mr. Milburn left office briefly before becoming supremo, losing his MP salary. Tony Blair flew from Egypt but traveled for discussions or a tour, while Michael Howard went on a trip to Mexico. Charles Kennedy donated money to his office, got a free ticket, and rented a flat.", "tinyllama:1.1b": "The text states that former Tory leader William Hague earned up to $820,000 on top of his MPs' salary from speaking fees and TV work, and ex-health secretary Alan Milburn earned a total income of $1.5 million, including payments for articles and advice while not in the Cabinet. The text also mentions former Defense Secretary Michael Portillo earning around $205,000 on top of his declared annual income of $85,000, as well as former Home Office Minister Ann Widdicombe receiving an additional $100,000 for her third and fourth novels. The text also mentions former Home Secretary Tony Blair's entry in the register as confirming that King Abdullah of Jordan paid him a total of $6,000 for a visit to the country in 2004, while other notable figures include £135,000 earnings from newspapers serialization and consultant fees of up to £195,000. The text also notes the entry of former Tory leader Charles Kennedy registering donations to his office from supporters and rent payments from a single-bedroom flat in London.", "tinydolphin:1.1b": " According to the summary provided, several key figures from former Tory leaders showcase their income levels and earnings through various sources such as public speeches, media appearances, consultancy fees, travel expenses, sponsorships and other benefits. In addition, there are some individuals who received substantial payments for various commitments like serving in the House of Commons or becoming an MP. The list also includes contributions from some political figures and their family members to their respective parties' electoral campaigns. Overall, the report provides a comprehensive snapshot of the earnings and financial commitments of influential politicians during the period December 2004-January 2005.", "phi:2.7b": " William Hague and Michael Portillo are former Tory leaders who earn money from speaking fees, newspaper articles, TV work, and being on investment company boards. Alan Milburn earned a salary as health secretary but continued earning income outside Parliament through speeches, articles, and TV appearances. Former Labour election supremo Alan Milburn was away from the frontbench for over a year before becoming the new Labour's election supremo, making him lose his minister's salary while in office.\n", "orca-mini:3b": " The text summarizes the information provided in the article about former politicians' earnings from speaking fees, book royalties, and other sources. It mentions William Hague, Michael Portillo, Robin Cook, Ann Widdecombe, and David Blunkett's earnings and declares their declared income. The text also mentions Tony Blair's expenses, such as his travel costs to Egypt and Jordan, and Michael Howard's expenses, including a Christmas hamper from the Sultan of Brunei. It also mentions Charles Kennedy's donations to his office and free tickets to the Bafta awards, as well as rent from a single-bedroom flat in London. Finally, it notes that the information was gathered in December 2004 and is included in the annual review of members' interests register.", "hermes3:3b": "William Hague and Michael Portillo earn six-figure speaking fees as ex-Tory leaders. Alan Milburn earns up to £85,000 from speeches while not in Cabinet.", "stablelm-zephyr:3b": "The text reveals the earnings of several former politicians from front-bench politics, showing that William Hague earned up to £820,000, including speaking fees and his MPs' salary, while Michael Portillo made up to £560,000 a year. Former Health Secretary Alan Milburn earned up to £85,000 from speeches, articles, and advice outside of Cabinet. Their earnings are partly due to speeches, TV work, and other activities during their time away from front-bench politics. The annual register of members' interests also shows other politicians earning money through various activities such as appearing on TV shows, writing books, or working as advisers for companies.", "chatgpt-4o-latest": "Former Tory leader William Hague earned up to £820,000 in addition to his MP salary, primarily from speaking fees and media work. Michael Portillo made up to £560,000 from speeches and TV roles, while Alan Milburn earned up to £85,000 from speeches, articles, and advisory roles. Robin Cook received up to £205,000 from book sales and consultancy, and Ann Widdecombe declared a £100,000 advance for her novels. David Blunkett became a paid adviser after leaving office. Other MPs, including Tony Blair, Michael Howard, and Charles Kennedy, declared gifts, travel expenses, and donations. The register only includes new information for December 2004, with earnings shown in broad bands.", "stablelm2:1.6b": "William Hague earned up to £60,0..\nMichael Portillo: Up to £240,000 from speaking fees and non-executive director positions.\nAlan Milburn: Earned up to £120,000 from newspaper articles, speeches, and advice. No longer in Cabinet.\nRobin Cook: Earned between £53,000 and £86,000 for book advance, consulting work, and Guardian column.\nAnn Widdecombe: Received a £24,000 advance for her novels, acting as the Guardian's agony aunt, and TV appearances.\nDavid Blunkett: Earned between £5,000 and £12,000 for seminars with Indepen Consulting Limited and various trips.\nCharles Kennedy registered donations from supporters, a free ticket to Bafta awards, and rent from a London flat.", "granite3.1-dense:2b": "The latest annual register of members' interests reveals substantial post-Parliamentary earnings for several former UK politicians. Former Tory leader William Hague earned up to £820,000, including speaking fees and a weekly column in The News of the World. Michael Portillo, his successor as shadow chancellor, made up to £560,000 from speeches, TV work, and non-executive directorships. Alan Milburn, ex-health secretary, earned up to £85,000 through speeches, articles, advice, and a committee position on Bridgepoint Capital's European advisory board.\n\nFormer Defence Secretary Michael Portillo received payments for his non-executive role at BAE Systems and will lose his ministerial salary upon standing down as an MP. Robin Cook earned between £45,001 and £50,000 from a paperback book deal, consultancy work with the Tote, and a Guardian column. Ann Widdecombe declared a £100,000 advance for her novels, as well as acting as an agony aunt in the Guardian and appearing on ITV's Celebrity Fit Club.\n\nDavid Blunkett has become a paid adviser to Indepen Consulting Limited, earning between £5,001 and £10,000 for seminars. Tony Blair received payments from King Abdullah of Jordan for official discussions in Egypt and Wadi Rum sightseeing tour. Michael Howard's entry includes a Christmas hamper from the Sultan of Brunei and travel expenses to address News International executives in Mexico. Charles Kennedy registered supporter donations, a free Bafta ticket, and rent for a London flat.\n\nThe register shows income in £5,000 increments, making precise calculations challenging due to the lack of specific figures.", "reference": "Mr Hague was also paid an undisclosed amount for the newspaper serialisation of his biography of William Pitt the Younger and up to £135,00 for work as an adviser to various companies.The register also shows former Home Office Minister Ann Widdecombe declaring a £100,000 advance for her third and fourth novels.The register shows former Tory leader William Hague earning up to £820,000 on top of his MPs' salary, much of it from speaking fees.His former shadow chancellor Michael Portillo makes up to £560,000 a year - partly because of speeches and TV work.Mr Milburn was away from the frontbench for just more than a year between stepping down as health secretary and becoming Labour's election supremo.And former Foreign Secretary Robin Cook was paid between £45,001 and £50,000 for the paperback edition of his book about his resignation from government.He also declares a trip to Mexico last year to address executives of News International, and helicopter and private jet travel paid for by supporters.His declared income of up to £205,000 also includes payments for being a consultant to the Tote and for his regular column in the Guardian newspaper.Former Defence Secretary Michael Portillo makes some of his money as a non-executive director of BAE Systems.He also earned up to £195,000 for a weekly column in the News of the World, and between £5,000 and £10,000 for presenting BBC'2's Have I Got News for You."}