{"raw_text": "Parties build up poll war chests\n \n The Labour Party received more than £5m in donations in the final quarter of 2004, new figures show.\n \n This is nearly half of the £11,724,929 received by 16 political parties listed by the Electoral Commission. The Conservatives were in second place with donations totalling £4,610,849, while the Liberal Democrats received just over £1m. The majority of Labour's donations came from affiliated trade unions. There were also large sums from individuals. Lord Drayson, whose company PowderJect won multi-million pound contracts to provide smallpox vaccine to the government after the 11 September terror attacks, gave £500,000 to the party just days before Christmas.\n \n This followed an earlier donation of the same amount earlier in 2004. He was made a lord by Tony Blair last year. Other significant donations came from retired millionaire businessman and philanthropist Sir Christopher Ondaatje who gave the party a sum of £500,000, and refrigerator magnate William Haughey OBE who gave £330,000. The totals for the fourth quarter were well up on the same period of 2003, as the parties built up their war chests for the general election campaign. The largest donation to the Conservatives was a bequest from Ruth Beardmore of nearly £400,000. The joint founder of merchant bank Hambro Magan gave £325,417. There were also donations topping £250,000 for the Conservatives from Scottish Business Groups Focus on Scotland and the Institute of International Research, the world's largest independent conference company.\n \n Also among the gifts to the Tories were 24 donations totalling £161,840 from Bearwood Corporate Services. This company is controlled by the party's former treasurer Lord Ashcroft which has directed almost £300,000 to specific marginal constituencies over the past two years. The Liberal Democrats' largest donor was the Joseph Rowntree Reform Trust Ltd, a company which promotes political reform and constitutional change, which gave a sum of £250,000. And fast food giants McDonald's are listed as donating a sum of £10,575. This was a fee the firm paid for a room for an event held with the work and skills foundation during the party's conference. The UK Independence Party, which lost its main donor Paul Sykes amid the row over Robert Kilroy-Silk's bid for the leadership last autumn, took in £63,081. Just £8,170 of this was cash and the remainder came in gifts in kind, such as office space and printing. Registered political parties are required to set out each quarter all donations over £5,000 to their headquarters and over £1,000 to local constituency parties they receive. It is an offence for a person to knowingly or recklessly make a false declaration about party donations.\n", "llama3.2:1b": "Labour Party received more than £5m in donations. \n\nThe Labour Party's campaign funds were increased by nearly half due to donations from various sources including affiliated trade unions, individuals, and organizations. Lord Drayson gave £500,000 just before Christmas. Other notable donors included retired businessman Sir Christopher Ondaatje (£500,000) and philanthropist William Haughey (£330,000).", "llama3.2:3b": "Labour Party received £5m in donations in the final quarter of 2004, with most coming from trade unions and individuals like Lord Drayson and Sir Christopher Ondaatje. The Conservatives received £4.6m, while the Liberal Democrats got £1m. Other parties' largest donors included Ruth Beardmore (£400k), Lord Ashcroft (£300k), and McDonald's (£10,575).", "gemma2:2b": "The Labour Party received the most donations (£5 million) in the final quarter of 2004, followed by the Conservatives (£4.6 million).  Significant donations came from individuals, trade unions, and Lord Drayson. The Conservatives also received notable donations, including a bequest from Ruth Beardmore and contributions from business groups like Scottish Business Groups Focus on Scotland.  The Liberal Democrats received funding from the Joseph Rowntree Reform Trust Ltd., while the UK Independence Party reported £63,081 in donations during that period, including items donated in kind. \n", "qwen2.5:0.5b": "The Labour Party received more than £5m in donations in the final quarter of 2004 compared to £11,724,929 from all political parties listed by the Electoral Commission.\n\nIn total, the Labour Party received $5 million in donations, which was nearly half of $11.725 million for the 16 political parties listed in the EC. They also received $4.6 million from affiliated trade unions and gave £500,000 to their founder (Lord Drayson). The Liberal Democrats received approximately £1 million, and the Conservatives had a significant donation of $4.6 million ($532,798).\n\nA notable donor to the Conservative party was Lord Ashcroft from Bearwood Corporate Services, who gave over £161,840 in donations with nearly 99% accuracy.\n\nFor the Liberal Democrats, there were large sums (over $250,000) from individuals and companies like William Haughey OBE of $330,000. The biggest donation to the Conservatives was a bequest by Ruth Beardmore worth over £400,000.\n\nAnother significant donor to the Conservative party was the Joseph Rowntree Reform Trust Ltd, which donated £250,000 for marginal constituencies and promoted political reform and constitutional change in Scotland.\n\nFor the Independent party, there were no donations.", "qwen2.5:1.5b": "The Labour Party received nearly half of the £11 million in political party donations from 2004 through December, primarily from affiliated trade unions and individuals. Significant donors included Lord Drayson, Sir Christopher Ondaatje, William Haughey OBE, and Scottish Business Groups Focus on Scotland, among others. The Conservatives raised over £4.6 million, with Ruth Beardmore's bequest topping the list of largest donations.", "qwen2.5:3b": "Labour received more than £5m in donations in the final quarter of 2004; Conservatives were second with £4.61m and Lib Dems just over £1m. Labour’s donations came mainly from affiliated trade unions, individuals (including Lord Drayson who donated £500k twice) and Sir Christopher Ondaatje (£500k). The Conservatives received a significant donation of nearly £400k from Ruth Beardmore and £325k from former party treasurer Lord Ashcroft. Liberal Democrats were boosted by donations from the Joseph Rowntree Reform Trust Ltd (£250k) and McDonald's (£10,575 for event space). UKIP received £63,081 of which only £8,170 was cash, with the rest in gifts in kind. All parties must declare quarterly donations over £5,000 to headquarters and local constituencies.", "opencoder:1.5b": "Parties build up poll war chests\n\nLabour Party received more than $5 million in donations in the final quarter of 2004.\n\nThis is nearly half of the $11,724,929 received by 16 political parties listed by the Electoral Commission.\n\nThe Conservatives were in second place with donations totalling $4,610,849.\n\nThe Liberal Democrats received just over $1 million.\n\nLord Drayson gave £500,000 to the party just days before Christmas.\n\nAlso, significant donations came from retired millionaire businessman and philanthropist Sir Christopher Ondaatje who gave the party a sum of £500,000.\n\nThe largest donation to the Conservatives was a bequest from Ruth Beardmore of nearly £400,000.\n\nThe joint founder of merchant bank Hambro Magan gave £325,417.\n\nThere were also donations topping £250,000 for the Conservatives from Scottish Business Groups Focus on Scotland and the Institute of International Research. \n\nAnd fast food giants McDonald's are listed as donating a sum of £10,575.\n\nThis was a fee the firm paid for a room for an event held with the work and skills foundation during the party's conference.\n\nThe UK Independence Party took in £63,081. Just £8,170 of this was cash and the remainder came in gifts in kind.\n\nRegistered political parties are required to set out each quarter all donations over £5,000 to their headquarters and over £1,000 to local constituency parties they receive. \n\nAn offence for a person to knowingly or recklessly make a false declaration about party donations.\n", "smollm:1.7b": "The Labour Party received more than £5m in donations in the final quarter of 2004, new figures show. The Conservatives were in second place with donations totalling £4,610,849, while the Liberal Democrats received just over £1m. The majority of Labour's donations came from affiliated trade unions. There were also large sums from individuals. Lord Drayson's company PowderJect won multi-million pound contracts to provide smallpox vaccine to the government after the 11 September terror attacks, and he gave £500,000 to the party just days before Christmas. Other significant donations came from retired millionaire businessman and philanthropist Sir Christopher Ondaatje who gave the party a sum of £500,000, and refrigerator magnate William Haughey OBE who gave £330,417. The totals for the fourth quarter were well up on the same period of 2003, as the parties built up their war chests for the general election campaign. The largest donation to the Conservatives was a bequest from Ruth Beardmore of nearly £400,000. The joint founder of merchant bank Hambro Magan gave £325,417. There were also donations topping £250,000 for the Conservatives from Scottish Business Groups Focus on Scotland and the Institute of International Research, the world's largest independent conference company.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text. The user wants only the summary in plain text without any explanations or formatting. Let me read through the text carefully.\n\nFirst, it mentions that Labour received more than £5 million in donations in the final quarter of 2004. That's nearly half of £11.7 million, which is what other parties like Conservatives and Liberal Democrats received combined. \n\nLooking at their donations, the Conservatives had the most with £4.6 million. The Liberal Democrats were next with just over £1 million. Labour's large donations mostly came from unions and individuals.\n\nThere's mention of Lord Drayson giving £500,000 to Labour around Christmas. He was made a lord by Tony Blair last year. Other donors include Sir Christopher Ondaatje who gave £500,000 and William Haughey, who gave £330,000.\n\nThe donations over the fourth quarter were higher than the previous three quarters because they built up their war chests for the general election. The Conservatives received bequests from Ruth Beardmore and another significant donation of £400,000. The joint founder of Hambro Magan also gave £325,417.\n\nOther donors include Bearwood Corporate Services with £161,840, Joseph Rowntree Reform Trust with £250,000, and McDonald's donated £10,575. \n\nThere are penalties if parties make false declarations about donations. registered parties must donate at least £5k to their headquarters or local constituencies each quarter.\n\nI should condense all this information into a concise summary without adding any extra details.\n</think>\n\nParties accumulated large sums in the 2004 election campaign, with Labour receiving nearly half of £11.7 million from other parties combined. They received significant donations mainly from unions and individuals, including Lord Drayson who gave £500k, Sir Ondaatje who provided £500k, and William Haughey for £330k. The Conservative Party led with £4.6m, while the Liberal Democrats had just over £1m. Gifts also included £250k from Joseph Rowntree Reform Trust, £161k from Bearwood Corporate Services, and £10,575 from McDonald's.", "tinyllama:1.1b": "The Labour Party received nearly half of the £11,724,929 in donations received by 16 political parties listed by the Electoral Commission for the final quarter of 2004. This was followed by major donors such as Lord Drayson, who gave a sum of £500,000 to the party just days before Christmas. Other significant donations came from retired millionaire businessman and philanthropist Sir Christopher Ondaatje, refrigerator magnate William Haughey OBE, and Scottish Business Groups Focus on Scotland founder Ruth Beardmore of nearly £400,000. The joint founder of the world's largest independent conference company, the Institute of International Research, also gave £325,417 to the Tories. Other major donors included fast food giant McDonald's, which took in £10,575 for an event held with the work and skills foundation during the party's conference. The UK Independence Party received £63,081 of donations over £5,000. This was followed by registered political parties requiring to declare all donations over £5,000 to their headquarter and over £1,000 to local constituency parties they receive. It is an offence for a person to knowingly or recklessly make a false declaration about party donations.", "tinydolphin:1.1b": " The Labour Party received more than £5 million in donations in the final quarter of 2004, according to new figures from the Electoral Commission. This is nearly half of the £11,724,929 that was reported by 16 political parties listed by the commission during the same period. The Conservatives were in second place with donations totalling £4,610,849, while the Liberal Democrats received over £1 million. The majority of Labour's donations came from affiliated trade unions.", "phi:2.7b": " Labour Party received nearly half of the donations from 16 political parties listed by the Electoral Commission in the final quarter of 2004. The majority of Labour's donations came from affiliated trade unions, and individual donors such as Lord Drayson and Sir Christopher Ondaatje also contributed significant sums.\n", "orca-mini:3b": " Political parties in the UK received significant donations during the fourth quarter of 2004, with the Labour Party receiving more than £5m in donations. The Conservatives received nearly half of this amount from affiliated trade unions, while the Liberal Democrats received just over £1m. Lord Drayson, a former Labour minister and recipient of lucrative contracts after the 9/11 attacks, gave the party £500,000, and William Haughey OBE, a refrigerator magnate, gave £330,000. Ruth Beardmore, the former wife of Sir Christopher Ondaatje, gave £400,000 to the Conservatives. Other significant donors included Bearwood Corporate Services, controlled by the party's former treasurer Lord Ashcroft, which directed almost £300,000 to specific marginal constituencies over the past two years. McDonald's, a fast food giant, donated £10,575. The UK Independence Party lost its main donor Paul Sykes amidst the row over Robert Kilroy-Silk's bid for the leadership last autumn and received £63,081.", "hermes3:3b": "Labour party received over £5m in donations (~45% of total), followed by Conservatives (£4.6m) and Liberal Democrats (£1m) in last quarter of 2004. Parties building up war chests for general election campaign.", "stablelm-zephyr:3b": "In the final quarter of 2004, the Labour Party received over £5 million in donations, making it the highest receiver among 16 political parties listed by the Electoral Commission. The Conservatives followed with £4,610,849, and the Liberal Democrats with just over £1 million. The majority of Labour's donations came from affiliated trade unions and individual donors, such as Lord Drayson and Sir Christopher Ondaatje. Donations increased compared to the same period in 2003, preparing parties for the general election campaign.", "chatgpt-4o-latest": "Labour received over £5m in donations in late 2004, nearly half of the £11.7m given to 16 political parties. The Conservatives followed with £4.6m, and the Liberal Democrats received just over £1m. Labour's major donors included trade unions, Lord Drayson (£500,000), Sir Christopher Ondaatje (£500,000), and William Haughey (£330,000). The Conservatives' largest donation was a £400,000 bequest from Ruth Beardmore, with additional contributions from business groups and Lord Ashcroft’s Bearwood Corporate Services. The Liberal Democrats' biggest donor was the Joseph Rowntree Reform Trust (£250,000). UKIP received £63,081, mostly in non-cash contributions. Political parties must disclose large donations quarterly, and false declarations are illegal.", "stablelm2:1.6b": "Labour Party receives more than £5m in donations in final quarter of 2004; Conservatives come second with £4m, while Liberal Democrats received over £1m. Labour's donations mostly came from affiliated trade unions. Significant donations also went to Conservatives from Scottish Business Groups and Bearwood Corporate Services. Liberal Democrats' largest donor was the Joseph Rowntree Reform Trust Ltd. UK Independence Party accepted £85k in gifts, including office space and printing. Parties built up war chests for general election campaign. Registered political parties must disclose each quarter donations over £5,000 to their headquarters or local constituency party.", "granite3.1-dense:2b": "In Q4 2004, political parties in the UK collected substantial funding, totaling £11,724,929 as reported by the Electoral Commission. The Labour Party secured over £5m, primarily from affiliated trade unions and significant individual donors like Lord Drayson (£500,000), Sir Christopher Ondaatje (£500,000), William Haughey (£330,000), and Bearwood Corporate Services (£161,840, managed by Lord Ashcroft's foundation). The Conservatives received £4,610,849, with major donations from Ruth Beardmore (nearly £400,000), Hambro Magan (£325,417), and Bearwood Corporate Services (£161,840). The Liberal Democrats gathered around £1m, with the Joseph Rowntree Reform Trust Ltd as their largest donor at £250,000. McDonald's, a fast-food company, donated £10,575 for an event during the Liberal Democrats' conference. The UK Independence Party collected £63,081, primarily in gifts in kind like office space and printing due to the loss of its main donor, Paul Sykes. These funds were built to support the parties' general election campaigns, with all donations over £5,000 disclosed quarterly and any false declarations punishable by law.", "reference": "Registered political parties are required to set out each quarter all donations over £5,000 to their headquarters and over £1,000 to local constituency parties they receive.The Labour Party received more than £5m in donations in the final quarter of 2004, new figures show.Other significant donations came from retired millionaire businessman and philanthropist Sir Christopher Ondaatje who gave the party a sum of £500,000, and refrigerator magnate William Haughey OBE who gave £330,000.The largest donation to the Conservatives was a bequest from Ruth Beardmore of nearly £400,000.The Conservatives were in second place with donations totalling £4,610,849, while the Liberal Democrats received just over £1m.The Liberal Democrats' largest donor was the Joseph Rowntree Reform Trust Ltd, a company which promotes political reform and constitutional change, which gave a sum of £250,000.This is nearly half of the £11,724,929 received by 16 political parties listed by the Electoral Commission.There were also donations topping £250,000 for the Conservatives from Scottish Business Groups Focus on Scotland and the Institute of International Research, the world's largest independent conference company.Also among the gifts to the Tories were 24 donations totalling £161,840 from Bearwood Corporate Services."}