{"raw_text": "Goldsmith denies war advice claim\n \n The attorney general has denied his statement to Parliament about the legality of the Iraq war was drafted by Downing Street officials.\n \n Lord Goldsmith said Lord Falconer and Baroness Morgan played no part in drafting the answer. He added the answer represented his view that the war was legal, but was not a summary of his advice to the PM. The government has resisted calls to publish the full advice, saying such papers are always kept confidential.\n \n In a statement, Lord Goldsmith said: \"I was fully involved throughout the drafting process and personally finalised, and of course approved, the answer.\" He said the answer had been prepared in his office with the involvement of Solicitor General Harriet Harman, two of his own officials, three Foreign Office officials, a QC, Christopher Greenwood and the then Lord Chancellor, Lord Irvine of Lairg.\n \n \"No other minister or official was involved in any way.\" He suggested the claim that Lord Falconer and Lady Morgan had drafted the answer were the result of a mis-transcription of his evidence to the Butler Inquiry into pre-war intelligence. \"As I have always made clear, I set out in the answer my own genuinely held, independent view that military action was lawful under the existing (UN) Security Council resolutions,\" he said. \"The answer did not purport to be a summary of my confidential legal advice to government.\" Former foreign secretary Robin Cook said Lord Goldsmith's admission that his parliamentary answer was not a summary of his legal opinion suggested Parliament may have been misled. \"The attorney general may never have presented his answer as a summary, but others certainly did,\" he said. \"What is clear from his statement today is that he does not believe that it was a full, accurate summary of his formal opinion.\"\n \n Earlier, Tony Blair dismissed questions about the attorney general's advice, and said his Parliamentary statement had been a \"fair summary\" of his opinion. \"That's what he (Lord Goldsmith) said and that's what I say. He has dealt with this time and time and time again,\" Mr Blair told his monthly news conference in Downing Street. He refused to answer further questions on the issue.\n \n On the question of whether such papers have always been kept confidential, Tory MP Michael Mates, who is a member of the Commons intelligence and security committee and was part of the Butler inquiry, told the BBC: \"That, as a general rule, is right, but it's not an absolute rule.\" He said there had been other occasions when advice had been published, most recently regarding Prince Charles's marriage plans. The government could not pick and choose when to use the convention, he said. Mr Mates added: \"This may be one of those special occasions... when it would be in the public interest to see the advice which the attorney general gave to the prime minister.\"\n \n The claims about Lord Falconer and Baroness Morgan's involvement were made in a book published this week by Philippe Sands QC, a member of Cherie Blair's Matrix Chambers. He also says Lord Goldsmith warned Tony Blair on 7 March 2003 that the Iraq war could be illegal without a second UN resolution sanctioning military action.\n \n A short statement about Lord Goldsmith's position presented in a written parliamentary answer on 17 March 2003 - just before a crucial Commons vote on the military action - did not suggest this. Former minister Clare Short, who resigned from the government over the Iraq war, said the ministerial answer was the same statement that was earlier shown to the cabinet as it discussed military action. She said the full advice should have been attached, according to the ministerial code, and demanded a Lords inquiry into the matter. The Conservatives and Liberal Democrats say they still want the publication of the full legal advice given by the Attorney General. Lib Dem foreign affairs spokesman Sir Menzies Campbell said Lord Goldsmith's statement still did not clear up the outstanding issues. \"If his original advice of 7 March accepted that military action might be illegal, how was it that he resolved any such doubts by the time the Parliamentary answer was published on 17 March?\" he said. \"Only the fullest disclosure will now do.\"\n", "llama3.2:1b": "Goldsmith denies claim that war advice to PM was drafted in Downing Street\nLord Goldsmith says he was involved throughout the drafting process and personally approved his own opinion\nGovernment has resisted calls to publish full advice, saying papers are always kept confidential\nClaims of involvement by Lord Falconer and Baroness Morgan were made in a book published this week", "llama3.2:3b": "Lord Goldsmith denies Downing Street officials drafted his statement about the legality of the Iraq war, saying he personally finalized and approved the answer with Solicitor General Harriet Harman and others involved in drafting process. Former foreign secretary Robin Cook says this admission suggests Parliament may have been misled, while Tories and Liberals call for publication of full legal advice given to Prime Minister Tony Blair.", "gemma2:2b": "Lord Goldsmith denies claims that Downing Street officials drafted his statement to Parliament regarding the legality of the Iraq war. He maintains the answer reflects his own view, not a summary of his confidential legal advice.  Some MPs and others believe this contradicts previous claims about the Attorney General's advice. Some also dispute his claim that he didn't present the response as a summary, while others call for publication of the full advice. \n", "qwen2.5:0.5b": "Lord Goldsmith denied drafting a war plan for Iraq, saying only his personal view was relevant. He claimed the statement was not a summary of legal advice and was kept confidential, but MPs are still demanding full written evidence.", "qwen2.5:1.5b": "Lord Goldsmith denies Parliament's claim that war advice draft came from Downing Street officials. Claims persist about involvement of Falconer, Morgan, and others in drafting. Lord Goldsmith insists his parliamentary statement represented his view on legality but not summary legal advice to PM. The government has resisted publishing full legal advice papers.", "qwen2.5:3b": "Lord Goldsmith has denied claims that his statement to Parliament about the legality of the Iraq war was drafted by Downing Street officials, including Lord Falconer and Baroness Morgan. He asserts that he personally finalised and approved the answer, involving Harriet Harman, two of his own officials, three Foreign Office officials, a QC, Christopher Greenwood, and then Lord Chancellor Lord Irvine of Lairg. However, former foreign secretary Robin Cook suggested Parliament might have been misled by the attorney general's admission. Tory MP Michael Mates argued that such advice should be public due to its importance in government decisions, while Clare Short and some political parties called for a Lords inquiry into the full legal advice given by Lord Goldsmith.", "opencoder:1.5b": "The claim is made that Lord Goldsmith denied his statement to the public, which highlights a lack of transparency and clear-cut information about the legality of the Iraq war. This statement does not provide a full summary of his advice to the prime minister, as it was left unaddressed during the drafting process. The government has responded to such claims by keeping the full legal advice confidential.\n", "smollm:1.7b": "The summary is:\n\nGoldsmith denies war advice claim\n\nThe attorney general has denied his statement to Parliament about the legality of the Iraq war was drafted by Downing Street officials.\n\nLord Goldsmith said Lord Falconer and Baroness Morgan played no part in drafting the answer. He added the answer represented his view that the war was legal, but was not a summary of his advice to the PM. The government has resisted calls to publish the full advice, saying such papers are always kept confidential.\n\nIn a statement, Lord Goldsmith said: \"I was fully involved throughout the drafting process and personally finalised, and of course approved, the answer.\" He said the answer had been prepared in his office with the involvement of Solicitor General Harriet Harman, two of his own officials, three Foreign Office officials, a QC, Christopher Greenwood and the then Lord Irvine of Lairg.\n\nNo other minister or official was involved in the drafting process, he added. \"What is clear from his statement today is that he does not believe that it was a full, accurate summary of his confidential legal opinion.\" Mr Mates told the BBC: \"That, as a general rule, is right, but it's not an absolute rule.\" He said there had been other occasions when it would be in the public interest to see the advice which the attorney general gave to the prime minister.\n\nOn the question of whether such papers have always been kept confidential, Tory MP Michael Mates told the BBC: \"That, as a general rule, is right, but it's not an absolute rule.\" He said Lord Goldsmith warned Tony Blair on 7 March 2003 that the Iraq war could be illegal without a second UN resolution sanctioning military action.\n\nA short statement about Lord Goldsmith's position presented in a written parliamentary answer on 17 March 2003 - just before a crucial Commons vote on the military action - did not suggest this. Former minister Clare Short, who resigned from the government over the Iraq war, said the ministerial answer was the same statement that was earlier shown to the cabinet as it discussed military action. She said the full legal advice given by the Attorney General should have been attached, according to the ministerial code of conduct.\n\nThe claims about Lord Falconer and Baroness Morgan's involvement were made in a book published this week by Philippe Sands QC, a member of Cherie Blair's Matrix Chambers. He also says Lord Goldsmith warned Tony Blair on 7 March 2003 that the Iraq war could be illegal without a second UN resolution sanctioning military action. The Conservatives and Liberal Democrats say they still want the publication of the full legal advice given by the Attorney General.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Lord Goldsmith's claim about the Iraq war. First, I'll read through the entire text carefully.\n\nThe main points are: Goldsmith denies his statement about the legal advice. He says he was involved in drafting and personally finalised it. The answer wasn't a summary of his advice but an independent view. There were three officials from the Foreign Office, two solicitors, a QC, Christopher Greenwood, and Lord Irvine. Some say these figures might be misattributed.\n\nAlso, there's mention of Robin Cook, former foreign secretary, criticizing Goldsmith for claiming that he didn't make it clear his evidence led to his independent opinion being published as a summary. Mr. Blair, former Prime Minister, dismissed this claim, saying the answer was fair and exact.\n\nAnother key point is whether such papers have always been kept confidential—Mates says yes, but not an absolute rule. The book by Sands mentions that Goldsmith warned Blair on March 7, 2003, about the war's legality unless a second resolution is imposed.\n\nSo I need to capture all these elements: Goldsmith's involvement, the nature of his draft (unlike previous statements where he might have admitted), the sources involved, who doubts his independent opinion was made clear as a summary, and whether the documents are kept confidential. Also, the mention of the book by Sands adds credibility.\n\nI should structure this into a concise summary without explanations or formatting, just plain text. Make sure to highlight key details like the draft process, the QC involved, specific officials' names, accusations from others, and the implications on publication.\n</think>\n\nLord Goldsmith denies his claim to Parliament about the Iraq war's legality. He claims he was fully involved in drafting an answer, personally finalising it, and approved it, but stating that this answer represented his own independent view rather than a summary of his advice. The draft included three officials from the Foreign Office, two solicitors, a QC (Harriet Harman), Christopher Greenwood, and Lord Irvine of Lairg. Some argue these figures may be inaccurately attributed.\n\nOther accusations suggest Goldsmith did not make it clear that military action could be illegal without a second UN resolution. Robin Cook criticized this claim, suggesting he claimed to avoid ambiguity but the parliamentary answer was still considered \"fair.\" Mr. Blair dismissed this, stating his statement was \"fair\" and accurate.\n\nThe government's stance remains unchanged: they insist the full legal advice must be published as a parliamentary answer. A short summary of Goldsmith's position in a parliamentary paper on March 17, 2003, did not clarify issues but highlighted his involvement. A book by Philippe Sands QC noted these figures were often misattributed, with later examples including Prince Charles's marriage plans.\n\nMitsunobu suggested the original draft might have been used for a special occasion to make the advice public. The question of confidentiality remains contentious, with Michael Mates arguing it was generally applicable but not absolute. Lib Dem Foreign Affairs spokesman Sir Menzies Campbell asserts Goldsmith's statement hasn't resolved issues and that full disclosure would be necessary.", "tinyllama:1.1b": "The attorney general denies war advice claim in a statement that arguably contradicts his previous written parliamentary answer, which represents his view that the Iraq war is legal but not summary of his formal opinion. Lord Goldsmith's statement emphasizes his full involvement throughout drafting and finalizing the answer, despite concerns raised by former minister Clarence Short over his admission that the full legal advice was never attached to the ministerial statement prior to the vote on the war. The attorney general suggests Parliament may have been misled when he claims his parliamentary statement constituted a summary of his formal opinion, though he refuses to answer further questions regarding the legality of the war during his monthly news conference in Downing Street.", "tinydolphin:1.1b": " The attorney general has denied drafting a parliamentary answer on whether the Iraq war was legally permissible, stating it represented his view. This comes amidst pressure to publish all advice given by Lord Goldsmith, which had previously been kept confidential. Some critics argue that the Attorney General's statement is misleading and should be made public for transparency purposes.", "phi:2.7b": " The Attorney General denied claims made in a book that Lord Falconer and Baroness Morgan were involved in drafting his statement about the legality of the Iraq war, and stated that it represented his independent view that the war was legal. However, the government has not published the full legal advice given by the Attorney General due to confidentiality reasons. This has led to questions being raised about the extent of transparency regarding parliamentary answers and legal opinions.\n", "orca-mini:3b": " Goldsmith denies war advice claim", "hermes3:3b": "Attorney General denies drafting Iraq war statement by Downing Street officials.", "stablelm-zephyr:3b": "Attorney General Lord Goldsmith denied claims that his statement to Parliament regarding the legality of the Iraq war was drafted by Downing Street officials, Lord Falconer and Baroness Morgan. He stated that their involvement in drafting the answer was false and suggested it may have been a result of a mis-transcription of his evidence to the Butler Inquiry into pre-war intelligence. The full legal advice given by Lord Goldsmith has not been published, as the government typically keeps such papers confidential. Former foreign secretary Robin Cook questioned whether Parliament had been misled, and Tory MP Michael Mates noted that there may be exceptions when advice is published for public interest.", "chatgpt-4o-latest": "Attorney General Lord Goldsmith denied that Downing Street officials drafted his parliamentary statement on the legality of the Iraq war, asserting it was his independent view that military action was lawful. He clarified that the statement was not a summary of his confidential legal advice to the government. Former Foreign Secretary Robin Cook suggested Parliament may have been misled, while Tony Blair insisted the statement was a fair summary. Calls for the full legal advice to be published persist, with critics arguing that Goldsmith's initial advice on 7 March 2003 raised doubts about the war's legality, which were not reflected in his 17 March statement. Tory MP Michael Mates and others argue that disclosure is in the public interest, while a book by Philippe Sands QC claims Goldsmith warned Blair that the war could be illegal without a second UN resolution. The controversy continues, with opposition parties demanding full transparency.", "stablelm2:1.6b": "UK attorney general Lord Goldsmith denied that his statement to Parliament about the legality of the Iraq war was drafted by Downing Street officials. He clarified that his advice did not purport to be a summary of confidential legal advice to government and suggested that the claim may have resulted from mis-transcription of his evidence during the Butler Inquiry. Former foreign secretary Robin Cook raised concerns over potential parliamentary misinformation. The full legal advice has been resisted by the government as confidential papers, with Tory MP Michael Mates stating that it's not an absolute rule.", "granite3.1-dense:2b": "Lord Goldsmith, the UK's Attorney General at the time of the Iraq War, has denied claims that Prime Minister Tony Blair and other ministers, specifically Lord Falconer and Baroness Morgan, drafted his parliamentary statement on the war's legality. According to Goldsmith, he personally prepared the answer in consultation with several officials, including Solicitor General Harriet Harman, two of his own staff, three Foreign Office officials, a QC, Christopher Greenwood, and then Lord Chancellor Lord Irvine. He emphasized that this response represented his view on the war's legality but was not a comprehensive summary of his confidential advice to Blair.\n\nGoldsmith suggested that mis-transcription during the Butler Inquiry might have caused confusion regarding Falconer and Morgan's involvement. Former Foreign Secretary Robin Cook noted that Goldsmith's admission implies Parliament may have been misled, as others could have presented his opinion differently. Tony Blair defended Goldsmith's parliamentary statement, asserting it was a fair summary of his viewpoint.\n\nIn response to questions about the confidentiality of such advice, Conservative MP Michael Mates acknowledged that general policy allows for publication but argued this case might be an exception where public interest demands access to the information. Philippe Sands QC, in his book, claimed Lord Goldsmith warned Blair on March 7, 2003, that the war could be illegal without a second UN resolution authorizing military action. However, the parliamentary answer published on March 17, 2003, did not convey this concern.\n\nFormer minister Clare Short demanded a House of Lords inquiry into the issue due to discrepancies between Goldsmith's original advice and his parliamentary statement. Sir Menzies Campbell, Liberal Democrat foreign affairs spokesman, stated that Goldsmith's clarification did not resolve all outstanding questions regarding how he resolved doubts about the war's legality by the time of the parliamentary answer. The Conservatives and Liberal Democrats still advocate for the publication of full legal advice given by the Attorney General to Blair.", "reference": "Former minister Clare Short, who resigned from the government over the Iraq war, said the ministerial answer was the same statement that was earlier shown to the cabinet as it discussed military action.Former foreign secretary Robin Cook said Lord Goldsmith's admission that his parliamentary answer was not a summary of his legal opinion suggested Parliament may have been misled.In a statement, Lord Goldsmith said: \"I was fully involved throughout the drafting process and personally finalised, and of course approved, the answer.\"He added the answer represented his view that the war was legal, but was not a summary of his advice to the PM.Lord Goldsmith said Lord Falconer and Baroness Morgan played no part in drafting the answer.\"The attorney general may never have presented his answer as a summary, but others certainly did,\" he said.\"If his original advice of 7 March accepted that military action might be illegal, how was it that he resolved any such doubts by the time the Parliamentary answer was published on 17 March?\"Earlier, Tony Blair dismissed questions about the attorney general's advice, and said his Parliamentary statement had been a \"fair summary\" of his opinion.he said.\"The answer did not purport to be a summary of my confidential legal advice to government.\"\"As I have always made clear, I set out in the answer my own genuinely held, independent view that military action was lawful under the existing (UN) Security Council resolutions,\" he said.A short statement about Lord Goldsmith's position presented in a written parliamentary answer on 17 March 2003 - just before a crucial Commons vote on the military action - did not suggest this.He said the answer had been prepared in his office with the involvement of Solicitor General Harriet Harman, two of his own officials, three Foreign Office officials, a QC, Christopher Greenwood and the then Lord Chancellor, Lord Irvine of Lairg."}