{"raw_text": "Kennedy questions trust of Blair\n \n Lib Dem leader Charles Kennedy has said voters now have a \"fundamental lack of trust\" of Tony Blair as prime minister.\n \n He said backing his party was not a wasted vote, adding that with the Lib Dems \"what you see is what you get\". He made his comments at the start of a day of appearances on Channel Five in a session on The Wright Stuff programme. Questions from callers, a studio audience and the show's presenter covered Lib Dem tax plans, anti-terror laws and immigration.\n \n Mr Kennedy said during his nearly 22 years in Parliament he had seen prime ministers and party leaders come and go and knew the pitfalls of British politics. \"1983 was when I was first elected as an MP - so Tony Blair, Michael Howard and myself were all class of '83 - and over that nearly quarter of a century the world has changed out of recognition,\" he said. \"We don't actually hear the argument any longer: 'Lib Dems, good people, reasonable ideas but only if we thought they could win around here - it's a wasted vote'. \"You don't hear that because the evidence of people's senses demonstrates that it isn't a wasted vote.\" But he said Mr Blair had lost the trust of the British people. \"There is a fundamental lack of trust in Tony Blair as prime minister and in his government,\" he said.\n \n \"What we've got to do as a party - what I've got to do as a leader of this party - is to convey to people that what you see is what you get.\" Mr Kennedy also used his TV appearance to defend his party's plans to increase income tax to 50% for those earning more than £100,000, saying it would apply to just 1% of the population. He said the extra revenue would allow his party to get rid of tuition and top-up fees, introduce free personal care for the elderly and replace the council tax with a local income tax. Mr Blair has already spent a day with Five and Michael Howard is booked for a similar session.\n", "llama3.2:1b": "Charles Kennedy questioned Tony Blair's trust as prime minister due to the \"fundamental lack of trust\" in him and his government, citing 22 years of experience and observing that British politics have changed much since 1983. He defended Lib Dem tax plans, saying they reflect the current situation, and criticized Blair for losing trust with the British people.", "llama3.2:3b": "Liberal Democrat leader Charles Kennedy said voters have a \"fundamental lack of trust\" in Tony Blair as prime minister, citing his party's commitment to transparency. He defended the party's tax plans, which include increasing income tax to 50% for those earning more than £100,000, and claimed it would apply to just 1% of the population.", "gemma2:2b": "Charles Kennedy argues that voters have lost trust in Tony Blair's leadership and that the Liberal Democrat party offers clear, honest policies. He maintains that voting for the Lib Dems isn't a wasted vote because they offer concrete solutions and deliver on their promises without relying on empty political rhetoric or unachievable hopes. \n", "qwen2.5:0.5b": "The Lib Dem leader Charles Kennedy expressed trust in Tony Blair as prime minister during his appearance on Channel Five's \"The Wright Stuff\" program, where he discussed various issues such as anti-terror laws, immigration, tax plans, and party leadership. While he acknowledged the UK government had changed significantly since his election 22 years earlier, he maintained that Tony Blair had lost the trust of the British people, indicating a fundamental lack of trust in his leadership. He also proposed an increase in income tax to fund various programs, including free personal care for the elderly and replacing council tax with a local income tax.", "qwen2.5:1.5b": "Charles Kennedy questions Tony Blair's trustworthiness as prime minister following Lib Dem party leader election. He argues that voters now have fundamental lack of trust in Blair, emphasizing the need to convey what is seen is what is gotten as a party approach.", "qwen2.5:3b": "Liberal Democrat leader Charles Kennedy expressed voters' fundamental lack of trust in Tony Blair as prime minister, stating that with the Lib Dems \"what you see is what you get.\" He emphasized his 22 years in Parliament experience, noting how perceptions of politicians have shifted over time. Kennedy defended his party's proposal to increase income tax on high earners, justifying it would benefit policies such as tuition fee abolition and free personal care for the elderly. Meanwhile, Blair and Michael Howard are featured in similar TV sessions.", "opencoder:1.5b": "Kennedy questions trust of Blair\n\nLib Dem leader Charles Kennedy said that voters now have a fundamental lack of trust in Tony Blair as prime minister.\n\nHe backed his party was not a wasted vote, adding that with the Lib Dems what you see is what you get. He made comments at the start of a day on Channel Five and The Wright Stuff programme during the show's session covering Lib Dem tax plans, anti-terror laws and immigration.\n\nMr Kennedy said he had seen prime ministers and party leaders come and go and knew the pitfalls of British politics. He said \"1983 was when I first elected as an MP - so Tony Blair, Michael Howard and myself were all class of '83 - and over that nearly quarter of a century the world has changed out of recognition,\" he said. \"We don't actually hear the argument any longer: 'Lib Dems, good people, reasonable ideas but only if we thought they could win around here - it's a wasted vote'. \"You don't hear that because the evidence of people's senses demonstrates that it isn't a wasted vote.\" But he knew Mr Blair had lost the trust of the British people. He said \"There is a fundamental lack of trust in Tony Blair as prime minister and in his government,\" he said.\n\nHe used his TV appearance to defend his party's plans to increase income tax to 50% for those earning more than £100,000, saying it would apply to just 1% of the population. He said the extra revenue would allow his party to get rid of tuition and top-up fees, introduce free personal care for the elderly and replace the council tax with a local income tax. Mr Blair has already spent a day on Five and Michael Howard is booked for a similar session.\n", "smollm:1.7b": "Kennedy questions trust of Blair\nLib Dem leader Charles Kennedy has said voters now have a \"fundamental lack of trust\" in Tony Blair as prime minister.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Charles Kennedy's comments on Tony Blair's trust among voters. Let me read through it carefully.\n\nSo, Kennedy is talking about the lack of trust in Blair as PM. He says backing his party isn't a wasted vote because Lib Dems \"what you see is what you get,\" which means they're doing what's expected. But he says Blair has lost that trust. I think he said this during a TV appearance. \n\nHe mentions his time in Parliament, talking about the 80s politicians like Michael Howard and Blair. He argues that since people saw Lib Dems do things on TV, they trusted them, but Blair's government might not have seen evidence of people trusting him.\n\nHe also said increasing income tax from £100k onwards would help the party by covering tuition and fees for students, free personal care for elderly, and replacing council taxes with local income. That's a lot of money to spend on benefits for the elderly. \n\nI should make sure I cover all these points without getting too detailed. Focus on the main ideas: trust issues with Blair, no vote arguments, public perception, Lib Dems' role in shaping public opinion, increased tax plan, and how this relates to their political goals.\n</think>\n\nCharles Kennedy stated that voters have a \"fundamental lack of trust\" towards Tony Blair as prime minister. He argued that backing his party wasn't a wasted vote because Lib Dems perceived their actions as expected, but Blair's government may have lost trust in them. He emphasized the importance of conveying people's perceptions of expectations during public appearances, particularly on Channel Five and Michael Howard's session for Blair. Kennedy also proposed increasing income tax to 50% for those over £100k, which would help the Lib Dems reduce tuition fees, provide free personal care for the elderly, and replace council taxes with local income taxes.", "tinyllama:1.1b": "Kennedy: Voters now lack \"trust\" of Tony Blair as prime minister, questioning vote-buying tactics\nDuring a televised appearance on The Wright Stuff, Lib Dem leader Charles Kennedy said the party's tax plans are \"1983,\" meaning he had just entered Parliament with similar leaders in 1983. He also noted that British politics has changed significantly since then and pointed to a lack of trust in Blair as prime minister, despite his apparent popularity among voters. Kennedy said the party needs to convey to people that what they see is \"what you get.\" On the topic of income tax, he defended his party's plans by pointing out that it would benefit just 1% of the population and allow him to ax tuition fees, personal care for elderly citizens, and replace council tax with a local income tax.", "tinydolphin:1.1b": " The text given is about a Lib Dem leader expressing a lack of trust in Tony Blair as prime minister, questioning the fairness and reliability of his leadership based on his perceived shortcomings in handling public funds during his tenure. The speaker also defends the party's tax plans by stating that they apply only to 1% of the population.", "phi:2.7b": " Charles Kennedy, leader of the Liberal Democrats, says that British voters now lack trust in Tony Blair as prime minister due to his perceived incompetence and political failures. He also defends his party's decision to increase income tax for those earning over £100,000, stating it will allow them to implement a range of important policies, such as abolishing tuition fees and providing free personal care for the elderly.\n", "orca-mini:3b": " Lib Dem leader Charles Kennedy said that voters have lost trust in Tony Blair as prime minister and that his party's tax plans would only apply to 1% of the population.", "hermes3:3b": "Kennedy says voters have fundamental lack of trust in Tony Blair as PM; blames reduced political trust on feeling that votes are wasted.", "stablelm-zephyr:3b": "Lib Dem leader Charles Kennedy said voters have a \"fundamental lack of trust\" in Tony Blair as prime minister, according to The Independent. Backing his party isn't a wasted vote, Kennedy stated during an appearance on Channel 5's The Wright Stuff. He defended the party's plan to increase income tax to 50% for those earning more than £100,000, saying it would generate extra revenue for tuition fee reductions, free personal care for the elderly, and replacing council tax with a local income tax.", "chatgpt-4o-latest": "Lib Dem leader Charles Kennedy stated that voters have a \"fundamental lack of trust\" in Prime Minister Tony Blair. He argued that supporting the Lib Dems is not a wasted vote, emphasizing that his party is transparent in its policies. Speaking on Channel Five's The Wright Stuff, Kennedy addressed issues such as tax plans, anti-terror laws, and immigration. He highlighted his long political experience and dismissed the notion that voting Lib Dem is futile. Kennedy defended his party's proposal to raise income tax to 50% for those earning over £100,000, stating it would affect only 1% of the population and fund policies like eliminating tuition fees, providing free personal care for the elderly, and replacing council tax with a local income tax. Blair and Conservative leader Michael Howard also participated in similar media sessions.", "stablelm2:1.6b": "Lib Dem leader Charles Kennedy claims that Tony Blair lacks trust among the British people, citing a \"fundamental lack of trust\" as an MP in nearly 25 years. He also defends his party's stance on increasing income tax for the wealthy, stating it will benefit just 1% of the population while eliminating tuition and top-up fees, providing free personal care for the elderly, and replacing the council tax with a local income tax. This is part of a discussion on Lib Dem tax plans, anti-terror laws, and immigration during a Channel Five session alongside Michael Howard.", "granite3.1-dense:2b": "Charles Kennedy, Liberal Democrat leader, expressed his belief that voters no longer trust Tony Blair's government due to a \"fundamental lack of trust.\" Kennedy emphasized that voting Lib Dem is not a wasted vote, as the party's pledges align with their public stance. During a Channel Five program, he highlighted his 22-year political experience and the significant changes in the world since 1983. He defended his party's plan to impose a 50% income tax rate on earnings over £100,000, which would affect only 1% of the population. Kennedy pledged that the extra revenue would fund various initiatives, including eliminating tuition and top-up fees, providing free personal care for the elderly, and replacing council tax with local income tax. This statement came after Prime Minister Tony Blair had already appeared on Channel Five and Michael Howard was scheduled to do so.", "reference": "Lib Dem leader Charles Kennedy has said voters now have a \"fundamental lack of trust\" of Tony Blair as prime minister.He said backing his party was not a wasted vote, adding that with the Lib Dems \"what you see is what you get\".But he said Mr Blair had lost the trust of the British people.\"There is a fundamental lack of trust in Tony Blair as prime minister and in his government,\" he said.Mr Kennedy said during his nearly 22 years in Parliament he had seen prime ministers and party leaders come and go and knew the pitfalls of British politics.Mr Blair has already spent a day with Five and Michael Howard is booked for a similar session."}