{"raw_text": "Whitehall cuts 'ahead of target'\n \n Thousands of civil service jobs have already been cut or moved out of London as part of a major cost-cutting drive.\n \n Chancellor Gordon Brown said 12,500 jobs had gone while 7,800 were being moved out of the South East. He plans to axe 104,000 jobs to free up money for education, health, defence, housing and overseas aid. Unions oppose the plans but Mr Brown said £2bn savings had already been made and more jobs had been cut than had been expected at this stage. A further 200 jobs at the Department of the Environment, Food and Rural Affairs have been earmarked to be cut. At the Department for Work and Pensions, 30,000 jobs are to go, 560 will be lost by the end of the month at the Department of Trade and Industry and 400 are to go at the Inland Revenue and Customs.\n \n In his Budget statement, the chancellor said the first 12,500 civil service jobs had been cut, on target. About 4,300 civil servants will leave London and the South East by the end of March 2005 and there are plans to relocate another 3,500. Of those 300 Department of Health posts will go to Yorkshire while hundreds at the Department of Culture will move to Birmingham and Newcastle.\n \n Mr Brown also announced plans to merge 35 agencies into nine - described by one civil service union as a \"bonfire of the quangos\". Mark Serwotka, the leader of the Public and Commercial Services Union said: \"In last year's budget we had the day of the long knifes as the chancellor kicked off the crude game of who could cut the most civil service jobs between the government and the Tories. \"There was a time when the only worry thousands of hard working civil and public servants had on budget day was whether petrol or taxes would go up, nowadays the worry is whether they will have a job by the end of it.\" He said Mr Brown had made welcome announcements on closing tax loopholes and extending the New Deal, while cutting \"the very people who deliver them.\" The Treasury also announced plans to reduce the number of public sector workers on sick leave with a new system of checks and tougher measures against those suspected of abusing the system.\n", "llama3.2:1b": "Thousands of civil service jobs have been cut or relocated in London as part of Chancellor Gordon Brown's cost-cutting drive, resulting in 12,500 positions being axeed. \n\nChancellor Gordon Brown has announced plans to cut a further 104,000 jobs and reduce public sector workers on sick leave with new checks and tougher measures.\n\nAbout 4,300 civil servants are leaving London by the end of March 2005, with plans to relocate another 3,500.\n\nJobs at the Department for Work and Pensions and the Inland Revenue and Customs have also been targeted.", "llama3.2:3b": "Thousands of civil service jobs have been cut or relocated as part of a cost-cutting drive, with 12,500 jobs already gone and more to follow. Chancellor Gordon Brown plans to axe 104,000 jobs across various departments, including cuts at the Department for Work and Pensions and Inland Revenue. The government has already made £2bn in savings and is proposing the merger of 35 agencies into nine, with plans to relocate staff from London and the South East to other parts of the country.", "gemma2:2b": "Thousands of civil service jobs have been cut or moved as part of a cost-cutting drive by the UK government. Chancellor Gordon Brown says 12,500 jobs have already been cut, and he plans to axe 104,000 more to fund education, health, defense, housing, and aid. Unions oppose these cuts, but Mr. Brown claims £2 billion in savings have already been made, with more job losses exceeding expectations. Job cuts will affect various government departments, including the Department of Health (30,000 jobs), the Department for Work and Pensions, and the Inland Revenue and Customs.  The government also plans to merge 35 agencies into nine to reduce bureaucracy. The Public and Commercial Services Union leader claims these job cuts disproportionately impact hard-working civil servants and public sector workers. They're concerned about increased sick leave abuse as a result of new regulations.\n", "qwen2.5:0.5b": "Whitehall has cut or moved out of London 12,500 jobs while planning to cut 7,800 jobs in the South East. The chancellor Gordon Brown plans to axe 104,000 jobs in total, but more jobs are expected to be cut than expected. Unions oppose the plan and say it will lead to over-allocated jobs at departments such as Education, Health, Defence, Housing, and Aid to Overseas Countries. Plans also include relocating 35 agencies into nine for efficiency reasons.", "qwen2.5:1.5b": "Chancellor Gordon Brown has announced major cuts in civil service jobs across Britain, targeting 104,000 positions while freeing up £2bn for education, health, defence, housing, and overseas aid. The plans aim to relocate thousands of workers from London and the South East, including Department of Health posts moving to Yorkshire and Culture department jobs relocating to Birmingham and Newcastle.", "qwen2.5:3b": "Thousands of civil service jobs have already been cut or moved out of London as part of major cost-cutting efforts by Chancellor Gordon Brown, aiming to free up funds for education, health, defense, housing, and overseas aid. Brown plans to axe 104,000 jobs but has already made £2bn savings and cut more than expected at this stage. Unions oppose the cuts, which include redundancies at Department of Environment, Food and Rural Affairs (200), Department for Work and Pensions (30,000), Department of Trade and Industry (560), Inland Revenue and Customs (400). Brown also announced plans to merge 35 agencies into nine. Public and Commercial Services Union leader Mark Serwotka criticized the cuts as affecting those who deliver public services.", "opencoder:1.5b": "Whitehall cuts 'ahead of target'\n\nThousands of civil service jobs have already been cut or moved out of London as part of a major cost-cutting drive.\n\nChancellor Gordon Brown said 12,500 jobs had gone while 7,800 were being moved out of the South East. He plans to axe 104,000 jobs to free up money for education, health, defence, housing and overseas aid. Unions oppose the plans but Mr Brown said £2bn savings had already been made and more jobs had been cut than had been expected at this stage.\n\nIn his Budget statement, the chancellor said the first 12,500 civil service jobs had been cut, on target. About 4,300 civil servants will leave London and the South East by the end of March 2005 and there are plans to relocate another 3,500. Of those 300 Department of Health posts will go to Yorkshire while hundreds at the Department of Culture will move to Birmingham and Newcastle.\n\nMr Brown also announced plans to merge 35 agencies into nine - described by one civil service union as a \"bonfire of the quangos\". Mark Serwotka, the leader of the Public and Commercial Services Union said: \"In last year's budget we had the day of the long knifes as the chancellor kicked off the crude game of who could cut the most civil service jobs between the government and the Tories. \"There was a time when the only worry thousands of hard working civil and public servants had on budget day was whether petrol or taxes would go up, nowadays the worry is whether they will have a job by the end of it.\" He said Mr Brown had made welcome announcements on closing tax loopholes and extending the New Deal, while cutting \"the very people who deliver them.\" The Treasury also announced plans to reduce the number of public sector workers on sick leave with a new system of checks and tougher measures against those suspected of abusing the system. The chancellor said the first 12,500 civil service jobs had been cut, on target.\n", "smollm:1.7b": "Whitehall cuts 'ahead of target' - Thousands of civil service jobs have already been cut or moved out of London as part of a major cost-cutting drive. Chancellor Gordon Brown said 12,500 jobs had gone while 7,800 were being moved out of the South East. He plans to axe 104,000 jobs to free up money for education, health, defence, housing and overseas aid. Unions oppose the plans but Mr Brown said £2bn savings had already been made and more jobs would be cut than had been expected at this stage. A further 200 jobs at the Department of the Environment, Food and Rural Affairs have been earmarked to be cut. At the Department for Work and Pensions, 30,000 jobs are to go, 560 will be lost by the end of March 2005 and there are plans to relocate another 3,500. In his Budget statement, the chancellor said the first 12,500 civil service jobs had been cut, on target. About 4,300 civil servants will leave London and the South East by the end of March 2005 and there are plans to relocate another 3,500. Of those 300 Department of Health posts will go to Yorkshire while hundreds at the Department of Culture will move to Birmingham and Newcastle.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text into a concise summary while preserving key ideas and details. Let me read through it carefully.\n\nThe first sentence says that \"Thousands of civil service jobs have already been cut or moved out of London as part of a major cost-cutting drive.\" So, the main idea is about the impact on jobs in London and other regions.\n\nNext, it mentions Chancellor Gordon Brown cutting 12,500 jobs in the South East and plans to axe 104,000 more. Unions oppose these cuts but there have already saved £2bn and more jobs were lost than expected. Also, a further 200 jobs are being cut in three departments.\n\nThen it gives some specifics about departments: Environment, Food and Rural Affairs, Trade and Industry, and Inland Revenue and Customs. Numbers are given for each department to be affected by these cuts.\n\nThe Budget statement says the first 12,500 jobs were cut on target, with a focus on moving out of London in March 2005. There will also be moves from South East, and some within that region.\n\nMark Serwotka's quote highlights the political debate around cutting jobs, emphasizing that there were concerns about rising taxes or petrol prices but now there are worries about job losses by budget end.\n\nThe Treasury announced a new system for closing public sector workers on sick leave. \n\nPutting it all together, I need to highlight the key points: significant job cuts across London and other regions, the impact on unions, financial savings, specific department cuts, and recent political debates.\n</think>\n\nThousands of civil service jobs have been cut or moved out of London as part of a cost-cutting drive. Chancellor Gordon Brown plans to axe 104,000 jobs to free money for education, health, defence, housing, and aid. Unions oppose these cuts but savings have already been made, with more jobs lost than expected. Further 200 jobs are cut in three departments: Environment, Food and Rural Affairs, Trade and Industry. The Budget shows the first 12,500 jobs were cut on target by March 2005, with moves from London and South East. Specific department cuts include Environment (350 jobs), Food and Rural Affairs (200), Trade and Industry (600), and Inland Revenue and Customs (400). The Treasury has announced a new sick-leave system.", "tinyllama:1.1b": "Whitehall has cut or moved out over 12,500 jobs as part of a major cost-cutting drive, announcing plans to axe even more jobs in the coming months. Chancellor Gordon Brown revealed £2bn savings had already been made and announced further job cuts, including 30,000 civil service positions targeted for elimination by March 2005, plus a further 200 slated for the Department of Trade and Industry and 400 relocated from London to the South East. The move comes amid increasing claims that the government is outsourcing jobs to other countries, with some unions claiming 3,500 positions at the Department of Health could be moved to Yorkshire and Newcastle. Despite these announcements, Mark Serwozk, leader of the Public and Commercial Services Union, criticized the government's policies as a \"bonfire of the quacks\", saying that civil servants were left with no choice but to cut their hours in order to keep their jobs.", "tinydolphin:1.1b": " In April 2005, British Chancellor Gordon Brown unveiled his long-awaited Budget, which aimed to save £2 billion by freeing up government spending. Key aspects included reducing civil service cuts ahead of their target date and increasing the number of jobs being moved out of London and the South East to create new opportunities elsewhere in the country. He also announced plans to merge 35 agencies into nine, described by one civil service union as a \"bonfire of the quangos.\" In response, Mark Serwotka, the leader of the Public and Commercial Services Union (PCSU), criticized Brown for prioritizing cost-cutting over job creation.", "phi:2.7b": " Thousands of civil service jobs have already been cut or moved out of London as part of a major cost-cutting drive. Chancellor Gordon Brown said 12,500 jobs had gone while 7,800 were being moved out of the South East. He plans to axe 104,000 jobs to free up money for education, health, defence, housing and overseas aid. Unions oppose the plans but Mr Brown said £2bn savings had already been made and more jobs had been cut than had been expected at this stage. A further 200 jobs at the Department of the Environment, Food and Rural Affairs have been earmarked to be cut. At the Department for Work and Pensions, 30,000 jobs are to go, 560 will be lost by the end of the month at the Department of Trade and Industry and 400 are to go at the Inland Revenue and Customs. In his Budget statement, the chancellor said the first 12,500 civil service jobs had been cut on target. About 4,300 civil servants will leave London and South East by March 2005. \nMr Brown also announced plans to merge 35 agencies into nine, described by one union leader as a \"bonfire of the quangos.\" Mark Serwotka said: \"The only thing that's different today is he's now saying we're going to cut more jobs than he originally intended.\" The Treasury has also announced new measures to reduce public sector workers on sick leave.\n", "orca-mini:3b": " The text discusses the government's plan to cut jobs in the civil service, with 12,500 jobs already being cut or moved out of London and more job cuts planned. The Chancellor, Gordon Brown, has also announced plans to merge 35 agencies into nine and has extended the New Deal program. Union leaders are opposing these cuts and fearing the loss of jobs for hardworking civil servants.", "hermes3:3b": "Whitehall cuts over 12,500 jobs ahead of target, saving £2bn.", "stablelm-zephyr:3b": "Thousands of civil service jobs have been cut or relocated due to a major cost-cutting drive, with 12,500 positions going and 7,800 being moved out of London. Chancellor Gordon Brown plans to axe 104,000 jobs to free up money for education, health, defense, housing, and overseas aid. Unions oppose the plans, but £2bn savings have already been made. The first 12,500 civil service jobs have been cut on target, with 4,300 leaving London and the South East by the end of March 2005 and others relocating to different locations. Mr. Brown also intends to merge 35 agencies into nine.", "chatgpt-4o-latest": "Chancellor Gordon Brown announced that 12,500 civil service jobs have been cut and 7,800 relocated out of London and the South East as part of a cost-cutting initiative. The goal is to cut 104,000 jobs to redirect funds to public services. Unions oppose the cuts, but Brown stated that £2bn in savings had already been achieved. Job reductions include 30,000 at the Department for Work and Pensions, 560 at the Department of Trade and Industry, and 400 at Inland Revenue and Customs. Additionally, 4,300 civil servants will leave London by March 2005, with further relocations planned. Brown also announced the merger of 35 agencies into nine, which unions criticized. The Treasury introduced measures to reduce public sector sick leave through stricter checks.", "stablelm2:1.6b": "Chancellor Gordon Brown's government has cut thousands of civil service jobs ahead of target, primarily in London but also moving jobs out of the South East. The aim is to free up money for various sectors while unions oppose the plans. Currently, about 4,0..\nMore jobs are expected to be cut across different departments, such as the Department of Health and Environment, Food & Rural Affairs. Brown announced plans to merge several agencies into nine, a measure seen by one civil service union as \"the bonfire of the quangos.\" The government also intends to reduce the number of public sector workers on sick leave with stricter measures against those suspected of abusing the system.", "granite3.1-dense:2b": "Chancellor Gordon Brown has initiated a significant civil service job reduction, targeting 104,000 cuts to fund education, healthcare, defense, housing, and overseas aid. As of now, 12,500 jobs have been eliminated, with an additional 7,800 being relocated outside the South East. Key departments affected include the Department of Work and Pensions (30,000 job losses), Department for Trade and Industry (560), and Inland Revenue/Customs (400). Jobs are also moving to Yorkshire from the Department of Health (300) and other departments. By March 2005, an estimated 4,300 civil servants will leave London and the South East, with more relocating to Yorkshire, Birmingham, and Newcastle.\n\nUnions express opposition to these cuts, likening them to a \"long knife\" approach between governments. Mark Serwotka, union leader, criticized Brown for focusing on job losses instead of addressing issues like tax loopholes and the New Deal. The Treasury also plans to reduce public sector sick leave through enhanced checks and stricter measures against abuse.", "reference": "In his Budget statement, the chancellor said the first 12,500 civil service jobs had been cut, on target.Unions oppose the plans but Mr Brown said £2bn savings had already been made and more jobs had been cut than had been expected at this stage.Chancellor Gordon Brown said 12,500 jobs had gone while 7,800 were being moved out of the South East.Thousands of civil service jobs have already been cut or moved out of London as part of a major cost-cutting drive.Mark Serwotka, the leader of the Public and Commercial Services Union said: \"In last year's budget we had the day of the long knifes as the chancellor kicked off the crude game of who could cut the most civil service jobs between the government and the Tories.A further 200 jobs at the Department of the Environment, Food and Rural Affairs have been earmarked to be cut."}