{"raw_text": "UK 'discriminated against Roma'\n \n The government's immigration rules racially discriminated against Roma (Gypsies) seeking entry into the UK, the Law Lords have ruled.\n \n It follows a Home Office move to cut asylum claims by stopping people, mostly Roma, from boarding flights to Britain from the Czech capital, Prague. Civil rights group Liberty said it exposed \"racism at the heart of the government's asylum policy\". The Home Office said it had not meant to discriminate against anyone. It said it would look at the implications of the ruling, but pointed out the controls were no longer in place because Czechs are now entitled to free movement across Europe.\n \n The screening took place at the airport in July 2001, at a time of concern about the number of asylum seekers entering Britain.\n \n Those refused \"pre-clearance\" were effectively prevented from travelling to the UK, because no airline would carry them. Lady Hale, sitting with Lords Bingham, Steyn, Hope and Carswell, said many Roma had good reason to want to leave the Czech Republic because of persecution. But she said they were treated more sceptically than non-Roma passengers by immigration officers \"acting on racial grounds\". Lady Hale said immigration officers should have treated all would-be passengers in the same way, only using more intrusive questioning if there was a specific reason.\n \n Liberty said statistics suggested Roma Czechs were 400 times more likely to be stopped by British immigration officials at Prague airport than non-Roma Czechs. It took up the case of six unnamed Roma Czechs refused entry to Britain, and that of the European Roma Rights Centre, which said the measures unfairly penalised Roma people. It lost a High Court action in October 2002 when a judge said the system was \"no more or less objectionable\" than a visa control system. He ruled there was no obligation on Britain not to take steps to prevent a potential refugee from approaching its border to claim asylum.\n \n The Court of Appeal then decided the practice almost inevitably discriminated against Roma, but that this was justified because they were more likely to seek asylum. Immigration law allows officials to discriminate against citizens from named countries, but it does not allow officers to go further than that.\n \n Responding to the ruling, a Home Office spokesman said: \"The scheme was operated two years ago as a short-term response to the high levels of passengers travelling from Prague who are subsequently found to be ineligible for entry to the UK.\"\n \n Welcoming the ruling, Maeve Sherlock, chief executive of the Refugee Council, said: \"Human rights abuses against the Roma in Eastern Europe are well documented, and it is hugely troubling that the government sought to deny entry to such a vulnerable group.\" Amnesty International's Jan Shaw said: \"That the government's own asylum policy was being operated discriminatorily is bleakly ironic given that discrimination often lies at the heart of serious human rights abuse, not least in the Czech Republic.\" But the chairman of Migration Watch UK, Sir Andrew Green, said the House of Lords decision was a \"step in the wrong direction\". \"The basic point is that the government has a duty to control our borders and this decision appears to extend the race relations legislation beyond sensible limits.\"\n", "llama3.2:1b": "UK immigration rules discriminated against Roma (Gypsies) by treating them more harshly than others, with many being stopped and refused entry due to concerns about asylum claims. A Home Office screening at Prague airport in 2001 was found to be racially discriminatory, with Roma passengers facing treatment more sceptically than non-Roma passengers. The rules were later deemed unlawful and the government has since implemented measures to address the issue.", "llama3.2:3b": "UK's immigration rules discriminated against Roma seeking entry into the country. The ruling follows a Home Office move to cut asylum claims by stopping Roma from boarding flights to Britain, with statistics showing they were 400 times more likely to be stopped than non-Roma Czechs. The Court of Appeal ruled that the practice was discriminatory but justified because Roma are more likely to seek asylum.", "gemma2:2b": "The UK's immigration rules racially discriminated against Roma seeking entry into the country, according to the Law Lords. The policy involved screening Roma passengers at Prague airport before they boarded flights to the UK, which effectively prevented them from entering due to their ethnic background. Despite the government claiming it was not intended to discriminate, the ruling found that this practice inevitably led to unfair treatment of Roma, as demonstrated by statistics and personal experiences. The Court of Appeal confirmed the discriminatory nature of the policy, but also stated that it had a legitimate basis in preventing potentially ineligible individuals from entering the country.  Various organizations reacted to the ruling with different viewpoints, including those who welcomed it while others argued against its implications for immigration control and border security. \n", "qwen2.5:0.5b": "UK discrimination against Roma: Home Office had intended to treat all would-be passengers equally but acted on racial grounds, causing Roma people to be unfairly stopped from entering Britain. The ruling allowed for screening at Prague airport by stopping Roma people, even if they were not eligible for entry. Immigration laws allow discriminatory actions against citizens from named countries, but not officers can go further than that. The government's own policy was being operated in a similar way as well.", "qwen2.5:1.5b": "Immigration rules discriminated against Roma seeking entry into UK. Home Office cut asylum claims by stopping Czechs from boarding flights. Lords ruled immigration officers racially treated Roma, revealing \"racism at heart\" of asylum policy. The system effectively prevented Roma from traveling to UK. Immigration law allows discrimination based on country of citizenship but not race or ethnicity. Home Office said it would look into implications and noted Czechs now entitled to free movement across Europe.", "qwen2.5:3b": "UK immigration rules discriminated against Roma seeking entry. In 2001, the Home Office cut asylum claims by stopping mostly Roma people from boarding flights to Britain from Prague. The Law Lords ruled it racially discriminatory, stating immigration officers should have treated all would-be passengers equally. Civil rights group Liberty argued that controls disproportionately affected Roma and lost a High Court case. The Court of Appeal agreed this practice discriminated against Roma but justified it as they were more likely to seek asylum. Home Office claimed the scheme was temporary in response to high passenger levels from Prague, ineligible for entry. Maeve Sherlock of the Refugee Council welcomed the ruling, while Amnesty International's Jan Shaw criticized discrimination often lies at heart of human rights abuse. Sir Andrew Green of Migration Watch UK opposed the decision, stating it extends race relations legislation beyond sensible limits.", "opencoder:1.5b": "The government's immigration rules racially discriminated against Roma (Gypsies) seeking entry into the UK, which was implemented in part by a Home Office move. The Home Office took action to cut asylum claims from people, mostly Roma, from flights to Britain, at a time of concern about the number of asylum seekers entering Britain. The screening took place at the airport in July 2001. Those refused \"pre-clearance\" were effectively prevented from travelling to the UK because no airline would carry them. While many Roma had good reasons to want to leave the Czech Republic, they were treated more sceptically than non-Roma passengers by immigration officers acting on racial grounds. The Home Office said that statistics suggested that Romanesques at Prague airport were 400 times more likely to be stopped by British officials than non-romanesque Czechs. A Home Office spokesman replied: \"The scheme was operated two years ago as a short-term response to the high levels of passengers travelling from Prague who are subsequently found to be ineligible for entry to the UK.\" The Court of Appeal decided that the practice almost inevitably discriminated against Roma, but it did so because they were more likely to seek asylum. In addition, Immigration law allows officials to discriminate against citizens from named countries, but it does not allow officers to go further than that. Responding to the ruling, a Home Office spokesman said: \"The government's own asylum policy was being operated discriminatorily is bleakly ironic given that discrimination often lies at the heart of serious human rights abuse, not least in the Czech Republic.\" Welcoming the ruling, Maeve Sherlock, chief executive of the Refugee Council said: \"Human rights abuses against the Roma in Eastern Europe are well documented, and it is hugely disturbing that the government sought to deny entry to such a vulnerable group.\"\n", "smollm:1.7b": "To summarize the text concisely, we need to identify the key ideas and details. The main points of the text are:\n\n1. UK 'discriminated against Roma' (the government's immigration rules racially discriminated against Roma seeking entry into the UK)\n2. It followed a Home Office move to cut asylum claims by stopping people from boarding flights to Britain from Prague, Czech Republic (the rule was no longer in place because Czechs were now entitled to free movement across Europe)\n3. The ruling was made by the Law Lords, a group of senior judges who sit in the House of Lords and are appointed by the monarch on the advice of the prime minister.\n4. The ruling was based on the principle that discrimination against Roma is no longer justified because they are more likely to seek asylum than other groups.\n5. The ruling was welcomed by Amnesty International, which said it was a step in the wrong direction given that discrimination often lies at the heart of serious human rights abuse.\n6. The ruling was not without controversy, as some argued that the government's decision was overly broad and would lead to arbitrary decisions about who should be allowed into the UK.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about how the UK dealt with Roma people who wanted to enter via Prague. Let me read through it carefully.\n\nFirst, the government's immigration rules were discriminatory against Roma, which was a big deal because they're Gypsies. They followed the Law Lords' ruling. That must be important—maybe the government wasn't treating Roma any better than others.\n\nThen, there was a move to stop people from boarding flights from Prague. They cut asylum claims by excluding mostly Roma people. Civil rights group Liberty said it exposed racism in the policy. The Home Office didn't mean to discriminate but found controls were no longer there because Czechs are now free to move across Europe. I should note that they now can freely move, which was a shift.\n\nThe screening happened in 2001 when concerns about asylum seekers rising. Roma people, especially from the Czech Republic, were worried about being sent there. But immigration officers treated them more scrutiny than non-Roma. Lady Hale's statements mentioned Roma being treated more sceptically, probably because they were part of a larger population.\n\nLiberty statistics showed Roma Czechs were 400 times more likely to be stopped by officers at Prague. They took six cases of Roma Czechs and the European Roma Rights Centre. The High Court in October 2002 ruled that the system wasn't objectionable, but now the Court of Appeal said discrimination was justified since Roma are more likely to seek asylum.\n\nThe Home Office's spokesman said the scheme used two years as a short-term response. They welcomed the ruling but pointed out it went beyond sensible limits. Migration Watch UK chairman Sir Andrew Green said the government had a duty to control borders and this decision extended race relations legislation beyond good. The refugees group Amity International agrees that the government was discriminative.\n\nI think I covered all main points: discrimination, controls cutting claims, Roma treated differently, statistics showing higher scrutiny, High Court ruling not changing opinion, Court of Appeal deciding discrimination justified, Home Office response, and the perspective from others.\n</think>\n\nThe UK's immigration policies were deemed discriminatory towards Roma, known as Gypsies, who sought entry via Prague. The Home Office removed controls on asylum claims by excluding most Roma passengers from Czech flights, which raised concerns about their travel to the UK. Civil rights group Liberty highlighted racial discrimination at their immigration officers, while the government did not intend to discriminate but found controls no longer in place. \n\nA screening process at the Czech airport in 2001 revealed Roma people faced higher scrutiny than non-Roma passengers. The government's approach was criticized by statistics showing Roma Czechs were 400 times more likely to be stopped, including six cases of Roma Czechs and the European Roma Rights Centre. The High Court ruled that the system wasn't objectionable, despite concerns about potential refugees crossing the border. However, the Court of Appeal found discrimination justified due to Roma's likelihood of seeking asylum. \n\nThe Home Office spokesman noted the two-year policy was a short-term response, while the refugees group, Amnesty International, criticized the government for its human rights abuse. Migration Watch UK chairman Sir Andrew Green argued that extending race relations legislation was beyond sensible limits. \n\nIn conclusion, while the government sought to control borders, they appeared discriminatory toward Roma, including those from Eastern Europe.", "tinyllama:1.1b": "In the UK, the government's immigration rules discriminated against Roma seeking entry into the country by stopping people who are mostly Gypsies (Roma) from boarding flights to Britain from the Czech capital, Prague. The Home Office moved to cut these asylum claims at the airport in July 2001, but civil rights group Liberty argued that it exposed \"racism at the heart of the government's asylum policy\". The Home Office said the controls were no longer in place due to concerns about the number of asylum seekers entering Britain. However, Lady Halley, sitting with Lord Steyn, Hope and Carswell, argued that Roma faced racist discrimination at the airport when officials acted on \"racial grounds\" and asked for more intrusive questioning if there was a specific reason. The case was taken up by European Roma Riigts Centre, which lost a High Court action in October 2002, but the UK court ruled that measures to prevent potential refugees approaching its border were justified because they were more likely to seek asylum. Immigrant law allowed officials to discriminate against citizens from named countries, but not against others. The Home Office spokeman said the scheme was \"operated two years ago as a short-term response to high levels of passežrs traveling from Prague who are subsequently found to be ineli­gible for entry to the UK\". Welcoming the decision, Amnestí International's Jan Shaw said: \"That the government's own asylum policy was being operated discriminati­tory is bleakly ironic given the serious human rights abuses against the Roma in Eastern Europe.\" But the chairman of Migratio Watch UK, Sir Andrew Green, argued that the House of Lords decision was a \"step in the wrong direction\".", "tinydolphin:1.1b": " The UK government's immigration rules discriminated against Romani people seeking entry into the country, according to the ruling by the Law Lords. This move was made in an effort to reduce asylum claims from Czech citizens mainly due to their status as \"Gypsies\". Civil rights group Liberty argued that this policy exposed a form of \"racism at the heart of the government's asylum policy\". The Home Office, however, maintained that it had not meant to discriminate against anyone. In fact, the ruling suggests that such measures were more likely to be applied to Romani people because they were more likely to seek asylum. However, the spokesperson of the Home Office stated that the system was an \"operational response\" and was aimed at preventing non-Romani citizens from entering Britain.", "phi:2.7b": " The Law Lords ruled that the Home Office discriminated against Roma seeking entry into the UK by denying pre-clearance based on racial grounds. The government's asylum policy targeted Roma, who were more likely to seek asylum than non-Roma. Liberty and the European Roma Rights Centre filed a case, which resulted in the court decision and highlighted racism at the heart of the asylum policy. The ruling criticized immigration officers' treatment of would-be passengers and called for more equitable treatment. However, the Home Office spokesperson argued that the scheme was temporary and justified discrimination based on nationality. Amnesty International welcomed the ruling while Sir Andrew Green criticized it as a step in the wrong direction.\n", "orca-mini:3b": " The UK discriminated against Roma seeking entry into the country, according to a Law Lords ruling. The screening of passengers at the airport in July 2001, which took place at a time of concern about asylum seekers entering Britain, resulted in many Roma being prevented from travelling to the UK because they were not allowed to board flights. Civil rights group Liberty said it exposed \"racism at the heart of the government's asylum policy\". The Home Office said it had not meant to discriminate against anyone but stressed that controls were no longer in place because Czechs are now entitled to free movement across Europe. Lady Hale, sitting with Lords Bingham, Steyn, Hope and Carswell, said immigration officers should have treated all would-be passengers in the same way, only using more intrusive questioning if there was a specific reason. The Court of Appeal later ruled that the practice almost inevitably discriminated against Roma but that this was justified because they were more likely to seek asylum. Responding to the ruling, a Home Office spokesman said: \"The scheme was operated two years ago as a short-term response to the high levels of passengers travelling from Prague who are subsequently found to be ineligible for entry to the UK.\" Welcoming the ruling, Maeve Sherlock, chief executive of the Refugee Council, said: \"Human rights abuses against the Roma in Eastern Europe are well documented, and it is hugely troubling that the government sought to deny entry to such a vulnerable group.\" Amnesty International's Jan Shaw said: \"That the government's own asylum policy was being operated discriminatorily is bleakly ironic given that discrimination often lies at the heart of serious human rights abuse, not least in the Czech Republic.\" But the chairman of Migration Watch UK, Sir Andrew Green, said the House of Lords decision was a \"step in the wrong direction\".", "hermes3:3b": "UK government's immigration rules discriminated against Roma people by treating them more skeptically than non-Roma passengers, ruling from Law Lords.", "stablelm-zephyr:3b": "The UK's immigration rules discriminated against Roma seeking entry into the country, according to a ruling by the Law Lords. The Home Office had cut asylum claims by stopping people, mostly Roma, from boarding flights to Britain from Prague. Civil rights group Liberty claimed this exposed \"racism at the heart of the government's asylum policy.\" The ruling follows a High Court decision in October 2002 that suggested the system was no more objectionable than a visa control system.", "chatgpt-4o-latest": "The UK government's immigration rules racially discriminated against Roma seeking entry, the Law Lords ruled. The Home Office had implemented a screening process at Prague airport in 2001 to reduce asylum claims, disproportionately targeting Roma. Civil rights group Liberty highlighted the racial bias, citing statistics showing Roma Czechs were 400 times more likely to be stopped. The Court of Appeal acknowledged the discrimination but initially justified it due to higher asylum claims among Roma. The Law Lords ultimately ruled that immigration officers acted on racial grounds, violating anti-discrimination laws. The Home Office defended the policy as a short-term measure, while human rights groups condemned it as unjust. Critics argued the ruling undermined border control, while supporters emphasized the need to protect vulnerable groups facing persecution.", "stablelm2:1.6b": "UK immigration rules were found to be racially discriminatory against Gypsies (Roma) seeking entry, according to a ruling by Law Lords. The Home Office's policy of cutting asylum claims by stopping Roma from boarding flights was stopped due to free movement in Europe, and the Court of Appeal ruled that it almost inevitably discriminated against them. This is supported by statistics showing that Roma are more likely to be stopped than non-Roma passengers at Prague airport. The UK government maintains that they did not intentionally discriminate against anyone and will look at implications, but points out that such controls no longer exist due to free movement across Europe for Czechs.", "granite3.1-dense:2b": "The UK's immigration rules were found by the Law Lords to discriminate against Roma (Gypsies) seeking entry, particularly those from the Czech Republic. This ruling stems from a 2001 Home Office policy that denied pre-clearance for travel to Britain to many Roma passengers, effectively preventing their journey due to airline unwillingness to carry them. Lady Hale, sitting with other Law Lords, noted that immigration officers treated Roma skeptically and more intrusively than non-Roma passengers on racial grounds. This discrimination was 400 times higher for Roma Czechs compared to non-Roma Czechs, according to Liberty's statistics. The government claimed the practice was a short-term response to high asylum claims but maintained it would reassess its implications. Civil rights groups and human rights organizations welcomed the ruling, emphasizing the vulnerability of Roma and documented human rights abuses in Eastern Europe. However, Sir Andrew Green of Migration Watch UK criticized the decision as moving race relations legislation beyond sensible limits.", "reference": "Liberty said statistics suggested Roma Czechs were 400 times more likely to be stopped by British immigration officials at Prague airport than non-Roma Czechs.It took up the case of six unnamed Roma Czechs refused entry to Britain, and that of the European Roma Rights Centre, which said the measures unfairly penalised Roma people.Responding to the ruling, a Home Office spokesman said: \"The scheme was operated two years ago as a short-term response to the high levels of passengers travelling from Prague who are subsequently found to be ineligible for entry to the UK.\"Lady Hale said immigration officers should have treated all would-be passengers in the same way, only using more intrusive questioning if there was a specific reason.Civil rights group Liberty said it exposed \"racism at the heart of the government's asylum policy\".Amnesty International's Jan Shaw said: \"That the government's own asylum policy was being operated discriminatorily is bleakly ironic given that discrimination often lies at the heart of serious human rights abuse, not least in the Czech Republic.\"But she said they were treated more sceptically than non-Roma passengers by immigration officers \"acting on racial grounds\".The government's immigration rules racially discriminated against Roma (Gypsies) seeking entry into the UK, the Law Lords have ruled.But the chairman of Migration Watch UK, Sir Andrew Green, said the House of Lords decision was a \"step in the wrong direction\"."}