{"raw_text": "At a glance: Tory health checks\n \n The UK' opposition Conservatives have unveiled plans to introduce health checks for immigrants if they win the General Election. Here's a guide to the plan:\n \n People coming to live and work in Britain from outside the EU. If they plan to stay six months or more and are from a country with lots of TB, they would have to have a chest x-ray and further tests if appropriate. All people from outside the European Union who want to stay a year or more will have to undergo a full medical.\n \n Tuberculosis, Hepatitis B and HIV. A positive test for TB would automatically mean visa applications being turned down. All other conditions would be dealt with on a case by case basis.\n \n People would have to prove they have an acceptable standard of health and are unlikely to be a danger to public health in the UK, or impose significant costs or demands on the NHS. They would also, if appropriate, have to be able to undertake the work or study they applied to come here for.\n \n People coming to Britain for less than six months would not be medically tested unless they intended to work in health care, childcare or teaching. Children and pregnant women wanting to live in Britain permanently would not have to have a chest X-ray for TB. Under 16s would not face tests for hepatitis and HIV.\n \n The Tories say people fleeing persecution will not be denied sanctuary in Britain because of poor health. However, they will undergo health checks to ensure they receive the right medical treatment and do not spread infectious diseases.\n \n They claim government figures show that TB in England has increased by 25% over the last 10 years and that nearly two-thirds of people with the disease were born overseas. They also believe there should be stricter controls over who comes into Britain to ensure they are not a public health risk. They say the plans will protect access to the NHS.\n \n Applicants will be tested in their home country. Only asylum seekers will be tested in the UK once their refugee status is established.\n \n Home Office Minister Des Browne says the Government already routinely checks people for TB if they come into the UK for six months or more from high-risk countries. Recent medical checks were carried out on 175,000 people at Heathrow Airport and 10,000 at Gatwick. From those tests, about 100 infectious cases of TB were found.\n \n The Tories say 47 other countries across the world impose requirements of this kind. The party has looked at the way the system is operated in Australia, Canada and New Zealand. The Tory proposals are \"quite closely modelled\" on the New Zealand system.\n \n Labour claims the policy is little more than a \"desperate attempt to catch up with Labour's five-year plan\" for immigration and asylum, which was published last week. This says health screening for TB will be targeted on applicants from high-risk areas before they are given entry clearance. Those who are diagnosed with the disease would then need to seek treatment at home before being allowed to enter the UK. The Liberal Democrats have warned Labour and the Tories they were \"in danger of pandering to prejudice rather than challenging it\".\n", "llama3.2:1b": "The UK Conservatives plan to introduce health checks for immigrants if they win the General Election, including:\n- Chest x-rays and further tests if necessary\n- Full medical screening for certain conditions like tuberculosis, hepatitis B, and HIV\n- Proving a high standard of health and not posing a public health risk\n- Having the ability to work or study in the UK\n- Applying for asylum seeker status before being tested\n- Home Office Minister Des Browne conducting medical checks on immigrants coming into the UK from high-risk countries", "llama3.2:3b": "UK opposition Conservatives plan to introduce health checks for immigrants if they win the General Election, with requirements including a chest x-ray and further tests for those from high-risk countries and those planning to stay six months or more. Tuberculosis, Hepatitis B and HIV will be tested, but applicants from non-EU countries seeking to stay a year or more will undergo a full medical.", "gemma2:2b": "The Conservative party plans to introduce health checks for immigrants who intend to stay in Britain six months or more, from high-risk countries (countries with high TB rates). These checks include chest x-rays and further tests if necessary. The plan states a positive TB test will automatically lead to visa rejection. All other conditions will be evaluated on a case-by-case basis. Tests for Hepatitis B, HIV, and TB are only required for immigrants staying for a year or more. Exceptions include those coming for less than six months, childcare/healthcare jobs, children and pregnant women. Home country tests for immigration applicants from high-risk countries are the norm. The party claims this protects public health and ensures access to NHS but critics say it's an attempt to catch up with Labour's existing plan on immigration and asylum. \n", "qwen2.5:0.5b": "Tories plan for health checks for migrants from outside EU, which could affect access to NHS. People will undergo chest x-rays if they are coming to Britain with TB or hepatitis B/HIV. Health check criteria are based on TB and diseases spread by the UK's NHS.\n\nThe Tories say people fleeing persecution won't be denied asylum in Britain due to poor health but will undergo medical checks to ensure proper treatment and not spread infectious diseases.\nHome Office Minister Des Browne says the UK has routinely checked applicants for TB if they come into the country, with about 100 cases found in its six months of operation.", "qwen2.5:1.5b": "The Conservatives propose health checks for immigrants coming to Britain from non-EU countries, focusing on TB, hepatitis B, and HIV, with exceptions for short-term stays, children, pregnant women, and those seeking asylum. The policy aims to ensure public health and protect the NHS but faces criticism over potential discrimination against refugees.", "qwen2.5:3b": "The UK Conservatives propose mandatory health checks for non-EU immigrants planning to stay six months or more, focusing on TB, Hepatitis B, and HIV tests. For those staying a year or longer from countries with high TB prevalence, chest X-rays and further tests are required. The policy aims to ensure applicants have an acceptable standard of health and will not impose significant costs on the NHS, though exemptions exist for short-term visitors and certain groups like children and pregnant women. While the Conservatives argue this strengthens public health and limits public expenditure, Labour claims it is merely a response to their earlier immigration plans. The initiative closely mirrors systems in Australia, Canada, and New Zealand.", "opencoder:1.5b": "At a glance: plans for health checks in people from countries with TB.\n\nThe UK's opposition Conservatives introduced health checks for immigrants who wish to stay a year or more due to their nationality. Allowing these individuals to undergo a full medical check-up ensures they receive the right treatment, avoiding risks associated with developing anemia.\n\nTB is a condition that can lead to serious complications like heart disease and weakened immune responses. Only people with TB are tested at home, reducing potential exposure from strangers or visiting countries. The increased incidence of TB in Britain over the last 10 years has also led to significant public health concerns related to TB spread.\n\nThe Tories cautioned about stricter controls over who comes into Britain to ensure they are not a public health risk. They believe that access to the NHS should be provided based on proof of health and susceptibility assessment, ensuring a safer journey for those who may face the disease. \n\nPublic health statistics indicate an overall increase in TB cases compared to previous years. The Government already tested these individuals, and recent tests have found about 100 infectious cases of TB. This information is crucial as it helps public health officials understand the country's readiness to tackle the diseases.\n", "smollm:1.7b": "The UK's opposition Conservatives have unveiled plans to introduce health checks for immigrants if they win the General Election. Here's a summary of the key points:\n\n* People coming to live and work in Britain from outside the EU would be subject to health checks if they plan to stay six months or more and are from a country with lots of TB.\n* All people coming to Britain from outside the European Union who want to stay a year or more will have to undergo a full medical examination, including chest X-rays and further tests if appropriate.\n* People would have to prove they have an acceptable standard of health and be unlikely to be a danger to public health in the UK, or impose significant costs or demands on the NHS. They would also, if appropriate, have to be able to undertake the work or study they applied to come into Britain for.\n* The Tories say people fleeing persecution will not be denied sanctuary in Britain because of poor health. However, they will undergo health checks to ensure they receive the right medical treatment and do not spread infectious diseases.\n* They claim government figures show that TB in England has increased by 25% over the last 10 years and that nearly two-thirds of people with the disease were born overseas.\n* The Tories say the plans will protect access to the NHS for immigrants who are already living in Britain.\n* The party claims the plans will be similar to those in Australia, Canada and New Zealand, where all immigrants must undergo health checks before they enter the country.\n* Labour claims the policy is little more than a \"desperate attempt to catch up with Labour's five-year plan\" for immigration and asylum, which was published last week. This says health screening for TB will be targeted on applicants from high-risk areas before they are given entry clearance. Those who are diagnosed with the disease would then need to seek treatment at home before being allowed to enter the UK.\n* The Liberal Democrats have warned Labour and the Tories they were \"in danger of pandering to prejudice rather than challenging it\".", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text about the Conservatives' plans for health checks. First, I should read through all the sections carefully.\n\nOkay, the text is a guide to how health checks might work for immigrants from outside the EU or those intending to stay in Britain for six months or more. It mentions TB, Hepatitis B, and HIV tests, which are pretty serious health conditions.\n\nThe key points here are that if someone comes from a high-risk country (like a lot of TB cases) they have to undergo medical checks unless they're applying for jobs in healthcare, childcare, or teaching. Children and pregnant women who stay permanently don't need TB testing. Under 16s aren't tested for Hepatitis B or HIV.\n\nThe Conservatives say this is a way to ensure these people get proper treatment and avoid spreading diseases. They've already done some tests at airports before, which shows their plan is feasible. Their approach is modelled on New Zealand's system, especially in Australia, New Zealand, and Canada.\n\nOn the flip side, Labour thinks this is just an attempt to catch up with a previous plan for immigration, which the party hasn't fully implemented yet. They believe health screening will be done before entry, but if someone has TB, they'll have to get treated at home first.\n\nSo, putting it all together, the summary should include the main idea of mandatory health checks under certain conditions and how the Tories are backing this with examples from New Zealand. I also need to mention that Labour thinks it's a rushed plan against the previous approach.\n</think>\n\nAt a glance: Health Checks for Immigrants  \nThe Conservatives aim to introduce health screenings for immigrants, especially those from high-risk countries or intending to stay in Britain long-term. People must undergo medical tests unless applying for healthcare jobs, where they won't need TB testing. Only low-risk individuals are exempt from TB checks, and Hepatitis B/HIV tests are only needed for those from places with fewer cases. The system is modeled after New Zealand's approach, as seen through existing airport screenings.", "tinyllama:1.1b": "The UK's opposition Conservative Party has unveiled plans for health checks for immigrants if they win the upcoming General Election, aimed at improving public health and limiting public spending on NHS treatment. The plan includes a range of measures such as people from countries with high rates of TB being tested before entering the UK to protect the NHS from infectious disease outbreaks, as well as strict controls over who comes into Britain to ensure they are not a public health risk. Home Office Minister Des Browney has said that routine medical checks were already carried out on 175,000 people at Heathrow Airport and 10,000 at Gatwick Airport, while about 100 infectious cases of TB were found during those tests. The Liberal Democrats have warned that the Conservative Party's plan is \"in danger of pandemonium rather than chaos\".", "tinydolphin:1.1b": " In summary, a new Conservative government policy aims to introduce health checks for migrants who wish to reside in Britain if they have lived in countries with high rates of tuberculosis, hepatitis B and HIV. This move is aimed at preventing the spread of infectious diseases and ensuring public health services are accessible. The plan also envisions that only those who qualify for refugee status will be tested for these diseases upon arrival in the UK. The new policy is based on the New Zealand model, which has been praised by critics but met with criticism from some within the Labour Party.", "phi:2.7b": " A possible summary is:\n\nThe Conservatives plan to introduce health checks for immigrants from certain countries who want to live in Britain for six months or more, unless they are seeking healthcare, childcare, or teaching. The checks would include tests for TB, hepatitis B and HIV. The checks would not affect those fleeing persecution or children and pregnant women. The checks aim to protect the NHS but have been criticised by Labour and the Liberal Democrats as a way of targeting immigrants from high-risk areas.\n", "orca-mini:3b": " Tory health checks propose requiring immigrants to undergo health checks for tuberculosis, Hepatitis B, and HIV, and turning down visa applications if a person has a positive test for TB. Other conditions would be dealt with on a case-by-case basis. Those coming from high-risk countries would have to go through additional medical screening in their home country before traveling to Britain, and asylum seekers would be tested in the UK once their refugee status is established. Applicants will be tested again in the UK, but not if they are from New Zealand or similar countries with a TB rate of less than 1%. The plan is modelled on Australia's system and has been implemented in Canada and New Zealand. Labour claims the policy is a desperate attempt to catch up with their five-year plan for immigration and asylum, while Liberal Democrats warn against pandering to prejudice.", "hermes3:3b": "Conservatives' plan for UK: health checks for non-EU immigrants over 6 months, testing for TB, Hepatitis B, HIV, ensuring no public health risk or excessive NHS demand. Kids under 16 & pregnant women exempt from tests. Tests in home country instead of UK except for asylum seekers after refugee status.", "stablelm-zephyr:3b": "The UK's opposition Conservatives plan to introduce health checks for immigrants originating from countries with a high prevalence of diseases like tuberculosis (TB) if they win the General Election. Those who intend to stay in Britain for six months or more and are TB positive will face automatic visa rejection, while others undergoing full medical examinations will be assessed on a case-by-case basis. Children under 16 and pregnant women permanently residing in Britain won't need chest X-rays for TB. Home Office Minister Des Browne states that the government routinely checks people from high-risk countries for TB upon entry to the UK. The Conservative proposals are modeled closely after New Zealand's system. Critics argue that this policy is an attempt by the Conservatives to catch up with their Labour party's immigration and asylum plan, which already includes health screening for TB in certain cases.", "chatgpt-4o-latest": "The UK Conservative Party has proposed mandatory health checks for immigrants if they win the General Election. Non-EU immigrants staying for six months or more from high TB-risk countries would require a chest X-ray, with further tests if needed. Those staying a year or more would undergo a full medical. A positive TB test would result in visa denial, while other conditions like Hepatitis B and HIV would be assessed individually. Immigrants must prove they meet health standards and won’t burden the NHS. Short-term visitors would not be tested unless working in healthcare, childcare, or teaching. Asylum seekers would not be denied entry due to poor health but would be screened for treatment and public health safety. Testing would occur in home countries, except for asylum seekers tested in the UK. The Conservatives cite rising TB cases and international precedents, modeling their plan on New Zealand’s system. Labour argues the policy mirrors their existing immigration plan, while the Liberal Democrats warn against pandering to prejudice.", "stablelm2:1.6b": "The Conservatives have proposed a health check for immigrants from outside the EU if they win the General Election, including those with TB or Hepatitis B, as well..\nPeople would be required to provide an acceptable standard of health and work/study capabilities, with exceptions for children and women in certain professions. All applicants except asylum seekers would undergo tests in their home country.\nHome Office Minister Des Browne notes that the UK already conducts routine TB checks for those arriving within six months from high-risk countries. Other countries impose similar requirements.", "granite3.1-dense:2b": "The UK Conservatives propose health checks for long-term immigrants from outside the EU, focusing on TB, Hepatitis B, and HIV. Those intending to stay six months or more from countries with high TB rates will undergo chest x-rays and additional tests; all year-long residents must complete a comprehensive medical evaluation. Positive TB results will deny visa applications, while other conditions are evaluated on a case-by-case basis. The plan aims to ensure applicants maintain acceptable health standards, avoid burdening the NHS, and not pose risks to public health or significant costs. These checks are modeled after systems in New Zealand, Australia, and Canada. However, Labour criticizes this as a response to their previous five-year plan for immigration and asylum, which also targets high-risk areas for TB screening before granting entry clearance. The Liberal Democrats caution against potentially pandering to prejudice with these proposals.", "reference": "If they plan to stay six months or more and are from a country with lots of TB, they would have to have a chest x-ray and further tests if appropriate.People coming to Britain for less than six months would not be medically tested unless they intended to work in health care, childcare or teaching.People would have to prove they have an acceptable standard of health and are unlikely to be a danger to public health in the UK, or impose significant costs or demands on the NHS.Home Office Minister Des Browne says the Government already routinely checks people for TB if they come into the UK for six months or more from high-risk countries.The Tories say people fleeing persecution will not be denied sanctuary in Britain because of poor health.Under 16s would not face tests for hepatitis and HIV.Children and pregnant women wanting to live in Britain permanently would not have to have a chest X-ray for TB.Here's a guide to the plan:  People coming to live and work in Britain from outside the EU.A positive test for TB would automatically mean visa applications being turned down.This says health screening for TB will be targeted on applicants from high-risk areas before they are given entry clearance.Those who are diagnosed with the disease would then need to seek treatment at home before being allowed to enter the UK.They claim government figures show that TB in England has increased by 25% over the last 10 years and that nearly two-thirds of people with the disease were born overseas."}