{"raw_text": "Terror suspects face house arrest\n \n UK citizens suspected of involvement in terrorism could face house arrest as part of a series of new measures outlined by the home secretary.\n \n It comes after law lords ruled that the detention of 12 foreign terror suspects without trial breached human rights. Charles Clarke's planned \"control orders\" mean anyone suspected of being involved in terrorism could be subject to house arrest, curfews or tagging. The Law Society dubbed Mr Clarke's new proposals an \"abuse of power\". Deals are already being sought to deport some of the foreign detainees who are mainly held in Belmarsh Prison in London under the current laws introduced after the US terror attacks on 11 September 2001. Mr Clarke said efforts would continue to deport them to their countries of origin Algeria, Tunisia, Egypt and Jordan without them facing torture or death.\n \n Under the proposed changes - prompted by the House of Lords ruling - the home secretary could order British citizens or foreign suspects who could not be deported, to face house arrest or other measures such as restrictions on their movements or limits on their use of telephones and the internet.\n \n British citizens are being included in the changes after the law lords said the current powers were discriminatory because they could only be used on foreign suspects. Mr Clarke also said intelligence reports showed some British nationals were now playing a more significant role in terror threats. Human rights lawyer Clive Stafford-Smith said the plans were a \"further abuse of human rights in Britain\".\n \n Mr Clarke said prosecutions were the government's first preference and promised the powers would only be used in \"serious\" cases, with independent scrutiny from judges.\n \n He told MPs: \"There remains a public emergency threatening the life of the nation.\" He accepted the law lords' ruling but argued detention powers had helped prevent attacks and deter terrorists. The current detainees would not be freed until the new powers were in place as they were still considered a national security threat, he told MPs.\n \n There have been calls for the rules for wire-tap and intercept evidence to be allowed to be used in courts but Mr Clarke refused to back that change.\n \n He said intercept evidence was only a small part of the case against the men and some of it could not be used because it could put sources' lives at risk. Most of the terror suspects are being held indefinitely at Belmarsh prison, in London. Conservative shadow home secretary David Davis was worried about extending special powers to cover British citizens. He warned: \"Throughout history, internment has generally backfired because of the resentment it creates. \"So unless the process is clearly just, the home secretary could find himself confining one known terrorist only to recruit 10 unknown terrorists.\" He suggested changing the law to let security-cleared judges view evidence gathered by phone-tapping could allow more terror cases to come to court.\n \n Liberal Democrat spokesman Mark Oaten also backed use of wire-tap evidence. He said the standard of proof for the new powers would have to be \"very high indeed\" and he asked whether ministers had looked at measures which fitted with human rights laws. Shami Chakrabarti, from human rights group Liberty, joined calls for intercept evidence to be allowed in trials. She said: \"Adherence to the rule of law should not be a game of cat and mouse. The government should not swap one human rights 'opt out' for another.\"\n", "llama3.2:1b": "Terror suspects in the UK could face house arrest as part of new measures outlined by the home secretary, including control orders that restrict their movements or allow tagging. \n\nThe plans are being met with criticism from law lords and human rights groups who argue they breach human rights. The law lords ruled that detaining 12 foreign terror suspects without trial breached human rights.\n\nThe government has proposed allowing some of these detainees to be deported to their countries of origin, but critics say this would extend special powers to cover British citizens, potentially infringing on human rights laws.", "llama3.2:3b": "UK citizens suspected of terrorism could face house arrest under new measures, with curfews or tagging also possible. The changes come after a ruling that detained foreign terror suspects without trial breached human rights. Deportation efforts are being pursued, and British citizens may be included in the new powers if deemed necessary. Human rights lawyers have expressed concerns about the proposed measures, calling them an \"abuse of power\".", "gemma2:2b": "UK citizens and foreign suspects suspected of terrorism may face house arrest, curfews, or restrictions on movement as part of new measures to comply with a recent ruling that their previous detention was a breach of human rights.  These measures are aimed at detaining individuals who cannot be deported back to their countries of origin and who pose a national security threat. The government argues that these new powers will help prevent future attacks but critics worry about the potential for abuse and resentment, suggesting alternative solutions like allowing wire-tap evidence in court proceedings. \n", "qwen2.5:0.5b": "UK citizens facing house arrest as part of new measures outlined by the Home Secretary.\n\nThe UK has agreed to face a series of new regulations on terrorism suspects, including house arrest, curfews, and tagging. Charles Clarke's proposals could limit their movement, while British citizens will be included in these changes following House of Lords rulings that the current powers were discriminatory against foreign suspects. Mr Clarke has said efforts are already underway to deport some foreign detainees who remain in Belmarsh Prison in London under the current laws.", "qwen2.5:1.5b": "The Home Secretary proposes measures including house arrest, curfews, and restrictions on movements for suspected terrorists, following a ruling that detention without trial breached human rights. The plans target UK citizens as well as foreign suspects held at Belmarsh Prison and aim to deport them. The move is seen as an abuse of power by the Law Society but Mr Clarke argues it will help prevent attacks and deter terrorism. Calls are made for more powers, such as allowing intercept evidence to be used in court cases against terror suspects, with concerns raised about detaining British citizens indefinitely without trial.", "qwen2.5:3b": "Terror suspects face potential house arrest or other measures under new UK proposals, following rulings that current detention practices violated human rights. Charles Clarke's \"control orders\" include house arrest, curfews, and tagging for anyone suspected of terrorism, with deportation deals sought for foreign detainees. British citizens could now be subject to these measures if deported countries cannot provide protection against torture/death. Proposed changes aim to counter the Lords' ruling but face criticism from legal experts who warn they could further abuse human rights. Clarke argues detention powers are necessary for national security, though critics like David Davis express concerns about internment's history and potential unintended consequences. Calls also exist for allowing intercept evidence in trials, although Clarke opposes this.", "opencoder:1.5b": "Terror suspects face house arrest is a summary of the provided text, preserving key ideas and details.\nIt comes after law lords ruled that the detention of 12 foreign terror suspects without trial breached human rights. Charles Clarke's planned \"control orders\" mean anyone suspected of being involved in terrorism could be subject to house arrest, curfews or tagging. The Law Society dubbed Mr Clarke's new proposals an \"abuse of power\". Deals are already being sought to deport some of the foreign detainees who are mainly held in Belmarsh Prison in London under the current laws introduced after the US terror attacks on 11 September 2001. British citizens are being included in the changes after the law lords said the current powers were discriminatory because they could only be used on foreign suspects.\nThe proposed changes - prompted by the House of Lords ruling - the home secretary could order British citizens or foreign suspects who could not be deported, to face house arrest or other measures such as restrictions on their movements or limits on their use of telephones and the internet. There have been calls for the rules for wire-tap and intercept evidence to be allowed to be used in courts but Mr Clarke refused to back that change.\nMr Clarke said prosecutions were the government's first preference and promised the powers would only be used in \"serious\" cases, with independent scrutiny from judges. The current detainees would not be freed until the new powers were in place as they were still considered a national security threat.\nThe home secretary was worried about extending special powers to cover British citizens. He warned: \"Throughout history, internment has generally backfired because of the resentment it creates. So unless the process is clearly just, the home secretary could find himself confining one known terrorist only to recruit 10 unknown terrorists.\" The rules for wire-tap and intercept evidence to be allowed to be used in courts but Mr Clarke refused to back that change.\nHe accepted prosecutions were the government's first preference and promised the powers would only be used in \"serious\" cases, with independent scrutiny from judges. The current detainees would not be freed until the new powers were in place as they were still considered a national security threat, he told MPs. There have been calls for the rules for wire-tap and intercept evidence to be allowed to be used in courts but Mr Clarke refused to back that change.\nThe rules for wire-tap and intercept evidence to be allowed to be used in courts but Mr Clarke refused to back that change.\n", "smollm:1.7b": "The summary is concise and objective, preserving key ideas and details while omitting unnecessary information. It provides an overview of the main points in the text without adding or subtracting any information.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about UK citizens suspected of terrorist activities facing house arrest or similar measures. Let me read through it carefully.\n\nThe text starts by mentioning that terror suspects could face house arrest due to new measures proposed by the Home Secretary. It refers to Charles Clarke's \"control orders,\" which include cases for house arrest, curfews, and tagging. This came after the House of Lords ruled that the detention of these individuals didn't breach human rights.\n\nIt mentions that some British citizens are being included in these changes because the law lords said only foreign suspects could be detained without trial, but Britain's own citizens were also affected. The government is seeking to deport foreign detainees, which are currently held under current laws introduced after 9/11.\n\nMr. Clarke is calling it an abuse of power, particularly as he mentioned the proposed rules as \"abuse of human rights.\" He wants the Home Secretary to order British citizens or others who can't be deported to face house arrest. This could include measures like curfews or restrictions on movement and use of telephones/internet.\n\nThe text also notes that some British nationals are now playing a bigger role in terrorist threats, calling these plans a \"further abuse of human rights.\" The government's first preference for prosecutions is mentioned, with independent oversight by judges. He told MPs about the public emergency and the current detainees not being freed yet due to the new powers.\n\nThere were calls for wire-tap evidence to be allowed in court, but Clarke refuses to back that. His stance includes wire-tap as a small part of their case, saying some evidence could endanger sources. He also worried about internment causing resentment over history and suggested changing the law to let security-clear judges view phone-tapping evidence.\n\nLibertarians like Mark Oaten agreed with Clarke's use of wire taps but raised concerns about human rights laws fitting into these new measures. A Human Rights Group member, Shami Chakrabarti, joined calls for intercept evidence to be permitted in court, emphasizing that law should remain consistent and not allow one 'opt out' to swap for another.\n\nFinally, there was a call from Conservative shadow Home Secretary David Davis about extending wire-tap powers to cover British citizens, worried about internment causing resentment. He warned that unless the process is clear, the detention could be restrictive.\n\nSo, putting it all together, the main points are: proposed house arrest or similar measures for terror suspects, including British citizens, due to Clarke's control orders; the government aims to deport some of them, current detention practices, emphasis on human rights abuses, and calls for clearer law regarding surveillance evidence. Also, there are concerns about wire-tap use causing issues with sources' lives and internment.\n</think>\n\nThe UK is expected to face house arrest or similar measures for suspects involved in terrorism due to proposed changes by the Home Secretary, including Charles Clarke's \"control orders.\" These measures will include house arrest, curfews, and restrictions on movement. British citizens are included as they may be detained without trial, citing discriminatory law. The government aims to deport some cases, currently held under existing laws introduced after 9/11. Clarke called this an abuse of human rights, emphasizing the first preference for prosecutions and independent oversight. He highlighted wire-tap evidence as a small part of their case but refused to back its use. Wire taps could endanger sources' lives, with concerns about internment causing resentment over history. The shadow Home Secretary David Davis is worried about British citizens being confined unnecessarily, warning that stricter powers could worsen existing issues. Human rights groups and conservative Shadow Home Secretary David Davis are calling for clearer laws on surveillance evidence, while Liberal Democrats and Shami Chakrabarti from Liberty join calls for intercept evidence to be permitted in trials.", "tinyllama:1.1b": "UK citizens suspected of involvement in terrorism could face house arrest, curfews, or electronic tags as part of a series of new measures set forth by the home secretary Charles Clark. The detained suspects would not be free until the new powers became lawful and were implemented, but human rights lawyer Clively Stafford-Smith called them an \"abuse of power.\" Some of the detained suspects are being held in Belmarsh Prison in London, where some could face torture or death under the current laws. The proposed changes prompted criticism from British lawyers and civil rights groups who argued that they were a \"further abuse of human rights\" and would only be used against \"serious\" cases. The new powers would allow security-cleared judges to view wire-tap evidence gathered by phone-tapping, potentially allowing more terror cases to come to court. Liberal Democrat MP Mark Oaten also backed the use of wire-tape evidence, while human rights lawyer Shami Chaubaraerti called for greater scrutiny of the government's use of detention powers. The proposed measures would allow British citizens and foreign suspects who could not be deported to face house arrest or other measures such as restrictions on their movements, internet access, and phone calls.", "tinydolphin:1.1b": " In response to the proposed changes in house arrest, UK citizens suspected of involvement in terrorism could face this measure as part of a series of new measures by home secretary Charles Clarke. These proposals include detention without trial, house arrest or curfews and the possibility of deporting those held under these powers. The Law Society has called for a review of current detention laws, suggesting that some foreign detainees may have been held in violation of human rights. Home Secretary Clarke stated that efforts would continue to deport those who were mainly held in Belmarsh Prison following the US terror attacks on 11 September 2001. British citizens will be excluded from these changes, as they are already subject to special powers under the current system.", "phi:2.7b": " Terror suspects could face house arrest under new measures from the UK's home secretary, who claimed that this was necessary to prevent attacks and protect national security. However, critics argued that these powers were an abuse of human rights, especially since they would now be used on British citizens as well as foreigners. The government had been accused of discrimination for using detention without trial only on foreign suspects, but the home secretary said he agreed with the House of Lords ruling on this issue. He also suggested that intelligence reports showed some British nationals were involved in terrorism, which was why they needed to be included in the new measures. However, opponents of these powers argued that there had been no evidence to back up the government's claims and that they would only create more resentment towards law enforcement agencies. In addition, the plans did not include a way for detainees to have their rights protected by judges or lawyers, which raised concerns about the fairness and transparency of the process.\n", "orca-mini:3b": " The home secretary can order British citizens or foreign suspects who cannot be deported to face house arrest or other measures such as restrictions on their movements or limits on their use of telephones and the internet. Intelligence reports show some British nationals are now playing a more significant role in terror threats, and the plans are an abuse of human rights in Britain. The government has promised to only use the powers in \"serious\" cases, with independent scrutiny from judges. The current detainees would not be freed until the new powers were in place, as they were still considered a national security threat.", "hermes3:3b": "Terror suspects facing house arrest; UK citizens potentially subject to curfews, tagging or house arrest under home secretary's control orders after Lords ruling on breaching human rights.", "stablelm-zephyr:3b": "Home Secretary Charles Clarke announced plans for \"control orders\" allowing house arrest, curfews, or tagging for UK citizens suspected of involvement in terrorism. This follows a ruling by law lords that the detention of 12 foreign terror suspects without trial breached human rights. Under the new measures, British citizens may also face similar restrictions if they cannot be deported. However, Clarke assured that these powers would only be used in serious cases and with independent scrutiny from judges. Critics argue that the plans constitute an \"abuse of power\" and threaten human rights in Britain.", "chatgpt-4o-latest": "UK citizens suspected of terrorism could face house arrest under new measures proposed by Home Secretary Charles Clarke. This follows a ruling that detaining foreign terror suspects without trial violated human rights. The proposed \"control orders\" would apply to both British and foreign suspects, imposing house arrest, curfews, or movement restrictions. The Law Society and human rights groups criticized the plan as an abuse of power. Clarke defended the measures, citing national security concerns, and insisted they would be used only in serious cases with judicial oversight. Conservative and Liberal Democrat politicians raised concerns about the impact on civil liberties and suggested allowing wire-tap evidence in court instead. Clarke rejected this, arguing it could endanger intelligence sources. Critics warned that such measures could fuel resentment and radicalization.", "stablelm2:1.6b": "UK citizens suspected of terrorism could face house arrest under new measures by the home secretary, following the ruling from the House of Lords that detention without trial was a breach of human rights. Charles Clarke's \"control orders\" would allow suspects to be subject to restrictions such V house arrest or curfews, with British citizens also included in the proposed changes due to law lords' ruling that current powers were discriminatory against foreign suspects. Prosecutions are promised for serious cases and there have been calls for allowing intercept evidence in court but Mr Clarke refused to back this change. The detainees would not be freed until the new powers were in place, as they remained a national security threat.", "granite3.1-dense:2b": "British citizens suspected of terrorism may face house arrest, curfews, or tagging as part of new measures proposed by Home Secretary Charles Clarke, following a House of Lords ruling that 12 foreign detainees' indefinite detention without trial breached human rights. The current laws, introduced post-9/11, were deemed discriminatory as they only applied to foreign suspects. Clarke aims to extend these measures to British citizens due to intelligence indicating their increased involvement in terror threats.\n\nThe proposed changes include house arrest for those who cannot be deported, along with restrictions on movements and telephone/internet use. While prosecutions remain the preferred method, Clarke asserts these powers will only be invoked in serious cases, subject to independent judicial scrutiny. He maintains that current detainees pose a national security threat and cannot be released until new powers are implemented.\n\nConservative MP David Davis expressed concern about extending special powers to British citizens, warning of historical precedents showing internment often backfires due to resentment. Liberal Democrat Mark Oaten supported the use of intercept evidence in trials, emphasizing a high standard for the new powers and urging adherence to human rights laws. Human rights groups like Liberty called for allowing such evidence in court, arguing that adherence to the rule of law should not involve constant \"human rights opt-outs.\"", "reference": "British citizens are being included in the changes after the law lords said the current powers were discriminatory because they could only be used on foreign suspects.He said intercept evidence was only a small part of the case against the men and some of it could not be used because it could put sources' lives at risk.Under the proposed changes - prompted by the House of Lords ruling - the home secretary could order British citizens or foreign suspects who could not be deported, to face house arrest or other measures such as restrictions on their movements or limits on their use of telephones and the internet.He said the standard of proof for the new powers would have to be \"very high indeed\" and he asked whether ministers had looked at measures which fitted with human rights laws.The Law Society dubbed Mr Clarke's new proposals an \"abuse of power\".It comes after law lords ruled that the detention of 12 foreign terror suspects without trial breached human rights.UK citizens suspected of involvement in terrorism could face house arrest as part of a series of new measures outlined by the home secretary.There have been calls for the rules for wire-tap and intercept evidence to be allowed to be used in courts but Mr Clarke refused to back that change.Mr Clarke said prosecutions were the government's first preference and promised the powers would only be used in \"serious\" cases, with independent scrutiny from judges.He suggested changing the law to let security-cleared judges view evidence gathered by phone-tapping could allow more terror cases to come to court.Mr Clarke also said intelligence reports showed some British nationals were now playing a more significant role in terror threats."}