{"raw_text": "Plan to give elderly care control\n \n Elderly and disabled people would choose how their own budget for personal care was spent and organised under government plans.\n \n Ministers say elderly and disabled people themselves, not social workers, should be able to decide on their care and stay in their own homes. They also plan a supremo for adult services in each English area to get different agencies working together. But the government shunned opponents' calls for free long-term care.\n \n There are 1.7m people needing care in England and ministers suggest the number could quadruple by 2050. Monday's consultation paper on social care for adults in England is aimed at ending a system which generates dependency. Health Minister Stephen Ladyman said: \"This document is the antithesis of the nanny state.\n \n \"It's about taking power away from the state and giving it to individuals and saying that we will help you make these decisions but we are not going to make them for you any more.\" The government has already allowed local councils to give people money so they can pay for their services directly but take-up of the scheme has been \"disappointing\".\n \n Ministers say the new plans would make direct payments simpler and try to counter reluctance in some local councils to use the payments. They also want to set up a new \"half-way house\" where social workers tell people how much money is available for their care and help them choose how to spend that \"individual budget\". The scheme will be funded on existing budgets set until 2008. But Mr Ladyman said the plans could deliver savings in some areas, such as freeing up NHS beds and preventing illnesses. He ruled out free personal care in England - which is on offer in Scotland and Wales, saying it was \"unsustainable\".\n \n David Rogers, from the Local Government Association, said agencies were working together on the kind of innovation proposed by the government. And Tony Hunter, president of the Association of Directors of Social Services, said the plans could improve dignity and well-being for thousands of people. But Age Concern argued social care was chronically under-funded and older people were being offered choice in principle, but not in practice. Its director general, Gordon Lishman, said: \"Direct payments will not work if there are no services for people to choose from locally.\"\n \n The Tories say people who pay for three years' long-term care directly or through insurance should be guaranteed free care for the rest of their lives. Tory spokesman Simon Burns said more than 80,000 long term care places had been lost since 1997. \"After eight years of persistent change, dogmatic enforcement of regulation, and overbearing government initiatives - we need action, not a vision,\" said Mr Burns. The Lib Dems say they would fund free personal care by a new 50% tax rate on incomes over £100,000. Health spokesman Paul Burstow said: \"Promoting independence sounds good and helping people to live in their own homes is a goal we share. \"But the risk is that independence can turn into isolation if the right support and care is not available.\"\n", "llama3.2:1b": "Ministers plan for elderly and disabled people to have control over personal care funding under government plans, with the aim of reducing dependency.\n\nThe government's consultation paper proposes introducing direct payments for care, while also setting up a \"half-way house\" where social workers provide information on budget options.\n\nMinisters say the new plans could deliver savings by freeing up NHS beds and preventing illnesses, but critics argue that free personal care is unsustainable in England.\n\nElderly people are expected to make their own decisions about how they use the funds under government plans, with the aim of reducing dependency.\n\nThe Liberal Democrats plan to fund free personal care through a 50% tax rate on incomes over £100,000.", "llama3.2:3b": "Elderly and disabled people would choose how their personal care budget is spent under government plans, with no free long-term care for those who have paid privately. The scheme aims to reduce dependency on state care and increase autonomy, but critics argue it's chronically under-funded and won't work without adequate local services.", "gemma2:2b": "The government plans to give elderly and disabled individuals control over their personal care budgets, allowing them to choose how funds are allocated and organized.  These reforms aim to empower individuals and shift decision-making from social workers to the people receiving services. Direct payments will be simplified, a \"half-way house\" model will provide guidance on budget allocation and support for choosing appropriate services, and existing funding resources will be utilized. While proponents see potential benefits like reduced dependence and increased individual choice, concerns remain about underfunding of social care services and the need to ensure availability of relevant local options. \n", "qwen2.5:0.5b": "Government plans aim to empower elderly and disabled people by allowing them to make decisions about their personal care spending and arrangement. Ministers aim for simplified direct payments, a new \"half-way house\" where social workers help individuals decide how much money is available for their care, a funding scheme on existing budget until 2008, but also discuss the need for free long-term care in England. Tory and Lib Dem parties argue against free personal care in England, while Age Concern argues that independence should come with local services.", "qwen2.5:1.5b": "The UK government plans to give elderly and disabled individuals control over personal care budgets, establish new agencies for adult services, allow direct payments for some social workers, and explore ways to prevent dependency in long-term care. The proposals aim to take power away from the state while retaining a focus on individual choices. However, there are concerns about free long-term care costs and funding discrepancies between regions.", "qwen2.5:3b": "Elderly and disabled people would have more control over how they spend their personal care budgets, which ministers say should be made by individuals rather than social workers. The government aims to end dependency with a new system of adult services coordination in each English area. However, the plans face criticism for not including free long-term care, despite its availability in Scotland and Wales. Direct payments will simplify how people manage their care money but may also lead to savings through freeing up hospital beds and preventing illnesses. Critics argue that social care is underfunded, and while there are calls for choice, services aren't always available locally. The Tory party proposes a lifelong guarantee of free care for those who pay for three years' long-term care directly or through insurance, suggesting they see the current system as unsustainable. The Lib Dems suggest funding free personal care by introducing a new 50% tax rate on incomes over £100,000.", "opencoder:1.5b": "Plan to give elderly care control\n\nElderly and disabled people would choose how their own budget for personal care was spent and organised under government plans.\n\nMinisters assert they should not be able to decide on their care without social workers. They also plan a supremo for adult services in each English area, aiming to get different agencies working together. However, the government has ignored opponents' calls to end a system which generates dependency. \n\nHealth Minister Stephen Ladyman expressed concerns about the document's antithesis of nannies and suggesting it is the antithesis of the state’s power and giving them more control over their decisions. The government already allowed local councils to give individuals direct access to payments, encouraging them to make these decisions in line with their needs.\n\nMinisters argue that the proposed plans would simplify direct payments and try to counter reluctance in some local councils to use the payments. They also wish to set up a new half-way house where social workers tell people how much money is available for their care and help them choose how to spend this individual budget. The government has already funded these plans on existing budgets.\n\nHowever, Mr Ladyman argued that direct payments could deliver savings in areas such as NHS beds and preventills like flu or cold. He ruled out free personal care in England but offered it in Scotland and Wales, suggesting it was \"unsustainable\". \n\nAgency representatives from the Local Government Association, the Association of Directors of Social Services, and Age Concern argued that social care was underfunded and older people were being offered choice in principle, but not in practice. They said, \"Direct payments will not work if there are no services for people to choose from locally.\"\n\nThe Tories support the idea that people who pay for three years' long-term care directly or through insurance should be guaranteed free care for the rest of their lives.\n\nLastly, Health Secretary Paul Burstow said: \"Promoting independence sounds good and helping people to live in their own homes is a goal we share. But the risk is that independence can turn into isolation if the right support and care is not available.\"\n", "smollm:1.7b": "The elderly and disabled people would choose how their own budget for personal care was spent and organized under government plans.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this pretty lengthy text about elderly care control. The user wants only the summary as plain text without any explanations or formatting.\n\nFirst, I'll read through each paragraph carefully to understand the main points. The first paragraph talks about how ministers are allowing elderly and disabled people to manage their personal care independently and creating a centralized adult services authority. It also mentions the government's opposition to this approach in some areas.\n\nThe next part discusses the current system generating dependency, led by the Health Minister Stephen Ladyman. He argues against the \"nanny state\" document but suggests reforms like direct payments and a half-way house for budget choices.\n\nThen there are arguments from various groups: Local Government Association, Social Services Directors' Association, and Age Concern. The AOSA wants to improve well-being with better support systems, while Age Concern points out that current systems lack the necessary services locally.\n\nTories and Lib Dems have opposing views about long-term care funding. Tories want free long-term care, while Lib Dems suggest a tax on high incomes for social workers. There's also a concern that independent living could lead to isolation if care isn't provided.\n\nI need to make sure all these points are included concisely in the summary without adding extra details or explanations.\n</think>\n\nElderly and disabled people have the option to manage their personal care independently, though local councils sometimes fail to do so. ministers propose a unified adult services authority, but the government has faced opposition for this approach. The current system generates dependency, as highlighted by Health Minister Stephen Ladyman, who argues against the \"nanny state\" document and advocates for direct payments and budget decisions. However, plans aim to reduce reliance on local councils, offering funding through existing budgets from 2008. Groups like AOSA advocate for better services and well-being but caution against free personal care in England, citing sustainability issues. Tories want more long-term care funding, while Lib Dems suggest a 50% tax rate on incomes over £100k to fund independent living.", "tinyllama:1.1b": "The government has launched a consultation paper titled \"Adult Social Care: Choice, Independence & Integrated Care\" to reform social care for adults in England. The aim of this plan is to end the \"nanny state\" and replace it with an \"individual budget\" system where elderly and disabled people decide how their own budgets are spent. Ministers have promised to give older and disabled people more autonomy over their care, while also allowing local councils to use existing budgets to offer direct payments to them. The new plans are aimed at ending a system which generates dependency, but critics believe they will only increase power for the state. To counter reluctance from some local councils to use direct payment schemes and prevent illnesses, ministers want to create a new \"half-way house\" where social workers provide guidance on how to use available funds. Age Concern believes that social care is chronically underfunded while The Tories believe people who pay for three years' long-term care directly or through insurance should be guaranteed free care for the rest of their lives, while The Lib Dems would fund free personal care by a new 50% tax rate on income over £100,000.", "tinydolphin:1.1b": " The government has announced plans to change the way elderly care is financed and given control over it to individuals, similar to how healthcare is managed today. It aims to help people make decisions about their care without having to rely on social workers. The new system would enable individuals to pay for their own care directly or use insurance to cover part of the costs, ensuring that they can choose how to spend their funds. Additionally, the government will provide funding for local councils to give money directly to people who need care, with an aim to improve access to personal care for those who cannot afford it themselves. In response, Age Concern and other opponents argue that social care is chronically underfunded and older people are being offered choice in principle but not in practice. The Tories say that people who pay for three years' care directly or through insurance should be guaranteed free care for the rest of their lives. They also propose to bring forward the implementation of a new 50% tax rate on incomes over £100,000 and fund free personal care by a new 50% tax rate on incomes over £100,000. The Lib Dems say they would fund free personal care by a new 50% tax rate on incomes over £100,000.", "phi:2.7b": " The government plans to give elderly and disabled people control over how they spend their budget for personal care, with a focus on staying in their own homes. Ministers also plan to create a centralised system of adult services in each English area to improve collaboration between different agencies. However, the government has rejected calls for free long-term care and is aiming to avoid dependency by simplifying direct payments schemes and increasing funding. The new plans could potentially save money in some areas, but may not address the chronic underfunding of social care. There are also differing opinions on how best to achieve independence and improve services, with the Tories proposing direct payment for three years' worth of long-term care and the Lib Dems suggesting a 50% income tax rate for over £100,000 earners.\n", "orca-mini:3b": " The government plans to give elderly care control by allowing people needing care to choose how their personal budget for care is spent, organized under government plans. Ministers suggest that elderly and disabled people should be able to decide on their care and stay in their own homes. They also plan a supreme leader for adult services in each English area to get different agencies working together, but the government shunned opponents' calls for free long-term care. There are 1.7 million people needing care in England and ministers suggest the number could quadruple by 2050. The government has already allowed local councils to give people money so they can pay for their services directly but take-up of the scheme has been \"disappointing\". Ministers plan a new scheme where social workers tell people how much money is available for their care and help them choose how to spend that \"individual budget\". The scheme will be funded on existing budgets set until 2008, but Mr Ladyman said the plans could deliver savings in some areas, such as freeing up NHS beds and preventing illnesses.", "hermes3:3b": "Elderly people to have control over personal care budgets, instead of social workers; consultation on plan to end dependency in care system for English adults.", "stablelm-zephyr:3b": "The UK government plans for elderly and disabled individuals to have control over their personal care budget, with each person deciding how their own funds are spent. A superintendent for adult services will supervise different agencies to collaborate within each English area. This proposal aims at reducing dependency and shifting power from the state to individuals. The new plan intends to simplify direct payments while addressing reluctance in local councils. Critics argue that this system could lead to isolation if appropriate support and care aren't available, and some suggest increasing funding for social care.", "chatgpt-4o-latest": "The government plans to give elderly and disabled people control over their personal care budgets, allowing them to decide how their care is organized rather than relying on social workers. Ministers aim to promote independence and reduce dependency, with a new system where individuals are informed of their available funds and assisted in choosing services. A local adult services coordinator will help agencies collaborate. The initiative builds on existing direct payment schemes, which have had limited uptake, and will be funded within current budgets until 2008. However, the government rejected calls for free long-term care, deeming it unsustainable. Supporters believe the plan could improve dignity and well-being, but critics argue that underfunding limits real choice. The Conservatives propose guaranteeing free care after three years of self-funding, while the Liberal Democrats suggest funding free personal care through higher taxes on high earners. Concerns remain that promoting independence without adequate support could lead to isolation.", "stablelm2:1.6b": "The UK government plans for elderly and disabled people to have control over personal care budgets instead of social workers, aiming to end dependency and empower individuals. They propose direct payments for adults needing care in England with a \"supreme\" adult services chief per area to coordinate agency work. This could make direct payment schemes simpler while also creating a halfway house where social workers assist with budget allocations. The scheme will be funded from existing budgets until 2028, but free personal care might not be available as it's currently unsustainable. Opponents argue that the government should provide free long-term care for those in need, but this contradicts its own policies and could lead to higher costs.", "granite3.1-dense:2b": "The UK government plans to reform elderly and disabled care, empowering individuals to manage their personal budgets for care services rather than relying on social workers. This shift aims to reduce dependency and promote independence. The government proposes a \"super-sponsor\" for adult services in each English region to coordinate various agencies. However, they have declined requests for free long-term care, deeming it unsustainable.\n\nThe consultation paper addresses the needs of 1.7 million people in England, who may increase to 7 million by 2050. The new system will simplify direct payments and create an \"individual budget\" model where social workers help users decide how to allocate their care funds. Funding will come from existing budgets set until 2008.\n\nSupporters include Health Minister Stephen Ladyman, who views the plans as a departure from the \"nanny state,\" and Age Concern's director general, Gordon Lishman, who believes direct payments must be accompanied by local services for success. The Local Government Association and the Association of Directors of Social Services express optimism about the potential to enhance dignity and well-being through these changes.\n\nOpponents argue that chronic underfunding of social care hinders the practical implementation of this choice model, as people lack access to necessary services locally. The Conservatives advocate for lifetime free care for those who pay for care upfront, while the Liberal Democrats propose a 50% tax rate on incomes over £100,000 to fund such care.\n\nPaul Burstow, the Lib Dem's health spokesman, acknowledges shared goals with the government in promoting independent living but warns of the risk of isolation without adequate support and care.", "reference": "Elderly and disabled people would choose how their own budget for personal care was spent and organised under government plans.The Tories say people who pay for three years' long-term care directly or through insurance should be guaranteed free care for the rest of their lives.They also want to set up a new \"half-way house\" where social workers tell people how much money is available for their care and help them choose how to spend that \"individual budget\".Ministers say elderly and disabled people themselves, not social workers, should be able to decide on their care and stay in their own homes.There are 1.7m people needing care in England and ministers suggest the number could quadruple by 2050.But the government shunned opponents' calls for free long-term care.But Age Concern argued social care was chronically under-funded and older people were being offered choice in principle, but not in practice.And Tony Hunter, president of the Association of Directors of Social Services, said the plans could improve dignity and well-being for thousands of people.The Lib Dems say they would fund free personal care by a new 50% tax rate on incomes over £100,000.He ruled out free personal care in England - which is on offer in Scotland and Wales, saying it was \"unsustainable\"."}