{"raw_text": "Brown's poll campaign move denied\n \n The government has denied reports that Gordon Brown is preparing to oust Alan Milburn as Labour's election supremo.\n \n Work and pensions minister Alan Johnson said it was wrong to suggest the chancellor would usurp Mr Milburn, adding they would \"work as a team\". A report in the Sunday Business claimed Mr Brown has been asked to take charge of media strategy, while Mr Milburn would move to a behind-the-scenes role. Labour has always maintained Mr Brown would have a central campaign role.\n \n But many Labour backbenchers are said to be dissatisfied with the way election campaigning has gone and have said they wanted to see the chancellor take a bigger role. Some commentators say the Tories have grasped the initiative, putting Labour on the back foot, having to respond to Conservative policy announcements. These claims follow various opinion polls which suggest the Tories have been gaining on Labour. Party strategists are believed to want to bring Mr Brown to centre-stage having seen support rise, in private polling, after his Budget last week. But another report in the Sunday Telegraph claims Mr Milburn is unwilling to allow any new role for the chancellor to come at his expense. Mr Johnson told BBC News: \"Gordon Brown will play a central role in any election campaign. \"They were wrong when they said Milburn was ousting Brown and they're wrong now if they are saying Brown is ousting Milburn. We work as a team.\" Mr Milburn has repeatedly said the chancellor was key to the campaign and dismissed claims of a rift. Neither Downing Street nor the Labour Party would comment directly on the reports.\n", "llama3.2:1b": "The government denies Gordon Brown's poll campaign move that Alan Milburn is being deselected as Labour election supremo. \nBrown's role in the campaign has been questioned by some Labour backbenchers, who want him to take a more central stage.\nLabour's work and pensions minister, Alan Johnson, says Brown will play a key role in any campaign, but also emphasizes that Milburn remains in charge.\nReports suggest some of these comments may have caused dissatisfaction among Milburn supporters.", "llama3.2:3b": "The government denied reports that Chancellor Gordon Brown was preparing to take over media strategy from Alan Milburn, who would reportedly move to a behind-the-scenes role in Labour's election campaign.", "gemma2:2b": "Reports that Gordon Brown will take over Alan Milburn's election campaign role have been denied by both Downing Street and Labour.  Many backbenchers want Mr. Brown to have a more central role, but Mr. Milburn has insisted he is key to the campaign.  Some commentators argue that the Conservatives are ahead in polls and Labour may need to respond quickly. \n", "qwen2.5:0.5b": "The government denies reports that Gordon Brown is preparing to oust Alan Milburn, adding they will \"work as a team\". The Labour party maintains Mr Milburn has no power to take over, while the Tories claim they have grasped the initiative and are putting Labour on the back foot.", "qwen2.5:1.5b": "The government denies that Chancellor Gordon Brown plans to remove Alan Milburn from his leadership role in Labor's election campaign, maintaining they will work together \"as a team\".", "qwen2.5:3b": "The government denies reports that Gordon Brown might replace Alan Milburn as Labour's election leader, with minister Alan Johnson stating they will \"work as a team.\" Reports suggest Mr. Brown is asked to lead media strategy while Mr. Milburn moves behind-the-scenes. Many Labour backbenchers and some commentators argue for the chancellor’s greater involvement in campaigning due to Conservative gains in polls. However, others claim Mr. Milburn is unwilling to relinquish his role, leading to internal tension within the party. Downplaying speculation, both Downing Street and Labour Party refuse to comment directly on these reports.", "opencoder:1.5b": "The government has denied reports that Gordon Brown is preparing to oust Alan Milburn, claiming he would \"work as a team\". A report in the Sunday Business claimed Mr Brown has been asked to take charge of media strategy. The Labour party has always maintained Mr Brown would have a central campaign role. Some Labour backbenchers are dissatisfied with the way election campaigning has gone and have wanted to see the chancellor take a bigger role. The Tories have grappled with this initiative, putting Labour on the back foot. Their responses to policy announcements by the Conservative party suggest they needed to take action.\n", "smollm:1.7b": "The summary should be:\nBrown's poll campaign move denied, Work and pensions minister Alan Johnson denied that Gordon Brown is preparing to overthrow Alan Milburn as Labour's election supremo, but many backbenchers are dissatisfied with the way election campaigning has gone and want the chancellor to take a bigger role. The government has denied reports that Gordon Brown is preparing to oust Alan Milburn from his position as Labour's election supremo, but some commentators say the chancellor would have a central campaign role if he were allowed to take charge of media strategy.\n", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Gordon Brown's election campaign. Let me read through it carefully.\n\nThe first sentence says \"Brown's poll campaign move denied.\" That's just introducing the topic, so that should be in the summary.\n\nNext, there are two paragraphs about Alan Johnson and Alan Milburn. The government denied reports that Brown is considering running for Alan Milburn as supremo. Johnson mentioned they would work together instead of taking over Milburn's role. Milburn has been called out for his role in election campaign, so this is a key point.\n\nThen there's a report about Brown being asked to handle media strategy while Milburn moves back elsewhere. Some people are unhappy because they think Brown should be handling everything, and others say the Tories have gotten ahead by putting Labour on the back foot.\n\nAnother report says the Tories aren't taking Milburn seriously anymore. They were supposed to support Milburn after his Budget last week. Mr Johnson said Brown is a central campaign figure, but he also warned that the government was wrong before when they thought Milburn was dropping Brown's shoes.\n\nI need to make sure I capture all these points: Brown's denial of Milburn taking charge, Johnson's statements about teamwork and working together, reports suggesting bias against Milburn as election campaign director, Tories gaining support for Milburn, and the government's warnings that they were wrong before. Also, Milburn repeatedly dismissed the government's claims of a rift with Brown.\n\nI should structure this into a concise summary without explanations or formatting.\n</think>\n\nBrown's poll campaign move denied Alan Johnson's report that Gordon Brown was preparing to oust Alan Milburn as election supremo. Johnson emphasized teamwork and working together instead of taking over Milburn's role, who has been criticized for his election campaigning. A report suggested bias against Milburn as director of election campaign, while another report suggested the Tories were gaining support by giving their back to Milburn after his Budget. The government warned they were wrong when they thought Milburn was dropping Brown's shoes but later denied that claim. Johnson called Brown central to any election campaign and warned the government of the torsion that they had previously believed there was no rift between Brown and Milburn.", "tinyllama:1.1b": "Brown's poll campaign move denied, despite claims that Milburn will be ousted by Johnson & Co. The government has dismissed suggestions that Alistair Brown would take over media strategy in favor of a \"team\" approach to election strategy. Labour backbenchers have expressed dissatisfaction with the direction of election campaigning, citing concerns about the Conservative party's initiatives, but official sources claim to have secured Milburn's support for a central role. Opinion polls show support rising for Labour despite Milburn's rebuff. However, another report claims that Milburn is unwilling to allow any new role for Brown, who will play a key role in the campaign.", "tinydolphin:1.1b": " The government has denied reports suggesting that Prime Minister Gordon Brown is preparing to replace Labour's election supremo, Alan Milburn. Work and pensions minister Alan Johnson claimed it was wrong to suggest the chancellor would usurp Milburn. However, many Labour backbenchers have expressed dissatisfaction with how election campaigning has gone and want to see Brown take a more central role. Some commentators have argued that the Conservatives are gaining on Labour in public opinion polls. Party strategists believe it's time for Brown to step up his involvement in the election campaign, given an increase in support following the Budget. In private, Mr. Milburn has been reported as saying he wouldn't allow any new role for Brown to come at his expense. However, another report from The Sunday Telegraph suggests that Labour strategists are open to a compromise whereby Mr. Brown could take on a more significant role than before while also allowing him to continue supporting Milburn in his current capacity. This has raised speculation about who would replace Milburn as election supremo, with some suggesting it might be the head of the treasury department or perhaps the former deputy leader. However, neither Downing Street nor the Labour Party have commented directly on these reports.", "phi:2.7b": " Reports suggest that Gordon Brown is considering taking a larger role in Labour's election campaign, but many backbenchers are unhappy with current campaigning methods. The Conservatives have made policy announcements that have put Labour on the back foot. Opinion polls show an increase in support for the Tories after the chancellor's budget. Some speculate that Brown wants to be more involved because of this rise in support, while others claim Milburn is unwilling to lose his role. Gordon Brown has denied any conflict with Milburn and insists they work as a team. \n", "orca-mini:3b": " The government has denied reports that Gordon Brown plans to take over Alan Milburn's role as Labour's election supremo. Brown will play a central role in the campaign, according to work and pensions minister Alan Johnson. The chancellor will have a behind-the-scenes role, while Milburn will move to a new role. Some Labour backbenchers are dissatisfied with the way election campaigning has gone and want to see Brown take a bigger role. Tory policies have given Labour some momentum, and party strategists want to bring Brown to center stage. However, there are reports that Milburn is unwilling to allow any new role for the chancellor to come at his expense.", "hermes3:3b": "Brown denied denying plan to replace Labour election leader Alan Milburn.", "stablelm-zephyr:3b": "The government has denied reports that Gordon Brown is planning to replace Alan Milburn as Labour's election strategist. Work and pensions minister Alan Johnson said it was incorrect to suggest Chancellor Brown would usurp Mr. Milburn's role, adding they \"work as a team\". Despite some Labour backbenchers wanting Brown to take a bigger role in campaign due to the party falling behind the Conservatives in opinion polls, Johnson assured that Brown will play a central role and they work as a team.", "chatgpt-4o-latest": "The government has denied reports that Gordon Brown is set to replace Alan Milburn as Labour's election chief. Minister Alan Johnson stated that Brown and Milburn would work as a team. Reports suggested Brown was asked to lead media strategy while Milburn moved to a behind-the-scenes role, amid dissatisfaction among Labour backbenchers over campaign progress. Some believe the Tories have gained momentum, prompting calls for Brown to take a more prominent role. While private polling showed increased support after Brown’s Budget, Milburn is reportedly resistant to any role change at his expense. Johnson reiterated that Brown would play a central role, dismissing claims of a rift, while Downing Street and Labour declined to comment directly.", "stablelm2:1.6b": "The government has denied rumors that Gordon Brown will replace Alan Milburn as Labour's election leader, stating they will work together as a team. Brown is expected to have a central campaign role in the upcoming elections, despite some dissatisfaction within the party regarding the campaign's direction. However, there are claims by the Conservatives that Labour is struggling due to their initiative and must respond to Conservative policy announcements. Brown has reportedly gained support after his budget, but Milburn is unwilling to allow any new role for him without compensation. Both Downing Street and the Labour Party refuse to comment on the reports.", "granite3.1-dense:2b": "The government has refuted allegations that Gordon Brown is set to replace Alan Milburn as Labour's election director, with Work and Pensions Minister Alan Johnson asserting they will collaborate instead of compete. Reports suggest Brown might handle media strategy while Milburn moves into a support role, but Labour insists the chancellor remains central to the campaign. Many backbenchers express discontent with current campaigning, attributing Labour's lag in opinion polls to the Tories' strategic edge. Opinion polls indicate the Conservatives are gaining ground on Labour. Party strategists aim to promote Brown's prominence due to increased support from private polling following his Budget. However, an Sunday Telegraph report indicates Milburn is unwilling to relinquish his central role. Johnson confirmed Brown's crucial campaign position, stating the reports are incorrect. Neither Downing Street nor Labour responded directly to these allegations.", "reference": "Labour has always maintained Mr Brown would have a central campaign role.Work and pensions minister Alan Johnson said it was wrong to suggest the chancellor would usurp Mr Milburn, adding they would \"work as a team\".A report in the Sunday Business claimed Mr Brown has been asked to take charge of media strategy, while Mr Milburn would move to a behind-the-scenes role.Mr Milburn has repeatedly said the chancellor was key to the campaign and dismissed claims of a rift.Mr Johnson told BBC News: \"Gordon Brown will play a central role in any election campaign.But another report in the Sunday Telegraph claims Mr Milburn is unwilling to allow any new role for the chancellor to come at his expense."}