{"raw_text": "Voters 'don't trust politicians'\n \n Eight out of 10 voters do not trust politicians to tell the truth, a new poll conducted for the BBC suggests.\n \n And 87% of the 1,000 adults quizzed by ICM for BBC News 24 said politicians did not deliver what they promised. The poll comes after Foreign Secretary Jack Straw predicted trust would be \"the key choice\" at the next election. Both the Tories and the Lib Dems are keen to emphasise a perceived lack of trust in Tony Blair, following his claims over Iraqi weapons.\n \n But according to the BBC poll, 61% said the issue of trust made no difference to whether or not they would vote at the next election, widely expected on 5 May. The poll also looked at what lay behind the lack of trust in politicians. Some 87% said politicians did not keep the promises they made before elections, while 92% said they never gave \"a straight answer\". Just under three-quarters of respondents (73%) said politicians had shown themselves to be dishonest too often.\n \n Mr Straw told activists in Blackburn on Thursday that voters would have to decide at the next election which party \"best deserves\" their \"future trust\". \"That in the end is the key choice at the next election.\"\n \n He acknowledged that the public had lost faith in Labour, but suggested it could persuade people to \"reinvest their trust with us\" if the party could overcome Tory attempts to spread cynicism in politics. The Conservatives are keen to highlight the trust issue. During his response to Gordon Brown's Budget statement on Tuesday, Michael Howard compared the chancellor's figures to the prime minister's claims about Iraq's weapons of mass destruction.\n \n The Lib Dems are also keen to highlight the trust issue, with Charles Kennedy has claiming voters had a \"fundamental lack of trust in the prime minister\". And the Green Party unveiled a billboard opposite the Palace of Westminster accusing the government of lying over the Iraq war.\n \n Former education secretary Estelle Morris told BBC News 24 that there was a \"real problem of trust\" between the public and the politicians. She said she did not feel her own colleagues could be trusted, but suggested the \"three-cornered relationship\" between the press, politicians and the public had a hand in the issue. The public was often turned off by sitting on the sidelines in \"the battle of words\" between the politician and the journalist, she added. Lib Dem foreign affairs spokesman Menzies Campbell said the Iraq war had hit trust in politicians hard. \"Issues of war and peace, life and death do have a very damaging effect on the credibility of politicians\". Martin Bell, who won the Tatton seat from Tory Neil Hamilton on anti-corruption platform, said politicians often failed to see themselves as others did. \"We need public figures we trust to tell the truth and who can see themselves as others see them.\"\n", "llama3.2:1b": "Voters do not trust politicians to tell the truth, with 8 out of 10 expressing skepticism. A BBC poll found that 87% of respondents believed politicians do not deliver what they promised, while 92% said they never give straight answers. Politicians are seen as dishonest and untrustworthy by many.", "llama3.2:3b": "Voters do not trust politicians to tell the truth and keep promises, with 8/10 saying they don't trust politicians to be truthful. 87% of respondents said politicians did not deliver on their pre-election promises, while 92% found their answers dishonest. The issue of trust makes no difference for most voters at the next election, which is widely expected on May 5th.", "gemma2:2b": "A new poll reveals that 8 out of 10 voters do not trust politicians to be truthful. 87% believe politicians fail to deliver on promises, while nearly three-quarters say they have been dishonest often. The issue of trust does not seem to significantly impact voting intentions for the upcoming election. Several parties, including Tories, Lib Dems, and Green Party, are capitalizing on this lack of trust by highlighting it as a key political issue in the campaign. \n", "qwen2.5:0.5b": "Key points:\n\n- More than 80% of voters in Britain do not trust politicians to deliver their promises.\n- 61% said trust made no difference when voting, widely expected on May 5th.\n- 87% of those questioned said politicians did not keep their promises, while 92% said they never gave \"straight answers.\"\n- 83% said politicians' actions were dishonest too often.\n- Mr. Straw suggested voters would have to decide which party \"best deserves\" trust for the next election.\n- The public had lost faith in Labour but wanted a solution to the trust issue, highlighting the problem between the press, politicians and the public.\n- Former education secretary Estelle Morris said there was a \"real problem of trust\" and that sitting on the sidelines could damage the credibility of politicians.\n- Lib Dem foreign affairs spokesman Menzies Campbell suggested Iraq war had hurt trust in politicians.", "qwen2.5:1.5b": "Voters do not trust politicians, with 8 out of 10 respondents indicating lack of trust in politicians to deliver promises and never giving \"a straight answer\". This issue is less significant for voter turnout at the next election on May 5th.", "qwen2.5:3b": "Eight out of ten voters do not trust politicians to be truthful, according to a BBC poll. 87% believe politicians have not delivered promises made before elections. Despite this, only 61% say it influences their vote in the upcoming election on May 5th. Trust issues are linked to politicians not keeping promises (87%), giving dishonest answers (92%) and being perceived as too often dishonest (73%). The Foreign Secretary emphasized that trust would be a key factor at the next election, but voters still see no difference compared to this issue in their voting choice. Politicians of different parties are highlighting these issues, with Labour suggesting they can regain trust if they overcome Tory attempts to spread cynicism. Former education secretary Estelle Morris and Lib Dem foreign affairs spokesman Menzies Campbell also emphasize the importance of trust in politicians.", "opencoder:1.5b": "The main point of the poll is about how voters perceive the trust between the public and politicians. Some respondents (particularly those around 8/10) find it hard to believe that politicians would promise what they promised, despite their promises being made before elections. Similarly, some argue that the lack of trust in Tony Blair has led them to make unilateral policy decisions, which contradicts with his promises. Meanwhile, others express concerns about the perceived lack of trust in Donald Trump, who famously made unilateral threats against the United States during World War II.\n", "smollm:1.7b": "The summary is concise and objective, preserving key ideas and details of the original text while omitting unnecessary information. The main points are:\n\n1. Voters do not trust politicians: 87% of voters said they did not trust politicians to tell the truth.\n2. Trust in politicians has decreased: 61% of respondents said politicians had shown themselves to be dishonest too often.\n3. Lack of trust is key factor in deciding which party to vote for: 92% of respondents said they would vote for a party that \"best deserves\" their future trust.\n4. The public's lack of trust in the prime minister is also a problem: 87% of respondents said they did not feel their own colleagues could be trusted, and 50% of respondents said politicians often failed to see themselves as others saw them.\n5. The three-cornered relationship between the press, politicians and the public has contributed to the lack of trust in politicians: 61% of respondents said politicians had shown themselves to be dishonest too often.\n\nThe summary accurately captures the main points of the original text while avoiding unnecessary information or analysis.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text into a concise summary that preserves key ideas and details. Let me read through the provided text carefully.\n\nThe first sentence says that voters don't trust politicians much. Then there's a poll from the BBC suggesting that 8 out of 10 voters don't trust politicians, specifically pointing out that 87% said politicians didn't deliver what they promised. This comes after Foreign Secretary Jack Straw mentioned that future election trust is crucial.\n\nThe text also mentions that both the Tories and Lib Dems are trying to highlight a lack of trust in Tony Blair, especially after Blair's controversial comments about Iraqi weapons. It talks about the poll showing that 61% said trust didn't matter for voting decisions, which they expect on May 5th.\n\nMr. Straw is saying voters have to choose \"the best deserves\" their future trust, emphasizing it's a key election choice. He acknowledges public loss of faith in Labour but suggests that if Labour can overcome Tory cynicism, people might reinvest their trust with them.\n\nThe text also mentions Michael Howard comparing Labour's numbers to Tony Blair's Iraq claims. Lib Dems are focusing on the same issue. The Green Party has a billboard calling the government lying over Iraq.Former education secretary Estelle Morris thinks there's a real problem of trust between the public and politicians, especially noting that journalists and politicians often sit back, turning people off.\n\nMenzies Campbell argues that the war issues damage politicians' credibility. Martin Bell from the Tory side says politicians fail to see others as they do. The summary needs to keep all these points but in a concise way without explanations or formatting.\n</think>\n\nvoters don't trust politicians  \na new poll by BBC shows 87% of 1,000 adults say politicians didn't deliver promised promises at elections, following Jack Straw's emphasis on future trust  \nthe poll found 61% said trust doesn't matter for voting decisions, with a focus on upcoming May elections  \nboth Tories and Lib Dems highlight lack of trust in Tony Blair, especially after Blair's controversial Iraq claims  \nMr. Straw emphasizes voters must choose \"best deserve\" their trust at the next election, acknowledging public loss of faith in Labour but suggesting Labour could reinvest trust if overcome by Tory cynicism", "tinyllama:1.1b": "The poll conducted for BBC News 24 shows that 61% of voters do not trust politician's promises made before elections, as well as disbelief in their honesty. These responses are widely expected at the next election, despite high-ranking politicians promising to overcome attempts to spread cyclicism in politics. The poll also suggests that voters view the lack of trust in politician's as a key factor shaping their vote choices, with 87% stating that they would not be inclined to do so if the promises made were kept. Some 92% stated that politicians never gave \"a straight answer,\" while 87% said they did not keep the promises they made before elections. The poll's findings are seen as a concern for the next election, with the Conservatives seeking to highlight issues related to trust and the Lib Dems highlighting the lack of trust in the prime minister. The Green Party has unveiled billboards and claims voters lack trust in the government's ability to tell the truth over Iraq.", "tinydolphin:1.1b": " The poll suggests that voters are not trusting politicians to be honest with them, a new study reveals. Conducted by ICM for BBC News 24, the survey found that 61% of adults surveyed do not believe politicians keep their promises before elections. This lack of trust is said to have made it difficult for voters to decide who they can trust in the future election. The poll also found that politicians are perceived as dishonest, with a majority of respondents stating that they have not seen any politician give a straight answer when answering their questions before elections. This issue has been raised by some commentators and activists, including Labour's Jeremy Leadbecher, who argue that the public should decide who gets their trust based on the promises made before elections.", "phi:2.7b": " The poll conducted by ICM for BBC News 24 found that eight out of ten voters do not trust politicians to tell the truth. A majority (87%) of 1,000 adults polled said that politicians did not deliver what they promised. Foreign Secretary Jack Straw predicted that trust would be \"the key choice\" at the next election, but according to the poll, just 61% of respondents said that the issue of trust made any difference in their decision-making process. Some 87% of the survey participants believed that politicians did not keep promises before elections, while 92% felt that they never gave a straight answer. Just under three-quarters of the survey participants reported that politicians had been dishonest too often. Michael Howard, the Conservative Party's leader, claimed that voters would have to decide which party deserved their future trust. Estelle Morris suggested that there was a \"real problem of trust\" between the public and the politicians, while Martin Bell argued that politicians needed to see themselves as others saw them. The poll found that trust in politicians had been damaged by issues such as war and peace, and corruption.\n", "orca-mini:3b": " The text reports that only 18% of voters trust politicians to tell the truth, with 8 out of 10 respondents expressing doubts about their honesty. Eighty-seven% of those polled by ICM for BBC News 24 said politicians did not keep their promises before elections, while 92% claimed they never gave straightforward answers. Three-quarters of respondents said politicians were dishonest too often, and only 18% trusted them to tell the truth. The issue of trust had no impact on whether or not people would vote at the next election, despite some people saying it was the key choice between parties. However, many people felt their trust in politicians was broken, and politicians needed to address this issue to win back voters' confidence.", "hermes3:3b": "Voters don't trust politicians, 87% say they break promises & give dishonest answers; 61% not voting based on trust issue.", "stablelm-zephyr:3b": "A new poll conducted for the BBC reveals that 8 out of 10 voters do not trust politicians to tell the truth. 87% of 1,000 adults surveyed by ICM for BBC News 24 said politicians did not deliver what they promised. Trust in politicians is important at the next election, predicted Foreign Secretary Jack Straw, adding that voters must decide which party \"best deserves\" their future trust. The Conservatives and Lib Dems are emphasizing this issue due to Tony Blair's claims over Iraqi weapons and recent scandals involving politicians. While 61% of respondents said the issue of trust made no difference in their decision to vote, 87% stated politicians did not keep promises they made before elections, and 92% never gave a straight answer.", "chatgpt-4o-latest": "A BBC poll found that 80% of voters do not trust politicians to tell the truth, and 87% believe they do not deliver on promises. Despite this, 61% said trust would not affect their voting decision. The poll highlighted key reasons for distrust, including broken promises (87%), lack of straight answers (92%), and frequent dishonesty (73%). Foreign Secretary Jack Straw acknowledged public distrust in Labour but urged voters to reinvest their trust. The Conservatives and Liberal Democrats emphasized the issue, linking it to Tony Blair’s claims about Iraq. Former education secretary Estelle Morris and Lib Dem spokesman Menzies Campbell cited media influence and the Iraq war as factors eroding trust. Martin Bell stressed the need for politicians who are honest and self-aware.", "stablelm2:1.6b": "Eight out of ten voters do not trust politicians to be honest, according to a BBC poll. Of 1,000 adults questioned by ICM for BBC News, 25% said politicians did not deliver what they promised. The issue of trust is expected to be the key choice at the upcoming election on 5 May. Only 6% said that the lack of trust made no difference to whether or not they would vote. Politicians are accused of showing themselves to be dishonest too often, and just under three-quarters (72%) said politicians had shown themselves to be dishonest too often. Former education secretary Estelle Morris noted a \"real problem of trust\" between the public and the politicians, citing issues of war and peace as having a damaging effect on credibility.", "granite3.1-dense:2b": "Eighty percent of British voters do not trust politicians, according to a BBC-commissioned poll by ICM. The survey found that 87% believe politicians break their promises, while 92% are perceived as dishonest and unreliable in providing straight answers. Despite this widespread distrust, 61% of respondents indicated that trust wouldn't affect their voting decisions at the upcoming May 5 election.\n\nPolitical parties seek to capitalize on public skepticism, with Labour's Jack Straw asserting that voters must choose a party deserving of future trust. The Conservatives and Lib Dems emphasize Tony Blair's lack of trust due to his Iraq weapons claims, while the Greens highlight government dishonesty regarding the Iraq war.\n\nExperts like former education secretary Estelle Morris and Martin Bell argue that a \"three-cornered relationship\" between politicians, media, and the public contributes to the trust deficit. This relationship often alienates the public from political discourse, making it difficult for voters to assess politicians accurately.", "reference": "But according to the BBC poll, 61% said the issue of trust made no difference to whether or not they would vote at the next election, widely expected on 5 May.Lib Dem foreign affairs spokesman Menzies Campbell said the Iraq war had hit trust in politicians hard.The Lib Dems are also keen to highlight the trust issue, with Charles Kennedy has claiming voters had a \"fundamental lack of trust in the prime minister\".Eight out of 10 voters do not trust politicians to tell the truth, a new poll conducted for the BBC suggests.The poll comes after Foreign Secretary Jack Straw predicted trust would be \"the key choice\" at the next election.The Conservatives are keen to highlight the trust issue.Former education secretary Estelle Morris told BBC News 24 that there was a \"real problem of trust\" between the public and the politicians.The poll also looked at what lay behind the lack of trust in politicians.Mr Straw told activists in Blackburn on Thursday that voters would have to decide at the next election which party \"best deserves\" their \"future trust\"."}