{"raw_text": "Profile: Gordon Brown\n \n The ultimate prize of 10 Downing Street may continue to elude him but, as he prepares to deliver a record-breaking ninth budget, Gordon Brown can at least console himself with the thought that he is the longest serving chancellor of modern times.\n \n He reached that milestone last June, when he overtook David Lloyd George, who served for seven years and 43 days between 1908 and 1915. How much longer Mr Brown will continue in the job is not clear (he once said there are two types of chancellor: \"those who fail and those who get out in time.\") There are rumours he will be moved to the Foreign Office if Labour wins the general election. But, for now, Mr Brown dominates the domestic political scene like few chancellors - or politicians - before him.\n \n Gordon Brown was born in Glasgow on 20 February 1951, the son of a Church of Scotland Minister in the small Fife town of Kirkcaldy. At 12, he was canvassing for Labour and by his 20s he was a leading political activist in Scotland. He achieved a first class degree in history from Edinburgh University, where he went on to complete a PhD. His early career was spent lecturing, working in television and making a name for himself in the Scottish Labour Party.\n \n His first attempt to enter Westminster, for Edinburgh South in 1979, was thwarted by the present Tory spokesman on foreign affairs, Michael Ancram. But in 1983, he took Dunfermline East, a new constituency including Rosyth naval base, pit villages and coastal towns.\n \n Entering Westminster, he came to share an office with the newly elected MP for Sedgefield, Tony Blair. Within four years, Mr Brown had gained his first frontbench post as shadow chief secretary to the Treasury. He became shadow chancellor under John Smith's leadership in 1992. After the death of leader John Smith in 1994 he stood aside, agreeing to give Tony Blair a clear run at the leadership during a now infamous meal at the Granita restaurant in Islington.\n \n The other part of the deal, that Mr Blair will one day stand down in favour of the chancellor, is the stuff of Westminster legend. Mr Blair's supporters say such a deal never existed and endless newspaper columns - and even a television film - have been devoted to the alleged deal. But if his leadership ambitions were at least temporarily thwarted in 1994, Mr Brown continued his devotion to politics. During the 1997 election campaign, he is said to have worked an average of 18 hours a day, six days a week after running on a treadmill for an hour each morning.\n \n This dedication to his career was underlined by a comment by Mr Brown's former girlfriend of five years, Princess Marguerite of Romania, the eldest daughter of ex-King Michael of Romania, who said a relationship with him was \"politics, politics, politics\".\n \n If that was true then, Mr Brown, who married PR executive Sarah Macaulay in 2000, changed his perspective when the couple were hit by tragedy early in 2002. Their daughter Jennifer died in Edinburgh Royal Infirmary, 10 days after being born seven weeks prematurely. A year later, in October 2003, the couple had a son - John - an event which again gave the chancellor an opportunity to show his softer side. A trip to Africa earlier this year, to publicise his scheme to cancel the debt of poor nations, also gave the chancellor an opportunity to show his more human side.\n \n The ideological differences between Mr Brown and Mr Blair remain relatively modest. The chancellor opposes the further encroachment of the market into the NHS and is seen as being more \"Old Labour\" than Mr Blair in his approach to wealth redistribution. But their shared belief that market economics are compatible with social justice continues to form the ideological heart of the New Labour project. Yet they are portrayed by the media as being locked in almost permanent conflict, with Mr Brown supposedly nursing resentment at being betrayed by his younger Downing Street neighbour over the succession. Mr Blair, for his part, is said to be frustrated that his public service reforms are being thwarted by a vengeful Mr Brown, who reportedly delights in keeping the prime minister in the dark over the contents of his Budget until the last possible minute. After a recent run of negative headlines, Labour MPs took the unprecedented step of making a direct appeal to the two men stop bickering, for the good of the party. Events like this, and the testimony of former ministerial colleagues, make it impossible to dismiss the Brown/Blair feud as just journalistic hearsay, cooked up by hacks and camp followers in the hothouse atmosphere of Westminster. How much it damages the ability of government to do its job is open to question.\n \n A truce appears to have been called in the run up to the general election after a fresh spat was sparked by Blairite Alan Milburn being brought in over the head of Mr Brown to run the election campaign. But with the Tories having appeared to get the better of the pre-election campaign thus far there are reports that Mr Brown - using the Budget as a springboard - is to revitalise Labour's campaign. Amid all this it is easy to forget that Mr Brown remains the man most likely to succeed Mr Blair as Labour leader. There may be no shortage of possible contenders for the crown - including Mr Milburn - but none can command the sort of support in the parliamentary party and beyond that Mr Brown can. And Mr Blair's decision to name his own retirement date has at least given Mr Brown something to aim for - even if the prime minister's intention to \"serve a full third term\" if elected, took the shine off the announcement for the chancellor and his supporters.\n", "llama3.2:1b": "Gordon Brown is the longest-serving chancellor of modern times, having served nine budgets. He dominated domestic politics until Michael Ancram blocked him in 1983 but later agreed to share an office with Tony Blair in 1992. \n\nBrown's career has been marked by dedication, including working 18 hours a day after running on a treadmill during election campaigns and experiencing personal tragedy such as the loss of his daughter Jennifer.", "llama3.2:3b": "Gordon Brown was born in Glasgow on 20 February 1951 and became the longest serving chancellor of modern times, surpassing David Lloyd George. He started his career as a political activist in Scotland, lecturing, working in television, and eventually entered Westminster in 1979. Brown served under John Smith and later Tony Blair, who succeeded him as Labour leader after Brown stood aside to give Blair a clear run at the leadership. The two have been portrayed as having an ideological difference, with Brown being more \"Old Labour\" than Blair, but also sharing similar beliefs on market economics and social justice.", "gemma2:2b": "Gordon Brown is the longest serving chancellor of modern times, achieving this milestone last June by surpassing David Lloyd George. His political career began early, marked by a dedication to Labour Party activism and academic pursuits. He rose through the ranks of parliament, becoming shadow chancellor under John Smith before being appointed by Tony Blair.  Brown's leadership style is characterized by his unwavering commitment to politics and personal sacrifices for his causes. The relationship with his former colleague and successor, Tony Blair, has been subject to intense scrutiny and debate within Westminster circles, but remains a constant point of interest. \n", "qwen2.5:0.5b": "Gordon Brown is 10 Downing Street’s longest-serving chancellor of modern times. He has been in charge since 1951 when he succeeded David Lloyd George (who served for seven years). Although he hasn’t had a new budget to deliver, some speculate that he could continue serving at least until the next election.", "qwen2.5:1.5b": "Gordon Brown is set to deliver an 11th budget as he prepares for potentially stepping down from 10 Downing Street after serving as Chancellor of the Exchequer since June 2007, surpassing previous record holders such as David Lloyd George. The position has been referred to as \"the chancellor's job\" by some, as Brown is often seen dominating politics and public opinion despite occasional clashes with Tony Blair over political leadership.", "qwen2.5:3b": "Gordon Brown is the longest-serving Chancellor of modern times, having held the position since June 2016 when he overtook David Lloyd George. He often faces rumors about being moved to the Foreign Office in case Labour wins a general election. Born in Glasgow in 1951, Brown began his political career by canvassing for Labour at age 12 and later became a leading activist in Scotland. His early career included working as a lecturer and making a name for himself in the Scottish Labour Party. He entered Westminster in 1983 and soon after became shadow chief secretary to the Treasury under John Smith's leadership. After John Smith's death, Brown stood aside for Tony Blair. Despite ideological differences between Brown and Blair, their shared belief in market economics and social justice forms the core of New Labour policies. Their relationship is often portrayed as strained but a recent truce appears to have been established before the general election. As the most likely candidate to succeed Blair, Brown remains central to Labour's leadership race despite his potential retirement date announced by Blair.", "opencoder:1.5b": "Profile: Gordon Brown\n\nGordon Brown was born in Glasgow on 20 February 1951, a son of a Church of Scotland Minister in the small Fife town of Kirkcaldy. He was a talented political Activist from history who achieved a first class degree in Edinburgh University, where he completed a PhD in politics. He worked at television and earned a reputation for being known for his lectures. During his tenure as a Labour MP, he was a successful politician, leading up to election 1979.\n\nMr Brown has spent six years serving as a leader in the Scottish Labour Party, sharing his passion for politics with his supporters, including members from the Royal Mail newspaper and the Granita restaurant. He is believed to have worked an average of 18 hours a day, six days a week after running on a treadmill for an hour each morning.\n\nMr Brown’s devotion to politics has led him to become a shadow chancellor under John Smith's leadership in 1992. He remains known for his role as the Treasury secretary at a party, and has also been known to serve as a political advocate on foreign affairs. However, if his leadership ambitions were at least temporarily thwarted in 1994, Mr Brown continued his devotion to politics.\n\nHe had an unchartered flight of friends during his eleventh birthday, including Princess Marguerite of Romania, who married him and his daughter Jennifer - 10 days after being born seven weeks prematurely. The couple had a son John - the chancellor's chance at keeping the party in check.\n\nThe political differences between Mr Brown and Mr Blair remain relatively modest, but they are portrayed by the media as being more \"Old Labour\" than Mr Blair in his approach to wealth redistribution. But their shared belief that market economics are compatible with social justice continues to form the ideological heart of the New Labour project.\n\nA truce appears to have been called in the run up to the general election after a fresh spat was sparked by Blairite Alan Milburn being brought in over the head of Mr Brown to run the election campaign. He is seen as a former Labour candidate, suggesting his support could be used against him for the election.\n\nThe Tories have shown some resistance to Mr Brown's campaign, including some of the former members from the Royal Mail newspaper. However, events like this, and the testimony of former ministerial colleagues, make it impossible to dismiss the Brown/Blair feud as just journalistic misinformation, cooked up by hacks and camp followers in the hothouse atmosphere of Westminster.\n\nThe possible contenders for the crown, including Mr Milburn - are yet to be revealed. But there can be no shortage of possible contenders for the chancellor's future. And Mr Blair’s decision to name his own retirement date has given Mr Brown something to aim for - even if the prime minister's intention to \"serve a full third term\" if elected, took the shine off the announcement for the chancellor and his supporters.\n", "smollm:1.7b": "", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize Gordon Brown's life and career into a concise summary as per the user's instructions. The user provided an extensive text about Gordon Brown, including his background, his political career, key policies, and the ongoing relationship with Tony Blair.\n\nFirst, I should identify the main points that are essential for summarizing. The text starts by mentioning his birthdate, place, early education, and how he became a political activist in Scotland. Then it talks about his career at the Scottish Labour Party, moving to Westminster as shadow chief secretary before taking on shadow chancellor role under John Smith. It also covers his management during the 1990s, including the time when there was a conflict with Smith over leadership.\n\nHe mentions supporting \"New Labour,\" which is New Economic思想, and he has a personal connection to Romania through a relationship he mentioned. The text also touches on his dedication to politics, including his time in Africa and the tragedy of his marriage, how it exposed him as softer than ever before, and how it dealt with media scrutiny.\n\nThe ongoing feud between Brown and Blair is discussed, their ideological differences, and the media portrayal versus real events. Finally, he's seen as a possible leader for Labour, despite being a longer-term leader.\n\nI need to make sure all these points are covered concisely without too much detail. I'll start by noting his birthdate, place, early political activities. Then mention his career moves to Westminster and shadow chancellor role. Include his leadership in 1992 and the time when there was a conflict with Smith. Highlight New Labour and his personal relationships. Mention his support for \"New Labour\" and media scrutiny. Discuss his personal relationship with Romania and the tragedy, as well as his role in promoting a quieter side through trips to Africa and public speaking. Summarize that he is seen as softer than ever before due to this, how his marriage exposed him, and his ability to navigate media scrutiny. Mention his potential for future leadership despite Smith's betrayal and his support for Blair.\n\nI need to make sure each of these points is covered without going into too much depth. The summary should be around 60 characters as the user mentioned, but maybe a bit longer if I include all key events. Let me check for any missing details or key events that were covered in the text.\n\nYes, I think I have all the main points: birthdate, early life and activism, career moves to Westminster, shadow chancellor role, leadership conflicts with Smith, New Labour ideology, personal relationships, media scrutiny, personal relationship issues due to tragedy, ability to show softer side, support for Blair despite media issues, potential future leadership, and how he's seen as a quieter leader.\n\nI think I can structure the summary by starting with his early life, then career moves, leadership roles, personal conflicts, media aspects, personal story about Romania, marriage, trip to Africa, and his role in future politics. That should cover all major points without getting too detailed.\n</think>\n\nGordon Brown was born on February 20, 1951, in Glasgow, Scotland. He has a son with a church minister in Fife, Kirkcaldy. Early in his life, he became a prominent Scottish Labour activist and college graduate from Edinburgh University, completing a PhD. He joined the Scottish Labour Party and later moved to Westminster, becoming shadow chief secretary before taking on shadow chancellor role under John Smith. During this time, there was a conflict with Smith over leadership. His support for \"New Labour\" is noted, and he has a personal relationship with Romania's ex-Prime Minister Michael of Romania. A tragic event occurred when his wife marries an 11-month-old, and his son John later marries someone else. He used international trips to Africa as a platform for public speaking and revealed that his marriage exposed him as less prominent than ever. Despite media scrutiny, he is seen as softer than ever before due to this story. His marriage to Romania's ex-Prime Minister, Alan Milburn, sparked a fresh spat, while the Tories have so far been successful in the pre-election campaign. He remains viewed as a potential future leader for Labour, though Smith's leadership has taken away full term.", "tinyllama:1.1b": "Presented in a concise manner, this summary highlights key ideas and details about Gordon Brown's tenure as the longest-serving chancelloor of modern times. It also briefly describes the rumours of Mr Brown's departure from the Prime Ministership following his failure to win the general election, his political background, and his support for Labour's pre-election campaign. The summary does not provide a detailed analysis of Brown's policies or achievements but rather focuses on his personal relationships with his ex-girlfriend and PR executive, Princess Margareta of Romania, and his family life, including the birth of his daughter and son in 2003.", "tinydolphin:1.1b": " While this is indeed an informative article about the tenure of Gordon Brown as UK Prime Minister, it does not fully capture the essence or impact of his role on the domestic political scene. He has been the longest-serving chancellor of modern times and during his time in office, he made significant progress in addressing the economic crisis faced by Britain, including measures to reduce the country's debt and invest in infrastructure projects such as roads, railways and energy generation.\n\nThis success has helped to secure the Labour party's position as the major opposition in Westminster. His leadership also saw the party gain substantial ground in recent general elections, particularly among younger voters who had been a significant driving force for the Conservatives in the past. This has made it increasingly difficult for the Tories to form a government alone, which is an essential requirement if they are to maintain their majority in Parliament.\n\nDespite these accomplishments, there have been several instances where Brown's leadership has faced criticism from within his own party and from commentators outside of it. This has been particularly true during the recent budget process, where he made numerous announcements that many of his supporters were not happy with. The public perception of Brown's handling of these announcements was mixed at best, but there is no doubt that he has been criticized for being too ambitious and over-reaching in some areas.\n\nIn conclusion, while this article does a good job of providing an overview of Gordon Brown's tenure as UK Prime Minister, it does not fully capture the impact or influence he has had on domestic politics. His leadership has helped to secure a Labour party that is popular with younger voters and have made significant progress in addressing the economic crisis faced by Britain. However, there are still many areas where Brown's leadership can be improved and his position as the longest-serving chancellor of modern times remains uncertain.", "phi:2.7b": " Gordon Brown is the longest-serving modern-day chancellor of the British Treasury, having been in office since 1998. He was born in Glasgow in 1951, and went on to become an influential figure in Scottish politics before entering Westminster. Despite a brief setback when he lost the leadership of Labour's shadow cabinet, he continued to make his mark in government as chief whip under Tony Blair. After Blair announced that he would stand down as prime minister soon after the 1997 election, Brown was promoted to shadow chancellor and eventually became Chancellor of the Exchequer. His approach to wealth redistribution has been seen as more Old Labour than New Labour, but his ideological differences with Blair are relatively modest. Despite reports of a bitter feud between the two men, they have called off their bickering in preparation for the upcoming general election.\n", "orca-mini:3b": " Gordon Brown, the longest-serving Chancellor of Modern Times, has nine budgets under his belt as Prime Minister Tony Blair's Chief Economic Advisor before being appointed to the top job in 1997. He is known for his dedication to politics and his commitment to public service reform, but he also has a reputation for being contentious with his boss, Prime Minister Tony Blair. Despite their ideological differences, they are seen as working towards a shared goal of social justice and market economics compatibility. However, recent media reports have highlighted tensions between the two leaders, prompting Labour MPs to appeal for them to stop bickering.", "hermes3:3b": "Gordon \n* Chancellor of Modern Times, longest serving\n* Prepares ninth budget\n* Dominates domestic political scene like few chancellors before him\n* Born in Glasgow on 20th February 1951\n* Early career involved lecturing, television work and Scottish Labour Party activism\n* First attempt to enter Westminster was unsuccessful but he took Dunfermline East later.", "stablelm-zephyr:3b": "Gordon Brown, the longest serving Chancellor of modern times, is preparing for his record-breaking ninth budget. Born in Glasgow on 20 February 1951, Brown became a leading political activist in Scotland during his twenties. He gained entry to Westminster in 1983 and rapidly rose through the ranks, eventually becoming shadow chancellor under John Smith's leadership in 1992. Brown's dedication to his career is evident from his intense work schedule during the 1997 election campaign, which he says helped him maintain focus on politics. Although there are ideological differences between Brown and Tony Blair, their shared belief in market economics being compatible with social justice forms the heart of New Labour. The Brown-Blair relationship has been a source of media speculation and conflict, but former ministerial colleagues attest to its reality. Despite this, a truce was called ahead of the general election, allowing Brown to revitalize Labour's campaign. As Chancellor, Brown remains the most likely successor for Tony Blair as Labour leader.", "chatgpt-4o-latest": "Gordon Brown, the longest-serving modern Chancellor, has dominated UK politics but has yet to achieve his ambition of becoming Prime Minister. Born in Glasgow in 1951, he was politically active from a young age and earned a PhD in history from Edinburgh University. After an early career in academia and media, he entered Parliament in 1983 and quickly rose through Labour’s ranks, becoming Shadow Chancellor in 1992. Following John Smith’s death in 1994, he stepped aside for Tony Blair to lead Labour, reportedly in exchange for a future leadership handover, though Blair’s camp denies such a deal. Brown has been a dedicated politician, known for his intense work ethic and commitment to economic policy. His personal life saw tragedy with the loss of his first child in 2002, but he later became a father again. Ideologically, he shares Blair’s belief in market-driven social justice but is seen as more traditional Labour. Their rivalry, often portrayed as a bitter feud, has shaped Labour’s internal dynamics. Despite tensions, Brown remains the most likely successor to Blair, though the Prime Minister’s intention to serve a full third term has complicated his path to leadership.", "stablelm2:1.6b": "Gordon Brown, the longest-serving Chancellor of modern times, prepares to deliver his ninth budget. Born in Glasgow, he started political activism at age 16 and earned degrees from Edinburgh University. He began his career as a lecturer before working in television and Scottish Labour Party. His first attempt for Westminster was blocked by Michael Ancram; however, he won Dunfermline East in 1933. Brown became Shadow Chancellor under John Smith's leadership in 1922. In 1 T4, he agreed to give Tony Blair a clear run at the leadership during a heated meal at the Granita restaurant in Islington.\n\nBrown's dedication and commitment to politics have been showcased during political campaigns and personal tragedy. He is known for his work ethic, working an average of 6 hours per day during the 1977 election campaign. His softer side was highlighted when his wife miscarried and he took his daughter to Africa to support a scheme aimed at cancelling the debt of poor nations.\n\nDespite ideological differences with Tony Blair, Brown and Blair remain locked in a feud that could damage the ability of government to do its job. A truce appears to have been called during the run-up to the general election; however, with the Tories gaining better results so far, there are reports that Mr. Brown may revive Labour's campaign.\n\nBrown remains the most likely contender to succeed Tony Blair as Labour leader, though Alan Milburn is also a potential candidate. Brown's support in the parliamentary party and beyond makes him more than just an adversary for his rival, Prime Minister Tony Blair. His dedication and personal experience make Brown the ultimate profile of a political figure in modern times.", "granite3.1-dense:2b": "Gordon Brown, born in 1951, is the longest-serving modern Chancellor of the Exchequer, surpassing David Lloyd George's seven years and 43 days tenure in 2006. Rumored to be considering a move to the Foreign Office if Labour wins the next election, Brown dominates British domestic politics. His career began as an early political activist in Scotland, leading him to become a Member of Parliament for Dunfermline East in 1983. After initial setbacks and a brief stint as shadow chief secretary to the Treasury, he became shadow chancellor under John Smith in 1992. Following Smith's death, Brown supported Tony Blair's leadership, agreeing to step aside for him during a controversial dinner. Despite this, Brown continued his political commitment, working extensively during the 1997 election campaign.\n\nBrown married Sarah Macaulay in 2000 and faced personal tragedy when their premature daughter Jennifer died in 2002. This loss reportedly softened him, as evidenced by his trips to Africa for debt relief initiatives. Brown's ideological alignment with Blair remains compatible, but he is perceived as more \"Old Labour\" regarding NHS market encroachment and wealth redistribution.\n\nBrown and Blair have a contentious relationship, often portrayed in the media as locked in conflict due to alleged resentment over succession and policy disagreements. Labour MPs recently urged them to mend fences for the party's sake. Despite this, Brown is considered the most likely successor to Blair as Labour leader, backed by extensive parliamentary support.\n\nIn recent times, Brown has employed his budget speeches as a platform to reinvigorate Labour's campaign. Regardless of the ongoing feud and external challenges, Brown remains a dominant figure in British politics, poised to potentially succeed Blair as Labour leader.", "reference": "The ideological differences between Mr Brown and Mr Blair remain relatively modest.Amid all this it is easy to forget that Mr Brown remains the man most likely to succeed Mr Blair as Labour leader.How much longer Mr Brown will continue in the job is not clear (he once said there are two types of chancellor: \"those who fail and those who get out in time.\")But, for now, Mr Brown dominates the domestic political scene like few chancellors - or politicians - before him.Mr Blair, for his part, is said to be frustrated that his public service reforms are being thwarted by a vengeful Mr Brown, who reportedly delights in keeping the prime minister in the dark over the contents of his Budget until the last possible minute.The other part of the deal, that Mr Blair will one day stand down in favour of the chancellor, is the stuff of Westminster legend.And Mr Blair's decision to name his own retirement date has at least given Mr Brown something to aim for - even if the prime minister's intention to \"serve a full third term\" if elected, took the shine off the announcement for the chancellor and his supporters.There may be no shortage of possible contenders for the crown - including Mr Milburn - but none can command the sort of support in the parliamentary party and beyond that Mr Brown can.But if his leadership ambitions were at least temporarily thwarted in 1994, Mr Brown continued his devotion to politics.The chancellor opposes the further encroachment of the market into the NHS and is seen as being more \"Old Labour\" than Mr Blair in his approach to wealth redistribution.A truce appears to have been called in the run up to the general election after a fresh spat was sparked by Blairite Alan Milburn being brought in over the head of Mr Brown to run the election campaign.If that was true then, Mr Brown, who married PR executive Sarah Macaulay in 2000, changed his perspective when the couple were hit by tragedy early in 2002.Within four years, Mr Brown had gained his first frontbench post as shadow chief secretary to the Treasury.But with the Tories having appeared to get the better of the pre-election campaign thus far there are reports that Mr Brown - using the Budget as a springboard - is to revitalise Labour's campaign.This dedication to his career was underlined by a comment by Mr Brown's former girlfriend of five years, Princess Marguerite of Romania, the eldest daughter of ex-King Michael of Romania, who said a relationship with him was \"politics, politics, politics\"."}