{"raw_text": "Sayeed to stand down as Tory MP\n \n Tory MP Jonathan Sayeed is to stand down on the grounds of ill health.\n \n The decision comes after Mr Sayeed survived an attempt to de-select him in a row over allegations he had profited from private tours of Parliament. The Mid-Bedfordshire MP had denied a claim that he was paid for guiding visitors around the Palace of Westminster. Conservative leader Michael Howard has now accepted the MP's resignation, it has been announced.\n \n Mr Sayeed was suspended from Parliament for two weeks last month after the Commons standards and privileges committee said his conduct had fallen \"well below the standards expected\". The Conservative Party had already been withdrawn the whip for a month. But his constituency association voted against a move to deselect him, with Mr Sayeed winning 173 of the 299 votes. After the vote, Mr Sayeed said only a fifth of association members had voted against him and he intended to get on with winning the election. But the vote prompted constituency association president Sir Stanley Odell to resign in protest. The Standards and Privileges Committee inquiry was launched after the Sunday Times alleged English Manner Limited charged clients for access to Westminster through Mr Sayeed. Mr Sayeed had denied the claims, saying the suspension was \"unjust and wrong\" but he made an \"unreserved\" apology to MPs in the Commons chamber. He insisted that the committee's report had contained a \"few errors of fact\". Mr Sayeed has been MP for Mid-Bedfordshire since 1997. He represented Bristol East from 1983 to 1992.\n", "llama3.2:1b": "Jonathan Sayeed, Tory MP, is standing down due to ill health. His resignation follows the Conservative Party accepting his withdrawal after he was suspended last month over allegations of profiting from private tours. The Standards and Privileges Committee had previously found his conduct \"well below standards\". However, a constituency association vote showed 173 votes against deselecting him, prompting his resignation.", "llama3.2:3b": "Tory MP Jonathan Sayeed will stand down due to ill health after surviving an attempt to de-select him over allegations he profited from private tours of Parliament, with the Conservative leader accepting his resignation.", "gemma2:2b": "Jonathan Sayeed is resigning as Tory MP due to ill health.  He survived an attempt to deselect him after allegations he profited from private tours of Parliament. The Standards and Privileges Committee inquiry led to his suspension and the Conservative Party removing its whip, but a constituency association vote against deselection allowed him to remain. \n", "qwen2.5:0.5b": "Tory MP Jonathan Sayeed resigned from his role as an MP on the grounds of ill health, following allegations that he profited from private tours of Parliament. His appointment was initially suspended for two weeks by the Commons standards and privileges committee but the party had already withdrawn its whip and constituency association president had resigned in protest.", "qwen2.5:1.5b": "Tory MP Jonathan Sayeed resigns due to health issues following allegations about guided tours and suspension over parliamentary conduct.", "qwen2.5:3b": "Tory MP Jonathan Sayeed is standing down due to ill health after surviving an attempt to de-select him over allegations of profiting from private tours of Parliament. The Commons standards and privileges committee ruled that his conduct fell below expected standards, leading to his suspension for two weeks. Despite this, Mr Sayeed's constituency association voted against deselection with a majority in favor. Conservative leader Michael Howard accepted the MP's resignation.", "opencoder:1.5b": "Tory MP Jonathan Sayeed is to stand down on the grounds of ill health.\n\nThe decision comes after Mr Sayeed survived an attempt to de-select him in a row over allegations he had profited from private tours of Parliament. The Mid-Bedfordshire MP had denied a claim that he was paid for guiding visitors around the Palace of Westminster. Conservative leader Michael Howard has now accepted the MP's resignation, it has been announced.\n\nMr Sayeed was suspended from Parliament for two weeks last month after the Commons standards and privileges committee said his conduct had fallen \"well below the standards expected\". The Conservative Party had already been withdrawn the whip for a month. But his constituency association voted against a move to deselect him, with Mr Sayeed winning 173 of the 299 votes. After the vote, Mr Sayeded only a fifth of association members had voted against him and he intended to get on with winning the election. But the vote prompted constituency association president Sir Stanley Odell to resign in protest. The Standards and Privileges Committee inquiry was launched after the Sunday Times alleged English Manner Limited charged clients for access to Westminster through Mr Sayeed. Mr Sayeed had denied the claims, saying the suspension was \"unjust and wrong\" but he made an \"unreserved\" apology to MPs in the Commons chamber. He insisted that the committee's report had contained a \"few errors of fact\". Mr Sayeed has been MP for Mid-Bedfordshire since 1997. He represented Bristol East from 1983 to 1992.\n", "smollm:1.7b": "", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Jonathan Sayeed standing down as a Tory MP. Let's see.\n\nFirst, the main points are that he's being considered for a seat, his health is an issue. The decision came after someone tried to de-select him because of his private tours. He denied being paid for guiding visitors. Also, he was suspended before and has been around for over 20 years. His constituency vote against him wasn't against the suspension but more about whether it should be removed. There's an incident where a company used his MP status to charge clients incorrectly.\n\nI need to make sure I include all these details without adding extra information. The summary should focus on his resignation, health, the previous suspension, the constituency vote, and the recent legal developments.\n\nHmm, I should also mention that the standards inquiry is part of this, but maybe not get into too much detail since it's about the summary. Keep it concise, just key points.\n</think>\n\nJonathan Sayeed is considering standing down as a Tory MP, mainly due to his health issues. He was suspended from Parliament in December after public misconduct allegations and has been in office since 1997. His constituency vote against him did not involve his suspension but more about whether the status should be removed. A legal incident involving a company using his MP status incorrectly led to him being suspended, and the Conservative Party withdrew the whip for another month. The Standards and Privileges Committee is conducting an inquiry into this matter, with Mr Sayeed having denied previous claims of private tour payments but resented them earlier.", "tinyllama:1.1b": "Based on the given material, Toro MP Jonathan Sayeed has decided to stand down as a result of his failing health. The decision comes after he survived an attempt by pro-defection allegations that he had profited from private tours of Parliament. Conservative leader Michael Howard has accepted Mr Sayeed's resignation, citing \"well below the standards expected\" for his conduct and his constituency association having voted to deselect him, with the MP winning 173 votes out of 299. The Standard & Privileges Committee inquiry was launched after claims from the Sunday Times that English Manners Limited paid clients to gain access to Westminster through Mr Sayeed, but he denied the allegations. He apologized for his \"fewer errors of fact\" in the Commons chamber before stating that the committee's report contained only a few errors. The MP has represented Toro since 1997 and held Bristol East from 1983 to 1992, and he had been MP for Mid-Befordshire since 1997 until his announcement of resignation.", "tinydolphin:1.1b": " Sayeed, Conservative MP for Mid-Bedfordshire, resigned due to illness. The decision came after he survived an attempt to de-select him over allegations of profiteering in the context of tours around Parliament. Speaking on condition of anonymity, Mr. Sayeed's representative said they have been denied access to him for the past few weeks because of his health issues.\n\nThe decision by Michael Howard, Tory leader, to accept Mr. Sayeed's resignation is a relief for the Conservative Party, as it prevents further controversy surrounding his conduct in office. As the MP for Bristol East, Mr. Sayeed has represented his constituents since 1983, and the decision could impact future elections or policy positions within the party.\n\nDespite the suspension, the UK's political landscape remains uncertain. While Sir Stanley Odell resigned over the vote against removing Mr. Sayeed, a majority of constituency association members chose to keep him in office. This inquiry into allegations against Mr. Sayeed is underway, with the committee examining whether MPs were \"unjustly or wrongfully\" suspended from their roles.\n\nDespite the controversy surrounding Mr. Sayeed's conduct and future plans for his constituency, Mid-Bedfordshire remains a key Tory seat in the upcoming election. The party is expected to hold onto its majority in the Commons, despite losing a Conservative MP who allegedly profited from private tours of Parliament.", "phi:2.7b": " Jonathan Sayeed, Tory MP for Mid-Bedfordshire, is resigning due to ill health after surviving an attempt at de-selection over allegations of profiting from private tours of Parliament. Conservative leader Michael Howard has accepted his resignation and Mr Sayeed was suspended for two weeks last month by the Commons standards and privileges committee. The committee found that his conduct had fallen \"well below the expected\" standards, but he was not deselected after a vote by his constituency association. After the vote, the association president resigned in protest. Mr Sayeed has been MP for Mid-Bedfordshire since 1997 and represented Bristol East from 1993 to 1995.\n", "orca-mini:3b": " Tory MP Jonathan Sayeed is resigning due to ill health. This follows his suspension from Parliament last month and allegations of wrongdoing related to private tours of the Palace of Westminster. The vote to deselect him by his constituency association was defeated, but the matter led to the resignation of the association president in protest.", "hermes3:3b": "Jonathan Sayeed, UK Tory MP, stands down due to health; previously suspended over allegations of profiting from private tours.", "stablelm-zephyr:3b": "Tory MP Jonathan Sayeed is stepping down due to ill health, following allegations of profiting from private tours of Parliament. Despite denying the claims, Mr Sayeed was suspended for two weeks and his Conservative Party whip had already been withdrawn for a month. After voting against his deselection, some association members voted against him while others resigned in protest. The Standards and Privileges Committee inquiry reportedly contained errors of fact.", "chatgpt-4o-latest": "Tory MP Jonathan Sayeed is stepping down due to ill health after surviving a de-selection attempt over allegations of profiting from private tours of Parliament. He denied the claims but was suspended from Parliament for two weeks after a committee found his conduct below expected standards. The Conservative Party had also withdrawn the whip for a month. Despite winning a constituency vote to remain, the controversy led to the resignation of the constituency association president. The inquiry was triggered by allegations that English Manner Limited charged clients for access to Westminster through Sayeed. He denied wrongdoing but apologized in Parliament. Sayeed has been MP for Mid-Bedfordshire since 1997 and previously represented Bristol East from 1983 to 1992.", "stablelm2:1.6b": "Tory MP Jonathan Sayeed will step down due to health concerns, after surviving an attempt to deselect him over allegations of profiting from private tours in Parliament. The decision follows a Commons standards and privileges committee finding his conduct \"well below expected standards.\" However, the MP won his constituency association's support against a move to deselect him. Sir Stanley Odell resigned in protest after a Sunday Times article alleged English Manner Limited charged clients for access to Westminster through Sayeed. Sayeed apologized but disputed the facts in the report. He has been an MP since 1979, representing Mid-Bedfordshire and Bristol East earlier.", "granite3.1-dense:2b": "Tory MP Jonathan Sayeed, representing Mid-Bedfordshire since 1997 and previously Bristol East (1983-1992), is resigning due to health issues. The decision follows an internal party rebellion; despite being suspended for two weeks by the Commons standards committee over allegations of profiting from private Parliament tours, Sayeed won a constituency association vote against deselection with 173 votes out of 299. This vote prompted the resignation of the association president in protest. Sayeed had denied the claims and made an unreserved apology in the Commons, acknowledging \"a few errors of fact\" in the committee's report.", "reference": "Mr Sayeed has been MP for Mid-Bedfordshire since 1997.But his constituency association voted against a move to deselect him, with Mr Sayeed winning 173 of the 299 votes.After the vote, Mr Sayeed said only a fifth of association members had voted against him and he intended to get on with winning the election.Mr Sayeed had denied the claims, saying the suspension was \"unjust and wrong\" but he made an \"unreserved\" apology to MPs in the Commons chamber.Mr Sayeed was suspended from Parliament for two weeks last month after the Commons standards and privileges committee said his conduct had fallen \"well below the standards expected\".The Standards and Privileges Committee inquiry was launched after the Sunday Times alleged English Manner Limited charged clients for access to Westminster through Mr Sayeed."}