{"raw_text": "India calls for fair trade rules\n \n India, which attends the G7 meeting of seven leading industrialised nations on Friday, is unlikely to be cowed by its newcomer status.\n \n In London on Thursday ahead of the meeting, India's finance minister, lashed out at the restrictive trade policies of the G7 nations. He objected to subsidies on agriculture that make it hard for developing nations like India to compete. He also called for reform of the United Nations, the World Bank and the IMF.\n \n Palaniappan Chidambaram, India's finance minister, argued that these organisations need to take into account the changing world order, given India and China's integration into the global economy. He said the issue is not globalisation but \"the terms of engagement in globalisation.\" Mr Chidambaram is attending the G7 meeting as part of the G20 group of nations, which account for two thirds of the world's population. At a conference on developing enterprise hosted by UK finance minister Gordon Brown on Friday, he said that he was in favour of floating exchange rates because they help countries cope with economic shocks. \"A flexible exchange rate is one more channel for absorbing both positive and negative shocks,\" he told the conference. India, along with China, Brazil, South Africa and Russia, has been invited to take part in the G7 meeting taking place in London on Friday and Saturday. China is expected to face renewed pressure to abandon its fixed exchange rate, which G7 nations, in particular the US, have blamed for a surge in cheap Chinese exports. \"Some countries have tried to use fixed exchange rates. I do not wish to make any judgements,\" Mr Chidambaram said. Separately, the IMF warned on Thursday that India's budget deficit was too large and would hamper the country's economic growth, which it forecast to be around 6.5% in the year to March 2005. In the year to March 2004, the Indian economy grew by 8.5%.\n", "llama3.2:1b": ["India called for fair trade rules at a G7 meeting, criticizing restrictive policies that make developing nations like India harder to compete with.", "It also proposed reforming the United Nations and international financial institutions."], "llama3.2:3b": ["India calls for fair trade rules amid criticism of G7 nations' restrictive policies and its own budget deficit, with Finance Minister Palaniappan Chidambaram arguing for a more flexible exchange rate system to cope with economic shocks."], "gemma2:2b": ["India is attending G7 meetings as a newcomer and is challenging G7 nations' trade policies that restrict developing countries.", "India proposes reforms for UN, World Bank, and IMF to account for changing global dynamics, especially given China and India's significant economic integration.", "India supports floating exchange rates to better handle economic shocks.", "The IMF warned of India's large budget deficit hindering economic growth."], "qwen2.5:0.5b": ["India is expected to attend the G7 meeting on Friday and Saturday as part of the G20 group of nations that account for two thirds of the world's population.", "India has been invited to take part in the G7 meeting taking place in London, which comes ahead of the upcoming G7 meeting of seven leading industrialised nations, which is expected to be attended by China, Brazil, South Africa and Russia.", "The IMF warned that India's budget deficit was too large and would hamper its economic growth, suggesting that it has a 6.5% budget deficit in the year to March 2005 while the Indian economy grew by 8.5%."], "qwen2.5:1.5b": ["India calls for fair trade rules at G7 meeting on agriculture subsidies and other issues affecting developing nations.", "India's finance minister argues these organisations need to adapt to changing global economics.", "India favors floating exchange rates as a way to better cope with economic shocks, but IMF warns the country's budget deficit poses risks to its growth."], "qwen2.5:3b": ["India calls for fair trade rules at G7 meeting, criticizing restrictive policies like agricultural subsidies and calling for reforms of UN, World Bank, and IMF.", "Finance Minister Palaniappan Chidambaram argues these organizations should consider changing world order with India and China's integration.", "He supports flexible exchange rates to help absorb economic shocks.", "India is part of the G20 along with China, Brazil, South Africa, and Russia.", "The IMF warns about large budget deficit hindering 6.5% GDP growth forecast for 2005, down from 8.5% in previous year."], "opencoder:1.5b": ["India calls for fair trade rules.", "In London on Thursday ahead of the G7 meeting of seven leading industrialised nations, India's finance minister lashed out at the restrictive trade policies of the G7 nations.", "He objected to subsidies on agriculture that make it hard for developing nations like India to compete.", "He also called for reform of the World Bank and the IMF, provided they consider the changing world order, given India and China's integration into the global economy.", "Mr Chidambaram, who is attending the G7 meeting as part of the G20 group of nations, accounts for two thirds of the world's population at a conference on developing enterprise hosted by Gordon Brown on Friday.", "He said he was in favour of floating exchange rates because they help countries cope with economic shocks and facilitate international trade.", "The issue is not globalisation but \"the terms of engagement in globalisation.\""], "smollm:1.7b": ["The summary of the text is: India calls for fair trade rules and opposes subsidies on agriculture that make it hard for developing nations like India to compete.", "It also wants reform of the United Nations, the World Bank and the IMF."], "deepseek-r1:1.5b": ["India is calling for fair trade rules, despite being part of the G7 meeting of leading industrialized nations on Friday.", "The Finance Minister, Palaniappan Chidambaram, criticized restrictive trade policies like agricultural subsidies and urged reforms in the United Nations, World Bank, and IMF.", "During a conference with Gordon Brown, he highlighted floating exchange rates as an idea to help manage economic shocks and emphasized that some countries have tried using fixed exchange rates, while the IMF warned India's budget deficit could slow growth.", "India is attending the G7 meeting alongside China, Brazil, South Africa, and Russia, but faces concerns about China's reliance on a fixed exchange rate for cheap exports."], "tinyllama:1.1b": ["India calls for fair trade rules at the G7 meeting of seven leading industrialized nations held on Friday.", "The country's finance minister, Pranab Mukherjee, criticised the restrictive trade policies of the G7 nations during his speech in London, calling for reform and an increase in excahnge rates.", "He also expressed support for floating exchange rates because they help manage economic shocks, similar to China, which is expected to face renewed pressure to abandon its fixed rate.", "The IMF has warned that India's budget deficit was too large, leading to concerns about the country's economic growth projections for 2004 and 2005."], "tinydolphin:1.1b": [" India is calling for fair trade rules at this year's G7 meeting, where seven leading industrialized nations will meet in London.", "The Indian finance minister, Palaniappan Chidambaram, criticized the restrictive trade policies of the G7 and argued that these organizations need to recognize the changing global landscape and consider the needs of countries like India and China in their pursuit of globalization.", "Chidambaram stated that these organizations should consider the issue of globalization and its impact on developing nations, like India.", "He also argued for a more flexible exchange rate system, which could help Indian businesses deal with economic shocks more effectively.", "Chidambaram's comments come after his country was invited to participate in this year's G7 meeting, where the focus is on addressing issues such as trade, globalization and economic cooperation.", "This event takes place in London from July 8-10, and India, along with China, Brazil, South Africa, and Russia, is set to be a part of it.", "The IMF has warned that India's budget deficit could pose challenges for its economic growth, forecasting an annual growth rate of around 6.5% in the year to March 2005 compared to the 8.5% growth seen in the same period a year earlier."], "phi:2.7b": [" The summary of the text is:\n\n- India demands fair trade rules from G7 nations and reform of global institutions.", "- India' s finance minister criticizes agricultural subsidies and calls for flexible exchange rates.", "- India is among the invited nations to attend the meeting on Friday and Saturday in London.", "- China faces pressure to abandon its fixed exchange rate, which US blames for cheap exports."], "orca-mini:3b": [" India called for fair trade rules at the G7 meeting and argued against the restrictive trade policies of the G7 nations.", "Finance minister Palaniappan Chidambaram said that global institutions need to take into account the changing world order, especially with India and China's integration into the global economy.", "He supported floating exchange rates as a channel for absorbing economic shocks and suggested that some countries have tried using fixed exchange rates, but he did not wish to make any judgments.", "The IMF warned that India's budget deficit was too large and would hinder its economic growth, and Chidambaram also expressed concerns about the World Bank, UN, and IMF."], "hermes3:3b": ["India calls for fair trade rules, opposes G7 nations' restrictive subsidies, demands UN, World Bank, IMF reform; supports flexible exchange rates."], "stablelm-zephyr:3b": ["India's finance minister, Palaniappan Chidambaram, criticized the restrictive trade policies of G7 nations and called for reform of United Nations, World Bank, and IMF at the G20 meeting.", "He argued that these organizations should consider the changing world order with India and China's integration into the global economy.", "India has been invited to take part in the G7 meeting along with China, Brazil, South Africa, and Russia.", "The IMF warned that India's budget deficit was too large and could hinder economic growth forecast at 6.5% in 2005 after 8.5% growth in 2004."], "stablelm2:1.6b": ["India seeks fair trade rules at G7 meeting; Finance minister criticizes agriculture subsidies and reform of UN, World Bank, and IMF.", "India argues these organizations should consider changing world order after China's integration into global economy.", "Floating exchange rates help absorb economic shocks, according to Finance Minister Chidambaram.", "China faces pressure to abandon fixed exchange rate blamed for cheap exports.", "IMF warns budget deficit is too large hindering India's economic growth forecast at 6.5% in the year to March."], "granite3.1-dense:2b": ["India's finance minister, Palaniappan Chidambaram, is advocating for reformed global financial institutions—the United Nations, World Bank, and IMF—during the G7 meeting in London.", "He emphasizes the need to adapt these organizations to reflect India and China's growing economic influence in the world order.", "Chidambaram supports floating exchange rates, believing they aid countries in managing economic fluctuations.", "The G20 group, which includes India, Brazil, South Africa, and Russia, is participating in the G7 event.", "China, specifically, faces pressure to abandon its fixed exchange rate due to concerns it contributes to surplus Chinese exports.", "The IMF has also expressed concern about India's budget deficit, which they believe will impede economic growth forecasted at 6.5% for the year ending March 2005, compared to 8.5% in the previous year."], "chatgpt-4o-latest": ["India's finance minister, Palaniappan Chidambaram, criticized the G7 nations' restrictive trade policies, particularly agricultural subsidies that disadvantage developing countries.", "He called for reforms in global institutions like the UN, World Bank, and IMF to reflect the evolving global economy, emphasizing fair terms of engagement in globalization.", "Speaking at a conference in London, he supported floating exchange rates as a tool to manage economic shocks.", "India, along with China, Brazil, South Africa, and Russia, was invited to the G7 meeting, where China faced pressure to abandon its fixed exchange rate.", "Meanwhile, the IMF warned that India's large budget deficit could hinder its economic growth, projected at 6.5% for the year ending March 2005, down from 8.5% the previous year."]}