{"raw_text": "Court rejects $280bn tobacco case\n \n A US government claim accusing the country's biggest tobacco companies of covering up the effects of smoking has been thrown out by an appeal court.\n \n The demand for $280bn (£155bn) - filed by the Clinton administration in 1999 - was rejected in a 2-1 decision. The court in Washington found that the case could not be brought under federal anti-racketeering laws. Among the accused were Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group and Brown and Williamson. In its case, the government claimed tobacco firms manipulated nicotine levels to increase addiction, targeted teenagers with multi-billion dollar advertising campaigns, lied about the dangers of smoking and ignored research to the contrary.\n \n Prosecutors wanted the cigarette firms to surrender $280bn in profits accumulated over the past 50 years and impose tougher rules on marketing their products. But the Court of Appeals for the District of Columbia ruled that the US government could not sue the firms under legislation drawn up to counteract Mafia infiltration of business. The tobacco companies deny that they illegally conspired to promote smoking and defraud the public. They also say they have already met many of the government's demands in a landmark $206bn settlement reached with 46 states in 1998. Shares of tobacco companies closed higher after the ruling, with Altria rising 5% and Reynolds showing gains of 4.5%.\n", "llama3.2:1b": ["A US court has rejected a $280 billion claim from the Clinton administration against five major tobacco companies.", "The claim was based on allegations that the companies manipulated nicotine levels to increase addiction, targeted teenagers with advertising campaigns, lied about smoking risks, and ignored research.", "A Court of Appeals decision ruled that the government could not sue under legislation intended to counteract Mafia infiltration of business."], "llama3.2:3b": ["US appeal court rejects $280bn tobacco case; accused firms deny conspiring to promote smoking, claim they met demands from 1998 settlement."], "gemma2:2b": ["A US appeals court dismissed a $280 billion lawsuit against major tobacco companies by the Clinton administration, arguing that the case could not be brought under anti-racketeering laws.", "The court's decision denies the government's claims that tobacco firms manipulated nicotine levels and targeted teenagers with marketing campaigns to increase smoking.", "Tobacco companies denied any illegal conspiracy and argued they have already settled with 46 states for $206 billion in a separate case."], "qwen2.5:0.5b": ["A US appeals court ruled that an anti-racketeering claim against the world's biggest tobacco companies cannot be brought under federal anti-money laundering laws.", "The company claim alleged that tobacco firms had misled consumers about nicotine levels, targeted teenagers with advertising campaigns, lied about smoking dangers and ignored research to the contrary.", "The appeal court rejected a $280bn demand made by US President Clinton in 1999.", "Tobacco companies deny wrongdoing and have already met government demands for higher-priced cigarettes."], "qwen2.5:1.5b": ["The US appeals court rejected a $280 billion demand by the Clinton administration against tobacco companies for misleading consumers about health risks and targeting youth, finding it couldn't be brought under federal anti-racketeering laws.", "The ruling led shares of several major tobacco firms to rise after a previous settlement in 1998."], "qwen2.5:3b": ["A US government claim accusing major tobacco companies of covering up smoking effects was rejected by an appeal court in a 2-1 decision.", "The case sought $280bn from firms including Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group and Brown and Williamson for manipulating nicotine levels, targeting teens with ads, lying about health risks, and ignoring contrary research.", "Prosecutors wanted past profits seized and tougher marketing rules.", "However, the court ruled the government could not sue under anti-racketeering laws designed to counter Mafia influence.", "Despite denying conspiracy, tobacco companies also criticized the lawsuit's claims.", "Shares of affected firms rose after the ruling."], "opencoder:1.5b": ["Court rejects claim accusing big tobacco companies of covering up effects of smoking.", "A US government claim has been thrown out by an appeal court.", "The demand for $280bn was rejected in a 2-1 decision.", "The case could not be brought under federal anti-racketeering laws.", "Among the accused are Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group and Brown and Williamson.", "In its case, the government claimed tobacco firms manipulated nicotine levels to increase addiction, targeted teenagers with multi-billion dollar advertising campaigns, lied about the dangers of smoking and ignored research to the contrary.", "Prosecutors wanted the firms to surrender $280bn in profits accumulated over the past 50 years and impose tougher rules on marketing their products.", "The Court of Appeals for the District of Columbia ruled that the US government could not sue the firms under legislation drawn up to counteract Mafia infiltration of business.", "The tobacco companies deny they illegally conspired to promote smoking and defraud the public.", "They also say they have already met many of the government's demands in a landmark $206bn settlement reached with 46 states in 1998.", "Shares of the companies closed higher after the ruling, with Altria rising 5% and Reynolds showing gains of 4.5%."], "smollm:1.7b": ["The summary should include:\n\n1.", "The main idea: The US government's claim that tobacco firms cover up the effects of smoking was rejected by an appeal court.", "2.", "Key details: The case was filed under federal anti-racketeering laws, and the government claimed that the companies manipulated nicotine levels to increase addiction, targeted teenagers with multi-billion dollar advertising campaigns, lied about the dangers of smoking, and ignored research to the contrary.", "3.", "The main idea: Prosecutors wanted the cigarette firms to surrender $280bn in profits accumulated over the past 50 years and impose tougher rules on marketing their products.", "4.", "Key details: The appeal court rejected the case under federal anti-racketeering laws, which were not applicable to tobacco companies.", "5.", "The main idea: The US government could not sue the tobacco firms under legislation drawn up to counteract Mafia infiltration of business.", "6.", "Key details: The tobacco companies deny that they illegally conspired to promote smoking and defraud the public.", "They also say they have already met many of the government's demands in a landmark $206bn settlement with 46 states in 1998.", "Shares of tobacco companies closed higher after the ruling, with Altria rising 5% and Reynolds showing gains of 4.5%."], "deepseek-r1:1.5b": ["The US appeal court has rejected a $280 billion tobacco case from the government, which alleged companies covered up smoking effects.", "The case was rejected 2-1 against federal anti-racketeering laws.", "The demand for the money was filed by the Clinton administration in 1999 and was rejected by the court, which found it cannot be brought under federal anti-racketeering legislation.", "Five companies accused of manipulating nicotine levels, targeting teenagers with advertising, lying about smoking dangers, and ignoring research were implicated.", "The prosecution wanted companies to drop profits over 50 years and impose stricter marketing rules but were denied this under US legislation.", "Companies denied illegal cooperation with a Mafia and had previously reached a $206 billion settlement in 1998 with 46 states.", "Shares of tobacco companies rose after the ruling, with Altria up 5% and RJ Reynolds up 4.5%."], "tinyllama:1.1b": ["A US government demand for $280bn (£155bn) to cover up the effects of smoking has been rejected by an appeal court in Washington.", "The case was brought by the Clinton administration, alleging that tobacco companies were manipulating nicotine levels and targeting teenagers with multi-billion dollar advertising campaigns.", "Prosecutors wanted the firms to surrender $280bn in profit accumulated over 50 years and impose \"tougher rules on marketing their products.\"", "However, the Court of Appeals for the District of Columbia ruled that the government could not sue the firm under legislation designed to counteract mafia influence on business.", "The companies deny conspiring to promote smoking and defraud the public, and say they have already met many of the demands made in a landmark $206bn settlement with 46 states in 1998.", "As shares of tobacco companies closed higher after the ruling, Reynolds Tobacco gained 4.5%, while Altria Group rose by 5%."], "tinydolphin:1.1b": [" In a recent decision, a court has rejected a $280 billion claim against major US tobacco companies.", "The demand for this sum had been filed by President Clinton's administration in 1999.", "Among the named defendants were Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group, and Brown & Williamson.", "In their case, they claimed that the companies manipulated nicotine levels to increase addiction, targeted teenagers with multi-billion dollar advertising campaigns, lied about the dangers of smoking, and ignored research proving the opposite.", "Prosecutors wanted $280 billion in profits accumulated over the past 50 years and tougher rules on marketing their products.", "However, the Court of Appeals for the District of Columbia ruled that the US government could not sue the tobacco companies under a legislation designed to counteract organized crime.", "Instead, the court deemed it appropriate to impose significant fines and penalties on the defendants.", "This decision has been met with relief by tobacco firms, who had initially hoped to avoid legal action, while shares of major tobacco companies increased in value following the ruling."], "phi:2.7b": [" The US government's $280 billion lawsuit against tobacco giants was rejected by an appeals court.", "The government claimed that tobacco firms manipulated nicotine levels, targeted teenagers in their marketing campaigns, lied about smoking dangers, and ignored research to the contrary.", "However, prosecutors were unable to bring the case under federal anti-racketeering laws because of a ruling that allowed the companies to be sued under legislation against Mafia infiltration of business.", "Tobacco companies deny any wrongdoing and have already met many of the government's demands in a settlement.", "The ruling led to higher share prices for tobacco companies."], "orca-mini:3b": [" The US government's lawsuit seeking $280 billion in damages from major tobacco companies was rejected by an appeals court.", "The court found that the case could not be brought under federal anti-racketeering laws, stating that the cigarette firms could not be sued under those laws.", "The accused companies denied any illegal activity and argued that they had already met many of the government's demands in a 1998 settlement with states.", "The tobacco industry's shares closed higher after the ruling."], "hermes3:3b": ["US court dismisses $280bn tobacco class against major companies."], "stablelm-zephyr:3b": ["A US court has thrown out a $280bn claim by the Clinton administration against the country's biggest tobacco companies for allegedly covering up the effects of smoking.", "The appeal court found that the case could not be brought under federal anti-racketeering laws, and among those accused were Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group, and Brown and Williamson.", "The government claimed that the firms manipulated nicotine levels to increase addiction, targeted teenagers with multi-billion dollar advertising campaigns, lied about the dangers of smoking, and ignored research contrary to their claims.", "Prosecutors wanted the cigarette firms to surrender their $280bn profits accumulated over the past 50 years and impose tougher rules on marketing their products.", "However, the Court of Appeals for the District of Columbia ruled that the US government could not sue the firms under legislation designed to counteract Mafia infiltration of business.", "The tobacco companies deny that they illegally conspired to promote smoking and defraud the public, claiming they have already met many of the government's demands in a landmark $206bn settlement reached with 46 states in 1998."], "stablelm2:1.6b": ["A US court has dismissed a $10 billion (approx.", "£9 billion) lawsuit against major tobacco companies over allegations they manipulated nicotine levels to increase addiction.", "The case was rejected by an appeals court in Washington, which found the claim could not be brought under federal anti-ryanteeering laws.", "The government claimed the firms targeted teenagers with advertising campaigns, lied about smoking dangers, and ignored research contrary to their actions.", "Prosecutors sought $10 billion in profits and stricter marketing rules but lost the appeal."], "granite3.1-dense:2b": ["The US government's $280 billion lawsuit against major tobacco companies—Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group, and Brown and Williamson—was rejected in a 2-1 decision by the Court of Appeals for the District of Columbia.", "The court ruled that federal anti-racketeering laws did not apply to this case.", "The government's allegations included manipulating nicotine levels, targeting teenagers with massive advertising campaigns, lying about smoking dangers, and disregarding harmful research.", "The tobacco firms deny these claims and claim they've already fulfilled many of the government's demands through a $206 billion settlement in 1998 with 46 states.", "Following the ruling, shares of affected companies increased."], "chatgpt-4o-latest": ["A US appeals court rejected a $280bn lawsuit against major tobacco companies, ruling that the case could not be pursued under federal anti-racketeering laws.", "The government accused firms like Altria and RJ Reynolds of manipulating nicotine levels, targeting teenagers, and misleading the public about smoking risks.", "Prosecutors sought to recover profits and impose stricter marketing rules, but the court found the lawsuit inapplicable under laws designed to combat organized crime.", "Tobacco companies denied wrongdoing, citing a prior $206bn settlement with states.", "Following the ruling, tobacco company shares rose."]}