{"raw_text": "Indonesians face fuel price rise\n \n Indonesia's government has confirmed it is considering raising fuel prices by as much as 30%.\n \n Millions of Indonesians use kerosene for basic cooking, and prices have been heavily subsidised for years. President Susilo Bambang Yudhoyono's government has said it wants to curb fuel subsidies and direct the money into aid programmes for the poor. But critics argue cutting subsidies will hurt the poorer families that his government says it wants to help. Millions of people were left homeless in Indonesia Aceh's region following the earthquake and tsunami disaster in late December.\n \n Indonesia pays subsidies to importers in order to stabilise domestic fuel prices, but higher oil prices have forced the government to spend more on holding prices down. It spent 59.2 trillion rupiah ($6.58bn; £3.5bn) on fuel subsidies in 2004, a sum far in excess of its original projection of 14.5 trillion rupiah. Since President Yudhoyono's government came to power in October, it has indicated its intention of raising domestic fuel prices by cutting subsidies. \"The (January to March) quarter of this year is the best time for us to increase fuel prices,\" said Sri Mulyani Indrawati, State Minister for National Development Planning. \"We are still considering if a 30% hike is suitable at the moment. The sooner the better for the state budget.\" The BBC's correspondent in Jakarta, Rachel Harvey, told World Business Report that there was likely to be a strong public reaction to any price rise. \"The big question is whether they go for one big, short, sharp shock and raise prices between 20% and 30% or whether they try to stagger it,\" she said. Indonesia's previous government, led by President Megawati Sukarnoputri, also attempted to cut subsidies in 2003, but was forced to back down in the face of public protests.\n", "llama3.2:1b": ["Indonesia's government is considering raising fuel prices by as much as 30% due to higher oil prices and domestic fuel price stabilization costs.", "The move comes as President Susilo Bambang Yudhoyono seeks to curb fuel subsidies and redirect aid to poor families.", "However, critics argue that cutting subsidies will harm poorer families."], "llama3.2:3b": ["Indonesia's government is considering a 30% fuel price rise amid concerns over heavy subsidization and its impact on the poor.", "The move aims to curb fuel subsidies and redirect funds to aid programs for the needy.", "However, critics argue that cutting subsidies will disproportionately affect vulnerable families.", "Indonesia's previous attempt to cut subsidies in 2003 was met with public protests."], "gemma2:2b": ["Indonesia is considering raising fuel prices by up to 30% to curb subsidies and redirect funds to poverty programs.", "The move comes amid high oil prices and increased subsidy spending.", "The government aims for a price increase during the first quarter of this year but faces potential backlash from the public.", "Past attempts to cut fuel subsidies have been met with strong opposition."], "qwen2.5:0.5b": ["Indonesia is considering raising fuel prices by as much as 30% due to high oil prices and a planned price hike in January-March of this year.", "The BBC's correspondent estimates that any increase could lead to strong public reaction, with either a big, short, sharp shock or staggered increases."], "qwen2.5:1.5b": ["Indonesia considering raising fuel prices by up to 30% due to increased oil costs and subsidy cuts intended for poor families following earthquake and tsunami."], "qwen2.5:3b": ["Indonesia's government is considering a fuel price rise up to 30%, mainly due to rising oil costs and subsidies being redirected towards aid programs for the poor.", "Critics argue this will harm poorer families, following years of subsidized fuel use by millions relying on kerosene for cooking.", "The Indonesian government plans to cut these subsidies to stabilize prices, but could face public backlash given previous attempts failed amid protests.", "The best time to implement a price hike is reportedly in the first quarter, with a potential short and steep increase of 20-30% possibly delayed or phased-in."], "opencoder:1.5b": ["Indonesians face a rising fuel price that is being subsidized by millions of people for years.", "The government of Indonesia has announced plans to raise fuel prices by up to 30% and has directed funds towards aid programs in the poor areas.", "Despite concerns from critics, the government's intent is to increase the prices even further, which has led to a public reaction and the possibility of a larger price rise."], "smollm:1.7b": ["Indonesians face fuel price rise"], "deepseek-r1:1.5b": ["Indonesia's fuel price increase is driven by higher oil prices and subsidies from the government.", "The president plans to raise prices up to 30% to stabilize costs.", "Millions in Aceh region were left homeless after a disaster, and previous government attempts to cut subsidies faced public protests.", "Public reaction is strong for any price rise, but concerns about its impact on poverty remain."], "tinyllama:1.1b": ["Indonesians are facing a fuel price rise of up to 30%, as Indonesia's government considers raising fuel subsidies and directing money from subsidiaries into aid programmes for the poor.", "The President Susilo Bambang Yudhoyono's government has been pushing for this change since his inauguration in October, following the devastating earthquake and tsunami in December that left millions homeless.", "Critics argue that cutting subsidies will harm the poorer families who are said to form a large part of President Yudhoyono's base.", "Despite the potential public backlash, a 20% increase is still being considered by the government, with a focus on short-term shocks rather than stagging it to avoid political upheaval.", "The BBC's correspondent in Jakarta, Rachel Harvey, warns of a strong response from the population."], "tinydolphin:1.1b": [" Indonesia's government is considering increasing fuel prices by up to 30%, as part of its broader efforts to curb state subsidies and direct some money into aid programs for the poor.", "Critics argue that cutting these subsidies will hurt the poorer families, while supporters contend that it is necessary to maintain stability in domestic fuel prices.", "The announcement comes after President Susilo Bambang Yudhoyono's government announced plans to curb fuel subsidies and direct some money into aid programs for the poor following the devastating earthquake and tsunami disasters that hit Indonesia in December.", "This decision by Indonesia's government comes as a significant shift in the nation's economic policies, as previous governments have attempted to cut subsidies in order to stabilize domestic fuel prices.", "However, this approach has faced backlash from critics who argue that cutting subsidies will hurt the poorer families, while supporters contend that it is necessary for maintaining stability in domestic fuel prices.", "The decision by President Yudhoyono's government comes as Indonesia prepares to enter its second quarter fiscal year, which is characterized by high oil prices and concerns about inflationary pressures due to increased demand for imported goods."], "phi:2.7b": [" The Indonesian government is considering increasing fuel prices by up to 30% due to higher oil prices and a need to reduce subsidies.", "This could have a significant impact on millions of people who rely on kerosene for basic cooking.", "Critics argue that cutting subsidies will hurt poorer families.", "The government plans to raise domestic prices during the first quarter of the year, but there is concern about public reaction to any price increase."], "orca-mini:3b": [" Indonesia is considering raising fuel prices by as much as 30%.", "Higher oil prices have forced the government to spend more on holding prices down.", "The government has said it wants to reduce subsidies and direct the money into aid programs for the poor.", "However, critics argue that cutting subsidies will hurt poorer families that the government says it wants to help.", "Indonesia paid subsidies to importers to stabilize domestic fuel prices.", "The government spent 59.2 trillion rupiah ($6.58bn; £3.5bn) on fuel subsidies in 2004, a sum far beyond its initial projection.", "The government is considering raising fuel prices by either 20% or 30%, but it has not made a final decision yet."], "hermes3:3b": ["Indonesian go goes after raising fuel prices up to 30%, as subsidy costs exceed projections and millions rely on subsidised kerosene for cooking."], "stablelm-zephyr:3b": ["Indonesia's government is considering a 30% increase in fuel prices, as they want to curb fuel subsidies and direct the money to aid programs for the poor.", "However, critics argue that this will hurt poorer families.", "The previous government attempted to cut subsidies in 2003 but had to reverse its decision due to public protests.", "Indonesia spent 59.2 trillion rupiah ($6.58bn) on fuel subsidies in 2004, exceeding its projection by 14.5 trillion rupiah.", "State Minister for National Development Planning, Sri Mulyani Indrawati, said a 30% hike would be suitable and noted that the sooner it occurs, the better for the state budget."], "stablelm2:1.6b": ["Indonesia's government may raise fuel prices up to 20%, following concerns that subsidies are heavily subsidizing millions of Indonesians who rely on kerosene for basic cooking.", "Fuel subsidies are being cut to direct funding into aid programs, however critics argue cutting these subsidies will hurt the poor families President Yudhoyono wants to help.", "The government aims to increase fuel prices in the first quarter of this year to avoid spending more than projected for holding down prices.", "A strong public reaction is expected on any price hike, with one approach being a short, sharp shock between 20% and 25%."], "granite3.1-dense:2b": ["Indonesia's government is contemplating a potential 30% increase in fuel prices, including kerosene for cooking purposes.", "This decision stems from the need to redirect subsidies towards poverty alleviation programs.", "However, critics warn that such a rise would disproportionately affect lower-income families who currently benefit from heavily subsidized fuel.", "The government's 2004 fuel subsidy spending was significantly higher than projected, reaching 59.2 trillion rupiah ($6.58bn; £3.5bn).", "State Minister Sri Mulyani Indrawati has stated that the current quarter is optimal for implementing price hikes to improve the state budget.", "Public reaction to such a rise is expected to be substantial, with debates over whether to enact one large increase or spread it out over time.", "Previous attempts by President Megawati Sukarnoputri's government to cut subsidies in 2003 failed due to widespread protests."], "chatgpt-4o-latest": ["Indonesia's government is considering raising fuel prices by up to 30% to reduce subsidies and redirect funds to aid programs for the poor.", "However, critics argue that cutting subsidies will harm low-income families.", "Fuel subsidies have been costly, with the government spending far more than projected due to rising oil prices.", "President Yudhoyono's administration has signaled its intent to raise prices, with officials suggesting the first quarter of the year as the best time.", "A strong public reaction is expected, with debate over whether to implement a sharp increase or a gradual rise.", "A previous attempt to cut subsidies in 2003 was abandoned due to protests."]}