{"raw_text": "Telegraph newspapers axe 90 jobs\n \n The Daily and Sunday Telegraph newspapers are axing 90 journalist jobs - 17% of their editorial staff.\n \n The Telegraph Group says the cuts are needed to fund an £150m investment in new printing facilities. Journalists at the firm met on Friday afternoon to discuss how to react to the surprise announcement. The cuts come against a background of fierce competition for readers and sluggish advertising revenues amid competition from online advertising. The National Union of Journalists has called on the management to recall the notice of redundancy by midday on Monday or face a strike ballot.\n \n Pearson's Financial Times said last week it was offering voluntary redundancy to about 30 reporters.\n \n The National Union of Journalists said it stood strongly behind the journalists and did not rule out a strike. \"Managers have torn up agreed procedures and kicked staff in the teeth by sacking people to pay for printing facilities,\" said Jeremy Dear, NUJ General Secretary. NUJ official Barry Fitzpatrick said the company had ignored the 90-day consultation period required for companies planning more than 10 redundancies. \"They have shown a complete disregard for the consultative rights of our members,\" said Mr Fitzpatrick, who added that the company now planned to observe the consultation procedures. The two Telegraph titles currently employ 521 journalists.\n \n Some broadsheet newspapers - especially those which have not moved to a tabloid format - have suffered circulation declines, which are hitting revenues. The Telegraph has announced no plans to go tabloid although both The Independent and The Times have seen circulation rise since shrinking in size.\n \n The Guardian is hedging its bets, planning a larger tabloid format like those popular in continental Europe. The Telegraph Group was bought by the Barclay twins - Frederick and David - last year, having previously been owned by Lord Conrad Black's Hollinger International. The brothers are currently mulling the sale of another of their businesses, retailer Littlewoods.\n \n Telegraph executive Murdoch MacLennan said the two newspapers would add eight colour pages in the coming months.\n \n \"Journalists are the lifeblood of any newspaper, and maintaining the quality of The Daily Telegraph and The Sunday Telegraph for our readers is vital,\" he said. \"However, action to improve our production capability and secure our titles against the competition is also vital.\" Many newspapers are investing in new printing machinery that enables them to print more colour pages, or in some cases, have colour on every page. They are hoping that by boosting colour it will make their publications more attractive to advertisers and readers alike. In recent months News Corp's News International unit, which publishes The Sun and the News of the World, the Guardian Media Group, Trinity Mirror and the Daily Mail & General Trust have all announced substantial investments in new printing plants.\n", "llama3.2:1b": ["Telegraph newspapers axe 90 jobs, cutting editorial staff by 17%.", "The Telegraph Group plans to invest £150m in new printing facilities, prompting calls for a strike ballot by the National Union of Journalists.", "Other broadsheet newspapers, such as Pearson's Financial Times and News Corp's News International, have also made similar announcements."], "llama3.2:3b": ["Telegraph newspapers cut 90 journalist jobs, citing need to fund £150m investment in new printing facilities amid fierce competition and sluggish advertising revenues.", "The National Union of Journalists has called for recall of redundancy notices or a strike ballot, accusing the company of ignoring consultation procedures and disregarding staff rights."], "gemma2:2b": ["The Telegraph newspapers are laying off 90 journalists, representing 17% of their editorial staff, to fund a £150m investment in new printing facilities.", "This move comes amidst fierce competition for readers and advertising revenue, prompting the National Union of Journalists (NUJ) to call for management to recall the redundancy notice or face a strike ballot.", "The NUJ argues that the company violated consultation procedures during this process."], "qwen2.5:0.5b": ["The Telegraph is losing 90 journalist jobs amid a £150m investment by the group in new printing facilities.", "The company's daily edition has also had to cut its staff from 521 down to 385, leaving eight colour pages for them.", "News Corp recently made significant investments in new printing machinery to boost their titles' quality and attract advertisers and readers alike."], "qwen2.5:1.5b": ["The Telegraph newspapers are axing 90 journalist jobs, including 17% of their editorial staff, due to £150m investment in new printing facilities and concerns about declining circulation and advertising revenues.", "The National Union of Journalists called for a strike ballot against the management's decision, which has been deemed illegal under consultation rules."], "qwen2.5:3b": ["The Telegraph newspapers are cutting 90 journalist jobs (17% of editorial staff), necessitated by an £150m investment in new printing facilities.", "This follows a backdrop of declining circulation due to competition from online advertising and is met with resistance from journalists, who plan strikes if management bypasses consultation procedures.", "The National Union of Journalists calls for recall of redundancy notices or a strike ballot.", "Despite some broadsheet newspapers losing readership, the Telegraph has resisted moving to a tabloid format.", "CEO Murdoch MacLennan emphasizes the importance of maintaining quality journalism while improving production capabilities.", "Other media companies are also investing in new printing technologies to enhance their publications and attract advertisers/readers."], "opencoder:1.5b": ["The Telegraph is axe 90 jobs by cutting funding for a new print facility, which they are planning to fund with an £150m investment.", "The National Union of Journalists has called on the management to recall the notice of redundancy and face a strike ballot due to the surprise announcement.", "Pearson's Financial Times is offering voluntary redundancy to about 30 reporters and said the two Telegraph titles currently employ 521 journalists.", "Some newspapers have suffered increased circulation since they announced that they would add eight colour pages in the coming months.", "The Guardian is planning a larger tabloid format for its readers."], "smollm:1.7b": ["The summary is:\n\n1.", "Telegraph newspapers are axing 90 journalist jobs - 17% of their editorial staff.", "2.", "The Telegraph Group says the cuts are needed to fund an £150m investment in new printing facilities.", "Journalists at the firm met on Friday afternoon to discuss how to react to the surprise announcement.", "3.", "Pearson's Financial Times said last week it was offering voluntary redundancy to about 30 reporters.", "4.", "The National Union of Journalists says it stands strongly behind the journalists and does not rule out a strike.", "5.", "Managers have torn up agreed procedures and kicked staff in the teeth by sacking people to pay for printing facilities, according to Jeremy Dear, NUJ General Secretary.", "6.", "The National Union of Journalists said it stood strongly against the journalists and did not rule out a strike.", "7.", "The two Telegraph titles currently employ 521 journalists - some broadsheet newspapers - have suffered circulation declines, which are hitting revenues.", "The Telegraph has announced no plans to go tabloid although both The Independent and The Times have seen circulation rise since shrinking in size.", "8.", "The Guardian is hedging its bets, planning a larger tabloid format like those popular in continental Europe.", "The Telegraph Group was bought by the Barclay twins - Frederick and David - last year, having previously been owned by Lord Conrad Black's Hollinger International.", "The brothers are currently mulling the sale of another of their businesses, retailer Littlewoods.", "9.", "Telegraph executive Murdoch MacLennan said the two newspapers would add eight colour pages in the coming months.", "10.", "\"Journalists are the lifeblood of any newspaper, and maintaining the quality of The Daily Telegraph and The Sunday Telegraph for our readers is vital,\" he said.", "\"However, action to improve our production capability and secure our titles against the competition is also vital.\"", "Many newspapers are investing in new printing machinery that enables them to print more colour pages, or in some cases, have colour on every page.", "They are hoping that by boosting colour it will make their publications more attractive to advertisers and readers alike.", "In recent months News Corp's News International unit, which publishes The Sun and the News of the World, the Guardian Media Group, Trinity Mirror and the Daily Mail & General Trust have all announced substantial investments in new printing plants."], "deepseek-r1:1.5b": ["The Daily and Sunday Telegraph newspapers are axing 90 journalist jobs, which amounts to 17% of their editorial staff.", "This news is part of a larger announcement regarding funding for new printing facilities costing £150 million.", "Journalists recently met at a meeting held on Friday afternoon to address the surprise announcement.", "The management has ignored the 90-day consultation period required for companies planning more than 10 redundancies and showed a complete disregard for member rights.", "Pearson's Financial Times offered voluntary redundancy to about 30 reporters last week.", "The National Union of Journalists strongly supports journalists and does not rule out a strike, while criticizing managers who tore up procedures to pay for printing facilities.", "The Two Daily newspapers currently employ 521 journalists.", "Some broadsheet newspapers, particularly those adapting to tabloid formats, face declining circulation which impacts revenues.", "The Guardian is planning a larger tabloid format similar to that popular in Europe.", "The Telegraph Group was bought by the Barclay twins last year, previously owned by Lord Conrad Black's Hollinger International.", "They are currently considering selling another business, Littlewoods.", "The manager, Murdoch MacLennan, noted that the Two Daily newspapers would add eight color pages in the future and emphasize the importance of maintaining quality to readers while investing in printing machinery for more color pages to attract advertisers and readers."], "tinyllama:1.1b": ["The Daily and Sunday Telegraph newspaper group has axed 90 journalist jobs out of a total editorial staff of over 521, 17% of whom are employed at the company's two titles - The Daily Telegraph and The Sunday Telegraph.", "The cuts are being made to fund an investment in new printing facilities.", "In response to fierce competition for readers and sluggish advertising revenues amid online advertising competition, the National Union of Journalists has called on management to recall voluntary redundancy notices or face a strike ballot.", "The company's Financia Times newspaper said it was also offering voluntary redundancies.", "In the meantime, publisher Barclay Twins is considering selling off two of its businesses - retailer Litllewoods and media outfit Hollinger International - to fund investment in new printing facilities.", "Despite the cuts, the Telegraph Group is reportedly mulled a larger tabloid format after losing two newspaper titles to rival Barclay Twins.", "The Daily Telegraph and The Sunday Telegraph have seen circulation declines since shrinking in size.", "News Corp's News International unit also announced significant investments in new printing plants."], "tinydolphin:1.1b": [" Telegraph newspapers axe 90 journalists, with some redundancies expected to fund £150m investment in new printing facilities.", "The cuts will affect a large proportion of their editorial staff, with one journalist writing that this decision represents \"a crushing blow\" and adds to the \"nature of the beast\" faced by journalists.", "The move comes amid fierce competition for readers and slow growth in print advertising revenues.", "The National Union of Journalists has called on the management of Telegraph Group to recall its notice of redundancy or face a strike ballot.", "The decision is seen as an attempt by the company to recover from the impact of the pandemic.", "Pearson's Financial Times announced plans for voluntary redundancy, with around 30 journalists being offered options to stay with the paper or consider other job opportunities.", "NUJ General Secretary Jeremy Dear called on management to reconsider the decision, saying it would \"kick some staff in the teeth.\"", "The National Union of Journalists (NUJ) expressed its support for the journalists affected and stated that they would not rule out a strike in response to the redundancies.", "The move comes amid growing consolidation in the industry, as several media groups are investing heavily in new printing facilities to improve production capabilities and attract more advertising revenue.", "News Corporation's News International unit is leading this trend with recent announcements of substantial investments in both The Sun and the News of the World, while Rupert Murdoch's Australian media group, News Corp, has also committed to significant expansion in print production facilities."], "phi:2.7b": [" The Telegraph Group is axing 90 journalist jobs to invest in new printing facilities for its two newspapers.", "This comes as competition from online advertising and sluggish revenues are affecting other newspapers.", "The National Union of Journalists has called on the company to recall the redundancy notices, and there may be a strike ballot if they do not."], "orca-mini:3b": [" The Daily and Sunday Telegraph newspapers are reducing their editorial staff by 17% or 90 jobs.", "This is happening due to a need to fund an £150m investment in new printing facilities.", "Pearson's Financial Times and The Guardian have also announced similar cuts to their reporters.", "The two Telegraph titles currently employ 521 journalists.", "Managers have ignored consultative rights and sacked people to pay for printing facilities, and the company plans to observe consultation procedures.", "The Guardian is considering a larger tabloid format like those popular in continental Europe."], "hermes3:3b": ["Telegraph newspapers cut 90 journalist jobs to fund £150m investment in printing facilities."], "stablelm-zephyr:3b": ["The Daily and Sunday Telegraph newspapers are cutting 90 journalist jobs, or 17% of their editorial staff, to fund an £150m investment in new printing facilities.", "This move comes amidst fierce competition for readers and sluggish advertising revenues, prompting the National Union of Journalists to call for management to recall the notice of redundancy by midday on Monday or face a strike ballot.", "The Telegraph Group stated that maintaining the quality of their publications is vital but action to improve production capability and secure titles against competition is also essential."], "stablelm2:1.6b": ["The Daily and Sunday Telegraph newspapers are cutting journalist jobs by 25% of their staff due to funding an £8m investment in new printing facilities.", "The National Union of Journalists is calling on management to recall the notice of redundancy as soon as possible or face a strike ballot.", "Meanwhile, Pearson's Financial Times offered voluntary redundancy to reporters and some broadsheet newspapers have suffered circulation declines.", "The Telegraph Group was bought by the Barclay twins last year but now plans to add eight color pages in the coming months."], "granite3.1-dense:2b": ["The Telegraph Group plans to cut 90 journalist jobs (17% of its editorial staff) to fund an £150m investment in new printing facilities, reflecting fierce competition and sluggish advertising revenues due to online competition.", "Journalists met on Friday to discuss the surprise announcement.", "The National Union of Journalists has threatened a strike if the redundancy notices are not withdrawn by midday Monday.", "This move follows similar actions by Pearson's Financial Times, which offered voluntary redundancies to about 30 reporters.", "The Telegraph Group, recently acquired by the Barclay twins, is adding eight color pages to its titles and plans no tabloid conversion.", "Other newspapers, like The Guardian and those owned by News Corp and Trinity Mirror, are also investing in more color printing to enhance their appeal to advertisers and readers."], "chatgpt-4o-latest": ["The Daily and Sunday Telegraph are cutting 90 journalist jobs (17% of editorial staff) to fund a £150m investment in new printing facilities.", "The decision comes amid competition for readers and declining ad revenues.", "The National Union of Journalists (NUJ) has condemned the move, accusing management of bypassing consultation procedures and threatening strike action.", "Other newspapers, including the Financial Times, have also announced job cuts.", "The Telegraph, owned by the Barclay twins, has no plans to go tabloid but will add more colour pages to attract advertisers and readers.", "Many newspapers are investing in new printing technology to stay competitive."]}