{"raw_text": "Air passengers win new EU rights\n \n Air passengers who are unable to board their flights because of overbooking, cancellations or flight delays can now demand greater compensation.\n \n New EU rules set compensation at between 250 euros (£173) and 600 euros, depending on the length of the flight. The new rules will apply to all scheduled and charter flights, including budget airlines. Airlines have attacked the legislation saying they could be forced to push prices higher to cover the extra cost. The European Commission is facing two legal challenges - one from the European Low-fare Airlines Association (ELAA) and the other from the International Air Transport Association (IATA), which has attacked the package as a \"bad piece of legislation\". Previously, passengers could claim between 150 euros and 300 euros if they had been stopped from boarding.\n \n However, only scheduled flight operators were obliged to offer compensation in cases of overbooking and they did not have to offer compensation for flight cancellations.\n \n The EU decided to increase passenger compensation in a bid to deter airlines from deliberately overbooking flights. Overbooking can often lead to 'bumping' - when a passenger is moved to a later flight. When this happens against a passenger's will, airlines will now have to offer compensation. In addition, if a flight is cancelled or delayed for more than two hours through the fault of the airline, all passengers must be paid compensation.\n \n However, airlines do not have to offer compensation if flights are cancelled or delayed due to \"extraordinary circumstances\". Airlines fear that \"extraordinary circumstances\" may not include bad weather, security alerts or strikes - events which are outside of their control. All EU-based airlines and operators of flights which take off from the EU will have to adhere to the new compensation regime which came into force on Thursday. Low-cost airlines have criticised the new compensation levels, arguing that the pay-out could be worth more than the ticket. \"It's a preposterous piece of legislation, we among all airlines are fighting this,\" Ryanair deputy chief executive Michael Cawley told Radio 4's Today programme.\n \n The European Regions Airline Association (ERAA) claims that neither airlines nor consumers were consulted over the changes. Andy Clarke, ERAA director of air transport, said that the EC advice misleads customers as it leads them to believe that airlines could be liable for payouts if flights are delayed because of bad weather.\n \n EC spokeswoman Marja Quillinan-Meiland conceded there were \"grey areas\" but said \"these are not as big as the airlines are making out\". In cases of dispute, national enforcement bodies would decide whether the passenger had a case, she said. New technology means it is easier for airlines to take off and land in bad weather, she added. The ERAA's Mr Clarke also warned that while airlines would comply with the new rules, the extra costs would be passed onto passengers. \"We reckon it's going to cost European air passengers - not the airlines, the airlines have no money, it has to be paid by passengers - 1.5bn euros, that's over £1bn a year loaded onto European passengers,\" Mr Clarke said. \"That's basically a transfer of money from passengers whose journeys are not disrupted to passengers whose journeys are disrupted.\"\n \n On Wednesday, Jacques Barrot, vice president of the European Commission and also Commissioner for Transport, said that the changes were necessary. \"The boom in air travel needs to be accompanied by proper protection of passengers' right.\" \"This is a concrete example of how the Union benefits people's daily lives,\" he added. The EC has launched an information campaign in airports and travel agencies to inform airline passengers of their new rights.\n", "llama3.2:1b": ["Air passengers who experience overbooking, cancellations, or flight delays can now claim up to 600 euros (around £173) in compensation from airlines.", "The European Commission is considering two legal challenges against the new rules, which apply to scheduled and charter flights, including budget airlines.", "Airlines have criticized the regulations, arguing that they could lead to increased costs for passengers."], "llama3.2:3b": ["Air passengers can now demand compensation for overbooking, cancellations, or flight delays, with amounts ranging from £173 to £600 depending on the flight length.", "Airlines may be forced to increase prices due to the new rules.", "The European Commission is facing legal challenges, and some airlines have criticized the package as a \"bad piece of legislation\"."], "gemma2:2b": ["New EU rules mandate compensation for passengers denied boarding due to overbooking, cancellations, or delays.", "Compensation ranges from €250 to €600 depending on flight length.", "Airlines are objecting to the cost impact on prices and the definition of \"extraordinary circumstances\".", "The new regulations affect all scheduled and charter flights including low-cost carriers.", "Passenger rights were expanded to include compensation for canceled flights, with airlines required to pay compensation if a flight is delayed for more than two hours due to their fault.", "Airlines fear the definition of \"extraordinary circumstances\" may be too narrow, limiting their ability to avoid compensation in situations beyond their control such as bad weather or security alerts.", "Airlines will comply but passengers are expected to bear the additional cost, estimated at €1.5 billion annually.", "The European Commission launched an information campaign about these new rights for airline passengers."], "qwen2.5:0.5b": ["Air passengers can demand greater compensation for overbooking, cancellations or flight delays due to EU regulations that will apply to all scheduled and charter flights.", "New rules set compensation at between 250 euros and 600 euros depending on the length of the flight.", "The EC is facing two legal challenges - from the European Low-fare Airlines Association (ELAA) and the International Air Transport Association (IATA).", "EU airlines are expected to change their procedures, with no guarantee that passengers will receive a payout if flights are cancelled or delayed due to \"extraordinary circumstances\"."], "qwen2.5:1.5b": ["Passengers can now demand up to €600 in compensation if overbooked, delayed, or bumped on EU flights due to poor weather or other causes outside the passenger's control.", "Airlines oppose stricter rules.", "The new EU regulations go into effect April 15th and apply to scheduled and charter flights with low-cost airlines."], "qwen2.5:3b": ["Air passengers can now demand greater compensation if they are unable to board flights due to overbooking, cancellations or delays under new EU rules set at between 250 euros (£173) and 600 euros, depending on flight length.", "Previously, the compensation range was from 150 to 300 euros.", "Airlines have criticized the legislation, fearing it could lead to higher prices due to additional costs.", "The new rules apply to all scheduled and charter flights, including budget airlines.", "Compensation is now mandatory for overbookings and delays of more than two hours, but not for cancellations or extraordinary circumstances like bad weather.", "Low-cost airlines such as Ryanair have criticized the compensation levels, arguing they could be worth more than the ticket price.", "The European Commission has launched an information campaign to inform passengers about their new rights."], "opencoder:1.5b": ["Air passengers now demand greater compensation for overbooking, cancellations or delays.", "The EU increased passenger compensation in a bid to deter airlines from deliberately overbooking flights.", "Passengers who are stopped from boarding due to overbooking will now have to offer compensation.", "Flight cancellations and extraordinary circumstances can still lead to \"extraordinary circumstances\" like bad weather, security alerts, or strikes - events that are outside of their control.", "All EU-based airlines and operators of flights which take off from the EU will adhere to the new compensation regime which came into force on Thursday.", "Low-cost airlines have criticized the new compensation levels, arguing that the payout could be worth more than the ticket.", "The European Regions Airline Association (ERAA) argues neither airlines nor consumers were consulted over the changes.", "Andy Clarke, ERAA director of air transport, added that while airlines would comply with the new rules, the extra costs would be passed onto passengers.", "A discrepancy between airline policies and passenger expectations has led to a \"preposterous piece of legislation\" which is now upheld by airlines and consumers.", "In case of disputes, national enforcement bodies would decide whether the passenger had a case, she also added that while airlines would comply with the new rules, the extra costs would be passed onto passengers.", "A lack of clear-cut regulations can lead to confusion for passengers and airlines alike.", "This includes but is not limited to changes in regulations, missteps in airline operations, or fraudulent cancellations.", "The ECB has launched a campaign in airports and travel agencies to inform airline passengers of their new rights.", "The EU's commitment to reducing airline fraud and maintaining fair competition is reflected in this response."], "smollm:1.7b": ["Air passengers who are unable to board their flights because of overbooking, cancellations or flight delays can now demand greater compensation.", "New EU rules set compensation at between 250 euros (£173) and 600 euros, depending on the length of the flight.", "The new rules will apply to all scheduled and charter flights, including budget airlines.", "Airlines have attacked the legislation saying they could be forced to push prices higher to cover the extra cost.", "The European Commission is facing two legal challenges - one from the European Low-fare Airlines Association (ELAA) and the other from the International Air Transport Association (IATA), which has attacked the package as a \"bad piece of legislation\".", "Previously, passengers could claim between 150 euros and 300 euros if they had been stopped from boarding.", "The EU decided to increase passenger compensation in a bid to deter airlines from deliberately overbooking flights.", "Overbooking can often lead to 'bumping' - when a passenger is moved to a later flight.", "When this happens against a passenger's will, airlines will now have to offer compensation.", "In addition, if a flight is cancelled or delayed due to \"extraordinary circumstances\", all passengers must be paid compensation.", "However, airlines do not have to offer compensation if the delay is caused by bad weather, security alerts or strikes - events which are outside of their control.", "All EU-based airlines and operators of flights which take off from the EU will have to adhere to the new compensation regime which came into force on Thursday.", "Low-cost airlines have criticized the new compensation levels, arguing that the pay-out could be worth more than the ticket.", "\"It's a preposterous piece of legislation, we among all airlines are fighting this,\" Ryanair deputy chief executive Michael Cawley told Radio 4's Today programme.", "The European Regions Airline Association (ERAA) claims that neither airlines nor consumers were consulted over the changes.", "In cases of dispute, national enforcement bodies would decide whether the passenger has a case.", "New technology means it is easier for airlines to take off and land in bad weather, but the extra costs will be passed onto passengers.", "The ERAA's Mr Clarke also warned that while airlines would comply with the new rules, the extra costs would be passed onto passengers whose journeys are not disrupted.", "\"We reckon it's going to cost European air passengers - not the airlines, the airlines have no money, it has to be paid by passengers' daily lives,\" he added.", "The EC has launched an information campaign in airports and travel agencies to inform airline passengers of their new rights."], "deepseek-r1:1.5b": ["Air passengers now demand increased compensation from airlines who were affected by overbooking, cancellations, or delays.", "The new EU rules set the range between 250-600 euros per flight, depending on length.", "Low-cost airlines are pushing for higher prices, while others argue it may be a misstep.", "Only scheduled flights require compensation during overbooking but not canceled ones.", "The EC acknowledged \"grey areas\" but said they aren't as big.", "Extraordinary circumstances like bad weather make compensation more likely.", "Consumers might worry extra costs, especially non-disrupted flights.", "The EU plans to launch an campaign to inform passengers of their rights under the new rules."], "tinyllama:1.1b": ["In response to the EU Commission launching new compensation rules for European air passengers whose flights were cancelled or delayed due to \"extraordinary circumstances,\" airlines face increased costs for compensating affected travelers, with the government arguing that the pay-outs will not exceed the ticket price.", "Critics argue that the compensation levels are too low and suggest a higher allowance in cases of deliberate overbooking.", "The EC also noted that new technology can make it easier for airlines to take off and land in bad weather, but warned that this would mean extra costs for European passengers.", "The EU has launched an information campaign to educate passengers about their rights, including the option to claim compensation or receive a refund if they are refused boarding or forced to cancel their flight due to \"extraordinary circumstances.\""], "tinydolphin:1.1b": [" The European Union (EU) has updated flight passenger compensation rules, setting minimum compensation levels for overbooking, cancellations, and delay.", "These changes will take effect on Thursday, 13th March.", "This decision was prompted by the ELAA and IATA legal challenges to the previous set of compensation limits imposed in April 2016.", "The new rules aim to protect passengers when airlines deliberately overbook flights, disrupting their travel plans.", "The minimum compensation amount will increase from 150 euros ($173) to between €173 and €600 for single journeys and €273 and €800 for round trips.", "Passengers booked on non-refundable tickets are not eligible for compensation.", "The changes will apply to all scheduled and charter flights, except those operated by low-cost airlines (LCAOs) or companies based in the EU.", "However, LCAOs and certain non-EU airlines may be exempted from the new rules.", "The European Commission has introduced these compensation changes following a legal challenge by ELAA, which represents scheduled and charter airlines.", "The challenge is backed by the International Air Transport Association (IATA), which has accused the EU of \"bad piece of legislation\" and urged for increased compensation payments to be made.", "The new compensation rules will be enforced by national enforcement bodies, with the European Court of Justice expected to assess their compliance with EC regulations.", "Airlines have expressed concerns that \"extraordinary circumstances\", such as bad weather, may not be considered by default.", "If flights are cancelled or delayed due to these conditions, passengers must be paid compensation.", "The EU's decision to increase passenger compensation rights has been praised by European transport experts and advocacy groups.", "However, the new rules have led to concerns that airlines may struggle to offset the additional costs incurred by passengers.", "Airlines often do not have the funds to cover these costs, while passengers are facing higher ticket prices as a result of the new compensation regime.", "This could lead to further disparities between passengers who are entitled to more compensation and those who are not."], "phi:2.7b": [" EU introduces new rules for air passenger compensation, increasing it from £173 to £600 depending on flight duration.", "Airlines can be forced to push prices higher due to extra costs.", "ELAA and IATA are challenging the law.", "Overbooking can now lead to greater compensation.", "Low-cost airlines believe the pay-out may be worth more than the ticket.", "National enforcement bodies will decide compensation disputes, but grey areas exist in cases of bad weather delays.", "The EC insists passengers benefit from new rules and there is no extra cost for them."], "orca-mini:3b": [" New EU rules require airlines to compensate passengers for overbooking, cancellations, and flight delays.", "Passengers who are unable to board their flights due to these issues can now demand compensation ranging from 250 euros to 600 euros, depending on the length of the flight.", "The rules apply to all scheduled and charter flights, including budget airlines.", "Airlines have criticized the legislation, arguing that it could push prices higher and force them to pay out more than they expect.", "However, only scheduled flight operators are obliged to offer compensation in cases of overbooking and flight cancellations, and they do not have to compensate for cancellation due to extraordinary circumstances.", "The EC has launched an information campaign in airports and travel agencies to inform airline passengers of their new rights."], "hermes3:3b": ["New EU rules grant air passengers compensation for overbooking, cancellations or delays, ranging from 250 to 600 euros depending on flight length."], "stablelm-zephyr:3b": ["New EU rules increase air passenger compensation between 250-€600 euros, depending on flight length, for overbooking, cancellations, or delays exceeding two hours due to airline fault.", "This applies to all scheduled and charter flights, including budget airlines.", "Airlines argue that they may need to raise prices to cover extra costs.", "The European Commission faces legal challenges from the European Low-Fare Airlines Association (ELAA) and the International Air Transport Association (IATA).", "Previously, passengers could only claim between 150-€300 euros for being denied boarding."], "stablelm2:1.6b": ["Air passengers win new EU compensation rights, with up to €10,0 H€uro compensation for flights delayed by more than 2 hours, or between €5,000 and €8,000 for cancellations.", "Previously, only scheduled flight operators were obliged to offer compensation; now, all airlines must do so in cases of overbooking, bumping, and cancelled or delayed flights due to extraordinary circumstances.", "The European Commission has faced legal challenges regarding the new rules from the International Air Transport Association (IATA) and the European Low-Fare Airlines Association (ELAA), but these have been rejected by the courts."], "granite3.1-dense:2b": ["New EU regulations set compensation for stranded air passengers at between 250 euros (£173) and 600 euros, depending on flight duration.", "These rules apply to both scheduled and charter flights, including budget airlines.", "Previously, compensation was capped at 150-300 euros for denied boarding due to overbooking or cancellations/delays exceeding two hours.", "The EU introduced these stricter penalties to discourage airlines from intentionally overbooking flights, which often leads to 'bumping.'", "Airlines, such as Ryanair and the European Regions Airline Association (ERAA), argue that the new compensation levels are excessive and could result in higher ticket prices for passengers.", "The ERAA warns of a potential 1.5 billion euro annual cost for European air passengers due to increased expenses borne by airlines, which they claim will be passed onto travelers.", "The European Commission is facing legal challenges from the European Low-fare Airlines Association (ELAA) and the International Air Transport Association (IATA), who consider the legislation unfavorable.", "Despite these objections, the EC maintains that these measures are crucial to protect passengers' rights in the context of growing air travel, emphasizing that they enhance people's daily lives.", "The commission has launched an information campaign to inform passengers about their new entitlements."], "chatgpt-4o-latest": ["Air passengers in the EU now have greater rights to compensation for overbooked, cancelled, or delayed flights under new regulations.", "Compensation ranges from 250 to 600 euros depending on flight length and applies to all airlines, including budget carriers.", "Previously, only scheduled flights had to compensate for overbooking, and cancellations were not covered.", "The rules aim to deter airlines from overbooking, requiring compensation for involuntary 'bumping' and delays over two hours caused by the airline.", "However, airlines are exempt from paying if delays or cancellations result from \"extraordinary circumstances,\" though there is debate over what qualifies.", "Airlines, particularly low-cost carriers, criticize the legislation, arguing it could lead to higher ticket prices and legal challenges have been filed.", "The European Commission defends the changes as necessary for passenger protection and has launched an information campaign to raise awareness."]}