{"raw_text": "Call centre users 'lose patience'\n \n Customers trying to get through to call centres are getting impatient and quicker to hang up, a survey suggests.\n \n Once past the welcome message, callers on average hang up after just 65 seconds of listening to canned music. The drop in patience comes as the number of calls to call centres is growing at a rate of 20% every year. \"Customers are getting used to the idea of an 'always available' society,\" says Cara Diemont of IT firm Dimension Data, which commissioned the survey. However, call centres also saw a sharp increase of customers simply abandoning calls, she says, from just over 5% in 2003 to a record 13.3% during last year. When automated phone message systems are taken out of the equation, where customers have to pick their way through multiple options and messages, the number of abandoned calls is even higher - a sixth of all callers give up rather than wait. One possible reason for the lack in patience, Ms Diemont says, is the fact that more customers are calling 'on the move' using their mobile phones.\n \n The surge in customers trying to get through to call centres is also a reflection of the centres' growing range of tasks. \"Once a call centre may have looked after mortgages, now its agents may also be responsible for credit cards, insurance and current accounts,\" Ms Diemont says. Problems are occurring because increased responsibility is not going hand-in-hand with more training, the survey found.\n \n In what Dimension Data calls an \"alarming development\", the average induction time for a call centre worker fell last year from 36 to just 21 days, leaving \"agents not equipped to deal with customers\". This, Ms Diemont warns, is \"scary\" and not good for the bottom line either. Poor training frustrates both call centre workers and customers. As a result, call centres have a high \"churn rate\", with nearly a quarter of workers throwing in the towel every year, which in turn forces companies to pay for training new staff. Resolution rates - the number of calls where a customer's query is resolved to mutual satisfaction - are running at just 50%. When the query is passed on to a second or third person - a specialist or manager - rates rise to about 70%, but that is still well below the industry target of an 85% resolution rate.\n \n Suggestions that \"outsourcing\" - relocating call centres to low-cost countries like India or South Africa - is to blame are wrong, Ms Diemont says.\n \n There are \"no big differences in wait time and call resolution\" between call centres based in Europe or North America and those in developing countries around the world. \"You can make call centres perform anywhere if you have good management and the right processes in place,\" she says. However, companies that decide to \"offshore\" their operations are driven not just by cost considerations. Only 42% of them say that saving money is the main consideration when closing domestic call centre operations. Half of them argue that workers in other countries offer better skills for the money. But not everybody believes that outsourcing and offshoring are the solution. Nearly two-thirds of all firms polled for the survey have no plans to offshore their call centres. They give three key reasons for not making the move:\n \n - call centre operations are part of their business \"core function\", \n  - they are worried about the risk of going abroad, \n  - they fear that they will damage their brand if they join the offshoring drive. The survey was conducted by Sunovate on behalf of Dimension Data, and is based on in-depth questionnaires of 166 call centres in 24 countries and five continents. What are your experiences with call centres? Are you happy to listen to Vivaldi or Greensleeves, or do you want an immediate response? And if you work in a call centre: did your training prepare you for your job?\n", "llama3.2:1b": ["Customers are getting impatient when trying to get through to call centers, with many hanging up after just 65 seconds of listening to canned music.", "The number of calls is growing at 20% per year, but customers are also abandoning calls due to difficulties navigating multiple options and messages.", "Call center agents may not be adequately trained due to insufficient induction time (average 21 days), resulting in poor customer satisfaction and a high churn rate.", "Companies that offshore call centers often prioritize cost savings over human skills or the potential damage to their brand reputation."], "llama3.2:3b": ["Customers are getting impatient with call centres, hanging up after 65 seconds on average.", "This comes as the number of calls increases by 20% annually and customers are abandoning calls more frequently, especially when automated systems are removed.", "Poor training is a major issue, leading to high \"churn rates\" and low resolution rates, with nearly a quarter of workers quitting every year and only 50% of queries being resolved to mutual satisfaction.", "Outsourcing to other countries is not the primary reason for these issues, as wait times and call resolution rates are similar between European/North American and developing country-based centres."], "gemma2:2b": ["Customers are increasingly impatient with call centers, leading to higher abandonment rates.", "Factors contributing to this include the growing range of tasks handled by call center agents and limited training opportunities.", "Poor training results in frustration amongst both employees and customers, leading to a high turnover rate and low resolution rates for customer inquiries.", "While outsourcing is often suggested as a solution, the survey shows no significant differences in wait times or resolution rates between developed and developing countries.", "Most companies are not offshoring their call centers due to concerns about core function, risk of leaving, and potential damage to brand reputation."], "qwen2.5:0.5b": ["Call centres users experience impatient callers, hang up quickly after 65-second message listening time and abandon calls due to fewer options and messages.", "The number of customers switching to automated phone systems is increasing but this has not translated into more patience from call centre employees.", "Issues are caused by increased responsibility and lack of training, leading to a high \"churn rate\" and low resolution rates in call centres.", "Outsourcing call centers to lower cost countries may be a solution but it requires good management processes and skills, and three major reasons do not outweigh the benefits when compared with traditional on-site operations.", "Call centre users' experiences: 1) impatient callers (average hang-up time of about 65 seconds) due to canned music; 2) abandon calls (due to fewer options and messages); 3) call center operators are frustrated by increased responsibility leading to poor training, \"churn rate\" and low resolution rates."], "qwen2.5:1.5b": ["### Summary\n\nCustomer patience in UK call centers declines, forcing employees and companies to adapt as call center volume increases and tasks expand.", "Poor management and inadequate training contribute to high employee turnover and poor service quality despite growing responsibilities and mobile-based calls.", "Call centers are more efficient abroad but remain challenging to manage due to cultural and language differences."], "qwen2.5:3b": ["Call centre users are losing patience, hanging up after just 65 seconds of listening to canned music.", "The number of calls is increasing at a rate of 20% annually and customers are abandoning calls more often due to multiple options in automated message systems.", "Patience issues stem from mobile phone usage and increased responsibilities within call centres.", "Training for new agents has declined, with induction periods now averaging just 21 days.", "This leads to high \"churn\" rates, where nearly a quarter of workers leave annually, forcing companies to retrain new staff.", "Resolution rates are at 50%, improving slightly when transferred to specialists or managers (around 70%).", "Outsourcing call centres is not the solution, as wait times and resolutions vary between countries.", "Nearly two-thirds of surveyed businesses do not plan to offshore their operations due to concerns about business continuity, potential brand damage, or inadequate skill sets in other countries."], "opencoder:1.5b": ["This is the summary of the given text:\n\nCall centre users are getting impatient and quicker to hang up on average.", "The drop in patience comes from increasing calls to call centres, where the rate is growing at a rate of 20% every year.", "As per the survey conducted by Dimension Data, customers find it hard to get through to call centers.", "The increase in customers is due to increased responsibility as they are calling 'on the move'.", "With more tasks, customers are abandoning calls, which is leading to a sharp increase in churn rate of around 13%.", "The development caused by increasing call centre operations is causing companies to pay for training new staff.", "The average induction time for workers is falling from 36 days to 21 days.", "Calling out to customers about their difficulty in getting through to call centres, the survey points towards not making this move due to concerns over risk of going abroad and damaging the company's brand image.", "In terms of management and cost considerations, companies that decide to offshore have found ways to improve operations.", "The high resolution rates suggest that even if the queries are resolved successfully, they offer better skills for the money.", "It’s also worth noting that companies with a 'core function' might be more comfortable with these operations.", "In terms of job security, the survey suggests outsourcing would lead to higher job losses for companies due to increased responsibilities and higher cost of offshoring.", "As a result, companies need to make a decision on whether or not they should offshore their call centre operations."], "smollm:1.7b": ["Summarize the text concisely by highlighting key ideas and details.", "The main idea of the text is that customers are getting impatient when trying to get through call centres, which leads to longer wait times and more abandoned calls.", "This trend is attributed to the increasing number of tasks being handled by call centre workers, as well as the lack of training for new staff.", "Other factors contributing to this problem include outsourcing and offshoring call centre operations."], "deepseek-r1:1.5b": ["call centres are facing significant challenges in meeting customer expectations.", "callers have been reported as becoming impatient due to short hangup times after the welcome message, which average around 65 seconds before being dropped by most.", "Once past the welcome message, only a small percentage of callers drop off within a minute or two.", "Customer abandonments have surged by 20% annually, reaching 14% in 2023 from just over 5% in 2003.", "The rise in abandonments is partly due to increased responsibility without corresponding training.", "Additionally, when automated phone message systems are unavailable, the number of abandoned calls rises to six out of ten callers giving up or being turned away instead of hanging up.", "Careers Data highlights that 62% of call center customers were from mobile users, emphasizing the need for more skilled and versatile agents.", "This suggests that traditional call centers may not be equipped to handle diverse clients effectively.", "The survey indicates that call centers are part of their core function, with customer abandonments rising by nearly three-quarters when closing domestic operations.", "Training remains a critical issue, leading to high churn rates (25%) and resolution rates averaging 50%.", "When queries reach specialists or managers, resolution rates rise to around 70%, well below the industry target of 85%.", "The text warns that outsourcing is not a viable solution, with resistance from companies prioritizing cost savings over quality.", "Callers are wary of cultural differences and potential brand damage by joining offshoring initiatives.", "Overall, call centers face overwhelmed service issues, high abandonments, and training challenges, indicating a need for rethinking approaches to retain customers and reduce costs."], "tinyllama:1.1b": ["The online survey conducted by IT firm Dimension Data found that customers are losing their patience and quickness to hang up calls to call centres, with some losing their patience after just 65 seconds of listening to music.", "The number of abandoned calls has increased from 13.3% in 2003 to a record 20% during the last year, as customer preferences for automated phone systems are increasing and call centres have become more complex due to the increasing range of tasks.", "Customers are losing patience with call centres' growing number of responsibilities and the lack of proper training for agents, with low resolution rates and high churn rates being the main issues that call centre workers face.", "Outsourcing is not considered a solution for companies as it drives costs down but may impact brand damage if done without careful consideration.", "Customers are willing to listen to voice-only or immediate responses, with training preparation not being enough to cater to their needs."], "tinydolphin:1.1b": [" The text provides information about the current state of call center operations.", "It mentions drop-in patience, automated phone message systems, and high churn rates among both call center workers and customers.", "The author suggests that outsourcing might not be the best solution to handle these issues.", "They also provide reasons for the lack of efficiency in call center operations and suggest that companies should weigh the pros and cons before deciding on whether to offshore or keep their call centers within their own borders."], "phi:2.7b": [" Customers trying to get through to call centers are getting impatient and quicker to hang up.", "Once past the welcome message, callers on average hang up after just 65 seconds of listening to canned music.", "The drop in patience comes as the number of calls to call centres is growing at a rate of 20% every year.", "One possible reason for the lack in patience, Ms Diemont says, is the fact that more customers are calling 'on the move' using their mobile phones."], "orca-mini:3b": [" Call centre users are losing patience due to longer wait times and higher abandon rates.", "The number of calls to call centres is growing at a rate of 20% per year, and more customers are simply abandoning calls.", "Poor training is causing problems for both call centre workers and customers.", "Despite the growing range of tasks, call centre induction times have fallen, and nearly a quarter of workers quit each year.", "Resolution rates are running at just 50%, and companies that offshore their operations are driven by cost considerations rather than skills.", "Call centre operations are considered part of a company's \"core function,\" and most firms have no plans to offshore their call centres."], "hermes3:3b": ["Call centre users becoming impatient, hanging up after 65s listening canned music; increased calls & abandoned calls due to growing tasks & inadequate training."], "stablelm-zephyr:3b": ["A survey reveals that customers are losing patience when trying to get through to call centres, with average hang-up times at 65 seconds after pasting the welcome message.", "The number of abandoned calls has increased from 5% in 2003 to a record 13.3% during last year.", "One reason for this decline is the rise in mobile phone usage and the growing range of tasks that call centres are expected to handle, which isn't always accompanied by adequate training for increased responsibility.", "Suggestions that outsourcing to low-cost countries is the answer are debunked, with no significant differences found between call centres based in Europe or North America versus those in developing nations."], "stablelm2:1.6b": ["Customers are becoming impatient when trying to reach call centers due to automated message systems.", "Around 1% of calls result in abandonment, up from just over 5% in 3%.", "Reasons cited include increased complexity in customer interactions and lack of training.", "Despite the growth of call center tasks, poor training frustrates staff and results in a high churn rate (nearly a quarter of workers leave annually).", "Companies should focus on good management and right processes to improve performance.", "Offshoring is not an effective solution; outsourcing to developing countries offers no major differences in wait time or call resolution.", "The survey was conducted by Sunovate for Dimension Data with representative data from 23 countries and five continents."], "granite3.1-dense:2b": ["Customers attempting to contact call centres exhibit decreasing patience, with 65 seconds of canned music being the average duration before they hang up.", "The survey indicates that the number of calls has risen by 20% annually, and a record 13.3% of customers abandoned calls last year, compared to just 5% in 2003.", "This impatience is attributed to factors like increased call volume due to expanded service offerings (e.g., credit cards, insurance) and more customers using mobile phones while on the move.", "Poor training of call centre agents, which has shrunk from 36 days to 21 days last year, contributes to this issue, leaving workers unprepared to handle customer inquiries effectively.", "This results in a 50% resolution rate and a high \"churn rate\" of nearly a quarter of staff annually.", "Experts warn that such poor performance is not good for businesses' bottom lines.", "Despite the negative trends, outsourcing to countries like India or South Africa does not appear to be the primary cause of these problems.", "Instead, factors like brand risk and maintaining core business operations prevent many companies from offshoring their call centres, with only 42% citing cost savings as a motivating factor.", "The remaining firms cite superior skills offered by international workers or concerns about damaging their brands when operating overseas as key reasons for not offshoring."], "chatgpt-4o-latest": ["Customers are becoming increasingly impatient with call centres, hanging up after just 65 seconds of waiting.", "The number of abandoned calls has risen sharply, reaching 13.3% in the past year, with even higher rates when automated systems are involved.", "A key factor is the rise in mobile phone usage, making callers less willing to wait.", "Call centres are handling more responsibilities, but training has declined, with induction times dropping from 36 to 21 days.", "Poor training leads to frustrated workers and customers, contributing to high staff turnover and low resolution rates, which stand at just 50%.", "Outsourcing to low-cost countries is not the main issue, as performance depends on management and processes rather than location.", "While some companies offshore for cost and skill advantages, most firms avoid it due to concerns about core business functions, risks, and brand reputation.", "The survey, conducted by Sunovate for Dimension Data, covered 166 call centres across 24 countries."]}