{"raw_text": "Rank 'set to sell off film unit'\n \n Leisure group Rank could unveil plans to demerge its film services unit and sell its media business, reports claim.\n \n Rank, formerly famous for the Carry On series, will expose the shake-up at the announcement of its results on Friday, the Sunday Telegraph reported. Advisors Goldman Sachs are understood to have valued its demerged Deluxe Film unit at £300m, the report added. Speculation of a possible shake-up has mounted since Rank announced a study into a possible demerger in September. Since Mike Smith's appointment as chief executive in 1999, the group has focused on fewer businesses and embarked on a major cost-cutting programme which has seen it dispose of a number of businesses, including the Odeon cinema chain and the Pinewood studios. The move left the group with three core divisions: gaming, Hard Rock and Deluxe Films, which provides technical services to Hollywood studios.\n \n Rank now aims to concentrate on its gaming, bars and hotels business, including extending its Hard Rock brand to its casinos - trials of which have been a success. It also owns Deluxe Media, which makes and distributes DVDs and videos. However, that business is seen as less successful. Last year it made profits of £21.5m on a turnover of £392.1m and experts suggest its success in moving to DVDs from VHS video could make it an attractive target for a private equity buyer. A spokesman for the firm refused to comment on the reports, but said any results from the demerger study were likely to be set out when it unveiled its results on Friday. Analysts predict the firm is likely to report a slight drop in annual pre-tax profits to £170m from £194m last year. Formed in the 1940s the firm was a leading UK film producer and cinema owner for many years. It has now diversified into a range of other leisure activities - mainly in the UK - including hotels, roadside service areas and holiday centres. It now owns 34 Grosvenor casinos, the Mecca Bingo chain and more than 100 Hard Rock Cafes in 38 countries.\n", "llama3.2:1b": ["Leisure group Rank is considering demerging its film services unit and selling its media business.", "Advisors Goldman Sachs have valued this unit at £300m.", "The company has been focusing on reducing costs since Mike Smith became chief executive in 1999, including disposing of the Odeon cinema chain and Pinewood studios.", "It now operates three main divisions: gaming, Hard Rock, and Deluxe Films, which provides technical services to Hollywood studios."], "llama3.2:3b": ["Rank is considering demerging its film services unit, Deluxe Films, which has been valued at £300m, to sell its media business.", "This move would focus on Rank's gaming, bars, and hotels business, including expanding the Hard Rock brand.", "Analysts predict a slight drop in annual profits."], "gemma2:2b": ["Rank may announce plans to demerge its film services unit and sell its media business.", "The move is reportedly valued at £300m by Goldman Sachs.", "The company aims to focus on its gaming, bars, and hotels business, potentially selling off its media division for a private equity buyer."], "qwen2.5:0.5b": ["Rank, the former film unit, is exploring a plan to sell its media business to finance future growth.", "The company, formerly famous for \"Carry On,\" announced it may demerge its film services and media units and sell its current businesses on Friday.", "Rank aims to concentrate on its gaming, bars, and hotels business, including expanding its Hard Rock brand to casinos.", "However, the Demerger Study by Goldman Sachs is expected to reveal potential future targets from the group's three core divisions: Gaming, Bars & Hotels, and Deluxe Films (formerly Deluxe Media).", "Experts predict it could be attractive for a private equity buyer due to its success moving to DVDs from VHS video videos.", "Formed in 1940s UK film production, Rank has since diversified into various leisure activities including hotels, roadside services, holiday centres, and casinos."], "qwen2.5:1.5b": ["Rank is considering splitting off its film unit to sell it privately, valued at £300 million by Goldman Sachs, following a recent study into a potential demerger that began in September.", "The company previously focused on gaming and bars/hotels but now plans to concentrate on these activities while also extending the Hard Rock brand internationally.", "Rank's media division is seen as less profitable compared to its DVD/video distribution business, which experts suggest could make it attractive for a private equity buyer after last year's successful transition from VHS to DVDs."], "qwen2.5:3b": ["Rank could demerge its film services unit and media business, potentially selling them for £300m.", "The move follows a focus on fewer businesses since CEO Mike Smith's appointment in 1999.", "Rank now focuses primarily on gaming, bars, hotels, and the Hard Rock brand.", "Its Deluxe Media division, which produces DVDs, may be an attractive target due to its success transitioning from VHS videos.", "Analysts predict annual pre-tax profits will drop slightly to £170m this year from £194m last year.", "Formerly a major UK film producer, Rank has diversified into other leisure activities globally."], "opencoder:1.5b": ["The leisure group Rank could unveil plans to demerge its film services unit and sell its media business, reports claim.", "The group, formerly famous for the Carry On series, has experienced a shake-up at the announcement of its results on Friday, a Sunday Telegraph report added.", "The firm is valued by Goldman Sachs as it disposed of a number of businesses including Odeon cinema chain and Pinewood studios.", "The move has led to three core divisions: gaming, Hard Rock and Deluxe Films, which focuses on technical services to Hollywood studios.", "Rank aims to concentrate on its gaming business, bars and hotels, and casinos - trials of which have been a success.", "It also owns Deluxe Media, which is a DVD and video distribution company.", "The report suggests the firm's success in moving to DVDs from VHS videos could make it an attractive target for a private equity buyer.", "The firm refused to comment on the reports, but said any results from the demerger study were likely to be set out when it unveiled its results."], "smollm:1.7b": ["The summary is concise and to the point.", "It captures the main ideas and key details of the text without including any additional information or explanations.", "The ranking of 'set to sell off film unit' is a clear indication that the text is about the sale of a film unit, which is one of the key businesses of the leisure group Rank."], "deepseek-r1:1.5b": ["Leisure Group is considering demergers involving film and media units, with expected results on Friday.", "Goldman Sachs valued a merged Deluxe Film unit at £300m.", "The company has diversified into leisure activities, divesting key businesses like Odeon and Pinewood.", "Restructuring aims to focus on gaming, bars/hotels, and media, after selling the Hard Rock business.", "Rank had issues with some film services but sold parts of their operations.", "Leisure Group's history as a major UK film producer now includes diverse leisure activities."], "tinyllama:1.1b": ["Despite making profits of £21.5m on a turnover of £392.1m, Deluxe Film Unit (DFI) will reportedly be sold off by Rank to explore strategic options, reports suggest.", "The demerging unit is likely to reveal its pre-tax profitability in a press release set for publication on Friday, as the company awaits the results of the study it undertook in September.", "The firm's gamings, bars and hotel businesses are valued at £300m.", "Despite its strong performance in recent years, analysts predict that this year's pre-tax profit will likely be slightly lower than last year.", "This follows a slump in cinema attendance following the COVID-19 pandemic, which has also impacted its other leisure activities.", "The firm owns 34 Grosvenor casinos, Mecca Bingo and Hard Rock Cafe outlets in more than 100 countries, but it's unclear if this will be one of the casino-style venues sold off to focus on its gaming, bars and hotel businesses."], "tinydolphin:1.1b": [" The Leisure Group, formerly famous for its Carry On series, announced plans to demerge its film services unit and sell its media business.", "The move is likely to result in the group dismantling its core film division and concentrating on gaming, bars and hotels.", "Analysts predict the firm will report a slight drop in annual pre-tax profits to £170m from £194m last year.", "The demerger could be driven by potential cost-cutting or strategic reasons."], "phi:2.7b": [" Leisure group Rank plans to demerge its film services unit and sell its media business, with Goldman Sachs valuing the demerged Deluxe Film unit at £300m.", "The firm has focused on fewer businesses since Mike Smith's appointment in 1999 and now aims to concentrate on its gaming, bars, hotels, and Hard Rock brand.", "However, it is seen as less successful than Deluxe Media, which makes DVDs and videos.", "Private equity buyers could be interested in the company if it reports a slight drop in profits.", "Rank formed in the 1990s and has since diversified into various leisure activities, including casinos and holiday centres."], "orca-mini:3b": [" Rank could unveil plans to demerge its film services unit and sell its media business.", "The group's gaming, bars, and hotels business, including extending its Hard Rock brand to its casinos, has been successful.", "However, Deluxe Media is seen as less successful.", "Last year, it made profits of £21.5m on a turnover of £392.1m, and experts suggest its success in moving to DVDs from VHS video could make it an attractive target for a private equity buyer.", "The company refused to comment on the reports but is likely to report a slight drop in annual pre-tax profits to £170m from £194m last year."], "hermes3:3b": ["Rank potentially selling film unit & demerging media business."], "stablelm-zephyr:3b": ["Leisure group Rank may demerge its film services unit, Deluxe Films, and sell its media business, according to reports.", "The company plans to focus on gaming, bars, and hotels, expanding the Hard Rock brand into casinos.", "Deluxe Media, which produces and distributes DVDs and videos, is seen as less successful but could be targeted by a private equity buyer.", "Analysts predict a slight drop in annual pre-tax profits from £194m to £170m."], "stablelm2:1.6b": ["Leisure group Rank is reportedly set to sell its media business (Deluxe Films) and potentially demerge its film services unit.", "The sale value is estimated at £15 million by advisors Goldman Sachs, valuing the Deluxe Film unit at £15 million.", "This follows a study into potential demerger in September, and since then, Rank has diversified into other leisure activities such"], "granite3.1-dense:2b": ["Rank, a historical UK film producer and cinema owner (formed in the 1940s), is considering demerging its Deluxe Film unit and potentially selling its media business, according to reports.", "The company, under new CEO Mike Smith since 1999, has been focusing on fewer businesses following a cost-cutting program.", "Rank now concentrates on gaming, bars, hotels, and Hard Rock branded establishments.", "Advisors Goldman Sachs valued Deluxe Film at £300m.", "The demerger study is expected to be announced alongside Rank's results on Friday, with analysts predicting a slight decline in annual pre-tax profits to £170m from last year's £194m.", "Deluxe Media, which handles DVD and video production, is seen as a potentially attractive target for private equity buyers due to its successful transition from VHS to DVD."], "chatgpt-4o-latest": ["Rank is reportedly planning to demerge its Deluxe Film unit and sell its media business, with an announcement expected alongside its financial results.", "Advisors Goldman Sachs have valued Deluxe Film at £300m.", "Since CEO Mike Smith's appointment in 1999, Rank has streamlined operations, selling assets like Odeon cinemas and Pinewood studios, leaving it with three core divisions: gaming, Hard Rock, and Deluxe Films.", "The company now aims to focus on gaming, bars, and hotels, expanding the Hard Rock brand into casinos.", "Deluxe Media, which produces and distributes DVDs, is seen as a potential private equity target.", "Analysts expect Rank to report a slight drop in annual pre-tax profits to £170m.", "Founded in the 1940s, Rank was once a major UK film producer and cinema owner but has since diversified into leisure businesses, including casinos, bingo halls, and Hard Rock Cafes."]}