{"raw_text": "US gives foreign firms extra time\n \n Foreign firms have been given an extra year to meet tough new corporate governance regulations imposed by the US stock market watchdog.\n \n The Securities and Exchange Commission has extended the deadline to get in line with the rules until 15 July 2006. Many foreign firms had protested that the SEC was imposing an unfair burden. The new rules are the result of the Sarbanes-Oxley Act, part of the US clean-up after corporate scandals such as Enron and Worldcom. Section 404 of the Sox Act, as the legislation is nicknamed, calls for all firms to certify that their financial reporting is in line with US rules. Big US firms already have to meet the requirements, but smaller ones and foreign-based firms which list their shares on US stock markets originally had until the middle of this year.\n \n Over the past few months, delegations of European and other business leaders have been heading to the SEC's Washington DC headquarters to protest. They say the burden is too expensive and the timescale too short and some, particularly the UK's CBI, warned that companies would choose to let their US listings drop rather than get in line with section 404. The latest delegation from the CBI met SEC officials on Wednesday, just before the decision to relax the deadline was announced. \"I think this signifies a change of heart at the SEC,\" CBI director-general Sir Digby Jones told the BBC's Today programme. \"They have been listening to us and to many overseas companies, who have reminded America what globalisation really means: that they can't make these rules in isolation.\" The SEC said it had taken into consideration the fact that foreign companies were already working to meet more onerous financial reporting rules in their home countries. The European Union, in particular, was imposing new international financial reporting standards in 2005, it noted. \"I don't underestimate the effort (compliance) will require... but this extension will provide additional time for those issuers to take a good hard look at their internal controls,\" said Donald Nicolaisen, the SEC's chief accountant.\n", "llama3.2:1b": ["Foreign firms have been given an extra year to meet US corporate governance regulations until July 15, 2006.", "The US Securities and Exchange Commission extended the deadline after complaints from foreign firms about imposing an unfair burden.", "Many foreign firms protested that the rules were too costly and rushed."], "llama3.2:3b": ["The US Securities and Exchange Commission has extended the deadline for foreign firms to meet new corporate governance regulations until 15 July 2006, from mid-2005.", "The move comes after protests from European business leaders who claimed the burden was too expensive and the timescale too short, with some threatening to drop their US listings rather than comply."], "gemma2:2b": ["The Securities and Exchange Commission (SEC) has extended the deadline for foreign firms to comply with new corporate governance regulations imposed by the US Sarbanes-Oxley Act (SOX).", "The original deadline was June 2006, but it is now set for July 15, 2006.", "This decision comes after protests from European and other business leaders who argued that the burden of compliance was too high and the timeframe too short.", "The SEC has acknowledged that foreign companies are already working to meet similar standards in their home countries."], "qwen2.5:0.5b": ["Foreign firms had been given an extra year to meet tougher corporate governance regulations imposed by the US stock market watchdog.", "Many foreign firms protested the new rules and the Securities and Exchange Commission had extended the deadline for meeting them until 15 July 2006.", "The latest delegation from CBI's European Union warned that companies would choose to let their US listings drop rather than meet the new regulations, citing increased financial reporting requirements in their home countries."], "qwen2.5:1.5b": ["US gives foreign firms extra year to comply with corporate governance regulations following Sarbanes-Oxley Act requirements and address concerns raised by European and other business leaders about potential financial reporting burden."], "qwen2.5:3b": ["US gives foreign firms extra year to meet tough new corporate governance regulations imposed by the Securities and Exchange Commission as part of the Sarbanes-Oxley Act after initially setting a deadline for mid-2005.", "The rules require all companies, including smaller ones and those listed on US stock markets from abroad, to certify that their financial reporting aligns with US standards.", "Foreign firms had protested that the regulations were unfair and imposed an undue burden.", "SEC extended the deadline until July 15, 2006, taking into account foreign companies' compliance with more stringent home country financial reporting rules, particularly those of the European Union implementing new international financial reporting standards in 2005."], "opencoder:1.5b": ["\"Foreign firms have been given an extra year to meet tough new corporate governance regulations imposed by the US stock market watchdog.\"", "This statement highlights the importance of timely and relevant government regulations in order to maintain stability within the financial system."], "smollm:1.7b": ["The summary is concise and objective, highlighting the key points of the text:\n\n1.", "Foreign firms have been given an extra year to meet tough new corporate governance regulations imposed by the US stock market watchdog.", "2.", "The Securities and Exchange Commission (SEC) has extended the deadline until 15 July 2006 to get in line with the rules.", "3.", "Many foreign firms protested that the SEC was imposing an unfair burden on them, citing the Sarbanes-Oxley Act as a reason for this extension.", "4.", "The new rules are part of the US clean-up after corporate scandals such as Enron and Worldcom, which led to the passage of the Sarbanes-Oxley Act in 2002.", "5.", "Section 404 of the Sox Act calls for all firms to certify that their financial reporting is in line with US rules, but smaller firms and foreign-based firms originally had until the middle of this year to meet these requirements.", "6.", "Over the past few months, delegations of European and other business leaders have been heading to the SEC's Washington DC headquarters to protest, saying the burden is too expensive and the timescale too short.", "7.", "The CBI warned that companies would choose to let their US listings drop rather than get in line with section 404.", "8.", "The latest delegation from the CBI met SEC officials on Wednesday before the decision to relax the deadline was announced.", "9.", "\"I think this signifies a change of heart at the SEC,\" Sir Digby Jones told the BBC's Today programme.", "\"They have been listening to us and to many overseas companies, who have already worked to meet more onerous financial reporting rules in their home countries.\""], "deepseek-r1:1.5b": ["US government has extended the deadline for foreign firms to comply with corporate governance rules until 15 July 2006, due to new regulations in their home countries under Sarbanes-Oxley Act (SARBOLIS).", "Firms protested, particularly smaller ones and foreign-based companies listing US shares.", "European business leaders recently visited SEC headquarters, marking a change of heart as the rules were announced.", "SEC director Sir Digby Jones emphasized compliance efforts from foreign companies, noting new standards in the EU could delay their response."], "tinyllama:1.1b": ["The Securities and Exchange Commission has decided to grant an extra year to foreign firms in order to meet new corporate governance requirements that were imposed by the US stock market watchdog as part of the Sarbanes-Oxley Act.", "The SEC previously set a deadline for foreign companies to certify their financial reporting is aligned with US rules, but some had objected to this requirement on the grounds that it was too expensive and the timescale was too short.", "European and other business leaders protested against this imposition of pressure on firms' financial reporting, particularly in the UK, which saw some companies let their US listings fall rather than comply with section 404.", "The SEC has now announced that it will grant a further year for these firms to get their reporting in line with the new rules, after meeting with delegations from the CBI (the Confederation of British Industry).", "The new deadline is set for 15 July 2006."], "tinydolphin:1.1b": [" Summary: The US Securities and Exchange Commission has given foreign firms an extra year to comply with new corporate governance regulations.", "These firms are required to certify that their financial reporting is in line with US standards until July 2006.", "The deadline was initially set for this year, but many companies resisted the pressure and continued working towards their full implementation.", "Some delegations from European and other business leaders protested against this decision and warned that they would drop their listing on US stock markets if they were not in compliance with section 404 of the Sarbanes-Oxley Act.", "The SEC agreed to relax the deadline, allowing foreign firms until the middle of this year to make the necessary changes."], "phi:2.7b": [" The US stock market watchdog has given foreign firms an extra year to comply with new corporate governance regulations, extending the deadline from the middle of the year until 15 July 2006.", "The rule is part of the Sarbanes-Oxley Act and aims to ensure that all firms certify their financial reporting is in line with US rules.", "Many business leaders had protested the burden, but the SEC said it considered the fact that foreign companies were already working on more stringent financial reporting standards in their home countries."], "orca-mini:3b": [" The US has given an extra year to meet tough new corporate governance regulations imposed by the stock market watchdog.", "The Securities and Exchange Commission (SEC) extended the deadline for foreign-based firms to get in line with the rules until 15 July 2006, citing the need to accommodate foreign companies that are already working to meet more onerous financial reporting rules in their home countries.", "Many foreign firms protested that the SEC was imposing an unfair burden and the new rules are the result of the Sarbanes-Oxley Act, which followed the Enron and Worldcom scandals."], "hermes3:3b": ["US extends deadline for foreign firms by a year to meet corporate governance regulations until 15th July 2006.", "The new rules are part of Sarbanes-Oxley Act after Enron and Worldcom scandals."], "stablelm-zephyr:3b": ["The US Securities and Exchange Commission (SEC) has extended the deadline for foreign firms to meet the new corporate governance regulations imposed by the US stock market watchdog.", "Originally set to comply by middle of 2006, these rules are part of the Sarbanes-Oxley Act, resulting from the US clean-up after corporate scandals such as Enron and Worldcom.", "Section 404 of the Sox Act requires all firms to certify their financial reporting aligns with US rules.", "European and other business leaders have protested the additional burden and time constraint; however, the SEC believes foreign companies are already working on meeting more stringent regulations in their home countries, like the European Union's imposition of international financial reporting standards in 2005."], "stablelm2:1.6b": ["The US Securities and Exchange Commission has extended an extra year for foreign firms to meet new corporate governance rules imposed by the stock market watchdog.", "This extension aligns with the rules until July 2026, following protests from foreign companies over the initial deadline of June 2023.", "The new rules were a result of the Sarbanes-Oxley Act and aim to certify that financial reporting is in line with US standards.", "Smaller firms and those listed on US stock markets originally had one year to meet these requirements, but now have an additional two years until July 2026.", "Many business leaders from Europe and other countries protested the initial deadline as it was deemed too expensive and short a timescale by some."], "granite3.1-dense:2b": ["The US Securities and Exchange Commission has extended the deadline for foreign firms to comply with stringent new corporate governance regulations, originally set for June 2005, until July 15, 2006.", "These rules, stemming from the Sarbanes-Oxley Act in response to corporate scandals like Enron and WorldCom, require firms to certify their US financial reporting aligns with American standards.", "Foreign companies, particularly those from Europe, had argued that the 2005 deadline was too restrictive and costly.", "After multiple protests, including a recent meeting with SEC officials by the UK's CBI, the commission agreed to the extension.", "The SEC acknowledged foreign firms' compliance with more rigorous reporting rules in their home countries as a factor in its decision, recognizing the global nature of business and the need for uniform standards.", "This extension aims to provide additional time for affected companies to assess and strengthen their internal controls."], "chatgpt-4o-latest": ["The US Securities and Exchange Commission (SEC) has extended the deadline for foreign firms to comply with new corporate governance regulations under the Sarbanes-Oxley Act until 15 July 2006.", "The rules, aimed at preventing corporate scandals like Enron and Worldcom, require firms to certify their financial reporting aligns with US standards.", "While large US firms already comply, smaller and foreign firms had protested the cost and short timeline.", "European business leaders, including the UK's CBI, warned that companies might drop US listings rather than comply.", "The SEC acknowledged concerns, noting that foreign firms were already adapting to stricter financial reporting rules in their home countries, such as new EU standards.", "The extension allows firms more time to assess and improve internal controls."]}