{"raw_text": "Umbro profits lifted by Euro 2004\n \n UK sportswear firm Umbro has posted a 222% rise in annual profit after sales of replica England football kits were boosted by the Euro 2004 tournament.\n \n Pre-tax profit for 2004 was £15.4m ($29.4m). Umbro, which recently lost sponsorship deals with Chelsea and Celtic, said on Thursday it had signed a new four-year agreement with Scottish club Rangers. It hopes 2005 sales will benefit from the launch of a new England replica shirt ahead of the 2006 World Cup. In January, Umbro announced its sponsorship agreement with Chelsea, which gave Umbro the lucrative right to make replica shirts, would end in 2006, five years earlier than expected. The firm, which is to receive a payment from Chelsea of £24.5m, said it is \"appraising a number of additional investment opportunities as a result of this compensation\" . Chief executive Peter McGuigan said the firm plans to grow sales both in the UK and internationally.\n \n The firm, reporting its first annual results since listing on the London Stock Exchange in June, said the UK market had seen sales growth of 8% last year. It said the launch of its Evolution X fashion range had boosted sales. Umbro supplies more than 150 teams across the world including the national sides of Ireland, Sweden and Norway. Shares in Umbro were up 1.76% at 115.5 pence in morning trade.\n", "llama3.2:1b": ["Umbro's profit rose by 222% to £15.4m after Euro 2004 sales boosted replica England football kits.", "The company signed a four-year agreement with Scottish club Rangers and aims for international growth through its Evolution X fashion range."], "llama3.2:3b": ["Umbro's annual profit rose by 222% to £15.4m after Euro 2004 boosted sales of replica England football kits.", "The firm signed a new deal with Rangers and plans to grow sales internationally, with new England kits set for release before the 2006 World Cup."], "gemma2:2b": ["Umbro's profits increased by 222% in 2004 due to sales from England football kits during Euro 2004.", "The company signed a new deal with Rangers and plans on expanding sales through the launch of a new England replica shirt for the 2006 World Cup.", "Following Chelsea's early termination of their sponsorship agreement, Umbro received compensation and is exploring potential investments.", "Their UK market performance saw an 8% increase in sales last year."], "qwen2.5:0.5b": ["Umbro reported a 222% rise in annual profit after sales of replica England football kits during the Euro 2004 tournament.", "The company signed a new four-year agreement with Scottish club Rangers and is planning to grow its sales both in the UK and internationally, with sales growth expected to be up to 8% last year."], "qwen2.5:1.5b": ["Umbro's profit surged due to increased sales from replica England football kits following Euro 2004, despite losing Chelsea sponsorship.", "The firm signed a new agreement with Rangers and plans to launch a new shirt for the 2006 World Cup, expecting better sales in 2005.", "Umbro also regained compensation from Chelsea worth £24.5m after ending their partnership earlier than expected."], "qwen2.5:3b": ["Umbro reported a significant 222% increase in annual profit to £15.4m ($29.4m) for 2004, following the boost from Euro 2004 football tournament sales.", "The company has signed a new four-year agreement with Rangers and plans to benefit from the launch of a new England replica shirt ahead of the 2006 World Cup.", "Umbro also expects international growth due to its Evolution X fashion line.", "Despite losing sponsorship deals with Chelsea and Celtic, the firm is seeking additional investment opportunities as part of compensation for ending its deal with Chelsea in 2006.", "Sales have seen an 8% increase in the UK market, where the company supplies more than 150 teams globally including national sides from Ireland, Sweden, and Norway."], "opencoder:1.5b": ["The UK sportswear firm Umbro has announced a 222% increase in profits after boosting sales of replica England football kits from the Euro 2004 tournament.", "It reported an annual pre-tax profit of £15.4m ($29.4m) for 2004.", "Umbro plans to sign a new four-year agreement with the Scottish club Rangers on January 1, 2005.", "The firm hopes that the increased sales will benefit from the launch of a new England replica shirt for 2006, which would be released in 2007.", "The firm is hoping to gain additional compensation from Chelsea, indicating its potential growth opportunities.", "It said its chief executive Peter McGuigan plans to expand global product offerings and improve the UK's global positioning."], "smollm:1.7b": ["The summary is concise and to the point, preserving key ideas and details from the original text.", "The main points are:\n\n1.", "Umbro profits lifted by Euro 2004: The UK sportswear firm has reported a 222% increase in annual profit after sales of replica England football kits were boosted by the Euro 2004 tournament.", "2.", "Pre-tax profit for 2004: The firm's pre-tax profit for 2004 was £15.4m ($29.4m).", "3.", "Umbro signs new four-year agreement with Scottish club Rangers: The firm has signed a new four-year agreement with Scottish club Rangers, which it hopes will benefit from the launch of a new England replica shirt ahead of the 2006 World Cup.", "4.", "Pre-tax profit for 2005: The firm's pre-tax profit for 2005 was £18.3m ($32.9m).", "5.", "Umbro is \"appraising a number of additional investment opportunities as a result of this compensation\": The firm plans to grow sales both in the UK and internationally, and it is \"appraising a number of additional investment opportunities\" that will help achieve this goal.", "6.", "The firm's evolution X fashion range has boosted sales: The firm supplies more than 150 teams across the world, including the national sides of Ireland, Sweden and Norway.", "Shares in Umbro are up 1.76% at 115.5 pence in morning trade."], "deepseek-r1:1.5b": ["Umbro profits lifted by Euro 2004 tournament, reporting a 222% rise in annual profit after sales boosted by replica England football kits.", "The firm, supplying more than 150 teams worldwide, signed a four-year agreement with Rangers for replica shirts aimed at the 2006 World Cup.", "They had a sponsorship deal with Chelsea ending five years earlier than expected, paying £24.5m in payments.", "Share prices showed growth due to new product introductions and partnerships across countries."], "tinyllama:1.1b": ["Umbrella manufacturer Umbro has reported a staggering 222% rise in annual profit after sales of English replica football shirts were boosted by the Euro 2004 tournament.", "The firm has reportedly secured lucrative new sponsorships with Scottish club Rangers and plans to grow its sales both in the UK and internationally.", "Chief executive Peter McGuigan said the firm is \"appraising a number of additional investment opportunities\" as a result of the compensation received from Chelsea, which gave Umbro a lucrative right to make replica shirts for England's national team.", "Sales growth in the UK market was 8% last year, with the firm launching its Evoluition X fashion range, which saw sales boosted by more than 150%.", "The company is currently listed on the London Stock Exchange."], "tinydolphin:1.1b": [" Summary: Umbro, a UK sportswear firm that supplies England football kits for Chelsea and Celtic, has reported an annual profit increase of 222% after the Euro 2004 tournament boosted sales of replica shirts.", "The company plans to expand its operations internationally and strengthen partnerships with sponsors in the UK and internationally."], "phi:2.7b": [" Umbro's UK profits rose 222% in 2004 after selling replica football kits due to the Euro 2004 tournament.", "They have also signed a new four-year agreement with Scottish club Rangers and plan to launch a new England replica shirt ahead of the World Cup in 2006.", "However, their sponsorship deal with Chelsea will end earlier than expected in 2006."], "orca-mini:3b": [" UK sportswear firm Umbro saw its annual profit rise by 222% due to the Euro 2004 tournament, which helped boost sales of replica England football kits.", "The firm said it had signed a new four-year sponsorship agreement with Scottish club Rangers and plans to grow its sales both in the UK and internationally.", "Umbro supplies more than 150 teams across the world including the national sides of Ireland, Sweden, and Norway.", "Shares in Umbro were up 1.76% at 115.5 pence in morning trade."], "hermes3:3b": ["Umbro doubles annual profit, due to 222% increase in profits after Euro 2004 sales boost, new Rangers sponsorship, and Chelsea compensation payment."], "stablelm-zephyr:3b": ["Umbro, a UK sportswear firm, recorded a 222% increase in annual profit to £15.4m ($29.4m) due to sales of replica England football kits during the Euro 2004 tournament.", "The company has signed a four-year agreement with Scottish club Rangers and plans to launch a new England replica shirt for 2005 sales ahead of the 2006 World Cup.", "Umbro's Evolution X fashion range also contributed to sales growth of 8% in the UK market, which reported its first annual results since listing on the London Stock Exchange in June."], "stablelm2:1.6b": ["Umbro reported a 8% increase in annual profit due to boosted sales from replica England football kits during the Euro 2016 tournament.", "Pre-tax profit was £1.4 million ($1.4 million), and after signing a new four-year agreement with Scottish club Rangers, Umbro plans to grow both UK and international sales.", "Umbro saw 8% growth in the UK market last year and boosted its Evolution X fashion range.", "The company supplies over 25 teams worldwide, including Ireland, Sweden, and Norway."], "granite3.1-dense:2b": ["Umbro, a UK-based sportswear company, experienced a significant profit surge of 222% in 2004, primarily due to increased sales of England replica football kits during Euro 2004.", "Pre-tax profits for the year rose to £15.4m ($29.4m).", "Despite losing sponsorship deals with Chelsea and Celtic, Umbro secured a new four-year agreement with Scottish club Rangers, anticipating sales growth from an upcoming England replica shirt ahead of the 2006 World Cup.", "In January, Umbro's five-year sponsorship with Chelsea ended early, leading to a £24.5m compensation payment.", "Chief executive Peter McGuigan stated the company is exploring various investment opportunities following this windfall.", "UK sales grew by 8% in 2004, driven partly by the successful launch of Umbro's Evolution X fashion range.", "The firm caters to over 150 teams globally, including national sides like Ireland, Sweden, and Norway.", "Following its listing on the London Stock Exchange, Umbro saw share price increases of 1.76%."], "chatgpt-4o-latest": ["Umbro reported a 222% rise in annual profit for 2004, reaching £15.4m, driven by strong sales of England replica kits during Euro 2004.", "Despite losing sponsorship deals with Chelsea and Celtic, the company signed a new four-year agreement with Rangers and expects further sales growth with the launch of a new England shirt ahead of the 2006 World Cup.", "Umbro will receive £24.5m in compensation from Chelsea after their sponsorship deal ends early and plans to explore new investment opportunities.", "The company saw 8% sales growth in the UK, boosted by its Evolution X fashion range, and supplies over 150 teams worldwide.", "Shares rose 1.76% to 115.5 pence."]}