{"raw_text": "Saudi ministry to employ women\n \n Women will be employed in Saudi Arabia's foreign ministry for the first time this year, Foreign Minister Prince Saud Al-Faisal has been reported as saying.\n \n The move comes as the conservative country inches open the door to working women. Last year, Crown Prince Abdullah, the de-facto ruler, told government departments to put plans in place for employing women. But progress has been slow, reports from the country say.\n \n Earlier this week, the local Arab News said Labour Minister Ghazi al-Gosaibi had \"caused uproar\" when he said his ministry was having difficulty hiring women because they demanded segregated offices. The newspaper said many Saudi women found his explanation \"a pitiful excuse for not employing women\". Women now make up more than half of all graduates from Saudi universities but only 5% of the workforce. \"Our educational reforms have created a new generation of highly-educated and professionally trained Saudi women who are acquiring their rightful position in Saudi society,\" Arab News quoted Prince Saud as saying. \"I am proud to mention here that this year we shall have women working in the Ministry of Foreign Affairs for the first time.\"\n", "llama3.2:1b": ["The Saudi ministry will employ women for the first time this year, with Foreign Minister Prince Saud Al-Faisal saying the decision is a step towards increasing women's participation in society.", "Women now make up more than half of all university graduates but only 5% of the workforce.", "A labour minister earlier expressed frustration over difficulties in hiring women due to their demands for segregated offices."], "llama3.2:3b": ["Saudi Arabia's foreign ministry plans to employ women for the first time, with progress made towards opening up the workforce to more women despite conservative attitudes."], "gemma2:2b": ["Saudi Arabia will employ women in its foreign ministry for the first time this year.", "This move comes after Crown Prince Abdullah instructed departments to plan for female employment and follows a recent statement from Labor Minister Ghazi al-Gosaibi that has been criticized.", "Saudi universities have seen increased graduation of women, but female participation in the workforce remains low (only 5%).", "Prince Saud Al-Faisal stated he is \"proud\" to announce this new development in women's roles within the ministry."], "qwen2.5:0.5b": ["Saudi Arabia's foreign ministry plans to employ women for the first time, according to Foreign Minister Prince Saud Al-Faisal.", "This move aims to open up Saudi Arabia's domestic work market and address issues related to gender equality.", "Women make up more than half of graduates from Saudi universities but only 5% of the workforce."], "qwen2.5:1.5b": ["Saudi Arabia's foreign ministry will employ women, becoming the country's first employing them.", "This follows Crown Prince Abdullah's previous directive and reflects a shift towards female employment reform in Saudi Arabia."], "qwen2.5:3b": ["Saudi ministry to employ women for the first time this year, according to Foreign Minister Prince Saud Al-Faisal.", "This follows Crown Prince Abdullah's directive last year to prepare for hiring women in government departments, though progress has been slow.", "Labour Minister Ghazi al-Gosaibi faced criticism for suggesting difficulty hiring women due to demands for segregated offices.", "Women now make up over half of university graduates but only 5% of the workforce.", "Prince Saud praised educational reforms creating a new generation of highly-educated Saudi women and announced that this year they will have women working in the Ministry of Foreign Affairs."], "opencoder:1.5b": ["The Saudi ministry has requested an increase in employment to help offset its financial burden.", "The move comes under the conservative country's eye, opening doors for workers to work women.", "Last year, reports said Crown Prince Abdullah reported that Foreign Minister Prince Saud Al-Faisal should have announced a plan to employ more women at the foreign ministry.", "However, progress has been slow and many Saudi women expressed concerns about their employment \"a pitiful excuse for not hiring women\".", "The educational reforms of this country have also helped generate highly educated, skilled women who can acquire their rightful position in the Arab society."], "smollm:1.7b": ["The Saudi government has announced plans to employ women in its foreign ministry, marking a significant step towards gender equality in the country.", "The move is seen as a response to the growing demand from women and their families who are increasingly demanding equal opportunities and rights.", "The decision comes after years of protests and activism by Saudi women who have been fighting for their right to work outside the home.", "The ministry will be responsible for handling diplomatic relations, trade agreements, and other international affairs related to Saudi Arabia's foreign policy.", "This is a significant step forward in terms of gender equality, as it demonstrates that Saudi women are capable of holding high-level positions in government and contributing to the country's development.", "The decision to employ women in the ministry comes after years of protests and activism by Saudi women who have been fighting for their right to work outside the home.", "The movement has gained momentum over the past few years, with many women demanding equal opportunities and rights.", "In 2018, Saudi women were granted the right to drive, a major milestone in the country's struggle for gender equality.", "The move is seen as a response to the growing demand from women and their families who are increasingly demanding equal opportunities and rights.", "The decision comes after years of protests and activism by Saudi women who have been fighting for their right to work outside the home.", "The government has also announced plans to introduce new laws to protect women's rights, including the right to own property and participate in the workforce.", "The move is seen as a significant step forward in terms of gender equality, as it demonstrates that Saudi women are capable of holding high-level positions in government and contributing to the country's development.", "The decision to employ women in the ministry comes after years of protests and activism by Saudi women who have been fighting for their right to work outside the home.", "The move is seen as a response to the growing demand from women and their families who are increasingly demanding equal opportunities and rights.", "The government has also announced plans to introduce new laws to protect women's rights, including the right to own property and participate in the workforce."], "deepseek-r1:1.5b": ["Saudi Arabia's foreign ministry will employ women for the first time this year, as Foreign Minister Prince Saud Al-Faisal reported on Monday (source: \"Arab News\").", "Previous efforts have been slow to employ women in the profession.", "Recent reports mention that labor minister Ghazi al-Gosaibi faced criticism for hiring women due to office segregation.", "However, women make up over half of Saudi university graduates but only 5% of the workforce.", "Prince Saud emphasized his pride in this milestone as part of broader reforms aimed at increasing female professionalism and earning."], "tinyllama:1.1b": ["Saudi ministries will employ more women than before, following Crown Prince Abdullah's statement calling on departmental departments to put plans in place for hiring women.", "Earlier this week, a local newspaper reported Labour Minister Ghazi al-Gozaibi saying the Ministry of Labour could not hire women due to their demanding offices.", "The move is part of Saudi Arabia's efforts to open up more doors to working women and improve gender parity in society.", "Women now account for more than half of graduates from the Kingdom's universities but only 5% of its workforce, according to the same newspaper.", "Prince Saud Al-Faisaal reportedly stated that this year, women will be hired at the Ministry of Foreign Affairs, marking a significant shift in policy towards hiring more women in government institutions across Saudi Arabia."], "tinydolphin:1.1b": [" The Saudi ministry is set to employ women for the first time this year.", "This move, according to reports, was made possible due to a Crown Prince's decision last year to open up job opportunities for women in the country.", "Despite progress being slow, Saudi Arabia's foreign ministry has announced that it will hire female employees, marking an important step towards gender equality and diversity in the workforce."], "phi:2.7b": [" In Saudi Arabia, the foreign ministry will employ women for the first time this year according to Foreign Minister Prince Saud Al-Faisal.", "This is part of a slow but gradual progress towards allowing more opportunities for working women in a traditionally conservative country.", "The move comes after Labour Minister Ghazi al-Gosaibi faced criticism for saying that his ministry was having difficulty hiring women because they demanded segregated offices, which many women found unacceptable.", "Women make up over half of all Saudi university graduates but only 5% of the workforce."], "orca-mini:3b": [" The Saudi government plans to employ women in its foreign ministry for the first time this year, according to reports.", "The move is part of the country's efforts to open up to working women and progress slowly.", "However, progress has been slow, with some women demanding segregated offices and the labor minister saying his ministry was having difficulty hiring women because they demanded them.", "Saudi Arabia's educational reforms have created a new generation of highly-educated and professionally trained women who are acquiring their rightful position in society.", "The country plans to employ women in its foreign ministry this year."], "hermes3:3b": ["Saudi ministry to employ women in foreign ministry."], "stablelm-zephyr:3b": ["Saudi Arabia's foreign ministry will employ women for the first time this year, according to Foreign Minister Prince Saud Al-Faisal.", "This move comes as the country gradually allows working women, with a slow progress reported earlier.", "Women make up over half of all graduates from Saudi universities but only 5% of the workforce.", "The recent statement by Crown Prince Abdullah urged government departments to prepare plans for employing women.", "Despite initial challenges regarding hiring women due to demands for segregated offices, Prince Saud emphasized that this year, the Ministry of Foreign Affairs will have its first female employees."], "stablelm2:1.6b": ["Saudi Arabia's foreign ministry will be hiring women, marking a milestone in the country's progressive path towards gender equality.", "This decision was announced by Prince Saud Al-Faisal, and it is expected to occur this year.", "However, progress has been slow due to concerns over segregated offices for female employees.", "Despite this, Saudi universities have produced an educated and professionally trained new generation of women, representing a significant shift in the workforce.", "The first female employees will work in the Ministry of Foreign Affairs for the first time."], "granite3.1-dense:2b": ["Saudi Arabia's Foreign Minister, Prince Saud Al-Faisal, announced plans to hire women for the first time in 2023.", "This decision follows Crown Prince Abdullah's directive for government departments to develop women employment strategies last year.", "Despite progress, challenges persist; Labour Minister Ghazi al-Gosaibi cited difficulties in hiring due to women demanding segregated offices, which was met with criticism as a weak excuse from many Saudi women.", "In contrast, over 50% of university graduates are female, yet only 5% of the workforce is composed of women.", "Prince Saud emphasized that educational reforms have produced a well-trained Saudi womanhood, entitled to their rightful place in society and soon to be integrated into the Ministry of Foreign Affairs."], "chatgpt-4o-latest": ["Saudi Arabia's Foreign Minister Prince Saud Al-Faisal announced that women will be employed in the foreign ministry for the first time this year.", "This move aligns with Crown Prince Abdullah's directive for government departments to hire women, though progress has been slow.", "Labour Minister Ghazi al-Gosaibi faced criticism for stating that hiring women was difficult due to their demand for segregated offices.", "Despite making up over half of university graduates, women constitute only 5% of the workforce.", "Prince Saud emphasized that educational reforms have created a new generation of highly educated Saudi women who are gaining their rightful place in society."]}