{"raw_text": "Ryanair in $4bn Boeing plane deal\n \n Budget airline Ryanair has placed an order for 70 Boeing 737-800 planes, in a deal valued at $4bn (£2.1bn) which should lead to 2,500 new Ryanair jobs.\n \n It also has an option for a further 70 aircraft, a move which brings the Ryanair/Boeing order book up to 225 firm orders and options on 193 more. Ryanair said the new planes would help it to cut operating costs further. The carrier reported a drop in quarterly profit earlier this year after it was hit by higher fuel costs. However, when it reported the results, the airline was upbeat about prospects for 2005, despite tough competition in the budget airline market.\n \n Ryanair chairman David Bonderman said that the 737-800 had \"significantly reduced our unit operating costs and allowed us to reduce air fares each year for the last five years\".\n \n \"With this new order and new pricing in place, Ryanair expects that unit operating costs (excluding fuel) will continue to fall each year for the next five years,\" he added. At the end of this year, Ryanair will have taken delivery of about 100 new planes, while the 70 new orders are due for delivery between 2008 and 2012. The airline said that when all these planes have been delivered, it will be able to carry more than 70 million passengers a year, making it Europe's largest airline. About 2,500 new jobs should be created in the next seven years, it added. The order can be seen as good news for Boeing, which in recent years has been overtaken by European plane maker Airbus as the world's biggest-selling plane maker.\n", "llama3.2:1b": ["Ryanair orders 70 Boeing 737-800 planes worth $4bn.", "Deals will lead to 2,500 new jobs and increase firm orders and options on 193 planes to 225.", "The airline expects unit operating costs to fall each year for five years.", "Ryanair's chairman says the new order should reduce fuel costs by \"significantly\"."], "llama3.2:3b": ["Ryanair orders 70 Boeing 737-800 planes valued at $4bn to reduce operating costs and create 2,500 new jobs, with options for further 70 aircraft.", "The deal is part of a larger order book that should allow Ryanair to carry over 70 million passengers per year and make it Europe's largest airline by 2009."], "gemma2:2b": ["Ryanair placed an order for 70 Boeing 737-800 planes worth $4 billion.", "This deal will create 2,500 new jobs and lead to further cost reduction in operating expenses.", "The order also includes an option for another 70 aircraft.", "The airline expects to achieve a significant increase in passenger capacity upon delivery of all the planes by 2012."], "qwen2.5:0.5b": ["Ryanair is planning to acquire Boeing’s 737-800 aircraft worth $4 billion.", "With 250 new jobs created over the next seven years, this order could boost Ryanair's profits and operations in Europe.", "Key ideas:\n- Ryanair plans to purchase 70 Boeing 737-800 planes\n- The deal includes an option for an additional 70 planes \n- This makes the total 250 jobs possible\n- The price is $4 billion (£2.1 billion)\n- The new planes are expected to reduce operating costs over time\n- Ryanair has struggled with low operating costs in recent years, but this order could help improve profitability\nSummary: Ryanair has announced plans to purchase Boeing's 737-800 aircraft for about $4 billion, which should lead to the creation of new jobs."], "qwen2.5:1.5b": ["Ryanair orders $4 billion worth of 737-800 planes from Boeing, bringing its total to 225+193 orders/options and securing 2,500 new jobs over seven years, aiming to reduce operating costs further despite fuel price hikes.", "Boeing's market share has dropped due to European competitors Airbus."], "qwen2.5:3b": ["Ryanair orders 70 Boeing 737-800 planes valued at $4bn to cut costs and create 2,500 jobs.", "The deal brings Ryanair/Boeing order book to 225 firm orders and options on 193 more.", "Ryanair chairman says the new planes will continue to reduce unit operating costs.", "Delivery of all planes is expected by 2012, allowing Ryanair to handle over 70 million passengers annually, making it Europe's largest airline.", "The order also indicates Boeing's increasing dominance in the aircraft market ahead of Airbus."], "opencoder:1.5b": ["Ryanair has placed an order for 70 Boeing 737-800 planes, leading to 2,500 new Ryanair jobs.", "The deal is valued at $4bn (£2.1bn) and brings the order book up to 225 firm orders with options on 193 more.", "The airline reported a drop in quarterly profit earlier this year due to higher fuel costs.", "However, when it reported the results, the airline was upbeat about prospects for 2005, despite tough competition in the budget airline market.", "Ryanair chairman David Bonderman said that new planes had significantly reduced unit operating costs and allowed us to reduce air fares each year for the last five years.", "The end of this year has allowed Ryanair to take delivery of about 100 new planes while the additional orders are scheduled to be delivered between 2008 and 2012.", "Ryanair plans to create more than 70 million jobs in the next seven years, as evidenced by Boeing's dominance over Airbus."], "smollm:1.7b": ["The summary is concise and to the point, capturing the main ideas and key details of the text:\n\n1.", "Ryanair places an order for 70 Boeing 737-800 planes valued at $4bn (£2.1bn).", "2.", "The deal brings in 2,500 new Ryanair jobs.", "3.", "Ryanair also has an option for a further 70 aircraft valued at $4bn (£2.1bn).", "4.", "The airline reported a drop in quarterly profit earlier this year after it was hit by higher fuel costs.", "However, when it reported the results, the airline was upbeat about prospects for 2005.", "5.", "Ryanair chairman David Bonderman said that the 737-800 had \"significantly reduced our unit operating costs and allowed us to reduce air fares each year for the last five years\".", "6.", "At the end of this year, Ryanair will have taken delivery of about 100 new planes, while the 70 new orders are due for delivery between 2008 and 2012.", "The airline said that when all these planes have been delivered, it will be able to carry more than 70 million passengers a year, making it Europe's largest airline.", "7.", "About 2,500 new jobs should be created in the next seven years, it added."], "deepseek-r1:1.5b": ["Ryanair has placed an order for 70 Boeing 737-800 planes valued at $4bn (£2.1bn), resulting in 2,500 new jobs.", "The airline also has a move to place an option for another 70 aircraft, increasing its order book and options to production.", "These deals are expected to further reduce operating costs over the next five years.", "Ryanair reported a profit drop due to higher fuel costs but expects positive outlook in 2005 amid tough budget competition.", "The carrier plans to deliver 100 new planes by end-of-year, with additional orders due from 2008 to 2012.", "By the time all planes are delivered, Ryanair aims to carry over 70 million passengers annually, creating approximately 2,500 new jobs in the next seven years.", "The order could boost Boeing's market leadership, which has grown past European manufacturer Airbus."], "tinyllama:1.1b": ["Ryanair has announced an agreement worth $4bn (£2.1bn) with Boeing to purchase 70 new 737-800 planes, which should bring down operating costs further for the budget airline operator.", "The order was placed in a deal value of $4bn and could lead to around 2,500 new Ryanair jobs.", "This new aircraft order is part of an overall plan by the airline to cut costs further.", "Ryanair had been hit by higher fuel costs due to competing with lower fares from the budget airline market in Europe.", "However, despite this, the airline was still upbeat about its prospects for 2005 and was expecting that unit operating costs would continue to fall each year for the next five years.", "The new order is part of a plan by Ryanair to take delivery of around 100 new planes over the next seven years, with deliveries expected between 2008 and 2012.", "This will create an estimated total of around 2,500 jobs for the aircraft maker, making it one of Europe's largest aviation companies."], "tinydolphin:1.1b": [" Ryanair has placed an $4bn Boeing 737-800 order with options to purchase a further 70 aircraft, a move that should lead to over 2,500 new Ryanair jobs and the creation of up to 100 new planes for delivery between 2008 and 2012.", "The airline also has an option for a further 70 aircraft, which could bring the total order book up to 225 firm orders and options on 193 more planes, according to Ryanair chairman David Bonderman.", "With this new order and new pricing in place, Ryanair is expected to continue to cut unit operating costs (excluding fuel) and reduce air fares each year for the next five years.", "At the end of this year, Ryanair will have taken delivery of about 100 new planes, while the 70 new orders are due for delivery between 2008 and 2012.", "The airline stated that when all these planes have been delivered, it will be able to carry more than 70 million passengers a year, making it Europe's largest airline.", "Additionally, about 2,500 new jobs should be created in the next seven years as a result of this order.", "The order can be seen as good news for Boeing and a further sign that Europe's aviation industry is growing rapidly."], "phi:2.7b": [" Ryanair has ordered 70 Boeing 737-800 planes for $4 billion, creating 2,500 new jobs and helping them to cut operating costs.", "The order will lead to a total of 225 firm orders and options on 193 more, making Ryanair Europe's largest airline.", "Ryanair chairman David Bonderman said the new planes would significantly reduce unit operating costs and allow them to reduce air fares each year for the last five years.", "When all deliveries are complete in 2012, they will be able to carry more than 70 million passengers a year, creating even more jobs.", "The order is good news for Boeing, as it overtook Airbus as the world's largest-selling plane maker in recent years."], "orca-mini:3b": [" Ryanair has placed an order for 70 Boeing 737-800 planes, valued at $4bn, which will lead to 2,500 new jobs and allow it to carry more passengers per year.", "The airline also has options for another 70 aircraft, bringing the total order book up to 225 firm orders and options on 193 more.", "Ryanair chairman David Bonderman said that the new planes will help reduce unit operating costs each year for the next five years.", "When all the planes are delivered, Ryanair will be able to carry more than 70 million passengers a year, making it Europe's largest airline."], "hermes3:3b": ["Ryanair orders 70 Boeing 737-800 planes for $4bn, increasing order book to 225 firm orders and options on 193 more planes, expected to reduce operating costs further and create 2,500 new jobs."], "stablelm-zephyr:3b": ["Budget airline Ryanair ordered 70 Boeing 737-800 planes for $4bn deal, leading to 2,500 new jobs.", "They also have an option for another 70 aircraft, totaling 225 firm orders and 193 options.", "The new planes will help cut operating costs further, with unit operating costs (excluding fuel) expected to decrease annually for the next five years.", "By 2023, Ryanair aims to carry over 70 million passengers, making it Europe's largest airline and creating approximately 2,500 new jobs over seven years.", "This deal is positive news for Boeing, as they have been overtaken by Airbus as the world's biggest-selling plane maker in recent years."], "stablelm2:1.6b": ["Budget airline Ryanair has ordered four Boeing planes worth $4bn (£2.1bn), creating potential 2,000 new jobs and allowing them to cut operating costs further.", "The order brings their total firm orders and options up to five, with delivery between 2023-2028.", "Ryanair CEO stated the new planes will help reduce air fares for the last five years while unit operating costs are expected to fall annually over the next five years.", "This marks good news for Boeing as they have lost their position to European plane maker Airbus in recent years."], "granite3.1-dense:2b": ["Ryanair, a budget airline, has ordered 70 Boeing 737-800 planes for $4bn (£2.1bn), with an option for additional 70 aircraft, totaling 225 firm orders and options for 193 more.", "This deal is expected to create 2,500 new jobs over the next seven years and significantly reduce Ryanair's unit operating costs.", "The airline, which previously reported a profit drop due to increased fuel costs, remains optimistic about its prospects for 2005 amidst intense competition in the budget airline sector.", "Ryanair chairman David Bonderman highlighted that the 737-800 model has helped lower fares and reduce unit operating costs annually over the past five years, with expectations of further declines for the next five years after this new order's delivery between 2008 and 2012.", "Upon completion of these planes' delivery, Ryanair aims to carry more than 70 million passengers per year, making it Europe's largest airline.", "This significant order is a positive development for Boeing, as it seeks to regain its position from Airbus as the world's leading plane maker."], "chatgpt-4o-latest": ["Ryanair has ordered 70 Boeing 737-800 planes in a $4 billion deal, with an option for 70 more, bringing its total order book to 225 firm orders and 193 options.", "The airline expects the new planes to reduce operating costs and help lower fares.", "Despite a recent profit drop due to higher fuel costs, Ryanair remains optimistic about 2005.", "Chairman David Bonderman stated that unit operating costs (excluding fuel) should continue to decline over the next five years.", "The 70 new planes will be delivered between 2008 and 2012, allowing Ryanair to carry over 70 million passengers annually and become Europe's largest airline.", "The deal is expected to create 2,500 jobs and is positive news for Boeing, which has been overtaken by Airbus as the top-selling plane maker."]}