{"raw_text": "Electrolux to export Europe jobs\n \n Electrolux saw its shares rise 14% on Tuesday after it said it would be shifting more of its manufacturing to low-cost countries.\n \n The Swedish firm, the world's largest maker of home appliances, said it is to relocate about 10 of its 27 plants in western Europe and North America. It did not say which facilities would be affected, but intends moving them to Asia, eastern Europe and Mexico. The company has two manufacturing sites in County Durham. It makes lawn and garden products in Newton Aycliffe, and cookers and ovens in Spennymoor. The Newton Aycliffe plant could also be affected by Electrolux's separate announcement that it is to spin-off its outdoor products unit into a new separate company.\n \n Electrolux's subsidiary brands include AEG, Zanussi and Frigidaire. The company said it was speeding up its restructuring programme, which aims to save between £190m and £265m annually from 2009. \"We see that about half the plants in high-cost countries - that is around 10 - are at risk,\" said Electrolux chief executive Hans Straberg. \"It looks pretty grim,\" said Swedish trades union official Ulf Carlsson. \"What are we going to end up producing in Sweden?\"\n", "llama3.2:1b": ["Electrolux plans to relocate about 10 of its manufacturing plants in western Europe and North America to Asia, eastern Europe, and Mexico.", "The company is shifting production from the two sites in County Durham to these locations as part of a restructuring effort aimed at saving £190m-£265m annually."], "llama3.2:3b": ["Electrolux plans to shift 10 of its 27 European and North American plants to Asia, eastern Europe, and Mexico, affecting jobs and production sites in the UK, including two manufacturing facilities in County Durham."], "gemma2:2b": ["Electrolux will relocate some of its manufacturing operations from western Europe and North America to Asia, eastern Europe, and Mexico.", "This move is expected to save the company money and speed up restructuring efforts.", "The company plans to spin off its outdoor products unit into a new separate company as part of these changes."], "qwen2.5:0.5b": ["Electrolux plans to relocate about 10 of its manufacturing plants from Europe to Asia, eastern Europe, and Mexico due to economic pressures.", "Straberg emphasizes that half the plants in high-cost countries in Western Europe will be affected by this move."], "qwen2.5:1.5b": ["Electrolux, a major appliance manufacturer, plans to move some of its manufacturing plants from high-cost countries like Europe and North America to low-cost locations such as Asia, Eastern Europe, and Mexico.", "This shift is expected to occur within the next few years, including potentially relocating one of its two plant sites in County Durham that produce lawn and garden products and cookers and ovens.", "The company also announced plans to spin off an outdoor products unit into a new separate entity."], "qwen2.5:3b": ["Electrolux, the world's largest home appliance maker, saw its shares rise 14% after announcing plans to relocate about 10 of its 27 plants in western Europe and North America to low-cost countries like Asia, eastern Europe, and Mexico.", "The company’s manufacturing sites in County Durham (Newton Aycliffe for lawn and garden products, Spennymoor for cookers and ovens) could also be affected by a plan to spin off its outdoor products unit.", "Electrolux's restructuring aims to save between £190m and £265m annually from 2009, with about half of high-cost plants at risk.", "Swedish union official Ulf Carlsson views the changes as grim for production in Sweden."], "opencoder:1.5b": ["\"Electrolux will be moving its manufacturing plants to lower-cost countries, with plans to relocate about 10 of its 27 plants across Western Europe and North America.", "The company intends to expand its operations into Southeast Asia, Eastern European countries and Mexico.", "It also has two manufacturing facilities in County Durham.\"", "The Swedish firm, the world's largest maker of home appliances, claims that it is planning to speed up its restructuring programme.", "It will save between £190m and £265m annually from 2009, reducing overall plant growth."], "smollm:1.7b": ["Electrolux, the world's largest maker of home appliances, is expected to relocate about 10 of its 27 plants in western Europe and North America to low-cost countries such as China, Mexico and Eastern Europe.", "The company said it will move some of its manufacturing facilities from these regions to other parts of the world where labor costs are lower.", "Electrolux's subsidiary brands include AEG, Zanussi and Frigidaire.", "The company has announced plans to spin off its outdoor products unit into a new separate company, which is expected to generate significant revenue for Electrolux.", "Electrolux aims to save around £190 million (approximately $265 million) annually from 2009 by streamlining its operations and reducing costs in high-cost countries such as the UK, Germany and France.", "The company said it will focus on cost savings through outsourcing manufacturing to lower-cost countries such as China, Mexico and Eastern Europe.", "Electrolux's subsidiary brands include AEG, Zanussi and Frigidaire.", "The company has announced plans to spin off its outdoor products unit into a new separate company, which is expected to generate significant revenue for Electrolux.", "Electrolux aims to save around £190 million (approximately $265 million) annually from 2009 by streamlining its operations and reducing costs in high-cost countries such as the UK, Germany and France.", "The company said it will focus on cost savings through outsourcing manufacturing to lower-cost countries such as China, Mexico and Eastern Europe.", "Electrolux's subsidiary brands include AEG, Zanussi and Frigidaire.", "The company has announced plans to spin off its outdoor products unit into a new separate company, which is expected to generate significant revenue for Electrolux."], "deepseek-r1:1.5b": ["Electrolux has shifted manufacturing from more expensive countries to cheaper ones by relocating 10 plants out of their current 27 and plans to relocate them in Western Europe, North America, Asia, Eastern Europe, and Mexico.", "The Newton Aycliffe plant could be affected due to a spin-off of its outdoor products unit.", "Shares have risen by 14%, and they are speeding up restructuring aimed at saving between £190m and £265m annually from 2009."], "tinyllama:1.1b": ["Electrolux announced plans to shift some manufacturing operations to low-cost countries and shift others to Asia, Eastern Europe, and Mexico, after it saw its shares rise by 14%.", "The company's subsidiary brands include AEG, Zanussi, and Frizzante, among other outdoor appliances.", "Electrolux's restructuring programme aims for annual cost savings of between £190m and £265m annually, with the move to reduce production in high-cost countries.", "The move was criticised by Swedish trade union official Ulf Carlsson, who called it \"pretty grim.\""], "tinydolphin:1.1b": [" Electrolux, a leading global manufacturer of home appliances, has announced that it will be relocating about 10 of its 27 plants in western Europe and North America to low-cost countries, such as China, India, and Mexico.", "The Swedish company currently produces lawn and garden products in Newton Aycliffe, and cookers and ovens in Spennymoor.", "However, it plans to shift these operations to countries with lower labor costs, including China and India, where production is cheaper and labor can be found at a lower cost.", "The decision to relocate these plants is a result of the ongoing global economic downturn and the need to reduce costs and increase efficiency in order to maintain competitiveness."], "phi:2.7b": [" Electrolux announced it will be moving more of its manufacturing to low-cost countries, with potential job losses for some plants in Europe and North America.", "The company plans to relocate about 10 of its 27 plants and also spin off its outdoor products unit into a new company.", "This is part of its restructuring programme aimed at saving between £190m and £265m annually from 2009."], "orca-mini:3b": [" Electrolux plans to shift more of its manufacturing to low-cost countries, including Asia, eastern Europe, and Mexico.", "About 10 of its 27 plants in western Europe and North America may be relocated, with some facilities in County Durham at risk.", "The company aims to save between £190m and £265m annually from 2009 through a restructuring program that includes spinning off its outdoor products unit."], "hermes3:3b": ["Electrolux exports Europe manufacturing to low-cost countries, aiming to save ~$190M-265M annually."], "stablelm-zephyr:3b": ["Electrolux, the world's largest home appliances maker, announced plans to shift more manufacturing to low-cost countries, affecting 10 of its 27 plants in western Europe and North America.", "The affected facilities will be relocated to Asia, eastern Europe, and Mexico.", "Electrolux's restructuring program aims to save between £190m and £265m annually starting from 2009."], "stablelm2:1.6b": ["Swedish appliance manufacturer Electrolux plans to relocate approximately half of its plants in high-cost countries, primarily Europe and North America, to lower-cost regions such as Asia, Eastern Europe, and Mexico.", "The company's share value rose by 1% following this announcement, though Electrolux also revealed a restructuring plan aiming to save between £50 million and £50 million annually from 2029.", "The CEO, Hans Straberg, said that \"about half the plants in high-cost countries are at risk,\" with potential consequences for production in Sweden."], "granite3.1-dense:2b": ["Electrolux, the world's leading home appliance manufacturer, experienced a 14% share price surge on Tuesday following its announcement to relocate approximately 10 of its 27 European and North American plants to low-cost regions like Asia, eastern Europe, and Mexico.", "This move includes potential closures at Electrolux's County Durham sites in Newton Aycliffe (lawn and garden products) and Spennymoor (cookers and ovens).", "The company aims to save between £190m and £265m annually through a quickened restructuring program.", "Chief Executive Hans Straberg stated that around half of the high-cost plants, or about 10, are at risk.", "Swedish trade union official Ulf Carlsson expressed pessimism, questioning what Sweden will produce following these changes."], "chatgpt-4o-latest": ["Electrolux shares rose 14% after announcing plans to shift more manufacturing to low-cost countries.", "The company will relocate about 10 of its 27 plants in Western Europe and North America to Asia, Eastern Europe, and Mexico, though specific sites were not disclosed.", "Its Newton Aycliffe plant in the UK may also be affected by a separate spin-off of its outdoor products unit.", "Electrolux, which owns brands like AEG, Zanussi, and Frigidaire, is accelerating its restructuring to save £190m-£265m annually from 2009.", "CEO Hans Straberg acknowledged that about half of the plants in high-cost countries are at risk, raising concerns among Swedish trade unions."]}