{"raw_text": "Worldcom ex-boss launches defence\n \n Lawyers defending former WorldCom chief Bernie Ebbers against a battery of fraud charges have called a company whistleblower as their first witness.\n \n Cynthia Cooper, WorldCom's ex-head of internal accounting, alerted directors to irregular accounting practices at the US telecoms giant in 2002. Her warnings led to the collapse of the firm following the discovery of an $11bn (£5.7bn) accounting fraud. Mr Ebbers has pleaded not guilty to charges of fraud and conspiracy.\n \n Prosecution lawyers have argued that Mr Ebbers orchestrated a series of accounting tricks at WorldCom, ordering employees to hide expenses and inflate revenues to meet Wall Street earnings estimates. But Ms Cooper, who now runs her own consulting business, told a jury in New York on Wednesday that external auditors Arthur Andersen had approved WorldCom's accounting in early 2001 and 2002. She said Andersen had given a \"green light\" to the procedures and practices used by WorldCom. Mr Ebber's lawyers have said he was unaware of the fraud, arguing that auditors did not alert him to any problems.\n \n Ms Cooper also said that during shareholder meetings Mr Ebbers often passed over technical questions to the company's finance chief, giving only \"brief\" answers himself. The prosecution's star witness, former WorldCom financial chief Scott Sullivan, has said that Mr Ebbers ordered accounting adjustments at the firm, telling him to \"hit our books\". However, Ms Cooper said Mr Sullivan had not mentioned \"anything uncomfortable\" about WorldCom's accounting during a 2001 audit committee meeting. Mr Ebbers could face a jail sentence of 85 years if convicted of all the charges he is facing. WorldCom emerged from bankruptcy protection in 2004, and is now known as MCI. Last week, MCI agreed to a buyout by Verizon Communications in a deal valued at $6.75bn.\n", "llama3.2:1b": ["Worldcom ex-head Cynthia Cooper calls former CEO Bernie Ebbers as first witness in fraud trial.", "Cooper, who alerted internal auditors about irregular accounting practices, now runs her own consulting business and is testifying against Ebbers.", "Prosecution alleges Ebbers orchestrated fraudulent accounting tricks, but he claims external auditors Arthur Andersen approved procedures."], "llama3.2:3b": ["Lawyers for former WorldCom CEO Bernie Ebbers called company whistleblower Cynthia Cooper as their first witness, arguing that external auditors Arthur Andersen had approved the firm's accounting practices in early 2001 and 2002. Cooper claimed Andersen gave a \"green light\" to procedures used by WorldCom, contradicting prosecution evidence that Ebbers orchestrated accounting tricks.", "The defense also highlighted Ebbers' lack of awareness about potential problems with the company's accounting, with Ebbers often passing technical questions to the finance chief without giving clear answers."], "gemma2:2b": ["Bernie Ebbers' lawyers called Cynthia Cooper, former WorldCom accounting head, as their first witness.", "Cooper testified that Arthur Andersen approved WorldCom's accounting practices and Mr. Ebbers was unaware of the fraud.", "She also said Mr. Ebbers often passed technical questions to his finance chief, giving only brief answers himself.", "This is in contrast to Scott Sullivan, the prosecution's star witness who claims Mr. Ebbers ordered accounting adjustments.", "If convicted on all charges, he could face 85 years in prison.", "WorldCom emerged from bankruptcy and now operates as MCI, which recently agreed to a buyout by Verizon for $6.75 billion."], "qwen2.5:0.5b": ["Worldcom's former boss, Cynthia Cooper, the ex-head of internal accounting at WorldCom, has been named her own defence against accusations that she orchestrated a series of accounting tricks at the company, ordering employees to hide expenses and inflate revenues to meet Wall Street earnings estimates.", "She told a jury in New York on Wednesday that external auditors Arthur Andersen had approved WorldCom's accounting practices in early 2001 and 2002.", "However, she argued that she was unaware of the fraud, saying she ordered accounting adjustments at the firm but had not mentioned anything uncomfortable about it during a 2001 audit committee meeting with former CFO Scott Sullivan.", "She claims the prosecution's star witness, former WorldCom financial chief Scott Sullivan, has stated that he ordered the company to change its accounting practices and was unaware of them."], "qwen2.5:1.5b": ["Former WorldCom chief Bernie Ebbers' defense includes Arthur Andersen's approval of accounting practices in early 2001-2002, which led to the company's collapse due to an $11 billion fraud and the former CEO's lack of knowledge about the scandal."], "qwen2.5:3b": ["WorldCom ex-boss Bernie Ebbers' defense has called Cynthia Cooper, former head of internal accounting, as their first witness.", "Cooper testified that external auditors approved WorldCom's practices and suggested Mr. Ebbers was unaware of the fraud orchestrated by employees to inflate revenues for meeting earnings estimates.", "She also stated that during shareholder meetings, Mr. Ebbers often delegated technical questions to his finance chief, giving brief answers himself.", "Prosecution's key witness Scott Sullivan did not mention any concerns about WorldCom’s accounting practices in a 2001 audit committee meeting.", "If convicted, Ebbers could face an 85-year jail sentence.", "WorldCom, now known as MCI, emerged from bankruptcy protection in 2004 and was later bought by Verizon Communications for $6.75bn."], "opencoder:1.5b": ["Worldcom ex-boss launches defence\n\nLawyers defending former WorldCom chief Bernie Ebbers against a series of fraudulent charges have called a company whistleblower as their first witness.", "Cynthia Cooper, WorldCom's ex-head of internal accounting, alerted directors to irregular accounting practices at the US telecom giant in 2002.", "Her warnings led to the collapse of the firm following the discovery of an $11bn (£5.7bn) accounting fraud.", "Mr Ebbers has pleaded not guilty to charges of fraud and conspiracy.", "Prosecution attorneys have argued that Mr Ebber orchestrated a series of accounting tricks at WorldCom, ordering employees to hide expenses and inflate revenues to meet Wall Street earnings estimates.", "But Ms Cooper, who now runs her own consulting business, told a jury in New York on Wednesday that external auditors Arthur Andersen had approved WorldCom's accounting in early 2001 and 2002.", "She said Andersen had given a \"green light\" to the procedures and practices used by WorldCom.", "Mr Ebber’s lawyer has argued that he was unaware of the fraud, arguing that auditors did not alert him to any problems.", "Ms Cooper also mentioned that during shareholder meetings Mr Ebbers often passed over technical questions to the company's finance chief, giving only \"brief\" answers himself.", "The prosecution’s star witness, former WorldCom financial chief Scott Sullivan, has said that Mr Ebbers ordered accounting adjustments at the firm, telling him to \"hit our books\".", "However, Ms Cooper reported that Mr Sullivan had not mentioned \"anything uncomfortable\" about WorldCom's accounting during a 2001 audit committee meeting.", "Mr Ebber could face a jail sentence of 85 years if convicted of all the charges he is facing.", "WorldCom emerged from bankruptcy protection in 2004, and is now known as MCI.", "Last week, MCI agreed to a buyout by Verizon Communications in a deal valued at $6.75bn."], "smollm:1.7b": ["The summary should be:\nWorldcom ex-boss launches defence against fraud charges"], "deepseek-r1:1.5b": ["Cynthia Cooper alerted directors at WorldCom in 2002 to fraud concerns, leading to its collapse.", "She alleged the fraud was orchestrated by former CEO Bernie Ebbers, arguing auditors approved her internal accounting practices.", "Cooper denied the fraud, stating external auditors had given a green light.", "Ebbers could face up to 85 years in jail if convicted of fraud and conspiracy charges.", "WorldCom was bought out by Verizon Communications for $6.75 billion."], "tinyllama:1.1b": ["The defending lawyers for ex-WorldCom chief Bernie Ebbers have called a company witness who warned against suspicious accounting practices during a time of financial crisis at the US telecoms giant in 2002.", "Cynthia Cooper, who had been the head of internal accounting at the firm, alerted directorate members to irregularities in their accounts, including possible fraudulent activity.", "The defence has argued that Ebber orchestrated a string of accounting trickery from early 2001 and 2002, while prosecution lawyers have claimed that Andersen accountants gave the green light for procedures used by WorldCom.", "During shareholder meetings, Ebber often passed over technical questions to company finance chief, leaving \"briefer\" answers to Mr Sullibian, who also testified against Ebber during the trial.", "The former boss could face a sentence of up to 85 years in jail if convicted of all charges against him."], "tinydolphin:1.1b": [" Summary: A former WorldCom executive named Cynthia Cooper has become the first witness for Bernie Ebbers' defense team in fraud charges against WorldCom.", "During her time working at the company, Ms. Cooper uncovered that the firm was routinely inflating revenue and hiding expenses to meet Wall Street earnings estimates.", "Contrary to prosecution claims, Ms. Cooper believes that external auditors Arthur Andersen approved the accounting.", "However, Ebbers' attorneys argue that he wasn't aware of any problems at the time."], "phi:2.7b": [" Lawyers representing former WorldCom CEO Bernie Ebbers called a whistleblower as their first witness.", "The defendant had pleaded not guilty to charges of fraud and conspiracy, but the prosecution claimed that he orchestrated accounting tricks at the company.", "The whistleblower, Cynthia Cooper, said that external auditors had given a \"green light\" to the fraudulent practices.", "The prosecution's star witness, former WorldCom financial chief Scott Sullivan, testified that Mr Ebbers ordered him to make adjustments to the firm's books.", "Ms Cooper claimed that Mr Ebbers did not realize the extent of the fraud and that he gave only brief answers during shareholder meetings.", "If convicted, Mr Ebbers could face a"], "orca-mini:3b": [" The former boss of WorldCom has called a company whistleblower as his first witness in his defense against fraud charges.", "Cynthia Cooper, the ex-head of internal accounting at WorldCom, accused external auditors of approving the firm's accounting practices and said that former CEO Bernie Ebbers was unaware of any problems.", "However, Mr Sullivan, the former finance chief, has denied this.", "The prosecution's star witness is also expected to give evidence later in the trial."], "hermes3:3b": ["Former WorldCom boss Ebbers' lawyer calls whistleblower Cooper as first witness; defends against fraud charges based on Ebber's unawareness of accounting tricks and auditors' approval."], "stablelm-zephyr:3b": ["Former WorldCom chief Bernie Ebbers' lawyers have called Cynthia Cooper, the company's ex-head of internal accounting, as their first witness in his defense against fraud charges.", "Cooper alerted directors to irregular accounting practices in 2002, leading to the collapse of the firm after an $11bn accounting fraud was discovered.", "Prosecution argues that Ebbers orchestrated a series of accounting tricks at WorldCom to meet Wall Street earnings estimates, while his defense claims he was unaware of the fraud and auditors didn't alert him to any problems.", "Cooper also mentioned that during shareholder meetings, Ebbers passed over technical questions to the finance chief, giving only brief answers.", "If convicted on all charges, Ebbers could face a 85-year jail sentence.", "WorldCom emerged from bankruptcy in 2004 and is now known as MCI, which recently agreed to a buyout by Verizon Communications for $6.75bn."], "stablelm2:1.6b": ["Ex-WorldCom chief Bernie Ebbers' lawyers call whistleblower Cynthia Cooper as their first witness in the fraud defense against charges of fraud and conspiracy.", "Prosecutors argue that Mr. Ebbers orchestrated $5.7bn accounting fraud, while Ms. Cooper claims external auditors Arthur Andersen approved WorldCom's practices.", "Ms. Cooper testified that external auditors approved WorldCom's accounting procedures; however, she stated Mr. Ebbs' awareness was unaware of the fraud.", "Mr. Ebbers could face a 10-year jail sentence if convicted of all charges."], "granite3.1-dense:2b": ["Lawyers for former WorldCom CEO Bernie Ebbers have called Cynthia Cooper, the company's ex-head of internal accounting, as their first witness in his fraud trial.", "Cooper alerted directors to irregular accounting practices in 2002, leading to WorldCom's collapse after an $11 billion (£5.7 billion) fraud was discovered.", "Ebbers pleaded not guilty to charges of fraud and conspiracy, with prosecution arguing he orchestrated accounting tricks, including hiding expenses and inflating revenues to meet Wall Street estimates.", "Cooper testified that external auditors Arthur Andersen had approved WorldCom's accounting in early 2001 and 2002, providing a \"green light\" for the company's procedures.", "Ebbers' defense claims he was unaware of the fraud, citing auditors' failure to alert him to any issues.", "Cooper also recounted that during shareholder meetings, Ebbers often delegated technical questions to the finance chief and offered only brief responses himself.", "The prosecution's key witness, former WorldCom financial chief Scott Sullivan, previously testified that Ebbers ordered accounting adjustments, instructing him to \"hit our books.\"", "However, Cooper disputed this, stating that Sullivan did not mention anything concerning the company's accounting during a 2001 audit committee meeting.", "If convicted of all charges, Ebbers could face an 85-year jail sentence.", "WorldCom, now known as MCI, emerged from bankruptcy in 2004 and was recently bought by Verizon Communications for $6.75 billion."], "chatgpt-4o-latest": ["Former WorldCom chief Bernie Ebbers' defense team called whistleblower Cynthia Cooper as their first witness in his fraud trial.", "Cooper, who exposed the $11bn accounting fraud that led to WorldCom's collapse, testified that external auditors Arthur Andersen had approved the company's accounting in 2001 and 2002.", "Prosecutors argue that Ebbers orchestrated fraudulent accounting to inflate revenues, while his lawyers claim he was unaware of the fraud.", "Cooper stated that Ebbers often deferred technical financial questions to the finance chief.", "Former CFO Scott Sullivan testified that Ebbers ordered accounting manipulations, but Cooper said Sullivan did not raise concerns in a 2001 audit meeting.", "If convicted, Ebbers faces up to 85 years in prison.", "WorldCom, now MCI, emerged from bankruptcy in 2004 and was recently acquired by Verizon for $6.75bn."]}