{"raw_text": "Insurance bosses plead guilty\n \n Another three US insurance executives have pleaded guilty to fraud charges stemming from an ongoing investigation into industry malpractice.\n \n Two executives from American International Group (AIG) and one from Marsh & McLennan were the latest. The investigation by New York attorney general Eliot Spitzer has now obtained nine guilty pleas. The highest ranking executive pleading guilty on Tuesday was former Marsh senior vice president Joshua Bewlay.\n \n He admitted one felony count of scheming to defraud and faces up to four years in prison. A Marsh spokeswoman said Mr Bewlay was no longer with the company. Mr Spitzer's investigation of the US insurance industry looked at whether companies rigged bids and fixed prices. Last month Marsh agreed to pay $850m (£415m) to settle a lawsuit filed by Mr Spitzer, but under the settlement it \"neither admits nor denies the allegations\".\n", "llama3.2:1b": ["Insurance bosses plead guilty in fraud charges stemming from an ongoing investigation into industry malpractice by New York attorney general Eliot Spitzer.", "Three US insurance executives pleaded guilty: Joshua Bewlay of Marsh McLennan and two others from American International Group, with Bewlay admitting to one felony count of scheming to defraud up to four years in prison."], "llama3.2:3b": ["Three more US insurance executives pleaded guilty to fraud charges as part of an investigation into industry malpractice, bringing the total number of guilty pleas to nine.", "The latest to plead guilty was Joshua Bewlay, a former senior vice president at Marsh & McLennan, who admitted one felony count and faces up to four years in prison."], "gemma2:2b": ["Three US insurance executives have pleaded guilty to fraud charges in connection with an investigation by New York Attorney General Eliot Spitzer.", "These pleas bring the total to nine, and the highest-ranking executive to plead guilty was former Marsh senior vice president Joshua Bewlay who admitted scheming to defraud and faces up to four years in prison.", "The investigation focused on whether companies rigged bids and fixed prices within the industry.", "Marsh has already agreed to a $850 million settlement with Spitzer's office, but this settlement does not confirm or deny allegations made against them."], "qwen2.5:0.5b": ["Summary: Two American executives pleaded guilty to fraud charges stemming from an investigation into industry malpractice in the US."], "qwen2.5:1.5b": ["Three U.S. insurance executives pleaded guilty in New York over fraud charges related to industry malpractice investigations led by Eliot Spitzer's office.", "Josh Bewlay of Marsh & McLennan admitted one felony count for scheming to defraud and faces up to four years in prison.", "His employer has confirmed his departure from the company following the settlement with Spitzer that covers $850m, but does not admit or deny the allegations."], "qwen2.5:3b": ["Three US insurance executives have pleaded guilty to fraud charges related to industry malpractice in an ongoing investigation by New York attorney general Eliot Spitzer.", "Two from American International Group and one from Marsh & McLennan were involved.", "The highest-ranking executive, Joshua Bewlay, admitted one felony count of scheming to defraud, facing up to four years in prison.", "A Marsh spokeswoman stated that Mr. Beway is no longer with the company.", "This investigation examined whether companies rigged bids and fixed prices.", "Marsh agreed to pay $850m (£415m) to settle a lawsuit filed by Spitzer under a settlement which neither admitted nor denied the allegations."], "opencoder:1.5b": ["InsuranceBosses have pleaded guilty to another three fraud charges stemming from an ongoing investigation into the malpractices of the US insurance industry.", "Two executives from American International Group (AIG) and one from Marsh & McLennan were the latest in the investigation.", "The highest ranking executive pleading guilty on Tuesday was former Marsh senior vice president Joshua Bewlay.", "He admitted one felony count of scheming to defraud and faces up to four years in prison.", "A Marsh spokeswoman said Mr Bewlay is no longer with the company.", "Mr Spitzer's investigation of the US insurance industry looked at whether companies rigged bids and fixed prices.", "Last month Marsh agreed to pay $850m (£415m) to settle a lawsuit filed by Mr Spitzer, but under the settlement it \"neither admits nor denies the allegations\".", "Please note that this text is only a summary and does not preserve all key ideas or details from the original text."], "smollm:1.7b": ["The summary is concise and to the point, capturing the essence of the text while omitting unnecessary details.", "The key ideas are preserved, including:\n\n1.", "The three US insurance executives pleaded guilty to fraud charges.", "2.", "The investigation by New York attorney general Eliot Spitzer has obtained nine guilty pleas.", "3.", "The highest ranking executive pleading guilty is former Marsh senior vice president Joshua Bewlay.", "4.", "Mr Bewlay admitted one felony count of scheming to defraud and faces up to four years in prison.", "5.", "A Marsh spokeswoman said Mr Bewlay was no longer with the company.", "6.", "The investigation into the US insurance industry looked at whether companies rigged bids and fixed prices.", "7.", "Last month Marsh agreed to pay $850m (£415m) to settle a lawsuit filed by New York attorney general Eliot Spitzer, but under the settlement it \"neither admits nor denies the allegations\"."], "deepseek-r1:1.5b": ["Insurance bosses are pleading guilty in an ongoing fraud case related to industry malpractice, with three executives being charged.", "AIG and Marsh & McLennan's executives were the latest.", "The New York attorney general, Eliot Spitzer, has obtained nine guilty pleas.", "Among them was Mr. Joshua Bewlay, who pleaded guilty on Tuesday.", "He admitted one felony count of scheming to defraud and faces up to four years in prison.", "AIG's former senior vice president is no longer with the company.", "The insurance industry's investigation involved determining if companies were manipulating bids and prices.", "Last month, Marsh agreed to settle a $850 million lawsuit but it did not resolve the allegations."], "tinyllama:1.1b": ["The US insurance industry's executives plead guilty to fraud charges stemming from an ongoing investigation led by New York attorney general Eliot Spitzer.", "A further three executives, including one from American International Group (AIG) and two from Marsh & McLean, have also been convicted as part of the probe.", "The highest ranking executive pleading guilty is Joshua Bewlay, senior vice president at Marsh, who will face up to four years in prison for scheming to defraud and one felony count.", "A Marsh spokesperson declined to comment on behalf of Mr Bewlay, who is said to have resigned from the company.", "The investigation was conducted by Spitzer's office against a network of insurance companies and brokerage firms."], "tinydolphin:1.1b": [" In summary, two US insurance executives from AIG and Marsh & McLennan have pleaded guilty for their involvement in an ongoing fraud investigation.", "This latest charge concerns the industry's practices, with New York attorney general Eliot Spitzer having obtained nine guilty pleas.", "The highest-ranking executive to confess was Joshua Bewlay, who admitted one felony count of scheming to defraud.", "No further information is available about the executives involved in this particular case."], "phi:2.7b": [" Three U.S. insurance executives pleaded guilty to fraud charges in an ongoing investigation into industry malpractice.", "The highest ranking executive who pled guilty was former Marsh senior vice president Joshua Bewlay, who admitted one felony count of scheming to defraud and faces up to four years in prison.", "The New York attorney general's investigation looked at whether companies rigged bids and fixed prices."], "orca-mini:3b": [" Insurance bosses pleaded guilty to fraud charges in an ongoing investigation into industry malpractice.", "Nine executives have now pleaded guilty, including two from AIG and one from Marsh & McLennan.", "Joshua Bewlay, a former senior vice president at Marsh, admitted one felony count of scheming to defraud and faces up to four years in prison.", "The investigation by Eliot Spitzer looked into allegations of bid rigging and price fixing in the US insurance industry."], "hermes3:3b": ["US insurance executives pleading guilty, AIG, Marsh & McLennan, fraud charges, New York attorney general Eliot Spitzer's investigation, 9 guilty pleas obtained."], "stablelm-zephyr:3b": ["Three US insurance executives, including two from AIG and one from Marsh & McLennan, have pleaded guilty to fraud charges in an ongoing investigation into industry malpractice.", "The highest-ranking executive pleading guilty was former Marsh senior vice president Joshua Bewlay, who admitted to one felony count of scheming to defraud and faces up to four years in prison.", "The investigation by New York attorney general Eliot Spitzer looked into whether companies rigged bids and fixed prices.", "Last month, Marsh agreed to pay $850 million to settle a lawsuit filed by Mr. Spitzer, but did not admit or deny the allegations."], "stablelm2:1.6b": ["Three US insurance executives pleaded guilty to fraud charges in an ongoing investigation into industry malpractice.", "AIG and Marsh & McLennan executives have been implicated with former Marsh VP Joshua Bewlay being the highest ranking executive pleading guilty, facing up to four years in prison for felony count of scheming to defraud.", "The investigation by New York attorney general Eliot Spitzer focused on whether companies rigged bids and fixed prices."], "granite3.1-dense:2b": ["Nine guilty pleas have been secured from US insurance executives as part of an investigation led by New York Attorney General Eliot Spitzer.", "The latest plea comes from former Marsh senior vice president Joshua Bewlay, who admitted to one felony count of scheming to defraud and could face up to four years in prison.", "This investigation probes allegations of industry malpractice, including bid rigging and price fixing.", "Last month, Marsh agreed to pay $850m (£415m) to settle a lawsuit filed by Spitzer, though the settlement does not admit or deny the accusations."], "chatgpt-4o-latest": ["Three more US insurance executives, two from AIG and one from Marsh & McLennan, have pleaded guilty to fraud charges in an ongoing investigation led by New York attorney general Eliot Spitzer.", "This brings the total guilty pleas to nine.", "Former Marsh senior vice president Joshua Bewlay admitted to scheming to defraud and faces up to four years in prison.", "Spitzer's investigation focuses on bid-rigging and price-fixing in the insurance industry.", "Last month, Marsh agreed to pay $850 million to settle a lawsuit but did not admit wrongdoing."]}