{"raw_text": "Lufthansa may sue over Bush visit\n \n German airline Lufthansa may sue federal agencies for damages after the arrival of US president George W Bush disrupted flights.\n \n Lufthansa said that it may lose millions of euros as a result of Air Force One landing at Frankfurt airport. Flights were affected for an hour on Wednesday morning, double the time that had been expected, leading to cancellations and delays. Lufthansa accounts for six out of every 10 planes using Frankfurt's airport.\n \n \"We are doing research into the possibilities we have,\" Michael Lamberty, a Lufthansa spokesman told the BBC. \"We are checking if there is action to be taken and in which courts it could be taken.\" Mr Lamberty explained that the company did not plan to pursue Germany's air traffic controllers' organisation or the airport authority but wanted instead to see if it was possible to sue the German federal agencies that gave the orders. The company said that it had to cancel 77 short and medium-distance flights, affecting about 5,000 passengers. Long-haul travellers were not disrupted.\n \n Central to the problem was that instead of half an hour, the arrival of President Bush on the German leg of his European tour took the best part of an hour, Lufthansa said. During that time, restrictions were put on planes taxiing, taking off and landing at Frankfurt's Rhein-Main airport. The extra time taken by President Bush and his entourage meant that there was a knock-on effect that led to significant delays. Mr Lamberty said that 92 outgoing flights and 86 income flights were delayed by an average of an hour following President Bush's arrival, affecting almost 17,000 passengers. Despite the problems, Mr Lamberty said that it was not certain that Lufthansa would take legal action.\n", "llama3.2:1b": ["Lufthansa may sue federal agencies for damages after US president George W Bush disrupted flights at Frankfurt airport, causing cancellations and delays.", "The airline's accounts show millions of euros in potential losses due to the extra time taken by President Bush and his entourage.", "Lufthansa is researching its options but has not planned to sue Germany's air traffic controllers' organisation or the airport authority."], "llama3.2:3b": ["Lufthansa may sue federal agencies in Germany over damages caused by US President George W Bush's visit to Frankfurt airport, resulting in flight cancellations and delays affecting around 5,000 passengers, with potential losses of millions of euros."], "gemma2:2b": ["Lufthansa may sue federal agencies for damages after US President Bush's visit to Frankfurt airport caused flight disruptions.", "The airline estimates a potential loss of millions of euros due to Air Force One landing for an hour longer than expected, leading to cancellations and delays affecting over 5,000 passengers.", "Lufthansa is exploring legal options against German federal agencies responsible for the orders that impacted airport operations."], "qwen2.5:0.5b": ["Lufthansa is suing federal agencies for damages after Air Force One landed in Frankfurt airport, disrupting flights and causing delays.", "The company plans to sue German federal agencies responsible for traffic control and airport authorities but wants to avoid pursuing the German air traffic controllers' organisation or airport authority.", "They had to cancel 77 short- and medium-distance flights and affect almost 17,000 passengers."], "qwen2.5:1.5b": ["German airline Lufthansa may sue for damages over delays caused when US President George W. Bush arrived in Frankfurt on Air Force One, disrupting flights for an hour."], "qwen2.5:3b": ["Lufthansa may sue federal agencies for damages after US president George W Bush's visit disrupted flights at Frankfurt airport.", "The delay affected six out of ten planes using the airport, causing an hour-long disruption leading to cancellations and delays, costing millions.", "Lufthansa has researched possible legal actions but will not sue controllers or airport authorities; instead, it aims to challenge German federal agencies responsible for air traffic orders given during Bush's visit.", "The company canceled 77 short/medium flights affecting about 5,000 passengers, while long-haul travel was unaffected.", "Legal action remains uncertain despite significant disruptions."], "opencoder:1.5b": ["Lufthansa may sue over Bush visit.", "The Federal Reserve Administration (Fed) and German agency may face damages after the arrival of US President George W Bush disrupting flights.", "Lufthansa said it may lose millions due to Air Force One landing at Frankfurt airport.", "The affected flights were cancelled for an hour that was predicted, resulting in cancellations and delays.", "The company uses Frankfurt's airport extensively as well.", "According to research done by Lufthansa, six out of every ten planes used the airport to conduct business.", "\"We are doing research into the possibilities we have,\" Michael Lamberty said on the BBC.", "\"We are checking if there is action to be taken and in which courts it could be taken.\"", "Mr Lamberty explained that he did not intend to pursue Germany's air traffic controllers' organisation or airport authority but wanted instead to see if it was possible to initiate a lawsuit.", "Lufthansa was also required to cancel 77 short and medium-distance flights, affecting about 5,000 passengers.", "During these extended travel hours, restrictions were put on taxiing, taking off and landing at Frankfurt's Rhein-Main airport.", "The extra time taken by President Bush and his entire team meant significant delays.", "The delay in the flights was caused by a knock-on effect that led to increased losses for passengers.", "According to research, it delayed 92 outgoing flights and 86 income flights, affecting almost 17,000 passengers.", "Despite this, the Federal Reserve Administration and German agency confirmed they were not certain of the outcome.", "However, despite these issues, the company said it had no further plans.", "It remains clear that the decision on whether to take legal action depends largely on whether it has a clear path forward in terms of recovering from the delays."], "smollm:1.7b": ["The summary is concise and to the point, capturing the main ideas and key details of the text.", "It provides a brief overview of the events surrounding President Bush's visit to Germany, including the disruption caused by Air Force One landing at Frankfurt Airport, the impact on flights, and the potential legal action Lufthansa may take against German air traffic controllers' organization or airport authority.", "The summary does not include any explanations, no formatting, and no reasoning process."], "deepseek-r1:1.5b": ["Lufthansa may sue for damages after the arrival of President Bush in Germany, causing flight disruptions at Frankfurt airport where planes were delayed for over an hour, affecting 17,000 passengers.", "Lufthansa plans to cancel 77 short/medium-distance flights and has taken legal action against German federal agencies but hasn't confirmed its intent yet."], "tinyllama:1.1b": ["German airline Lufthansa is considering filing lawsuits against federal authorities for damage caused by Air Force One landing at Frankfurt airport, with losses estimated at millions of euros due to delays and cancelled flights.", "The company blamed Air Force One's arrival for interrupting scheduled flight operations, affecting around 700 passengers, 5,000 others who were not affected by the disruption, and prompting cancellations.", "Lufthansa cited a lack of action to be taken against the German air traffic controllers' organisation and airport authority in pursuing Germany's air traffic controllers' organisation or the airport authority.", "The company said it was checking if there is action to be taken, but stressed that they had to cancel 77 short and medium-distance flights affected by Air Force One's arrival, affecting about 5,000 passengers.", "However, Central to the problem was that Air Force One instead of half an hour took a significant amount of flight operations in Frankfurt's Rhein-Main airport, delaying planes taking off and landing.", "Despite the problems, Lufthansa is still considering filing lawsuits against federal authorities for damages caused by the Air Force One's arrival."], "tinydolphin:1.1b": [" A U.S. Air Force Boeing 747 flew into German airspace, causing flight cancellations and delays for passengers at Frankfurt Airport.", "The aircraft's pilot attempted to land on a runway after the arrival of President Bush, disrupting flights and affecting approximately half a million passengers.", "Lufthansa, one of Germany's largest airlines, is now investigating options for seeking compensation, potentially pursuing either Germany's air traffic controllers or the airport authority.", "The company needs to determine if it can sue the federal agencies responsible for giving orders that led to disruptions in flights, affecting about 5,000 passengers and causing cancellations of up to 77 short and medium-distance flights."], "phi:2.7b": [" German airline Lufthansa may sue US federal agencies for damages after a disruption to flights caused by Air Force One's landing at Frankfurt airport.", "The company is exploring possible legal action against the German air traffic controllers' organisation and the airport authority, but has not yet decided to pursue it.", "Lufthansa reported that 77 short- and medium-distance flights were affected, with about 5,000 passengers being affected.", "The extra time taken by President Bush and his entourage caused significant delays, impacting"], "orca-mini:3b": [" Lufthansa may sue federal agencies for damages after President Bush's visit disrupted flights at Frankfurt airport, causing delays and cancellations for 5,000 passengers."], "hermes3:3b": ["Lufthansa possible lawsuit over George W Bush visit disruption, potentially losing millions due to increased flight cancellations and delays caused by Air Force One landing at Frankfurt airport for an extra hour."], "stablelm-zephyr:3b": ["German airline Lufthansa may sue federal agencies for damages after US president George W. Bush disrupted flights at Frankfurt airport.", "The company estimates they could lose millions of euros due to the hour-long landing delay, causing cancellations and delays.", "Lufthansa said it had to cancel 77 short and medium-distance flights, affecting around 5,000 passengers.", "The airline is researching possible legal action against German federal agencies that gave the orders for the disruption."], "stablelm2:1.6b": ["German airline Lufthansa may sue federal agencies for damages due to the disruption caused by US president George W Bush's arrival at Frankfurt airport.", "Flights were affected for an hour on Wednesday morning, causing cancellations and delays, with six out of every 10 Lufthansa planes using the airport.", "Lufthansa accounts for six out of every 10 flights departing from Frankfurt.", "President Bush's longer-than-expected German arrival caused restrictions on planes taxiing, taking off, and landing at the Rhein-Main airport, resulting in significant delays across outgoing and incoming flights.", "However, it is not certain that Lufthansa will pursue legal action."], "granite3.1-dense:2b": ["Lufthansa, accounting for six out of every ten planes at Frankfurt airport, may sue German federal agencies over President George W. Bush's extended 2008 visit.", "The arrival of the US president and his entourage caused an hour-long disruption, leading to 77 flight cancellations and delays for about 5,000 passengers due to taxiing, takeoff, and landing restrictions.", "Lufthansa is investigating legal options, focusing on German federal agencies that issued the orders rather than the air traffic controllers or airport authority.", "While not yet decided, this potential action could result in significant financial losses for the airline."], "chatgpt-4o-latest": ["Lufthansa is considering suing German federal agencies for financial losses caused by flight disruptions during US President George W. Bush's visit.", "The arrival of Air Force One at Frankfurt airport led to an hour-long restriction on flights, double the expected time, resulting in cancellations and delays.", "Lufthansa, which operates most flights at the airport, had to cancel 77 short and medium-distance flights, affecting 5,000 passengers, while nearly 17,000 others faced delays.", "The airline is exploring legal options but has not confirmed whether it will take action."]}