{"raw_text": "Japan turns to beer alternatives\n \n Japanese brewers are increasingly making money from beer-flavoured drinks rather than beer itself\n \n Beer and spirits are heavily taxed in Japan, driving breweries to search for alternatives. Japan's long economic downturn helped drive the trend, as drinkers looked for cheaper opportunities to drown their sorrows. Now, according to Asahi Breweries, the market for so-called \"beer-like\" drinks is set to grow 84% this year.\n \n Asahi is predicting profits to rise 50% in 2005 as it launches a drink based on soybean peptides rather than malt. The chosen name, \"Shinnama\" or \"new draft\", disguises its non-beer nature. But despite a record profit in 2004 of 30.6bn yen ($291m; £154m), up 31.8% on the previous year, Asahi is coming late to the market. Key rival Sapporo is already well-established with the beer-flavoured \"Draft One\". Suntory, meanwhile, is doing well with \"Super Blue\", which combines happoshu - an existing low-cost beer alternative made with malt and seawater - and shochu, a distilled alcohol derived from sweet potatoes or barley. Happoshu has been a mainstay of brewery profits for years, taking over from beer thanks to its low tax and therefore low cost. Kirin, the fourth big name, is launching its own \"third-type\" drink in April.\n", "llama3.2:1b": ["Japanese brewers are turning to alternatives to beer due to heavy taxation and economic downturn, with Asahi Breweries predicting a 50% rise in profits for 2005 based on soybean peptides drinks like Shinnama.", "The market for such beverages is expected to grow by 84% this year, while Asahi has announced plans to launch a drink disguised as beer called Shinnama or \"new draft\"."], "llama3.2:3b": ["Japanese brewers are increasing sales of beer-flavored drinks due to high taxes on beer and spirits, with Asahi predicting a 84% market growth this year and rising profits by 50%.", "Key rival Sapporo's \"Draft One\" already dominates the market, while Suntory's \"Super Blue\" combines beer and shochu for success."], "gemma2:2b": ["Japanese brewers are shifting focus from traditional beer to alternative drinks with beer flavors due to high taxes on alcohol.", "This trend is driven by economic downturn and consumers seeking cheaper options.", "Market for these alternatives is expected to grow significantly.", "Some examples include Asahi's \"Shinnama\", Sapporo's \"Draft One\", Suntory's \"Super Blue\" and Kirin's new \"third-type\" drink."], "qwen2.5:0.5b": ["Japan's brewers are shifting their focus towards more affordable drinks such as \"beer-like\" options instead of traditional beers.", "Asahi Breweries plans to release a soybean peptide-based drink targeting this market.", "Sapporo, already the world leader with beer-flavored products like Draft One, is not on par in 2015 profits and has yet to join the new wave of competitors."], "qwen2.5:1.5b": ["Japanese breweries are expanding into non-alcoholic drinks due to high taxation on alcohol, with a focus on soy-based alternatives and lower-cost versions of traditional beverages like happoshu and shochu.", "This trend aims to capitalize on the economic downturn by offering cheaper options for consumers who previously preferred beer or spirits."], "qwen2.5:3b": ["Japanese brewers are increasingly focusing on non-beer alternatives like soybean peptides-based drinks due to heavy taxes on traditional beer.", "The market for these \"beer-like\" drinks is expected to grow 84% this year.", "Asahi Breweries, already seeing record profits from such drinks, plans a new product disguised as malt-based \"new draft\".", "However, key competitors Sapporo and Suntory have established brands like \"Draft One\" and \"Super Blue\", respectively.", "Kirin also plans to enter the market with its own alternative by April."], "opencoder:1.5b": ["Japan's economic downturn and the shift towards cheaper beer alternatives have driven sales of beer-flavored drinks to skyrocket as compared to beer itself.", "Asahi Breweries are investing heavily in so-called \"beer-like\" drinks market growth is projected to grow 84% this year.", "Asahi's profit uplift has been steady as it launches a drink based on soybean peptides, not malt.", "The chosen name \"Shinnama\" or \"new draft\", disguises its non-beer nature, but despite the high sales record in 2004 of 30.6bn yen ($291m; £154m), up 31.8% on the previous year.", "Key rival Sapporo is already well-established with the beer-flavored \"Draft One\".", "Suntory is doing well with \"Super Blue\", which combines happiness-shu - an existing low-cost beer alternative made with malt and seawater - and shochu, a distilled alcohol derived from sweet potatoes or barley.", "The profit of Happiness shu has been high for years, taking over from beer thanks to its low tax and therefore low cost.", "Kirin is launching its \"third-type\" drink in April."], "smollm:1.7b": ["Japan turns to beer alternatives due to high taxes on traditional beer.", "Japanese brewers are looking for cheaper opportunities to sell their products.", "The market for so-called \"beer-like\" drinks is set to grow 84% this year as breweries launch new drinks based on soybean peptides or other ingredients.", "Key rival Sapporo is already well established with the beer-flavoured \"Draft One\".", "Suntory, meanwhile, is doing well with \"Super Blue\", which combines happoshu - an existing low-cost beer alternative made with malt and seawater - and shochu, a distilled alcohol derived from sweet potatoes or barley.", "Happoshu has been a mainstay of brewery profits for years due to its low tax and therefore low cost.", "Kirin, the fourth big name, is launching its own \"third-type\" drink in April."], "deepseek-r1:1.5b": ["Japanese brewers are increasingly moving towards non-beer products due to government tax regulations, despite Japan facing its economic downturn.", "Asahi Breweries introduced \"Shinnama\" or \"new draft,\" using soybean peptides, aiming for 50% profit growth in 2005.", "Despite this success, they fall behind big names like Sapporo and Suntory.", "Santoro is well-established with \"Super Blue,\" blending Happoshu (a low-cost beer-flavored malt) with shochu.", "Happoshu has been a key revenue source for breweries due to its low taxes."], "tinyllama:1.1b": ["Japanese brewers are increasingly diversifying their product range beyond beer by introducing alternative drinks that replicate the taste and quality of real beers but at a cheaper price, according to Asahi Breweries.", "The market for so-called \"beer-like\" drinks is set to grow this year as consumers are looking for affordable alternatives to their usual brews.", "Asahi has introduced its own brand called \"Shinnama\" that combines beer-flavoared malts and sake, while Suntorry and Saipoor have also launched beer-like products.", "Kirin will release its own third-type drink this April."], "tinydolphin:1.1b": [" Japan's beer market has undergone a shift towards more alternative flavoured beers, known as soybean peptides.", "Asahi Breweries, a major player in the industry, has identified this trend and plans to introduce a \"Shinnama\" (new draft) next year, based on soybean peptides instead of traditional malt.", "The company's forecast for 2005 is that profits will grow by 50% compared to previous years.", "Suntory, another major player in the market, has been successful with its \"Super Blue\" combination of beer and happiness-based soyhu.", "Happoshu, a traditional low-cost drink often derived from sweet potatoes or barley, is still a mainstay of profitability for breweries due to its tax-exempt nature.", "Kirin, the fourth largest beer producer in Japan, is also venturing into the market with its \"third-type\" beer, which will launch in April."], "phi:2.7b": [" Japan's beer industry is turning towards non-beer alternatives due to high taxes on alcohol.", "Asahi Breweries plans to launch a soybean peptide-based beverage called \"Shinnama\", set to grow 84% this year.", "Other companies, such as Sapporo and Suntory, have already established successful low-cost drink options like \"Draft One\" and \"Super Blue\".", "Kirin will also be launching its own \"third-type\" drink in April."], "orca-mini:3b": [" Japan's beer industry is looking for alternative revenue streams as taxes on beer make it a costly option for drinkers.", "Asahi Breweries is launching a drink made from soybean peptides and is late to the market, while other companies are already well-established with beer-flavored alternatives.", "Suntory and Sapporo are using happoshu and shochu, respectively, while Kirin is launching its own third-type drink in April.", "These alternative beverages are cheaper than traditional beer and have become increasingly popular in recent years due to Japan's economic downturn and the desire for cheaper drinks among consumers.", "Asahi Breweries predicts profits will rise 50% this year as it launches a new drink based on soybean peptides."], "hermes3:3b": [" Japan brewers moving away from beer to taxed alternatives\n,\n Beer-alternatives market growing 84% in Japan\n,\n Asahi Breweries: Profits rising 50%, soybean peptide-based \"Shinnama\"<|end_of_text|><|begin_of_text|>Infect"], "stablelm-zephyr:3b": ["In Japan, due to heavily taxed beer and spirits, brewers are turning to beer-flavoured drinks as an alternative source of revenue.", "Asahi Breweries predicts a growth of 84% in this market with the launch of a soybean peptides-based drink in 2005, named \"Shinnama.\"", "Key rivals Sapporo and Suntory have already established successful beer-flavored products.", "Kirin is also launching its own \"third-type\" drink in April."], "stablelm2:1.6b": ["Japanese brewers are shifting focus from traditional beers due to higher taxes on beer and spirits.", "The market for non-beer drinks has grown significantly, with Asahi Breweries predicting a 5% increase this year.", "Asahi's new drink, \"Shinnama,\" is based on soybean peptides, while Sapporo already dominates the market with Draft One.", "Suntory is also successful with their Super Blue drink, combining low-cost beer alternatives and distilled alcohol."], "granite3.1-dense:2b": ["Japanese breweries are shifting focus from traditional beer production to non-beer, beer-flavoured drinks due to high taxes on beer and spirits, exacerbated by Japan's economic downturn.", "Asahi Breweries anticipates an 84% market growth for these \"beer-like\" beverages in 2005, with profits expected to surge 50%.", "They plan to introduce a new product called \"Shinnama,\" based on soybean peptides instead of malt.", "Despite Asahi's late entry into this market, rivals like Sapporo, Suntory, and Kirin are already established with various beer-flavoured alternatives.", "These competitors leverage existing low-cost options such as happoshu (made with malt and seawater) and shochu for their drinks, which have replaced beer due to lower taxes."], "chatgpt-4o-latest": ["Japanese brewers are shifting focus to beer-flavored alternatives due to high beer taxes and economic downturns.", "The market for these drinks is expected to grow 84% in 2005.", "Asahi Breweries anticipates a 50% profit increase with its new soybean-based drink, \"Shinnama,\" despite entering the market late.", "Competitors Sapporo and Suntory already have successful products, such as \"Draft One\" and \"Super Blue,\" which blend happoshu and shochu.", "Happoshu, a low-tax beer alternative, has long driven brewery profits.", "Kirin is also launching its own \"third-type\" drink in April."]}