{"raw_text": "Turkey-Iran mobile deal 'at risk'\n \n Turkey's investment in Iran's mobile industry looks set to be scrapped after its biggest mobile firm saw its investment there slashed by MPs.\n \n Iran's parliament voted by a large majority to cut Turkcell's stake in a new mobile network from 70% to 49%. The move, which was justified on national security grounds, follows an earlier vote by MPs to give themselves a veto over foreign investments. Turkcell said the decision \"increases the risks\" attached to the project. Although the company's statement said it would continue to monitor developments, observers said they thought Turkcell was set to pull out of the $3bn deal. \"The possibility of carrying out this project is next to zero,\" said Atinc Ozkan, analyst at Finans Investment in Istanbul. If Turkcell does back out, MTN - the South African firm which lost out in the original tender - may well be back in the running. The company has said it is prepared to accept a minority stake if Iran will award it the mobile deal.\n \n Turkcell's mobile deal is the second Turkish investment in Iran to run into trouble. Turkish-Austrian consortium TAV was chosen to build and run Tehran's new Imam Khomeini International Airport - but the army closed it just hours after it opened in May 2004. In both cases, the justification has been national security, amid allegations that the Turkish firms are too close to Israel. The hardline posture taken by parliament, which is dominated by religious conservatives, could yet impact other inward investments.\n", "llama3.2:1b": ["Turkey's mobile firm Turkcell's investment in Iran is set to be scrapped due to a 70% stake being cut from 49%.", "The move was justified on national security grounds, but observers believe it increases the risks attached to the project and may lead to the company pulling out.", "If Turkcell does back out, MTN could take the deal, which is worth $3bn."], "llama3.2:3b": ["Turkey's investment in Iran's mobile industry may be scrapped after MPs slashed Turkcell's stake from 70% to 49% on national security grounds, with observers predicting the company will pull out of the $3bn deal."], "gemma2:2b": ["Turkey's Turkcell investment in Iran's mobile industry faces potential cancellation due to parliament's decision to reduce Turkcell's stake and give itself a veto over foreign investments.", "This move threatens the $3 billion deal and may lead to MTN's re-entry into the competition, while potentially impacting other Turkish investments in Iran."], "qwen2.5:0.5b": ["A major Turkish investment in Iran's mobile industry has been scrapped after MPs voted to cut Turkcell's stake by 49%.", "This decision was justified on security grounds but could have significant consequences for Turkey's relations with Iran and the international community.", "If Turkcell pulls out of the project, MTN (South African firm) might still be interested in the deal due to its strong support from the US government."], "qwen2.5:1.5b": ["Turkey's investment in Iran's mobile industry faces risk due to MPs slashing Turkcell's stake from 70% to 49%, citing national security and giving themselves veto power over foreign investments.", "If Turkcell pulls out, MTN might take its place.", "This comes after a Turkish-Austrian consortium failed to build Tehran airport.", "The move could impact other inward investments by Turkey due to parliament's hardline stance."], "qwen2.5:3b": ["Turkey's investment in Iran's mobile industry appears threatened after Turkcell saw its stake slashed from 70% to 49%.", "This follows a parliamentary vote giving them veto power over foreign investments and concerns about national security.", "Analysts believe Turkcell is likely to abandon the $3bn deal, potentially allowing MTN to re-enter.", "This marks Turkey's second investment in Iran facing national security objections; TAV was prevented from operating Tehran airport due to similar allegations of close ties with Israel.", "The hardline stance by religious conservatives could affect other potential investments."], "opencoder:1.5b": ["Turkey-Iran's mobile deal 'at risk'\n\nAfter its biggest mobile firm saw an investment there slashed by MPs, Turkey's investment in Iran's mobile industry has been scrapped.", "The move, justified on national security grounds, follows an earlier vote by MPs to give themselves a veto over foreign investments.", "According to the company's statement, the decision \"increases the risks\" attached to the project.", "While the company’s statement said it would continue to monitor developments, observers believe that Turkcell was set to pull out of the $3bn deal.", "As a result, they think Turkcell could pull out of the deal if they do back out.", "If not, other investors may still be willing to accept a minority stake if Iran will award it the mobile deal."], "smollm:1.7b": ["The summary of the text above should be:\n\nTurkey-Iran mobile deal 'at risk'\n\nTurkcell's investment in Iran's mobile industry looks set to be scrapped after its biggest mobile firm saw its investment there slashed by MPs.", "Iran's parliament voted by a large majority to cut Turkcell's stake in a new mobile network from 70% to 49%.", "The move, which was justified on national security grounds, follows an earlier vote by MPs to give themselves a veto over foreign investments.", "Turkcell said the decision \"increases the risks\" attached to the project.", "Although the company's statement said it would continue to monitor developments, observers said they thought Turkcell was set to pull out of the $3bn deal.", "\"The possibility of carrying out this project is next to zero,\" said Atinc Ozkan, analyst at Finans Investment in Istanbul.", "If Turkcell does back out, MTN - the South African firm which lost out in the original tender - may well be back in the running.", "The company has said it is prepared to accept a minority stake if Iran will award it the mobile deal.", "The Turkish-Austrian consortium TAV was chosen to build and run Tehran's new Imam Khomeini International Airport - but the army closed it just hours after it opened in May 2004.", "In both cases, the justification has been national security, amid allegations that the Turkish firms are too close to Israel.", "The hardline posture taken by parliament, which is dominated by religious conservatives, could yet impact other inward investments."], "deepseek-r1:1.5b": ["Turkish Mobile Investment (Turkcell) is cutting its investment in Iran's mobile industry, following a vote by Iran's parliament.", "The company's decision was justified by national security grounds but faced skepticism.", "Turkcell said it would monitor developments, while others like TAV are evaluating the $3 billion deal over concerns about being too close to Israel and potential internal tensions."], "tinyllama:1.1b": ["Turkcell's mobile deal has come under scrutiny after Iranian lawmakers voted down its investment in the country.", "Turkey's biggest mobile company saw a stake in Iran's new mobile network slashed to 49%, while MPs also voted to cut Turkcell's shareholding from 70% to 49%.", "This move is viewed as increasing the risk for the project, with observers suggesting that Turkcell may back out or be forced to accept a minority stake.", "The consortium awarded to Turkey by Iran's authorities has faced similar accusations of security concerns, and justification of this latest decision seems to be linked to national security.", "The country is also seen as being cautious about foreign investments in the wake of recent events."], "tinydolphin:1.1b": [" The paragraph describes a situation where Turkish investment in Iran's mobile industry appears to be at risk due to parliamentary decisions that reduce the stake of Turkcell, the biggest mobile firm in the deal.", "The reasons for the reduction are not specified but are seen as related to national security concerns.", "This has led some observers to believe that Turkcell may pull out of the project and consider other investments in the future."], "phi:2.7b": [" Turkey's largest mobile operator planned to withdraw from its $3 billion investment in Iran's mobile industry due to a new law giving MPs the power to veto foreign investments and concerns about national security after their stake was reduced by 70% to 49%.", "If Turkcell pulls out, South African firm MTN may have a better chance of winning the deal.", "This is not the first time a Turkish investment in Iran has encountered trouble; TAV, which was chosen to build Tehran's new Imam Khomeini International Airport, faced opposition from the Iranian military.", "The government has cited concerns about foreign influence and relations with Israel as justification for the decision.", "This could impact other investments made by Turkey in Iran in the future."], "orca-mini:3b": [" Turkey's $3 billion mobile deal with Iran is at risk after its biggest firm saw its investment cut by parliament.", "Lawmakers voted by a large majority to reduce Turkcell's stake in a new mobile network from 70% to 49%.", "The move was justified on national security grounds, and observers believe Turkcell may be set to pull out of the deal.", "MTN was also involved in the original tender but lost out to Turkcell.", "The consortium has expressed interest in accepting a minority stake in the project if Iran will award it to them."], "hermes3:3b": ["Turkey-Iran mobile deal at risk\nTurkcell investment slashed by Iran's parliament\nIncreased risks for Turkey's mobile deal in Iran\nParliament cuts Turkcell stake from 70% to 49%\nNational security grounds cited for decision"], "stablelm-zephyr:3b": ["Turkey's investment in Iran's mobile industry might not happen because Iran's parliament voted to reduce Turkcell's stake from 70% to 49%.", "This decision was made to protect national security, and some people think Turkcell might leave the project.", "If they do, another company called MTN from South Africa could have a chance to be involved.", "In the past, Turkey invested in building an airport with Iran, but it didn't work out well because of similar security concerns."], "stablelm2:1.6b": ["A mobile deal between Turkey and Iran, involving Turkey's largest mobile firm, Turkcell, appears at risk after MPs slashed Turkcell's stake in a new mobile network from 10% to 20%.", "The move was justified on national security grounds following an earlier vote by MPs to give themselves a veto over foreign investments.", "If Turkcell pulls out of the $3bn deal with South African firm MTN, it may be possible for them to re-enter the project.", "This is the second Turkish investment in Iran to face difficulties due to national security concerns."], "granite3.1-dense:2b": ["Turkey's primary mobile investment in Iran, held by Turkcell, faces cancellation due to a parliamentary vote reducing its stake from 70% to 49%.", "This decision, motivated by national security concerns, increases project risks and makes it nearly impossible for Turkcell to proceed.", "Analysts predict MTN might now secure the contract, accepting a minority stake if offered.", "This is not the first Turkish investment in Iran to face issues; TAV's project to build Tehran's Imam Khomeini International Airport was also terminated due to national security fears of Israeli ties.", "The hardline stance of parliament, controlled by religious conservatives, may deter future inward investments."], "chatgpt-4o-latest": ["Turkey's investment in Iran's mobile industry is in jeopardy after Iran's parliament reduced Turkcell's stake in a new mobile network from 70% to 49%, citing national security concerns.", "This follows an earlier decision granting MPs veto power over foreign investments.", "Turkcell acknowledged increased risks and may withdraw from the $3bn deal, with analysts predicting its exit.", "If Turkcell pulls out, South Africa's MTN, which lost the original bid, may re-enter negotiations.", "This is the second Turkish investment in Iran to face obstacles, following the closure of Tehran's new airport by the army in 2004.", "Both cases were justified on national security grounds, with concerns over Turkish firms' alleged ties to Israel.", "Iran's conservative-dominated parliament's stance may deter further foreign investments."]}