{"raw_text": "ID theft surge hits US consumers\n \n Almost a quarter of a million US consumers complained of being targeted for identity theft in 2004, official figures suggest.\n \n The Federal Trade Commission said two in five of the 635,173 reports it had from consumers concerned ID fraud. ID theft occurs when criminals use someone else's personal information to steal credit or commit other crimes. Internet auctions were the second biggest source of fraud complaints, comprising 16% of the total. The total cost of fraud reported by consumers was $546m (£290m).\n \n The report marks the fifth year in a row in which identity fraud has topped the table. The biggest slice of the 246,570 ID fraud cases reported - almost 30% - concerned abuses of people's credit. Misusing someone's identity to claim new credit cards or loans comprised 16.5% of the total, with almost 12% coming from false claims on existing credit. Another 18% came from attempts to rip off people's bank accounts, while 13% of cases concerned attempts to defraud employers by abusing someone else's identity. Outside the field of ID theft, 53% of the near-400,000 complaints were internet-related. Among the 100,000 internet auction complaints, the failure of sellers to deliver or the supply of sub-standard goods were the most common woes reported. Catalogue and home-shopping frauds were next in line, accounting for 8% of total complaints, while concerns about internet services and computers - including spyware found on people's PCs and undisclosed charges for websites - amounted to 6% of complaints.\n", "llama3.2:1b": ["Almost 250,000 US consumers reported identity theft in 2004, with two in five reports involving online auctions, followed by credit fraud cases totaling $546m (£290m) in cost."], "llama3.2:3b": ["Almost a quarter of a million US consumers reported being targeted for identity theft in 2004, with the total cost of fraud at $546m.", "Internet auctions were the second biggest source of complaints, accounting for 16% of cases.", "Identity abuse via credit accounts was the most common type of ID fraud, making up almost 30% of cases."], "gemma2:2b": ["246,570 US consumers reported being victims of identity theft in 2004, with the cost reaching $546 million.", "The majority of cases (30%) involved abuse of credit.", "Internet auctions were second most-reported source of fraud, while internet sales and computer issues also accounted for a significant number of complaints."], "qwen2.5:0.5b": ["The Federal Trade Commission (FTC) reports that two out of every five US consumers reported being targeted for identity theft in 2004, amounting to almost a quarter of a million cases.", "The report notes that ID fraud is the second most common type of fraud among the general population after credit card fraud, with approximately 16% of online complaints related to it.", "Misusing someone's personal information to obtain new credit or loans was reported by two out of every five consumers involved in this activity.", "Credit card fraud accounts for about 30% of ID fraud cases involving credit cards, followed by false claims on existing credit (12%), attempts to rip off people's bank accounts (18%), and attempts to defraud employers by abusing someone else's identity (16%).", "ID theft encompasses a wide range of fraudulent activities, including online auctions, the failure of sellers to deliver goods, catalog and home-shopping frauds, spyware found on people's PCs, undisclosed charges for websites, computer software piracy, and other internet-related issues.", "Internet auction complaints accounted for 8% of total ID fraud cases reported by consumers."], "qwen2.5:1.5b": ["ID theft surged by a quarter million cases, affecting nearly a fifth of US consumers who reported identity fraud in 2004.", "The FTC received reports from over 635,000 individuals.", "Internet auctions were the second-largest source of fraud complaints.", "Credit abuse and false claims on existing credit topped ID fraud statistics at 30% each.", "ID theft costs $546 million or £290 million in total reported by consumers.", "The report marks the fifth consecutive year with identity fraud being the most complained-about issue."], "qwen2.5:3b": ["ID theft surge hits US consumers: In 2004, nearly 250,000 US consumers reported being targeted by identity thieves, with ID fraud reports topping five years in a row.", "Two out of every five consumer complaints (16%) were related to internet auctions.", "Total cost was $546m (£290m).", "Major areas affected: misuse of credit (30%), false claims on existing credit (12%), bank account abuse (18%), and employer fraud attempts (13%).", "Outside ID theft, nearly half (53%) of 378,000 complaints were internet-related.", "Common issues: sellers failing to deliver or providing substandard goods (internet auctions), fraudulent catalogues and home shopping scams (8% each), and concerns about internet services/PC spyware/disclosed charges for websites (6%)."], "opencoder:1.5b": ["\"ID theft surge hits US consumers nearly a quarter of million Americans complained of being targeted for identity theft in 2004.", "The Federal Trade Commission (FTC) reported two in five fraudulent reports from consumers concerned with ID fraud.", "Internet auctions were the second biggest source of fraud complaints comprising 16% of total.", "The cost of fraud reported by consumers was $546 million and $290 million respectively (£290 million).", "The report marks the fifth year in a row where identity fraud has topped the table, contributing almost 30% to concerned abuses of people's credit.", "Misusing someone's identity to claim new credit cards or loans accounted for 16.5% of total, with about 12% coming from false claims on existing credit and another 18% occurred from fraudulent employment attempts, while employers were also concerned with defraud attempts.\""], "smollm:1.7b": ["The summary is concise and clear, preserving the key ideas and details from the original text.", "The main points are:\n\n1.", "Almost a quarter of a million US consumers complained of being targeted for identity theft in 2004.", "2.", "The Federal Trade Commission (FTC) said two in five of the 635,173 reports it had from consumers concerned ID fraud.", "3.", "The total cost of fraud reported by consumers was $546 million (£290 million).", "4.", "The biggest slice of the 246,570 ID fraud cases - almost 30% - concerned abuses of people's credit.", "Misusing someone's identity to claim new credit comprised 16.5% of the total.", "Another 18% came from false claims on existing credit.", "5.", "The second biggest slice of the 246,570 ID fraud cases - almost 12% - concerned attempts to rip off people's bank accounts.", "6.", "The third biggest slice of the 246,570 ID fraud cases - almost 8% - came from attempts to defraud employers by abusing someone else's identity.", "7.", "Outside the field of ID theft, 53% of the near-400,000 complaints were internet-related.", "Among the 100,000 internet auction complaints, the failure of sellers to deliver or the supply of sub-standard goods were the most common woes reported.", "The summary captures the main points from the original text, including the key ideas and details about the ID theft surge in 2004, the Federal Trade Commission's (FTC) report on ID fraud complaints, and the various types of ID fraud scams that affected consumers.", "The summary is concise and easy to understand, making it a good tool for readers who want to quickly grasp the main points from the original text."], "deepseek-r1:1.5b": ["Almost a quarter million US consumers complained about being targeted for identity theft in 2004, according to official figures.", "The Federal Trade Commission reported two out of five reports from 635,173 consumers due to ID fraud.", "Identity theft occurs when criminals use personal information for other crimes like online auctions, which were the second largest source of complaints, accounting for 16% of total fraud complaints.", "Total fraud costs were $546 million (£290 million).", "The report ranks ID fraud as a major issue, with nearly 30% involving identity abuse, including misusing credit cards or loans, false claims on existing credit, bank account fraud, and employer-related fraud.", "Outside the field of ID theft, internet-related complaints were almost half of all reported issues, with common problems like seller failures or substandard goods.", "Common frauds include catalogue and home-shopping fraud at 8%, as well as computer concerns like spyware and website charges at 6%."], "tinyllama:1.1b": ["Despite the efforts of consumer protection agencies across the United States, identity theft continues to be a major concern among consumers.", "In 2004, almost a quarter of all ID fraud reports concerned identity theft, accounting for nearly 25% of total cases reported.", "The top source of ID fraud was online auction sites, while false claims on credit cards made up the second-largest chunk of cases.", "Misusing an existing credit account was also a significant issue (16.5%), as was attempts to rip off bank accounts or defraud employers through abuse of someone else's identity (13%).", "Internet-related complaints accounted for 400,000 total reports, making up 29% of the cases reported in 2004.", "Catalogue and home-shoppping frauds, including failure to deliver goods or subpar quality, were the most common woes reported.", "Catalogue and home-shopping services and computers were also a significant source of complaints, with spyware found on people's PCs and undisclosed charges for websites accounting for 6% of total complaints."], "tinydolphin:1.1b": [" The ID theft surge has pushed consumer complaint numbers to a new high in recent years, with the Federal Trade Commission receiving around 200,000 reports per year from individuals who experienced ID theft and reported it to the FTC.", "This spike in fraud incidents is due to the rise of internet auctions being the second most common source for identity theft complaints, comprising over a quarter of the total.", "The report also reveals that over 30% of all cases involved misusing people's credit, making it the most popular category of fraud.", "Misplaced claims on existing credit cards and loans accounted for almost 16% of the total, with employer fraud coming in at around 12%.", "The highest percentage of complaints came from attempts to defraud employers by misusing someone else's identity or stealing personal information."], "phi:2.7b": [" The FTC's report shows that almost a quarter million US consumers complained of identity theft in 2004. Credit abuse was the most common form of fraud, accounting for 30% of cases.", "Internet auctions were the second biggest source of complaints, with 16% of all complaints.", "Misusing someone else' s personal information to commit credit card fraud is also on the rise."], "orca-mini:3b": [" The US Consumer Report found that almost a quarter of a million consumers complained of identity theft in 2004, with internet auctions being the second biggest source of fraud.", "Misusing someone's identity to claim new credit cards or loans was the largest category, accounting for almost 30% of all complaints.", "Another 18% came from attempts to defraud employers by abusing someone else's identity, while 13% of cases concerned attempts to rip off people's bank accounts.", "The remaining 53% of the near-400,000 complaints were internet-related."], "hermes3:3b": ["US consumers reported over 250k cases of identity theft in 2004\nFTC reports 2/5 reports were related to ID fraud\nCost of reported fraud was $546m, internet auctions second biggest source of fraud complaints"], "stablelm-zephyr:3b": ["ID theft surge in US, with nearly 250,000 reports in 2004; FTC figures reveal fraud costing $546m.", "Internet auctions became second biggest source of fraud complaints, totaling 16%.", "ID fraud has topped the table for five consecutive years.", "Credit abuse (30%) and false claims on existing credit (16.5%), bank accounts (18%), and attempts to defraud employers (13%) were among the most common cases.", "Outside of ID theft, 53% of nearly 400,000 complaints were internet-related."], "stablelm2:1.6b": ["Almost a quarter of a million US consumers reported being targeted for ID fraud in 2014, with two in five of the cases being reported by the Federal Trade Commission.", "The majority (83%) of cases were internet-related, including fraudulent activities on auction sites and catalogues.", "Misuse of credit and bank accounts, as well as attempts to defraud employers and charge undisclosed fees for websites or online services, constituted 52% of ID fraud complaints."], "granite3.1-dense:2b": ["In 2004, nearly 250,000 US consumers reported identity theft to the Federal Trade Commission, accounting for two-fifths of all reports (635,173).", "This represented a fifth annual surge in ID fraud.", "The primary methods involved misusing personal information for credit (30%), false claims on existing credit (16.5%), and bank account fraud (12%).", "Additional tactics included defrauding employers (18%) through identity abuse, and 13% concerned attempts to deceive employers with stolen identities.", "Outside ID theft, internet-related complaints made up 53%, primarily due to seller non-delivery or subpar goods in online auctions (27%), catalog fraud (8%), and concerns about internet services and computer issues (6%)."], "chatgpt-4o-latest": ["Nearly 250,000 US consumers reported identity theft in 2004, according to the Federal Trade Commission, with ID fraud making up two in five of the 635,173 complaints received.", "The most common type involved credit-related abuses, including fraudulent new credit cards or loans (16.5%) and false claims on existing credit (12%).", "Bank account fraud accounted for 18%, while 13% involved employment-related identity misuse.", "Internet auctions were the second-largest fraud category, making up 16% of complaints, with sellers failing to deliver or providing substandard goods.", "Overall, fraud cost consumers $546 million.", "Internet-related issues comprised 53% of non-ID theft complaints, including catalogue fraud (8%) and concerns over internet services and spyware (6%).", "This marked the fifth consecutive year that identity fraud topped the complaint list."]}