{"raw_text": "Yukos accused of lying to court\n \n Russian oil firm Yukos lied to a US court in an attempt to stop the Russian government selling off its key production unit, the court has heard.\n \n The unit, Yugansk, was sold to pay off a $27.5bn (£14.5bn) back tax bill. Yukos argued that since it had a US subsidiary and local bank accounts, the US court could declare it bankrupt and stop the auction of Yugansk. But Deutsche Bank - itself a target of a Yukos lawsuit - said documents had been backdated to strengthen the case.\n \n Deutsche Bank's evidence came on the first day of a two-day hearing in Houston. Its lawyer, Hugh Ray, told the court that Yukos had claimed it had transferred $27m into two Texas bank accounts opened by its new US subsidiary. By doing so, he said, the firm had intended to reinforce its US presence - and thus its chances of getting its case heard in US courts. But he said that the papers documenting the transaction were not drawn up till weeks after Yukos made its bankruptcy application on 14 December, and then backdated.\n \n Yukos chief financial officer Bruce Misamore, who had moved to the US in early December to set up Yukos USA, acknowledged the point. He said the discrepancy was only in the paperwork, but that money had indeed been transferred on 14 December. Even so, he told the court that only $480,000 had been in the accounts that day, with the rest arriving a day later.\n \n Deutsche Bank is involved in the case because it is itself being sued by Yukos. It had agreed to loan to an arm of Russian state gas firm Gazprom the money to bid for Yuganskneftegaz, as the Yukos unit is formally known. The sale went ahead, despite an order from the US bankruptcy court ordered that it should be stopped. In the end, the auction was won by an unknown shell company for $9.4bn - much less than most assessments of its value - before ending up in the hands of state-controlled oil firm Rosneft. Rosneft, meanwhile, has agreed to merge with Gazprom, bringing a large chunk of Russia's very profitable oil business back under state control.\n \n Yukos maintains that it filed for bankruptcy in the US because it feared it would not be able to do so in Russia. It also said that in the event of going bust, it could offer the chance of restructuring. \"It gives us a kind of life after death alternative,\" said Yukos chief executive Steven Theede. Yukos is currently suing four companies - Gazprom, its unit Gazpromneft, Rosneft and the shell company which won the bidding - for their part in Yugansk's disposal. It has also threatened to sue the Russian government for $28bn. Analysts have questioned whether a US court has any jurisdiction over Russian companies, while Moscow officials have dismissed Yukos' legal wrangling as meaningless. Yukos claims that the rights of its shareholders have been ignored and that is has been punished for the political ambitions of its founder Mikhail Khodorkovsky. Mr Khodorkovsky, once Russia's richest man, is in prison, having been charged with fraud and tax evasion and repeatedly denied bail.\n", "llama3.2:1b": ["Russian oil firm Yukos has accused a US court of lying to stop the sale of its production unit Yugansk due to concerns over bankruptcy in Russia.", "Yukos claims it filed for bankruptcy in the US but was unable to do so in Russia, where it had been sold as part of a $27.5bn debt repayment plan.", "However, the US court ruled that Yukos could not declare itself bankrupt and stop the auction process.", "The US bank, Deutsche Bank, provided evidence that documents supporting Yukos' claims were backdated to prevent bankruptcy proceedings from affecting its US operations."], "llama3.2:3b": ["Yukos accused of lying to a US court about transferring funds into US bank accounts.", "The Russian oil firm had claimed the transfer was made to reinforce its US presence, but documents were backdated.", "Yukos chief financial officer acknowledged the discrepancy, stating that only $480,000 was in the accounts on the day of the alleged transaction."], "gemma2:2b": ["Yukos oil firm was accused of lying to a US court in an attempt to block the sale of its key production unit, Yugansk.", "Yukos argued that it could declare bankruptcy and stop the auction if the court agreed but evidence from Deutsche Bank, who is also suing Yukos, showed that documents related to money transfers were backdated.", "Yukos admitted the discrepancies in paperwork but claimed that funds were transferred on 14 December, while a US court had already ordered a halt to the sale.", "The sale of Yugansk eventually went ahead and was won by a shell company for a much lower price than its estimated value, which ultimately ended up being controlled by Rosneft under state control.", "Yukos claims this was done intentionally against them and that their rights were ignored."], "qwen2.5:0.5b": ["Russian oil firm Yukos allegedly lied to a US court about its ownership of Yugansk, a production unit sold to stop the Russian government from selling it off.", "The company argues the document backing the sale was backdated before being presented at trial, but Deutsche Bank's lawyer reveals the documents were not drawn up until weeks after Yukos made bankruptcy application in December, despite the paperwork being filed on 14 December.", "Yukos claims it has no such jurisdiction in Russia and is currently suing other companies for Yugansk's disposal, as well as the Russian government."], "qwen2.5:1.5b": ["Yukos lied to US court to prevent government from selling off key production unit; Deutsche Bank evidence weakens case against Russian firm."], "qwen2.5:3b": ["Russian oil firm Yukos attempted to prevent the sale of its Yugansk unit by falsely claiming it had a US presence and could be declared bankrupt there.", "Deutsche Bank provided evidence showing that documents supporting this claim were backdated.", "Despite allegations, Yukos transferred money from a new US subsidiary's account to strengthen its case.", "The sale proceeded despite an American bankruptcy court order.", "The transaction was made through Rosneft, which bought Yugansk for less than expected before transferring it to Gazprom, another state-controlled firm.", "Yukos sued multiple parties including the Russian government and claimed shareholders' rights were ignored.", "The company's legal challenges are met with skepticism by both analysts and Moscow officials, who view them as efforts related to Khodorkovsky's imprisonment."], "opencoder:1.5b": ["Yukos accused of lying to court, the Russian oil firm said that the unit, Yugansk, was sold to pay off a $27.5bn (£14.5bn) back tax bill.", "The US court has heard documents indicating that Deutsche Bank had been involved in the case and that money had been transferred on 14 December.", "The discrepancy was only in the paperwork but not due to any particular reason.", "The case ended up with a loss for Russia, with Rosneft merging with Gazprom, bringing back the very profits of its business."], "smollm:1.7b": ["The summary above captures the main ideas from the text:\n\n1.", "Yukos accused of lying to court: The Russian oil firm Yukos lied to a US court in an attempt to stop the Russian government selling off its key production unit, Yuganskneftegaz.", "2.", "Russian oil firm Yukos lied to a US court in an attempt to stop the Russian government selling off its key production unit, Yuganskneftegaz: The US court had no evidence that Yukos had transferred $27m into two Texas bank accounts opened by its new US subsidiary, Yuganskneftegaz.", "3.", "Deutsche Bank's evidence came on the first day of a two-day hearing in Houston: Deutsche Bank presented evidence that Yukos had claimed it had transferred $27m into two Texas bank accounts opened by its new US subsidiary, Yuganskneftegaz.", "However, the documents were not dated until weeks after Yukos made its bankruptcy application on 14 December.", "4.", "Yukos chief financial officer Bruce Misamore acknowledged the point: Yukos had agreed to loan to an arm of Russian state gas firm Gazprom the money to bid for Yuganskneftegaz, but only if it was sold in Russia.", "The sale went ahead despite an order from the US bankruptcy court that it should be stopped.", "5.", "Yukos maintains that it filed for bankruptcy in the US because it feared it would not be able to do so in Russia: Yukos claimed that it feared it would not be able to file for bankruptcy in Russia, which is a more lenient jurisdiction than the US.", "6.", "Yukos' legal wrangling was seen as meaningless by analysts: Analysts questioned whether a US court had any jurisdiction over Russian companies and argued that Yukos' legal wrangling was pointless given the lack of evidence.", "7.", "Yukos threatened to sue the Russian government for $28bn: Yukos claimed that the rights of its shareholders have been ignored and that it has been punished for the political ambitions of its founder Mikhail Khodorkovsky.", "8.", "The US court had no evidence that Yukos had transferred $27m into two Texas bank accounts opened by its new US subsidiary, Yuganskneftegaz: The US court did not have any evidence to support this claim and it was unclear what evidence would be presented in the event of a trial.", "9.", "Deutsche Bank's evidence came on the first day of a two-day hearing in Houston: Deutsche Bank presented evidence that Yukos had claimed it had transferred $27m into two Texas bank accounts opened by its new US subsidiary, Yuganskneftegaz.", "However, the documents were not dated until weeks after Yukos made its bankruptcy application on 14 December.", "10.", "Yukos chief financial officer Bruce Misamore acknowledged the point: Yukos had agreed to loan to an arm of Russian state gas firm Gazprom the money to bid for Yuganskneftegaz, but only if it was sold in Russia.", "The sale went ahead despite an order from the US bankruptcy court that it should be stopped."], "deepseek-r1:1.5b": ["Yukos lied to a U.S. court in 2018 to stop selling its production unit, Yuganskneft, which was supposed to pay off $27.5 billion in taxes but instead sold to a shell company for much less.", "Yukos claimed it had US subsidiaries and bank accounts, claiming bankruptcy could stop the sale.", "The firms were involved in the case after documents showed funds transfered by December 14th, with only partial funds on file.", "The court upheld their request for restructuring or bankruptcy.", "Yuki moved to the U.S., but now is suing Gazprom, Rosneft, and four shell companies for Yuganskneft's sale, threatening $28 billion in lawsuits from Russia.", "There are questions about US jurisdiction over Russian companies and Yukos' legal wrangling."], "tinyllama:1.1b": ["In a court hearing held in Houston, the American firm Deutsche Bank argued that Russian oil giant YuKos lied to the US bankruptcy court when it claimed that it had transferred $27m into two Texas bank accounts opened by its new US subsidiary.", "However, Deutsche Bank's lawyer Hugh Ray presented evidence that YuKos had backdated documents to strengthen its case for bankruptcy in the US courts.", "The dispute has implications for the Russian government and Russia's state-controlled oil business, as YuKos claims that it faced punishment due to Khodorkovsky's political ambitions and imprisonment."], "tinydolphin:1.1b": [" Yukos accused of lying to court for seizing control of Russian oil assets, claiming that they had transferred funds into unregistered US subsidiaries, while Deutsche Bank backdated documents to weaken its case in the US bankruptcy proceedings against it.", "The lawsuit is an attempt to recover $27 billion in taxes owed by the now-bankrupt Russian oil firm Yugansk."], "phi:2.7b": [" Yukos, a Russian oil firm, accused of lying to US court by Deutsche Bank in an attempt to prevent the selling of its key production unit, Yugansk, for $27.5 billion back taxes.", "The company claimed that it had a US subsidiary and local bank accounts, but the evidence presented showed the transactions were backdated.", "Yukos' CEO, Steven Theede, said this was because they feared not being able to do so in Russia.", "The sale of Yugansk went ahead and resulted in an unknown shell company winning for $9.4 billion.", "Yukos is currently suing four companies involved in the sale and has also threatened to sue the Russian government for $28bn.", "However, Yukos claims their legal rights have been ignored, and its founder Mikhail Khodorkovsky, once Russia's richest man, is in prison."], "orca-mini:3b": [" Yukos was accused of lying to a US court to stop the Russian government selling off its key production unit, Yugansk.", "The unit was sold for $9.4 billion despite an order from the US bankruptcy court to stop the auction.", "Yukos argued that it could not be bankrupt in Russia and offered a chance to restructure.", "However, Deutsche Bank accused Yukos of backdating documents to strengthen its case.", "Yukos's CFO acknowledged the discrepancy but claimed only $480,000 was in the accounts on the day of the transaction.", "The auction was won by an unknown shell company for $9.4 billion before being merged with Gazprom, bringing a large chunk of Russia's profitable oil business back under state control.", "Yukos maintains that it filed for bankruptcy in the US because it feared it would not be able to do so in Russia and claimed that the rights of its shareholders had been ignored.", "It has also threatened to sue the Russian government for $28 billion."], "hermes3:3b": ["Yukos claims US court Yukos lied about bank transfers to avoid Russian tax sale of Yugansk oil unit."], "stablelm-zephyr:3b": ["Russian oil firm Yukos was accused of lying to a US court regarding its attempt to halt the Russian government's sale of its key production unit, Yugansk, which was sold to pay off a $27.5bn back tax bill.", "Yukos argued that having a US subsidiary and local bank accounts allowed the court to declare bankruptcy and stop the auction of Yugansk.", "However, Deutsche Bank, targeted by a Yukos lawsuit, presented evidence suggesting that documents were backdated to strengthen the case.", "The situation raises questions about whether a US court has jurisdiction over Russian companies and claims of shareholder rights being ignored due to political motivations."], "stablelm2:1.6b": ["Yukos, a Russian oil firm, was accused of lying to a US court to prevent the government from selling its production unit.", "The company argued that since it had a US subsidiary, local bank accounts, and documents backdated, the US court could declare them bankrupt.", "Yukos claimed it transferred $5 million into two Texas bank accounts opened by its new US subsidiary but the paperwork was not properly completed.", "Deutsche Bank, which was involved in the case due to being sued by Yukos, said that the documents were backdated to strengthen the case.", "The sale of Yugansk went ahead despite an order from the US bankruptcy court that it should be stopped."], "granite3.1-dense:2b": ["Russian oil firm Yukos lied to a US court regarding the transfer of $27 million into two Texas bank accounts by its new US subsidiary, as part of an attempt to prevent Russia from selling off Yugansk, a key production unit valued at approximately $9.4 billion to pay off debts and avoid bankruptcy.", "Deutsche Bank, sued by Yukos for the loan that enabled Gazprom to bid for Yuganskneftegaz, presented evidence showing the transaction documents were backdated to strengthen Yukos' case.", "The court heard that only $480,000 was in the accounts on the day of alleged transfer, with the rest arriving later.", "Deutsche Bank is one of four defendants sued by Yukos for its role in Yugansk's sale.", "Yukos claims it filed for US bankruptcy due to concerns about not being able to do so in Russia and as a means for potential restructuring, while its founder, Mikhail Khodorkovsky, is imprisoned on fraud charges related to his political ambitions.", "Analysts question the US court's jurisdiction over Russian entities, and Moscow dismisses Yukos' legal actions as insignificant."], "chatgpt-4o-latest": ["Yukos, a Russian oil firm, was accused of lying to a US court to prevent the Russian government from selling its key production unit, Yugansk, to cover a $27.5bn tax bill.", "Yukos claimed US jurisdiction by transferring money to Texas bank accounts, but Deutsche Bank argued that documents were backdated to support this claim.", "Yukos CFO Bruce Misamore admitted paperwork discrepancies but insisted the transfer occurred.", "Deutsche Bank, sued by Yukos, had financed Gazprom’s bid for Yugansk, which was ultimately sold to a shell company for $9.4bn and later acquired by state-controlled Rosneft.", "Yukos argued it filed for US bankruptcy to enable restructuring and is suing multiple entities involved in the sale.", "Analysts doubt US jurisdiction, while Moscow dismisses Yukos' legal actions.", "Yukos claims political persecution, linking its troubles to its founder Mikhail Khodorkovsky, who is imprisoned for fraud and tax evasion."]}