{"raw_text": "Mexican in US send $16bn home\n \n Mexican labourers living in the US sent a record $16.6bn (£8.82bn) home last year.\n \n The Bank of Mexico said that remittances grew 24% last year and now represent the country's second-biggest source of income after oil. Better records and greater prosperity of Mexican expatriates in the US are the main reasons behind the increase. About 10 million Mexicans live in the US, where there are 16 million citizens of Mexican origin. Remittances now represent more than 2% of the country's GDP, according to the Bank of Mexico's figures. Last year, there were 50.9 million transactions, with an average value of $327 per remittance, the bank said. According to Standard & Poor's, which has recently upgraded Mexico's sovereign debt rating, the rise in remittances helps protect the Mexican economy against a potential fall in the international oil prices.\n \n The growth in remittances has sparked fierce competition between banks. Bank of America announced last week that it planned to eliminate transfer fees for some customers. Remittance charges are estimated to have dropped by between 50 and 60%, reports from the US Treasury and the Inter-American Development Bank have said. The Inter-American Development Bank estimates that remittances to Latin America and the Caribbean reached $45bn in 2004.\n", "llama3.2:1b": ["Mexican labourers living in the US sent a record $16.6 billion home last year, up 24% from the previous year.", "Remittances now represent over 2% of Mexico's GDP.", "The Bank of Mexico says remittances account for more than half of Mexico's income and have helped protect the country's economy against potential falls in oil prices."], "llama3.2:3b": ["Mexican expats living in the US sent a record $16.6bn home last year, up 24% from the previous year, making remittances Mexico's second-largest source of income after oil."], "gemma2:2b": ["Mexican laborers living in the US sent a record $16.6 billion home last year, representing their second-largest source of income after oil.", "This growth is due to better records and prosperity of Mexican expats, with remittances now exceeding 2% of Mexico's GDP.", "Remittances have spurred fierce competition among banks, leading to reduced transfer fees."], "qwen2.5:0.5b": ["Mexican labourers in the US sent a record amount of money ($16.", "6 billion) home last year, surpassing the country's second-biggest income source after oil.", "Mexican expatriates living in the US now represent more than 2% of the country's GDP and are responsible for about 50 million transactions worth $327 each per remittance.", "The Bank of Mexico said that remittances grew by 24%, which represents the second-biggest source of income after oil, indicating better records and greater prosperity in Mexican expatriates living in the US.", "Banks are faced with fierce competition due to this growth.", "Bank of America announced plans to eliminate transfer fees for some customers, while Remittance charges have dropped between 50-60%, according to US Treasury and Inter-American Development Bank estimates."], "qwen2.5:1.5b": ["Mexican workers sent $16.6 billion home last year, representing a 24% growth after oil as Mexico's second-largest income source, with 10 million Mexicans living in the US and an estimated 50.9 million transactions averaging $327 per remittance, helping protect Mexican economy from falling oil prices."], "qwen2.5:3b": ["Mexican labourers living in the US sent a record $16.6bn home last year, growing by 24% from the previous year.", "This represents Mexico's second-largest source of income after oil, driven by better records and prosperity among Mexican expatriates in the US.", "About 10 million Mexicans live in the US.", "Remittances now account for more than 2% of GDP, with an average value of $327 per transaction.", "The growth has led to increased competition among banks, prompting some to eliminate transfer fees.", "The Inter-American Development Bank estimates remittances to Latin America and the Caribbean reached $45bn in 2004."], "opencoder:1.5b": ["Mexican labor in the U.S., sending a record $16bn, now represents another significant source of income.", "The growth in remittance has fueled fierce competition between banks, suggesting a potential for further economic expansion.", "The Bank of America planned to reduce transfer fees for customers, showing that remittances are not tied to the cost of carrying goods or services, which is indicated by the decline in remittance charges."], "smollm:1.7b": ["The Mexican government's decision to increase remittances sent by Mexican citizens living abroad has been a key factor in Mexico's economic growth, according to a recent report from the Bank of Mexico.", "The bank said that remittances now represent more than 2% of the country's GDP and have helped protect the economy against a potential fall in oil prices.", "The increase in remittances is also attributed to better records and greater prosperity of Mexican expatriates living in the US, which has led to an increase in their ability to send money back home.", "According to a recent report from the Bank of Mexico, there are now 10 million Mexicans living in the US, with 16 million citizens of Mexican origin.", "Remittances now represent more than 2% of the country's GDP and have helped protect the economy against a potential fall in oil prices.", "The growth in remittances has sparked fierce competition between banks, reports from the US Treasury and the Inter-American Development Bank have said.", "The Inter-American Development Bank estimates that remittances to Latin America and the Caribbean reached $45bn in 2004."], "deepseek-r1:1.5b": ["Mexican laborers in the United States sent $16.6 billion home last year, marking a record.", "The Bank of Mexico reported that remittances grew 24% and are now second-largest income source after oil.", "Around 10 million Mexicans live in the US, contributing over 2% to GDP.", "Remittances saw 50.9 million transactions averaging $327 each last year.", "S&P upgraded Mexico's debt rating due to rising remittances protecting the economy against potential oil price drops.", "Competitive bank transfers led to Bank of America eliminating transfer fees for some customers, with reductions estimated at 50-60%."], "tinyllama:1.1b": ["Mexican laborers living in the United States sent a record $16.6bn (£8.82bn) home last year, while the Bank of Mexico noted that remittances represented a \"second-largest source\" of income for Mexicans living abroad.", "The increase in remittances is partly due to better records and greater prosperity among Mexican expatriates in the US, as well as higher inflation and lower oil prices.", "The growth in remittances has sparked fierce competition between banks as they seek to minimize transfer fees for customers.", "A report from the US Treasury and Inter-American Development Bank estimated that remittance charges dropped by up to 60% last year."], "tinydolphin:1.1b": [" In summary, Mexican workers living in the U.S. sent $16 billion back home last year, making up a significant portion of the country's GDP.", "This amount is expected to grow even further due to improved records and better prosperity for Mexican-Americans residing there.", "The rise in remittances has led to increased competition between banks, which are charging lower fees as customers benefit from decreased costs."], "phi:2.7b": [" In 2004, Mexican laborers living in the United States sent $16.6 billion home, making it the second-largest source of income for Mexico after oil.", "This was a 24% increase from the previous year, mainly due to better record-keeping and increased prosperity of Mexican expatriates.", "The Bank of Mexico's figures show that remittances now represent more than 2% of the country's GDP.", "Standard & Poor's has recently upgraded Mexico's sovereign debt rating, citing the growth in remittances as a protective factor against potential falls in oil prices.", "Several banks, including Bank of America, have also begun to eliminate transfer fees for some customers.", "Remittance charges are estimated to have dropped by between 50 and 60% according to reports from the US Treasury and the Inter-American Development Bank.", "In 2004, remittances to Latin America and the Caribbean reached $45 billion."], "orca-mini:3b": [" Mexican labourers living in the US sent home a record $16.6 billion last year, representing 2% of Mexico's GDP.", "The growth in remittances is a key driver of economic growth in Mexico and helps protect the country against a fall in oil prices.", "Some banks are competing to offer lower transfer fees for remittance transactions."], "hermes3:3b": ["US Mexican laborers sent 16BN (\n- 16.6BN exact\n) back home last year."], "stablelm-zephyr:3b": ["Mexican expatriates in the US sent a record $16.6 billion home last year, representing the country's second-biggest source of income after oil.", "This increase is due to better records and greater prosperity among Mexican expats in the US.", "Remittances now account for more than 2% of Mexico's GDP and are estimated to have dropped by 50-60%.", "The growth in remittances helps protect the Mexican economy against potential falls in international oil prices, leading to fierce competition between banks.", "Last week, Bank of America announced plans to eliminate transfer fees for some customers, contributing to a drop of 50-60% in remittance charges."], "stablelm2:1.6b": ["Last year, Mexican laborers living in the U.S sent a record $8.6 billion back home, according to the Bank of Mexico.", "Remittances have grown by 2%, making them Mexico's second-biggest source of income after oil.", "Around one million Mexicans reside in the U.S, where there are 1 million citizens of Mexican origin.", "The increase comes from better records and greater prosperity for Mexican expatriates.", "Remittances now account for more than 2% of the country’s GDP and were involved in 9 million transactions with an average value of $5 per transaction.", "A recent upgrade to Mexico's sovereign debt rating by Standard & Poor's protects the Mexican economy against a potential drop in international oil prices.", "The growth in remittances has led to fierce competition between banks, with Bank of America announcing plans to eliminate transfer fees for some customers."], "granite3.1-dense:2b": ["Mexican migrants residing in the U.S. sent a record $16.6 billion home last year, marking a 24% increase from the previous year.", "This makes remittances Mexico's second-largest income source after oil.", "The surge is attributed to improved records and economic prosperity of Mexican expatriates in the U.S., with about 10 million Mexicans living there.", "Remittances now account for over 2% of Mexico's GDP, averaging $327 per transaction across 50.9 million transfers.", "Standard & Poor's cites this remittance growth as a factor mitigating the impact of potential oil price drops on Mexico's economy.", "The competition among U.S. banks to handle these transactions has intensified, with Bank of America reducing transfer fees by 50-60%.", "Estimates suggest $45 billion in remittances flowed to Latin America and the Caribbean in 2004."], "chatgpt-4o-latest": ["Mexican laborers in the US sent a record $16.6 billion home in the past year, marking a 24% increase.", "Remittances are now Mexico's second-largest income source after oil, accounting for over 2% of GDP.", "The rise is attributed to better record-keeping and increased prosperity among Mexican expatriates.", "With 50.9 million transactions averaging $327 each, remittances help stabilize Mexico’s economy, especially against potential oil price declines.", "The surge has intensified competition among banks, leading to lower transfer fees.", "Overall, remittances to Latin America and the Caribbean reached $45 billion in 2004."]}