{"raw_text": "Metlife buys up Citigroup insurer\n \n US banking giant Citigroup has sold its Travelers Life & Annuity insurance arm to Metlife for $11.5bn (£6.1bn).\n \n The sale is a further move by Citigroup away from its 1990s strategy of offering every financial service - insurance, broking and banking. Profit growth in the insurance market has not matched expansion at Citigroup's other businesses. For Metlife, the US's leading insurance company, the purchase gives it access to a much larger distribution network.\n \n Robert Benmosche, Metlife's chairman and chief executive, said that it was a \"great opportunity for the brand of Metlife to be distributed through Citigroup\". Under the agreement, Metlife will be able to sell its products through Citigroup over the next 10 years. The deal includes Smith Barney retail brokerages and Citibank branches. The company will pay between $1bn and $3bn in Metlife stock with the rest being made up of cash. Travelers had sales of $5.2bn in 2004 and made a profit of $901m. It has total net assets of $96bn. \"This deal employs some of Metlife's excess capital in a potentially higher-return business and gives it more distribution,\" said Stuart Quint, an analyst at Gartmore.\n", "llama3.2:1b": ["Citigroup sells Travelers Life & Annuity insurance arm to Metlife for $11.5 billion.", "The sale allows Metlife access to Citigroup's larger distribution network."], "llama3.2:3b": ["US banking giant Citigroup sold its Travelers Life & Annuity insurance arm to Metlife for $11.5bn, allowing Metlife access to a larger distribution network, Smith Barney retail brokerages, and Citibank branches over the next 10 years."], "gemma2:2b": ["Citigroup sold its Travelers Life & Annuity insurance arm to Metlife for $11.5 billion.", "The sale allows Metlife access to Citigroup's large distribution network.", "This deal will be completed over the next 10 years.", "Metlife will pay a combination of stock and cash, with the total amount being between $1 billion and $3 billion."], "qwen2.5:0.5b": ["Metlife buys up Citigroup insurer for $11.5 billion.", "This move by MetLife is aimed at expanding its insurance offerings beyond its traditional business areas, such as banking and broking.", "With a larger distribution network under the agreement, this could lead to increased exposure and potential profits in this new area.", "The deal also involves selling some of MetLife's excess capital from its existing operations to Citigroup for $10 billion more."], "qwen2.5:1.5b": ["MetLife purchases Citigroup's Travelers Life & Annuity for $11.5 billion to expand its insurance offerings through Citibank branches and retail brokerages, enhancing distribution capabilities while allowing Metlife to recoup excess capital in a higher-return business."], "qwen2.5:3b": ["US banking giant Citigroup sells its Travelers Life & Annuity insurance arm to Metlife for $11.5bn.", "The sale reflects Citigroup’s shift away from offering all financial services (insurance, broking and banking).", "Metlife gains access to Citigroup's larger distribution network.", "Under the agreement, Metlife will sell products through Citigroup over the next decade using Smith Barney retail brokerages and Citibank branches.", "Metlife will receive between $1bn and $3bn in stock with cash making up the rest.", "Travelers had sales of $5.2bn in 2004, a profit of $901m and total net assets of $96bn.", "The deal allows Metlife to deploy excess capital in potentially higher-return insurance business."], "opencoder:1.5b": ["The US banking giant Citigroup has sold its Travelers Life & Annuity insurance arm to Metlife for a further move by a much larger distribution network with access rights."], "smollm:1.7b": ["The following is the summary:\n\nMetlife buys up Citigroup insurer\nUS banking giant Citigroup has sold its Travelers Life & Annuity insurance arm to Metlife for $11.5bn (£6.1bn).", "The sale is a further move by Citigroup away from its 1990s strategy of offering every financial service - insurance, broking and banking.", "Profit growth in the insurance market has not matched expansion at Citigroup's other businesses.", "For Metlife, the US's leading insurance company, the purchase gives it access to a much larger distribution network.", "Robert Benmosche, Metlife's chairman and chief executive, said that it was a \"great opportunity for the brand of Metlife to be distributed through Citigroup\".", "Under the agreement, Metlife will be able to sell its products through Citigroup over the next 10 years.", "The deal includes Smith Barney retail brokerages and Citibank branches.", "The company will pay between $1bn and $3bn in Metlife stock with the rest being made up of cash.", "Travelers had sales of $5.2bn in 2004 and made a profit of $901m.", "It has total net assets of $96bn.", "\"This deal employs some of Metlife's excess capital in a potentially higher-return business and gives it more distribution,\" said Stuart Quint, an analyst at Gartmore."], "deepseek-r1:1.5b": ["Metlife acquired Travelers Life & Annuity insurance from Citigroup for $11.5 billion in 2004.", "This move reflects Citigroup's expansion beyond insurance into broking and banking, despite lower profit growth compared to other business areas.", "Metlife benefits from a larger distribution network under this deal."], "tinyllama:1.1b": ["Metlife has acquired the Travelers Life & Annuity insurance arm from Citigroup for $11.5bn (£6.1bn).", "The move will give Metlife access to a larger distribution network, including branches of Citigroup in the US.", "This is a significant opportunity for the brand of Metlife to sell its products through Citigroup over the next 10 years, while also benefiting from access to Travelers' sales and distribution channels.", "The deal includes Citibank retail branches and will pay between $1bn and $3bn in Metlife stock with the rest being made up of cash.", "Travelers had revenues of $5.2bn in 2004, making it a potentially higher-return business for Metlife.", "The deal is expected to be completed by Q3 2005."], "tinydolphin:1.1b": [" MetLife is buying Citigroup's Travelers Life & Annuity insurance arm for $11.5 billion, which will help it expand its distribution network further to include more financial services.", "This acquisition also makes sense for MetLife, as it moves away from Citigroup's older strategy of providing every service under one roof.", "Profit growth has not kept up with expansion at Citigroup's other businesses.", "For Citigroup, the deal is a way to add value to its insurance operations and gain access to a larger distribution network through MetLife's strong presence in the brokerage and banking industries.", "This deal involves the sale of approximately $5 billion worth of Travelers' shares and the payment of approximately $1 billion in cash to Citigroup.", "The total transaction value is estimated at between $11 billion and $30 billion, which includes the payment of MetLife stock with the rest being made up of cash."], "phi:2.7b": [" Citigroup sold its Travelers Life & Annuity insurance arm to US insurance company Metlife for $11.5 billion.", "The sale allows Metlife to access Citigroup's large network of distribution.", "Metlife will be able to sell its products through Smith Barney retail brokerages and Citibank branches over the next 10 years, with payment being made in the form of Metlife stock or cash.", "Travelers had sales of $5.2 billion in 2004 and a profit of $901 million."], "orca-mini:3b": [" US banking giant Citigroup has sold its Travelers Life & Annuity insurance arm to Metlife for $11.5bn.", "The deal allows Metlife to sell its products through Citigroup and provides access to a larger distribution network."], "hermes3:3b": ["Metlife buys $11.5b Citigroup's insurance arm for distribution network."], "stablelm-zephyr:3b": ["Citigroup sold its Travelers Life & Annuity insurance arm to Metlife for $11.5bn, allowing Metlife to expand its distribution network.", "The sale is part of Citigroup's strategy shift away from offering all financial services, with the insurance market experiencing slower profit growth compared to other businesses.", "Under the agreement, Metlife will sell products through Citigroup's Smith Barney retail brokerages and Citibank branches for the next 10 years."], "chatgpt-4o-latest": ["Citigroup has sold its Travelers Life & Annuity insurance arm to Metlife for $11.5 billion, marking a shift away from its 1990s strategy of offering all financial services.", "The sale allows Citigroup to focus on more profitable areas while giving Metlife, the leading US insurer, access to a larger distribution network.", "Under the agreement, Metlife can sell its products through Citigroup for the next 10 years, including via Smith Barney brokerages and Citibank branches.", "The deal consists of $1 billion to $3 billion in Metlife stock, with the remainder in cash.", "Travelers had $5.2 billion in sales and $901 million in profit in 2004, with total net assets of $96 billion.", "Analysts see the acquisition as a strategic move for Metlife to deploy excess capital in a higher-return business."], "stablelm2:1.6b": ["MetLife acquires Citigroup's Travelers Life & Annuity insurance arm for $6.1 billion.", "This move by Citigroup away from its traditional strategy of offering all financial services.", "For Metlife, the acquisition gives it access to a larger distribution network, particularly in retail brokerages and Citibank branches.", "The deal includes Smith Barney retail brokerages and Citibank branches, with payment ranging from $1 billion to $3 billion in MetLife stock, while the rest is made up of cash."], "granite3.1-dense:2b": ["Metlife acquired Citigroup's Travelers Life & Annuity insurance division for $11.5bn, marking Citigroup's further divestment from its 1990s multifaceted financial services strategy due to underperformance in the insurance market.", "For Metlife, this acquisition expands its distribution network by leveraging Citigroup's retail brokerages and branches.", "The deal includes Smith Barney brokerages and Citibank branches.", "Metlife will pay between $1bn and $3bn in stock, with the remainder in cash.", "Travelers Life & Annuity reported 2004 sales of $5.2bn and a profit of $901m, along with total net assets of $96bn.", "Analyst Stuart Quint views this as Metlife utilizing its excess capital in a potentially more lucrative business and gaining additional distribution channels."]}