{"raw_text": "Ebbers denies WorldCom fraud\n \n Former WorldCom chief Bernie Ebbers has denied claims that he knew accountants were doctoring the books at the firm.\n \n Speaking in court, Mr Ebbers rejected allegations he pressured ex-chief financial officer Scott Sullivan to falsify company financial statements. Mr Sullivan \"made accounting decisions,\" he told the federal court, saying his finance chief had \"a keen command of the numbers\". Mr Ebbers has denied charges of fraud and conspiracy. During his second day of questioning in the New York trial Mr Ebbers played down his working relationship with Mr Sullivan and denied he frequently met him to discuss company business when questioned by the prosecution.\n \n \"In a lot of weeks, we would speak ... three or four times,\" Mr Ebbers said, adding that conversations about finances were rarely one-on-one and were usually discussed by a \"group of people\" instead.\n \n Mr Ebbers relationship to Mr Sullivan is key to the case surrounding financial corruption that led to the collapse of the firm in 2002 following the discovery of an $11bn accounting fraud. The prosecution's star witness is Mr Sullivan, one of six WorldCom executives indicted in the case, He has pleaded guilty to fraud and appeared as a prosecution witness as part of an agreement with prosecutors. During his time on the witness stand Mr Sullivan repeatedly told jurors he met frequently with Mr Ebbers, told him about changes made to WorldCom's accounts to hide costs and had warned him such practises were improper. However during the case on Tuesday Mr Ebbers denied the allegations. \"I wasn't advised by Scott Sullivan of anything ever being wrong,\" he told the court. \"He's never told me he made an entry that wasn't right. If he had, we wouldn't be here today.\" Mr Ebbers could face a jail sentence of up to 85 years if convicted of all the charges he is facing. Shareholders lost about $180bn in WorldCom's collapse, 20,000 workers lost their jobs and the company went bankrupt. The company emerged from bankruptcy last year and is now known as MCI.\n", "llama3.2:1b": ["Bernie Ebbers has denied claims that he pressured ex-chief financial officer Scott Sullivan to falsify WorldCom's books, despite being accused of fraud and conspiracy."], "llama3.2:3b": ["Bernie Ebbers denies pressuring Scott Sullivan to falsify WorldCom financial statements, claiming they spoke rarely and that Sullivan made accounting decisions on his own.", "Ebbers also said he was not advised of any improper actions by Sullivan."], "gemma2:2b": ["Bernie Ebbers denies knowing about accounting fraud at WorldCom.", "He claims he had limited contact with Scott Sullivan and did not receive information about incorrect entries.", "Mr. Sullivan, key witness in the case, testified he frequently met with Mr. Ebbers to discuss improper accounting practices.", "If found guilty of all charges, Ebbers could face a lengthy jail sentence."], "qwen2.5:0.5b": ["Bernie Ebbers denies WorldCom fraud charges."], "qwen2.5:1.5b": ["Former WorldCom CEO Bernie Ebbers denies knowing about accounting fraud at his firm during a trial.", "Ebbers claims he did not pressure ex-CFO Scott Sullivan to falsify financial statements, instead stating their discussions were usually group-based.", "The case hinges on the prosecution's key witness, who has been indicted and pleaded guilty but remains a prosecution witness.", "Ebbers faces potential jail time if found guilty of fraud charges."], "qwen2.5:3b": ["Former WorldCom CEO Bernie Ebbers denies knowing accountants were falsifying books, disputing claims he pressured Scott Sullivan to do so.", "He states Sullivan made accounting decisions with a strong command of numbers.", "Ebbers maintains his relationship with Sullivan was not frequent enough for them to discuss finances one-on-one and often involved groups.", "Despite Sullivan's testimony in the case, blaming Ebbers, Ebbers denies ever being advised by Sullivan about incorrect entries.", "If convicted, Ebbers could face up to 85 years in prison.", "The collapse of WorldCom cost shareholders $180 billion, led to job losses for 20,000 workers, and ultimately resulted in bankruptcy, with the company later reorganizing as MCI."], "opencoder:1.5b": ["Ebbers denies WorldCom fraud \n\nFormer WorldCom chief Bernie Ebbers has denied claims that he knew accountants were doctoring the books at the firm.", "During his second day of questioning in the New York trial, Mr Ebbers rejected allegations he pressured ex-chief financial officer Scott Sullivan to falsify company financial statements.", "Mr Sullivan \"made accounting decisions,\" he told the federal court, saying his finance chief had a keen command of the numbers.", "Mr Ebbers has denied charges of fraud and conspiracy.", "Speaking in court, Mr Ebbers denied charges of fraud that he played down working relationships with Mr Sullivan and discussed company business when questioned by the prosecution.", "In a lot of weeks, we would speak three or four times, Mr Ebbers added.", "During his second day of questioning, Mr Ebbers met Mr Sullivan repeatedly with him about changes made to WorldCom's accounts to hide costs and warned him such practices were improper.", "However during the case on Tuesday, Mr Ebbers denied the allegations.", "\"I wasn't advised by Scott Sullivan of anything ever being wrong,\" he told the court, referring to his previous experience with Mr Sullivan.", "If he had, we wouldn't be here today.", "If he was ever present in discussions about company business and financial situations, Mr Ebbers would have denied this."], "smollm:1.7b": ["Ebbers denied claims that he knew accountants were doctoring the books at the firm."], "deepseek-r1:1.5b": ["Bernie Ebbers denied claims of fraudulent accounting at WorldCom, clarifying his stance on alleged pressure from Scott Sullivan and questioning any fraudulent practices related to financial decisions.", "The case surrounding the collapse of WorldCom in 2002 remains unresolved, with six executives implicated, five of whom pleaded guilty.", "During the trial, credible evidence was presented, especially about meetings between Ebbers and financial director Scott Sullivan.", "By Tuesday, Ebbers denied all allegations, facing potential jail time up to 85 years.", "Shareholders lost $180 billion, workers lost their jobs for 20,000, and the company went bankrupt, becoming MCI after bankruptcy."], "tinyllama:1.1b": ["The following is a summary of the recent news about WorldCom CEO Bernie Ebber's statements in court during his trial on fraud charges:\n\nEbber denies accusations that he pressured ex-chief financial officer Scott Sullivan to falsify company financial statements.", "According to Ebber, Sullivan made decisions based on accounting matters and didn't often discuss finances one-on-one with him.", "However, during his testimony in court, Ebber denied that he frequently met with Sullivan or discussed the company's financial business.", "Ebber also played down his working relationship with Sullivan and denied that they ever talked about financing decisions, saying those conversations were usually conducted by a group of people instead."], "tinydolphin:1.1b": [" In a recent statement, Ebbers denies accusations that he pressured Sullivan to falsify company financial statements.", "He stated that his finance chief had a keen command of the numbers, and he believed in \"a group of people\" discussing finances.", "The case against WorldCom is based on allegations that it hid costs from shareholders and employees to avoid bankruptcy."], "phi:2.7b": [" Bernie Ebbers denies being aware of accountants falsifying financial statements at WorldCom, despite allegations made by former chief financial officer Scott Sullivan.", "During his first day in court, Mr Ebbers played down his relationship with Mr Sullivan and denied frequently meeting him to discuss company business.", "He also denied receiving advice from Mr Sullivan about any wrongdoing.", "Mr Ebbers could face a long jail sentence if convicted of all charges he is facing, which include fraud and conspiracy."], "orca-mini:3b": [" Bernie Ebbers has denied charges of fraud and conspiracy in a federal court hearing.", "He played down his working relationship with former CFO Scott Sullivan and denied meeting him frequently to discuss company business."], "hermes3:3b": ["Bernie Ebbers denies knowing accounting fraud at WorldCom."], "stablelm-zephyr:3b": ["Bernie Ebbers, former WorldCom chief, denies allegations of knowing accountants were falsifying financial statements.", "He speaks in court and disputes ex-CFO Scott Sullivan's claim of having a \"keen command of the numbers.\"", "Ebbers' relationship with Sullivan is crucial to the case that led to the firm's $11bn accounting fraud collapse in 2002.", "If convicted, Ebbers could face up to 85 years in prison."], "chatgpt-4o-latest": ["Former WorldCom chief Bernie Ebbers denied knowing about fraudulent accounting at the firm, rejecting claims that he pressured ex-CFO Scott Sullivan to falsify financial statements.", "Ebbers downplayed his relationship with Sullivan, stating financial discussions were usually in groups.", "Sullivan, the prosecution's key witness, testified that he informed Ebbers about improper accounting practices, but Ebbers denied any knowledge of wrongdoing.", "If convicted, Ebbers could face up to 85 years in prison.", "WorldCom's collapse in 2002 led to $180 billion in shareholder losses, 20,000 job cuts, and bankruptcy, though it later re-emerged as MCI."], "stablelm2:1.6b": ["Former WorldCom CEO Bernie Ebbers denies fraud allegations against him, his ex-CEO Scott Sullivan, and others involved in a $2bn accounting fraud that led to the collapse of the firm, which later became MCI.", "Ebbers denies being advised of any wrongdoings by Sullivan or involving a group discussion about company finances.", "If convicted of all charges, he could face up to a year in jail for each count."], "granite3.1-dense:2b": ["Bernie Ebbers, former WorldCom CEO, has denied fraud charges in a New York trial.", "He maintains that he was unaware of ex-CFO Scott Sullivan's alleged role in doctoring financial statements to hide costs and inflate company value by $11 billion.", "Ebbers claimed their meetings were rarely one-on-one and focused on broader business discussions, not specific accounting adjustments.", "The prosecution's key witness is Sullivan, who pleaded guilty to fraud and testified that he frequently advised Ebbers about improper financial practices.", "If convicted, Ebbers could receive up to 85 years in jail.", "WorldCom's collapse resulted in $180 billion losses for shareholders, 20,000 job losses, and the company going bankrupt; it now operates under the name MCI."]}