{"raw_text": "US company admits Benin bribery\n \n A US defence and telecommunications company has agreed to pay $28.5m after admitting bribery in the West African state of Benin.\n \n The Titan corporation was accused of funnelling more than $2m into the 2001 re-election campaign of President Mathieu Kerekou. At the time, Titan was trying to get a higher price for a telecommunications project in Benin. There is no suggestion that Mr Kerekou was himself aware of any wrongdoing. Titan, a California-based company, pleaded guilty to falsifying its accounts and violating US anti-bribery laws. It agreed to pay $13m in criminal penalties, as well as $15.5m to settle a civil lawsuit brought by the US financial watchdog, the Securities and Exchange Commission (SEC).\n \n The SEC had accused Titan of illegally paying $2.1m to an unnamed agent in Benin claiming ties with President Kerekou. Some of the money was used to pay for T-shirts with campaign slogans on them ahead of the 2001 election. Shortly after the poll, which Mr Kerekou won, Benin officials agreed to quadruple Titan's management fee. Prosecuting attorney Carol Lam said: \"All US companies should take note that attempting to bribe foreign officials is criminal conduct and will be appropriately prosecuted.\" The company says it no longer tolerates such practices. Under the US Foreign Corrupt Practices Act, it is a crime for American firms to bribe foreign officials.\n", "llama3.2:1b": ["US defence and telecommunications company Titan corporation has agreed to pay $28.5m after admitting bribery in Benin.", "It was accused of funneling over $2m into President Mathieu Kerekou's re-election campaign in 2001, which led to a higher price for a telecommunications project.", "Titan pleaded guilty to falsifying its accounts and violating US anti-bribery laws, agreeing to pay $13m in criminal penalties and $15.5m to settle a civil lawsuit with the Securities and Exchange Commission (SEC)."], "llama3.2:3b": ["A US defence and telecommunications company, Titan Corporation, has agreed to pay $28.5m after admitting to bribery in Benin, including $2m funneled into President Mathieu Kerekou's 2001 re-election campaign, and violating US anti-bribery laws with a guilty plea and civil settlement with the Securities and Exchange Commission."], "gemma2:2b": ["Titan Corporation admitted to bribing Benin officials in exchange for favorable deals on a telecommunications project.", "The company agreed to pay $28.5 million in penalties to settle charges of bribery and violating anti-bribery laws."], "qwen2.5:0.5b": ["US defence company Titan admitted bribing Mr Kerekou in West Africa after paying $28.", "5m."], "qwen2.5:1.5b": ["A US defense and telecommunications firm has admitted bribery in Benin, paying $28.5 million along with $13 million in criminal penalties and $15.5 million in civil settlements, following allegations of funneling funds worth $2 million into a re-election campaign.", "The company now pledges to cease such practices."], "qwen2.5:3b": ["US defense and telecoms company Titan Corp pays $28.5m after admitting bribery in Benin.", "In 2001, Titan bribed Benin President Mathieu Kerekou's re-election campaign by funneling over $2m.", "The SEC sued Titan for violating US anti-bribery laws; it pleaded guilty to falsifying accounts and agreed to pay civil penalties of $15.5m and criminal fines totaling $13m.", "Prosecutors emphasized that all US companies should avoid bribing foreign officials, as it is illegal under the Foreign Corrupt Practices Act.", "Titan states they no longer tolerate such practices."], "opencoder:1.5b": ["The US company admits Benin bribery by a U.S. defence and telecommunications company has agreed to pay $28.5 million after admitting bribery in the West African state of Benin.", "The Titan corporation was accused of funnelling more than $2 million into the 2001 re-election campaign of President Mathieu Kerekou at the time, with the latter trying to get a higher price for telecommunications project in Benin.", "Titan, a California-based company, pleaded guilty to falsifying its accounts and violating US anti-bribery laws by paying $13.5 million in criminal penalties, and agreeing to $15.5 million to settle a civil lawsuit brought by the US financial watchdog (SEC).", "The SEC had accused Titan of illegal payment of $2.1 million from an unnamed agent who was affiliated with President Kerekou; money was used to pay for T-shirts with campaign slogans on them ahead of the 2001 election.", "Shortly after the poll, Benin officials agreed to quadruple Titan's management fee."], "smollm:1.7b": ["The US company admitted bribery in Benin by paying $28.5 million after admitting bribery in the West African state of Benin.", "The Titan corporation was accused of funnelling more than $2m into the 2001 re-election campaign of President Mathieu Kerekou, which is a crime under US law.", "There is no suggestion that Mr Kerekou was himself aware of any wrongdoing.", "The company pleaded guilty to falsifying its accounts and violating US anti-bribery laws.", "It agreed to pay $13 million in criminal penalties, as well as $15.5 million to settle a civil lawsuit brought by the SEC.", "The SEC had accused Titan of illegally paying $2.1 million to an unnamed agent in Benin claiming ties with President Kerekou.", "Some of the money was used to pay for T-shirts with campaign slogans on them ahead of the 2001 election.", "Shortly after the poll, which Mr Kerekou won, Benin officials agreed to quadruple Titan's management fee.", "Prosecuting attorney Carol Lam said: \"All US companies should take note that attempting to bribe foreign officials is criminal conduct and will be appropriately prosecuted.\"", "The company says it no longer tolerates such practices.", "Under the US Foreign Corrupt Practices Act, it is a crime for American firms to bribe foreign officials."], "deepseek-r1:1.5b": ["A US defense and telecommunications company has agreed to pay $28.5 million after admitting bribery in Benin.", "The company also details allegations of funneling more than $2 million into the 2001 re-election campaign against President Mathieu Kerekou, while Titan was attempting to secure a higher price for a telecommunications project in Benin."], "tinyllama:1.1b": ["US company admits Benin bribery by funnelling more than $2m into campaign of President Mathieu Kerékou and violating anti-bribery laws.", "Titans pleaded guilty to falsifying accounting records, violating US Anti-Bribing Acts, and paying an agent in Benin to influence President Kerékou's re-election bid.", "Titans agreed to pay $13m in criminal penalties, plus $15.5m to settle a civil lawsuit filed by the SEC.", "Prosecuting attorney Carol Lam says American companies should not tolerate such practices and states that attempting to bribe foreign officials is criminal conduct.", "Titans has since ceased paying bribes in Benin, but the company still acknowledges its involvement in the election tampering case."], "tinydolphin:1.1b": [" A US telecommunications company has admitted bribing a West African government official in Benin to advance their bid for a telecoms project, violating U.S. anti-bribery laws and pleaded guilty to falsifying its financial records.", "The Titan Corporation, an American firm, paid over $2m to an agent in Benin in 2001, claiming that the money was for \"promotion\" and \"support of President Kerekou's re-election campaign.\"", "Although no proof of wrongdoing by President Kerekou himself is offered, the company admitted responsibility.", "In return, Titan agreed to pay a $13m criminal penalty, plus $15.5m in civil damages to settle a lawsuit brought by the U.S. financial watchdog, the Securities and Exchange Commission (SEC)."], "phi:2.7b": [" A US defence and telecommunications company has admitted bribery in Benin, paying $28.5m after falsely claiming financial support from a company trying to gain a higher price for a project.", "The company pleaded guilty to violating US anti-bribery laws and paid $13m in criminal penalties, as well as"], "orca-mini:3b": [" A US defense and telecommunications company pleaded guilty to paying $2.1 million to an unnamed agent in Benin, claiming ties with President Mathieu Kerekou.", "The money was used to pay for T-shirts with campaign slogans on them ahead of the 2001 election.", "After the poll, which Mr Kerekou won, Benin officials agreed to quadruple Titan's management fee.", "The company says it no longer tolerates such practices and has agreed to pay $13m in criminal penalties and $15.5m to settle a civil lawsuit brought by the US financial watchdog, the Securities and Exchange Commission (SEC)."], "hermes3:3b": ["US company Titan pays $28m for bribery in Benin, admitting to funnelling over $2m into 2001 re-election campaign of President Mathieu Kerekou, violating US anti-bribery laws."], "stablelm-zephyr:3b": ["A California-based defense and telecommunications company, Titan, has agreed to pay $28.5m after admitting bribery in Benin.", "They were accused of funneling over $2m into President Mathieu Kerekou's re-election campaign in 2001.", "Titan pleaded guilty to falsifying its accounts and violating US anti-bribery laws, resulting in a criminal penalty of $13m and a civil lawsuit settlement of $15.5m with the Securities and Exchange Commission (SEC).", "The SEC accused Titan of paying an unnamed agent in Benin claiming ties to President Kerekou, with some funds used for election-related T-shirts.", "This incident violates the US Foreign Corrupt Practices Act."], "chatgpt-4o-latest": ["A US defence and telecommunications company, Titan, has agreed to pay $28.5 million after admitting to bribery in Benin.", "The company funneled over $2 million into President Mathieu Kerekou's 2001 re-election campaign while seeking a higher price for a telecommunications project.", "There is no evidence that Kerekou was aware of the wrongdoing.", "Titan pleaded guilty to falsifying accounts and violating US anti-bribery laws, agreeing to pay $13 million in criminal penalties and $15.5 million to settle a civil lawsuit with the SEC.", "The SEC accused Titan of illegally paying $2.1 million to an agent with alleged ties to Kerekou, some of which funded campaign materials.", "After Kerekou's victory, Benin officials approved a fourfold increase in Titan's management fee.", "Prosecutors warned US companies against bribing foreign officials, and Titan stated it no longer tolerates such practices."], "stablelm2:1.6b": ["A California-based defense and telecommunications company, Titan Corporation, has admitted to paying $5 million after being accused of bribery in Benin, a West African state.", "The firm was accused of funneling over $2 million into the re-election campaign of President Mathieu Kerekou while attempting to secure a higher price for a telecom project.", "Titan pleaded guilty to falsifying accounts and violating US anti-bribery laws.", "It will pay $500,0 00 in criminal penalties as well as $500,000 to settle a civil lawsuit brought by the Securities and Exchange Commission (SEC).", "The SEC accused Titan of illegally paying $2.1 million to an unnamed agent with ties to President Kerekou."], "granite3.1-dense:2b": ["US defence and telecommunications firm Titan has admitted to paying over $2 million in bribes to secure favorable terms in a 2001 telecom project in Benin, during President Mathieu Kerekou's re-election campaign.", "Titan, based in California, pleaded guilty to falsifying accounts and violating US anti-bribery laws, agreeing to pay $28.5 million in total: $13 million in criminal penalties and $15.5 million for a SEC civil suit.", "The bribes were allegedly funnelled through an unnamed agent with ties to Kerekou, who used the funds to print campaign T-shirts.", "Post-election, Benin officials increased Titan's management fee by fourfold.", "Prosecuting attorney Carol Lam emphasized that such actions are criminal and will be pursued.", "Titan claims it now disavows these practices under the US Foreign Corrupt Practices Act, which prohibits American companies from bribing foreign officials."]}