{"raw_text": "US seeks new $280bn smoker ruling\n \n The US Justice Department is to try to overturn a court ruling that threw out its claim for $280bn (£149bn) in damages from tobacco firms.\n \n Earlier this month, a three-judge appeal court panel rejected the claim - filed in 1999 by the administration of Bill Clinton - in a 2-1 decision. Government lawyers said they would ask the full US Court of Appeals for the District of Columbia to hear the case. The court room battle is seen as key in government attempts to fight smoking. \"It's pretty clear that they've suffered a severe setback,\" said Anthony Sebok, a professor at Brooklyn Law School, adding that the appeal was what the government \"would be expected to ask for\".\n \n Prosecutors had argued that tobacco firms lied about the dangers of smoking, ignored research that highlighted problems, looked to increase addiction by manipulating nicotine levels and targeted the young with their adverts. Among the firms accused were Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group and Brown and Williamson. Prosecutors went after the companies using legislation put in place to fight organised crime, and accused the firms of conspiring and running \"Racketeer Influenced and Corrupt Organisations\". The tobacco companies denied the charges, saying that they never illegally conspired to promote smoking and fool the public. They also said that they have met many of the government's demands laid out in a landmark $206bn settlement hammered out in 1998 with 46 states. A three-judge panel agreed with the companies, finding that the case could not be brought under federal anti-racketeering laws.\n \n Central to the government's case was a meeting in the Plaza Hotel, New York, on 15 December, 1953. Prosecutors contend that executives from the major tobacco firms met and agreed to present a unified strategy denying the harmful effects of smoking. Despite denying for decades that smoking could be linked to illness, the companies have modified their stances in recent years. Altria's Philip Morris now accepts that nicotine is harmful, and the company's main lawyer William Ohlemeyer told the BBC last year that earlier statements may have been wrong but they were not dishonest. Government lawyers have until 21 March to file their appeal.\n", "llama3.2:1b": ["The US Justice Department plans to appeal a court ruling rejecting its claim for $280bn in damages from tobacco firms.", "The appeal, set to be heard by the full US Court of Appeals for the District of Columbia, aims to overturn the lower court's decision that found no evidence to support the case."], "llama3.2:3b": ["The US Justice Department plans to appeal a court ruling that dismissed its $280 billion claim against tobacco firms, claiming the companies lied about smoking's dangers and targeted young people with adverts.", "The government is seeking to overturn a 2-1 decision by a three-judge panel, which found the case could not be brought under federal anti-racketeering laws."], "gemma2:2b": ["The US Justice Department plans to appeal a court ruling that blocked its $280 billion lawsuit against tobacco companies.", "The government argued that tobacco companies knowingly misled the public about smoking's dangers and manipulated nicotine levels for profit, citing evidence of coordinated efforts to downplay the health risks.", "Tobacco firms denied these accusations, arguing they already faced financial consequences under a previous settlement with states and met many of the federal government's demands in a separate case."], "qwen2.5:0.5b": ["The US government is seeking a new court decision overturning a tobacco firm claim for $280bn in damages from tobacco firms, with the appeals panel rejecting a previous three-judge appeal against a 2-1 decision earlier this month.", "The case has been seen as key to government efforts to fight smoking and highlight the role of big tobacco companies in developing and promoting their products."], "qwen2.5:1.5b": ["The US seeks to overturn a court ruling that rejected its $280 billion settlement claim against tobacco companies, which would allow it to pursue additional damages and challenge claims of illegal behavior."], "qwen2.5:3b": ["The US Justice Department seeks to overturn a court ruling dismissing its $280bn ($149bn) damages claim against tobacco firms, filed in 1999 by the Clinton administration.", "An earlier three-judge panel rejected this claim in a 2-1 decision and recommended that the full US Court of Appeals for the District of Columbia hear it.", "Prosecutors argued tobacco companies lied about smoking dangers, manipulated nicotine levels, and targeted youth with adverts.", "The companies denied conspiring but met many government demands from a $206bn settlement.", "Central to the case was a 1953 meeting where executives agreed on a unified strategy denying smoking's harmful effects.", "Despite admitting nicotine harm in recent years, tobacco companies maintain they were not dishonest.", "The US Justice Department has until March 21st to file an appeal."], "opencoder:1.5b": ["The US Justice Department is to try to overturn a court ruling that threw out its claim for $280bn in damages from tobacco firms.", "The government argued that tobacco firms were \"likening\" with illegal activity, and they did not meet the government's demands laid out in a landmark settlement hammered out in 1998.", "Experts argue that the case could not be brought under federal anti-racketeering laws, which is against alcoholism and addiction regulation."], "smollm:1.7b": ["The US government seeks new $280bn in damages from tobacco firms for allegedly defying a court ruling that threw out its claim for $280bn (£149bn) in damages from tobacco firms.", "The US Justice Department is to try to overturn the claim - filed in 1999 by the administration of Bill Clinton - in a 2-1 decision.", "Government lawyers said they would ask the full US Court of Appeals for the District of Columbia to hear the case, and that the appeal was what the government \"would be expected to ask for\".", "The appeal court rejected the claim on grounds that it was not based on any evidence of wrongdoing by the tobacco firms.", "Prosecutors argued that tobacco firms lied about the dangers of smoking, ignored research that highlighted problems, looked to increase addiction by manipulating nicotine levels and targeted the young with their adverts.", "Among the firms accused were Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group and Brown and Williamson.", "Prosecutors went after the companies using legislation put in place to fight organized crime, and accused the firms of conspiring and running \"Racketeer Influenced and Corrupt Organisations\" (RICO) - a criminal conspiracy framework introduced by the US Congress in 1986.", "The tobacco companies denied the charges, saying that they never illegally conspired to promote smoking and fool the public.", "They also said that they have met many of the government's demands laid out in a landmark $206bn settlement hammered out in 1998 with 46 states.", "A three-judge panel agreed with the companies, finding that the case could not be brought under federal anti-racketeering laws.", "Central to the government's case was a meeting in the Plaza Hotel, New York, on 15 December, 1953.", "Prosecutors contend that executives from the major tobacco firms met and agreed to present a unified strategy denying the harmful effects of smoking.", "Despite denying for decades that smoking could be linked to illness, the companies have modified their stances in recent years.", "Altria's Philip Morris now accepts that nicotine is harmful, and the company's main lawyer told the BBC last year that earlier statements may have been wrong but they were not dishonest.", "Government lawyers have until 21 March to file their appeal."], "deepseek-r1:1.5b": ["The US Justice Department is seeking new $280 billion damages from tobacco firms in a case brought by the Clinton administration, which was rejected by a 3-judge appeal court panel on appeal day.", "The case has significant government significance as it involves fighting organized crime-related stances against tobacco companies, including Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group, and Brown and Williamson.", "The Supreme Court is expected to hear the case, with the full US Court of Appeals in New York required to review it."], "tinyllama:1.1b": ["The US government is set to challenge a court ruling that threw out its claim for $280bn in damages from tobacco firms.", "The Justice Department has announced plans to try to overturn the decision, which was filed by the administration of Bill Clinton in 1999.", "The prosecution will argue that tobacco companies misled the public about the dangers of smoking and manipulated nicotine levels to increase addiction.", "A three-judge appeal court panel ruled against the government, finding that the case should be heard by the full US Court of Appeals for the District of Columbia.", "Prosecutors have until 21 March to file their appeal, with the government expected to argue that firms lied about health risks and manipulated nicotine levels to target young people.", "The government has called on the court to rule in its favour in order to fight smoking in the US."], "tinydolphin:1.1b": [" The US Justice Department has filed an appeal against a $280bn ruling that threw out its claim for $280bn in damages from tobacco firms, according to news reports.", "This case is seen as a significant battle in the government's efforts to fight smoking.", "The ruling was made by a three-judge appeal court panel in 2018 and has been widely criticized for not considering the scientific evidence on the harm caused by smoking."], "phi:2.7b": [" The US Justice Department plans to appeal a court decision that dismissed their $280bn lawsuit against tobacco firms, which claimed that the companies lied about the dangers of smoking and targeted young people with their advertising.", "Prosecutors argued that the tobacco companies conspired to promote smoking and used legislation intended to fight organized crime.", "However, a three-judge panel rejected the claim in 2019, and prosecutors will ask the full US Court of Appeals for the District of Columbia to hear the case.", "The tobacco companies denied the charges and claimed they had met many of the government's demands."], "orca-mini:3b": [" The US government is seeking a new ruling from a court over $280 billion in damages from tobacco firms.", "The claim was filed in 1999 by the administration of Bill Clinton and was rejected by a three-judge panel earlier this month.", "Government lawyers plan to appeal the decision to a higher court.", "The case centers around allegations that tobacco companies lied about the harmful effects of smoking, manipulated nicotine levels, targeted young people with their ads, and conspired to promote smoking."], "hermes3:3b": ["US goes for $280bn re-ruling against tobacco companies."], "stablelm-zephyr:3b": ["The US Justice Department plans to appeal a recent court decision that rejected its claim for $280bn in damages from tobacco firms.", "A two-judge panel had previously denied the government's allegations that tobacco companies lied about smoking dangers, ignored research, manipulated nicotine levels and targeted youth with advertising.", "The full Court of Appeals will now consider the case, which is seen as a key moment in the government's efforts to combat smoking."], "chatgpt-4o-latest": ["The US Justice Department is seeking to overturn a court ruling that dismissed its $280bn damages claim against tobacco firms.", "The claim, originally filed in 1999, was rejected by a three-judge appeal panel in a 2-1 decision.", "Prosecutors argued that tobacco companies misled the public about smoking dangers, manipulated nicotine levels, and targeted youth.", "The firms, including Altria Group and RJ Reynolds, denied wrongdoing, citing a 1998 $206bn settlement.", "The case was dismissed under federal anti-racketeering laws.", "A key government argument was a 1953 meeting where tobacco executives allegedly conspired to deny smoking risks.", "The government has until 21 March to appeal."], "stablelm2:1.6b": ["The US Justice Department seeks to overturn a court ruling rejecting its claim for $10 billion in damages from tobacco firms, as part of the administration of Bill Clinton's administration.", "A three-judge panel previously rejected the claim in a 2-1 decision.", "The government plans to ask the full US Court of Appeals for the District of Columbia to hear the case, with smoking being seen as crucial to their efforts.", "Prosecutors argued that tobacco companies lied about health risks and manipulated nicotine levels.", "A meeting in the Plaza Hotel on December 3rd is central to the government's case.", "The firms have denied the allegations but admit to modifying stances on smoking in recent years.", "The government has until March to file its appeal."], "granite3.1-dense:2b": ["The US Justice Department plans to challenge a recent two-judge decision by an appeals court panel, which rejected a $280 billion claim against major tobacco firms.", "Filed in 1999 under the Clinton administration, this lawsuit accused these companies—including Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, and Brown and Williamson—of deceitfully downplaying smoking's health risks, suppressing research, enhancing nicotine levels to increase addiction, and targeting young consumers.", "The government argued that these actions constituted racketeering conspiracy under federal law.", "A three-judge panel dismissed the case, agreeing that it could not be brought under anti-racketeering statutes.", "The tobacco companies deny the allegations, stating they never illegally collaborated to mislead the public and have fulfilled many of their 1998 settlement demands with 46 states.", "Prosecutors emphasize a 1953 Plaza Hotel meeting as pivotal evidence of the conspiracy, where executives allegedly agreed on a unified strategy to deny smoking's harmful effects.", "Despite earlier denials, some companies now acknowledge that nicotine is harmful.", "The government has until March 21 to file its appeal."]}