{"raw_text": "Lufthansa flies back to profit\n \n German airline Lufthansa has returned to profit in 2004 after posting huge losses in 2003.\n \n In a preliminary report, the airline announced net profits of 400m euros ($527.61m; £274.73m), compared with a loss of 984m euros in 2003. Operating profits were at 380m euros, ten times more than in 2003. Lufthansa was hit in 2003 by tough competition and a dip in demand following the Iraq war and the killer SARS virus. It was also hit by troubles at its US catering business. Last year, Lufthansa showed signs of recovery even as some European and US airlines were teetering on the brink of bankruptcy. The board of Lufthansa has recommended paying a 2004 dividend of 0.30 euros per share. In 2003, shareholders did not get a dividend. The company said that it will give all the details of its 2004 results on 23 March.\n", "llama3.2:1b": ["Lufthansa returns to profit in 2004 after posting huge losses in 2003.", "The airline reported net profits of €400m (€527.61m), up from a loss of €984m.", "Operating profits were also higher, at €380m.", "Despite this, Lufthansa still faced challenges in 2003 and its US catering business struggled."], "llama3.2:3b": ["Lufthansa has returned to profit in 2004 with net profits of 400m euros and operating profits of 380m euros after posting huge losses in 2003 due to tough competition, demand dip, and US catering troubles."], "gemma2:2b": ["Lufthansa returned to profit in 2004 after significant losses in 2003.", "Operating profits were ten times higher than in 2003, driven by recovery from past difficulties and a competitive landscape that was less impacted.", "The company is recommending a dividend of 0.30 euros per share for 2004.", "Detailed results will be released on March 23rd."], "qwen2.5:0.5b": ["In 2003, German airline Lufthansa posted huge losses but returned to profit in 2004, which was later reported by the board of Lufthansa as paying a 2004 dividend of 0.30 euros per share."], "qwen2.5:1.5b": ["German airline Lufthansa reports net profits of €400 million for 2004 after posting losses of €984 million in 2003, marking a turnaround from tough competition and economic downturns including the Iraq war and SARS virus.", "The company plans to pay an annual dividend of €0.30 per share on March 23rd."], "qwen2.5:3b": ["Lufthansa returned to profit in 2004 with net profits of 400m euros after posting huge losses in 2003 due to tough competition and reduced demand from the Iraq war, SARS virus, and issues at its US catering business.", "Operating profits were 380m euros, ten times more than in 2003.", "The board recommended a 2004 dividend of 0.30 euros per share, following no dividend payout in 2003.", "Details of the full results are to be released on March 23rd."], "opencoder:1.5b": ["Lufthansa flies back to profit.", "Lufthansa has returned to profit in 2004 after posting huge losses in 2003.", "In a preliminary report, the airline announced net profits of 400m euros ($527.61m; £274.73m), compared with a loss of 984m euros in 2003.", "Operating profits were at 380m euros, ten times more than in 2003.", "Lufthansa was hit in 2003 by tough competition and a dip in demand following the Iraq war and the killer SARS virus.", "It also faced troubles at its US catering business.", "Last year, Lufthansa showed signs of recovery even as some European and US airlines were teetering on the brink of bankruptcy.", "The board of Lufthansa has recommended paying a 2004 dividend of 0.30 euros per share in 2003.", "The company said that it will give all the details of its 2004 results on 23 March."], "smollm:1.7b": ["Lufthansa has returned to profit in 2004 after posting huge losses in 2003.", "German airline Lufthansa has shown signs of recovery even as some European and US airlines were teetering on the brink of bankruptcy.", "The board of Lufthansa has recommended paying a 2004 dividend of 0.30 euros per share.", "In 2003, shareholders did not get a dividend.", "The company said that it will give all the details of its 2004 results on 23 March."], "deepseek-r1:1.5b": ["Lufthansa returned to profit in 2004 following a severe loss in 2003.", "With €400m net profits compared to a €984m loss, operating profits were €380m, ten times higher than the previous year.", "The airline faced challenges including tough competition and demand drops due to events like Iraq War and SARS.", "Despite issues at its US catering business, Lufthansa showed signs of recovery.", "In 2004, a dividend recommendation of €0.30 per share was set, with results expected on March 23."], "tinyllama:1.1b": ["Lufthansa, a German airline, has returned to profitability in 2004 after posting huge losses in 2003.", "The company announced net profits of 400m euro, compared with a loss of 984m euro in 2003.", "Operating profit was at 380m euro, over ten times more than the previous year's loss.", "Lufthansa faced competition from US airlines and troubles at its US catering business as European and US airlines were teetering on the brink of bankruptcy in 2004.", "The board of Lufthansa has recommended paying a 2004 shareholder dividend of 0.30 euro, following a 2003 dividend of 0.15 euro.", "In 2004, Lufthansa is expected to report its 2004 results on March 23rd."], "tinydolphin:1.1b": [" Lufthansa has returned to profitability in 2004 after posting huge losses in 2003.", "The airline reported a preliminary report of net profits of 400 million euros ($527.61m; £274.73m) for the year, compared with a loss of 984 million euros in 2003.", "Operating profits were at 380 million euros, more than ten times higher than in 2003.", "The airline was affected by tough competition and a dip in demand following the Iraq war and the SARS virus, but showed signs of recovery even as some European and US airlines were teetering on the brink of bankruptcy.", "Lufthansa's board has recommended paying a 2004 dividend of 0.30 euros per share.", "Shareholders did not receive a dividend in 2003, but will be given all the details of its 2004 results on 23 March."], "phi:2.7b": [" Lufthansa has returned to profit in 2004 after posting huge losses in 2003 due to tough competition and a dip in demand following the Iraq war and SARS virus, but also by troubles at its US catering business.", "The board has recommended paying a dividend of 0.30 euros per share for 2004."], "orca-mini:3b": [" German airline Lufthansa returned to profit in 2004 after posting huge losses in 2003, thanks to improved operating profits and a 10x increase in the value of its catering business.", "However, Lufthansa was hit by competition and demand drops due to the Iraq war and SARS virus in 2003.", "Despite the challenges, Lufthansa showed signs of recovery in 2004.", "The company recommended paying a dividend of 0.30 euros per share in 2004, while shareholders did not get a dividend in 2003.", "Details of the 2004 results will be revealed on March 23, 2005."], "hermes3:3b": ["Lufthansa returns to profit (400m€) in 2004 after 2003 losses due to competition, Iraq war impact, SARS, and US catering troubles."], "stablelm-zephyr:3b": ["Lufthansa, a German airline, returned to profit in 2004 after massive losses in 2003 due to tough competition, the Iraq war's dip in demand, and issues with their US catering business.", "Operating profits increased tenfold compared to 2003, and the company showed signs of recovery amidst bankruptcy struggles of some European and US airlines.", "The board recommended a 0.30 euros per share dividend for 2004, contrasting with non-payment in 2003.", "Lufthansa plans to release all details of its 2004 results on March 23rd."], "chatgpt-4o-latest": ["Lufthansa returned to profit in 2004 with net profits of 400 million euros, compared to a 984 million euro loss in 2003.", "Operating profits rose to 380 million euros, ten times higher than the previous year.", "The airline had struggled in 2003 due to competition, reduced demand after the Iraq war and SARS, and issues with its US catering business.", "Despite challenges, Lufthansa recovered while some European and US airlines faced bankruptcy.", "The board recommended a 2004 dividend of 0.30 euros per share, after no dividend in 2003.", "Full results will be released on 23 March."], "stablelm2:1.6b": ["Lufthansa returns to profit after losses in 2003, with operating profits at 20 times more than in 2003 due to tough competition and dip in demand following wars and SARS.", "Troubles at US catering business also affected the company.", "Lufthansa showed signs of recovery in 2003 despite similar bankruptcies among European and US airlines.", "Board recommends paying a dividend of 0.20 euros per share, while shareholders did not receive one in 2003.", "Full details of results will be released on March 1st."], "granite3.1-dense:2b": ["Lufthansa, a German airline, rebounded to profit in 2004 after experiencing significant losses in 2003.", "The preliminary report indicates net profits of 400 million euros and an increase in operating profits to 380 million euros, tenfold more than in 2003.", "This turnaround was attributed to improved performance following challenging years marked by intense competition, reduced demand due to the Iraq war and SARS virus, and issues at its US catering operations.", "Despite these challenges, Lufthansa demonstrated recovery in 2004, while many other airlines faced financial crises.", "The board has proposed a 2004 dividend of 0.30 euros per share, following the absence of a dividend in 2003.", "The company will reveal comprehensive 2004 results on March 23."]}