{"raw_text": "Brussels raps mobile call charges\n \n The European Commission has written to the mobile phone operators Vodafone and T-Mobile to challenge \"the high rates\" they charge for international roaming.\n \n In letters sent to the two companies, the Commission alleged the firms were abusing their dominant market position in the German mobile phone market. It is the second time Vodafone has come under the Commission's scrutiny. The UK operator is already appealing against allegations that its UK roaming rates are \"unfair and excessive\". Vodafone's response to the Commission's letter was defiant. \"We believe the roaming market is competitive and we expect to resist the charges,\" said a Vodafone spokesman. \"However we will need time to examine the statement of objections in detail before we formally respond.\"\n \n The Commission's investigation into Vodafone and Deutsche Telekom's T-Mobile centres on the tariffs the two companies charge foreign mobile operators to access their networks when subscribers of those foreign operators use their mobile phones in Germany.\n \n The Commission believes these wholesale prices are too high and that the excess is passed on to consumers. \"The Commission aims to ensure that European consumers are not overcharged when they use their mobile phones on their travels around the European Union,\" the Commission said in a statement. Vodafone and O2, Britain's other big mobile phone operator, were sent similar statements of objections by the Commission in July last year. Vodafone sent the Commission a response to those allegations in December last year and is now waiting for a reply. The Vodafone spokesman said a similar process would be set in motion with these latest statement of objections about its operations in Germany.\n \n The companies will have three months to respond to the Commission's allegations and the process \"may go on for some time yet\", the spokesman said. The Commission could charge the companies up to 10% of their annual turnover, though in practice that sort of figure is rarely demanded. The Commission's latest move comes just a few months after national telecoms regulators across Europe launched a joint investigation which could lead to people being charged less for using their mobile phone when travelling abroad. The investigation involves regulators assessing whether there is effective competition in the roaming market.\n", "llama3.2:1b": ["The European Commission has sent letters to Vodafone and T-Mobile, challenging their high international roaming charges.", "Vodafone and Deutsche Telekom's T-Mobile have been accused of abusing their dominant market position in Germany.", "The Commission believes these wholesale prices are too high due to the lack of competition.", "A similar process was initiated against O2 by the Commission in July last year with Vodafone responding and now waiting for a reply."], "llama3.2:3b": ["The European Commission has written to Vodafone and T-Mobile, challenging high rates they charge for international roaming.", "The companies are accused of abusing their dominant market position in Germany, passing excess costs on to consumers.", "The Commission aims to ensure European consumers are not overcharged when using mobile phones abroad."], "gemma2:2b": ["The European Commission sent letters to Vodafone and T-Mobile accusing them of abusing their market position by charging high rates for international roaming.", "The Commission's investigation focuses on wholesale prices charged to other mobile operators, believing these are too high and passed onto consumers.", "The companies have three months to respond before a possible penalty."], "qwen2.5:0.5b": ["The European Commission has challenged Vodafone and T-Mobile's high rates for international roaming, stating that they are abusing their dominant market position in Germany and could increase charges for European consumers traveling around the EU."], "qwen2.5:1.5b": ["The European Commission has written letters challenging high international roaming charges paid by Vodafone and T-Mobile customers, following an earlier complaint about unfair UK roaming rates.", "This follows a previous similar letter from the commission regarding Germany's mobile phone market, which is set to undergo a three-month process of response from Vodafone before further action could be taken.", "The investigation aims to ensure European consumers are not overcharged for their use of international mobile networks."], "qwen2.5:3b": ["The European Commission has sent letters to Vodafone and T-Mobile challenging high international roaming charges, alleging they abuse dominant market positions.", "This follows similar scrutiny of UK operator Vodafone for unfair roaming rates.", "The investigation focuses on excessive wholesale prices from foreign operators using German networks, which are passed on to consumers.", "Vodafone responded defiantly but is preparing a detailed response within three months.", "If found guilty, the companies could face up to 10% of their annual turnover in fines.", "This comes amidst broader European investigations aiming for reduced roaming charges when abroad."], "opencoder:1.5b": ["The European Commission has written to Vodafone and T-Mobile, challenging the high rates they charge for international roaming.", "The companies made similar statements about unfair and excessive charges due to competitive roaming markets.", "The Commission's investigation focuses on these wholesale prices, which are too high and may be passed up to consumers.", "As it stands, Vodafone and O2, the UK operator, have been sent similar statements of objections by the Commission in July and December last year.", "The companies will need three more months for a response, but some time is yet to be seen."], "smollm:1.7b": ["The text above summarizes the main points of the article, but it does not provide any additional information or explanations about the specific details mentioned in the text.", "It only provides a concise summary of the key ideas and details without providing any additional context or background information."], "deepseek-r1:1.5b": ["The European Commission is challenging high rates for international roaming with mobile phone operators in Germany.", "The UK operator, Vodafone, has faced similar scrutiny before and is appealing their claims that rates are unfair and excessive.", "The Commission investigates tariffs charged to foreign operators accessing networks via German phones.", "Charges seem excessive due to being too high, passed on to consumers.", "Vodafone defended its stance as defiant but acknowledged needing time to examine objections in detail.", "The response period for Vodafone remains three months, with similar processes set for Deutsche Telekom and O2."], "tinyllama:1.1b": ["Paris rappelé par des appels mobiles hautement exorbitants, les opérateurs de téléphones mobiles T-Mobile et Vodafone sont critiqués par la Commission européenne pour leur pratique de l'émulation dans le domaine mobile.", "Les deux chaînes ont reçu des lettres de la part de la Commission, qui a souligné que les opérateurs avaient pris une position dominante dans le marché du téléphonie mobiles allemand.", "La France est déjà énoncée en appel contre l'allegation selon laquelle les tarifs d'émulation du marché mobile allemande sont incompréhensibles et excessifs pour les consommateurs.", "Le communiqué de la Commission européenne n'a pas d'objectif particulier pour ce qui porte sur le rapport entre Voïmahoné et T-Mobile et O2, mais les deux chaînes ont été envoyées une réponse aux questions du Comité européen en décembre dernier.", "Les opérateurs français sont maintenant passés à l'obligation de répondre aux accusations et à cette étape s'accompagneront des trois mois suivants pour que ce processus \"ne peut pas durer\" selon le déblocage d'une voix du directeur général de T-Mobile.", "La Commission européenne a en outre critiqué les opérateurs françaises pour avoir déjà provoqué des tarifs exceptionnels pour leurs clients étrangers dans l'Europe, alors que les règles allemandes et les réglementations nationales européennes sont étroites sur ce point."], "tinydolphin:1.1b": [" European Commission has sent letters to Vodafone and T-Mobile, the two dominant mobile phone operating companies in Germany, alleging that they charge excessive rates for international roaming.", "In separate statements of objection sent to the companies, the Commission claims that both firms are abusing their market dominance by overcharging consumers who use their networks while abroad.", "The European Commission has already brought charges against Vodafone in the UK and is now seeking similar allegations from Deutsche Telekom, which it accuses of excessive pricing for foreign subscribers when using its mobile networks in Germany."], "phi:2.7b": [" The European Commission has questioned Vodafone and T-Mobile's high international roaming rates, alleging they are taking advantage of their dominant position in the German mobile phone market.", "The companies have responded defiantly to the letters sent by the Commission, but will need time to examine the allegations.", "The process may take some time to complete, and the Commission could impose a fine of up to 10% of the companies' annual turnover."], "orca-mini:3b": [" Brussels has written to Vodafone and T-Mobile, charging them for high rates of international roaming.", "The Commission believes that the mobile phone operators are abusing their dominant market position in the German mobile phone market and are charging foreign mobile operators too much for access to their networks.", "The investigation is ongoing and the companies have three months to respond to the allegations."], "hermes3:3b": ["European Commission challenges high mobile call charges for international roaming.", "Vodafone and T-Mobile investigated for abusing dominant market position."], "stablelm-zephyr:3b": ["The European Commission has challenged mobile phone operators Vodafone and T-Mobile over \"high rates\" they charge for international roaming, claiming the firms abuse their dominant position in the German market.", "In a letter to the companies, the Commission accused them of passing excessive charges on to consumers when foreign mobile operators use their networks in Germany.", "The two companies have been given three months to respond to the allegations, which could result in a 10% annual turnover charge if they are found guilty.", "This follows a joint investigation by national telecoms regulators across Europe assessing whether there is effective competition in the roaming market."], "chatgpt-4o-latest": ["The European Commission has accused Vodafone and T-Mobile of charging excessively high international roaming rates in Germany, alleging they are abusing their dominant market position.", "This is the second time Vodafone has faced such scrutiny, as it is already appealing similar allegations in the UK.", "The Commission's investigation focuses on the high wholesale tariffs these companies charge foreign operators, which it believes result in inflated costs for consumers.", "Vodafone has denied wrongdoing and plans to contest the charges.", "The companies have three months to respond, and potential fines could reach up to 10% of their annual turnover, though such penalties are rarely imposed.", "This action follows a broader investigation by European telecom regulators into competition in the roaming market, which could lead to lower charges for consumers."], "stablelm2:1.6b": ["The European Commission has raised concerns over high international roaming charges from mobile phone operators Vodafone and T-Mobile, claiming they abuse their dominant market position in Germany's mobile phone market.", "This is the second time Vodafone faces scrutiny from the Commission.", "The firms are charged with maintaining excessive wholesale prices which are then passed on to consumers.", "The Commission aims to ensure fair treatment of European customers when using mobile phones while travelling within the EU.", "Vodafone and O2 will have three months to respond to the Commission's allegations, though this process could potentially take longer."], "granite3.1-dense:2b": ["The European Commission has written to Vodafone and T-Mobile, alleging they overcharge foreign mobile operators for accessing their networks in Germany, which subsequently impacts consumers' international roaming costs.", "This marks the second such investigation against Vodafone, following an earlier case in the UK.", "The Commission believes these wholesale prices are too high and aims to prevent European consumers from being overcharged while using mobile phones abroad.", "Vodafone has dismissed the charges as defensive, vowing a detailed response.", "Companies have three months to reply; if found guilty, they could face fines up to 10% of their annual turnover.", "This action precedes a joint European telecoms regulators' investigation into effective competition in the roaming market, potentially leading to reduced charges for consumers traveling within the EU."]}