{"raw_text": "WorldCom director admits lying\n \n The former chief financial officer at US telecoms firm WorldCom has admitted before a New York court that he used to lie to fellow board members.\n \n Speaking at the trial of his former boss Bernard Ebbers, Scott Sullivan said he lied to the board to cover up the hole in WorldCom's finances. Mr Ebbers is on trial for fraud and conspiracy in relation to WorldCom's collapse in 2002. He pleads not guilty. The firm had been overstating its accounts by $11bn (£8.5bn). Mr Sullivan, 42, has already pleaded guilty to fraud and will be sentenced following Mr Ebbers' trial, where he is appearing as a prosecution witness. Mr Ebbers, 63, has always insisted that he was unaware of any hidden shortfalls in WorldCom's finances.\n \n In the New York court on Wednesday, Mr Ebbers' lawyer Reid Weingarten asked Mr Sullivan: \"If you believe something is in your interest, you are willing and able to lie to accomplish it, isn't that right?\"\n \n \"On that date, yes. I was lying,\" replied Mr Sullivan. Mr Weingarten has suggested that Mr Sullivan is implicating Mr Ebbers only to win a lighter sentence, something Mr Sullivan denies. Mr Sullivan also rejects a suggestion that he had once told fellow WorldCom board member Bert Roberts that Mr Ebbers was unaware of the accounting fraud at WorldCom. The trial of Mr Ebbers is now into its third week.\n \n Under 23 hours of questioning from a federal prosecutor, Mr Sullivan has previously told the court that he repeatedly warned Mr Ebbers that falsifying the books would be the only way to meet Wall Street revenue and earnings expectations. Mr Sullivan claims that Mr Ebbers refused to stop the fraud. Mr Ebbers could face a sentence of 85 years if convicted of all the charges he is facing. WorldCom's problems appear to have begun with the collapse of the dotcom boom which cut its business from internet companies. Prosecutors allege that the company's top executives responded by orchestrating massive fraud over a two-year period. WorldCom emerged from bankruptcy protection in 2004, and is now known as MCI.\n", "llama3.2:1b": ["Scott Sullivan, former WorldCom CFO, admitted lying to board members about accounting discrepancies.", "He testified before New York court that he lied to cover up $11bn hole in WorldCom's finances.", "Sullivan previously pleaded guilty to fraud and will be sentenced following Bernard Ebbers' trial, where he is a prosecution witness, but denies implicating him to get a lighter sentence."], "llama3.2:3b": ["Former WorldCom CFO Scott Sullivan admitted lying to fellow board members to cover up the company's $11bn financial hole.", "Sullivan will testify that his former boss Bernard Ebbers was aware of the fraud but pleaded not guilty, and Ebbers faces up to 85 years in prison if convicted."], "gemma2:2b": ["Scott Sullivan, former CFO of WorldCom, admitted to lying to the board about accounting discrepancies.", "He was sentenced for fraud, and will be testifying against his former boss Bernard Ebbers, who denies any knowledge of financial misstatements.", "Ebbers faces a potential 85-year sentence if convicted.", "WorldCom, after collapsing in 2002 due to a massive overstatement of accounts and the dotcom crash, emerged from bankruptcy as MCI."], "qwen2.5:0.5b": ["WorldCom former chief financial officer Scott Sullivan admitted to lying before a New York court.", "He claimed he used to lie to the board of directors, covering up the hole in WorldCom's finances.", "He pleaded not guilty to fraud charges against his former boss Bernard Ebbers and faces a 85-year sentence if convicted.", "WorldCom was involved in a financial crisis following the dot-com boom, which cut its business from internet companies.", "Prosecutors allege that the company's top executives responded by orchestrating massive fraud over two years.", "WorldCom emerged from bankruptcy protection in 2004 and is now known as MCI."], "qwen2.5:1.5b": ["WorldCom former CFO Scott Sullivan admits lying to cover up accounting fraud, facing potential life sentence for financial misreporting; his defense suggests he did so to avoid harsher penalties."], "qwen2.5:3b": ["Former WorldCom CFO Scott Sullivan admitted lying to fellow board members to cover up financial discrepancies, while his former boss Bernard Ebbers denies being aware of the fraudulent accounting practices.", "Sullivan has pleaded guilty to fraud and will face sentencing after Ebbers' trial.", "At Ebbers's trial in New York, Ebbers’s lawyer suggested that Sullivan lied only for a lighter sentence, which Sullivan denied.", "Prosecutors allege that top executives orchestrated massive fraud over two years to meet Wall Street expectations, leading to WorldCom's bankruptcy and subsequent transformation into MCI."], "opencoder:1.5b": ["The former chief financial officer at US telecoms firm WorldCom has admitted before a New York court that he used to lie to fellow board members.", "He said he had been caught tampering with the book of accounts by Mr Ebbers in relation to WorldCom's collapse in 2002, pleading not guilty following his trial.", "The firm had made several false accusations about its accounting practices which resulted in a significant financial fallout."], "smollm:1.7b": ["The summary should be:\nWorldCom director admits lying to fellow board members before a New York court about WorldCom's financial situation.", "He pleads not guilty and will be sentenced after WorldCom's trial.", "The former chief financial officer confessed that he lied to the board to cover up the hole in WorldCom's finances, but did not admit that Mr Ebbers was unaware of any hidden shortfalls."], "deepseek-r1:1.5b": ["The former chief financial officer of WorldCom, Scott Sullivan, admitted in a New York court in 2004 that he lied to his board members about overstating financial accounts by $11 billion ($8.5 billion at the time).", "He pleaded guilty for fraud and conspiracy related to WorldCom's collapse in 2002.", "The trial is ongoing under 23 hours of questioning, with him appearing as a prosecution witness.", "The case involves fraud and conspiracy charges, with potential sentences ranging up to 85 years if convicted."], "tinyllama:1.1b": ["L’ancien directeur en finance de WorldCom, Scott Sulliblan (59), a déclaré devant la cour d'appel américaine d'New York que, au cours d'une conférence de préliminaire, il avait avoué à des membres du conseil d'administration d’une façon assez bienveillante et sans motif précis la faute d’un déficit financier important.", "Il a également affirmé qu’il avait envoyé un message à Bert Roberts, un ancien directeur de finance de WorldCom, qui n’avait pas réfléchi à la situation financière de la société.", "Il a révélé aussi qu’il a déclaré à des témoins que le boss de comptabilité du groupe avait refusé de continuer les faux comptes pour trouver un moyen d'obtenir des revenus Wall Street et d'exploiter les caractéristiques de la vente d'Internet.", "Les faits apparemment commencèrent avec le blocage du cycle des boursier dans l'année qui a succédé à la crise de l'internet, selon les accusers.", "La société est revenue de faillite en 2004 et est connue maintenant sous le nom de MCIS (ancien nom : WorldCom)."], "tinydolphin:1.1b": [" The statement provides a brief overview of the events in the trial involving Scott Sullivan, former CFO of US telecoms firm WorldCom, who admitted to lying to board members about the company's finances before being charged by the U.S. Federal Court in New York."], "phi:2.7b": [" A former director of WorldCom admitted lying to fellow board members about the hole in the company's finances during the telecoms firm's collapse in 2002.", "The CFO, Scott Sullivan, who pleaded guilty to fraud, claimed he lied to cover up the accounting discrepancies.", "His ex-boss, Bernard Ebbers, was on trial for the same charges and is pleading not guilty.", "During the trial, it was revealed that Mr Sullivan had implicate Mr Ebbers only to get a lighter sentence.", "The company's problems were triggered by the dotcom bubble burst which led to a drop in business from internet companies.", "Prosecutors allege that top executives at WorldCom orchestrated massive fraud over two years."], "orca-mini:3b": [" The former chief financial officer at US telecoms firm WorldCom has admitted lying to fellow board members about the company's finances."], "hermes3:3b": ["WorldCom CFO admits lying to board about financial hole during trial."], "stablelm-zephyr:3b": ["Scott Sullivan, former CFO of telecoms firm WorldCom, admitted to lying to board members about the $11bn accounting hole.", "Speaking in the trial of founder Bernard Ebbers, who denies charges of fraud and conspiracy related to WorldCom's 2002 collapse, Sullivan said he lied to cover up the hidden shortfalls in finances.", "Ebbers' lawyer suggested Sullivan was implicating his client for a lighter sentence, but Sullivan denied the suggestion.", "WorldCom's troubles began with the dotcom boom's decline, leading to top executives perpetrating fraud over two years before the company emerged from bankruptcy protection in 2004 as MCI."], "chatgpt-4o-latest": ["Former WorldCom CFO Scott Sullivan admitted in a New York court that he lied to the board to conceal financial shortfalls.", "He testified against former CEO Bernard Ebbers, who is on trial for fraud and conspiracy related to WorldCom’s $11 billion accounting scandal.", "Ebbers denies wrongdoing, claiming he was unaware of the fraud.", "Sullivan, who has pleaded guilty, denies implicating Ebbers for a lighter sentence.", "He testified that he warned Ebbers about the fraudulent accounting, but Ebbers refused to stop it.", "If convicted, Ebbers could face up to 85 years in prison.", "WorldCom, which collapsed in 2002, emerged from bankruptcy in 2004 as MCI."], "stablelm2:1.6b": ["Former WorldCom CFO Scott Sullivan admitted before a New York court that he lied to cover up financial discrepancies during the firm's collapse in 2001.", "Sullivan covered up the hole in WorldCom's finances by telling the board it was not a problem, when in reality it was over $8bn.", "He pleaded guilty to fraud and will face sentencing after his former boss Bernard Ebbers' trial.", "Ebbers is on trial for fraud and conspiracy relating to WorldCom's collapse but has always denied any involvement.", "The dotcom boom caused significant issues for WorldCom; prosecutors claim top executives orchestrated massive fraud over two years, leading the company into bankruptcy in 2001 with its name now known as MCI."], "granite3.1-dense:2b": ["Former WorldCom CFO Scott Sullivan admitted to lying to the board of directors, including his former boss Bernard Ebbers, about the company's financial health during a New York court trial.", "This testimony supports fraud allegations against Ebbers, who is on trial for overstating WorldCom's accounts by $11 billion in 2002, leading to the telecoms firm's collapse.", "Sullivan pleaded guilty to fraud and will be sentenced following Ebbers' trial.", "During questioning, prosecutor Reid Weingarten suggested Sullivan was implicating Ebbers for a lighter sentence, which Sullivan denies.", "Sullivan claims he repeatedly warned Ebbers that book-cooking was the only way to meet Wall Street expectations, but Ebbers allegedly refused to stop the fraud.", "If convicted, Ebbers faces up to 85 years in prison.", "The financial issues began with the dotcom crash, and prosecutors accuse top executives of orchestrating a two-year fraud scheme.", "WorldCom emerged from bankruptcy as MCI in 2004."]}