{"raw_text": "Glaxo aims high after profit fall\n \n GlaxoSmithKline saw its profits fall 9% last year to £6.2bn ($11.5bn), but Europe's biggest drugmaker says a recovery during 2005 is on the way.\n \n Cheap copies of its drugs, particularly anti-depressants Paxil and Wellbutrin, and a weak dollar had hit profits, but global sales were up 1% in 2004. The firm is confident its new drug pipeline will deliver profits despite the failure of an obesity drug. Chief executive Jean-Pierre Garnier said it had been a \"difficult year\".\n \n In early afternoon trade in London the company share price was down 1% at 1218 pence. Mr Garnier said the company had absorbed over £1.5bn of lost sales to generics but still managing to grow the business. \"The continuing success of our key products means we can now look forward to a good performance in 2005,\" he said. \"2005 will also be an important year in terms of research and development pipeline progress.\" However, the firm discontinued development of an experimental treatment for obesity, known as '771, after disappointing clinical trial results. Glaxo is relying on new treatments for conditions such as cancer, diabetes, depression, HIV/AIDS and allergies to lift the pace of sales growth after several disappointing years.\n", "llama3.2:1b": ["GlaxoSmithKline saw a 9% fall in profits last year to £6.2bn due to cheaper copies of its drugs, weak dollar prices, and an obesity drug that failed trials.", "Despite this, the company is confident about its new pipeline, including treatments for cancer, diabetes, depression, HIV/AIDS, and allergies."], "llama3.2:3b": ["GlaxoSmithKline saw profits fall 9% last year due to cheap generic versions of its drugs and a weak dollar.", "Global sales were up 1% in 2004.", "The company is confident that its new drug pipeline will deliver profits, despite the failure of an obesity drug and discontinuing development of another experimental treatment."], "gemma2:2b": ["GlaxoSmithKline's profit fell 9% in 2004 due to generic competition and a weak dollar.", "Despite this, global sales increased 1%.", "The company expects profit recovery in 2005 thanks to new drug development pipeline.", "Glaxo discontinued obesity treatment '771', but remains focused on treatments for cancer, diabetes, depression, HIV/AIDS, and allergies."], "qwen2.5:0.5b": ["GlaxoSmithKline saw a 9% fall in profits last year to £6.2bn, but CEO Jean-Pierre Garnier says that global sales are up 1% in 2004.", "He said his company is confident its new drug pipeline will deliver profits despite the failure of an obesity drug."], "qwen2.5:1.5b": ["GlaxoSmithKline reported a 9% profit decline to £6.2bn in 2004 despite strong overall revenue growth of 1%.", "Key factors included falling drug prices due to generics competition and a weaker dollar, with the company's pipeline expected to drive better performance in 2005."], "qwen2.5:3b": ["GlaxoSmithKline saw its profits fall 9% to £6.2bn in 2004 due to cheap generic drug copies and a weak dollar, but global sales increased by 1%.", "The company expects recovery in 2005 thanks to its new pipeline of drugs including those for cancer, diabetes, depression, HIV/AIDS, and allergies.", "However, the company discontinued development of an obesity treatment after disappointing clinical results.", "Its share price dropped 1% to £12.18 in early London trade."], "opencoder:1.5b": ["GlaxoSmithKline saw its profits fall 9% last year to £6.2bn ($11.5bn), but Europe's biggest drugmaker says a recovery during 2005 is on the way.", "The firm is confident its new drug pipeline will deliver profits despite the failure of an obesity drug, and the company discontinued development of an experimental treatment for obesity after disappointing clinical trial results."], "smollm:1.7b": ["GlaxoSmithKline's profits fell 9% last year due to a decline in European sales, but Europe's biggest drugmaker says a recovery is on the way during 2005.", "The firm has been confident about its new drug pipeline and expects it to deliver profits despite the failure of an obesity drug.", "In early afternoon trade in London, the company share price was down 1% at £11.50.", "Chief executive Jean-Pierre Garnier said the company had been a \"difficult year\" due to the loss of sales to generics and the continued impact of the obesity drug failure on its pipeline progress.", "The firm's management team has been working hard to recover from the setback, but it is confident that new treatments for conditions such as cancer, diabetes, depression, HIV/AIDS and allergies will lift the pace of sales growth during 2005."], "deepseek-r1:1.5b": ["GlaxoSmithKline reported profits down 9% to £6.2bn ($11.5bn) last year, despite Europe's biggest drugmaker claiming progress in 2005.", "Key areas impacted include cheap drug copies and a weak dollar, but global sales up 1%.", "CEO Jean-Pierre Garnier emphasized continued success with key products, promising growth next year, noting reliance on new treatments for conditions like cancer, diabetes, depression, HIV/AIDS, and allergies.", "Share price dropped 1% in London, reflecting mixed performance."], "tinyllama:1.1b": ["GlaxoSmithKline saw its profits fall 9% last year despite a rise in sales of new drugs, including anti-depressants Pacilex and Wellbutrin, which were hit by cheap copies and the weak dollar.", "Sales grew by 1%, but the company is confident that its pipeline of new drugs will boost profitability in the face of generic competition.", "Despite losing sales to generic brands, Glaxo has absorbed £1.5bn of lost sales but still managed to grow its business.", "The firm is now focusing on research and development for obesity treatment known as \"771\", which after disappointing clinical trial results, it continues to develop despite the negative impact of recent market trends."], "tinydolphin:1.1b": [" GlaxoSmithKline, Europe's largest drugmaker, saw profits fall 9% last year to £6.2bn ($11.5bn).", "However, during its recovery in 2005, the company expects a significant rise in sales, as it aims to maintain its leading position and boost growth by focusing on research and development projects.", "Despite facing losses in expensive drugs like Paxil and Wellbutrin, Glaxo was able to increase profits through the acquisition of several new products during 2004, including cheaper versions of its popular anti-depressants, Paxil and Wellbutrin.", "The company's strong financial performance can be attributed to increased sales from its new drug pipeline, which includes medications that have been successful in the global market despite facing significant competition from generics.", "In addition, Glaxo has managed to grow by absorbing over £1.5bn of lost sales due to competitors and continued research and development progress, thus demonstrating its ability to anticipate market trends and stay ahead of the competition in the years ahead.", "However, the company discontinued development of an experimental treatment for obesity following disappointing clinical trial results, which may hold back growth in the near future but is seen as a strategic move in terms of R&D pipeline advancement."], "phi:2.7b": [" GlaxoSmithKline's profits fell 9% in 2004 but they are recovering due to an increase in global sales by 1% in 2004.", "They believe that their new drug pipeline will deliver profits despite a failed obesity drug trial.", "The company plans on developing treatments for cancer, diabetes, depression, HIV/AIDS and allergies to boost sales growth."], "orca-mini:3b": [" Glaxo aims high after profit fall despite a weak dollar and generic competition.", "Despite a 9% drop in profits last year, the company is confident about the future due to a new drug pipeline and global sales growth of 1%.", "Paxil and Wellbutrin are the company's most successful drugs, but the failure of an obesity drug is still affecting profits.", "The company plans to grow the business through research and development despite the loss of sales to generics.", "However, they discontinued development of an experimental treatment for obesity after disappointing clinical trial results.", "Glaxo is relying on new treatments for conditions such as cancer, diabetes, depression, HIV/AIDS, and allergies to lift the pace of sales growth after several disappointing years."], "hermes3:3b": ["GlaxoSmithKline reports 9% profit drop ($11.5b) in 2004, but expects recovery in 2005; confident in new drug pipeline despite obesity drug failure."], "stablelm-zephyr:3b": ["GlaxoSmithKline's profits fell 9% in 2004 to £6.2bn ($11.5bn) due to cheap copies of its drugs and a weak dollar.", "However, global sales were up 1% in 2004, and the company believes its new drug pipeline will deliver profits in 2005 despite the failure of an obesity drug.", "Despite discontinuing the development of an experimental treatment for obesity, known as '771, Glaxo is focusing on new treatments for conditions such as cancer, diabetes, depression, HIV/AIDS, and allergies to drive sales growth."], "chatgpt-4o-latest": ["GlaxoSmithKline's profits fell 9% to £6.2bn in 2004 due to competition from generic drugs and a weak dollar, though global sales rose 1%.", "Despite a difficult year, CEO Jean-Pierre Garnier remains optimistic about 2005, citing strong key product performance and a promising drug pipeline.", "The company absorbed £1.5bn in lost sales to generics but continued to grow.", "However, it discontinued an experimental obesity drug after poor trial results.", "Glaxo is focusing on new treatments for cancer, diabetes, depression, HIV/AIDS, and allergies to drive future growth."], "stablelm2:1.6b": ["GlaxoSmithKline experienced a £6.2bn ($5bn) drop in profits due to cheaper copies of their drugs and a weak dollar, but plans for recovery as global sales increase by 1%.", "The company is confident its new drug pipeline will deliver profits despite the discontinuation of an experimental obesity treatment.", "Despite absorbing over £1.5bn of lost sales to generics, Glaxo continues to grow its business with successful key products.", "They anticipate a good performance in 205 and expect new treatments for various conditions such"], "granite3.1-dense:2b": ["GlaxoSmithKline, Europe's leading pharmaceutical firm, reported a 9% drop in profits for 2004, totaling £6.2bn ($11.5bn), due to cheaper generic versions of its drugs like Paxil and Wellbutrin, and a weak US dollar.", "Despite this, global sales increased by 1% that year.", "Chief Executive Jean-Pierre Garnier expressed optimism for 2005, attributing the company's resilience to its robust pipeline of new drugs targeting conditions such as cancer, diabetes, depression, HIV/AIDS, and allergies.", "Glaxo absorbed over £1.5bn in lost sales from generics but maintained growth.", "The firm also discontinued an obesity treatment due to unfavorable clinical trial results, focusing instead on these promising new therapies for 2005."]}