{"raw_text": "US bank in $515m SEC settlement\n \n Five Bank of America subsidiaries have agreed to pay a total of $515m (£277m) to settle an investigation into fraudulent trading share practices.\n \n The US Securities and Exchange Commission announced the settlements, the latest in an industry-wide clean-up of US mutual funds. The SEC also said it had brought fraud charges against two ex-senior executives of Columbia Distributor. Columbia Distributor was part of FleetBoston, bought by BOA last year. Three other ex-Columbia executives agreed settlements with the SEC.\n \n The SEC has set itself the task of stamping out the mutual funds' use of market-timing, a form of quick-fire, short-term share trading that harms the interests of small investors, with whom mutual funds are particularly popular. In the last two years, it has imposed penalties totalling nearly $2bn on 15 funds. The SEC unveiled two separate settlements, one covering BOA's direct subsidiaries, and another for businesses that were part of FleetBoston at the time. In both cases, it said there had been secret deals to engage in market timing in mutual fund shares. The SEC agreed a deal totalling $375m with Banc of America Capital Management, BACAP Distributors and Banc of America Securities. It was made up of $250m to pay back gains from market timing, and $125m in penalties. It is to be paid to the damaged funds and their shareholders. Separately, the SEC said it had reached a $140m deal - equally split between penalties and compensation - in its probe into Columbia Management Advisors (CAM) and Columbia Funds Distributor (CFD) and three ex-Columbia executives. These businesses became part of BOA when it snapped up rival bank FleetBoston in a $47bn merger last March.\n \n The SEC filed civil fraud charges in a Boston Federal court against James Tambone, who it says headed CFD's sales operations, and his alleged second in command Robert Hussey. The SEC is pressing for the highest tier of financial penalties against the pair for \"multiple violations\", repayment of any personal gains, and an injunction to prevent future breaches, a spokeswoman for the SEC's Boston office told the BBC. There was no immediate comment from the men's' lawyers. The SEC's settlement with CAM and CFD included agreements with three other ex-managers, Peter Martin, Erik Gustafson and Joseph Palombo, who paid personal financial penalties of between $50-100,000.\n", "llama3.2:1b": ["Five Bank of America subsidiaries have agreed to pay $515m (£277m) in a US Securities and Exchange Commission (SEC) settlement related to fraudulent trading share practices.", "The settlements cover direct subsidiaries of BOA and businesses that were part of FleetBoston at the time of the merger."], "llama3.2:3b": ["Bank of America subsidiaries agree to pay $515m to settle SEC investigation into fraudulent trading practices by mutual funds, including market timing, which harms small investors.", "The SEC has imposed over $2bn in penalties on 15 funds in the last two years.", "Two ex-senior executives at Columbia Distributor and three others agreed settlements with the SEC."], "gemma2:2b": ["Bank of America subsidiaries will pay $515 million to settle SEC investigations into fraudulent share trading practices in mutual funds.", "The settlements follow a broader industry-wide crackdown on market timing, a practice that harms small investors.", "The SEC's action includes fines and penalties for both Bank of America subsidiaries and former executives at Columbia Management Advisors (CAM) and Columbia Funds Distributor (CFD)."], "qwen2.5:0.5b": ["US bank BofA has settled for $515m to clean up mutual funds and settle charges against ex-executives."], "qwen2.5:1.5b": ["US banks settle fraud against mutual funds totaling $515m; SEC charges Columbia executives over market timing practices in mutual fund shares."], "qwen2.5:3b": ["US bank Bank of America agreed to pay a total of $515m (£277m) in settlements with the US Securities and Exchange Commission (SEC) over fraudulent trading practices.", "The SEC accused five subsidiaries of Bank of America of engaging in market-timing schemes, which harm small investors by exploiting mutual funds.", "Additionally, two ex-senior executives from Columbia Distributor were charged with fraud, along with three other ex-Columbia executives who reached settlements with the SEC.", "Separate settlements involved Banc of America Capital Management and three ex-Columbia executives, totaling $140m ($70m penalties, $70m compensation).", "The SEC also filed civil fraud charges against James Tambone and Robert Hussey for their roles in CFD's operations, seeking high financial penalties and injunctions."], "opencoder:1.5b": ["The US bank in $515m SEC settlement has agreed to pay a total of $515m (£277m) to settle an investigation into fraudulent trading share practices.", "The US Securities and Exchange Commission announced the settlements, it has brought fraud charges against two ex-senior executives of Columbia Distributor.", "In the last two years, the SEC has imposed penalties totalling nearly $2bn on 15 funds.", "The disclosed settlements cover BOA's direct subsidiaries and a total of $375m with Banc of America Capital Management, BACAP Distributors and Banc of America Securities.", "The securities have been paid to the damaged funds and their shareholders.", "The SEC also has reached a $140m deal in its probe into Columbia Management Advisors (CAM) and Columbia Funds Distributor (CFD)."], "smollm:1.7b": ["The summary is:\n\n1.", "Five Bank of America subsidiaries have agreed to pay a total of $515 million (£277 million) to settle an investigation into fraudulent trading share practices.", "2.", "The US Securities and Exchange Commission announced the settlements, the latest in an industry-wide clean-up of US mutual funds.", "3.", "The SEC has set itself the task of stamping out the mutual funds' use of market timing, a form of quick-fire, short-term share trading that harms the interests of small investors, with whom mutual funds are particularly popular.", "4.", "In the last two years, it has imposed penalties totalling nearly $2bn on 15 funds.", "The SEC agreed two separate settlements, one covering BOA's direct subsidiaries, and another for businesses that were part of FleetBoston at the time.", "5.", "In both cases, it said there had been secret deals to engage in market timing in mutual fund shares.", "6.", "The SEC agreed a deal totalling $375m to pay back gains from market timing, and $125m in penalties.", "It is to be paid to the damaged funds and their shareholders.", "7.", "Separately, the SEC says it has reached a $140m deal - equally split between penalties and compensation - in its probe into Columbia Management Advisors (CAM) and Columbia Funds Distributor (CFD) and three ex-Columbia executives.", "These businesses became part of BOA when it snapped up rival bank FleetBoston in a $47bn merger last March.", "8.", "The SEC is pressing for the highest tier of financial penalties against the pair for \"multiple violations\", repayment of any personal gains, and an injunction to prevent future breaches, a spokeswoman for the SEC's Boston office told the BBC.", "There was no immediate comment from the men's' lawyers."], "deepseek-r1:1.5b": ["The US Securities and Exchange Commission (SEC) announced a $515 million settlement involving five bank subsidiaries in response to ongoing fraud cases.", "The SEC aimed to address mutual fund practices using market-timing strategies, which harm small investors due to rapid share trading.", "Three other senior executives from Columbia Distributor agreed settlements, as did two former COOs and another ex-Columbia executive.", "The SEC targeted mutual funds engaged in these practices, including agreements with BACAP, CFD, CAM, and three others, each settled under separate cases with financial penalties, compensation, or payments.", "One case involved $140m split between fines and compensation, while another included $375m equally split."], "tinyllama:1.1b": ["A total of $515m (£277m) has been agreed by US banking group Bank of America subsidiaries to settle an investigation into fraudulent trading practices in share transactions.", "The settlements were the latest in a broader industry-wide clean-up for mutual funds, and were set against three ex-senior executives of Columbia Distributor, which is part of FleetBoston at the time.", "The SEC imposed penalties totalling $2bn on 15 mutual fund businesses and was to have paid back gain from market timing, but agreed settlements totalled nearly $386m.", "The SEC also brought charges against three former executives of Columbia Distributor: Peter Martin, Erik Gustafson and Joseph Palombos, who each paid personal financial penalties ranging between $50-100,000."], "tinydolphin:1.1b": [" Summarized for the user: The US Securities and Exchange Commission (SEC) has reached a $515m settlement with five bank subsidiaries to resolve allegations that they traded in fraudulent manner.", "The settlements were made to avoid potential legal actions against ex-senior executives of Columbia Distributor and Columbia Funds Distributor, which was part of FleetBoston acquired by BOA last year.", "This marks the latest in an industry-wide clean-up of US mutual funds."], "phi:2.7b": [" Bank of America subsidiaries have agreed to pay a total of $515m in fines to settle an investigation into fraudulent trading share practices, part of the US Securities and Exchange Commission's (SEC) efforts to curb market-timing in mutual funds.", "The SEC has also brought charges against two ex-senior Columbia Executives."], "orca-mini:3b": [" Five US bank subsidiaries of Bank of America agreed to pay a total of $515 million to the US Securities and Exchange Commission to settle allegations of fraudulent trading practices in mutual funds.", "The SEC charged two former senior executives of Columbia Distributor, which was part of FleetBoston, with fraud.", "BOA bought FleetBoston last year.", "Three other ex-Columbia executives agreed settlements with the SEC.", "BOA subsidiaries agreed to repay any gains from market timing and pay penalties.", "The largest penalty was $375 million for Banc of America Capital Management, BACAP Distributors, and Banc of America Securities.", "Another $140 million penalty was agreed with three ex-Columbia executives and the companies they worked for.", "The SEC filed civil fraud charges against James Tambone, who headed CFD's sales operations, and his second in command Robert Hussey."], "hermes3:3b": ["BoA subsidiaries pay $515m to settle SEC fraud trading investigation in mutual funds share practices."], "stablelm-zephyr:3b": ["Bank of America's subsidiaries agreed to pay $515 million in a SEC settlement for fraudulent trading share practices.", "The US Securities and Exchange Commission (SEC) announced this as the latest clean-up effort in the industry.", "The settlement involves two deals: one covering Bank of America's direct subsidiaries, which includes Banc of America Capital Management, BACAP Distributors, and Banc of America Securities, with $250 million to pay back gains from market timing and $125 million in penalties.", "Additionally, a $140 million deal was reached for Columbia Management Advisors (CAM) and Columbia Funds Distributor (CFD), as well as three ex-Columbia executives.", "Civil fraud charges have been filed against James Tambone, who headed CFD's sales operations, and Robert Hussey, his alleged second in command."], "chatgpt-4o-latest": ["Bank of America subsidiaries agreed to pay $515 million to settle an SEC investigation into fraudulent mutual fund trading practices.", "The SEC, aiming to eliminate harmful market-timing trades, has imposed nearly $2 billion in penalties on 15 funds over two years.", "The settlement includes $375 million from Banc of America Capital Management and related entities, with $250 million in restitution and $125 million in penalties.", "A separate $140 million settlement was reached with Columbia Management Advisors and Columbia Funds Distributor, acquired by BOA in its $47 billion FleetBoston merger.", "The SEC also filed fraud charges against two former Columbia executives and settled with three others, who paid personal fines of $50,000 to $100,000."], "stablelm2:1.6b": ["Five Bank of America subsidiaries reach a total $£ settlement with the US Securities and Exchange Commission to address fraudulent trading share practices in mutual funds.", "The SEC also brings fraud charges against two ex-senior executives of Columbia Distributor, part of FleetBoston that was bought by Bank of America last year.", "The SEC aims to stamp out mutual fund market timing, which harms small investors' interests.", "In the past two years, it imposed penalties totaling nearly $2 billion on funds.", "Two separate settlements cover BOA's direct subsidiaries and businesses at the time of FleetBoston merger.", "The SEC agreed a deal totaling $X with Banc of America Capital Management, BACAP Distributors, and Banc of America Securities."], "granite3.1-dense:2b": ["Five Bank of America subsidiaries have agreed to a $515 million (£277 million) settlement with the US Securities and Exchange Commission (SEC), stemming from an investigation into fraudulent trading share practices, particularly market timing in mutual funds.", "This settlement is part of a broader industry-wide effort to eradicate such activities that harm small investors' interests.", "The SEC also charged two former executives from Columbia Distributor, now part of Bank of America (BOA) following its acquisition of FleetBoston last March, with multiple fraud violations and seeks their repayment of personal gains and an injunction against future breaches.", "The total SEC penalty for these two former executives is $140 million, evenly split between penalties and compensation.", "In addition, the SEC secured settlements with three other ex-Columbia management figures, who agreed to pay personal financial penalties ranging from $50,000 to $100,000.", "The total settlement amount includes both penalties and compensation for the damaged funds and shareholders."]}