{"raw_text": "Qantas sees profits fly to record\n \n Australian airline Qantas has posted a record fiscal first-half profit thanks to cost-cutting measures.\n \n Net profit in the six months ending 31 December rose 28% to A$458.4m ($357.6m; £191m) from a year earlier. Analysts expected a figure closer to A$431m. Qantas shares fell almost 3%, however, after it warned that earnings growth would slow in the second half. Sales will dip by at least A$30m after the Indian ocean tsunami devastated many holiday destinations, Qantas said.\n \n \"The tsunami affected travel patterns in ways that we were a bit surprised about,\" chief executive Geoff Dixon explained. \"It certainly affected Japanese travel into Australia. As soon as the tsunami hit we saw ... a lessening with bookings for Australia.\" Higher fuel costs also are expected to eat into earnings in coming months. \"We don't have as much hedging benefit in the second half as we had in the first,\" said chief financial officer Peter Gregg. Qantas is facing increased pressure from rivals such as low-cost carrier Virgin Blue and the Australian government is in talks about whether to allow Singapore Airlines to fly between the Australia and the US - one of Qantas' key routes.\n \n Even so, the firm is predicting that full-year earnings will increase from the previous 12 months. Analysts have forecast full-year profit will rise about 11% to around A$720 million ($563 million). Qantas boss Mr Dixon also said he would be reviewing the group's cost-cutting measures. During the first six months of the fiscal year, Qantas made savings of A$245m, and is on track to top its target of A$500m for the full year. Last month, the company warned it may transfer as many as 7,000 jobs out Australia, with Mr Dixon quoted as saying that the carrier could no longer afford to remain \"all-Australian\".\n", "llama3.2:1b": ["Qantas posts record profits despite cost-cutting measures and increased pressure from rivals, but warns of slower earnings growth in the second half."], "llama3.2:3b": ["Qantas posted a record fiscal first-half profit of A$458.4m ($357.6m; £191m), despite cost-cutting measures and expected sales dip due to the Indian Ocean tsunami.", "Earnings growth is expected to slow in the second half, with Qantas sharing falling almost 3%.", "Full-year earnings are forecast to increase by around 11% to A$720 million."], "gemma2:2b": ["Qantas reported a record profit of A$458.4 million for its fiscal first half, driven by cost-cutting measures and increased demand in certain markets.", "However, the company warned about slowing earnings growth and travel disruptions due to the Indian Ocean tsunami.", "The airline also faces competition from Virgin Blue and potential regulatory changes regarding Singapore Airlines' operations between Australia and the US.", "Despite these challenges, Qantas expects full-year earnings growth of approximately 11%.", "The company is also considering job cuts to optimize costs."], "qwen2.5:0.5b": ["Key ideas:\n\n- Australian airline Qantas posted a record first-half profit of A$458.4m ($357.6m; £191m) thanks to cost-cutting measures.", "- Analysts expected a figure closer to A$431m.", "- The loss is expected to be larger in the second half, after sales will dip by at least A$30m due to the Indian ocean tsunami and higher fuel costs.", "- Qantas faces increased pressure from rivals such as Virgin Blue, the Australian government talks about allowing Singapore Airlines to fly between Australia and the US, and the possibility of transferring up to 7,000 jobs out Australia.", "- Qantas is facing increased pressure from critics who say it has not had a successful first-half season."], "qwen2.5:1.5b": ["Australian airline Qantas reports record first-half profit of $357.6 million after cuts but warns earnings will slow in second half due to lower bookings and increased fuel costs.", "Qantas expects full-year earnings increase from previous year despite challenges posed by low-cost carriers, government talks on US routes, and planned job transfers."], "qwen2.5:3b": ["Qantas has reported a record fiscal first-half profit of A$458.4m ($357.6m; £191m) thanks to cost-cutting measures, up 28% from a year earlier.", "However, earnings growth is expected to slow in the second half due to the Indian Ocean tsunami and rising fuel costs.", "Qantas shares fell almost 3%.", "Despite this, Qantas predicts full-year earnings will increase by around A$720m ($563 million) from the previous year.", "The airline faces increased competition from rivals like Virgin Blue and government talks about Singapore Airlines flying between Australia and the US.", "Qantas is also reviewing its cost-cutting measures after making savings of A$245m in the first six months, on track to meet its full-year target of A$500m."], "opencoder:1.5b": ["Qantas has seen profits since it launched in the post-war years due to cost-cutting measures.", "The net profit increased by a record-breaking 28% from a year ago to A$458.4m, while sales dipped by approximately A$30m due to the ongoing impact of the 2012 Indian ocean tsunami on holiday destinations.", "The Australian airline reported a slow growth in earnings, with higher fuel costs contributing to a decline in profits.", "Qantas shares fell slightly after being warned about the tsunami, while analysts expect its earnings to increase by 11% to about A$720m ($563 million).", "The company plans to make a savings of approximately A$245m and has set a target of A$500m for the fiscal year.", "The company also announced plans to transfer an estimated 7,000 jobs out of Australia."], "smollm:1.7b": ["Qantas saw profits fly to record in the six months ending 31 December, driven by cost-cutting measures and a strong performance on its key route.", "The airline's net profit rose 28% to A$458.4m ($357.6m; £191m) from a year earlier, exceeding expectations.", "Analysts expected the figure closer to A$431m, but Qantas' full-year earnings are likely to be higher due to increased demand for its services and improved operational efficiency.", "The tsunami affected travel patterns in ways that we were a bit surprised about, with lower bookings for Australia among other destinations.", "However, the airline is expecting higher earnings from its key route between Australia and Japan, which will help offset the impact of the tsunami on bookings.", "Higher fuel costs are also expected to eat into earnings in coming months.", "Qantas' full-year profit will increase by about 11% to A$720 million ($563 million), with analysts predicting a strong performance for the year ahead.", "The airline is reviewing its cost-cutting measures, which were implemented last month, and expects to see further savings in the second half of the year.", "Even so, Qantas is predicting that full-year earnings will increase from the previous 12 months' target of A$500 million ($369m).", "The airline's net profit rose 18% to A$472.4m ($344.1m; £215m) last month, exceeding expectations and exceeding its full-year target by a significant margin.", "Qantas' full-year earnings are likely to be higher due to increased demand for its services and improved operational efficiency.", "The airline's strong performance on its key route between Australia and Japan will help offset the impact of the tsunami on bookings, while higher fuel costs will eat into earnings in coming months."], "deepseek-r1:1.5b": ["Qantas achieved its first-half fiscal record with a 28% increase in net profit at $458 million compared to the previous year, driven by cost-cutting measures.", "However, the industry's travel patterns were negatively affected by the Indian Ocean Tsunami, causing sales to drop and earnings growth to slow.", "Despite expected fuel costs and increased competition from Virgin Blue, Qantas predicts full-year profits will rise around 11% to $720 million in the next year."], "tinyllama:1.1b": ["In a record fiscal first-half profit of A$458.4m ($357.6m; £191m), Australian airline Qanta (previously Qantas) saw earnings growth slowing in the second half.", "The company attributed this to cost-cutting measures made during the year and a lessening with bookings for Australia following the Japanese tsunami disaster.", "Meanwhile, the carrier is facing increased pressure from rival airlines such as Virgin Blue and the Australian government is considering allowing Singapore Airlines to fly between Australia and the US in response to the tsunami.", "Despite Qanta's positive net profit result, analysts expect a decrease in earnings growth for the second half of fiscal year 2011, and the company is reviewing its cost-cutting measures.", "As previously mentioned, Qanta plans to transfer up to 7,000 jobs outside Australia."], "tinydolphin:1.1b": [" Qantas Airlines has reported a record first-half profit of A$458.4 million ($357.6 million) compared to A$431 million in the previous year, a rise of 28%.", "The Australian airline group has attributed this achievement partly to cost-cutting measures and partly to growth of its international routes during the tsunami.", "The tsunami disrupted travel patterns leading to Qantas's sales dip by A$30 million after the Indian Ocean earthquake in December 2004, although it saw bookings increase due to holidaymakers staying away from the affected areas.", "Higher fuel costs will also be a significant factor for Qantas in coming months.", "The airline's chief financial officer, Peter Gregg, stated that there would be less hedging benefit in the second half of the year compared to the first as it saw higher fuel costs.", "Full-year earnings are predicted to increase from the previous 12 month period.", "Analysts had expected Qantas to report around A$720 million in profit for the full year, but Mr Dixon has announced that he would be reviewing the airline's cost-cutting measures during the first six months of the fiscal year."], "phi:2.7b": [" Qantas, an Australian airline, recorded a record first-half profit due to cost-cutting measures.", "Net profit rose 28% to A$458.4m from a year earlier.", "The Indian Ocean tsunami affected travel patterns in ways that Qantas was not expecting, leading to lower bookings for Australia.", "Higher fuel costs are also expected to affect earnings in the second half of the fiscal year.", "However, the firm is predicting full-year profits will increase and is reviewing its cost-cutting measures.", "Qantas could potentially transfer as many as 7,000 jobs out of Australia if it can no longer afford to be \"all-Australian\"."], "orca-mini:3b": [" Qantas sees profits soar to a record first-half profit of A$458.4m ($357.6m; £191m) thanks to cost-cutting measures, despite a decrease in sales due to the Indian ocean tsunami and higher fuel costs.", "The airline also warned that earnings growth will slow in the second half, as it plans to review its cost-cutting measures and faces increased competition from low-cost carriers Virgin Blue and the Australian government's talks about allowing Singapore Airlines to fly between Australia and the US."], "hermes3:3b": ["Qantas posts record half-year profit of 28%, up to A$458m, due to cost-cutting.", "However, sales are expected to drop by A$30m after tsunami and earnings growth will slow in second half.", "Full-year earnings forecast is for an 11% increase."], "stablelm-zephyr:3b": ["Australian airline Qantas reported a record fiscal first-half profit of A$458.4m due to cost-cutting measures.", "The company attributes the surge in profits to these measures and reassures that full-year earnings will increase from the previous year, with analysts forecasting around A$720 million in profit.", "However, Qantas shares fell after it warned sales would dip by at least A$30m due to the impact of the Indian ocean tsunami on holiday destinations.", "The Australian government is also considering allowing Singapore Airlines to fly between Australia and the US, potentially posing competition for Qantas."], "chatgpt-4o-latest": ["Qantas reported a record fiscal first-half net profit of A$458.4 million, a 28% increase due to cost-cutting measures, surpassing analyst expectations.", "However, shares fell nearly 3% after the airline warned of slower earnings growth in the second half, citing reduced sales from the Indian Ocean tsunami's impact on travel and rising fuel costs.", "Competition from Virgin Blue and potential entry of Singapore Airlines on key routes also pose challenges.", "Despite this, full-year earnings are expected to rise, with analysts forecasting an 11% increase to A$720 million.", "Qantas saved A$245 million in the first half and aims to exceed its A$500 million cost-cutting target.", "The company is also considering shifting up to 7,000 jobs overseas to remain competitive."], "stablelm2:1.6b": ["Qantas records record first-half profit thanks to cost-cutting measures and a 19% increase in net profit for the six months ending December, reaching A$4.4 million ($5.6 million, £4.8 million).", "However, earnings growth is expected to slow in the second half due to lower bookings following the Indian Ocean tsunami, while higher fuel costs may also impact earnings.", "Qantas faces pressure from rivals and the Australian government discusses allowing Singapore Airlines to fly between Australia and the US, one of Qantas' key routes.", "The company aims to top its target of A$5 million ($6.4 million) for full-year earnings after achieving savings of A$1 million during the first half."], "granite3.1-dense:2b": ["Qantas reported a record fiscal first-half net profit of A$458.4 million, a 28% increase from the previous year, exceeding analysts' expectations of A$431m.", "The airline attributed this growth to cost-cutting measures and efficient operations.", "However, Qantas anticipates slower earnings growth in the second half due to a potential A$30 million sales decline from the Indian Ocean tsunami's impact on travel patterns, particularly Japanese tourism to Australia.", "Fuel price increases are expected to offset these gains.", "The company is also facing competition from low-cost carrier Virgin Blue and anticipates increased pressure as the Australian government considers Singapore Airlines' potential US-Australia route.", "Despite these challenges, Qantas forecasts full-year earnings will rise about 11% to around A$720 million.", "Chief Executive Geoff Dixon plans to reassess the airline's cost-cutting efforts, having already achieved A$245 million in savings during the first six months and targeting A$500 million for the full year.", "Lastly, Qantas may transfer up to 7,000 jobs overseas due to financial constraints."]}