{"raw_text": "Iraq to invite phone licence bids\n \n Iraq is to invite bids for two telephone licences, saying it wants to significantly boost nationwide coverage over the next decade.\n \n Bids have been invited from local, Arab and foreign companies, Iraq's Ministry of Communications said. The winner will work in partnership with the Iraqi Telecommunications and Post Company (ITPC). The firms will install and operate a fixed phone network, providing voice, fax and internet services.\n \n The ministry said that it wanted to increase Iraq's \"very low telephone service penetration rate from about 4.5% today to about 25% within 10 years.\" It also hopes to develop a \"highly visible and changeable telecommunication sector\". Details of the bidding and tender process will be published on the ministry's website on 9 February. It also is planning a road-show for investors in Amman, Jordan. The ministry said it would base its selection on criteria including the speed of implementation, tariff rates, coverage, and the firm's experience and financial strength.\n", "llama3.2:1b": ["Iraq to invite bids for two telephone licences, aiming to boost nationwide coverage over the next decade.", "Bids are open from local, Arab, and foreign companies.", "The winner will install a fixed phone network with voice, fax, and internet services in partnership with Iraq Telecommunications and Post Company (ITPC)."], "llama3.2:3b": ["Iraq to invite bids for two telephone licences to boost nationwide coverage over the next decade, aiming to increase phone service penetration from 4.5% to 25%.", "Bids invited include local, Arab, and foreign companies, with successful bidder working in partnership with ITPC to install and operate a fixed phone network providing voice, fax, and internet services."], "gemma2:2b": ["Iraq will issue two phone licence bids to increase nationwide telephone service coverage to 25% within 10 years.", "Local, Arab, and foreign companies can bid in partnership with the Iraqi Telecommunications and Post Company (ITPC).", "The winning company will install and operate a fixed network providing voice, fax, and internet services.", "The ministry will select based on implementation speed, tariff rates, coverage, experience, and financial strength.", "Details of the bidding process will be published on February 9th."], "qwen2.5:0.5b": ["Iraq is inviting bids for two telephone licences to increase nationwide coverage over the next decade.", "The winners will work with the Iraqi Telecommunications and Post Company (ITPC).", "Iraq wants to significantly boost its \"very low telephone service penetration rate from 4.5% today to about 25% within 10 years.\"", "It aims to develop a high-profile telecommunication sector and plan a road-show in Amman, Jordan.", "Details of the bidding process will be published on the ministry's website on February 9th."], "qwen2.5:1.5b": ["Iraq plans to invite bids for telephone licences, aiming to boost national phone service penetration from 4.5% today to 25% within 10 years by partnering with ITPC.", "The winner will install and operate a fixed network offering voice, fax, and internet services.", "Bids have been submitted by local, Arab, and foreign companies.", "Details of the process will be announced on February 9th via ministry website and a Jordanian roadshow.", "Selection criteria include speed, tariffs, coverage, and financial strength."], "qwen2.5:3b": ["Iraq invites bids for two telephone licences to significantly boost nationwide coverage over the next decade.", "Bids are open from local, Arab, and foreign companies working in partnership with ITPC to install a fixed phone network offering voice, fax, and internet services.", "The goal is to increase Iraq's very low 4.5% telephone service penetration rate to about 25% by 2030.", "Criteria for selection include speed of implementation, tariff rates, coverage, experience, and financial strength.", "Details of the bidding process will be published on the ministry’s website on February 9th.", "A road-show is also planned in Jordan for investors."], "opencoder:1.5b": ["Iraq invites phone licence bids for two telephones.", "Iraq has invited bids from local, Arab, and foreign companies for providing telephone licences to significantly boost nationwide coverage over the next decade.", "Bids have been conducted from various sectors in Iraq's Ministry of Communications.", "The winner will work in a partnership with the Iraqi Telecommunications and Post Company (ITPC).", "Firms will install and operate a fixed phone network, providing voice, fax, and internet services.", "The ministry further mentioned that it is aiming for an increased \"low telephone service penetration rate from 4.5% to about 25% within 10 years.\"", "It also plans to develop a highly visible and changeable telecommunication sector.", "Details of the bidding process will be published on the ministry's website on 9 February.", "The roadshow for investors in Amman, Jordan is planned to take place."], "smollm:1.7b": ["Iraq to invite bids for two telephone licences"], "deepseek-r1:1.5b": ["Iraq is inviting bids for two telephone licenses aimed at boosting nationwide coverage over the next decade.", "The winning bid companies will collaborate with the Iraqi Telecommunications and Post Company (ITPC) to set up a fixed network offering voice, fax, and internet services.", "The ministry aims to increase penetration rates from 4.5% to 25% by 2023.", "The bids and tender process are scheduled for February 9th on the ministry's website.", "A road show in Amman is planned as well.", "Selection criteria include implementation speed, tariff rates, coverage, and experience."], "tinyllama:1.1b": ["Iraq has announced plans to invite bidsfor two wireless phone licences, with a view to significantly boosting national telephone coverage over the next decade.", "The ministy of communications has invited local, Arab, and foreign companies to compete for these fixed-phone contracts, which will be jointly managed by ITPC, Iraq's telecommunication and post company.", "The ministry hopes to increase the current \"very low\" coverage rate from about 4.5% today to around 25%.", "They also aim to develop a high-visibility and changeable telecom sector.", "Details of the bidding process will be published on the ministy's website on February 9, with a roadshow for investors in Amman planned for later that month."], "tinydolphin:1.1b": [" Iraq invites phone licence bids to boost nationwide coverage over the next decade.", "Local companies will compete for two licenses, while foreign companies can also partner with ITPC.", "Winners will set up a fixed phone network, providing voice, fax and internet services.", "The Ministry of Communications hopes to increase the country's telephone service penetration rate from current levels of around 4.5% to 25% in 10 years.", "In addition, it plans a road-show for investors in Amman, Jordan."], "phi:2.7b": [" Iraq will invite bids from local, Arab, and foreign companies to install and operate a fixed phone network across the country over the next decade.", "The aim is to significantly boost nationwide coverage, with the winning company partnering with the Iraqi Telecommunications and Post Company (ITPC).", "The ministry aims to increase Iraq's very low telephone service penetration rate from 4.5% today to 25% within 10 years."], "orca-mini:3b": [" Iraq plans to invite bids for two telephone licences from local, Arab, and foreign companies, with the winner partnering with Iraq's Telecommunications and Post Company (ITPC) to install and operate a fixed phone network that provides voice, fax, and internet services.", "The ministry aims to increase Iraq's low telephone service penetration rate of around 4.5% today to about 25% within 10 years, and hopes to develop a highly visible and changeable telecommunications sector.", "The bidding process will be published on the ministry's website on February 9th, with a roadshow planned for investors in Jordan.", "The ministry is looking for a firm that can implement quickly, offer competitive tariffs, have experience, and sufficient financial strength."], "hermes3:3b": ["Iraq inviting bids for telephone licences, aiming to boost nationwide coverage to 25% within 10 years."], "stablelm-zephyr:3b": ["Iraq is inviting phone license bids from local, Arab, and foreign companies to significantly enhance nationwide coverage by 10 years.", "The winning company will partner with Iraqi Telecommunications and Post Company (ITPC) and install a fixed phone network providing voice, fax, and internet services.", "The ministry plans to increase Iraq's low telephone service penetration rate from 4.5% to 25% and develop a changeable telecommunication sector.", "Bidding and tender details will be published on the ministry's website on February 9th, and a road show for investors in Amman, Jordan is also planned.", "Selection criteria include implementation speed, tariff rates, coverage, and financial strength of the chosen firm."], "chatgpt-4o-latest": ["Iraq's Ministry of Communications will invite bids for two telephone licenses to expand nationwide coverage over the next decade.", "Local, Arab, and foreign companies can apply, with the winner partnering with the Iraqi Telecommunications and Post Company (ITPC) to install and operate a fixed phone network offering voice, fax, and internet services.", "The goal is to increase telephone service penetration from 4.5% to 25% and develop a dynamic telecom sector.", "Details of the bidding process will be published on 9 February, with a road-show for investors in Amman, Jordan.", "Selection criteria include implementation speed, tariff rates, coverage, experience, and financial strength."], "stablelm2:1.6b": ["Iraq will invite bids for two telephone licenses to boost nationwide coverage over the next decade.", "Local, Arab, and foreign companies have submitted their bids, with the winner partnering with ITPC to install and operate a fixed phone network offering voice, fax, and internet services.", "The goal is to increase service penetration from 4.5% to 100% within a few years.", "Bids will be evaluated by speed of implementation, tariff rates, coverage, firm's experience and financial strength, with details published on the ministry's website on Feb 9th and an investor road-show in Amman, Jordan."], "granite3.1-dense:2b": ["Iraq will invite bids for two telephone licences to improve its telecommunication services, aiming to raise nationwide penetration from 4.5% to 25% within a decade.", "Bidders include local, Arab, and foreign companies, who will collaborate with the Iraqi Telecommunications and Post Company (ITPC) for installation and operation of a fixed phone network offering voice, fax, and internet services.", "The selection process will consider factors such as implementation speed, tariff rates, coverage, and bidders' experience and financial stability.", "Details on bidding and tender procedures are set to be published online on 9 February, with an investor road-show in Amman, Jordan, also planned."]}