{"raw_text": "Salary scandal in Cameroon\n \n Cameroon says widespread corruption in its finance ministry has cost it 1bn CFA francs ($2m; £1m) a month.\n \n About 500 officials are accused of either awarding themselves extra money or claiming salaries for \"non-existent\" workers. Prime Minister Ephraim Inoni, who vowed to tackle corruption when he came to office last year, said those found guilty would face tough punishments. The scam is believed to have begun in 1994.\n \n The prime minister's office said the alleged fraud was uncovered during an investigation into the payroll at the ministry. In certain cases, staff are said to have lied about their rank and delayed their retirement in order to boost their earnings. The prime minister's office said auditors had found \"irregularities in the career structure of certain civil servants\". It added that the staff in question \"appear to have received unearned salaries, boosting the payroll\".\n \n Fidelis Nanga, a journalist based in the Cameroon capital Yaounde, said the government was considering taking criminal action against those found guilty and forcing them to repay any money owed. \"The prime minister has given instructions for exemplary penalties to be meted out against the accused and their accomplices if found guilty,\" he told the BBC's Network Africa programme.\n \n Mr Inoni launched an anti-corruption drive in December after foreign investors criticised a lack of transparency in the country's public finances. In one initiative designed to improve efficiency, civil servants who arrived late for work were locked out of their offices. The government now intends to carry out an audit of payrolls at all other government ministries. In a report compiled by anti-corruption body Transparency International in 2003, graft was said to be \"pervasive\" in Cameroon.\n", "llama3.2:1b": ["Cameroon's finance ministry is plagued by widespread corruption worth $2m per month, with officials allegedly awarding themselves extra money or claiming salaries for non-existent workers.", "The scandal began in 1994 and has been uncovered during an investigation into payroll at the ministry.", "The government aims to tackle the issue through criminal action and penalties against those found guilty."], "llama3.2:3b": ["Cameroon's finance ministry is accused of widespread corruption costing it $2m monthly.", "About 500 officials are suspected of awarding themselves extra money or claiming salaries for non-existent workers.", "The scam allegedly began in 1994 and is linked to irregularities in civil servants' careers.", "The government plans to punish those found guilty with \"exemplary penalties\" and force them to repay any owed money."], "gemma2:2b": ["Cameroon's finance ministry is facing accusations of widespread corruption costing $2 million a month.", "An investigation revealed that approximately 500 officials allegedly awarded themselves extra money or claimed salaries for non-existent workers.", "The prime minister pledged to impose severe consequences and has ordered an audit of all other ministries' payrolls, aiming to address the issue of corruption which Transparency International labeled as \"pervasive.\""], "qwen2.5:0.5b": ["A widespread corruption scandal has emerged in Cameroon, where the finance ministry's senior officials are accused of awarding themselves extra money or claiming salaries for non-existent workers.", "The alleged fraud began in 1994 and is believed to have begun in 1990s.", "The prime minister vowed to tackle corruption when he came to office last year.", "The government plans to take criminal action against those found guilty, forcing them to repay any money owed."], "qwen2.5:1.5b": ["Corruption in Cameroon's finance ministry has cost the country $2 million monthly, with about 500 officials suspected of inflating salaries and embezzling funds since 1994.", "Prime Minister Ephraim Inoni vowed tough punishment for offenders, while government efforts include forcing repayments and audits at other ministries."], "qwen2.5:3b": ["Cameroon's finance ministry is facing allegations of widespread corruption that has cost the country up to $2 million per month since 1994.", "Approximately 500 officials are accused of awarding themselves extra money or claiming salaries for nonexistent workers.", "Prime Minister Ephraim Inoni vowed to tackle corruption, promising tough punishments for those found guilty.", "The alleged fraud was uncovered during an investigation into the ministry's payroll.", "Staff reportedly lied about their rank and delayed retirement to boost earnings.", "In response, the government is considering criminal action against those found guilty and intends to audit payrolls at all other government ministries.", "Graft in Cameroon's public finances was identified as pervasive by Transparency International in a 2003 report."], "opencoder:1.5b": ["Salary scandal in Cameroon\n\nThe government has criticized widespread corruption in its finance ministry for issuing 1bn CFA francs worth of excessive salaries to various officials accused of earning money by awarding themselves extra or misleadingly entitled to compensate non-existent workers.", "Prime Minister Ephraim Inoni, who vowed to tackle corruption when he came to office last year, ordered that the accused officials face tough punishments.", "The scandal, initially believed to have begun in 1994, has been a persistent nightmare since.", "The officials accused of earning money are now being found guilty of non-payment and other violations, while their employers who had previously paid them do not receive compensation.", "The government says it will conduct an audit of its payroll at all other government ministries."], "smollm:1.7b": ["The summary should preserve the key ideas and details from the original text:\n\n1.", "The Cameroon says widespread corruption in its finance ministry has cost it $2 million a month ($2m).", "2.", "About 500 officials are accused of awarding themselves extra money or claiming salaries for \"non-existent\" workers.", "Prime Minister Ephraim Inoni, who vowed to tackle corruption when he came to office last year, said those found guilty would face tough punishments.", "The scam is believed to have begun in 1994.", "3.", "The prime minister's office said the alleged fraud was uncovered during an investigation into the payroll at the ministry.", "In certain cases, staff are said to have lied about their rank and delayed their retirement in order to boost their earnings.", "The prime minister's office said auditors had found \"irregularities in the career structure of certain civil servants\".", "It added that the staff in question \"appear to have received unearned salaries\", boosting the payroll.", "4.", "Fidelis Nanga, a journalist based in the Cameroon capital Yaounde, said the government was considering taking criminal action against those found guilty and forcing them to repay any money owed.", "\"The prime minister has given instructions for exemplary penalties to be meted out against the accused and their accomplices if found guilty,\" he told the BBC's Network Africa programme.", "5.", "The government now intends to carry out an audit of payrolls at all other government ministries.", "In a report compiled by anti-corruption body Transparency International in 2003, graft was said to be \"pervasive\" in Cameroon."], "deepseek-r1:1.5b": ["Camboile's Salary Scandal  \n\nCamboile has been accused of widespread corruption in its finance ministry, costing it 1bn CFA francs ($2m; £1m) a month.", "Approximately 500 officials were implicated in alleged issues where they either received extra money or claimed salaries for \"non-existent\" workers.", "Prime Minister Ephraim Inoni has pledged to tackle corruption but claims the scandal has not been fully exposed yet.", "The investigation into the ministry's payroll revealed that staff lied about their rank and delayed retirement, boosting earnings.", "Auditors found irregularities in civil servants' career structures, including unearned salaries boosting the payroll.", "Fidelis Nanga, a journalist, suggested taking criminal action against guilty individuals and their accomplices if penalties are met.", "In December 2017, Mr. Inoni launched an anti-corruption drive after criticism from foreign investors on lack of transparency in public finances.", "Late-arriving civil servants were restricted from accessing offices.", "Transparency International's report in 2003 highlighted graft as pervasive in Camboile's financial system."], "tinyllama:1.1b": ["The Cameroun government has been accused of widespread corruption in its financing ministry, with officials allegedly awarding themselves extra money or claiming salaries for \"non-existent\" workers.", "Prime Minister Ephrasiam Inoni voiced a desire to tackle this problem when he came to power last year and announced an investigation into payrolls at the ministry.", "According to audiot, staff were found to be lying about their rank and delaying their retirement in order to boost their earnings.", "The government has reportedly found irregularities in the career structure of some civil servants, while journalist Fidelis Nanga claimed that President Faustin-Archange Touadera is considering criminal action against those found guilty and imposing exemplary penalties if guilty."], "tinydolphin:1.1b": [" The Cameroonian government has discovered that several hundred senior civil servants were involved in awarding themselves extra salaries and claiming them as their own.", "This scandal is believed to have occurred between 1994 and 2005, during which time the country faced a severe financial crisis.", "According to Prime Minister Ephraim Inoni, about 500 officials were accused of taking advantage of this system, with those guilty facing serious punishment.", "The government's announcement comes as a response to foreign investors' growing frustration with corruption in Cameroon."], "phi:2.7b": [" Cameroon's finance ministry has been accused of corruption that costs the country 1 billion CFA francs (US$2m; £1m) per month.", "About 500 officials have been implicated in awarding themselves extra money or claiming salaries for non-existent workers.", "The prime minister, Ephraim Inoni, said those found guilty would face tough punishments.", "An investigation into the ministry's payroll has uncovered irregularities, including staff lying about their rank and delaying retirement to boost their earnings.", "The government is considering taking criminal action against the guilty parties and may require them to repay any owed salaries.", "Mr Inoni launched an anti-corruption drive in December after foreign investors criticized a lack of transparency in the country's public finances."], "orca-mini:3b": [" A corruption scandal involving over 500 officials at the Cameroon finance ministry has caused the country to lose $2m per month due to unearned salaries and delayed retirement.", "The prime minister's office found that certain civil servants were given extra pay, boosting the payroll.", "Journalist Fidelis Nanga told the BBC that the government is considering taking criminal action against those found guilty and forcing them to repay any money owed.", "In 2003, a Transparency International report revealed widespread corruption in Cameroon."], "hermes3:3b": ["Cameron salary scandal: 1bn CFA ($2m) lost monthly due to widespread corruption in finance ministry, costing ~500 officials extra salaries or claiming for non-existent workers."], "stablelm-zephyr:3b": ["Cameroon's finance ministry has reportedly lost around $2m (£1m) a month due to widespread corruption involving approximately 500 officials who either awarded themselves extra money or claimed salaries for non-existent workers.", "Prime Minister Ephraim Inoni, who vowed to tackle corruption when he came to office last year, said those found guilty would face severe punishments.", "The alleged fraud began in 1994 and was uncovered during an investigation into the payroll at the ministry.", "Cameroon's government is considering criminal action against those found guilty and intends to audit payrolls at all other government ministries following a 2003 report by anti-corruption body Transparency International that claimed graft was \"pervasive\" in the country."], "chatgpt-4o-latest": ["Cameroon has uncovered widespread corruption in its finance ministry, costing the country 1bn CFA francs ($2m) per month.", "About 500 officials are accused of inflating their salaries or claiming wages for non-existent workers, with some falsifying their ranks and delaying retirement to increase earnings.", "Prime Minister Ephraim Inoni, who launched an anti-corruption drive in December, has vowed tough punishments for those found guilty, including possible criminal action and repayment of stolen funds.", "The government plans to audit payrolls across all ministries.", "Transparency International previously reported pervasive corruption in Cameroon."], "stablelm2:1.6b": ["A salary scandal involving widespread corruption in the finance ministry of Cameroon has cost the country approximately $2 million a month or 1 billion CFA francs (around £1m or $1m).", "Approximately 50 officials are accused of either awarding themselves extra money or claiming salaries for nonexistent workers.", "Prime Minister Ephraim Inoni vowed to tackle corruption when he took office, with those found guilty facing tough punishments.", "The alleged fraud was uncovered during an investigation into the payroll at the ministry.", "Staff have allegedly lied about their rank and delayed retirement in order to boost their earnings."], "granite3.1-dense:2b": ["Cameroon's finance ministry is reported to have lost approximately 1bn CFA francs ($2m; £1m) monthly due to widespread corruption, involving around 500 officials.", "This alleged fraud, suspected to have started in 1994, was discovered during an investigation into the ministry's payroll.", "The accused are accused of awarding themselves extra money or claiming salaries for non-existent workers by inflating their ranks and delaying retirement.", "Prime Minister Ephraim Inoni, who pledged to combat corruption upon taking office in 2019, has vowed severe penalties for those found guilty, including criminal action and repayment of ill-gotten gains.", "The government plans an audit of payrolls across all ministries as part of its anti-corruption drive, initiated following criticism from foreign investors about lack of transparency in public finances.", "Transparency International's 2003 report described corruption as \"pervasive\" in Cameroon."]}