{"raw_text": "German jobless rate at new record\n \n More than 5.2 million Germans were out of work in February, new figures show.\n \n The figure of 5.216 million people, or 12.6% of the working-age population, is the highest jobless rate in Europe's biggest economy since the 1930s. The news comes as the head of Germany's panel of government economic advisers predicted growth would again stagnate. Speaking on German TV, Bert Ruerup said the panel's earlier forecast of 1.4% was too optimistic and warned growth would be just 1% in 2005.\n \n The German government is trying to tackle the stubbornly-high levels of joblessness with a range of labour market reforms. At their centre is the \"Hartz-IV\" programme introduced in January to shake up welfare benefits and push people back into work - even if some of the jobs are heavily subsidised. The latest unemployment figures look set to increase the pressure on the government. Widely leaked to the German newspapers a day in advance, they produced screaming headlines criticising Chancellor Gerhard Schroeder's Social Democrat-Green Party administration. Mr Schroeder had originally come into office promising to halve unemployment.\n \n Still, some measures suggest the picture is not quite so bleak. The soaring official unemployment figure follows a change in the methodology which pushed up the jobless rate by more than 500,000 in January. Adjusted for seasonal changes, the overall unemployment rate is 4.875 million people or 11.7%, up 0.3 percentage points from the previous month. Using the most internationally-accepted methodology of the International Labour Organisation (ILO), Germany had 3.97 million people out of work in January. And ILO-based figures also suggest that 14,000 new net jobs were created that month, taking the number of people employed to 38.9 million. The ILO defines an unemployed person as someone who in the previous four weeks had actively looked for work they could take up immediately.\n", "llama3.2:1b": ["German jobless rate at record level, surpassing 12.6%"], "llama3.2:3b": ["More than 5.2 million Germans are out of work at a record 12.6% jobless rate, surpassing 1930s levels.", "Chancellor Gerhard Schroeder's government faces criticism over its failure to halve unemployment, but ILO-based figures suggest 14,000 new net jobs were created in January."], "gemma2:2b": ["Germany's jobless rate is at a record high of 12.6%, exceeding that of other European economies since the 1930s.", "This comes after the government introduced new welfare programs and with expectations of limited economic growth in 2005.", "The higher unemployment figures have sparked criticism against the government, while some statistics suggest a less bleak picture when adjusted for seasonal changes."], "qwen2.5:0.5b": ["German jobless rate at record high: More than 5.2 million out of work; panel predicts stagnation, unemployment growth continues; government reforms targeting welfare benefits and job-seeking efforts aim to reduce joblessness."], "qwen2.5:1.5b": ["Germany's jobless rate hit a record high with 5.216 million people out of work, leading some to predict further economic challenges and growth stagnation, while the government is implementing labor market reforms like \"Hartz-IV\" aimed at reducing unemployment by pushing individuals back into work."], "qwen2.5:3b": ["German jobless rate hits new record at 12.6%, or 5.216 million people, marking highest since 1930s.", "Government's \"Hartz-IV\" program aims to reduce unemployment through welfare reforms and subsidised jobs.", "Despite government efforts, economic adviser predicts sluggish growth in 2005.", "Unemployment data have been revised upwards by more than 500,000 due to methodological changes but adjusted figures show a decrease from the previous month.", "ILO-based statistics indicate net job creation of 14,000 in January."], "opencoder:1.5b": ["The German jobless rate at a new record has been particularly high this February.", "The figure of 5.216 million people, or 12.6% of the working-age population, is the highest jobless rate in Europe's biggest economy since the 1930s.", "The head of Germany's panel of government economic advisers predicted growth would again stagnate.", "With a range of labour market reforms at their centre is the \"Hartz-IV\" programme introduced in January to shake up welfare benefits and push people back into work - even if some of the jobs are heavily subsidised."], "smollm:1.7b": ["The German jobless rate at new record is a significant increase from the previous month's figure, with more than 5.2 million people out of work.", "This number is higher than the European average and is the highest jobless rate in Germany since the 1930s.", "The head of Germany's panel of government economic advisers predicted growth would again stagnate, but the actual growth was just 1% in 2005.", "The German government has taken steps to tackle the stubbornly-high levels of joblessness with a range of labour market reforms, including the \"Hartz-IV\" programme which aims to shake up welfare benefits and push people back into work - even if some of the jobs are heavily subsidised.", "The latest unemployment figures look set to increase the pressure on the government as it tries to address the issue.", "Despite this, some measures suggest that the picture is not quite so bleak.", "The soaring official unemployment figure follows a change in the methodology which pushed up the jobless rate by more than 500,000 in January.", "Adjusted for seasonal changes, the overall unemployment rate is 4.875 million people or 11.7%, up 0.3 percentage points from the previous month.", "Using the most internationally-accepted methodology of the International Labour Organisation (ILO), Germany had 3.97 million people out of work in January.", "The ILO defines an unemployed person as someone who in the previous four weeks had actively looked for work they could take up immediately."], "deepseek-r1:1.5b": ["The article reports that in February, over 5.2 million Germans were out of work, marking a new record for unemployment and suggesting significant economic pressures.", "This marks the highest jobless rate in Europe since the 1930s, a critical point for Germany to address its high unemployment.", "The government is working on reforms like \"Hartz-IV\" to reduce welfare benefits but faces criticism over effectiveness.", "Official data show a higher unemployment rate than expected due to methodological changes and seasonality.", "Unemployment reached 4.875 million in January, up from the previous month.", "There was also an increase in new jobs created, reaching 14,000, which pushed employment to 38.9 million people.", "Overall, while reforms are being taken, concerns remain about the sustainability of efforts and broader economic challenges."], "tinyllama:1.1b": ["In February, more than 5.216 million Germans were out of work according to new data published by Germany's bureau of statistics (GfA), which is the highest jobless rate in Europe's biggest economy since the 1930s.", "The head of Germany's labour market panel, Bert Rupert, warned that growth would be just 1% in 2005 due to stubbornly high levels of joblessness caused by a range of labour market reforms.", "At least some of these jobs are heavily subsidised, and the government is seeking to tackle such patterns through a variety of labour market reform initiatives.", "The latest uneconomy figures, which produced headlines criticising Chancellor Gerhard Schroeeder's administration for halving unemployment, suggest that measures suggested could not quite be considered as drastic enough.", "Nevertheless, some methods suggest that the overall jobless rate is still relatively high, at 4.875 million people or 11.7% of the working-age population.", "Adjusted for seasonal changes, the official uneconomy figure is 3.97 million people, or 12.6%, up by 0.3 percentage points from the previous month.", "Using ILO-based figures also suggest that net new jobs were created in January at a rate of 14,000 per month, taking the number of employed to 38.9 million."], "tinydolphin:1.1b": [" The German jobless rate has reached a new record, with more than 5.2 million people out of work during February.", "This is the highest such figure since the 1930s.", "The head of Germany's panel of government economic advisers predicts that growth may again stagnate due to joblessness in 2005.", "The government has introduced a number of reforms aimed at reducing unemployment, including Hartz-IV, which was implemented last month.", "However, many newspapers are criticizing the government for not achieving its goal of halving unemployment within a decade."], "phi:2.7b": [" In February, more than 5.2 million Germans were out of work, the highest jobless rate in Europe's biggest economy since the early 1900s.", "The figure is due to a change in methodology that pushed unemployment higher in January.", "However, adjusted for seasonal changes, the overall unemployment rate increased by 0.3 percentage points to 11.7% in February.", "Some measures suggest there are still net job creations, with the number of people employed reaching 38.9 million."], "orca-mini:3b": [" Germany's jobless rate reached a new record in February with more than 5.2 million Germans out of work, marking the highest level since the 1930s.", "The government is implementing labor market reforms to tackle the issue but criticism has increased as the latest unemployment figures led to headlines criticizing Chancellor Gerhard Schroeder's Social Democrat-Green Party administration.", "However, adjusted for seasonal changes and using an internationally-accepted methodology, Germany had 3.97 million people out of work in January, while ILO-based figures suggest that 14,000 new net jobs were created that month, taking the number of people employed to 38.9 million."], "hermes3:3b": ["German record jobless rate: Over 5.2m out of work (12.6% of working-age pop)."], "stablelm-zephyr:3b": ["In February, Germany recorded a record jobless rate of 5.216 million people, or 12.6% of the working-age population, marking the highest level since the 1930s in Europe's largest economy.", "This news came as the head of Germany's panel of government economic advisers warned that growth would stagnate at 1% in 2005.", "The German government has implemented labor market reforms, including \"Hartz-IV\" program to encourage people back into work through subsidized jobs.", "Despite a significant rise in unemployment figures following a change in methodology, overall unemployment rates adjusted for seasonal changes remain around 11.7%."], "chatgpt-4o-latest": ["Germany's unemployment rate reached a record high of 12.6% in February, with over 5.2 million people out of work, the highest since the 1930s.", "Economic growth is expected to stagnate, with forecasts revised down to 1% for 2005.", "The government is implementing labour market reforms, including the \"Hartz-IV\" programme, to reduce joblessness, but the latest figures have intensified criticism of Chancellor Gerhard Schroeder's administration.", "However, the rise in unemployment partly reflects a change in methodology, and ILO-based figures indicate 3.97 million unemployed in January, with 14,000 new jobs created, bringing total employment to 38.9 million."], "stablelm2:1.6b": ["More than 5.2 million Germans are currently jobless according to new figures.", "This represents a 6% joblessness rate among the working-age population, highest in Europe's biggest economy since the 90s.", "Germany is attempting to address this issue with labor market reforms and initiatives like Hartz-IV introduced in January to reform welfare benefits and encourage people back into work.", "However, recent unemployment figures are expected to increase pressure on the government.", "The actual joblessness rate has seen a rise of over 1 million since January due to changes in the methodology used by the ILO.", "Germany had around 3 million unemployed individuals when using the ILO's methodology in January and new net jobs were created that month, leading to an employment rate of approximately 9 million."], "granite3.1-dense:2b": ["Germany's jobless rate reached a record high of 12.6%, with over 5.216 million people out of work in February, according to new figures.", "This is the highest unemployment rate since the 1930s and surpasses the earlier prediction of 1.4% growth by Germany's economic advisers, now forecast at just 1%.", "The German government, led by Chancellor Gerhard Schroeder's Social Democrat-Green Party, is implementing labor market reforms, including the \"Hartz-IV\" program to encourage job seekers back into work, even through subsidized positions.", "Despite these efforts, the unemployment figures have strained the government, with critical media headlines following a leaked report.", "Adjusted for seasonal changes, 11.7% of the population is unemployed (4.875 million).", "The International Labour Organisation's (ILO) methodology shows 3.97 million people out of work in January and an additional 14,000 net job creations, bringing the employed total to 38.9 million.", "Notably, the ILO defines unemployment as those actively seeking jobs they could start immediately."]}