{"raw_text": "Why few targets are better than many\n \n The economic targets set out at the Lisbon summit of European Union leaders in 2000 were meant to help Europe leapfrog its way past the United States to become the world's leading economy by 2010.\n \n But the Lisbon targets are about much more than just economic prestige. For many economists and analysts they are about ensuring Europe doesn't become a global economic laggard. They are also about ensuring Europe can continue to compete as an equal with the growing economic giants of Asia, India and China, as well as with the economic might of the United States. That's why there was a tone of urgency in the report, out on Wednesday, by the former Dutch prime minister Wim Kok. Mr Kok was commissioned by the European Commission in March this year to assess how far the EU has come towards meeting the Lisbon targets, five years on from their inception. His conclusion was simple: too many of the targets will be seriously missed.\n \n Lisbon risks becoming a \"synonym for missed objectives and failed promises\", his report said. \"The status quo is not an option.\"\n \n At risk in the medium to long run is nothing less than the sustainability of the society Europe has built, it said. The report comes at a time when Europe's competitive position is waning. The EU's economic growth rate is projected to be 2% this year and 2.4% next. While there has been growth in overall employment rates in Europe, productivity lags behind that of the US. But meeting the Lisbon targets requires a political commitment that no EU member state has volunteered so far. That has in part been due to the state of the global economy in the past few years.\n \n As Mr Kok's report noted: \"The ink had scarcely dried on the [Lisbon] agreement before the worldwide stock market bubble imploded.\" \"The US suffered two years of economic slowdown and recession and the European economy followed suit.\"\n \n The circumstances weren't conducive to creating the 20 million new jobs promised by EU leaders in Lisbon in 2000. Neither were they conducive to getting governments to spend more on research and development, money needed if the EU was to meet its target of becoming a so-called \"knowledge-based economy\". \"The [Lisbon] vision is a compelling one, but in order to do it society has to change,\" said Paul Hofheinz of the Lisbon Council, a Brussels-based citizen action group. \"What you find is that a lot of people have been fighting change. You find trade unions fighting change. But also the employers' associations. \"Even though they tell you they're in favour of change, many are actually pushing for less competition, more subsidy and less free market activity.\"\n \n But part of the problem was also linked to the original targets set out in Lisbon five years ago. Targets have a habit of coming back to haunt you and in the Lisbon case, they covered too much, according to the Wim report. Economic growth and job creation were linked to issues ranging from environmental protection to social inclusion, and even safety at sea. The agenda was just too broad and as a result nothing was prioritised.\n \n \"Lisbon is about everything and thus about nothing,\" the Kok report said. \"Everybody is responsible and thus no one.\" That's why the Kok report recommends that the Lisbon targets be narrowed down to 14 key indicators, with an emphasis on creating jobs and economic growth. It also recommends that the European Commission draw up a league table which ranks countries according to the steps they're taking towards meeting the targets, effectively \"naming, shaming and faming\". \"Rhetoric and delivery don't necessarily go hand in hand,\" Mr Kok said in a press conference alongside the publication of his report. \"We don't have the luxury anymore just to exchange politeness with one another.\"\n \n On one point Mr Kok was very clear: The European Union should not try to emulate the US economy. The European economic and social model needs to change, but not so much so that social and environmental issues take a backseat to economic growth. In that sense, the Lisbon agenda is sailing into unchartered waters. The Kok report tries to do away with a belief that jobs need to be sacrificed at the altar of economic growth. \"It's very ambitious,\" said John Palmer, political director at the European Policy Centre, a Brussels-based think-tank. \"This is something that no advanced economy in the world has tried to do. It's going to require quite new and innovative policies.\" But some analysts believe that the Kok report doesn't come up with the sort of innovative policies and thinking needed to make the Lisbon targets a reality. For example, it recommends putting in place policies which encourage women and older people to remain in the workforce. But it doesn't say how companies should be convinced to do this. It will be up to the incoming president of the European Commission, Jose Manuel Barroso, to adopt Mr Kok's recommendations and press them on EU governments. Mr Barroso has said that the EU's competitiveness will be his top priority. He expects his five-year term in office to be judged on Europe's success in meeting the Lisbon agenda.\n", "llama3.2:1b": ["Why few targets are better than many\nThe economic targets set out at the Lisbon summit of European Union leaders in 2000 were meant to help Europe leapfrog its way past the United States to become the world's leading economy by 2010.", "Too many targets will be seriously missed\nThe report by Wim Kok, former Dutch prime minister, found that too much was covered in the original targets and nothing was prioritized.", "Lisbon risks becoming a global economic laggard\nThe report notes that Lisbon risks failing to achieve its objectives due to the state of the global economy and the lack of political commitment from EU member states.", "Meeting the Lisbon targets requires a political commitment\nThe report emphasizes that meeting the Lisbon targets is not an option, as it will require a \"political commitment\" that no EU member state has volunteered for so far.", "The circumstances are conducive to creating new jobs\nHowever, the circumstances were not conducive to creating 20 million new jobs promised in Lisbon, and getting governments to spend more on research and development was also difficult."], "llama3.2:3b": ["The European Union's Lisbon summit targets, set for 2010, aim to make Europe the world's leading economy by surpassing the US.", "However, a recent report by former Dutch prime minister Wim Kok found that many targets will likely be missed, threatening the sustainability of European society.", "The targets were too broad and covered various aspects, leading to a lack of prioritization.", "Kok recommends narrowing down targets to 14 key indicators focusing on job creation and economic growth.", "He also suggests ranking countries for progress towards meeting targets, effectively \"naming and shaming\" non-performers.", "The report warns that the EU should not try to emulate the US economy but rather adapt its social and environmental model while promoting economic growth."], "gemma2:2b": ["The Lisbon targets set by European Union leaders in 2000 aimed to make Europe the world's leading economy by 2010.", "However, a new report by former Dutch Prime Minister Wim Kok suggests that these goals are unlikely to be met due to a lack of political commitment and an overly broad agenda.", "The report recommends narrowing down the targets to focus on job creation and economic growth.", "It also calls for a ranking system of countries based on their progress.", "The report cautions against emulating the US model, instead promoting a European-centric approach with emphasis on social and environmental responsibility alongside economic growth.", "Kok's recommendations will now be handed over to the new President of the European Commission, Jose Manuel Barroso."], "qwen2.5:0.5b": ["The economic targets set at the Lisbon summit of European Union leaders were meant to help Europe become the world’s leading economy by 2010, but there are concerns about their failure to deliver.", "The report from former Dutch prime minister Wim Kok argues that meeting the Lisbon targets will require a political commitment and changes in society, including addressing environmental issues and increasing research and development spending.", "While some argue that the targets were ambitious, others believe they could not be achieved due to economic and social constraints.", "The report suggests narrowing the list of key indicators and ranking countries by their progress towards meeting the targets, with potential consequences such as shaming and punishment for non-compliance.", "Some analysts suggest the Kok report is too ambitious and does not provide innovative solutions for achieving the Lisbon targets."], "qwen2.5:1.5b": ["The European Union economic targets set at the 2000 Lisbon summit were meant to position Europe as a global economic powerhouse, but have failed to meet key indicators due to insufficient political commitment and an overly broad agenda that includes environmental protection, social inclusion, and safety issues.", "The report recommends narrowing down the Lisbon targets to 14 key indicators focusing on job creation and economic growth and creating a league table of progress toward meeting them."], "qwen2.5:3b": ["Why few targets are better than many\n\nThe Lisbon summit of European Union leaders in 2000 aimed to make Europe the world's leading economy by 2010, but the targets set have broader implications for competitiveness against Asian giants like India and China, as well as the US.", "A report by Wim Kok, a former Dutch prime minister commissioned by the EU to assess progress towards these targets, found that many will be missed.", "His report emphasized urgency in addressing issues such as economic stagnation and low productivity, linked closely with high unemployment rates.", "Mr. Kok's recommendations include narrowing down 15 original targets to 14 key indicators focusing on job creation and growth, setting up a league table ranking countries' progress towards these goals, and discouraging an overly broad agenda that covers too many issues.", "Despite the urgency, challenges persist due to the broad scope of Lisbon targets.", "The European Commission faces difficulties in achieving political commitments, while trade unions, employers’ associations, and others have shown resistance to change.", "Mr. Kok's report suggests a shift towards more specific goals, such as creating 14 key indicators related to job creation and economic growth.", "Some analysts believe the recommendations fall short of providing innovative policies to achieve these targets, especially in encouraging companies to retain women and older workers.", "The incoming president of the European Commission, Jose Manuel Barrosose, has made EU competitiveness his top priority during a five-year term."], "opencoder:1.5b": ["The economic targets set out at the Lisbon summit of European Union leaders in 2000 were meant to help Europe leapfrog its way past the United States to become the world's leading economy by 2010.", "However, too many targets are better than many, which highlights the urgency in the report.", "It is about ensuring Europe doesn't become a global economic laggard and also about ensuring Europe can continue to compete as an equal with the growing economic giants of Asia, India, and China, as well as with the economic might of the United States.", "The targets are about ensuring the European economy is sustainable, that growth in employment rates and productivity meet the expectations set out by EU leaders in Lisbon five years ago.", "That’s why a political commitment was required to create jobs and achieve economic growth.", "In addition to the targets, there were concerns regarding the original targets in 2000, which have since been mitigated through the recommendation of narrowing down the targets to 14 key indicators.", "The report also recommends the European Commission to name, sham, and fame countries based on their actions towards meeting the targets.", "Yet, the report's recommendations do not come down to the need for innovative policies or the need for companies to be persuaded to accept them."], "smollm:1.7b": ["The economic targets set out at the Lisbon summit of European Union leaders in 2000 were meant to help Europe leapfrog its way past the United States to become the world's leading economy by 2010.", "But the Lisbon targets are about much more than just economic prestige.", "For many economists and analysts they are about ensuring that Europe doesn't become a global economic laggard.", "They are also about ensuring that Europe can continue to compete as an equal with the growing economic giants of Asia, India and China, as well as with the economic might of the United States.", "That's why there was a tone of urgency in the report, out on Wednesday by the former Dutch prime minister Wim Kok.", "Mr Kok was commissioned by the European Commission in March this year to assess how far the EU has come towards meeting the Lisbon targets, five years on from their inception.", "His conclusion was simple: too many of the targets will be seriously missed.", "The Lisbon risks becoming a \"synonym for missed objectives and failed promises\", his report said.", "\"The status quo is not an option.\"", "The report comes at a time when Europe's economic growth rate is projected to be 2% this year and 2.4% next, while the US economy is expected to grow by 3%.", "But meeting the Lisbon targets requires a political commitment that no EU member state has volunteered so far.", "That has in part been due to the state of the global economy in the past few years.", "The US suffered two years of economic slowdown and recession, and the European economy followed suit.", "But as the global economy continues to recover, the EU's competitiveness will be more important than ever.", "As Mr Kok's report noted: \"The [Lisbon] agreement was a good one, but in order to do it you have to change everything.\"", "That means narrowing down the 14 key indicators that were set out by the European Commission to just 10 or so.", "It also means putting in place policies which encourage companies to hire more women and older people, as well as investing in education and training.", "But some analysts believe that the Kok report doesn't come up with the sort of innovative policies and thinking needed to make the Lisbon targets a reality.", "For example, it recommends putting in place policies which encourage companies to invest in research and development.", "But this will require significant investment from governments.", "On one point Mr Kok was very clear: the European Union should not try to emulate the US economy.", "The EU's competitiveness will be its top priority, he said.", "He expects his five-year term in office to be judged on Europe's success in meeting the Lisbon targets.", "Mr Barroso has said that the EU's competitiveness will be his top priority.", "But as the global economy continues to recover, the EU's competitiveness will be more important than ever.", "The report concludes by recommending that the European Commission draw up a league table which ranks countries according to their progress towards meeting the 14 key indicators.", "This is a bold move, but it may help to identify those countries that are struggling to meet the targets and provide them with the support they need.", "But some analysts believe that the Kok report doesn't come up with the sort of innovative policies and thinking needed to make the Lisbon targets a reality.", "For example, it recommends putting in place policies which encourage companies to hire more women and older people, as well as investing in education and training.", "But this will require significant investment from governments."], "deepseek-r1:1.5b": ["The European Union's economic targets, set at the Lisbon summit in 2000, aim to move beyond the United States by 2010 but are broader than just financial success.", "They focus on Europe's ability to compete and promote social progress.", "Wim Kok' report highlighted issues like job loss and environmental problems, showing a risk of Portugal lagging behind.", "The report suggested broadening targets to include social aspects, but focused on job creation and economic growth with 14 key indicators.", "It called for a league table ranking countries' progress and emphasized avoiding US models.", "However, the text warned against ignoring social welfare while noting potential new policies from unions and employers.", "Wim Kok recommended prioritizing Europe's competitiveness, especially under incoming president Jose Manuel Barroso."], "tinyllama:1.1b": ["The economic targets set out at the Lisbon summit of European Union leaders in 2000 were meant to help Europe leapfrog its way past the United States to become the world's leading economy by 2010, but the Lisbon targets are about much more than just economic prestige.", "For many economists and analysts, they are about ensuring Europe doesn't become a global economic laggard.", "They are also about ensuring Europe can continue to compete as an equal with the growing economic giants of Asia, India, and China, as well as with the economic might of the United States.", "That's why there was a tone of urgency in the report, out on Wednesday, by the former DuTC Chairman Wiim Koek.", "Mr. Koek's report suggests that meeting the Lisbon targets requires political commitment that no EU member state has volunteered so far.", "While the EU's economic growth rate is projected to be 2% this year and 2.4% next, productivity lagged behind that of the US.", "But meeting the Lisbon targets will require a shift in priorities to narrow down the 14 key indicator areas to 14 key indicators with an emphasis on creating jobs and economic growth.", "As Mr. Koek notes, while the EU's competitive position is waining due to global economic slowdowns, receiving government support for research and development, money needed if the EU was to meet its Lisbon vision will be necessary for getting governments to spend more on research and development.", "Despite this, many have argued that the EU's economic growth rate will decline once again in 2015 due to austerity measures which are being imposed by some EU member states.", "While it may take time for these economic changes to play out fully, Mr. Koek believes that meeting Lisbon targets won't make much of a difference if they are not narrowed down and prioritized accordingly.", "The EU's competitiveness is its most important asset, and the political will needs to be there to get it right."], "tinydolphin:1.1b": [" Here is a condensed version of the text provided: \"The economic targets set out at the Lisbon summit of European Union leaders in 2000 were meant to help Europe leapfrog its way past the United States to become the world's leading economy by 2010.", "However, the Lisbon targets are about much more than just economic prestige.", "They aim to ensure that Europe doesn't become a global economic laggard.\"", "The Economic Targets: \n- Maintain a fiscal position that allows for sufficient public investment and government borrowing relative to GDP, and to achieve a balance between fiscal and monetary policy.", "- Reduce unemployment and promote employment opportunities, particularly in rural areas.", "- Improve the quality of jobs through initiatives such as the European Pillar of Social Rights and the European Social Fund.", "- Maintain high levels of public health within the EU, including the availability of adequate healthcare services and a balanced focus on preventive measures.", "- Promote a sustainable use of natural resources, including in agriculture and energy production.", "- Ensure that research and innovation activities contribute to the economic well-being of Europeans and strengthen their competitive edge in the global marketplace.", "14 Key Indicators: \n- Economic Growth and Job Creation: Inflation, unemployment rates, and levels of productivity are monitored.", "- Environmental Protection and Sustainability: Air and water pollution levels, greenhouse gas emissions, and energy consumption are assessed.", "- Social and Economic Inclusion: Access to education, healthcare, and housing is surveyed.", "- Trade and Globalization: The EU's trade balance, the volume of foreign direct investment, and international trade agreements are measured.", "- European Investments and Policies: Government spending on research and development, infrastructure investment, and tax relief for businesses are tracked.", "Narrowing Down Targets: \n- The Kok Report recommends that the Lisbon targets be narrowed down to 14 key indicators, with an emphasis on creating jobs and economic growth.", "Future Challenges: \n- As the global economy waned, so too did the EU's competitiveness.", "Critics argue that the Kok report doesn't provide a new strategy for meeting the Lisbon targets, which may be a reason for some skepticism of the report's recommendations.", "Future Challenges: \n- The Lisbon goals will continue to shape European policy and decision making for years to come.", "As a result, it is crucial for governments and businesses alike to remain alert to new threats and opportunities in the global economy and adapt accordingly."], "phi:2.7b": [" The original targets set out at the Lisbon summit of European Union leaders in 2000 were meant to help Europe leapfrog its way past the United States and become the world's leading economy by 2010.", "However, due to various economic and political challenges, many of the targets are likely to be missed.", "This could have serious consequences for Europe's position in the global economy.", "The report suggests that a more focused approach is needed, with an emphasis on creating jobs and driving economic growth.", "It also recommends that countries should be ranked according to their progress towards meeting the targets, which would incentivize them to take action.", "Overall, it is clear that there is a need for innovative policies to help Europe meet its Lisbon goals, but this will require significant political will and commitment from European leaders."], "orca-mini:3b": [" The Lisbon risks becoming a \"synonym for missed objectives and failed promises\", according to a report by former Dutch prime minister Wim Kok.", "The report, commissioned by the European Commission, assesses how far the EU has come towards meeting the Lisbon targets, five years on from their inception.", "However, too many of the targets will be seriously missed, the report warns.", "The targets cover economic growth and job creation, as well as environmental protection, social inclusion, and safety at sea.", "The agenda was broad and everything was covered, which is why nothing was prioritized.", "Rhetoric and delivery don't necessarily go hand in hand, according to the report.", "Therefore, the EU should not try to emulate the US economy, which is based on a different model.", "The Kok report recommends narrowing down the Lisbon targets to 14 key indicators and drawing up a league table which ranks countries according to their progress towards meeting the targets."], "hermes3:3b": ["Lisbon targets for European economic growth by 2010 face missed objectives and require narrowing down to key indicators, according to report by former Dutch PM Wim Kok.", "Targets include job creation and economic growth; should not attempt to emulate US economy."], "stablelm-zephyr:3b": ["The Lisbon Summit set economic targets for Europe in 2000, aiming to overtake the US as the world's leading economy by 2010.", "However, former Dutch Prime Minister Wim Kok's report found that many of these targets will be missed and warns that Europe's sustainability is at risk.", "The Lisbon agenda was intended to prioritize job creation and economic growth, but the broad range of targets made it difficult to focus on specific areas.", "Kok recommends narrowing the targets to 14 key indicators and creating a league table to rank countries based on their progress towards meeting the goals."], "chatgpt-4o-latest": ["The Lisbon targets, set by EU leaders in 2000, aimed to make Europe the world's leading economy by 2010, ensuring competitiveness against the US and emerging Asian economies.", "However, a report by former Dutch Prime Minister Wim Kok found that many targets would be missed due to overly broad goals, lack of political commitment, and economic downturns.", "The report warned that Europe's economic and social sustainability was at risk and recommended narrowing the targets to 14 key indicators focused on job creation and growth.", "It also suggested ranking countries based on progress to encourage accountability.", "While advocating economic reform, Kok emphasized that Europe should not fully emulate the US model, maintaining social and environmental priorities.", "Critics argue the report lacks concrete strategies for implementation.", "The new European Commission president, Jose Manuel Barroso, has pledged to prioritize competitiveness and push for progress on the Lisbon agenda."], "stablelm2:1.6b": ["Summary: The Lisbon targets, established by European Union leaders at the 2000 Lisbon summit, were intended to propel Europe ahead of the United States and become the world's leading economy.", "However, there is a risk that these targets will lead to missed objectives and failed promises.", "In order to ensure the sustainability of society in Europe, it must change its economic model to compete with Asian giants such as India and China, as well as with the US.", "The EU's growth rate is projected at 2% this year and 2.4%, but meeting the Lisbon targets requires political commitment from each member state.", "The global financial crisis of 2008 and subsequent challenges made it difficult for these targets to be met.", "In order to achieve the desired results, the targets should be narrowed down to key indicators related to job creation and economic growth, with a focus on ensuring that social and environmental issues are not neglected in favor of economic growth.", "The European Union must avoid attempting to emulate the US economy's model, but instead change its economic and social structure without compromising essential elements such as social inclusion and environmental protection."], "granite3.1-dense:2b": ["The Lisbon targets, set by European Union leaders in 2000 to surpass the US as the world's leading economy by 2010 and maintain global competitiveness with emerging economic powers like Asia, India, China, and the US, are at risk of being missed due to insufficient political commitment.", "Wim Kok's 2023 assessment report, commissioned by the European Commission, highlights that many Lisbon targets will likely not be achieved.", "The EU's economic growth rate is projected to remain around 2% and productivity still lags behind the US.", "Kok's recommendation to narrow down the 19 original Lisbon targets into 14 key indicators focuses on job creation and economic growth.", "He suggests creating a league table ranking countries based on their progress towards these goals, with the aim of fostering competition and accountability.", "The report emphasizes that the EU should not prioritize economic growth at the expense of social and environmental issues, advocating for policies to keep women and older workers in the labor force without specifying how this can be achieved.", "The primary challenge lies in transforming the European Union's economic model while preserving its social and environmental foundations, an ambitious task as no advanced economy has attempted such a balance before.", "The success of meeting these targets hinges on the incoming president of the European Commission, Jose Manuel Barroso, adopting Kok's recommendations and driving change in EU governments."]}