{"raw_text": "Malaysia lifts Islamic bank limit\n \n Malaysia's central bank is to relax restrictions on foreign ownership to encourage Islamic banking.\n \n Banks in Malaysia will now be able to sell up to 49% of their Islamic banking units, while the limit on other kinds of bank remains at 30%. RHB, Malaysia's third-biggest lender, is already scouting for a foreign partner for its new Islamic banking unit, the firm told Reuters. The moves put Malaysia ahead of a 2007 deadline to open up the sector. The country's deal to join the World Trade Organisation set that year as a deadline for liberalisation of Islamic banking. Also on Tuesday, the central bank released growth figures showing Malaysia's economy expanded 7.1% in 2004. But growth slowed sharply in the fourth quarter to 5.6%, and the central bank said it expected 6% expansion in 2005.\n \n Malaysia changed the law to allow Islamic banking in 1983. It has granted licences to three Middle Eastern groups, which - along with local players - mean there are eight fully-operational Islamic banking groups in the country. Islamic banks offer services which permit modern banking principles while sticking to Islamic law's ban on the payment of interest. Most of the Malays which make up half the country's population are Muslims.\n", "llama3.2:1b": ["Malaysia's central bank is relaxing restrictions on foreign ownership for Islamic banks, allowing them to sell up to 49% of their units, compared to the current limit of 30%.", "This move puts Malaysia ahead of a 2007 deadline to liberalize Islamic banking and comes after growth figures showed the country's economy expanded by 7.1% in 2004."], "llama3.2:3b": ["Malaysia lifts restrictions on foreign ownership for Islamic banks, allowing 49% stake sales, ahead of a 2007 deadline.", "The country has eight fully-operational Islamic banking groups and plans to expand."], "gemma2:2b": ["Malaysia is relaxing restrictions on foreign ownership for its Islamic banks, allowing them to sell up to 49% of their units.", "This move follows a 2007 deadline set by Malaysia's WTO deal and aims to further develop this sector.", "The country has seen growth in the Islamic banking sector with eight fully-operational institutions operating."], "qwen2.5:0.5b": ["Malaysia has lifted restrictions on foreign ownership and increased its ability to operate an Islamic banking sector, allowing for more diverse offerings.", "The central bank is currently looking at potential foreign partners for a new Islamic banking unit in Malaysia, as the 2007 deadline to open up the sector approached.", "Malaysian growth figures show that the economy expanded by 7.1% in 2004 but slowed in the fourth quarter to 5.6%, with the central bank expecting 6% expansion in 2005."], "qwen2.5:1.5b": ["Malaysia lifts restrictions on foreign ownership of Islamic banks, allowing 49% and expanding from a 30% limit for other types of banks.", "RHB is scouting for a partner to launch an Islamic banking unit.", "The move comes ahead of a 2007 WTO deadline for liberalizing the sector.", "Malaysia's economy grew by 7.1% in 2004, although growth slowed to 5.6% in the fourth quarter and expectations are for another 6% expansion in 2005.", "The country began Islamic banking laws in 1983 with three regional groups operating alongside local banks."], "qwen2.5:3b": ["Malaysia's central bank is lifting restrictions allowing foreign ownership in Islamic banks to 49%, from a previous limit of 30%.", "This move, effective for new units, follows Malaysia’s deadline set by its WTO membership in 2007 to liberalize the sector.", "RHB has already started exploring partnerships with foreign entities for its new Islamic banking unit.", "The economy grew 7.1% in 2004 but slowed to 5.6% in Q4 of that year, expecting a 6% growth in 2005.", "Malaysia began allowing Islamic banking in 1983 and has granted licenses to eight fully-operational groups, including those from Middle Eastern countries.", "Islamic banks provide modern banking services compliant with Islamic law's prohibition on interest payments."], "opencoder:1.5b": ["The output for this text is as follows:\n\nMalaysia lifts Islamic bank limit.", "Malaysia's central bank relaxes restrictions on foreign ownership encouraging Islamic banking.", "Banks in Malaysia will now be able to sell up to 49% of Islamic banking units while the limit remains at 30%.", "RHB, Malaysia's third-biggest lender already focused for a foreign partner.", "The country's new Islamic banking unit firm announced in Reuters today.", "Country's deal to join World Trade Organisation set deadline for liberalisation.", "Also on Tuesday, central bank released growth figures showing Malaysian economy expanded by 7.1% in 2004.", "But growth slowed sharply in the fourth quarter to 5.6%, and central bank said it predicted 6% expansion in 2005.", "Malaysia changed Islamic banking law in 1983 with licences granted to three Middle Eastern banks."], "smollm:1.7b": ["The Malaysian government has relaxed restrictions on foreign ownership for Islamic banks, allowing them to sell up to 49% of their units and other kinds of bank remain at 30%.", "This move is expected to encourage more foreign investment in the sector and help Malaysia achieve its goal of becoming a major player in the global Islamic banking market.", "The country has already signed a deal with RHB, one of the largest banks in Malaysia, to set up an Islamic banking unit.", "The Malaysian government's decision to relax restrictions on foreign ownership for Islamic banks is seen as a step towards liberalization of the sector and encouraging more foreign investment.", "This move is expected to help Malaysia achieve its goal of becoming a major player in the global Islamic banking market.", "The country has already signed agreements with several Middle Eastern groups which have been granted licenses by the central bank to operate Islamic banks.", "The Malaysian government's decision to relax restrictions on foreign ownership for Islamic banks is also seen as a step towards encouraging more foreign investment in the sector and helping Malaysia achieve its goal of becoming a major player in the global Islamic banking market.", "The country has already signed agreements with RHB, one of the largest banks in Malaysia, to set up an Islamic banking unit.", "The Malaysian government's decision to relax restrictions on foreign ownership for Islamic banks is expected to encourage more foreign investment in the sector and help Malaysia achieve its goal of becoming a major player in the global Islamic banking market.", "The country has already signed agreements with several Middle Eastern groups which have been granted licenses by the central bank to operate Islamic banks.", "The Malaysian government's decision to relax restrictions on foreign ownership for Islamic banks is also seen as a step towards encouraging more foreign investment in the sector and helping Malaysia achieve its goal of becoming a major player in the global Islamic banking market.", "The country has already signed agreements with RHB, one of the largest banks in Malaysia, to set up an Islamic banking unit.", "The Malaysian government's decision to relax restrictions on foreign ownership for Islamic banks is expected to encourage more foreign investment in the sector and help Malaysia achieve its goal of becoming a major player in the global Islamic banking market.", "The country has already signed agreements with several Middle Eastern groups which have been granted licenses by the central bank to operate Islamic banks."], "deepseek-r1:1.5b": ["The central bank of Malaysia is relaxing restrictions on foreign ownership for Islamic banks.", "This move aims to encourage Islamic banking.", "Banks in Malaysia can now sell up to 49% of their Islamic banking units while keeping others at a lower limit of 30%.", "RHB, Malaysia's third-biggest lender, has already scouting for a foreign partner.", "This change sets the country ahead of the 2007 deadline to open up the sector.", "The central bank also released growth figures, showing an economy that expanded by 7.1% in 2004 and slowing to 5.6% in the fourth quarter, with an expected 6% expansion in 2005."], "tinyllama:1.1b": ["Malaysia has relaxed restrictions on foreign ownership for Islamic banks, allowing them to sell up to a maximum of 49% of their units, while the limit on other kinds of bank remains at 30%.", "Banking giant RHB is also scouting for a potential foreign partner for its new Islamic banking unit.", "The country's liberalisation of Islamic banking set in motion by a 2007 deadline has progressed, with Malaysia now ahead of the WTO's deadline to join the trade bloc.", "Growth figures showed Malaysia's economy expanding 7.1% last year and growth slowing down sharply in Q4 to just 5.6%.", "The country granted licences to three Islamic banking groups, including the country's largest by number of licenses.", "Muslims form half of Malaysia's population, and Islamic banks have grown to 8 fully-operational groups out of 17 operational groups in the country."], "tinydolphin:1.1b": [" The summary statement is \"Malaysia has approved a relaxation in Islamic bank ownership limits, allowing foreign ownership of Islamic banks to increase.\"", "It explains that under the current set of rules, Islamic banks in Malaysia can have foreign ownership ratios of up to 30%, but this was changed by the central bank.", "The new rule allows Islamic banks to sell up to 49% of their units to non-Malaysians while keeping the existing 30% limit in place for other types of lenders.", "This move is expected to encourage more businesses to embrace Islamic banking practices and attract foreign investment, paving the way for more growth in Malaysia's economy."], "phi:2.7b": [" Malaysia's central bank is relaxing restrictions on foreign ownership for Islamic banking, allowing banks to sell 49% of their units and setting a 2007 deadline for full liberalization.", "The country has eight fully-operational Islamic banking groups with eight local and three Middle Eastern licensed groups."], "orca-mini:3b": [" Malaysia removes the limit on foreign ownership of Islamic banks to encourage more growth.", "RHB is scouting for a foreign partner for its new Islamic banking unit.", "The World Trade Organization deadline for liberalization of Islamic banking was 2007, and Malaysia's economy grew by 7.1% in 2004.", "However, growth slowed significantly in the fourth quarter to 5.6%.", "The central bank expects 2005 growth of 6%."], "hermes3:3b": ["Malaysia lifts 49% cap on foreign ownership for Islamic banks."], "stablelm-zephyr:3b": ["Malaysia's central bank has relaxed restrictions on foreign ownership in Islamic banks, allowing sales of up to 49% of Islamic banking units.", "This move encourages Islamic banking and puts Malaysia ahead of a 2007 deadline to open up the sector.", "The country has granted licenses to three Middle Eastern groups, along with local players, resulting in eight fully-operational Islamic banking groups."], "chatgpt-4o-latest": ["Malaysia's central bank is easing restrictions on foreign ownership in Islamic banking, allowing banks to sell up to 49% of their Islamic banking units, compared to a 30% limit for other banks.", "RHB, Malaysia's third-largest lender, is seeking a foreign partner for its Islamic banking unit.", "This move comes ahead of a 2007 deadline set by Malaysia's World Trade Organisation agreement to liberalize Islamic banking.", "The central bank also reported 7.1% economic growth in 2004, though growth slowed to 5.6% in the fourth quarter, with a 6% expansion expected in 2005.", "Malaysia legalized Islamic banking in 1983 and has licensed three Middle Eastern groups, bringing the total to eight Islamic banking groups.", "These banks follow Islamic law, which prohibits interest payments, catering to the country's Muslim-majority population."], "stablelm2:1.6b": ["Malaysia will relax restrictions on foreign ownership for Islamic banks, allowing them to sell up to 20% of their units and maintaining a limit at 80%.", "This move puts Malaysia ahead of a deadline set by joining the World Trade Organisation to liberalize the sector.", "The central bank has also released growth figures showing an 7.1% expansion in 4Q but slowed to 5.6% in Q4 with an expected 6% growth in 2024.", "The country first introduced Islamic banking through legal changes that granted licenses to three Middle Eastern groups, along with local players, resulting in eight fully-operational Islamic banks.", "Most Malays, who comprise half the population, are Muslims."], "granite3.1-dense:2b": ["Malaysia's central bank is easing restrictions on foreign ownership in Islamic banks, from 30% down to 49%.", "This move aims to stimulate the growth of Islamic banking, a sector that has been open since 1983 and currently includes eight operational institutions.", "Local lender RHB Bank is already seeking a foreign partner for its new Islamic banking unit.", "Malaysia's economy expanded by 7.1% in 2004 but experienced a slowdown to 5.6% in the fourth quarter, with the central bank predicting 6% growth in 2005.", "The country is ahead of its 2007 deadline for liberalizing Islamic banking, set as part of its World Trade Organization commitments."]}