{"raw_text": "Alfa Romeos 'to get GM engines'\n \n Fiat is to stop making six-cylinder petrol engines for its sporty Alfa Romeo subsidiary, unions at the Italian carmaker have said.\n \n The unions claim Fiat is to close the Fiat Powertrain plant at Arese near Milan and instead source six-cylinder engines from General Motors. Fiat has yet to comment on the matter, but the unions say the new engines will be made by GM in Australia. The news comes a week after GM pulled out of an agreement to buy Fiat. GM had to pay former partner Fiat 1.55bn euros ($2bn; £1.1bn) to get out of a deal which could have forced it to buy the Italian carmaker outright. Fiat and GM also ended their five-year alliance and two joint ventures in engines and purchasing, but did agree to continue buying each other's engines.\n \n \"Powertrain told us today that Alfa Romeo engines will no longer be made in Arese,\" said union leader Vincenzo Lilliu, as reported by the Reuters news agency. \"The assembly line will be dismantled and the six-cylinder Alfa Romeo motor will be replaced with an engine GM produces in Australia.\" Reuters also said that Mr Lilliu and other union bosses shouted insults at Fiat chairman Luca di Montezemolo, following a meeting on Tuesday regarding the future of the Arese plant. The unions said the end of engine production at the facility would mean the loss of 800 jobs. All Alfa Romeo models can be bought with a six-cylinder engine - the 147, 156, 156 Sportwagon, 166, GTV, GT and Spider.\n", "llama3.2:1b": ["Fiat is to stop producing six-cylinder petrol engines for its Alfa Romeo subsidiary due to the Italian carmaker's decision to close the Arese plant in Milan.", "Instead, Fiat will source six-cylinder engines from General Motors, which is based in Australia, with production reportedly taking place at a new facility in that country."], "llama3.2:3b": ["Fiat plans to stop producing six-cylinder petrol engines for Alfa Romeo at its Arese plant near Milan, citing a move towards sourcing engines from General Motors in Australia instead, according to unions, which claim the move would result in 800 job losses."], "gemma2:2b": ["Fiat will stop manufacturing six-cylinder petrol engines for its Alfa Romeo subsidiary, instead sourcing them from General Motors (GM).", "This change will lead to the closure of the Fiat Powertrain plant in Arese and the displacement of GM engine production from Australia.", "The move follows a recent agreement between Fiat and GM that ended with GM withdrawing its buyout offer and also ending their joint ventures."], "qwen2.5:0.5b": ["Unions at Fiat have said they will stop making six-cylinder petrol engines for Alfa Romeo's subsidiary in Arese near Milan.", "The unions claim the new engines will be made by General Motors in Australia.", "Fiat has yet to comment on the matter but has pledged to continue buying GM's engines and purchasing, while ending engine production at Arese.", "All 14 Alfa Romeo models can be bought with a six-cylinder engine."], "qwen2.5:1.5b": ["Fiat plans to close its Fiat Powertrain plant in Arese and source six-cylinder engines from GM in Australia for Alfa Romeo."], "qwen2.5:3b": ["Fiat is to stop making six-cylinder petrol engines for its Alfa Romeo subsidiary due to union claims that Fiat will close the Arese plant near Milan and source these engines from General Motors in Australia.", "The move comes a week after GM pulled out of a deal with Fiat, which included buying the Italian carmaker.", "Union leaders at the Arese plant claim this change means the end of engine production, leading to job losses for 800 workers.", "Alfa Romeo uses six-cylinder engines across several models including the 147, 156, and Spider."], "opencoder:1.5b": ["The output is a concise summary of the given text:\n\nAlfa Romeo intends to close its subsidiary Fiat Powertrain plant at Arese near Milan for six-cylinder engines from General Motors.", "The news comes a week after GM pulled out of an agreement to buy Fiat outright, and they agreed to continue buying each other's engines.", "The powertrain has reported that Alfa Romeo will no longer produce engine in Arese."], "smollm:1.7b": ["The summary is concise and to the point, conveying the main ideas of the original text without including unnecessary details or explanations.", "The key points are:\n\n1.", "Alfa Romeos 'to get GM engines' - This sentence summarizes the main idea of the text, which is that Fiat is planning to stop making six-cylinder petrol engines for its sporty Alfa Romeo subsidiary and instead source them from General Motors.", "2.", "GM engines will be replaced by Alfa Romeo engines - The second key point in the summary is that GM will replace the six-cylinder engines with those produced by Fiat, which would mean the end of production at the Arese plant.", "3.", "800 jobs lost - This sentence provides a specific number and details about the impact on Alfa Romeo employees."], "deepseek-r1:1.5b": ["The unions at Fiat are opposing their planned shutdown of their powertrain plant near Milan and replacing it with GM engines in Australia.", "They have agreed to purchase the new engines but claim this move will eliminate 800 jobs for Alfa Romeo models that no longer use these engines.", "The move comes after GM paid $1.55 billion for the previous agreement, which could force them to buy the entire Italian automotive division outright."], "tinyllama:1.1b": ["In response to Fiat's decision to close the Fiat Powertrain plant in Arese, Italy, the union representatives of Fiat have claimed that the company will instead source six-cylinder engines from General Motors (GM) manufactured in Australia.", "This announcement was made on Tuesday, and it is part of a five-year agreement between GM and Fiat, which has ended due to disagreements over engine purchasing.", "The union representatives also alleged that the end of engine production at Arese will mean the loss of 800 jobs.", "Alfa Romeo models can be equipped with six-cylinder engines by default, while GM's products include the 147, 156, 156 Sportwaagon, 166, GTV, and GT."], "tinydolphin:1.1b": [" Summary: Fiat is planning to stop producing six-cylinder petrol engines for its Alfa Romeo brand in favor of GM's offerings.", "This decision has led to unions at Fiat attempting to force a change in engine production, threatening to lose 800 jobs and disrupt the market for Alfa Romeo models."], "phi:2.7b": [" Fiat is ending the production of six-cylinder petrol engines for its sporty Alfa Romeo subsidiary in Italy.", "The union claims that General Motors will be providing the new engines, which will be made in Australia.", "This news comes shortly after GM pulled out of an agreement to buy Fiat.", "Fiat and GM's joint ventures in engines and purchasing are also ending."], "orca-mini:3b": [" Fiat is halting production of six-cylinder petrol engines for its sporty Alfa Romeo subsidiary.", "The union leaders claimed that GM will supply the engines from Australia and the Arese plant will lose its assembly line.", "The news follows GM's agreement to pay Fiat 1.55bn euros to get out of a deal to buy Fiat outright.", "The unions allege that Luca di Montezemolo was shouted at during a meeting regarding the future of the Arese plant."], "hermes3:3b": ["Alfa Romeo to get GM engines (no more producing own 6-cylinder petrol engines, will source from GM in Australia, according to unions)."], "stablelm-zephyr:3b": ["Fiat is reportedly shutting down its Alfa Romeo subsidiary's six-cylinder petrol engine plant in Arese, Milan, and will start sourcing engines from General Motors instead.", "GM will manufacture the new six-cylinder engines in Australia.", "The move comes a week after GM ended its agreement to buy Fiat and paid $1.55 billion to secure its exit from that deal.", "Alfa Romeo still offers all models with six-cylinder engines, which include 147, 156, 156 Sportwagon, 166, GTV, GT, and Spider.", "The shutdown will result in the loss of 800 jobs at the plant."], "chatgpt-4o-latest": ["Fiat will stop producing six-cylinder petrol engines for Alfa Romeo and will source them from General Motors instead, according to unions.", "The Fiat Powertrain plant in Arese, near Milan, is set to close, with GM manufacturing the replacement engines in Australia.", "This follows GM's recent withdrawal from a deal to buy Fiat, paying €1.55bn to exit the agreement.", "Despite ending their five-year alliance, Fiat and GM will continue purchasing each other's engines.", "The decision is expected to result in 800 job losses at the Arese plant, sparking union protests.", "All Alfa Romeo models currently offer a six-cylinder engine."], "stablelm2:1.6b": ["Fiat will stop producing six-cylinder petrol engines for its Alfa Romeo subsidiary, instead sourcing engines from General Motors, which will be produced in Australia.", "This decision comes a week after GM pulled out of an agreement to buy Fiat.", "The unions claim that Fiat is planning to close the Fiat Powertrain plant at Arese near Milan and replace Alfa Romeo's six-cylinder engines with GM-produced models in Australia.", "If this happens, it would result in job loss."], "granite3.1-dense:2b": ["Fiat plans to cease producing six-cylinder petrol engines for its Alfa Romeo division at the Fiat Powertrain plant in Arese, Italy, according to unions.", "Instead, Fiat will source these engines from General Motors (GM), which will manufacture them in Australia.", "This decision comes after GM's withdrawal from a proposed acquisition of Fiat for 1.55 billion euros, and the termination of their five-year alliance and joint ventures in engines and purchasing.", "The unions claim this shift will result in the loss of approximately 800 jobs at the Arese plant.", "All Alfa Romeo models currently offer six-cylinder options, including the 147, 156, 156 Sportwagon, 166, GTV, GT, and Spider."]}