{"raw_text": "Shares hit by MS drug suspension\n \n Shares in Elan and Biogen Idec plunged on Monday as the firms suspended sales of new multiple sclerosis drug Tysabri after a patient's death in the US.\n \n On the New York Stock Exchange, shares in Ireland-based Elan lost 70% while US partner Biogen Idec shed 43%. The firms took action after the death from a central nervous system disease and a suspected case of the condition. The cases cited involved the use of both Tysabri and Avonex, Biogen Idec's existing multiple sclerosis drug. The companies said they have no reports of the rare condition - progressive multifocal leukoencephalopathy (PML) - in patients taking either Tysabri or Avonex alone. Tysabri was approved for use in the US last November and was widely tipped to become the world's leading multiple sclerosis treatment.\n \n \"The companies will work with clinical investigators to evaluate Tysabri-treated patients and will consult with leading experts to better understand the possible risk of PML,\" the two firms said in a statement. \"The outcome of these evaluations will be used to determine possible re-initiation of dosing in clinical trials and future commercial availability.\"\n \n Analysts had believed the product would provide a new growth opportunity for Biogen Idec, which had faced increased competition from rivals to Avonex. Elan, once the biggest firm on the Irish stock exchange, was also expected to receive a boost, from the new product. An inquiry into Elan's accounts in 2002 brought the group close to bankruptcy but the firm has been rebuilding itself since, with its share price increasing by almost four-fold last year. \"Most of the value in the company was in Tysabri,\" said Ian Hunter at Goodbody Stockbrokers in Dublin. \"Now there's a question mark over it.\" Elan finished down $18.90 at $8, while Biogen fell $28.63 to $38.65.\n \n - Shares in UK pharmaceutical firm Phytopharm closed down 19.84% at 151.5 pence on the London Stock Exchange on Monday, after it said a partner was set to pull out of a deal on an experimental Alzheimer's disease treatment. Phytopharm said Japan's Yamanouchi Pharmaceutical was likely to end a licensing agreement, prompting analysts to raise questions over the level of its future cash reserves.\n", "llama3.2:1b": ["Shares in Elan and Biogen Idec fell after they suspended sales of new multiple sclerosis drug Tysabri due to a patient's death in the US.", "The companies cited no reports of PML (progressive multifocal leukoencephalopathy) in patients taking either Tysabri or Avonex alone, but stated that they would work with clinical investigators and experts to understand the risk.", "Analysts had believed Tysabri would provide a new growth opportunity for Biogen Idec and Elan, which had been boosted by its launch of multiple sclerosis treatment Avonex."], "llama3.2:3b": ["Shares in Elan and Biogen Idec plunged after suspending sales of multiple sclerosis drug Tysabri due to patient deaths from progressive multifocal leukoencephalopathy (PML), with shares in Elan losing 70% and those in Biogen Idec shedding 43%."], "gemma2:2b": ["Elan and Biogen Idec suspended sales of their new multiple sclerosis drug Tysabri after a patient's death from a rare brain disease.", "The companies are investigating the cause and will determine future use based on the results.", "This suspension impacted both Elan and Biogen, with shares in Elan falling by 70% and Biogen's shares dropping by 43%.", "Phytopharm also experienced a decline in its stock price following news of an experimental Alzheimer's treatment deal termination."], "qwen2.5:0.5b": ["Shares in Elan and Biogen Idec fell on Monday as both firms suspended sales of their multiple sclerosis drug Tysabri after a patient's death from a central nervous system disease.", "The companies said they are working with clinical investigators to evaluate potential risks associated with the new treatment and will consult leading experts.", "The outcome of these evaluations would be used to determine possible re-initiation of dosing in future trials and commercial availability.", "Analysts believe this drug represents a new growth opportunity for Biogen Idec, which was facing increased competition from rivals to Avonex but has been rebuilding itself since the 2002 inquiry into its accounts."], "qwen2.5:1.5b": ["Shares in several pharmaceutical companies plunged after the suspension of Tysabri due to reports linking it with PML, resulting in significant losses for Elan and Biogen Idec as well as Phytopharm.", "The European firm also faces inquiries into its accounts following a bankruptcy close call."], "qwen2.5:3b": ["Shares in Elan and Biogen Idec plunged after Tysabri sales were suspended due to a patient death linked to progressive multifocal leukoencephalopathy (PML).", "Elan's shares lost 70% while Biogen Idec's shed 43%.", "The companies are evaluating the risk of PML in patients using either Tysabri or Avonex.", "Analysts expected Tysabri to provide a growth opportunity for Biogen Idec, which faces increased competition from Avonex.", "Elan’s share price had increased nearly four-fold last year but now questions remain about the product's future value.", "UK firm Phytopharm also saw its shares fall after reporting that its partner was set to end a licensing agreement for an experimental Alzheimer's disease treatment."], "opencoder:1.5b": ["The summary would presume that the text provided is a report from a financial conference or a trading blog discussing shares in multiple sclerosis-related firms.", "The summary here attempts to condense the given text while preserving key points and details.", "Here are some highlights:\n\n1.", "Shares hit by MS drug suspension\n\n2.", "Elan and Biogen Idec plunged on Monday as their drug suspensions\n\n3.", "The companies took action after the death from a central nervous system disease\n\n4.", "A case involving Tysabri and Avonex, both approved for use in the US\n\n5.", "Elan's accounts in 2002 brought the group close to bankruptcy but the firm has been rebuilding itself.", "The key points about their actions, the nature of the case, and the potential impact on their products have been preserved.", "Additional information or more details would need to be included based on the context of the specific report."], "smollm:1.7b": ["The summary should be concise and focus on the main points:\n\n1.", "Shares in Elan and Biogen Idec plummeted after the US drug suspension.", "2.", "The two firms suspended sales of new multiple sclerosis drug Tysabri after a patient's death was reported, citing possible cases of PML.", "3.", "Analysts believed the product would provide a growth opportunity for Biogen Idec.", "4.", "Elan finished down 19.84% at $8 on the London Stock Exchange.", "5.", "Analysts raised questions over the level of Yamanouchi Pharmaceutical's cash reserves, which were likely to be used in future clinical trials."], "deepseek-r1:1.5b": ["The shares of Elan and Biogen Idec fell significantly in the US on Monday after they suspended sales of Tysabri, due to a patient's death in the US and disease cases involving Avonex.", "Elan lost 70% while Biogen Idec shed 43%.", "The companies plan to evaluate Tysabri-treated patients for PML, a rare condition.", "Analysts expect Tysabri to open new growth opportunities for both firms, with Biogen expected to see significant rebound from the partnership with Phytopharm and Elan expected to rebuild after a tough time."], "tinyllama:1.1b": ["Based on the text material, the drug named Tysabri, which is currently under review in the US, has been found to be associated with a rare and fatal condition called progressive multi-foceal leukoecnema (PML) in patients taking the product alone.", "The firms involved in the launch of this treatment, Elain and Biogen Idec, took action after the deaths of two individuals, one in the US and another in Spain.", "The companies have stated that they will work with clinical investigators to evaluate the risks associated with Tysabri and will consult leading experts on PML as part of their evaluation process.", "Although the product has significant potential as a new treatment for multiple sclerosis, concerns about the possible risk of PML have resulted in the temporary suspension of sales in some countries.", "Overall, this news has caused significant losses among shareholders, including Phytopharm, which is set to lose $10 million from the deal with Yamanoichi Pharmaceucials after the announcement."], "tinydolphin:1.1b": [" The article discusses how two major drug companies, Elan and Biogen Idec, suspended sales of Tysabri, their new multiple sclerosis drug after a patient's death in the US, which led to significant drops in their share prices on the New York Stock Exchange.", "This event occurred amidst uncertainty regarding progressive multifocal leukoencephalopathy (PML) reported in patients taking both Tysabri and Avonex.", "The companies have not released any reports of the rare condition, but analysts are expecting a shift towards new growth opportunities for both firms.", "The drop in shares is indicative of investors' concerns regarding the potential risks associated with the drug's use, which could impact future sales and earnings."], "phi:2.7b": [" Shares in Elan and Biogen Idec fell after the suspension of their multiple sclerosis drug Tysabri following a patient's death due to a central nervous system disease.", "The firms took action by suspending sales of both Tysabri and Biogen Idec'S existing MS drug, Avonex.", "They are conducting an investigation into PML (progressive multifocal leukoencephalopathy) in patients taking either Tysabri or Avonex alone to determine if re-initiation of dosing in clinical trials is possible.", "The outcome of these evaluations will be used to determine future commercial availability.", "Phytopharm, a UK pharmaceutical firm, saw its share price fall after it said that Japan's Yamanouchi Pharmaceutical was likely to end a licensing agreement on an experimental Alzheimer'S disease treatment.", "Analysts are questioning the level of Phytopharm's future cash reserves."], "orca-mini:3b": [" Shares in Elan and Biogen Idec lost a significant amount of value on Monday after their partner, Yamanouchi Pharmaceutical, pulled out of a deal on an experimental Alzheimer's disease treatment.", "The move came after one patient died from a rare condition linked to the use of Tysabri and Avonex, the companies' existing multiple sclerosis drugs.", "The firms will work with clinical investigators and leading experts to evaluate the safety of Tysabri-treated patients and determine possible re-initiation of dosing in clinical trials and future commercial availability.", "Analysts believed Tysabri would provide a new growth opportunity for Biogen Idec, which had faced increased competition from rivals to Avonex.", "Elan was also expected to receive a boost, from the new product."], "hermes3:3b": ["Shares dropped for Elan and Biogen Idec after Tysabri MS drug suspension due to patient deaths from central nervous system disease and suspected PML condition, affecting US approvals and sales."], "stablelm-zephyr:3b": ["Elan and Biogen Idec's shares fell sharply following the suspension of sales of their multiple sclerosis drug Tysabri by the companies after a patient's death linked to a rare condition, progressive multifocal leukoencephalopathy (PML).", "Both Elan and Biogen Idec said they have no reports of PML in patients taking Tysabri or Avonex, another Biogen Idec drug.", "The outcome of evaluations of Tysabri-treated patients will determine possible re-initiation of dosing in clinical trials and future commercial availability.", "Analysts had expected Tysabri to provide a new growth opportunity for Biogen Idec, while Elan was also expected to benefit from the product."], "chatgpt-4o-latest": ["Shares in Elan and Biogen Idec plummeted after they suspended sales of their multiple sclerosis drug Tysabri following a patient's death from a rare central nervous system disease in the US.", "Elan's stock dropped 70%, while Biogen Idec's fell 43%.", "The cases involved patients using both Tysabri and Biogen's existing drug Avonex, though no reports of the disease were linked to either drug alone.", "The companies are investigating the risk and will determine whether to resume trials and sales.", "Analysts had expected Tysabri to be a major growth driver for both firms, particularly for Elan, which had been recovering from financial troubles.", "Meanwhile, UK pharmaceutical firm Phytopharm saw its shares fall nearly 20% after Japan's Yamanouchi Pharmaceutical signaled it would end a licensing deal for an experimental Alzheimer's treatment, raising concerns about Phytopharm's financial future."], "stablelm2:1.6b": ["Shares in Elan and Biogen Idec dropped after suspending sales of Tysabri due to a patient's death in the US.", "No reports of rare condition PML have been found in patients taking either drug alone, but clinical evaluations will evaluate Tysabri-treated patients for possible re-initiation of dosing in trials and future commercial availability.", "Elan was expected to benefit from the new product, while Biogen Idec faced increased competition from rivals to Avonex.", "Shares closed down in both Ireland and Japan following these events."], "granite3.1-dense:2b": ["Shares in Elan and Biogen Idec plummeted on Monday due to the suspension of Tysabri sales following a patient's death from progressive multifocal leukoencephalopathy (PML), a rare central nervous system disease linked to both Tysabri and Avonex.", "Elan lost 70%, while Biogen Idec dropped 43%.", "The companies will evaluate Tysabri-treated patients and consult experts to assess the risk of PML, potentially re-initiating dosing in clinical trials and future commercialization.", "This development posed a significant question mark over Elan's growth prospects, as most analysts had expected Tysabri to be a major contributor after its approval for US use last November.", "Biogen Idec was also anticipated to benefit from the product.", "Additionally, Phytopharm's shares fell 19.84% on the London Stock Exchange due to Japan's Yamanouchi Pharmaceutical likely ending a licensing agreement for an Alzheimer's disease treatment.", "This news raised concerns about Phytopharm's future cash reserves, as analysts questioned its financial position."]}