{"raw_text": "India unveils anti-poverty budget\n \n India is to boost spending on primary schools and health in a budget flagged as a boost for the ordinary citizen.\n \n India's defence budget has also been raised 7.8% to 830bn rupees ($19bn). The priority for Finance Minister Palaniappan Chidambaram is to fight poverty and keep the government's Communist allies onside. But his options are limited by a new law which makes him cut the budget deficit, which he said would be 4.5% of GDP in the year to March 2005. The country's overall deficit is thought to be more than 10%, if the spending of India's 35 states and territories is included. Under the fiscal responsibility law, Mr Chidambaram has to trim the deficit by 0.3 percentage points each year, a target he says he has now met for the current year.\n \n But the heavy spending on poverty reduction means the 2005-6 target for the deficit will be 4.3%, Mr Chidambaram said - falling short of the new law's requirement. \"I was left with no option but to press the pause button vis a vis the act,\" he said. The following year, though, would have to be back on track, he warned.\n \n \"I may add that we are perilously close to the limits of fiscal prudence and there is no more room for spending beyond our means,\" he said. The coming year's reduction has meant bringing more of the businesses in India's burgeoning services sector into the tax system and restructuring the personal tax system, although there are numerous corporate tax and duty reductions built into the budget.\n \n Presenting his budget in the lower house of parliament, Mr Chidambaram said the Indian economy was performing strongly and that inflation has been reined in. He said India's economy grew 6.9% in 2004. In his budget Mr Chidambaram has:\n \n - Increased spending on primary education to 71.56bn rupees ($1.6bn) \n  - Increased spending on health to 102.8bn rupees ($2.35bn) \n  - Announced that 80bn rupees ($1.8bn) will be spent on building rural infrastructure \n  - Pledged 102.16bn rupees ($2.3bn) for tsunami victims \n  - Increased flow of funds to agriculture by 30% \n  - Announced a package for the sugar industry\n \n In addition, up to 100bn rupees ($2.3bn) to be spent on infrastructure will be sourced by borrowing against the country's foreign exchange reserves, keeping budgeted spending under control. \"Given the resilience of the Indian economy... it is possible to launch a direct assault on poverty,\" Mr Chidambaram said. \"The whole purpose of democratic government is to eliminate poverty.\" The new Indian government, led by the Congress Party, was voted into power last May after it pledged to introduce economic reforms with a \"human face\".\n \n The finance minister says he is committed to continue reforming India's tax system while expanding the tax base. As part of his reforms he has announced:\n \n - Duty cuts on capital goods and raw materials \n  - Expanded service tax net \n  - Raised the income-tax threshold to 100,000 rupees ($2,300) \n  - Reduced income tax for those earning less than 250,000 rupees ($5,700) to 20% \n  - Reduced corporate tax rates to 30%\n \n An annual economic survey released on Friday said India needed to ease limit restriction on foreign investment, reform labour laws and cut duties apart from widening the tax base for long-term economic growth. But Mr Chidambaram is under pressure from the Communist parties to focus on increasing social spending. The Communists are also hostile to measures seeking to increase foreign investment and allow companies to hire and fire employees at will. In recent months, they have expressed their displeasure at the government's economic reform plans including increasing foreign direct investment in telecommunication and aviation. In his last budget, Mr Chidambaram had pledged billions of dollars for improving education and health services for the poor as well as special assistance for farmers.\n", "llama3.2:1b": ["India unveils anti-poverty budget with increased spending on primary schools and health, a 7.8% increase in defence budget to $19bn.", "Finance Minister Palaniappan Chidambaram's priorities are boosting poverty reduction efforts while keeping the government's deficit at 4.5% of GDP.", "The 2005-6 target for deficit is 4.3%, falling short of a 0.3 percentage point reduction required under new fiscal responsibility law."], "llama3.2:3b": ["India's Finance Minister Palaniappan Chidambaram has unveiled a budget focused on reducing poverty, with increased spending on primary schools, health, and rural infrastructure.", "The defense budget is also higher at 7.8%.", "The government aims to reduce the deficit to 4.3% of GDP in the current fiscal year, falling short of the target set by a new law due to heavy spending on poverty reduction.", "Corporate tax rates are reduced to 30%, while personal tax systems are being restructured."], "gemma2:2b": ["India's new budget prioritizes poverty reduction with increased spending on primary schools, healthcare, rural infrastructure, and tsunami relief.", "The government aims to reduce the deficit by 0.3 percentage points each year while increasing social spending and supporting economic growth.", "The budget includes tax reforms such as duty cuts, expanded service tax net, and income-tax threshold increases for lower earners.", "However, the government faces pressure from the Communist party to prioritize social spending over further liberalization of policies like foreign investment."], "qwen2.5:0.5b": ["India’s 2005-6 fiscal deficit is expected to be close to 10%.", "The government wants to cut it by 4.5% from the current year’s figure, which is 10%.", "However, the new law restricts spending, leading Chidambaram to press the pause button on further cuts.", "In addition, he has announced a series of tax reforms to raise revenue and reduce the deficit."], "qwen2.5:1.5b": ["India unveils budget aimed at poverty reduction with increased spending on schools, healthcare, rural infrastructure, tsunami victims, agriculture support, and infrastructure borrowing against reserves.", "Finance Minister pledges to continue tax reforms while expanding base, targeting 4.3% deficit reduction in FY05 despite fiscal responsibility law's requirement of 4.5%."], "qwen2.5:3b": ["India unveils anti-poverty budget boosting spending on primary schools, health, and rural infrastructure.", "Defense budget rises 7.8% to ₹830bn.", "Finance Minister Palaniappan Chidambaram aims to combat poverty and keep government allies content despite fiscal responsibility law requiring a 4.5% GDP deficit by March 2005.", "Current target is 4.3%.", "Budget includes increased spending on education, health, rural infrastructure, tsunami relief, agriculture, and sugar industry.", "Infrastructure spending up to ₹100bn sourced from foreign reserves.", "To ease poverty, Chidambaram proposes duty cuts, expanded service tax net, income-tax threshold increase, reduced corporate tax rates, and raising income tax rate for lower earners.", "Pressure exists to focus on social spending despite opposition from Communist allies who are hostile towards economic reforms like FDI in telecommunications and aviation."], "opencoder:1.5b": ["India unveils anti-poverty budget\n\nIndia is to boost spending on primary schools and health in a budget flagged as a boost for the ordinary citizen.", "The defence budget has been raised 7.8% to 830bn rupees ($19bn).", "The priority for Finance Minister Palaniappan Chidambaram is to fight poverty and keep the government's Communist allies onside.", "But his options are limited by a new law which makes him cut the deficit, which he said would be 4.5% of GDP in the year to March 2005.", "The country's overall deficit is thought to be more than 10%, if the spending of India's 35 states and territories is included.", "Under the fiscal responsibility law, Mr Chidambaram has to trim the deficit by 0.3 percentage points each year, a target he says he has now met for the current year.", "The heavy spending on poverty reduction means the 2005-6 target for the deficit will be 4.3%, Mr Chidambaram said - falling short of the new law's requirement.", "\"I was left with no option but to press the pause button vis a vis the act,\" he said.", "The following year, though, would have to be back on track, he warned.", "In his budget Mr Chidambaram has increased spending on primary education to 71.56bn rupees ($1.6bn) and health to 102.8bn rupees ($2.35bn).", "He announced that 80bn rupees ($1.8bn) will be spent on building rural infrastructure and pledged 102.16bn rupees ($2.3bn) for tsunami victims.", "In addition, Mr Chidambaram has increased flow of funds to agriculture by 30% while announcing a package for the sugar industry.", "Presenting his budget, Mr Chidambaram said the Indian economy was performing strongly and that inflation has been reined in.", "He said India's economy grew 6.9% in 2004.", "In his budget Mr Chidambaram showed commitment to democratic government by introducing economic reforms with a \"human face\".", "The new Indian government, led by the Congress Party, was voted into power last May after it pledged to introduce economic reform with a \"human face\".", "As part of his reforms, he has announced duty cuts on capital goods and raw materials while expanding service tax net.", "He raised income-tax threshold to 100,000 rupees ($2,300) and reduced income tax for those earning less than 250,000 rupees ($5,700) to 20%.", "The corporate tax rates were also increased from 30%.", "An annual economic survey released on Friday said India needed to ease limit restriction on foreign investment while expanding the tax base for long-term growth.", "But Mr Chidambaram is under pressure from the Communist parties to focus more on social spending, increasing foreign direct investment in telecommunications and aviation as well."], "smollm:1.7b": ["The following summary captures the main ideas:\n\n1.", "India is to boost spending on primary schools and health in a budget flagged as a boost for the ordinary citizen.", "2.", "India's defence budget has also been raised 7.8% to 830bn rupees ($19bn).", "The priority for Finance Minister Palaniappan Chidambaram is to fight poverty and keep the government's Communist allies onside.", "But his options are limited by a new law which makes him cut the budget deficit, which he said would be 4.5% of GDP in the year to March 2005.", "The country's overall deficit is thought to be more than 10%, if the spending of India's 35 states and territories is included.", "3.", "But the heavy spending on poverty reduction means the 2005-6 target for the deficit has been missed by 4.3% ($87bn).", "Mr Chidambaram has:\n\t* Increased spending on primary education to 102.8bn rupees ($2.3bn)\n\t* Increased spending on health to 102.16bn rupees ($2.3bn)\n\t* Pledged 100bn rupees ($2,300) in tax relief for those earning less than 250,000 rupees ($5,700)\n\t* Raised the income-tax threshold to 100,000 rupees ($2,300)\n4.", "In addition, up to 100bn rupees ($2,300) in tax relief for those earning less than 250,000 rupees ($5,700) has been allocated by the government to increase the tax base for long-term economic growth.", "But Mr Chidambaram is under pressure from the Communist parties to focus on increasing foreign investment and allowing companies to hire and fire employees at will."], "deepseek-r1:1.5b": ["The Indian government has introduced an anti-poverty budget that increases spending on primary schools and health services.", "The defense budget is also raised, leading to a 7.8% increase in the 2005-6 fiscal year, though this cuts the deficit by 4.5%, below the target of 0.3 percentage points annually.", "The overall deficit is expected to be over 10%, but due to poverty reduction spending, next year's deficit will fall short.", "Finance Minister Chidambaram aims to increase business and personal taxes and source infrastructure through foreign reserves.", "New duties are cut on capital goods, expanded service tax, income tax thresholds up to ₹100,000, reduced taxes for lower earners, and corporate tax rates lowered.", "The current budget boosts education (₹71.56 billion) and health (₹102.8 billion)."], "tinyllama:1.1b": ["India is to boost spendings on primary schools and health in a new government-backed budget, flagged by Finance Minister Chiyambenchippaan Chiambaraam for fiscal responsibility.", "The priorities are to reduce poverty and keep the government's Communist allies onside, with the country's overall deficit projected to be 4.5% of GDP in the year to March 2005.", "However, as a result of the new law for reducing spendings on poverty reduction, 2005-6 will have to be back on track, with fiscal prudence still needed to match the law's requirements.", "Mr Chiyambenchippaan Chiambaraam has pleaded with his parliamentary colleagues that there is no more room for spendings beyond our means, and he has reduced corporate tax rates to 30% in an attempt to encourage investment.", "The new budget has also increased spendings on social spendings, such as education and health, with 80bn rupees ($1.8bn) being spent on building rural infrastructure.", "In addition, the government is expected to receive up to 100bn rupees ($2.3bn) from borrowing against the country's foreign exchange reserve in order to finance its programs for combating poverty.", "The budget has also emphasized social spendings as a priority and aims to reduce poverty among India's 4.8 billion population."], "tinydolphin:1.1b": [" India unveils anti-poverty budget, setting a new direction to fight poverty while keeping the government's Communist allies onside.", "The budget allocates 80 billion rupees ($1.8 billion) for building rural infrastructure, and 102.8 billion rupees ($2.35 billion) for health services.", "It also increases spending on primary education to 71.56 billion rupees ($1.6 billion), while reducing spending on the arts by 15%.", "This move is expected to provide a solid foundation for India's fight against poverty, as well as boost the country's overall economic growth.", "The Finance Minister, Palaniappan Chidambaram, has also announced that the country will spend $4 billion on developing infrastructure and investments in agriculture over the next five years.", "This move is aimed at promoting innovative ideas and strengthening India's economy, while also ensuring that poverty remains a distant memory."], "phi:2.7b": [" India will increase spending on primary schools and healthcare while reducing its defense budget to fight poverty.", "However, the country is expected to face challenges in maintaining a low deficit due to restrictions on foreign investment and labor laws.", "The government has committed to continue economic reforms with a focus on social spending."], "orca-mini:3b": [" India unveils anti-poverty budget with increased spending on primary schools and health, bringing more businesses into the tax system and restructuring personal taxes.", "The country's overall deficit is thought to be over 10%, if the spending of India's 35 states and territories is included.", "The government's Communist allies are limiting their demands for additional spending on poverty reduction.", "The budget aims to fight poverty and keep the government's Communists onside, but has little wiggle room due to a new law that requires it to cut the deficit by 0.3 percentage points each year.", "The coming year's reduction means bringing more of the businesses in India's burgeoning services sector into the tax system and restructuring the personal tax system.", "Presenting his budget in the lower house of parliament, Mr Chidambaram said the Indian economy was performing strongly and that inflation has been reined in.", "He increased spending on primary education to 71.56bn rupees ($1.6bn) and on health to 102.8bn rupees ($2.35bn).", "India's economy grew 6.9% in 2004.", "The budget also pledged 102.16bn rupees ($2.3bn) for tsunami victims, 80bn rupees ($1.8bn) for rural infrastructure and a package for the sugar industry."], "hermes3:3b": ["India's budget focuses on anti-poverty measures by increasing spending on primary schools and healthcare, while also raising defence budget by 7.8%."], "stablelm-zephyr:3b": ["India's Finance Minister, Palaniappan Chidambaram, presented a budget focused on fighting poverty and keeping the government's Communist allies happy.", "The Indian economy grew 6.9% in 2004, and spending on primary education increased by 71.56 billion rupees ($1.6bn), while health spending rose to 102.8 billion rupees ($2.35bn).", "Chidambaram also pledged 80 billion rupees ($1.8bn) for rural infrastructure development and 100 billion rupees ($2.3bn) for tsunami victims, increased agricultural funding by 30%, and announced a package for the sugar industry.", "The budget included plans to restructure India's tax system while expanding the tax base and borrowing against foreign exchange reserves to keep spending under control.", "Chidambaram faced pressure from Communist parties to focus on social spending but was committed to continuing economic reforms, including labor law reforms and easing restrictions on foreign investment for long-term growth."], "chatgpt-4o-latest": ["India's budget prioritizes poverty reduction, increasing spending on primary education, healthcare, rural infrastructure, and agriculture while also allocating funds for tsunami victims.", "The defense budget rises by 7.8% to 830bn rupees.", "Finance Minister Palaniappan Chidambaram must balance social spending with fiscal responsibility, as a new law mandates deficit reduction.", "The 2005-06 deficit target of 4.3% exceeds the law's requirement, but he warns against excessive spending.", "Tax reforms include expanding the tax base, reducing corporate tax rates, and adjusting income tax thresholds.", "The government faces pressure from Communist allies to boost social spending while resisting foreign investment and labor reforms.", "Despite economic growth of 6.9% in 2004, challenges remain in balancing fiscal prudence with social commitments."], "stablelm2:1.6b": ["India announces an anti-poverty budget with increased spending on primary schools, health, and rural infrastructure.", "Finance Minister Palaniappan Chidambaram prioritizes fighting poverty to keep his government's allies on board while following a new law that requires him to cut the budget deficit to 4.5% of GDP by year-end.", "The budget also includes funds for tsunami victims, increased agriculture spending, and infrastructure borrowing to source up to $2.3bn in spending.", "The Indian economy reportedly grew 6.9% in 2010."], "granite3.1-dense:2b": ["India has unveiled its 2005-6 budget, prioritizing anti-poverty measures and social spending.", "Finance Minister Palaniappan Chidambaram increased funding for primary education (71.56bn rupees or $1.6bn), healthcare (102.8bn rupees or $2.35bn), rural infrastructure ($80bn or $1.8bn), tsunami relief ($102.16bn or $2.3bn), and agriculture by 30%.", "The budget also allotted up to 100bn rupees for infrastructure, to be financed through borrowing against foreign exchange reserves.", "Despite a new law mandating a yearly deficit reduction of 0.3 percentage points, Chidambaram met this target in the current budget but fell short of the 4.5% cap due to increased poverty spending.", "The overall deficit is estimated to be over 10%, including state and territorial expenditure.", "Chidambaram emphasized that these fiscal priorities aim to combat poverty, as per the Congress Party's election promise of \"human face\" economic reforms.", "He announced duty cuts for capital goods and raw materials, expanded service tax coverage, raised income-tax thresholds, and reduced corporate tax rates to 30%.", "The finance minister is under pressure from Communist allies to focus on social spending rather than economic reforms like foreign investment liberalization and labor law changes.", "In his last budget, Chidambaram had pledged substantial investments in education, healthcare for the poor, and agricultural support."]}