{"raw_text": "Verizon 'seals takeover of MCI'\n \n Verizon has won a takeover battle for US phone firm MCI with a bid worth $6.8bn (£3.6bn), reports say.\n \n The two firms are expected to seal the deal on Monday morning, according to news agency reports, despite what was thought to be a higher bid from Qwest. The US telecoms market is consolidating fast, with former long-distance giant AT&T being bought by former subsidiary SBC earlier this year for $16bn. MCI exited bankruptcy in April, having gone bust under previous name WorldCom. The bankruptcy followed its admission in 2002 that it illegally booked expenses and inflated profits.\n \n Shareholders lost about $180bn when the company collapsed, while 20,000 workers lost their jobs. Former Worldcom boss Bernie Ebbers is currently on trial, accused of overseeing an $11bn fraud. Qwest has itself come under suspicion of sub-standard behaviour, paying the Securities and Exchange Commission $250m in October to settle charges that it manipulated its results to keep Wall Street happy.\n \n MCI is the US's second-biggest long distance firm after AT&T. Consolidation in the US telecommunications industry has picked up in the past few months as companies look to cut costs and boost client bases. A merger between MCI and Verizon would be the fifth billion-dollar telecoms deal since October. Last week, SBC Communications agreed to buy its former parent and phone trailblazer AT&T for about $16bn. Buying MCI would give either Qwest or Verizon access to MCI's global network and business-based subscribers. The rationale is similar to the one underpinning SBC's AT&T deal. Verizon is by far the bigger company and has its own successful mobile arm - factors which may have swung the board in its favour since both suitors are offering a mixture of cash and shares.\n", "llama3.2:1b": ["Verizon has won a $6.8 billion takeover bid for US phone firm MCI, reports say, after a bidding war with Qwest.", "MCI is the second-largest long distance company in the US after AT&T.", "The deal is expected to be finalized on Monday morning."], "llama3.2:3b": ["Verizon wins takeover battle for US phone firm MCI with a $6.8bn bid, despite reports of a higher bid from Qwest.", "The deal is expected to be finalized on Monday morning.", "Shareholders lost $180bn in the 2002 collapse of WorldCom, and Qwest has faced regulatory charges over manipulating its results.", "The merger would give Verizon access to MCI's global network and business-based subscribers, making it the fifth billion-dollar telecoms deal since October."], "gemma2:2b": ["Verizon acquired MCI for $6.8 billion.", "This follows Qwest's bid, despite the latter being considered to be higher.", "The deal signifies consolidation within the US telecommunications industry.", "Several other high-value telecom mergers have occurred recently, leading to cost reduction and increased client base opportunities."], "qwen2.5:0.5b": ["Verizon successfully sealed the takeover bid for MCI with a $6.8 billion acquisition deal, expected to close on Monday morning.", "This marks the fifth largest telecoms deal after AT&T, SBC, AT&T/ATV Communications, and Qwest.", "The merger would allow either Qwest or Verizon access to MCI's global network and MCI's business-based subscribers."], "qwen2.5:1.5b": ["Verizon has won $6.", "8 billion bid for MCI, likely completing the acquisition on Monday amid high bidding from Qwest; US telecoms market consolidating fast with AT&T/SBC merger, former bankrupt WorldCom bankruptcy and Verizon/Qwest/AT&T/MCI consolidation plans affecting future industry dynamics."], "qwen2.5:3b": ["Verizon has won a $6.8bn takeover bid for US phone firm MCI, sealing a deal expected on Monday despite a higher offer from Qwest.", "MCI exited bankruptcy after going bust under the former name WorldCom in 2002 amid fraud allegations.", "Former Worldcom boss Bernie Ebbers is currently on trial for overseeing an $11bn fraud.", "The telecoms industry consolidation has accelerated with SBC Communications buying AT&T.", "A merger between MCI and Verizon, by far the bigger company, would provide access to MCI's global network and business-based subscribers."], "opencoder:1.5b": ["Verizon has won the takeover battle for MCI with a bid worth $6.8bn (£3.6bn).", "US telecoms market is consolidating fast, former long-distance giant AT&T being bought by former subsidiary SBC earlier this year for $16bn.", "MCI exited bankruptcy in April, having gone bust under previous name WorldCom.", "Shareholders lost about $180bn when the company collapsed, while 20,000 workers lost their jobs.", "Former Worldcom boss Bernie Ebbers is currently on trial.", "Qwest has also been substandard in the past few months, charging the Securities and Exchange Commission $250m to settle charges.", "MCI agrees to buy its former parent and phone trailblazer AT&T for about $16bn.", "The merger would give access to both companies' global networks and business-based subscribers.", "The rationale behind the merger is similar to AT&T's deal with SBC."], "smollm:1.7b": ["Verizon has won a takeover battle for US phone firm MCI with a bid worth $6.8bn (£3.6bn).", "Reports say.", "The two firms are expected to seal the deal on Monday morning, according to news agency reports, despite what was thought to be a higher bid from Qwest.", "The US telecoms market is consolidating fast, with former long-distance giant AT&T being bought by former subsidiary SBC earlier this year for $16bn.", "MCI exited bankruptcy in April, having gone bust under previous name WorldCom.", "The bankruptcy followed its admission in 2002 that it illegally booked expenses and inflated profits.", "Shareholders lost about $180bn when the company collapsed, while 20,000 workers lost their jobs.", "Former Worldcom boss Bernie Ebbers is currently on trial, accused of overseeing an $11bn fraud.", "Qwest has itself come under suspicion of sub-standard behaviour, paying the Securities and Exchange Commission $250m in October to settle charges that it manipulated its results to keep Wall Street happy.", "MCI is the US's second-biggest long distance firm after AT&T.", "Consolidation in the US telecommunications industry has picked up in the past few months as companies look to cut costs and boost client bases.", "A merger between MCI and Verizon would be the fifth billion-dollar telecoms deal since October.", "Last week, SBC Communications agreed to buy its former parent and phone trailblazer AT&T for about $16bn.", "Buying MCI would give either company access to MCI's global network and business-based subscribers.", "The rationale is similar to the one underpinning SBC's AT&T deal.", "Verizon is by far the bigger company and has its own successful mobile arm - factors which may have swung the board in its favour since both suitors are offering a mixture of cash and shares."], "deepseek-r1:1.5b": ["verizon has won a takeover deal for mci, worth $6.8 billion, despite qwest offering a higher price.", "mci was bought out of bankruptcy after going bankrupt in 2002. mci is the second-largest long-distance firm after at&t.", "the merger would be the fifth billion-dollar telecom deal since october.", "the bid targets qwest or Verizon's global network and business-based subscribers, similar to sbc's at&t acquisition.", "qwest is under investigation for poor financial practices, as are both firms seeking consolidation.", "share holders lost around $180b, with 20k workers affected.", "bernie ebbers is on trial for fraud in mci's bankruptcy.", "the deal would be the first merger since october."], "tinyllama:1.1b": ["During a takeover battle, Verizon has reportedly won a bid worth $6.8bn (£3.6bn) for US phone firm MCI.", "The two firms are expected to merge on Monday morning, according to news reports citing a source close to the deal.", "The US telecoms market is consolidating rapidly as companies seek to boost client bases and cut costs.", "Former WorldCom boss Bernie Ebbers faces trial for fraud and manipulating financial results, while SBC Communications' proposed acquisition of its former parent and phone trailblazer AT&T has also been subject to scrutiny in the past few months."], "tinydolphin:1.1b": [" The takeover of MCI, a major US phone firm, has been reported to be worth $6.8bn (£3.6bn).", "This follows Qwest's bid, which was said to be higher than the one offered by rival Verizon.", "Both companies are expected to seal the deal on Monday morning, although reports suggest that MCI might end up selling its shares instead of receiving a cash offer.", "The merger would create one of the largest telecoms companies in the world and will have significant implications for the US market.", "If completed, it could lead to further consolidation and possibly result in more competitive bidding processes in the future.", "This could potentially benefit consumers as it may mean lower prices and more choices for their communication needs.", "However, potential shareholders might be concerned about potential losses due to an overly concentrated market.", "The decision on whether to accept a bid or sell shares has yet to be made by MCI's shareholders, who are expected to vote on the offer during a special shareholders' meeting in October.", "This vote will determine which company gains control of MCI and its $50bn worth of assets."], "phi:2.7b": [" Verizon won a takeover bid for MCI, US phone firm that went bankrupt due to fraud in 2002.", "The deal could be sealed soon with a higher bid from Qwest expected.", "The telecommunications industry is consolidating, with the second-biggest long distance firm after AT&T going bust under previous name WorldCom.", "A merger between MCI and Verizon would give them access to each other's network and subscribers."], "orca-mini:3b": [" Verizon won a bidding war for MCI with a $6.8 billion offer, reports say.", "The deal is expected to be sealed on Monday.", "Qwest offered a higher bid but was outbid.", "Consolidation in the US telecommunications industry has picked up recently as companies look to cut costs and boost client bases.", "A merger between MCI and Verizon would give either Qwest or Verizon access to MCI's global network and business-based subscribers.", "The rationale is similar to that underpinning SBC's AT&T deal.", "Verizon is the bigger company and has its own successful mobile arm, factors which may have swung the board in its favour."], "hermes3:3b": ["Verizon acquires MCI for $6.8bn takeover."], "stablelm-zephyr:3b": ["Verizon won the takeover battle for US phone firm MCI with a $6.8bn bid, expected to be finalized on Monday.", "This consolidation in the telecom industry is part of a trend seen in recent months as companies aim to cut costs and expand client bases.", "A merger between MCI and Verizon would make either Qwest or Verizon globally competitive through access to MCI's global network and business subscribers, with factors such as cash and shares influencing their respective bids."], "chatgpt-4o-latest": ["Verizon has won the takeover battle for US phone firm MCI with a $6.8 billion bid, despite a reportedly higher offer from Qwest.", "The deal is part of a wave of consolidation in the US telecom industry, following SBC's $16 billion acquisition of AT&T.", "MCI, formerly WorldCom, emerged from bankruptcy in April after a massive accounting scandal that led to shareholder losses of $180 billion and 20,000 job cuts.", "Former CEO Bernie Ebbers is on trial for overseeing an $11 billion fraud.", "Qwest has also faced scrutiny, settling charges of financial manipulation for $250 million.", "The merger with Verizon would be the fifth billion-dollar telecom deal since October, giving Verizon access to MCI’s global network and business clients.", "Verizon’s larger size and successful mobile division likely influenced MCI’s decision."], "stablelm2:1.6b": ["Verizon wins takeover of MCI with a $6.8bn bid, expected to be sealed on Monday after a previous Qwest offer.", "MCI's collapse resulted from fraudulent accounting practices led by former CEO Bernie Ebbers.", "A merger between Verizon and MCI would give access to their respective networks and subscribers.", "This consolidation is part of the US telecoms market's trend toward fewer large companies and more mergers."], "granite3.1-dense:2b": ["Verizon has agreed to acquire MCI, a US long-distance phone firm, for $6.8 billion, with the deal expected to be finalized on Monday.", "This takeover is part of a broader trend of consolidation in the US telecommunications industry, driven by companies seeking cost reduction and expanded client bases.", "Formerly known as WorldCom, MCI emerged from bankruptcy in April 2002 after admitting to fraudulent accounting practices that led to a $180 billion loss for shareholders and 20,000 job losses.", "Qwest had initially bid higher than Verizon but withdrew its offer.", "MCI is the second-largest long-distance provider in the US after AT&T.", "The acquisition would grant Verizon access to MCI's extensive global network and business subscribers, positioning it as a significant competitor in the market.", "Verizon's larger size and successful mobile division likely swayed the decision in its favor compared to Qwest.", "This deal marks the fifth billion-dollar telecoms transaction since October."]}