{"raw_text": "Crossrail link 'to get go-ahead'\n \n The £10bn Crossrail transport plan, backed by business groups, is to get the go-ahead this month, according to The Mail on Sunday.\n \n It says the UK Treasury has allocated £7.5bn ($13.99bn) for the project and that talks with business groups on raising the rest will begin shortly. The much delayed Crossrail Link Bill would provide for a fast cross-London rail link. The paper says it will go before the House of Commons on 23 February.\n \n A second reading could follow on 16 or 17 March. \"We've always said we are going to introduce a hybrid Bill for Crossrail in the Spring and this remains the case,\" the Department for Transport said on Sunday. Jeremy de Souza, a spokesman for Crossrail, said on Sunday he could not confirm whether the Treasury was planning to invest £7.5bn or when the bill would go before Parliament.\n \n However, he said some impetus may have been provided by the proximity of an election.\n \n The new line would go out as far as Maidenhead, Berkshire, to the west of London, and link Heathrow to Canary Wharf via the City. Heathrow to the City would take 40 minutes, dramatically cutting journey times for business travellers, and reducing overcrowding on the tube. The line has the support of the Mayor of London, Ken Livingstone, business groups and the government, but there have been three years of arguments over how it should be funded. The Mail on Sunday's Financial Mail said the £7.5bn of Treasury money was earmarked for spending in £2.5bn instalments in 2010, 2011 and 2012.\n", "llama3.2:1b": ["The UK Treasury has allocated £7.5 billion ($13.99 billion) for the Crossrail transport plan, which will go before the House of Commons on February 23.", "Talks with business groups to raise the remaining £2.5 billion will begin soon.", "A hybrid bill providing a fast cross-London rail link is being considered."], "llama3.2:3b": ["The UK government is set to allocate £7.5bn ($13.99bn) for the Crossrail project this month, with talks on raising the remaining funds expected to begin shortly.", "The much-delayed Crossrail Link Bill will be introduced before Parliament on February 23, with a second reading possible in March."], "gemma2:2b": ["Crossrail project will receive funding from UK Treasury.", "The £10 billion project is expected to go before Parliament as a hybrid bill this month.", "The bill will provide a cross-London rail link connecting Heathrow to Canary Wharf via the City, reducing travel time for business travellers and easing overcrowding on the tube."], "qwen2.5:0.5b": ["The £10 billion Crossrail project is now gaining approval after Business Secretary Ken Livingstone's support, but the full bill has not been finalized yet.", "The paper reports that talks with business groups are underway on raising additional funds.", "It will go before Parliament in February, and a second reading could follow by March 16 or 17."], "qwen2.5:1.5b": ["The £10bn Crossrail project backed by business groups aims to receive parliamentary approval this month, with the UK Treasury allocating £7.5bn ($13.99bn) for the scheme and talks on raising the remaining funds starting shortly.", "The Crossrail Link Bill would provide a fast cross-London rail link connecting Maidenhead in Berkshire to Heathrow via Canary Wharf, expected to shorten business travelers' time from 40 minutes to just 20-25 minutes by reducing overcrowding on the tube and cutting journey times.", "The project has the support of the Mayor of London, Ken Livingstone, business groups, and government but faces three years of debates over funding."], "qwen2.5:3b": ["Crossrail Link plan, backed by business groups, is set to receive approval this month according to The Mail on Sunday.", "The UK Treasury has allocated £7.5bn for the project with talks underway to raise the rest.", "A draft bill will be considered in February and March.", "Crossrail would extend from Heathrow to Canary Wharf via the City of London, reducing journey times for business travelers and alleviating tube overcrowding.", "Support comes from Mayor of London Ken Livingstone, business groups, and government.", "Arguments have centered around funding, but there are reports the Treasury is planning to invest £7.5bn in three-year instalments starting 2010."], "opencoder:1.5b": ["The Crossrail transport plan, backed by business groups, is to get the go-ahead this month according to The Mail on Sunday.", "The Treasury has allocated £7.5bn for the project and talks with business groups on raising the rest will begin shortly.", "A second reading could follow on 16 or 17 March.", "The paper says it will go before the House of Commons on 23 February.", "Jeremy de Souza, a spokesman for Crossrail, said he could not confirm whether the Treasury was planning to invest £7.5bn or when the bill would go before Parliament.", "However, he said some impetus may have been provided by the proximity of an election.", "The new line would go out as far as Maidenhead, Berkshire, to the west of London, and link Heathrow to Canary Wharf via the City.", "The costs were earmarked for 20 years in 2011 and 2012."], "smollm:1.7b": ["The Crossrail link is expected to get the go-ahead this month, according to The Mail on Sunday.", "The project has been delayed by three years due to disagreements over funding and other issues.", "The UK Treasury has allocated £7.5bn for the project and that money will be used to finance the construction of the cross-London rail link.", "Business groups have been pushing for a faster implementation of the Crossrail Link Bill, which would provide for the fast construction of the link.", "The paper says talks with business groups on raising the rest of the £10bn needed to build the link will begin shortly.", "The second reading could follow on 23 February in the House of Commons.", "Jeremy de Souza, a spokesperson for Crossrail, said on Sunday he could not confirm whether the Treasury was planning to invest £7.5bn or when the bill would go before Parliament.", "However, he said some impetus may have been provided by the proximity of an election.", "The new line would go out as far as Maidenhead, Berkshire, to the west of London, and link Heathrow to Canary Wharf via the City.", "Heathrow to the City would take 40 minutes, dramatically cutting journey times for business travellers, and reducing overcrowding on the tube.", "The line has the support of the Mayor of London, Ken Livingstone, business groups and the government, but there have been three years of arguments over how it should be funded.", "The Mail on Sunday's Financial Mail said the £7.5bn of Treasury money was earmarked for spending in £2.5bn instalments in 2010, 2011 and 2012."], "deepseek-r1:1.5b": ["The UK announced a £10bn Crossrail transport plan, known as the \"Hybrid Bill,\" with £7.5bn allocated for part of its development.", "The government will introduce hybrid spending in three equal installments over five years, aiming to link London and other major hubs.", "The project is set to go before the House of Commons on 23 February and may follow up on 16 or 17 March.", "The line extends from Maidenhead, Berkshire, across London to connect Heathrow with Canary Wharf via the City.", "It offers fast rail connections reducing travel times by 40 minutes for business travelers, with significant improvements in overcrowding on the tube.", "Funding details remain unclear, but the plan will be supported by the Mayor of London, business groups, and government."], "tinyllama:1.1b": ["Presenting a summary of the recent news regarding the CrossraiL transport plan, which involves a fast rail link connecting Heathrow to Canary Wharf, the UK Treasury has allocated £7.5bn ($13.99bn) for the project and intends to raise the remaining funding through business groups.", "The passage mentions that the second reading of the CrossraiL Bill will take place in the Spring.", "Impetuosity has been mentioned as an explanation for the proximity of a possible election, but no further details on how it could affect investment or timelines are provided.", "The passage suggests that the Mayor of London, Ken Livingstone, and business groups have expressed support for CrossraiL's benefits to business travelers, while the government has been providing funding in advance.", "The project has been plagued by debates over its funding but is now expected to be completed within three years."], "tinydolphin:1.1b": [" Crossrail, a massive transportation project, has gotten the go-ahead from the UK Treasury, according to The Mail on Sunday.", "It will be funded by £7.5bn ($13.99bn) and fast rail links are expected to connect Heathrow Airport with Canary Wharf via the City.", "Crossrail Link Bill is expected to go before Parliament in the Spring, as mentioned by the Department for Transport, while a second reading could follow on 16 or 17 March.", "The bill will introduce a hybrid bill and is supported by business groups and the government.", "However, there may have been an element of pressure for investment from an election timing."], "phi:2.7b": [" The Crossrail transport plan will receive the go-ahead this month with the support of business groups and the UK Treasury allocating a budget of £7.5 billion.", "Talks to raise more funding for the project will begin soon, and the bill will be introduced in the House of Commons on February 23rd.", "A second reading could take place on March 16th or 17th.", "The new line would connect Heathrow to Canary Wharf via the City, significantly reducing journey times for business travelers and relieving overcrowding on the tube.", "There have been three years of funding arguments over this project."], "orca-mini:3b": [" Crossrail is set to receive the go-ahead this month after three years of arguments over funding.", "The much delayed transport plan would link London's Heathrow airport with the City of London and reduce overcrowding on the tube."], "hermes3:3b": ["Crossrail transport plan to get approval, UK Treasury allocates £7.5b ($13.99b) for project."], "stablelm-zephyr:3b": ["The UK Treasury is reportedly allocating £7.5bn ($13.99bn) for the Crossrail project, which aims to provide a fast cross-London rail link backed by business groups, the Mayor of London, and the government.", "The remaining funding will be raised through talks with these entities.", "The Department for Transport plans to introduce a hybrid Bill in the Spring.", "If approved, the line would extend from Maidenhead, Berkshire, to Canary Wharf via Heathrow and reduce journey times for business travelers while addressing overcrowding on the Tube."], "chatgpt-4o-latest": ["The £10bn Crossrail transport project is expected to receive approval this month, with the UK Treasury allocating £7.5bn and discussions with business groups set to begin to raise the remaining funds.", "The long-delayed Crossrail Link Bill, which would establish a fast rail link across London, is scheduled to go before the House of Commons on 23 February, with a second reading possible in mid-March.", "The new line would extend to Maidenhead, linking Heathrow to Canary Wharf via the City, significantly reducing travel times and easing tube congestion.", "While the Department for Transport confirmed plans for a hybrid bill in the spring, Crossrail spokesman Jeremy de Souza could not confirm Treasury funding details.", "The project has support from the Mayor of London, business groups, and the government, though funding disputes have delayed progress.", "Treasury funds are reportedly planned for release in £2.5bn instalments between 2010 and 2012."], "stablelm2:1.6b": ["The £7.5 billion Crossrail project will receive its official go-ahead this month after the UK Treasury allocated the funds.", "Business groups are expected to raise the remaining amount.", "The much delayed bill would authorize a fast cross-London rail link between Heathrow, Canary Wharf, and London.", "The new line will stretch from Maidenhead in Berkshire west of London, cutting journey times for business travelers and reducing overcrowding on the tube.", "Crossrail has support from London's Mayor, Ken Livingstone, as well as business groups and the government, but funding disagreements have led to delays."], "granite3.1-dense:2b": ["The UK is set to approve a £10 billion Crossrail project, backed by business groups, government, and the Mayor of London.", "This significant investment includes £7.5 billion from the Treasury, allocated in three equal parts ($4.53bn each) for 2010, 2011, and 2012.", "The project aims to create a fast cross-London rail link, extending from Maidenhead, Berkshire, to Heathrow and the City of London, reducing travel time between these areas by 40 minutes.", "Despite uncertainty from Crossrail spokesman Jeremy de Souza regarding exact details, the proposal is expected to proceed with a hybrid Bill in early March, potentially gaining momentum due to an upcoming election."]}