{"raw_text": "Brewers' profits lose their fizz\n \n Heineken and Carlsberg, two of the world's largest brewers, have reported falling profits after beer sales in western Europe fell flat.\n \n Dutch firm Heineken saw its annual profits drop 33% and warned that earnings in 2005 may also slide. Danish brewer Carlsberg suffered a 3% fall in profits due to waning demand and increased marketing costs. Both are looking to Russia and China to provide future growth as western European markets are largely mature.\n \n Heineken's net income fell to 537m euros ($701m; £371m) during 2004, from 798m euro a year ago. It blamed weak demand in western Europe and currency losses. It had warned in September that the weakening US dollar, which has cut the value of foreign sales, would knock 125m euros off its operating profits. Despite the dip in profits, Heineken's sales have been improving and total revenue for the year was 10bn euros, up 8.1% from 9.26bn euros in 2003. Heineken said it now plans to invest 100m euros in \"aggressive\" and \"high-impact\" marketing in Europe and the US in 2005. Heineken, which also owns the Amstel and Murphy's stout brands, said it would also seek to cut costs. This may involve closing down breweries.\n \n Heineken increased its dividend payment by 25% to 40 euro cents, but warned that the continued impact of a weaker dollar and an increased marketing spend may lead to a drop in 2005 net profit.\n \n Carlsberg, the world's fifth-largest brewer, saw annual pre-tax profits fall to 3.4bn Danish kroner (456m euros). Its beer sales have been affected by the sluggish European economy and by the banning of smoking in pubs in several European countries. Nevertheless, total sales increased 4% to 36bn kroner, thanks to strong sales of Carlsberg lager in Russia and Poland. Carlsberg is more optimistic than Heineken about 2005, projecting a 15% rise in net profits for the year. However, it also plans to cut 200 jobs in Sweden, where sales have been hit by demand for cheap, imported brands. \"We remain cautious about the medium-to-long term outlook for revenue growth across western Europe for a host of economic, social and structural reasons,\" investment bank Merrill Lynch said of Carlsberg.\n", "llama3.2:1b": ["Heineken's annual profits fell 33% to $701m in 2004 due to declining beer sales in western Europe and increased marketing costs.", "The company plans to cut costs by closing down breweries, increasing its dividend payment, but warns that the continued impact of a weaker dollar may lead to a drop in net profit.", "Carlsberg's annual profits fell 15% to $456m in 2004 due to sluggish European economy and banning of smoking in pubs.", "The company projects a 15% rise in net profits for 2005, despite plans to cut 200 jobs in Sweden where sales have been hit by demand for cheap brands.", "Both companies face challenges from declining beer sales and increasing marketing costs, but Carlsberg is more optimistic about the future."], "llama3.2:3b": ["Heineken's annual profits dropped 33% due to weak demand in western Europe and currency losses.", "Carlsberg saw a 3% fall in profits, blaming waning demand and increased marketing costs.", "Both brewers are looking to Russia and China for growth, with Heineken investing 100m euros in European and US marketing and Carlsberg projecting a 15% rise in net profits despite plans to cut 200 jobs in Sweden."], "gemma2:2b": ["Heineken's profits fell 33% due to weak demand in Western Europe and currency losses.", "Carlsberg suffered a 3% decline in profits due to declining beer sales and increased marketing costs.", "Both companies are seeking growth in Russia and China.", "Despite the dip in profits, Heineken plans aggressive marketing and cost-cutting measures.", "Carlsberg is more optimistic about 2005, projecting a 15% rise in net profits.", "Both companies are facing challenges from economic downturns, changing regulations, and competition."], "qwen2.5:0.5b": ["In recent years, Heineken and Carlsberg have reported falling profits in their respective markets after beer sales in Western Europe declined significantly.", "Both companies are looking to increase their marketing efforts in Russia and China as western European markets are generally mature.", "However, both breweries' net income has dropped due to weak demand, currency losses, and increased marketing costs.", "Heineken plans to invest 100 million euros in Europe and the US in aggressive and high-impact marketing efforts and may also consider closing down some of its breweries.", "Carlsberg's annual pre-tax profits have fallen slightly since 2003 despite strong sales in Russia and Poland, but it is projecting a 15% rise for the year.", "It plans to cut 200 jobs in Sweden due to weaker demand for cheap, imported brands."], "qwen2.5:1.5b": ["Brewer profits decline due to weak beer sales in Western Europe, with companies targeting markets outside the region for future growth."], "qwen2.5:3b": ["Heineken and Carlsberg, two major brewers, reported falling profits due to weak beer sales in Western Europe.", "Heineken saw its annual profits drop 33% with earnings likely to slide further in 2005.", "Blaming currency losses and weakened demand, it plans aggressive marketing and cost-cutting measures in the region and US.", "Despite profit dip, revenue rose by 8.1%.", "The company increased dividends but warned of potential drop due to weakening dollar and higher marketing spend.", "Carlsberg saw a 3% fall in profits, affected by waning European demand and rising costs.", "However, it expects a 15% increase in net profits for 2005, boosted by strong sales in Russia and Poland.", "Carlsberg plans to cut 200 jobs in Sweden where sales have fallen due to cheaper imported brands.", "Investment bank Merrill Lynch warned of caution regarding Western Europe’s revenue growth amid economic, social, and structural challenges."], "opencoder:1.5b": ["Brewers' profits lose their fizz\n\nHeineken and Carlsberg, two of the world's largest brewers, have reported falling profits after beer sales in western Europe fell flat.", "Both Dutch firm Heineken saw its annual profits drop 33% and warned that earnings in 2005 may also slide.", "Danish brewer Carlsberg suffered a 3% fall in profits due to waning demand and increased marketing costs.", "Both are looking to Russia and China to provide future growth as western European markets are largely mature.", "Heineken's net income fell to 537m euros ($701m; £371m) during 2004, from 798m euro a year ago.", "It blamed weak demand in western Europe and currency losses.", "It had warned in September that the weakening US dollar, which has cut the value of foreign sales, would knock 125m euros off its operating profits.", "Despite the dip in profits, Heineken's sales have been improving and total revenue for the year was 10bn euros, up 8.1% from 9.26bn euros in 2003.", "Heineken said it now plans to invest 100m euros in \"aggressive\" and \"high-impact\" marketing in Europe and the US in 2005.", "Heineken increased its dividend payment by 25% to 40 euro cents, but warned that the continued impact of a weaker dollar and an increased marketing spend may lead to a drop in 2005 net profit.", "Carlsberg, the world's fifth-largest brewer, saw annual pre-tax profits fall to 3.4bn Danish kroner (456m euros).", "Its beer sales have been affected by the sluggish European economy and by the banning of smoking in pubs in several European countries.", "Nevertheless, total sales increased 4% to 36bn kroner, thanks to strong sales of Carlsberg lager in Russia and Poland.", "Carlsberg is more optimistic than Heineken about 2005, projecting a 15% rise in net profits for the year.", "However, it also plans to cut 200 jobs in Sweden, where sales have been hit by demand for cheap, imported brands.", "\"We remain cautious about the medium-to-long term outlook for revenue growth across western Europe for a host of economic, social and structural reasons,\" investment bank Merrill Lynch said of Carlsberg."], "smollm:1.7b": ["The summary is concise and to the point, preserving key ideas and details from the original text.", "It captures the main points:\n\n1.", "Heineken's profits lost 33% in 2004 compared to 798m euro a year ago.", "2.", "Carlsberg saw its annual pre-tax profits fall by 3.4bn Danish kroner (456m euros) due to weaker demand and increased marketing costs.", "3.", "Heineken's net income fell to 537m euros in 2004, from 798m euro a year ago.", "4.", "Carlsberg's net income also declined by 33% in 2004 compared to 10bn euros in 2003.", "5.", "Heineken increased its dividend payment by 25% to 40 euro cents, but warned that the continued impact of a weaker dollar and an increased marketing spend may lead to a drop in 2005 net profit.", "6.", "Carlsberg saw annual pre-tax profits fall by 15% in 2005 compared to 36bn kroner in 2004.", "7.", "Carlsberg is more optimistic than Heineken about 2005, projecting a 15% rise in net profit for the year.", "8.", "Carlsberg also plans to cut 200 jobs in Sweden due to demand for cheap, imported brands."], "deepseek-r1:1.5b": ["Heineken and Carlsberg reported lower profits post-beer sales in Western Europe.", "Heineken fell 33% and warned of weaker demand, increased marketing costs, while Carlsberg saw a 3% drop.", "Both were considering growth in Russia-China but planned to reduce jobs in Sweden due to low demand for imported brands."], "tinyllama:1.1b": ["Brewers' profits lose their fizz as Danish firm Heineken reports falling sales in western Europe; rival Carlsbberg sees strong growth despite sluggish European economy and smoking ban, but also plans to cut jobs in Sweden."], "tinydolphin:1.1b": [" Brewers' profits are in decline after beer sales in Western Europe dropped flat, according to industry reports.", "This is primarily attributed to waning demand and increased marketing costs for both Heineken and Carlsberg.", "Despite these challenges, the companies are seeking ways to maintain revenue growth in 2005 by investing in marketing efforts and cutting expenses.", "However, they expect their profits will continue to decline due to currency losses and potential slowdown in the global economy."], "phi:2.7b": [" Heineken and Carlsberg's profits in western Europe fell after beer sales declined flatly.", "Heineken reported lower annual profits of 537m euros while Carlsberg saw its profits fall by 3% due to reduced demand and increased marketing costs.", "Both companies are looking to Russia and China for future growth as western European markets are mature, but Heineken's net income dropped to"], "orca-mini:3b": [" Heineken and Carlsberg, two of the largest brewers in the world, have reported falling profits due to weak beer sales in western Europe.", "While Heineken's net income dropped 33% due to currency losses and weakening demand, Carlsberg suffered a 3% fall in profits due to the sluggish European economy and smoking bans in several countries.", "Both companies are looking to Russia and China for future growth, as western European markets are largely mature.", "Heineken increased its dividend payment by 25%, but warned that continued currency losses and increased marketing costs may lead to a drop in net profit in 2005.", "Carlsberg saw annual pre-tax profits fall to 3.4bn Danish kroner, but total sales increased 4% thanks to strong beer sales in Russia and Poland.", "However, they remain cautious about the medium-to-long term outlook for revenue growth across western Europe due to economic, social, and structural reasons."], "hermes3:3b": ["Heineken & Carlsberg report decreased profits due to falling beer sales in western Europe.", "Both firms look to Russia & China for future growth."], "stablelm-zephyr:3b": ["Heineken and Carlsberg, two major brewers, reported a drop in profits due to stagnant beer sales in western Europe.", "Heineken's net income decreased by 33% to 537 million euros, while Carlsberg saw a 3% fall in profits.", "Both companies attribute the decline to weak demand and currency losses; however, they remain hopeful for future growth in Russia and China.", "To adapt, Heineken plans 100 million euros in increased marketing spending and cost-cutting measures potentially involving closing breweries, while Carlsberg projects a 15% rise in net profits for 2005 but also plans job cuts in Sweden."], "chatgpt-4o-latest": ["Heineken and Carlsberg reported declining profits due to weak beer sales in Western Europe.", "Heineken's net income fell 33% to 537 million euros in 2004, citing weak demand and currency losses, despite an 8.1% rise in total revenue.", "It plans to invest 100 million euros in aggressive marketing and cut costs, possibly by closing breweries.", "Carlsberg's pre-tax profits dropped 3% to 3.4 billion Danish kroner, impacted by a sluggish economy and smoking bans, though total sales rose 4% due to strong demand in Russia and Poland.", "Carlsberg expects a 15% profit rise in 2005 but will cut 200 jobs in Sweden.", "Both brewers are looking to Russia and China for future growth."], "stablelm2:1.6b": ["Heineken and Carlsberg, two major brewers in Europe, reported falling profits due to weak demand and increased marketing costs.", "Both are seeking growth in Russia and China.", "Heineken's net income dropped 3% to €15m ($15m; £14m), while Carlsberg saw pre-tax profits fall 4% to €3.4bn ($3.4bn).", "However, both companies expect to grow their earnings by a projected 10-20% in the coming years after investing heavily into marketing and expanding into new markets."], "granite3.1-dense:2b": ["Heineken and Carlsberg, two major global brewers, experienced declining profits in 2004 due to weak demand in western European markets, which have become mature.", "Heineken's net income fell by 33% to 537m euros, impacted by a weakening US dollar and currency losses.", "Despite this, total revenue increased 8.1% to 10bn euros.", "Heineken plans to invest 100m euros in marketing for Europe and the US, potentially leading to cost cuts via brewsery closures.", "The company also raised its dividend by 25%, but warned of potential profit drops due to a weaker dollar and increased spending on marketing.", "Carlsberg's annual pre-tax profits dropped 3% to 456m euros, primarily attributed to the sluggish European economy and bans on smoking in pubs.", "Total sales rose 4% to 36bn Danish kroner, driven by strong Carlsberg lager sales in Russia and Poland.", "Carlsberg projects a 15% increase in net profits for 2005 but anticipates cutting 200 jobs in Sweden due to increased competition from cheaper imports.", "Investment bank Merrill Lynch expressed cautious optimism about western Europe's long-term revenue growth, citing economic, social, and structural factors as key concerns."]}