{"raw_text": "Yangtze Electric's profits double\n \n Yangtze Electric Power, the operator of China's Three Gorges Dam, has said its profits more than doubled in 2004.\n \n The firm has benefited from increased demand for electricity at a time when power shortages have hit cities and provinces across the country. As a hydroelectric-power generator it has not been hurt by higher coal costs. Net income jumped to 3bn yuan in 2004 ($365m; £190m), compared with 1.4bn yuan in 2003. Sales surged to 6.2bn yuan, from 3bn yuan a year earlier. The figures topped analysts expectations, even though the rate of growth has slowed from 2003. Analysts forecast that it is likely to decline further this year to a rate of expansion of closer to 20%.\n \n Yangtze Electric has been expanding its output to meet demand driven by China's booming economy. The government has delayed the building of a number of power plants in an effort to rein in growth amid concerns that the economy may overheat. That has led to an energy crunch, with demand outstripping supply. Earlier this month, work was halted on an underground power station, and a supply unit on the Three Gorges Dam, as well as a power station on its sister Xiluodu dam because of environmental worries. A total of 30 large-scale projects have been halted across the country for similar reasons. The Three Gorges Dam project has led to more than half a million people being relocated and drawn criticism from environmental groups and overseas human rights activists. Its sister project, the Xiluodu Dam, is being built on the Jinshajiang - or \"river of golden sand\" as the upper reaches of the Yangtze are known.\n", "llama3.2:1b": ["Yangtze Electric Power's profits doubled in 2004 to 3 billion yuan, surpassing forecasts for a year ahead despite slowing growth rates and increased demand across China."], "llama3.2:3b": ["Yangtze Electric Power's profits more than doubled in 2004 to 3bn yuan due to increased demand for electricity amid power shortages.", "Sales surged to 6.2bn yuan, beating analyst expectations, but growth rate is expected to slow and potentially decline this year."], "gemma2:2b": ["Yangtze Electric's profits more than doubled in 2004, driven by increased demand for electricity due to China's booming economy and power shortages.", "The company benefited from its hydroelectric power generation and saw sales surge while analysts anticipate a decline in growth this year."], "qwen2.5:0.5b": ["Yangtze Electric Power's profits more than doubled in 2004.", "The company has benefited from increased demand for electricity due to China's booming economy and a rise in power shortages.", "In 2004, its net income reached 3 billion yuan, up from 1.4 billion yuan the previous year.", "Sales were $6.2 billion, compared to $3 billion a year earlier.", "Analysts expect Yangtze Electric to lose some of this growth due to energy crunch and increased competition in the market."], "qwen2.5:1.5b": ["Yangtze Electric's profits nearly doubled in 2004 due to increased electricity demand and reduced coal costs while expanding operations to meet China's booming economy, despite slowed growth rates."], "qwen2.5:3b": ["Yangtze Electric Power's profits doubled in 2004 to 3bn yuan ($365m; £190m), up from 1.4bn yuan in 2003, driven by increased electricity demand and its hydroelectric business resilience against coal price hikes.", "Sales grew to 6.2bn yuan compared to 3bn yuan a year prior.", "Analysts expected further decline in growth rate this year to around 20%.", "The company is expanding output to meet the economy's growing demand despite government efforts to control growth due to environmental concerns and economic overheating fears.", "Several large-scale projects have been halted, including on the Three Gorges Dam and Xiluodu Dam, leading to mass resettlement of over half a million people and criticisms from various groups."], "opencoder:1.5b": ["Yangtze Electric Power has doubled its profits in 2004, having received more than increased demand for electricity at a time when power shortages hit cities and provinces across the country.", "Despite higher coal costs, it managed to make significant profit from increased energy consumption driven by China's booming economy.", "With net income growing up to 3bn yuan ($365m; £190m) compared with 1.4bn yuan in 2003, sales surged to 6.2bn yuan.", "The figures topped analysts expectations due to the rate of growth slowing from 2003.", "Analysts predict that it is likely to decrease further this year as expansion amid growing economy can lead to heat-related problems for the government.", "The Three Gorges Dam project has led to more people being relocated and expressed concerns about environmental conditions, as well as human rights violations in several countries."], "smollm:1.7b": ["The summary should be: Yangtze Electric's profits double in 2004 due to increased demand for electricity at a time when power shortages have hit cities and provinces across the country, leading to higher coal costs.", "The firm has benefited from its hydroelectric-power generator business, which is not affected by rising coal prices.", "Sales surged to 6.2bn yuan in 2004, exceeding analyst expectations, while net income jumped to 3bn yuan in 2004 compared with 1.4bn yuan in 2003.", "Analysts forecast that Yangtze Electric's profits will likely decline further this year due to the rate of growth slowing down from 2003."], "deepseek-r1:1.5b": ["Yangtze Electric's profits doubled in 2004, as the company, operator of China's Three Gorges Dam, benefited from increased electricity demand during periods of power shortages while avoiding higher coal costs due to its hydroelectric nature.", "In 2004, Yangtze Electric reported net income of 3 billion yuan (USD $365 million; £190 million) compared to 1.4 billion yuan in 2003.", "Sales reached 6.2 billion yuan, reflecting a significant growth from 3 billion yuan the previous year.", "Analysts expect around a 20% growth rate but are projecting further decline this year.", "The company has expanded output amid China's booming economy and government delays in building power projects.", "Many projects were halted due to supply shortages and environmental concerns, such as work halts on the Three Gorges Dam and Xiluodu Dam.", "Approximately 30 large-scale projects were halted across the country, leading to a surge in relocation for people living near the Yangtze River."], "tinyllama:1.1b": ["Yangtze Electric's earnings nearly doubled in 2004, with net income surging to 3bn yuan compared to 1.4bn yuan in 2003.", "The firm reported sales of 6.2bn yuan in 2004, a significant increase from the year before.", "Analysts expect further growth this year as demand for electricity continues to grow, driven by China's economic boom.", "However, concerns over environmental issues and power shortages have led to projects being halted across the country, including large-scale projects on the Three Gorges Dam project and its sister Xiluo Du dam."], "tinydolphin:1.1b": [" The text provided provides an overview of Yangtze Electric Power's profits doubling in 2004 due to increased demand for electricity at a time when power shortages have hit cities and provinces across China.", "Analysts had forecasted that the company would decline further this year but instead saw its revenue grow by almost 50%.", "The growth in demand can be attributed to China's economic boom, which has led to an energy crunch.", "The halt of large-scale projects for both power stations and dams is due to environmental concerns and has caused many relocations and problems with the environment."], "phi:2.7b": [" Yangtze Electric Power's profits more than doubled in 2004 due to increased demand for electricity and their status as a hydroelectric power generator, despite higher coal costs.", "The company has been expanding its output and is forecasted to continue growing at a rate of expansion of 20% this year.", "However, the government's efforts to rein in growth have led to an energy crisis with concerns that China's economy may overheat.", "Yangtze Electric's Three Gorges Dam project has faced criticism from environmental groups and human rights activists for relocating more than half a million people."], "orca-mini:3b": [" Yangtze Electric's profits doubled in 2004 due to increased demand for electricity and the company's hydroelectric-power generation not being hurt by higher coal costs.", "Sales and net income grew to 6.2bn yuan and 3bn yuan, respectively, from 3bn yuan a year earlier.", "The company has been expanding its output to meet demand driven by China's booming economy.", "However, there was an energy crunch in China due to the delay of some power plants and projects."], "hermes3:3b": ["Yangtze Electric's profits more than doubled to 3bn yuan in 2004, due to increased electricity demand and less impact from rising coal costs."], "stablelm-zephyr:3b": ["Yangtze Electric Power, operator of China's Three Gorges Dam, reported a profit doubling in 2004, reaching 3 billion yuan ($365m; £190m).", "The company benefited from increased electricity demand during power shortages across the country.", "Net income increased from 1.4 billion yuan in 2003, while sales surged to 6.2 billion yuan compared to 3 billion yuan a year earlier.", "Analysts forecasted a possible decline in growth to around 20% this year due to China's booming economy and energy supply delays caused by environmental concerns."], "chatgpt-4o-latest": ["Yangtze Electric Power's profits more than doubled in 2004, reaching 3bn yuan due to rising electricity demand amid nationwide power shortages.", "As a hydroelectric generator, it avoided higher coal costs, with sales surging to 6.2bn yuan.", "Despite exceeding analysts' expectations, growth slowed from 2003 and is expected to decline further.", "The company has expanded output to meet demand, but government efforts to curb economic overheating have delayed power plant construction, exacerbating energy shortages.", "Environmental concerns have halted multiple projects, including parts of the Three Gorges and Xiluodu dams.", "The Three Gorges Dam has faced criticism for displacing over half a million people and environmental impacts."], "stablelm2:1.6b": ["Yangtze Electric's profits more than doubled, benefiting from increased electricity demand amid power shortages in China.", "The company has not been affected by higher coal costs and saw a 62% increase in net income to 3bn yuan ($1.4bn; £1.05bn) in Q4 2018, compared to Q3.", "Sales surged to 6.2bn yuan from 3bn yuan a year earlier.", "Analysts' expectations were met as the rate of growth slowed from Q3 but is expected to decline this year.", "Yangtze Electric has expanded output to meet demand driven by China's booming economy while government delayed building more power plants due to potential energy crunches caused by high demand exceeding supply."], "granite3.1-dense:2b": ["Yangtze Electric Power, the operator of China's Three Gorges Dam, reported a significant increase in profits for 2004, doubling to 3 billion yuan ($365 million).", "This growth was driven by heightened electricity demand due to China's rapidly expanding economy.", "Despite higher coal costs, the company's net income surged from 1.4 billion yuan in 2003, while sales reached 6.2 billion yuan, up from 3 billion yuan.", "These results exceeded analysts' expectations but indicated a slowing growth rate compared to 2003.", "The company's expansion has kept pace with demand, as the government has temporarily halted construction of several power plants to curb economic overheating and address environmental concerns.", "This included stopping work on an underground station, a supply unit at Three Gorges Dam, and another power station on Xiluodu dam due to environmental issues.", "The Three Gorges Dam relocation project has been criticized by environmental groups and human rights activists for displacing more than half a million people.", "Meanwhile, the Xiluodu Dam is being constructed on the Jinshajiang River, known as \"river of golden sand.\""]}