{"raw_text": "GSK aims to stop Aids profiteers\n \n One of the world's largest manufacturers of HIV/Aids drugs has launched an initiative to combat the smuggling of cheaper pills - supplied to poorer African countries - back into Europe for resale at far higher price.\n \n The company, GlaxoSmithKline, is to alter the packaging and change the colour of the pills, currently provided to developing nations under a humanitarian agreement. It is estimated that drugs companies are losing hundreds of millions of dollars each year as a result of the diversion of their products in this way. This is a very sensitive area for the big drugs companies. They want to maintain their profits, but have been put under tremendous pressure to provide cheap anti-Aids drugs to the world's poorest nations.\n \n The result is that drugs supplied to Africa are now more than thirty times cheaper than those sold in Europe; bringing these medicines within the reach of millions of HIV-positive Africans through their government's health care systems.\n \n But the wide difference in price also means that there are big gains to be made from illegally diverting these cheaper drugs back into wealthier countries and re-selling them at a higher price. GlaxoSmithKline believes that by coating the pills destined for Africa in a red dye and adding new identification codes both onto the pills and on the packaging, then this trade can be substantially reduced. The company says that it will then be possible to identify specific distributors in Africa who have re-sold humanitarian drugs for profit, as well as those suppliers in Europe that have also been involved in the trade. Glaxo says distribution of the new-look drugs has already begun and that their chemical content is identical to those currently being sold in Europe.\n", "llama3.2:1b": ["GlaxoSmithKline aims to combat the smuggling of cheaper HIV/Aids pills from Africa into European markets, which are now 30 times cheaper than in Europe due to price difference, allowing millions of Africans to access life-saving medicine through their governments' healthcare systems.", "The company plans to alter packaging and add a red dye and new identification codes to make it harder for cheaper drugs to be diverted back into wealthier countries and sold at a higher price."], "llama3.2:3b": ["GlaxoSmithKline launches initiative to combat cheaper HIV/AIDS pills smuggled back into Europe for resale at higher prices, altering packaging and color to identify distributors involved in diversion trade."], "gemma2:2b": ["GlaxoSmithKline is combating smuggling of cheaper HIV/AIDS drugs from developing nations to Europe for resale at higher prices.", "They are altering packaging and adding new identification codes to pills, aiming to reduce illegal diversion while still providing affordable medication to Africa through government healthcare systems."], "qwen2.5:0.5b": ["GSK aims to stop Aids profiteers by coating cheaper HIV/Aids drugs with a red dye to reduce the price of these medicines.", "This would allow them to sell more of these expensive drugs in poorer African countries for a higher profit.", "The company is also planning to change packaging and colours, adding new identification codes, to disguise the drugs as being from richer European countries.", "This will help GSK identify distributors who are selling cheaper HIV/Aids drugs back to Africa at a higher price."], "qwen2.5:1.5b": ["GSK aims to stop AIDS drug profiteers by altering packaging and changing pill colors, reducing price differences between African regions and Europe, potentially shutting down illegal trade routes for higher profits."], "qwen2.5:3b": ["GSK plans to combat drug smuggling by altering packaging and color of HIV/AIDS pills provided to poorer African countries, changing them into a red dye with added identification codes.", "This aims to reduce the profit margins from diverting these cheaper medicines back into wealthier European markets where they are resold at higher prices.", "GSK estimates this could save hundreds of millions annually as it maintains its humanitarian agreement commitments for affordable drugs in Africa."], "opencoder:1.5b": ["GSK aims to combat AIDS profiteers.", "The company, GlaxoSmithKline, is altering the packaging and changing the colour of the pills to supply cheap HIV/Aids drugs to developing nations.", "The loss of approximately $100 million per year from the diversion into this activity has been a critical factor for companies.", "This area faces severe financial pressures and is therefore an area where many big corporations are forced to work, even if they know that there's a revenue risk.", "The change in price means that there are already substantial gains from returning drugs to their original supply locations.", "Distributors in Africa have also been given the opportunity to resell these new drug packs at higher prices, as evidenced by GlaxoSmithKline.", "The high return is a major reason for increased confidence among consumers and retailers who may prefer not to drive through this channel.", "The key selling point of GlaxoSmithKline's policy is the ability to reduce the amount of drugs companies are producing, thus lowering costs.", "The introduction of the red dye coating and new identification codes on pills and packaging allows for a substantial shift in drug price and re-selling options in both Africa and Europe.", "The company believes distribution of these new drugs will facilitate efficient tracking and identification of specific distributors in Africa who have sold humanitarian drugs for profit.", "Additionally, suppliers in Europe having also been involved in the trade can be identified, further strengthening the brand's reputation in this market."], "smollm:1.7b": ["The company GSK aims to stop the smuggling of cheaper HIV/Aids drugs into Europe for resale at a higher price, which is estimated to be hundreds of millions of dollars each year.", "The company believes that by altering the packaging and changing the colour of the pills, it can make it more difficult for drug smugglers to sell these medicines in Africa.", "This is a very sensitive area for the big drugs companies as they want to maintain their profits but are put under tremendous pressure to provide cheap anti-Aids drugs to the world's poorest nations through their government's health care systems.", "The result of this diversion of cheaper HIV/Aids drugs into Europe and resale at a higher price is that these medicines become more expensive for millions of people living with HIV/AIDS in Africa, who are unable to afford them.", "This means that there are big gains to be made from illegally diverting these cheaper drugs back into wealthier countries and re-selling them at a higher price.", "GlaxoSmithKline believes that by coating the pills destined for Africa in a red dye and adding new identification codes both onto the pills and on the packaging, then this trade can be substantially reduced.", "The company says that it will then be possible to identify specific distributors in Africa who have re-sold humanitarian drugs for profit, as well as those suppliers in Europe that have also been involved in the trade.", "Glaxo believes distribution of the new-look HIV/Aids drugs has already begun and that their chemical content is identical to those currently being sold in Europe."], "deepseek-r1:1.5b": ["GSK aims to stop drug smugglers supplying cheaper HIV/AIDs drugs to Africa, changing pills' packaging and colors.", "This diversion costs them hundreds of millions annually but maintains profits.", "The drugs are now much cheaper in Africa than Europe, enabling millions of African HIV-positive people to access life-saving medicines via government health care systems.", "Despite the diversion, they can still profit from re-selling cheap pills elsewhere."], "tinyllama:1.1b": ["GSK Aims to Stop Profiteering by Smuggling Affordable Drugs Back into Africa\nOne of the world's largest manufacturers of HIV/Aids drugs has launched an initiative to combat smugglers' profiteering on the back of cheap drug supplies being provided to developing nations under a humanitarian agreement.", "The company, GlaxoSmithKline (GSK), is aiming to alter the packaging and change the color of the pill, currently provided to poorer African countries under a humanitarian agreement.", "This will make it more difficult for drug companies to profit from their medicine being sold in cheaply priced countries like Africa, where they are now three times cheaper than those sold in Europe.", "The result is that illicit traders have been able to make substantial profits by diverting these drugs back into wealthier countries and re-selling them at a higher price.", "To reduce this trade, GSK has launched an initiative aimed at preventing the smuggling of cheap medicine back into Africa.", "The company is offering a new label for pills with red dye and identifying codes on packaging to help identify specific distributors in Africa who have also been involved in the trade.", "As part of this initiative, GSK has begun distribution of the new-look drugs and says that their chemical content remains unchanged as the medicine is identical to those currently being sold in Europe."], "tinydolphin:1.1b": [" The Global Pharmaceutical Industry is facing a unique challenge with regards to counterfeit HIV/AIDS medication smuggled into Africa by profiteering drug manufacturers.", "In an effort to stem this tide, GSK has launched a comprehensive initiative aimed at addressing the problem of cheap anti-AIDS drugs being diverted from developing nations into Europe.", "By altering the packaging and introducing a new color code on the pills, GSK plans to make its drugs more difficult for smuggling due to their appearance.", "This move is expected to significantly reduce profits for these companies while also improving accessibility for HIV-positive patients in Africa."], "phi:2.7b": [" GSK aims to stop Aids profiteers by altering the packaging and colour of its HIV/Aids drugs, which are supplied to poorer African countries under a humanitarian agreement.", "This helps combat the smuggling of cheaper pills back into Europe for resale at much higher prices.", "The company believes that by adding new identification codes and coating the pills in red dye, it can reduce this trade significantly.", "The new-look drugs have already been distributed and their chemical content is identical to those being sold in Europe."], "orca-mini:3b": [" GSK aims to stop Aids profiteers by altering the packaging and changing the color of the HIV/Aids drugs it provides to poorer African countries.", "This initiative will help reduce the illegal diversion of these cheaper drugs back into Europe for resale at higher prices.", "The company hopes to identify specific distributors in Africa who have re-sold humanitarian drugs for profit and those suppliers in Europe that have also been involved in the trade.", "Distribution of the new-look drugs has already begun, and they are expected to be more effective in reducing illegal drug diversion."], "hermes3:3b": ["GSK initiates plan to combat Aids profiteering by altering pill packaging and color, making drugs for poorer countries less identifiable for resale at higher prices."], "stablelm-zephyr:3b": ["GlaxoSmithKline (GSK) is combating the smuggling of cheaper HIV/AIDS drugs back into Europe for resale at a higher price.", "The initiative involves altering pill packaging and coloring, aiming to reduce the diversion of products sourced for poorer African countries.", "It is estimated that drug companies are losing millions each year due to this issue.", "By coating pills in red dye and adding identification codes, GSK hopes to identify distributors involved in profiteering.", "Distribution of the new drugs has begun, with their chemical content identical to European-sold versions."], "chatgpt-4o-latest": ["GlaxoSmithKline is taking measures to prevent the illegal resale of cheaper HIV/AIDS drugs, intended for poorer African nations, back into Europe at higher prices.", "To combat this, the company is changing the packaging, adding identification codes, and coating the pills with red dye.", "The price gap between Africa and Europe has led to significant smuggling, costing drug companies hundreds of millions of dollars.", "By implementing these changes, GSK aims to track and reduce this trade while ensuring affordable medication remains available to those in need."], "stablelm2:1.6b": ["GSK launches initiative to combat drug smuggling by altering packaging and adding identification codes for cheaper HIV/aid drugs given to African countries, reducing profits from diversion while ensuring access to millions of Africans via government healthcare systems.", "Drug companies lose hundreds of millions due to this practice; red dyeing pills and identifying distributors involved in the trade will significantly reduce profit-making."], "granite3.1-dense:2b": ["GlaxoSmithKline (GSK), a leading HIV/AIDS drug manufacturer, is implementing an initiative to combat the illegal smuggling of cheaper, humanitarian-distributed pills from Africa into wealthier European markets.", "The company plans to alter the packaging and color of these pills, currently supplied to developing nations under a global agreement.", "This diversion results in profits for drug companies, estimated at hundreds of millions of dollars annually, as the cheaper medicines are sold at significantly higher prices in Europe.", "By coating African-bound pills with red dye and adding identification codes, GSK aims to trace and penalize distributors involved in this illicit trade.", "This move will help maintain drug profits while ensuring the affordable distribution of life-saving medicines to millions of HIV-positive individuals in Africa through national healthcare systems."]}