{"raw_text": "Dollar drops on reserves concerns\n \n The US dollar has dropped against major currencies on concerns that central banks may cut the amount of dollars they hold in their foreign reserves.\n \n Comments by South Korea's central bank at the end of last week have sparked the recent round of dollar declines. South Korea, which has about $200bn in foreign reserves, said it plans instead to boost holdings of currencies such as the Australian and Canadian dollar. Analysts reckon that other nations may follow suit and now ditch the dollar. At 1300 GMT, the euro was up 0.9% on the day at 1.3187 euros per US dollar. The British pound had added 0.5% to break through the $1.90 level, while the dollar had fallen by 1.3% against the Japanese yen to trade at 104.16 yen.\n \n At the start of the year, the US currency, which had lost 7% against the euro in the final three months of 2004 and had fallen to record lows, staged something of a recovery.\n \n Analysts, however, pointed to the dollar's inability recently to extend that rally despite positive economic and corporate data, and highlighted the fact that many of the US's economic problems had not disappeared. The focus once again has been on the country's massive trade and budget deficits, with predictions of more dollar weakness to come. \"The comments from Korea came at a time when sentiment towards the dollar was already softening,\" said Ian Gunner, a trader at Mellon Financial. On Tuesday, traders in Asia said that both South Korea and Taiwan had withdrawn their bids to buy dollars at the start of the session. Mansoor Mohi-Uddin, chief currency strategist at UBS, said that there was a sentiment in the market that \"central banks from Asia and the Middle East are buying euros\". A report last month already showed that the dollar was losing its allure as a currency that offered rock-steady returns and stability. Compiled by Central Banking Publications and sponsored by the UK's Royal Bank of Scotland, the survey found 39 nations out of 65 questioned were increasing their euro holdings, with 29 cutting back on the US dollar.\n", "llama3.2:1b": ["The US dollar has dropped against major currencies due to concerns that central banks may reduce foreign reserve holdings in the coming months.", "This is sparked by South Korea's decision not to increase its own reserve holdings, which could lead other nations to follow suit and abandon the dollar.", "The dollar fell 1.3% against the Japanese yen and lost 0.9% against the euro during the day, according to current exchange rates.", "Analysts believe that this trend is likely to continue as trade and budget deficits in the US worsen and sentiment towards the dollar becomes increasingly negative."], "llama3.2:3b": ["The US dollar has dropped against major currencies due to concerns that central banks may cut their dollar reserves, sparking comments from South Korea's central bank about boosting foreign reserve holdings in alternative currencies.", "Analysts predict more dollar weakness as US economic problems persist despite positive data."], "gemma2:2b": ["The US dollar has weakened against major currencies due to concerns about central banks reducing their holdings of dollars in reserves.", "South Korea's plans to boost holdings of Australian and Canadian dollars have sparked this trend, with analysts expecting similar actions from other nations.", "The US currency struggles to maintain its rally despite positive economic indicators, as the focus remains on trade deficits and budget imbalances.", "The market sentiment leans towards euro strengthening, fueled by a growing distrust in the dollar's stability.", "Several surveys indicate that central banks are shifting their holdings towards euros, indicating a weakening appeal of the dollar."], "qwen2.5:0.5b": ["The US dollar has fallen against major currencies due to concerns that central banks may cut their reserves' holdings.", "South Korea has pledged to boost its dollar holdings instead, citing concerns over a possible increase in oil prices and other economic issues.", "Analysts expect other nations to follow suit, with the euro losing 1.3% against Japan's yen at 104.16 yen on Tuesday, while the US dollar lost 7% against the euro in the final three months of 2004.", "The survey also found that 39 nations out of 65 questioned were increasing their euro holdings and cutting back on the US dollar."], "qwen2.5:1.5b": ["The US dollar has weakened against major currencies due to concerns that central banks might reduce their foreign reserves, following comments from South Korea's central bank.", "This trend led to a 1.3% decline in the US dollar relative to the Japanese yen and an increase of 0.9% in the euro."], "qwen2.5:3b": ["The US dollar has dropped against major currencies due to concerns that central banks may cut holdings of dollars in foreign reserves.", "South Korea's decision to increase holdings of Australian and Canadian dollars sparked this trend.", "The euro gained 0.9%, the British pound rose 0.5% above $1.90, and the Japanese yen strengthened against the dollar.", "Analysts predict more dollar weakness as economic issues persist, particularly trade and budget deficits.", "Previously recovering from losing 7% to the euro in the final quarter of 2004 and hitting record lows, the dollar's rally stalled despite positive data.", "Many Asian and Middle Eastern central banks have increased euro holdings while decreasing US dollar reserves, indicating growing preference for currencies offering stability."], "opencoder:1.5b": ["The US dollar has dropped against major currencies on concerns that central banks may cut the amount of dollars they hold in their foreign reserves.", "At the start of the year, the US currency staged something of a recovery despite positive economic and corporate data.", "Analysts pointed to the dollar's inability recently to extend that rally despite positive economic and corporate data.", "The focus once again has been on the country's massive trade and budget deficits, with predictions of more dollar weakness to come.", "Ian Gunner, a trader at Mellon Financial, said that sentiment towards the dollar was already softening.", "Traders in Asia said that both South Korea and Taiwan had withdrawn their bids to buy dollars at the start of the session.", "Mansoor Mohi-Uddin, chief currency strategist at UBS, said that there was a sentiment in the market that \"central banks from Asia and the Middle East are buying euros\".", "The report last month already showed that the dollar was losing its allure as a currency that offered rock-steady returns and stability.", "Compiled by Central Banking Publications and sponsored by the UK's Royal Bank of Scotland, the survey found 39 nations out of 65 questioned were increasing their euro holdings, with 29 cutting back on the US dollar."], "smollm:1.7b": ["The US dollar has dropped against major currencies on concerns that central banks may cut the amount of dollars they hold in their foreign reserves.", "The US dollar is currently trading at around $1.90 per euro, down from a high of $1.95 in January 2004.", "South Korea's central bank at the end of last week has sparked the recent round of dollar declines by saying it plans instead to boost holdings of currencies such as the Australian and Canadian dollar.", "Analysts reckon that other nations may follow suit and now ditch the dollar.", "At 1300 GMT, the euro was up 0.9% on the day at 1.3187 euros per US dollar.", "The British pound had added 0.5% to break through the $1.90 level, while the dollar had fallen by 1.3% against the Japanese yen to trade at 104.16 yen."], "deepseek-r1:1.5b": ["The US dollar has experienced drops in value against major currencies due to concerns from central banks that may reduce their holdings.", "South Korea's actions have sparked these declines, prompting analysts to consider other countries might follow.", "The euro was up 0.9%, the British pound broke through $1.90, and the yen fell by 1.3%.", "Earlier, the US had recovered slightly but now faces economic weakness due to its trade and budget deficits.", "Analysts noted that many of these problems haven't been fully resolved yet.", "A recent report showed significant increases in euro holdings and decreases in dollar returns, with the central bank buying euros."], "tinyllama:1.1b": ["Pas de déclencheurs pour la hausse du pondus d'argent américain contre les autres monnaies, avec une décision finale d'autres nations à déplacer leurs stocks de dollars dans l'autre sens.", "La France, la Suède et la Norvège ont annoncé enfin leur intention de rétablir leur stocks d'euro sur les marchés pour 2006, alors que les pays américains n'ont pas vraiment eu le loisir d'exploiter leur monnaie avant l'annonce du ralliement des Britanniques à la libéralisation.", "Les commentateurs ont ainsi souligné qu'une réduction de déclencheurs pourrait avoir été prévu dans les derniers semaines, mais que ce ne fut pas le cas.", "En effet, les États-Unis ont encore attrapé l'attention de la presse lors du mois d'avril avec leur décision de nager plus vite et mieux leur réserves d'euro contre les autres pays monétaires en Europe, tout juste après les nouvelles de la finification des stocks d'euro en France.", "Leurs commentateurs ont ainsi affirmé que les négociations pour faire entrer les États-Unis dans la monnaie suisse étaient en cours au bout de quelques semaines."], "tinydolphin:1.1b": [" The US dollar dropped against major currencies during a period when central banks around the world were considering cutting their reserves in an attempt to alleviate economic pressure.", "South Korea's central bank expressed its concerns about the reserves held by other nations, sparking the recent fluctuations of the currency market.", "In response to the rising concerns over foreign reserves, several countries have increased holdings of the Australian and Canadian dollars.", "The dollar's performance was a significant shift in global financial markets, with many predicting more downward pressure on the value of the US currency against its major rivals."], "phi:2.7b": [" The US dollar has dropped against major currencies due to concerns about central banks potentially reducing their foreign reserves of dollars.", "South Korea's central bank recently announced they plan to increase holdings of other currencies like Australian and Canadian dollar.", "This could encourage other nations to do the same, leading to a shift away from the dollar.", "Analysts point out that despite positive economic data, the US's trade and budget deficits remain a concern, potentially causing more dollar weakness.", "The comments by South Korea came at a time when sentiment towards the dollar was already softening."], "orca-mini:3b": [" Dollar drops against major currencies due to concerns about central banks cutting the amount of dollars they hold in their foreign reserves, sparked by South Korea's central bank comments at the end of last week.", "Other nations may follow suit and now dump the dollar, according to analysts.", "The US currency has been unable to extend its recent rally despite positive economic and corporate data, highlighting its inability to address its massive trade and budget deficits.", "Sentiment towards the dollar is softening, with many Asian and Middle Eastern central banks reportedly buying euros instead."], "hermes3:3b": ["US Dollar drops against major currencies due to concerns about central banks reducing USD reserves held in foreign reserves.", "This follows comments from South Korea's central bank about boosting non-US currency reserve holdings."], "stablelm-zephyr:3b": ["The US dollar has declined against major currencies due to concerns that central banks may reduce the amount of dollars they hold in their foreign reserves.", "South Korea's central bank comments have sparked the recent dollar declines, leading other nations to consider ditching the dollar in favor of other currencies.", "Analysts predict more dollar weakness as predictions focus on the US's massive trade and budget deficits.", "A report showed that the dollar is losing its appeal as a reliable currency for returns and stability, with 39 out of 65 surveyed nations increasing their euro holdings and 29 cutting back on the US dollar."], "chatgpt-4o-latest": ["The US dollar has declined against major currencies due to concerns that central banks may reduce their dollar holdings in foreign reserves.", "South Korea, holding about $200 billion in reserves, announced plans to increase holdings of other currencies like the Australian and Canadian dollar, prompting fears that other nations may follow.", "The euro, British pound, and Japanese yen all gained against the dollar.", "Despite a brief recovery earlier in the year, analysts note the dollar's struggles to sustain gains amid persistent US trade and budget deficits.", "Reports indicate that Asian and Middle Eastern central banks are shifting towards the euro, with a survey showing 39 out of 65 nations increasing euro holdings while 29 reduced their dollar reserves."], "stablelm2:1.6b": ["The US dollar has dropped against major currencies due to concerns that central banks may cut foreign reserves, particularly among South Korea which plans to boost holdings of other currencies such as the Australian and Canadian dollar.", "Other nations are expected to follow suit and ditch the dollar as sentiment towards it weakens.", "At present, the euro is up 0.9% on the day at 1.26 euros per US dollar, while the British pound has added 0.5%.", "Traders believe that more dollar weakness is predicted for the future as many of the US's economic problems persist."], "granite3.1-dense:2b": ["The US dollar has weakened against major currencies due to concerns that central banks might reduce their dollar holdings in foreign reserves.", "South Korea's decision to shift its reserves towards Australian and Canadian currencies, following similar moves by other Asian nations, has triggered this decline.", "At the time of writing, the euro was up 0.9%, trading at 1.3187 euros per US dollar, while the British pound surpassed $1.90.", "The dollar's recent recovery from record lows in late 2004 has faltered amid economic issues like large trade and budget deficits.", "Analysts predict further dollar weakness as central banks from Asia and the Middle East favor euros over the US currency."]}