{"raw_text": "Business fears over sluggish EU economy\n \n As European leaders gather in Rome on Friday to sign the new EU constitution, many companies will be focusing on matters much closer to home - namely how to stay in business.\n \n Lille is a popular tourist destination for Britons who want a taste of France at the weekend. But how many tourists look at the impressively grand Victorian Chambre de Commerce, which stands beside the Opera House, and consider that it was built - like the town halls in many northern English towns - on the wealth created by coal, steel and textiles? Like northern England and industrial Scotland, those industries have been in long term decline - the last coal pit closed in 1990. Beck-Crespel is a specialist steel firm in Armentieres, about 20 miles from Lille. The company has not laid off a worker since 1945. It specialises in making bolts and fixings for power stations and the oil industry, but not many of those are being built in Europe these days.\n \n Director Hugues Charbonnier says he is under pressure because factories in the Far East are able to make some of his output more cheaply, while his key markets are now in China and India. \"In our business the market is absolutely global, you can not imagine living with our size (of business) even within an enlarged European Union, (if we did that) we would need not 350 people but perhaps just 150 or 200,\" he says. It isn't just globalisation that is hurting; the law in France means workers are paid for a 39 hour week even though they work just 35 hours. But at least there is still a steel industry. Coal has now totally vanished and textiles are struggling. New business has been attracted, but not enough to make up the difference.\n \n That is one reason why people here are not great fans of the EU, says Frederic Sawicki, a politics lecturer at the University of Lille.\n \n \"In the region today the unemployment rate is 12%, in some areas it is 15%. They don't see what Europe is doing for them, so there is a kind of euro scepticism, especially in the working classes,\" he says. Which is strange because Lille is at the crossroads of Europe - if anywhere should be benefiting from the euro it is here. The euro was designed to increase trade within the eurozone, but the biggest increase in trade has been with the rest of the world. Much of that trade passes through the world's largest port, Rotterdam, in Holland, home to specialist crane maker Huisman Itrec. Its cranes help build oil rigs and lifted the sunken Russian submarine Kursk from the sea bed, but Huisman Itrec is now setting up a factory in China, where costs are cheaper and its main customers are closer.\n \n Boss Henk Addink blames the low growth rate in Europe for the lack of orders closer to home. \"In the US growth is something like 6%, in China they are estimating 15%, and in the EU it is more or less 1%,\" he says. Mr Addink blames the euro for stifling demand. He much preferred the old currencies of Europe, which moved in relation to each country's economic performance. In Germany, industry is exporting more these days, but the economy as a whole is once again mired in slow growth and high unemployment. Growth is likely to peak this year at just under 2%. In Britain that would be a bad year; in Germany it is one of the best in recent years. With Germany making up a third of the eurozone's economy, this is a major problem. If Germany doesn't once again become the powerhouse of Europe, growth across the bloc is never going to be as strong as it could be. However, at one factory near the Dutch border things are changing.\n \n The Siemens plant at Boscholt makes cordless phones and employs 2,000 staff. Staff have started working an extra four hours a week for no extra pay, after Siemens threatened to take the factory and their jobs to Hungary. Factory manager Herbert Stueker says that he now hopes to increase productivity \"by nearly 30%\". But Germany needs much more reform if all its industry is to compete with places such Hungary or China. The Government is reforming the labour market and cutting the generous unemployment system, but the real solution is to cut the wages of low skilled workers, says Helmut Schneider, director of the Institute for the Study of Labour at Bonn University. \"Labour is too costly in Germany, especially for the low skilled labour and this is the main problem. If we could solve that problem we could cut unemployment by half,\" he says. The EU set itself the target of being the most efficient economy in the world by 2010. Four years into that process, and the target seems further away than ever.\n", "llama3.2:1b": ["European businesses are concerned about a sluggish EU economy due to factors such as the decline of coal, steel, and textile industries, leading to high unemployment rates and low growth rates.", "Companies like Beck-Crespel in Armentieres, which has not laid off a worker since 1945, face challenges from globalized markets that can produce their products more cheaply.", "Local businesses are also struggling due to the euro's impact on trade within the EU, with many feeling that they do not benefit from it.", "The region of Lille is at the crossroads of Europe and sees high unemployment rates, with some areas reaching 15%."], "llama3.2:3b": ["Businesses in northern France and Germany face challenges due to a sluggish European economy.", "Many industries, such as coal mining and textiles, have declined.", "Companies like Beck-Crespel and Huisman Itrec struggle with cheaper production costs from countries like China.", "The EU's single currency has also stifled demand for domestic products.", "Some factories, however, are adapting by increasing productivity or relocating to more competitive regions."], "gemma2:2b": ["European businesses face challenges due to globalisation, competition from lower-cost countries, and sluggish European economic growth.", "Many companies are struggling, with some forced to adjust to lower demand or relocate production.", "The low growth in Europe impacts trade, employment, and overall competitiveness within the eurozone.", "Despite plans for EU reform and hopes of greater productivity, many experts believe Germany's slow growth is hindering the bloc's progress towards achieving economic efficiency by 2010."], "qwen2.5:0.5b": ["Business leaders are focused on staying in business while also addressing economic challenges closer to home.", "The EU is facing sluggish economic growth due to a decline in coal, steel and textile industries.", "Some companies in Lille, such as Beck-Crespel, specialise in making bolts and fixings for power stations and the oil industry.", "The company has not laid off a worker since 1945.", "Lille is a popular tourist destination attracting tourists from Britain looking to experience France on weekends.", "The German Government is reforming the labour market but addressing the core issue of low-skilled workers' wages, which could lead to significant unemployment in the EU."], "qwen2.5:1.5b": ["Businesses fear economic downturn as EU leaders gather, with many focusing on staying in business rather than new regulations or globalization.", "Europe struggles economically due to coal industry decline, textile problems, and workers' rights laws.", "France's unemployment rate is high (12%) compared to growth rates in other European nations like the US, China, and Germany.", "Despite this, some areas see potential for future development despite current economic challenges, such as an EU factory increasing productivity by 30%."], "qwen2.5:3b": ["Business fears over sluggish EU economy persist as European leaders gather for the new constitution signing.", "Companies focus on local survival challenges such as long-term decline in coal, steel, and textile industries.", "Lille's Beck-Crespel firm is under pressure due to globalisation; factories in Far East offer cheaper production costs.", "Frederic Sawicki of Lille University notes 12-15% unemployment rate and euro scepticism among the working classes despite economic crossroads with Europe.", "Euro growth has mainly benefited trade with non-EU countries, not intra-eu commerce.", "Huisman Itrec factory relocating to China due to lower costs and closer customers.", "Siemens factory in Boscholt plans productivity increase by hiring extra workers and threatening relocation to Hungary if necessary.", "However, Germany faces challenges including high labour costs for low-skilled workers that could require wage cuts.", "EU's target of being the most efficient economy is distant after four years."], "opencoder:1.5b": ["This summary preserves the key ideas and details from the original text:\n\n\"The Business Fears Over Sluggish EU Economy\" \n\nAs European leaders gather to sign the new EU constitution, many companies are focusing on matters much closer to home - namely how to stay in business.", "Lille is a popular tourist destination for Britons who want a taste of France at the weekend.", "The company has not laid off a worker since 1945.", "It specialises in making bolts and fixings for power stations and the oil industry, but not many of those are being built in Europe these days.", "That's why people here are not great fans of the EU, says Frederic Sawicki, a politics lecturer at the University of Lille.", "The growth is stifling demand, he prefers the old currencies of Europe.", "In Germany, industry is exporting more these days, but the economy as a whole is once again mired in slow growth and high unemployment.", "Growth is likely to peak this year at just under 2%.", "Germany needs much more reform if all its industry is to compete with places such Hungary or China.", "The Government is reforming the labour market and cutting the generous unemployment system, but the real solution is to cut wages of low skilled workers.", "If we could solve that problem we could cut unemployment by half.", "The EU set itself the target of being the most efficient economy in the world by 20th century.", "Four years into that process, the target seems further away than ever."], "smollm:1.7b": ["The text is a summary of the main ideas and details from the original text.", "Here's how you can summarize it:\n\n1.", "**Business fears over sluggish EU economy**: As European leaders gather in Rome on Friday to sign the new EU constitution, many companies will be focusing on matters much closer to home - namely how to stay in business.", "2.", "**Lille is a popular tourist destination for Britons who want a taste of France at the weekend**: Like northern England and industrial Scotland, those industries have been in long term decline - the last coal pit closed in 1990.", "Beck-Crespel is a specialist steel firm in Armentieres, about 20 miles from Lille.", "The company has not laid off a worker since 1945.", "3.", "**Director Hugues Charbonnier says he is under pressure because factories in the Far East are able to make some of his output more cheaply**: In our business the market is absolutely global, you can not imagine living with our size (of business) even within an enlarged European Union, if we did that - the market is absolutely global, you can not imagine living with our size (of business) even within an enlarged European Union, if we did that.", "4.", "**That is one reason why people here are not great fans of the EU**: In the region today the unemployment rate is 12%, in some areas it is 15%.", "They don't see what Europe is doing for them, so there is a kind of euro scepticism especially in the working classes.", "5.", "**Boss Henk Addink blames the low growth rate in Europe for the lack of orders closer to home**: In Germany, industry is exporting more and more because the economy as a whole is once again mired in slow growth and high unemployment.", "With Germany making up a third of the eurozone's economy, this is a major problem.", "6.", "**The Siemens plant at Boscholt makes cordless phones and employs 2,000 staff**: Factory manager Herbert Stueker says that he now hopes to increase productivity \"by nearly 30%\" if all its industry is to solve the main problem of being too costly in Germany, low skilled workers.", "7.", "**The EU set itself the target of being the most efficient economy in the world by 2010**: Four years into that process, and the target seems further away than ever."], "deepseek-r1:1.5b": ["The text discusses Lille's tourism industry, which is a popular destination for British tourists, but faces challenges due to declining coal, steel, and textiles industries.", "The local steel firm, Beck-Crespel, has been operating without layoffs since 1945, relying on labor from 35 hours per week to meet global demand.", "The French government aims to make Europe's economy more efficient with a target of 2010 being the most efficient economy globally.", "However, despite these efforts, progress towards this goal is hindered by issues related to low skilled wages and regional unemployment rates."], "tinyllama:1.1b": ["The business community in Lille, France, is worried about how to stay in business, especially in light of their declining industry and the long-term consequences of globalization.", "One concern is the lack of orders closer to home, which they believe is due to factors such as low growth rates in Europe and a lack of jobs in Germany.", "The lack of orders is also contributing to rising unemployment and uneconomic industries such as textiles and steel production.", "As for the EU's constitution signing ceremony, Lille businesses are focusing on how they can stay profitable while looking towards China for opportunities.", "However, even with these challenges, the EU continues to face a daunting task of being the most efficient economy in the world by 2010."], "tinydolphin:1.1b": [" Business leaders are grappling with the sluggish European economy as they continue to navigate new economic challenges.", "With many industries experiencing declining revenues and skilled workers seeking new opportunities in other regions, it highlights the need for reform and innovation within the EU.", "In the case of Lille, a popular tourist destination in France, the business climate has shifted towards a focus on maintaining local businesses instead of pursuing overseas expansion.", "Despite this, the challenges faced by European leaders, including Germany's commitment to maintaining its economic dominance, underscore the need for reform and global cooperation."], "phi:2.7b": [" The text discusses how the decline of industries such as coal, steel, and textiles has impacted Europe's economies.", "Companies like Lille's Beck-Crespel are struggling to compete with cheaper production in countries like China.", "The EU is also facing challenges as the job market remains stagnant, leading to a lack of support for the organization.", "Many companies are moving their factories to China due to cheaper labor costs, and the euro has been criticized for hindering economic growth.", "Overall, Europe's economy is struggling, despite its size and location at the center of the European Union."], "orca-mini:3b": [" Business fears over sluggish EU economy, Lille is a popular tourist destination for Britons who want a taste of France at the weekend.", "But how many tourists look at the impressively grand Victorian Chambre de Commerce, which stands beside the Opera House, and consider that it was built - like the town halls in many northern English towns - on the wealth created by coal, steel and textiles?", "Like northern England and industrial Scotland, those industries have been in long term decline - the last coal pit closed in 1990.", "Beck-Crespel is a specialist steel firm in Armentieres, about 20 miles from Lille.", "The company has not laid off a worker since 1945.", "It specialises in making bolts and fixings for power stations and the oil industry, but not many of those are being built in Europe these days.", "Director Hugues Charbonnier says he is under pressure because factories in the Far East are able to make some of his output more cheaply, while his key markets are now in China and India.", "\"In our business the market is absolutely global, you can not imagine living with our size (of business) even within an enlarged European Union, (if we did that) we would need not 350 people but perhaps just 150 or 200,\" he says.", "It isn't just globalisation that is hurting; the law in France means workers are paid for a 39 hour week even though they work just 35 hours.", "But at least there is still a steel industry.", "Coal has now totally vanished and textiles are struggling.", "New business has been attracted, but not enough to make up the difference.", "That is one reason why people here are not great fans of the EU, says Frederic Sawicki, a politics lecturer at the University of Lille."], "hermes3:3b": ["European companies struggle due to slow EU economy; concern over globalisation, cheap competition from Asia; dissatisfaction with EU benefits despite geographical advantage for trade."], "stablelm-zephyr:3b": ["European leaders sign the new EU constitution during a meeting in Rome as companies focus on staying in business amid fears over the sluggish EU economy.", "Lille, a popular tourist destination for Britons, is experiencing issues like northern England and industrial Scotland, with industries in decline such as coal, steel, and textiles.", "A director of Beck-Crespel, a specialist steel firm in Armentieres, France, says that globalization and the French law requiring workers to be paid for a 39-hour week despite working 35 hours are hurting his business.", "Many regions within Europe, including Lille, see high unemployment rates and euro-scepticism among working classes due to lack of benefits from the EU.", "In Germany, industry is exporting more but faces slow growth and high unemployment.", "The Siemens plant in Boscholt increases productivity by 30% after offering a 4-hour workweek without extra pay for workers."], "chatgpt-4o-latest": ["European businesses are struggling due to sluggish economic growth, global competition, and high labor costs.", "In Lille, once a hub for coal, steel, and textiles, industries have declined, leading to high unemployment and skepticism about the EU's benefits.", "Companies like Beck-Crespel face pressure from cheaper production in Asia, while Huisman Itrec is relocating to China due to low European demand.", "Germany, the eurozone's largest economy, is experiencing slow growth and high unemployment, with companies like Siemens forcing workers to increase hours without extra pay to remain competitive.", "Experts argue that labor costs, particularly for low-skilled workers, must be reduced to boost employment.", "Despite the EU's goal of becoming the world's most efficient economy by 2010, progress remains slow."], "stablelm2:1.6b": ["European companies are facing business concerns due to a sluggish European economy as they gather for the new EU constitution signing in Rome.", "Industries such as coal, steel, and textiles have long-term declines, resulting in low growth rates and high unemployment.", "Despite this, there are efforts to reform labor market and cut wages for low-skilled workers in Germany, which contributes significantly to the EU's overall economy.", "The EU aims to become the most efficient economy worldwide by 2008."], "granite3.1-dense:2b": ["European businesses, particularly those in regions like northern France and Belgium, face significant challenges due to long-term industrial decline, globalization, and high labor costs.", "Despite being at Europe's economic crossroads, these areas experience high unemployment rates (up to 15%) and euro skepticism among the working class.", "The sluggish EU economy hampers domestic demand, as growth is lower than in the US (6%), China (15%), or even some European countries like Germany (2%).", "Germany's slow growth and high unemployment rates pose a major obstacle to overall eurozone strength.", "Meanwhile, other industrial sectors, such as those in Holland and Poland, are expanding, often at the expense of traditional German industry due to lower labor costs and proximity to global markets.", "Reforms in Germany, including labor market changes and reduced unemployment benefits, aim to boost competitiveness, but experts argue that further cuts to wages for low-skilled workers are necessary to achieve this goal and reduce unemployment by half.", "The EU's ambition to become the most efficient economy by 2010 appears increasingly distant."]}