{"raw_text": "Huge rush for Jet Airways shares\n \n Indian airline Jet Airways' initial public offering was oversubscribed 16.2 times, bankers said on Friday.\n \n Over 85% of the bids were at the higher end of the price range of 1,050-1,125 rupees ($24-$26). Jet Airways, a low-fare airline, was founded by London-based ex-travel agent Naresh Goya, and controls 45% of the Indian domestic airline market. It sold 20% of its equity or 17.2 million shares in a bid to raise up to $443m (£230.8m). The price at which its shares will begin trading will be agreed over the weekend, bankers said. \"The demand for the IPO was impressive. We believe that over the next two years, the domestic aviation sector promises strong growth, even though fuel prices could be high,\" said Hiten Mehta, manager of merchant banking firm, Fortune Financial Services. India began to open up its domestic airline market - previously dominated by state-run carrier Indian Airlines - in the 1990s. Jet began flying in 1993 and now has competitors including Air Deccan and Air Sahara. Budget carriers Kingfisher Airlines and SpiceJet are planning to launch operations in May this year. Jet has 42 aircraft and runs 271 scheduled flights daily within India. It recently won government permission to fly to London, Singapore and Kuala Lumpur.\n", "llama3.2:1b": ["Indian airline Jet Airways' initial public offering was oversubscribed by 16.2 times with over 85% of bids at the higher end of its price range.", "Over 17 million shares were sold in the IPO for $443m.", "The stock's trading date will be agreed on over the weekend, but analysts predict strong growth in India's domestic aviation sector and believe fuel prices could increase."], "llama3.2:3b": ["Jet Airways' initial public offering was oversubscribed 16.2 times, with over 85% of bids at the higher end of its price range.", "The airline sold 20% of its equity for up to $443m (£230.8m).", "India's domestic airline market is expected to experience strong growth in the next two years despite high fuel prices.", "Jet Airways controls 45% of the Indian market, with 42 aircraft and 271 daily flights, and recently won government permission to fly internationally."], "gemma2:2b": ["Jet Airways IPO oversubscribed 16.2 times, with over 85% of bids at the higher end of the price range ($24-$26).", "The airline raised up to $443 million by selling 20% equity or 17.2 million shares.", "Demand was strong due to the domestic aviation sector's expected growth despite potential high fuel prices.", "Jet Airways is a low-fare airline controlling 45% of the Indian domestic market and recently won permission for flights to London, Singapore, and Kuala Lumpur."], "qwen2.5:0.5b": ["Jet Airways' initial public offering was oversubscribed, with bids for over 85% of the shares sold at a price range of 1,050-1,125 rupees ($24-$26).", "It is a low-fare airline that controls 45% of the Indian domestic airline market.", "The IPO will be agreed on the weekend and is expected to raise up to $443m (£230.8m).", "Jet Airways recently won government permission to fly to London, Singapore, and Kuala Lumpur."], "qwen2.5:1.5b": ["Huge interest in Jet Airways IPO: oversubscribed 16.2 times; bids at higher end of price range (1,050-1,125 rupees); raised $443m (£230.8m) by selling 17.2 million shares; expected strong growth in domestic aviation sector due to fuel price volatility."], "qwen2.5:3b": ["Huge demand for Jet Airways shares: IPO oversubscribed 16.2 times, with over 85% of bids at the higher end of the $24-$26 range.", "A low-fare airline founded by Naresh Goya, controlling 45% of Indian domestic market, sold 20% of its equity (17.2 million shares) to raise up to $443m.", "The IPO's price will be agreed over the weekend.", "Analysts predict strong future growth in Indian aviation sector despite high fuel prices.", "Jet Airways has 42 aircraft and operates 271 daily flights within India, including plans for international routes."], "opencoder:1.5b": ["\"From the perspective of a trader on the IPO market, it is expected that growth in the domestic aviation sector will continue even though fuel prices are rising as demand for the next-generation airline has increased.\"", "The initial public offering (IPO) of Jet Airways was oversubscribed 16.2 times by Indian airline shares, where the highest bid was at a price range of approximately $1,050 to $1,125 rupees in an offer from London-based ex-travel agent Naresh Goya and controls 45% of the Indian domestic airline market.", "The airline's equity or share price was sold for approximately $443 million in an offer worth up to $230.8 million.", "Jet Airways plans to begin trading prices over the weekend, which was agreed by bankers.", "\"The IPO was highly anticipated given its impressive range of bid and offer options and its potential to generate significant revenue and profits,\" said Hiten Mehta, who is a manager at Fortune Financial Services.", "\"India has seen tremendous growth in the domestic aviation sector as the airline has been able to retain numerous investors and business partners over the past few years.\"", "India's domestic airline market started opening up in the 1980s, with Jet Airways beginning its operations.", "The airline's competitors include Air Deccan and Air Sahara.", "Kingfisher Airlines and SpiceJet are also planning to launch operations in May this year.", "The growth prospects of the Indian domestic airline market are expected to continue, despite the growing economic uncertainty and the higher cost of fuel compared to some major airlines like British Airways or Aeroflot."], "smollm:1.7b": ["The Indian airline Jet Airways' initial public offering was oversubscribed 16.2 times, with over 85% of the bids at the higher end of the price range of $24-$26.", "The company's founder, Naresh Goya, and his family-owned airline, Jet Airways, were behind the IPO.", "The bid was oversubscribed by a margin of around 10%.", "Over 85% of the bids were at the higher end of the price range, which is significantly higher than the market average.", "This suggests that investors were willing to pay more for shares in Jet Airways, as they believe the company has strong growth potential and will continue to operate successfully over the next two years.", "The demand for Jet Airways' shares was high due to its low operating costs and relatively low fuel prices compared to other airlines in India.", "This is a key factor that investors consider when evaluating an IPO, as it can indicate a company's ability to generate profits and sustain itself in the long term.", "Jet Airways has been successful in the Indian domestic market, with over 20% of its shares trading at the higher end of the price range.", "This suggests that investors believe in the company's potential for growth and profitability, which is a key factor in determining the IPO price.", "The bid was oversubscribed by a margin of around 10%, which means that investors were willing to pay more than the market average price for shares in Jet Airways.", "This suggests that investors believe in the company's potential for growth and profitability, and are willing to pay a premium for shares in the company.", "Overall, the IPO was oversubscribed by a significant margin due to high demand from investors who believe in Jet Airways' strong growth potential and low operating costs.", "The bid was oversubscribed by a margin of around 10%, which suggests that investors are willing to pay more for shares in Jet Airways than the market average price."], "deepseek-r1:1.5b": ["Jet Airways' initial public offering was oversubscribed by 16.2 times, with bids ranging from 1050 to 1125 rupees, almost $24-$26 each.", "They sold a significant portion of their shares (20%) for up to $443 million, raising the potential start price for trading.", "With a market share of 45% in India's domestic airline sector, Jet Airways is one of the leading budget carriers.", "It began flying in 1993 and competes with Air Deccan and Air Sahara.", "The company operates 42 aircraft serving around 271 flights daily, including government approvals for London, Singapore, and Kuala Lumpur."], "tinyllama:1.1b": ["Jet Airways' initial public offering (IPO) is expected to be oversubscribed, with 85% of the bids being at the higher end of the price range of 1,050-1,125 rupees ($24-$26).", "The Indian low-fare airline has registered a huge demand, selling 20% of its equity or 17.2 million shares in the initial public offering (IPO) at an estimated price of $443m (£230.8m).", "The firm's shares will begin trading over the weekend, and the demand for the IPO was impressive, with analysts predicting strong growth despite high fuel prices.", "India is currently opening up its domestic airline market, which is expected to be competitive in the coming months with budget carriers Kingfisher Airlines and SpiceJeet launching operations within the year.", "Jet Airways has 42 aircraft and flies over 271 scheduled flights daily within India.", "The government granted permission for the airline to fly to London, Singapore, and Kuka Lua in May this year."], "tinydolphin:1.1b": [" Indian airline Jet Airways' initial public offering (IPO) was oversubscribed by 16.2 times, with over 85% of the bids being at the higher end of the price range.", "The company was founded by London-based ex-travel agent Naresh Goya and controls 45% of the Indian domestic airline market.", "Its shares began trading on a private platform ahead of its IPO, which took place on November 18th.", "The demand for Jet's IPO was impressive, with over two million potential investors interested in purchasing a piece of the company.", "The shares are expected to begin trading this coming weekend, pending approval by regulators."], "phi:2.7b": [" The initial public offering of Indian airline Jet Airways was oversubscribed 16.2 times with over 85% of the bids being at a higher end of the price range.", "The IPO sold 20% of its equity or 17.2 million shares in an effort to raise up to $443m, with the trading price to be agreed upon over the weekend.", "The demand for the IPO was impressive, and the airline industry as a whole is predicted to see strong growth in the next two years despite high fuel prices."], "orca-mini:3b": [" Jet Airways shares were oversubscribed 16.2 times at the higher end of the price range of $24-$26 per share.", "Over 85% of the bids were at this price level.", "The airline plans to sell 20% of its equity or 17.2 million shares for up to $443m (£230.8m).", "The price at which its shares will begin trading will be agreed over the weekend, and India's domestic aviation sector is expected to grow strongly in the next two years."], "hermes3:3b": ["Jet Airways shares oversubscribed 16.2 times in IPO."], "stablelm-zephyr:3b": ["Jet Airways' initial public offering (IPO) was highly successful, with oversubscription of 16.2 times.", "The airline sold 17.2 million shares to raise up to $443m (£230.8m).", "Jet Airways controls 45% of the Indian domestic airline market and plans to start operations in London, Singapore, and Kuala Lumpur soon.", "The price at which its shares will begin trading is set to be agreed upon over the weekend.", "India's domestic aviation sector is expected to see strong growth in the next two years, despite potential fuel price hikes."], "chatgpt-4o-latest": ["Jet Airways' initial public offering was oversubscribed 16.2 times, with over 85% of bids at the higher price range of 1,050-1,125 rupees.", "The airline, founded by Naresh Goya, controls 45% of India's domestic market and sold 20% of its equity to raise up to $443 million.", "The final share price will be decided over the weekend.", "Analysts expect strong growth in India's aviation sector despite high fuel prices.", "Jet Airways, which began operations in 1993, faces competition from Air Deccan and Air Sahara, with new budget carriers Kingfisher Airlines and SpiceJet set to launch.", "Jet operates 42 aircraft with 271 daily domestic flights and recently gained approval to fly to London, Singapore, and Kuala Lumpur."], "stablelm2:1.6b": ["Jet Airways' IPO was oversubscribed 2 times and received over 1/3 of bids at the higher end of its price range, raising up to £8m ($14m).", "Founded by ex-travel agent Naresh Goya, the low-fee airline controls 50% of India's domestic airline market and will sell 2 million shares to raise funds.", "Its shares start trading soon; the price is yet to be agreed upon."], "granite3.1-dense:2b": ["Jet Airways' initial public offering (IPO) was highly oversubscribed by 16.2 times, with 85% of bids at the upper end of the price range ($24-$26).", "The airline, founded by Naresh Goya and controlling 45% of India's domestic market, sold 17.2 million shares worth up to $443m.", "The trading price will be determined over the weekend.", "Market analysts predict strong growth in the domestic aviation sector due to upcoming competition from budget carriers like Kingfisher Airlines and SpiceJet.", "Jet Airways, with 42 aircraft and daily 271 flights within India, recently obtained permission to fly internationally to London, Singapore, and Kuala Lumpur."]}