{"raw_text": "Ukraine steel sell-off 'illegal'\n \n The controversial sell-off of a Ukrainian steel mill to a relative of the former president was illegal, a court has ruled.\n \n The mill, Krivorizhstal, was sold in June 2004 for $800m (£424m) - well below other offers. President Viktor Yushchenko, elected in December, is planning to revisit many of Ukraine's recent privatisations. Krivorizhstal is one of dozens of firms which he says were sold cheaply to friends of the previous administration.\n \n On Wednesday, Prime Minister Yulia Tymoshenko said as many as 3,000 firms could be included on the list of firms whose sale was being reviewed.\n \n Mr Yushchenko had previously said the list would be limited to 30-40 enterprises. More than 90,000 businesses in all, from massive corporations to tiny shopfronts, have been sold off since 1992, as the command economy built up when Ukraine was part of the Soviet Union was dismantled. Analysts have suggested that the government needs to avoid the impression of an open-ended list, so as to preserve investor confidence.\n \n Thursday's ruling by a district court in Perchesk overturned a previous decision in a lower court permitting the sale. The consortium which won the auction for the mill was created by Viktor Pinchuk, son-in-law of former-President Leonid Kuchma, and Rinat Akhmetov, the country's richest man. The next step is for the supreme court to annul the sale altogether, opening the way for Krivorizhstal to be resold. Mr Yushchenko has suggested a fair valuation could be as much as $3bn. One of the foreign bidders who lost out, steel giant LNM, told BBC News that it would be interested in any renewed sale.\n", "llama3.2:1b": ["The Ukrainian government's decision to sell Krivorizhstal steel mill to Viktor Pinchuk, son-in-law of former president Leonid Kuchma, was ruled illegal by a district court in Perchesk on Wednesday.", "The sale was agreed upon in June 2004 for $800m (£424m), significantly lower than other offers.", "President Viktor Yushchenko plans to review more than 90,000 businesses that have been sold off since 1992, which could include Krivorizhstal.", "Analysts and investors are concerned about the potential impact on investor confidence if a large number of companies are added to the list."], "llama3.2:3b": ["A Ukrainian court ruled the sale of Krivorizhstal steel mill to a relative of former President Leonid Kuchma's son-in-law was illegal, as it went against fair market value.", "The sale was for $800m and was criticized by new President Viktor Yushchenko for being below other offers."], "gemma2:2b": ["A Ukrainian court ruled that the sale of Krivorizhstal steel mill was illegal.", "The mill was sold for $800 million to a relative of former president Leonid Kuchma and an oligarch, Rinat Akhmetov, well below market value.", "President Viktor Yushchenko plans to review numerous privatizations involving underpriced sales to friends of the previous administration.", "He aims to re-evaluate this sale's legality and potentially reopen negotiations for a higher price, with some analysts suggesting $3 billion is a potential valuation.", "A renewed sale could be pursued by LNM, a major steel company that lost out in the initial auction."], "qwen2.5:0.5b": ["Ukraine's Krivorizhstal steel mill was sold to a relative of former President Viktor Yushchenko at an \"illegal\" price, according to a court ruling.", "The decision by the Ukrainian district court on Thursday has opened the possibility for a resold auction, with the supreme court potentially overturning this action and allowing LNM Steel to be sold again."], "qwen2.5:1.5b": ["A Ukrainian court ruled against an illegal sell-off of a state-owned steel mill to a relative of a previous president, overturning a previous decision and paving the way for potential resales while Mr. Yushchenko considers revisiting other privatisations."], "qwen2.5:3b": ["Ukraine's controversial sale of Krivorizhstal steel mill to President Viktor Yushchenko’s relative was ruled illegal by a court.", "The June 2004 $800m sale was below other offers and affected many firms sold cheaply during Ukraine's privatisation period since 1992.", "Prime Minister Yulia Tymoshenko now considers reviewing sales of up to 3,000 companies, but the Supreme Court is set to annul Krivorizhstal’s sale, potentially reselling it for as much as $3bn."], "opencoder:1.5b": ["Ukraine steel sell-off 'illegal' The controversial sell-off of a Ukrainian steel mill to a relative of the former president was illegal, a court has ruled The mill, Krivorizhstal, was sold in June 2004 for $800m (£424m) - well below other offers President Viktor Yushchenko, elected in December, is planning to revisit many of Ukraine's recent privatisations Krivorizhstal is one of dozens of firms which he says were sold cheaply to friends of the previous administration On Wednesday, Prime Minister Yulia Tymoshenko said as many as 3,000 firms could be included on the list of firms whose sale was being reviewed Mr Yushchenko had previously said the list would be limited to 30-40 enterprises More than 90,000 businesses in all, from massive corporations to tiny shopfronts, have been sold off since 1992, as the command economy built up when Ukraine was part of the Soviet Union was dismantled Analysts have suggested that the government needs to avoid the impression of an open-ended list, so as to preserve investor confidence Thursday's ruling by a district court in Perchesk overturned a previous decision in a lower court permitting the sale.", "The consortium which won the auction for the mill was created by Viktor Pinchuk, son-in-law of former-President Leonid Kuchma, and Rinat Akhmetov, the country's richest man.", "The next step is for the supreme court to annul the sale altogether, opening the way for Krivorizhstal to be resold Mr Yushchenko has suggested a fair valuation could be as much as $3bn.", "One of the foreign bidders who lost out, steel giant LNM, told BBC News that it would be interested in any renewed sale."], "smollm:1.7b": ["Ukraine's steel mill sell-off was illegal because it was sold without proper bidding process and without considering all relevant factors.", "The court ruled that the previous sale was invalid due to lack of transparency and unfair business practices.", "The next step is for the supreme court to annul the sale altogether, opening the way for Krivorizhstal to be resold at a fair price."], "deepseek-r1:1.5b": ["The Ukrainian steel sell-off was illegal, sold for $800 million in 2004.", "The president plans to revisit privatisations but hasn't mentioned revisiting private deals.", "Private companies were bought since 1992 when the Soviet Union ended its command economy.", "Yushchenko may revise or revoke the sale but could offer a higher price if it happens.", "A court ruled against a prior decision, now in review with possible revocation."], "tinyllama:1.1b": ["The Ukrainian steel mill, Krivorizhsstal, has been sold for a lower price than other offers made by the government, and is currently being reviewed by Prime Minister Yulia Tymoshenko and the Cabinet.", "Mr Yushchenko claims that as many as 3,000 firms could be included on the list of firm to be reviewed, including smaller enterprises.", "The transfer was approved in June 2004 for $800m (£424m) by President Viktor Yushchenko, and is one of over 90,000 businesses that have been sold off since 1992, when Ukraine's command economy was dismantled.", "Analysts suggest that the government may need to preserve investor confidence in order not to prolong a list of firms being reviewed.", "The next step is for the supreme court to annul the sale and allow Krivorizhsstal to be resolved, potentially worth as much as $3bn.", "The foreign bidder who lost out to LNM has expressed interest in any renewed sale."], "tinydolphin:1.1b": [" In recent years, the privatization of various businesses across Ukraine has been a topic of controversy due to the lack of transparency and the potential for corruption involved.", "The Krivorizhstal steel mill, which was sold to the relatives of President Viktor Yushchenko in 2004, is under review by the Prime Minister Yulia Tymoshenko and may face further investigation into its sale.", "This decision has sparked outrage among many Ukrainians who feel that their taxes were used to benefit friends of the previous administration.", "President Yushchenko's supporters argue that this sale was cheap because it involved a relative of the former president, while critics believe that these deals were often done at a significant loss to the taxpayers and investors.", "As a result of the ongoing controversy surrounding Krivorizhstal's sale, Prime Minister Tymoshenko has announced that she will reopen the review process, possibly resulting in the reselling of Krivorizhstal or its entire portfolio.", "This decision has been met with mixed reactions from Ukrainians and has led to further debate about the fairness and transparency of privatizations across Ukraine."], "phi:2.7b": [" Ukraine's former president sold a steel mill illegally to his relative at below-market prices and is now reviewing many other privatisations.", "The Prime Minister has said 3,000 firms may be on the review list.", "Over 90,000 businesses have been sold off since 1992 as part of Ukraine's transition from Soviet Union.", "An appellate court overturned a lower court ruling permitting the sale, opening the way for Krivorizhstal to be resold at a fair valuation.", "LNM, a foreign steel giant, is interested in any new sale."], "orca-mini:3b": [" The controversial sell-off of a Ukrainian steel mill to a relative of the former president was illegal, a court has ruled.", "The mill, Krivorizhstal, was sold for $800m (£424m) - well below other offers.", "President Viktor Yushchenko is planning to revisit many of Ukraine's recent privatisations.", "Krivorizhstal is one of dozens of firms which he says were sold cheaply to friends of the previous administration.", "More than 90,000 businesses in all, from massive corporations to tiny shopfronts, have been sold off since 1992, as the command economy built up when Ukraine was part of the Soviet Union was dismantled.", "Analysts have suggested that the government needs to avoid the impression of an open-ended list, so as to preserve investor confidence.", "Thursday's ruling by a district court in Perchesk overturned a previous decision in a lower court permitting the sale.", "The consortium which won the auction for the mill was created by Viktor Pinchuk, son-in-law of former-President Leonid Kuchma, and Rinat Akhmetov, the country's richest man.", "The next step is for the supreme court to annul the sale altogether, opening the way for Krivorizhstal to be resold.", "Mr"], "hermes3:3b": ["Ukrainian steel mill sell-off to ex-president's relative found illegal; court rules sale below market value and orders reselling."], "stablelm-zephyr:3b": ["A court ruled that the controversial sell-off of Ukrainian steel mill Krivorizhstal to a relative of former president Viktor Yushchenko was illegal.", "The mill was sold for $800m in 2004, well below other offers, and President Yushchenko plans to revisit many of Ukraine's recent privatizations.", "Prime Minister Yulia Tymoshenko said 3,000 firms could be included on the list of reviewed sales.", "The next step is for the supreme court to annul the sale, opening the way for Krivorizhstal to be resold, potentially worth up to $3bn."], "chatgpt-4o-latest": ["A Ukrainian court ruled that the 2004 sale of the Krivorizhstal steel mill to a relative of former President Leonid Kuchma was illegal, as it was sold for $800 million—far below other offers.", "President Viktor Yushchenko, elected in December, is reviewing past privatizations, with Prime Minister Yulia Tymoshenko stating that up to 3,000 firms could be reassessed.", "The court's decision overturns a previous ruling, and the supreme court may annul the sale, allowing for resale.", "Yushchenko estimates a fair valuation at $3 billion, and foreign bidders, including steel giant LNM, have expressed interest.", "Analysts warn that an open-ended review could harm investor confidence."], "stablelm2:1.6b": ["A Ukrainian steel mill, Krivorizhstal, was found to be sold below market value during a sell-off by former president Viktor Yushchenko, which is deemed 'illegal'.", "President Yushchenko plans to revisit Ukraine's recent privatisations that were criticized for being sold cheaply.", "Over 30 companies have been involved in these sales since 2010 when the command economy was dismantled after Ukraine joined the Soviet Union as a part of the USSR.", "A district court ruled on Thursday, overturning a previous decision permitting the sale, and the supreme court will now annul the sale altogether.", "The next step is for Krivorizhstal to be resold at an alleged fair valuation of $3bn by one of the foreign bidders who lost out, steel giant LNM."], "granite3.1-dense:2b": ["A court ruled that Ukraine's 2004 sale of Krivorizhstal steel mill to a consortion led by Viktor Pinchuk (son-in-law of former President Leonid Kuchma) and Rinat Akhmetov (Ukraine's richest man) was illegal.", "This decision overturns an earlier ruling in favor of the sale, which was criticized as being significantly lower than other offers for the $800m (£424m) price tag.", "President Viktor Yushchenko plans to review numerous recent privatizations, including Krivorizhstal, among dozens of firms he believes were sold cheaply to associates of the previous administration.", "The ruling paves the way for Krivorizhstal's resale, with potential valuations reaching up to $3bn, and could impact over 90,000 businesses Ukraine has sold off since the collapse of the Soviet Union's command economy in 1992.", "Prime Minister Yulia Tymoshenko suggests that as many as 3,000 firms may be included in this review list."]}