{"raw_text": "Georgia plans hidden asset pardon\n \n Georgia is offering a one-off 'tax amnesty' to people who hid their earnings under the regime of former president Eduard Shevardnadze.\n \n The country's new president, Mikhail Saakashvili, has said that anyone now willing to disclose their wealth will only have to pay 1% in income tax. The measure is designed to legitimise previously hidden economic activity and boost Georgia's flagging economy. Georgia's black market is estimated to be twice the size of its legal economy.\n \n Mr Saakashvili, elected president in January after Mr Shevardnadze was toppled, has urged the Georgian Parliament to approve the amnesty as soon as possible. It is one of a series of proposals designed to tackle corruption, which was rampant during the Shevardnadze era, and boost Georgia's fragile public finances.\n \n The new government is encouraging companies to pay taxes by scrapping existing corruption investigations and destroying all tax records from before 1 January, three days before President Saakashvili was elected. \"There are people who have money but are afraid to show it,\" the president told a government session. \"Documentation about where this money came from doesn't exist because under the former, entirely warped regime, earning capital honestly was not possible.\"\n \n By declaring their assets and paying the one-off tax, people would be able to \"legalise their property\", Mr Saakashvili stressed.\n \n \"No one will have the right to check this money's origin. This money must go back into the economy.\" The amnesty will not extend to people who made money through drugs trafficking or international money laundering. Criminal investigations in such cases -thought to involve about 5% of Georgian businesses -are to continue. Mr Saakashvili has accused the Shevardnadze regime, which was toppled by a popular uprising in November, of allowing bribery to flourish. Georgia's economy is in a desperate condition. Half the population are living below the poverty line with many surviving on income of less than $4, or three euros, a day. The unemployment rate is around 20% while the country has a $1.7bn public debt.\n", "llama3.2:1b": ["Georgia offers a one-off tax amnesty to hide earnings under former President Eduard Shevardnadze's regime, with those eligible paying only 1% in income tax and disclosing their wealth."], "llama3.2:3b": ["Georgia plans a one-off 'tax amnesty' for those who hid assets under Eduard Shevardnadze's regime to boost the economy and tackle corruption.", "Anyone willing to disclose their wealth will pay 1% in income tax.", "The measure aims to legitimise hidden economic activity, with the country's black market estimated to be twice its legal economy."], "gemma2:2b": ["Georgia is offering a one-time tax amnesty to individuals who hid their wealth under the previous government.", "This amnesty allows them to pay only 1% income tax on previously hidden earnings and legitimize their assets.", "The measure aims to combat corruption, boost Georgia's economy, and improve public finances.", "It excludes cases involving drug trafficking and international money laundering.", "The amnesty is part of a broader effort to address corruption and improve the country's economic situation."], "qwen2.5:0.5b": ["The new government in Georgia plans to pardon people who hid their earnings under a former president's regime and declare that anyone willing to disclose their wealth will only have to pay 1% of income tax.", "Key points:\n- New government offers one-off amnesty for those willing to disclose their wealth.", "- Former president Shevardnadze promised the amnesty as a way to boost Georgia's economy, but it is designed to legitimize previously hidden economic activity and improve public finances.", "- The amnesty includes people who are currently not declared on taxes and those who made money through drug trafficking or international money laundering.", "- A new government has promised to continue with anti-corruption measures in cases where evidence of bribery exists."], "qwen2.5:1.5b": ["Georgia offers one-off tax amnesty to disclose hidden assets under former president's regime for economic legitimacy and boost in strained economy."], "qwen2.5:3b": ["Georgia offers a 'tax amnesty' to people who hid their earnings during Eduard Shevardnadze's regime, allowing them to pay only 1% income tax on disclosed wealth.", "President Mikhail Saakashvili aims to legitimise hidden economic activity and boost the economy, which is estimated to be twice as large as its legal sector due to a black market.", "The amnesty encourages companies to disclose their assets and taxes by forgiving previous corruption investigations.", "However, it excludes activities related to drugs trafficking or international money laundering.", "The government intends to use this money to strengthen Georgia's public finances despite the country having a severe economic crisis with half of the population living below poverty line and unemployment rates above 20%."], "opencoder:1.5b": ["Georgia plans hidden asset pardon.", "Georgia is offering a one-off 'tax amnesty' to people who hid their earnings under the regime of former president Eduard Shevardnadze.", "The country's new president, Mikhail Saakashvili, has urged the Georgian Parliament to approve the amnesty as soon as possible.", "It is one of a series of proposals designed to tackle corruption, which was rampant during the Shevardnadze era, and boost Georgia's fragile public finances.", "Mr Saakashvili, elected president in January after Mr Shevardnadze was toppled, has urged the Georgian Parliament to approve the amnesty as soon as possible.", "It is one of a series of proposals designed to tackle corruption, which was rampant during the Shevardnadze era, and boost Georgia's fragile public finances.", "The new government is encouraging companies to pay taxes by scrapping existing corruption investigations and destroying all tax records from before 1 January, three days before President Saakashvili was elected.", "\"There are people who have money but are afraid to show it,\" the president told a government session.", "\"Documentation about where this money came from doesn't exist because under the former, entirely warped regime, earning capital honestly was not possible.\"", "By declaring their assets and paying the one-off tax, people would be able to \"legalise their property\", Mr Saakashvili stressed.", "\"No one will have the right to check this money's origin.", "This money must go back into the economy.\"", "The amnesty will not extend to people who made money through drugs trafficking or international money laundering.", "Criminal investigations in such cases -thought to involve about 5% of Georgian businesses -are to continue.", "Mr Saakashvili has accused the Shevardnadze regime, which was toppled by a popular uprising in November, of allowing bribery to flourish.", "Georgia's economy is in a desperate condition.", "Half the population are living below the poverty line with many surviving on income of less than $4, or three euros, a day.", "The unemployment rate is around 20% while the country has a $1.7bn public debt."], "smollm:1.7b": ["The summary above captures the main ideas and key points from the original text:\n\n1.", "Georgia is offering a one-off tax amnesty to people who hid their earnings under the regime of former President Eduard Shevardnadze.", "2.", "The country's new president, Mikhail Saakashvili, has said that anyone now willing to disclose their wealth will only have to pay 1% in income tax.", "3.", "The measure is designed to legitimise previously hidden economic activity and boost Georgia's flagging economy.", "4.", "Georgia's black market is estimated to be twice the size of its legal economy.", "5.", "Mr Saakashvili, elected president in January after Mr Shevardnadze was toppled, has urged the Georgian Parliament to approve the amnesty as soon as possible.", "6.", "The new government is encouraging companies to pay taxes by scrapping existing corruption investigations and destroying all tax records from before 1 January, three days before President Saakashvili was elected.", "7.", "There are people who have money but are afraid to show it because under the former regime earning capital honestly was not possible.", "8.", "Documentation about where this money came from doesn't exist because under the former regime earning capital honestly was not possible.", "9.", "The amnesty will not extend to people who made money through drugs trafficking or international money laundering.", "10.", "Criminal investigations in such cases -thought to involve about 5% of Georgian businesses -are to continue.", "11.", "Mr Saakashvili has accused the Shevardnadze regime, which was toppled by a popular uprising in November, of allowing bribery to flourish.", "12.", "Georgia's economy is in a desperate condition with half the population living below the poverty line and many surviving on income of less than $4, or three euros, a day.", "13.", "The unemployment rate is around 20% while the country has a $1.7bn public debt."], "deepseek-r1:1.5b": ["Georgia is considering a one-time 'tax amnesty' plan to hide earnings under the Shevardnadze regime.", "The new president, Mikhail Saakashvili, wants individuals hiding their money to pay only 1% in income tax now.", "This measure aims to legitimize hidden economic activity and boost Georgia's struggling economy.", "Mr. Saakashvili urged the Georgian Parliament to approve the amnesty as soon as possible.", "He also encouraged companies to pay taxes by scrapping past crimes and losing all records since President was elected three days ago.", "People hiding their money would legally \"legalise their property,\" but criminal investigations for drug trafficking or international money laundering remain ongoing, targeting businesses.", "The economy is currently struggling with half a million below the poverty line, unemployment at 20%, and a public debt of $1.7 billion."], "tinyllama:1.1b": ["Georgia plans to offer a one-off \"tax amnesty\" to people who hid their earnings under former President Eduard Shevardnadze's regime of corruption and criminal investigations have already been carried out, as part of the new government's effort to legitimize previously hidden economic activity and boost Georgia's flagging economy.", "The \"tax amnesty\" will help people disclose their wealth without having to pay 1% in income tax, as well as destroy all tax records from before January 1, three days before President Saakašvili was elected.", "The new government is encouraging companies to pay taxes by scrapping existing corruption investigation and destroying all tax records from before January 1.", "To be eligible for the amnesty, people must have made money through drug trafficking or international money laundering, but criminal investigations in such cases will continue.", "A country's economy is in a desperate condition, with half of the population living below poverty lines and many surviving on income levels less than $4 or three euros per day.", "As part of its efforts to clean up the country's finances, Georgia plans to ask for international donations to boost public spending and cut the country's public debt."], "tinydolphin:1.1b": [" In summary, the Georgian government announced an amnesty plan to encourage citizens to declare their hidden income for tax relief.", "This move aims to help recover lost revenue from the previous corruption-ridden regime, as well as boost the country's economy through legal business activities and alleviate poverty among its inhabitants.", "The plan is also intended to help legitimize previously hidden economic activity."], "phi:2.7b": [" Georgia's new president, Mikhail Saakashvili, is offering a one-off \"tax amnesty\" to people who hid their earnings under former president Eduard Shevardnadze's regime, allowing them to disclose their wealth with only 1% income tax.", "The measure aims to legitimise hidden economic activity and boost Georgia's flagging economy, estimated to have a black market twice the size of its legal economy.", "The amnesty is one of several proposals designed to tackle corruption and Georgia's fragile public finances.", "Saakashvili has urged the Georgian Parliament to approve the amnesty as soon as possible, encouraging companies to pay taxes by scrapping existing investigations and destroying tax records from before 1 January, three days before his election.", "People who declare their assets and pay the one-off tax will \"legalise\" their property, he said, while those involved in drug trafficking or international money laundering are not eligible for amnesty."], "orca-mini:3b": [" Georgia plans to offer a one-off tax amnesty to people who hid their earnings under the regime of former president Eduard Shevardnadze.", "The measure is designed to legitimize previously hidden economic activity and boost the country's flagging economy, which is estimated to be twice the size of its legal economy.", "President Mikhail Saakashvili has urged the Georgian Parliament to approve the amnesty as soon as possible, saying that anyone willing to disclose their wealth will only have to pay 1% in income tax.", "The new government is encouraging companies to pay taxes by scrapping existing corruption investigations and destroying all tax records from before 1 January, three days before Mr. Saakashvili was elected.", "People who declare their assets and pay the one-off tax would be able to \"legalize their property,\" said the president.", "The amnesty will not extend to people who made money through drugs trafficking or international money laundering, and criminal investigations in such cases are to continue.", "Georgia's economy is in a desperate condition, and half the population are living below the poverty line with many surviving on income of less than $4, or three euros, a day.", "The unemployment rate is around 20%, and the country has a $1.7bn public debt."], "hermes3:3b": ["Georgia offering single % tax amnesty for people who hid assets under ex-president Shevardnadze to legitimize hidden economic activity and boost economy."], "stablelm-zephyr:3b": ["Georgia's new president, Mikhail Saakashvili, is offering a one-time \"tax amnesty\" to individuals who hid their earnings during former president Eduard Shevardnadze's regime.", "Those willing to disclose their wealth will only have to pay 1% in income tax.", "This measure aims to legitimize hidden economic activity and boost the struggling economy, which is estimated to be twice the size of its legal economy.", "The amnesty proposal is part of a series designed to tackle corruption and improve Georgia's public finances.", "Companies are being encouraged to pay taxes by abandoning corruption investigations and destroying tax records from before January 1st.", "Saakashvili emphasized that no one will have the right to question the origin of the declared money, and the amnesty would not apply to those who made money through drug trafficking or international money laundering.", "Georgia's economy is in dire condition, with half the population living below the poverty line and an unemployment rate around 20%."], "chatgpt-4o-latest": ["Georgia's President Mikhail Saakashvili is offering a one-time tax amnesty for individuals who hid earnings under former President Eduard Shevardnadze.", "Those who disclose their wealth will pay only 1% in income tax, aiming to legitimize hidden economic activity and boost the struggling economy, where the black market is twice the size of the legal economy.", "The government will scrap corruption investigations and destroy tax records before January 1 to encourage compliance.", "The amnesty excludes those involved in drug trafficking or international money laundering.", "Saakashvili, who took office after Shevardnadze was ousted, seeks to combat corruption and improve public finances in a country where half the population lives in poverty, unemployment is 20%, and public debt stands at $1.7 billion."], "stablelm2:1.6b": ["Georgia offers a one-time \"tax amnesty\" for people who concealed their earnings under former President Eduard Shevardnadze's regime.", "New President Mikhail Saakashvili aims to boost the economy and tackle corruption by allowing previously hidden wealth to be revealed, paying 1% income tax, and legalizing property.", "The amnesty will not extend to those involved in drug trafficking or international money laundering cases.", "To address economic issues, Georgia is encouraging companies to pay taxes without existing corruption investigations and destroying old tax records."], "granite3.1-dense:2b": ["Georgia's new president, Mikhail Saakashvili, proposes a one-time tax amnesty for individuals who hid their earnings under Eduard Shevardnadze's regime.", "This measure aims to legitimize previously concealed economic activities and stimulate the struggling economy, which is estimated to be twice the size of its legal economy due to a vast black market.", "The amnesty offers a 1% income tax rate for disclosing hidden wealth.", "Saakashvili urges the Parliament to approve this proposal promptly as part of a broader anti-corruption plan and economic recovery strategy.", "The new government plans to eliminate existing corruption investigations and destroy pre-election tax records (January 1, 2004) to encourage businesses to pay taxes.", "This initiative targets honest business owners reluctant to declare their assets due to the previous regime's corrupt practices.", "However, criminal activities like drug trafficking and money laundering remain unaffected by this amnesty.", "Georgia faces severe economic challenges, with half its population below the poverty line and an unemployment rate of about 20%, alongside a $1.7 billion public debt."]}