{"raw_text": "Novartis hits acquisition trail\n \n Swiss drugmaker Novartis has announced 5.65bn euros ($7.4bn; £3.9bn) of purchases to make its Sandoz unit the world's biggest generic drug producer.\n \n Novartis, which last month forecast record sales for 2005, said it had bought all of Germany's Hexal. It also acquired 67.7% of Hexal's US affiliate Eon Labs, and offered to buy the remaining shares for $31 each. Novartis said that it would be able to make cost savings of about $200m a year following the acquisitions. Novartis' shares rose 1% to 57.85 Swiss francs in early trading.\n \n The deal will see Novartis' Sandoz business overtake Israel's Teva Pharmaceuticals as the world's biggest maker of generics. Based on 2004 figures the newly merged producer would have sales of more than $5bn, the company estimated. Novartis said that it would merge a number of departments, adding that there may be job cuts.\n \n \"The strong growth outlook for Sandoz, which will create jobs, is expected to partially compensate for necessary reductions in the work force,\" the firm said in a statement. Generic drugs are chemically identical to their more expensive branded rivals. Producers such as Sandoz can copy the branded products usually after their patent protection expires and can sell them more cheaply as they do not have to pay research and development cost.\n \n There are more than 150 generic drugmakers worldwide and analysts have predicted consolidation in a market that they call fragmented. However, not all analysts were initially convinced about the deal. \"This is a very expensive acquisition,\" Birgit Kuhlhoff, from Sal Oppenheim investment bank, told Reuters. \"I find it strange that they are making acquisitions in exactly those markets where they suffered price pressure.\"\n", "llama3.2:1b": ["Novartis has announced acquiring Sandoz for 5.65bn euros to become the world's largest generic drug producer.", "The deal includes buying all of Germany's Hexal and its US affiliate Eon Labs, with a potential $31 share offer.", "This will make Sandoz overtake Israel's Teva Pharmaceuticals as the biggest generic maker."], "llama3.2:3b": ["Novartis has announced €5.65 billion ($7.4 billion) in purchases to make its Sandoz unit the world's largest generic drug producer.", "It acquired all of Germany's Hexal and 67.7% of US affiliate Eon Labs, offering to buy remaining shares for $31 each.", "The deal will see Sandoz surpass Israel's Teva Pharmaceuticals as the world's largest maker of generics, with estimated sales over $5 billion in 2004."], "gemma2:2b": ["Novartis acquired Hexal and Eon Labs to make its Sandoz unit the world's largest generic drug producer, overtaking Teva Pharmaceuticals.", "This merger is expected to generate cost savings of $200 million annually and merge departments, potentially leading to job cuts.", "The deal will significantly boost Sandoz's sales to over $5 billion.", "While some analysts were skeptical about the cost, others believe this move aligns with a market trend toward consolidation in the fragmented generic drug industry."], "qwen2.5:0.5b": ["Novartis acquires Hexal and Eon Labs for $31 each.", "The acquisition is expected to boost generic drug production by more than $5 billion per year.", "However, some analysts are concerned about potential job cuts in the merged company."], "qwen2.5:1.5b": ["Swiss drugmaker Novartis has purchased Germany's Hexal and 67.7% of its US affiliate Eon Labs for $5.65 billion euros to make Sandoz the world's largest generic drug producer, aiming to boost sales from $5 billion in 2004 by 2010 while making cost savings of about $200 million annually through departmental mergers and job cuts.", "The acquisitions will enable Novartis to overtake Teva Pharmaceuticals as the biggest generics maker and create jobs despite potential workforce reductions."], "qwen2.5:3b": ["Novartis acquires Hexal and Eon Labs to create Sandoz as the world's largest generic drug producer for $7.4bn.", "The acquisition is expected to save Novartis about $200m annually, making it a leading player in generics market with sales exceeding $5bn based on 2004 figures.", "However, the deal may lead to job cuts due to planned department mergers and anticipated generic drug price pressures despite strong growth prospects for Sandoz.", "Some analysts questioned the high cost of the acquisition."], "opencoder:1.5b": ["Novartis hits an acquisition deal to gain control over Sandoz, which has made Germany's largest generic drug producer.", "The company announced a $5.65bn purchase followed by a buy-off deal with Israel's Teva.", "Novartis is forecasting a 2005 sales record and has bought all of Germany's Hexal.", "It also acquired an affiliate firm Eon Labs to buy shares for $31 each in return for saving about $200m per year.", "The acquisition saw the company's Sandoz business taking over Israel's Teva as the world's largest maker of generic drugs, based on 2004 figures.", "Novartis has merged many departments and will make approximately $5bn in sales after the acquisitions."], "smollm:1.7b": ["The summary should preserve key ideas and details of the original text:\n\n1.", "**Key idea**: Novartis has announced 5.65bn euros ($7.4bn; £3.9bn) of purchases to make its Sandoz unit the world's biggest generic drug producer.", "2.", "**Main points**:\n\t* The deal will see Novartis' Sandoz business overtake Israel's Teva Pharmaceuticals as the world's biggest maker of generics.", "* Based on 2004 figures, the newly merged producer would have sales of more than $5bn, the company estimated.", "* There may be job cuts due to the merger.", "3.", "**Key details**:\n\t* The strong growth outlook for Sandoz, which will create jobs, is expected to partially compensate for necessary reductions in the work force.", "* Producers such as Sandoz can copy the branded products usually after their patent protection expires and can sell them more cheaply as they do not have to pay research and development cost.", "4.", "**Key differences**: The summary should preserve key ideas and details of the original text, including:\n\t+ Key idea: Novartis has announced 5.65bn euros ($7.4bn; £3.9bn) of purchases to make its Sandoz unit the world's biggest generic drug producer.", "+ Main points: The deal will see Novartis' Sandoz business overtake Israel's Teva Pharmaceuticals as the world's biggest maker of generics, based on 2004 figures and estimated sales.", "+ Key details: There may be job cuts due to the merger, but the strong growth outlook for Sandoz is expected to partially compensate for necessary reductions in the work force.", "+ Key differences: The summary should not include any additional information or explanations about the deal, such as the exact amount of the purchase or the specific companies involved."], "deepseek-r1:1.5b": ["Novartis has announced a major acquisition, spending 5.65 billion euros ($7.4 billion) on acquiring Sandoz's Hexal division for part of its U.S. affiliate Eon Labs.", "This deal is expected to yield cost savings of approximately $200 million annually and would make Sandoz the world's largest generic drug producer after merging with Teva Pharmaceuticals, surpassing it by over 150 generic drugmakers globally.", "While the acquisition could lead to job cuts, the strong growth outlook for Sandoz in research and development is seen as a strategic advantage."], "tinyllama:1.1b": ["Novaartis announces a major acquisition trail to become the world's biggest generic drug producer after acquiring Sandoz unit for $5.65 billion and purchasing 67.7% of HexaL US affiliate Eon Lab's shares for $31 per share.", "Novaartis plans to save costs through the acquisitions and make cost savings of about $200 million a year following the deals.", "The deal will see Novaartis become the second-biggest generic drug producer after Israeli Teva Pharmaceuticals, with an estimated annual sales of over $5 billion.", "While analysts have predicted consolidation in a fragmented market, the acquisition is viewed as a risky move by some."], "tinydolphin:1.1b": [" Swiss drugmaker Novartis has acquired the US division of Germany's Hexal Pharma and is set to buy a controlling stake in its American affiliate Eon Labs.", "The company plans to become the largest generic drug producer in the world, overtaking rival Israel's Teva Pharmaceuticals.", "The transaction will likely result in cost savings for Novartis, which will generate $200m annually with the acquisition.", "Novartis, a division of Swiss pharmaceutical giant Schering-Plough, is investing approximately $5bn to merge various departments under its Sandoz brand to create a single global drug producer.", "The company's previous growth outlook forecast suggests that the deal will boost the Sandoz group's revenue by 20% while adding over 16,000 jobs in total.", "Sandoz is expected to be the world's largest generic drug producer by the end of the year.", "The acquisition of Hexal and Eon Labs is expected to make the newly merged Sandoz business significantly larger than any of its current competitors, including Teva Pharmaceuticals.", "The combined entity would generate over $5bn in sales annually with the addition of its own branded products.", "Novartis plans to merge multiple departments under the Sandoz umbrella, which may include those responsible for research and development (R&D) as well as manufacturing.", "This move is seen by some analysts as a way to cut down on costs and invest in future growth while still maintaining the company's reputation for innovation and profitability."], "phi:2.7b": [" Novartis has announced the purchase of German generic drugmaker Hexal and its US affiliate Eon Labs for 5.65bn euros ($7.4bn; £3.9bn) to become the world's biggest generic drug producer.", "The deal is expected to create jobs, but may result in job cuts due to reduced work force.", "Novartis' Sandoz business will have sales of over $5bn annually after the merger with Hexal.", "Generic drugs are cheaper as they do not have to pay for research and development cost.", "Analysts predict consolidation in a fragmented market.", "Some analysts are skeptical about the deal, stating that it is expensive."], "orca-mini:3b": [" Swiss drugmaker Novartis has announced $7.4 billion of purchases for its Sandoz unit to become the world's biggest generic drug producer.", "The company bought all of Germany's Hexal and offered to buy the remaining shares at $31 each.", "The deal will create a new entity with sales of more than $5 billion, while Novartis said that there may be job cuts.", "Generic drugs are chemically identical to their more expensive branded rivals, and Sandoz can copy them after their patent protection expires.", "However, analysts have predicted consolidation in the market.", "Some were initially skeptical about the deal, calling it an expensive acquisition."], "hermes3:3b": [" Novartis buys $7.4b for Sandoz to become world's top generic drug producer, overtake Teva."], "stablelm-zephyr:3b": ["Swiss pharmaceutical company Novartis announced purchasing 5.65 billion euros worth of assets to make its Sandoz unit the world's largest generic drug producer.", "This acquisition will see Novartis' Sandoz business overtake Israel's Teva Pharmaceuticals as the global leader in generics, with estimated sales of over $5bn post-merger.", "The company plans to merge several departments and consider job cuts, while aiming to achieve cost savings of approximately $200m per year following the acquisitions."], "chatgpt-4o-latest": ["Novartis has announced acquisitions worth $7.4 billion to make its Sandoz unit the world's largest generic drug producer.", "The company purchased Germany's Hexal and a majority stake in its U.S. affiliate, Eon Labs, offering to buy the remaining shares.", "Novartis expects annual cost savings of $200 million and will surpass Teva Pharmaceuticals in the generics market, with projected sales exceeding $5 billion.", "The company plans to merge departments, potentially leading to job cuts, though it expects overall job growth.", "Generic drugs are cheaper alternatives to branded medicines, and the market is highly fragmented.", "Some analysts expressed concerns over the high acquisition cost and market challenges."], "stablelm2:1.6b": ["Swiss drugmaker Novartis plans to acquire Sandoz for $7.4bn to become the world's largest generic drug producer.", "The deal will allow Novartis' Sandoz business to surpass Israel's Teva Pharmaceuticals as the leading maker of generics, with an estimated sales of over $5bn.", "After the acquisition, Novartis aims to create cost savings and merge departments, possibly resulting in job cuts."], "granite3.1-dense:2b": ["Novartis, a Swiss pharmaceutical giant, has announced a substantial 5.65 billion euro ($7.4 billion; £3.9 billion) acquisition spree to transform its Sandoz unit into the world's largest generic drug producer.", "This deal includes purchasing all of Germany's Hexal and acquiring 67.7% of its US affiliate Eon Labs, with an offer for the remaining shares at $31 each.", "Novartis anticipates annual cost savings of approximately $200 million following these acquisitions, which will enable Sandoz to surpass Israel's Teva Pharmaceuticals as the global leader in generic drug production.", "The merged entity is projected to generate over $5 billion in sales based on 2004 figures.", "Novartis expects job creation to offset necessary workforce reductions, as Sandoz's growth is expected to drive employment.", "Generic drugs are cheaper alternatives to branded medicines, as they do not require research and development expenses.", "Despite industry fragmentation and potential price pressure in targeted markets, analysts remain cautious about the deal's value."]}