{"raw_text": "MCI shareholder sues to stop bid\n \n A shareholder in US phone firm MCI has taken legal action to halt a $6.75bn (£3.6bn) buyout by telecoms giant Verizon, hoping to get a better deal.\n \n The lawsuit was filed on Friday after Qwest Communications, which had an earlier offer for MCI rejected, said it would submit an improved bid. MCI's directors have backed Verizon, despite it tabling less money. They are accused of breaching their fiduciary duties by depriving MCI shareholders \"of maximum value\".\n \n According the legal papers filed in a Delaware court, Verizon is set to pay an \"\"unconscionable, unfair and grossly inadequate\" sum for MCI, which was formerly known as Worldcom. Qwest said on Wednesday that MCI had rejected a deal worth $8bn. A number of large MCI shareholders expressed unhappiness at the decision, saying that Verizon's offer, made up of cash, shares and dividends, undervalued the company. Friday's lawsuit argues that the Verizon offer makes no provision for future growth prospects and that consolidation in the US phone industry will put a premium on MCI's network, assets and clients. MCI's directors have argued that Verizon is bigger than Qwest, has fewer debts and has built a successful mobile division. Chief executive Michael Capellas spent last week meeting with shareholders in an effort to win their backing.\n \n In 2002, investors in the then-named Worldcom lost millions when the company filed for bankruptcy following an accounting scandal. However, the firm - now renamed MCI - has put its operations in order and emerged from bankruptcy protection last April. It is a long-distance and corporate phone firm, and would provide the buyer with access to a global telecommunications network and a large number of business-based subscribers. MCI shares jumped on Friday, hitting their highest level since April 2004 amid speculation that it would be the focus of a bidding war. A takeover of MCI would be the fifth billion-dollar telecoms deal since October as companies look to cut costs and boost client bases. Earlier this month, SBC Communications agreed to buy its former parent and phone pioneer AT&T for about $16bn.\n", "llama3.2:1b": ["A shareholder in US phone firm MCI has sued Verizon to stop a proposed $6.75 billion buyout, alleging the deal undervalues the company and ignores potential future growth prospects.", "The lawsuit was filed after Qwest Communications rejected an improved bid, with MCI's directors backing Verizon despite missing less money.", "MCI shares have risen amid speculation of a bidding war."], "llama3.2:3b": ["A shareholder in US phone firm MCI has sued Verizon's $6.75bn bid, claiming it undervalues the company, citing no provision for future growth and a lack of consideration for MCI's network and clients.", "Qwest had earlier submitted an offer worth $8bn, which was rejected by MCI directors who instead back Verizon despite its lower valuation."], "gemma2:2b": ["A shareholder in MCI is suing to block Verizon's $6.75 billion acquisition, arguing the deal undervalues the company.", "The lawsuit claims Verizon's offer fails to account for future growth potential and that consolidation will boost MCI's value.", "MCI's directors favor the Verizon deal despite expressing shareholder dissatisfaction over the price."], "qwen2.5:0.5b": ["A shareholder in US telecom firm MCI sued Verizon to halt its bid of $6.", "75 billion for the company.", "The lawsuit claimed that the Verizon offer undervalued MCI, which had previously been known as Worldcom, and put a premium on its network, assets and clients.", "MCI's directors argued that Verizon was bigger than Qwest, had fewer debts and had built a successful mobile division.", "Despite this, MCI shareholders expressed unhappiness at the decision and believed that Verizon would be more aggressive in its takeover of the company."], "qwen2.5:1.5b": ["MCI shareholder sues Verizon over bid worth $6.75bn: MCI shareholders accuse Verizon of undervaluing the company in an attempt to drive up the price by offering more cash, shares, and dividends than Qwest.", "The lawsuit argues that Verizon's offer lacks provisions for future growth prospects, putting a premium on network assets and clients."], "qwen2.5:3b": ["A shareholder in MCI has sued to stop Verizon's $6.75bn buyout, claiming the offer undervalues the company.", "Qwest had previously rejected an earlier offer from Verizon but now claims it will submit a better one, worth up to $8bn.", "The lawsuit alleges that MCI directors breached fiduciary duties by endorsing Verizon, who is accused of underpaying shareholders.", "Qwest argues MCI's network and assets are undervalued given future growth prospects in the US phone industry.", "Despite bankruptcy issues in 2002, MCI has since reformed and could provide a global telecommunications network to buyers.", "This deal would be part of five billion-dollar telecoms deals since October aimed at cost-cutting and expanding client bases."], "opencoder:1.5b": ["The key ideas and details in the text are the legal suit by MCI shareholders against Verizon for a stop bid, the reasons behind the suit being the breach of fiduciary duties and undervaluing of MCI, and the prospects of future growth of Qwest.", "The suit also argues against the company's broader position as a global telecom firm."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details:\n\n1.", "The MCI shareholder has taken legal action to stop a $6.75bn (£3.6bn) bid by Verizon.", "2.", "The lawsuit was filed on Friday after Qwest Communications had an earlier offer rejected, saying it would submit an improved bid.", "3.", "MCI's directors have backed Verizon, despite it tabling less money.", "4.", "Verizon is accused of breaching its fiduciary duties by depriving MCI shareholders \"of maximum value\".", "5.", "The legal papers filed in a Delaware court argue that Verizon's offer makes no provision for future growth prospects and that consolidation in the US phone industry will put a premium on MCI's network, assets and clients.", "6.", "MCI has put its operations in order and emerged from bankruptcy protection last April.", "7.", "It is a long-distance and corporate phone firm, and would provide the buyer with access to a global telecommunications network and a large number of business-based subscribers.", "8.", "MCI shares have risen on Friday, hitting their highest level since April 2004 amid speculation that it would be the focus of a bidding war.", "9.", "Earlier this month, SBC Communications agreed to buy its former parent and phone pioneer AT&T for about $16bn."], "deepseek-r1:1.5b": ["A shareholder in US phone firm MCI has sued Verizon for stopping a $6.75 billion buyout, hoping to secure a better deal.", "The suit was filed against Qwest Communications after submitting an improved bid, but MCI's directors accused breaching fiduciary duties by depriving shareholders of maximum value.", "Verizon is set to pay an \"unconscionable, unfair and grossly inadequate\" sum, according to legal papers in Delaware.", "Qwest rejected a $8bn offer, with the buyer gaining access to a global network and many business subscribers.", "MCI's CEO met shareholders last week to win their backing.", "The deal is part of five billion-dollar telecom deals since October, as companies seek cost-cutting and client expansion.", "MCI, now Worldcom, faced bankruptcy issues before, which is why they seek the buyout.", "MCI shares surged on Friday due to speculation about the deal being part of a bidding war.", "SBC Communications bought AT&T for $16bn."], "tinyllama:1.1b": ["A group of shareholders in US phone firm MCI have taken legal action to stop a $6.75bn (£3.6bn) takeover by telecoms giant Verizon, alleging that they have been deprived of maximum value by the bid's lower price offer.", "The company's former management has accused Qwest Communications of breaching its fiduciary duties and depriving MCI shareholders \"of maximum value\".", "An improving offer from Verizon is being challenged in court, where MCI's directorial board has backed the bidder despite it being offered less money than rival bids.", "The takeover would be the fifth billion-dollar telecoms deal of recent months and is seen as a key part of consolidation in an industry that has faced stiff competition from big tech companies like Google, Amazon, and Facebook."], "tinydolphin:1.1b": [" In a legal battle, shareholders in US phone company MCI have sued to stop the bid made by telecoms giant Verizon, which is valued at $6.75 billion.", "The lawsuit was filed on Friday and accuses MCI's directors of breaching their fiduciary duties by depriving shareholders of maximum value, with a number of large MCI shareholders expressing dissatisfaction with the offer.", "The bid for MCI is worth $8 billion and Qwest Communications has made an earlier offer but it was rejected.", "This legal action comes ahead of a bidding war in which companies look to acquire telecoms companies as they aim to cut costs and expand their operations.", "In recent years, several deals have reached the $10 billion mark, with companies such as SBC Communications, AT&T and Clearwire acquiring smaller companies.", "The takeover of MCI by Verizon would be the fifth billion-dollar telecoms deal in October."], "phi:2.7b": [" A shareholder has sued Verizon to stop a $6.75 billion buyout of MCI on the grounds that it undervalues the company's assets and clients.", "The lawsuit argues that Verizon's offer is \"unconscionable, unfair and grossly inadequate\" and seeks to protect the interests of MCI shareholders."], "orca-mini:3b": [" A shareholder in US phone firm MCI has sued to stop a $6.75 billion takeover by telecoms giant Verizon, arguing that the offer undervalues the company.", "The lawsuit was filed in a Delaware court after Qwest Communications, which had an earlier offer for MCI rejected, submitted an improved bid.", "MCI's directors are backing Verizon, but large shareholders are unhappy with the decision.", "According to legal papers, Verizon's offer makes no provision for future growth prospects and consolidation in the US phone industry would increase the value of MCI's network, assets, and clients.", "The shareholder lawsuit argues that the revised offer undervalues the company and does not provide for future growth opportunities."], "hermes3:3b": ["MCI shareholder sues Verizon's $6.75b acquisition, claiming directors breached fiduciary duties by undervaluing the company."], "stablelm-zephyr:3b": ["A shareholder in US phone firm MCI has filed a lawsuit aiming to halt the $6.75 billion (£3.6bn) buyout by telecoms giant Verizon, hoping to secure a better deal after MCI rejected an offer from Qwest Communications, which then submitted an improved bid.", "The legal papers argue that the Verizon offer undervalues the company due to its lack of provision for future growth prospects and consolidation in the US phone industry will increase the value of MCI's network, assets and clients.", "MCI's directors have supported Verizon despite its lower offer, asserting that it is larger than Qwest, has fewer debts and a successful mobile division."], "chatgpt-4o-latest": ["A shareholder in MCI has sued to block Verizon's $6.75 billion buyout, arguing it undervalues the company and deprives shareholders of maximum value.", "The lawsuit follows Qwest Communications' announcement of an improved bid after its earlier $8 billion offer was rejected.", "MCI's directors support Verizon, citing its financial stability and mobile success, but critics argue the deal ignores future growth potential.", "MCI, formerly Worldcom, emerged from bankruptcy in 2004 and remains a key player in corporate telecommunications.", "The lawsuit comes amid a wave of telecom mergers, including SBC's recent $16 billion acquisition of AT&T.", "MCI shares surged on speculation of a bidding war."], "stablelm2:1.6b": ["A shareholder in MCI (previously Worldcom) has filed a lawsuit against Verizon's $6.5bn acquisition bid, hoping to secure a better deal.", "Qwest Communications initially offered $8bn but was later rejected by MCI.", "The legal papers claim that MCI shareholders will receive an \"unconscionable, unfair and grossly inadequate\" sum from Verizon, which undervalues the company.", "MCI's directors are accused of breaching their fiduciary duties, depriving MCI shareholders of maximum value.", "However, Verizon's offer includes cash, shares, and dividends, while Qwest's offer only included a debt payment.", "Investors expressed unhappiness at the decision, saying that Verizon's offer undervalues the company.", "The lawsuit argues that the Verizon offer does not provide for future growth prospects and puts a premium on MCI's network, assets, and clients.", "MCI's directors argued that Verizon is larger than Qwest, has fewer debts, and has built a successful mobile division.", "Verizon CEO Michael Capellas met with shareholders to win their backing.", "Following Worldcom's bankruptcy in 2001, the company was renamed MCI and emerged from bankruptcy protection in April 2..\nMCI is a long-distance and corporate phone firm that provides access to a global telecommunications network and a large number of business-based subscribers.", "Verizon's acquisition bid will be the fifth billion-dollar telecoms deal since October as companies seek to cut costs and boost client bases."], "granite3.1-dense:2b": ["A shareholder in MCI, a US phone firm previously known as Worldcom, has initiated legal action against Verizon's $6.75 billion buyout proposal, alleging that the directors breached fiduciary duties by not securing a more lucrative deal for shareholders.", "Qwest Communications had earlier offered $8 billion, which MCI rejected due to perceived undervaluation by Verizon's proposed structure of cash, shares, and dividends.", "The lawsuit argues that the offer neglects future growth prospects and disregards the value of MCI's network, assets, and clients in the context of consolidating the US phone industry.", "Despite these concerns, MCI's directors support Verizon, citing its larger size, fewer debts, and successful mobile division as advantages.", "The shareholder lawsuit, filed in a Delaware court, claims that Verizon's offer is unfairly low and does not account for the potential premium from consolidation.", "MCI shares surged following the news of the lawsuit, reaching their highest level since April 2004, as investors speculate about an intensifying bidding war.", "This takeover would be the fifth $1 billion-plus telecoms deal this year, with AT&T recently sold to SBC Communications for approximately $16 billion."]}