{"raw_text": "Mixed reaction to Man Utd offer\n \n Shares in Manchester United were up over 5% by noon on Monday following a new offer from Malcolm Glazer.\n \n The board of Man Utd is expected to meet early this week to discuss the latest proposal from the US tycoon that values the club at £800m ($1.5bn). Manchester United revealed on Sunday that it had received a detailed proposal from Mr Glazer. A senior source at the club told the BBC: \"This time it's different\". The board is obliged to consider this deal. But the Man Utd supporters club urged the club to reject the new deal. Manchester United past and present footballers Eric Cantona and Ole Gunnar Solskjaer, and club manager Sir Alex Ferguson, have lent their backing to the supporters' group, Shareholders United. They have all spoken out against the bid.\n \n A spokesman for the supporters club said: \"I can't see any difference (compared to Mr Glazer's previous proposals) other than £200m less debt. \"He isn't bringing any money into the club; he'll use our money to buy it.\"\n \n Mr Glazer's latest move is being led by Mr Glazer's two sons, Avi and Joel, according to the Financial Times. A proposal was received by David Gill, United's chief executive, at the end of last week, pitched at about 300p a share. David Cummings, head of UK equities for Standard Life Investments, said he believed a \"well funded\" 300p a share bid would be enough for Mr Glazer to take control of the club. \"I do not think there is anything that Manchester United fans can do about it,\" he told the BBC. \"They can complain about it but it is curtains for them. They may not want him but they are going to get him.\" The US tycoon, who has been wooing the club for the last 12 months, has approached the United board with \"detailed proposals\", it has confirmed.\n \n Mr Glazer, who owns the Tampa Bay Buccaneers team, hopes this will lead to a formal bid being accepted. He is believed to have increased the amount of equity in the new proposal, though it is not clear by how much. For his proposal to succeed, he needs the support of United's largest shareholders, the Irish horseracing tycoons JP McManus and John Magnier. They own 29% of United through their Cubic Expression investment vehicle. Mr Glazer and his family hold a stake of 28.1%. But it is not yet known whether Mr McManus and Mr Magnier would support a Glazer bid. NM Rothschild, the investment bank, is advising Mr Glazer, according to the Financial Times. His previous adviser, JPMorgan, quit last year when Mr Glazer went ahead and voted against the appointment of three United directors to the board, against its advice. But the FT said it thought JP Morgan may still have had some role in financing Mr Glazer's latest financial proposal.\n", "llama3.2:1b": ["Man Utd shares rose over 5% by noon on Monday following a new offer from Malcolm Glazer valuing the club at £800m ($1.5bn).", "A senior source says this is different than previous proposals, with £200m less debt mentioned.", "The supporters' club and several former Manchester United players have spoken out against the deal, while David Gill has said it's \"curses for them\".", "Glazer's sons are leading the proposal, and a well-funded bid is expected to be accepted if supported by largest shareholders JP McManus and John Magnier, who own 29% of United."], "llama3.2:3b": ["Manchester United received a £800m ($1.5bn) offer from Malcolm Glazer's family.", "The club is obliged to consider the deal, but supporters' group Shareholders United has urged rejection due to concerns about Glazer not bringing new funds and instead using existing money to buy the club.", "Eric Cantona, Ole Gunnar Solskjaer, and Sir Alex Ferguson have backed the group, while David Cummings believes a well-funded bid of 300p a share would be enough for Glazer to take control."], "gemma2:2b": ["Manchester United shares rose 5% following a new offer from Malcolm Glazer, valuing the club at £800 million.", "The offer includes a detailed proposal to Manchester United but supporters are urging the club to reject it.", "Eric Cantona, Ole Gunnar Solskjaer and Sir Alex Ferguson have also spoken out against the bid.", "Some analysts believe Mr Glazer is likely to succeed in taking control of the club.", "He has increased equity in the latest proposal and aims to gain support from major shareholders JP McManus and John Magnier.", "Mr Glazer's proposals were sent last week, with his financial backing expected to drive the formal bid."], "qwen2.5:0.5b": ["### Summary\n\nMan Utd has received a new offer from Malcolm Glazer at $800m (£150m).", "The club will meet with its supporters group to discuss the deal and weigh different options, including a 300p share bid.", "Glazer's sons are involved in the proposal and his family owns 28.1% of Man Utd through Cubic Expression investment vehicle.", "### Explanation\nThe summary provides a concise overview of the events related to Manchester United (Man Utd), focusing on their new offer from Malcolm Glazer at $800m (£150m) and their supporters group's upcoming meeting.", "The key points are:\n- Manchester United received a new offer from Malcolm Glazer.", "- Man Utd will meet with its Supporters' United Club to discuss the deal.", "- Glazer's sons, Eric Cantona and Ole Gunnar Solskjaer, and Manchester United past and present footballers voiced their opinions.", "- The Supporters' United Club is urging Manchester United to reject the new deal."], "qwen2.5:1.5b": ["Manchester United shares rose after receiving a new bid valued at £800m from Malcolm Glazer, who has been wooing the club for 12 months and is seeking to increase his ownership stake through an equity takeover by increasing it from 29% to around 34%.", "The offer, worth £300 per share, has received strong backing from fans but faces opposition from Glazer's sons."], "qwen2.5:3b": ["Shares in Manchester United rose over 5% by noon on Monday after a new $1.5bn offer from Malcolm Glazer.", "The club’s board is expected to meet this week to discuss the proposal, valued at £800m and offering to reduce debt.", "While supporters’ group Shareholders United urge rejection, past players like Eric Cantona and Sir Alex Ferguson support Mr Glazer's bid, believing he won’t bring money but will use shareholders' money.", "The proposal comes from Avi and Joel Glazer.", "JP Morgan advised Mr Glazer previously but left last year after Glazer rejected their advice on board appointments.", "United’s largest shareholders, Irish investors JP McManus and John Magnier, hold 29% through Cubic Expression, a vehicle.", "However, it is unclear if they will support the bid."], "opencoder:1.5b": ["Mixed reaction to Man Utd offer\n\nShares in Manchester United were up over 5% by noon on Monday following a new offer from Malcolm Glazer.", "The board of Man Utd is expected to meet early this week to discuss the latest proposal from the US tycoon that values the club at £800m ($1.5bn).", "Manchester United revealed on Sunday that it had received a detailed proposal from Mr Glazer.", "A senior source at the club told the BBC: \"This time it's different\".", "The board is obliged to consider this deal, but the Man Utd supporters' club urged the club to reject the new deal.", "Despite his concerns, the club promised to buy the club for about £200m less debt.", "\"I can't see any difference (compared to Mr Glazer's previous proposals) other than £200m less debt,\" he told the BBC."], "smollm:1.7b": ["The summary is concise and objective, preserving key ideas and details while omitting unnecessary information.", "It provides a brief overview of the main points without adding or subtracting any information.", "The text does not include explanations, reasoning processes, or additional context that might be helpful in understanding the topic better."], "deepseek-r1:1.5b": ["Manchester United shares surged by around 5% on Monday after receiving a new offer from Glazer, a US tycoon valued at £800m ($1.5bn).", "The board is expected to meet early next week to discuss the proposal, different from previous ones.", "Man Utd supporters urge them to reject the bid while their past players support Shareholders United.", "A £200m debt difference was noted compared to Glazer's previous ideas, and Glazer aims to increase his equity.", "The offer was made by David Gill and funded by David Cummings, who believes a 300p share bid could work but lacks funds.", "Glazer is aiming for formal acceptance and needs JP McManus and John Magnier to back it, owning 29% each through their investment vehicle.", "NM Rothschild advised Glazer with JPMorgan still possibly involved in financing."], "tinyllama:1.1b": ["The shareholders of Manchester United are opposed to Malcolm Glazer's latest bid for control, which was described as \"well-funded\" and led by his sons Avichai and Joe Glazer.", "The board is expected to consider the offer soon, with David Gill, head of UK equities for Standard Life Investments, saying that \"I do not think there's anything fans can do about it.\"", "However, the US tycoon has been reaching out to the club's largest shareholders, including JP McManus and John Magnier, with a new proposal.", "The Irish horseracing tycoons have increased their equity stake in the new proposal, though it is not yet known whether they would support a Glazer bid.", "While Glazer has approached United's largest shareholders, NM Rothschild, the investment bank, advises him and his family hold a significant equity stake in the club."], "tinydolphin:1.1b": [" Manchester United is set to make a major offer for their football club, valuing it at £800 million ($1.5 billion), as reported by the BBC on Sunday.", "This comes after Malcolm Glazer received a detailed proposal from US tycoon, Eric Cantona, who also happens to be a Manchester United supporter.", "The board of the English soccer team has begun considering this offer, and it is thought that the supporters' group, Shareholders United, will support the new deal.", "However, Manchester United past and present footballers, including Eric Cantona and Ole Gunnar Solskjaer, as well as the club manager Sir Alex Ferguson, have expressed their opposition to Glazer's proposal.", "The main difference between the old proposal and this one is that it involves £200 million less debt than before.", "A spokesman for Shareholders United said: \"I can't see any difference apart from £200 million less debt.\"", "The supporters' club believes that Glazer's latest offer is not enough to buy the club, and it has suggested that a \"well-funded\" bid by David Gill, the UK chief executive of Standard Life Investments, would be enough for him.", "However, it is unclear if shareholders will accept this offer.", "The board and Glazer's representatives are expected to meet soon to discuss the matter further."], "phi:2.7b": [" Manchester United has received a new offer from US tycoon Malcolm Glazer, valued at £800m ($1.5bn).", "The board is expected to consider the proposal this week.", "Manchester United past and present footballers, as well as Shareholders United supporters club, have spoken out against the bid.", "Mr Glazer' sons are leading the proposed buyout, and a  \"well-funded\" 300p a share bid has been received by David Gill, CEO of Manchester United.", "A spokesman for the supporters group said there was no difference between this latest proposal and previous ones, but that £200m less debt would be used to finance the club's purchase.", "Mr Glazer hopes to secure support from the Irish horseracing tycoons, who own 29% of the club, and is believed to have increased his equity stake in the new proposal."], "orca-mini:3b": [" Manchester United shares were up by over 5% on Monday afterboard members received a new offer from US tycoon Malcolm Glazer.", "The board is expected to meet early this week to discuss the proposal, which values the club at £800m ($1.5bn).", "Manchester United revealed on Sunday that it had received a detailed proposal from Mr Glazer, and senior sources at the club told the BBC that the board is obliged to consider the latest deal.", "However, Manchester United fans have urged the club to reject the new offer, citing concerns about the lack of transparency in previous proposals.", "If the board accepts Mr Glazer's latest bid, it will be led by his two sons and David Cummings, head of UK equities for Standard Life Investments.", "The Irish horseracing tycoons JP McManus and John Magnier own 29% of United through their Cubic Expression investment vehicle, but it is not yet known whether they would support a Glazer bid."], "hermes3:3b": ["Manchester Utd shares increase by over 5% after receiving Malcolm Glazer's new £800m ($1.5bn) offer.", "Supporters and past footballers (e.g.", "Cantona, Solskjaer) oppose the bid but believe it is hard to prevent Glazer from taking control of the club."], "stablelm-zephyr:3b": ["A man named Malcolm Glazer wanted to buy a football team called Manchester United.", "They talked about his idea and now they need to discuss it with their board.", "Some people, like Eric Cantona and Ole Gunnar Solskjaer, don't want him to take over the team because they think he won't actually help the club but will use its money to buy it.", "Glazer has asked for 300p per share, and some people believe that is enough for him to control the team.", "He needs support from big shareholders, JP McManus and John Magnier, which hasn't been decided yet."], "chatgpt-4o-latest": ["Shares in Manchester United rose over 5% after Malcolm Glazer made a new £800m ($1.5bn) offer for the club.", "The board is set to review the proposal, but the supporters' group, backed by figures like Eric Cantona, Ole Gunnar Solskjaer, and Sir Alex Ferguson, opposes the bid, arguing Glazer would use the club’s money for the purchase.", "The offer, led by Glazer’s sons, values shares at 300p each, and analysts believe it could secure control.", "Glazer needs the support of major shareholders JP McManus and John Magnier, who own 29% of the club.", "His previous adviser, JPMorgan, had quit, but NM Rothschild is now advising him, with speculation that JPMorgan may still be involved in financing."], "stablelm2:1.6b": ["Manchester United shares rose by 5% after a new £1.5bn ($1.97bn) offer was revealed by Malcolm Glazer, who values the club at this amount from his own funds.", "The board is expected to meet early next week for discussion.", "However, opposition from Shareholders United and past and present footballers like Eric Cantona, Ole Gunnar Solskjaer, and Sir Alex Ferguson urges rejection of the deal.", "Manchester United supporters' group has urged the club to reject the new proposal, with a spokesman stating: \"I can't see any difference (compared to Mr Glazer's previous proposals) other than £1m less debt.\"", "The proposal involves around 10% of shares and faces opposition from largest shareholders, the Irish horseracing tycoons JP McManus and John Magnier."], "granite3.1-dense:2b": ["Manchester United shares surged over 5% on Monday due to a new £800m ($1.5bn) offer from US tycoon Malcolm Glazer.", "The club's board is scheduled to review the proposal, which values Man Utd at this amount and includes reduced debt of about £200m.", "However, supporters' group Shareholders United, backed by former players Eric Cantona, Ole Gunnar Solskjaer, and manager Sir Alex Ferguson, urges a rejection.", "Glazer's offer is expected to be led by his sons, Avi and Joel, and aims at acquiring 29% of the club from Irish horseracing tycoons JP McManus and John Magnier (who hold 28.1%).", "To succeed, Glazer needs their support and that of NM Rothschild, his advisory firm.", "Despite Glazer's previous vote against United board members, it remains unclear if JPMorgan still plays a role in financing this latest proposal.", "The Financial Times suggests Glazer is likely to proceed with the bid, as he sees no alternative but to take control of the club."]}