{"raw_text": "Rescue hope for Borussia Dortmund\n \n Shares in struggling German football club Borussia Dortmund slipped on Monday despite the club agreeing a rescue plan with creditors on Friday.\n \n The club, which has posted record losses and racked up debts, said last week that it was in \"a life-threatening profitability and financial situation\". Creditors agreed on Friday to suspend interest payments until 2007. News of the deal had boosted shares in the club on Friday, but the stock slipped back 7% during Monday morning.\n \n In addition to the interest-payment freeze, Borussia Dortmund also will get short-term loans to help pay salaries. It estimated that it needs almost 30m euros ($39m; £21m) until the end of June if it is to pay its bills. The football club is hoping that all its creditors will agree to defer rent payments on its Westfalen stadium. Borussia officials met with almost all the banks involved in its financing on Friday and over the weekend. Three creditors have yet to agree to the deal struck last week. On 14 March, one of these creditors - property investment fund Molsiris which owns the club's stadium - holds its AGM at which it will discuss the rescue plan. Chief executive Gerd Niebaum stepped down last week and creditors have been pushing for a greater say in how the club is run. Borussia Dortmund also is facing calls to appoint executives from outside the club. The club posted a record loss of 68m euros in the 12 months through June. Adding to its woes, Borussia Dortmund was beaten 5-0 by Bayern Munich on Saturday.\n", "llama3.2:1b": ["Borussia Dortmund shares fell after agreeing with creditors on a rescue plan despite posting record losses and debts.", "The club said it needs €29 million until June to pay bills and has asked for short-term loans to help cover salaries.", "Creditors agreed to defer rent payments on the Westfalen stadium, but three have yet to agree to the deal."], "llama3.2:3b": ["Borussia Dortmund agreed with creditors on Friday to suspend interest payments until 2007 and receive short-term loans to pay salaries.", "Shares slipped back 7% after the initial boost, amid reports that three creditors have yet to agree to the deal.", "The club estimated it needs nearly 30m euros by June to pay bills, including rent for its Westfalen stadium, which is owned by a creditor holding an AGM on March 14."], "gemma2:2b": ["Borussia Dortmund's shares dropped despite agreeing a debt rescue plan with creditors on Friday.", "The deal includes interest payment suspension and short-term loans to cover salary expenses.", "The club hopes for rent payment deferrals from its stadium landlord, but three creditors remain undecided.", "A key meeting is planned for March 14th to discuss the agreement.", "Borussia Dortmund faces financial struggles and a significant loss in revenue.", "Their latest defeat to Bayern Munich has added to these challenges."], "qwen2.5:0.5b": ["Borussia Dortmund's shares fell after agreeing with creditors and receiving short-term loans, which helped boost shares but also faced financial problems including debts and profitability issues."], "qwen2.5:1.5b": ["German football club Borussia Dortmund's shares fell after agreeing to a loan and interest-payment suspension plan but failed to fully recover from Friday's rise following creditors' agreement.", "The club needs €30 million until June 2019 to cover bills, with some lenders still refusing the deal struck earlier.", "The rescue efforts include short-term loans for salaries and rent deferments on stadium payments."], "qwen2.5:3b": ["Rescue plan agreed for struggling Borussia Dortmund but shares slip after Friday's deal.", "Club reported record losses and debts, with creditors suspending interest payments until 2007, boosting Friday's stock.", "Needs €30m by June to pay bills; hope for deferred stadium rent payments and greater creditor involvement in running the club.", "Recent loss of €68m through June; Borussia Dortmund narrowly lost to Bayern Munich on Saturday."], "opencoder:1.5b": ["Rescue hope for Borussia Dortmund\n\nBorussia Dortmund shares have struggled with a debt-heavy football club after the club posted record losses and incurred debts, but agreed to suspend interest payments until 2007 due to financial situation.", "The club reported that it was in \"a life-threatening profitability and financial situation\".", "The agreement with creditors on Friday helped bolster the club's shares during Monday morning.", "In addition, Borussia Dortmund will also get short-term loans to pay salaries, estimated that it will need around $39 million until the end of June if it can pay its bills.", "The club has been posting news of significant losses and racked up debts over the weekend, but the stock has slipped back 7%.", "The club has also met with almost all the banks involved in its financing on Friday and is planning to discuss further about the deal as per investor feedback.", "Three of the creditors have yet to agree to the deal last week and the club's property investment fund Molsiris, which owns the Westfalen stadium, has held it at the AGM discussing the plan.", "The club also expressed calls to appoint executives from outside the club and was beaten in a friendly match Saturday."], "smollm:1.7b": ["Borussia Dortmund's share price slipped on Monday morning due to the agreement with creditors on Friday that it would suspend interest payments until 2007.", "The club agreed a rescue plan with creditors, which included short-term loans and a debt repayment schedule, but the deal did not include any guarantees of future payment or other financial commitments.", "Borussia Dortmund's management team met with almost all its creditors on Friday to discuss the rescue plan, but three creditors have yet to agree to the deal struck last week.", "On 14 March, one of these creditors - property investment fund Molsiris which owns the club's stadium - holds its AGM at which it will discuss the rescue plan.", "Chief executive Gerd Niebaum stepped down last week and creditors have been pushing for a greater say in how the club is run.", "Borussia Dortmund also is facing calls to appoint executives from outside the club, but the club did not reveal any new management changes.", "The club posted a record loss of 68m euros in the 12 months through June.", "Adding to its woes, Borussia Dortmund was beaten 5-0 by Bayern Munich on Saturday."], "deepseek-r1:1.5b": ["Borussia Dortmund's shares slipped despite agreeing a rescue deal with creditors.", "The club had high losses and debts, agreed to suspend interest payments until 2007, causing the stock to drop by 7%.", "They will receive short-term loans for salaries, estimated at nearly 30 million euros, which must be paid before June ends.", "Three creditors haven't agreed, with one's AGM scheduled next week, and they are facing criticism from creditors who want all of them on board.", "The club also faces criticism over calls to appoint external executives and has a record loss of 68 million euros through June."], "tinyllama:1.1b": ["Borussia Dortmund shares fell sharply on Monday despite the club agreeing a rescue plan with creditors on Friday that includes interest payment freezes and short-term loans to help pay salaries.", "The football club estimates it needs almost 30m euro ($39m; £21m) until June if it is to make all its debts, including rent repayments on Westfalen Stadium.", "Borussia Dortmund officials met with three creditors last week and have yet to agree the rescue deal struck last week.", "The club's chief executive Gerd Niebaum stepped down in March, but creditors are pushing for greater control over how it is run.", "Borussia Dortmund also faces calls to appoint executives from outside the club.", "It posted a record loss of 68m euro ($102m; £71m) in the 12 months through June, adding to its woes after being beaten 5-0 by Bayern Munich on Saturday."], "tinydolphin:1.1b": [" Borussia Dortmund, a struggling German football club, has been saved from financial ruin following an agreement with creditors that allows them to temporarily suspend interest payments until the end of June.", "The team is hoping that by postponing its debts, they can better manage their finances and avoid bankruptcy.", "Borussia Dortmund is set to receive short-term loans from creditors, which could help them cover their bills while they work out a long-term solution with other creditors.", "The club's financial troubles began in 2005 when it posted record losses of 68 million euros in the 12 months through June.", "Borussia Dortmund is owned by several investment funds, including one called Molsiris, which owns the stadium.", "The club's chief executive, Gerd Niebaum, stepped down last week and was replaced by a company executive earlier this month.", "Several creditors have expressed interest in appointing new executives from outside the team, but Borussia Dortmund officials are hopeful that the deal will be approved at an upcoming creditors meeting, which is scheduled for April 14."], "phi:2.7b": [" Despite agreeing a rescue plan with creditors last week, shares in German football club Borussia Dortmund fell back 7% during Monday morning as it announced that it needs almost 30m euros until the end of June to pay bills.", "The club also hopes that all its creditors will agree to defer rent payments on its stadium to help alleviate its financial situation."], "orca-mini:3b": [" Borussia Dortmund reached a rescue plan with creditors on Friday, but shares slipped back 7% on Monday as some creditors refused to agree to the deal.", "The club needs almost 30 million euros until June if it wants to pay its bills and is facing calls to appoint executives from outside the club.", "Three creditors have not agreed to the deal struck last week.", "On 14 March, one of these creditors - Molsiris which owns the club's stadium - will hold an AGM where it will discuss the rescue plan."], "hermes3:3b": ["Borussia Dortmund shares fall despite financial rescue plan; club agrees to interest suspension and short-term loans for salaries until end-Jun 2016, aiming for creditors to defer rent payments on Westfalen stadium."], "stablelm-zephyr:3b": ["Borussia Dortmund's shares dropped despite agreeing to a rescue plan with creditors, which includes suspending interest payments and providing short-term loans for salaries.", "The football club needs around 30 million euros ($39m) until June to pay bills, and hopes that all creditors will defer rent payments on its Westfalen stadium.", "Three creditors have not yet agreed to the deal, and calls are growing for external executives to be appointed."], "chatgpt-4o-latest": ["Borussia Dortmund's shares fell despite securing a rescue plan with creditors to address its severe financial crisis.", "Creditors agreed to suspend interest payments until 2007, and the club will receive short-term loans to cover salaries, needing nearly 30 million euros by June.", "The club is also seeking rent deferrals on its stadium, with three creditors yet to approve the deal.", "Property investment fund Molsiris will discuss the plan at its AGM on 14 March.", "CEO Gerd Niebaum resigned, and creditors are demanding more influence over the club's management.", "The club posted a record 68 million euro loss and suffered a 5-0 defeat to Bayern Munich."], "stablelm2:1.6b": ["Borussia Dortmund's shares dropped after agreeing a rescue plan with creditors, despite earlier gains.", "Club, struggling financially and posting record losses, estimated almost €7m ($7.3m; £6.9m) until the end of June to pay bills.", "It hopes for all its creditors to agree to defer rent payments on stadium.", "Three creditors yet to agree to deal, including property investment fund Molsiris which holds club's stadium in AGM set for March.", "Borussia Dortmund also facing calls to appoint executives from outside the club after posting a record loss of €5m ($5.3m; £4.7m) in six months through June and being beaten 5-0 by Bayern Munich."], "granite3.1-dense:2b": ["Borussia Dortmund, a German football club with severe financial issues and record losses of 68 million euros in the past year, agreed to a rescue plan with creditors on Friday.", "This included suspending interest payments until 2007 and arranging for short-term loans to cover salaries and operational expenses, estimated at nearly 30 million euros until June.", "Despite this relief, shares in the club dropped by 7% on Monday following the deal announcement.", "The club aims for all creditors, including a property investment fund that owns its stadium, to defer rent payments.", "Chief executive Gerd Niebaum resigned last week, and creditors are advocating for increased involvement in the club's management.", "Additionally, Dortmund faces pressure to appoint executives from outside the team.", "The club was defeated 5-0 by Bayern Munich on Saturday, further exacerbating its financial strain."]}