{"raw_text": "Gaming firm to sell UK dog tracks\n \n Six UK greyhound tracks have been put up for sale by gaming group Wembley as part of a move which will lead to the break-up of the group.\n \n Wembley announced the planned sale as it revealed it was to offload its US gaming division to BLB Investors. US gaming consortium BLB will pay $339m (£182.5m) for the US unit, although the deal is subject to certain conditions. BLB holds a 22% stake in Wembley and last year came close to buying the whole firm in a £308m takeover deal. Shares in Wembley were up 56 pence, or 7.6%, at 797p by mid-morning.\n \n The sale of the US gaming unit will leave Wembley with its UK business. This includes greyhound tracks at Wimbledon in London, Belle Vue in Manchester, Perry Barr and Hall Green in Birmingham, Oxford and Portsmouth. Analysts have valued the six tracks at between £40m-£50m. The US business accounts for about 90% of Wembley's operating profit and consists of operations in Rhode Island and Colorado. BLB's purchase of the US unit is subject to the agreement of a revenue-sharing deal being struck with Rhode Island authorities. Wembley said that, once the deal was completed, it anticipated returning surplus cash to shareholders. \"Whilst the completion of the sale of the US Gaming Division remains subject to a number of conditions, we believe this development is a positive step towards the maximisation of value for shareholders,\" said Wembley chairman Claes Hultman. Wembley sold the English national football stadium in 1999 to concentrate on its gaming operations.\n", "llama3.2:1b": ["Wembley, a UK gaming firm, plans to sell six greyhound tracks including Wimbledon and Belle Vue to US conglomerate BLB Investors in exchange for $339m (£182.5m).", "The sale leaves Wembley with its UK business.", "The deal is subject to certain conditions, but analysts estimate the value of the tracks at between £40m-£50m."], "llama3.2:3b": ["Gaming firm Wembley to sell six UK greyhound tracks, which are valued at £40m-£50m, as part of a move to break up and focus on its UK business following the sale of its US division for $339m (£182.5m)."], "gemma2:2b": ["Wembley, a gaming company, is selling six UK greyhound tracks to BLB Investors for $339 million.", "This sale will lead to the breakup of Wembley and leaves them with their UK business, which includes Greyhound tracks at Wimbledon, Belle Vue, Perry Barr, Hall Green, Oxford, and Portsmouth.", "The US gaming unit accounts for about 90% of Wembley's operating profit.", "The deal is subject to a revenue-sharing agreement with Rhode Island authorities and will likely lead to surplus cash being returned to shareholders."], "qwen2.5:0.5b": ["The US-based gaming group Wembley has announced it will sell its UK greyhound tracks to US investors BLB Investors, who hold a 22% stake in Wembley.", "The sale leaves Wembley with its UK businesses, including greyhound tracks at Wimbledon, Belle Vue, Perry Barr, Hall Green, Oxford, and Portsmouth."], "qwen2.5:1.5b": ["Gaming firm Wembley plans to sell six UK greyhound tracks to BLB Investors for $339m, leaving it with a UK business including track facilities at various locations.", "The sale of the US division is expected to result in revenue-sharing agreements and increased shareholder value potential.", "Wembley's acquisition of the US unit was previously considered but ultimately not pursued due to unfavorable conditions."], "qwen2.5:3b": ["Gaming firm Wembley plans to sell six UK greyhound tracks, as part of a move that will see the company split into UK and US business units.", "Wembley is offloading its US gaming division for $339m (£182.5m) to BLB Investors, which holds a 22% stake in Wembley.", "The sale leaves Wembley with its UK operations, valued at between £40m-£50m, including tracks in London, Manchester, Birmingham, and Portsmouth.", "Analysts estimate the US business accounts for about 90% of Wembley's operating profit.", "BLB must agree to a revenue-sharing deal with Rhode Island authorities before the sale can be completed.", "Wembley chairman Claes Hultman believes this development maximizes shareholder value."], "opencoder:1.5b": ["Gaming firm to sell UK dog tracks, Wembley announced the planned sale as it revealed it was to offload its US gaming division to BLB Investors.", "US gaming consortium BLB will pay $339m (£182.5m) for the US unit.", "Shares in Wembley were up 56 pence, or 7.6%, at 797p by mid-morning.", "The UK business includes greyhound tracks at Wimbledon in London, Belle Vue in Manchester, Perry Barr and Hall Green in Birmingham, Oxford and Portsmouth.", "The company accounts for about 90% of Wembley's operating profit."], "smollm:1.7b": ["The summary should be:\nGaming firm to sell UK dog tracks\nSix UK greyhound tracks have been put up for sale by gaming group Wembley as part of a move which will lead to the break-up of the group.", "Wembley announced the planned sale as it revealed it was to offload its US gaming division to BLB Investors.", "US gaming consortium BLB will pay $339m (£182.5m) for the US unit, although the deal is subject to certain conditions.", "BLB holds a 22% stake in Wembley and last year came close to buying the whole firm in a £308m takeover deal.", "Shares in Wembley were up 56 pence, or 7.6%, at 797p by mid-morning.", "The sale of the US gaming unit will leave Wembley with its UK business.", "This includes greyhound tracks at Wimbledon in London, Belle Vue in Manchester, Perry Barr and Hall Green in Birmingham, Oxford and Portsmouth.", "Analysts have valued the six tracks at between £40m-£50m.", "The US business accounts for about 90% of Wembley's operating profit and consists of operations in Rhode Island and Colorado.", "BLB's purchase of the US unit is subject to the agreement of a revenue-sharing deal being struck with Rhode Island authorities.", "Wembley said that, once the deal was completed, it anticipated returning surplus cash to shareholders.", "\"Whilst the completion of the sale of the US Gaming Division remains subject to a number of conditions, we believe this development is a positive step towards the maximization of value for shareholders,\" said Wembley chairman Claes Hultman.", "Wembley sold the English national football stadium in 1999 to concentrate on its gaming operations."], "deepseek-r1:1.5b": ["The gaming company Wembley is selling its US gaming division worth $339 million, which is subject to certain conditions with Rhode Island authorities and the possibility of returning surplus cash to shareholders.", "In exchange, they will buy back UK greyhound tracks in London, Manchester, Birmingham, Oxford, and Portsmouth.", "These tracks were previously part of Wembley's UK business.", "The US gaming unit accounts for approximately 90% of their operating profit and is based in Rhode Island and Colorado.", "Wultman, chairman of Wembley, believes this development will maximize value for shareholders."], "tinyllama:1.1b": ["Gaming firm Weimbely has put six UK greyhound tracks up for sale, as part of a move towards break-up with US gaming conglomerate BLB Investoars.", "The sale includes a stake in the entire group and was subject to certain conditions, but shareholders are expected to benefit financially from the transaction once it is completed.", "Weimbely revealed last year that it had entered into discussions regarding its US gaming division, which is also being sold.", "The six tracks at Wiembladon in London, Belle Vue in Manchester, Perry Barr and Hall Green in Birmingham, Oxford and Portsmouth are part of the sale.", "Analysts estimate that Weimbely's UK business, including greyhound tracks, accounts for around 90% of its operating profit, but the US division is expected to provide a significant portion of revenue once the deal is completed.", "The group has said it anticipates returning surplus cashe from the sale to shareholders."], "tinydolphin:1.1b": [" Wembley has decided to sell six UK greyhound tracks, totaling approximately £40 million, in a bid to break up the firm.", "The move is part of an overhaul plan that also involves Wembley and its US gaming division, BLB Investors.", "The sale of these tracks will see the company return surplus cash to shareholders.", "Shares in Wembley were trading at £79.50 by mid-morning, up 56 pence or 7.6%."], "phi:2.7b": [" Six UK greyhound tracks are being sold by gaming firm Wembley as part of the group's move to break up, with a US gaming consortium called BLB Investors set to buy the American division for $339 million.", "This will leave Wembley with its UK business, which includes six greyhound tracks worth between £40m-£50m."], "orca-mini:3b": [" Gaming company Wembley is selling six greyhound tracks in the UK, including Wimbledon and Perry Barr, for sale by group chairman Claes Hultman.", "The US business of Wembley includes Rhode Island and Colorado, but a revenue-sharing deal with authorities is expected.", "Wembley is also planning to return surplus cash to shareholders once the deal is complete."], "hermes3:3b": ["Gaming company Wembley sells UK greyhound tracks for sale, as US division to be bought by BLB Investors for $339m."], "stablelm-zephyr:3b": ["Gaming firm Wembley is selling six UK greyhound tracks as part of a business break-up move, offloading its US gaming division to BLB Investors for $339m ($182.5m).", "The sale includes Wembley's greyhound tracks in London, Manchester, Birmingham, Oxford, and Portsmouth.", "Analysts value the six UK tracks at between £40m-£50m.", "BLB holds a 22% stake in Wembley and previously attempted to buy the entire firm for £308m.", "The revenue-sharing deal with Rhode Island authorities must be agreed before the completion of the sale."], "chatgpt-4o-latest": ["Gaming group Wembley is selling six UK greyhound tracks as part of a broader breakup strategy.", "The company is also offloading its US gaming division to BLB Investors for $339 million, pending certain conditions, including a revenue-sharing agreement with Rhode Island authorities.", "The US business, which contributes 90% of Wembley's operating profit, includes operations in Rhode Island and Colorado.", "The UK tracks, valued at £40m-£50m, include locations in London, Manchester, Birmingham, Oxford, and Portsmouth.", "Wembley plans to return surplus cash to shareholders once the deal is completed.", "Shares in Wembley rose 7.6% following the announcement."], "stablelm2:1.6b": ["Gaming group Wembley is selling six UK greyhound tracks as part of an announcement revealing plans to offload its US gaming division.", "The sale will result in a break-up of the group, with shares in Wembley up 7.6% at mid-day, and analysts valuing the tracks at between £5-£10 million.", "Wembley's UK business includes these tracks and is also part of operations in Rhode Island and Colorado.", "The sale of the US gaming unit will leave Wembley with its UK business."], "granite3.1-dense:2b": ["Wembley, a UK-based gaming company, plans to sell six UK greyhound tracks—Wimbledon, Belle Vue, Perry Barr, Hall Green, Oxford, and Portsmouth—as part of a broader restructuring.", "The US gaming division will be sold to BLB Investors for $339m (£182.5m), pending conditions.", "This transaction leaves Wembley with its UK operations, which are valued between £40m-£50m and contribute significantly to the company's profit.", "The US business, accounting for about 90% of Wembley's operating profit, operates in Rhode Island and Colorado.", "BLB's acquisition is contingent on a revenue-sharing agreement with Rhode Island authorities.", "Upon completion, Wembley intends to distribute surplus cash to shareholders.", "This move follows Wembley's 1999 sale of the English national football stadium to focus on gaming operations."]}