{"raw_text": "Call to save manufacturing jobs\n \n The Trades Union Congress (TUC) is calling on the government to stem job losses in manufacturing firms by reviewing the help it gives companies.\n \n The TUC said in its submission before the Budget that action is needed because of 105,000 jobs lost from the sector over the last year. It calls for better pensions, child care provision and decent wages. The 36-page submission also urges the government to examine support other European countries provide to industry. TUC General Secretary Brendan Barber called for \"a commitment to policies that will make a real difference to the lives of working people.\"\n \n \"Greater investment in childcare strategies and the people delivering that childcare will increases the options available to working parents,\" he said. \"A commitment to our public services and manufacturing sector ensures that we can continue to compete on a global level and deliver the frontline services that this country needs.\" He also called for \"practical measures\" to help pensioners, especially women who he said \"are most likely to retire in poverty\". The submission also calls for decent wages and training for people working in the manufacturing sector.\n", "llama3.2:1b": ["The Trades Union Congress is calling on the government to review support given to manufacturing companies, citing 105,000 job losses over the past year.", "It urges the government to improve pensions, childcare provision, and wages, as well as examine policies provided by other European countries.", "The union also calls for investment in childcare strategies and training for workers in the sector."], "llama3.2:3b": ["The Trades Union Congress is calling on the government to review its support for manufacturing firms amid 105,000 job losses over the last year.", "The TUC urges better pensions, child care provision, decent wages, and investment in childcare strategies, as well as examining support provided by European countries."], "gemma2:2b": ["The Trades Union Congress (TUC) urges the government to address job losses in manufacturing by reviewing support policies and improving pensions, childcare, and wages.", "The TUC suggests comparing support programs with other European countries.", "They call for investment in childcare services and public services, especially focusing on helping pensioners."], "qwen2.5:0.5b": ["Key ideas and details from the text:\n\n  * Manufacturing jobs are at risk due to job losses.", "* The TUC is calling on the government to address this issue by reviewing its support for manufacturing firms.", "* Better pensions, child care provision, and decent wages are needed for manufacturing firms.", "* Greater investment in childcare strategies would increase options for working parents.", "* A commitment to public services and the manufacturing sector ensures continued global competitiveness and frontline services.", "* Deeper measures to improve wages and training for workers in the manufacturing sector would be helpful."], "qwen2.5:1.5b": ["The Trades Union Congress (TUC) has urged the government to review support for manufacturing jobs due to a 105,000 job loss over the past year, emphasizing better pensions, childcare, wages, and investments in public services such as childcare and pensions."], "qwen2.5:3b": ["The Trades Union Congress (TUC) urges the government to review support for manufacturing firms to stem job losses following a 105,000 job reduction over the past year.", "Key demands include better pensions, child care provision, decent wages, and investment in childcare strategies.", "TUC also calls for supporting public services and manufacturing sector to ensure global competitiveness and frontline service delivery.", "Additionally, they advocate for practical measures to help pensioners, particularly women at risk of poverty upon retirement, as well as training for workers in the manufacturing industry."], "opencoder:1.5b": ["The government plans to save jobs by investing in better childcare strategies and providing more support to working parents.", "They are committed to improving public services and ensuring a frontline job market that meets the needs of all people, including those living below the poverty line.", "A commitment to practical measures will also help pensioners.", "The increased investment in manufacturing sector ensures continued competition and delivery of necessary service levels."], "smollm:1.7b": ["The Trades Union Congress (TUC) is calling on the government to stem job losses in manufacturing firms by reviewing the help it gives companies.", "The 36-page submission before the Budget urges the government to examine better pensions, child care provision and decent wages for working people.", "The TUC General Secretary Brendan Barber called for \"a commitment to policies that will make a real difference to the lives of working people.\"", "The TUC also calls for greater investment in childcare strategies and the people delivering that childcare to increase the options available to working parents.", "A commitment to our public services and manufacturing sector ensures that we can continue to compete on a global level and deliver the frontline services that this country needs.", "The submission also calls for practical measures to help pensioners, especially women who are most likely to retire in poverty.", "The TUC General Secretary also called for decent wages and training for people working in the manufacturing sector."], "deepseek-r1:1.5b": ["The TUC calls for a push to save manufacturing jobs through improved welfare and wages, urging the government to address 105,000 job losses from the past year.", "They call for better pensions, child care, and decent wages.", "The proposal also asks the government to examine policies from other countries and review support for the manufacturing sector's investment in childcare.", "TUC Secretary Brendan Barber emphasizes a commitment to policies that make a real difference."], "tinyllama:1.1b": ["Summary: The Trade Union Congress (TUC) is calling on the government to review its help given to companies in manufacturing sectors by offering better child care, wages, and support, particularly for women penning out of poverty.", "They urge for stronger policies that will make a real difference to the lives of working people and ensure continued competitiveness in global markets.", "The TUC recommends improving support for public services and the manufacturing sector as well as investing more in childcare policies."], "tinydolphin:1.1b": [" The Trades Union Congress (TUC) is urging the government to take action to stem job losses in manufacturing firms by reviewing the support it provides companies.", "The TUC says that the government must invest more in childcare strategies and provide better pensions, child care provision, and decent wages for workers in industries like manufacturing.", "The union believes that a commitment to policies that make a real difference to the lives of working parents is essential to ensure that working people can continue to compete on a global level and deliver the frontline services that this country needs."], "phi:2.7b": [" The Trades Union Congress (TUC) is urging the government to review its support for companies in manufacturing as it has resulted in 105,000 jobs being lost over the last year.", "TUC General Secretary Brendan Barber called for better pensions, child care provision, decent wages and greater investment in childcare strategies to increase options available to working parents.", "The submission also calls for practical measures to help pensioners, especially women who are most likely to retire in poverty.", "Additionally, TUC is urging a commitment to public services and manufacturing sector to ensure that the country can compete on a global level and deliver frontline services needed by the nation."], "orca-mini:3b": [" The Trades Union Congress (TUC) is calling on the government to save manufacturing jobs by reviewing help given to companies, including better pensions, child care provision, and decent wages.", "They urge the government to examine support provided by other European countries to industry.", "The TUC also calls for greater investment in public services and the manufacturing sector."], "hermes3:3b": ["TUC calls for government to review manufacturing support to save jobs, demanding better pensions, childcare provision, wages, and examining other European countries' industry assistance."], "stablelm-zephyr:3b": ["The Trades Union Congress (TUC) is urging the government to prevent further job losses in the manufacturing industry by reviewing its support for companies.", "They propose improving pensions, childcare, and wages while examining policies implemented in other European countries.", "TUC General Secretary Brendan Barber emphasizes the need for meaningful policy changes to improve the lives of working people."], "chatgpt-4o-latest": ["The Trades Union Congress (TUC) is urging the government to address job losses in manufacturing by reviewing its support for companies.", "In its Budget submission, the TUC highlights the loss of 105,000 jobs in the sector over the past year and calls for better pensions, childcare provision, and fair wages.", "It also suggests examining how other European countries support their industries.", "TUC General Secretary Brendan Barber emphasizes investment in childcare, public services, and manufacturing to maintain global competitiveness.", "He also advocates for measures to assist pensioners, particularly women, and for improved wages and training in the manufacturing sector."], "stablelm2:1.6b": ["The Trades Union Congress (TUC) urges the government to review support for companies in the manufacturing industry to prevent job losses and calls for better pensions, child care provision, and decent wages.", "In their budget submission, they note the loss of jobs over the past year and suggest examining support provided by other European countries.", "TUC General Secretary Brendan Barber emphasizes investing in childcare options for working parents and practical measures to help pensioners, particularly women who are most likely to retire in poverty.", "The TUC also requests decent wages and training for people in the manufacturing sector."], "granite3.1-dense:2b": ["The Trades Union Congress (TUC) has urged the government to address job losses in UK manufacturing, which have resulted in 105,000 job cuts over the past year.", "In a 36-page submission for the upcoming Budget, the TUC advocates for enhanced pensions, improved childcare provisions, and fair wages for workers in this sector.", "The TUC also recommends studying supportive policies implemented by European nations to industries.", "General Secretary Brendan Barber emphasized the importance of increased investment in childcare and public services to maintain global competitiveness and provide essential frontline services.", "Furthermore, he highlighted the need for practical measures to assist pensioners, particularly women at risk of retiring in poverty, along with decent wages and training opportunities for manufacturing employees."]}