{"raw_text": "Shares rise on new Man Utd offer\n \n Shares in Manchester United closed up 4.75% on Monday following a new offer from US tycoon Malcolm Glazer.\n \n The board of the football club is expected to meet early this week to discuss the latest proposal, which values the club at £800m ($1.5bn). Manchester United revealed on Sunday that it had received a detailed proposal from Mr Glazer, which looks set to receive more serious scrutiny. The club has previously rejected Mr Glazer's approaches out of hand. But a senior source at the club told the BBC: \"This time it's different.\" Supporters' group Shareholders United, however, urged the club to reject the new deal.\n \n A spokesman for the Shareholders United said: \"I can't see any difference (compared to Mr Glazer's previous proposals) other than £200m less debt. \"He isn't bringing any money into the club; he'll use our money to buy it.\"\n \n Mr Glazer's latest move is being led by Mr Glazer's two sons, Avi and Joel, according to the Financial Times. A proposal was received by David Gill, United's chief executive, at the end of last week, pitched at about 300p a share. David Cummings, head of UK equities for Standard Life Investments, said he believed a \"well funded\" 300p a share bid would be enough for Mr Glazer to take control of the club.\n \n \"I do not think there is anything that Manchester United fans can do about it,\" he told the BBC. \"They can complain about it but it is curtains for them. They may not want him but they are going to get him.\" The US tycoon, who has been wooing the club for the last 12 months, has approached the United board with \"detailed proposals\", it has confirmed.\n \n Mr Glazer, who owns the Tampa Bay Buccaneers team, hopes this will lead to a formal bid being accepted. He is believed to have increased the amount of equity in the new proposal, though it is not clear by how much. For his proposal to succeed, he needs the support of United's largest shareholders, the Irish horseracing tycoons JP McManus and John Magnier. They own 29% of United through their Cubic Expression investment vehicle. Mr Glazer and his family hold a stake of 28.1%. But it is not yet known whether Mr McManus and Mr Magnier would support a Glazer bid. NM Rothschild, the investment bank, is advising Mr Glazer, according to the Financial Times. His previous adviser, JPMorgan, quit last year when Mr Glazer went ahead and voted against the appointment of three United directors to the board, against its advice. But the FT said it thought JP Morgan may still have had some role in financing Mr Glazer's latest financial proposal.\n", "llama3.2:1b": ["Shares in Manchester United rose 4.75% on Monday following a new offer from US tycoon Malcolm Glazer valued at £800m ($1.5bn).", "The club had previously rejected Glazer's approaches due to concerns about his approach to debt and control, but supporters of the bid are urging the club to reject it.", "Glazer is being led by his sons Avi and Joel, who have approached United with detailed proposals, and a new investment from NM Rothschild to support the bid.", "The Irish horseracing tycoons JP McManus and John Magnier own significant stakes in United through their Cubic Expression investment vehicle but are uncertain about supporting Glazer's bid."], "llama3.2:3b": ["Shares in Manchester United rose 4.75% after US tycoon Malcolm Glazer made a new offer worth £800m ($1.5bn).", "The board is expected to meet this week to discuss the proposal, which includes a stake of 28.1%.", "Supporters' group Shareholders United urged the club to reject the deal, while others believe it could lead to a formal bid being accepted.", "JP McManus and John Magnier own 29% of the club, and their support is needed for Mr Glazer's proposal to succeed."], "gemma2:2b": ["Manchester United shares rose 4.75% on Monday following a new offer from Malcolm Glazer, who values the club at £800 million.", "The offer includes less debt than previous attempts and is being led by Glazer's sons.", "Some believe this offer may succeed because it is well funded and would likely lead to a formal bid for control of the club.", "However, supporters' group Shareholders United urge rejection, claiming Glazer doesn’t bring new money and will instead use existing funds.", "Mr. Glazer's success hinges on support from major shareholders JP McManus and John Magnier, who hold 29% of shares.", "He is being advised by NM Rothschild after his previous advisor left due to disagreements with the club."], "qwen2.5:0.5b": ["Manchester United shares rose 4.75% on Monday following a new offer from US tycoon Malcolm Glazer.", "Shares were expected to meet the latest proposal, valued at £800m ($1.5bn).", "The club received a detailed proposal from Mr Glazer, who previously rejected it out of hand.", "Shareholders United expressed their concern about the new deal, while Manchester United's senior source urged rejection.", "Shares closed higher as investors anticipated further development of the current offer."], "qwen2.5:1.5b": ["Manchester United shares rise 4.75% following new offer from US tycoon Malcolm Glazer valued at £800m ($1.5bn), while supporters urge rejection due to lower bid amount and lack of investment plans, with senior club sources suggesting it is a \"different\" offer than previous ones."], "qwen2.5:3b": ["Shares in Manchester United rose 4.75% on Monday after a new offer from US tycoon Malcolm Glazer valued the club at £800m ($1.5bn).", "The board is expected to meet early this week to discuss the proposal, which values the club at £800m and looks set for serious consideration despite previous rejections.", "Shareholders United urged rejection of the deal, noting no substantive changes except a reduction in debt.", "Glazer's sons are leading the new move with a 300p per share offer; UK equity expert David Cummings believes this price would be enough to secure control.", "Glazer faces opposition from Irish shareholders JP McManus and John Magnier, whose support is needed for his bid.", "Financial advisers like NM Rothschild are now advising him, with JPMorgan previously supporting a previous attempt but no longer directly involved."], "opencoder:1.5b": ["Shares rise on new Man Utd offer\n\nShares in Manchester United closed up 4.75% on Monday following a new offer from US tycoon Malcolm Glazer.", "The board of the football club is expected to meet early this week to discuss the latest proposal, which values the club at £800m ($1.5bn).", "Manchester United revealed on Sunday that it had received a detailed proposal from Mr Glazer, which looks set to receive more serious scrutiny.", "However, a senior source at the club told the BBC: \"This time it's different.\"", "Supporters' group Shareholders United, however, urged the club to reject the new deal.", "The US tycoon, who has been wooing the club for the last 12 months, has approached the United board with \"detailed proposals\", it has confirmed."], "smollm:1.7b": ["Shares in Manchester United closed up 4.75% on Monday following a new offer from US tycoon Malcolm Glazer.", "The board of the football club is expected to meet early this week to discuss the latest proposal, which values the club at £800m ($1.5bn).", "Manchester United revealed on Sunday that it had received a detailed proposal from Mr Glazer, which looks set to receive more serious scrutiny.", "The board has previously rejected Mr Glazer's approaches out of hand.", "But a senior source at the club told the BBC: \"This time it's different.\"", "Supporters' group Shareholders United urged the club to reject the new deal.", "But a spokesman for the Shareholders United said: \"I can't see any difference (compared to Mr Glazer's previous proposals) other than £200m less debt.", "He isn't bringing any money into the club; he'll use our money to buy it.\"", "Mr Glazer's latest move is being led by Mr Glazer's two sons, Avi and Joel, according to the Financial Times.", "A proposal was received by David Gill, United's chief executive, at the end of last week, pitched at about 300p a share.", "David Cummings, head of UK equities for Standard Life Investments, said he believed a \"well funded\" 300p a share bid would be enough for Mr Glazer to take control of the club.", "But Mr Glazer's latest move is being led by Mr Glazer's two sons, Avi and Joel, according to the Financial Times.", "A proposal was received by David Gill, United's chief executive, at the end of last week, pitched at about 300p a share.", "Mr Glazer, who owns the Tampa Bay Buccaneers team, hopes this will lead to a formal bid being accepted.", "He is believed to have increased the amount of equity in the new proposal, though it is not yet known by how much.", "For his proposal to succeed, he needs the support of United's largest shareholders, the Irish horseracing tycoons JP McManus and John Magnier.", "They own 29% of United through their Cubic Expression investment vehicle.", "Mr Glazer and his family hold a stake of 28.1%.", "But it is not yet known whether Mr McManus and Mr Magnier would support a Glazer bid.", "NM Rothschild, the investment bank, is advising Mr Glazer, according to the Financial Times.", "His previous adviser, JPMorgan, quit last year when Mr Glazer went ahead and voted against the appointment of three United directors to the board, against its advice.", "But the FT said it thought JP Morgan may still have had some role in financing Mr Glazer's latest financial proposal."], "deepseek-r1:1.5b": ["Man Utd shares closed up 4.75% on Monday after receiving an offer from US tycoon Malcolm Glazer, valued at £800m ($1.5bn).", "The club's board is expected to discuss this proposal, which will face serious scrutiny.", "A senior source said this time it differs, unlike previous approaches.", "Shareholders united urged Man Utd to reject the deal despite backing it.", "Glazer, with sons Avi and Joel, led a move in The Financial Times, sending a $300p share offer.", "He is seeking investment from Standard Life Investments, who believe a 300p share bid would suffice.", "Glazer's proposal requires support from the top 29% holders to succeed."], "tinyllama:1.1b": ["The share price of Manchester United has risen by 4.75% on Monday, after a new offer from US tycoon Malcolm Glazer.", "The club's board is expected to meet early this week to discuss the latest proposal, which values the club at £800m ($1.5bn).", "Manchester United's Supporters United criticizes the Board for \"well funded\" proposals by Mr Glazer, calling on shareholders and large shareholders such as JP McManus and John Magnier to support his bid.", "It is not yet known whether JP Morgan will be advising Mr Glazer in this regard.", "The FT reported that JPMorgan may still have a role in financing Mr Glazer's latest financial proposal."], "tinydolphin:1.1b": [" The English football club Manchester United has announced a new £800m ($1.5bn) offer from US tycoon Malcolm Glazer, who owns the Tampa Bay Buccaneers team.", "The board of Manchester United is set to meet early this week in hopes of reaching an agreement with the US tycoon before they reject his latest proposal out of hand.", "Shareholders' United, however, have urged the club not to accept the new deal and instead prioritize a higher bid from Avi and Joel Glazer, who are led by their father, Avi.", "The proposal comes after several rounds of failed negotiations with the Glazers, who own 29% of Manchester United through their Cubic Expression investment vehicle.", "Some supporters' groups, such as Shareholders United, have urged the club to reject the new deal."], "phi:2.7b": [" The shares in Manchester United rose 4.75% following a new offer by US tycoon Malcolm Glazer.", "The board of the football club is expected to meet early this week to discuss the latest proposal, valued at £800m ($1.5bn).", "Mr Glazer's previous proposals have been rejected out of hand but he has received a detailed proposal from him and it looks set to receive serious scrutiny.", "Supporters' group Shareholders United urged the club to reject the new deal as Mr Glazer is not bringing any money into the club, only using their money to buy it.", "A proposal was received by David Gill, United' s chief executive, at the end of last week, pitched at about 300p a share."], "orca-mini:3b": [" Manchester United shares rise on new offer from US tycoon Malcolm Glazer, who has approached the club with detailed proposals and is believed to have increased the amount of equity in his new proposal.", "The board of the football club is expected to meet early this week to discuss the latest proposal, which values the club at £800m ($1.5bn).", "Shareholders United urges the club to reject the new deal, but a senior source at the club told the BBC: \"This time it's different.\"", "The US tycoon hopes this will lead to a formal bid being accepted and he needs the support of United's largest shareholders, including JP McManus and John Magnier, who own 29% of United through their Cubic Expression investment vehicle."], "hermes3:3b": ["Manchester Utd shares rise 4.75% on new £800m ($1.5bn) offer from US tycoon Malcolm Glazer."], "stablelm-zephyr:3b": ["Shares in Manchester United rose 4.75% following a new offer from US tycoon Malcolm Glazer.", "The club's board is set to discuss the £800m ($1.5bn) proposal, which looks different this time as it includes less debt.", "However, supporters' group Shareholders United urged the club to reject the deal, claiming that Mr Glazer won't bring any money into the club but will use their money to buy it.", "A well-funded 300p a share bid could be enough for Mr Glazer to take control of Manchester United, according to David Cummings, head of UK equities for Standard Life Investments."], "chatgpt-4o-latest": ["Shares in Manchester United rose 4.75% after US tycoon Malcolm Glazer made a new £800m ($1.5bn) offer for the club.", "The board is set to review the proposal, which is being led by Glazer's sons, Avi and Joel.", "Unlike previous bids, this one is receiving serious consideration, though supporters' group Shareholders United remains opposed, arguing Glazer is not investing new money but using the club's own funds.", "The offer, pitched at 300p per share, could be enough for Glazer to take control if he secures backing from major shareholders JP McManus and John Magnier, who own 29% of the club.", "Glazer and his family currently hold 28.1%.", "Investment bank NM Rothschild is advising Glazer, while JPMorgan, his former adviser, may still be involved in financing."], "stablelm2:1.6b": ["Manchester United shares rose 4% after receiving a new offer from Malcolm Glazer, valued at £1bn ($1.5bn).", "The board is expected to discuss the proposal soon.", "However, Shareholders United urged the club to reject the deal.", "Supporters group believe Glazer's previous proposals are similar and urge for less debt.", "It remains unclear if Glazer's bid will be supported by largest shareholders, JP McManus and John Magnier, who own 50% of Manchester United through their Cubic Expression investment vehicle."], "granite3.1-dense:2b": ["Shares in Manchester United rose 4.75% on Monday due to a new £800m ($1.5bn) offer from US tycoon Malcolm Glazer, via his two sons Avi and Joel.", "The club's board will meet this week to discuss the proposal.", "Previously rejected by Manchester United, the current bid includes less debt but no additional cash investment.", "The deal hinges on support from the club's largest shareholders, JP McManus and John Magnier, who own 29% of the club.", "Glazer's previous adviser, JPMorgan, has withdrawn its role, with NM Rothschild now acting as his investment bank.", "Shareholders' group Shareholders United opposes the offer, arguing it doesn't bring new funds to the club.", "A BBC source claims this proposal is distinct from earlier ones, but critics contend it lacks significant value."]}