{"raw_text": "Pension hitch for long-living men\n \n Male life expectancy is much higher than originally estimated, leading pension researchers have said.\n \n The Pensions Policy Institute (PPI) said life expectancy for unskilled and professional men has been understated. Life expectancy at birth is 71 years for a manual worker and 79 years for a professional - a gap of eight years. But if measured at age 65 instead, the PPI said, a manual worker will live to 81 years and a professional worker to 86 years - a gap of just five years. The PPI's estimate is higher because it excludes people who have died before they reach 65 years of age and also takes into account ongoing improvements in life expectancy.\n \n The government has ruled out raising the state pension age, because it says it would penalise lower-skilled workers who generally have lower life expectancies. Chris Curry, PPI research director, said its calculations suggested there could be more pressure on state pension spending than originally envisaged. \"Even people in social class V [unskilled manual workers] who are widely likely to have the lowest life expectancy can still expect to live 16 years after state pension age,\" he said. Researchers have not updated life expectancy projections for women, who on average live longer than men.\n", "llama3.2:1b": ["Pension researchers estimate male life expectancy higher than initially thought, with a gap of eight years between life expectancy at birth and retirement age for unskilled and professional men.", "Calculations suggest that if measured at 65, these individuals can expect to live up to 86-91 years, depending on their occupation."], "llama3.2:3b": ["Life expectancy at birth is higher than previously estimated, with unskilled and professional men living up to 79 and 86 years respectively.", "However, when adjusted for age 65, the gap narrows to five years.", "The Pensions Policy Institute's calculations suggest that state pension spending could be increased due to longer lifespans among men."], "gemma2:2b": ["Life expectancy for male workers is higher than previously estimated.", "The gap between expected life at birth and life at retirement is significant.", "This may lead to greater pressure on public pensions than initially planned."], "qwen2.5:0.5b": ["Pension policies could be more expensive as a result of lower-skilled workers' longer lifespans, research suggests."], "qwen2.5:1.5b": ["Pension researchers from the Pensions Policy Institute estimate that male life expectancy has increased significantly beyond initial estimates, particularly for unskilled workers compared to professionals at 65 years old.", "The PPI suggests a gap of eight years in life expectancy between manual and professional males when measured at birth, but only five years by age 65.", "This difference is attributed to excluding deaths before reaching the age of 65 and accounting for ongoing improvements in life expectancy data.", "The institute's revised projections indicate greater pressure on state pension spending than initially anticipated due to longer lifespans among lower-skilled workers."], "qwen2.5:3b": ["Male life expectancy is much higher than previously thought, with an unskilled man living to 81 and a professional to 86 at age 65, creating a gap of only five years instead of eight.", "The Pensions Policy Institute (PPI) suggests this discrepancy could lead to increased pressure on state pension spending, as even low-skilled workers can expect to live 16 years post-state pension age.", "However, the government has declined to raise the state pension age due to its potential negative impact on lower-skilled workers with shorter life expectancy.", "The PPI's estimates exclude those who died before reaching 65 and account for ongoing improvements in longevity.", "Women generally have longer lifespans than men, but their life expectancy projections have not been updated."], "opencoder:1.5b": ["The Pension hitch for long-living men is related to the difference in life expectancy between a skilled and an unskilled labor force - a significant discrepancy exists.", "While male life expectancies are typically much higher than originally estimated, research suggests that this disparity could be attributed to several factors: people who have died before reaching their specified age, ongoing improvements in life expectancy, and the absence of state pension regulations limiting the rise of the state pension age."], "smollm:1.7b": ["The summary is concise and clear, preserving key ideas and details from the original text.", "The main points are:\n\n1.", "Pension hitch for long-living men: Male life expectancy is much higher than originally estimated, leading pension researchers have said.", "2.", "Life expectancy at birth for unskilled and professional men: 71 years for a manual worker and 79 years for a professional - a gap of eight years.", "3.", "Pension policy institute's estimate: Life expectancy at age 65 instead of at birth, the PPI estimated life expectancy to be 81 years for a manual worker and 86 years for a professional.", "4.", "Rule out raising the state pension age: The government has ruled out raising the state pension age because it would penalise lower-skilled workers who generally have lower life expectancies.", "5.", "State pension spending: Even people in social class V (unskilled manual workers) who are widely likely to have the lowest life expectancy can still expect to live 16 years after state pension age, according to Chris Curry, PPI research director.", "The summary conveys the main ideas and key details from the original text without adding or changing them."], "deepseek-r1:1.5b": ["Male life expectancies are higher than previously estimated, affecting pensions research.", "Pensions Policy Institute (PPI) notes that unskilled and professional men have lower life expectancies at birth compared to when measured at 65, with a gap of eight years for unskilled workers and five years for professionals.", "PPI estimates higher due to excluding those who die before reaching 65 and accounting for improvements in life expectancy.", "The government does not want to raise the state pension age because it penalizes lower-skilled workers, as Chris Curry from PPI said.", "He highlighted that even unskilled manual workers (social class V) might live 16 years after the pension age despite low life expectancies.", "Women generally have longer lives, so their projections are not updated."], "tinyllama:1.1b": ["Summary: Pension researchers have estimated that life expectancy for unskillled and professional men has been underestimated by eight years, leading to a gap of eight years between the two groups.", "The PPI's estimate is higher because it includes ongoing improvements in life expectancy for both groups, and estimates of the state pension age have been revised downwards.", "These revisions suggest that there could be more pressure on state pension spendings than originally anticipated."], "tinydolphin:1.1b": [" The Pensions Policy Institute (PPI) has found that life expectancies for male unskilled and professional workers are much higher than previously estimated, leading to changes in pension policy.", "They have concluded that pension contributions should be based on life expectancy at age 65 rather than current assumptions of a person's lifespan being reduced by eight years for manual workers and seven years for professionals.", "The Institute's estimate is higher because it takes into account improvements in life expectancy over the past few decades."], "phi:2.7b": [" A new study shows that male life expectancy is higher than originally estimated, meaning there will be more pressure on the state pension system in the future.", "The Pensions Policy Institute found that if measured at age 65 instead of birth, a manual worker could expect to live to 81 years while a professional could live to 86 years.", "However, the government has not yet raised the state pension age because it considers this would unfairly affect lower-skilled workers who have shorter life expectancies."], "orca-mini:3b": [" The government has ruled out raising the state pension age due to a gap of eight years in life expectancies between manual and professional workers.", "This gap is wider than originally estimated by the Pensions Policy Institute (PPI), which suggests that there may be more pressure on state pension spending.", "PPI's calculations show that even people in social class V, who have the lowest life expectancy, can still expect to live 16 years after state pension age.", "Researchers have not updated projections for women, who on average live longer than men."], "hermes3:3b": ["Pension study finds men's life expectancy higher than estimated, leading to wider gaps between skilled and unskilled workers' potential state pension spending duration."], "stablelm-zephyr:3b": ["Pension researchers at The Pensions Policy Institute (PPI) have found that male life expectancy is higher than originally estimated.", "Life expectancy for unskilled and professional men has been underestimated, with manual workers living 71 years and professionals 79 years, a gap of eight years.", "When measured at age 65, the gap reduces to five years.", "The PPI's estimate takes into account people who died before reaching 65 and considers ongoing improvements in life expectancy.", "However, the government has ruled out raising the state pension age due to potential penalties on lower-skilled workers with lower life expectancies.", "Women's life expectancy projections have not been updated, as they typically live longer than men."], "chatgpt-4o-latest": ["Male life expectancy is higher than previously estimated, according to the Pensions Policy Institute (PPI).", "Life expectancy at birth is 71 years for manual workers and 79 years for professionals, but at age 65, it rises to 81 and 86 years, respectively.", "The PPI's estimates exclude those who die before 65 and account for improving longevity.", "The government has ruled out raising the state pension age, arguing it would disadvantage lower-skilled workers with shorter life expectancies.", "PPI research director Chris Curry warned that state pension spending could face more pressure than expected, as even unskilled workers can expect to live 16 years after reaching pension age.", "Life expectancy projections for women have not been updated."], "stablelm2:1.6b": ["Male life expectancy has been significantly underestimated due to historical underestimation of unskilled and professional men's lifespans.", "Currently estimated at around 76 years for manual workers and 81 years for professionals, these gaps have expanded to five years if measured at age 56 instead of birth.", "The Pensions Policy Institute (PPI) attributes this discrepancy to excluding people who die before reaching 56 years old and accounting for ongoing improvements in life expectancy.", "However, the government has ruled out raising the state pension age due to its potential impact on lower-skilled workers with lower life expectancies."], "granite3.1-dense:2b": ["Pension research indicates that male life expectancies were previously underestimated, particularly for unskilled workers (71 years at birth) and professionals (79 years).", "When measured from age 65, the gap narrows to five years: 81 for manual workers and 86 for professionals.", "This higher estimate by the Pensions Policy Institute (PPI) accounts for deceased individuals before 65 and considers ongoing life expectancy improvements.", "The government refuses to raise the state pension age, citing potential harm to lower-skilled workers with shorter life expectancies.", "PPI research director Chris Curry warns that even unskilled manual workers (class V) might live 16 years beyond their state pension age.", "Life expectancy projections for women, who generally outlive men, have not been revised."]}