{"raw_text": "Q&A: Malcolm Glazer and Man Utd\n \n The battle for control of Manchester United has taken another turn after the club confirmed it had received a fresh takeover approach from US business tycoon Malcolm Glazer.\n \n No formal offer has been made yet, but Manchester United have confirmed they have received a \"detailed proposal\" from the US entrepreneur which could lead to a bid. Reports have put the offer at 300p per share, which would value Manchester United at about £800m ($1.5bn). The approach by the 76-year-old owner of the Tampa Bay Buccaneers American football team is reportedly being led by his two sons, Avi and Joel. A previous approach to the United board by Mr Glazer in October last year was turned down. However, the BBC has learnt that the club is unlikely to reject the latest plan out of hand.\n \n Mr Glazer's previous offer involved borrowing large amounts of money to finance any takeover. That would have left the club with debt levels which were deemed \"not... in the best interests of the company\" by Manchester United's board when they rejected his approach last year. However, Mr Glazer's latest offer is reported to have cut the amount of borrowing needed by £200m.\n \n While United's board may be casting a serious eye over Mr Glazer's latest proposals, supporters remain fiercely opposed to any deal.\n \n Supporters' group Shareholders United - which has proved adept in rallying opposition to Mr Glazer's campaign - said it would fight any move. \"Manchester United are a debt-free company. We don't want to fall into debt and we don't need to fall into debt,\" Shareholders United's Sean Bones told the BBC. United's players also appear unhappy at the prospect of a takeover. \"A lot of people want the club's interest to be with people who have grown up with the club and got its interests at heart,\" Rio Ferdinand told BBC Radio Five Live. \"No-one knows what this guy will be bringing to the table.\"\n \n The key to any successful bid will be attracting the support of United's largest shareholders, the Irish horse racing tycoons John Magnier and JP McManus. Through their Cubic Expression vehicle they own 28.9% of the club. Mr Glazer owns 28.1%. Joe McLean, a football specialist at accountancy firm Grant Thornton, said the support of Mr Magnier and Mr McManus was \"utterly crucial\". \"Mr Glazer's bid will not proceed without their support and they have previously indicated that they are holding their stake as an investment. \"If that's the case, the shares will therefore need a price attachment of about 300 pence, maybe 305. \"If that's the case then Mr Glazer might well secure their support - if he does, this bid could well go ahead.\"\n \n Indeed it is. Malcolm Glazer was little-known in the UK until he started to build up his stake in Manchester United in late 2003. In February 2004 he said he was \"considering\" whether to bid for the club. No bid emerged, but Mr Glazer continued to increase his holding in the club. In October 2004, Manchester United said they had received a \"preliminary approach\", which turned out to have come from Mr Glazer. However, the board rejected the move because of the amount of debt it would involve. At the club's annual general meeting in November, Mr Glazer took revenge by using his hefty stake in the club to oust three directors from the board. Legal adviser Maurice Watkins, commercial director Andy Anson and non-executive director Philip Yea were voted out, against the wishes of chief executive David Gill. But the move led to bankers JP Morgan and public relations firm Brunswick withdrawing from the Glazer bid team.\n", "llama3.2:1b": ["The US business tycoon Malcolm Glazer has received a fresh takeover approach for Manchester United with a proposed price of 300p per share, valuing the club at around £800m ($1.5bn).", "This is after a previous offer was turned down last year due to concerns about debt levels.", "The current offer would reduce borrowing costs by £200m compared to Mr Glazer's previous proposal.", "Manchester United's board is considering the bid but supporters are opposing it, with Shareholders United stating that \"debt-free\" means being free from financial obligations and not wanting to enter into debt.", "The Irish horse racing tycoons John Magnier and JP McManus hold a 28.9% stake in Manchester United.", "Mr Glazer's sons Avi and Joel are leading the bid, with reports suggesting they have increased their holding in the club significantly since Mr Glazer first considered buying it in late 2003.", "However, Manchester United's board has rejected previous bids due to concerns about debt levels."], "llama3.2:3b": ["Manchester United has received a fresh takeover approach from US businessman Malcolm Glazer, who offers £800m ($1.5bn) for 300p per share.", "The proposal is being led by Glazer's sons Avi and Joel, and is reportedly lower in debt than the previous offer rejected last year.", "Manchester United's board may be considering the plan, with key stakeholders John Magnier and JP McManus holding 28.9% of the club.", "Supporters are opposed to any deal, citing concerns over debt levels."], "gemma2:2b": ["Malcolm Glazer has made a fresh takeover offer for Manchester United.", "The offer is reported at 300p per share, valuing the club at approximately £800m ($1.5bn).", "The offer involves less borrowing than his previous attempt, and supporters are opposed to it.", "Players also express reservations about Mr. Glazer's potential involvement.", "The success of the bid depends on securing support from major shareholders, John Magnier and JP McManus.", "Mr. Glazer's previous attempts have been unsuccessful due to debt concerns and confrontational tactics."], "qwen2.5:0.5b": ["Here's a summary:\n\n  * Manchester United is considering a takeover by US business tycoon Malcolm Glazer.", "* The latest offer by Mr Glazer includes borrowing large amounts of money to finance the takeover.", "* Supporters remain opposed to any deal, citing concerns about debt levels and the potential impact on club finances."], "qwen2.5:1.5b": ["Malcolm Glazer has submitted a takeover offer valued at £800m for Manchester United worth 300p per share, reportedly being backed by his sons Avi and Joel Glazer with support from Irish horse racing tycoons John Magnier and JP McManus who own 28.9% of the club's shares.", "The previous approach was rejected due to debt issues but a cut in borrowing needed is reported.", "Support from key shareholders is crucial for any successful bid."], "qwen2.5:3b": ["The battle for control of Manchester United has intensified with a fresh takeover approach from US business tycoon Malcolm Glazer, who is reportedly leading by his two sons Avi and Joel.", "While no formal offer has been made yet, the proposal values Manchester United at about £800m ($1.5bn), valued at 300p per share.", "Previous attempts were rejected due to debt concerns but this latest offer aims to reduce borrowing needed by £200m.", "Manchester United’s board is evaluating Glazer's new proposals cautiously, while supporters remain strongly opposed.", "For a successful bid, Glazer needs the backing of largest shareholders John Magnier and JP McManus, holding 28.9% of shares; their support will be crucial as they are likely to demand at least 300p per share for them to back the deal."], "opencoder:1.5b": ["The battle for control of Manchester United has taken another turn after the club confirmed it had received a fresh takeover approach from US business tycoon Malcolm Glazer.", "No formal offer has been made yet, but reports have put the offer at 300p per share which would value Manchester United at about £800m ($1.5bn).", "The approach by the 76-year-old owner of the Tampa Bay Buccaneers American football team is reportedly being led by his two sons, Avi and Joel.", "A previous approach to the United board by Mr Glazer in October last year was turned down but the BBC has learnt that the club is unlikely to reject the latest plan out of hand.", "Supporters' group Shareholders United - which has proved adept in rallying opposition to Mr Glazer's campaign - said it would fight any move."], "smollm:1.7b": ["The key points in this summary are:\n\n1.", "The battle for control of Manchester United has taken another turn after the club confirmed it had received a \"detailed proposal\" from US business tycoon Malcolm Glazer.", "2.", "No formal offer has been made yet, but Manchester United have confirmed they have received a \"detailed proposal\".", "3.", "Mr Glazer's previous approach to the United board was led by his two sons, Avi and Joel.", "A previous approach to the United board by Mr Glazer in October last year was turned down.", "4.", "The key to any successful bid will be attracting the support of United's largest shareholders, the Irish horse racing tycoons John Magnier and JP McManus.", "Through their Cubic Expression vehicle they own 28.9% of the club.", "Mr Glazer owns 28.1%.", "5.", "Mr Glazer's bid will not proceed without their support and they have previously indicated that they are holding their stake as an investment.", "If that's the case, the shares will therefore need a price attachment of about 300 pence, maybe 305.", "6.", "If that's the case then Mr Glazer might well secure their support - if he does, this bid could well go ahead."], "deepseek-r1:1.5b": ["Manchester United confirmed receiving a \"detailed proposal\" from US businessman Malcolm Glazer, priced at 300p per share, valued at £800m.", "He mentioned his sons Avi and Joel as part of the management team.", "Glazer's previous offer was repudiated, but the latest plan cuts borrowing by £200m.", "The club faces opposition from supporters who oppose any deal, fearing debt and wanting interests with Manchester's former owners.", "However, Glazer's support could be gained through his big stake in the club, including John Magnier and JP McManus owning 28.9% each.", "Despite this, the board has decided to take action."], "tinyllama:1.1b": ["The battle for control of Manchester United has taken another turn after the club confirmed it had received a new takeover approach from US business tycoon Malcolm Glazer.", "No formal offer has been made yet, but Manchester United have confirmed they have received a \"detailed proposal\" from the US entrepreneur which could lead to a bid.", "The previous approach by Glazer in October last year was rejected, and the club is unlikely to reject the latest plan outright.", "Malcolm Glazer's previous offer involved borrowing large amounts of money to finance any takeover but had been deemed \"not in the best interests of the company\" by Manchester United's board when they turned down his approach last year.", "The new proposal, led by Malcom Glazer and Joe Magnier and JP McManus, is said to have cut borrowing needs by £200m.", "While supporters remain firmly opposed to any deal, Malcolm Glazer has been able to gain the support of John Magnier and JP McManus in securing their shareholdings."], "tinydolphin:1.1b": [" Malcolm Glazer's proposal for a new takeover of Manchester United is back in the spotlight after a fresh approach has been received, potentially worth £800 million ($1.5 billion).", "The club's board will now consider the offer and make a decision on whether to accept it or reject it outright.", "Malcolm Glazer, who owns more than 27% of Manchester United's shares, has been actively involved in the club's business operations for several years.", "His bid is aimed at strengthening the company and potentially investing in the club's future success.", "The new offer, which values Manchester United at about £800 million ($1.5 billion), represents a significant increase in value compared to previous approaches made by the 76-year-old tycoon.", "Manchester United's board is reportedly considering whether to reject the latest offer outright or accept it, without a formal bid from the US business tycoon.", "Malcolm Glazer has been a divisive figure in the club's history, both for his financial backing and his perceived influence over the club's management.", "The decision by Manchester United's board to reject his initial proposal could be seen as a warning shot across the bows of potential buyers.", "However, it is not clear whether any other bids will still be considered at this stage."], "phi:2.7b": [" Malcolm Glazer has received a detailed takeover proposal for Manchester United valued at £800m ($1.5bn), which is reported to be an attractive offer given his previous rejection of an earlier approach due to debt levels.", "However, he needs the support of the club's largest shareholders, John Magnier and JP McManus, who have previously indicated that they are holding their stake as an investment.", "If they support Glazer's bid, it could go ahead."], "orca-mini:3b": [" Malcolm Glazer has made a fresh takeover approach to Manchester United, proposing to buy the club for about 300p per share, which would value it at around £800m ($1.5bn).", "The US entrepreneur is leading the approach, and his two sons are involved in the bid.", "However, the bid could be rejected by the board due to concerns about the amount of debt involved.", "Manchester United's players and supporters are opposed to any potential takeover, and legal advice has been sought."], "hermes3:3b": ["Manchester United received a takeover offer from US businessman Malcolm Glazer, seeking to value the club at £800m.", "However, supporters and players are opposed to the deal, as they worry about falling into debt.", "For a successful bid, Glazer needs support of major shareholders Magnier and McManus (28.9%), who have previously indicated holding stake as investment and possibly selling if priced at 300p per share."], "stablelm-zephyr:3b": ["Manchester United confirmed receiving a \"detailed proposal\" from US entrepreneur Malcolm Glazer, potentially leading to a bid.", "Although no formal offer has been made yet, reports suggest an offer of 300p per share, valuing the club around £800m ($1.5bn).", "Glazer's previous approach was turned down due to high levels of borrowing deemed not in Manchester United's best interests.", "To secure support from major shareholders John Magnier and JP McManus, Glazer's bid will likely need a price attachment of around 300p per share or 305p.", "Despite resistance from supporters' group Shareholders United and players, securing the backing of Magnier and McManus is crucial for the bid to proceed."], "chatgpt-4o-latest": ["Manchester United has received a new takeover proposal from US businessman Malcolm Glazer, though no formal offer has been made.", "The proposal, reportedly valuing the club at £800m, is being led by Glazer's sons, Avi and Joel.", "A previous bid was rejected due to concerns over debt, but the latest offer reduces borrowing by £200m.", "While the club's board is considering the proposal, fans and players strongly oppose it, fearing financial instability.", "The key to the bid's success lies with major shareholders John Magnier and JP McManus, who own 28.9% of the club.", "If they support Glazer's offer, the takeover could proceed.", "Glazer, who began acquiring shares in 2003, previously attempted a bid in 2004 but was rejected.", "He later used his stake to remove three directors from the board, leading to the withdrawal of key financial and PR advisors from his bid team."], "stablelm2:1.6b": ["US entrepreneur Malcolm Glazer has received a $1.5bn takeover offer for Manchester United from his family's business interests.", "No formal offer has been made yet, but the club is unlikely to reject the latest proposal by Glazer, who previously attempted to take control of the club with large borrowing amounts.", "To secure takeover support, the largest shareholders are expected to back any deal, with Irish horse racing tycoons John Magnier and JP McManus owning 9% of the club through their Cubic Expression vehicle."], "granite3.1-dense:2b": ["Malcolm Glazer, a US business tycoon and owner of the Tampa Bay Buccaneers, has presented Manchester United with a new takeover proposal.", "The club has received a detailed plan valuing Manchester United at around £800 million ($1.5 billion) per share, or 300p per share.", "This offer includes reduced borrowing compared to Glazer's previous plan, which the board found unfavorable due to potential debt accumulation.", "The key to a successful bid lies in securing support from Manchester United's largest shareholders, John Magnier and JP McManus, who own 28.9% of the club.", "Their backing is essential for Glazer's plan to proceed.", "Despite the proposal, Manchester United's board and fans are cautious, with supporters' group Shareholders United vowing to oppose any debt-induced takeover.", "Players, including Rio Ferdinand, express concern about the club's interests being compromised by outsiders.", "Glazer's history in the UK is limited, but his stake in Manchester United has allowed him influence since 2003, culminating in ousting three directors from the board in 2004."]}