{"raw_text": "Ebbers 'aware' of WorldCom fraud\n \n Former WorldCom boss Bernie Ebbers was directly involved in the $11bn financial fraud at the firm, his closest associate has told a US court.\n \n Giving evidence in the criminal trial of Mr Ebbers, ex-finance chief Scott Sullivan implicated his colleague in the accounting scandal at the firm. Mr Sullivan, WorldCom's former number two, is the government's chief witness in its case against Mr Ebbers. Mr Ebbers has denied multiple charges of conspiracy and fraud.\n \n Senior WorldCom executives are accused of orchestrating a huge fraud at the former telecoms company in which they exaggerated revenues and hid the cost of expenses. The firm was forced into bankruptcy, the largest in US history. Mr Sullivan, 42, pleaded guilty to fraud last year and agreed to assist the government with its case against Mr Ebbers.\n \n Prosecutors have alleged that Mr Ebbers, 63, directed Mr Sullivan to hide the true state of the company's finances by providing false information to the firm's accountants. Mr Ebbers has denied all the charges, saying he was unaware of the fraud. His lawyers claim that their client was unfamiliar with detailed accounting practices and left that side of the business to Mr Sullivan.\n \n However, on Monday Mr Sullivan named Mr Ebbers as one of five executives who participated in the accounting fraud. \"He [Ebbers] has got a hands-on grasp of financial information,\" Mr Sullivan told a New York court. On his first day of questioning, Mr Sullivan admitted to falsifying the company's financial statements.\n \n \"We did not disclose these adjustments,\" he said. \"We did not talk about these adjustments and the information was false.\" Mr Sullivan said his former boss knew more about accounting matters than many chief financial officers and described him as \"detail-oriented\".\n \n He portrayed Mr Ebbers, a charismatic businessman who built up WorldCom from a small regional operator into one of America's largest telecoms firms, as obsessed with costs. \"He would talk about that there were more coffee filters than coffee bags and that means employees are taking coffee home,\" he said. \"We needed to cut expenses. We needed to cut a lot more than coffee expenses.\" Mr Sullivan is at the centre of the government's case against Mr Ebbers. Mr Ebbers could face a sentence of 85 years if convicted of all the charges he is facing.\n", "llama3.2:1b": ["Bernie Ebbers, WorldCom's former CEO, was directly involved in the $11bn financial fraud that led to the company's bankruptcy.", "His closest associate, Scott Sullivan, implicated him in court, with Sullivan testifying that Ebbers \"had a hands-on grasp of financial information\" and knew more about accounting matters than his chief financial officers."], "llama3.2:3b": ["Bernie Ebbers, former WorldCom boss, was directly involved in the $11 billion financial fraud, according to his associate Scott Sullivan, who testified that Ebbers directed him to hide the true state of the company's finances and knew more about accounting matters than many CFOs."], "gemma2:2b": ["Bernie Ebbers was directly involved in WorldCom's $11 billion accounting fraud, according to Scott Sullivan, his former associate and key witness in the criminal trial.", "Sullivan testified that Ebbers directed him to hide the true state of the company’s finances by providing false information to accountants.", "Ebbers has denied being aware of the fraud, but Sullivan claims he had \"hands-on grasp\" of financial information and was detail-oriented.", "This testimony puts Ebbers in a difficult position as he could face 85 years in prison if convicted."], "qwen2.5:0.5b": ["Former WorldCom boss Bernie Ebbs was directly involved in a $11bn fraud, and his former chief financial officer Scott Sullivan implicated him in the accounting scandal at the firm.", "The prosecution has alleged that Ebbs, 63, directed Mr Sullivan to hide the true state of the company's finances by providing false information.", "Mr Ebbs denies all charges but describes himself as a detail-oriented businessman obsessed with costs and willing to cut expenses significantly, facing up to 85 years in prison if convicted."], "qwen2.5:1.5b": ["Former WorldCom CEO Bernie Ebbers implicated in $11bn fraud, details suggest he directed accounting manipulation.", "Prosecutors allege Ebbers knew about fraud but denied involvement, while Sullivan described him as detail-oriented with an obsession over costs."], "qwen2.5:3b": ["Former WorldCom boss Bernie Ebbers was directly involved in the $11bn financial fraud, according to his former finance chief Scott Sullivan.", "Mr Sullivan implicated Mr Ebbers and other executives in hiding the true state of company finances by providing false information to accountants.", "Mr Ebbers denied all charges, claiming he was unaware of the fraud.", "However, Mr Sullivan named Mr Ebbers as one of five executives who participated in the accounting scandal, admitting to falsifying financial statements and described Mr Ebbers as detail-oriented and obsessed with costs.", "Mr Ebbers could face a 85-year sentence if convicted."], "opencoder:1.5b": ["Ebbers 'aware' of WorldCom fraud, Former WorldCom boss Bernie Ebbers was directly involved in the $11bn financial fraud at the firm, his closest associate told a US court.", "Mr Ebbers gave evidence in the criminal trial of Mr Ebbers, ex-finance chief Scott Sullivan implicated his colleague in the accounting scandal at the firm.", "Senior WorldCom executives are accused of orchestrating a huge fraud at the former telecoms company in which they exaggerated revenues and hid the cost of expenses.", "The firm was forced into bankruptcy, the largest in US history.", "Mr Sullivan, 42, pleaded guilty to fraud last year and agreed to assist the government with its case against Mr Ebbers.", "Prosecutors have alleged that Mr Ebbers, 63, directed Mr Sullivan to hide the true state of the company's finances by providing false information to the firm's accountants.", "Mr Ebbers has denied all the charges, saying he was unaware of the fraud.", "Their client was unfamiliar with detailed accounting practices and left that side of the business to Mr Sullivan.", "However, on Monday Mr Sullivan named Mr Ebbers as one of five executives who participated in the accounting fraud.", "He got a hands-on grasp of financial information from Mr Sullivan."], "smollm:1.7b": ["Summarizing the text, we can identify the following key ideas:\n\n1.", "Bernie Ebbers was directly involved in WorldCom fraud: The former WorldCom boss was accused of orchestrating a huge fraud at the firm, which led to its bankruptcy.", "2.", "Former WorldCom executives are accused of conspiracy and fraud: The government's case against Mr Ebbers alleges that he and his colleagues conspired to hide the true state of the company's finances by providing false information to the firm's accountants.", "3.", "Prosecutors have alleged that Bernie Ebbers was aware of the fraud: The government's lawyers claim that Mr Ebbers, 63, knew more about financial matters than many chief financial officers and described him as \"detail-oriented\".", "4.", "Bernie Ebbers denied all charges: Despite being accused of conspiracy and fraud, Mr Ebbers denied any wrongdoing and claimed that he was unaware of the true state of the company's finances.", "5.", "Senior WorldCom executives are accused of orchestrating the fraud: The government's case against Mr Ebbers alleges that senior executives at WorldCom, including Mr Sullivan, were involved in the accounting fraud.", "6.", "Prosecutors have alleged that Bernie Ebbers was aware of the fraud: The government's lawyers claim that Mr Ebbers, 42, knew more about financial matters than many chief financial officers and described him as \"detail-oriented\".", "7.", "Mr Sullivan testified in the criminal trial: In addition to giving evidence in the criminal trial of Mr Ebbers, Mr Sullivan also testified against his former boss, providing details about the accounting fraud at WorldCom."], "deepseek-r1:1.5b": ["Ebbers was aware of $11 billion WorldCom fraud, whose former chief, Sullivan, served as the government's chief witness in his criminal case against him.", "Senior executives at WorldCom were accused of fabricating financial data to hide expenses, with the firm going bankrupt for the largest US bank history.", "Sullivans pleaded guilty but left the accounting details to him, who described Ebbers as detail-oriented and obsessed with costs.", "Ebbers denies fraud charges and is portrayed by the government as a manipulative leader focused on costs.", "If convicted, he could face up to 85 years in prison for fraud-related charges."], "tinyllama:1.1b": ["Ebbeers, 'Aware' of WorldCom Fraud, Exposes Scott Sullivan's Role in Accounting Scandal\n\nEx-WorldCom bosse Bernie Ebbers exposed his former colleague Scott Sullvian as a direct participant in the $11bn financial fraud at the former telecoms company.", "Ebber's claims came during an accounting scandal trial where he stated that his former team knew more about accounting matters than many chief financial officers, described by Ebber himself as detail-oriented.", "Sullvian was the government's central witness in the case against Ebber who is facing multiple charges of conspiracy and fraud.", "In his testimony, Sullvian admitted to concealing a huge fraud scandal at WorldCom, where he worked.", "Ebber also stated that Sullvian was a hands-on participant in the accounting fraud as well as someone who would not hesitate to \"cut expenses\" if needed.", "The government is alleging that Ebber orchestrated a massive financial fraud scandal at WorldCom, with Sullvian named as one of five executives involved in it."], "tinydolphin:1.1b": [" The following text is an analysis of the given information, summarizing its key ideas and presenting it in a clear, concise, and logical structure:\n\nEbbers 'aware' of WorldCom fraud.", "(1) Bernie Ebbers was directly involved in the $11bn financial fraud at WorldCom.", "(2) His closest associate, Scott Sullivan, implicated his former colleague in this accounting scandal.", "(3) Sullivan implicates Ebbers as a part of the conspiracy to hide the truth about WorldCom's financial status.", "(4) Ex-CEO Bernie Ebbers is denying charges of conspiracy and fraud."], "phi:2.7b": [" Bernie Ebbers was involved in a $11bn financial fraud at WorldCom, as his former associate Scott Sullivan claimed in court.", "Senior WorldCom executives orchestrated the fraud by hiding expenses and exaggerating revenues.", "Mr Ebbers denied all the charges and left accounting to his colleague.", "However, on Monday, Mr Sullivan named Mr Ebbers as one of five executives involved in the fraud.", "He described him as detail-oriented and obsessed with costs."], "orca-mini:3b": [" Bernie Ebbers was directly involved in the $11 billion financial fraud at WorldCom and has denied multiple charges of conspiracy and fraud.", "Senior executives at the former telecoms company exaggerated revenues and hid the cost of expenses.", "Mr Ebbers directed a close associate to hide the true state of the company's finances by providing false information to the firm's accountants.", "He has been accused of being aware of the fraud and is expected to face up to 85 years in prison if convicted."], "hermes3:3b": ["WorldCom boss Bernie Ebbers aware of $11bn financial fraud, ex-finance chief Scott Sullivan implicates him in US court."], "stablelm-zephyr:3b": ["Bernie Ebbers, former WorldCom boss, was directly involved in the $11bn financial fraud at the company, according to his ex-associate Scott Sullivan.", "Testifying in Ebbers' criminal trial, Sullivan informed the court that Ebbers participated in the accounting scandal alongside senior executives who inflated revenues and hid expenses.", "WorldCom filed for bankruptcy, marking the largest bankruptcy in US history.", "Ebbers has denied multiple charges of conspiracy and fraud, claiming he was unaware of the fraud.", "However, Sullivan implicated Ebbers as one of five executives involved in the accounting fraud and described him as detail-oriented."], "chatgpt-4o-latest": ["Former WorldCom CEO Bernie Ebbers was directly involved in the $11 billion fraud at the company, according to testimony from ex-finance chief Scott Sullivan in a US court.", "Sullivan, the government's key witness, implicated Ebbers in orchestrating the accounting fraud, which exaggerated revenues and hid expenses, leading to the largest bankruptcy in US history.", "Prosecutors allege Ebbers directed Sullivan to falsify financial information, though Ebbers denies the charges, claiming ignorance of accounting details.", "Sullivan testified that Ebbers was highly involved in financial matters and obsessed with cost-cutting.", "If convicted, Ebbers could face up to 85 years in prison."], "stablelm2:1.6b": ["Former WorldCom boss Bernie Ebbers was implicated in $1bn financial fraud by his ex-finance chief, Scott Sullivan, during a US court trial.", "Sullivan testified that WorldCom executives exaggerated revenues and hid expenses, leading to bankruptcy.", "Prosecutors alleged that Ebbers directed Sullivan to provide false information to the firm's accountants.", "Despite this evidence, Ebbers denies all charges, claiming he was unaware of the fraud.", "The case centers on whether Ebbers personally oversaw the financial manipulations at WorldCom."], "granite3.1-dense:2b": ["Bernie Ebbers, former WorldCom CEO, was directly involved in a $11 billion financial fraud at his company, according to testimony from his ex-finance chief, Scott Sullivan, in a US court.", "Sullivan, who pleaded guilty to fraud and is cooperating with the government, described Ebbers as detail-oriented and obsessed with cost-cutting measures.", "Sullivan testified that Ebbers had a hands-on grasp of financial information and knew more about accounting practices than many CFOs.", "The fraud involved exaggerating revenues and hiding expenses, leading to WorldCom's bankruptcy in 2002—the largest US bankruptcy at the time.", "Ebbers denies all charges, asserting he was unaware of the fraud and left financial details to Sullivan.", "If convicted on all counts, Ebbers faces up to 85 years in prison."]}