{"raw_text": "Bush budget seeks deep cutbacks\n \n President Bush has presented his 2006 budget, cutting domestic spending in a bid to lower a record deficit projected to peak at $427bn (£230bn) this year.\n \n The $2.58 trillion (£1.38 trillion) budget submitted to Congress affects 150 domestic programmes from farming to the environment, education and health. But foreign aid is due to rise by 10%, with more money to treat HIV/Aids and reward economic and political reform. Military spending is also set to rise by 4.8%, to reach $419.3bn. The budget does not include the cost of running military operations in Iraq and Afghanistan, for which the administration is expected to seek an extra $80bn from Congress later this year.\n \n Congress will spend several months debating George W Bush's proposal.\n \n The state department's planned budget would rise to just under $23bn - a fraction of the defence department's request - including almost $6bn to assist US allies in the \"war on terror\". However, the administration is keen to highlight its global effort to tackle HIV/Aids, the BBC's Jonathan Beale reports, and planned spending would almost double to $3bn, with much of that money going to African nations. Mr Bush also wants to increase the amount given to poorer countries through his Millennium Challenge Corporation. The scheme has been set up to reward developing countries that embrace what the US considers to be good governance and sound policies. Yet Mr Bush's proposed spending of $3bn on that project is well below his initial promise of $5bn.\n \n A key spending line missing from proposals is the cost of funding the administration's proposed radical overhaul of Social Security, the pensions programme on which many Americans rely for their retirement income.\n \n Some experts believe this could require borrowing of up to $4.5 trillion over a 20-year period. Neither does the budget include any cash to purchase crude oil for the US emergency petroleum stockpile. Concern over the level of the reserve, created in 1970s, has led to rises in oil prices over the past year. The Bush administration will instead continue to fill the reserve by taking oil - rather than cash - from energy companies that drill under federal leases.\n \n The outline proposes reductions in budgets at 12 out of 23 government agencies including cuts of 9.6% at Agriculture and 5.6% at the Environmental Protection Agency. The spending plan for the year beginning 1 October is banking on a healthy US economy to boost government income by 6.1% to $2.18 trillion. Spending is forecast to grow by 3.5% to $2.57 trillion. But the budget is still the tightest yet under Mr Bush's presidency. \"In order to sustain our economic expansion, we must continue pro-growth policies and enforce even greater spending restraint across federal government,\" Mr Bush said in his budget message to Congress. Mr Bush has promised to halve the US's massive budget deficit within five years. The deficit, partly the result of massive tax cuts early in Mr Bush's presidency, has been a key factor in pushing the US dollar lower. The independent Congressional Budget Office estimates that the shortfall could shrink to little more than $200bn by 2009, returning to the surpluses seen in the late 1990s by 2012. But its estimates depend on the tax cuts not being made permanent, in line with the promise when they were passed that they would \"sunset\", or disappear, in 2010. Most Republicans, however, want them to stay in place. And the figures also rely on the \"Social Security trust fund\" - the money set aside to cover the swelling costs of retirement pensions - being offset against the main budget deficit.\n", "llama3.2:1b": ["Bush's 2006 budget seeks deep cuts in domestic spending, with $2.58 trillion (£1.38 trillion) allocated for domestic programs and foreign aid rising by 10%.", "Military spending is also increasing by 4.8% to $419.3bn.", "The administration aims to raise an extra $80bn from Congress later this year for military operations in Iraq and Afghanistan.", "Domestic spending would rise to £23bn, with most of the money going to African nations under the Millennium Challenge Corporation."], "llama3.2:3b": ["President Bush's 2006 budget includes deep cutbacks in domestic spending but a 10% increase in foreign aid, with $419.3bn allocated for military spending.", "The budget excludes the cost of Iraq and Afghanistan operations, which the administration will seek extra funding for later.", "Social Security funding is missing from proposals, potentially requiring borrowing."], "gemma2:2b": ["President Bush's 2006 budget seeks deep cuts in domestic spending to reduce a record $427 billion deficit.", "The budget prioritizes military and foreign aid, proposing a 10% increase for foreign aid and a 4.8% rise in military spending.", "Key reductions include the Agriculture and Environmental Protection Agency budgets.", "Spending on HIV/Aids treatment will see a significant increase, while the funding for Social Security remains unaddressed.", "The plan relies on economic growth to boost government income and aims to reduce the deficit by half within five years."], "qwen2.5:0.5b": ["President Bush has presented his 2006 budget for Congress, which includes a $427 billion record deficit projected to peak in 2012.", "The budget affects domestic programs like agriculture and education but does not include funding for military operations or treatment of HIV/Aids.", "Key spending lines missing from the budget are cuts at Agriculture and Environmental Protection Agencies.", "The plan forecasts a $2.58 trillion budget that includes savings in domestic spending, but a $419.3 billion increase in foreign aid."], "qwen2.5:1.5b": ["President Bush presents a $2.58 trillion budget for 2006, proposing deep cuts in domestic spending while increasing military and foreign aid funding.", "Key areas include reducing domestic programs like agriculture and education; boosting HIV/AIDS treatment abroad; raising defense spending by 4.8% to over $419 billion; and cutting Social Security costs by up to $4.5 trillion over two decades.", "The budget aims to lower the projected federal deficit to $230 billion, but excludes funding for Iraq and Afghanistan operations and a crude oil stockpile."], "qwen2.5:3b": ["Bush's 2006 budget seeks deep cuts in domestic spending to address a projected $427bn ($230bn) deficit this year, affecting over 150 programs.", "Foreign aid and military spending will increase.", "The state department's budget is expected to rise slightly with a focus on HIV/AIDS treatment and economic/political reform abroad.", "Social Security funding remains undisclosed.", "Oil reserves for emergency use will be funded by energy companies rather than cash contributions.", "The budget includes cuts at 12 out of 23 agencies, notably reducing the Agriculture and Environmental Protection Agency budgets significantly.", "Bush anticipates government income growing by 6.1%, but spending forecast to grow by only 3.5% to $2.57 trillion.", "He promises to halve the deficit within five years but acknowledges it depends on tax cuts not being made permanent and the Social Security trust fund being used against the main budget shortfall."], "opencoder:1.5b": ["The output from the text is a summary detailing the Bush budget's actions and effects, focusing on key spending lines and potential future growth plans.", "The absence of explanations or reasoning process will keep the focus crisp."], "smollm:1.7b": ["The summary is concise and focuses on key ideas and details.", "The main points are:\n\n1.", "Bush budget seeks deep cuts in domestic spending, but foreign aid is due to rise by 4.8%.", "Military spending is also set to rise by 4.8%.", "2.", "The state department's planned budget would rise to almost $23bn - a fraction of the defence department's request.", "3.", "The proposed budget for HIV/AIDS treatment and poverty relief in developing countries is well below Mr Bush's initial promise.", "4.", "Some experts believe that this could require borrowing of up to $4.5 trillion over 20 years.", "5.", "The outline proposes reductions in budgets at 12 out of 23 government agencies, including cuts of 9.6% at Agriculture and 5.6% at the Environmental Protection Agency.", "6.", "Spending is forecast to grow by 3.5% to $2.18 trillion.", "7.", "The budget is still the tightest yet under Mr Bush's presidency.", "8.", "\"In order to sustain our economic expansion, we must continue pro-growth policies and enforce even greater spending restraint across federal government,\" Mr Bush said in his budget message to Congress.", "9.", "The deficit could shrink to little more than $200bn by 2009 if the tax cuts are made permanent, but its estimates depend on the tax cuts not being made permanent, in line with the promise when they were passed that they would \"sunset\", or disappear, in 2010.", "10.", "Most Republicans, however, want them to stay in place.", "And the figures also rely on the Social Security trust fund being offset against the main budget deficit."], "deepseek-r1:1.5b": ["President George W. Bush's 2006 budget proposed a substantial cut to U.S. domestic spending, aiming for a record deficit of over $427 billion.", "The total budget was estimated at $2.58 trillion, distributing $1.38 trillion across 150 domestic programs.", "Foreign aid is expected to rise by 10%, with increased funding for HIV/AIDS and rewards for reform.", "Military spending will increase by 4.8%, but the costs for Iraq and Afghanistan operations remain unassigned.", "The state department's budget was planned at $23 billion, including a boost for \"allies in the war on terror,\" though this could exceed the previous request.", "The administration aims to emphasize its global efforts in HIV/AIDS and highlighted plans to double spending to nearly $3 billion, with part of it going towards reducing Social Security cuts.", "Key areas affected include agriculture (9.6% cut) and environmental protection (5.6% cut).", "The budget is forecast to grow by 3.5%, with economic growth expected to drive over $2.18 trillion in income, offering a 6.1% boost.", "This year's spending will nearly double to $2.57 trillion, though it remains the tightest yet under Bush's presidency.", "Experts estimate $4.5 trillion borrowing is needed over 20 years, and significant tax cuts were made but are likely to last only until 2010.", "Republicans prefer keeping tax cuts, while the Social Security trust fund needs balancing to avoid deficits.", "Overall, the budget focuses on reducing domestic spending, with foreign aid and military changes expected, though it is less restrictive than previous budgets."], "tinyllama:1.1b": ["The President Bush presented his 2006 budget, which cut domestic spendings and affected 150 programmes from farm farming to education and health, but foreign aid is due to rise by 10% with more money for treating HIV/Aids and rewarding economic and political reform.", "Military spending is also set to rise, reaching $419.3bn, as the US government awaits Congress's decision on an extra $80bn.", "Congress will spend several months debating George W Bush's proposal, with $23bn for state department's planned budget expected, almost doubling to $3bn, increasing the amount given to poorer countries through Millennial Chaltenge Corporation and aiming to increase the amount funded by social security.", "The administration will be forced to balance its proposals, including spending cuts of 9.6% at agriculture and 5.6% at environment protection agency, with a healthy US economy to boost government income by 6.1%, with budget being banking on an economic expansion, pro-growth policies and enforcing even greater spendings restraint across federal government, and tax cuts being seen as the cause of pushing the US dollar lower.", "However, the independent Congressional Budget Office estimates that the shortfall could shrink to little more than $200bn by 2009, returning to the surpluses seen in the late 1990s, with most Republican wanting the tax cuts not being made permanent, and the \"Social Security trust fund\" expected to be offset against main budget deficiit."], "tinydolphin:1.1b": [" President Bush's 2006 budget, aimed at lowering a record US deficit projected for this year, cut domestic spending by nearly $427 billion to reduce the national debt by $427 billion and help balance the budget.", "The budget allocates $2.58 trillion to domestic programs with an additional $10 billion to treat HIV/AIDS, and an extra $3 billion for military spending.", "The budget also increases military spending by 4% while maintaining military operations in Iraq and Afghanistan.", "President Bush's proposal does not include funding for the Millennium Challenge Corporation, which has been set up to reward developing countries that embrace good governance and sound policies.", "However, the administration plans to increase funding for poorer countries through its Global Efforts initiative.", "In addition, the budget allocates $3 billion for Operation Iraqi and $1 billion for Operation Enduring Freedom to help fund the US war on terror.", "The state department's planned budget would rise by almost $6 billion, with more money allocated for assistance to US allies in Iraq and Afghanistan.", "Major spending increases include $23 billion for Social Security, which has been set aside to reward good governance and sound policies.", "However, the administration aims to reduce the total amount spent on that program by $4.5 billion over 20 years.", "Some experts believe the budget requires borrowing of up to $4.5 trillion over a 20-year period.", "The budget also includes a proposal for the creation of a new pension plan, known as the \"emergency petroleum stockpile,\" to fund the administration's proposed radical overhaul of Social Security."], "phi:2.7b": [" President Bush's 2006 budget proposes deep cuts to domestic spending with a $2.58 trillion (£1.38 trillion) budget that affects 150 programs from farming to health and foreign aid, which is expected to increase by 10%.", "Military spending is also set to rise by 4.8%, reaching $419.3 billion.", "The state department's planned budget would rise slightly but the administration is focusing on its global effort to fight HIV/Aids and reward economic and political reform.", "However, it falls short of its initial promise of $5 billion for the Millennium Challenge Corporation.", "The Bush administration also wants to revamp Social Security, which has not been funded in the budget.", "Other cuts include Agriculture and Environmental Protection Agency.", "Despite this, the budget is the tightest yet under Mr. Bush's presidency and assumes a healthy US economy to boost government income by 6.1%."], "orca-mini:3b": [" President Bush has presented his 2006 budget, which includes deep cutbacks in domestic spending and a rise in military spending, while foreign aid is expected to rise by 10% and treatment for HIV/Aids and reward economic and political reform are prioritized.", "The budget does not include the cost of running military operations in Iraq and Afghanistan, but Congress will debate it for several months.", "The state department's planned budget would rise to just under $23bn, with almost $6bn going towards assisting US allies in the \"war on terror\".", "However, the administration is keen to highlight its global effort to tackle HIV/Aids and planned spending would almost double to $3bn, with much of that money going to African nations.", "The budget does not include the cost of funding the administration's proposed radical overhaul of Social Security, which could require borrowing up to $4.5 trillion over a 20-year period."], "hermes3:3b": ["Bush budget cuts domestic spending and aims to lower record deficit of $427bn by reducing budgets at 12 out of 23 government agencies, with foreign aid and military spending also increasing."], "stablelm-zephyr:3b": ["President Bush presented a 2006 budget seeking deep cutbacks, focusing on lowering the record deficit projected at $427 billion.", "The $2.58 trillion budget impacted 150 domestic programs, including increases in military spending and foreign aid.", "However, Congress will spend several months debating the proposal.", "Key details include an increase in HIV/AIDS funding, planned spending to support US allies in the \"war on terror,\" and a decrease in Social Security budget.", "The budget assumes a healthy US economy boosting government income by 6.1% with spending forecasted to grow 3.5%."], "chatgpt-4o-latest": ["President Bush's 2006 budget proposal aims to reduce the record $427 billion deficit by cutting domestic spending across 150 programs, including agriculture, environment, education, and health, while increasing foreign aid by 10% and military spending by 4.8% to $419.3 billion.", "The budget excludes costs for military operations in Iraq and Afghanistan, for which an additional $80 billion will be requested.", "The State Department's budget would rise to nearly $23 billion, with $6 billion allocated to allies in the \"war on terror\" and $3 billion for HIV/AIDS programs, primarily in Africa.", "Funding for the Millennium Challenge Corporation is set at $3 billion, below the initially promised $5 billion.", "The budget does not account for the cost of Social Security reform, which could require up to $4.5 trillion in borrowing over 20 years, nor does it allocate cash for the U.S. emergency petroleum reserve.", "Spending cuts are proposed for 12 of 23 government agencies, including a 9.6% reduction at Agriculture and 5.6% at the Environmental Protection Agency.", "The budget relies on a projected 6.1% increase in government revenue and a 3.5% rise in spending, with Bush aiming to halve the deficit within five years.", "The Congressional Budget Office estimates the deficit could shrink to $200 billion by 2009 and return to surpluses by 2012, but this depends on tax cuts expiring as planned in 2010, a move opposed by most Republicans.", "The projections also rely on using the Social Security trust fund to offset the main budget deficit."], "stablelm2:1.6b": ["President Bush presented his $2 trillion budget, cutting domestic spending and increasing aid to address a projected record deficit of $1 trillion this year.", "The budget will affect programs from farming to environment and education, with foreign aid rising by %.", "Military spending is set to rise 4.8%.", "Congress will debate the proposal for several months.", "The budget does not include funding for military operations in Iraq and Afghanistan, which the administration plans to seek from Congress later that year.", "The state department's planned budget would increase to a fraction of the defense department's request at $60 billion, including almost $3 billion for assistance to US allies in the \"war on terror\".", "Spending is forecasted to grow by 3.5% to $2.2 trillion under the budget plan.", "To halve the massive budget deficit, President Bush has promised to reduce it within five years through pro-growth policies and spending restraint across federal government."], "granite3.1-dense:2b": ["President Bush has introduced a 2006 budget proposal totaling $2.58 trillion, aiming to reduce the projected record deficit of $427bn to $231bn by 2009.", "The plan cuts domestic spending across 150 programs, including farming, environment, education, and health, by 9.6% at Agriculture and 5.6% at the Environmental Protection Agency.", "Despite these reductions, military spending will increase by 4.8%, reaching $419.3bn, with an additional $80bn expected for Iraq and Afghanistan operations from Congress.", "Foreign aid is set to rise by 10%, allocating more funds for HIV/AIDS treatment and supporting economic and political reforms in developing nations, potentially doubling to $3bn.", "The administration also plans to enhance the Millennium Challenge Corporation's funding for developing countries with good governance and policies, though this is $1.5bn less than initially promised ($5bn).", "The budget omits costs for military operations in Iraq and Afghanistan, which will be sought from Congress later.", "Key missing lines include funding for Social Security reform (estimated at up to $4.5 trillion over 20 years) and purchasing crude oil for the US emergency petroleum stockpile.", "Instead, the administration will continue filling the reserve through non-cash transactions with energy companies drilling under federal leases.", "The budget anticipates a 6.1% boost in government income from a healthy economy to $2.18 trillion and expects spending to grow by 3.5%, reaching $2.57 trillion, for the fiscal year starting October 1, 2005.", "The proposal emphasizes maintaining pro-growth policies and increased spending discipline to support economic expansion and address the deficit.", "Bush aims to halve the deficit within five years, with the independent Congressional Budget Office estimating it could shrink to nearly $200bn by 2009 and return to surpluses by 2012, provided tax cuts do not become permanent and the \"Social Security trust fund\" offsets the main budget deficit."]}