{"raw_text": "BT offers equal access to rivals\n \n BT has moved to pre-empt a possible break-up of its business by offering to cut wholesale broadband prices and open its network to rivals.\n \n The move comes after telecom regulator Ofcom said in November that the firm must offer competitors \"real equality of access to its phone lines\". At the time, Ofcom offered BT the choice of change or splitting into two. Ofcom is carrying out a strategic review aimed at promoting greater competition in the UK telecom sector. BT's competitors have frequently accused it of misusing its status as the former telecoms monopoly and controller of access to many customers to favour its own retail arm.\n \n This latest submission was delivered to the watchdog ahead of a deadline for the second phase of its review.\n \n \"Central to the proposals are plans by BT to offer operators lower wholesale prices, faster broadband services and transparent, highly-regulated access to BT's local network,\" the former monopoly said in a statement. \"The United Kingdom has the opportunity to create the most exciting and innovative telecoms market in the world,\" BT chief executive Ben Verwaayen said. \"BT has a critical role to play, and today we are making a set of far-reaching proposals towards that framework,\" he said. BT wants lighter regulation in exchange for the changes, as well as the removal of the break-up threat.\n \n The group is to set up a new Access Services division - with a separate board which would include independent members - to ensure equal access for rivals to the \"local loop\", the copper wires that run between telephone exchanges and households. The company also unveiled plans to cut the wholesale prices of its most popular broadband product by about 8% from April in areas of high customer demand.\n \n It added that it plans to invest £10bn in the next five years to create a \"21st Century network\". To meet the growing demand for greater bandwidth, BT said it would begin trials in April with a view to launching higher-speed services nationally from the autumn.\n \n Telecom analysts Ovum welcomed the move, saying BT had \"given a lot of ground\".\n \n \"The big question now is whether the industry, and particularly Ofcom feels BT's proposals go far enough ...Now the real negotiation begins,\" director of telecoms research Tony Lavender said. Internet service provider (ISP) Plus.net also backed the proposals saying \"we will be entirely happy if Ofcom accepts them\". \"BT has been challenged to play fair and its plans will introduce a level playing field. The scenario now is how well people execute their business plans as a service provider,\" chief executive Lee Strafford said. Chris Panayis, managing director of ISP Freedom2surf said that it would make the situation clearer for business. \"I think it's the first productive thing we've had from BT,\" he said.\n \n AOL backed the price cuts but said regulation was still needed to ensure a level playing field. \"This is a reminder to Ofcom that as long as BT can change the dynamics of the whole broadband market at will, the process of opening up the UK's local telephone network to infrastructure investment and competition remains fragile,\" a spokesman said. \"Ofcom needs to return to regulation of the wholesale broadband service [IPStream] and provide more robust rules for local loop unbundling if consumers are to see the benefits of increased competition and infrastructure investment.\" More than 100 telecom firms, consumer groups and other interested parties are expected to make submissions to the regulator during this consultation phase. Ofcom is expected to spend the next few weeks examining the proposals before making an announcement within the next few months.\n", "llama3.2:1b": ["BT offers equal access to rivals by cutting wholesale broadband prices and opening its network to competition, as it submits a proposal for a second phase of Ofcom's strategic review aimed at promoting greater competition in the UK telecom sector.", "BT plans to cut wholesale prices by 8% from April and invest £10bn in new infrastructure over five years.", "The company also wants lighter regulation in exchange for these changes, including the removal of a break-up threat.", "Telecom analysts have welcomed the move, but others are still awaiting Ofcom's response before considering the proposals a major step forward."], "llama3.2:3b": ["BT offers lower wholesale broadband prices and opens its network to rivals, including plans for a new Access Services division with independent members, in response to a possible break-up of its business amid calls for greater competition in the UK telecom sector."], "gemma2:2b": ["BT will offer lower wholesale broadband prices, faster service speeds, and transparent access to its network for competitors.", "They'll create a new division to ensure equal access to the \"local loop\" and cut prices on their popular broadband product by 8% starting in April.", "BT plans to invest £10bn over five years to create a \"21st Century Network.\"", "Industry analysts welcome the move, but will continue to monitor if it goes far enough, with further negotiation expected between BT and Ofcom."], "qwen2.5:0.5b": ["BT offers to cut prices for its broadband services and open up competition with rivals, amid a planned review of the UK telecoms market by OFCOM.", "The company plans to offer lower wholesale rates, faster speeds, transparent access to local networks, and investment in creating a more efficient network.", "BT wants to ensure fair competition and regulation is put in place before making any changes.", "Other companies like AOL and ISP Plus.net have also backed similar proposals."], "qwen2.5:1.5b": ["BT has submitted proposals aimed at promoting greater competition in the UK telecom sector by offering equal access to rivals and cutting wholesale prices for broadband services, with plans to invest £10bn over five years to meet growing demand for bandwidth."], "qwen2.5:3b": ["BT has offered to cut wholesale broadband prices and open its network to rivals after being urged to do so by telecom regulator Ofcom, which previously proposed BT split into two for not providing fair access.", "The move includes plans for lower wholesale prices, faster broadband services, transparent access to the local loop, and a new Access Services division.", "CEO Ben Verwaayen emphasized creating an \"exciting and innovative telecoms market\" while removing the threat of breakup.", "Telecom analysts welcomed BT's proposals but questioned if they go far enough with Ofcom.", "ISPs like Plus.net and Freedom2surf supported the moves as beneficial for competition, though AOL criticized the need for continued regulation to prevent future market dynamics from changing.", "More than 100 parties are expected to submit comments before Ofcom makes a final decision."], "opencoder:1.5b": ["The text summarizes a group of businesses (BT) that has moved to promote competition in the telecom sector, with the aim to increase access for rivals.", "The move comes after Ofcom, which was already operating under strict regulation, made it clear that there would be some form of real equality in access.", "BT’s latest proposals include plans to lower wholesale prices, faster broadband services and to provide more transparency and a regulated environment for its customers.", "In addition, BT has announced plans to invest $10bn towards a \"21st Century network\" which will enable greater bandwidth.", "The move underscores the need to ensure a level playing field between businesses.", "Ovum, director of telecoms research, and ISP Plus.net backed the proposals, while Chris Panayis, managing director of ISP Freedom2surf stressed the importance of returning to regulation."], "smollm:1.7b": ["The summary should be concise and focus on the main ideas:\n\n1.", "BT offers equal access to rivals\n2.", "The move comes after telecom regulator Ofcom said in November that BT must offer competitors \"real equality of access to its phone lines\"\n3.", "The move is part of a strategic review aimed at promoting greater competition in the UK telecom sector\n4.", "BT's competitors have frequently accused it of misusing its status as the former telecoms monopoly and controller of access to many customers to favour its own retail arm\n5.", "The proposals include plans for lower wholesale prices, faster broadband services and a new Access Services division with independent members\n6.", "To meet the growing demand for greater bandwidth, BT said it will begin trials in April with a view to launching higher-speed services nationally from the autumn\n7.", "Telecom analysts Ovum welcomed the move, saying BT had \"given a lot of ground\"\n8.", "The big question now is whether the industry and particularly Ofcom feels BT's proposals go far enough - we'll be entirely happy if Ofcom accepts them"], "deepseek-r1:1.5b": ["BT has announced plans to offer lower wholesale prices for broadband services and expand its network access to competitors.", "Following Ofcom's review in November, BT is now seeking equal access to its phone lines.", "The company is setting up a new Access Services division with a separate board to ensure fairness among rivals.", "It also plans to reduce the wholesale price of its most popular product by 8% and invest £10bn over five years for a \"21st Century network.\"", "Ofcom remains committed to regulating broadband services, aiming to create a competitive market in the UK telecom sector."], "tinyllama:1.1b": ["BT has submitted proposals aimed at pre-empting a possible breakup of its business by opening up its network and offering equal access to rival services, in addition to cutting wholesalerepricing prices and opening local loop unbundling for internet service providers (ISPs).", "The move comes after the telecom regulatory body Ofcom announced plans for promoting greater competition in the UK telecommunications sector.", "BT's competitors have frequently accused it of misusing its status as the former monopoly and controlling access to many customers, allowing them to favor their own retail arm over competitors.", "This latest submission was delivered ahead of a deadline for Ofcom's strategic review of its telecommunications market, with proposals outlining plans by BT to offer lower prices for broadband services to competitors and offering transparent, highly-regulated access to the local network.", "The group also submitted plans to establish an Access Services division, separate from the existing Access and Network Operations Division, to ensure equal access for rival ISPs in areas with high customer demand.", "The proposals would include cutting the prices of BT's most popular broadband product by about 8% from April, while also launching higher-speed services nationally in the coming months.", "Telecom analysts Ovuim welcomed the move and said that BT had given enough ground to negotiate with Ofcom on how they execute their business plans.", "AOL supported BT's plan for equal access but stated that regulatory changes were still needed to ensure a level playing field.", "AOL argued that although BT could change the dynamics of the entire broadband market at will, more robust rules for local loop unbundling if consumer are to see the benefits of increased competition and investment.", "The proposals submitted to Ofcom come ahead of another consultation period during which interested parties are expected to make submissions on how to promote greater competition in the UK telecommunications sector."], "tinydolphin:1.1b": [" BT has proposed equal access for rivals in its pre-emption move, offering competitors lower wholesale broadband prices and faster internet services.", "It will also offer transparent high-speed access to the local loop network to both operators and consumers, as well as investing £10 billion over five years to create a 21st Century network.", "BT plans to invest in trials in April and launches new higher-speed services nationally from autumn.", "The UK has the opportunity to create the most exciting and innovative telecoms market in the world, with Ofcom playing a critical role in ensuring fair competition."], "phi:2.7b": [" BT has proposed offering equal access to its network and wholesale broadband prices for competitors while also opening up local phone lines in line with new regulations by telecom watchdog, Ofcom.", "In exchange for lighter regulation, the company wants to end the threat of a break-up.", "The proposals include plans for an Access Services division with transparent, regulated access to BT's local network and lower pricing.", "BT has promised to invest £10bn to create a \"21st Century network\" over the next five years.", "While some telecom analysts welcome BT's move, others believe that Ofcom should require even more action from BT to promote competition."], "orca-mini:3b": [" BT has offered to cut wholesale broadband prices and open its network to rivals, as part of a response to a threat from regulator Ofcom to split the company into two.", "The move comes after telecoms regulator Ofcom said in November that the firm must offer competitors \"real equality of access to its phone lines\".", "BT's competitors have frequently accused it of misusing its status as the former telecoms monopoly and controller of access to many customers to favour its own retail arm."], "hermes3:3b": ["BT offers lower wholesale broadband prices and equal network access to rivals, in response to telecoms regulator Ofcom's demand for fair competition after suggesting BT might need to split its business."], "stablelm-zephyr:3b": ["BT proposes lowering wholesale broadband prices and opening its network to competitors in order to prevent a possible break-up.", "The move comes after UK telecom regulator Ofcom ordered BT to provide equal access to its customers, leading BT to create plans for lower wholesale prices, faster broadband services, and transparent access to their local network.", "They also aim to invest £10 billion over the next five years and launch higher-speed services nationally by autumn.", "Although AOL backs the price cuts, they believe regulation is necessary to maintain a level playing field.", "Ofcom will review the proposals over the next few weeks before making an announcement."], "chatgpt-4o-latest": ["BT has proposed measures to avoid a potential break-up by offering lower wholesale broadband prices and ensuring equal access to its network for rivals.", "This move follows Ofcom's demand for fair access to BT's infrastructure to promote competition in the UK telecom sector.", "BT plans to establish a new Access Services division with independent oversight and invest £10bn over five years in a next-generation network.", "The company also intends to cut broadband prices by 8% in high-demand areas and launch higher-speed services.", "While telecom analysts and ISPs welcomed the proposals, some, including AOL, stressed the need for continued regulation to ensure fair competition.", "Ofcom will review submissions from over 100 stakeholders before making a decision in the coming months."], "stablelm2:1.6b": ["BT offers equal access to rivals by lowering wholesale broadband prices and opening its network to competitors, as required by telecom regulator Ofcom's strategic review aimed at promoting greater competition in the UK telecom sector.", "This follows accusations from BT's competitors that it misused its status as the former monopoly controller of many customers to favor its own retail arm.", "The move aims to create a more exciting and innovative telecoms market worldwide.", "If Ofcom accepts the proposals, BT plans to invest £1bn over the next five years to create a \"Century network\" with lighter regulation for the changes."], "granite3.1-dense:2b": ["BT has proposed significant changes to improve competition in the UK telecom sector, following a directive from telecom regulator Ofcom to offer competitors \"real equality of access\" to its phone lines or risk splitting into two.", "Key elements of BT's plan include:\n\n1.", "Offering lower wholesale broadband prices and faster services to rivals at reduced costs.", "2.", "Establishing a new Access Services division with an independent board to ensure equal, highly-regulated access to the \"local loop\" (copper wires connecting exchanges to households).", "3.", "Cutting the wholesale price of its most popular broadband product by about 8% in high-demand areas from April.", "4.", "Investing £10 billion over five years for a \"21st Century network\" to meet growing bandwidth demands, with plans to launch higher-speed services nationally by the autumn.", "5.", "Proposing lighter regulation in exchange for these changes and the removal of the break-up threat.", "These measures aim to create a more competitive UK telecom market, according to BT CEO Ben Verwaayen.", "Telecom analysts and industry players, such as AOL, Plus.net, and Freedom2surf, have generally welcomed the proposals, viewing them as crucial steps towards a level playing field.", "However, Ofcom will now evaluate whether these changes sufficiently address concerns about BT's previous practices and market dominance."]}