{"raw_text": "Turkey knocks six zeros off lira\n \n Turkey is to relaunch its currency on Saturday, knocking six zeros off the lira in the hope of boosting trade and powering its growing economy.\n \n The change will see the end of such dizzyingly-high denominations as five million lira - enough for a short taxi ride - and the 20m note, worth $15. These valuations were the product of decades of inflation which, as recently as 2001, was as high as 70%. Inflation has since been tamed and economic prospects are improving.\n \n The currency - officially to be known as the new lira - will be launched at midnight on 1 January. From that point, the one-million lira note will become the new one-lira coin. The government hopes the change will be seen as a promise of growing economic stability as Turkey embarks on the long process of trying to join the European Union.\n \n On an everyday level, it is hoped the change will stimulate more international trade and end confusion among foreign investors and Turks alike. \"The transition to the new Turkish lira shows clearly that our economy has broken the vicious circle that it was imprisoned in for long years,\" said Sureyya Serdengecti, head of the Turkish Central Bank. \"The new lira is also the symbol of the stable economy that we dreamed of for long years.\"\n \n The Turkish economy teetered on the brink of collapse in 2001 when the lira plunged in value and two million people lost their jobs.\n \n Turkey had to turn to the International Monetary Fund for financial assistance, accepting a $18bn loan in return for pushing through a wide-ranging austerity programme. These tough measures have borne fruit. Inflation fell below 10% earlier this year for the first time in decades while exports are up 30% this year. Meanwhile, the economy is expanding at a healthy rate, with 7.9% growth expected in 2004. The government hopes that the new currency will cement the country's economic progress, two weeks after EU leaders set a date for the start of Turkey's accession talks.\n \n The slimmed-down lira is likely to be widely welcomed by the business community.\n \n \"The Turkish lira has been like funny money,\" Tevfik Aksoy, chief Turkish economist for Deutsche Bank, told Associated Press. \"Now at least in cosmetic terms it will look like real currency.\" However, some do not feel quite so happy about seeing the nominal value of their investments reduced. \"If a person has 10 billion lira in investments this will suddenly decrease,\" shop owner Hayriye Evren, told Associated Press. \"This will definitely affect people psychologically.\"\n", "llama3.2:1b": ["Turkey is to reissue its currency as the new lira and remove six zeros from the current version, with some economists predicting a boost to trade and economic growth.", "The change is part of Turkey's efforts to join the European Union and stabilize its economy.", "The move aims to reassure foreign investors and improve business confidence, despite concerns about the impact on certain individuals' investments."], "llama3.2:3b": ["Turkey is launching a new currency on January 1, knocking six zeros off the lira to boost trade and economic growth.", "The old high-denomination notes will be replaced by a slimmed-down one-million lira note becoming the one-lira coin.", "The move aims to end inflation and stimulate international trade after years of struggling with an unstable economy."], "gemma2:2b": ["Turkey is reintroducing its currency with a new denomination, dropping six zeros from the previous lira.", "The change aims to boost trade and signal economic stability as Turkey seeks EU membership.", "This shift is expected to simplify international transactions and benefit businesses.", "However, some investors may feel negatively affected by the lower nominal value of their investments."], "qwen2.5:0.5b": ["A new Turkish lira is being introduced to replace the old one, and it's expected to boost trade and improve the country's economy.", "The government hopes that changes to the currency will help Turkey join the European Union and make the country more stable.", "Some businesses believe the new currency is a good idea, but others are concerned about its value in terms of foreign investments."], "qwen2.5:1.5b": ["Turkey plans to relaunch its currency by knocking six zeros off the lira, officially changing it to the new Turkish lira on January 1st at midnight, aimed at boosting trade and economic stability as Turkey prepares for EU accession talks.", "The change involves reducing high denominations like five million lira ($15), aiming to stimulate more international trade and ease confusion among foreign investors and Turks."], "qwen2.5:3b": ["Turkey relaunches its currency on January 1st by introducing the new lira with six zeros removed to combat high inflation (recently at 70%).", "The old five million and twenty million note values are eliminated.", "This reform aims to boost trade and strengthen economic stability, following years of financial crises and IMF intervention that led to job losses in 2001.", "Turkey's economy has since improved with exports increasing by 30% this year and expected growth at 7.9% in 2004.", "The new lira is expected to be welcomed by businesses while some investors may feel negatively about the reduced nominal value of their investments."], "opencoder:1.5b": ["Turkey knocks six zeros off lira.", "Turkey is to relaunch its currency on Saturday, knocking six zeros off the lira.", "The change will see the end of such dizzyingly-high denominations as five million lira - enough for a short taxi ride - and the 20m note, worth $15.", "These valuations were the product of decades of inflation which, as recently as 2001, was as high as 70%.", "Inflation has since been tamed and economic prospects are improving.", "The currency is officially to be known as the new lira.", "From that point, the one-million lira note will become the new one-lira coin.", "The government hopes the change will be seen as a promise of growing economic stability.", "On an everyday level, it is hoped the change will stimulate more international trade and end confusion among foreign investors.", "The transition to the new Turkish lira shows clearly that our economy has broken the vicious circle that it was imprisoned in for long years."], "smollm:1.7b": ["The summary should preserve the key ideas and details from the original text while omitting any unnecessary information or explanations.", "The main points of the text are:\n\n1.", "Turkey is to relaunch its currency on Saturday, knocking six zeros off the lira in the hope of boosting trade and powering its growing economy.", "2.", "The change will see the end of such dizzyingly-high denominations as five million lira - enough for a short taxi ride - and the 20m note, worth $15.", "These valuations were the product of decades of inflation which, as recently as 2001, was as high as 70%.", "3.", "The currency - officially to be known as the new lira - will be launched at midnight on 1 January.", "From that point, the one-million lira note will become the new one-lira coin.", "4.", "On an everyday level, the change is hoped to stimulate more international trade and end confusion among foreign investors and Turks alike.", "5.", "The Turkish economy teetered on the brink of collapse in 2001 when the lira plunged in value and two million people lost their jobs.", "6.", "Turkey had to turn to the International Monetary Fund for financial assistance, accepting a $18bn loan in return for pushing through a wide-ranging austerity programme.", "These tough measures have borne fruit.", "7.", "The slimmed-down lira is likely to be widely welcomed by the business community.", "8.", "If a person has 10 billion lira in investments this will suddenly decrease, this will definitely affect people psychologically."], "deepseek-r1:1.5b": ["Turkey replaced the five million lira note with a 20 million and a 10 billion lira note, hoping it would boost trade and aid in growth.", "The new lira was introduced on January 1st, replacing the one million lira coin.", "The old five million note will now be part of a new series, with the government hopes this move signals economic stability.", "The Turkish lira has been highly volatile since 2001 but is now stable at around $3-4M.", "Some investors feel happy due to the currency's value, while others worry about the loss of investment value."], "tinyllama:1.1b": ["In an effort to stimulate trade and boost Turkey's economic growth, the Turkish government has announced the launch of a new currency, the new lira, with dizzyingly high denominations (five million lira and 20 million) replaced by smaller, more conventional ones.", "This change will take effect on January 1st, after months of inflationary pressures in Turkey and efforts to reform the economy since 2001.", "The new lira is meant as a symbol of stability for foreign investors and Turkish citizens alike, who hope it will help drive international trade and end confusion among foreign investors.", "Despite some reservation about the currency's effect on investments, many analysts believe the new lira will be well-received by the business community."], "tinydolphin:1.1b": [" Turkey is planning to launch its new lira currency on January 1st, 2005.", "This new currency aims to help boost trade and stimulate the country's economic growth.", "The previous lira was worth six zeros which dwarfed the value of any other money in the world.", "By reducing these super-high denominations, Turkey hopes to make the lira more user-friendly for international traders and citizens alike.", "The new currency will be called the \"new lira,\" replacing the existing 10m notes with a one million lira note.", "The old 20m note, worth $15, has been replaced by the new 100k note, which is still worth $3.", "The change in denominations can seem confusing to foreign investors and Turks alike, but this transition will help promote more trade and business opportunities for both parties.", "The new lira is not only expected to stimulate more international trade but also reduce confusion among foreign investors and Turks who might be confused by the old currency symbols.", "The government hopes that these changes will help Turkey join the European Union, a process that has been slow but steady.", "Turkey's economy, which is currently in a deep freeze, teetered on the brink of collapse in 2001 when its lira plunged in value and two million people lost their jobs.", "To address these problems, Turkey turned to the International Monetary Fund for financial assistance.", "This loan was used to push through a series of austerity measures aimed at reducing the country's deficit.", "The new lira is expected to provide an economic boost to Turkey's economy, which is predicted to grow by 20% this year.", "Furthermore, the new currency will allow Turkey to join the European Union more easily and reduce costs for both international traders and businesses in the country."], "phi:2.7b": [" Turkey is set to relaunch its currency on January 1st with six zeros removed from the current value of the Turkish Lira.", "The move is aimed at boosting trade and confidence in the country's growing economy.", "One million lira notes will now be equivalent to one new lira coin, and foreign investors are likely to welcome the change.", "However, some people may feel uneasy about seeing their investments worth less."], "orca-mini:3b": [" The Turkish government is relaunching its currency on Saturday, reducing the denomination of the one-million lira note to become the new one-lira coin and setting a new exchange rate for smaller denominations.", "This move is an attempt by the government to stimulate international trade and boost the country's economy, which has been experiencing steady growth in recent years despite challenges from inflation and high unemployment rates.", "The Turkish Central Bank hopes that the change will help clear up confusion among foreign investors and citizens alike."], "hermes3:3b": ["Turkey to launch new lira by relaunching with six zeros removed to combat inflation and boost trade, following economic improvement since 2001."], "stablelm-zephyr:3b": ["Turkey is redesigning its currency, removing six zeros from the lira, to boost trade and encourage economic growth.", "The change affects denominations such as five million lira and 20m note, which were previously inflated beyond usefulness.", "The new lira will be launched on January 1st, replacing the one-million lira note with a new one-lira coin.", "This move is seen as a symbol of stability and progress in Turkey's long journey to join the European Union.", "The change is expected to stimulate international trade, end confusion among foreign investors, and ultimately help the economy grow at a healthy rate with 7.9% growth predicted in 2004.", "However, some individuals may experience psychological effects due to the reduction in the nominal value of their investments."], "chatgpt-4o-latest": ["Turkey is relaunching its currency on January 1, removing six zeros from the lira to boost trade and economic stability.", "The new currency, called the \"new lira,\" aims to simplify transactions and attract foreign investment.", "Decades of high inflation, which peaked at 70% in 2001, had led to excessively high denominations, but recent economic reforms have stabilized inflation below 10%.", "After a financial crisis in 2001, Turkey secured an $18 billion IMF loan and implemented austerity measures, leading to economic growth of 7.9% in 2004 and a 30% rise in exports.", "The government hopes the currency change will reinforce economic progress as Turkey begins EU accession talks.", "While the business community welcomes the move, some individuals are concerned about the psychological impact of seeing their investments' nominal value reduced."], "stablelm2:1.6b": ["Turkey plans to relaunch its currency on January 1st by removing six zeros from the current Lira to boost trade and economy growth.", "The new lira will be officially called the \"new lira,\" with denominations being reduced from five million lira to one- million lira notes becoming the new one-lira coin.", "This move aims to stimulate more international trade, end confusion among foreign investors, and signal a stable economy as Turkey joins the European Union.", "The Turkish economy suffered collapse in 2011 when the lira plummeted, prompting financial assistance from the International Monetary Fund with a $5 billion loan in exchange for pushing through an austerity program.", "Inflation has decreased below 1%, while exports have risen by 3%.", "The new currency aims to strengthen Turkey's economic progress, just as EU leaders set a date for starting accession talks."], "granite3.1-dense:2b": ["Turkey is set to reintroduce its currency on January 1, 2004, as the new Turkish lira, aiming to bolster trade and propel its expanding economy.", "The change will eliminate high-value notes (up to five million lira) and coins (up to 20 million lira), which were once worth significant amounts due to decades of hyperinflation peaking at 70% in 2001.", "Since then, Turkey has made substantial progress, with inflation now below 10%, exports up by 30%, and an expected 7.9% economic growth for 2004.", "The new lira is intended to symbolize a stable economy and promote international trade, fostering confidence among investors and Turks.", "While the business community generally supports this move, some investors express concern about their holdings' reduced value."]}