{"raw_text": "Asia shares defy post-quake gloom\n \n Indonesian, Indian and Hong Kong stock markets reached record highs.\n \n Investors seemed to feel that some of the worst-affected areas were so under-developed that the tragedy would have little impact on Asia's listed firms. \"Obviously with a lot of loss of life, a lot of time is needed to clean up the mess, bury the people and find the missing,\" said ABN Amro's Eddie Wong. \"[But] it's not necessarily a really big thing in the economic sense.\"\n \n India's Bombay Stock Exchange inched slightly above its previous record close on Wednesday. Expectations of strong corporate earnings in 2005 drove the Indonesian stock exchange in Jakarta to a record high on Wednesday. In Hong Kong, the Hang Seng index may be benefiting in part from the potential for its listed property companies to gain from rebuilding contracts in the tsunami-affected regions of South East Asia. In Sri Lanka, some economists have said that as much as 1% of annual growth may be lost. Sri Lanka's stock market has fallen about 5% since the weekend, but it is still 40% higher than at the start of 2004.\n \n Thailand may lose 30bn baht (£398m; $768m) in earnings from tourism over the next three months, according to tourism minister Sontaya Kunplome.\n \n In the affected provinces, he expects the loss of tourism revenue to be offset by government reconstruction spending. Thailand intends to spend a similar sum - around 30bn baht - on the rebuilding work. \"It will take until the fourth quarter of next year before tourist visitors in Phuket and five other provinces return to their normal level,\" said Naris Chaiyasoot, director general at the ministry's fiscal policy office. In the Maldives the cost of reconstruction could wipe out economic growth, according to a government spokesman. \"Our nation is in peril here,\" said Ahmed Shaheed, the chief government spokesman. He estimated the economic cost of the disaster at hundreds of millions of dollars. The Maldives has gross domestic product of $660m. \"It won't be surprising if the cost exceeds our GDP,\" he said. \"In the last few years, we made great progress in our standard of living - the United Nations recognised this. Now we see this can disappear in a few days, a few minutes.\" Shaheed noted that investment in a single tourist resort - the economic mainstay - could run to $40m. Between 10 and 12 of the 80-odd resorts have been severely damaged, and a similar number have suffered significant damage.\n \n However, many experts, including the World Bank, have pointed out that it is still difficult to assess the magnitude of the disaster and its likely economic impact. In part, this is because of its scale, and because delivering aid and recovering the dead remain priorities. \"Calculators will have to wait,\" said an IMF official in a briefing on Wednesday. \"The financial and world community will be turning toward reconstruction efforts and at that point people will begin to have a sense of the financial impact.\"\n", "llama3.2:1b": ["indian stock market\nindonesian stock exchange\nhong kong stock index\nsri lanka's stock market\nthailand's tourism industry\nmaldives' economy"], "llama3.2:3b": ["Asian stock markets reached record highs despite the devastating post-quake gloom, with investors downplaying the economic impact due to the region's underdeveloped areas.", "Thailand may lose £398m in tourism earnings over three months, but expects government reconstruction spending to offset losses.", "The Maldives' economy could be wiped out by reconstruction costs, estimated at hundreds of millions of dollars."], "gemma2:2b": ["Asian stock markets are reaching record highs despite the devastating tsunami.", "While some economists predict a slight dip in certain Asian nations, particularly Sri Lanka and Thailand due to tourism losses, others believe rebuilding efforts will offset these declines.", "The Maldives is facing a potential economic collapse due to significant damage to its tourism-based economy.", "However, experts emphasize that the true economic impact of the disaster will be clearer once reconstruction efforts begin."], "qwen2.5:0.5b": ["Asia's stock markets are experiencing record-breaking gains, with Indonesian and Indian stocks nearing their all-time highs.", "Some economists expect Asia's listed firms to suffer less than other parts of the world from the earthquake-induced tsunami.", "The affected regions may face additional challenges in rebuilding their economies due to infrastructure damage.", "Investors are concerned about potential economic losses related to tourism and reconstruction efforts.", "[summary] Asian stock markets hit record high, with Indonesia and India leading, though some worry about future economic impacts.", "Economic effects will depend on the severity of the tsunami and overall recovery efforts."], "qwen2.5:1.5b": ["Asian stock markets rebound despite tsunami-related troubles, with investors expecting economic recovery through stronger corporate earnings and property developers' potential benefits from rebuilding contracts.", "In Sri Lanka, growth is expected to decrease by 1%, while Thailand's tourism sector may suffer significantly due to $398m loss in revenue and ongoing reconstruction efforts."], "qwen2.5:3b": ["Asia's stock markets reached record highs following the tsunami, with investors viewing affected areas as under-developed enough that economic impacts would likely be minimal.", "Indonesia and Hong Kong saw their exchanges hit new peaks amid expectations of strong corporate earnings in 2005.", "India’s BSE remained above its previous high on Wednesday.", "The Hang Seng index benefited from potential rebuilding contracts in the tsunami-affected regions.", "While some countries like Sri Lanka may lose 1% of annual growth, others are facing significant challenges such as Thailand losing up to £398m in tourism earnings and Maldives expecting economic costs exceeding $660m GDP.", "Experts note that assessing the disaster's impact remains challenging due to ongoing aid efforts and recovery work."], "opencoder:1.5b": ["The Asia Share Defies Post-Quake Gloom\n\nIndonesian, Indian and Hong Kong stock markets reached record highs by the end of the day.", "Investors seemed to feel that some areas were under-developed, causing a tragic outcome.", "\"It's not necessarily a big thing in the economic sense,\" said ABN Amro's Eddie Wong.", "However, it is certainly an important factor for Asian firms.", "The loss of life and time are necessary for the recovery of the damaged structures and people.", "India's Bombay Stock Exchange showed a slight increase in close range on Wednesday, expecting strong earnings in 2005.", "In the world of economies, it’s estimated that a good deal of investment can be recovered after a tsunami-affected region like South East Asia.", "In Sri Lanka, the economy's expected growth rate may be cut by about 1%.", "However, it is still 40% higher than at the start of 2004.", "In the affected provinces, he expects to offset the lost tourism revenue from the disaster in the upcoming months.", "Maldives, a major player in the region, has been at a loss for significant economic gain over the years - probably due to a recovery from a catastrophic event.", "The cost of reconstruction could wipe out economic growth, but it might be worth it if the economy's recovery can lead to improved economic performance.", "Thailand, as a global investor, expects the economic boom in the next three months to offset the tourism costs and expenses spent on construction projects.", "However, many experts say that it is still challenging to assess the magnitude of the disaster and its likely economic impact.", "The cost of a single tourist resort, which could be $40m, makes travelling economically feasible.", "However, it will need to wait until the next few years before people in Phuket and other provinces can start returning, a forecast made by the World Bank."], "smollm:1.7b": ["Asia's stock markets were affected by the Asian tsunami disaster, but it is not necessarily a big economic shock.", "The Indian and Hong Kong stock exchanges may benefit from rebuilding contracts in the affected regions.", "In Sri Lanka, some economists say that as much as 1% of annual growth may be lost due to tourism revenue."], "deepseek-r1:1.5b": ["The Asian stock markets reached record highs following a tragic event.", "Investors believed the tragedy wouldn't significantly impact listed firms in affected regions.", "India's Bombay Exchange slightly rose, Hong Kong's Hang Seng benefited from property companies rebuilding after the disaster, and Thailand expected a $30b loss in tourism earnings over three months.", "The Maldives faced high reconstruction costs exceeding GDP, estimated at hundreds of millions."], "tinyllama:1.1b": ["In Asia, despite a drop in stock prices after the devastating Indian Ocean tsunami, investors seem undeterred by the catastrophic disaster and are optimistic about the region's listed firms.", "While some areas may experience short-term impact, the potential for corporate earnings rebundling and government reconstruction spendings could offset losses over a longer period.", "The post-quake gloom has been broken up by strong corporate earnings and economic growth in the affected provinces of Thailand, Indonesia, and Malaysia.", "However, investors are still unsure about the magnitude of the disaster's impact on Asia's listed firms, with various experts expressing concern over calculating the scale of aid deliveries and recovery efforts."], "tinydolphin:1.1b": [" The tsunami disaster caused significant economic damage across multiple Asian countries, leading to record high stock markets and earnings for listed companies.", "However, the economic impact may not be as severe as initially feared.", "Some analysts believe that the potential for strong corporate earnings in 2005 may offset some of the loss from the disaster.", "The Thai government has estimated the cost of reconstruction at around 30 billion baht ($768 million), while the Maldives is expected to face a staggering economic loss of $12 billion over the next four years due to the destruction caused by the tsunami."], "phi:2.7b": [" Asia's stock markets reached record highs despite the devastation caused by the tsunami, with investors hoping that under-developed areas would not significantly impact listed firms' profits.", "India, Indonesia, and Hong Kong saw their respective indices reach new high points.", "In Sri Lanka, the market has already recovered from the initial shock of the tragedy.", "Thailand's tourism industry is projected to lose a significant amount due to the disaster, but government spending on reconstruction work may offset this.", "The Maldives' economic growth could be affected as well.", "It remains difficult to assess the full extent of the disaster and its financial impact at this point in time."], "orca-mini:3b": [" Asia's stock markets defied doubts over the impact of the South Asian tsunami tragedy, with some listed firms posting record highs despite the loss of life and destruction caused by the disaster.", "Investors seemed to feel that some of the worst-affected areas were so under-developed that the tragedy would have little impact on Asia's listed firms.", "However, it was difficult to assess the magnitude of the disaster and its likely economic impact, as aid and recovery efforts dominated priorities.", "The Indian Bombay Stock Exchange inched slightly above its previous record close on Wednesday, while Indonesia's stock exchange in Jakarta hit a record high.", "In Hong Kong, the Hang Seng index may be benefiting from the potential for its listed property companies to gain from rebuilding contracts in the tsunami-affected regions of South East Asia.", "However, Thailand may lose 30bn baht (£398m; $768m) in earnings from tourism over the next three months, according to tourism minister Sontaya Kunplome.", "In the affected provinces, he expects the loss of tourism revenue to be offset by government reconstruction spending.", "The Maldives could lose hundreds of millions of dollars due to the disaster, and it is still difficult to assess the magnitude of its economic impact.", "However, many experts, including the World Bank, have pointed out that it is still difficult to assess the magnitude of the disaster and its likely economic impact.", "In part, this is because of its scale, and because delivering aid and recovering the dead remain priorities."], "hermes3:3b": ["Asian stocks reach record highs despite Indonesian, Indian & Hong Kong markets being affected by tsunami, with some estimating minimal economic impact due to development level of worst-hit areas."], "stablelm-zephyr:3b": ["Stock markets in Asia, such as Indonesia, India, and Hong Kong, reached record highs despite the post-quake gloom.", "Some experts believe the worst-affected areas would have little impact on listed Asian firms due to their underdevelopment.", "However, there are concerns for tourism earnings in Thailand, estimated to be lost around $398 million over three months, which may be offset by government reconstruction spending.", "The Maldives' economic growth could be destroyed by the cost of reconstruction, with a government spokesman estimating the economic cost of the disaster at hundreds of millions of dollars.", "Although it is still difficult to assess the magnitude and impact of the disaster, experts believe that delivering aid and recovering the dead remain priorities."], "chatgpt-4o-latest": ["Asian stock markets, including those in Indonesia, India, and Hong Kong, reached record highs despite the tsunami disaster.", "Investors believed the affected areas were underdeveloped and would have minimal economic impact on listed firms.", "India's Bombay Stock Exchange and Indonesia's Jakarta Stock Exchange hit new highs due to strong corporate earnings expectations, while Hong Kong's Hang Seng index benefited from potential rebuilding contracts.", "Sri Lanka's stock market dropped 5% but remained significantly higher than at the start of 2004.", "Thailand expects a $768 million loss in tourism revenue but plans to offset it with government reconstruction spending.", "The Maldives faces severe economic consequences, with reconstruction costs potentially exceeding its GDP.", "Experts, including the World Bank and IMF, caution that the full economic impact remains uncertain as aid and recovery efforts take priority."], "stablelm2:1.6b": ["Asia shares rise despite earthquake, with record highs in Indonesia, India, and Hong Kong.", "Investors expect little long-term economic impact from the disaster, such as loss of life or significant cleanup tasks.", "Some countries, like Thailand, may face short-term earnings losses but see potential offset from government reconstruction spending.", "Experts caution that it's difficult to accurately assess the disaster's effects due to its scale and ongoing recovery efforts."], "granite3.1-dense:2b": ["Asian stock markets, including those in Indonesia, India, Hong Kong, Sri Lanka, Thailand, and the Maldives, defied post-tsunami gloom by reaching record highs.", "Indonesia's Jakarta stock exchange achieved a new peak due to anticipated strong corporate earnings in 2005.", "India's Bombay Stock Exchange also climbed slightly above its previous record close.", "Hong Kong's Hang Seng index may benefit from rebuilding contracts in South East Asian regions affected by the tsunami.", "Thailand could lose up to 30 billion baht (£398m; $768m) in tourism earnings over three months, but expects reconstruction spending to offset this loss.", "Similarly, the Maldives faces potential economic devastation due to reconstruction costs estimated at hundreds of millions of dollars, surpassing its GDP of $660m.", "Despite these market gains, experts caution that accurately assessing the disaster's full economic impact is challenging, given the urgent priorities of aid delivery and recovering the dead.", "The World Bank, IMF, and other organizations agree that financial calculations will have to wait until reconstruction efforts can be focused on."]}