{"raw_text": "Split-caps pay £194m compensation\n \n Investors who lost money following the split-capital investment trust scandal are to receive £194m compensation, the UK's financial watchdog has announced.\n \n Eighteen investment firms involved in the sale of the investments agreed the compensation package with the Financial Services Authority (FSA). Splits were marketed as a low-risk way to benefit from rising share prices. But when the stock market collapsed in 2000, the products left thousands of investors out of pocket. An estimated 50,000 people took out split-capital funds, some investing their life savings in the schemes. The paying of compensation will be overseen by an independent company, the FSA said.\n \n Further details of how investors will be able to claim their share of the compensation package will be announced in the new year. \"This should save investors from having to take their case to the Financial Ombudsman Service, something, no doubt, that will be very welcome,\" Rob McIvor, FSA spokesman, told BBC News. Agreeing to pay compensation did not mean that the eighteen firms involved were admitting any guilt, the FSA added. Any investor accepting the compensation will have to waive the right to take their case to the Financial Ombudsman Service.\n \n The FSA has been investigating whether investors were misled about the risks posed by split-capital investment trusts. The FSA's 60 strong investigation team looked into whether fund managers colluded in a so-called \"magic circle\", in the hope of propping up one another's share prices.\n \n Firms involved were presented with 780 files of evidence detailing 27,000 taped conversations and over 70 interviews. In May, the FSA was widely reported as having asked firms to pay up to £350m in compensation. Mr McIvor told the BBC that the final settlement figure was smaller because two unnamed firms had pulled out of the compensation negotiations. Investors in these two firms may now have to take any compensation claim to the Financial Ombudsman Service or the courts.\n", "llama3.2:1b": ["Investors who lost money on split-capital investment trusts are to receive £194m compensation, the UK's financial watchdog has announced.", "The payout will be overseen by an independent company and investors will be able to claim their share in January 2024."], "llama3.2:3b": ["Eighteen investment firms agreed a £194m compensation package with the FSA over split-capital investment trust scandal, leaving estimated 50,000 investors out of pocket after their investments collapsed in 2000."], "gemma2:2b": ["Investors who lost money due to the split-capital investment trust scandal will receive £194 million in compensation.", "Eighteen investment firms agreed to this package, which was reached after an investigation by the Financial Services Authority (FSA).", "The compensation process will be overseen by an independent company.", "While agreeing to pay is not an admission of guilt, some investors may need to pursue claims through alternative channels."], "qwen2.5:0.5b": ["The UK FSA has awarded investors lost from the split-capital investment trust scandal £194m, according to a statement from FSA spokesman Rob McIvor.", "The money will be used as compensation for those whose investments were affected.", "Investors have been informed that they can choose whether or not to make a claim against the Financial Ombudsman Service (FOS)."], "qwen2.5:1.5b": ["Investors who lost money from a split-capital investment trust scandal will receive £194m compensation, with details of claims set for 2023.", "Compensation agreement includes waiving right to FOS in some cases.", "Investigation into firms' alleged misleading practices continues."], "qwen2.5:3b": ["Investors who lost money due to a split-capital investment trust scandal are set to receive £194m in compensation, announced by UK's financial watchdog, the FSA.", "The payout is for investors misled about the risks of these low-risk products marketed as beneficial during rising share prices in 2000.", "Approximately 50,000 people invested life savings in the schemes, which left them out of pocket when the stock market collapsed.", "Compensation will be administered by an independent company and details on how to claim compensation will be announced later this year.", "Investors accepting compensation give up their right to pursue Financial Ombudsman Service or court actions.", "FSA investigated whether investors were misled about risks posed by split-capital investment trusts, finding evidence of potential collusion among firms in maintaining share prices.", "The final settlement figure was lower due to two firms not participating in the compensation negotiations."], "opencoder:1.5b": ["Investors who lost money following the split-capital investment trust scandal are to receive £194m compensation, the UK's financial watchdog has announced.", "Eighteen investment firms involved in the sale of the investments agreed the compensation package with the Financial Services Authority (FSA).", "Splits were marketed as a low-risk way to benefit from rising share prices.", "The stock market collapsed in 2000, the products left thousands of investors out of pocket.", "An estimated 50,000 people took out split-capital funds, some investing their life savings in the schemes.", "The pay of compensation will be overseen by an independent company.", "Further details of how investors can claim their share of the compensation package will be announced in the new year.", "Agreeing to pay compensation did not mean that the eighteen firms involved were admitting any guilt, the FSA added.", "Any investor accepting the compensation will have to waive the right to take their case to the Financial Ombudsman Service.", "The FSA has been investigating whether investors were misled about the risks posed by split-capital investment trusts.", "The FSA's 60 strong investigation team looked into whether fund managers colluded in a so-called \"magic circle\", in the hope of propping up one another's share prices.", "Firms presented with 780 files of evidence detailing 27,000 taped conversations and over 70 interviews.", "In May, the FSA was widely reported as having asked firms to pay up to £350m in compensation.", "Investors can now claim any compensation from these two firms."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details while omitting unnecessary information.", "The text highlights the following points:\n\n1.", "Eighteen investment firms involved in the sale of split-capital investment trusts agreed a compensation package with the FSA.", "2.", "The compensation package was marketed as a low-risk way to benefit from rising share prices, but when the stock market collapsed in 2000, the products left many investors out of pocket.", "3.", "An estimated 50,000 people took out split-capital funds, some investing their life savings in the schemes.", "The paying of compensation will be overseen by an independent company, the FSA said.", "4.", "Further details about how investors can claim their share of the compensation package will be announced in the new year.", "\"This should save investors from having to take their case to the Financial Ombudsman Service,\" Rob McIvor, FSA spokesperson, told BBC News.", "5.", "The FSA has been investigating whether investors were misled about the risks posed by split-capital investment trusts.", "The FSA's 60 strong investigation team looked into whether fund managers colluded in a so-called \"magic circle\", in the hope of propping up one another's share prices.", "6.", "Firms involved were presented with 780 files of evidence detailing 27,000 taped conversations and over 70 interviews.", "In May, the FSA was widely reported as having asked firms to pay up to £350m in compensation.", "Mr McIvor told the BBC that the final settlement figure was smaller because two unnamed firms had pulled out of the compensation negotiations.", "7.", "Investors in these two firms may now have to take any compensation claim to the Financial Ombudsman Service or the courts."], "deepseek-r1:1.5b": ["The UK's financial watchdog, the Financial Services Authority (FSA), announced a £194m compensation package for investors who lost money following the split-capital investment trust scandal.", "Eighteen investment firms agreed with the FSA to pay this amount, which was marketed as a low-risk investment option.", "These funds were sold when share prices were rising.", "However, in 2000, when the stock market collapsed, thousands of investors, many using split-capital funds, were left without pocketed profits.", "Over 50,000 people invested their savings or life money.", "The FSA said compensation would be overseen by an independent company.", "Investors could claim their share of the £194m, but this might require legal steps such as the Financial Ombudsman Service or courts.", "Further details on the payment mechanism will likely be announced in January.", "Additionally, the FSA is investigating whether investors were misled about risks and if fund managers colluded with each other to boost prices.", "Some companies agreed to a larger settlement, potentially affecting their claims."], "tinyllama:1.1b": ["The UK financial watchdog, the Financial Services Authority (FSA), has announced that it will pay compensation of £194m to investors who lost money following the split-capital investment trusts marketing as a low-risk way to benefit from rising share prices.", "The compensation package will be overseen by an independent company, and details on how investors can claim their share have not yet been announced.", "The decision to pay compensation follows an investigation into whether investors were misled about the risks of these investment trusts.", "In total, 18 firms in the marketing of split-capital funds agreed to pay compensation, totalling £350m if they meet certain criteria."], "tinydolphin:1.1b": [" The Financial Services Authority (FSA) announced that investors who lost money following the split-capital investment trust scandal are set to receive £194m in compensation, marking a significant recovery for those affected by the scandal.", "This follows the resolution of a 20-year legal battle, with the firms involved agreeing to pay out in order to avoid further litigation and claims.", "The scandal began when investment firm Hargreave & Co., which marketed split-capital funds, admitted to misleading investors by presenting false information about the risks of these investments.", "Many people were left with little or no understanding of the potential risks involved in taking part in such investments.", "The FSA's investigation revealed that some firms took advantage of a loophole in the law, creating what is known as a \"magic circle\" to protect each other's share prices.", "This allowed investors to lose their money without facing legal consequences.", "As a result, the FSA was seeking compensation for those affected by this misconduct and has now announced that £194m will be paid out to those who were in line with the scandal.", "Investors will have to apply for the compensation payments through their own insurers or lawyers, with any payments made overseen by an independent company.", "This decision was taken to prevent investors from having to go through the Financial Ombudsman Service, which could potentially result in them facing further legal costs and additional administrative hassle.", "The FSA's announcement is a significant milestone for those affected by this scandal, as it acknowledges the hard work of investors in seeking justice against their former employers.", "This decision also serves to send a strong message to other businesses that may be involved in similar misconduct in the future."], "phi:2.7b": [" The FSA has agreed a compensation package for investors who lost money due to investment trust scandals.", "It is estimated that 50,000 people invested their life savings in split-capital funds, and the eighteen companies involved agreed to pay £194m.", "Investors will have to waive their right to take their case to the Financial Ombudsman Service when accepting the compensation.", "The FSA's investigation team looked into whether fund managers colluded with one another, and two firms pulled out of the compensation negotiations, potentially leaving some investors without compensation."], "orca-mini:3b": [" Compensation will be paid to investors who lost money following the split-capital investment trust scandal.", "The £194m package is being agreed between eighteen firms involved in the sale of the investments and the Financial Services Authority (FSA).", "Investors who took out split-capital funds are expected to receive compensation, but details about how this will be done are yet to be announced.", "The FSA believes that investors were misled about the risks associated with these schemes.", "Two unnamed firms pulled out of the compensation negotiations, resulting in a smaller settlement figure."], "hermes3:3b": ["$194m compensation for investors lost due to split-capital investment trust scandal, according to UK financial watchdog's announcement.", "18 investment firms agreed to compensation package overseen by FSA."], "stablelm-zephyr:3b": ["The UK's financial watchdog, the Financial Services Authority (FSA), has announced that investors who lost money due to the split-capital investment trust scandal will receive £194 million in compensation.", "Eighteen investment firms involved in the sale of these investments have agreed on this package.", "The FSA has been investigating whether investors were misled about the risks posed by these investment trusts, with a team examining if fund managers colluded for their own benefit.", "Although the payment of compensation does not mean the eighteen firms admitting guilt, they will oversee how investors claim their share of the compensation package, replacing the need to take cases to the Financial Ombudsman Service.", "Further details on claiming this compensation will be announced in the new year."], "chatgpt-4o-latest": ["Investors who lost money in the split-capital investment trust scandal will receive £194m in compensation, as announced by the UK's Financial Services Authority (FSA).", "Eighteen investment firms agreed to the package, though without admitting guilt.", "Split-capital funds were marketed as low-risk but led to significant losses when the stock market collapsed in 2000, affecting around 50,000 investors.", "Compensation distribution will be overseen by an independent company, with details to be announced in the new year.", "Accepting compensation requires waiving the right to take cases to the Financial Ombudsman Service.", "The FSA investigated whether investors were misled and whether fund managers colluded to support share prices.", "Evidence included 780 files, 27,000 taped conversations, and 70 interviews.", "The final settlement was lower than the initially proposed £350m, as two firms withdrew from negotiations, leaving their investors to seek compensation through the Ombudsman or courts."], "stablelm2:1.6b": ["UK's financial watchdog announces £1 million compensation package for investors affected by split-capital investment trust scandal.", "Eighteen investment firms agreed on the compensation deal, overseen by an independent company.", "An estimated 100,0 C,35 thousand people invested in split-capital funds when they collapsed in 2008.", "Further details of how to claim compensation will be announced soon.", "No admission of guilt from firms involved in scandal."], "granite3.1-dense:2b": ["The UK's financial watchdog, the Financial Services Authority (FSA), has announced a £194m compensation package for investors who lost money due to the split-capital investment trust scandal.", "Eighteen firms agreed to this settlement, which involves marketing these investments as low-risk, high-return schemes.", "However, when the stock market crashed in 2000, many investors were left financially drained, with an estimated 50,000 people affected.", "The FSA will oversee compensation claims, and details on how to claim are expected to be released in the new year.", "This settlement does not imply guilt from the firms involved.", "Investors accepting compensation must waive their right to pursue cases through the Financial Ombudsman Service.", "The FSA's investigation uncovered evidence of potential collusion among fund managers, known as a \"magic circle,\" intended to support each other's share prices.", "Initially, the FSA sought up to £350m in compensation, but this reduced to £194m due to two firms withdrawing from negotiations.", "Those investors in these companies may now need to file claims through courts or the Financial Ombudsman Service."]}