{"raw_text": "Nasdaq planning $100m share sale\n \n The owner of the technology-dominated Nasdaq stock index plans to sell shares to the public and list itself on the market it operates.\n \n According to a registration document filed with the Securities and Exchange Commission, Nasdaq Stock Market plans to raise $100m (£52m) from the sale. Some observers see this as another step closer to a full public listing. However Nasdaq, an icon of the 1990s technology boom, recently poured cold water on those suggestions.\n \n The company first sold shares in private placements during 2000 and 2001. It technically went public in 2002 when the stock started trading on the OTC Bulletin Board, which lists equities that trade only occasionally. Nasdaq will not make money from the sale, only investors who bought shares in the private placings, the filing documents said. The Nasdaq is made up shares in technology firms and other companies with high growth potential. It was the most potent symbol of the 1990s internet and telecoms boom, nose-diving after the bubble burst. A recovery in the fortunes of tech giants such as Intel, and dot.com survivors such as Amazon has helped revive its fortunes.\n", "llama3.2:1b": ["Nasdaq plans to raise $100m from a public share sale to list on the Nasdaq stock index, which would be another step closer to a full public listing despite previous indications that it may not go through."], "llama3.2:3b": ["Nasdaq plans to sell $100m worth of shares to raise funds, effectively listing itself on the market it operates, with investors who previously bought shares through private placements set to profit."], "gemma2:2b": ["Nasdaq Stock Market plans to raise $100 million through a public share sale to fund expansion.", "The company will not profit directly from the sale but investors who bought shares in past private placements will.", "The Nasdaq is composed of tech firms and companies with high growth potential, having benefited from a resurgence in the tech sector following its decline during the dot-com bubble burst."], "qwen2.5:0.5b": ["Nasdaq plans to sell $100 million worth of shares publicly.", "Some observers see this as another step toward full public listing.", "However, Nasdaq recently took a cold shower on the idea.", "The company started selling shares in private placements in 2000 and 2001, but it couldn't make money from these sales.", "Nasdaq is primarily focused on technology companies with high growth potential."], "qwen2.5:1.5b": ["Nasdaq plans to sell shares for $100m ($52m) to raise capital, amid speculation Nasdaq could be preparing a public listing, though recent history suggests this might not happen.", "The tech index's market was dominated by 1990s internet and telecoms stocks that initially traded on the OTC Bulletin Board before going public in 2002.", "Since then, it has been largely overshadowed by current tech trends."], "qwen2.5:3b": ["Nasdaq plans to sell $100m worth of shares publicly for $52m (£52m).", "This follows previous private placements and a 2002 OTC Bulletin Board listing.", "Nasdaq sells these shares only to those who participated in earlier private sales, not from public listings.", "The company operates the tech-focused Nasdaq stock index.", "Initially selling during the 1990s tech boom but experiencing a downturn following the dot-com bubble burst, Nasdaq has seen recent improvements with strong performances by companies like Intel and Amazon."], "opencoder:1.5b": ["Nasdaq planning a $100 million share sale.", "The owner plans to sell shares to the public and list itself on the market it operates according to a registration document filed with the Securities and Exchange Commission.", "Some observers believe this as another step closer to a full public listing, while Nasdaq has recently poured cold water on those suggestions.", "Nasdaq first sold shares in private placements during 2000 and 2001.", "However, it was not publicly traded in 2002, with the stock starting trading only on an OTC Bulletin Board that lists equities that trade rarely.", "The Nasdaq plans to make money from these sales, but investors who bought shares in the private placings are only restricted.", "The company's revenues from this sale have helped revive its fortunes and is made up of high-growth technology firms and other companies with potential for growth.", "It's considered the most potent symbol of the 1990s internet and telecom boom, nose-diving after a bubble burst."], "smollm:1.7b": ["The Nasdaq stock market plans to raise $100 million from a public sale, which is expected to be one step closer to listing on the Nasdaq exchange.", "According to a registration document filed with the Securities and Exchange Commission (SEC), Nasdaq plans to sell shares to the public and list itself on the Nasdaq stock exchange.", "The Nasdaq has historically traded on the Over-the-Counter Bulletin Board (OTCBB) which lists equities that trade only occasionally.", "The company first sold shares in private placements during 2000 and 2001, but it did not make money from the sale.", "Instead, Nasdaq will raise $100 million from investors who bought shares in the private placements.", "The Nasdaq is made up of shares in technology firms and other companies with high growth potential.", "It was one of the most potent symbols of the 1990s internet and telecoms boom, but it also suffered a significant decline after the bubble burst.", "A recovery in the fortunes of tech giants such as Intel and Amazon has helped revive the Nasdaq's fortunes."], "deepseek-r1:1.5b": ["Nasdaq plans to sell shares and list itself publicly, aiming to raise $100 million.", "However, some observers believe this could be an IPO closer to a full listing, while others warn against the history of Nasdaq's success under the bubble.", "Nasdaq has sold shares privately since 2001 and technically went public in 2002 on OTC, only fetching money from private sales.", "It comprises technology companies with high growth potential, once a symbol of the 1990s tech boom but now under significant pressure due to the bubble's collapse."], "tinyllama:1.1b": ["Nasdaq plans to raise $100m through a share sale and list itself on the Nasdaq stock market amidst suggestions of another public listing.", "Nasdaq, which was once a well-known technology-dominated stock index, has also downplayed speculation that it may pursue a full public listing.", "Private placements have been made available for investors who buy shares in the company during 2000 and 2001 but Nasdaq will not make money from this sale as only investors who originally subscribed to these private placements will be making a profit.", "The Nasdaq is listed on the OTC Bullet Board, which lists equities that trade only occasionally.", "The stock index has also been affected by the bust after the boom of the dotcom years and has fallen from its peaks in 2011-2013 to around $647bn in market value, a decline of more than 80%."], "tinydolphin:1.1b": [" Nasdaq plans a $100 million share sale to raise funds for Nasdaq Stock Market listing.", "Owner of technology-dominated Nasdaq stock index plans to sell shares publicly, but will not make money from it.", "It's the third time since 2002 that Nasdaq is considering a share sale for growth funding."], "phi:2.7b": [" Nasdaq plans to sell $100m worth of shares and possibly go public again despite concerns about recent trends in the technology industry.", "However, they will not make any profit from this sale since they have already sold shares privately before.", "Nasdaq is a stock market that focuses on high-growth companies in technology and other industries."], "orca-mini:3b": [" Nasdaq plans to sell shares worth $100m and list itself on the stock market it operates.", "The company, which was once a public stock, will not make any profit from the sale but investors who bought shares in private placements will benefit.", "Nasdaq is made up of shares in technology companies and other high-growth firms.", "It was a symbol of the 1990s internet and telecoms boom and was on the brink of bankruptcy after the bubble burst, but has since seen a recovery in the fortunes of tech giants and dot.com survivors."], "hermes3:3b": ["Nasdaq plans $100m share sale to raise funds"], "stablelm-zephyr:3b": ["Nasdaq, owner of the technology-dominated Nasdaq stock index, plans to raise $100m from a share sale and list on the market it operates.", "The move is seen as another step closer to a full public listing, but the company has previously dismissed similar suggestions.", "Nasdaq initially sold shares through private placements in 2000 and 2001, entering the OTC Bulletin Board in 2002, with no profit for Nasdaq itself.", "The index comprises shares in technology firms and others with high growth potential, recovering after the bubble burst during the 1990s internet and telecoms boom."], "chatgpt-4o-latest": ["Nasdaq plans to raise $100 million through a share sale and list itself on the market it operates.", "While some see this as a step toward a full public listing, Nasdaq has downplayed such speculation.", "The company previously sold shares privately in 2000 and 2001 and technically went public in 2002 on the OTC Bulletin Board.", "Nasdaq will not profit from the sale; only private investors will.", "Known for its technology-focused stocks, Nasdaq was a key symbol of the 1990s tech boom before crashing and later recovering with the resurgence of major tech firms like Intel and Amazon."], "stablelm2:1.6b": ["Nasdaq plans to sell shares on the market it operates for $1 billion (£1 billion), without making a profit from the sale.", "The company, known for technology stocks, was once part of the tech boom but saw its value decline following the bubble burst.", "A recent recovery in tech stocks has helped Nasdaq regain its position as a prominent symbol of growth potential."], "granite3.1-dense:2b": ["Nasdaq Stock Market, the operator of the Nasdaq index, intends to sell $100m worth of shares to the public, listing itself on the market it manages.", "This move signifies a potential step towards a full public listing, though Nasdaq has previously downplayed such prospects.", "The company initially issued shares privately in 2000 and 2001, and technically went public in 2002 through the OTC Bulletin Board.", "Unlike previous sales, this upcoming offering will not benefit Nasdaq directly; instead, investors who purchased shares in prior private placements will profit.", "Nasdaq's shareholder portfolio consists of technology firms and growth-oriented companies.", "Although it symbolized the 1990s tech boom, its value declined following the market crash.", "Recently, however, a resurgence in the fortunes of tech titans like Intel and surviving dot.com entities has revitalized Nasdaq's position."]}