{"raw_text": "India power shares jump on debut\n \n Shares in India's largest power producer, National Thermal Power Corp (NTPC) have risen 13% on their stock market debut.\n \n The government's partial sell-off of NTPC is part of a controversial programme to privatise state-run firms. The 865 million share offer, a mix of new shares and sales by the government, raised 54bn rupees($1.2bn). It was India's second $1bn stock debut in three months, coming after the flotation by software firm Tata. The share offer was eleven times oversubscribed. \"It is a good investment bet,\" said Suhas Naik, an investment analyst from ING Mutual Fund. \"Power needs in India are set to rise and NTPC will benefit from that.\" Analysts say the success of the NTPC flotation would encourage the government to reduce stakes in more power companies. NTPC has said it will use the money from the share sale to feed the growing needs of the country's energy-starved economy. The firm is the largest utility company in India, and the sixth largest power producer in the world.\n", "llama3.2:1b": ["India's National Thermal Power Corp (NTPC) shares rose 13% on their debut stock market offering after a partial sell-off by the government.", "The offer raised $1.2bn from selling 865m shares, which was eleven times oversubscribed.", "Analysts say NTPC will benefit from India's growing energy needs."], "llama3.2:3b": ["Shares in National Thermal Power Corp (NTPC), India's largest power producer, rose 13% on their stock market debut after a partial government sell-off of 865 million shares that raised $1.2 billion.", "The share offer was eleven times oversubscribed and analysts consider it a good investment bet due to rising Indian power needs and NTPC's position as the sixth largest global power producer."], "gemma2:2b": ["NTPC shares jumped 13% on their debut, raising ₹54 billion (US $1.2 billion) after a successful initial public offering.", "The sale was eleven times oversubscribed and represents a step towards privatization of state-run firms.", "Analysts believe NTPC's success will encourage the government to sell more stakes in power companies, as India's growing energy needs are expected to benefit this sector."], "qwen2.5:0.5b": ["India's National Thermal Power Corporation (NTPC) shares have risen 13% on their stock market debut after a government partial sell-off of NTPC.", "Key ideas:\n- NTPC shares rise 13%\n- Market debut of NTPC\n- Share market debut in India\n- Controversial program to privatise state-run firms\n- Second $1 billion stock debut in three months (after Tata's)\n- Stock offer raised 54 billion rupees ($1.2 billion)\n- Successful investment bet for power needs in India\n- NTPC shares will benefit from increased demand for energy due to rising electricity costs\n- NTPC is the largest utility and power producer in India, sixth-largest in the world"], "qwen2.5:1.5b": ["Shares in India's largest power producer, National Thermal Power Corp (NTPC), rose 13% on its stock market debut, raising $1.2 billion from an oversubscribed share offering of 865 million shares ($1 billion in government sales and $400 million from retail investors).", "The flotation is part of a controversial program to privatize state-run firms.", "NTPC will use the proceeds for growing power needs and aims to benefit from rising energy demands, making it India's second-largest stock debut this year following Tata Software Services' offering.", "Analysts expect further government divestment in other utilities due to successful NTPC flotation."], "qwen2.5:3b": ["India's largest power producer, National Thermal Power Corp (NTPC), saw its shares jump 13% on their stock market debut.", "This $1.2 billion initial public offering was part of a government privatization program.", "The offer received eleven times oversubscription.", "Analysts see this as an encouraging sign for more privatizations in the power sector, with NTPC planning to use proceeds to meet growing energy needs.", "As India's sixth-largest power producer and largest utility company, NTPC is poised to benefit from rising domestic power requirements."], "opencoder:1.5b": ["India’s power shares are expected to rise on their debut stock.", "The National Thermal Power Corporation (NTPC) has raised 13% since its first public offering ($1.2bn).", "It is India's second $1bn stock market debut after Tata, a software firm from the Indian government.", "The sale raised $54bn and was eleven times oversubscribed, which suggests an increased demand for the NTPC's shares.", "Industry analysts predict that the success of NTPC flotation could encourage the government to privatise more companies."], "smollm:1.7b": ["The summary should be concise and focus on the main ideas:\n\n1.", "Shares in India's largest power producer, National Thermal Power Corp (NTPC) have risen 13% on their stock market debut.", "2.", "The government's partial sell-off of NTPC is part of a controversial programme to privatise state-run firms.", "3.", "The 865 million share offer, a mix of new shares and sales by the government, raised 54bn rupees ($1.2bn).", "4.", "It was India's second $1bn stock debut in three months, coming after the flotation by software firm Tata.", "5.", "The share offer was eleven times oversubscribed.", "6.", "NTPC has said it will use the money from the share sale to feed the growing needs of the country's energy-starved economy.", "7.", "The government is expected to reduce stakes in more power companies as a result of this success."], "deepseek-r1:1.5b": ["NTPC's stock price surged by 13% at its debut, partly due to a government's 865 million share offer, raising 54 billion rupees and enabling India's second $1 billion share float after Tata Software in 2013.", "The sale aims to support the country's rising energy demands as the economy faces slowdowns elsewhere.", "NTPC, a leader in India's power sector, will use the funds to meet growing energy needs."], "tinyllama:1.1b": ["The Indian power market has witnessed a surge in interest with the launch of shares in National Thermal Power Corp (NTPC), which was part of a controversial programme to privatize state-run firms.", "The share sale raised $1bn and resulted in an 13% jump on the stock market debut, making it India's second largest power floatation in three months after Tatas' listing in February.", "Analysts say the success of the NTPC floatation would encourage the government to reduce stakes in more state-run firms, adding that the firm is set to benefit from India's rapidly growing energy needs."], "tinydolphin:1.1b": [" Summary: \nIndia's power shares surged on their stock market debut after being offered at a 13% premium, raising 54 billion rupees ($1.2bn).", "The offering was part of a government program to privatize state-owned firms in India.", "It also came as the second largest $1bn stock debut in three months for the power sector.", "Many analysts believe this could be an encouraging sign that India's energy demand is set to rise, leading to investment opportunities."], "phi:2.7b": [" The text summarizes a 13% increase in India's National Thermal Power Corp (NTPC) shares on their debut stock market offer.", "This sale was part of a controversial programme to privatize state-run firms.", "The success of this flotation would encourage the government to reduce stakes in other power companies, as it could use the money from the share sale to feed the growing energy needs of India's economy.", "NTPC is the largest utility company and sixth largest power producer in the world."], "orca-mini:3b": [" India's largest power producer, National Thermal Power Corp (NTPC) has seen its shares jump 13% on their stock market debut, following a government partial sell-off of shares totaling $1.2 billion.", "The offer was eleven times oversubscribed, and analysts believe it shows confidence in the country's energy needs, with NTPC being the largest utility company in India.", "The success of the offer would encourage the government to reduce stakes in more power companies."], "hermes3:3b": ["India's NTPC shares rise 13% on stock market debut; part of gov't privatization program, oversubscribed 11x, good investment for rising power needs in India."], "stablelm-zephyr:3b": ["India's largest power producer, NTPC, made a 13% jump on their stock market debut after an 865 million share offer, a mix of new shares and sales by the government, raised 54bn rupees ($1.2bn).", "The government is part of a programme to privatize state-run firms, with analysts suggesting the success of NTPC's flotation could encourage them to reduce stakes in more power companies.", "The money from the share sale will be used to feed India's energy-starved economy as NTPC is the largest utility company and sixth largest power producer globally."], "chatgpt-4o-latest": ["Shares in India's largest power producer, NTPC, rose 13% on their stock market debut as part of the government's privatization program.", "The 865 million share offer, a mix of new shares and government sales, raised $1.2 billion and was oversubscribed eleven times.", "Analysts see NTPC as a strong investment due to India's rising power needs.", "The success of the flotation may encourage further government stake reductions in power firms.", "NTPC plans to use the funds to support India's growing energy demands.", "It is the country's largest utility and the world's sixth-largest power producer."], "stablelm2:1.6b": ["India's largest power producer, National Thermal Power Corp (NTPC), saw a 10% increase in share value on its debut stock market launch.", "This follows a government partial sell-off of NTPC as part of a privatized program aiming to reduce state-run firms.", "The million share offering generated over $1bn.", "It was India's second $1bn stock debut within three months, precedes the listing by software firm Tata.", "Analysts predict the success of NTPC's float may encourage the government to sell stakes in more power companies.", "As the largest utility company and sixth biggest producer globally, NTPC has stated it will use funds from this share sale for meeting India's energy-starved economy's needs."], "granite3.1-dense:2b": ["India's largest power corporation, NTPC, experienced a 13% surge on its stock market debut, raising 54 billion rupees ($1.2 billion) through an 865 million share offering.", "This was India's second $1 billion stock debut in three months following Tata's flotation.", "The NTPC share sale was eleven times oversubscribed and received praise from analysts, who view it as a lucrative investment due to India's increasing power demands.", "NTPC plans to utilize the funds to meet the country's growing energy needs.", "As a leading utility company in India and the sixth-largest global power producer, NTPC aims to reduce government stakes in more power firms following this successful listing."]}