{"raw_text": "SBC plans post-takeover job cuts\n \n US phone company SBC Communications said it expects to cut around 12,800 jobs following its $16bn (£8.5bn) takeover of former parent AT&T.\n \n SBC said 5,125 positions would go as a result of network efficiencies. Another 1,700 will go from its sales department, 3,400 from business operations and 2,600 across legal, advertising and public relations. SBC currently employs 163,000 people while AT&T employs 47,000. The takeover was announced on Monday. The deal will be financed with $15bn of shares as well as a $1bn special dividend paid to AT&T shareholders.\n \n It effectively marks the end of AT&T, which was founded in 1875 by telephone pioneer Alexander Graham Bell and is one of the US's best-known companies. SBC and AT&T said estimated cost savings of at least $2bn from 2008 were a main driver for the merger. AT&T is a long-distance telecoms firm, while SBC is mainly focused on the local market in the western US. Both also have data network businesses. The takeover is subject to approval by AT&T's shareholders and regulators. The companies said they expected to complete the agreement during the first half of 2006.\n", "llama3.2:1b": ["SBC Communications plans to cut around 12,800 jobs following its $16bn takeover of former parent AT&T.", "This will include 5,125 positions in network efficiencies, 1,700 from sales, 3,400 from business operations, and 2,600 across legal, advertising, and public relations departments."], "llama3.2:3b": ["SBC Communications plans to cut approximately 12,800 jobs after its $16bn takeover of AT&T, including 5,125 in network efficiencies, 1,700 in sales, 3,400 in business operations, and 2,600 across legal and public relations."], "gemma2:2b": ["SBC Communications will cut approximately 12,800 jobs after its $16 billion acquisition of former parent company AT&T.", "Job cuts are expected across various departments including network efficiency, sales, business operations, and legal, advertising, and public relations.", "The merger aims to achieve cost savings of at least $2 billion starting in 2008 and will effectively end the long-standing existence of AT&T.", "The deal is subject to shareholder and regulatory approval."], "qwen2.5:0.5b": ["SBC plans to cut jobs following a $16bn takeover of AT&T, which was announced on Monday.", "SBC expects to reduce its workforce from 163,000 employees currently at AT&T to around 12,800 positions in the post-takeover job cuts."], "qwen2.5:1.5b": ["SBC Communications plans post-takeover job cuts following its $16bn acquisition of AT&T, with 12,800 positions being cut across various departments including network efficiencies and sales.", "SBC employs 163,000 people while AT&T has 47,000 employees, resulting in estimated cost savings of at least $2bn from 2008 for the merger."], "qwen2.5:3b": ["US phone company SBC Communications plans to cut around 12,800 jobs after its $16bn takeover of former parent AT&T.", "This includes 5,125 from network efficiencies, 1,700 from sales, 3,400 from business operations, and 2,600 across legal, advertising, and public relations departments.", "SBC currently employs 163,000 people while AT&T has 47,000.", "The deal is expected to save at least $2bn by 2008 and is subject to shareholder and regulatory approval."], "opencoder:1.5b": ["SBC plans post-takeover job cuts, as it anticipates to cut around 12,800 jobs following its $16bn (£8.5bn) takeover of former parent AT&T.", "SBC plans to cut 5,125 positions due to network efficiencies, another 1,700 from its sales department, business operations, and legal, advertising and public relations.", "The companies currently employ 163,000 people while AT&T employs 47,000.", "The merger was announced on Monday.", "The deal is financed with $15bn of shares and a $1bn special dividend paid to AT&T shareholders.", "SBC and AT&T are expected to complete the agreement during the first half of 2006.", "The companies also estimate cost savings of at least $2bn from 2008."], "smollm:1.7b": ["The main idea behind this text is that SBC Communications, a US-based phone company, will cut around 12,800 jobs as part of its takeover of former AT&T, a long-distance telecoms firm.", "The deal was announced on Monday and is expected to be financed with $15bn of shares from both companies.", "SBC will also reduce the number of employees it employs by another 1,700.", "The text does not provide any additional information about the specifics of the job cuts or the reasons behind them.", "It simply summarizes the main idea and key points without providing any analysis or explanations."], "deepseek-r1:1.5b": ["SBC Communications expects to reduce around 12,800 jobs following its acquisition of AT&T.", "They plan specific cuts: 5k for network efficiencies, 1.7k in sales, 3.4k in business operations, and 2.6k in legal or PR areas.", "Currently, SBC employs 163,000, while AT&T has 47,000.", "The deal was announced Monday, financed with $15 billion and a $1 billion dividend.", "AT&T, founded in 1875, is best known for the telephone industry, serving the western US.", "SBC operates there while AT&T serves long-distance telecoms.", "Cost savings of $2 billion are estimated from 2008."], "tinyllama:1.1b": ["SBC plans to cut around 12,800 jobs following its $16bn (£8.5bn) takeover of former parent AT&T.", "The company expects network efficiencies and closures from the sales, business operations, and legal, advertising, and public relations departments.", "SBC currently employs 163,000 while AT&T has 47,000 employees.", "The merger was announced on Monday, resulting in estimated cost savings of $2bn from 2008.", "The deal will be financed with a $15bn shareholder equity split and $1bn special dividend paid to AT&T shareholders.", "SBC expects the deal to complete during the first half of 2006."], "tinydolphin:1.1b": [" Summary: SBC Communications, a US phone company, announced plans for job cuts following its $16 billion acquisition of AT&T, a telecommunications firm.", "The plan involves efficiency improvements in their networks and eliminating about 12,800 jobs.", "At the same time, SBC is planning to reduce the number of employees in its sales department by around 5,125, its business operations department by approximately 1,700, its legal, advertising, and public relations departments by 2,600, and its public affairs unit by approximately 3,400.", "SBC's total workforce will decrease from 163,000 to around 159,000, while AT&T's current headcount will drop from 47,000 to approximately 42,800.", "The deal between the two companies was announced on Monday.", "It is expected to be completed during the first half of 2006."], "phi:2.7b": [" After SBC's $16 billion take-over, it plans to cut 12,800 jobs, with 5,125 positions going from network efficiency, 1,700 from sales department, 3,400 from business operations and 2,600 across legal, advertising and public relations.", "The deal is subject to regulatory approval."], "orca-mini:3b": [" US phone company SBC Communications plans to cut around 12,800 jobs following its $16bn takeover of former parent AT&T."], "hermes3:3b": ["SBC post-acquisition job cuts (12,800), mainly from sales, business ops, legal & PR departments."], "stablelm-zephyr:3b": ["US phone company SBC Communications plans to cut around 12,800 jobs following its $16bn takeover of former parent AT&T.", "SBC expects 5,125 positions to be cut due to network efficiencies, 1,700 from sales department, 3,400 from business operations and 2,600 across legal, advertising, and public relations.", "The deal will be financed with $15bn of shares and a $1bn special dividend paid to AT&T shareholders.", "This marks the end of AT&T, which was founded in 1875 by Alexander Graham Bell.", "SBC and AT&T estimate cost savings of at least $2bn from 2008 due to the merger.", "The takeover is subject to approval by AT&T's shareholders and regulators with completion expected during the first half of 2006."], "chatgpt-4o-latest": ["SBC Communications plans to cut 12,800 jobs following its $16 billion takeover of AT&T, with reductions across network efficiencies, sales, business operations, and legal, advertising, and public relations.", "SBC employs 163,000 people, while AT&T has 47,000.", "The deal, financed with $15 billion in shares and a $1 billion special dividend, marks the end of AT&T, founded in 1875.", "The merger aims for at least $2 billion in cost savings by 2008.", "SBC focuses on local telecom services, while AT&T specializes in long-distance and data networks.", "The takeover requires shareholder and regulatory approval and is expected to be completed in the first half of 2006."], "stablelm2:1.6b": ["SBC plans to cut around 15,0"], "granite3.1-dense:2b": ["SBC Communications, following its $16bn acquisition of former parent company AT&T, plans to eliminate approximately 12,800 jobs.", "This includes 5,125 positions for network efficiency, 1,700 from sales, 3,400 from business operations, and 2,600 in legal, advertising, and public relations.", "SBC currently employs 163,000, while AT&T has 47,000 workers.", "The merger aims to yield at least $2bn in cost savings by 2008, driven by network integration and operational synergies.", "Both companies are established players in long-distance telecommunications (AT&T) and the local US market (SBC), with data networks as well.", "The deal, valued primarily in shares and a special dividend to AT&T shareholders, is contingent on shareholder approval and regulatory clearance, with completion expected by Q1 2006.", "This merger signifies the end of AT&T, founded in 1875 by Alexander Graham Bell."]}