{"raw_text": "Axa Sun Life cuts bonus payments\n \n Life insurer Axa Sun Life has lowered annual bonus payouts for up to 50,000 with-profits investors.\n \n Regular annual bonus rates on former Axa Equity & Law with-profits policies are to be cut from 2% to 1% for 2004. Axa blamed a poor stock market performance for the cut, adding that recent gains have not yet offset the market falls seen in 2001 and 2002. The cut will hit an estimated 3% of Axa's policyholders. The rest will know their fate in March.\n \n The cuts on Axa's policies will mean a policyholder who had invested £50 a month into an endowment policy for the past 25 years would see a final maturity payout of £46,998. This equated to a annual investment growth rate of 8% Axa said. With-profits policies are designed to smooth out the peaks and troughs of stock market volatility. However, heavy stock market falls throughout 2001 and 2002 forced most firms to trim bonus rates on their policies. \"The stock market has grown over the past 18 months, however not enough to undo the damage that occurred during 2001 and 2002,\" Axa spokesman Mark Hamilton, Axa spokesman, told BBC News. Axa cut payouts for the same investors last January.\n", "llama3.2:1b": ["Axa Sun Life cuts bonus payments on up to 50,000 with-profits investors due to poor stock market performance.", "Regular annual bonus rates will be reduced from 2% to 1%.", "The cuts affect estimated 3% of policyholders and policyholders who have invested £50 per month for 25 years."], "llama3.2:3b": ["Axa Sun Life is cutting annual bonus payments on with-profits policies, reducing rates from 2% to 1% for 2004 due to poor stock market performance.", "The cuts will affect an estimated 3% of policyholders and impact final maturity payouts."], "gemma2:2b": ["Axa Sun Life is cutting annual bonus payments for with-profits policyholders by half.", "The cut affects roughly 3% of Axa's policyholders and will reduce bonus rates from 2% to 1% for policies issued in 2004.", "Axa blames the cuts on poor stock market performance, which resulted from heavy falls in 2001 and 2002.", "The company said that recent gains haven't yet offset these losses.", "This is not the first time Axa has made such a change, with a similar action taken last January."], "qwen2.5:0.5b": ["Axa Sun Life is lowering annual bonus payments on policies with-profits investments by up to 50,000 in 2004, reducing them from 2% to 1%.", "The company blames a poor stock market performance for this cut and states that the payouts will hit an estimated 3% of policyholders.", "The cuts are expected to reduce investment growth rates of policyholders with investments ranging from £50 per month over the past 25 years."], "qwen2.5:1.5b": ["Life insurer Axa Sun Life has lowered annual bonus payments on with-profits policies by 50% to 1%, effective from this year and hitting approximately 3% of its policyholders' investments.", "The decision is due to poor stock market performance in recent years, despite some gains.", "Investors who previously received £50 monthly investment through an endowment policy will see a final maturity payout worth £46,998 after the reduction."], "qwen2.5:3b": ["Axa Sun Life reduces annual bonus payouts from 2% to 1% for up to 50,000 with-profits investors due to poor stock market performance in 2001 and 2002.", "This affects an estimated 3% of Axa's policyholders, including a hypothetical £46,998 final payout for a 25-year investment plan.", "Axa blamed recent gains not enough offsetting prior losses.", "The reductions were implemented last January as well."], "opencoder:1.5b": ["Axa Sun Life lowered annual bonus payouts for up to 50,000 with-profits investors in a manner that involved cutting from 2% to 1% for 2004.", "The company reported that recent gains have not yet offset the market falls seen in 2001 and 2002.", "Axa cut the bonus rates on its policies hoping to offset these market falls.", "The increased risk, coupled with the impact of recent gains, meant a significant reduction in bonuses.", "With this, many policyholders had their annual payouts reduced."], "smollm:1.7b": ["Axa Sun Life cuts bonus payments for up to 50,000 policyholders with profits.", "The annual bonus rates on former Axa Equity & Law policies are to be cut from 2% to 1%.", "Regular annual bonus rates on former Axa policies are to be cut from 2% to 1% for 2004.", "Axa blamed a poor stock market performance for the cut, adding that recent gains have not yet offset the market falls seen in 2001 and 2002.", "The cut will hit an estimated 3% of Axa's policyholders.", "The rest will know their fate in March.", "The cuts on Axa's policies will mean a policyholder who had invested £50 a month into an endowment policy for the past 25 years would see a final maturity payout of £46,998.", "This equated to a annual investment growth rate of 8% Axa said.", "With-profits policies are designed to smooth out the peaks and troughs of stock market volatility.", "However, heavy stock market falls throughout 2001 and 2002 forced most firms to trim bonus rates on their policies.", "\"The stock market has grown over the past 18 months, however not enough to undo the damage that occurred during 2001 and 2002,\" Axa spokesman Mark Hamilton, Axa spokesman, told BBC News.", "Axa cut payouts for the same investors last January."], "deepseek-r1:1.5b": ["Axa Sun Life has reduced annual bonus payouts to up to 50,000 with-profits investors, effective from 2004.", "Policyholders investing £50 monthly into an endowment policy will receive a final payout of £46,998 in March, representing around 8% annual growth.", "The company attributes the cut to poor market performance but explains it as not entirely solely responsible for past volatility impacts."], "tinyllama:1.1b": ["Axa Sun Life has lowered annual bonus payments for up to 50,000 with-profits investors by up to 1% for 2004.", "The company cited poor stock market performance and a shift in the market's trends in its decision to cut bonus rates on these policies from 2% to 1%.", "Regular payments averaging 2% were maintained for a group of investors, but will not be offered for those who had invested £50 per month for the past 25 years.", "The policyholder's final maturity payout was estimated at £46,998 based on an annual investment growth rate of 8%.", "With-profits policies are designed to smooth out volatility in stock market returns and heavy stock market falls throughout 2001 and 2002 led to the reduction of bonus rates for these investors."], "tinydolphin:1.1b": [" Cutting bonuses for with-profits policyholders at insurer Axa Sun Life is a move to compensate for poor stock market performance during recent years.", "This decision comes as a result of a reevaluation by the company, which has decided to lower their annual bonus payments from 2% to 1%.", "This decision affects around 3% of policyholders in total.", "The cut would reduce the investment growth for these policyholders and could result in them receiving less than £50 at maturity for a 25-year endowment policy.", "Axa Sun Life is a life insurer that offers policies designed to help protect investments during periods of market fluctuation, specifically during periods of high volatility.", "The stock market has been struggling in recent years, with many companies reporting poor earnings and negative dividend growth.", "This means investors may be more cautious and demand better returns on their investments than they were previously."], "phi:2.7b": [" The life insurer Axa Sun Life has reduced its annual bonus payments for with-profits investors from 2% to 1% due to poor stock market performance in 2001 and 2002.", "This will affect an estimated 3% of policyholders, but most will know their payout by March.", "The cut will reduce the maturity payout of a £50 monthly investment into an endowment policy over 25 years to £46,998, which is equivalent to an annual growth rate of 8%."], "orca-mini:3b": [" Life insurer Axa Sun Life has reduced annual bonus payments for up to 50,000 with-profits investors by an estimated 3%.", "The cuts will mean a policyholder who had invested £50 a month into an endowment policy for the past 25 years would see a final maturity payout of £46,998.", "This equated to a annual investment growth rate of 8%.", "With-profits policies are designed to smooth out the peaks and troughs of stock market volatility.", "However, heavy stock market falls throughout 2001 and 2002 forced most firms to trim bonus rates on their policies."], "hermes3:3b": ["Axa Sun Life reduces annual bonus rates by 1pp for with-profits investors, blaming poor stock market performance; affects ~3% policyholders."], "stablelm-zephyr:3b": ["Life insurer Axa Sun Life has reduced annual bonus payments for up to 50,000 with-profits investors by cutting rates from 2% to 1% for 2004.", "The decision was influenced by poor stock market performance in 2001 and 2002, which left a significant impact on the insurance company's policyholders.", "Around 3% of Axa's policyholders will be affected by these changes, with the rest finding out about their final maturity payouts in March.", "With-profits policies aim to smooth out volatility in stock markets, but heavy market declines during 2001 and 2002 prompted many companies to reduce bonus rates for their policies."], "chatgpt-4o-latest": ["Axa Sun Life has reduced annual bonus payouts for up to 50,000 with-profits investors, cutting rates on former Axa Equity & Law policies from 2% to 1% for 2004.", "The company cited poor stock market performance, stating that recent gains have not yet offset losses from 2001 and 2002.", "The cut affects about 3% of policyholders, with the rest to be informed in March.", "A policyholder investing £50 monthly for 25 years would now receive a final payout of £46,998, reflecting an 8% annual growth rate.", "With-profits policies aim to smooth market fluctuations, but significant losses in 2001 and 2002 forced most firms to reduce bonus rates.", "Axa had also cut payouts for these investors in January of the previous year."], "stablelm2:1.6b": ["Axa Sun Life reduces bonus payments for up to 3% of policyholders in with-profits investments due to poor stock market performance.", "Annual bonus rates on former Axa Equity & Law policies will be reduced from 2% to 1%.", "The cut impacts an estimated £3 million in payouts and is expected in March.", "Historically, the policyholders received an annual investment growth rate of 8%, which was achieved by those who invested a month at a time."], "granite3.1-dense:2b": ["Axa Sun Life has reduced annual bonus payments for approximately 50,000 with-profits policyholders from 2% to 1% for 2004, citing poor stock market performance since 2001 and 2002.", "This affects about 3% of Axa's total policyholders; the rest will learn their fate in March.", "For those impacted, a £50 monthly investment over 25 years would yield a final maturity payout of £46,998, assuming an 8% annual growth rate.", "These with-profits policies aim to mitigate stock market volatility, but the extended decline has necessitated cuts across major financial institutions.", "Axa had previously reduced payouts for these policyholders in January."]}