{"raw_text": "Iraqi voters turn to economic issues\n \n Beyond the desperate security situation in Iraq lies an economy in tatters.\n \n A vicious cycle of unemployment, poor social services and poverty has been made worse by a lack of investment. So there is much hope that an elected government will break the deadlock. \"First rule of law, then the economy,\" says Radwan Hadi, deputy managing director of Aberdeen-based oil and gas consultancy Blackwatch Petroleum Services, which entered Iraq in 2003. Mr Hadi's view about what the new government's priorities should be is shared by many Iraqis. The economy has become the second-most dominant issue for many political parties ahead of Sunday's election, according to Bristol University political scientist Anne Alexander, who is working on a project that looks at governance and security in post-war Iraq.\n \n Job creation ranks high both on election manifestos and on the Iraqi people's wish list. Nobody knows exactly how many Iraqis are out of work, but it is clear that the situation is dire. \"Estimates of Iraq's unemployment rate vary, but we estimate it to be between 30-40%,\" the Washington-based independent think-tank The Brookings Institution says in its Iraq Index. But some progress has been made, largely thanks to the country's oil revenues which have exceeded $22bn since June 2003.\n \n Iraq's infrastructure is on the mend, with notable improvements having been made in areas such as electricity supply, irrigation, telephone networks and the re-opening of hospitals. But serious problems remain and the growing divide between haves and have-nots is angering voters. One Iraqi woman told Ms Alexander about her frustration as she watched TV adverts for private hospitals soon after having failed to track down basic medicines from Baghdad's pharmacies. Observes Mr Hadi: \"The economy at present marks a big divide; the rich get richer, the poor get poorer.\" An indication of this can be seen in the world of finance where, in contrast with the daily plight of ordinary people, 19 private banks operate, only one of which is run in accordance with Islamic banking principles. Hopes are high for the future of finance, so foreign banks have been buying into the sector. National Bank of Kuwait has bought a majority stake in Credit Bank of Iraq, the Jordanian investment bank Export & Finance Bank has bought 49% of National Bank of Iraq.\n \n Foreign firms also hope to cash in on the reconstruction effort. Bechtel's efforts to rebuild schools and restore power have attracted controversy as well as boosting its bottom line while Halliburton has enjoyed a wealth of military contracts. But the involvement of foreign firms in the health and banking sectors and beyond sits uneasily with many Iraqis who are accustomed to the state taking responsibility for functions that are essential to making society work, observes Ms Alexander. \"It is seen as a selling off of Iraq's assets and bringing in multinationals at the expense of Iraqi businesses and Iraqi workers,\" she says. Consequently, the transitional government has been forced to backtrack in recent months over its proposal to allow 100% foreign ownership of Iraqi assets, she explains. In the West, it is easy to forget that the otherwise brutal Baathist regime used to look after the majority of Iraq's citizens rather well in terms of job creation, social security and healthcare. Opinion polls suggest that \"people still want the state to take a leading role in providing these things\", Ms Alexander says.\n \n Yet in some areas of the economy, investment from abroad is still warmly welcomed, insists Mr Hadi, an Iraqi who left the country three decades ago. \"I think the private sector will evolve incredibly fast,\" Mr Hadi says. \"Iraq's vast natural resources can support any magnitude of economic growth.\"\n \n Many foreign companies say they are keen to get in on the act, yet few are actually entering the country in any meaningful way. But there are exceptions. Mr Hadi's Blackwatch is just one of many small operators preparing for a much bigger future. Blackwatch's Baghdad-based affiliate Falcon Group has dozens of people working for it across the country in Kirkuk and Baghdad, and its engineers and geo-scientists work with the Iraqi oil ministry to hammer out technology transfer issues, Mr Hadi points out. \"These guys are trying to work. The Iraqi business people will do business at all times. \"Life goes on in Iraq, the people take responsibility, they want to live normal lives.\"\n", "llama3.2:1b": ["Iraqi voters prioritize economic issues such as unemployment and poverty over security concerns.", "The economy is in a dire state due to a lack of investment, leading to high unemployment rates (30-40%).", "While some progress has been made, including oil revenues exceeding $22bn since 2003, serious problems remain.", "Foreign firms are interested in investing in the economy, but many Iraqis oppose this, viewing it as an \"us vs them\" situation where foreign companies profit at the expense of Iraqi businesses and workers.", "Despite this, some Iraqis, such as Radwan Hadi, believe that private sector investment will drive growth and create jobs."], "llama3.2:3b": ["Iraqi voters prioritize economic issues ahead of security concerns as unemployment rates range from 30-40%.", "Infrastructure improvements have been made, but serious problems remain, including a growing divide between haves and have-nots.", "Foreign firms seek to capitalize on the reconstruction effort, but their involvement in essential sectors like healthcare and banking is seen as a threat by many Iraqis.", "Despite this, some see investment from abroad as crucial for economic growth."], "gemma2:2b": ["Economic concerns are a significant issue for voters in Iraq ahead of the upcoming election, with unemployment and poverty ranking high as key challenges.", "While progress has been made in infrastructure improvements and oil revenues have aided recovery, income disparities remain wide, fueling discontent among many Iraqis.", "A growing divide between wealthy and poor is evident, particularly in access to healthcare and finance services.", "Foreign firms' involvement in Iraq’s economy is controversial, with some fearing a transfer of resources away from Iraqi businesses and workers.", "Despite the challenges, investors are hopeful about Iraq's vast natural resources for future growth."], "qwen2.5:0.5b": ["Key points:\n- Iraq voters turn to economic issues.", "- A vicious cycle of unemployment, poor social services and poverty has been made worse by a lack of investment.", "- The economy is seen as a major issue for many political parties ahead of the election.", "- Iraq's infrastructure is improving, but serious problems remain.", "- Foreign firms hope to cash in on reconstruction efforts.", "- The Baathist regime used to look after most citizens' jobs and social security.", "- Many foreign companies see immediate benefits from working in Iraq."], "qwen2.5:1.5b": ["Iraqi voters prioritize economic issues over security following a deteriorating economy marked by high unemployment and poor infrastructure despite increasing foreign investment."], "qwen2.5:3b": ["Iraqi voters prioritize economic issues despite a dire situation.", "Unemployment, poor social services, and poverty have been exacerbated by lack of investment.", "There is hope for an elected government to address these problems.", "Job creation ranks high on election manifestos and the Iraqi people's wish list.", "Iraq's infrastructure has improved but disparities between rich and poor persist, leading to frustration among voters.", "The economy reflects a widening divide, with Islamic banks operating alongside 19 private banks.", "Foreign firms are investing in reconstruction, though some see this as privatizing assets at the expense of local businesses and workers.", "Despite concerns about foreign involvement, Iraq's vast natural resources support potential economic growth.", "Small operators like Blackwatch are preparing for future expansion, suggesting a nascent private sector despite government reluctance to fully open up investment opportunities."], "opencoder:1.5b": ["Iraqi voters turn to economic issues \n\nBeyond the desperate security situation in Iraq lies an economy in tatters.", "A vicious cycle of unemployment, poor social services and poverty has been made worse by a lack of investment.", "So there is much hope that an elected government will break the deadlock.", "\"First rule of law, then the economy,\" says Radwan Hadi, deputy managing director of Aberdeen-based oil and gas consultancy Blackwatch Petroleum Services, which entered Iraq in 2003.", "Mr Hadi's view about what the new government's priorities should be is shared by many Iraqis.", "The economy has become the second-most dominant issue for many political parties ahead of Sunday's election.", "But others show signs of recovery and growth, according to Bristol University political scientist Anne Alexander, who is working on a project that looks at governance and security in post-war Iraq.", "Job creation ranks high both on election manifestos and on the Iraqi people's wish list.", "There are fears that the situation is dire.", "\"Estimates of Iraq's unemployment rate vary, but we estimate it to be between 30-40%,\" the Washington-based independent think-tank The Brookings Institution says in its Iraq Index.", "But some progress has been made, largely thanks to the country's oil revenues which have exceeded $22bn since June 2003.", "The infrastructure is on the mend with notable improvements having been made in areas such as electricity supply, irrigation, telephone networks and the re-opening of hospitals.", "But serious problems remain and the growing divide between haves and have-nots is angering voters.", "One Iraqi woman told Ms Alexander about her frustration as she watched TV adverts for private hospitals soon after having failed to track down basic medicines from Baghdad's pharmacies.", "Observes Mr Hadi: \"The economy at present marks a big divide; the rich get richer, the poor get poorer.\"", "An indication of this can be seen in the world of finance where, in contrast with the daily plight of ordinary people, 19 private banks operate, only one of which is run in accordance with Islamic banking principles.", "Foreign firms also hope to cash in on the reconstruction effort.", "Bechtel's efforts to rebuild schools and restore power have attracted controversy as well as boosting its bottom line while Halliburton has enjoyed a wealth of military contracts.", "But the involvement of foreign firms in the health and banking sectors and beyond sits uneasily with many Iraqis who are accustomed to the state taking responsibility for functions that are essential to making society work, Ms Alexander says.", "Yet in some areas of the economy, investment from abroad is still warmly welcomed, insists Mr Hadi, an Iraqi who left the country three decades ago.", "\"I think the private sector will evolve incredibly fast,\" Mr Hadi says.", "\"Iraq's vast natural resources can support any magnitude of economic growth.\""], "smollm:1.7b": ["Summarize the text concisely and preserve key ideas and details."], "deepseek-r1:1.5b": ["The Iraqi voters are turning their back on the economy, which is struggling under a lack of investment.", "The government aims to break this cycle by prioritizing \"first rule of law then the economy.\"", "Anne Alexander highlights job creation as a key issue, noting its high ranking in election manifests and wish lists.", "Without accurate unemployment figures, progress has been made with oil revenues exceeding $22 billion.", "The economy, infrastructure, and education are improving, but significant disparities between haves and have-nots persist.", "A woman in Iraq was frustrated watching TV ads for private hospitals after not finding essential medicines.", "Foreign banks and companies are investing in finance sectors beyond their responsibilities, while some Iraqis view the government as responsible for essential functions.", "The transition has backtracked over allowing foreign ownership of Iraqi assets.", "Hadi believes the private sector can evolve rapidly due to Iraq's vast resources, hoping for future economic growth."], "tinyllama:1.1b": ["The Iraqi voters have turned towards economic issues in their vote for a new government to break the deadlock in Iraq's economy, with a focus on improving job creation rates, social services, and poverty alleviation.", "Despite the government's priorities being job creation and social services, a report by Bristol University political scientist Anne Alexander shows that the situation is dire.", "The economic landscape has become the second-most dominant issue for Iraqi voters, with the unemployment rate ranging from 30-40%, and the situation is worse in areas such as electricity supply and irrigation.", "The focus on investing in infrastructure, finance, and healthcare, as well as rebuilding schools and restoring power, has attracted foreign firm investment.", "However, some progress has been made and serious problems remain regarding the growth of the country's infrastructure and job creation rates.", "Iraq's infraestruture is on a mense, with notable improvements having been made in areas such as electricity supply, irrigation, and telephone networks.", "There is still a divide between rich and poor, with 19 private banks operating while foreign bank holdings are growing rapidly.", "Despite the government focusing on improving job creation rates, foreign firmbacking is welcomed due to Iraq's vast natural resources.", "The private sector is preparing for a much bigger future, with small operators like Falcon Group set to gain greatly from technology transfer issues.", "Overall, Iraqi voters are hopeful about the future of their economy and will continue to prioritize improving job creation rates, social services, and poverty alleviation in their vote for a new government."], "tinydolphin:1.1b": [" In summary, the statement is about the situation regarding economic development and investment in Iraq amidst political uncertainties and a lack of security.", "The government is aiming to break the deadlock by bringing in more foreign investment, but there are concerns about job creation and the priorities of the people.", "Foreign firms hope to profit from reconstruction efforts while many Iraqis prefer a more sustainable and local approach to managing their resources."], "phi:2.7b": [" The economy is a top priority for voters in Iraq's upcoming election as the country struggles with unemployment and poverty caused by lack of investment.", "Despite progress made in infrastructure and some improvement in basic services like electricity supply, there are still serious problems that have created a divide between the rich and poor.", "Foreign firms hope to cash in on reconstruction efforts, but this has been met with controversy.", "The transitional government has had to backtrack over plans for 100% foreign ownership of Iraqi assets.", "In the past, the state took responsibility for essential functions like job creation, social security, and healthcare, which many Iraqis still desire.", "However, some foreign investment is welcomed in certain areas of the economy, particularly from the private sector.", "Despite this, few foreign companies are actually entering Iraq yet.", "Small operators like Blackwatch Petroleum Services are working to prepare for a bigger future as they take advantage of the country's vast natural resources.", "Life in Iraq goes on despite the challenges it faces, with Iraqis taking responsibility and wanting to live normal lives."], "orca-mini:3b": [" Iraqi voters have a new focus on economic issues as the country's infrastructure improves but job creation and social services remain a problem.", "Unemployment is estimated to be around 30-40%, and the divide between haves and have-nots is growing angry voters.", "Foreign firms are welcomed as investors in Iraq, but their involvement should be limited to 100% foreign ownership of Iraqi assets.", "Otherwise, it is seen as a selling off of Iraq's assets and bringing in multinationals at the expense of Iraqi businesses and Iraqi workers."], "hermes3:3b": ["Iraqi economy issue predominates over security concerns; hopes for job creation as unemployment rate is estimated between 30-40%; infrastructure improvements made but poverty still exists and divides society; foreign firms hope to invest in reconstruction efforts."], "stablelm-zephyr:3b": ["Iraqi voters prioritize economic issues, with job creation ranking high among election manifestos and being a key desire of the people.", "The economy has become a second most dominant issue for many political parties ahead of elections.", "Despite some progress in areas such as electricity supply and infrastructure thanks to Iraq's oil revenues, an estimated 30-40% of Iraqis are unemployed, leading to frustration and anger among voters, especially as there is a growing divide between rich and poor.", "Foreign firms have been investing in the reconstruction effort, but their involvement in sectors like healthcare and banking sits uneasily with many Iraqis who want the state to take responsibility for essential functions.", "However, some foreign companies are optimistic about the potential for Iraqi businesses and workers to support immense economic growth due to Iraq's vast natural resources."], "chatgpt-4o-latest": ["Iraqi voters are increasingly focused on economic issues amid ongoing security challenges.", "High unemployment, poor social services, and poverty persist due to a lack of investment, with job creation ranking as a top priority for both politicians and citizens.", "While oil revenues have helped improve infrastructure, economic inequality is growing, frustrating many Iraqis.", "Foreign investment in banking and reconstruction is met with mixed reactions, as many still expect the state to play a central role in providing jobs and services.", "Despite security concerns, some foreign and local businesses are preparing for future growth, with Iraq’s vast natural resources seen as a key driver of economic recovery."], "stablelm2:1.6b": ["Iraqi voters prioritize economic issues, including unemployment and poor social services, over the security situation.", "Economic challenges have been worsened by a lack of investment; however, progress has been made with oil revenues exceeding $bn since June.", "The economy is divided between haves (rich) and have-nots.", "Foreign firms hope to capitalize on the reconstruction effort, but this goes against many Iraqis' traditional preference for state involvement in essential societal functions.", "Some foreign companies are taking steps toward collaboration with local businesses, despite little entry from abroad thus far."], "granite3.1-dense:2b": ["Iraqi voters prioritize economic issues due to the country's struggling economy amidst a security crisis.", "High unemployment rates, estimated between 30-40%, and poor social services are significant concerns.", "Despite oil revenues exceeding $22 billion since 2003, Iraq still faces infrastructure challenges in areas like electricity supply, irrigation, telephone networks, and healthcare.", "The economy exhibits a growing divide between the wealthy and poor, with only one Islamic bank among 19 private banks operating in Iraq.", "This disparity has led to frustration among voters, as seen in their reaction to private hospital advertisements and limited access to basic medicines.", "Foreign firms are involved in reconstruction efforts, such as Bechtel's school-building projects and Halliburton's military contracts, which have both boosted profits and drawn criticism for perceived exploitation of Iraqi workers.", "However, the transitional government has recently reversed its plan to allow 100% foreign ownership of Iraqi assets due to public opposition.", "Despite these challenges, many Iraqis, including Radwan Hadi and Anne Alexander, believe in the private sector's potential for rapid growth, driven by the country's abundant natural resources.", "Small operators like Blackwatch Petroleum Services' Falcon Group are already establishing a presence across Iraq, indicating optimism for future business development.", "The electorate continues to favor a strong role for the state in essential services, reflecting the legacy of the Baathist regime's more effective provision of social security, healthcare, and job creation."]}