{"raw_text": "Glazer makes new Man Utd approach\n \n Malcolm Glazer has made a fresh approach to buy Manchester United, which could lead to a bid valuing the Premiership club at £800m.\n \n The US tycoon, who has been wooing the club for the last 12 months, has approached the United board with \"detailed proposals\", it has confirmed. Mr Glazer, who owns the Tampa Bay Buccaneers team, hopes this will lead to a formal bid being accepted. His new offer is expected to contain substantially less debt. Mr Glazer has already had one takeover attempt turned down by the Red Devils and responded by using his 28.1% shareholding to vote off three board members last November.\n \n Man United had turned down the bid because it was based on a high level of borrowing. But newspapers have speculated recently that the tycoon had gained the support of leading banks to come up with a stronger and less debt-laden bid. Last week, however, Mr Glazer issued a statement to the Stock Exchange distancing himself from a new bid.\n \n Meanwhile, United's chief executive David Gill said in December that talks would not resume unless Glazer came up with \"definitive proposals\". Now the board has confirmed that the US bidder is back, with a statement issued on Sunday reading: \"The board can confirm it has now received a detailed proposal subject to various preconditions which may form the basis of an offer. \"A further announcement will be made in due course.\"\n \n To succeed Malcolm Glazer will still need the approval of major shareholders John Magnier and JP McManus, who own 28.9% of the club. But the Irish duo have cut off talks with Glazer over the proposed sale of their stake and have so far made no comment on his latest approach. United fans have reacted with anger at the announcement. They have vehemently opposed any proposed takeover by Glazer since he first showed interest in the club in September 2003 and after Sunday's announcement they vowed to fight on. \"We will fight tooth and nail to stop him whatever his offer says. We do not want him or anybody else taking over United,\" said Mark Longden of the Independent Manchester United Supporters' Association. \"The campaign against this proposed takeover will continue as it has done since Glazer first showed interest in the club.\"\n", "llama3.2:1b": ["Malcolm Glazer, owner of the Tampa Bay Buccaneers, has made a new approach to buying Manchester United with an offer that could value the club at £800m and contain less debt.", "The proposal includes substantial ownership and is backed by US banks.", "However, the bid was initially rejected due to high borrowing levels.", "A further statement from Glazer's board confirmed that they had received his detailed proposals subject to certain preconditions and a follow-up announcement will be made soon, but it is unclear when this will happen."], "llama3.2:3b": ["Malcolm Glazer has made a fresh approach to buy Manchester United, with a new bid valuing the club at £800m.", "The US tycoon's previous attempt was rejected due to high levels of debt.", "Glazer has been working with banks to create a stronger and less debt-laden offer.", "The board confirms that they have received a detailed proposal subject to preconditions, but talks will not resume unless Glazer provides \"definitive proposals\"."], "gemma2:2b": ["Malcolm Glazer made a new proposal to buy Manchester United, potentially valuing the club at £800 million.", "His offer includes less debt than his previous bid and is expected to be detailed soon.", "The Red Devils' board has confirmed receiving this proposal and will issue an update.", "While Glazer needs approval from major shareholders John Magnier and JP McManus, the latter have refused to continue talks regarding their stake sale, leaving fans angered and committed to resisting any takeover."], "qwen2.5:0.5b": ["Man Utd owner Malcolm Glazer makes a fresh bid, valuing the Premiership club at £800m.", "He approaches the team with detailed proposals and expects to receive a formal offer later.", "The transfer is expected to include substantial less debt than previously stated by Manchester United.", "United's board has confirmed the new approach but remains cautious.", "John Magnier and JP McManus are still opposed to any proposed takeover, while Manchester United fans express strong opposition against the bid."], "qwen2.5:1.5b": ["Malcolm Glazer makes a fresh approach to buy Manchester United, valued at £800m with less debt, after being rejected previously due to high borrowing.", "Glazer's latest bid could lead to formal acceptance, potentially including new proposals from him and reducing debt.", "His previous attempt was turned down because of high leverage; he now hopes for a stronger offer without debt.", "Talks between Glazer and United have resumed following his reapplication, with shareholders remaining skeptical but the club's fans are determined to oppose any takeover by Glazer until they receive definitive offers."], "qwen2.5:3b": ["Malcolm Glazer has made a new approach to buy Manchester United, which could value the club at £800m.", "The US tycoon submitted detailed proposals to the board and aims to reduce debt compared to his previous bid.", "While he previously faced rejection due to high borrowing levels, recent speculation suggests he may have gained support from major banks.", "Glazer's latest proposal is now confirmed by United's board with conditions yet to be met.", "Major shareholders John Magnier and JP McManus have not commented on Glazer's approach.", "Manchester United fans remain opposed to any takeover, viewing it as a threat to the club's identity."], "opencoder:1.5b": ["\"Glazer makes a new approach to buy Man Utd, which could lead to a formal bid with less debt.", "He plans to use his 28.1% shareholding to vote off three board members last November.", "While he initially turned down the bid due to high borrowing, the news of strong support from leading banks and more substantial loan offers soon after sparked confidence in the club's approach.", "The announcement by Mr Glazer issued a formal statement to the Stock Exchange indicating his latest proposal is under review.\""], "smollm:1.7b": ["Glazer's new approach to buy Manchester United is expected to lead to a formal bid being accepted, which could result in a valuation of £800 million for the Premiership club.", "The US tycoon, who owns the Tampa Bay Buccaneers team, has made detailed proposals with regards to the sale of the club and its assets.", "Mr Glazer's new approach is expected to include substantially less debt compared to previous offers.", "United fans have reacted with anger at the announcement, which they believe will lead to a takeover by Glazer or another interested party."], "deepseek-r1:1.5b": ["Malcolm Glazer has announced a new Man Utd approach, aiming to acquire the club at £800 million with reduced debt.", "The US tycoon, after a previous rejection of the bid, is now confirming the offer and will need major shareholders' approval before proceeding.", "However, an Irish duo involved in Glazer's latest deal is still in talks with him over their stake, and Man Utd fans have expressed strong opposition to any potential takeover by Glazer since he first joined interest in the club in September 2003."], "tinyllama:1.1b": ["A new U.S.", "Owner, Malcolm Glazer, has presented a fresh proposal to buy Manchester United with more detail and less debt than the previous one.", "The team's majority shareholder, John Magnier and JP McManus, have expressed their support for the new offer, which they hope will lead to a formal bid being accepted.", "Despite opposing Glazer initially, fans have continued their protests against his takeover plans, vowing to continue fighting until they succeed or back out altogether."], "tinydolphin:1.1b": [" Malcolm Glazer, a businessman from the United States, has made a fresh approach to buy Manchester United.", "His new offer is expected to contain substantially less debt compared to previous bids and could lead to a formal bid being accepted by the club's board.", "This comes as a surprise because he had been turning down previous takeover attempts.", "However, shares in Manchester United have risen since this latest announcement."], "phi:2.7b": [" Malcolm Glazer is trying to buy Manchester United for £800m, and his new offer is less likely to have debt.", "The US tycoon has approached the board with \"detailed proposals\" and hopes to receive a formal bid.", "However, major shareholders John Magnier and JP McManus have cut off talks with Glazer over the proposed sale of their stake.", "United fans are angry about the latest announcement and vow to fight on against any takeover by Glazer."], "orca-mini:3b": [" Malcolm Glazer has made a fresh approach to buy Manchester United, which could lead to a bid valuing the Premiership club at £800m.", "The US tycoon approached the United board with \"detailed proposals\" and hopes to make a formal bid.", "His new offer is expected to contain substantially less debt.", "Mr Glazer had earlier won over leading banks to come up with a stronger and less debt-laden bid, but last week he issued a statement distancing himself from a new bid.", "Man United's chief executive David Gill said in December that talks would not resume unless Glazer came up with \"definitive proposals\".", "Now the board has confirmed that the US bidder is back with a statement issued on Sunday reading: \"The board can confirm it has now received a detailed proposal subject to various preconditions which may form the basis of an offer.", "A further announcement will be made in due course.\"", "The campaign against this proposed takeover will continue as it has done since Glazer first showed interest in the club."], "hermes3:3b": ["Malcom Glazer makes new £800m bid to buy Man Utd, after previously rejected due to high debt.", "Now with \"detailed proposals\" for lower borrowing."], "stablelm-zephyr:3b": ["US tycoon Malcolm Glazer has submitted detailed proposals to buy Manchester United, potentially valuing the Premiership club at £800m.", "Having previously been turned down by the Red Devils due to a high level of borrowing, Glazer now hopes that his new offer will be accepted with the support of major shareholders John Magnier and JP McManus.", "However, both magnifiers have halted talks with Glazer regarding the sale of their stake and have remained silent on his latest approach.", "Manchester United fans have expressed anger at the announcement, vowing to fight against any potential takeover by Glazer or others."], "chatgpt-4o-latest": ["Malcolm Glazer has made a renewed attempt to buy Manchester United, potentially valuing the club at £800m.", "His latest approach includes \"detailed proposals\" with less debt, following a previously rejected bid.", "Glazer, who owns the Tampa Bay Buccaneers, had used his 28.1% stake to remove three board members after his initial bid was turned down.", "Reports suggest he has secured bank support for a stronger offer.", "The United board has confirmed receiving his proposal but requires approval from major shareholders John Magnier and JP McManus, who have not commented.", "Fans remain strongly opposed, vowing to resist any takeover attempt."], "stablelm2:1.6b": ["Malcolm Glazer makes a new proposal to buy Manchester United, with an expected lower debt value than previous offers.", "He aims for a formal bid acceptance if his proposals are met.", "Despite previous denials of a takeover attempt due to high borrowing levels, Glazer gained support from leading banks in a potential less debt-laden bid.", "The board has received a detailed proposal subject to various preconditions.", "Major shareholders John Magnier and JP McManus still need approval for their 9% stake but have cut off talks with Glazer.", "United fans oppose any takeover by Glazer, continuing the fight against his interest since September 2018."], "granite3.1-dense:2b": ["Malcolm Glazer, a US tycoon and owner of the Tampa Bay Buccaneers, has resurfaced with a new bid to purchase Manchester United.", "This proposal is reportedly valued at £800 million and includes significantly less debt than his previous rejected offer.", "The board has confirmed receiving detailed proposals from Glazer, who hopes they will lead to a formal bid acceptance.", "However, the proposal still requires approval from major shareholders John Magnier and JP McManus, who have discontinued discussions with Glazer over selling their stake.", "Despite this development, Manchester United fans remain vehemently opposed to any takeover by Glazer, vowing to continue their campaign against it."]}