{"raw_text": "Millions 'to lose textile jobs'\n \n Millions of the world's poorest textile trade workers will lose their jobs under new trade rules to be introduced in the new year, a charity has warned.\n \n The World Trade Organisation (WTO) is to end its Multi-Fibre Agreement (MFA) on midnight of 31 December. Christian Aid condemned the move, saying it would see almost a million jobs in Bangladesh alone being axed. However, supporters of the change claim it will mean increased efficiency and lower costs for Western consumers.\n \n It will also see more jobs created in India and China, advocates argue. The WTO said that many developing countries support the end of quotas and stressed that funding was available to countries such as Bangladesh to help them make the transition to a fully liberalised market. \"There will be a period of adjustment required,\" said WTO spokesman Keith Rockwell. \"Some countries will do better than others but there is no one who is suggesting that no developing country will do well out of this. \"Some countries where it may appear that orders will dry up have seen orders surging and there are many companies who will continue with existing trading relationships.\"\n \n Christian Aid has called on British firms not to simply \"cut and run\" but look after their workers, in a new report called Rags To Riches To Rags.\n \n It added that with few employment alternatives available many sacked garment workers could end up in far worse jobs - with some of the mainly female workers forced into the sex trade. The WTO itself has warned that as many as 27 million jobs could be lost as a result of liberalisation in the textile industry. Some of the world's fastest developing countries which rely on textile exports to build growth - for example in Bangladesh textiles account for almost 85% of the country's exports and the industry employs around 1.5 million people. The MFA pact has helped developing countries get a bigger share of the world market. \"The losers in this new trade landscape will be some of the most vulnerable workers in countries such as Bangladesh, Cambodia, Sri Lanka and Nepal,\" Andrew Pendleton, Christian Aid's head of Trade Policy, said. \"They will be hard-pressed to cope when garment industries there lose their protection. \"We are deeply concerned that the New Year will spell misery for huge numbers of garment workers.\" The WTO said there was no consenus among its members to retain the quotas and emphasised that funding was available to countries such as Bangladesh to help them adjust to the liberalised market.\n \n It added that the impact of the changes for workers most affected by the shake-up had not been considered, adding such seismic changes to policy should \"put the interests of poor people first - rather than simply aiming to liberalise markets at any cost\". While the current MFA was not perfect, its did allow Third World countries like Bangladesh to get onto the first rung of industrial development, Christian Aid said. \"International trade must not be governed by a 'race to the bottom' that pitches one set of poor people against another,\" Mr Pendleton added.\n", "llama3.2:1b": ["Millions of textile workers in developing countries such as Bangladesh, Cambodia, Sri Lanka, and Nepal will lose their jobs due to new trade rules imposed by the World Trade Organisation (WTO) at midnight on December 31.", "The WTO has ended its Multi-Fibre Agreement (MFA), which provided protections for these countries' garment industries.", "The organisation claims that increased efficiency and lower costs will benefit Western consumers, while supporters argue that this shift will lead to increased poverty and human rights abuses among the affected workers.", "According to Christian Aid, nearly a million jobs in Bangladesh alone could be lost as a result of the changes, including women who may find themselves forced into sex work.", "The WTO itself has warned that 27 million jobs could be lost worldwide due to liberalisation in the textile industry.", "The organisation is calling on British firms to look after their workers and support those affected by the change, rather than simply abandoning them as \"rags to riches\".", "It argues that poor people should not be pitted against each other for the sake of economic gain."], "llama3.2:3b": ["Millions of textile workers will lose their jobs under new WTO rules due to end of Multi-Fibre Agreement on December 31, Christian Aid warns.", "The charity claims it could lead to almost a million job losses in Bangladesh alone.", "Supporters argue it will increase efficiency and lower costs for Western consumers."], "gemma2:2b": ["The Multi-Fibre Agreement (MFA) will end on December 31st, 2023, resulting in the loss of jobs for millions worldwide, particularly in developing countries like Bangladesh.", "The World Trade Organization (WTO) argues that this change will lead to increased efficiency and lower costs for consumers.", "However, Christian Aid warns that many workers may be forced into unfavorable jobs or even sex work due to limited employment opportunities.", "Some companies are expected to continue existing trading relationships while others may experience a decline in orders.", "The WTO acknowledges the potential negative impact on developing countries but emphasizes funding is available to support them."], "qwen2.5:0.5b": ["The World Trade Organization (WTO) is ending its Multi-Fibre Agreement on December 31st and could see nearly 1 million textile workers lose their jobs in Bangladesh alone.", "Christian Aid warned that increased efficiency, lower costs for Western consumers, and more jobs in India and China would be created under this new trade agreement.", "Supporters argue the changes will mean higher standards of living for British firms but some critics claim it could lead to a significant loss of jobs.", "The WTO has said there is no consensus on retaining quotas and that funding will help developing countries make the transition.", "Some workers in Bangladesh are particularly affected as their orders may dry up, with many forced into the sex trade.", "The MFA pact helped developing countries get a bigger share of the world market but this new agreement could lead to more job losses for poor people."], "qwen2.5:1.5b": ["The World Trade Organization (WTO) plans to end its Multi-Fibre Agreement (MFA), leading to significant job losses for millions, particularly in Bangladesh, where 1 million textile jobs could be eliminated.", "Critics argue the move will increase efficiency and lower costs for consumers, while supporters claim it will create more jobs in India and China.", "Christian Aid warns that this change will force many garment workers into exploitative sex work and emphasizes the need to protect vulnerable populations from job losses.", "The WTO maintains there is no consensus on retaining quotas but acknowledges funding for developing countries' transition."], "qwen2.5:3b": ["Millions of textile workers in developing countries will lose their jobs under new trade rules due to the end of the World Trade Organisation's Multi-Fibre Agreement on December 31.", "Christian Aid warns almost a million jobs could be lost in Bangladesh alone, though supporters argue increased efficiency and lower costs for Western consumers are benefits.", "The WTO suggests India and China may see more job creation, but some developing countries like Bangladesh will face challenges with no guaranteed employment alternatives available.", "Christian Aid urges British firms to consider their workers' welfare amidst potential economic hardship for textile workers in countries such as Bangladesh, Cambodia, Sri Lanka, and Nepal."], "opencoder:1.5b": ["Millions of world's poorest textile workers will lose their jobs under new trade rules to be introduced in the new year, a charity has warned.", "The World Trade Organisation (WTO) is to end its Multi-Fibre Agreement (MFA) on midnight of 31 December.", "British firms not to simply \"cut and run\" but look after their workers, in a new report called Rags To Riches To Rags.", "The industry employs around 1.5 million people and accounts for almost 85% of the country's exports.", "The MFA pact has helped developing countries get a bigger share of the world market.", "Some of the world's fastest developing countries which rely on textile exports to build growth - for example in Bangladesh textiles account for nearly 27 million jobs.", "The MFA allowed Third World countries like Bangladesh to get onto the first rung of industrial development.", "International trade must not be governed by a 'race to the bottom' that pitches one set of poor people against another, Mr Pendleton added."], "smollm:1.7b": ["The WTO is expected to end its Multi-Fibre Agreement (MFA) on December 31st, which will see almost a million jobs in Bangladesh alone being axed under new trade rules.", "The WTO has emphasized that the move will mean increased efficiency and lower costs for Western consumers, but it has also been criticized by charities such as Christian Aid for its potential impact on poor countries like Bangladesh.", "The MFA allowed developing countries to get onto the first rung of industrial development, enabling them to export goods to other countries in exchange for concessions on tariffs and quotas.", "However, critics argue that this system is unfair and does not benefit all countries equally.", "Christian Aid has called on British firms not to simply \"cut and run\" but look after their workers, in a new report called Rags To Riches To Rags.", "The charity emphasized that with few employment alternatives available, many sacked garment workers could end up in far worse jobs - such as the sex trade - if they are unable to find work in their home country.", "The WTO itself has warned that as many as 27 million jobs could be lost as a result of liberalisation in the textile industry.", "The MFA pact has helped developing countries get a bigger share of the world market, but Christian Aid is concerned that the new trade rules will not benefit these countries equally.", "Christian Aid argues that the impact of the changes for workers most affected by the shake-up has not been considered and that international trade must be governed by a \"race to the top\" rather than pitting one set of poor people against another.", "The charity also emphasizes that the WTO's move is not without its critics, with many arguing that it does not do enough to protect workers' rights in developing countries."], "deepseek-r1:1.5b": ["Millions of the world's poorest textile trade workers will lose their jobs under new trade rules to be introduced in January, according to a charity warning.", "The World Trade Organisation (WTO) plans to end its Multi-Fibre Agreement (MFA) by midnight on 31 December.", "Christian Aid called for support for these changes and condemned the move, noting it would ax almost a million jobs in Bangladesh alone.", "However, supporters argue increased efficiency and lower costs could be achieved for Western consumers.", "They also noted more jobs created in India and China, with many countries, including Bangladesh, seeing transitions to a fully liberalised market.", "The WTO highlighted that some developing countries support ending quotas, stressed funding availability, and warned that some countries where orders dry up may now surge due to increased demand from exports.", "Christian Aid called for British firms not to \"cut and run\" but focus on their workers' well-being.", "They also noted that while many third-world countries like Bangladesh are benefiting from the MFA, others will face challenges in adapting to free trade.", "The WTO acknowledged some countries may struggle with worker shortages during this transition, but there is no consensus on retaining quotas.", "Christian Aid emphasized that many fastest-growing countries rely on textile exports and highlight how changes could push those industries into a more vulnerable position, especially for garment workers who might lose protections or face worse job prospects."], "tinyllama:1.1b": ["In response to the announcement by the World Trade Organization (WTO) that it will phase out quotas in Bangladesh and India, a charity has warned that millions of garment workers could lose their jobs.", "Christian Aid's director, Andrew Pendleston, argued that the loss of these jobs will be particularly hard-hit for workers in Bangladeš who rely heavily on textile industries to build up employment opportunities.", "The WTO itself has cautioned that up to 27 million jobs could be lost as a result of liberalization in the textile industry, with some countries such as Bangladeš reliant on exports to support their growth.", "Despite efforts by the WTO to ensure that funds are available for countries like Bangladeš, Christian Aid has emphasized that this should not come at the expense of vulnerable workers.", "The charity argues that while the current MFA was not perfect, it did allow Third World countries like Bangladeš to move towards industrial development, which should be the primary goal of policy when considering the impact on garment workers."], "tinydolphin:1.1b": [" The WTO announced new rules for the textile industry which could lead to job losses in Bangladesh and other poor countries.", "The new rules would allow Western consumers to buy cheaper clothes without having to pay more for quality, but it might also see an increase in exports from these countries to the US and Europe.", "This will affect millions of poor people who rely on textile jobs for a living.", "Christian Aid is calling for better treatment for workers and urging companies not to cut and run when faced with new challenges."], "phi:2.7b": [" Millions of the world's poorest textile trade workers may lose their jobs under new trade rules being introduced in the new year.", "The World Trade Organization (WTO) will end its Multi-Fibre Agreement (MFA) on December 31, leading to almost a million job losses in Bangladesh alone.", "Supporters argue that it will increase efficiency and lower costs for Western consumers.", "However, Christian Aid has criticized this change, stating that funding is available to help countries transition to a fully liberalized market.", "The charity called on British firms not to simply \"cut and run,\" but look after their workers.", "Without employment alternatives, many sacked garment workers could end up in the sex trade.", "The report also warns of negative impacts on developing countries' economies.", "The WTO has warned that as many as 27 million jobs could be lost due to liberalization in the textile industry."], "orca-mini:3b": [" The MFA ending on 31 December 2019 will see millions of textile trade workers lose their jobs in developing countries such as Bangladesh, and some workers may even transition to the sex trade.", "The WTO argues that liberalization will lead to increased efficiency and lower costs for Western consumers, but critics warn of job losses and a potential \"race to the bottom\" where Third World countries compete with each other on price.", "The charity Christian Aid calls for British firms to look after their workers and provide support during this transition period."], "hermes3:3b": ["Textile jobs to be lost for millions, warning says.", "Bangladesh alone to face nearly 1m job cuts due to WTO's end of Multi-Fibre Agreement."], "stablelm-zephyr:3b": ["The World Trade Organisation (WTO) is ending its Multi-Fibre Agreement (MFA) on December 31, which could result in millions of textile workers worldwide losing their jobs, according to Christian Aid.", "The organization believes almost a million jobs in Bangladesh alone will be eliminated as a consequence of the change, with some supporters claiming increased efficiency and lower costs for Western consumers would be the advantages.", "However, WTO claims developing countries support the end of quotas and stressed funding is available for nations such as Bangladesh to help them transition to a fully liberalized market.", "Christian Aid has urged British firms to look after their workers and not simply cut and run, warning that sacked garment workers could face even worse job opportunities, including entering the sex trade."], "chatgpt-4o-latest": ["Millions of textile workers, particularly in developing countries, will lose their jobs as the World Trade Organisation (WTO) ends the Multi-Fibre Agreement (MFA) on December 31.", "Christian Aid warns that nearly a million jobs in Bangladesh alone will be lost, with many workers, especially women, facing worse employment conditions, including the risk of entering the sex trade.", "While supporters argue the change will increase efficiency and lower costs for Western consumers, it is expected to benefit countries like India and China while harming vulnerable workers in nations such as Bangladesh, Cambodia, Sri Lanka, and Nepal.", "The WTO acknowledges the transition challenges but insists that funding is available to help affected countries adjust.", "Christian Aid urges British firms to support their workers rather than abandoning them and criticizes the policy shift for prioritizing market liberalization over the well-being of poor workers."], "stablelm2:1.6b": ["Millions of textile workers in the world's poorest countries will lose jobs under new trade rules introduced in 2021, according to charity Christian Aid.", "The World Trade Organization (WTO) is ending its Multi-Fibre Agreement (MFA), leading to almost one million job losses in Bangladesh alone.", "Supporters claim it will lead to increased efficiency and lower costs for Western consumers while also creating more jobs in India and China.", "However, critics argue that many developing countries will suffer from this transition, and the impact on workers most affected by the shake-up hasn..", "The WTO acknowledges there is a period of adjustment required and no consensus exists among its members to retain quotas.", "Funding is available to help countries like Bangladesh adjust to a fully liberalized market, but the interests of poor people must be prioritized over the aim to liberalize markets at any cost, according to Christian Aid."], "granite3.1-dense:2b": ["The World Trade Organisation (WTO) is set to terminate its Multi-Fibre Agreement (MFA) on December 31, 2022, potentially eliminating nearly a million textile jobs in Bangladesh and up to 27 million jobs globally.", "This change aims to increase efficiency and reduce costs for Western consumers.", "However, Christian Aid warns that many sacked garment workers may resort to worse employment or the sex trade due to limited alternatives.", "The WTO emphasizes that funding is available to help affected countries transition to a fully liberalized market, but acknowledges that some nations may struggle during the adjustment period.", "Christian Aid urges British firms not to \"cut and run\" but support their workers, highlighting the concern for vulnerable garment workers in developing countries like Bangladesh, where textile exports constitute nearly 85% of the economy and employ around 1.5 million people.", "The charity argues that international trade should prioritize poor people's interests over unrestricted market liberalization."]}