{"raw_text": "Fannie Mae 'should restate books'\n \n US mortgage company Fannie Mae should restate its earnings, a move that is likely to put a billion-dollar dent in its accounts, watchdogs have said.\n \n The Securities & Exchange Commission accused Fannie Mae of using techniques that \"did not comply in material respects\" with accounting standards. Fannie Mae last month warned that some records were incorrect. The other main US mortgage firm Freddie Mac restated earnings by $5bn (£2.6bn) last year after a probe of its books. The SEC's comments are likely to increase pressure on Congress to strengthen supervision of Fannie Mae and Freddie Mac.\n \n The two firms are key parts of the US financial system and effectively underwrite the mortgage market, financing nearly half of all American house purchases and dealing actively in bonds and other financial instruments. The investigation of Freddie Mac in June 2003 sparked concerns about the wider health of the industry and raised questionsmarks over the role of the Office of Federal Housing Enterprise Oversight (OFHEO), the industry's main regulator. Having been pricked into action, the OFHEO turned its attention to Fannie May and in September this year said that the firm had tweaked its books to spread earnings more smoothly across quarters and play down the amount of risk it had taken on. The SEC found similar problems. The watchdog's chief accountant Donald Nicolaisen said that \"Fannie Mae's methodology of assessing, measuring and documenting hedge ineffectiveness was inadequate and was not supported\" by generally accepted accounting principles.\n", "llama3.2:1b": ["Fannie Mae should restate its earnings due to non-compliance with accounting standards.", "The Securities & Exchange Commission found similar issues at Freddie Mac.", "The two firms underwrite the US mortgage market, deal in financial instruments, and have a significant impact on home purchases.", "Their recent restatements of earnings were prompted by concerns about their financial health."], "llama3.2:3b": ["US mortgage company Fannie Mae should restate its earnings due to non-compliance with accounting standards, following a Securities & Exchange Commission probe.", "The investigation found incorrect records, similar to Freddie Mac's $5bn restatement last year.", "The two firms underwrite nearly half of all American house purchases and have been subject to increased pressure on Congress to strengthen supervision."], "gemma2:2b": ["Fannie Mae should restate its earnings, potentially resulting in a billion-dollar loss.", "The Securities & Exchange Commission (SEC) accuses Fannie Mae of using non-compliant accounting practices that are similar to those found in Freddie Mac's previous restatement.", "The SEC's investigation has increased pressure on Congress to strengthen oversight of both Fannie Mae and Freddie Mac.", "These firms play a significant role in the US financial system, handling mortgage financing for nearly half of American house purchases."], "qwen2.5:0.5b": ["US mortgage firm Fannie Mae is under investigation for using improper financial practices to report its earnings, which will likely hurt the company’s accounts and cause it $5 billion in losses.", "Freddie Mac last year restated its earnings after a similar investigation, showing that the two firms are key parts of the US financial system and effectively finance nearly half of all American house purchases and deal with bonds.", "The SEC's comments have led to pressure on Congress to strengthen supervision over Fannie Mae and Freddie Mac.", "The two firms operate underwriting mortgage business and actively engage in bond market transactions, which is critical for the stability of the US financial system."], "qwen2.5:1.5b": ["US mortgage company Fannie Mae should restate earnings, likely costing $1 billion, following SEC accusations of non-compliance with accounting standards, prompting calls for enhanced oversight of the two firms central to the mortgage market."], "qwen2.5:3b": ["US mortgage company Fannie Mae should restate its earnings, likely leading to a billion-dollar decrease in accounts.", "The Securities & Exchange Commission (SEC) accused the firm of using non-compliant accounting techniques.", "This move is expected to increase pressure on Congress to strengthen regulation of Fannie Mae and Freddie Mac.", "Both firms are crucial components of the US financial system, underwriting nearly half of all American house purchases.", "An investigation into Freddie Mac in 2003 highlighted concerns about the mortgage industry's health and questioned the OFHEO's role as a regulator.", "The SEC found similar issues with Fannie Mae, including an inadequate methodology for assessing hedge ineffectiveness."], "opencoder:1.5b": ["US mortgage company Fannie Mae should restate its earnings, likely to put a billion-dollar dent in its accounts, watchdogs have said.", "The Securities & Exchange Commission accused Fannie Mae of using techniques that did not comply in material respects with accounting standards.", "Fannie Mae last month warned that some records were incorrect.", "Fannie Mae is key part of the US financial system and effectively underwrites the mortgage market, financing nearly half of all American house purchases.", "The investigation of Freddie Mac in June 2003 sparked concerns about the wider health of the industry.", "Having been pricked into action, OFHEO turned its attention to Fannie May and in September this year said that the firm had tweaked its books."], "smollm:1.7b": ["The summary is concise and to the point.", "It captures the main ideas and key details from the text without including any explanations or reasoning processes.", "The summary should preserve the original meaning and tone of the text, while omitting unnecessary information."], "deepseek-r1:1.5b": ["The U.S. Treasury Department criticized Fannie Mae as \"not compliant\" with accounting standards due to potential misstatements in its financial statements.", "The Securities & Exchange Commission accused Fannie Mae of using improper techniques, while Freddie Mac also faced an investigation that led to concerns about the health of the mortgage industry and questions regarding regulatory oversight by the Office of Federal Housing Enterprise Oversight (OFHEO).", "Both firms restated earnings last year, with F Annie Mae showing a $5 billion increase in its financial statements and Freddie Mac only increasing their 2003 earnings by $187 million.", "These findings highlight potential issues in their accounting practices that could pressure Congress to strengthen supervision."], "tinyllama:1.1b": ["The Securities & Exchange Commission has accused the US mortgage company Fawnie Mae of using techniques that did not meet standard accounting standards, leading to a bill of $1 billion in damages on their accounts.", "The main US mortgage firm Freddie Mac was also threatened with supervision restructuring in 2003 after it was found to have misreported half of its books, leading to concerns about the wider health of the industry and questions over the role of OFHEO.", "In September 2004, the SEC's chief accountant, Donald Nicolaisen, expressed serious doubts about Fawnie Mae's methodology, which had resulted in a bill of $1 billion in damages on their accounts.", "The watchdog is now calling for an investigation into the wider mortgage industry to look at how they are regulated and overseen."], "tinydolphin:1.1b": [" Fannie Mae is a major American mortgage company, responsible for restating its earnings to correct issues they believe led to incorrect financial statements.", "The SEC, or the Securities & Exchange Commission, has accused Fannie Mae of not following accounting standards when restating their books.", "This could lead to a billion-dollar loss in their accounts if they restate again, which could have repercussions on the entire US mortgage market.", "The two major competitors, Freddie Mac and the Office of Federal Housing Enterprise Oversight (OFHEO), are also under scrutiny for their own mistakes in financial reporting."], "phi:2.7b": [" Fannie Mae should restate its earnings due to US mortgage company Fannie Mae's use of techniques that do not comply with accounting standards.", "This could result in a billion-dollar impact on the company's accounts.", "Freddie Mac had previously restated its earnings after a similar investigation, and the SEC's comments may put pressure on Congress to strengthen supervision of both companies.", "Fannie May is a key player in the US financial system, financing nearly half of all American house purchases, but there are concerns over the health of the industry as a whole."], "orca-mini:3b": [" Fannie Mae, a US mortgage company, is likely to restate its earnings by a billion dollars due to problems with its accounting methods.", "The SEC accused Fannie Mae of using techniques that did not comply with accounting standards, and the investigation of Freddie Mac in 2003 sparked concerns about the wider health of the industry.", "The role of the OFHEO regulator was also raised after the probe."], "hermes3:3b": ["Fannie Mae likely to restat earnings billion$; SEC accuses of non-compliant accounting methods."], "stablelm-zephyr:3b": ["Fannie Mae, a US mortgage company, is reportedly being accused by the Securities & Exchange Commission (SEC) of using non-compliant accounting techniques that resulted in a potential billion-dollar impact on its accounts.", "The SEC's comments are likely to increase pressure on Congress to strengthen supervision of Fannie Mae and counterparty Freddie Mac, both of which play significant roles in the US financial system as they effectively underwrite nearly half of all American house purchases and actively deal with bonds and other financial instruments.", "This situation follows similar actions by Freddie Mac where it restated its earnings last year after an investigation prompted concerns about the wider health of the industry and raised questions marks over the role of the Office of Federal Housing Enterprise Oversight (OFHEO), the main regulator within the sector.", "Fannie Mae has since adjusted its books to spread earnings more smoothly across quarters and reduce risk exposure, in response to the SEC's findings, with similar issues identified by the watchdog's chief accountant, Donald Nicolaisen."], "chatgpt-4o-latest": ["Fannie Mae has been advised to restate its earnings due to accounting practices that did not comply with standards, potentially leading to significant financial adjustments.", "The SEC found that Fannie Mae manipulated its records to smooth earnings and downplay risks, similar to issues previously uncovered at Freddie Mac, which had to restate $5 billion in earnings.", "This scrutiny increases pressure on Congress to enhance oversight of both firms, which play a crucial role in the US mortgage market.", "The investigation also raises concerns about the effectiveness of the industry's main regulator, the OFHEO."], "stablelm2:1.6b": ["US mortgage company Fannie Mae needs to restate its earnings due to using non-compliant techniques with accounting standards, according to the Securities & Exchange Commission.", "This will result in a $1 billion loss for Fannie Mae's accounts.", "The investigation of Freddie Mac raised concerns about the US financial system and potential regulatory changes are likely as a result.", "Fannie Mae and Freddie Mac are key parts of the mortgage market, financing nearly half of all American house purchases and dealing actively in bonds and other financial instruments."], "granite3.1-dense:2b": ["Fannie Mae, a major US mortgage company, is advised to restate its earnings due to violations of accounting standards, as per the Securities & Exchange Commission (SEC).", "This action could potentially reduce Fannie Mae's accounts by $1 billion.", "The SEC's findings are expected to intensify calls for Congress to enhance oversight of both Fannie Mae and its sibling firm, Freddie Mac.", "Both companies significantly contribute to the US mortgage market, underwriting nearly half of all American home purchases.", "An investigation into Freddie Mac in 2003 exposed flaws in their accounting practices, prompting OFHEO, the industry's principal regulator, to scrutinize Fannie Mae as well.", "The SEC and OFHEO discovered that Fannie Mae manipulated its financial records to mask risk more effectively and evenly across quarters.", "According to the SEC's chief accountant, Donald Nicolaisen, Fannie Mae's methodology for evaluating hedge ineffectiveness lacked support under generally accepted accounting principles."]}