{"raw_text": "US to rule on Yukos refuge call\n \n Yukos has said a US bankruptcy court will decide whether to block Russia's impending auction of its main production arm on Thursday.\n \n The Russian oil firm has filed for bankruptcy protection in the US in an attempt to halt the forced sale. However, Judge Letitia Clark said the hearing would continue on Thursday when arguments in the case would be heard. Russian authorities are due to auction off Yuganskneftegas on 19 December to pay a huge tax bill sent to Yukos.\n \n Russian prosecutors are forcing the sale of the firm's most lucrative asset Yuganskneftegas to help pay a $27bn (£14bn) back tax bill, which they claim is owed by Yukos.\n \n Filing for bankruptcy protection in the US was \"a last resort to preserve the rights of our shareholders, employees and customers,\" said Yukos chief executive Steven Theede. The company added it had opted to take action through American courts as US bankruptcy law gives worldwide jurisdiction over a debtor company's property and because it was seeking a judiciary willing to protect the value of shareholders' investments. However, as the firm is based in Russia and has no significant US assets, lawyers are unsure of the outcome of the case. \"We are here to stop 60% of our body from being cut off on Sunday,\" Zack Clement, a lawyer for Yukos, told Judge Clark in an emergency hearing in Houston, Texas, on Wednesday. As well as the bid to get Chapter 11 bankruptcy - which protects firms from creditors, allowing them to continue trading as they restructure their finances - the group also made a claim for damages against the Russian government. Yukos asked the Houston court to order Russia to arbitration so that it can press claims for billions of dollars in damages over a \"campaign of illegal, discriminatory and disproportionate\" tax claims. Mr Clement said that under Russian law, the Russian government was obliged to enter into arbitration as set out in international law.\n \n He added that the opening bid for the firm's Yuganskneftgas unit was $8bn - less than half of the $20bn that Yukos advisers say it is worth. \"We believe the only significant bidder at the auction on Sunday is Gazprom,\" he said, referring to Russia's natural gas giant. Yukos maintains that the forced auction is illegal and \"will cause the company to suffer immediate and irreparable harm.\" Many commentators believe the Russian government's aggressive pursuit of Yukos is a politically-motivated response to the political ambitions of its former chief executive, Mikhail Khodorkovsky. Mr Khodorkovsky, who had funded liberal opposition groups, was arrested in October last year on fraud and tax evasion charges and is still in jail Analysts believe that if its production unit is auctioned off, it is likely to be bought up by a government-backed firm, like Gazprom, effectively bringing a large chunk of Russia's lucrative oil and gas industry back under state control.\n", "llama3.2:1b": ["The US bankruptcy court is set to decide whether to block Russia's planned auction of its main production arm Yukos on December 19.", "Yukos has filed for bankruptcy in the US and sought to prevent the sale, which could raise $27 billion in tax debt owed by Yukos to Russia.", "The company claims that a $8 billion opening bid is less than half its estimated value.", "Judge Letitia Clark has announced that arguments will be heard on December 19, despite initial plans for the hearing to take place earlier.", "Russian authorities are due to auction off Yuganskneftegas to pay a huge tax bill to Yukos.", "Yukos has also filed a claim for damages against Russia and sought an order for arbitration to press claims for billions of dollars in damages over alleged illegal tax claims."], "llama3.2:3b": ["US bankruptcy court will decide whether to block Russia's auction of Yukos' main production arm, Yuganskneftegas, on December 19.", "Yukos filed for US bankruptcy protection in an attempt to halt the sale, which is intended to pay a $27bn tax bill.", "The company claims the sale is illegal and would cause \"immediate and irreparable harm\".", "Russia's authorities argue that Yukos owes the tax bill and are seeking to recover it through the auction of the firm's most lucrative asset."], "gemma2:2b": ["Yukos Energy has filed for bankruptcy protection in the US to prevent the forced sale of its most valuable asset, Yuganskneftegas, to pay a tax debt.", "Yukos believes this is illegal and will cause them significant harm.", "They are seeking protection under Chapter 11 bankruptcy law and compensation from Russia for what they claim is a politically-motivated campaign against them.", "Gazprom is the only likely bidder at the auction scheduled for December 19th, with many analysts predicting that Yukos will be sold to government-backed companies like Gazprom."], "qwen2.5:0.5b": ["Russian oil firm Yukos may lose out on the sale of its Yuganskneftegas production unit in a bankruptcy hearing after Russian authorities auction off the company’s assets on December 19th.", "Some comments:\n- US will decide whether to block Russian auction (U.S. bankruptcy court)\n- Judge Letitia Clark's ruling\n- Russia is attempting to force the sale of oil and gas production arm of Yukos due to a $27bn tax bill (Yuganskneftegas) that has been delayed since November 19th.", "- Russian prosecutors are seeking to protect shareholders' investments by forcing the sale of Yuganskneftegas, citing it as \"one of the company’s most lucrative assets\"\n- Yukos is facing an $8b bid from Gazprom (Russian gas giant)\n- Analysts believe that auctioning off Yuganskneftegas could be a way for Russia to regain control of its oil and gas industry\nThe Russian government seems motivated by its former CEO, Mikhail Khodorkovsky, who was arrested in October last year on fraud and tax evasion charges.", "The company is hoping to buy up Gazprom as a means of avoiding further legal troubles and protecting their assets from the Russian government's aggressive actions."], "qwen2.5:1.5b": ["US court to decide on Yukos bankruptcy bid to stop sale of Russian oil giant Yuganskneftegas in auction for tax payment."], "qwen2.5:3b": ["US court will decide on whether to block Russia's auction of Yukos' main production arm Yuganskneftegas scheduled for December 19th.", "Yukos has filed for bankruptcy protection in US courts to halt the sale, which is aimed at settling a $27bn tax bill.", "The auction would cut off nearly half of Yukos' business.", "If successful, Yukos seeks arbitration with Russia over alleged unfair taxation practices and demands billions in damages.", "Analysts suggest the likely buyer could be Gazprom, allowing government control over key Russian assets."], "opencoder:1.5b": ["US to Rule on Yukos Refugee Call\n\nYukos has said that if the US bankruptcy court determines that Russia's auction of its main production arm is illegal, it will decide whether to block U.S. forced sales of Yuganskneftegas.", "The Russian oil firm filed for bankruptcy protection in the U.S., which was a \"last resort\" to preserve the rights of shareholders and employees.", "The company added that the actions were part of an attempt to halt the forced sale, which has led to a $27bn tax bill against Yukos that is owed by the Russian government.", "The filing claim was part of an attempt to protect Yukos' business from creditors who could seek billions in damages over a \"campaign of illegal, discriminatory and disproportionate\" tax claims.", "The hearing in Houston, Texas, on Wednesday, came as a result of a bid made by U.S. citizens for the firm's Yuganskneftegas unit - $8bn less than half of the $20bn that UK businesses are willing to sell.", "The opening bid was due to be made at an auction, and in response to this, the firm has been allowed to trade under U.S. law, which is subject to state rules.", "The Russian government's aggressive pursuit of the firm, which includes its natural gas giant, is likely a politically motivated response to the political ambitions of its former chief executive, Mikhail Khodorkovsky.", "The move, led by analysts who believe that if its production unit is auctioned off, it could be bought up by a government-backed company like Gazprom effectively bringing a significant chunk of Russia's trading business back under state control.", "In conclusion, the U.S., and particularly the US bankruptcy court, has made a crucial decision in this issue, and as such, any further discussion around this topic is deemed unimportant.", "The key takeaways from the case include the importance of legalizing forced sales at the expense of businesses, and the potential for significant restructuring to be conducted under U.S. law."], "smollm:1.7b": ["The summary should preserve the key ideas and details:\n\n1.", "The US will decide whether to block Russia's impending auction of its main production arm on Thursday.", "2.", "Judge Letitia Clark said the hearing would continue on Thursday when arguments in the case would be heard.", "Russian authorities are due to auction off Yuganskneftegas on 19 December to pay a huge tax bill sent to Yukos.", "3.", "Russian prosecutors are forcing the sale of the firm's most lucrative asset Yuganskneftegas on Sunday to help pay a $27bn (£14bn) back tax bill, which they claim is owed by Yukos.", "4.", "Filing for bankruptcy protection in the US was \"a last resort to preserve the rights of our shareholders, employees and customers,\" said Yukos chief executive Steven Theede.", "The company added it had opted to take action through American courts as US bankruptcy law gives worldwide jurisdiction over a debtor company's property.", "However, as the firm is based in Russia and has no significant US assets, lawyers are unsure of the outcome of the case.", "5.", "Yukos asked the Houston court to order Russia to arbitration so that it can press claims for billions of dollars in damages over a \"campaign of illegal, discriminatory and disproportionate\" tax claims.", "Mr Clement said that under Russian law, the Russian government is obliged to enter into arbitration as set out in international law.", "6.", "Yukos maintains that the Russian government's aggressive pursuit of Yukos is a politically-motivated response to the political ambitions of its former chief executive, Mikhail Khodorkovsky.", "Analysts believe that if its production unit is auctioned off, it is likely to be bought up by a government-backed firm, like Gazprom, effectively bringing a large chunk of Russia's lucrative oil and gas industry back under state control."], "deepseek-r1:1.5b": ["Yukos is considering legal action to prevent Russia from bidding on its oil production arm, which could harm financial stability.", "The Russian firm filed for bankruptcy protection, citing the sale's potential tax burden.", "Yukos is preparing a $8bn bid in December on Yuganskneftegas, though efforts are blocked by Russian authorities and pending arbitration claims."], "tinyllama:1.1b": ["The US has been granted permission to continue with the bankruptcy proceedings brought against Yukenesftgas by Russian authorities seeking the forced auction off the company's most profitable asset, according to a Houston judge.", "However, the prospect of filing for bankruptcy protection in the US is considered a last resort due to its failure to secure any significant US assets worth the $27 billion owed by Yukonegas.", "The group has filed claims against the Russian government for damages over an \"illegally discriminatory and disproportionate\" tax campaign aimed at preventing it from restructuring financially, and asserts that the forced auction will cause immediate harm to its assets.", "This case is part of a larger political response to Khodorkovsky's political ambitions, which analysts believe could lead to the government-backed acquisition of Yukefgas, with Gazprom being seen as a potential buyer."], "tinydolphin:1.1b": [" Judge Letitia Clark has announced that the US bankruptcy court will hear arguments on Thursday concerning whether to block Russia's planned auction of Yukos's main production arm, Yuganskneftegas, according to news reports.", "In a bid to halt the forced sale, Yukos filed for bankruptcy protection in the US.", "The Russian firm is due to be auctioned off on December 19 to help pay a huge tax bill sent to Yukos.", "This auction has led to widespread protests in Russia as lawyers and shareholders argue over who should gain from the deal.", "The auction, which could see Russian authorities seize control of Yukos's assets, has been met with resistance as Yukos claims that it needs to protect its shareholders' rights.", "In response, lawyers for the Russian government have suggested they will enter into arbitration to decide on whether Yukos should be protected from taxes.", "This legal battle is seen by many as a political stunt to gain support from Russia’s new ruling elite."], "phi:2.7b": [" Yukos has filed for bankruptcy protection in the US to prevent a forced sale of its main production arm.", "The company's assets are being auctioned off in a tax bill to pay Russian authorities $27 billion.", "Lawyers are unsure of the outcome of the case, as Yukos is based in Russia but has no significant US assets."], "orca-mini:3b": [" Yukos has asked the US bankruptcy court to block the auction of its main production arm, Yuganskneftegas, on Thursday.", "The company is seeking damages from Russia's government over a \"campaign of illegal, discriminatory and disproportionate\" tax claims.", "The opening bid for the unit is $8bn, less than half its estimated value.", "Analysts believe that if Yuganskneftegas is auctioned off, it is likely to be bought up by a government-backed firm like Gazprom, effectively bringing a large chunk of Russia's lucrative oil and gas industry back under state control."], "hermes3:3b": ["US court to decide Yukos auction blockage"], "stablelm-zephyr:3b": ["US bankruptcy court to decide on Yukos' bid for refuge in US\nYukos seeks protection from Russian tax auction\nRussian prosecutors force sale of Yuganskneftegas to pay £14bn back tax bill owed by Yukos\nYukos files for bankruptcy protection in US to preserve rights of shareholders, employees and customers\nYukos claims damages against Russian government over \"campaign of illegal, discriminatory and disproportionate\" tax claims\nAnalysts believe state-backed firm, Gazprom, likely to acquire production unit if it goes up for auction"], "chatgpt-4o-latest": ["Yukos has sought US bankruptcy protection to prevent Russia's auction of its key production unit, Yuganskneftegas, scheduled for December 19 to cover a $27 billion tax bill.", "A US court will decide on Thursday whether to block the sale.", "Yukos argues the forced auction is illegal and politically motivated, aimed at punishing its former CEO, Mikhail Khodorkovsky, who funded opposition groups and is jailed on fraud charges.", "The company also seeks damages from Russia, claiming discriminatory tax actions.", "Analysts expect the auction to benefit state-backed firms like Gazprom, reinforcing government control over Russia’s oil and gas sector."], "stablelm2:1.6b": ["The US will rule on a Yukos bankruptcy court case concerning the forced sale of its main production arm, as Russia auctions off Yuganskneftegas to pay a huge tax bill owed by Yukos.", "The firm filed for bankruptcy protection in the US, citing the forced sale as a last resort to preserve shareholder rights.", "Lawyers are uncertain about the outcome due to no significant US assets and the company being based in Russia.", "Russian prosecutors are forcing the sale of Yuganskneftegas to pay back tax claims that they claim is owed by Yukos.", "Yukos sought Chapter 15 bankruptcy protection, allowing it to continue trading while restructing its finances.", "The group also claimed damages from the Russian government and requested arbitration for claims of billions in damages over a \"campaign of illegal, discriminatory, and disproportionate\" tax claims."], "granite3.1-dense:2b": ["US bankruptcy court will decide on December 19 whether to block Russia's planned auction of Yukos' principal production arm, Yuganskneftegas, due to a $27bn (£14bn) tax debt claimed by Russian prosecutors.", "Yukos filed for US bankruptcy as a last resort to safeguard shareholder, employee, and customer rights, seeking Chapter 11 protection and potential damages against the Russian government.", "The company argues that the forced auction is illegal and will cause immediate, irreparable harm, with estimates suggesting Yuganskneftegas is worth around $20bn.", "Commentators speculate that the Russian government's aggressive pursuit of Yukos is politically motivated, possibly in response to former CEO Mikhail Khodorkovsky's liberal ambitions and subsequent imprisonment on fraud charges.", "If sold, Yuganskneftegas is expected to be purchased by a state-backed firm like Gazprom, potentially reintegrating significant Russian oil and gas assets into government control."]}