{"raw_text": "Libya takes $1bn in unfrozen funds\n \n Libya has withdrawn $1bn in assets from the US, assets which had previously been frozen for almost 20 years, the Libyan central bank has said.\n \n The move came after the US lifted a trade ban to reward Tripoli for giving up weapons of mass destruction and vowing to compensate Lockerbie victims. The original size of Libya's funds was $400m, the central bank told Reuters. However, the withdrawal did not mean that Libya had cut its ties with the US, he added.\n \n \"We are in the process of opening accounts in banks in the United States,\" the central bank's vice president Farhat Omar Ben Gadaravice said. The previously frozen assets had been invested in various countries and are believed to have included equity holdings in banks. The US ban on trade and economic activity with Tripoli - imposed by then president Ronald Regan in 1986 after a series of what the US deemed terrorist acts, including the 1988 Lockerbie air crash - was suspended in April. Bankers from the two country's had been working on how to unfreeze Libya's assets.\n", "llama3.2:1b": ["Libya has withdrawn $1bn in frozen US funds and invested them in banks in the US, which were previously under a trade ban due to Libya's withdrawal of arms from 1986."], "llama3.2:3b": ["Libya has withdrawn $1bn from frozen US assets, previously valued at $400m, following a US trade ban lifted due to Libya giving up weapons of mass destruction and compensating Lockerbie victims' families.", "The withdrawal allows Libya to open accounts in US banks while maintaining ties with the country."], "gemma2:2b": ["Libya has withdrawn $1 billion in frozen funds from the US after the trade ban imposed by then-president Ronald Reagan in 1986 was lifted.", "The move came following Libya’s commitment to give up weapons of mass destruction and compensate Lockerbie victims.", "Libyan central bank officials say they are opening accounts in US banks, and that this action does not signify the end of their relationship with the US."], "qwen2.5:0.5b": ["Libya withdrew $1 billion in US funds, which had previously been frozen since 1986 under a trade ban with the US."], "qwen2.5:1.5b": ["Libya has withdrawn $1 billion in frozen assets from the U.S., despite maintaining ties with Washington.", "The original amount was $400 million, but the withdrawal didn't end Libya-US economic relations.", "Bankers worked on freezing the assets and opened accounts for them.", "The ban was lifted by Reagan's successor."], "qwen2.5:3b": ["Libya has withdrawn $1bn in previously frozen assets from the US, following a trade ban lift due to Libya's disarmament and compensation for Lockerbie victims.", "The original amount was $400m, originally frozen for almost two decades.", "Libyan central bank vice president stated that this withdrawal does not signify severing ties with the US; instead, accounts are being opened in US banks using these funds, which were previously invested globally including in equity holdings in local banks.", "This process began after a trade ban imposed by then-US President Ronald Reagan was suspended in 1986 following terrorist acts, including the Lockerbie air crash."], "opencoder:1.5b": ["Libya has taken $1bn in unfrozen funds.", "The Libyan central bank has said that the US withdrawn $1bn of assets from Libya, those previously frozen for almost 20 years.", "The move was after a trading ban imposed by the US.", "During this period, funds invested various countries, including banks and other financial institutions.", "These assets included equity holdings in banks.", "The US ban on trade and economic activity with Tripoli - which was then President Ronald Regan's country - was suspended in April.", "Bankers from both countries had been working on how to unfreeze the assets."], "smollm:1.7b": ["Libya has withdrawn $1 billion from the US, which had previously been frozen for almost 20 years.", "The move came after the US lifted a trade ban to reward Tripoli for giving up weapons of mass destruction and vowing to compensate Lockerbie victims.", "The original size of Libya's funds was $400 million, but the central bank said that it has since reduced its assets by around 50%.", "The move did not mean that Libya had cut its ties with the US, as the Libyan central bank told Reuters.", "Instead, Libya is in the process of opening accounts in banks in the United States and other countries to which it previously had invested its funds.", "The US ban on trade and economic activity with Tripoli - imposed by then President Ronald Regan in 1986 after a series of what the US deemed terrorist acts, including the 1988 Lockerbie air crash - was suspended in April.", "The Libyan central bank said that it had worked closely with the US to find ways to unfreeze Libya's assets and that the process would take several months.", "The move is seen as a sign of improved relations between the two countries, which have been at odds over the issue since 2011."], "deepseek-r1:1.5b": ["Libya received $1 billion in unfrozen funds from the US, which had previously been frozen for over 20 years.", "The withdrawal came after the US lifted a trade ban to reward Tripoli for reducing weapons of mass destruction and vowing to compensate Lockerbie victims.", "The original funds were $400 million but did not imply a tie with the US.", "Libyan Central Bank's vice president noted they are in the process of opening accounts in the US."], "tinyllama:1.1b": ["A Libyan central banker has confirmed that $1bn of frozen funds were withdrawn by Libya, which had previously been frozen for almost 20 years.", "The US announced a trade ban in 1986 to punish Libya over the Lockerbie air disaster and other terrorist acts.", "This week, however, Libya withdrew $1bn from the US without cutting ties to Washington, as per the central bank's vice president Farhat Omar Ben Gaardaviase.", "The frozen assets were invested in various countries and had an estimated value of over $400m before being opened for investment in banks in the US.", "Libya has been struggling with its economic situation due to a lack of funds, but the withdrawal did not affect its trade ties with the US."], "tinydolphin:1.1b": [" In summary, Libya has discharged $1 billion of frozen US assets due to the lifting of trade restrictions and recompense for the Lockerbie victims.", "The central bank estimates that the withdrawal did not mean an end to ties with the US but rather opened new accounts in the United States."], "phi:2.7b": [" Libya has withdrawn $1bn in frozen funds which were previously invested in various countries and believed to have included equity holdings in banks.", "The US ban on trade and economic activity with Tripoli, imposed by former president Ronald Reagan in 1986 after a series of what the US deemed terrorist acts, including the 198"], "orca-mini:3b": [" Libya has withdrawn $1bn in assets from the US as part of a deal to end a trade ban imposed by the US in 1986 after a series of terrorist acts, including the Lockerbie air crash.", "The Libyan central bank said the move was in response to the lifting of the trade ban and did not mean that Libya had cut its ties with the US."], "hermes3:3b": ["Libya withdraws $1bn from frozen US funds, after 20 years."], "stablelm-zephyr:3b": ["Libya withdrew $1bn in frozen funds from the US, which were previously held at $400m, after the US lifted a trade ban in return for giving up weapons of mass destruction and promising compensation for Lockerbie victims.", "The previously invested funds included equity holdings in banks and the withdrawal did not indicate a break in Libya's relationship with the US.", "Libyan central bank vice president Farhat Omar Ben Gadaravice said they were opening accounts in US banks.", "The trade ban imposed by then President Ronald Reagan in 1986 was suspended in April, leading to discussions between the two countries on unfreezing assets."], "chatgpt-4o-latest": ["Libya has withdrawn $1 billion in previously frozen US assets after the US lifted a trade ban as a reward for Libya abandoning weapons of mass destruction and agreeing to compensate Lockerbie victims.", "The original frozen funds were $400 million, but investments increased their value.", "Libya's central bank emphasized that this withdrawal does not signal a break in ties with the US, as they are opening accounts in American banks.", "The assets had been invested globally, including in bank equities.", "The US trade ban, imposed in 1986 after alleged terrorist acts, including the Lockerbie bombing, was suspended in April, and bankers from both countries worked on unfreezing the funds."], "stablelm2:1.6b": ["Libya withdraws $1bn from previously frozen US assets; no change in relations between countries.", "The funds were originally part of Libya's $100bn economy, and upon completion of disarmament commitments and compensation for victims related to the 1988 Lockerbie bombing, the US lifted a trade ban on Tripoli.", "However, the withdrawal does not imply that Libya has cut its ties with the US, as they are still opening accounts in American banks.", "The previously frozen assets included equity holdings in banks and equities."], "granite3.1-dense:2b": ["Libya has recovered approximately $1bn in previously frozen funds from the US, following the lifting of a trade ban in April 2023 due to Libya's commitment to surrender weapons of mass destruction and compensate Lockerbie victims.", "The original sum was $400m.", "These assets, initially invested across various countries including equity holdings in banks, were held under a 1986 US ban imposed by President Ronald Regan for alleged terrorist activities, most notably the 1988 Lockerbie air disaster.", "The central bank aims to reopen accounts in US banks with this newly obtained money, signifying no severance of ties between Libya and the United States."]}