{"raw_text": "Cairn shares slump on oil setback\n \n Shares in Cairn Energy, a UK oil firm, have closed down 18% after a disappointing drilling update and a warning over possible tax demands.\n \n The company said tests had shown no significant finds in one of its Indian oil fields, but was upbeat about the potential of other areas. It also said the Indian government had told it to pay a production tax, for which Cairn argues it is not liable. Cairn's shares have jumped by almost 400% this year. Investors had piled into Cairn after the company announced significant oil finds in India this year. Chief executive Bill Gammell said on Friday he was \"disappointed\" with exploration in the so-called N-C extension area in Rajasthan. Investors had held high hopes of major oil finds in this area. But Cairn said estimates had been revised in what was a \"significant downgrade of the initial expectation\".\n \n Cairn also said that the government believed the company was liable to pay taxes under its production-sharing contract. The company said the rate would be about 900 rupees ($20.40; £10.50) per tonne, or seven barrels, of oil. A spokesman for the firm said that the tax would wipe 5% of the field's current value.\n \n \"Cairn refutes the government's position,\" Mr Gammell said. He insisted that the contract made it clear that the tax should be shouldered by the licensee - India's state-run Oil & Natural Gas Corp (ONGC) - and not the contractor. \"We have a pretty strong legal case here,\" he added, saying it would only become an issue once the firm started production. Investors took a dim view of the statements though. The shares closed down 247p, or 18%, at 1115 pence. \"I think people were slightly over-ambitious for how quickly Cairn would be able to develop and potentially offload these reserves,\" said analyst Jason Kenney at ING.\n \n The disappointments overshadowed increased production targets for Cairn's existing oilfields. The company raised targets for its Mangala and Aishwariya fields in India from 60,000 barrels a day to between 80,000 and 100,000 barrels a day. Its Mangala field, thought to contain a billion barrels, is its biggest find to date. \"These two fields will provide the core of the future developments in Rajasthan,\" Mr Gammell said. Cairn added that it would be appraising another field early next year. Mr Gammell set up the company in the 1980s and has successfully switched its focus to South Asia from interests in the US and Europe. Cairn, which also operates in Nepal and Bangladesh, was catapulted into the FTSE 100 index of leading UK shares earlier this year after the sharp rise in its share price.\n", "llama3.2:1b": ["Cairn Energy's shares have dropped 18% after a disappointing drilling update and warning over tax demands.", "The company has estimated no significant oil finds in one Indian field, but is upbeat about other areas.", "It also warned that it may have to pay taxes on production, which could affect its ability to sell reserves quickly.", "Investors had previously piled into Cairn's shares after announcing significant oil finds in India this year.", "However, the company now says it is not liable for paying these taxes.", "The share price has jumped by almost 400% this year.", "Cairn CEO Bill Gammell has said that he was \"disappointed\" with exploration in a specific area and that investors had held high hopes of major oil finds there."], "llama3.2:3b": ["Cairn Energy's shares fell 18% due to a disappointing drilling update and warnings over tax demands from India.", "Tests showed no significant oil finds in one field, but other areas show promise.", "The company disputes government claims it owes production taxes under a contract.", "Cairn raised production targets for its existing fields, with Mangala expected to produce between 80,000-100,000 barrels per day."], "gemma2:2b": ["Cairn Energy's shares dropped 18% after disappointing oil drilling results and a tax dispute with the Indian government.", "While no major finds were made in one area, Cairn is optimistic about other areas.", "The company argues it should not pay taxes under its production-sharing contract.", "Investors reacted negatively to these developments, leading to a significant decline in share price."], "qwen2.5:0.5b": ["Cairn Energy's shares have fallen more than 40% as oil discoveries were seen as a threat to their business.", "The company said tests showed no significant finds in one of India’s oil fields, but was still optimistic about other areas where drilling had been successful.", "Cairn has reported an increase in production targets for its existing oilfields and is working on developing new reserves.", "Investors have piled into the company after the company announced major oil discoveries last year."], "qwen2.5:1.5b": ["Cairn Energy's stock has fallen 18% following disappointing drilling results and a tax liability warning from India, despite expectations for oil finds in India previously."], "qwen2.5:3b": ["Cairn Energy's shares plummeted by 18% following a disappointing drilling update and concerns about potential tax demands from the Indian government.", "The company announced no significant oil finds in one of its fields, causing estimates to be significantly revised downwards.", "Investors had earlier been optimistic due to significant recent oil discoveries.", "Cairn disputed the government's claim that it should pay production taxes under their production-sharing contract, arguing instead that the State-run Oil & Natural Gas Corp (ONGC) should bear this cost.", "Despite increased production targets for existing fields and plans to explore another field in 2015, investors remained skeptical due to the disappointment with exploration results."], "opencoder:1.5b": ["Cairn shares slump on oil setback\n\nShares in Cairn Energy have closed down 18% after a disappointing drilling update and a warning over possible tax demands.", "The company was upbeat about the potential of other areas, but it said the Indian government told it to pay a production tax.", "The company's estimate is expected to wipe 5% of the field's current value, which Cairn agrees would be a significant amount.", "Cairn’s shares jumped by almost 400% this year.", "Investors had piled into Cairn after the company announced significant oil finds in India this year.", "Chief executive Bill Gammell said he was \"disappointed\" with exploration in the so-called N-C extension area in Rajasthan.", "Investors held high hopes of major oil finds in this area, but Cairn's estimate had been revised in what was a \"significant downgrade of the initial expectation.\"", "Cairn also asserted that the government believed the company was liable to pay taxes under its production-sharing contract.", "The company said the rate would be about 900 rupees per tonne, or seven barrels, of oil.", "The firm's spokesman confirmed that the tax would wipe out 5% of the field's value.", "\"It's a pretty strong legal case here,\" Mr Gammell added, saying it would only become an issue once the firm started production.", "Investors took a dim view of the statements though.", "Cairn refuted its position and said it was not in line with its contract.", "Cairn’s shares closed down 247p, or 18%, at around 11,500 pence.", "The disappointments overshadowed increased production targets for Cairn's existing oilfields.", "The company raised targets for its Mangala and Aishwariya fields from 60,000 barrels a day to between 80,000 and 100,000 barrels a day.", "Its Mangala field is the biggest find to date.", "The company also said it would be appraising another field earlier next year.", "Cairn added that it would be aiming for a future where India can offer its reserves in India's state-run Oil & Natural Gas Corporation (ONGC) - an unsettling claim from the government."], "smollm:1.7b": ["The summary should contain only the main ideas and key details from the original text.", "The tone should be neutral and objective, without any emotional or persuasive language.", "The summary should preserve the exact wording and sentence structure of the original text, including punctuation and capitalization."], "deepseek-r1:1.5b": ["Cairn Energy shares have dropped by 18% due to disappointing drilling results and a warning about potential tax demands.", "The company acknowledged one Indian oil field didn't yield significant findings but highlighted others' promising potential.", "The Indian government was expected to pay production taxes under its contract but deemed the liability unclear.", "Share prices rose over 400%, driven by strong exploration in the N-C extension area.", "Investors were hopeful but now view government's tax position cautiously.", "Gammell criticized the government, emphasizing legal claims about tax-sharing.", "Production targets for existing fields like Mangala and Aishwariya have been raised.", "The company is now part of the FTSE 100 after a sharp rise in share price."], "tinyllama:1.1b": ["In a disappointing update on their oil discoveries in India, Cairn Energy announced that it has closed down a large portion of its exploration efforts as it struggles to pay tax demands from the Indian government.", "The slump in Cairn's shares is due to its failure to properly address the production-sharing contract with Oil & Natural Gas Corp (ONGC) and its potential liability for oil finds in the N-C extension area, as per recent reports.", "Meanwhile, its flagship Mangala field in India has been revised downward from 60,000 to 80,000 barrels a day, and production targets have increased by over 25% for existing fields.", "Cairn's CEO, Bill Gammerl, stated that the company was \"disappointed\" with exploration results in the area and expressed doubts about the Indian government's ability to pay production taxes.", "The stock has fallen by almost 400% in a year due to investors' disappointment over possible liabilities and its slumping share price."], "tinydolphin:1.1b": [" Cairn shares slumped by over 18% after a disappointing drilling update and a warning from the Indian government about possible tax demands.", "The company's shares closed down 247p, or 18%, at 1115 pence.", "Investors had been bullish on Cairn following its recent success with discovering oil in India, but the setback is a significant blow to the company's share price.", "The company has raised production targets for existing fields as well as plans for new developments in Rajasthan.", "The shares have jumped by almost 400% this year.", "Bill Gammell, the CEO of Cairn Energy, was disappointed with the latest results and said that his team had been working hard to find solutions for any potential tax demands.", "He assured investors that the company's strategy is sound and remains a strong competitor in the global oil industry."], "phi:2.7b": [" Shares in Cairn Energy have fallen 18% following disappointing drilling updates and a warning over possible tax demands from the Indian government.", "The company said that tests had shown no significant oil finds in one of its Indian fields, but was still optimistic about potential discoveries in other areas.", "However, investors were disappointed with the news, with the shares dropping by more than 400% this year after the company's initial announcement of major oil finds in India.", "Cairn has also faced tax demands from the government under their production-sharing contract, and has maintained that it is not liable for these charges.", "While Mr Gammell insisted that the legal case was strong, investors responded negatively to the news, with the company's shares falling by more than"], "orca-mini:3b": [" Cairn Energy's shares closed down 247p, or 18%, at 1115 pence after the company shared a disappointing drilling update and received a tax demand from the Indian government.", "The company said tests had shown no significant finds in one of its Indian oil fields but was upbeat about other areas.", "However, the government believed the company was liable to pay taxes under its production-sharing contract, and the company argued that the contract made it clear that the tax should be shouldered by the licensee - India's state-run Oil & Natural Gas Corp (ONGC) - and not the contractor.", "Investors were disappointed with the statements, and the shares closed down 247p, or 18%.", "Cairn raised production targets for its existing oilfields in India, but its Mangala and Aishwariya fields are its biggest finds to date.", "The company will appraise another field early next year."], "hermes3:3b": ["Cairn Energy shares drop 18% after negative Indian oil field update and tax warning."], "stablelm-zephyr:3b": ["Cairn Energy's shares fell 18% following a disappointing drilling update and a potential tax demand from the Indian government.", "The UK oil firm revealed no significant finds in one of its Indian oil fields but expressed optimism about other areas.", "Cairn argued that it should not be taxed as per the production-sharing contract, as the rate would be \"about 900 rupees per tonne,\" wiping 5% of the field's value.", "The company raised its production targets for existing oilfields in India from 60,000 barrels a day to 80,000-100,000 barrels a day, with its largest find being the Mangala field, containing a billion barrels."], "chatgpt-4o-latest": ["Cairn Energy shares fell 18% after disappointing drilling results and a potential tax dispute with the Indian government.", "The company reported no significant oil finds in the N-C extension area of Rajasthan, revising estimates downward, though it remained optimistic about other fields.", "Additionally, the Indian government claimed Cairn must pay a production tax, which the company disputes, arguing that India's state-run ONGC should bear the cost.", "Despite raising production targets for its Mangala and Aishwariya fields, investor confidence waned, leading to the share price drop.", "Cairn, which has shifted focus to South Asia, saw its stock surge earlier in the year after major oil discoveries in India."], "stablelm2:1.6b": ["UK oil firm Cairn's shares dropped by 5% due to disappointing drilling results and a potential tax demand from the Indian government.", "The company announced no significant finds in one of their Indian oil fields, but was optimistic about other areas.", "They also said the Indian government wants them to pay a production tax, which they argue is not liable for.", "Cairn's shares had jumped by almost 10% this year on expectations of major oil finds in India.", "Analysts are warning that investors may have over-ambitiously anticipated how quickly Cairn would be able CaiRn to develop and potentially offload these reserves."], "granite3.1-dense:2b": ["Cairn Energy's shares dropped by 18% following a disappointing drilling update and a tax dispute with the Indian government over potential production tax liabilities.", "Despite minor oil finds in some areas, tests revealed no significant reserves in the N-C extension field in Rajasthan, a \"significant downgrade\" of initial expectations.", "The company believes it should not be liable for the tax under its production-sharing contract with state-run ONGC.", "Chief Executive Bill Gammell asserted a strong legal case, but investors remain skeptical.", "This setback overshadows Cairn's increased production targets for existing Indian fields (Mangala and Aishwariya) from 60,000 to 80-100,000 barrels a day, primarily driven by the Mangala field's estimated one billion barrel reserves.", "Cairn plans to appraise another field next year.", "The company's founder has transformed it into a significant player in South Asia after U.S. and European interests."]}