{"raw_text": "French boss to leave EADS\n \n The French co-head of European defence and aerospace group EADS Philippe Camus is to leave his post.\n \n Mr Camus said in a statement that he has accepted the invitation to return full-time to the Lagardere group, which owns 30% of EADS. \"I will give up my role as soon as the board of directors asks me to do so,\" he said. Airbus head Noel Forgeard is now set to replace Mr Camus, bringing the company's power struggle to an end. Fighting between Mr Camus and Mr Forgeard has hit the headlines in France and analysts feared that this fighting could destabilise the defence and aerospace group. French finance minister Herve Gaymard is on record as saying that he \"deplored\" the infighting at the company. The company should now be able put this dispute behind it, with the departure of Mr Camus and with the clear support given to Mr Forgeard by the Lagardere group, the main French shareholder of EADS. The other main shareholders of EADS are the French government (15%) , who also support Mr Forgeard, and Germany's DaimlerChrysler (30%). Rainer Hertrich, the German co-head of EADS will also step down when his contract expires next year.\n \n Mr Camus recently came under pressure as it became clear that the A380 superjumbo was running over budget. EADS - Airbus' majority owner - admitted earlier this week that the project was running 1.45bn euros (£1bn; $1.9bn) over budget. But Mr Forgeard has denied this, telling French media that there is no current overrun in the budget. \"But for the sake of transparency, we told our shareholders last week that if we look at the forecast for total costs of the project up to 2010, there is a risk that we will go over by around 10%, which is about 1bn euros (£686m; $1.32bn),\" he told France's LCI Television. Due to enter service in 2006, the A380 will replace the Boeing 747 jumbo as the world's biggest passenger aircraft.\n", "llama3.2:1b": ["French co-head Philippe Camus of EADS is leaving his post to return full-time to Lagardere, a French company that owns 30% of EADS.", "Airbus head Noel Forgeard will replace him, bringing an end to power struggles within the group.", "The departure has sparked concerns about the defense and aerospace company's ability to manage costs."], "llama3.2:3b": ["French co-head Philippe Camus to leave EADS due to French group Lagardere's request, replacing Noel Forgeard who was previously seen as being at odds with Camus over budget concerns related to the A380 superjumbo project."], "gemma2:2b": ["Philippe Camus is leaving his role as co-head of EADS and returning to Lagardere group, which owns 30% of EADS.", "Noel Forgeard is replacing him as the new co-head.", "The power struggle between Camus and Forgeard caused concerns about EADS' stability.", "The company will now move forward without this conflict.", "The A380 superjumbo project is running over budget but there are no current overrun issues, according to Airbus."], "qwen2.5:0.5b": ["French EADS boss Philippe Camus is set to step down when Lagardere group president Noel Forgeard becomes chief executive.", "The company faces a financial crisis and may have to declare bankruptcy if there are any further delays in the project, which was originally due for completion by 2013."], "qwen2.5:1.5b": ["French boss Philippe Camus leaving EADS, replaced by Noel Forgeard after power struggle ends; Airbus is $1bn over budget for A380 superjumbo project."], "qwen2.5:3b": ["French co-head of EADS Philippe Camus is leaving his post to return full-time to Lagardere group, which owns 30% of EADS.", "Mr Camus said he will give up his role at the request of board.", "Noel Forgeard, Airbus head, will now replace him after a power struggle between them hit headlines and analysts feared it could destabilize EADS.", "The company should now be able to put this dispute behind it with Camus' departure and support from Lagardere group.", "Rainer Hertrich, the German co-head of EADS, is also stepping down next year.", "Mr Camus recently faced criticism due to A380 superjumbo project over budget issues, while Forgeard denied any current overrun in the budget.", "The A380 was planned for service in 2006 and would replace Boeing 747 as world's largest passenger aircraft."], "opencoder:1.5b": ["The French boss to leave EADS.", "Mr Camus said in a statement that he has accepted the invitation to return full-time to the Lagardere group, which owns 30% of EADS.", "\"I will give up my role as soon as the board of directors asks me to do so,\" he said.", "Airbus head Noel Forgeard is now set to replace Mr Camus, bringing the company's power struggle to an end.", "The company's power struggle has hit the headlines in France and analysts fear that this fighting could destabilise the defence and aerospace group.", "French finance minister Herve Gaymard deplored the infighting at the company.", "The company should now be able put this dispute behind it, with the departure of Mr Camus and with the clear support given to Mr Forgeard by the Lagardere group."], "smollm:1.7b": ["The French boss to leave EADS is to accept an invitation to return full-time to the Lagardere group, which owns 30% of EADS.", "The company has decided that it will no longer have a French boss and will instead be led by Mr Forgeard.", "Airbus head Noel Forgeard is now set to replace Mr Camus as the company's leader.", "Airbus' CEO Jean-Pierre Rochard said in a statement that he had accepted the invitation to return full-time to the Lagardere group, which owns 30% of EADS.", "\"I will give up my role as soon as the board of directors asks me to do so,\" he said.", "Airbus head Noel Forgeard is now set to replace Mr Camus as the company's leader.", "French finance minister Herve Gaymard is on record as saying that he \"deplored\" the infighting at the company.", "The company should now be able put this dispute behind it, with the departure of Mr Camus and with the clear support given to Mr Forgeard by the Lagardere group, the main French shareholder of EADS.", "The other main shareholders of EADS are the German government (15%) , who also support Mr Forgeard.", "Rainer Hertrich, the German co-head of EADS will also step down when his contract expires next year."], "deepseek-r1:1.5b": ["The French boss Philippe Camus is leaving his post as EADS co-head of the European defence and aerospace group, with Noel Forgeard replacing him to take over.", "The A380 superjumbo project faced a $1.45 billion budget overrun, but Forgeard denied it, stating transparency regarding potential overruns.", "Lagardere owns 30% of EADS, and other shareholders support both Camus and Forgeard, with DaimlerChrysler holding two-thirds.", "Hertrich, the German co-head, will also leave his role next year upon contract expiration."], "tinyllama:1.1b": ["The French company Airbus has announced that its co-head Philippe Camus will leave his post at EADS, formerly known as European Aeronautic Defence and Space Company, by October, following the departure of two other executives.", "The departure of Mr Camus, along with Lagarde Re Group co-head Noel Forgeard, was seen as a watershed moment for the power struggle within Airbus's power structure.", "After years of infighting, the company should now be able to put this dispute behind it, with support from its main shareholders including the French government and DaimlerChrysler.", "However, Rainer Hertrich, co-head of EADS, will also step down when his contract expires next year."], "tinydolphin:1.1b": [" The French boss of EADS has left his position, following an investigation into a project that exceeded its budget by over £1bn (approximately $1.9bn).", "In addition to this, Airbus, the group's major shareholder, admitted that the A380 superjumbo was running over budget at the time of the disclosure.", "The company has faced several scandals in recent years, with some analysts fearing it could face more trouble if these issues are not resolved."], "phi:2.7b": [" French co-head of EADS Philippe Camus is leaving his post to return full-time to Lagardere group, which owns 30% of EADS.", "The company's power struggle with Airbus head Noel Forgeard has ended with Mr. Camus' departure and the support given by the Lagardere group and French government as well as DaimlerChrysler, the other major shareholder of EADS.", "The A380 superjumbo project is running over budget but Mr. Forgeford denied this and said they are currently on track to meet their cost estimates."], "orca-mini:3b": [" French co-head of EADS Philippe Camus is leaving his position due to disagreements with other top executives at the company.", "Noel Forgeard, who was previously the head of Airbus, is now set to take over as the new CEO of EADS.", "The departure of Mr Camus came amidst reports that the A380 superjumbo project was running over budget, but both he and his replacement deny this claim."], "hermes3:3b": ["French EADS co-CEO Philippe Camus to leave, replacing by Noel Forgeard after power struggle end.", "Camus to return full-time to Lagardere group."], "stablelm-zephyr:3b": ["Philippe Camus, the French co-head of EADS, is set to leave his post and return full-time to the Lagardere group, which owns 30% of EADS.", "Airbus head Noel Forgeard will replace him, ending the power struggle within the company.", "The departure of Camus and the support for Forgeard by the Lagardere group should allow EADS to move past internal conflicts.", "Rainer Hertrich, the German co-head of EADS, will also step down when his contract expires next year.", "Earlier this week, EADS admitted that the A380 superjumbo project was running over budget; however, Forgeard denied this claim, stating there is no current overrun in the budget."], "chatgpt-4o-latest": ["Philippe Camus, the French co-head of EADS, is leaving his position to return full-time to the Lagardere group, which owns 30% of EADS.", "Airbus head Noel Forgeard will replace him, ending a power struggle that had raised concerns about the company's stability.", "French finance minister Herve Gaymard criticized the infighting, but with Camus' departure and strong support for Forgeard from Lagardere and the French government (which owns 15% of EADS), the dispute is expected to be resolved.", "German co-head Rainer Hertrich will also step down when his contract expires next year.", "Camus faced pressure over budget overruns on the A380 superjumbo project, with EADS admitting a 1.45bn euro overrun, though Forgeard downplayed the issue, stating that projected costs up to 2010 could exceed the budget by 10%.", "The A380, set to enter service in 2006, will become the world's largest passenger aircraft, surpassing the Boeing 747."], "stablelm2:1.6b": ["French boss Philippe Camus is leaving his position at EADS after accepting an invitation from Lagardere group to return full-time to its ownership stake.", "Airbus head Noel Forgeard is set to replace Camus, ending the power struggle between them in France.", "Camus's departure and the support given by the Lagardere group will likely stabilize the defense and aerospace company.", "The A380 project, owned by EADS-Airbus, admitted earlier this week that the project was running 1.5 billion euros ($2 billion) over budget, but Forgeard has denied any current overrun in the budget."], "granite3.1-dense:2b": ["French co-head of EADS Philippe Camus is resigning to return full-time to the Lagardere group, which owns 30% of EADS.", "This decision ends internal power struggles between Camus and Airbus head Noel Forgeard, who will now take over as CEO.", "The French government (15%) and Germany's DaimlerChrysler (30%) support Forgeard.", "Camus' departure follows revelations about the A380 superjumbo project being 1.45 billion euros over budget, though Forgeard denies this, stating a 10% risk of exceeding total costs by around 1 billion euros by 2010.", "The A380 is set to replace the Boeing 747 as the world's largest passenger aircraft, entering service in 2006."]}