{"raw_text": "Strong quarterly growth for Nike\n \n Nike has reported its best second-quarter earnings, helped by strong demand for its athletic shoes and Converse sneakers.\n \n The global sports giant said it posted a profit of $261.9m (£135.6m), for the three months to 30 November, up from $179.1m in the same period last year. Revenues increased 11% to $3.1bn, from $2.8bn for the same period in 2003. Nike, whose products are endorsed by Tiger Woods among other sports stars, said \"demand continues to grow\". The results came after a strong first quarter of the year for the firm based in Beaverton, Oregon.\n \n Philip Knight, chairman and chief executive, said: \"Nike's second-quarter revenues and earnings per share reached all-time high levels as a result of solid performance across our global portfolio. \"Our businesses in the United States and emerging markets such as China, Russia and Turkey, combined with favourable European exchange rates, helped drive much of this growth.\" He added: \"With the first half of our fiscal year in the books, we remain confident that our business strategy and consistent execution will allow us to deliver on our goals of healthy, profitable growth.\" The firm reported worldwide futures orders for athletic footwear and gear, scheduled for delivery from December 2004 to April 2005, of $4.9bn. That is 9.1% higher than such orders reported for the same period last year.\n", "llama3.2:1b": ["Nike reported strong quarterly earnings, with profits up 30% at $261.9m and revenues up 11% at $3.1bn.", "Demand continues to grow across its global portfolio.", "The company's businesses in the US and emerging markets such as China, Russia, and Turkey are driving growth."], "llama3.2:3b": ["Nike reported its best second-quarter earnings, with a profit of $261.9m and revenues increasing 11% to $3.1bn, driven by strong demand for athletic shoes and Converse sneakers.", "The company cited solid performance in the US and emerging markets, favorable exchange rates, and future orders of $4.9bn."], "gemma2:2b": ["Nike's second-quarter earnings reached all-time highs, with a profit of $261.9 million and revenue increase of 11% to $3.1 billion.", "Strong demand for athletic shoes and Converse sneakers fueled this growth, particularly in the US and emerging markets like China.", "Nike expects continued strong performance based on its current business strategy and execution."], "qwen2.5:0.5b": ["Nike reports strong second-quarter earnings with strong demand for its athletic shoes and Converse sneakers.", "The firm's global products are endorsed by Tiger Woods among other sports stars, as it said \"demand continues to grow.\"", "The firm reported strong worldwide futures orders for athletic footwear and gear."], "qwen2.5:1.5b": ["Nike reports its best second-quarter earnings, with strong demand leading to a 11% revenue increase from $2.8 billion in 2003 to $3.1 billion in 2004, partly due to higher revenues from emerging markets and improved exchange rates."], "qwen2.5:3b": ["Nike has reported its best second-quarter earnings with a profit of $261.9m and revenues increasing 11% to $3.1bn from $2.8bn, up from $179.1m and $2.8bn respectively in the previous year.", "The company's strong demand for athletic shoes and Converse sneakers is attributed to endorsements by sports stars like Tiger Woods.", "CEO Philip Knight highlights solid performance across global portfolios in US and emerging markets such as China, Russia and Turkey, along with favourable European exchange rates.", "Nike projects healthy, profitable growth ahead based on its strategy execution.", "The company also reports $4.9bn worldwide futures orders for athletic footwear and gear scheduled for delivery from December 2004 to April 2005, a 9.1% increase year-over-year."], "opencoder:1.5b": ["Nike has reported strong second-quarter earnings that were driven by strong demand for its athletic shoes and sneakers.", "The global sports giant reported a profit of approximately $261.9 million (up from $135.6 million in the same period last year).", "Revenues increased 11% to approximately $3.1 billion (from $2.8 billion for the same period in 2003).", "It has said \"demand continues to grow\" after strong first quarter of the year based in Beaverton, Oregon.", "After a strong first quarter of the year for the firm, Philip Knight, chairman and chief executive of Nike reported confident growth based on solid performance across his global portfolio."], "smollm:1.7b": ["Nike has reported strong quarterly growth for its business, helped by strong demand for its athletic shoes and Converse sneakers.", "The global sports giant said it posted a profit of $261.9 million (£135.6m) in the three months to 30 November, up from $179.1 million in the same period last year.", "Revenues increased 11% to $3.1bn, from $2.8bn for the same period in 2003.", "Nike, whose products are endorsed by Tiger Woods among other sports stars, said \"demand continues to grow\".", "The results came after a strong first quarter of the year for the firm based in Beaverton, Oregon."], "deepseek-r1:1.5b": ["Nike reported strong quarterly growth with a profit of €261.9m (USD $275.0m) for the second quarter compared to last year's €179.1m.", "Revenues increased by 11% to USD $3.1 billion, up from USD $2.8 billion in 2003.", "Demand continues to grow, highlighted by Tiger Woods' endorsement.", "CEO Philip Knight noted sustained growth across the US and emerging markets with favorable European exchange rates aiding the success.", "Worldwide futures orders for athletic footwear rose by 9.1% since last year."], "tinyllama:1.1b": ["Nike has reported strong quarterly growth in profits and sales, driven by demand for its athletic shoes and Converse snakeskin products.", "The global sports giant recorded a profit of $261.9m ($135.6m) for the three months to 30 November, up from $179.1m in the same period last year.", "Its sales increased by 11% to $3.1bn ($2.8bn), and its net income reached a record high of $401.7m ($235.6m).", "The company credited favorable performance across all three segments, particularly in emerging market regions such as China, Russia, and Turkey.", "Philip Knight, chairman and CEO, noted that the firm's consistent execution was allowing it to deliver on its goals for healthy profit growth.", "Nike reported worldwide future orders worth $4.9bn ($3.5bn) for athletic footwear and gear scheduled for delivery from December 2004 to April 2005, up by 9.1% year-over-year."], "tinydolphin:1.1b": [" Nike reported record second-quarter earnings, helped by strong demand for its athletic shoes and Converse sneakers.", "The global sports giant's profit increased by $261.9 million, or $135.6 million, in the three months ending November 30, 2004, compared to a record profit of $179.1 million recorded in the same period last year.", "Revenues for the quarter were up 11% at $3.1 billion, from $2.8 billion.", "Nike's success can be attributed to its strategies and commitment to delivering exceptional products to their endorsers, such as Tiger Woods, among others.", "The firm's performance for the first half of 2004 exceeded expectations, with worldwide futures orders for athletic footwear and gear scheduled for delivery from December 2004 to April 2005 reaching $4.9 billion, an increase of 9.1% over the same period last year."], "phi:2.7b": [" Nike posted its best second-quarter earnings with a profit of $261.9m (£135.6m), up from $179.1m in the same period last year, driven by strong demand for athletic shoes and Converse sneakers.", "The sports giant reported revenues of $3.1bn, an 11% increase on the"], "orca-mini:3b": [" Nike had its best quarterly earnings in recent years, thanks to strong sales of athletic shoes and sneakers.", "The company's revenues increased by 11% to $3.1 billion, while profits jumped to $261.9 million from $179.1 million.", "The firm's US and emerging markets such as China, Russia, and Turkey performed well.", "The company also attributed its growth to favourable exchange rates in Europe.", "Nike had worldwide orders for athletic footwear and gear scheduled for delivery between December 2004 and April 2005, which were $4.9 billion, up from the previous year's order of $4.1 billion."], "hermes3:3b": ["Nike reports best Q2 earnings, $261.9m profit ( $179.1m previous yr), 11% increase in revenues to $3.1bn."], "stablelm-zephyr:3b": ["Nike reported its best Q2 earnings, driven by strong demand for athletic shoes and Converse sneakers.", "Revenues increased 11% to $3.1bn, with emerging markets and favourable exchange rates contributing to growth.", "The company remains confident in its business strategy for healthy, profitable growth."], "chatgpt-4o-latest": ["Nike reported strong second-quarter earnings, with profits rising to $261.9 million from $179.1 million a year earlier, driven by high demand for athletic shoes and Converse sneakers.", "Revenues increased 11% to $3.1 billion.", "Chairman and CEO Philip Knight attributed the growth to strong performance in the U.S. and emerging markets like China, Russia, and Turkey, as well as favorable European exchange rates.", "Nike remains confident in its business strategy for continued profitable growth.", "Future orders for athletic footwear and gear, scheduled for delivery from December 2004 to April 2005, rose 9.1% to $4.9 billion."], "stablelm2:1.6b": ["Nike posted strong Q2 earnings with $3.1 billion in revenues, helped by demand for athletic shoes and Converse sneakers.", "The company's profit increased from $1 million to $9.9 million for the three months ending November, while revenue grew by 8%.", "Nike, whose products are endorsed by many athletes, saw growth across its global portfolio.", "CEO Philip Knight said \"demand continues to grow\" and that favorable exchange rates contributed to this growth.", "In Q4, worldwide futures orders for athletic footwear and gear were $4.9 billion, an increase of 9.1% compared to the same period last year."], "granite3.1-dense:2b": ["Nike's second-quarter earnings surged to $261.9m, a significant increase from $179.1m in the prior year, due to robust demand for athletic shoes and Converse sneakers.", "The company's global revenues grew by 11% to $3.1bn, exceeding the $2.8bn reported in Q4 2003.", "Nike's chairman and CEO, Philip Knight, attributed this success to solid performance across various regions, including the US, emerging markets like China, Russia, and Turkey, and favorable European exchange rates.", "Additionally, worldwide futures orders for athletic footwear and gear scheduled for delivery between December 2004 and April 2005 were reported at $4.9bn, a 9.1% rise from the same period last year.", "Knight expressed confidence in Nike's business strategy and execution to maintain healthy, profitable growth throughout the first half of its fiscal year."]}