{"raw_text": "Yukos unit fetches $9bn at auction\n \n A little-known Russian company has bought the main production unit of oil giant Yukos at auction in Moscow.\n \n Baikal Finance Group outbid favourite Gazprom, the state-controlled gas monopoly, to buy Yuganskneftegas. Baikal paid 260.75bn roubles ($9.37bn: £4.8bn) for Yugansk - nowhere near the $27bn Russia says Yukos owes in taxes. Yukos reacted immediately by repeating its view that the auction was illegal in international and Russian law, and said Baikal had bought itself trouble.\n \n \"The company considers that the victor of today's auction has bought itself a serious $9bn headache,\" said Yukos spokesman Alexander Shadrin. He said the company would continue to make \"every lawful move\" to protect tens of thousands of shareholders in Yukos from \"this forcible and illegitimate removal of their property\". Meanwhile, Tim Osborne, head of Yukos main shareholders' group Menatep, said that Yukos may have to declare itself bankrupt, and that legal action would be taken, outside Russia, against the auction winners. Reports from Russia say Baikal has paid a deposit of nearly $1.7bn from a Sberbank (Savings Bank) account to the Russian Federal Property Fund, for Yugansk.\n \n The sale came despite a restraining order issued by a US court dealing with the firm's bankruptcy application for Chapter 11 protection. Yukos has always insisted the auction was state-sponsored theft but Russian authorities argued they were imposing the law, trying to recover billions in unpaid taxes. There were originally four registered bidders, and with its close ties to the Kremlin, state-backed gas monopoly Gazprom had been seen as favourite. But just two companies turned up for the auction, Gazprom and the unknown Baikal Finance Group, named after a large freshwater lake in Siberia. And, according to Tass news agency, Gazprom did not make a single bid, leaving the way open for Baikal, which paid above the auction start price of 246.75bn roubles.\n \n Mystery firm Baikal Finance Group is officially registered in the central Russian region of Tver, but many analysts believe it may be linked to Gazprom. Kaha Kiknavelidze, analyst at Troika Dialog, said: \"I think a decision that Yugansk should end up with Gazprom was taken a long time ago. So the main question was how to structure this transaction.\n \n \"I would not exclude that the structure of the deal has slightly changed and Gazprom now has a partner. \"I would also not exclude that Baikal will decline to pay in 14 days, that are given by law, and Gazprom is then recognised as the winner. This would give Gazprom an extra 14 days to accumulate the needed funds. \"Another surprise was that the winner paid a significant premium above the starting price.\" However, Gazprom has announced it is not linked to Baikal in any way. And Paul Collison, chief analyst at Brunswick UBS, said: \"I see no plausible explanation for the theory that Baikal was representing competing interests. \"Yugansk will most likely end up with Gazprom but could still end up with the government. There is still potential for surprises.\" Yugansk is at the heart of Yukos - pumping close to a million barrels of oil a day. The unit was seized by the government which claims the oil giant owes more than $27bn in taxes and fines. Yukos says those tax demands are exorbitant, and had sought refuge in US courts.\n \n The US bankruptcy court's initial order on Thursday - to temporarily block the sale - in response to Yukos filing for Chapter 11 bankruptcy protection, was upheld in a second ruling on Saturday. The protection, if recognised by the Russian authorities, would have allowed Yukos' current management to retain control of the business and block the sale of any company assets. Yukos has said the sale amounts to expropriation - punishment for the political ambitions of its founder, Mikhail Khodorkovsky. Mr Khodorkovsky is now in jail, on separate fraud charges. But President Vladimir Putin has described the affair as a crackdown on corruption - and the BBC's Sarah Rainsford in Moscow says most Russians believe the destruction of Yukos is now inevitable. Hours before the auction lawyers for Menatep, a group through which Mr Khodorkovsky and his associates control Yukos, said they would take legal action in other countries. Menatep lawyers, who were excluded from observing the auction, said they would retaliate by seeking injunctions in foreign courts to impound Russian oil and gas exports.\n", "llama3.2:1b": ["A Russian company called Baikal Finance Group has bought the main production unit of oil giant Yukos at an auction in Moscow for $9.37 billion.", "Yukos claims the sale is illegal and that Baikal was acting on behalf of Gazprom, which was not involved in the process.", "The sale came despite a restraining order issued by a US court dealing with Yukos' bankruptcy application for Chapter 11 protection.", "Baikal has said it paid above the auction start price due to its close ties to the Kremlin.", "The Russian government has seized Yuganskneftegas, and claims that Yukos owes more than $27 billion in taxes and fines.", "Yukos says these demands are exorbitant and had sought refuge in US courts.", "The sale has been met with skepticism from many analysts who believe it was a politically motivated attempt to punish Mikhail Khodorkovsky for his opposition to the government.", "There is potential for surprises, including possible legal action against Baikal Finance Group or its parent company Gazprom outside of Russia."], "llama3.2:3b": ["A little-known Russian company Baikal Finance Group outbid Gazprom for the main production unit of oil giant Yukos at an auction in Moscow.", "The deal was worth $9 billion and was criticized by Yukos as illegal.", "The sale comes despite a US court's restraining order on the auction, which would have blocked the sale if recognized by Russian authorities."], "gemma2:2b": ["A little-known company, Baikal Finance Group, won an auction for Yuganskneftegas, a major production unit of the seized oil giant Yukos, at a price of $9.37 billion.", "Yukos claims this is illegal expropriation and plans to challenge it.", "The sale proceeds despite a US court order that prevented the sale during Yukos' bankruptcy proceedings.", "Gazprom, the state-controlled gas monopoly, was expected to be the favorite bidder but withdrew before bidding started.", "Baikal Finance Group paid significantly above the starting price.", "Legal action is planned by Menatep, which controls Yukos, in other countries."], "qwen2.5:0.5b": ["A little-known Russian company, Baikal Finance Group, has purchased the main production unit of the oil giant Yukos at auction in Moscow for $260.75 billion.", "Despite the state-controlled gas monopoly Gazprom's bid, Baikal paid a significant premium over the start price to buy Yuganskneftegas.", "The sale came despite a restraining order issued by a US court dealing with the firm's bankruptcy application for Chapter 11 protection.", "However, the main question remains as to whether Baikal will represent competing interests or whether the auction was state-sponsored theft."], "qwen2.5:1.5b": ["A Russian company that did not publicly disclose its identity bought the main production unit of Yukos at an auction for $9 billion despite protests from the firm's shareholders.", "The auction ended with Baikal Finance Group winning at a premium above the starting price, leading to speculation about possible state involvement and challenges to the sale's legitimacy in both Russia and international law."], "qwen2.5:3b": ["A little-known Russian company, Baikal Finance Group, bought Yuganskneftegas, the main production unit of oil giant Yukos, at an auction in Moscow for 260.75bn roubles ($9.37bn).", "This sale came despite a restraining order from a US court and was seen as state-sponsored theft by Yukos, which insisted the tax demands were exorbitant.", "The original four bidders included Gazprom but only two turned up: Baikal Finance Group and Gazprom, which did not bid.", "Analysts believe Gazprom may have found a partner in this deal.", "While many analysts saw this sale as state-sponsored theft by the Russian government to recover unpaid taxes, Yukos said it would continue legal action against the winners outside of Russia.", "The auction also came with the caveat that the protection given to Yukos under US bankruptcy law could allow its current management to retain control of the business and prevent any sale of assets."], "opencoder:1.5b": ["Yukos unit fetches $9bn at auction, Baikal Finance Group has bought Yuganskneftegas for 260.75bn roubles, and the sale came despite a restraining order issued by a US court dealing with the firm's bankruptcy application for Chapter 11 protection.", "The mystery firm Baikal Finance Group is officially registered in the central Russian region of Tver but many analysts believe it may be linked to Gazprom.", "The main question was how to structure this transaction, Yugansk will most likely end up with Gazprom but could still end up with the government.", "There is still potential for surprises and the US bankruptcy court's initial order on Thursday (to temporarily block the sale) in a second ruling on Saturday allowed this action to proceed."], "smollm:1.7b": ["The summary is concise and objective, preserving key ideas and details of the text while omitting unnecessary information.", "The main points are:\n\n1.", "The sale of Yukos unit at auction in Moscow was illegal in international law and Russian law.", "2.", "Baikal Finance Group outbid other bidders for Yuganskneftegas.", "3.", "Baikal paid 260,75bn roubles ($9.37bn) for Yugansk - nowhere near the $9bn Russia says Yukos owes in taxes.", "4.", "The company considered that the victor of today's auction had bought itself a serious $9bn headache.", "5.", "Tim Osborne, head of Yukos main shareholders' group Menatep, said that Yukos may have to declare itself bankrupt, and that legal action would be taken, outside Russia, against the auction winners.", "6.", "Reports from Russia say Baikal has paid a deposit of nearly $1.7bn from an Sberbank account to the Russian Federal Property Fund, for Yuganskneftegas.", "7.", "The sale came despite a restraining order issued by a US court dealing with the firm's bankruptcy protection.", "8.", "Kaha Kiknavelidze, analyst at Brunswick UBS, said: \"I see no plausible explanation for the theory that Baikal was representing competing interests.\"", "9.", "Yugansk will most likely end up with Gazprom but could still end up with the government.", "10.", "The US bankruptcy court's initial order on Thursday - to temporarily block the sale - in response to Yukos filing for Chapter 11 bankruptcy protection, was upheld in a second ruling on Saturday.", "11.", "The Russian authorities have said the sale amounts to expropriation - punishment for the political ambitions of its founder, Mikhail Khodorkovsky.", "12.", "Mr Khodorkovsky is now in jail, on separate fraud charges.", "13.", "Most Russians believe the destruction of Yukos is now inevitable."], "deepseek-r1:1.5b": ["The Russian company Yukos purchased a significant portion of its oil operations for $9bn, winning against Baikal Finance Group.", "The Russian government paid nearly $1.7 billion in deposits but didn't expect to pay off the taxes owed to Russia.", "Yukos will protect its shareholders from tax-related removals if it's not sold out.", "Meanwhile, U.S. law has deemed the sale illegal in Russia and international law as well.", "If the winner isn't declared bankrupt, Yukos could face it.", "The Russian government is buying from Eulerian Group, which owns a large freshwater lake in Siberia, but this doesn't link them to Gazprom.", "Yukos is exploring a potential deal with Gazprom, which has been seen by some as favorable.", "The US court ruled that the sale was illegal in Russia and International law, and if the winner isn't sold out, they might face bankruptcy.", "There's some legal uncertainty outside Russia over the winners' actions, potentially causing surprises."], "tinyllama:1.1b": ["A little-known Russian company has made a $9bn (£4.8bn) bid for the main production unit of oil giant Yukos at auction in Moscow, but the winning bidder is yet to be announced.", "Baikal Finance Group, an unidentified firm registered in Tver region, paid 260.75bn roubles ($9.37bn: £4.8bn) for Yuaganskneftegas, the Russian state-controlled gas monopoly, but it will have to wait until after a restraining order issued by a US court is lifted as Russian authorities argue against declaring them bankrupt.", "The sale came amid speculation that the winning bidder was likely to be Gazprom, state-backed gas monopoly Gazprom, or another unidentified firm.", "However, Gazprom has denied being in any competition with Baikal for the auctioned unit and Paul Collison, chief analyst at Brunswick UBS, suggests that Baikal might still end up with Gazprom but could also be bought by other unidentified bidders.", "This has led to speculation about the identity of the winner of the auction and whether there will be further surprises in store for the situation.", "However, the Russian authorities have yet to make a decision on the outcome of the auction, and if Gazprom is declared bankrupt, there may be consequences."], "tinydolphin:1.1b": [" Yukos unit fetches $9bn at auction - but not everyone is pleased with this outcome.", "Yukos, a major Russian oil company, has bought the main production unit of its rival, Yuganskneftegas, for $9bn.", "This was reportedly done in an attempt to protect itself from potential tax liabilities related to its previous ownership.", "However, the auction process received backlash from various groups.", "The unit was valued at a low price before the auction, which could be seen as unfair by some.", "Additionally, the fact that Yukos agreed to buy another company, Menatep, suggests that they may not fully respect or protect its shareholders' interests when it comes to taxes.", "Some critics have accused Yukos of buying itself into trouble through this transaction.", "Nonetheless, the deal is expected to go through, and Yukos will reportedly declare bankruptcy in Russia as a result."], "phi:2.7b": [" A little-known Russian company called Baikal Finance Group bought the main production unit of oil giant Yukos at an auction for $9.37 billion.", "This is not far from Russia's claimed debt of $27 billion, but the company has no plans to declare bankruptcy.", "Yukos claims that the auction was illegal and will continue to protect its shareholders.", "The sale happened despite a US court restraining order on Yukos' Chapter 11 bankruptcy application.", "Gazprom, a state-controlled gas monopoly, did not participate in the auction.", "There are theories that Baikal Finance Group is linked to Gazprom, but this has been denied by both companies.", "The unit is located in Yugansk, which produces over a million barrels of oil a day."], "orca-mini:3b": [" The little-known Russian company Baikal Finance Group has bought the main production unit of oil giant Yukos at auction in Moscow for $9.37 billion, over twice the starting price.", "The sale came despite a restraining order issued by a US court dealing with the firm's bankruptcy application for Chapter 11 protection.", "The victor, Baikal, has paid a deposit of nearly $1.7 billion from a Sberbank (Savings Bank) account to the Russian Federal Property Fund, for Yugansk.", "The sale amounts to expropriation, and Yukos insists it was state-sponsored theft.", "The company is linked to Gazprom but Kaha Kiknavelidze doubts its connection.", "The US court's initial order on Thursday to temporarily block the sale has been upheld in a second ruling on Saturday.", "Menatep lawyers have announced they will take legal action in other countries, and Yukos insists the sale amounts to expropriation."], "hermes3:3b": ["Yukos production unit Yuganskneftegas sold for $9bn at auction to Baikal Finance Group over Gazprom."], "stablelm-zephyr:3b": ["A little-known Russian company, Baikal Finance Group, has bought the main production unit of Yukos oil at an auction in Moscow for $9 billion.", "The mysterious group paid 260.75 billion roubles (£9.37bn) for Yuganskneftegas, purchasing it from the Russian government which claims Yukos owes over $27bn in taxes and fines.", "Yukos maintains that the auction was illegal under international and Russian law, and could face legal action against the new owners outside Russia.", "Baikal Finance Group is linked to Gazprom through Kaha Kiknavelidze, an analyst who believes a decision was made \"a long time ago\" regarding the partnership between Gazprom and Baikal for this transaction."], "chatgpt-4o-latest": ["A little-known Russian company, Baikal Finance Group, won the auction for Yukos' main production unit, Yuganskneftegas, outbidding state-controlled Gazprom with a $9.37 billion bid.", "Yukos condemned the auction as illegal and vowed legal action, potentially declaring bankruptcy.", "The sale proceeded despite a US court's restraining order related to Yukos' Chapter 11 bankruptcy filing.", "Analysts suspect Baikal may be linked to Gazprom, possibly structuring the deal to facilitate Gazprom's eventual acquisition.", "The Russian government seized Yugansk, citing Yukos' $27 billion tax debt, while Yukos claims the charges are politically motivated.", "Founder Mikhail Khodorkovsky is in jail on fraud charges, and legal battles over the sale are expected to continue internationally."], "stablelm2:1.6b": ["Russian company Baikal Finance Group bought the main production unit of oil giant Yukos at an auction for $9bn, beating favourite Gazprom and claiming ownership of over $30bn in unpaid taxes.", "Yukos insists the auction was illegitimate while Russia argues it's enforcing the law to recover tax debts.", "Two companies participated, with Baikal Finance Group winning at above starting price."], "granite3.1-dense:2b": ["Baikal Finance Group, a lesser-known Russian company, outbid Gazprom, the state-controlled gas monopoly, to purchase Yuganskneftegas, a key production unit of Yukos, for $9.37 billion ($4.8 billion) at an auction in Moscow.", "This transaction, despite being declared illegal by Yukos and potentially violating international law, proceeded as the only registered bidder alongside Gazprom (which did not participate).", "The deal came amidst a US court-ordered temporary block on the sale, which Yukos claims amounts to expropriation due to excessive tax demands.", "Baikal paid a substantial premium above the auction's starting price of 246.75 billion roubles (approximately $9.37 billion).", "Yukos, through its main shareholders' group Menatep, maintains that the auction was state-sponsored theft and vows to protect tens of thousands of shareholders by taking \"every lawful move\" to prevent this forcible seizure of their property.", "Yuganskneftegas generates nearly a million barrels of oil daily, making it crucial to Yukos' operations.", "Gazprom has denied any connection with Baikal, while analysts speculate that the transaction might involve Gazprom as a partner or that Baikal could forfeit its bid within 14 days, allowing Gazprom time to collect funds.", "The Russian government claims Yukos owes over $27 billion in taxes and fines.", "Following the auction, Menatep announced plans to seek injunctions in foreign courts to freeze Russian oil and gas exports as retaliation for the sale.", "President Vladimir Putin characterizes this process as a crackdown on corruption, while most Russians consider the destruction of Yukos inevitable due to Mikhail Khodorkovsky's imprisonment on fraud charges."]}