{"raw_text": "Christmas shoppers flock to tills\n \n Shops all over the UK reported strong sales on the last Saturday before Christmas with some claiming record-breaking numbers of festive shoppers.\n \n A spokesman for Manchester's Trafford Centre said it was \"the biggest Christmas to date\" with sales up 5%. And the Regent Street Association said shops in central London were also expecting the \"best Christmas ever\". That picture comes despite reports of disappointing festive sales in the last couple of weeks.\n \n The Trafford Centre spokeswoman said about 8,500 thousand vehicles had arrived at the centre on Saturday before 1130 GMT. \"We predict that the next week will continue the same trend,\" she added.\n \n It was a similar story at Bluewater in Kent. Spokesman Alan Jones said he expected 150,000 shoppers to have visited by the end of Saturday and a further 100,000 on Sunday. \"Our sales so far have been 2% up on the same time last year,\" he said. \"We're very busy, it's really strong and people will be shopping right up until Christmas. \"Over the Christmas period we're expecting people to spend in excess of £200m at the centre.\"\n \n On Saturday afternoon, a spokeswoman for the St David's Shopping Centre in Cardiff said it looked like being its busiest day of the year with about 200,000 shoppers expected to have visited by the close of play. At the St Enoch's Shopping Centre in Glasgow, more than 140,000 shoppers - an all-time record - were expected to have passed through the doors by its closing time of 1900 GMT. Senior business manager Jon Walton said: \"It has been phenomenal - absolutely mobbed. \"Every week footfall has been showing strong growth and at the weekends it has been going mad.\" Regent Street Association director Annie Walker said on Saturday: \"The stores were heaving today and a lot of people are going to be doing last minute shopping as many people finished work on Friday and can go in the week.\"\n \n She said reports of a slump in pre-Christmas sales were related to the growing popularity of internet sales. \"I do think this has had a lot to do with reports of lower sales figures,\" she said. \"Internet shopping has gone up enormously and not all stores have websites.\"\n", "llama3.2:1b": ["Christmas shoppers flock to tills, with strong sales reported in various UK shopping centers.", "Some centers, such as Manchester's Trafford Centre and Bluewater in Kent, experienced record-breaking numbers of visitors.", "Sales were up 5% at the Trafford Centre and 2% at Bluewater.", "In London, the Regent Street Association predicted a \"best Christmas ever\" despite disappointing pre-Christmas sales."], "llama3.2:3b": ["Christmas shoppers flocked to tills across the UK on the last Saturday before Christmas, with many shops reporting record-breaking numbers.", "The Trafford Centre saw 8,500 vehicles arrive by 1130 GMT, while Bluewater in Kent expected 250,000 visitors over two days.", "Other shopping centres reported strong sales and footfall, including a potential all-time record at St Enoch's Shopping Centre in Glasgow.", "Senior business manager Jon Walton attributed the surge to last-minute shopping before work finished on Friday."], "gemma2:2b": ["Retailers across the UK saw strong sales on the last Saturday before Christmas, with some reporting record-breaking numbers.", "Many shoppers are expected to continue buying in the days leading up to Christmas.", "The reasons for this surge in sales include pent-up demand and a focus on in-person shopping experiences.", "The internet's growing popularity is also contributing to declining in-store traffic as people seek convenience, but many are still choosing physical stores."], "qwen2.5:0.5b": ["Shoppers flock to Manchester's Trafford Centre for the last Saturday before Christmas, where sales were reported to be at their record-breaking levels with an increase of 5%.", "Bluewater in Kent was also expecting the best Christmas ever, with plans to see about 150,000 shoppers on Sunday.", "Sales so far have been showing strong growth and people are expected to spend over £200m at the centre during the holiday season.", "Regent Street Association director Annie Walker said reports of a slump in pre-Christmas sales were related to the growing popularity of internet shopping."], "qwen2.5:1.5b": ["Strong Christmas sales reported across UK shops, including Manchester's Trafford Centre and Bluewater in Kent, despite disappointing recent weeks."], "qwen2.5:3b": ["Christmas shoppers flock to UK shops, reporting strong sales despite initial disappointing festive sales reports.", "Manchester's Trafford Centre saw a 5% increase in sales, expecting continued trend as over 8,500 vehicles arrived by Saturday afternoon.", "Bluewater in Kent anticipated 2% growth compared to last year with up to 350,000 shoppers expected during the weekend.", "Cardiff’s St David's Shopping Centre and Glasgow's St Enoch's are also experiencing record-breaking footfalls on their busiest days of the year, with senior business managers noting intense shopping activity attributed to people finishing work early for last-minute purchases.", "The Regent Street Association suggests this trend is due to increased internet sales popularity."], "opencoder:1.5b": ["Christmas shoppers flock to tills\n\nShops all over the UK reported strong sales on the last Saturday before Christmas with some claiming record-breaking numbers of festive shoppers.", "A spokesman for Manchester's Trafford Centre said it was \"the biggest Christmas to date\" with sales up 5%.", "The Regent Street Association said shops in central London were also expecting the \"best Christmas ever\".", "That picture comes despite reports of disappointing festive sales in the last couple of weeks.", "Trafford Centre spokeswoman said about 8,500 thousand vehicles had arrived at the centre on Saturday before 11.30 GMT.", "\"We predict that the next week will continue the same trend,\" she added.", "It was a similar story at Bluewater in Kent.", "Spokesman Alan Jones said he expected 150,000 shoppers to have visited by the end of Saturday and a further 100,000 on Sunday.", "He \"our sales so far have been 2% up on the same time last year,\" he said.", "We're very busy, it's really strong and people will be shopping right up until Christmas.", "Over the Christmas period we're expecting people to spend in excess of £200m at the centre.", "On Saturday afternoon, a spokeswoman for the St David's Shopping Centre in Cardiff said it looked like being its busiest day of the year with about 200,000 shoppers expected to have visited by the close of play.", "At the St Enoch's Shopping Centre in Glasgow, more than 140,000 shoppers - an all-time record - were expected to have passed through the doors by its closing time of 19.00 GMT.", "Senior business manager Jon Walton said: \"It has been phenomenal - absolutely mobbed.", "Every week footfall has been showing strong growth and at the weekends it has been going mad.\"", "Regent Street Association director Annie Walker said on Saturday: \"The stores were heaving today and a lot of people are going to be doing last minute shopping as many people finished work on Friday and can go in the week.\"", "She said reports of a slump in pre-Christmas sales were related to the growing popularity of internet sales.", "\"I do think this has had a lot to do with reports of lower sales figures,\" she said.", "Internet shopping has gone up enormously and not all stores have websites."], "smollm:1.7b": ["The text above is summarized as follows:\n\n1.", "The article highlights the strong sales in UK shops on Christmas Eve, with some claiming record-breaking numbers of festive shoppers.", "2.", "Shops reported high sales throughout the week leading up to Christmas, but this was particularly evident at Trafford Centre and Regent Street Association stores.", "3.", "The spokeswoman for Trafford Centre said it was \"the biggest Christmas to date\" with sales up 5%.", "The Regent Street Association also reported strong sales on Saturday afternoon.", "4.", "On Saturday evening, a spokeswoman from St David's Shopping Centre in Cardiff said it looked like being its busiest day of the year with about 200,000 shoppers expected to have visited by the close of play.", "5.", "On Saturday afternoon, a spokeswoman for St Enoch's Shopping Centre in Glasgow said it was expecting strong footfall and an all-time record with over 140,000 shoppers - an all-time record.", "6.", "Senior business manager Jon Walton from St David's Shopping Centre in Cardiff said: \"It has been phenomenal - absolutely mobbed.\"", "7.", "Regent Street Association director Annie Walker from the St Enoch's Shopping Centre in Glasgow said on Saturday: \"The stores were heaving today and a lot of people are going to be doing last minute shopping as many people finished work on Friday and can go in the week.\""], "deepseek-r1:1.5b": ["The last Saturday before Christmas in the UK saw strong holiday shoppers, with Manchester's Trafford Centre claiming record-breaking numbers, up 5% compared to last year.", "The Regent Street Association also predicted central London would see an \"ideal\" Christmas.", "Other locations like Bluewater Kent and St David's Cardiff experienced busy days, exceeding thousands of shoppers expected over the festive period.", "Annie Walker noted reports of lower pre-Christmas sales were likely due to internet shopping growth, as not all stores used websites or relied on online services."], "tinyllama:1.1b": ["A spokeperson for various shopping centers across the UK reported strong sales on Christmas Saturday, despite some stores reporting disappointing figures in the last two weeks.", "Trafford Centre in Manchester, for instance, claimed that approximately 8,500 vehicles arrived at the center on December 23rd, leading to a total of 8,500,000 shoppers visiting during the festive period, according to the spokesperson.", "The same spokeperson reported that Bluewater in Kent had experienced similar traffic and stated that more than 150,000 shoppers visited the center between December 23rd and Christmas Eve, with further visitors set to arrive over the next week.", "The St David's Shopping Center in Cardiff also reported busiest day of the year on Christmas Saturday, with around 200,000 shoppers expected to have passed through its doors by the close of play.", "Regent Street Association director Annie Walker attributed reports of lower sales figures as a result of growing popularity of internet shopping."], "tinydolphin:1.1b": [" The text provided is an overview of some significant events that occurred on or around the last Saturday before Christmas in UK shops.", "This information highlights a substantial rise in sales across the country as well as the experiences of retailers, including the Trafford Centre, Bluewater, St Enoch's and Regent Street Association."], "phi:2.7b": [" On Saturday before Christmas, shops across the UK reported strong sales as shoppers flocked to tills.", "The Trafford Centre in Manchester saw record-breaking numbers of customers, with over 8,500 cars arriving at the centre on Saturday morning.", "Bluewater in Kent also had a busy day, with over 150,000 shoppers expected by the end of the day.", "Cardiff's St David's Shopping Centre was expected to have its busiest day yet, with 200,000 shoppers predicted to have visited.", "In Glasgow, more than 140,000 people were expected to visit the St Enoch's Shopping Centre by the time it closed for the night.", "Senior business manager Jon Walton said it had been \"absolutely mobbed\" and Director of the Regent Street Association Annie Walker said last-minute shopping was a trend.", "However, she noted that reports of lower pre-Christmas sales could be attributed to growing popularity of internet shopping, as not all stores have websites."], "orca-mini:3b": [" Christmas shoppers flocked to tills in all over the UK on the last Saturday before Christmas, with some shops reporting record-breaking numbers.", "The spokesman for Manchester's Trafford Centre said it was the best Christmas ever, with sales up 5%.", "Similarly, the Bluewater shopping centre in Kent saw a huge number of shoppers, with over 150,000 expected to visit by the end of Saturday and more than £200m being spent.", "On the same day in Cardiff, the St David's Shopping Centre was busy, with around 200,000 shoppers predicted to have visited by its closing time.", "In Glasgow, the St Enoch's Shopping Centre also saw a record-breaking number of visitors, with over 140,000 people expected to pass through the doors by 1900 GMT.", "Annie Walker, director of the Regent Street Association, said reports of lower sales were related to the growing popularity of internet shopping and not all stores had websites."], "hermes3:3b": ["UK shops saw strong Christmas sales on last Saturday before Christmas, with some reporting record-breaking festive shoppers and an increase by 5%."], "stablelm-zephyr:3b": ["Festive shoppers flocked to UK shops on the last Saturday before Christmas, with some reporting record-breaking numbers.", "The Trafford Centre had its biggest Christmas yet, with sales up 5%, and central London shops expected the \"best Christmas ever.\"", "Bluewater in Kent predicted 150,000 visitors by Sunday and £200m in spending over the holiday period.", "On busy days, some shopping centers reported 200,000 shoppers, with internet sales contributing to the increase in footfall."], "chatgpt-4o-latest": ["Shops across the UK experienced strong sales on the last Saturday before Christmas, with some reporting record-breaking numbers of shoppers.", "Manchester's Trafford Centre saw a 5% sales increase, while central London stores anticipated their best Christmas ever.", "Despite earlier reports of slow sales, major shopping centers like Bluewater in Kent, St David’s in Cardiff, and St Enoch’s in Glasgow saw massive crowds, with some setting all-time records.", "Retailers expect the trend to continue through Christmas, with spending projected to exceed £200m at Bluewater alone.", "The rise of internet shopping may have contributed to earlier reports of lower sales."], "stablelm2:1.6b": ["Many shops across the UK reported strong Christmas sales, with Manchester's Trafford Centre claiming it was \"the biggest Christmas ever\", at 5% increase in sales.", "Central London shops also expected the best Christmas ever despite reports of disappointing festive sales in recent weeks.", "The St David's Shopping Centre in Cardiff and St Enoch's Shopping Centre in Glasgow both had their busiest days of the year, with over 100,0 S shoppers passing through.", "Internet shopping is believed to have contributed to lower pre-Christmas sales figures."], "granite3.1-dense:2b": ["Christmas shoppers flocked to UK shopping centers on the last Saturday before Christmas, reporting strong sales and some claiming record-breaking numbers.", "Major centers like Manchester's Trafford Centre, Bluewater in Kent, St David's in Cardiff, and St Enoch's in Glasgow saw significant visitor counts - 8,500 vehicles at the Trafford Centre, 150,000-200,000 shoppers each at Bluewater and St David's, and over 140,000 at St Enoch's.", "Sales were up 2-5% compared to last year, with a combined prediction of over £200m in spending during the Christmas period.", "Despite earlier reports of disappointing festive sales, experts attribute this surge to the growing popularity of online shopping, which many stores lack due to not having websites."]}