{"raw_text": "Senior Fannie Mae bosses resign\n \n The two most senior executives at US mortgage giant Fannie Mae have resigned after accounting irregularities were uncovered at the company.\n \n Chief executive Franklin Raines, a former senior official in the Clinton administration, and chief financial officer Tim Howard have left the firm. Fannie Mae was criticised by financial regulators and could have to restate its earnings by up to $9bn (£4.6bn). It is America's second largest financial institution.\n \n Recent investigations have exposed extensive accounting errors at Fannie Mae, which supplies funds to America's $8 trillion mortgage market. Last week, the firm was admonished by the Securities and Exchange Commission which said it had made major errors in its financial reporting.\n \n The financial regulator said Fannie Mae would have to raise substantial new capital to restore its balance sheet. Analysts said the SEC's criticism made it impossible for Fannie Mae's senior executives to remain. Mr Raines, head of the Office of Management and Budget under President Clinton, has taken early retirement while Mr Howard has also stepped down, the company said on Tuesday. KPMG, Fannie Mae's independent auditor, will also be replaced. \"By my early retirement, I have held myself accountable,\" Mr Raines said in a statement.\n \n Fannie Mae was found to have violated accounting rules relating to derivatives - financial instruments used to hedge against fluctuations in interest rates - and some pre-paid loans. As a result, it could be forced to restate $9bn in earnings over the past four years, effectively wiping out a third of the company's profits since 2001. Although not making loans directly to buyers, Fannie Mae is the largest single player in the mortgage market, underwriting half of all US house purchases. The firm operates under charter from the US Congress. It has faced stinging criticism from Congressional leaders who held hearings into its finances earlier this year and from government regulator, the Office of Federal Housing Enterprise Oversight (OFHEO). \"We are encouraged that the board's announcement signals a new culture and a new direction for Fannie Mae,\" Armando Falcon, OFHEO director said. The problems afflicting Fannie Mae are just the latest to hit the US mortgage industry. Freddie Mac, the country's other largest mortgage firm, was forced to restate its earnings by $4.4bn last year and pay a $125m fine after an investigation of its books.\n", "llama3.2:1b": ["Fannie Mae senior executives Franklin Raines and Tim Howard have resigned after accounting irregularities were uncovered at US mortgage giant Fannie Mae.", "The company is facing significant financial reporting issues, including extensive errors in its financial reporting and violations of accounting rules related to derivatives and pre-paid loans.", "Fannie Mae faces a potential $9 billion restatement of earnings over the past four years due to these problems."], "llama3.2:3b": ["Fannie Mae's two senior executives resign amid accounting irregularities.", "Investigations revealed extensive errors in financial reporting, including derivative rule violations and pre-paid loans.", "The company may have to restate up to $9 billion in earnings and replace its auditor."], "gemma2:2b": ["Two senior executives at Fannie Mae resigned due to accounting irregularities including errors in derivatives and pre-paid loans.", "The company faces potential restatement of $9 billion in earnings over the past four years, which could significantly affect profits.", "This scandal follows similar issues at Freddie Mac, further highlighting problems within the US mortgage industry."], "qwen2.5:0.5b": ["Fannie Mae chief executives Franklin Raines and Tim Howard resigned after uncovering significant accounting irregularities at the mortgage giant.", "Fannie Mae faces up to $9 billion in potential earnings revaluation, due to accounting errors that affected payments made by Fannie Mae to the US mortgage market."], "qwen2.5:1.5b": ["Senior executives at Fannie Mae have resigned due to accounting irregularities that could force restatement of earnings by up to $9 billion and potentially jeopardize the firm's balance sheet, leading to replacements for Chief Executive Franklin Raines and Chief Financial Officer Tim Howard as well as KPMG auditors."], "qwen2.5:3b": ["Senior executives Franklin Raines and Tim Howard resign from Fannie Mae following accounting irregularities exposed in the company’s financial reporting.", "The SEC criticized Fannie Mae for major errors, prompting regulators to demand substantial new capital.", "Violations included violations of derivative accounting rules and underestimation of prepaid loans.", "Fannie Mae could face up to $9 billion earnings restatement, potentially reducing profits by a third since 2001.", "This follows recent criticism from Congressional leaders and the Office of Federal Housing Enterprise Oversight (OFHEO)."], "opencoder:1.5b": ["The two most senior executives at US mortgage giant Fannie Mae have resigned after accounting irregularities were uncovered at the company.", "Chief executive Franklin Raines, a former senior official in the Clinton administration, and chief financial officer Tim Howard have left the firm.", "Fannie Mae was criticized by financial regulators and could have to restate its earnings by up to $9bn (£4.6bn).", "It is America's second largest financial institution.", "Recent investigations have exposed extensive accounting errors at Fannie Mae, which supplies funds to America's $8 trillion mortgage market.", "Last week, the firm was admonished by the Securities and Exchange Commission which said it had made major errors in its financial reporting.", "The company announced major accounting issues over the past four years, leading to a threefold decrease in profits from 2001 onwards.", "Fannie Mae also faces criticism from government leaders and regulatory agencies, who conducted hearings earlier this year.", "\"By my early retirement, I have held myself accountable,\" Mr Raines said in a statement."], "smollm:1.7b": ["The summary should be: Senior Fannie Mae bosses resign after accounting irregularities were uncovered at the company.", "The two most senior executives at US mortgage giant Fannie Mae have resigned after accounting irregularities were uncovered at the company.", "Fannie Mae was criticized by financial regulators and could have to restate its earnings by up to $9bn (£4.6bn) due to errors in its financial reporting.", "It is America's second largest financial institution.", "The recent investigations have exposed extensive accounting errors at Fannie Mae, which supplied funds to America's $8 trillion mortgage market.", "Last week, the firm was admonished by the Securities and Exchange Commission which said it had made major errors in its financial reporting.", "Analysts said the SEC's criticism made it impossible for Fannie Mae's senior executives to remain.", "Mr Raines, head of the Office of Management and Budget under President Clinton, has taken early retirement while Mr Howard has also stepped down, the company said on Tuesday.", "KPMG, Fannie Mae's independent auditor, will also be replaced.", "\"By my early retirement, I have held myself accountable,\" Mr Raines said in a statement."], "deepseek-r1:1.5b": ["Senior Fannie Mae bosses Franklin Raines and Tim Howard resigned after accounting irregularities were uncovered.", "Fannie Mae was criticized by regulators, including the Securities and Exchange Commission (SEC), which noted significant accounting errors affecting its earnings.", "Fannie Mae had violated derivative rules and some pre-paid loans, leading to losses of $9bn in earnings over four years, wiping out a third of profits since 2001.", "Raines, former CEO under President Clinton, and Howard, CFO, stepped down as executives.", "KPMG, the independent auditor, will also be replaced.", "Freddie Mac faced similar issues last year, restateting its earnings by $4.4bn and paying a $125m fine."], "tinyllama:1.1b": ["After accounting irregularities were uncovered at US mortgage giant Fawnni Mae, its top executives Franklin Raines, former senior official in the Clinton administration, and Tim Howard resigned, leading to a request by US financial regulators for the company to restructure its earnings.", "The company was accused of extensive accounting errors and failed to make loan offers directly to buyers, leading to wiping out a third of the company's profit over four years.", "The issues at Fawnni Mae are just the latest in a string of problems affecting the US mortgage industry as a result of regulatory scrutiny and investigations."], "tinydolphin:1.1b": [" US mortgage giant Fannie Mae has experienced a series of scandals in recent years, resulting in the resignations of two senior executives.", "The company's chief executive, Franklin Raines, and chief financial officer, Tim Howard, left due to accounting irregularities uncovered by regulators.", "The problems at Fannie Mae are just another example of how the US mortgage industry is being affected by a range of challenges.", "Over the past few years, we have seen the collapse of two major mortgage giants, Freddie Mac and Wachovia, which were both influenced by similar accounting irregularities.", "These scandals have led to further regulatory scrutiny and financial losses for Fannie Mae.", "The SEC's criticism of Fannie Mae has made it impossible for its senior executives to remain in their positions.", "This, in turn, has forced them to retire early or resign.", "KPMG, the company's independent auditor, will also be replaced as a result of this decision.", "The findings of these investigations have revealed that Fannie Mae is facing significant financial difficulties and may need to restate its earnings by up to $9 billion due to extensive accounting errors.", "This could potentially wipe out a third of the company's profits since 2001.", "Fannie Mae is also under the watchful eye of the US Congress and the Office of Federal Housing Enterprise Oversight (OFHEO), which has held hearings into its finances.", "These investigations have highlighted the need for reform in the mortgage industry and for improved accountability at Fannie Mae and other companies involved in the housing market.", "The problems faced by Fannie Mae are indicative of a broader issue within the US mortgage industry, where regulatory scrutiny and financial difficulties are commonplace.", "As a result, it is important for companies like Fannie Mae to adopt a more transparent approach to reporting their financial information and working towards a more sustainable future for the housing market."], "phi:2.7b": [" Two top executives at Fannie Mae, the US's second-largest financial institution, have resigned following accounting irregularities uncovered at the company.", "The SEC has criticized Fannie Mae for errors in its financial reporting, which could result in earnings restatements and capital increases.", "KPMG, the firm's auditor, will also be replaced.", "The recent investigations found that Fannie Mae had violated accounting rules related to derivatives and pre-paid loans, potentially wiping out a third of the company's profits since 2001."], "orca-mini:3b": [" Senior executives at Fannie Mae, including Franklin Raines and Tim Howard, have resigned after the discovery of significant accounting errors.", "The financial regulator SEC criticized Fannie Mae for violating accounting rules relating to derivatives and pre-paid loans, which could lead to a restatement of earnings by up to $9bn.", "Fannie Mae is the largest player in the mortgage market and operates under a charter from the US Congress.", "It faces criticism from Congressional leaders and government regulators."], "hermes3:3b": ["Fannie Mae execs (Raines, Howard) resign due to accounting irregularities, up to $9bn restatement of earnings required, 2nd largest US financial institution."], "stablelm-zephyr:3b": ["Two top executives at Fannie Mae, a big US mortgage company, resigned because they found bad money stuff happening in the company.", "Their names were Franklin Raines, who used to work for President Clinton, and Tim Howard.", "They made some mistakes with counting money things called \"derivatives\" and also with something called \"pre-paid loans.\"", "Because of these problems, the company might have to change how it shows its earnings from $9 billion to $4.6 billion.", "Fannie Mae is a very important company because they help people buy houses by giving them money."], "chatgpt-4o-latest": ["The two top executives of US mortgage giant Fannie Mae, CEO Franklin Raines and CFO Tim Howard, have resigned following the discovery of accounting irregularities.", "Financial regulators criticized the company, which may need to restate up to $9 billion in earnings.", "The Securities and Exchange Commission found major financial reporting errors, requiring Fannie Mae to raise substantial new capital.", "The company violated accounting rules related to derivatives and pre-paid loans, potentially erasing a third of its profits since 2001.", "Congressional leaders and regulators have scrutinized Fannie Mae, and its independent auditor, KPMG, will be replaced.", "The resignations follow similar issues at Freddie Mac, which previously had to restate $4.4 billion in earnings and pay a fine."], "stablelm2:1.6b": ["Senior executives at Fannie Mae have resigned amid accounting irregularities discovered by recent investigations.", "CEO Franklin Raines and CFO Tim Howard will leave the company, which could face up to $9 billion restatement in earnings.", "The Securities and Exchange Commission criticized Fannie Mae for major financial reporting errors.", "To address these issues, KPMG, Fannie Mae's independent auditor, will also be replaced.", "Fannie Mae is America's second-largest financial institution and supplies funds to the US $8 trillion mortgage market.", "The company could face sanctions such..", "The text discusses the resignation of two senior executives from Fannie Mae amid accounting irregularities and criticism from regulatory bodies like the Securities and Exchange Commission (SEC) and the Office of Federal Housing Enterprise Oversight (OFHEO).", "Fannie Mae, as America's second-largest financial institution, plays a significant role in the US $8 trillion mortgage market.", "The text highlights that Fannie Mae could be forced to restate up to $9 billion in earnings due to these irregularities."], "granite3.1-dense:2b": ["Fannie Mae's two top executives, CEO Franklin Raines (formerly in the Clinton administration) and CFO Tim Howard, have resigned following uncovered accounting irregularities worth up to $9 billion.", "These errors involve violations of derivative and pre-paid loans accounting rules, impacting Fannie Mae's earnings over the past four years.", "The Securities and Exchange Commission admonished the company for significant financial reporting flaws.", "As a result, Fannie Mae must increase capital to restore its balance sheet.", "This development follows criticism from Congressional leaders and government regulator OFHEO regarding the firm's finances.", "The incident marks another blow to the U.S. mortgage industry, following similar issues at Freddie Mac, which recalculated earnings by $4.4 billion last year and paid a fine of $125 million due to book investigation concerns."]}