{"raw_text": "Disney settles disclosure charges\n \n Walt Disney has settled charges from US federal regulators that it failed to disclose how family members of directors were employed by the company.\n \n The media giant was not fined by the Securities and Exchange Commission, but has agreed to refrain from any future violations of securities law. Disney failed to tell investors that between 1999 and 2001 it employed three adult children of three then directors. The firm has neither admitted nor denied wrongdoing in the settlement.\n \n The three Disney directors in question in the central matter of the SEC's investigation - Reveta Bowers, Stanley Gold and Raymond Watson - have all since left the company, with Ms Bowers and Mr Watson both retiring, and Mr Gold quitting in 2003. Their children were paid between $60,000 (£30,800) and $150,000 a year, with shareholders not being informed. The SEC also found that Disney did not disclose that a 50% Disney-owned subsidiary company - Lifetime - employed the wife of current Disney director John Bryson, and that she earned more than $1m a year. Louise Bryson remains with Lifetime.\n \n Disney also failed to disclose payments to Air Shamrock, an airline owned by Mr Gold and fellow former Disney directors Roy Disney. Finally, Disney also did not reveal that it provided more than $200,000 annually for office space, secretarial services, and a leased car and driver to former director Thomas Murphy. \"Shareholders have a significant interest in information regarding relationships between the company and its directors,\" said SEC deputy enforcement director Linda Thomsen. \"Failure to comply with the SEC's disclosure rules in this area impedes shareholders' ability to evaluate the objectivity and independence of directors.\"\n", "llama3.2:1b": ["Disney settles charges over failure to disclose employment of family members and directors, paying $150,000 in fines and agreeing to refrain from future violations of securities law."], "llama3.2:3b": ["Disney has settled charges with US federal regulators for failing to disclose how family members of directors were employed by the company, without admitting wrongdoing.", "The settlement does not result in a fine, but Disney agrees to refrain from future violations.", "The SEC found that Disney failed to disclose payments to employees of subsidiary companies and provided secretarial services to former directors."], "gemma2:2b": ["Disney settled charges from the Securities and Exchange Commission for failing to disclose family member employment by directors.", "The company did not admit or deny wrongdoing, but agreed to refrain from future violations.", "The SEC found that Disney failed to disclose payments to family members of certain directors, including those of Lifetime subsidiary, and former director Thomas Murphy's."], "qwen2.5:0.5b": ["Disney settled charges from US federal regulators, admitting it failed to disclose how family members were employed by Disney.", "Three former directors resigned after 1999-2001: Reveta Bowers, Stanley Gold, and Raymond Watson, left Disney.", "The SEC found that Disney did not disclose financial information related to their children's employment with the subsidiary Air Shamrock and provided more than $200,000 for office space, secretarial services, and a car driver to former Disney director Thomas Murphy."], "qwen2.5:1.5b": ["Disney has settled charges from US federal regulators for allegedly failing to disclose information about family members employed by the company, while continuing to pay them undisclosed salaries over a decade.", "Disney did not admit or deny wrongdoing but agreed to refrain from future violations of securities law.", "The settlement includes disclosure of employment details for directors' families and former employees at subsidiaries and companies they controlled."], "qwen2.5:3b": ["Disney settles charges from US federal regulators for failing to disclose how family members of directors were employed by the company between 1999 and 2001.", "The settlement comes without a fine, but Disney agrees not to violate securities law in the future.", "Three former directors (Bowers, Gold, Watson) have since left, their children were paid undisclosed salaries from subsidiaries, and Air Shamrock subsidiary employed one director's wife.", "Additionally, Disney did not disclose payments for office space and personal use for another former director.", "The Securities and Exchange Commission emphasized shareholders' right to information about relationships between the company and its directors."], "opencoder:1.5b": ["Disney settles disclosure charges.", "Walt Disney has settled charges from US federal regulators that it failed to disclose how family members of directors were employed by the company.", "The media giant was not fined by the Securities and Exchange Commission, but has agreed to refrain from any future violations of securities law.", "Disney failed to tell investors that between 1999 and 2001 it employed three adult children of three then directors.", "The firm has neither admitted nor denied wrongdoing in the settlement.", "The three Disney directors in question in the central matter of the SEC's investigation - Reveta Bowers, Stanley Gold and Raymond Watson - have all since left the company, with Ms Bowers and Mr Watson both retiring, and Mr Gold quitting in 2003.", "Their children were paid between $60,000 (£30,800) and $150,000 a year, with shareholders not being informed.", "The SEC also found that Disney did not disclose that a 50% Disney-owned subsidiary company - Lifetime - employed the wife of current Disney director John Bryson, and that she earned more than $1m a year.", "Disney also failed to disclose payments to Air Shamrock, an airline owned by Mr Gold and fellow former Disney directors Roy Disney.", "Finally, Disney also did not reveal that it provided more than $200,000 annually for office space, secretarial services, and a leased car and driver to former director Thomas Murphy."], "smollm:1.7b": ["Disney settled charges from US federal regulators that it failed to disclose how family members of directors were employed by the company.", "The media giant was not fined, but has agreed to refrain from any future violations of securities law.", "Disney failed to tell investors that between 1999 and 2001 it employed three adult children of three then directors.", "The firm has neither admitted nor denied wrongdoing in the settlement.", "The three Disney directors in question in the central matter of the SEC's investigation - Reveta Bowers, Stanley Gold and Raymond Watson - have all since left the company, with Ms Bowers and Mr Gold both retiring, and Mr Gold quitting in 2003.", "Their children were paid between $60,000 (£30,800) and $150,000 a year, with shareholders not being informed.", "The SEC also found that Disney did not disclose that a 50% Disney-owned subsidiary company - Lifetime - employed the wife of current Disney director John Bryson, and that she earned more than $1m a year.", "Louise Bryson remains with Lifetime.", "Disney also failed to disclose payments to Air Shamrock, an airline owned by Mr Gold and fellow former Disney directors Thomas Murphy and Roy Disney.", "Finally, Disney did not reveal that it provided more than $200,000 annually for office space, secretarial services, and a leased car and driver to former director Thomas Murphy.", "\"Shareholders have a significant interest in information regarding relationships between the company and its directors,\" said SEC deputy enforcement director Linda Thomsen.", "\"Failure to comply with the SEC's disclosure rules in this area impedes shareholders' ability to evaluate the objectivity and independence of directors.\""], "deepseek-r1:1.5b": ["Disney settled its disclosed-dishonesty violation case against the US SEC for failing to disclose employment of three adult children of three then-directors between 1999 and 2001.", "The children were paid $60k-$150k annually and not given shares or info.", "A 50% subsidiary company, Lifetime, employed the wife of current Disney director John Bryson, earning over $1m.", "Disney also didn't disclose $200k annual payments for office space, secretaries, and a leased car/driver to former director Thomas Murphy.", "The SEC concluded that Disney complied by not failing any further but missed key details.", "Shareholders face doubts about the directors' relationships without disclosure."], "tinyllama:1.1b": ["Disney has agreed to refrain from future violations of US securities law after settling charges from regulators that it failed to disclose how family members of former directors were employed by the company.", "The media giant was found to have employed three adult children of three then director's between 1999 and 2001, without disclosing to shareholders that they worked for the company or that they earned more than $1m a year.", "In addition, Disney did not disclose payments made to Air Shamrock, a subsidiary owned by their former director John Bryson, and provided office space, secretarial services and a leased car and driver to Thomas Murphy, a former director.", "The SEC's investigation revealed that these failures constituted a breach of the company's fiduciary duties towards its shareholders."], "tinydolphin:1.1b": [" Disney, the renowned media conglomerate, has come to an agreement with the U.S. Securities and Exchange Commission (SEC) to refrain from any future violations of securities laws.", "In a major settlement involving family members of three then-directors, Disney has revealed that it failed to disclose how direct family members were employed by the company.", "This omission led to significant misinformation among investors and shareholders about Disney's financial dealings.", "However, Disney has made an exceptional gesture in settling the charges.", "The company has agreed not to make any future disclosures of its relationships with direct family members.", "Furthermore, Disney has stated that it will refrain from employing family members of its directors for a period of five years following the payment of penalties.", "This decision is intended to prevent any further violation of securities laws and to maintain transparency in the company's operations.", "The SEC's investigation found that Disney failed to inform shareholders about the relationships between three then-directors, Reveta Bowers, Stanley Gold, and Raymond Watson.", "These individuals had all left the company since 1999.", "The investigators discovered that between 1999 and 2001, Disney employed three adult children of three directors - Reveta Bowers' daughter, Stanley Gold's wife, and Raymond Watson's son.", "These employees were paid between $60,000 (£30,800) and $150,000 a year.", "Furthermore, shareholders were not aware of these payments.", "The SEC further stated that Disney did not disclose that Air Shamrock, an airline owned by the three then-directors, had provided more than $200,000 annually for office space, secretarial services, and a leased car and driver to Thomas Murphy.", "This disclosure would have allowed investors to evaluate the objectivity and independence of these directors.", "In conclusion, Disney has reached an understanding with the SEC that it will refrain from making future disclosures related to its relationships with family members.", "Additionally, Disney is committed to ensuring that any financial information provided to shareholders accurately reflects the company's operations and transactions.", "This decision not only protects investors but also maintains transparency in Disney's business dealings."], "phi:2.7b": [" Walt Disney has settled charges from US federal regulators for failing to disclose how family members of directors were employed by the company between 1999-2001.", "The media giant was not fined but agreed to refrain from future violations of securities law.", "Three directors - Reveta Bowers, Stanley Gold, and Raymond Watson"], "orca-mini:3b": [" Walt Disney Company settled charges from US federal regulators regarding its failure to disclose family members of directors were employed by the company, including paying adult children up to $150,000 per year.", "The media giant did not admit or deny wrongdoing in the settlement and has agreed to refrain from future violations of securities law.", "Three Disney directors, Reveta Bowers, Stanley Gold, and Raymond Watson, have since left the company.", "Their children were paid between $60,000 and $150,000 per year.", "The SEC also found that Disney did not disclose payments to Air Shamrock, an airline owned by former Disney directors Roy Disney, and failed to reveal payments of over $200,000 annually for office space, secretarial services, and a leased car and driver to former director Thomas Murphy."], "hermes3:3b": ["Disney sets securities fine refund, agrees not to violate disclosure laws.", "(Re: Failing to disclose employment of family members of directors)"], "stablelm-zephyr:3b": ["Walt Disney has settled with US federal regulators, avoiding a fine, after being charged for failing to disclose the employment of family members of directors between 1999 and 2001.", "The company will refrain from future violations of securities law.", "Three directors involved in the matter have left the company, with their children's salaries not being disclosed to shareholders.", "Additionally, Disney failed to reveal payments to a subsidiary company and provided excess funds for office space, secretarial services, and leasing.", "The Securities and Exchange Commission (SEC) aims to protect shareholders' ability to evaluate director objectivity and independence."], "chatgpt-4o-latest": ["Disney settled charges from US regulators for failing to disclose employment of directors' family members between 1999 and 2001.", "The SEC did not fine Disney but required it to avoid future securities law violations.", "Three former directors' children were paid between $60,000 and $150,000 annually without shareholder disclosure.", "Additionally, Disney did not disclose that a subsidiary employed a director’s wife with a salary exceeding $1 million.", "Other undisclosed payments included funds to an airline owned by former directors and over $200,000 annually for office space and services for a former director.", "The SEC emphasized the importance of transparency in evaluating directors' independence."], "stablelm2:1.6b": ["Walt Disney settled charges from the Securities and Exchange Commission for failing to disclose employment relationships between family members of directors, without admitting or denying wrongdoing.", "The company agreed not to violate securities law, but failed to inform investors about three director's children who were employed between 2016 and 2018.", "SEC found other instances where Disney failed to disclose payments to an owned subsidiary, the wife of a current director, and provided office space, secretarial services, and a car to another former director.", "The settlement shows that shareholders have a right to evaluate if directors are objective and independent based on disclosure information."], "granite3.1-dense:2b": ["Disney has agreed to a settlement with US federal regulators, the Securities and Exchange Commission (SEC), for failing to disclose employment relationships between family members of directors.", "The company failed to inform investors about compensation given to adult children of three then-directors (Reveta Bowers, Stanley Gold, and Raymond Watson) and the wife of current director John Bryson, who earned over $1m annually.", "Disney also neglected to disclose payments to Air Shamrock, an airline owned by former directors Roy Disney and Gold, and provided more than $200,000 annually for office space, secretarial services, and a leased car for Thomas Murphy, a former director.", "The SEC's deputy enforcement director emphasized the importance of disclosure in enabling shareholders to assess the objectivity and independence of directors.", "Disney did not admit or deny wrongdoing as part of the settlement."]}