{"raw_text": "Putin backs state grab for Yukos\n \n Russia's president has defended the purchase of Yukos' key production unit by state-owned oil firm Rosneft, saying it followed free market principles.\n \n Vladimir Putin said it was quite within the rights of a state-owned company to ensure its interests were met. Rosneft bought 100% of Baikal Finance Group, in a move that amounts to the renationalisation of a major chunk of Russia's booming oil industry. Rosneft will now control about 16% of Russia's total crude oil output. Yukos share jumped in Moscow, climbing as much as 50% before being suspended.\n \n Rosneft is already in the process of merging with Gazprom, the world's biggest gas company, a move that will see Gazprom return to majority state-ownership.\n \n Baikal was the surprise buyer of oil and gas giant Yukos's main production division at a forced auction on Sunday. \"Everything was done by market methods,\" Mr Putin said at his year-end press conference in Moscow. Shedding some light on the Kremlin's motivation, Mr Putin referred to a period of so-called \"cowboy capitalism\" that followed the collapse of the Soviet Union.\n \n He said privatisations carried out in the early 1990s had involved trickery, including law breaking, by people seeking to acquire valuable state property. \"Now the state, using market methods, is safeguarding its interests. I think this is quite normal,\" the Russian president said. A Rosneft spokesman has said the acquisition is part of its plan to build a \"balanced, national energy corporation.\"\n \n The latest announcement comes after more than a year of wrangling that has pushed Yukos, one of Russia's biggest companies to the brink of collapse. The Russian government put Yukos's Yuganskneftegas subsidiary up for sale last week after hitting the company with a $27bn (£14bn) bill for back taxes and fines.\n \n Analysts say that Yukos's legal attempts to block the auction by filing for bankruptcy protection in the US are probably what caused this week's cloak-and-dagger dealings. Gazprom, the company originally tipped to buy Yuganskneftegas, was banned from taking part in the auction by a US court injunction. By selling the Yukos unit to little-known Baikal and then to Rosneft, Russia is able to circumvent a host of tricky legal landmines, analysts said. \"You cannot sue the Russian government,\" said Eric Kraus, a strategist at Moscow's Sovlink Securities. \"The Russian government has sovereign immunity.\" \"The government is renationalising Yuganskneftegas.\"\n \n Even so, analysts reckon that the saga still has a long way to go. The Rosneft announcement came just hours after Yukos accused Gazprom of illegally taking part in Sunday's auction. It has said it will be seeking damages of $20bn. The claim was made at the latest hearing in the US bankruptcy court in Houston, Texas, where Yukos, had filed for Chapter 11 bankruptcy protection. If found in contempt of the US court order blocking the auction, Gazprom could face having foreign assets seized. Yukos' lawyers had also been expected to try to have Baikal's assets frozen. Lawyers claimed the auction was illegal because Yukos - with an office in Houston - had filed for bankruptcy and therefore its assets were under the protection of US law which has worldwide jurisdiction. Further muddying the waters is a merger between Rosneft and Gazprom which authorities have said will go ahead as planned.\n", "llama3.2:1b": ["Putin defends purchase of Yukos' key production unit by state-owned oil firm Rosneft, saying it follows free market principles.", "The acquisition was made after Russia's government put Yukos's Yuganskneftegas subsidiary up for sale due to back taxes and fines.", "Analysts say Russia is circumventing legal landmines by selling the unit to Baikal Finance Group through a US court injunction and renationalizing the company."], "llama3.2:3b": ["Putin defends purchase of Yukos' production unit by state-owned oil firm Rosneft, saying it followed free market principles.", "Rosneft bought 100% of Baikal Finance Group, renationalizing a major chunk of Russia's booming oil industry.", "Putin referred to a period of \"cowboy capitalism\" following the Soviet Union's collapse and said the state is now safeguarding its interests using market methods.", "The move comes after over a year of wrangling that pushed Yukos to the brink of collapse, with analysts saying Russia is able to circumvent legal landmines by selling to little-known companies before buying back from Rosneft."], "gemma2:2b": ["Vladimir Putin defended the state-owned Rosneft's purchase of Yukos' main production unit, claiming it was a legitimate exercise to safeguard Russian interests following years of private company misconduct after the collapse of the Soviet Union.", "Rosneft now controls 16% of Russia's oil output and will merge with Gazprom.", "The move follows Yukos' near-collapse due to back taxes and fines, leaving them vulnerable to government intervention.", "Legal battles between Yukos, Gazprom, and the Russian government have entangled the situation, with legal claims for damages made against various parties involved.", "Despite this, experts foresee a lengthy process ahead, as the merger with Gazprom will proceed while legal disputes are settled."], "qwen2.5:0.5b": ["Russian President Vladimir Putin defended the purchase of Yukos' key production unit by Rosneft, saying it followed free market principles and that Rosneft would now control about 16% of Russia's total crude oil output.", "The latest news came after more than a year of wrangling that pushed Yukos to the brink of collapse.", "Analysts say Russian government attempts to block auction sold its legal attempt, filing for bankruptcy protection in US court.", "Yuganskneftegas subsidiary was sold to little-known Baikal and then Rosneft.", "Russia can circumvent tricky landmines thanks to a \"balanced, national energy corporation\" led by Rosneft.", "Russian government's sovereign immunity: The government has no legal right to sue the Russian government even in bankruptcy court in US.", "Yugoslav ex-corporation Yenchevskaya Dukhina (YD) will continue its operations as well."], "qwen2.5:1.5b": ["Putin defends state purchase of Yukos unit, citing free market principles; Rosneft acquires key production division from bankrupt Yukos subsidiary, aimed at circumventing legal challenges while renationalizing major oil industry stake."], "qwen2.5:3b": ["Putin supports state acquisition of Yukos' key production unit by Rosneft, viewing it as following free market principles.", "Rosneft's move renationalises a significant portion of Russia's oil industry.", "Putin references the period of \"cowboy capitalism\" post-Soviet collapse and emphasizes the state safeguarding its interests through market methods.", "Despite legal attempts to block the auction, Yukos is now under state control with Baikal Finance Group as intermediary before Rosneft acquisition.", "Analysts highlight tricky legal hurdles circumvented, including sovereign immunity claims by Russia's government.", "The saga shows continued conflict between Yukos and Gazprom, with further complex plans for a merger between Gazprom and Rosneft complicating the situation."], "opencoder:1.5b": ["This summary preserves the key ideas and details from the original text: \"Russia's president has defended the purchase of Yukos' key production unit by state-owned oil firm Rosneft, saying it followed free market principles.", "Baikal was the surprise buyer of oil and gas giant Yukos's main production division at a forced auction on Sunday.\"", "This conveys that in response to the acquisition of Rsneft by the Russian government, Yugoslavia, an entity known for its unique blend of foreign policy and corporate strategy, has successfully renationalized its oil industry.", "The subsequent announcement by the President of the United States, Yuri Gagarin, is a significant part of this transformation."], "smollm:1.7b": ["The summary should be:\n\"Russia's president backs state-owned oil firm's bid to buy key production unit by state-owned oil firm.\""], "deepseek-r1:1.5b": ["Putin defended the state-granted purchase of Baikal Finance Group by Rosneft, arguing it aligns with free market principles.", "Rosneft now controls 16% of Russia's crude oil output after buying 100% of Baikal Finance Group.Rosneft is merging with Gazprom to return Gazprom to majority state ownership, a move expected to enhance energy security.", "The sale of Yukos' main production division was prompted by the $27bn tax bill and government auction.", "analysis suggests legal challenges from Yukos over bankruptcy protections hindered operations.", "Analysts note that Rosneft's announcement came hours after Yukos accused Gazprom of involvement in the forced auction, demanding damages.", "Although some moves like the merger are planned, there's still work to be done for Yukos' collapse."], "tinyllama:1.1b": ["The Russian president, Vladimir Putin, defended the state-takeover of Yukos' key production unit after being accused by the company itself of 'illicit' activities, following the purchase of 100% of Baikal Finance Group.", "The move was described as a 'renationalisation' of Russia's oil industry and a 'restructuring' by Putin, who also said that this would not have to happen if the state wasn't doing so well financially.", "Meanwhile, Gazprom, Russia's biggest oil company, is already in merger with Gazprom, which will see Gazprom return to majority-state ownership after a process of 'major nationalisations'.", "The Russian government has filed legal claims against Yukos for back taxes and fines totaling $27 billion, leading to the legal battle leading up to the sale of YuKan's subsidiary, YuGan.", "Despite this, Putin argued that the auction was legitimate because the company had been placed under bankruptcy protection in the US and therefore its assets were being protected by US law.", "The move came after a year-long legal battle that saw Yukos, one of Russia's biggest companies, to the brink of collapse.", "Meanwhile, Gazprom has filed for bankruptcy protection in Houston and is set to merge with Russian oil giant Rosneft, which authorities have said will go ahead as planned."], "tinydolphin:1.1b": [" Summarize: The Russian government successfully renationalized Yukos's oil production unit by purchasing it from state-owned Rosneft, in a deal aimed at ensuring its interests.", "This follows the free market principles of the Russian economy and is seen as part of Putin's attempt to remake Russia into a more market-oriented nation.", "Meanwhile, Yukos share prices soared after the acquisition, with some speculating that the Kremlin was seeking to distract investors and maintain control over oil production."], "phi:2.7b": [" Putin defends state-owned company's purchase of Yukos' key production unit, stating it followed free market principles.", "Rosneft, a state-owned oil firm, bought 100% of Baikal Finance Group, renationalizing a major chunk of Russia'S oil industry.", "The move will allow Rosneft to control about 16% of Russian's total crude oil output.", "Putin claims the acquisition was done by free market methods and is a normal practice for the state-owned company.", "However, Yukos had filed bankruptcy protection in the US, leading to a complex legal battle between Gazprom, the company originally tipped to buy Yuganskneftegas, and Rosneft.", "The latest announcement came after more than a year of wrangling that pushed Yukos to the brink of collapse.", "Analysts say that the complicated legal proceedings were due to Yukos' attempts to block the auction by filing for bankruptcy protection in the US.", "By selling the unit to little-known Baikal and then to Rosneft, Russia is able to avoid any lawsuits against the government.", "However, the saga still has a long way to go as Gazprom accused Rosneft of illegally taking part in the auction.", "If found guilty, Gazprom could face having its foreign assets seized.", "Yukos' lawyers also claimed that Baikal's assets should be frozen.", "The latest developments have left many analysts scratching their heads and questioning what will happen next."], "orca-mini:3b": [" Russia's President Vladimir Putin has defended the purchase of Yukos' key production unit by state-owned oil firm Rosneft, saying it followed free market principles.", "Rosneft bought 100% of Baikal Finance Group at a forced auction on Sunday.", "The move amounts to the renationalization of a major chunk of Russia's booming oil industry and follows Gazprom's ban from participating in the auction by a US court injunction.", "Yukos' lawyers claimed that the auction was illegal because Yukos had filed for bankruptcy protection in the US and its assets were under the protection of US law which has worldwide jurisdiction.", "Rosneft is already in the process of merging with Gazprom, which will see Gazprom return to majority state-ownership."], "hermes3:3b": ["Putin supports Russia's state buyout of Yukos key production unit by Rosneft, claiming it follows free market principles after privatisations in early 1990s were deemed law-breaking."], "stablelm-zephyr:3b": ["Russia's President, Vladimir Putin, defended the purchase of Yukos' key production unit by state-owned oil firm, Rosneft, stating that it followed free market principles.", "This acquisition led to the renationalization of a major part of Russia's booming oil industry, with Rosneft controlling 16% of the country's total crude oil output.", "In addition, Rosneft is merging with Gazprom, the world's largest gas company, which will result in Gazprom returning to majority state-ownership.", "This acquisition came after over a year of conflict involving Yukos, one of Russia's biggest companies, and the Russian government imposing a $27bn bill for back taxes and fines on it.", "Analysts predict that this saga still has further developments ahead."], "chatgpt-4o-latest": ["President Vladimir Putin defended the state-owned Rosneft's acquisition of Yukos' key production unit, stating it adhered to free market principles.", "Rosneft's purchase of Baikal Finance Group, which had unexpectedly won the auction for Yukos' main division, effectively renationalized a significant portion of Russia's oil industry.", "This move strengthens state control, with Rosneft set to merge with Gazprom, returning it to majority state ownership.", "Putin justified the acquisition as a correction of the dubious privatizations of the 1990s.", "The sale followed a $27 billion tax claim against Yukos, pushing it toward collapse.", "Analysts suggest the maneuver helped Russia bypass legal challenges, as the government has sovereign immunity.", "However, Yukos has accused Gazprom of illegal involvement and is seeking $20 billion in damages in a US bankruptcy court, which could lead to asset seizures.", "The legal battle is expected to continue, further complicating the situation."], "stablelm2:1.6b": ["Russia's President Vladimir Putin defended the state-owned company Rosneft's acquisition of Yukos' key production unit, stating that it followed free market principles.", "This move involves Rosneft acquiring 25% of Baikal Finance Group, which amounts to the renationalization of a major portion of Russia's oil industry.", "As part of this plan, Rosneft aims to build a \"balanced, national energy corporation.\"", "The situation began when the Russian government put Yukos' subsidiary up for sale due to hefty back taxes and fines.", "Analysts believe that the auction was not only legal but also necessary in order to avoid complicated legal landmines."], "granite3.1-dense:2b": ["Russian President Vladimir Putin defended the acquisition of Yukos' key production unit by state-owned oil firm Rosneft, asserting it adhered to market principles following post-Soviet privatization practices marked by fraud and lawbreaking.", "The deal, which has resulted in Rosneft controlling approximately 16% of Russia's crude oil output, involved the purchase of Baikal Finance Group from Yukos' bankrupt assets at a forced auction.", "This move is part of Rosneft's strategy to establish a balanced, national energy corporation.", "The transaction bypassed legal challenges and US court injunctions banning Gazprom, originally intended for the acquisition, due to Russia's sovereign immunity.", "However, tensions persist as Yukos claims Gazprom illegally participated in the auction and seeks $20 billion in damages.", "Despite these disputes, a planned merger between Rosneft and Gazprom is expected to proceed as arranged."]}