{"raw_text": "US firm pulls out of Iraq\n \n A US company has pulled out of a major contract to rebuild Iraq's transport system after attacks on reconstruction efforts, Pentagon officials have said.\n \n Contrack International, of Arlington, Virginia, heads a coalition of firms working on a series of schemes. Its withdrawal from the $325m (£170m) contract in November is thought to be the largest cancellation to date. Contrack said \"the original scope of work that was envisioned could not be executed in a cost-effective manner\". But the firm denied reports it was withdrawing completely from Iraq. \"Members of the joint venture including Contrack are committed to the ongoing reconstruction efforts, are actively working in Iraq and continue to look for new construction opportunities in the country,\" it said in a statement. The Pentagon's Project and Contract Office (PCO) in Baghdad said it had taken over Contrack's management of the subcontractors working on the transportation projects.\n \n US firms and their workers have been targets of attacks, and security concerns are said to be a major reason for the slow pace of reconstruction in Iraq. Of the $18.4bn in reconstruction funds approved by Congress, less than $2bn has been spent. Lt Col Eric Schnaible of the PCO told the Associated Press news agency Contrack's withdrawal from the transportation contract was a \"mutually agreed-to separation\" and did not indicate a movement by US companies to leave Iraq. \"Some parts of the country are a whole lot more permissive than others,\" he added. \"Where we can get the work done, good things are happening.\"\n", "llama3.2:1b": ["US firm Contrack International pulls out of $325m contract in Iraq due to cost concerns.", "The withdrawal is considered the largest cancellation to date and was reportedly agreed upon between US companies.", "Despite security concerns and slow reconstruction efforts, Pentagon officials claim Contrack's departure did not indicate a shift by US companies from Iraq."], "llama3.2:3b": ["A US company, Contrack International, has withdrawn from a $325m contract to rebuild Iraq's transport system due to security concerns and attacks on reconstruction efforts.", "The Pentagon has taken over management of subcontractors working on transportation projects."], "gemma2:2b": ["A US firm, Contrack International, has withdrawn from a $325 million contract to rebuild Iraq's transportation system due to security concerns.", "The withdrawal is the largest cancellation to date but the firm denies it means leaving Iraq entirely and remains committed to reconstruction efforts.", "The Pentagon now manages subcontractors for the project.", "Security concerns have slowed down reconstruction in Iraq, with less than 2 billion dollars spent out of the $18.4 billion allocated by Congress."], "qwen2.5:0.5b": ["US company Contrack International pulled out of a contract to rebuild Iraq's transport system after attacks on reconstruction efforts in November.", "The Pentagon claimed Contrack was withdrawing completely from Iraq but denied it."], "qwen2.5:1.5b": ["A major US company has pulled out of a $325 million contract for rebuilding Iraq's transport system, citing cost concerns and security issues as reasons for its withdrawal from the project.", "The Pentagon is taking over Contrack's management of subcontractors working on the transportation projects in Iraq."], "qwen2.5:3b": ["US firm Contrack International withdraws from $325m contract in Iraq's transport system after attacks on reconstruction efforts.", "The withdrawal is thought to be the largest cancellation so far.", "Contrack denies complete departure but maintains it could not execute work effectively due to security concerns.", "Pentagon's Project and Contract Office now manages subcontractors' ongoing projects.", "While some areas are relatively safe, progress remains slow with less than $2bn out of approved $18.4bn reconstruction funds spent.", "Lt Col Schnaible suggests withdrawal does not indicate US companies leaving Iraq entirely."], "opencoder:1.5b": ["The US firm pulls out of Iraq is a matter of concern for the Pentagon, as it may be affecting the reconstruction efforts aimed at the country's infrastructure.", "The company has pulled out of a major contract to rebuild Iraq's transport system after attacks on reconstruction efforts.", "The Pentagon officials have indicated concerns about the possible economic and operational impact of the withdrawal process.", "They said they could not deny reports that the withdrawal was not withdrawn completely from Iraq, but the firms involved in the project are committed to ongoing reconstruction efforts, working in Iraq, and seeking new construction opportunities in the country.", "The Pentagon's Project and Contract Office (PCO) has taken over management of the subcontractors working on the transportation projects.", "The company’s workers have been targets of attacks and security concerns, further prompting concern about the slow pace of reconstruction in Iraq.", "Of $18.4bn in approved reconstruction funds, only a fraction of the $2bn has been spent, indicating less financial investment compared to what was agreed upon by Congress.", "Concerns about the mutual agreement on withdrawal from the transportation contract indicate a clear commitment by US companies to leave Iraq.", "The statement from Contrack's PCO emphasizes the importance of this \"mutually agreed-to separation\" and indicates that some parts of the country are more permissive than others in their capacity as security guardians."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details:\n\n1.", "The US firm pulled out of a major contract to rebuild Iraq's transport system after attacks on reconstruction efforts.", "2.", "A US company has withdrawn from a major contract to rebuild Iraq's transport system after attacks on reconstruction efforts.", "3.", "Contrack International, of Arlington, Virginia, heads a coalition of firms working on a series of schemes and said it withdrew from the $325m (£170m) contract in November.", "4.", "The US firm denied reports it was withdrawing completely from Iraq.", "Instead, it said it had taken over Contrack's management of the subcontractors working on transportation projects.", "5.", "Security concerns are said to be a major reason for the slow pace of reconstruction in Iraq.", "Of the $18.4bn in reconstruction funds approved by Congress, less than $2bn has been spent.", "6.", "Lt Col Eric Schnaiberger of the PCO told the Associated Press news agency Contrack's withdrawal from the transportation contract was a \"mutually agreed-to separation\" and did not indicate a movement by US companies to leave Iraq.", "7.", "Some parts of the country are a whole lot more permissive than others, where US firms can get the work done, good things are happening."], "deepseek-r1:1.5b": ["The Pentagon has decided not to pull out of the $325 million transportation contract in Iraq following attacks on its reconstruction efforts.", "This is considered a significant cancellation since last year.", "A coalition led by Contrack International, based in Arlington, Virginia, heads this effort, which involves various development schemes.", "Despite refusing to completely withdraw from Iraq, Contrack stated their commitment to ongoing reconstruction efforts and active involvement with the country.", "The Pentagon's Management Office in Baghdad has taken over Contrack's management of subcontractors for transportation projects.", "US firms have been targets of attacks, exacerbating security concerns and a slow pace of Reconstruction in Iraq.", "Less than $2 billion out of the $18.4 billion approved by Congress has been spent, with some parts of Iraq being more welcoming regions.Lt Col. Eric Schnaible from PCO noted that some areas are less restrictive, highlighting positive aspects despite the contract's cancellation."], "tinyllama:1.1b": ["A US company has pulled out of a reconstruction project in Iraq, citing safety concerns after attacks on workers and contractors involved in building transport infrastructure.", "The Contrack International coalition has been working on various schemes but announced its decision to withdraw from the $325m contract.", "It is thought that other companies are still actively involved in Iraq's reconstruction efforts, while US firms are now more cautious due to safety concerns.", "Despite the slow pace of reconstruction, a security concern has been the target of attacks, and the lack of funds has been one major reason for the low level of spending so far.", "Some companies have agreed to separate from Iraq in order to focus on other areas where there is more support for US interests."], "tinydolphin:1.1b": [" US firm Contrack International has pulled out of a major contract to rebuild Iraq's transport system after attacks on reconstruction efforts.", "The decision to pull out is seen as the largest cancellation in a long time, and it might be the reason why some projects have not yet begun.", "Despite the fact that Contrack initially envisioned a cost-effective way of working, they had to change their plans due to security concerns.", "This comes amid escalating attacks on American workers and facilities in Iraq.", "The situation is said to make it challenging for companies like Contrack to continue working on reconstruction projects, despite the importance of those initiatives."], "phi:2.7b": [" Contrack International has pulled out of a major contract to rebuild Iraq's transport system due to attacks on reconstruction efforts and cost-effectiveness.", "The Pentagon's Project and Contract Office (PCO) in Baghdad is taking over management of subcontractors working on transportation projects.", "US firms have been targeted by attacks, but the PCO said Contrack' s withdrawal does not indicate a move by US companies to leave Iraq."], "orca-mini:3b": [" A US company, Contrack International, pulled out of a $325 million contract to rebuild Iraq's transport system due to security concerns and the need for cost-effective projects.", "The withdrawal was reported to be the largest cancellation to date.", "However, the firm denied reports of complete withdrawal and said it was committed to ongoing reconstruction efforts in Iraq, with some projects still underway.", "Security concerns are cited as a major reason for slow progress in reconstruction.", "Less than $2 billion out of a total of $18.4 billion approved by Congress has been spent so far."], "hermes3:3b": ["US company Contrack leaves $325m Iraq transport system contract over cost-effective execution issues."], "stablelm-zephyr:3b": ["A US company called Contrack International has withdrawn from a major contract in Iraq worth $325m to rebuild their transport system.", "They did this because attacks on reconstruction efforts made it hard to do the work well and fairly cheaply.", "However, they denied that they were leaving Iraq altogether.", "Other American companies and workers have faced security issues, which makes rebuilding Iraq slower than expected.", "Only about $2bn out of the approved $18.4bn has been spent so far."], "chatgpt-4o-latest": ["A US company, Contrack International, has withdrawn from a $325 million contract to rebuild Iraq's transport system due to security concerns, marking the largest cancellation to date.", "The firm cited cost-effectiveness issues but denied a complete withdrawal from Iraq, stating it remains committed to reconstruction efforts.", "The Pentagon's Project and Contract Office in Baghdad has taken over management of subcontractors.", "Security threats have slowed reconstruction, with only a small portion of the $18.4 billion approved by Congress spent.", "Officials insist Contrack's exit does not signal a broader US company withdrawal, emphasizing progress in safer areas."], "stablelm2:1.6b": ["US company Contrack pulls out of Iraq's transport system reconstruction due to attacks and security concerns, but denies completely withdrawing from the project.", "The largest cancellation in history occurred when Contrack said it couldn..", "The US firm denied reports claiming a full withdrawal from Iraq.", "According to a statement by Contrack, they could not execute the original scope of work within a cost-effective manner.", "However, the firm remains committed to ongoing reconstruction efforts and active in Iraq.", "Security concerns are cited as major reasons for slow pace of reconstruction in Iraq.", "Only 25% ($400 million) of $800 million approved by Congress has been spent on reconstruction thus far.", "Lt Col Eric Schnaible of the Pentagon's Project and Contract Office stated that Contrack's withdrawal from the transportation contract was a mutually agreed-to separation, indicating no intention for US companies to leave Iraq.", "He commented that in areas where work is possible, progress is happening."], "granite3.1-dense:2b": ["Conttrack International, a US firm leading a coalition in Iraq's $325m transport system reconstruction project, has withdrawn from its contract due to security risks and cost-effectiveness issues.", "This marks one of the largest contract cancellations to date.", "Despite this, Contrack maintains commitment to ongoing reconstruction efforts and new construction opportunities in Iraq.", "The Pentagon's Project and Contract Office took over management of the subcontractors following the withdrawal.", "Security concerns and attacks on US firms have hindered Iraq's reconstruction progress, with less than 2% of $18.4bn approved for reconstruction having been spent.", "Lt Col Eric Schnaible stated that Contrack's departure was a mutually agreed-to separation and did not signal a broader US company exit from Iraq, acknowledging varying levels of permissibility across the country where projects can be successfully executed."]}