{"raw_text": "Jarvis sells Tube stake to Spain\n \n Shares in engineering group Jarvis have soared more than 16% on news that it is offloading its stake in London underground consortium Tube Lines.\n \n The sale of the 33% stake to Spain's Ferrovial for £146m ($281m) is a lifeline to Jarvis, which was weighed down by debts of more than £230m. The company recently warned it could go under if it did not secure a refinancing deal by mid-January 2005. But now its banks have agreed to extend its credit facilities until March 2006.\n \n The company also said it had agreed terms over the completion of 14 of its biggest construction projects under the government's Private Finance Initiative (PFI).\n \n Jarvis wants to scale back the division, which has proved too costly and has been blamed for many of its problems. Instead, it plans to focus on UK rail renewal, roads and plant hire work. Madrid-based Ferrovial already holds a 33% stake in Tube Lines, which maintains the Jubilee, Northern and Piccadilly lines. The Spanish group has been keen to snap up more UK infrastructure assets, having bought Amey in 2003. Jarvis said the sale, which raked in more than the £100m analysts had expected, would \"substantially\" enhance its financial position. \"I am now confident that we can now move forward in 2005 towards rebuilding Jarvis and return it to growth as a profitable business,\" said chief executive Alan Lovell. Shares in Jarvis were up more than 16% to 18 pence by the close of trade on Friday.\n", "llama3.2:1b": ["Jarvis sells stake in Tube Lines to Spain's Ferrovial for £146m, securing its refinancing deal until March 2006 and extending its credit facilities.", "The sale will help alleviate debts of over £230m and allow Jarvis to focus on UK rail renewal, roads, and plant hire work instead of construction projects."], "llama3.2:3b": ["Jarvis sells 33% stake in Tube Lines to Ferrovial for £146m, avoiding potential bankruptcy and securing credit facilities until March 2006.", "The sale is part of Jarvis' plan to scale back its underperforming division and focus on UK rail renewal, roads, and plant hire work."], "gemma2:2b": ["Jarvis sold its 33% stake in Tube Lines to Spain's Ferrovial for £146 million, providing financial relief and allowing Jarvis to focus on UK rail renewal, roads, and plant hire.", "This deal followed Jarvis's warning of potential insolvency due to debt exceeding £230 million and enabled a credit facility extension until March 2006."], "qwen2.5:0.5b": ["Shares in London-based engineering group Jarvis rose more than 16% following news that the company sold its 33% stake to Spain's Ferrovial for £146m, which is seen as a lifeline despite the financial strain it faces from debts and refinancing difficulties.", "The sale aims to bolster Jarvis' finances by allowing it to focus on UK infrastructure projects such as construction of Jubilee, Northern and Piccadilly lines, while keeping a 33% stake in Tube Lines, which has seen its debt level rise to more than £230m.", "Ferrovial holds a 33% stake in the project but remains committed to securing refinancing until mid-January, while Jarvis plans to focus on UK rail renewal and road construction rather than expanding into new markets.", "The company's stock price has surged by more than 16% since its opening in trade, reaching an all-time high of $18 by Friday afternoon."], "qwen2.5:1.5b": ["Engineering group Jarvis sells stake in Tube Lines consortium to Spanish company Ferrovial for £146m, increasing share price and securing a refinancing deal until March 2006."], "qwen2.5:3b": ["Jarvis, struggling with £230m debts, has sold its 33% stake in London Underground consortium Tube Lines for £146m ($281m) to Spain's Ferrovial.", "This sale is expected to significantly improve Jarvis' financial position.", "The company plans to focus on UK rail renewal, roads, and plant hire work instead of the troubled construction division.", "Ferrovial, which already owns a 33% stake in Tube Lines, has been acquiring more UK infrastructure assets.", "The sale's success exceeded initial expectations, with shares rising over 16%.", "Alan Lovell, Jarvis' CEO, is now optimistic about rebuilding the company for profitable growth in 2005."], "opencoder:1.5b": ["Jarvis, having sold its stake in London underground consortium Tube Lines, has agreed terms over the completion of several of its biggest construction projects under the government's Private Finance Initiative (PFI).", "The company wants to scale back its division and focus on UK rail renewal, roads and plant hire work.", "It plans to extend its credit facilities until March 2006, saying it \"will 'substantially' enhance Jarvis's financial position.\"", "Despite the perceived higher risk of bankruptcy, the company is confident that it can continue operating with strong growth prospects."], "smollm:1.7b": ["The summary is concise, yet captures the main points of the text:\n\n1.", "The sale of the Tube stake to Spain has lifted Jarvis's financial position and provided a lifeline for the company.", "2.", "The sale was negotiated with Ferrovial, which agreed to extend its credit facilities until March 2006.", "3.", "The company also said it had agreed terms over the completion of 14 of its biggest construction projects under the government's PFI scheme.", "4.", "Jarvis wants to focus on UK rail renewal, roads and plant hire work instead of its current division.", "5.", "Madrid-based Ferrovial already holds a 33% stake in Tube Lines, which maintains the Jubilee, Northern and Piccadilly lines.", "6.", "The Spanish group has been keen to snap up more UK infrastructure assets, having bought Amey in 2003.", "7.", "Jarvis said the sale would \"substantially\" enhance its financial position.", "8.", "I am now confident that we can now move forward in 2005 towards rebuilding Jarvis and return it to growth as a profitable business."], "deepseek-r1:1.5b": ["Jarrold has sold a 33% stake in its engineering group Jarvis to Ferrovial, which is based in Spain.", "The sale of the investment was made for £146 million (€281 million), giving Jarrold a lifeline from its debts exceeding £230 million.", "Ferrovial is willing to extend credit facilities with its banks until March 2006.Jarrold aims to focus on reordering projects under the Private Finance Initiative and has agreed terms for completing 14 of its major construction tasks.", "Ferrovial holds a 33% stake in Tube Lines, which owns key railway routes like Jubilee, Northern, and Piccadilly.", "Jarrold's share price increased by over 16%, reaching around £0.18 per share on Friday.", "The CEO, Alan Lovell, stated Jarrold is confident it can proceed to recover from its financial struggles into 2005, returning to a profitable business."], "tinyllama:1.1b": ["Jarvis has sold its stake in Tube Line consortium to Spain's Ferrovial for £146m ($281m) as a life-line to help it avoid bankruptcy, and now the company is seeking to scale back its UK rail projects.", "Jarvis said it agreed terms over the PFI projects being completed under the government's Private Finance Initiatve (PFI), which has proved too costly, but has been blamed for many of its problems.", "The company plans to focus on UK rail renewal and roads work instead.", "Jarvis also announced plans to cut its construction division by around 25%, blaming over-exuberance and many problems in projects that have resulted in the loss of £100m ($208m) in analysts' estimates."], "tinydolphin:1.1b": [" Jarvis, a well-known UK engineering company, has announced that its stake in London's underground consortium Tube Lines is being sold to Spanish conglomerate Ferrovial for £146 million ($281 million).", "This transaction could be considered as a lifeline for Jarvis, which was burdened with debts of more than £230 million.", "Due to the company's financial woes, it warned in November that it might go under if it didn't secure a refinancing deal by January 15th.", "However, the extension of credit facilities has given Jarvis hope for the future.", "The company has agreed terms over 14 of its biggest construction projects under the government's Private Finance Initiative (PFI).", "Despite being in financial difficulties, Jarvis plans to scale back its operations and focus on UK rail renewal, roads, and plant hire work.", "This announcement is a significant step towards rebuilding the company from the ashes of its previous management's mismanagement.", "The Spanish group, Ferrovial, has acquired a 33% stake in Tube Lines while Jubilee, Northern, and Piccadilly lines are under the ownership of Amey."], "phi:2.7b": [" The engineering group Jarvis has sold its 33% stake in London underground consortium Tube Lines to Spain's Ferrovial for £146m.", "This is a lifeline for Jarvis, which had debts of more than £230m and was struggling to secure a refinancing deal by mid-January 2005.", "The sale will help Jarvis focus on UK rail renewal, roads, and plant hire work instead of the costly division it has been burdened with.", "Ferrovial already holds a 33% stake in Tube Lines and is interested in purchasing more UK infrastructure assets.", "The sale will significantly improve Jarvis' financial position and enable the company to move forward towards rebuilding itself as a profitable business.", "Shares in Jarvis have surged more than 16% to 18 pence by the close of trade on Friday."], "orca-mini:3b": [" Engineering group Jarvis has sold its stake in London underground consortium Tube Lines to Spain's Ferrovial for £146m ($281m), which will help it repay debts of more than £230m.", "The sale will also significantly enhance the company's financial position, and Jarvis plans to focus on UK rail renewal, roads, and plant hire work in 2005.", "Analysts had expected the deal to raise more than the £100m that was originally anticipated."], "hermes3:3b": ["Jarvis sells 33% Tube Lines stake to Ferrovial for $281m, reducing debt and boosting finances."], "stablelm-zephyr:3b": ["Jarvis, an engineering group, sold its 16.7% stake in Tube Lines to Spain's Ferrovial for £146m ($281m).", "This deal helps Jarvis, which was struggling with over £230m worth of debts, by allowing its banks to extend credit facilities until March 2006.", "The company also agreed on the completion of 14 significant construction projects under the UK government's Private Finance Initiative (PFI).", "Jarvis plans to focus on UK rail renewal, roads, and plant hire work after scaling back divisions that were costly and caused many issues."], "chatgpt-4o-latest": ["Jarvis has sold its 33% stake in London Underground consortium Tube Lines to Spain's Ferrovial for £146m, providing a financial lifeline as it faced debts exceeding £230m.", "The sale exceeded analysts' expectations and helped secure an extension of its credit facilities until March 2006.", "Jarvis also reached agreements on completing major construction projects under the government's Private Finance Initiative.", "The company plans to scale back costly divisions and focus on UK rail renewal, roads, and plant hire.", "Ferrovial, which already owns 33% of Tube Lines, continues expanding its UK infrastructure holdings.", "Jarvis' CEO expressed confidence in rebuilding the company, and its shares rose over 16% to 18 pence."], "stablelm2:1.6b": ["Engineering group Jarvis sells a 13.8% stake in London underground consortium Tube Lines to Spain's Ferrovial for £79 million, providing a lifeline amidst debts of over £25 million.", "The sale will enhance its financial position and enable it to focus on UK rail renewal, roads, and plant hire work rather than scaling back the costly division."], "granite3.1-dense:2b": ["Jarvis, an engineering firm, sold its 33% stake in Tube Lines—a London underground consortium—to Spain's Ferrovial for £146m ($281m).", "This deal serves as a financial lifeline for Jarvis, which was burdened with debts exceeding £230m.", "The sale allows Jarvis to secure extended credit facilities until March 2006 and marks the completion of 14 major PFI projects.", "To streamline operations, Jarvis aims to reduce its involvement in Tube Lines' costly division, focusing instead on UK rail renewal, road construction, and plant hire work.", "Chief Executive Alan Lovell expressed confidence in rebuilding Jarvis as a profitable business following this transaction, which generated more than the anticipated £100m.", "As a result, Jarvis' share price surged over 16% to 18 pence per share by the end of trading on Friday."]}