{"raw_text": "Air Jamaica back in state control\n \n The Jamaican government is regaining control of Air Jamaica in an bid to help the ailing company out of its financial difficulties.\n \n The firm has failed to make money since the state sold a majority stake to hotel tycoon Gordon Stewart in 1994. In common with many carriers, Air Jamaica, with debts of $560m (£291m), has been hit by high fuel costs and the impact of the 11 September attacks. The company will be restructured with the aim of finding a new buyer. \"The administration is committed to a viable national airline that will serve as a major catalyst for our economy,\" said Finance Minister Omar Davies. The 35-year-old airline transports about 55% of all passengers to the island and its pilots are reportedly among the best paid in the industry, with senior members of staff earning in excess of $234,000 a year.\n", "llama3.2:1b": ["Air Jamaica is back under state control after failing to turn profitable due to financial difficulties.", "The government aims to restructure the airline to find a new buyer, and Finance Minister Omar Davies stated the aim is to establish a viable national airline that will stimulate the economy."], "llama3.2:3b": ["The Jamaican government is regaining control of Air Jamaica, a company that has been struggling financially since a majority stake was sold in 1994 due to high fuel costs and the impact of the 9/11 attacks, with debts of $560m.", "The airline will be restructured with the aim of finding a new buyer, aiming to establish a viable national airline for the economy."], "gemma2:2b": ["The Jamaican government is taking control of Air Jamaica to help it overcome financial difficulties.", "The airline has struggled since a 1994 sale of majority ownership and has been impacted by high fuel costs and the aftermath of September 11th attacks.", "It will be restructured with an aim to find a new buyer."], "qwen2.5:0.5b": ["Air Jamaica is back in control after state ownership.", "The company has failed to make money since the 1994 sale by Gordon Stewart and faces financial difficulties.", "It will be restructured for a new buyer.", "Airlines transport about 55% of passengers, with pilots reportedly among the best-paid in the industry.", "Senior staff earn over $230k annually."], "qwen2.5:1.5b": ["Air Jamaica is being taken over by Jamaican authorities as part of an effort to revitalize struggling airlines like itself due to high fuel costs and September 11 attacks."], "qwen2.5:3b": ["Jamaica's government is reasserting control over Air Jamaica amid persistent financial struggles, including high debt ($560m) and reduced profitability since 1994.", "The airline, vital for transporting 55% of island passengers, has faced challenges from fuel costs and the September 11 attacks.", "Efforts aim to find a new buyer while restructuring the company.", "Finance Minister Omar Davies emphasizes the importance of maintaining a viable national carrier as a key economic driver.", "Air Jamaica's skilled staff earns up to $234,000 annually."], "opencoder:1.5b": ["The Jamaican government is regaining control of Air Jamaica to aid the failing company.", "The firm has incurred debts of $560m which include high fuel costs and attacks on the 11 September, impacting the company's financials.", "The aim will be to find a new buyer for the company."], "smollm:1.7b": ["The Jamaican government is regaining control of Air Jamaica in an effort to help the company out of financial difficulties.", "The airline has failed to make money since the state sold a majority stake to hotel tycoon Gordon Stewart in 1994.", "In common with many carriers, Air Jamaica has been hit by high fuel costs and the impact of the 11 September attacks.", "The government is committed to finding a new buyer for the company.", "The administration is also working on restructuring Air Jamaica to make it more viable.", "This will involve reducing costs and increasing efficiency in order to attract new customers and improve profitability.", "The airline's pilots are reportedly among the best paid in the industry, with senior members of staff earning in excess of $234,000 a year."], "deepseek-r1:1.5b": ["Air Jamaica has regained state control as the Jamaican government aims to help it escape financial trouble.", "They sold a majority stake in hotel tycoon Gordon Stewart, who now operates the largest hotel group in the country.", "The firm hasn't made significant money since its early days due to high fuel costs and the impact of 11 September attacks.", "They plan for restructuring with a new buyer, targeting a major national airline as an economic catalyst.", "The finance minister highlights strong performance, with pilots earning $234,000 annually, over 55% of passengers arriving on the island, and significant employee pay."], "tinyllama:1.1b": ["The Jamaican government is taking steps to regain control of Air Jamaica, which has been facing financial difficulties due to high fuel costs and the impact of the 11 September attacks on its finances.", "The company will be restructured with the aim of finding a new buyer, while the Jamaiican government is committed to developing a viable national airline that serves as a major catalyst for economic growth in the country.", "Highlighting the salaries and benefits of Jamaician pilots and the high percentage of passengers they serve, this summary contains key ideas and details without explanations or formatting."], "tinydolphin:1.1b": [" The Jamaican government has regained control of struggling airline Air Jamaica following a bidding process led by US billionaire and hotel tycoon Gordon Stewart.", "The company's debts had risen to over $560m (£291m) and were primarily caused by high fuel costs, which have been exacerbated by the 11 September attacks.", "The ailing carrier will be restructured with the aim of finding a new buyer in order to return to profitability.", "Finance Minister Omar Davies emphasized that this was an important step in creating a national airline capable of driving investment and growth in the Jamaican economy.", "The airline's senior pilots are reportedly among the best paid in the industry, with compensation packages exceeding $234,000 per year for some positions."], "phi:2.7b": [" Jamaica's government has regained control of Air Jamaica, which has been struggling financially since the state sold a majority stake to a hotel tycoon in 1994.", "The airline, hit by high fuel costs and the impact of the 11 September attacks, will be restructured with the goal of finding a new buyer.", "The company transports 55% of all passengers to the island and its pilots are among the industry's top paid."], "orca-mini:3b": [" Air Jamaica is being taken back under government control to try to help the company out of financial difficulties.", "The airline has been struggling due to high fuel costs and the impact of 9/11, and has debts of $560 million.", "It will be restructured with a view to finding a new buyer, and the government hopes that this will lead to a viable national airline that can serve as a major catalyst for the economy.", "The airline transports about 55% of all passengers to Jamaica and its pilots are among the best paid in the industry.", "Senior staff members earn over $234,000 a year."], "hermes3:3b": ["Air Jamaica returned to governmental control to overcome financial struggles due to high fuel costs, 9/11 impact, and debt ($560m)."], "stablelm-zephyr:3b": ["The Jamaican government is taking back control of Air Jamaica to help the financially troubled company.", "It has not been profitable since 1994 when a majority stake was sold to Gordon Stewart.", "High fuel costs and the impact of September 11 are among the challenges faced by the $560m debt-laden airline, which will be restructured with the goal of finding a new buyer.", "The 35-year-old carrier accounts for around 55% of passengers traveling to the island, and its pilots are among the best paid in the industry."], "chatgpt-4o-latest": ["The Jamaican government is taking back control of Air Jamaica to address its financial struggles.", "The airline has not been profitable since the state sold a majority stake to Gordon Stewart in 1994.", "Burdened with $560 million in debt, it has suffered from high fuel costs and the impact of the 9/11 attacks.", "The government plans to restructure the company and seek a new buyer.", "Finance Minister Omar Davies emphasized the airline's importance to the economy.", "Air Jamaica, a 35-year-old carrier, transports 55% of passengers to the island, and its pilots are among the industry's highest paid."], "stablelm2:1.6b": ["The Jamaican government regained control of Air Jamaica to help it escape financial difficulties, addressing high fuel costs and the aftermath of the September attacks that have impacted its finances.", "Air Jamaica aims to restructure and find a new buyer with debts of $1 million (approximately £1 million).", "The airline transports about 1% of all passengers on the island and employs top-paid pilots and staff members."], "granite3.1-dense:2b": ["Jamaica's government plans to reacquire Air Jamaica, a struggling national airline, from its 1994 sale to hotel magnate Gordon Stewart.", "The company, burdened with $560m in debt due to high fuel costs and post-9/11 impacts, has not generated profit since the sale.", "Finance Minister Omar Davies emphasized the importance of a revitalized Air Jamaica as an economic driver.", "The airline currently handles 55% of Jamaica's passenger traffic, with highly compensated pilots and staff earning over $234,000 annually.", "Restructuring will seek a new owner to ensure the airline's viability."]}