{"raw_text": "S Korean lender faces liquidation\n \n Creditors of South Korea's top credit card firm have said they will put the company into liquidation if its ex-parent firm fails to back a bail-out.\n \n LG Card's creditors have given LG group until Wednesday to sign up to a $1.1bn rescue package. The firm avoided bankruptcy thanks to a $4.5bn bail-out in January 2004, which gave control to the creditors. LG Group has said any package should reflect the firm's new ownership, and it will not accept an unfair burden. At least seven million people in South Korea use LG Card's plastic for purchases.\n \n LG Card's creditors have threatened parent group LG Group with penalties if it fails to respond to their demands.\n \n \"Creditors would seek strong financial sanctions against LG Group if LG Card is liquidated,\" said Yoo Ji-chang, governor of Korean Development Bank (KDB) - one of the card firm's major creditors. LG Group has said providing further help to the credit card issuer could hurt its corporate credibility and could spark shareholder lawsuits. It says it wants \"fair and reasonable guidelines\" on splitting the financial burden with the creditors, who now own 99.3% of LG Card. The creditors have asked the government to mediate to avoid any risk to the stability of financial markets, KDB said. Analysts believe a compromise is likely. \"LG Group knows the impact on consumer demand and the national economy from a liquidation of LG Card,\" said Kim Yungmin, an equity strategist at Dongwon Investment Trust Management.\n \n LG Card almost collapsed in 2003 due to an increase in overdue credit card bills after the bursting of a credit bubble. The firm returned to profit in September 2004, but now needs a capital injection to avoid being delisted from the Korea Stock Exchange. The exchange can delist a company if its debt exceeds its assets for two years running. LG card's creditors fear that such a move would triggered massive debt redemption requests that could bankrupt the firm, which owes about $12.05bn. \"Eventually, LG Group will have to participate, but they have been stalling to try to earn better concessions,\" said Mr Kim.\n", "llama3.2:1b": ["Here is a concise summary of the text:\n\nSouth Korean credit card lender LG Card's creditors are threatening penalties if LG Group fails to provide a $1.1bn rescue package that meets their demands for fair and reasonable guidelines on splitting the financial burden.", "The company received a previous bailout in 2004, but has avoided bankruptcy with a new ownership structure.", "If liquidation occurs, it could lead to massive debt redemption requests and a possible delisting from the stock exchange."], "llama3.2:3b": ["South Korea's top credit card firm LG Card is facing liquidation due to failure of its parent group LG Group to back a $1.1bn rescue package.", "Creditors threaten financial sanctions against LG Group if it fails to respond, but the group claims it wants \"fair and reasonable guidelines\" on sharing the financial burden."], "gemma2:2b": ["LG Card's creditors are threatening liquidation if LG Group does not provide a bailout.", "The creditors demand a $1.1 billion rescue package to avoid the credit card company's collapse, which would risk financial market instability and harm consumer demand.", "LG Group has expressed reluctance, citing their concerns about burdening corporate credibility and potential shareholder lawsuits.", "The government is expected to mediate between the two parties to reach a compromise.", "LG Card almost collapsed in 2003 due to an increase in overdue bills, but returned to profitability after a bailout.", "The company now faces potential delisting if it fails to meet debt-to-asset ratios for two years."], "qwen2.5:0.5b": ["South Korea's top credit card firm, LG Card, has faced potential liquidation due to a failed parent firm (LG Group).", "The creditors of LG Card have agreed to give the company $1.1 billion in a \"bail-out\" package, with the possibility that the firm will not be able to respond within the next 7 days.", "LG Group says it wants fair and reasonable guidelines on splitting the financial burden with creditors, who now own about 99.3% of LG Card.", "Analysts expect a compromise is likely."], "qwen2.5:1.5b": ["South Korea's largest credit card company, LG Card, faces liquidation unless its parent company LG Group agrees to a bailout package.", "This has led creditors of LG Card to threaten legal action against LG Group if the request is not met by Wednesday.", "The firm, which has over 7 million users in South Korea, was previously saved from bankruptcy through a $4.5bn bail-out and now seeks fairness in its proposed rescue plan.", "The crisis highlights issues around corporate ownership changes affecting financial stability."], "qwen2.5:3b": ["S Korean lender LG Card faces potential liquidation if parent firm LG Group does not back a $1.1bn rescue package.", "LG Card's creditors threatened penalties for LG Group if it fails to respond by Wednesday, with 7 million South Koreans using its cards.", "The deal should reflect new ownership, though LG Group wants fair burden sharing.", "Creditors claim LG Group could harm corporate credibility and face shareholder lawsuits if it refuses further help.", "Analysts suggest a compromise is likely, fearing LG Card's delisting would cause debt redemption requests leading to bankruptcy.", "LG Group faces pressure from creditors over financial burden while avoiding harming its reputation or facing legal action."], "opencoder:1.5b": ["S Korea lender faces liquidation\n\nCreditors of South Korea's top credit card firm will put the company into liquidation if its ex-parent firm fails to back a bail-out.", "LG Card's creditors will sign up to a $1bn rescue package in January 2004, which gave control to LG Group.", "LG Group said any package should reflect the firm's new ownership and will not accept an unfair burden.", "At least seven million people in South Korea use LG Card plastic for purchases.", "LG Card's creditors have threatened parent group LG Group with penalties if it fails to respond to their demands."], "smollm:1.7b": ["The summary should preserve key ideas and details from the original text:\n\n1.", "The South Korean credit card firm LG Card has faced liquidation due to a lack of financial support from its parent company LG Group.", "2.", "Creditors have threatened LG Group with strong financial sanctions if it fails to provide further help to LG Card, which now owns 99.3% of the credit card issuer.", "3.", "Analysts believe that a compromise is likely and that the government can mediate to avoid any risk to the stability of financial markets from a liquidation of LG Card.", "4.", "LG Card almost collapsed in 2003 due to an increase in overdue credit card bills after the bursting of a credit bubble, but now needs a capital injection to avoid being delisted from the Korea Stock Exchange.", "The exchange can delist a company if its debt exceeds its assets for two years running.", "5.", "LG Card's creditors fear that such a move would trigger massive debt redemption requests that could bankrupt the firm, which owes about $12.05bn.", "6.", "Eventually, LG Group will have to participate in any liquidation, but they have been stalling to try to earn better concessions."], "deepseek-r1:1.5b": ["South Korea's top credit card company, LG Card, is at risk of liquidation if its parent company LG Group fails to respond to a $1.1 billion rescue package requested by its creditors.", "LG Group had already received a $4.5 billion bail-out in 2004, which was sufficient for the creditors.", "However, LG Group now needs to comply with these demands.", "The Korean Development Bank (KDB) is concerned about potential financial sanctions and has suggested mediation.", "The debt-to-asset ratio might lead to delisting, risking bank actions.", "Experts believe a compromise is likely."], "tinyllama:1.1b": ["South Korean credit card company LG Card has faced a threat of liquidation due to its debts exceeding assets for two years in a row.", "The company's largest creditor, the Korean Development Bank (KDB), has threatened penalties if LG Group fails to provide a \"fair and reasonable\" response to credit card creditors' demands.", "Despite these warnings, LG Group has continued to delay signing up for a bail-out package.", "The company faces a looming liquidation if it fails to meet creditors' expectations, with the potential for widespread debt redetermination requests and shareholder lawsuits.", "Analysts believe that a compromise is likely in order to avoid further instability for financial markets."], "tinydolphin:1.1b": [" The situation in South Korea is concerning for LG Card's creditors.", "LG Card's creditors have put the company into liquidation if its parent firm does not approve a new bailout package and agree to share responsibility for the company's debt with them.", "The creditors, including seven million customers who use LG Card's plastic for purchases, threaten the bankruptcy of the parent company, LG Group.", "This is due to a past rescue by LG Group in 2004, which required the company's new owner, an investment group, to bear most of the burden.", "The LG Group creditors are now considering additional demands for a more balanced solution to the problem."], "phi:2.7b": [" Creditors of South Korea's top credit card firm have warned LG Group to back a rescue package worth $1.1 billion or put the company into liquidation by Wednesday.", "The company avoided bankruptcy in 2004 with a $4.5 billion bail-out, but its creditors want to split any further financial burden fairly.", "LG Group has said it will not accept an unfair burden and could face penalties if it does not respond to their demands."], "orca-mini:3b": [" Creditors of South Korea's top credit card firm LG Card have threatened parent group LG Group with penalties if it fails to respond to their demands.", "The creditors are demanding a bail-out package that reflects the firm's new ownership and fair and reasonable guidelines on splitting the financial burden with them.", "LG Group has said it wants \"fair and reasonable guidelines\" on splitting the financial burden with the creditors.", "A compromise is likely."], "hermes3:3b": ["Korean lender LG Card's creditors plan liquidation if ex-parent LG Group doesn't back $1.1bn rescue package by Wednesday.", "LG Card creditors threaten penalties against LG Group if it fails to respond, as the card firm faces delisting due to high debt levels."], "stablelm-zephyr:3b": ["South Korea's top credit card firm, LG Card, is facing potential liquidation as its creditors demand a $1.1bn rescue package be agreed upon by ex-parent company LG Group.", "The creditors are warning of penalties if the demands are not met and have asked for government mediation to avoid risks to financial markets.", "LG Group has said it will not accept unfair burdens or hurt its corporate credibility when providing further help to LG Card, as this may lead to shareholder lawsuits.", "A compromise seems likely, according to analysts."], "chatgpt-4o-latest": ["Creditors of South Korea's LG Card have threatened liquidation if its former parent, LG Group, does not support a $1.1 billion bailout by Wednesday.", "LG Card, which avoided bankruptcy in 2004 with a $4.5 billion rescue, is now controlled by creditors.", "LG Group argues that any new package should reflect the firm's changed ownership and refuses an unfair financial burden.", "Creditors warn of financial sanctions against LG Group if it does not comply.", "The government has been asked to mediate to prevent financial instability.", "Analysts expect a compromise, as LG Group is aware of the economic impact of LG Card's collapse.", "The company, which nearly failed in 2003 due to overdue credit card bills, returned to profit in 2004 but now requires capital to avoid delisting from the Korea Stock Exchange.", "If delisted, it could face massive debt redemption requests, risking bankruptcy.", "Experts believe LG Group is delaying to negotiate better terms."], "stablelm2:1.6b": ["South Korean creditors are set to put top credit card firm LG Card into liquidation if its parent company fails to support a $1.1 billion rescue package.", "The creditors have until Wednesday to secure the deal and threaten penalties against LG Group if it doesn L fail to respond to their demands.", "If liquidated, at least seven million people in South Korea would lose access to their credit card services.", "A compromise is likely with the creditors seeking \"fair and reasonable guidelines\" on splitting the financial burden with them who now own 3% of LG Card.", "Analysts warn that a liquidation could trigger massive debt redemption requests that may bankrupt the firm, which owes around $2 billion."], "granite3.1-dense:2b": ["South Korea's leading credit card issuer, LG Card, faces potential liquidation if its parent company, LG Group, does not agree to a $1.1 billion rescue package by Wednesday.", "Creditors have threatened financial penalties and market instability should LG Card go under.", "The creditors own 99.3% of LG Card following its 2004 bail-out from LG Group, which provided $4.5 billion to avoid bankruptcy.", "LG Group aims for fair compensation and doesn't want an unfair burden, while analysts predict a compromise due to the economic impact on consumer demand and the national economy from a liquidation.", "LG Card nearly collapsed in 2003 due to a credit bubble burst, but it has returned to profit and now requires a capital injection to prevent delisting from the Korea Stock Exchange."]}