{"raw_text": "Share boost for feud-hit Reliance\n \n The board of Indian conglomerate Reliance has agreed a share buy-back, to counter the effects of a power struggle in the controlling family.\n \n The buy-back is a victory for chairman Mukesh Ambani, whose idea it was. His brother Anil, the vice-chairman, said had not been consulted and that the buy-back was \"completely inappropriate and unnecessary\". The board hopes the move will reverse a 13% fall in Reliance's shares since the feud became public last month. The company has been fractious since founder Dhirubhai Ambani died in 2002, leaving no will. \"Today's round has gone to [Mukesh], there is no doubt about it,\" said Nanik Rupani, president of the Indian Merchants Chamber, a Bombay-based traders' body. The company plans to buy back 52 million shares at 570 rupees (£6.80; $13) apiece, a premium of more than 10% to its current market price.\n", "llama3.2:1b": ["The board of Reliance conglomerate has agreed to a share buy-back, with chairman Mukesh Ambani's idea and backed by the company's founder Dhirubhai Ambani.", "The move aims to reverse a 13% fall in shares since the feud became public last month."], "llama3.2:3b": ["Reliance's board has agreed on a share buy-back amid a power struggle in the controlling family.", "The move is a victory for Mukesh Ambani, who pushed for it despite his brother Anil's opposition.", "The buy-back aims to reverse Reliance's 13% share fall since the feud became public, and the company plans to purchase 52 million shares at a premium of over 10%."], "gemma2:2b": ["Reliance has approved a share buyback program designed to stabilize the company's stock price in light of a recent family feud.", "The move was spearheaded by chairman Mukesh Ambani and is seen as a win for him, while his brother Anil, the vice-chairman, opposes it.", "The company will purchase 52 million shares at a premium price, aiming to counter the significant share drop stemming from the internal conflict."], "qwen2.5:0.5b": ["Reliance is expected to buy back 52 million shares for Rs 570 each.", "The deal could boost the stock value and restore confidence in the company.", "The decision reflects the board's desire to balance the competing interests between Anil Ambani, Mukesh Ambani, and Dhirubhai Ambani."], "qwen2.5:1.5b": ["Reliance board agrees share buy-back, benefiting chairman Mukesh Ambani in feud with brother Anil.", "The move aims to reverse 13% drop in shares following power struggle over control since Dhirubhai's death.", "Board plans a 52 million share repurchase at 570 rupees per share, giving Mukesh a premium of more than 10%."], "qwen2.5:3b": ["Indian conglomerate Reliance has agreed to a share buy-back to counter effects of a power struggle in the controlling family.", "The move is led by chairman Mukesh Ambani against his brother Anil's objections.", "This follows a 13% drop in shares since the feud became public last month.", "The company aims to boost its market position, planning to purchase 52 million shares at an above-market price of ₹570 (approximately £6.80 or $13) per share."], "opencoder:1.5b": ["The board of Indian conglomerate Reliance has agreed a share buy-back to counter the effects of a power struggle in the controlling family.", "The buy-back is a victory for chairman Mukesh Ambani's idea it was.", "His brother Anil, the vice-chairman, said that the buy-back was \"completely inappropriate and unnecessary\".", "The board hopes the move will reverse a 13% fall in Reliance's shares since the feud became public last month.", "The company has been fractious since founder Dhirubhai Ambani died in 2002 leaving no will today.", "Mukesh, the chairman, said his intention to agree the buy-back was correct and there is no doubt about it.", "The company plans to buy back 52 million shares at Rs.570 per share, a premium of more than 10% to its current market price."], "smollm:1.7b": ["Reliance has agreed a share buy-back to counter the effects of power struggle in the controlling family.", "The buy-back is a victory for chairman Mukesh Ambani, whose idea it was.", "His brother Anil, the vice-chairman, said had not been consulted and that the buy-back was \"completely inappropriate and unnecessary\".", "The board hopes the move will reverse a 13% fall in Reliance's shares since the feud became public last month.", "The company has been fractious since founder Dhirubhai Ambani died in 2002, leaving no will.", "\"Today's round has gone to Mukesh, there is no doubt about it,\" said Nanik Rupani, president of the Indian Merchants Chamber, a Bombay-based traders' body.", "The company plans to buy back 52 million shares at 570 rupees (£6.80; $13) apiece, a premium of more than 10% to its current market price."], "deepseek-r1:1.5b": ["The board of Indian conglomerate Reliance has agreed on a share buy-back plan in response to power struggles within the controlling family, aimed at reversing a 13% decline in shares since the power dispute was made public.", "Mukesh Ambani's chairman will participate in the buyback, which costs 570 rupees per share for 52 million shares at an overall premium of more than 10%."], "tinyllama:1.1b": ["Concise summary: The board of Indian conglomerate Reliance agreed to a share buy-back after the family controlling Ambani brother proposed the idea.", "Anil, vice-chairman, claimed that the move was \"incompletey inappropriate and unnecessary\", while the company hopes it will lead to a reversal of a 13% decline in its shares since the founder's death last year.", "The buy-back plan has been approved by Reliance chairman Mukesh Ambani, who plans to purchase 52 million shares at £6.80 apiece ($13), with a premium of more than 10%."], "tinydolphin:1.1b": [" Reliance's board has agreed to implement a share buy-back plan following a power struggle between the controlling Ambani family members.", "Chairman Mukesh Ambani's idea for buying back shares at a premium of more than 10% to the company's current market price, sparked a feud among the siblings and resulted in a 13% fall in Reliance's shares since Dhirubhai Ambani's death.", "The move will be aimed at reversing this trend, according to Anil Ambani.", "The buy-back has been approved by the board but no formal announcement has been made yet."], "phi:2.7b": [" Reliance's board has agreed to buy back 52 million shares for £6.8 million, in an attempt to restore the company after a power struggle.", "The board hopes it will reverse a 13% fall in share prices since the feud became public last month.", "The move is supported by the Indian Merchants Chamber, but opposed by Anil Ambani, who says it was \"completely inappropriate and unnecessary\"."], "orca-mini:3b": [" Reliance's board agreed to a share buy-back to counter the effects of a power struggle in the controlling family and to reverse a 13% fall in shares since the feud became public last month.", "Chairman Mukesh Ambani proposed the idea, which was approved by the board.", "However, his brother Anil said he had not been consulted and criticized the buy-back as \"completely inappropriate and unnecessary.\"", "The move is aimed at reversing a 13% fall in Reliance's shares since the feud became public.", "The company plans to buy back 52 million shares at 570 rupees per share, a premium of more than 10% to its current market price."], "hermes3:3b": ["Reliance board approves share buy-back to counter Ambani brothers' feud impact."], "stablelm-zephyr:3b": ["Reliance Industries board approves share buy-back plan to counter the effects of a family feud.", "Chaiman Mukesh Ambani proposed the plan, while his brother Anil opposed it.", "The buy-back aims to reverse a 13% fall in Reliance's shares since the power struggle became public last month.", "The company plans to purchase 52 million shares at a premium of over 10%."], "chatgpt-4o-latest": ["Reliance's board has approved a share buy-back to counter the impact of a power struggle between chairman Mukesh Ambani and his brother Anil.", "Mukesh proposed the buy-back, while Anil opposed it, calling it unnecessary.", "The move aims to reverse a 13% decline in Reliance's shares since the feud became public.", "The company, troubled since founder Dhirubhai Ambani's death in 2002, plans to buy back 52 million shares at 570 rupees each, a 10% premium over the current market price.", "Observers see this as a victory for Mukesh."], "stablelm2:1.6b": ["Indian conglomerate Reliance's board has approved a share buy-back as a countermeasure for the power struggle in the controlling family.", "This move is a victory for Chairman Mukesh Ambani who initiated it, while brother Anil, vice-chairman, disagreed with the idea and considered the buy-back \"completely inappropriate and unnecessary\".", "The decision to buy back 1 million shares at an above-average price of £6 per share aims to reverse the decline in Reliance's shares since the feud made public last month."], "granite3.1-dense:2b": ["Indian conglomerate Reliance's board has authorized a share buy-back initiative led by chairman Mukesh Ambani, aiming to mitigate the impact of a family feud that began last month.", "The proposed buy-back involves purchasing 52 million shares at 570 rupees each (approximately £6.80/$13), offering a premium exceeding 10% over the current market price.", "This move is anticipated to reverse a 13% decline in Reliance's share value since the feud's public exposure.", "However, his brother Anil, vice-chairman, expressed opposition, deeming the buy-back \"completely inappropriate and unnecessary.\"", "The company has faced internal strife since its founder's death in 2002 without a will.", "Market observers note Mukesh Ambani's influence in this decision."]}