{"raw_text": "Asia shares defy post-quake gloom\n \n Thailand has become the first of the 10 southern Asian nations battered by giant waves at the weekend to cut its economic forecast.\n \n Thailand's economy is now expected to grow by 5.7% in 2005, rather than 6% as forecast before tsunamis hit six tourist provinces. The full economic costs of the disaster remain unclear. In part, this is because of its scale, and because delivering aid and recovering the dead remain priorities. But Indonesian, Indian and Hong Kong stock markets reached record highs on Wednesday, suggesting that investors do not fear a major economic impact.\n \n The highs showed the gap in outlook between investors in large firms and individuals who have lost their livelihoods.\n \n Investors seemed to feel that some of the worst-affected areas - such as Aceh in Indonesia - were so under-developed that the tragedy would little impact on Asia's listed companies, according to analysts. \"Obviously with a lot of loss of life, a lot of time is needed to clean up the mess, bury the people and find the missing. But it's not necessarily a really big thing in the economic sense,\" said ABN Amro chief Asian strategist Eddie Wong. India's Bombay Stock Exchange inched slightly above its previous record close on Wednesday. Expectations of strong corporate earnings in 2005 drove the Indonesian stock exchange in Jakarta to a record high on Wednesday. In Hong Kong, the Hang Seng index may be benefiting in part from the potential for its listed property companies to gain from rebuilding contracts in the tsunami-affected regions of South East Asia. In Sri Lanka, some economists have said that as much as 1% of annual growth may be lost. Sri Lanka's stock market has fallen about 5% since the weekend, but it is still 40% higher than at the start of 2004.\n \n Thailand may lose 30bn baht (£398m; $768m) in earnings from tourism over the next three months, according to tourism minister Sontaya Kunplome.\n \n In the affected provinces, he expects the loss of tourism revenue to be offset by government reconstruction spending. Thailand intends to spend a similar sum - around 30bn baht - on the rebuilding work. \"It will take until the fourth quarter of next year before tourist visitors in Phuket and five other provinces return to their normal level,\" said Naris Chaiyasoot, director general at the ministry's fiscal policy office. In the Maldives the cost of reconstruction could wipe out economic growth, according to a government spokesman. \"Our nation is in peril here,\" said Ahmed Shaheed, the chief government spokesman. He estimated the economic cost of the disaster at hundreds of millions of dollars. The Maldives has gross domestic product of $660m. \"It won't be surprising if the cost exceeds our GDP,\" he said. \"In the last few years, we made great progress in our standard of living - the United Nations recognised this. Now we see this can disappear in a few days, a few minutes.\" Shaheed noted that investment in a single tourist resort - the economic mainstay - could run to $40m. Between 10 and 12 of the 80-odd resorts have been severely damaged, and a similar number have suffered significant damage. However, many experts, including the World Bank, have pointed out that it is still difficult to assess the magnitude of the disaster and its likely economic impact.\n", "llama3.2:1b": ["Thailand's economy is expected to grow by 5.7% in 2005, rather than 6%, due to post-tsunami reconstruction spending.", "Stock markets in Indonesia, India, Hong Kong, and Sri Lanka have reached record highs despite investors' concerns about the potential economic impact.", "Tourism minister Sontaya Kunplome estimates Thailand will lose 30bn baht (£398m; $768m) in tourism revenue over three months.", "The government plans to spend a similar amount on rebuilding work."], "llama3.2:3b": ["Thailand cuts economic forecast due to tsunami effects.", "Investors show optimism despite high loss of life in underdeveloped areas like Indonesia's Aceh.", "India, Hong Kong, and Indonesian stock markets reach record highs.", "Thailand expects to lose 30bn baht from tourism revenue over three months but plans to spend same amount on reconstruction.", "Maldives fears economic cost could wipe out GDP."], "gemma2:2b": ["Thailand revised its economic growth forecast due to the tsunamis' effect on tourism.", "Investor confidence remains high despite a potential economic loss in some areas like Indonesia and Sri Lanka.", "The Maldives may lose considerable GDP from the disaster, but reconstruction spending could offset those losses.", "Many experts remain cautious about assessing the full economic impact of the disaster."], "qwen2.5:0.5b": ["The Asian economies are facing severe losses after large-scale earthquakes in several southern countries.", "Thailand, in particular, has been hit hard by an 18-meter tsunami on Saturday, leading to a 5.7% drop in economic forecasts compared with the same period last year.", "The full economic costs of the disaster remain unclear and investors appear more concerned about the worst-affected areas than those who have lost their livelihoods.", "Thailand's stock market has reached record highs, suggesting that investors do not fear a major economic impact.", "Sontaya Kunplome, Thailand's tourism minister, estimates that it could take until 2014 to fully recover from the damage caused by the tsunami.", "The Maldives' economy has been estimated at $660m, and investment in a single tourist resort could run to $40m between 10 and 12 resorts damaged."], "qwen2.5:1.5b": ["Thailand's economy forecast lowered by 0.3 percentage points following tsunami.", "Thailand expected to spend over $1 billion on rebuilding.", "Southeast Asian markets rise due to optimism about recovery from natural disasters.", "Sri Lanka, Maldives see significant economic losses estimated in billions of dollars.", "Experts warn it's challenging to accurately assess the full impact of tsunami-related damages."], "qwen2.5:3b": ["Asia's stock markets reached record highs despite Thailand cutting its economic forecast due to tsunamis hitting six tourist provinces.", "Thailand expects a 5.7% growth in GDP for 2005, down from initially projected 6%.", "In contrast, the Indonesian, Indian and Hong Kong stock markets surged on investor optimism that companies will not be significantly impacted by underdeveloped regions like Aceh.", "However, losses are expected elsewhere; Sri Lanka could lose up to 1% of its annual growth.", "Thailand anticipates a three-month loss of around 30bn baht in tourism earnings, which will be partly offset by government spending on reconstruction.", "In the Maldives, where GDP is $660m, reconstruction costs could surpass this figure."], "opencoder:1.5b": ["The text provided summarizes the following key points:\n\n1.", "Asia shares defy post-quake gloom - This statement doesn't take into account any additional details or explanations.", "2.", "Thailand's economy is expected to grow by 5.7% in 2005 rather than 6%.", "This growth isn't disclosed in the given text.", "3.", "The full economic costs of the disaster remain unclear - This question could indicate a need for further research or information regarding this matter.", "4.", "Investors seemed to feel that some of the worst-affected areas are under-developed, suggesting a significant economic impact.", "However, the details aren't provided in the text.", "5.", "The highs showed the gap in outlook between investors in large firms and individuals who have lost their livelihoods - This information isn't disclosed in the text.", "6.", "Sri Lanka's stock market has fallen about 5% since Wednesday - This falls significantly from the previous close on Wednesday, indicating significant economic impact."], "smollm:1.7b": ["The summary should include:\n\n1.", "The main idea or thesis statement about the text.", "2.", "A brief overview of the key ideas or points in the text.", "3.", "Any additional information or details that are relevant but not essential to understanding the main idea.", "4.", "No explanations, no formatting, and no reasoning process."], "deepseek-r1:1.5b": ["Thailand faced a severe economic crisis after the tsunami, with its economy expected to grow by 5.7% in 2005 instead of the anticipated 6%.", "The full economic costs were unclear due to the disaster's scale.", "Investors were concerned about the gap in their outlook, as some markets showed resilience despite losses.", "Thailand lost up to $30 billion from tourism over three months, with government reconstruction spending expected to offset this loss.", "Analysts noted that areas like Aceh may not impact Asian companies significantly, while other regions such as Indonesia and Maldives faced economic potential for growth mitigation.", "The crisis remains uncertain, with some markets showing improved outlooks despite the disaster's impact."], "tinyllama:1.1b": ["Asia shares defy post-quake gloom, Thailand's economy is expected to grow by 5.7% in 2005, despite being hit by giant waves during Japan's tsunami in 2011.", "The full economic costs of the disaster remain unclear due to its scale and scope, but Indonesian, Indian, and Hong Kong stock market gains were interpreted as a sign that investors do not fear major impact.", "Despite a loss of tourism revenue, Thailand will still lose roughly 30bn baht ($768m) in earnings from tourism over the next three months, according to Tourism Minister Sonthaia Kunpromee.", "The government has estimated that economic growth would wipe out the nation's GDP by a few million dollars, and investment in one resort could run as much as $40m.", "Meanwhile, experts have pointed out that it is still difficult to assess the magnitude of Japan's quake and tsunami, while the impact on Thailand remains uncertain."], "tinydolphin:1.1b": [" Thailand shares are expected to record their lowest growth rate since last year amidst widespread destruction caused by a massive tsunami.", "The country's economy is estimated to have suffered a loss of approximately $6 billion in revenue due to the disaster, with tourism revenue being particularly affected.", "As a result of the devastating events, many analysts predict that investor confidence will be significantly impacted, leading to further economic turmoil.", "Thailand's tourist industry is a major driver of its economy, and the rebuilding efforts are expected to take several months to complete.", "Meanwhile, in India, the Bombay Stock Exchange has experienced a record high on Wednesday, while Hong Kong's Hang Seng index may also be benefiting from potential property company earnings growth in areas affected by the tsunami."], "phi:2.7b": [" The text summarizes how the first ten southern Asian nations affected by tsunamis in 2005 are dealing with the aftermath of the disaster.", "It mentions that Thailand has cut its economic forecast, while stock markets have reached record highs due to a divergence between investors and individual losses.", "Investors seem confident that the impact on large firms will be minimal, while smaller countries may suffer significant economic consequences, especially Sri Lanka and the Maldives.", "The article also provides an estimate of the tourism revenue loss in Thailand and the Maldives.", "However, it acknowledges that it is difficult to predict the full economic cost of the disaster."], "orca-mini:3b": [" Thailand has become the first southern Asian nation to cut its economic forecast after the tsunami hit six tourist provinces, due to the scale and delivery of aid and recovering the dead remaining unclear.", "Despite this, Indonesian, Indian and Hong Kong stock markets reached record highs on Wednesday, suggesting that investors do not fear a major economic impact.", "The full economic costs of the disaster remain unclear, but some experts have estimated that it could wipe out tourism revenue in Phuket and other affected provinces, with a potential loss of 30bn baht for Thailand in the next three months.", "However, the government intends to spend similar sums - around 30bn baht - on rebuilding work.", "The Maldives, which relies heavily on tourism, has estimated the cost of reconstruction at hundreds of millions of dollars.", "The economic mainstay, tourist resorts, could run to $40m between 10 and 12 of the 80-odd resorts have been severely damaged, with a similar number suffering significant damage.", "However, many experts still point out that it is difficult to assess the magnitude of the disaster and its likely economic impact."], "hermes3:3b": ["Thailand's lowered economic forecast despite Asian markets reaching record highs after tsunami.", "Some investors believe underdeveloped areas may not significantly affect economy."], "stablelm-zephyr:3b": ["Thailand has become the first of ten southern Asian nations affected by tsunamis to reduce its economic forecast, with a 5.7% growth in 2005 expected instead of 6%.", "Record highs for Indonesian, Indian and Hong Kong stock markets indicate that investors do not foresee significant economic impact on Asia's listed companies due to the under-developed nature of the worst-affected areas.", "Thailand may lose 30bn baht (£398m $768m) in tourism earnings over the next three months; however, this loss is expected to be offset by government reconstruction spending.", "The Maldives faces the possibility of a complete economic wipeout due to reconstruction costs, though it's still early to assess the full impact."], "chatgpt-4o-latest": ["Asian stock markets remained resilient despite the economic uncertainty caused by the tsunami disaster.", "Thailand revised its 2005 growth forecast down to 5.7% from 6%, with expected tourism losses of 30bn baht over three months, though reconstruction spending may offset this.", "Sri Lanka could lose up to 1% of annual growth, while the Maldives faces potential economic devastation, with reconstruction costs possibly exceeding its $660m GDP.", "However, stock markets in Indonesia, India, and Hong Kong hit record highs, as investors believed the worst-affected areas were underdeveloped and would have limited impact on major listed companies.", "Analysts noted that while the human toll was immense, the broader economic consequences remained uncertain."], "stablelm2:1.6b": ["Thailand's economy is now expected to grow by 5.7% instead of 6%, due to tsunamis in six tourist provinces, despite concerns about the full economic costs remaining unclear.", "Investors do not fear a major impact on Asia's listed companies; those directly affected by the disaster, such as Aceh in Indonesia, are considered underdeveloped with little economic impact.", "Expectations of strong corporate earnings drive stock markets higher.", "In Sri Lanka, some economists say up to 1% of annual growth may be lost, while Thailand may lose earnings from tourism over next three months but expects a similar sum for reconstruction work.", "Experts note it's hard to assess the magnitude of the disaster and its potential economic impact."], "granite3.1-dense:2b": ["Thailand, one of 10 southern Asian nations affected by tsunamis, is the first to revise its economic growth forecast for 2005 from 6% to 5.7%, due to significant losses in tourism revenue expected at 30 billion baht (£398m; $768m) over three months.", "Despite this, Thailand plans to spend a similar amount on reconstruction.", "Investors appear optimistic about Asia's recovery, with Indonesian, Indian, and Hong Kong stock markets reaching record highs, possibly reflecting the perception that the disaster won't have a major long-term economic impact on listed companies due to the underdevelopment of affected regions like Aceh in Indonesia.", "The Maldives faces potential economic collapse, with costs estimated at hundreds of millions of dollars, as many tourist resorts were severely damaged or destroyed.", "Experts caution that accurately assessing the disaster's full economic consequences is challenging due to ongoing relief efforts and prioritizing aid distribution."]}