{"raw_text": "Soros group warns of Kazakh close\n \n The Open Society Institute (OSI), financed by billionaire George Soros, has accused Kazakhstan officials of trying to close down its local office.\n \n A demand for unpaid taxes and fines of $600,000 (£425,000) is politically motivated, the OSI claimed, adding that it paid the money in October. The organisation has found itself in trouble after being accused of helping to topple Georgia's former president. It denies having any role, but offices have had to close across the region.\n \n The OSI shut its office in Moscow last year and has withdrawn from Uzbekistan and Belarus. In the Ukraine earlier this year, Mr Soros - who took on the Bank of England in the 1990s - and won, was pelted by protestors. \"This legal prosecution can be considered an attempt by the government to force Soros Foundation-Kazakhstan to cease its activities in Kazakhstan and shut its doors for Kazakh citizens and organisations,\" the OSI said.\n \n The OSI aims to promote democratic and open, market-based societies. Since the break up of the Soviet Union in 1991, Kazakhstan has been dominated by its president Nursultan Abish-uly Nazarbayev. He has powers for life, while insulting the president and officials has been made a criminal offence. The government controls the printing presses and most radio and TV transmission facilities. It operates the country's national radio and TV networks. Recent elections were criticised as flawed and the opposition claimed there was widespread vote rigging. Supporters, however, say he brings much needed stability to a region where Islamic militancy is on the rise. They also credit him with promoting inter-ethnic accord and pushing through harsh reforms.\n", "llama3.2:1b": ["The Open Society Institute (OSI), funded by billionaire George Soros, has accused Kazakhstan officials of trying to shut down its local office due to unpaid taxes and fines.", "The OSI claims this is a politically motivated attempt to suppress the group's activities in the country."], "llama3.2:3b": ["The Open Society Institute has accused Kazakhstan officials of trying to close its local office due to unpaid taxes and fines amounting to $600,000, claiming the demand is politically motivated.", "The OSI has shut offices in other countries where Soros' activities were criticized, citing concerns that the legal prosecution aims to force the foundation to cease operations in Kazakhstan."], "gemma2:2b": ["The Open Society Institute (OSI), financed by George Soros, alleges that Kazakhstan authorities are trying to shut down its local office due to unpaid taxes and fines, which they claim are politically motivated.", "The OSI denies any role in Georgia's former president's overthrow and has been withdrawing from various countries due to similar allegations.", "Their office closure follows a pattern of similar actions against organizations associated with Soros in the region."], "qwen2.5:0.5b": ["Key points:\n\n  * Soros group accused Kazakhstan of closing down its local office.", "* The OSI (Open Society Institute) claims the officials are responsible for politically motivated actions.", "* Soros has been accused of helping to topple a former president in Georgia, but this is disputed by the OSI.", "* The OSI has shut its office in Moscow and withdrawn from Uzbekistan and Belarus.", "* The OSI aims to promote democratic and open societies.", "* Kazakhstan's president Nursultan Abish-uly Nazarbayev has been in power since 1991, with powers for life."], "qwen2.5:1.5b": ["The Open Society Institute (OSI) accuses Kazakhstan officials of trying to close its office due to unpaid taxes and fines, following accusations that it helped topple Georgia's former president.", "OSI has shut offices in Moscow, Uzbekistan, and Belarus and faces legal prosecution for alleged involvement in the Bank of England dispute."], "qwen2.5:3b": ["The Open Society Institute (OSI), funded by George Soros, has accused Kazakhstan officials of trying to close down its local office.", "The OSI claims that the demand for unpaid taxes and fines ($600,000) is politically motivated, as it had been involved in supporting a previous regime change.", "It shut down offices in Moscow, withdrew from Uzbekistan and Belarus, and was pelted by protestors in Ukraine due to a legal prosecution.", "The OSI promotes democratic and open societies; however, Kazakhstan has been dominated by President Nursultan Nazarbayev for life with severe restrictions on media and elections criticized as flawed."], "opencoder:1.5b": ["Soros group warns of Kazakhstan closing down its local office by accusing Kazakhstan officials of trying to close down its local office, A demand for unpaid taxes and fines of $600,000 (£425,000) is politically motivated, the OSI claimed, adding that it paid the money in October.", "The organisation has found itself in trouble after being accused of helping to topple Georgia's former president and it denies having any role, but offices have had to close across the region.", "The OSI shut its office in Moscow last year and has withdrawn from Uzbekistan and Belarus.", "In the Ukraine earlier this year, Mr Soros took on the Bank of England in the 19th century and won, was pelted by protestors.", "\"This legal prosecution can be considered an attempt by the government to force Soros Foundation-Kazakhstan to cease its activities in Kazakhstan and shut its doors for Kazakh citizens and organisations,\" the OSI said."], "smollm:1.7b": ["The Open Society Institute (OSI) has accused Kazakhstan officials of trying to close down its local office.", "The OSI warned that it paid $600,000 in unpaid taxes and fines to help the Kazakh government shut down its local office.", "The OSI also said it had found itself in trouble after being accused of helping to topple Georgia's former president.", "It denied having any role, but offices have had to close across the region.", "The OSI has been accused of promoting democratic and open societies by providing financial support to Kazakhstan.", "Since the break up of the Soviet Union in 1991, Kazakhstan has been dominated by its president Nursultan Abilayev.", "He has powers for life, while insulting the president and officials has been made a criminal offence.", "The government controls the printing presses and most radio and TV transmission facilities.", "It operates the country's national radio and TV networks.", "Recent elections were criticized as flawed and the opposition claimed there was widespread vote rigging.", "However, supporters say he brings much needed stability to a region where Islamic militancy is on the rise.", "They also credit him with promoting inter-ethnic accord and pushing through harsh reforms."], "deepseek-r1:1.5b": ["The Open Society Institute (OSI), funded by billionaire George Soros, has accused Kazakhstan officials of trying to close their local office, accusing them of using unpaid taxes and fines totaling $600,000 in October.", "OSI claims they faced government change elsewhere, including Greece and Georgia.", "They've been accused of helping topple Georgia's former president but found themselves in trouble with offices in Russia, Uzbekistan, and Belarus.", "Soros, involved in the banking group from the 1990s, is now facing protests in Ukraine after being part of that organization.", "OSI aims to promote democracy but faces criticism from opposition groups about flawed elections, vote manipulation, and support for Nursultan Abish-uly Nazarbayev's role in stability despite Islamic militancy rising."], "tinyllama:1.1b": ["Soros group warns of Kazakh close, accusing officials of trying to close down local office\nThe Open Society Institute (OSI), a financing source of billionaire George Soros, has accused the Kazakh authorities of attempting to close down its local office.", "The OSI claims that payments worth $600,000 in unpaid taxes and fines were politically motivated, adding that it paid the money in October.", "The organization is now facing legal action by Kazakh officials as part of their attempts to \"force Soros Foundation-Kazahtab\" to close down operations.", "This legal prosecution can be considered an attempt by the government to force the foundation to cease its activities and shut its doors for Kazakh citizens and organizations, according to the OSI.", "The organization aims to promote democracy and open market-based societies since the collapse of the Soviet Union in 1991, while Kazakh authorities have been dominated by President Nurmukhamed Niyazbayev since the breakup of the Soviet Union in 1991.", "However, critics argue that these powers are controlled by the government and there has been significant vote rigging in recent elections, which were criticized as flawed."], "tinydolphin:1.1b": [" The Soros Group has accused the Kazakh government of attempting to shut down its local office, citing unpaid taxes and fines totaling $600,000 (£425,000).", "In response, the OSI has paid the money in October.", "However, this move comes amidst political tensions between the United States and Russia due to Soros' involvement in the 1992 Georgia uprising.", "This accusation follows a similar legal prosecution against Soros Foundation-Kazakhstan earlier this year.", "The OSI argues that it was merely helping promote democratic and open societies, not interfering with Kazakhstani affairs or individuals.", "However, the closure of its office in Moscow has caused regional offices to shut down across several countries, including Ukraine.", "This situation highlights the ongoing political turmoil in Central Asia, as governments in some countries struggle to maintain stability and promote their own agendas amid increasing Islamic militancy."], "phi:2.7b": [" The Open Society Institute (OSI) has accused Kazakhstan officials of trying to close down its local office.", "They claim that it was politically motivated, but they paid the money in October.", "Soros Foundation-Kazakhstan is a non-profit organization that aims to promote democratic and market-based societies.", "It has withdrawn from several countries due to legal prosecution or government pressure."], "orca-mini:3b": [" The Soros group, financed by George Soros, has accused Kazakhstan officials of trying to close down its local office.", "The OSI claims that a demand for unpaid taxes and fines of $600,000 is politically motivated, and it has shut its office in Moscow, withdrawn from Uzbekistan and Belarus, and closed its office in the Ukraine earlier this year after being accused of helping to topple Georgia's former president.", "The OSI denies having any role but offices have had to close across the region."], "hermes3:3b": ["Soros' OSI claims Kazakh officials try to close local office due to unpaid taxes; alleges political motive."], "stablelm-zephyr:3b": ["The Open Society Institute (OSI), funded by George Soros, has accused Kazakhstan officials of attempting to close down its local office.", "OSI claims a demand for unpaid taxes and fines of $600,000 is politically motivated.", "The organization denies having any role in the Georgia former president's toppling and has had offices close across the region.", "Last year, OSI closed its Moscow office, withdrew from Uzbekistan and Belarus, and experienced legal prosecution under Nursultan Abish-uly Nazarbayev's presidency in Kazakhstan.", "Since 1991, his government controls most media outlets, including national radio and TV networks.", "Critics argue that recent elections were flawed, while supporters maintain Nursultan Abish-uly Nazarbayev brings stability to the region amid rising Islamic militancy."], "chatgpt-4o-latest": ["The Open Society Institute (OSI), funded by George Soros, claims Kazakh authorities are trying to shut down its local office by demanding $600,000 in unpaid taxes and fines, despite the OSI stating it paid the amount in October.", "The OSI has faced similar issues in other countries after being accused of aiding political upheavals, leading to office closures in Moscow, Uzbekistan, and Belarus.", "The OSI argues the legal action is an attempt to force its exit from Kazakhstan.", "The organization promotes democracy and open markets, but Kazakhstan remains under the long-term rule of President Nursultan Nazarbayev, who has extensive powers, controls media, and has faced criticism for flawed elections and vote rigging.", "While critics highlight authoritarianism, supporters credit him with stability and economic reforms."], "stablelm2:1.6b": ["The Open Society Institute (OSI), funded by George Soros, accuses Kazakhstan officials of attempting to close down its local office due to unpaid taxes and fines that are deemed politically motivated.", "OSI claims it paid the money in October and denies any involvement in helping to topple Georgia's former president.", "The organization has closed offices across the region.", "In Moscow, OSI shut its last year and pulled out of Uzbekistan, Belarus, and Ukraine earlier this year after being protested by protestors.", "George Soros won a legal victory against the Bank of England but was met with protests.", "The OSI aims to promote democratic and market-based societies in the post-Soviet era, especially considering that Kazakhstan is dominated by President Nursultan Nazarbayev who holds powers for life.", "His government controls media outlets, radio stations, and TV transmission facilities.", "Recent elections were criticized as flawed, while opposition claimed widespread vote rigging."], "granite3.1-dense:2b": ["The Open Society Institute (OSI), funded by billionaire George Soros, alleges that Kazakh officials are attempting to close its local office due to a politically motivated demand for $600,000 in unpaid taxes and fines.", "The OSI denies involvement in Georgia's 2003 coup attempt but has closed offices in Moscow, Uzbekistan, Belarus, and now threatens Kazakhstan.", "This legal action is seen as an attempt to shut down the foundation's activities within Kazakhstan, potentially impacting citizens and organizations.", "Kazakhstan, under President Nursultan Abish-uly Nazarbayev (who has life presidency), maintains strict control over media, printing presses, and broadcast networks.", "Critics argue recent elections were flawed due to vote rigging, while supporters credit the president with stability amidst rising Islamic militancy and inter-ethnic tensions.", "The government criminalizes disrespect towards officials and exerts control over most media outlets."]}