{"raw_text": "Cash gives way to flexible friend\n \n Spending on credit and debit cards has overtaken cash spending in the UK for the first time.\n \n The moment that plastic finally toppled cash happened at 10.38am on Wednesday, according to the Association for Payment Clearing Services (Apacs) Apacs chose school teacher Helen Carroll, from Portsmouth, to make the historic transaction. The switch over took place as she paid for her groceries in the supermarket chain Tesco's Cromwell Road branch.\n \n Mrs Carroll was born in the same year that plastic cards first appeared in the UK. \"I pay for most things with my debit card, with occasional purchases on one of my credit cards,\" said Mrs Carroll, who teaches at Peel Common Infants School in Gosport.\n \n Spending patterns for the year and estimates for December led Apacs to conclude that 10.38am was the time that plastic would finally rule the roost. Shoppers in the UK are expected to put £269bn on plastic cards during the whole of 2004, compared with £268bn paid with cash, Apacs said. When the first plastic cards appeared in the UK in June 1966, issued by Barclaycard, but only a handful of retailers accepted them and very few customers held them. \"But in less than 40 years, plastic has become our most popular way to pay, due to the added security and flexibility it offers,\" said Apacs spokeswoman Jemma Smith. \"The key driver has been the introduction of debit cards, which now account for two-thirds of plastic card transactions and are used by millions of us every day.\"\n", "llama3.2:1b": ["Cash gives way to credit/debit cards in UK spending.", "Plastic cards have overtaken cash in the UK for the first time since their introduction in 1966.", "Tesco's Cromwell Road branch was one of the retailers that accepted plastic cards, while only a handful did so initially."], "llama3.2:3b": ["Plastic cards have overtaken cash spending in the UK for the first time, according to the Association for Payment Clearing Services (Apacs).", "The switch occurred at 10:38am on a Wednesday when school teacher Helen Carroll made a transaction at Tesco's.", "Apacs estimates that £269bn will be spent on plastic cards in 2004, compared to £268bn with cash, due to the added security and flexibility of debit cards."], "gemma2:2b": ["Plastic cards have surpassed cash spending in the UK as a preferred method for payment, with an estimated £269 billion spent on them in 2004.", "The shift is attributed to increased security, flexibility, and the rise of debit card usage over time.", "This change marked a historic moment on Wednesday when Helen Carroll made the first transaction using plastic cards at Tesco's Cromwell Road branch."], "qwen2.5:0.5b": ["Key points from the text:\n\n1.", "Cash spending in the UK overtakes credit card spending.", "2.", "The transaction at 10:38 am on Wednesday resulted in a significant shift towards cash use, coinciding with Mrs. Carroll's experience at Tesco.", "3.", "Plastic cards first appeared in the UK in June 1966.", "4.", "In less than 40 years, plastic has become more popular and secure for transactions due to added security features and flexibility offered by debit cards.", "5.", "Shoppers are expected to spend £269 billion on plastic cards during December 2004 compared to £268 billion paid with cash in the same year."], "qwen2.5:1.5b": ["Plastic spending in the UK surpasses cash spending for the first time at 10:38am on Wednesday, with £269bn spent via credit or debit cards compared to £268bn with cash.", "Helen Carroll, a school teacher from Portsmouth, made the historic switch as she paid for groceries with her debit card.", "The shift has been driven by increased use of debit cards and improved security and flexibility offered by plastic payment methods."], "qwen2.5:3b": ["Cash spending in the UK has been overtaken by credit and debit card spending for the first time.", "This shift happened at 10:38 AM on Wednesday when school teacher Helen Carroll paid for groceries using her debit card at Tesco's Cromwell Road branch.", "Apacs predicts £269bn will be spent via plastic cards in 2004, up from £268bn in cash.", "Plastic cards replaced cash as the preferred payment method after their introduction in 1966 by Barclaycard, though initially only a small number of retailers accepted them.", "Today, debit cards dominate with two-thirds of plastic card transactions and widely used daily."], "opencoder:1.5b": ["\"Cash gives way to flexible friend.", "Spending on credit and debit cards have overtaken cash spending in the UK for the first time.", "The moment that plastic finally toppled cash happened at 10.38am on Wednesday, according to Apacs, Helen Carroll from Portsmouth chose school teacher Mrs Carroll to make historic transaction.", "She paid groceries in Tesco's Cromwell Road branch by making the switch.", "Mrs Carroll was born in same year as plastic cards first appeared in UK.", "He explained spending patterns and estimated values for December led Apacs to conclude that 10.38am was time plastic would finally topple the roost.", "Shoppers are expected to put £269bn on plastic during whole of 2004 compared with cash payment, Apacs said.", "\"."], "smollm:1.7b": ["Cash gives way to flexible friend: Spending on credit and debit cards has overtaken cash spending in the UK for the first time.", "The moment that plastic finally toppled cash happened at 10.38am on Wednesday, according to the Association for Payment Clearing Services (Apacs).", "The switch over took place as she paid for her groceries in the supermarket chain Tesco's Cromwell Road branch.", "Mrs Carroll was born in the same year that plastic cards first appeared in the UK.", "\"I pay for most things with my debit card, with occasional purchases on one of my credit cards,\" said Mrs Carroll, who teaches at Peel Common Infants School in Gosport.", "The spending patterns for the year and estimates for December led Apacs to conclude that 10.38am was the time that plastic would finally rule the roost.", "Shoppers in the UK are expected to put £269bn on plastic cards during the whole of 2004, compared with £268bn paid with cash, Apacs said.", "When the first plastic cards appeared in the UK in June 1966, issued by Barclays, but only a handful of retailers accepted them and very few customers held them.", "But in less than 40 years, plastic has become our most popular way to pay, due to the added security and flexibility it offers.", "The key driver has been the introduction of debit cards, which now account for two-thirds of plastic card transactions and are used by millions of us every day."], "deepseek-r1:1.5b": ["The UK has seen plastic payment cards take over as a major form of currency, with spending on plastic cards surpassing cash by £26 billion in 2004.", "Helen Carroll, a teacher and Tesco customer, paid for her groceries using her debit card at 10:38am on Wednesday when the switch happened, after Barclaycard's first plastic use in 1966.", "Plastic now is the most popular payment method due to increased security and flexibility from debit cards."], "tinyllama:1.1b": ["The UK's move towards flexible friend, cash, has come to an end, with the switchover from plastic spendings to debit cards taking place at 10.38am on Wednesday according to The Association for Payment Clearing Services (Apacs), who said that plastic had finally taken over as a method of payment in Britain after 52 years.", "Despite being introduced in the UK in 1966, only around 40% of Britons used them by 1978, but this has since increased to almost two-thirds.", "The switchover, which was expected to cost £269bn to the UK economy, is now underway and will see the introduction of debit cards in place of cash transactions from December.", "With plastic becoming less popular, debit cards have become the most widely used method of payment across the country, with almost 140 million cards in use in 2004."], "tinydolphin:1.1b": [" The UK switched from using cash to plastic in 1966, making credit and debit cards the most popular way to pay today.", "Currently, around £269 billion is spent with plastic cards, compared to £268 billion spent on cash.", "Spending patterns have shown that one major reason for this change is the addition of debit cards, which offer two-thirds of all plastic card transactions and are used by millions of people across the country."], "phi:2.7b": [" The text summarizes how credit and debit cards became more popular than cash in the UK and when the switch happened at a specific time.", "It also mentions the benefits of using plastic cards over cash and gives some background information on their history and usage."], "orca-mini:3b": [" Cash spending has been surpassed by plastic cards in the UK for the first time, according to Apacs.", "The historic moment took place at 10.38am on Wednesday when Helen Carroll, a school teacher from Portsmouth, paid for her groceries using a Tesco's credit card.", "Mrs Carroll was born in the same year that plastic cards were first introduced in the UK and has been paying for most things with her credit card.", "The amount of cash spending in the UK is expected to reach £269 billion in 2004, while plastic spending is expected to reach £268 billion, according to Apacs."], "hermes3:3b": ["Cash over toped by plastic in UK for first time; plastic spending surpassing cash £269bn vs £268bn per year; Apacs, credit."], "stablelm-zephyr:3b": ["For the first time, spending on credit and debit cards in the UK has overtaken cash spending.", "This switch happened at 10:38 am on Wednesday as school teacher Helen Carroll used her debit card to pay for groceries at Tesco's Cromwell Road branch.", "Apacs estimates that shoppers will put £269 billion on plastic cards in 2004 compared to £268 billion paid with cash.", "The introduction of debit cards has been a major driver for the popularity of plastic cards, as they account for two-thirds of transactions and are used by millions daily."], "chatgpt-4o-latest": ["Spending on credit and debit cards in the UK has surpassed cash for the first time, with the milestone occurring at 10.38am on a Wednesday, according to Apacs.", "School teacher Helen Carroll was chosen to make the historic transaction at a Tesco store.", "Apacs estimates that UK shoppers will spend £269bn on plastic cards in 2004, compared to £268bn in cash.", "Since the introduction of plastic cards in 1966, their popularity has grown due to security and flexibility, with debit cards now making up two-thirds of plastic transactions."], "stablelm2:1.6b": ["For the first time in UK history, spending on credit and debit cards has surpassed cash.", "This shift occurred when Helen Carroll, a teacher from Portsmouth, paid for groceries using her debit card at Tesco's Cromwell Road branch.", "Apacs estimates that £1bn will be spent on plastic cards during 2018 compared to £1bn spent with cash.", "The popularity of plastic payment methods is due in part to the widespread adoption of debit cards, which now account for two-thirds of all plastic card transactions and are used by millions daily."], "granite3.1-dense:2b": ["In a historic moment at 10:38 AM on Wednesday, UK resident Helen Carroll, a school teacher from Portsmouth, made the first transaction using a credit or debit card instead of cash in a Tesco supermarket.", "This event marked the transition where spending on plastic cards surpassed cash spending for the first time in the UK, according to the Association for Payment Clearing Services (Apacs).", "By the end of 2004, it was estimated that £269 billion would be spent via plastic cards, while only £268 billion would be paid with cash.", "The shift towards plastic has been driven by added security and convenience, especially since the introduction of debit cards in the late 1980s, which now constitute two-thirds of all plastic card transactions."]}