{"raw_text": "Nasdaq planning $100m-share sale\n \n The owner of the technology-dominated Nasdaq stock index plans to sell shares to the public and list itself on the market it operates.\n \n According to a registration document filed with the Securities and Exchange Commission, Nasdaq Stock Market plans to raise $100m (£52m) from the sale. Some observers see this as another step closer to a full public listing. However Nasdaq, an icon of the 1990s technology boom, recently poured cold water on those suggestions.\n \n The company first sold shares in private placements during 2000 and 2001. It technically went public in 2002 when the stock started trading on the OTC Bulletin Board, which lists equities that trade only occasionally. Nasdaq will not make money from the sale, only investors who bought shares in the private placings, the filing documents said. The Nasdaq is made up shares in technology firms and other companies with high growth potential. It was the most potent symbol of the 1990s internet and telecoms boom, nose-diving after the bubble burst. A recovery in the fortunes of tech giants such as Intel, and dot.com survivors such as Amazon has helped revive its fortunes.\n", "llama3.2:1b": ["Nasdaq plans to sell $100m shares to list on market it operates."], "llama3.2:3b": ["Nasdaq plans to sell $100m worth of shares to raise funds from private placements that have been made since 2000.", "The company will list itself on the market it operates and will not profit from the sale."], "gemma2:2b": ["Nasdaq Stock Market plans to raise $100 million from a public share sale.", "The proceeds will go to investors who purchased shares in private placements.", "The company is exploring a full listing on the market but has not made any official announcements regarding this possibility.", "Nasdaq's value was heavily influenced by the 1990s dot-com bubble and subsequent crash, but has recently seen a resurgence with tech giants like Intel and online companies such as Amazon regaining popularity."], "qwen2.5:0.5b": ["The Nasdaq is planning to sell shares publicly and list itself on the market it operates.", "Some observers see this as a step closer to a full public listing, but they are not sure whether Nasdaq will make money from the sale.", "The company previously sold shares privately in 2000 and 2001, and initially went public through the OTC Bulletin Board."], "qwen2.5:1.5b": ["Nasdaq plans a $100 million share sale to list itself on Nasdaq, which was once a symbol of the 1990s technology boom but now sees rising fortunes due to tech giants' recoveries."], "qwen2.5:3b": ["Nasdaq plans to sell $100m worth of shares publicly, raising money for itself despite being a private company.", "This move aims to list Nasdaq on the stock market, seen by some as a step towards full public ownership.", "However, Nasdaq previously rejected such suggestions due to its recent struggles after the tech bubble burst in the 1990s.", "Despite its current status as an index of technology firms with high growth potential, Nasdaq has faced challenges since then.", "Its fortunes have improved as giants like Intel and survivors like Amazon have seen resurgence."], "opencoder:1.5b": ["The owner of the technology-dominated Nasdaq stock index plans to sell shares to the public and list itself on the market it operates.", "According to a registration document filed with the Securities and Exchange Commission, Nasdaq Stock Market plans to raise $100m (£52m) from the sale by another step closer to a full public listing.", "The company first sold shares in private placements during 2,000 and 2001.", "It technically went public in 2002 when the stock started trading on the OTC Bulletin Board, which lists equities that trade only occasionally.", "Nasdaq will not make money from the sale, only investors who bought shares in the private placements.", "The Nasdaq is made up of high-growth technology firms and other companies with potential.", "It was the most potent symbol of the 19th century internet boom, nose-diving after the bubble burst.", "A recovery in tech giants like Intel and dot.com survivors like Amazon has helped revive its fortunes."], "smollm:1.7b": ["The Nasdaq stock index plans to raise $100 million from a public sale, which is expected to be another step closer to listing on the Nasdaq exchange.", "The company's first private placements in 2000 and 2001 were followed by a full public listing in 2002.", "Nasdaq will not make money from the sale, only investors who bought shares in the private placements.", "The Nasdaq is made up of shares in technology firms and other companies with high growth potential.", "It was one of the most potent symbols of the 1990s internet and telecoms boom, nose-diving after the bubble burst.", "A recovery in the fortunes of tech giants such as Intel and dot.com survivors such as Amazon has helped revive its fortunes."], "deepseek-r1:1.5b": ["Nasdaq plans a $100 million share sale, not making direct money but distributing profits to investors from private sales.", "They've been technically public since 2002 and made public in 2003 through OTC listings.", "The Nasdaq was a symbol of the tech boom in the late '90s but now faces a bubble-bait era with high-tech companies surviving."], "tinyllama:1.1b": ["The owner of the Nasdaq stock index plans to sell shares to the public on a US market it operates and list itself on the market via a $100m (£52m) raise.", "The company initially sold shares in private placements during 2000-2001, but now plans to reopen the OTC Bullish Board for a stock listing.", "The Nasdaq is a publicly traded index of high growth companies, listed on a US market, which was once known as one of the most potent symbols of the tech boom and dot-com survivors' revival."], "tinydolphin:1.1b": [" Summary: Nasdaq is planning to sell shares on a public market with a $100 million (£52 million) offering, aiming to raise funds for business operations and possibly make some investment returns.", "This will be the company's first major listing on a stock exchange since being privately listed in 2000 and 2001.", "However, the company has not specified whether it intends to make any money from this sale."], "phi:2.7b": [" Nasdaq, a company that operates stock indices for technology firms, plans to sell shares to the public and list itself on the market it operates.", "It aims to raise $100m from the sale in private placements during the 1990s.", "Although some see this as a step towards a full public listing, Nasdaq has recently expressed skepticism about the idea.", "The company went public by trading its stock on the OTC Bulletin Board in  2002 and primarily trades shares of technology firms and companies with high growth potential."], "orca-mini:3b": [" Nasdaq plans to raise $100m by selling shares to the public and listing itself on the market it operates.", "Some observers see this as another step closer to a full public listing, but Nasdaq recently poured cold water on those suggestions.", "The company plans to make money from the sale only for investors who bought shares in private placements.", "Nasdaq is made up of shares in technology firms and other companies with high growth potential.", "It was the most potent symbol of the 1990s internet and telecoms boom and has since struggled to recover its former glory.", "However, tech giants such as Intel and dot.com survivors such as Amazon have helped revive its fortunes."], "hermes3:3b": ["Nasdaq plans $100m share sale, aiming to raise funds while potentially going public."], "stablelm-zephyr:3b": ["Nasdaq, owner of the technology-dominated Nasdaq stock index, plans to raise $100m from a share sale to the public and list on the market it operates.", "Although some see this as a step closer to a full public listing, Nasdaq previously dismissed similar suggestions.", "The company first sold shares in private placements during 2000 and 2001, then technically went public in 2002 when stock started trading on the OTC Bulletin Board.", "Nasdaq comprises shares in technology firms with high growth potential, recovering after the dot-com boom and seeing a revival in fortunes of tech giants like Intel and Amazon."], "chatgpt-4o-latest": ["Nasdaq plans to sell $100 million in shares and list itself on the market it operates.", "While some see this as a step toward a full public listing, Nasdaq has downplayed such speculation.", "The company previously sold shares privately in 2000 and 2001 and began trading publicly on the OTC Bulletin Board in 2002.", "Nasdaq will not profit from the sale; only private investors will.", "Known for its technology-focused stocks, Nasdaq was a key symbol of the 1990s tech boom, suffered after the bubble burst, and has since rebounded with the recovery of major tech firms."], "stablelm2:1.6b": ["Nasdaq plans to sell shares through a public offering, raising $£x for investors.", "This is not expected to generate profits for Nasdaq itself but will benefit those who purchased shares in private placements.", "Founded in the tech boom, it went public in 1992 and has since rebounded with investments in tech firms and companies with high growth potential."], "granite3.1-dense:2b": ["Nasdaq Stock Market, owner of the Nasdaq index, intends to sell $100m worth of shares to the public, aiming for a full market listing.", "This move comes after previous private share sales in 2000 and 2001, with its first public trading on the OTC Bulletin Board in 2002.", "Nasdaq will not profit from this sale; instead, investors who purchased shares during those private placements will benefit.", "Historically significant as a symbol of the 1990s tech boom, Nasdaq experienced a significant downturn following the internet and telecoms bubble burst.", "Recently, a resurgence in tech giants' and surviving dot-com companies' fortunes has bolstered its position."]}