{"raw_text": "Warning over US pensions deficit\n \n Taxpayers may have to bail out the US agency that protects workers' pension funds, leading economists have warned.\n \n With the Pension Benefit Guaranty Corporation (PBGC) some £23bn (£12m) in deficit, the Financial Economists Roundtable (FER) wants Congress to act. Instead of taxpayers having to pick up the bill, the FER wants Congressmen to change the PBGC's funding rules. The FER says firms should not have been allowed to reduce the insurance premiums they pay into the PBGC fund. The FER blames this on a 2004 law, in a statement signed by several members, who include Nobel economics laureate William Sharpe. It said it was \"dismayed\" at the situation and wants Congress to overturn the legislation.\n \n Cash-strapped US companies, including those in the airline, car-making and steel industries, had argued in favour of the 2004 rule change, claiming that funding the insurance premiums adequately would force them to have to cut jobs. \"With a little firmer hand on the pensions issues in the US, I think that Congress could avoid having to turn to the taxpayer and instead turn the obligations back onto the companies that deserve to pay them,\" said Professor Dennis Logue, dean of Price College of Business at the University of Oklahoma. The PBGC was founded in 1974 to protect workers' retirement rights. Its most recent action came last week when it took control of the pilots' pension scheme at United Airlines. With United battling bankruptcy, the carrier had wanted to use the money set aside for pensions to finance running costs. The company has an estimated $2.9bn hole in its pilots' pension scheme, which the PBGC will now guarantee.\n", "llama3.2:1b": ["US agency that protects workers' pension funds is facing a £23bn deficit.", "Economists warn taxpayers may need to bail it out.", "FER (Financial Economists Roundtable) suggests changing funding rules for the Pension Benefit Guaranty Corporation, rather than passing on the bill to companies.", "Companies in industries such as airlines and steel had argued that reduced premiums would lead to job cuts."], "llama3.2:3b": ["Taxpayers may have to bail out the Pension Benefit Guaranty Corporation (PBGC), which is £23bn (£12m) in deficit.", "Economists blame a 2004 law that reduced insurance premiums paid by firms, allowing them to cut jobs instead of paying their pension obligations.", "The Financial Economists Roundtable wants Congress to change funding rules rather than taxpayers picking up the bill."], "gemma2:2b": ["The Pension Benefit Guaranty Corporation (PBGC) is facing a £23 billion deficit and economists are warning that taxpayers may have to cover the shortfall.", "The Financial Economists Roundtable (FER) demands that Congress changes funding rules for the PBGC to prevent taxpayer burdening.", "The FER blames the 2004 law allowing companies to reduce their insurance premiums, leading to the current deficit.", "This comes as cash-strapped companies argued against adequate funding, citing job cuts as a result.", "The PBGC recently intervened in United Airlines' pilots' pension scheme after it faced bankruptcy and wanted to use retirement funds for running costs."], "qwen2.5:0.5b": ["A group of economists have warned that US pension funds may be at risk due to a government funding rule change, but it could potentially force companies to cut jobs.", "They believe this is not necessary and they hope that Congress can overturn the 2004 law signed by several members of the Federal Reserve Board."], "qwen2.5:1.5b": ["The US's Pension Benefit Guaranty Corporation faces a £23bn deficit and may require taxpayer bailouts if Congress does not act.", "Economists blame a 2004 law for firms reducing insurance premiums, leading to increased funding needs and potential job cuts.", "Companies like airlines, carmakers, and steel manufacturers argued against the rule change that led to the PBGC's current financial problems."], "qwen2.5:3b": ["Warning over US pensions deficit: Financial Economists Roundtable (FER) warns of potential taxpayer bailout for Pension Benefit Guaranty Corporation (PBGC), facing £23bn deficit.", "FER advocates Congress changing funding rules; they blame a 2004 law allowing firms to reduce insurance premiums into PBGC's fund, which led to current deficit situation.", "US companies argued this would force job cuts but now claim it has forced them to rely on taxpayers instead.", "Dean of Price College of Business at University of Oklahoma suggests Congress could avoid taxpayer burden by shifting financial obligations back onto affected companies.", "Recent action includes PBGC taking control of United Airlines' pilots pension scheme, estimated at $2.9bn deficit."], "opencoder:1.5b": ["\"Warning over US pensions deficit.\"", "This is a concise summary of a key issue faced by tax-payers in the United States, which was the need to take a detraction from their retirement savings.", "The FER wants Congressmen to change the PBGC's funding rules and argue that firms should not have been allowed to reduce insurance premiums into the fund.", "The situation is disheartening for cash-strapped companies such as aircraft pilots who had hoped to use the money invested in retirement security to finance operational costs."], "smollm:1.7b": ["The US pension deficit is a significant issue that requires immediate attention from Congress.", "With the Pension Benefit Guaranty Corporation (PBGC) some £23bn in deficit, it is essential to address this issue and find a solution that ensures the long-term sustainability of these funds.", "The FER blames the 2004 law for allowing firms to reduce the insurance premiums they pay into the PBGC fund, which has led to the current situation.", "To avoid having to turn to taxpayers, Congress could take steps to ensure that companies are adequately funding their pension schemes and reducing the deficit.", "This can be achieved by increasing the funding rates or introducing new regulations that require companies to contribute a larger share of their profits towards pension schemes."], "deepseek-r1:1.5b": ["The U.S. pension system faces a £23 billion deficit due to the Pension Benefit Guaranty Corporation (PBGC), which may require taxpayers to bail out the agency that protects workers' retirement funds.", "The Financial Economists Roundtable (FER) wants Congress to act, arguing that allowing firms to reduce their insurance premiums paid into the PBGC fund would force them to cut jobs instead of paying for benefits.", "FER accuses a 2004 law of \"dismayed\" conditions and urges Congress to overturn it.", "U.S. companies have argued that cutting jobs could make their payments easier, but they now face £2.9 billion in an already struggling system due to Bank of America's bankruptcy.", "PBGC was established in 1974 and has recently controlled United Airlines' pilots' pension scheme, leaving a £2.9 billion shortfall."], "tinyllama:1.1b": ["The US government is facing a potential fiscal crisis as it is at risk of being hit with penalties for deficit spending, leading economists warn.", "The Pennihons Benefit Guaranby (PBG) has been some $23bn in deficipled, and the Financiaeconomics Roundtable (FER) urged Congress to act instead of taxpayers bailing out the PBG.", "The FER blamed this on a 2004 law allowing firms to reduce insurance premiums into the PBG, but also asked for Congress to change the legislation.", "As US companies in sectors such as airlines, automotive, and steel industries had argued in favor of the 2004 rule change, the FER believes that funding the insurance premiums adequately would force companies to have to cut jobs.", "With a little firm hand on the pennihons issues, Professors Dennis Logue and Denis Shaevsky argue that Congress could avoid having to turn over these obligations back onto the companies that deserve them, suggesting the PBG take control of pilots' pension scheme at United Airlines."], "tinydolphin:1.1b": [" The US government may need to bail out the agency that protects workers' pension funds by leading economists, according to the Financial Economists Roundtable (FER).", "In a statement signed by several members, including Nobel economics laureate William Sharpe, FER claims that the 2004 rule change allowed companies to reduce their insurance premiums for workers' pension plans.", "This change is said to have been made in an effort to alleviate some of the burden placed on taxpayers.", "However, Cash-strapped US companies argued against the 2004 rule change, claiming that funding the insurance premiums adequately would force them to cut jobs.", "In response to this criticism, the Pension Benefit Guaranty Corporation (PBGC), or its predecessor, took control of United Airlines' pilots' pension fund in a move that may have created significant financial difficulties for the carrier.", "This has left the PBGC in a precarious position, with many wondering if it will be able to make good on its commitments to ensure workers' retirement rights.", "The FER believes that it is crucial for Congress to reconsider these changes and find more sustainable ways of handling pension funds in the US."], "phi:2.7b": [" Taxpayers may have to pay to bail out the US agency that protects workers' pension funds due to a deficit of £23 billion.", "Economists want Congress to change the funding rules and prevent firms from reducing insurance premiums into the fund.", "They blame a law passed in 2004 for this, stating it could be overturned.", "Cash-strapped companies had argued in favor of this law, which they said would force them to lay off jobs.", "The PBGC is responsible for protecting workers' retirement rights and was founded in 1974.", "It recently took control of the pilots' pension scheme at United Airlines due to bankruptcy concerns."], "orca-mini:3b": [" The US agency that protects workers' pension funds is facing a £23bn deficit, and some members of Congress want to change the funding rules to prevent companies from reducing insurance premiums into the fund.", "The PBGC was founded in 1974 to protect workers' retirement rights, but some companies argue that funding the insurance premiums adequately would force them to cut jobs.", "The US agency took control of the pilots' pension scheme at United Airlines last week."], "hermes3:3b": ["US Pensions Deficit Warning: Taxpers may need to bail out PBGC (Pension Benefit Guaranty Corp) as it is £23bn in deficit.", "FER recommends changing funding rules to avoid taxpayer burden."], "stablelm-zephyr:3b": ["Economists warn that taxpayers may have to bail out the US Pension Benefit Guaranty Corporation (PBGC), which protects workers' pension funds, as it is £23bn in deficit.", "The Financial Economists Roundtable (FER) suggests that Congress should change funding rules for the PBGC instead of taxpayers having to foot the bill.", "They blame a 2004 law for allowing firms to reduce insurance premiums paid into the PBGC fund and want this legislation overturned.", "Cash-strapped US companies supported the 2004 rule change, arguing it would force them to cut jobs if they had to adequately fund insurance premiums."], "chatgpt-4o-latest": ["Economists warn that US taxpayers may have to bail out the Pension Benefit Guaranty Corporation (PBGC), which faces a $23 billion deficit.", "The Financial Economists Roundtable (FER) urges Congress to revise PBGC funding rules instead of relying on taxpayer support.", "The FER blames a 2004 law that allowed firms to reduce insurance premiums paid into the PBGC fund and calls for its repeal.", "Struggling industries, including airlines and car manufacturers, had supported the rule change to avoid job cuts.", "The PBGC, established in 1974 to protect workers' pensions, recently took over United Airlines' pilots' pension scheme, which has a $2.9 billion shortfall.", "Economists argue that Congress should hold companies accountable for pension obligations rather than shifting the burden to taxpayers."], "stablelm2:1.6b": ["Key points: \n1.", "US agency, Pension Benefit Guaranty Corporation (PBGC), is £50 billion ($86 billion) in deficit.", "2.", "Financial Economists Roundtable (FER) urges Congress to change PBGC's funding rules instead of taxpayers bailing out the agency.", "3.", "FER blames current funding rules for insurance premiums as a result of a 1988 law, which aims to avoid bailouts from the taxpayer.", "4.", "US companies in various industries have argued that cutting jobs is necessary due to funding the insurance premiums, but this could lead to bankruptcy and other financial difficulties.", "5.", "PBGC took control of United Airlines' pilots' pension scheme last week after the airline sought to use funds set aside for pensions to cover ongoing costs during bankruptcy."], "granite3.1-dense:2b": ["The Pension Benefit Guaranty Corporation (PBGC) faces a £23 billion deficit, according to the Financial Economists Roundtable (FER).", "This group of economists, including Nobel laureate William Sharpe, warns that taxpayers may need to bail out PBGC.", "The FER argues that Congress should amend the 2004 law, which allowed companies to reduce insurance premiums paid into the PBGC fund.", "These businesses, including those in airlines, automotive manufacturing, and steel industries, claimed reducing premiums would lead to job cuts.", "Professor Dennis Logue suggests Congress could prevent this by enforcing stricter payment obligations on deserving companies rather than relying on taxpayers.", "The PBGC, established in 1974, recently took control of United Airlines' pilots' pension scheme due to the company's bankruptcy and a £2.9 billion deficit in its pension fund."]}