{"raw_text": "Beer giant swallows Russian firm\n \n Brewing giant Inbev has agreed to buy Alfa-Eco's stake in Sun Interbrew, Russia's second-largest brewer, for up to 259.7m euros ($353.3m; £183.75m).\n \n Alfa-Eco, the venture capital arm of Russian conglomerate Alfa Group, has a one-fifth stake in Sun Interbrew. The deal gives Inbev, the world's biggest beermaker, near-total control over the Russian brewer. Inbev bought out another partner in August 2004. Inbev brands include Bass, Stella Artois, Hoegaarden and Staropramen. It employs 77,000 people, running operations in over 30 countries across the Americas, Europe and Asia Pacific.\n \n The Leuven-based brewery said it would own 97.3% of the voting shares and 98.8% of the non-voting shares of Sun Interbrew. The deal is expected to be completed in the first quarter of 2005. Inbev was formed in August 2004 when Belgium's Interbrew bought Brazilian brewer Ambev. Sun Interbrew, which employs 8,000 staff, owns breweries in eight Russian cities - Klin, Ivanovo, Saransk, Kursk, Volzhsky, Omsk, Perm and Novocheboksarsk. There are also three breweries in Ukraine, in the cities of Chernigov, Nikolaev and Kharkov.\n", "llama3.2:1b": ["Inbev has agreed to buy Alfa-Eco's stake in Sun Interbrew for up to 259.7m euros ($353.3m; £183.75m) in exchange for near-total control over the Russian brewer.", "The deal gives Inbev a one-fifth stake and nearly 98% of voting shares, while Alfa-Eco retains the remaining non-voting shares."], "llama3.2:3b": ["Inbev to buy Alfa-Eco's stake in Sun Interbrew for up to 259.7m euros, gaining near-total control over Russia's second-largest brewer.", "Inbev already owns majority stake in Sun Interbrew, acquired in August 2004.", "The deal will be completed in Q1 2005 and gives Inbev 97.3% of voting shares and 98.8% of non-voting shares."], "gemma2:2b": ["Inbev has purchased Alfa-Eco's stake in Sun Interbrew, gaining near-total control of the Russian brewer.", "The deal gives Inbev 97.3% voting shares and 98.8% non-voting shares of Sun Interbrew, with completion expected in Q1 2005.", "Sun Interbrew is Russia's second largest brewer, with operations in eight cities and three in Ukraine.", "Inbev owns brands like Bass, Stella Artois, Hoegaarden, and Staropramen."], "qwen2.5:0.5b": ["Inbev has agreed to buy Alfa-Eco's 98.8% stake in Russian brewer Sun Interbrew.", "The deal is expected to be completed by the first quarter of 2005.", "Sun Interbrew currently employs over 30,000 people across eight Russian cities, including Klin, Ivanovo, Saransk, Kursk, Volzhsky, Omsk, Perm and Novocheboksarsk."], "qwen2.5:1.5b": ["Inbev has agreed to buy Alfa-Eco's stake in Sun Interbrew for 259.7 million euros, giving Inbev near-total control over the Russian brewer.", "The deal is expected to be completed by Q1 2005.", "Inbev now owns 97.3% of voting shares and 98.8% of non-voting shares in Sun Interbrew."], "qwen2.5:3b": ["Beer giant Inbev has agreed to buy Alfa-Eco's stake in Sun Interbrew, Russia's second-largest brewer, for up to 259.7m euros.", "This deal gives Inbev near-total control over the Russian brewer.", "Inbev brands include Bass, Stella Artois, Hoegaarden and Staropramen; it employs 77,000 people across multiple continents.", "The deal is expected to be completed in Q1 2005.", "Sun Interbrew has breweries in eight Russian cities and three in Ukraine, employing a total of 8,000 staff."], "opencoder:1.5b": ["Beer giant swallows Russian firm Brewing giant Inbev has agreed to buy Alfa-Eco's stake in Sun Interbrew for up to 259.7m euros ($353.3m; £183.75m).", "Alfa-Eco controls Sun Interbrew, which is the world’s biggest beermaker.", "Inbev bought out another partner in August 2004 and operates 77,000 people across 30 countries.", "The deal is expected to be completed in the first quarter of 2005."], "smollm:1.7b": ["The summary is concise and to the point, capturing the main points of the original text while omitting unnecessary details.", "It provides a brief overview of the key players involved in the deal, the terms of the agreement, and the implications for the Russian brewery industry."], "deepseek-r1:1.5b": ["Inbev, a world-renowned beer giant, has agreed to purchase a substantial stake in Sun Interbrew, Russia's second-largest brewer.", "Alfa-Eco, a venture capital arm of Alfa Group, owns approximately 20% of Sun Interbrew.", "This deal allows Inbev to gain nearly complete control over the Russian brewing industry.", "The transaction is expected to be completed by the end of Q1 2005 and costs up to 259.7 million euros.", "Before the buyout, Inbev held a significant stake in Sun Interbrew, which employs 8,000 staff.", "The company operates breweries in eight Russian cities: Klin, Ivanovo, Saransk, Kursk, Volzhsky, Omsk, Perm, and Novocheboksarsk.", "There are three breweries in Ukraine, located in Chernigov, Nikolaev, and Kharkov."], "tinyllama:1.1b": ["Inbev has agreed to buy Alfa-Eco's stake in Sun Interbrew for up to €353 million ($402 million; £278 million).", "Alfa-Eco, the investment arm of Russian conglomerate Alfagrupo, holds a 15% share in Sun Interbrew, which is the second-largest brewer in Russia.", "Inbev, the world's largest beer producer, will own 97.3% of the voting shares and 98.8% of non-voting shares in the company.", "The deal is expected to complete in the first quarter of 2005.", "Sun Interbrew employs over 8,000 staff and has breweries in eight Russian cities, as well as one in Ukraine."], "tinydolphin:1.1b": [" In July, French multinational corporation France Telecom reached a deal to acquire a majority stake in Deutsche Telecom from Rupert Schmitz, the former head of Germany's federal intelligence agency, BND.", "The deal is expected to be completed by the end of this year and will give France Telecom control over the European market for telecommunications services.", "The acquisition is part of a larger consolidation strategy by France Telecom aimed at expanding its presence in Europe, particularly in countries like Germany, France, and Italy where it has been facing stiff competition from rival incumbents such as Vodafone, SFR, O2 and Telecom Italia.", "In addition to Deutsche Telecom, the deal also includes a 30% stake in Mobilis, a French mobile telecommunications company that operates under the Orange and T-Mobile brands in Europe.", "Rupert Schmitz's departure from the BND has opened up possibilities for further expansion for France Telecom in this market.", "The acquisition of Deutsche Telecom is part of a broader strategy by France Telecom to position itself as a leading telecommunications company in Europe, aiming to capture share from Vodafone and other major players such as SFR and O2.", "This move is likely to boost the company's reputation for innovation and customer service, both in Germany and throughout the European market."], "phi:2.7b": [" Inbev has acquired Alfa-Eco's stake in Sun Interbrew, Russia's second-largest brewer, for up to $353.3 million euros.", "The deal will give Inbev nearly complete control over Sun Interbrew, which operates breweries in eight Russian cities and three Ukrainian cities, employing 8,000 staff."], "orca-mini:3b": [" Inbev, the world's largest beer maker, has acquired a stake in Sun Interbrew, Russia's second-largest brewer, for up to 259.7m euros ($353.3m; £183.75m).", "With Inbev's acquisition of another partner in August 2004, Inbev now has near-total control over the Russian brewer.", "Sun Interbrew owns breweries in eight Russian cities and there are also three breweries in Ukraine."], "hermes3:3b": ["Inbev acquires nearly full control over Russian brewer Sun Interbrew by buying out Alfa-Eco's stake for up to 259.7m euros."], "stablelm-zephyr:3b": ["Brewing giant Inbev has acquired Alfa-Eco's stake in Sun Interbrew, Russia's second-largest brewer, for up to 259.7 million euros.", "This deal gives Inbev near-total control over the Russian brewer, owning 97.3% of voting shares and 98.8% of non-voting shares.", "The completion is expected in first quarter of 2005.", "Sun Interbrew has eight breweries in Russia as well as three in Ukraine."], "chatgpt-4o-latest": ["Brewing giant Inbev has agreed to buy Alfa-Eco's one-fifth stake in Sun Interbrew, Russia's second-largest brewer, for up to 259.7 million euros, giving Inbev near-total control.", "Inbev, the world's largest beermaker, had already bought out another partner in August 2004.", "The deal will give Inbev 97.3% of voting shares and 98.8% of non-voting shares in Sun Interbrew, with completion expected in early 2005.", "Inbev, formed from the 2004 merger of Interbrew and Ambev, operates in over 30 countries.", "Sun Interbrew employs 8,000 people and owns breweries in eight Russian cities and three in Ukraine."], "stablelm2:1.6b": ["Beer giant Inbev has agreed to acquire Alfa-Eco's stake in Sun Interbrew, the second-largest Russian brewer, for up to €25 million ($30 million; £24 million).", "This deal grants Inbev near-total control over the Russian brewery.", "Inbev already owns a 9% stake in Sun Interbrew and would own 3.3% of voting shares and 8.3% of non-voting shares under the new agreement.", "The acquisition is set to be completed by Q1 2015, following which Inbev will own 46.74% of Sun Interbrew's voting rights and 34.69% of non-voting rights."], "granite3.1-dense:2b": ["Inbev, the world's leading beer producer, has acquired a significant stake in Russia's second-largest brewer, Sun Interbrew, from Alfa-Eco, a venture capital arm of Russian conglomerate Alfa Group.", "This acquisition involves Inbev purchasing Sun Interbrew's remaining shares for up to 259.7 million euros, granting it nearly complete control over the brewer.", "The deal is expected to be finalized in Q1 2005.", "Sun Interbrew, with 8,000 employees, operates breweries in eight Russian cities and three in Ukraine.", "This acquisition expands Inbev's global presence, which already includes brands like Bass, Stella Artois, Hoegaarden, and Staropramen, and manages operations across the Americas, Europe, and Asia Pacific."]}