{"raw_text": "US manufacturing expands\n \n US industrial production increased in December, according to the latest survey from the Institute for Supply Management (ISM).\n \n Its index of national manufacturing activity rose to 58.6 last month from 57.8 in November. A reading above 50 indicates a level of growth. The result for December was slightly better than analysts' expectations and the 19th consecutive expansion. The ISM said the growth was driven by a \"significant\" rise in the new orders. \"This completes a strong year for manufacturing based on the ISM data,\" said chairman of the ISM's survey committee. \"While there is continuing upward pressure on prices, the rate of increase is slowing and definitely trending in the right direction.\"\n \n The ISM's index of national manufacturing activity is compiled from monthly responses of purchasing executives at more than 400 industrial companies, ranging from textiles to chemicals to paper, and has now been above 50 since June 2003. Analysts expected December's figure to come in at 58.1. The ISM manufacturing index's main sister survey - the employment index - eased to 52.7 in December from 57.6 in November, while its \"prices paid\" index, measuring the cost to businesses of their inputs, also eased to 72.0 from 74.0. The ISM's \"new orders\" index rose to 67.4 from 61.5.\n", "llama3.2:1b": ["US industrial production increased by 0.6% in December.", "Its manufacturing activity index rose to 58.6, driven primarily by a surge in new orders.", "This marks the 19th consecutive expansion and improves on analysts' expectations.", "The growth rate is expected to slow as prices rise.", "The ISM's manufacturing index has been above 50 since June 2003."], "llama3.2:3b": ["US manufacturing production increased in December with an index reading of 58.6, beating analyst expectations and marking the 19th consecutive month of expansion.", "Growth was driven by a significant rise in new orders, with the \"new orders\" index rising to 67.4.", "The employment index eased to 52.7, while prices paid eased to 72.0."], "gemma2:2b": ["US manufacturing expanded in December, with the ISM index reaching 58.6.", "This is the 19th consecutive month of growth and driven by a surge in new orders.", "Prices continue to increase but at a slower rate.", "The employment and prices paid indices also showed some easing."], "qwen2.5:0.5b": ["US manufacturing expanded in December, according to a survey by the Institute for Supply Management (ISM).", "Its national manufacturing activity index rose to 58.6 last month from 57.8 in November.", "Analysts expect further growth due to a \"significant\" rise in new orders and slower price inflation rates.", "This concludes the summary of the provided text."], "qwen2.5:1.5b": ["US manufacturing increased in December with an index rising to 58.6, marking the 19th consecutive expansion and driven by a significant rise in new orders.", "Analysts had expected a figure of 58.1.", "The ISM's employment index eased slightly while other indices showed downward trends in costs and prices."], "qwen2.5:3b": ["US manufacturing expands with December industrial production increasing by 58.6 (up from 57.8 in November), indicating a growth level above 50, surpassing analyst expectations and marking the 19th consecutive month of expansion.", "The ISM attributes this to a significant rise in new orders.", "While inflation pressures persist, their rate is slowing, suggesting progress towards favorable conditions.", "This index has consistently exceeded 50 since June 2003.", "The employment index eased slightly to 52.7 (down from 57.6) and the \"prices paid\" index fell to 72.0 (from 74.0), reflecting a deceleration in input costs."], "opencoder:1.5b": ["The key details and ideas in the text are as follows: \n\n1.", "US manufacturing expands\n2.", "US industrial production increased in December, according to the latest survey from the Institute for Supply Management (ISM).", "3.", "The index of national manufacturing activity rose to 58.6 last month from 57.8 in November.", "4.", "A reading above 50 indicates a level of growth.", "5.", "The result for December was slightly better than analysts' expectations and the 19th consecutive expansion.", "6.", "The ISM said the growth was driven by a \"significant\" rise in the new orders.", "7.", "This completes a strong year for manufacturing based on the ISM data.", "8.", "While there is continuing upward pressure on prices, the rate of increase is slowing and definitely trending in the right direction.", "9.", "The index of national manufacturing activity is compiled from monthly responses of purchasing executives at more than 400 industrial companies, ranging from textiles to chemicals to paper, and has now been above 50 since June 2003.", "10.", "Analysts expected December's figure to come in at 58.1.", "11.", "The ISM manufacturing index's main sister survey - the employment index - eased to 52.7 in December from 57.6 in November.", "12.", "Its \"prices paid\" index, measuring the cost to businesses of their inputs, also eased to 72.0 from 74.0.", "13.", "The ISM's \"new orders\" index rose to 67.4 from 61.5."], "smollm:1.7b": ["The US manufacturing expanded in December, with its index rising by 3.9% to 58.6 from 57.8 in November.", "This was a significant increase driven by the growth of new orders, which accounted for 20.4% of total production.", "The ISM's survey committee said that this expansion is \"trending in the right direction\" and that prices are still rising."], "deepseek-r1:1.5b": ["US manufacturing shows signs of strong expansion with industrial production rising in December at 58.6 compared to 57.8 last month.", "Growth was driven by a significant rise in new orders, indicating quicker picking up of demand.", "This is the 19th consecutive expansion month as ISM data highlights increasing activity since June 2003.", "Analysts expect December's figure at 58.1 but observed it higher.", "The \"prices paid\" index dropped to 72.0, signaling rising input costs despite a modest slowdown in growth."], "tinyllama:1.1b": ["The US manufacturing industry expanded in December, according to the latest survey from the Institute for Supply Management (ISM).", "Its index of national manufacturing activity rose to 58.6 in December, beating market expectations and marking a sustained expansion.", "The ISM's manufacturing index showed a \"significant\" rise in new orders, with a slowing upward pressure on prices but the rate of increase \"trending in the right direction.\"", "Analysts expected a reading above 50 on December 18th but instead fell below it at 52.7.", "The ISM's main sister survey - the employment index - also edged up to 52.7 from 57.6, while its \"price paid\" index also rose to 72.0 from 74.0.", "The ISM's \"new orders\" index fell to 67.4 from 61.5."], "tinydolphin:1.1b": [" US industrial production increased in December as the latest survey from the Institute for Supply Management (ISM) reports.", "With a reading above 50, the result for December was slightly better than analysts' expectations and the 19th consecutive expansion.", "The index of national manufacturing activity continues to show upward pressure on prices and is moving in the right direction, according to the ISM report."], "phi:2.7b": [" US industrial production increased in December according to the latest survey by Institute for Supply Management (ISM).", "Its national manufacturing activity index reached 58.6, higher than expected and marking 19th consecutive expansion.", "The growth was driven by significant rise in new orders which has been consistent in the past two years.", "Analysts expect this trend to continue with slowing increase in prices."], "orca-mini:3b": [" US manufacturing expanded in December according to the latest survey from the Institute for Supply Management (ISM).", "Its index of national manufacturing activity rose to 58.6 last month from 57.8 in November, indicating growth.", "The result was slightly better than analysts' expectations and the 19th consecutive expansion.", "The ISM reported that the growth was driven by a \"significant\" rise in new orders."], "hermes3:3b": ["US manufacturing index at 58.6 in Dec, indicating growth; above 50 indicates expansion."], "stablelm-zephyr:3b": ["US manufacturing activity expanded in December, with the Institute for Supply Management (ISM) reporting a national manufacturing index of 58.6, slightly better than expected and marking the 19th consecutive expansion.", "The growth was driven by a significant increase in new orders, according to the ISM's survey committee chairman.", "The improvement comes as the main sister survey, the employment index, eased slightly, while the \"prices paid\" index remained steady."], "chatgpt-4o-latest": ["US industrial production expanded in December, with the ISM manufacturing index rising to 58.6 from 57.8 in November, marking the 19th consecutive month of growth.", "The increase was driven by a significant rise in new orders, and while price pressures remain, their rate of increase is slowing.", "The index, based on responses from over 400 industrial companies, has remained above 50 since June 2003.", "Analysts had expected a reading of 58.1.", "Meanwhile, the ISM employment index declined to 52.7 from 57.6, and the \"prices paid\" index eased to 72.0 from 74.0.", "The \"new orders\" index rose to 67.4 from 61.5."], "stablelm2:1.6b": ["US manufacturing expands in December with a rise in new orders, according to the Institute for Supply Management's survey.", "The index of national manufacturing activity increased to 6.0 last month from 8.0 in November.", "Analyst expectations were met as the growth was driven by an increase in new orders, signaling a strong year for manufacturing based on ISM data.", "Prices are trending downwards while still increasing at a slower rate."], "granite3.1-dense:2b": ["US manufacturing saw growth in December, as per the Institute for Supply Management (ISM) survey.", "The national manufacturing activity index increased to 58.6 from 57.8 in November, surpassing analysts' expectations of 58.1 and marking the 19th consecutive month of expansion since June 2003.", "This growth was primarily fueled by a significant rise in new orders.", "The ISM chair noted a slowdown in upward pressure on prices but an overall positive trend.", "The main sister survey, the employment index, decreased slightly to 52.7 from November's 57.6.", "The \"prices paid\" index also eased from 74.0 to 72.0.", "New orders rose to 67.4 from 61.5 in November."]}