{"raw_text": "Reliance unit loses Anil Ambani\n \n Anil Ambani, the younger of the two brothers in charge of India's largest private company, has resigned from running its petrochemicals subsidiary.\n \n The move is likely to be seen as the latest twist in a feud between Mr Ambani and his brother Mukesh. Anil, 45, has stepped down as director and vice-chairman of Indian Petrochemicals Corporation (IPC). The company was not available for comment. IPC is 46%-owned by Reliance Industries which in turn is run by Mukesh. Mukesh has spoken of ownership issues between the two brothers, who took over control of the Reliance empire following the death of their father in July, 2002.\n \n Reliance's operations have massive reach, covering textiles, telecommunications, petrochemicals, petroleum refining and marketing, as well as oil and gas exploration, insurance and financial services. The brothers' spat has hogged headlines in India during recent weeks, despite a denial from the family that there was anything wrong. Speculation has been rife about what has triggered the stand-off, with some observers blaming Anil's political ambitions, others the heavy investment by Mukesh and Reliance in a mobile phone venture. Shares of IPC dipped on the news in Mumbai, but recovered to trade almost 6% higher. Reliance shares added 1.7%, while Reliance Energy, headed by Anil, jumped 7%.\n", "llama3.2:1b": ["Anil Ambani resigned from Indian Petrochemicals Corporation (IPC), Reliance's petrochemicals subsidiary, likely due to a feud with his brother Mukesh over ownership issues and control of the company.", "IPC is 46% owned by Reliance Industries, which in turn is run by Mukesh."], "llama3.2:3b": ["Anil Ambani has resigned as director and vice-chairman of Indian Petrochemicals Corporation, a subsidiary of Reliance Industries led by his brother Mukesh.", "The move is part of a long-standing feud between the two brothers, who took over control of the Reliance empire after their father's death in 2002."], "gemma2:2b": ["Anil Ambani has resigned as director and vice-chairman of Indian Petrochemicals Corporation (IPC), a subsidiary of Reliance Industries.", "The move follows tension between the brothers, Mukesh and Anil, who inherited control of Reliance Industries after their father's death.", "The conflict has drawn media attention and speculation about its causes.", "Shares of IPC initially dropped but later recovered, while shares in Reliance Industries and Reliance Energy rose."], "qwen2.5:0.5b": ["Reliance unit loses Anil Ambani: The younger brother of Mukesh Ambani has resigned as IPC director and vice-chairman due to a feud with his older brother, Anil.", "This comes after speculation about the cause of the spat.", "Reliance's operations are diverse, spanning various industries including textiles, telecommunications, petrochemicals, and oil/gas exploration.", "The dispute highlights the company's scale despite a family feud involving both brothers."], "qwen2.5:1.5b": ["Anil Ambani resigns as director and vice-chairman of IPC following feud with Mukesh over ownership issues within the Reliance group, amidst speculation about political ambitions or investment rivalry.", "Shares of IPC fell briefly but rebounded to trade higher compared to Reliance's gains."], "qwen2.5:3b": ["Anil Ambani, aged 45 and younger brother of Mukesh Ambani, has resigned from his roles as director and vice-chairman of Indian Petrochemicals Corporation (IPC), a subsidiary of India's largest private company, Reliance Industries.", "This move signals the latest tension between the two brothers following their takeover of the Reliance empire after their father's death in 2002.", "IPC is partially owned by Reliance Industries, which Mukesh runs.", "The feud has been prominent in Indian media despite family denials and speculation about potential triggers like Anil's political ambitions or Mukesh’s investments in a mobile phone venture.", "IPC shares fell initially but recovered, while Reliance and its subsidiary Reliance Energy saw gains."], "opencoder:1.5b": ["Reliance unit loses Anil Ambani\n\nAnil Ambani, the younger of the two brothers in charge of India's largest private company, has resigned from running its petrochemicals subsidiary.", "The move is likely to be seen as the latest twist in a feud between Mr Ambani and his brother Mukesh.", "Anil, 45, has stepped down as director and vice-chairman of Indian Petrochemicals Corporation (IPC).", "The company was not available for comment.", "IPC is 46%_owned by Reliance Industries which in turn is run by Mukesh.", "Mukesh has spoken of ownership issues between the two brothers, who took over control of the Reliance empire following the death of their father in July, 2002.", "Reliance's operations have massive reach, covering textiles, telecommunications, petrochemicals, petroleum refining and marketing, as well as oil and gas exploration, insurance and financial services.", "The brothers' spat has hogged headlines in India during recent weeks, despite a denial from the family that there was anything wrong.", "Speculation has been rife about what has triggered the stand-off, with some observers blaming Anil's political ambitions, others the heavy investment by Mukesh and Reliance in a mobile phone venture.", "Shares of IPC dipped on the news in Mumbai, but recovered to trade almost 6% higher.", "Reliance shares added 1.7%, while Reliance Energy, headed by Anil, jumped 7%."], "smollm:1.7b": ["Reliance Industries has announced that its director and vice-chairman have resigned due to disagreements between the brothers Anil and Mukesh Ambani.", "The move is likely seen as a reaction to the recent tension between the two brothers over ownership issues at Reliance Petrochemicals Corporation (IPC), which is 46% owned by Reliance Industries.", "The IPC subsidiary was not available for comment, but it has been reported that Anil Ambani stepped down as director and vice-chairman of the company in July 2002, following his father's death.", "This move is likely seen as a way to distance himself from his brother's political ambitions and to focus on his own business interests.", "The brothers' feud has been ongoing for several years, with both Anil and Mukesh accusing each other of mismanaging the company's operations.", "The IPC subsidiary was not available for comment, but it is likely that the brothers will continue to work together in their respective roles at Reliance Industries.", "Reliance Industries has a massive reach in India, covering textiles, telecommunications, petrochemicals, petroleum refining and marketing, as well as oil and gas exploration, insurance and financial services.", "The brothers' business interests are also intertwined, with both Anil and Mukesh owning significant stakes in various subsidiaries of the company.", "The IPC subsidiary was not available for comment, but it is likely that the brothers will continue to work together in their respective roles at Reliance Industries.", "The IPC subsidiary has been a key driver of India's economic growth, and its success has been seen as a symbol of the country's ability to diversify its economy away from oil and gas dependence.", "Reliance Energy, headed by Anil, jumped 7% on the news in Mumbai, but recovered to trade almost 10% higher.", "Reliance shares added 6% to their overall market value, while Reliance Petroleum Corporation (RPC) rose 2%.", "The IPC subsidiary was not available for comment, but it is likely that the brothers will continue to work together in their respective roles at Reliance Industries."], "deepseek-r1:1.5b": ["Anil Ambani has stepped down as director and vice-chairman of Reliance Industries' petrochemicals subsidiary, India Petrochemicals Corporation (IPC), which is owned 46% by Mukesh.", "The resignation, part of a feud between the two brothers who controlled Reliance's empire after their father died in July 2002, has fueled speculation about political ambitions or investments in mobile technology.", "IPC shares dipped but nearly regained a 6% gain, while Reliance Energy shares saw a 1.7% rise and overall shares increased by 7%."], "tinyllama:1.1b": ["In a surprise move, Anil Ambani, the younger of the two brothers in charge of India's largest private company, has stepped down from running their petrocemicals subsidiary.", "The move is likely to be seen as the latest twist in a feud between Mukesh Ambani and his brother Anil, who control Reliance Industries, the parent company of IPC.", "Mukesh has spoken of ownership issues between the two brothers, who took over control of Reliance Empiré following the death of their father in 2002.", "However, Reliance's operations have a massive reach and cover textiles, telecommunications, petrocemicals, petroleum refining, financial services, oil and gas exploitation, insurance, and financial services.", "The brothers' spat has seen significant headlines in India this past week, despite denials from the family that anything was amiss.", "However, speculation has been raised about Anil's political ambitions alongside heavy investment by Mukesh and Reliance in a mobile phone venture.", "Shares of IPC fell on news of Ambani's resignation but recovered to trade almost 6% higher.", "Reliance shares jumped 1.7%, while Reliance Energy saw an 8% gain."], "tinydolphin:1.1b": [" The text provides an overview of a recent business event involving two brothers from India's largest private company.", "Reliance Industries, controlled by the Ambani family, lost its executive director and vice-chairman after Anil Ambani resigned from his position at Indian Petrochemicals Corporation (IPC).", "The move comes amidst a feud between the brothers over ownership of certain business units.", "IPC is 46% owned by Reliance Industries, and Mukesh is its chief operating officer.", "This feud has drawn attention in India and internationally, as well as creating uncertainty for shareholders and investors."], "phi:2.7b": [" Anil Ambani, one of India's largest private company leaders and the younger brother of Mukesh Ambani, has resigned from his position at Indian Petrochemicals Corporation (IPC).", "The feud between the brothers is believed to have started after Anil stepped down as director and vice-chairman.", "The Reliance empire covers various industries such as petrochemicals, telecommunications, textiles, and more.", "Despite speculations about what has triggered this stand-off, shares of IPC dipped initially but recovered by 6% soon after.", "Reliance Energy, headed by Anil, gained 7% in value, while Reliance's overall stocks added 1.7%."], "orca-mini:3b": [" Anil Ambani, who was vice-chairman and director of Indian Petrochemicals Corporation (IPC), which is owned by India's largest private company Reliance Industries, has resigned from running the company.", "Speculation has been rife about what has triggered the feud between the two brothers.", "The feud has hogged headlines in India during recent weeks despite a denial from the family that there was anything wrong."], "hermes3:3b": ["Anil Ambani resigns from petrochemicals subsidiary IPC (46% owned by Mukesh's Reliance Industries), likely part of feud between Ambani brothers."], "stablelm-zephyr:3b": ["Anil Ambani resigns from running Indian Petrochemicals Corporation, a move likely involving his brother Mukesh in their ongoing feud over control of Reliance Industries empire.", "Anil stepped down as director and vice-chairman of IPC, which is 46% owned by Reliance Industries led by Mukesh.", "The brothers took control of the Reliance empire after their father's death in 2002, with speculation surrounding political ambitions or heavy investment in a mobile phone venture by Mukesh and Reliance."], "chatgpt-4o-latest": ["Anil Ambani has resigned as director and vice-chairman of Indian Petrochemicals Corporation (IPC), a subsidiary of Reliance Industries, amid an ongoing feud with his brother Mukesh Ambani.", "The dispute follows their takeover of Reliance after their father's death in 2002.", "Speculation about the rift includes Anil's political ambitions and Mukesh's investments in a mobile phone venture.", "Despite the tensions, Reliance shares rose, with IPC recovering losses and Reliance Energy, led by Anil, jumping 7%."], "stablelm2:1.6b": ["Anil Ambani, who managed India's largest private company, Reliance Industries, resigned from his position as director and vice-chairman of Indian Petrochemicals Corporation (IPC), owned by both him and brother Mukesh.", "This move is likely a result of their ongoing feud, although the specific trigger was not mentioned.", "The brothers took control following their father's death and share ownership issues have been at the forefront of media attention.", "IPC's shares showed minor dips in Mumbai but recovered by almost 6%, while Reliance shares and Reliance Energy, headed by Anil, experienced significant jumps."], "granite3.1-dense:2b": ["Anil Ambani, one of the two brothers leading India's largest conglomerate, has resigned from his position as director and vice-chairman of its petrochemicals subsidiary, Indian Petrochemicals Corporation (IPC).", "This move is perceived as another development in a longstanding feud between Anil and his brother Mukesh.", "IPC, 46% owned by Reliance Industries (controlled by Mukesh), did not comment on the resignation.", "The brothers' disagreement has been a prominent issue in Indian media, with speculation pointing to factors such as political aspirations or differing investments in mobile phone ventures.", "IPC shares initially fell but later rebounded; Reliance and Reliance Energy shares also showed fluctuations post-announcement."]}