{"raw_text": "India opens skies to competition\n \n India will allow domestic commercial airlines to fly long haul international routes, a move it hopes will stoke competition and drive down prices.\n \n However, only state controlled carriers will be able to fly the lucrative Gulf routes, to countries such as Kuwait and Saudi Arabia, for at least three years. Jet Airways and Air Sahara are the two companies that will benefit initially. India is looking to develop its airline industry as booming economic growth drives demand for travel.\n \n Monica Chadha, BBC Delhi reporter, said air travel in India had increased by almost 20% from the previous year and was expected to rise even further. Infrastructure development is lagging demand, however, and will have to improve. \"Most international airports in the country are shabby and ill-equipped to handle heavy air traffic,\" Ms Chada said, adding that while the Civil Aviation minister has promised to modernise and privatise airports little progress has been made. Steps have been take to move things forward and the government recently changed legislation that limited foreign investment in domestic airlines. It raised the maximum stake holding allowed to 49% from 40%. Local press, meanwhile, have reported that the US and India will start negotiations about adding more routes in January. Jet Airways is India's premier private domestic carrier; Air Sahara is ranked third in the category.\n", "llama3.2:1b": ["India allows domestic airlines to operate long-haul international routes for at least three years, with state-controlled carriers Jet Airways and Air Sahara benefiting initially.", "However, only domestic carriers can fly lucrative Gulf routes such as those to Kuwait and Saudi Arabia for at least three years.", "India's air travel has increased by almost 20% in the previous year, but infrastructure development is lagging demand and needs improvement."], "llama3.2:3b": ["India allows domestic airlines to fly long-haul international routes starting soon.", "Only state-controlled carriers can initially access lucrative Gulf routes for 3 years.", "Demand for travel is expected to increase due to booming economic growth, but infrastructure development lags behind."], "gemma2:2b": ["India is opening international long-haul routes to competition, allowing domestic airlines to fly these routes while state-controlled carriers are allowed to fly Gulf routes for three years.", "The move aims to increase competition and lower airfare prices.", "India's aviation sector is growing rapidly with increased demand but infrastructure needs improvement to handle the traffic."], "qwen2.5:0.5b": ["India allows domestic commercial airlines to fly long-haul international routes for at least three years, with only state-controlled carriers being able to operate Gulf routes.", "Monica Chadha from BBC Delhi reports that air travel in India has increased by almost 20% from the previous year and is expected to rise even further.", "While the country's airports are in poor condition and limited foreign investment, a new government plan aims to modernize and privatize domestic airlines.", "Airports in the US and India have also been mentioned as potential routes."], "qwen2.5:1.5b": ["India opens domestic commercial airlines to international long-haul routes but restricts them from Gulf countries for 3 years, allowing Jet Airways and Air Sahara as initial beneficiaries.", "Increasing air travel demand despite infrastructure gaps and recent reforms aimed at developing India's aviation industry."], "qwen2.5:3b": ["India allows domestic commercial airlines to operate long haul international routes but only state-controlled carriers can fly lucrative Gulf routes for at least three years.", "The move aims to stimulate competition and reduce fares, benefiting Jet Airways and Air Sahara initially.", "India's air travel has grown by almost 20% from the previous year, driven by economic growth.", "However, poor infrastructure, especially at international airports, is limiting demand.", "Government promises to modernize and privatize airports have yet to be fulfilled.", "Legislation permitting up to a 49% foreign stake in domestic airlines was recently enacted.", "Negotiations between India and the US regarding expanding routes are expected to commence in January."], "opencoder:1.5b": ["India opens skies to competition\n\nIndia will allow domestic commercial airlines to fly long-haul international routes, a move it hopes will stoke competition and drive down prices.", "However, only state-controlled carriers will be able to fly the lucrative Gulf routes, to countries such as Kuwait and Saudi Arabia, for at least three years.", "Jet Airways and Air Sahara are the two companies that will benefit initially.", "India is looking to develop its airline industry as booming economic growth drives demand for travel.", "The BBC reported that air travel in India had increased by almost 20% from the previous year and was expected to rise even further.", "Infrastructure development is lagging demand, however, and will have to improve.", "\"Most international airports in the country are shabby and ill-equipped to handle heavy air traffic,\" Ms Chadha said, adding that while the Civil Aviation minister has promised to modernise and privatise airports little progress has been made.", "The government recently changed legislation that limited foreign investment in domestic airlines and raised the maximum stake holding allowed to 49% from 40%.", "Local press reports suggest that the US and India are negotiating about adding more routes in January."], "smollm:1.7b": ["India has opened skies to competition by allowing domestic commercial airlines to fly long haul international routes, a move it hopes will stoke competition and drive down prices.", "However, only state controlled carriers will be able to fly the lucrative Gulf routes for at least three years.", "Jet Airways and Air Sahara are the two companies that will benefit initially.", "India is looking to develop its airline industry as booming economic growth drives demand for travel."], "deepseek-r1:1.5b": ["India allows commercial airlines to fly long-haul international routes, such as Gulf destinations (Kuwait and Saudi Arabia), intending to provide competition.", "Only state-controlled carriers will benefit initially, while others like Jet Airways and Air Sahara gain traction first.", "Monica Chadha notes a 20% increase in air travel last year, expecting further growth.", "Infrastructure issues persist, with many airports lacking modern capacity.", "The government has introduced legislation boosting domestic airline investment up to 49% of ownership from an initial 40%.", "Negotiations between the US and India for more routes are ongoing."], "tinyllama:1.1b": ["India opens skies to competition by allowing state-owned commercial airlines to fly long haul international routes, including Gulf routes, for at least three years.", "However, two companies that will initially benefit are Jet Airways and Air Sahara.", "Demand for travel is predicted to rise further due to economic growth, but infrastructure development remains a hindrance.", "The Civil Aviation Ministry has promised to modernise airports and increase foreign investment, but has yet to take steps forward on this front.", "However, changes in legislation have allowed for greater stakeholding limits for domestic carriers.", "Jet Airways is the premier private domestic carrier, while Air Sahara is ranked third in the category."], "tinydolphin:1.1b": [" India has opened skies to competition by allowing domestic commercial airlines to fly long haul international routes, a move it hopes will spur lower prices and boost demand for travel.", "This decision marks a significant shift in policy following years of government intervention that restricted foreign ownership in airlines.", "The move is expected to stimulate increased competition and drive down costs for passengers by allowing more carriers to enter the market.", "However, only some state-controlled carriers will be permitted to operate Gulf routes for at least three years, as part of a broader program of development and capacity growth in the Indian airline industry.", "Monica Chadha from BBC Delhi reported that demand has increased significantly in recent years due to rapid economic growth and increased travel demand.", "The Civil Aviation Minister has promised to modernize and privatise airports but little progress has been made.", "This move is an important step towards improving infrastructure, ensuring a more competitive industry, and ultimately benefiting passengers."], "phi:2.7b": [" India's domestic airlines are now allowed to fly international long haul routes, with state-controlled carriers still holding a monopoly on certain Gulf routes for three years.", "This move aims to stimulate competition and reduce airfares as economic growth leads to increased travel demand.", "However, infrastructure development has not kept pace with this growth, and the government is taking steps to modernise and privatize airports.", "Negotiations are in progress between the US and India to add more international routes in January.", "Jet Airways is the top private domestic carrier in India, while Air Sahara ranks third."], "orca-mini:3b": [" The Indian government will allow state-controlled carriers to fly long haul international routes for three years while modernizing and privatizing airports.", "The move is intended to stimulate competition, drive down prices, and increase travel demand.", "However, progress has been slow on infrastructure development, and foreign investment in domestic airlines remains limited to 49%.", "The Indian press reports that negotiations between India and the US are expected to start soon."], "hermes3:3b": ["India allows domestic airlines for long-haul int'l flights, encouraging competition: state-controlled for Gulf routes (Jet Air, Air Sahara benefit initially), as demand rises due to economic growth."], "stablelm-zephyr:3b": ["India allows domestic airlines to compete in long-haul international routes, aiming to stimulate competition and reduce prices.", "State-controlled carriers can initially fly Gulf routes for three years.", "Jet Airways and Air Sahara are expected to benefit.", "India's airline industry is developing due to increased demand with 20% growth from the previous year.", "However, infrastructure development lags behind and needs improvement.", "The government recently changed legislation to allow foreign investment in domestic airlines, raising the maximum stakeholding limit to 49%."], "chatgpt-4o-latest": ["India will allow domestic airlines to operate long-haul international routes to boost competition and lower prices, though state-controlled carriers will retain exclusive rights to Gulf routes for three years.", "Jet Airways and Air Sahara will initially benefit from the policy.", "Air travel in India has surged by nearly 20%, but infrastructure remains inadequate, with airports needing modernization.", "The government has raised the foreign investment cap in domestic airlines from 40% to 49% and is taking steps to improve the sector.", "Additionally, India and the US plan to negotiate expanded air routes."], "stablelm2:1.6b": ["India allows domestic airlines to compete on international long-haul routes, with state-controlled carriers exempted for Gulf routes.", "Jet Airways and Air Sahara benefit initially, as booming economy drives demand.", "Infrastructure development lags but modernization efforts underway.", "Limitations on foreign investment in domestic airlines increased recently, but US-India negotiations about adding more routes start in January.", "India aims to develop its airline industry with a focus on Gulf routes due to high economic growth."], "granite3.1-dense:2b": ["India permits domestic carriers to operate long-haul international flights, aiming to boost competition and lower costs.", "State-controlled airlines will exclusively fly Gulf routes for at least three years, benefiting Jet Airways and Air Sahara initially.", "This decision follows rapidly growing air travel in India (up 20% year-on-year), driven by economic expansion.", "Despite this, infrastructure remains underdeveloped to accommodate increased traffic; most international airports are outdated and poorly equipped.", "The Civil Aviation minister has pledged to modernize and privatize airports, but progress has been slow.", "Recent legislative changes allow foreign investment in domestic airlines up to 49%, a significant step forward.", "Local media report that India and the US are set to negotiate additional routes in January, further expanding Jet Airways' and Air Sahara's reach."]}