{"raw_text": "Weak end-of-year sales hit Next\n \n Next has said its annual profit will be £5m lower than previously expected because its end-of-year clearance sale has proved disappointing.\n \n \"Clearance rates in our end-of-season sale have been below our expectations,\" the company said. The High Street retailer said it now expected to report annual profits of between £415m and £425m ($779m-798m). Next's shares fell more than 3% following the release of the trading statement.\n \n Next chief executive Simon Wolfson admitted that festive sales were \"below where we would expect a normal Christmas to be\", but said sales should still top analyst expectations.\n \n Among areas where Next could have done better, Mr Wolfson said menswear ranges were \"a little bit too similar to the previous year\". Mr Wolfson also said that disappointing pre-Christmas sales were \"more to do with the fact that we went in with too much stock rather than (the fact that) demand wasn't there for the stock\". Next's like-for-like store sales in the five months from 3 August to 24 December were up 2.9% on a year earlier. This figure is for existing Next stores, which were unaffected by new Next store openings. Like-for-like sales growth at the 49 Next stores directly affected by new store openings in their locality was 0.5%.\n \n Overall sales across both its retail and mail order divisions were up 12.4%, Next said. Its Next Directory mail order division saw sales rise 13.4% during the five-month period. \"In terms of all the worries about their trading pre-Christmas, it's a result,\" said Nick Bubb, an analyst at Evolution Securities. \"Profits of around £420m would be well within the comfort zone.\" However, one dealer, who asked not to be named, told Reuters the seasonal sales performance was \"not what people had hoped for\". \"Christmas has been tough for the whole sector, and this is one of the best retailers,\" he said. Next's trading statement comes a day after House of Fraser and Woolworths disappointed investors with their figures.\n", "llama3.2:1b": ["Next's annual profit will be £5m lower than expected due to disappointing clearance sales in its end-of-year stock.", "The company now expects profits to be between £415m and £425m ($779m-798m).", "Sales were up 2.9% on a year earlier, but declined by 0.5% at Next stores affected by new store openings."], "llama3.2:3b": ["Next's annual profit will be £5m lower than expected due to disappointing end-of-year clearance sales.", "Like-for-like store sales were up 2.9% in the five months leading up to Christmas, but menswear ranges were too similar to previous years and pre-Christmas sales were affected by excessive stock.", "Overall retail sales were up 12.4%, with Next Directory mail order division seeing a 13.4% increase."], "gemma2:2b": ["Next's annual profit will be £5 million lower than expected due to disappointing end-of-year clearance sales.", "Sales were below expectations, but still projected to meet analyst forecasts.", "The company attributed the underperformance to some product categories being similar to previous years and overstocking pre-Christmas.", "Overall sales across retail and mail order divisions rose 12.4%, with Next Directory seeing a strong increase.", "However, analysts remain cautious about the sector performance in general."], "qwen2.5:0.5b": ["Next Ltd said its annual profit will be £5m lower than previously expected due to poor clearance sales in December.", "The company's shares fell by more than 3% following the release of the Trading Statement.", "Sales for Next were up 12.4%, and it saw a rise of 13.4% during the five-month period.", "The concern is that profits will be closer to £420m, but analysts say this would still be well within the comfort zone."], "qwen2.5:1.5b": ["Retail chain Next expects lower profits due to disappointing end-of-year clearance sales, downgrading its profit forecast from £415m-£425m to between £370m-£400m ($689m-762m).", "CEO Simon Wolfson acknowledges festive sales were below expectations.", "Menswear ranges are criticized for being too similar to previous years, while new store openings contribute less to like-for-like growth compared to pre-opening.", "Retail and mail order divisions' overall sales rose 12.4%, but some dealers report weaker-than-expected performance in the Christmas season."], "qwen2.5:3b": ["Next’s annual profit is expected to be £5m lower than previously anticipated due to disappointing end-of-year clearance sales.", "The company now expects profits between £415m and £425m ($779m-798m), down from its initial estimate.", "Next reported like-for-like store sales up 2.9% year-on-year, with some areas needing improvement such as menswear ranges and excessive pre-Christmas stock.", "Analysts view the results cautiously positive, noting that despite a 12.4% rise in overall sales (excluding mail order), the company performed better than most retailers during the period."], "opencoder:1.5b": ["Next High Street retailer reported in December that its end-of-year clearance sale had proved disappointing due to the negative reception from festive sales.", "The retail sector, which saw annual profits falling, expected to report profits between £415m and £425m (approximately $779m-~$798m) as compared to previous year's figures.", "The share price of Next has decreased more than 3% following the release of the trading statement.", "The company chief executive Simon Wolfson stressed that festive sales were \"below where we would expect a normal Christmas to be\".", "Nevertheless, sales should still meet the retailer's expectations.", "Next retail division reported in December that men's wear ranges were slightly less than the previous year and there was a lack of demand for the stock which resulted in disappointing pre-Christmas sales.", "The like-for-like store sales in the five months from 3 August to 24 December were up 2.9% on an overall year earlier but remained unaffected by new store openings.", "Overall, the retail sector's Next Directory mail order division had a performance of around 12.4% during this period which was higher than previous years and sales growth at the 49 Next stores directly affected by new store openings in their locality was 0.5%.", "The dealer who questioned the pre-Christmas sales performance, who told not to be named, mentioned that Christmas had been tough for the sector and it was reported by Evolution Securities.", "However, Nick Bubb, an analyst at Evolution Securities, said the seasonal sales performance was \"not what people had hoped for\" and he explained that House of Fraser and Woolworths were disappointed with their figures."], "smollm:1.7b": ["The summary should be: Weak end-of-year sales hit Next - 5m lower than previously expected because its end-of-season clearance sale has proved disappointing.", "This summary captures the main ideas from the original text, including the key points about weak end-of-year sales and disappointing end-of-season clearance sales for Next.", "The summary is concise and does not include any additional information or explanations."], "deepseek-r1:1.5b": ["Weak end-of-year profits hit Next because of disappointing clearance sale and promotional efforts, lower than expected £5m less.", "They expect £415-£425m next year.", "CEO Wolfson said sales should still exceed expectations but were below usual Christmas performance.", "Areas to improve: men's apparel too similar, pre-Christmas sales due to stock issues.", "Total sales up 12.4% with better mail order growth (13.4%).", "Bubb noted £420m profit within comfort zone despite negative seasonality.", "Dealer feedback that seasonal peaks were disappointing."], "tinyllama:1.1b": ["Next, the High Street retailer, has reported its annual profit forecast for the financial year to be £5m lower than previously expected due to poor end-of-year clearance sales in its main product categories.", "Chief executive Simon Wolfson admitted that festivals sales were \"below where we would expect a normal Christmas to be\", but argued that the retailer's men's clothing ranges were not as similar to the previous year, which could have hurt sales.", "The company has also reported disappointing pre-Christmas sales and like-for-like store sales growth at 49 Next stores directly affected by new store openings in their locality.", "Overall sales across both its retail and mail order divisions were up 12.4%, despite concerns about previous profits of around £420m."], "tinydolphin:1.1b": [" Next, a popular UK retailer known for its clearance sales, has reported lower profits than expected due to lower end-of-season sale sales.", "The company's sales fell below expectations, indicating that they were not as successful as expected during the holiday season.", "To prevent further disappointment, Next has implemented a plan to improve their sales performance and profitability going forward.", "CEO Simon Wolfson acknowledged the challenges faced during the holiday season and admitted that they did not meet expectations for the time.", "Despite this, Next still expects to report annual profits of between £415 million and £425 million ($779 million-$798 million).", "The company plans to invest more in their product range and focus on improving customer experiences during the peak shopping season."], "phi:2.7b": [" Next's annual profit will be £5m lower than expected due to disappointing end-of-year clearance sales.", "The company now expects profits between £415m and £425m, but CEO Simon Wolfson admitted that Christmas sales were \"below expectations\".", "Like-for-like store sales in the past five months increased by 2.9%, while direct impact stores saw a 0.5% increase.", "Overall sales across retail and mail order divisions rose 12.4%.", "Despite this, Next's profits are expected to fall within the analyst comfort zone."], "orca-mini:3b": [" Next's end-of-year clearance sale has proved disappointing, resulting in a £5m drop in annual profits compared to previously expected amounts.", "CEO Simon Wolfson admitted that festive sales were \"below where we would expect a normal Christmas to be,\" but the company still expects to report annual profits between £415m and £425m due to strong demand for its menswear ranges.", "Unlike-for-like store sales at existing Next stores were up 2.9% on last year, while like-for-like sales growth at newly opened Next stores was 0.5%.", "Like-for-like sales at the 49 newly opened Next stores directly affected by new store openings in their locality was 0.5%.", "Overall sales across both retail and mail order divisions were up 12.4%, with its Next Directory mail order division seeing sales rise 13.4% during the five-month period.", "Despite lower than expected profits, one dealer noted that the sector had been tough for everyone, and Next's trading statement came just days after House of Fraser and Woolworths disappointed investors with their figures."], "hermes3:3b": ["Next expects £415m-£425m annual profits, lower than initial estimate due to below-expectation end-of-year clearance sale."], "stablelm-zephyr:3b": ["Next reported disappointing end-of-year sales, causing a £5m reduction in annual profits from previous expectations.", "The company cited below average clearance rates as the reason for the poor performance.", "Next's like-for-like store sales growth was up 2.9% during the five months from August to December, with overall sales across retail and mail order divisions up 12.4%.", "The company plans to address issues with its menswear ranges and reduce inventory levels in preparation for future sales periods."], "chatgpt-4o-latest": ["Next has lowered its annual profit forecast by £5m due to weaker-than-expected end-of-year clearance sales, now expecting profits between £415m and £425m.", "Shares fell over 3% following the announcement.", "CEO Simon Wolfson acknowledged that festive sales were below expectations but still likely to exceed analyst predictions.", "He attributed weaker pre-Christmas sales to excess stock rather than lack of demand and noted that menswear ranges were too similar to the previous year.", "Like-for-like store sales rose 2.9% over five months, while overall sales, including mail order, increased 12.4%.", "Analysts had mixed reactions, with some seeing the results as acceptable while others were disappointed.", "The statement followed weak trading updates from House of Fraser and Woolworths."], "stablelm2:1.6b": ["Annual profits at retailer Next will be lower than expected due to poor end-of-year clearance sales.", "The clearance rates in the end-of-season sale were below expectations, leading Next to revise its annual profit range down from £105m-£108m to £97.5m-£98.5m ($97.5m-$98.5m).", "Shares fell over 3%.", "CEO Simon Wolfson attributed the underwhelming sales to both normal Christmas expectations and a surplus of stock, but noted that demand was still higher than expected.", "Like-for-like store sales were up 2.9% YoY, while Next Directory's mail order division saw a rise of 4.4%.", "Overall, Next's retail and mail order divisions increased their sales by 0.4%.", "House of Fraser and Woolworths also disappointed investors recently with their own financial reports."], "granite3.1-dense:2b": ["Next Plc anticipates £415m to £425m annual profit, 3% lower than initially projected due to underwhelming end-of-year clearance sale.", "The retailer's chief executive, Simon Wolfson, acknowledged disappointing festive sales, attributing it to similar menswear ranges from the previous year and excess inventory.", "Despite this, overall sales across both retail and mail order divisions increased by 12.4%.", "Like-for-like store sales in existing Next stores grew by 2.9%, while those affected by new store openings saw a 0.5% rise.", "Analysts view the figure as within acceptable limits, but some industry observers expressed disappointment, citing tough conditions across the sector during Christmas."]}