{"raw_text": "Yukos heading back to US courts\n \n Russian oil and gas company Yukos is due in a US court on Thursday as it continues to fight for its survival.\n \n The firm is in the process of being broken up by Russian authorities in order to pay a $27bn (£14bn) tax bill. Yukos filed for bankruptcy in the US, hoping to use international business law to halt the forced sale of its key oil production unit, Yuganskneftegas. The unit was however sold for $9.4bn to state oil firm Rosneft but only after the state auction had been disrupted.\n \n Yukos lawyers now say the auction violated US bankruptcy law. The company and its main shareholders have vowed to go after any company that buys its assets, using all and every legal means. The company wants damages of $20bn, claiming Yuganskneftegas was sold at less than market value. Judge Letitia Clark will hear different motions, including one from Deutsche Bank to throw out the Chapter 11 bankruptcy filing. The German lender is one of six banks that were barred from providing financing to Gazprom, the Russian state-owned company that was expected to win the auction for Yuganskneftegas. Deutsche Bank, which is also an advisor to Gazprom, has called on the US court to overturn its decision to provide Yukos with bankruptcy protection.\n \n Lifting the injunction would remove the uncertainty that surrounds the court case and clarify Deutsche Bank's business position, analysts said.\n \n Analysts are not optimistic about Yukos' chances in court. Russian President Vladimir Putin and the country's legal authorities have repeatedly said that the US has no jurisdiction over Yukos and its legal wranglings. On top of that, the firm only has limited assets in the US. Yukos has won small victories, however, and is bullish about its chances in court. \"Do we have an ability to influence what happens? We think we do,\" said Mike Lake, a Yukos spokesman. \"The litigation risks are real,\" said Credit Suisse First Boston analyst Vadim Mitroshin The dispute with the Russian authorities is partly driven by President Putin's clampdown on the political ambitions of ex-Yukos boss Mikhail Khodorkovsky. Mr Khodorkovsky is in jail on charges of fraud and tax evasion.\n", "llama3.2:1b": ["Yukos, a Russian oil and gas company, faces a US court case over its assets being sold to Rosneft after filing for bankruptcy.", "The company claims the sale was unfair and wants damages of $20bn.", "The US court will hear motions from banks, including Deutsche Bank, which is advising Gazprom.", "Lifting an injunction could remove uncertainty but analysts are not optimistic about Yukos' chances due to limited assets in the US and Russian President Putin's opposition."], "llama3.2:3b": ["Yukos is set to appear in a US court as it continues to fight against being broken up by Russian authorities due to a $27bn tax bill, claiming the sale of its key oil production unit was done at less than market value.", "Yukos filed for bankruptcy in the US hoping to halt the forced sale, and now seeks damages of $20bn from any company that buys its assets.", "The US court is also dealing with motions from Deutsche Bank and Gazprom over the auction process, which analysts say could lift uncertainty surrounding the case but are not optimistic about Yukos' chances."], "gemma2:2b": ["Yukos, a Russian oil and gas company, is fighting its forced breakup to pay a $27 billion tax bill in US court.", "The company claims the auction for its key unit, Yuganskneftegas, violated US bankruptcy law.", "Yukos lawyers seek damages of $20 billion and will use all legal means to stop asset purchases by companies like Rosneft, which purchased the unit after a disputed auction.", "Deutsche Bank, a creditor to Gazprom involved in the sale, seeks to overturn Yukos' bankruptcy protection.", "Despite analysts doubting its chances, Yukos remains optimistic about its legal case."], "qwen2.5:0.5b": ["Russian oil giant Yukos, a leading player in the US oil market, is due to appear in US courts as part of its ongoing bankruptcy proceedings.", "The company's assets are being auctioned off for $9.", "4 billion by Rosneft, while Yuganskneftegas, a major oil production unit of Yukos, was sold for $27 billion at an auction that was disrupted after state auctions were interrupted.", "Russian authorities have demanded that Yukos pay a tax bill of approximately $27 billion and has previously threatened legal action against it to stop the sale of its assets.", "The company's lawyers are now contending that Rosneft violated US bankruptcy law by selling Yuganskneftegas at less than market value, seeking damages of about $20 billion from the court.", "Deutsche Bank is one of six banks barred from providing financing to Gazprom, the Russian state-owned oil firm, which was expected to win the auction for Yuganskneftegas.", "Analysts are skeptical about Yukos' chances in court due to Russia's claim that the US has no jurisdiction over it and its limited assets in the US.", "According to analysts, Yukos still has some ability to influence what happens in court but is worried about the litigation risks associated with a bankruptcy case in the United States.", "The dispute between Russian authorities and Yukos is partly fueled by President Putin's crackdown on political ambitions of ex-Yukos boss Mikhail Khodorkovsky.", "Mr. Khodorkovsky is currently in jail on fraud and tax evasion charges, and has faced additional legal troubles since his conviction due to the clampdown on the political ambitions of ex-Yukos boss Mikhail Khodorkovsky."], "qwen2.5:1.5b": ["Russian oil giant Yukos faces US court amid bankruptcy filing, facing potential legal challenge to its assets sale to Rosneft.", "Judge Letitia Clark sets motions for consideration, including Deutsche Bank's request to overturn Chapter 11 bankruptcy protection.", "Analysts view Yukos' prospects uncertain but bullish on their ability to influence the outcome."], "qwen2.5:3b": ["Russian oil company Yukos is facing a US court hearing as it continues its fight against the breakup and sale of Yuganskneftegas, worth $27bn, by Russian authorities to pay back taxes.", "The firm has filed for bankruptcy in the US hoping to halt the forced sale using international business law.", "Despite winning small victories, Yukos remains optimistic about its chances despite legal challenges from Russian President Putin.", "The case is complicated by Putin's influence over Khodorkovsky and his detention on fraud and tax evasion charges.", "Analysts are not optimistic given Russia’s stance on US jurisdiction and Yukos' limited assets in the US."], "opencoder:1.5b": ["Yukos heading back to US courts\n\nRussian oil and gas company Yukos is due in a US court on Thursday as it continues to fight for its survival.", "The firm is in the process of being broken up by Russian authorities, aiming to pay a $27bn (£14bn) tax bill.", "Yukos filed for bankruptcy hoping to halt the forced sale of its key oil production unit, Yuganskneftegas.", "The unit however was sold for $9.4bn for Rosneft but only after disrupting the state auction.", "Yukos lawyer now say the auction violated US bankruptcy law.", "The company and its main shareholders have vowed to go after any company that buys its assets, using all and every legal means.", "The company wants damages of $20bn, claiming Yuganskneftegas was sold at less than market value.", "Deutsche Bank has called on the US court to overturn its decision to provide Yukos with bankruptcy protection.", "Analysts are not optimistic about Yukos' chances in court.", "The US President Vladimir Putin and the country's legal authorities have repeatedly said that the US has no jurisdiction over Yukos and its legal wranglings.", "On top of that, the firm only has limited assets in the US."], "smollm:1.7b": ["The summary should be: Yukos, a Russian oil and gas company, is due to face a US court case over its assets sold at less than market value.", "The firm's lawyers are now demanding damages of $20bn from the US government for violating bankruptcy law.", "Yukos wants to go after any company that buys its assets, using all legal means available.", "The company wants damages of $20bn and is bullish about its chances in court."], "deepseek-r1:1.5b": ["Yukos, a Russian oil company, is facing a Chapter 11 bankruptcy in the U.S. due to its failure to comply with U.S. bankruptcy laws after selling its key production unit.", "The company is suing Russia over potential violations of U.S. bankruptcy law during the sale and has plans to challenge a German bank's offer to assist.", "Analysts suggest the court case will be contentious, influenced by President Putin's policies on political ambitions, particularly Khodorkovsky in jail for fraud and tax evasion."], "tinyllama:1.1b": ["Russian oil and gas company Yuka (previously known as Yukos) has filed for bankruptcy proceedings against its main asset, the Yuaganskneftegas unit, which is owned by state-owned Gazprom.", "This move was part of a broader strategy aimed at holding onto key assets in order to minimize debt and potentially prevent the forced sale of the unit by Russian authorities.", "The company has also filed for bankruptcy proceedings against another asset, Yukefneftegas.", "The case is due to be heard on Thursday in a US court.", "Yuka's lawyer, Mike Lake, claims that US legal authorities have no jurisdiction over the case and that the firm's assets are limited in the US.", "Meanwhile, Deutsche Bank and some of its clients have called for the injunction to be removed, citing uncertainty around the matter."], "tinydolphin:1.1b": [" The summary of the text provided is as follows: Yukos, a Russian oil and gas company, has been suing for its survival in the US courts as it attempts to recover billions of dollars owed to it by Rosneft, the Russian state-owned energy giant.", "Despite facing significant hurdles in court, Yukos remains confident that it can overcome any obstacles it encounters and ultimately gain a stronger foothold in the US market."], "phi:2.7b": [" Yukos, a Russian oil and gas company, has filed for bankruptcy protection in the US to fight against forced sale of its key production unit, Yuganskneftegas.", "The state-owned company Rosneft purchased the asset after the auction was disrupted.", "Yukos' lawyers claim the auction violated US bankruptcy laws, and the company is seeking damages of $20bn.", "Deutsche Bank has called on the court to overturn its decision to provide bankruptcy protection, as it provided financing to Gazprom, which won the auction for Yuganskneftegas.", "Lifting the injunction would clarify Deutsche Bank's business position.", "Analysts do not expect Yukos' chances in court due to Russia's refusal to recognize US jurisdiction and limited assets in the US.", "However, the company is confident in winning small victories in court and influencing what happens."], "orca-mini:3b": [" Yukos, a Russian oil and gas company, is due in a US court on Thursday as it continues to fight for its survival.", "The firm filed for bankruptcy in the US hoping to use international business law to halt the forced sale of its key oil production unit, Yuganskneftegas.", "However, the unit was later sold for $9.4bn to state oil firm Rosneft but only after the auction was disrupted.", "Yukos lawyers now say the auction violated US bankruptcy law and the company wants damages of $20bn claiming Yuganskneftegas was sold at less than market value.", "Analysts are not optimistic about Yukos' chances in court as Russian President Vladimir Putin and the country's legal authorities have repeatedly said that the US has no jurisdiction over Yukos and its legal wranglings."], "hermes3:3b": ["Yukos returns to US court to challenge forced sale of company asset Yuganskneftegas, claiming auction violated US bankruptcy law and seeking $20bn damages."], "stablelm-zephyr:3b": ["Russian oil company Yukos returns to US courts as it fights for survival against a $27bn tax bill imposed by Russian authorities.", "The firm filed for bankruptcy in the US, claiming its assets were sold at less than market value.", "Yukos lawyers now claim the auction violated US bankruptcy law and the company seeks damages of $20bn.", "Deutsche Bank, one of six banks barred from providing financing to Gazprom expected to buy Yuganskneftegas, is calling on the US court to overturn Yukos' bankruptcy protection.", "Analysts are cautious about Yukos' chances in court, noting limited assets in the US and repeated statements by Russian authorities asserting that the US has no jurisdiction over Yukos."], "chatgpt-4o-latest": ["Yukos, a Russian oil company, is returning to a US court to challenge the forced sale of its key oil unit, Yuganskneftegas, which was auctioned for $9.4 billion to state-owned Rosneft to cover a $27 billion tax bill.", "Yukos argues the sale violated US bankruptcy law and seeks $20 billion in damages, claiming the unit was undervalued.", "Deutsche Bank, an advisor to Gazprom, is pushing to dismiss Yukos' US bankruptcy filing, arguing the US lacks jurisdiction.", "Analysts doubt Yukos' chances, as Russian authorities, including President Putin, reject US involvement.", "The case is linked to Putin’s crackdown on ex-Yukos boss Mikhail Khodorkovsky, who is jailed for fraud and tax evasion."], "stablelm2:1.6b": ["Russian oil company Yukos is set to return to a US court, fighting for its survival as it faces forced sale of key assets to pay a $10 billion tax bill.", "The company aims to halt the auction through international business law but asserts that the sale violates US bankruptcy laws.", "Yukos intends to pursue damages of around $10 billion and claims the sale was below market value.", "A judge will consider different motions, including one by Deutsche Bank to throw out the Chapter 7 bankruptcy filing.", "Analysts predict a challenging outcome for Yukos in court due to Russian authorities' opposition to US jurisdiction and limited assets in the US."], "granite3.1-dense:2b": ["Russian oil company Yukos, facing bankruptcy and asset sales to settle a $27bn tax debt, is contesting the process in US courts.", "Yukos filed for Chapter 11 bankruptcy, hoping to halt the forced sale of its key unit, Yuganskneftegas, to state-owned Rosneft.", "The company claims the auction violated US bankruptcy law and seeks $20bn in damages, alleging the sale was below market value.", "Judge Letitia Clark will hear motions, including one from Deutsche Bank to invalidate Yukos' bankruptcy protection.", "Analysts are pessimistic about Yukos' prospects due to Russia's assertion of US jurisdiction and Yukos' limited assets in the country.", "However, Yukos remains hopeful, citing potential influence over the case.", "The dispute is linked to former CEO Mikhail Khodorkovsky's imprisonment on fraud and tax charges by President Vladimir Putin."]}