{"raw_text": "Laura Ashley chief stepping down\n \n Laura Ashley is parting company with its chief executive Ainum Mohd-Saaid.\n \n The clothing and home furnishing retailer said Ms Mohd-Saaid had resigned for personal reasons. Her departure will come into effect on 1 February and follows the departure of co-chief executive Rebecca Navarednam on 1 January. Ms Mohd-Saaid is to be replaced by Lillian Tan, presently a non-executive director of the company and head of a Malaysian retailer.\n \n In a statement issued on Thursday, Laura Ashley thanked Ms Mohd-Saaid for her services to the company. Its shares were down 8.51% to 10.75p in late Thursday morning trading on the London Stock Exchange.\n \n Since 2002, Ms Tan has been managing director and chief executive of Metrojaya, one of the largest retail groups in Malaysia. Laura Ashley, which is due to issue its next trading statement in the next few weeks, has in recent months been hit by reports of poor sales. In October last year, it announced the closure of one of its two Welsh factories. In September, the company had said that its half-year clothing sales had been \"below expectations\". In recent times, it has put renewed focus on home furnishings rather than clothing, but last September it reported that interim six month losses had risen from £1m to £1.2m, while sales had fallen from £138m to £118m.\n \n Laura Ashley, which floated on the London Stock Exchange for £200m ($376m) in 1995, is majority-owned by Malaysia entrepreneur Dr Khoo Kay Peng. In 1996, its share price was more than 200p. It has long been reported that Dr Khoo intends to take the company private, but he has always denied this. \"Laura Ashley is a bit of a shrivelled husk of a company,\" said retail analyst Nick Bubb of Evolution Securities. \"It is all pretty odd with its Malaysian owners seemingly just shuffling the deckchairs.\" Laura Ashley was founded by its late namesake in Kent in 1955, before moving to Mid Wales in 1961 where it still has its main UK factory.\n", "llama3.2:1b": ["Laura Ashley chief stepping down for personal reasons.", "Ms Mohd-Saaid's departure will come into effect on 1 February.", "She is being replaced by Lillian Tan, who was head of a Malaysian retailer before joining Laura Ashley as non-executive director and head of the company.", "Ms Tan's departure follows co-chief executive Rebecca Navarednam's resignation in January."], "llama3.2:3b": ["Laura Ashley chief executive Ainum Mohd-Saaid is leaving for personal reasons and will be replaced by Lillian Tan, who previously managed Metrojaya's retail group.", "The departure follows the loss of co-CEO Rebecca Navarednam in January.", "Laura Ashley reported poor sales and increased losses last year, with Dr Khoo Kay Peng, majority owner, considering taking the company private."], "gemma2:2b": ["Laura Ashley's chief executive Ainum Mohd-Saaid resigned for personal reasons, effective February 1st.", "Lillian Tan will replace her, and the company's shares fell after the announcement.", "This follows co-chief executive Rebecca Navarednam's departure in January, and comes amid recent reports of declining sales and a focus shift towards home furnishings by Laura Ashley.", "The company is majority owned by Malaysian entrepreneur Dr Khoo Kay Peng, who has plans for a potential takeover, although he denies it."], "qwen2.5:0.5b": ["Laura Ashley, a clothing retailer and home furnishing company, is parting company with its chief executive, Ainum Mohd-Saaid.", "Her resignation will come into effect on January 1, 2023.", "The co-chief executive, Rebecca Navarednam, who joined in January, will replace her.", "Laura Ashley has seen significant challenges and losses in recent years.", "It was founded in Kent in 1955 before moving to Mid Wales in 1961 where it still has a main UK factory."], "qwen2.5:1.5b": ["Laura Ashley chief executive Ainum Mohd-Saaid resigns for personal reasons effective February 1st, replaced by Lillian Tan.", "The company's shares fell 8.51% on Thursday, following poor sales and recent factory closures.", "Laura Ashley, majority-owned by Malaysian entrepreneur Dr Khoo Kay Peng since 1996, has been hit by declining sales in clothing department, focusing more on home furnishings recently.", "The retailer floated on the London Stock Exchange in 1995 with a price of over £200p, but its share value is now less than £10 per share due to poor performance and financial challenges."], "qwen2.5:3b": ["Laura Ashley chief executive Ainum Mohd-Saaid is stepping down for personal reasons effective February 1st.", "She will be replaced by Lillian Tan, currently a non-executive director and head of a Malaysian retailer.", "Laura Ashley's shares fell 8.51% to 10.75p on Thursday after reports of poor sales.", "Since 2002, Ms. Tan has managed Metrojaya in Malaysia.", "The company announced the closure of one Welsh factory last October and reported losses rising from £1m to £1.2m despite focusing on home furnishings rather than clothing.", "Laura Ashley is majority-owned by Malaysian entrepreneur Dr. Khoo Kay Peng, who has previously denied plans to take the company private.", "Retail analyst Nick Bubb describes Laura Ashley as a \"shrivelled husk\" with confusing ownership dynamics."], "opencoder:1.5b": ["Laura Ashley chief stepping down, following her departure from Ainum Mohd-Saaid, as part of a company changing focus into home furnishings.", "She is due to issue its next trading statement in the next few weeks.", "The clothing and home furnishing retailer reported that Ms Mohd-Saaid's departure comes on 1 February.", "The department has been replaced by Lillian Tan now acting as the non-executive director.", "The company reportedly had a Malaysian retailer, which Ms Tan manages for three years now.", "As part of the sale of clothing, the company said its shares were down 8.51% to 10.75p in late Thursday trading.", "In recent times, it has focused on home furnishings since October last year, after reporting sales losses of £1m and £1.2m, respectively."], "smollm:1.7b": ["Laura Ashley is parting company with its chief executive Ainum Mohd-Saaid.", "The clothing and home furnishings retailer said Ms Mohd-Saaid had resigned for personal reasons.", "Her departure will come into effect on 1 February and follows the departure of co-chief executive Rebecca Navarednam on 1 January.", "Ms Mohd-Saaid is to be replaced by Lillian Tan, presently a non-executive director of the company and head of a Malaysian retailer."], "deepseek-r1:1.5b": ["Laura Ashley is stepping down as CEO after she resigned with Ms Mohd-Saaid, who left due to personal reasons.", "Her departure begins on 1 February following Rebecca Navarednam's departure.", "Ms Tan, currently non-executive director at Metrojaya, will replace her, a large retail group in Malaysia.", "Laura Ashley has faced financial challenges with reduced factory closures and decreased profits in clothing and home furnishings."], "tinyllama:1.1b": ["Laura Ashley is parting ways with its chief executive Ainum Mohd-Saai and replacing her as of February 1st.", "In a statement, the company said Ms Mohd-Saai's departure was due to personal reasons.", "Her successor will be appointed later this month, as Lillian Tan, currently a non-executive director and head of a Malaysian retailer, will replace her in the role.", "While Laura Ashley has been hit by negative sales reports, it has also put renewed focus on home furnishings rather than clothings, but recent financial statements indicate that interim six month losses had risen from £1m to £1.2m and sales had fallen from £138m to £118m.", "Laura Ashley is majority-owned by Malaysia entrepreneur Dr Khoo Kay Peng and has long been reported to have plans to take the company private."], "tinydolphin:1.1b": [" In February 2023, Laura Ashley will part ways with its chief executive Ainum Mohd-Saaid after personal reasons prompt her resignation.", "This follows the departure of co-chief executive Rebecca Navarednam on January 1st.", "The company will then be led by non-executive director Lillian Tan, who presently headed a Malaysian retailer before working at Laura Ashley since 2005.", "In addition to her roles at Laura Ashley and Metrojaya, Ms Tan has extensive experience in the retail industry, having managed several other organizations."], "phi:2.7b": [" Laura Ashley is a clothing and home furnishing retailer that has seen sales fall and factories close due to poor performance since September last year.", "The company has recently announced the resignation of its chief executive, Ainum Mohd-Saaid, for personal reasons.", "Her departure will be effective from February 1st, and she will be replaced by Lillian Tan, a Malaysian retailer who was previously managing director and CEO of Metrojaya.", "Laura Ashley's shares have fallen 8.51% in late Thursday morning trading on the London Stock Exchange.", "Dr Khoo Kay Peng, the majority owner, has long been reported to take the company private but he denies this."], "orca-mini:3b": [" Laura Ashley's chief executive Ainum Mohd-Saaid is stepping down due to personal reasons.", "The departure will take effect on February 1 and follows the departure of co-chief executive Rebecca Navarednam on January 1.", "Replacing Mohd-Saaid as head of the company is Lillian Tan, a non-executive director of Laura Ashley and head of a Malaysian retailer Metrojaya.", "In a statement released on Thursday, Laura Ashley thanked Ms Mohd-Saaid for her services to the company.", "The company's shares were down 8.51% to 10.75p in late morning trading on the London Stock Exchange.", "Since 2002, Lillian Tan has been managing director and chief executive of Metrojaya, one of the largest retail groups in Malaysia.", "Laura Ashley, which floated on the London Stock Exchange for £200m in 1995, is majority-owned by Malaysia entrepreneur Dr Khoo Kay Peng.", "However, Dr Khoo has always denied plans to take the company private."], "hermes3:3b": ["Laura Ashley's CEO Ainum Mohd-Saaid steps down, effective Feb 1.", "Lillian Tan replaces her as CEO.", "Mohd-Saaid left due to personal reasons; Laura Ashley also lost co-CEO Rebecca Navarednam in January."], "stablelm-zephyr:3b": ["Laura Ashley parting ways with CEO Ainum Mohd-Saaid for personal reasons, effective 1 February.", "Co-CEO Rebecca Navarednam departed on 1 January.", "Lillian Tan, a non-executive director and head of a Malaysian retailer, will replace Ms Mohd-Saaid.", "Laura Ashley has faced reports of poor sales and recently closed one of its Welsh factories.", "The company has shifted focus to home furnishings after facing declines in clothing sales.", "Malaysia entrepreneur Dr Khoo Kay Peng owns majority shares in Laura Ashley."], "chatgpt-4o-latest": ["Laura Ashley's chief executive, Ainum Mohd-Saaid, is stepping down for personal reasons, effective 1 February, following the departure of co-chief executive Rebecca Navarednam on 1 January.", "She will be replaced by Lillian Tan, a non-executive director and head of a Malaysian retailer.", "The company thanked Mohd-Saaid for her service, while its shares fell 8.51% to 10.75p.", "Laura Ashley has struggled with poor sales, closing a Welsh factory and reporting increased losses.", "Majority-owned by Malaysian entrepreneur Dr Khoo Kay Peng, the company has faced speculation about going private, which Dr Khoo has denied.", "Founded in 1955, Laura Ashley has shifted focus from clothing to home furnishings but continues to face financial challenges."], "stablelm2:1.6b": ["Laura Ashley's chief executive, Ainum Mohd-Saaid, has resigned for personal reasons, with her departure effective from February 1st.", "Co-Chief Rebecca Navarednam departed on January 1st, and the company will be managed by Lillian Tan upon Ms. Mohd-Saied's replacement.", "Laura Ashley recently faced poor sales figures and factory closures.", "Dr. Khoo Kay Peng is majority owner and plans to take the company private."], "granite3.1-dense:2b": ["Laura Ashley's CEO, Ainum Mohd-Saaid, is resigning for personal reasons and will step down on February 1st, following the departure of co-CEO Rebecca Navarednam in January.", "Ms. Tan, a non-executive director and head of a Malaysian retailer, will replace her.", "The company, majority-owned by Malaysia entrepreneur Dr. Khoo Kay Peng, has faced sales declines, factory closures, and rising losses.", "Laura Ashley, once a significant UK retailer, has been underperforming since its 1995 IPO.", "Retail analyst Nick Bubb described the company as \"a shrivelled husk,\" suggesting Dr. Khoo's intentions to take the company private remain unclear."]}