{"raw_text": "Green reports shun supply chain\n \n Nearly 20% more UK top 250 firms produced non-financial reports on social and environment issues than last year.\n \n But of the 145 companies reporting, 76% didn't examine their supply chains, says the annual Directions survey. Green groups say putting pressure on supply chains is a major way companies can reduce their environmental impact. The survey is published by corporate social responsibility firm Context and branding firm SalterBaxter.\n \n Blake Lee-Harwood, campaigns director at Greenpeace in the UK, said: \"It's fairly meaningless to talk about your company's direction in terms of sustainability without having detailed knowledge of your supply chain. \"It's also important to get some kind of independent assessment of your reporting.\"\n \n Less than a quarter of companies (24%) get their corporate social responsibility (CSR) reports independently verified to provide assurances they are accurate and complete, says the survey. To date there are no set standards for non-financial reporting, although the Global Reporting Initiative, an independent pro-sustainability institution, is planning to establish some. The reports surveyed by Directions are published voluntarily. They are usually called corporate social responsibility (CSR) reports, sustainability reports, or social and environmental reports.\n \n Peter Knight, director of Context, says 24 UK top 250 companies reported for the first time this year and, in general, the quality of reports has improved. \"The corporate lexicon of homilies, generalities and soft assurances - fluff - is on its way out. There are less pictures of smiling children and butterflies.\" The UK government will soon require all quoted companies to report their social and environmental risks in a chapter in their annual reports, called the Operating and Financial Review. The regulation is not expected until 2005 and the first reports under this scheme will not be published before 2006. The US seems to lag Europe in producing corporate social responsibility reports. The majority of European top 50 companies (44) publish them and only 27 of the US top 50.\n", "llama3.2:1b": ["UK firms produce more non-financial reports on social and environment issues than last year, with nearly 20% more reporting than last time.", "76% of companies examined their supply chains in the survey, but less than a quarter (24%) get their CSR reports independently verified.", "The Global Reporting Initiative is planning to establish set standards for non-financial reporting.", "The UK government will require quoted companies to report on social and environmental risks in a new chapter in their annual reports by 2005."], "llama3.2:3b": ["Nearly 20% more UK top 250 firms produced non-financial reports on social and environment issues, but 76% didn't examine their supply chains.", "Only 24% get CSR reports independently verified.", "The quality of reports has improved and the global reporting initiative plans to establish standards."], "gemma2:2b": ["A survey shows that while 20% more UK top 250 firms published sustainability reports, 76% did not examine their supply chains.", "Green groups emphasize the importance of supply chain scrutiny for environmental impact reduction.", "Independent verification of CSR reports is low, and there are no set standards yet.", "The quality of reports has improved, but remains voluntary and lacks standardized metrics.", "UK regulations will require companies to report social and environmental risks, and US companies lag behind European counterparts in publishing these reports."], "qwen2.5:0.5b": ["Key points:\n\n- UK top 250 firms report less on environmental issues compared to last year.", "- Supply chain pressure is a significant way companies can reduce their environmental impact.", "- Greenpeace campaigns director Blake Lee-Harwood suggests it's meaningless to talk about sustainability without supply chain details.", "- Fewer than half (24%) of companies get their CSR reports independently verified for accuracy and completeness."], "qwen2.5:1.5b": ["Green groups say pressure on supply chains is a major way for companies to reduce environmental impact, but nearly half fail to examine their supply chains in annual non-financial reports.", "Only about one quarter get independent verification of these reports.", "The UK government plans to require all quoted companies to report social and environmental risks in annual reports starting in 2005."], "qwen2.5:3b": ["Nearly 20% more UK top 250 firms produced non-financial reports on social and environmental issues than last year.", "However, less than 76% examined their supply chains according to an annual survey by Context and SalterBaxter.", "Green groups emphasize the importance of scrutinizing supply chains for reducing environmental impact.", "The report indicates that only 24% of companies get their CSR reports independently verified, suggesting limited standardization in non-financial reporting.", "Although there are no established standards, the Global Reporting Initiative is planning to establish them.", "UK government regulations will soon require all quoted companies to report on social and environmental risks, though this will not be implemented until 2005.", "European top 50 companies publish CSR reports more frequently than their US counterparts."], "opencoder:1.5b": ["Green reports shun supply chain\n\nNearly 20% more UK top 250 firms produced non-financial reports on social and environment issues than last year.", "But of the 145 companies reporting, 76% didn't examine their supply chains.", "Blake Lee-Harwood, campaigns director at Greenpeace in the UK, said: \"It's fairly meaningless to talk about your company's direction in terms of sustainability without having detailed knowledge of your supply chain.", "It's also important to get some kind of independent assessment of your reporting.\"", "Less than a quarter of companies (24%) get their corporate social responsibility (CSR) reports independently verified to provide assurances they are accurate and complete, says the survey.", "Peter Knight, director of Context, says 24 UK top 250 companies reported for the first time this year and, in general, the quality of reports has improved."], "smollm:1.7b": ["The summary should preserve key ideas and details, while omitting non-essential information such as explanations, formatting, or reasoning processes.", "Here's how you can do it:\n\n1.", "Identify the main idea: The text is about the UK's top 250 companies producing non-financial reports on social and environment issues.", "2.", "Extract key concepts: The main concept in this text is the production of non-financial reports by companies, which are then evaluated for their quality.", "3.", "Omit unnecessary information: The summary should not include any explanations or descriptions of how companies evaluate their non-financial reporting, nor should it include formatting or reasoning processes.", "4.", "Use concise language: The summary should use simple and clear language to convey the main idea without including any unnecessary details."], "deepseek-r1:1.5b": ["Green reports emphasize avoiding supply chain issues, with UK top 250 firms producing nearly twice as many non-financial reports this year.", "76% of these 145 companies didn’t assess their supply chains, noted by Directions survey.", "Green groups advocate for transparency in company practices.", "Less than 25% had independent assessments, aiming for a standards framework via the Global Reporting Initiative.", "The UK government requires all corporate social responsibility reports to include environmental risks by 2005, delaying publication until 2006."], "tinyllama:1.1b": ["A new survey by corporate social responsibility firm Context and branding firm SaltwaterBaxter has found that nearly 20% more UK top 250 firms produced non-financial reports on social and environmental issues compared to last year.", "However, only 76% of those companies assessed their supply chains using green groups' criteria, which suggests a lack of detail and knowledge of the company's impact on the wider economy.", "The majority (24%) of companies don't get their CSR reports independently verified and there are no set standards for non-financial reporting.", "In the US, only 27% of top 50 companies publish corporate social responsibility reports, with only 21% assessing supply chains.", "Despite this, the Corporate Social Responsibility (CSR) Reporting Code is expected to come into force in the UK by 2005 and require all quoted companies to report on their environmental, financial and operational risks."], "tinydolphin:1.1b": [" 1.", "Green reports shun supply chain\n  2.", "Nearly 20% more UK top 250 firms produced non-financial reports on social and environment issues than last year.", "3.", "But of the 145 companies reporting, 76% didn't examine their supply chains, says the annual Directions survey.", "Green groups say putting pressure on supply chains is a major way companies can reduce their environmental impact.", "The survey is published by corporate social responsibility firm Context and branding firm SalterBaxter.", "4.", "Blake Lee-Harwood, campaigns director at Greenpeace in the UK, said it's fairly meaningless to talk about your company's direction in terms of sustainability without having detailed knowledge of your supply chain.", "5.", "Less than a quarter of companies (24%) get their corporate social responsibility reports independently verified to provide assurances they are accurate and complete, says the survey.", "6.", "To date there are no set standards for non-financial reporting, although the Global Reporting Initiative, an independent pro-sustainability institution, is planning to establish some.", "The reports surveyed by Directions are published voluntarily.", "7.", "Peter Knight, director of Context, says 24 UK top 250 companies reported for the first time this year and, in general, the quality of reports has improved.", "\"The corporate lexicon of homilies, generalities and soft assurances - fluff - is on its way out.", "There are less pictures of smiling children and butterflies.\"", "8.", "The UK government will soon require all quoted companies to report their social and environmental risks in a chapter in their annual reports called the Operating and Financial Review.", "The regulation is not expected until 2005, and the first reports under this scheme will not be published before 2006.", "9.", "The US seems to lag Europe in producing corporate social responsibility reports.", "The majority of European top 50 companies (44) publish them and only 27 of the US top 50."], "phi:2.7b": [" Nearly 20% more UK companies produced non-financial reports on social and environmental issues than last year, but 76% didn't examine their supply chains.", "Only 24 out of 250 reported voluntarily published their CSR reports, which are usually called sustainability reports.", "The UK government will soon require all quoted companies to report social and environmental risks in a chapter of their annual reports, which is expected to be introduced in 2005.", "European top 50 companies are more likely to publish CSR reports than US companies."], "orca-mini:3b": [" Green-reporting UK top 250 firms produced more non-financial reports on social and environment issues compared to last year, but less than half examined their supply chains.", "The Directions survey found 76% of companies didn't examine their supply chains.", "This is a major way companies can reduce their environmental impact according to Greenpeace, which called for independent verification of non-financial reports.", "Less than a quarter of companies got their CSR reports independently verified.", "The UK government will require all quoted companies to report social and environmental risks in a chapter in their annual reports, but it's not expected until 2005 and the first reports won't be published until 2006.", "Most European top 50 companies publish them, while only 27 of the US top 50 do."], "hermes3:3b": ["20% more UK top 250 firms produced non-financial reports, but 76% don't examine supply chains; 24% get CSR reports verified."], "stablelm-zephyr:3b": ["Nearly 20% more UK top 250 firms produced non-financial reports on social and environment issues compared to last year, according to the annual Directions survey.", "However, 76% of these companies didn't examine their supply chains, which green groups say is a major way to reduce environmental impact.", "Only 24% of the surveyed companies had their corporate social responsibility (CSR) reports independently verified, and there are currently no set standards for non-financial reporting besides the Global Reporting Initiative planning to establish some.", "The UK government will soon require all quoted companies to report their social and environmental risks in a chapter in their annual reports."], "chatgpt-4o-latest": ["Nearly 20% more of the UK's top 250 firms produced non-financial reports on social and environmental issues than last year, but 76% of the 145 reporting companies did not examine their supply chains.", "Green groups argue that addressing supply chains is crucial for reducing environmental impact.", "The annual Directions survey, published by Context and SalterBaxter, also found that less than 24% of companies have their corporate social responsibility (CSR) reports independently verified.", "There are no set standards for non-financial reporting, though the Global Reporting Initiative aims to establish some.", "The quality of reports is improving, with fewer vague statements and symbolic imagery.", "The UK government will soon require quoted companies to disclose social and environmental risks in their annual reports, but this regulation will not take effect until 2005.", "European companies lead in CSR reporting compared to US firms."], "stablelm2:1.6b": ["Nearly all UK top firms produced non-financial reports on social and environmental issues, but fewer than a quarter examined their supply chains as per the annual Directions survey.", "Green groups claim that applying pressure on supply chains is an effective method for companies to reduce their environmental impact; however, the survey published by corporate social responsibility firm Context and branding firm SalterBaxter reveals that 95% of reporting firms didn..", "The UK government's upcoming requirement for quoted companies to report their social and environmental risks in an annual operating and financial review is expected soon.", "The US seems to lag behind Europe in producing corporate social responsibility reports; while the majority of European top firms publish them, only 1% of the US top firms do so."], "granite3.1-dense:2b": ["Nearly 20% more UK top 250 firms reported on social and environmental issues in their non-financial CSR reports this year, with 145 companies doing so according to Context's annual Directions survey.", "However, a significant majority (76%) of these companies failed to evaluate their supply chains, which are crucial for reducing environmental impact, as noted by green groups like Greenpeace.", "Only about 24% of the companies independently verify their CSR reports for accuracy, despite less fluff and more substantiated information compared to previous years.", "The UK government plans to mandate such reporting in annual filings by 2006, a move that lags behind European counterparts, with 44 out of top 50 European companies already publishing these reports, while only 27 US firms have followed suit."]}