{"raw_text": "Tsunami to cost Sri Lanka $1.3bn\n \n Sri Lanka faces a $1.3bn (£691m) bill in 2005 for reconstruction after the tsunami which killed more than 30,000 of its people, its central bank says.\n \n This estimate is preliminary, bank governor Sunil Mendis told reporters, and could rise in 2006. The island state is asking for about $320m from the International Monetary Fund to help pay for relief, he said. The bank has 5bn rupees ($50m; £27m) set aside to lend at a lower interest rate to those who lost property. According to Mr Mendis, half the IMF support could come from a freeze on debt repayments, which would free up resources immediately. The rest could come from a five-year emergency loan. Sri Lanka is hoping for a wider freeze from other creditors.\n \n The Paris Club of 19 creditors meets on 12 January to discuss a debt moratorium for the nations hit by the tsunami, which ravaged south and east Asia on 26 December.\n \n Some 150,000 people across the region are feared to be dead and millions have been left homeless and destitute. A full reckoning of the economic cost to Sri Lanka of the tsunami will not be clear for some time to come. But already it looks likely that growth in the first half of 2005 will slow, Mr Mendis told reporters, although he would not say by how much. One side-effect of the disaster has been that the value of the rupee has risen as foreign funds have flooded into the country. The currency has strengthened 4% since late December, coming close to 100 rupees to the US dollar for the first time in more than six months.\n", "llama3.2:1b": ["Sri Lanka faces a $1.3 billion reconstruction bill after a tsunami that killed over 30,000 people in 2005.", "The central bank is seeking IMF assistance of about $320m, with half potentially coming from debt freeze or emergency loan.", "A Paris Club meeting will discuss a debt moratorium for affected nations."], "llama3.2:3b": ["Sri Lanka faces a $1.3bn bill from the central bank for tsunami reconstruction and is asking the IMF for $320m.", "The island state is also seeking debt relief from creditors, including a freeze on repayments and a five-year emergency loan.", "A Paris Club meeting on January 12 will discuss a debt moratorium for nations affected by the tsunami, which killed over 30,000 people and left millions homeless."], "gemma2:2b": ["Sri Lanka faces a $1.3 billion reconstruction cost after the tsunami.", "The central bank estimates this could rise and is seeking $320 million from the International Monetary Fund to help pay for relief.", "Half of that support could come from debt moratoriums, freeing up immediate resources.", "The country is also hoping for wider debt freezes from other creditors."], "qwen2.5:0.5b": ["The Sri Lanka government is seeking $320m from the International Monetary Fund (IMF) as a preliminary estimate of the tsunami's reconstruction costs.", "The bank has set aside 5bn rupees (GBP 27m) to lend at a lower interest rate, and half of the IMF's support could come from a freeze on debt repayments.", "Sri Lanka hopes for a wider freeze from other creditors.", "While the exact cost is not clear yet, some economists predict growth in the first half of 2005 will slow due to the impact of the disaster."], "qwen2.5:1.5b": ["Sri Lanka faces a $1.3bn reconstruction cost after the tsunami in 2005, with an IMF freeze on debt repayments providing immediate resources.", "The island nation is requesting about $320m from the International Monetary Fund and has set aside ₹5bn ($50m; £27m) for lending to those affected by the disaster."], "qwen2.5:3b": ["Sri Lanka estimates a $1.3bn reconstruction cost from the 2004 tsunami, with preliminary figures expected to rise in 2006.", "The central bank seeks about $320m from the IMF and hopes half of it will come from debt moratoriums.", "Sri Lanka is part of discussions for a broader debt moratorium at the Paris Club meeting on January 12th.", "Over 150,000 people are feared dead in the region with millions homeless.", "The currency has strengthened 4% since December due to foreign investments.", "Growth in first half of 2005 is expected to slow but exact reduction not stated."], "opencoder:1.5b": ["Tsunami to cost Sri Lanka $1.3bn\n\nSri Lanka faces a $1.3bn (£691m) bill in 2005 for reconstruction after the tsunami which killed more than 30,000 of its people, it is critical that this recovery can be achieved successfully before further disruption can occur.", "This estimate is preliminary and Sri Lanka's bank governor Sunil Mendis has told reporters.", "He mentioned the possibility of a rise in 2006.", "The island state is asking for about $320m from the International Monetary Fund to help pay for relief, he said.", "The bank has already set aside $50m (£27m) to lend at a lower interest rate to those who lost property.", "According to Mr Mendis, half of IMF support could come from a freeze on debt repayments, which would free up resources immediately.", "The rest could come from a five-year emergency loan.", "Sri Lanka is hoping for a wider freeze from other creditors.", "The Paris Club of 19 creditors met on 12 January to discuss a debt moratorium for the nations hit by the tsunami, which caused south and east Asia to ripple harm on 26 December.", "Some 150,000 people across the region are believed to have been affected and thousands have been left homeless and destitute.", "The economic cost of the disaster is expected to be clear after this analysis but as with all financial costs, it will not be clear for some time to come.", "The recovery looks likely that growth in the first half of 2005 will slow, but that's a side effect of the disaster.", "The value of the rupee has risen as foreign funds have flooded into the country and reaching close to 100 rupees to the US dollar for the first time in more than six months."], "smollm:1.7b": ["The summary is concise and focuses on the main points of the text:\n\n1.", "Sri Lanka faces a $1.3bn bill in 2005 for reconstruction after the tsunami, which killed more than 30,000 people.", "2.", "The bank governor Sunil Mendis says that half the IMF support could come from a freeze on debt repayments, which would free up resources immediately.", "3.", "Sri Lanka is asking for about $320m from the International Monetary Fund to help pay for relief and rebuild its economy.", "4.", "The bank has 5bn rupees ($50m; £27m) set aside to lend at a lower interest rate to those who lost property in the tsunami.", "5.", "Mr Mendis says that half the IMF support could come from a freeze on debt repayments, which would free up resources immediately.", "6.", "The Paris Club of 19 creditors meets on 12 January to discuss a debt moratorium for the nations hit by the tsunami, which ravaged south and east Asia on 26 December.", "7.", "Some 150,000 people across the region are feared to be dead and millions have been left homeless and destitute.", "A full reckoning of the economic cost to Sri Lanka of the tsunami will not be clear for some time to come.", "8.", "The currency has strengthened 4% since late December, coming close to 100 rupees to the US dollar for the first time in more than six months."], "deepseek-r1:1.5b": ["Sri Lanka's tsunami cost $1.3 billion in 2005 for reconstruction, estimated as a preliminary figure that may rise next year.", "The island aims to receive approximately $320 million from the IMF and has set aside 50 million rupees at a lower interest rate.", "Potential delays could be resolved through a moratorium on debt repayments, potentially freeing resources.", "The rupee's value increased by 4%, reaching close to 100 US dollars.", "The government aims for faster recovery and seeks broader agreements with creditors."], "tinyllama:1.1b": ["Sri Lanka is facing a $1.3bn (£691m) bill for reconstruction and emergency relief after the tsunami that killed more than 30,000 people in the island nation in December 2004.", "The central bank governor has estimated the bill as preliminary but it could increase in 2006, according to Sri Lanka's central banker Sunil Mendis.", "Half of the IMF-funded support is available immediately but the rest will come from a five-year emergency loan.", "The Paris Club of 19 creditors is meeting on January 12th to discuss a debt moratorium for those hit by the disaster.", "The expected economic cost to Sri Lanka of the tsunami will not be clear until later in 2005, but already it looks likely that growth in the first half of 2005 will slow.", "The rupee has been strengthening since late December, with the value of the currency coming close to 100 rupees to the US dollar for the first time in over six months."], "tinydolphin:1.1b": [" Sri Lanka faces a $1.3 billion (£691 million) bill in costs due to the tsunami that killed over 30,000 people and caused widespread destruction across its coastal areas in December 2004.", "The country's central bank Governor Sunil Mendis has estimated the cost at $1.3 billion, or £691 million.", "The tsunami has been one of the worst natural disasters to affect a major nation, leaving over a million people dead and causing significant damage to infrastructure, agriculture, and businesses across several countries in Asia's south and east.", "The country's parliament is expected to discuss debt relief options for affected individuals, and the Paris Club of 19 creditors will meet on 12 January to discuss a moratorium on repaying debts affected by the disaster.", "Due to the tsunami, Sri Lanka's GDP is expected to decline in the first half of 2005, with growth forecasted to slow significantly after hitting an all-time high of around 7.9% in 2004.", "The rupee has also strengthened against the US dollar, reaching a level close to 100 rupees for the first time since November 2003."], "phi:2.7b": [" Sri Lanka will face a $1.3 billion bill in 2005 for tsunami reconstruction and is seeking assistance from the IMF.", "Half of this loan could be a debt repayment freeze, and the other half could come in the form of an emergency loan.", "The impact on growth in the first half of 2005 has already slowed down, and the value of the rupee has risen as a result of foreign funds flooding into the country."], "orca-mini:3b": [" Sri Lanka will require $1.3 billion to rebuild after the tsunami that killed over 30,000 people and will ask for $320 million from the International Monetary Fund.", "The central bank has set aside 5bn rupees ($50 million; £27 million) for those who lost property.", "The Paris Club of 19 creditors will meet in January to discuss a debt moratorium for tsunami-hit nations, with some 150,000 people across the region feared dead.", "The economic cost to Sri Lanka is not yet clear but growth will slow down in the first half of 2005, according to the governor of the central bank.", "The currency has strengthened 4% since late December, coming close to 100 rupees to the US dollar for the first time in more than six months."], "hermes3:3b": ["Sri Lanka $1.3bn bill for tsunami reconstruction."], "stablelm-zephyr:3b": ["Sri Lanka faces a $1.3bn bill for reconstruction after the 2004 tsunami, with preliminary estimates from the central bank.", "The island state is seeking $320m from the International Monetary Fund (IMF) and hopes for wider support from other creditors.", "Half of the IMF's promised aid could come from a debt moratorium being discussed by the Paris Club of 19 creditors on 12 January.", "Sri Lanka's growth in the first half of 2005 may slow due to the tsunami's economic cost, which is still unknown.", "The value of the rupee has risen 4% since December as foreign funds flood into the country."], "chatgpt-4o-latest": ["Sri Lanka faces a $1.3 billion reconstruction cost in 2005 after the tsunami that killed over 30,000 people.", "The estimate may rise in 2006.", "The country seeks $320 million from the IMF, with half potentially coming from a debt repayment freeze and the rest from a five-year emergency loan.", "Sri Lanka also hopes for a broader debt moratorium from other creditors, with the Paris Club set to discuss this on 12 January.", "The tsunami has devastated the region, leaving 150,000 feared dead and millions homeless.", "The full economic impact remains unclear, but growth in early 2005 is expected to slow.", "Meanwhile, foreign aid inflows have strengthened the rupee by 4%, nearing 100 rupees per US dollar for the first time in six months."], "stablelm2:1.6b": ["Sri Lanka will face a $1.3bn reconstruction bill due to the tsunami that killed over half its population and affected southeast Asia.", "This figure is preliminary and could increase.", "The country has requested $5bn from the International Monetary Fund for relief, with the central bank setting aside $5bn to lend at a lower interest rate to those who lost property.", "Half of the IMF support can be obtained through a debt freeze that would free up resources immediately, while the rest can come from a five-year emergency loan if approved by other creditors.", "The total economic cost of the tsunami is expected to have an impact on Sri Lanka's growth in 2015, although its value has risen due to foreign funds pouring into the country since late December."], "granite3.1-dense:2b": ["Sri Lanka anticipates a $1.3bn (£691m) reconstruction cost following the 2004 tsunami, which claimed over 30,000 lives.", "The central bank's preliminary estimate may increase in 2006.", "Sri Lanka seeks $320m from the International Monetary Fund to aid relief efforts.", "The bank has $50m ($27m) set aside for low-interest loans to property owners.", "Potential IMF support could involve a debt moratorium, freezing repayments, and offering a five-year emergency loan.", "Sri Lanka hopes other creditors will also grant similar relief.", "Approximately 150,000 people in the region are estimated dead, with millions displaced.", "The economic impact on Sri Lanka is expected to slow growth in H2 2005 due to the disaster.", "Conversely, the rupee's value has strengthened by 4%, reaching near-historical levels close to 100 rupees per US dollar."]}