{"raw_text": "Indian oil firm eyes Yukos assets\n \n India's biggest oil exploration firm, Oil & Natural Gas Corp (ONGC), says it is in talks to buy the former assets of troubled Russian crude producer Yukos.\n \n \"We are in touch with the concerned Russian entities about the Yukos assets and other opportunities in Russia,\" said ONGC chairman Subir Raha. Local press had reported that ONGC was looking to buy 15% of Yukos' former key oil production unit for $2bn (£1bn). Yukos is being broken up by Russian authorities to pay a massive tax bill.\n \n It was forced to sell its key production unit Yuganskneftegas (Yugansk) last month after being hit with a bill of $27bn in unpaid taxes and fines.\n \n State-owned Rosneft now owns Yugansk and Russia has said it will turn the oil producer into a stand-alone firm. Indian oil minister Mani Shankar Aiyar discussed ONGC's plans during a trip to Moscow last year, and the topic came up again during Russian president Vladimir Putin's recent visit to New Delhi. \"It would make great sense for us to build on that,\" said Mr Aiyar. India's oil production has stagnated over recent years, and it is having to look abroad to secure future supplies. India imports about 70% of its total oil consumption. At the same time, India's economy is booming and the country's thirst for oil is so strong that it has helped pushed up the price of crude worldwide.\n \n India produces about 793,000 barrels of oil per day (bpd), little changed since the start of the 1990s, according to oil industry analysts Douglas-Westwood. Consumption, meanwhile, has jumped to 2.4 million bpd, compared with 474,000 bpd in 1973.\n \n \"For countries to develop, they have to have access to energy,\" said John Westwood, managing director of oil industry analysts Douglas-Westwood. India is a \"dramatically growing economy that must have access to oil\". By buying into Yugansk, ONGC would be able to reduce its dependence on Gulf states for oil imports, Mr Westwood explained, especially as the chances of finding and exploiting resources within India are slim. \"We forecast that Indian production will go into significant decline,\" Mr Westwood said. \"By 2020, production may only be at half of today's levels.\" ONGC, which is majority-owned by the Indian state, already has bought petroleum assets in countries including Vietnam, Sudan and Russia. The company is a partner with Rosneft in the Sakhalin-1 oil field off Russia's Siberian coast.\n \n ONGC is, however, not the only firm interested in Yugansk.\n \n Chinese crude company China National Petroleum has also been mentioned as a possible investor, while on Thursday, Italy refused to rule out an interest. ONGC's interest is the latest twist in a saga that has seen one of the world's biggest oil producers brought to its knees. The dispute is partly driven by President Putin's clampdown on the political ambitions of ex-Yukos boss Mikhail Khodorkovsky, who is currently in jail on charges of fraud and tax evasion. Yukos has been battling the Russian authorities for more than a year and has filed for bankruptcy protection in the US. Analysts have questioned how long it can continue to survive without Yugansk. On Thursday, a US court said it will hear arguments for Yukos' bankruptcy claim to be thrown out on 16 February. Should that happen, Yukos will have little chance of clawing back its assets, analysts said.\n", "llama3.2:1b": ["India's Oil & Natural Gas Corp (ONGC) is in talks to buy the former assets of Russian crude producer Yukos due to Russia's decision to break it up and turn the oil producer into a stand-alone firm.", "The sale is seen as a way for India to secure future supplies without relying on Russia, which has been struggling with tax payments owed to the International Monetary Fund (IMF)."], "llama3.2:3b": ["India's ONGC in talks to buy 15% stake in former Russian oil producer Yukos, with potential to acquire entire production unit for $2 billion, amid plans by Russia to break up the company due to massive tax bill."], "gemma2:2b": ["Oil & Natural Gas Corp (ONGC), India's largest oil firm, is in talks to buy a portion of the former assets of Yukos, the Russian oil producer that recently went bankrupt.", "This comes after Yukos was forced to sell Yuganskneftegas due to unpaid taxes and fines, now owned by Rosneft, which will break it into a separate entity.", "ONGC sees this as an opportunity to reduce India's dependence on Gulf states for oil imports and expand its operations abroad.", "This move aligns with India's growing economy but also poses challenges since production is stagnant at home.", "Other companies like China National Petroleum and Italy are also interested in Yugansk, while Yukos faces a possible legal battle over its assets and bankruptcy may impact their recovery."], "qwen2.5:0.5b": ["Here is the summary:\n\nIndia's Oil & Natural Gas Corporation (ONGC) has been in talks with Russia's Yukos for years.", "ONGC wants to buy part of Yukos' oil production unit and pay about $2 billion to get a stake.", "This would make ONGC India's largest oil firm, which owns around 793,000 barrels per day (bpd).", "Despite the talks, Russia has said it will turn Yukos into a stand-alone company in return for billions of dollars.", "The move aims to help stabilize India's energy supply and boost its economy.", "However, ONGC is not alone in this.", "Chinese oil company China National Petroleum also expressed interest in buying part of Yukos' assets."], "qwen2.5:1.5b": ["Indian oil company ONGC talks about potentially buying Yukos's Russian assets, despite the former company facing financial troubles and being broken up due to unpaid taxes and fines.", "This could help India reduce dependence on Gulf oil producers and access cheaper Russian crude.", "Other companies like China National Petroleum have also expressed interest in potential investment opportunities with Yugansk."], "qwen2.5:3b": ["Indian oil firm ONGC is in talks to buy former Russian crude producer Yukos’ assets, including a key production unit Yuganskneftegas (Yugansk) sold last month due to unpaid taxes and fines totaling $27bn.", "This move aims to secure future supplies for India’s booming economy, which imports about 70% of its total oil consumption.", "ONGC has shown interest in buying 15% of Yukos’ former unit for $2bn, despite local press reports of a proposed sale price of $1bn.", "The deal would help reduce Indian dependence on Gulf states and exploit resources within India, where production is expected to decline significantly by 2020.", "Meanwhile, Chinese and Italian firms are also interested in the Yugansk assets.", "The situation is partly driven by political issues involving ex-Yukos boss Mikhail Khodorkovsky, who is currently jailed on fraud and tax evasion charges."], "opencoder:1.5b": ["The given text is too long to summarize properly using the provided prompt.", "The goal here is not only to condense the original text into a concise summary, but also preserve important details.", "Therefore, some specific terms or ideas would be omitted in the summarized version.", "In the provided text:\n\n1.", "\"Indian oil firm eyes Yukos assets\" \n2.", "\"Oil & Natural Gas Corp (ONGC), says it is in talks to buy the former assets of troubled Russian crude producer Yukos.\"", "3.", "The speaker states that ONGC chairman Subir Raha reports about the Yukos assets and other opportunities in Russia.", "4.", "It was forced to sell its key production unit Yuganskneftegas (Yugansk) last month after being hit with a bill of $27bn in unpaid taxes and fines.", "5.", "The speaker talks about India's oil production, consumption, and economy.", "6.", "ONGC's plans during a trip to Moscow and discussed on the topic Mr Aiyar.", "7.", "The speaker mentions India's growth and how it can access future supplies for crude oil.", "These are the main points that were not excluded in the summary."], "smollm:1.7b": ["The summary is concise and objective, capturing the main points of the original text while omitting unnecessary details.", "The key ideas and key words are preserved, ensuring that the reader understands the essence of the text without getting bogged down in technical jargon or complex explanations."], "deepseek-r1:1.5b": ["NGOC is planning to acquire Yukos for $2bn, splitting its resources and breaking it up due to taxes.", "They sold Yuganskneftegas last month, which was about 70% of production.", "India's oil industry faces rising costs and relies on Gulf states, while ONGC aims to reduce reliance by acquiring Russia's production.", "Rosneft now owns part of the company and will be a standalone firm.", "The government supports this deal as it reduces dependency on Gulf states."], "tinyllama:1.1b": ["The Indian oil firm Oil & Natural Gas Corp (ONGC) is looking at buying shares in the former assets of troubled Russian crude producer YuKao's, which include YuKao's key oil production unit for $2 billion (£1 billion).", "INGOC chairman Subir Raha said that it was in talks to buy 15% of the former assets to help pay off massive tax debts and fines.", "Russian authorities had to sell YugaNeskneftegas (YugaNS), which is being turned into a stand-alone firm, as it owed billions in unpaid taxes and fines.", "State-owned Rosneft now owns YuKao's key production unit and INGOC sees building on that by buying shares in YugaNS.", "The Indian economy has seen a boom in demand for oil since 2014, with imports soaring to over 700,000 barrels per day (bpd).", "However, India's growth is outpacing global oil production and it is having to import more oil to feed the country's thirst.", "Despite this, ONGC is looking at buying shares in YuKao's for $2 billion, much like other firms are doing.", "The move has boosted INGOC's chances of making a deal as it hopes to reduce its dependence on foreign oil, which could help India develop.", "The Indian government has bailed out several struggling Russian companies to keep their business alive, including the debt-ridden state-owned bank VTB and troubled energy company Rosneft."], "tinydolphin:1.1b": [" The Indian oil firm ONGC is in talks with the Russian oil company Yukos for buying their former assets, valued at $2 billion.", "This move by ONGC follows recent tax troubles, which forced them to sell a part of their production unit earlier this year.", "Indian Energy Minister Mani Shankar Aiyar met Russian President Vladimir Putin last year to discuss the matter.", "It is anticipated that the acquisition would make great sense for both parties involved since it would help India secure its oil needs and strengthen its position in the international market."], "phi:2.7b": [" Indian oil firm ONGC is in talks with Russia to buy the former assets of troubled Russian crude producer Yukos, which was forced to sell its key production unit Yugansk last month due to unpaid taxes and fines.", "The purchase would help reduce India's dependence on Gulf states for oil imports as the country' s economy booms.", "ONGC's interest is part of a long-running saga involving ex-Yukos CEO Mikhail Khodorkovsky, who is currently in jail on charges of fraud and tax evasion.", "If ONGC makes the purchase, Yukos will have little chance of clawing back its assets as it filed for bankruptcy protection in the US and lost a court case on 16 February."], "orca-mini:3b": [" India's biggest oil exploration firm ONGC is in talks to buy the former assets of troubled Russian crude producer Yukos.", "The purchase would allow ONGC to reduce its dependence on Gulf states for oil imports.", "However, other firms like China National Petroleum and Italy have also expressed interest in Yugansk.", "The acquisition is the latest twist in a saga that has seen one of the world's biggest oil producers brought to its knees by a tax bill of $27bn against Yukos."], "hermes3:3b": ["INDIA's ONGC discusses buying YUKOS assets \nONGC in talks to buy former YUKOS assets in Russia, to reduce oil import dependence and growing energy demand."], "stablelm-zephyr:3b": ["India's Oil & Natural Gas Corp (ONGC) is reportedly in talks to purchase the remaining assets of the now-broken up Russian crude producer, Yukos.", "ONGC has expressed an interest in acquiring 15% of Yuganskneftegas, one of Yukos' key oil production units, for $2bn (£1bn).", "Indian oil minister Mani Shankar Aiyar mentioned this during a visit to Moscow last year and the topic was again discussed by Russian president Vladimir Putin during his New Delhi visit.", "India's oil production has stagnated in recent years, leading the country to look abroad for future supplies, with 70% of its total oil consumption imported."], "chatgpt-4o-latest": ["India's Oil & Natural Gas Corp (ONGC) is in talks to acquire former assets of Russian oil firm Yukos, which was dismantled to pay a $27bn tax bill.", "ONGC is reportedly considering a $2bn purchase of a 15% stake in Yuganskneftegas (Yugansk), Yukos' key production unit now owned by state-run Rosneft.", "India's oil minister discussed the deal with Russian officials, as India seeks to secure energy supplies amid rising consumption and stagnant domestic production.", "ONGC, already invested in global petroleum assets, aims to reduce reliance on Gulf oil.", "Other potential investors include China's CNPC and possibly Italy.", "The Yukos saga is linked to President Putin's crackdown on ex-Yukos chief Mikhail Khodorkovsky, who is jailed for fraud and tax evasion.", "Yukos has filed for US bankruptcy protection, but its survival is uncertain if the claim is dismissed."], "stablelm2:1.6b": ["Indian oil firm ONGC is in talks to buy the former assets of troubled Russian crude producer Yukos.", "The acquisition could reduce ONGC's dependence on Gulf states for oil imports, especially as India's production levels are expected to decline significantly in the future.", "Oil & Natural Gas Corp (ONGC) already owns petroleum assets in countries like Vietnam, Sudan, and Russia."], "granite3.1-dense:2b": ["India's largest oil exploration firm, Oil & Natural Gas Corp (ONGC), is in discussions with Russian entities regarding the acquisition of former Yukos assets.", "ONGC aims to purchase a stake in Yuganskneftegas, a significant oil production unit previously owned by Yukos.", "The talks were discussed during Indian oil minister Mani Shankar Aiyar's visit to Moscow and reiterated during Russian President Vladimir Putin's recent trip to New Delhi.", "Yukos, once a major global crude producer, is being dismantled due to an unpaid tax bill of around $27 billion.", "State-owned Rosneft now controls Yugansk, and Russia plans to transform it into a standalone firm.", "India imports about 70% of its oil consumption from the Gulf states, but given its rapidly growing economy (currently consuming 2.4 million barrels per day), reducing this dependence on foreign sources is crucial.", "ONGC has previously expanded into petroleum assets in countries like Vietnam and Sudan, partnering with Rosneft in the Sakhalin-1 oil field off Russia's Siberian coast.", "The company is not the sole potential investor; Chinese crude firm China National Petroleum and Italy are also being considered.", "The acquisition would help India lessen its reliance on Gulf states for oil imports, as domestic production is expected to decline significantly by 2020.", "The deal is partly driven by Russian President Putin's efforts to limit the political ambitions of Yukos' former chairman Mikhail Khodorkovsky, who is currently imprisoned on fraud and tax evasion charges.", "In a recent development, a US court will hear arguments to dismiss Yukos' bankruptcy claim on February 16.", "If the decision goes against Yukos, its prospects of recovering assets diminish further."]}