{"raw_text": "Continental 'may run out of cash'\n \n Shares in Continental Airlines have tumbled after the firm warned it could run out of cash.\n \n In a filing to US regulators the airline warned of \"inadequate liquidity\" if it fails to reduce wage costs by $500m by the end of February. Continental also said that, if it did not make any cuts, it expects to lose \"hundreds of millions of dollars\" in 2005 in current market conditions. Failure to make cutbacks may also push it to reduce its fleet, the group said. Shares in the fifth biggest US carrier had fallen 6.87% on the news to $10.44 by 1830 GMT. \"Without the reduction in wage and benefit costs and a reasonable prospect of future profitability, we believe that our ability to raise additional money through financings would be uncertain,\" Continental said in its filing to the US Securities and Exchange Commission (SEC).\n \n Airlines have faced tough conditions in recent years, amid terrorism fears since the 11 September World Trade Centre attack in 2001. But despite passengers returning to the skies, record-high fuel costs and fare wars prompted by competition from low cost carriers have taken their toll. Houston-based Continental now has debt and pension payments of nearly $984m which it must pay off this year. The company has been working to streamline its operations - and has managed to save $1.1bn in costs without cutting jobs. Two weeks' ago the group also announced it would be able to shave a further $48m a year from its costs with changes to wage and benefits for most of its US-based management and clerical staff.\n", "llama3.2:1b": ["Continental Airlines warned that it could run out of cash if it fails to reduce wage costs by $500m by the end of February, due to \"inadequate liquidity\" in current market conditions.", "The airline expects to lose hundreds of millions of dollars in 2005 without making cuts and may need to reduce its fleet.", "Shares fell 6.87% on news that Continental had fallen 1830 GMT from $10.44 by 1830 GMT"], "llama3.2:3b": ["Continental Airlines warns of potential cash shortage due to inadequate liquidity if wage cuts are not made by February, risking loss of hundreds of millions of dollars in 2005 and potentially reducing fleet.", "Shares have fallen 6.87%.", "The airline has $984m in debt and pension payments this year, but has managed to save $1.1bn in costs without cutting jobs."], "gemma2:2b": ["Continental Airlines warned that it may run out of cash unless significant cost cuts are made.", "The company needs to reduce wages by $500 million by the end of February or face potential losses in 2005, which could lead to fleet reductions.", "Shares fell after the announcement."], "qwen2.5:0.5b": ["Continental Airlines may struggle with running out of cash, as it warned about inadequate liquidity if it doesn't reduce wage costs by $500 million by the end of February.", "The airline expects hundreds of millions of dollars in current market conditions without making cuts.", "It has filed a filing to US regulators, warning that failure to make any cuts could lead to reduced fleet and potential reduction in capital expenditures.", "Continental's stock price fell by 6.87% on the news at $10.44 per share by 18:30 GMT, with debt and pension payments of nearly $984 million due this year.", "The company has been working to streamline its operations and save nearly $48 million a year without cutting jobs."], "qwen2.5:1.5b": ["Continental Airlines faces potential bankruptcy due to insufficient cash reserves and inability to cut costs, leading to a 6.", "87% share price drop by the end of February.", "The airline warns it could lose hundreds of millions in profits if no cost reductions are made before January 31st or fleet size is reduced due to lack of financing options."], "qwen2.5:3b": ["Continental Airlines warns of potential cash shortage if cost cuts are not made, leading to stock drops by 6.87% to $10.44.", "Failure to reduce wage and benefit costs could result in millions in losses and fleet reductions.", "The airline faces financial pressures due to recent tough market conditions including high fuel costs and competition from low-cost carriers.", "Continental has already saved $1.58bn but still owes nearly $984m this year for debt and pensions."], "opencoder:1.5b": ["Continental 'may run out of cash' Shares in Continental Airlines have tumbled after a firm warned it could run out of cash in a filing to US regulators.", "The airline has faced tough conditions in recent years, amid fears of World Trade Centre attack, which could escalate the price of flights.", "Despite passengers returning to the skies, high fuel costs and fare wars triggered by competition from low cost carriers have caused significant financial losses.", "The company is facing a debt-paying balance sheet which will have to be paid off this year.", "The aim has been to save $1.1bn in costs while shaving $48m a year from wage and benefits for most of its US-based management and clerical staff."], "smollm:1.7b": ["The Continental Airlines' financial situation is precarious, as they are facing increased fuel costs, fare wars, and the threat of bankruptcy due to inadequate liquidity.", "The airline has already warned that it may run out of cash if it fails to reduce its wage and benefit costs by $500m by the end of February.", "If this prediction comes true, Continental will likely face a significant financial crisis, which could lead to job losses and further instability in the aviation industry."], "deepseek-r1:1.5b": ["Continental 'may run out of cash' shares in the airline industry have fallen after a warning about potential liquidity issues, which includes losing hundreds of millions in 2005 if wage cuts aren't made by February.", "They also plan to reduce their fleet without making those cuts.", "Their current debt and pension payments amount to nearly $984 million, which they must pay this year."], "tinyllama:1.1b": ["Continental Airlines has warned that it may run out of cash, after the firm warned that it could face financial losses of hundreds of millions in current market conditions.", "The fifth largest US airline had fallen by 6.87% in stock prices due to the news, as well as a downgrade in its credit rating.", "The company said that without \"inefficient liquidity\" cuts, it would lose thousands of dollars per day and may have to reduce its fleet if not.", "Continental Airlines' shares had fallen by 6.87% on the news to $10.44, despite the airline saying that it could raise additional funds through financials.", "Despite the challenging circumstances, the company has been working hard to streamline operations and manage costs without cutting jobs.", "Two weeks ago, it announced cost savings of $48m a year for its US-based management and clerical staff."], "tinydolphin:1.1b": [" Continental Airlines, one of the largest airlines in the world, warned that it could run out of cash if it does not make significant cuts by February.", "The company stated that \"inadequate liquidity\" is expected if it fails to reduce wage costs by $500 million by the end of February.", "Continental's warning comes amidst concerns over the airline industry's financial situation and its ability to recover from the aftermath of the September 11 terrorist attacks, which disrupted air travel around the world.", "The company has faced intense competition from low-cost carriers and is working to reduce costs without cutting jobs or reducing its fleet."], "phi:2.7b": [" Continental Airlines may run out of cash due to inadequate liquidity if they fail to reduce wage costs by $500m by the end of February.", "The airline also expects to lose hundreds of millions of dollars in 2005 without making any cuts, which may prompt them to reduce their fleet.", "This news caused shares in Continental to fall 6.87%."], "orca-mini:3b": [" Continental may run out of cash due to inadequate liquidity if it fails to reduce wage costs by $500m by the end of February.", "The group warned that it expects to lose hundreds of millions of dollars in 2005 in current market conditions, and unless it reduces its fleet, it may have to cut its workforce."], "hermes3:3b": [" Continental Airlines possibly running out of cash; warns of inadequate liquidity if not reduces $500m wage costs by Feb end."], "stablelm-zephyr:3b": ["Continental Airlines is warning that it may run out of cash if it doesn't reduce wage costs by $500m by February end.", "The airline stated that it expects to lose hundreds of millions of dollars in 2005 due to current market conditions if no cuts are made.", "If reductions push the company to reduce its fleet, shares in the fifth biggest US carrier fell 6.87% to $10.44.", "Continental has been working to streamline operations and save $1.1bn without cutting jobs."], "chatgpt-4o-latest": ["Continental Airlines warned it could run out of cash if it fails to cut wage costs by $500 million by the end of February.", "The airline expects to lose hundreds of millions of dollars in 2005 under current market conditions and may have to reduce its fleet.", "Shares fell 6.87% to $10.44 following the announcement.", "Continental cited high fuel costs, fare wars, and debt obligations of nearly $984 million as financial pressures.", "The company has already saved $1.1 billion without job cuts and recently announced an additional $48 million in cost reductions through wage and benefit changes for management and clerical staff."], "stablelm2:1.6b": ["Continental Airlines warned it could run out of cash due to inadequate liquidity despite making $1.1 billion in cost cuts.", "The airline expects hundreds of millions in losses if it fails to reduce wage costs by the end of February, potentially pushing it to cut its fleet.", "Failure to make cuts may also lead to further debt and pension payment obligations.", "Airlines have faced tough conditions in recent years due to terrorism fears but record fuel costs and fare wars."], "granite3.1-dense:2b": ["Continental Airlines, the fifth largest U.S. carrier, is at risk of cash shortages due to inadequate liquidity, as reported in a filing to the SEC.", "The company warns that without reducing wage costs by $500 million by February or making other unspecified cuts, it may lose hundreds of millions in 2005 and potentially face fleet reductions.", "Shares plummeted 6.87% following this announcement, trading at $10.44.", "Continental's financial struggles stem from high debt, pension payments, and operational challenges amidst record-high fuel costs, competition from low-cost carriers, and post-9/11 travel uncertainties.", "Despite these issues, the company has already saved $1.1 billion through cost cuts without job losses, and recently announced an additional $48 million in annual savings via wage and benefits modifications for U.S.-based management and clerical staff."]}