{"raw_text": "India's Deccan gets more planes\n \n Air Deccan has signed a deal to acquire 36 planes from Avions de Transport Regional (ATR).\n \n The value of the deal has not been revealed, because of a confidentiality clause in the agreement. But Air Deccan's managing director Gorur Gopinath has said the price agreed was less than the catalogue price of $17.6m (£9.49m) per plane. Recently, India's first low-cost airline ordered 30 Airbus A320 planes for $1.8bn.\n \n Under the agreement, Air Deccan will buy 15 new ATR 72-500 and lease another 15. ATR will also provide six second hand airplanes. In a statement, ATR has said deliveries of the aircraft will begin in 2005 and will continue over a five-year period.\n \n Mr Gopinath said the planes will connect regional Indian cities. \"After an evaluation of both ATR and Bombardier aircraft, we have chosen the ATR aircraft as we find it most suitable for our operations and for the Indian market for short haul routes.\" Filippo Bagnato, ATR's chief executive, has said that his firm will also work with Air Deccan to create a training centre in Bangalore.\n \n The potential of the Indian budget market has attracted attention from businesses at home and abroad. Air Deccan has said it will base its business model on European firms such as Ireland's Ryanair. Beer magnate Vijay Mallya recently set up Kingfisher Airlines, while UK entrepreneur Richard Branson has said he is keen to start a local operation. India's government has given its backing to cheaper and more accessible air travel.\n", "llama3.2:1b": ["India's Air Deccan signs deal with Avions de Transport Regional (ATR) for 36 planes.", "The price agreed was less than $17.6m per plane, which is significantly lower than the catalogue price of £9.49m per plane.", "Air Deccan will purchase new ATR 72-500 and used aircraft, while ATR will provide six second-hand planes.", "Deliveries are expected to begin in 2005 and last for five years."], "llama3.2:3b": ["Air Deccan signs deal with Avions de Transport Regional (ATR) to acquire 36 planes, including 15 new ATR 72-500 and 6 second-hand aircraft, for an undisclosed amount.", "Deliveries begin in 2005 over a five-year period.", "The airline plans to connect regional Indian cities, with planes priced lower than catalogue value of $17.6m per plane."], "gemma2:2b": ["Air Deccan has signed a deal with ATR to acquire 15 new ATR 72-500 planes and 15 leased ATR aircraft, for a price lower than the catalogue price of $17.6 million per plane.", "The delivery will begin in 2005 and continue over a five-year period.", "This acquisition is part of Air Deccan's plan to connect regional Indian cities through short haul routes.", "ATR will also set up a training center in Bangalore with Air Deccan.", "The deal reflects the growing demand for budget airlines in India, similar to European models like Ryanair."], "qwen2.5:0.5b": ["India's first low-cost airline Air Deccan has agreed to buy 36 new planes from ATR for $17.6m each, with deliveries beginning in 2005 and lasting five years.", "The deal includes an ATR 72-500 aircraft and six second-hand airplanes, with ATR providing a catalogue price of $1.8bn.", "The potential market for Indian budget flights is attracting attention from businesses worldwide, and Air Deccan plans to base its business model on European firms such as Ryanair."], "qwen2.5:1.5b": ["India's Air Deccan signs deal with ATR for 36 new planes, including leasing 15, which will connect regional Indian cities like the first low-cost airline order in 2004.", "Deals include potential training center at Bangalore."], "qwen2.5:3b": ["India's Deccan signs deal for 36 ATR planes, including 15 new ATR 72-500 and lease of another 15.", "The price is less than $17.6m per plane; delivery begins in 2005 over five years.", "Air Deccan will use them to connect regional Indian cities.", "Filippo Bagnato, ATR's CEO, also announced a training center in Bangalore.", "This deal highlights the growing interest in India's low-cost airline market by both home and foreign businesses."], "opencoder:1.5b": ["India's Deccan gets more planes, Air Deccan has signed a deal to acquire 36 planes from Avions de Transport Regional (ATR), but the value of the deal has not been revealed due to a confidentiality clause in the agreement.", "Under the agreement, Air Deccan will buy 15 new ATR 72-500 and lease another 15.", "The ATR also provides six second hand airplanes.", "Mr Gorur Gopinath has said the price agreed was less than the catalogue price of $17.6m (£9.49m) per plane.", "India's first low-cost airline ordered 30 Airbus A320 planes for $1.8bn are reported to be delivering in 2005 and will continue over a five-year period, and its business model includes European firms such as Ireland's Ryanair.", "The potential of the Indian budget market has attracted attention from businesses at home and abroad."], "smollm:1.7b": ["The summary of the text above should be:\n\nIndia's Deccan gets more planes\nAir Deccan has signed a deal to acquire 36 planes from Avions de Transport Regional (ATR).", "The value of the deal has not been revealed, because of a confidentiality clause in the agreement.", "But Air Deccan's managing director Gorur Gopinath has said the price agreed was less than the catalogue price of $17.6m (£9.49m) per plane.", "Recently, India's first low-cost airline ordered 30 Airbus A320 planes for $1.8bn.", "Under the agreement, Air Deccan will buy 15 new ATR 72-500 and lease another 15.", "ATR will also provide six second hand airplanes.", "In a statement, ATR has said deliveries of the aircraft will begin in 2005 and will continue over a five-year period.", "Mr Gopinath said the planes will connect regional Indian cities.", "\"After an evaluation of both ATR and Bombardier aircraft, we have chosen the ATR aircraft as we find it most suitable for our operations and for the Indian market for short haul routes.\"", "Filippo Bagnato, ATR's chief executive, has said that his firm will also work with Air Deccan to create a training centre in Bangalore.", "The potential of the Indian budget market has attracted attention from businesses at home and abroad.", "Air Deccan has said it will base its business model on European firms such as Ireland's Ryanair.", "Beer magnate Vijay Mallya recently set up Kingfisher Airlines, while UK entrepreneur Richard Branson has said he is keen to start a local operation.", "India's government has given its backing to cheaper and more accessible air travel."], "deepseek-r1:1.5b": ["Air Deccan has acquired 36 planes from ATR, with no deal value revealed due to confidentiality.", "The price was less than $17.6 million per plane, chosen based on suitability for regional operations.", "India ordered 30 Airbus A320s for $1.8 billion and will buy 15 ATR 72-500 planes from ATR while leasing another 15, providing six second-hand airplanes.", "These planes connect regional Indian cities for short-haul routes.", "ATR's deliveries begin in 2005 and last five years.", "ATR CEO Filippo Bagnato plans to collaborate with Deccan on a training center in Bangalore.", "The deal targets India's budget market, appealing to Europe and the US, supported by companies like Ryanair and Kingfisher, as well as business interests driving cheaper air travel."], "tinyllama:1.1b": ["India's low-cost carrier Air Deccan has signed a deal for the purchase of 36 planes from Avions de Transport Regional (ATR), valued at approximately $1.8bn.", "The agreement has included a lease of six second-hand planes, with deliveries scheduled to begin in 2005 and continue over a five-year period.", "Air Deccan will also benefit from the training centre being set up by ATR, which is expected to create employment opportunities for locals.", "The potential for increased demand has prompted local businesses such as Viya Mallya and Richard Branson to consider starting their own budget airlines.", "The Indian government has recently given its backing to cheap air travel in the country."], "tinydolphin:1.1b": [" Air Deccan, the first low-cost Indian airline, has secured an aircraft deal worth $1.8 billion with regional aircraft manufacturer Avions de Transport Regional (ATR).", "The contract includes the acquisition of 36 aircraft valued at approximately $17.6 million each and leaseback agreements on another 15 planes.", "Air Deccan, founded by Gorur Gopinath, has ordered the ATR 72-500s, which have a maximum range of 4,835 kilometers (3,638 miles) and are powered by Pratt & Whitney PW210 turbofan engines.", "The six second-hand aircraft will be delivered in 2005, with deliveries continuing for an estimated five years.", "ATR has offered six Airbus A320s as the option for Air Deccan.", "These planes have a maximum range of 4,997 kilometers and are powered by Pratt & Whitney PW100 turbofan engines, providing a better performance than Airbus's latest aircraft, the A320.", "Air Deccan has chosen to lease six second-hand Airbus A320s from ATR since they are more suitable for its regional Indian operations.", "These aircraft will connect smaller cities in India with major metropolitan areas like Delhi, Mumbai, and Bangalore.", "Filippo Bagnato, CEO of ATR, has expressed his interest in establishing a training center in Bangalore to assist Air Deccan's growth.", "The potential of the Indian budget market has caught the attention of global businesses and entrepreneurs such as Richard Branson, who is considering starting a local operation.", "Kingfisher Airlines, owned by Vijay Mallya and funded by billionaire entrepreneur Richard Branson, is planning to introduce low-cost flights in India.", "The government has given its approval to cheaper and more accessible air travel, with plans for an increased budget carrier industry in the country."], "phi:2.7b": [" Air Deccan has signed an agreement with Avions de Transport Regional (ATR) to acquire 36 planes for less than the catalogue price of $17.6m per plane, which will be delivered over five years.", "The deal is expected to connect regional Indian cities through short haul routes.", "ATR will also provide six second-hand airplanes and work with Air Deccan to create a training center in Bangalore.", "This potential market has attracted businesses at home and abroad, including Ireland's Ryanair and UK entrepreneur Richard Branson.", "India's government has given its support for cheaper air travel."], "orca-mini:3b": [" Air Deccan has signed a deal to acquire 36 planes from Avions de Transport Regional (ATR).", "The deal is valued less than the catalogue price of $17.6m (£9.49m) per plane.", "The planes will connect regional Indian cities and Air Deccan has chosen ATR aircraft for its operations and market."], "hermes3:3b": ["Air Deccan acquires 36 ATR 72-500 planes for less than $17.6m each, connecting regional Indian cities."], "stablelm-zephyr:3b": ["Air Deccan, an Indian low-cost carrier, has signed a deal to acquire 36 planes from Avions de Transport Regional (ATR) for an undisclosed amount, revealing only that the price is less than $17.6 million per plane.", "The new planes will include 15 ATR 72-500s and 15 leases, with six secondhand aircraft provided by ATR.", "Deliveries of the aircraft will commence in 2005 and continue over a five-year period.", "Air Deccan's managing director, Gorur Gopinath, stated that they chose ATR due to its suitability for their operations and the Indian market for short haul routes.", "In addition to the aircraft acquisition, ATR will also work with Air Deccan to establish a training center in Bangalore.", "The potential of the Indian budget market has attracted international interest from companies like Ryanair and local entrepreneurs such as Vijay Mallya's Kingfisher Airlines and Richard Branson's prospective venture.", "India's government supports cheaper and more accessible air travel, fostering growth in this sector."], "chatgpt-4o-latest": ["Air Deccan has signed a deal to acquire 36 planes from Avions de Transport Regional (ATR), including 15 new ATR 72-500, 15 leased aircraft, and six second-hand planes.", "The deal's value remains undisclosed, but the price per plane is below the $17.6 million catalogue price.", "Deliveries will begin in 2005 and continue over five years.", "The airline chose ATR over Bombardier for its suitability for short-haul routes in India and plans to connect regional cities.", "ATR will also help establish a training center in Bangalore.", "India's budget airline market is attracting interest from domestic and international businesses, with Air Deccan modeling itself on Ryanair.", "Other players, including Vijay Mallya's Kingfisher Airlines and Richard Branson, are also exploring opportunities, with government support for affordable air travel."], "stablelm2:1.6b": ["Air Deccan acquired 12 ATR aircraft from Avions de Transport Regional (ATR) for approximately $9 million per plane, with the price agreed being less than the catalog price.", "The new planes will serve regional Indian cities and connect short-haul routes.", "Air Deccan plans to base its business model on European firms like Ryanair, while India's government supports cheaper and accessible air travel."], "granite3.1-dense:2b": ["Air Deccan, India's first low-cost regional airline, has secured a deal with Avions de Transport Regional (ATR) for 36 planes, including 15 new ATR 72-500s and 15 leased models.", "The total value of the agreement remains confidential due to a non-disclosure clause.", "Gorur Gopinath, Air Deccan's managing director, confirmed the purchase price was lower than the catalogue price of $17.6m per plane.", "Deliveries are expected to start in 2005 and span five years.", "ATR will also supply six second-hand aircraft.", "The chosen ATR models are deemed ideal for short-haul Indian routes, according to Gopinath.", "Filippo Bagnato, ATR's CEO, announced plans to collaborate with Air Deccan on establishing a training center in Bangalore.", "The burgeoning potential of India's budget market has garnered interest from both domestic and international investors.", "Companies like Kingfisher Airlines (owned by beer magnate Vijay Mallya) and entrepreneur Richard Branson have entered the scene, aiming to capitalize on this opportunity.", "The Indian government supports the expansion of affordable air travel."]}