{"raw_text": "DaimlerChrysler's 2004 sales rise\n \n US-German carmaker DaimlerChrysler has sold 2.1% more cars in 2004 than in the previous year, as solid Chrysler sales offset a weak showing for Mercedes.\n \n Sales totalled 3.9 million units worldwide during 2004, the company said at the Detroit Motor Show. A switch to new models hit luxury marque Mercedes-Benz, with sales down 3.1% at 1.06 million. Chrysler avoided the fate of US rivals Ford and General Motors, both of whom lost ground to Japanese firms. Its sales rose 3.5% to 2.7 million units.\n \n Similarly on the up was the Smart brand of compact cars, with the division's sales jumping by 21.1% during 2004 to 136,000. The future of the brand - which is controlled by the Mercedes group within DaimlerChrysler - remains in question, however. Smart has consistently lost money since it started trading in 1998, and new model launches are now \"on hold\", said Mercedes chief executive Eckhard Cordes. In Europe, the Smart will now go on sale through regular Mercedes dealerships as well as its own dealer network, Mr Cordes said.\n", "llama3.2:1b": ["DaimlerChrysler sold 2.1% more cars in 2004 than in 2003, with sales of 3.9 million worldwide.", "The company's sales rose by 3.5% to 2.7 million units due to strong Chrysler and Smart brand sales.", "DaimlerChrysler avoided significant losses for US rivals Ford and General Motors by selling more cars."], "llama3.2:3b": ["DaimlerChrysler's sales rose 2.1% in 2004 to 3.9 million units, driven by solid Chrysler sales and a jump of 21.1% for the Smart brand, which will now be sold through Mercedes dealerships."], "gemma2:2b": ["DaimlerChrysler sales increased by 2.1% in 2004 due to strong Chrysler performance.", "While Mercedes-Benz saw a 3.1% decline in sales, Chrysler's sales rose 3.5%.", "The Smart brand experienced a 21.1% increase in sales.", "Future of the Smart brand remains uncertain."], "qwen2.5:0.5b": ["DaimlerChrysler's sales in 2004 increased by 3.5% to 2.7 million units worldwide.", "The company's luxury marque Mercedes-Benz saw a decline of 3.1% to 1.06 million cars sold, while its compact car division Smart saw a 21.1% rise to 136,000 vehicles sold."], "qwen2.5:1.5b": ["DaimlerChrysler's sales increased by 2.1% in 2004 over the previous year, driven by strong Chrysler performance but weaker Mercedes-Benz and Smart brand results."], "qwen2.5:3b": ["DaimlerChrysler's sales rose 2.1% in 2004 compared to the previous year, totaling 3.9 million units worldwide.", "This growth was driven by strong Chrysler sales (up 3.5%) despite a decline of 3.1% for Mercedes-Benz (down to 1.06 million).", "The Smart brand's sales increased by 21.1%, reaching 136,000 units.", "However, the future of the Smart brand remains uncertain due to its consistent losses and current hiatus in new model launches.", "In Europe, Smart will be sold through both Mercedes dealerships and its own network."], "opencoder:1.5b": ["DaimlerChrysler has announced an increased sales figure in 2004, driven by a shift from strong automotive sales to weak Japanese carmakers like Mercedes-Benz.", "The company reported that the new model sales in 2004 were less than in the previous year due to differences between its Japanese counterparts and global automotive trends.", "The sales growth was offset by weaker Japanese car maker sales that continued with Ford and GM, both of whom had lost ground to other car makers like Audi or Lamborghini."], "smollm:1.7b": ["DaimlerChrysler's 2004 sales rise was driven by a strong Chrysler brand and solid sales, offsetting a weak showing for Mercedes.", "The company sold 3.9 million units worldwide during the year, with sales rising 3.1% to 2.7 million units.", "Smart, a subsidiary of DaimlerChrysler controlled by Mercedes, also saw strong sales growth in 2004, increasing 21.1% to 136,000 units.", "The future of Smart, which is currently controlled by the Mercedes group within DaimlerChrysler, remains uncertain.", "The brand has consistently lost money since it started trading in 1998 and new model launches are now \"on hold\", said Cordes.", "In Europe, Smart will go on sale through regular Mercedes dealerships as well as its own dealer network, Mr Cordes added."], "deepseek-r1:1.5b": ["DaimlerChrysler sold 2% more cars than the previous year in 2004, partly offsetting a dip in sales from Mercedes-Benz.", "The total worldwide sales were 3.9 million units at the Detroit Motor Show.", "Mercedes-Benz lost 3.1% and dropped to 1.06 million sales.", "Daimler avoided losing ground to Ford and GM, with 3.5% growth to 2.7 million units.", "Smart's 21.1% rise was mixed, but Mercedes can now sell it via their dealerships in Europe."], "tinyllama:1.1b": ["DaimlerChrusler's 2004 sales rise by 3.5% to 2.7 million units worldwide despite a decrease in sales for luxury marque Mercedes-Benz.", "Sales of its Smart brand, which has seen consistent losses since starting trading in 1998, will now also be sold through regular Mercedes dealership networks, reported DaimlerChrusler.", "However, the Smart brand remains uncertain and may not see any major releases in 2005, as it is under investigation by authorities within the Daimler group."], "tinydolphin:1.1b": [" In a nutshell, the text is about DaimlerChrysler's sales rising in 2004 compared to previous years by 2.1% and selling approximately 3.9 million units, mostly in the US.", "The company highlighted sales of luxury car Mercedes-Benz but failed to sell its own brand Smart.", "However, its competitors like Ford and General Motors saw declines in their sales."], "phi:2.7b": [" DaimlerChrysler sold more cars in 2004 than the previous year, with Chrysler's sales up 3.5% and Mercedes-Benz down 3.1%.", "The division's Smart brand also saw a 21.1% increase in sales to 136,000 units, but its future is uncertain due to consistent losses since its launch in 1998."], "orca-mini:3b": [" DaimlerChrysler sold 3.9 million cars in 2004, a 2% increase from the previous year.", "Chrysler avoided losses like Ford and GM, while sales rose for the compact Smart brand.", "However, the future of the Smart brand is uncertain due to financial losses."], "hermes3:3b": ["DaimlerChrysler 2004 sales increased by 2.1%, Chrysler up 3.5%, Mercedes down 3.1%; total 3.9m units, Smart sales +21.1%, now sold through regular Mercedes dealerships."], "stablelm-zephyr:3b": ["DaimlerChrysler sold 2.1% more cars in 2004 than in 2003, with 3.9 million units worldwide and solid Chrysler sales offsetting a weak showing for Mercedes.", "Sales for Mercedes-Benz were down 3.1% to 1.06 million, while Chrysler's rose 3.5% to 2.7 million.", "The Smart brand experienced a 21.1% increase in sales during 2004, but its future is uncertain as it has consistently lost money since 1998 and new model launches are on hold.", "In Europe, the Smart will now be sold through regular Mercedes dealerships as well as its own dealer network."], "chatgpt-4o-latest": ["DaimlerChrysler's global car sales rose by 2.1% in 2004 to 3.9 million units, driven by strong Chrysler sales, which increased by 3.5% to 2.7 million, offsetting a 3.1% decline in Mercedes-Benz sales to 1.06 million.", "The Smart brand saw a 21.1% sales increase to 136,000 units, but its future remains uncertain due to ongoing financial losses.", "New Smart model launches are on hold, and the brand will now be sold through Mercedes dealerships in Europe."], "stablelm2:1.6b": ["DaimlerChrysler sold 2.1% more cars than the previous year, with solid Chrysler sales offsetting a decline for Mercedes-AMG.", "Total worldwide sales reached 3.9 million units; Ford and General Motors lost ground to Japanese firms while Smart's sales increased by 1%.", "The Smart brand is currently facing uncertainty due to consistent losses."], "granite3.1-dense:2b": ["In 2004, DaimlerChrysler sold 3.9 million vehicles globally, marking a 2.1% increase from the previous year.", "Chrysler's sales surged by 3.5%, reaching 2.7 million units, while Mercedes-Benz saw a 3.1% decline to 1.06 million due to a transition to new models.", "The Smart brand, managed by Mercedes within DaimlerChrysly, experienced a significant 21.1% sales growth to 136,000 units but faces uncertainty as it continues to incur losses and new model launches have been postponed.", "This year, the Smart will be sold through both Mercedes and its own dealer networks in Europe."]}