{"raw_text": "Enron bosses in $168m payout\n \n Eighteen former Enron directors have agreed a $168m (£89m) settlement deal in a shareholder lawsuit over the collapse of the energy firm.\n \n Leading plaintiff, the University of California, announced the news, adding that 10 of the former directors will pay $13m from their own pockets. The settlement will be put to the courts for approval next week. Enron went bankrupt in 2001 after it emerged it had hidden hundreds of millions of dollars in debt.\n \n Before its collapse, the firm was the seventh biggest public US company by revenue. Its demise sent shockwaves through financial markets and dented investor confidence in corporate America.\n \n \"The settlement is very significant in holding these outside directors at least partially personally responsible,\" William Lerach, the lawyer leading the class action suit against Enron, said. \"Hopefully, this will help send a message to corporate boardrooms of the importance of directors performing their legal duties,\" he added. Under the terms of the $168m settlement - $155m of which will be covered by insurance - none of the 18 former directors will admit any wrongdoing. The deal is the fourth major settlement negotiated by lawyers who filed a class action on behalf of Enron's shareholders almost three years ago. So far, including the latest deal, just under $500m (£378.8m) has been retrieved for investors.\n \n However, the latest deal does not include former Enron chief executives Ken Lay and Jeff Skilling. Both men are facing criminal charges for their alleged misconduct in the run up to the firm's collapse. Neither does it cover Andrew Fastow, who has pleaded guilty to taking part in an illegal conspiracy while he was chief financial officer at the group. Enron's shareholders are still seeking damages from a long list of other big name defendants including the financial institutions JP Morgan Chase, Citigroup, Merrill Lynch and Credit Suisse First Boston. The University of California said the trial in the case is scheduled to begin in October 2006. It joined the lawsuit in December 2001alleging \"massive insider trading\" and fraud, claiming it had lost $145m on its investments in the company.\n", "llama3.2:1b": ["Eighteen former Enron directors have agreed a $168m settlement deal over the collapse of the energy firm.", "The University of California is seeking damages for \"massive insider trading\" and fraud.", "The directors will pay $13m from their own pockets, with 10 paying an additional $1.3m each.", "The settlement covers $155m through insurance, leaving out executives Ken Lay, Jeff Skilling, Andrew Fastow, and others facing criminal charges."], "llama3.2:3b": ["Eighteen former Enron directors agree to a $168m settlement with investors, with 10 paying $13m from their own pockets, over allegations of massive insider trading and fraud.", "The settlement does not include former executives Ken Lay and Jeff Skilling or Andrew Fastow, who has pleaded guilty."], "gemma2:2b": ["Eighteen former Enron directors agreed to a $168 million settlement for their role in the company's collapse.", "They will not admit wrongdoing but the settlement is significant because it holds them partially responsible and sends a message about director accountability.", "So far, over $500 million has been recovered for investors through various settlements.", "However, this deal doesn't cover former CEO Ken Lay, Jeff Skilling, or Andrew Fastow who are facing criminal charges.", "The shareholder lawsuit is still ongoing with the trial scheduled to begin in October 2006."], "qwen2.5:0.5b": ["Here's a summary of the text:\n\nEighteen former Enron directors have reached a $168 million settlement deal with the university, agreeing to pay an additional $13 million from their own pockets after they were plaintiffs in a shareholder lawsuit over the firm's financial collapse in 2001.", "The deal is expected to go into court next week and may help send a message to corporate boardrooms about the importance of directors performing their legal duties.", "Former Enron CEO Ken Lay, Jeff Skilling, Andrew Fastow, and others are still seeking damages from major defendants like JP Morgan Chase, Citigroup, Merrill Lynch, and Credit Suisse First Boston."], "qwen2.5:1.5b": ["Eighteen former Enron directors have agreed a $168 million settlement over shareholder lawsuits related to the energy firm's collapse, including an out-of-pocket payment of $13 million by 10 of the directors.", "The deal is part of a larger class action suit against Enron that has recovered nearly $500 million for investors since its inception in 2003."], "qwen2.5:3b": ["Eighteen former Enron directors have agreed a $168 million settlement deal to settle shareholder lawsuits over the firm's collapse.", "The University of California led the lawsuit; 10 directors will pay $13 million from their pockets.", "The settlement, approved by courts next week, aims to hold outside directors accountable for Enron's bankruptcy in 2001, which concealed millions in debt and sent shockwaves through financial markets.", "Despite the deal, criminal charges remain against former CEO Ken Lay and Jeff Skilling, as well as Andrew Fastow's plea guilty.", "Shareholders are still seeking damages from other major defendants like JP Morgan Chase, Citigroup, Merrill Lynch, and Credit Suisse First Boston.", "The University of California joined in December 2001 alleging \"massive insider trading\" and fraud, losing $145 million on Enron investments."], "opencoder:1.5b": ["The Enron settlement deal between the University of California and several former Enron directors has a significant payout of $168 million (£89 million).", "Theplaintiff filed a class action suit against Enron for holding these outside directors at least partially responsible for their illegal actions, including insider trading and fraud.", "It highlights how successful settlements can send messages about the importance of directors performing their legal duties.", "It also hints at potential lawsuits from other big name defendants, including former executives Ken Lay and Jeff Skilling and Andrew Fastow."], "smollm:1.7b": ["The summary should be: Enron's former directors agreed a $168m (£89m) settlement deal with shareholders over the collapse of the energy firm.", "The settlement will be put to the courts for approval next week, and it is significant as it holds these outside directors at least partially personally responsible for their role in the company's downfall."], "deepseek-r1:1.5b": ["Enron's former directors received a $168 million settlement, including ten who will pay $13 million from their own pockets.", "Enron went bankrupt in 2001 after hiding hundreds of millions in debt and was the seventh-largest US company by revenue.", "Shareholders are suing for damages, including big names like JP Morgan Chase, Citigroup, and Andrew Fastow pleaded guilty to illegal conspiracies.", "Four major settlements have been made, with the last not including Ken Lay and Jeff Skilling, who were former CEOs, and neither covered Andrew Fastow, a CFO.", "The trial is set for October 2006."], "tinyllama:1.1b": ["A summary of the Enron scandal from the text material: Enron Bosse's in $168m payout and $155m insurance coverage.", "Eightteen former Enron directors have agreed to a settlement deal in a shareholder lawsuit.", "A total of $500m has been retrieved so far for investors, but the latest deal does not include former Enron CEO Ken Lay and Jeff Skilling, who were accused of misconduct by criminal charges.", "The company also faces damages from other big name defendants such as financial institutions JP Morgan Chase, Citigroup, Merril Lynch, and Credit Suisse First Boston.", "An additional trial to commence in October 2006 is scheduled."], "tinydolphin:1.1b": [" Enron bosses agree to pay $168 million in bonuses after they were named as defendants in a shareholder lawsuit.", "This comes as no surprise given their previous misconduct and involvement in the firm's collapse, which led to widespread bankruptcy for the company.", "The settlement also includes an additional $50 million pay-out to investors who had already recovered some of the missing funds from Enron's stock.", "It is hoped that this will help to send a strong message about the importance of directors fulfilling their legal duties."], "phi:2.7b": [" Eighteen former Enron directors have agreed a $168M settlement deal in a shareholder lawsuit over the firm's collapse.", "The University of California will receive a portion of the payout and some of the former directors will pay from their own pockets.", "The settlement has not been approved by the court yet, but it is a significant step towards holding these outside directors responsible for Enron's misdeeds."], "orca-mini:3b": [" Eighteen former Enron directors have agreed a $168m settlement deal in a shareholder lawsuit over the collapse of the energy firm.", "The settlement will be put to the courts for approval next week.", "Enron went bankrupt in 2001 after it emerged it had hidden hundreds of millions of dollars in debt.", "None of the 18 former directors will admit any wrongdoing, but the deal includes $155m covered by insurance.", "The settlement is significant in holding outside directors partially responsible for the firm's collapse and the trial is scheduled to begin in October 2006."], "hermes3:3b": ["Enron directors agree $168m settlement in shareholder lawsuit over bankruptcy, with 18 former directors paying $13m individually; total $500m recovered for investors."], "stablelm-zephyr:3b": ["Eighteen former Enron directors have agreed to a $168 million settlement deal in a shareholder lawsuit over the energy firm's collapse.", "Ten of the directors will pay $13 million from their own pockets, and the settlement will be put before the court for approval next week.", "This is the fourth major settlement negotiated by lawyers who filed a class-action on behalf of Enron shareholders almost three years ago.", "So far, just under $500 million has been retrieved for investors.", "The University of California, leading plaintiff in the case, alleges \"massive insider trading\" and fraud,\" claiming it had lost $145 million on its investments in the company.", "The lawsuit does not cover former Enron chief executives Ken Lay and Jeff Skilling or Andrew Fastow, who has pleaded guilty to taking part in an illegal conspiracy while he was the group's chief financial officer."], "chatgpt-4o-latest": ["Eighteen former Enron directors have agreed to a $168 million settlement in a shareholder lawsuit over the company's collapse, with $13 million coming from 10 directors personally.", "The deal, pending court approval, does not include former executives Ken Lay, Jeff Skilling, or Andrew Fastow, who face criminal charges.", "Enron, once the seventh-largest U.S. company by revenue, went bankrupt in 2001 after concealing massive debt, shaking investor confidence.", "The settlement, mostly covered by insurance, does not admit wrongdoing but is seen as a warning to corporate boards.", "Lawyers have recovered nearly $500 million for investors, with further claims pending against major financial institutions.", "The University of California, a lead plaintiff, alleges insider trading and fraud, with a trial set for October 2006."], "stablelm2:1.6b": ["Eighteen former Enron directors have agreed to a ££mm settlement in a shareholder lawsuit related to the collapse of the energy firm.", "The settlement will be put to court for approval next week; none of the former directors admit wrongdoing, with $£mm covered by insurance.", "This is the fourth major settlement negotiated by lawyers representing Enron shareholders who filed a class action almost three years ago.", "So far, less than ££mm has been retrieved for investors, including the latest deal.", "The University of California will lead the trial scheduled to begin in October 2016."], "granite3.1-dense:2b": ["Former Enron directors have agreed to a $168 million (£89 million) settlement in a shareholder lawsuit regarding the energy firm's collapse in 2001, with 10 of them pledging to pay $13 million each.", "The University of California announced this deal, which will be presented to courts for approval soon.", "Enron was once the seventh largest US company by revenue before its bankruptcy due to hidden debt.", "This settlement is the fourth significant agreement in a class action led by lawyer William Lerach, who aims to emphasize boardroom responsibilities.", "None of the 18 directors will admit wrongdoing under the terms, and $155 million will be covered by insurance.", "The deal does not involve former CEOs Ken Lay and Jeff Skilling or chief financial officer Andrew Fastow, who pleaded guilty to fraud.", "Enron shareholders continue pursuing damages from institutions like JP Morgan Chase, Citigroup, and Credit Suisse First Boston.", "The trial is scheduled for October 2006."]}