{"raw_text": "India and Iran in gas export deal\n \n India has signed a $40bn (£21bn) deal to import millions of tonnes of liquefied natural gas from Iran.\n \n Firms led by the Oil & Natural Gas Corporation (ONGC) will also assist in the development of Iranian oil fields. Ministers, eager to gain access to energy supplies to meet the demands of a booming economy, secured a similar deal to one between Iran and China. The announcement comes as ONGC said it was in talks to buy former assets of troubled Russian oil firm Yukos. The agreements with Iran were sealed after talks in New Delhi between Middle East producers and Asia's biggest energy consumers - China, India, Japan and South Korea.\n \n Iran - Opec's second-biggest oil producer and one of the world's top gas producers - has been pursuing a series of deals, rewarding LNG buyers with participation in development of its oil fields. Under the agreement, it will supply India with 7.5 million tonnes of LPG annually over a 25 year period from 2009. ONGC and the National Iranian Oil Company (NIOC) reached a preliminary deal for Indian firms to take part in the development of the Yadavaran and Jufeyr oilfields, both countries said in a statement. India's oil production has stagnated over recent years, and it is having to look abroad to secure future supplies. India imports about 70% of its total oil consumption. Consumption has jumped to 2.4 million barrels per day, compared with 474,000 bpd in 1973.\n", "llama3.2:1b": ["India signs $40bn deal for liquefied natural gas from Iran.", "Iran agrees to supply 7.5m tonnes of LPG annually to India over 25 years.", "ONGC and NIOC reach a preliminary agreement for Indian firms to develop Iran's oilfields.", "India imports about 70% of its oil consumption, with consumption increasing by 2.4 million barrels per day."], "llama3.2:3b": ["India has signed a $40bn deal to import 7.5m tonnes of liquefied natural gas from Iran annually over 25 years.", "Indian firms will also assist in the development of Iranian oil fields under the agreement which rewards LNG buyers with participation in oil field development.", "India imports about 70% of its total oil consumption, which has jumped to 2.4 million barrels per day."], "gemma2:2b": ["India and Iran have agreed on a $40 billion deal for the import of liquefied natural gas (LNG) from Iran over a period of 25 years.", "This agreement also includes ONGC assisting in the development of Iranian oil fields.", "The deal comes as India seeks to secure energy supplies amid rapid economic growth.", "It's part of a larger trend of international agreements by Iran for LNG purchase and oil field development, particularly with Asian countries like China, India, Japan, and South Korea."], "qwen2.5:0.5b": ["India and Iran have signed a $40bn deal to import millions of tonnes of liquefied natural gas (LNG) from Iran, with firms led by the Oil & Natural Gas Corporation of India (ONGC).", "The agreement will also help ONGC develop oil fields in Iran.", "China has also negotiated a similar deal with Iran and Russia's Yukos company to buy former assets of its troubled oil firm."], "qwen2.5:1.5b": ["India signs $40 billion deal with Iran for liquefied natural gas and oil field development assistance.", "Deals also announced for ONGC's acquisition of Yukos assets."], "qwen2.5:3b": ["India has signed a $40bn deal with Iran for millions of tonnes of liquefied natural gas imports and development of Iranian oil fields.", "This deal is part of Iran's strategy to secure energy supply from LNG buyers by offering them participation in its oil field development.", "Under the agreement, Iran will supply India 7.5 million tonnes of LPG annually over a 25-year period starting from 2009.", "Indian firms like ONGC are participating in the development of two Iranian oilfields - Yadavaran and Jufeyr.", "India is looking to secure future energy supplies as its production has stagnated, with imports accounting for about 70% of total consumption."], "opencoder:1.5b": ["India and Iran have signed a $40bn deal to import millions of tonnes of liquefied natural gas from Iran.", "ONGC, the Oil & Natural Gas Corporation, will assist in the development of Iranian oil fields.", "The Minister's message, indicating they are in talks, secured a similar deal between Iran and China.", "The deal was sealed at talks in New Delhi by Middle East producers and Asia's biggest energy consumers - China, India, Japan, and South Korea.", "Iran has been gaining popularity for LNG buyers and is one of the world's top gas producers.", "OPEC's second-biggest oil producer and one of the world's major gas producers, Iran has pursued a series of deals, rewarding LNG buyers with participation in development of its oil fields.", "Under the agreement, it will supply India with 7.5 million tonnes of LPG annually over a 25 year period from 2009.", "The agreement with China reached a preliminary deal for Indian firms to take part in the development of the Yadavaran and Jufeyr oilfields, both countries said in a statement."], "smollm:1.7b": ["The summary should preserve the key ideas and details from the original text:\n\n1.", "India and Iran have signed a $40bn deal to import millions of tonnes of liquefied natural gas (LNG) from Iran.", "2.", "Firms led by the Oil & Natural Gas Corporation (ONGC) will also assist in the development of Iranian oil fields.", "Ministers, eager to gain access to energy supplies to meet the demands of a booming economy, secured a similar deal to one between Iran and China.", "The announcement comes as ONGC said it was in talks to buy former assets of troubled Russian oil firm Yukos.", "3.", "Iran - Opec's second-biggest oil producer and one of the world's top gas producers - has been pursuing a series of deals, rewarding LNG buyers with participation in development of its oil fields.", "Under the agreement, it will supply India with 7.5 million tonnes of LPG annually over a 25 year period from 2009.", "ONGC and the National Iranian Oil Company (NIOC) reached a preliminary deal for Indian firms to take part in the development of the Yadavaran and Jufeyr oilfields, both countries said in a statement.", "4.", "India's oil production has stagnated over recent years, and it is having to look abroad to secure future supplies.", "India imports about 70% of its total oil consumption.", "Consumption has jumped to 2.4 million barrels per day, compared with 474,000 bpd in 1973."], "deepseek-r1:1.5b": ["India signed a $40 billion yuan deal with Iran for liquefied natural gas, aiming to enhance access to energy supplies and meet economic demands.", "The agreement is part of a series with China, including talks between Middle East producers and Asian energy consumers in New Delhi.", "ONGC and the National Iranian Oil Company (NIOC) reached a preliminary deal to supply 7.5 million tonnes of LPG annually from 2009 to 2034, while India's oil production has surged since recent years due to reliance on imports.", "Consumption has jumped significantly, reaching 2.4 million barrels per day compared to 474,000 in 1973."], "tinyllama:1.1b": ["India and Iran have signed a $40 billion deal to import millions of tons of gas from Iran for India.", "The firms led by ONGC (Oil & Natural Gas Corporation) will assist in the development of Iranian oil fields, while ministers eagerly seek access to energy supplies to meet demand in the booming Indian economy.", "These deals follow talks between ME producers and Asia's biggest energy consumers - China, India, Japan, and South Korea.", "The agreement with Iran was sealed after months of discussion between Midle East producers and Asian energy consumers, with China, India, Japan, and South Korea at the forefront.", "Iran has been pursuing a series of dealings, rewarding LNG buyers with participation in the development of its oil fields.", "The agreement also sees India importing 7.5 million tons of liquefied natural gas (LNG) annually from Iran for 25 years starting in 2009.", "Indian firm Oil & Natural Gas Corporation (ONGC) and NIOC (National Iranian Oil Company) reached a preliminary deal for Indian firms to take part in the development of two key Iranian oilfields.", "The agreement has seen India importing around 2 million tons of liquefied petroleum gas (LPG) annually from Iran since 2009, with the aim of increasing this capacity to 7.5 million tons by 2015."], "tinydolphin:1.1b": [" India and Iran have signed a $40 billion deal to import millions of tonnes of liquefied natural gas from Iran.", "Firms led by ONGC are involved in this agreement, aiming to boost the economic relations between the two countries.", "The talks took place in New Delhi, where both nations were keen on securing energy supplies to meet the demands of their rapidly growing economies.", "This marks a major move for both OPEC and Iran, as they pursue new trade agreements with Asia's largest consumers.", "India, which currently consumes about 70% of its oil demand, is looking to secure a larger share of Iranian supplies, while Iran is eager to boost its economy by developing its oil fields in partnership with Indian firms."], "phi:2.7b": [" India has signed a $40 billion deal to import millions of tonnes of liquefied natural gas from Iran and will assist in the development of Iranian oil fields.", "The agreements come as ONGC discusses buying assets from the Russian oil firm Yukos."], "orca-mini:3b": [" India and Iran have signed a $40 billion deal for India to import millions of tonnes of liquefied natural gas (LNG) from Iran.", "In addition, ONGC is also involved in the development of Iranian oil fields under the agreement.", "Indian firms will participate in the development of Yadavaran and Jufeyr oilfields.", "India's oil production has stagnated and imports account for over 70% of its total consumption.", "Consumption has increased to 2.4 million barrels per day, compared with 474,000 bpd in 1973.", "The agreements were sealed after talks between Middle East producers and Asia's biggest energy consumers - China, India, Japan, and South Korea."], "hermes3:3b": ["India signs $40B deal to import gas from Iran.", "ONGC to import millions of tonnes of LNG, also participating in Iranian oil field development."], "stablelm-zephyr:3b": ["India has signed a $40bn deal to import millions of tonnes of liquefied natural gas from Iran, with ONGC assisting in the development of Iranian oil fields.", "This agreement is similar to one between Iran and China.", "The deals with Iran were sealed during talks in New Delhi involving Middle East producers and Asia's biggest energy consumers – China, India, Japan, and South Korea.", "Under the agreement, Iran will supply India with 7.5 million tonnes of LPG annually over a 25-year period starting from 2009.", "India's stagnant oil production has led to the country looking abroad for future supplies, and it now imports about 70% of its total oil consumption."], "chatgpt-4o-latest": ["India has signed a $40 billion deal to import 7.5 million tonnes of liquefied natural gas annually from Iran for 25 years starting in 2009.", "Indian firms, led by ONGC, will also help develop Iranian oil fields.", "The agreement follows similar deals Iran has made, offering LNG buyers participation in its oil field development.", "The deal was finalized after talks between Middle Eastern producers and major Asian energy consumers.", "With India's oil production stagnating and 70% of its oil being imported, the country is seeking foreign energy sources to meet rising demand, which has surged to 2.4 million barrels per day."], "stablelm2:1.6b": ["India and Iran have signed a $10 billion deal for India to import millions of tonnes of liquefied natural gas from Iran, with the involvement of Oil & Natural Gas Corporation (ONGC) assisting in Iranian oil field development.", "This agreement follows similar deals between Iran and China and secures access to energy supplies for India's booming economy.", "Iran will supply 7.5 million tonnes of LPG annually over a year period, with ONGC and NIOC reaching a preliminary deal for Indian firms to participate in the development of the Yadavaran and Jufeyr oilfields.", "India is looking to secure future oil production as its production stagnates and imports increase due to economic growth."], "granite3.1-dense:2b": ["India has agreed to a $40bn deal with Iran for the importation of liquefied natural gas (LNG) over 25 years, starting from 2009.", "The Oil & Natural Gas Corporation (ONGC) will facilitate this and also assist in developing Iranian oil fields.", "This agreement mirrors a similar deal between Iran and China.", "India's need for increased energy supplies to support its growing economy led to these negotiations.", "ONGC is concurrently in talks to acquire assets of the bankrupt Russian oil firm Yukos.", "These agreements are part of broader discussions involving Middle East producers and Asia's major energy consumers, including China, India, Japan, and South Korea.", "Iran, OPEC's second-largest oil producer and a significant gas producer, is offering LNG buyers participation in the development of its oil fields as part of these deals.", "India currently imports around 70% of its total oil consumption due to stagnating domestic production, which has increased to 2.4 million barrels per day since 1973."]}