{"raw_text": "Nortel in $300m profit revision\n \n Telecoms equipment maker Nortel Networks has sharply revised downwards its profits for the 2003 fiscal year.\n \n In a long-awaited filing, Nortel said it had made $434m (£231m), compared to the previously reported $732m. But the figures - revised after an audit which led to the sacking of the Canadian firm's chief - showed revenue was about 4% higher than first thought. Nortel shares, which have lost nearly 50% of their value since last year, climbed 1.46% in Toronto on Tuesday. Nortel's head Frank Dunn and two other executives were fired in January last year after the company announced it had conducted the internal audit. Securities and police authorities in both the US and Canada are still conducting inquiries into the accounts.\n \n Nortel also issued new figures for the 2001-2002 period, which they had previously indicated had understated losses. \"With the completion of our restatements we have a solid foundation on which to move forward with our business,\" said Nortel president and chief executive Bill Owens. \"The restatement has been a monumental task, both complex and demanding.\" The company also said 12 senior executives - none of whom were involved directly in the accounting of the revised figures - have voluntarily agreed to repay to bonuses awarded in 2003 totalling $8.6m. Nortel added: \"these members of the core executive team share the board's deep disappointment over the circumstances that led to the restatement.\"\n", "llama3.2:1b": ["Nortel Networks has made $434m profit for the 2003 fiscal year, down from previous reports of $732m.", "The company had revenue higher than expected, at approximately 4% above initial projections.", "Several executives were fired in January last year after internal audits revealed discrepancies.", "Nortel shares rose 1.46% on Tuesday following the announcement, and company president Bill Owens expressed a \"solid foundation\" for moving forward with business."], "llama3.2:3b": ["Nortel Networks has revised its 2003 fiscal year profits from $732m to $434m, a 40% decrease.", "Revenue is 4% higher than initially thought.", "The company's head and two executives were fired after an internal audit.", "New figures for 2001-2002 show understated losses.", "12 senior executives have agreed to repay $8.6m in bonuses."], "gemma2:2b": ["Nortel Networks revised its 2003 profits downwards from $732 million to $434 million, due to an internal audit.", "This resulted in higher revenue figures and a new foundation for the company's business.", "Nortel also issued revised figures for 2001-2002, which previously understated losses.", "12 senior executives will repay bonuses totaling $8.6 million awarded in 2003."], "qwen2.5:0.5b": ["Nortel Networks has reported a downward revision to its profits for the fiscal year 2003.", "The company made $434 million in revenues, up from $732 million earlier reported.", "Revenue growth exceeded expectations, and Nortel shares climbed 1.46% on Tuesday in Toronto.", "Former CEO Frank Dunn and two other executives were sacked after announcing a significant internal audit that led to the company making large accounting adjustments.", "Nortel also issued new financial figures for the 2001-2002 period, which had previously indicated understated losses.", "\"With restatements completed, we have a solid foundation on which to move forward with our business,\" said Nortel president and CEO Bill Owens.", "The company announced it has agreed to pay $8.6 million in bonuses to its senior executives due to the significant accounting adjustments made during the restatement process.", "The new financial figures show Nortel had made $434 million in revenues compared to previous reported amounts of $732 million.", "This is a 4% increase from the first reported figure, which was previously expected but has been revised downwards."], "qwen2.5:1.5b": ["Nortel Networks, an equipment maker, revised its fiscal year profits from $732 million down to $434 million after an internal audit.", "This revision is based on a 4% higher revenue figure compared to previous estimates.", "Nortel's share price increased by 1.", "46%.", "The company has released updated figures for the 2001-2002 period, which have now been fully restated.", "Senior executives agreed to repay $8.", "6 million in bonuses linked to the accounting errors from 2003."], "qwen2.5:3b": ["Nortel Networks has significantly revised its 2003 fiscal year profits from $732m to $434m, with revenue estimated at about 4% higher.", "The revision follows an audit leading to the dismissal of CEO Frank Dunn and other executives in January.", "Nortel's shares rose 1.46% in Toronto post-publication.", "New figures for 2001-2002 indicate understated losses, with Bill Owens stating a solid foundation is now established.", "Additionally, 12 senior executives have agreed to return bonuses totaling $8.6m."], "opencoder:1.5b": ["Nortel in $300 million profit revision\n\nTelecoms equipment maker Nortel Networks has revised profits for the 2003 fiscal year.", "In a later filing, Nortel reported $434 million (roughly $231 million) compared to the previously reported $732 million.", "The figures were revised after an audit which led to the company's sacking of the Canadian firm's chief executive.", "Revenue was about 4% higher than initially thought, and Nortel shares lost nearly 50% of value since last year.", "Nortel's head Frank Dunn and two other executives were fired in January last year as part of a broader audit.", "Securities and police authorities are still conducting inquiries into the accounts.", "Also, Nortel issued new figures for the 2001-2002 period with estimates of losses indicated by the company's previous reports.", "\"The restatement has been a monumental task, both complex and demanding,\" Nortel said in an update to its executive statement.", "The company also noted that 12 senior executives from various departments did not participate in the accounting process for the revised figures.", "The board expressed disappointment with the circumstances leading up to the audit."], "smollm:1.7b": ["Nortel Networks has made a significant loss in its 2003 financial year, with revenue down by 4% compared to the previously reported $732m.", "However, this figure is likely an understatement as the company's internal audit revealed that it had underestimated losses in the previous period.", "The revised figures are based on the completion of restatements and are therefore more accurate than the original numbers.", "The new figures for the 2001-2002 period were also revised, with a higher revenue amount reported by the company.", "This is likely due to the fact that the internal audit revealed errors in the previous year's accounting.", "The company has since apologized to its customers and employees for any inconvenience caused by the restatement process.", "The company's management team has taken steps to address the losses, including issuing new bonuses to 12 senior executives who were involved directly in the accounting of the revised figures.", "This is a step towards rebuilding trust with its stakeholders and improving its financial performance."], "deepseek-r1:1.5b": ["Nortel Networks reported a significant decrease in its 2003 fiscal year profits to $434 million, down from the previously projected $732 million after an internal audit that led to two executives being hired.", "The company also noted that revenue was only about 4% higher than initially expected.", "Nortel shares, which had lost nearly 50% in value over the past year, rebounded by just 1.46% in Toronto on Tuesday.", "Additionally, 12 senior executives were voluntarily repaid bonuses totaling $8.6 million in 2003.", "Despite these positive developments, the company remains under investigation by regulators in both the US and Canada due to concerns over its accounting adjustments."], "tinyllama:1.1b": ["Nortele Networks has revised downwards its profit for fiscal year 2003, with a sharp decline in revenues due to a revision of previously reported figures.", "The company also announced new figures for the same period, which were significantly lower than previous reports.", "Nortele stated that they had understated losses in 2001-2002 and had taken steps to improve their financial standing with the completion of a significant restructuring exercise.", "The company also voluntarily repaid bonus awards given to senior executives who were not directly involved in accounting adjustments, totaling $8.6m.", "Despite these revised figures, Nortele shares gained 1.46% on Tuesday in Toronto after the release of their long-awaited filing.", "Nortele also announced new figures for fiscal year 2003 but admitted that the revision had undersatttled losses.", "However, the company stated that it had a solid foundation upon which to move forward with its business."], "tinydolphin:1.1b": [" In May, Nortel Networks reported a significant drop in its profits for the fiscal year 2003, from $732 million to $434 million.", "This significant drop caused shares in the company to tumble by over 50% since its last trading session in January.", "The audit revealed that Nortel had understated its losses and now reported an estimated loss of $300 million for fiscal year 2003.", "In response to this negative outcome, the company's management team has issued a significant restatement of Nortel's financial statements for both the 2001-2002 period and for fiscal year 2003 itself.", "This revised statement indicates that Nortel had understated its losses by over $300 million.", "In response to this restatement, approximately 12 senior executives voluntarily agreed to repay to their bonuses awarded in 2003 up to $8.6 million each.", "This decision was made in light of the company's disappointing financial performance and management's subsequent need to address the situation and restore credibility in the marketplace.", "The restatement has also resulted in new figures for Nortel's 2001-2002 period, which were reported as being significantly understated before the audit.", "The revised statements indicate that Nortel had reported profits of approximately $434 million during fiscal year 2001 and approximately $732 million during fiscal year 2002, while in reality, Nortel's profit was about 4% higher than the figures originally reported.", "Furthermore, these restatements also led to an increase in revenue for Nortel by approximately 4%.", "This revision has been widely praised by analysts and investors who have been demanding a more accurate reflection of the company's actual financial performance.", "Despite this positive outcome, the stock market still has a negative view of Nortel due to its previous misconduct in relation to the accounting for its fiscal year 2001-2002 period.", "This situation highlights the importance of restatements and the difficulty they pose for companies seeking to regain investor trust after experiencing severe setbacks or scandals."], "phi:2.7b": [" Telecom equipment maker Nortel Networks has significantly revised its profits for the 2003 fiscal year, reporting $434 million instead of the previously reported $732 million.", "Revenue was 4% higher than initially thought.", "The company's auditors discovered a significant issue with their financial statements, leading to the firing of three executives and ongoing investigations by authorities in both the US and Canada.", "Additionally, 12 senior executives have agreed to repay $8.6 million in bonuses awarded in 2003.", "The company acknowledges deep disappointment over the circumstances surrounding the restatement."], "orca-mini:3b": [" Telecom equipment maker Nortel Networks revised down its profits for the 2003 fiscal year, showing revenue was about 4% higher than first thought and making it a solid foundation to move forward.", "The company fired three executives including its CEO and issued new figures for the 2001-2002 period."], "hermes3:3b": ["Nortel reduces 2003 profits to $434m, down from previously reported $732m; revises up revenue by 4%; audit led to CFO and executives' firing."], "stablelm-zephyr:3b": ["Nortel Networks revised its profits for the 2003 fiscal year from $732m to $434m after an internal audit, which also led to the dismissal of two executives.", "Revenue was 4% higher than previously thought, and Nortel's shares gained 1.46% in Toronto.", "The company issued new figures for the 2001-2002 period, acknowledging that the previous losses had been understated.", "Twelve senior executives volunteered to repay $8.6m worth of bonuses awarded in 2003."], "chatgpt-4o-latest": ["Nortel Networks has revised its 2003 profits down from $732m to $434m following an audit that led to the firing of its chief, Frank Dunn, and two other executives.", "Despite the revision, revenue was 4% higher than initially reported.", "Nortel shares rose 1.46% in Toronto, though they have lost nearly 50% of their value since last year.", "Authorities in the US and Canada continue to investigate the company's accounts.", "Nortel also restated figures for 2001-2002, acknowledging previously understated losses.", "CEO Bill Owens emphasized the complexity of the restatement process.", "Additionally, 12 senior executives, not directly involved in the revised accounting, have voluntarily repaid $8.6m in 2003 bonuses, expressing disappointment over the situation."], "stablelm2:1.6b": ["Nortel, a telecom equipment maker, has significantly revised its profit figures for the fiscal year, reporting $4 ($2) million profits compared to the previous $8 ($6) million.", "The revised numbers were as a result of an internal audit which also resulted in the sacking of Nortel's chief executive officer.", "Revenue was found to be 4% higher than initially anticipated.", "Nortel shares have lost nearly 10% since last year, showing a slight increase after they recovered by 1.1% following Tuesday's market data.", "The audit and subsequent inquiry by the US and Canadian authorities are still ongoing as part of investigations into the company's accounts.", "Furthermore, Nortel issued new figures for the fiscal years 2003-2004 which were previously indicated to have understated losses."], "granite3.1-dense:2b": ["Nortel Networks, a telecom equipment manufacturer, revised its 2003 fiscal year profits from $732 million to $434 million following an internal audit.", "This revision resulted in the ousting of CEO Frank Dunn and two other executives.", "Despite the lowered profit estimate, revenue was found to be approximately 4% higher than initially reported.", "Nortel shares, which had lost nearly half their value since last year, saw a 1.46% increase in Toronto on Tuesday.", "The company also adjusted its 2001-2002 period's losses, indicating they were understated.", "Nortel CEO Bill Owens expressed satisfaction with the completion of these restatements, which he described as a complex and demanding task.", "As part of the repayment for bonuses awarded in 2003, 12 senior executives have voluntarily agreed to return $8.6 million.", "The board expressed deep disappointment over the circumstances that led to the restatement."]}