{"raw_text": "Minister hits out at Yukos sale\n \n Russia's renationalisation of its energy industry needs to be reversed, a senior government figure has warned.\n \n Economy minister German Gref told the Kommersant newspaper that direct state involvement in oil was \"unjustified\". His comments follow the sale of much of oil giant Yukos to cover back taxes - a deal which effectively took most of the firm's assets into public ownership. On 28 December, another senior economic adviser called the sale \"the swindle of the century\". Yuganskneftegaz, the unit which produced 60% of Yukos' output, had been seized and sold in December for less than $10bn to a previously unknown firm called Baikal.\n \n Baikal promptly passed into the hands of state-controlled firm Rosneft, itself shortly to merge with state gas giant Gazprom. \"We used to see street hustlers do this kind of thing,\" Andrei Illarionov - then economic adviser to President Vladimir Putin - told a press conference. \"Now officials are doing it.\" Within days, he was stripped of most of his responsibilities.\n \n Mr Gref, a well-known opponent of nationalisation in competitive parts of the market, was keen to distance himself from Mr Iliaronov's comments. The privatisation of companies such as Yukos in the 1990s had been badly handled, he said. But he stressed that the government needed to get out of oil. \"I think that Rosneft and Yuganskneftegaz, should it become a state-owned company, must be privatized,\" he said.\n \n \"Today our government is ineffective and state companies, as a result, are for the overwhelming part ineffective as well.\" And he warned that using back taxes to deal with firms like Yukos - a technique now being applied by the Kremlin to several other firms - was a mistake. \"If we follow that logic, we should nationalise all businesses,\" he said. Many large Russian companies, particularly in the energy sector, use complex webs of offshore companies to avoid taxes.\n \n Mr Gref also poured cold water on President Putin's promises of doubled economic growth within a decade. The assault on Yukos' assets has been widely blamed for a slowdown in economic growth in recent months. \"The task is not simply to double GDP; instead it is to use GDP to qualitatively improve people's lives,\" Mr Gref told Kommersant. \"We don't need simply to increase GDP, but to improve its structure.\" Instead of focusing on headline growth figures, Russia needed to focus on better institutions, such as a more efficient - and less corrupt - court system.\n", "llama3.2:1b": ["Russian Minister German Gref has warned that the government's renationalisation efforts must be reversed after the sale of oil giant Yukos to cover back taxes.", "The sale was seen as \"the swindle of the century\" by another senior economic adviser, Andrei Illarionov, who called it a \"mistake\"."], "llama3.2:3b": ["Russia's economy minister German Gref warned that the renationalization of the energy industry needs to be reversed.", "He criticized the sale of Yukos oil giant's assets to cover back taxes, calling it \"unjustified\".", "Gref also expressed concerns about President Putin's promise of doubled economic growth within a decade and stated that Russia needed to focus on improving institutions rather than just increasing GDP."], "gemma2:2b": ["Russia's renationalization of the energy industry is being criticized by Economy Minister Gref who believes it should be reversed.", "The sale of Yukos assets, including Yuganskneftegaz, was criticized for bypassing proper legal procedures and enriching the state at the expense of private companies.", "Gref sees privatization as the solution to improve efficiency in the energy sector while emphasizing the need for a less corrupt court system and better economic institutions to achieve genuine growth rather than just increasing GDP figures."], "qwen2.5:0.5b": ["A senior Russian economic adviser warned that the government needs to nationalize large Russian companies, including oil firms Yukos.", "He said this is necessary because nationalization would help raise people's lives and boost GDP growth.", "The government has already sold much of Yukos' oil to the state-controlled firm Rosneft for less than $10 billion."], "qwen2.5:1.5b": ["Russian energy industry privatization reversed; senior minister criticizes Yukos sale for back taxes and nationalizing state-owned firms."], "qwen2.5:3b": ["Russia's economy minister has warned against direct state involvement in oil, citing the sale of much of Yukos—a move that effectively took most of the firm's assets into public ownership—as an example.", "This follows the sale of Yuganskneftegaz, another key unit, to a state-controlled entity Rosneft at below market value.", "The minister criticizes the privatization of companies like Yukos and uses back taxes against firms, suggesting this tactic may result in nationalization of all businesses if continued.", "He also calls for improving institutions rather than focusing solely on GDP growth."], "opencoder:1.5b": ["The President hit back at the sale of Yukos, which was a business worth billions of dollars.", "The sale involved disposing of the company's assets in December, after which Baikal took over, effectively selling it to a previously unknown entity known as Rosneft.", "Rosneft, a state-controlled gas and oil trading firm, merged with Gazprom, a major gas company in the 1980s.", "The key difference was that the former was owned by Russia while the latter was owned by the Federal Reserve Bank of New York.", "The President grumbled about the privatization of companies like Yukos in the 1980s and declared it as an ineffective measure.", "He stressed that the government needed to focus on strategic initiatives rather than direct control over assets.", "However, Mr Gref, a former opponent of nationalisation, was also grinning at the president's comments.", "He called for a nationalization strategy that would ensure economic peace and reduce dependence on Russia for generating global power.", "And he said that it would not be necessary to use back taxes to neutralize the company - this tactic is widely used by the Kremlin to improve businesses.", "The President offered cold water as a deterrent against economic growth, as well as pointed out the importance of creating efficient government institutions like a more streamlined court system.", "The focus was on creating a future where we could expect more rapid economic growth and better governance."], "smollm:1.7b": ["The summary is concise and objective, preserving the key ideas and details of the original text while omitting any explanations or justifications.", "The main points are:\n\n1.", "Minister hits out at Yukos sale: Russia's renationalisation of its energy industry needs to be reversed, a senior government figure has warned.", "2.", "Economy minister German Gref told the Kommersant newspaper that direct state involvement in oil is \"unjustified\".", "His comments follow the sale of much of oil giant Yukos to cover back taxes - a deal which effectively took most of the firm's assets into public ownership.", "On 28 December, another senior economic adviser called the sale \"the swindle of the century\".", "Yuganskneftegaz, the unit which produced 60% of Yukos' output, had been seized and sold in December for less than $10bn to a previously unknown firm called Baikal.", "3.", "Baikal passed into the hands of state-controlled firm Rosneft: The privatisation of companies such as Yukos in the 1990s had been badly handled, he said.", "But he stressed that the government needed to get out of oil.", "\"I think that Rosneft and Yuganskneftegaz, should it become a state-owned company, must be privatized,\" he said.", "4.", "Mr Gref, a well-known opponent of nationalisation in competitive parts of the market: The privatisation of companies such as Yukos in the 1990s had been badly handled, he warned.", "But he stressed that using back taxes to deal with firms like Yukos - a technique now being applied by the Kremlin to several other firms - was a mistake.", "5.", "Russia's economy needs to be improved: The task is not simply to double economic growth within a decade; instead it is to use GDP to qualitatively improve people's lives, Mr Gref told Kommersant.", "He doesn't need simply to increase GDP, but to improve its structure.", "Instead of focusing on headline growth figures, Russia needs to focus on better institutions, such as a more efficient - and less corrupt - court system."], "deepseek-r1:1.5b": ["The summary should include the following key points:\n\n1.", "Government warnings against renationalizing energy sectors due to state involvement.", "2.", "Sale of major oil company Yukos by state-controlled firm Rosneft.", "3. criticism of economic advisor Andrei Illarionov calling the sale a swindle.", "4.", "Gref's opposition and focus on privatization efforts.", "5. mention of government's need to nationalize businesses.", "6. criticism that double-digit economic growth is being promoted despite specific issues."], "tinyllama:1.1b": ["A senior government figure has criticized the recent sale of Russia's energy giant YuKaZ by state-controlled firm Rosneft, arguing that it was not justifiable given previous attempts to nationalize these firms.", "Economy minister German Gref warned that using back taxes as a means of resolving companies like YuKaZ should be avoided, saying the Kremlin's approach would have a detrimental effect on the country's economy.", "President Vladimir Putin promised doubled economic growth within a decade in his New Year address, but several large Russian companies are using complex webs of offshore companies to avoid taxes.", "Economist Andrei Illarionov called for improved institutions, not just focus on headline growth figures, to improve Russia's economy."], "tinydolphin:1.1b": [" The statement from the Ministry of Economy states that Russian authorities have made significant progress in addressing back taxes, but criticizes the government for pursuing policies that could affect future economic growth.", "The text mentions several key points:\n1.", "Russia's renationalization of oil assets is seen as an unfair move.", "2.", "Officials have been accused of mismanagement and corruption in the past.", "3.", "The state should not use back taxes to acquire businesses, but rather invest in infrastructure and education for future growth.", "4.", "President Putin's promises of doubled economic growth are seen as a potential roadblock to these efforts.", "5.", "Instead, the government should focus on improving institutions such as a more efficient court system for better governance and more equitable financial practices."], "phi:2.7b": [" The Russian government's renationalisation of the energy industry has been criticised by senior officials who believe that direct state involvement in oil is unjustified.", "This comes after the sale of Yukos, an oil giant, to cover back taxes, which was sold at a fraction of its true value to Baikal, a previously unknown firm controlled by Rosneft, another state-owned gas company.", "Andrei Illarionov, an economic adviser to President Putin, called this \"the swindle of the century\".", "The government needs to get out of oil and privatise companies like Yuganskneftegaz, which was seized and sold for less than $10 billion, Mr Gref said.", "He warned that using back taxes to deal with firms like Yukos is a mistake and advocated for a more effective use of GDP to improve people's lives rather than just increasing it.", "The government should focus on better institutions such as a more efficient court system."], "orca-mini:3b": [" Minister criticizes the sale of Yukos oil firm and calls for privatization of Rosneft and Yuganskneftegaz.", "The government should get out of oil and back taxes should not be used to deal with firms like Yukos, warns Gref.", "President Putin's promise of doubled economic growth is not achievable, according to Gref.", "Instead of focusing on GDP growth, Russia needs to focus on improving the structure of the economy by improving institutions such as court system."], "hermes3:3b": ["Russia's energy minister opposes renationalization of oil industry, criticizing Yukos sale as unjustified, uncompetitive nationalizations likely to follow, focuses on improving economic structure over just GDP growth."], "stablelm-zephyr:3b": ["Russia's economy minister, German Gref, has warned that the renationalisation of the energy industry must be reversed, stating that direct state involvement in oil is \"unjustified\".", "His comments follow the sale of major oil firm Yukos to cover back taxes, which many viewed as a swindle.", "Gref distanced himself from previous economic adviser Andrei Illarionov's criticism of nationalisation and highlighted that using back taxes to deal with problematic firms was a mistake.", "He also dismissed President Putin's promises of doubled economic growth within a decade, emphasising the need for better institutions instead."], "chatgpt-4o-latest": ["Russia's Economy Minister German Gref criticized the renationalization of the energy industry, calling state involvement in oil \"unjustified\" and advocating for the privatization of Rosneft and Yuganskneftegaz.", "His comments followed the controversial sale of Yukos assets to cover back taxes, which led to their transfer to state-controlled Rosneft.", "Another senior adviser, Andrei Illarionov, condemned the sale as \"the swindle of the century\" and was later stripped of most of his responsibilities.", "Gref warned that using back taxes to seize companies like Yukos was a flawed approach and argued that state-run firms were largely ineffective.", "He also dismissed President Putin's economic growth targets, attributing the recent slowdown to the Yukos affair and emphasizing the need for institutional reforms over mere GDP expansion."], "stablelm2:1.6b": ["Russia's energy industry should be nationalized, according to an Economy minister who warns that direct state involvement in oil is \"unjustified\".", "German Gref commented on the Yukos sale which took most of the firm’s assets into public ownership; a deal that effectively resulted in Yuganskneftegaz, a unit producing 25% of Yukos' output being seized and sold for less than $1bn to an unknown firm called Baikal.", "These sales have been criticized as the \"swindle of the century\"."], "granite3.1-dense:2b": ["Russia's Economy Minister German Gref criticized the recent renationalization of Yukos' assets, which were sold to cover back taxes.", "He argued that direct state involvement in oil is \"unjustified\" and called for the privatization of Rosneft (which acquired Yuganskneftegaz) and any other state-owned energy companies.", "Gref distanced himself from a previous statement by economic adviser Andrei Illarionov, who dubbed the sale \"the swindle of the century.\"", "He emphasized that the current government is ineffective, and state companies are similarly inefficient due to poor management during the 1990s privatization process.", "Gref also criticized the use of back taxes to seize private assets, suggesting it could lead to further nationalization if applied consistently.", "He dismissed President Putin's pledge for doubled economic growth within a decade, arguing that improving Russia's institutions and reducing corruption is crucial for better living standards."]}