{"raw_text": "US prepares for hybrid onslaught\n \n Sales of hybrid cars in the US are set to double in 2005, research suggests.\n \n Research group JD Power estimates sales will hit 200,000 in 2005, despite higher prices and customer scepticism. Carmakers are starting to build hybrid sports utility vehicles (SUVs), the four-wheel-drive vehicles which now dominate the US car market. Hybrids cut both petrol consumption and emissions by combining a petrol engine with an electric motor constantly kept charged by extra engine power. Several jurisdictions, notably the state of California, mandate low emissions for new cars. Equally, the rise in oil prices over the past year has sparked hopes that consumers may be tempted by potential savings of a few hundred dollars a year on fuel.\n \n At the Detroit Motor Show, a range of manufacturers are prominently displaying their hybrid credentials. Toyota has led the market to date with the Prius, popularised by a number of celebrities keen to burnish their \"green\" credentials. In April it will launch a hybrid version of its Highlander SUV, with an SUV from its luxury Lexus marque due later in the year.\n \n Honda has three hybrids on the market, and between them the two Japanese carmakers sold more than 80,000 units last year. Ford, which has sold 4,000 of its first hybrid since its launch in August, is bringing a hybrid SUV - the Mariner - to market a year ahead of schedule, with plans for three more models by 2008. GM has a hybrid pickup on the market and is showing two concept SUVs in Detroit. Even sports car maker Porsche may join the race, although it insists it is still considering whether to hybridise its Cayenne SUV.\n \n Others remain more sceptical. Nissan has bought Toyota's hybrid technology, but plans to bring out its first model only in 2006. \"We want to make sure we are not concentrating on one technology,\" Nissan chief executive Carlos Ghosn said. \"We will not be surprised by any acceleration or deceleration in the hybrid market.\" Volkswagen, meanwhile, says it will focus on clean-burning diesel engines instead. And some watchers point out that the price tag on a hybrid - upwards of $3,000 above that of an equivalent normal-engined car, and suspicion of the technology - may still cool its attraction. \"The average consumers aren't willing to pay that premium for a car they won't drive more than six years,\" said Anthony Pratt from JD Power.\n", "llama3.2:1b": ["US prepares for hybrid onslaught with sales expected to double in 2005.", "Research suggests hybrid cars will sell 200,000 units in 2005, despite higher prices and customer scepticism.", "Many manufacturers are launching or improving their hybrid offerings, including Toyota's Prius, Honda's three models, Ford's Mariner SUV, and GM's two concept SUVs.", "Hybrid sales are expected to continue growing as oil prices rise and regulatory mandates tighten.", "However, some carmakers remain skeptical about the technology's long-term appeal, citing high prices and potential consumer unwillingness to pay for it."], "llama3.2:3b": ["US sales of hybrid cars are expected to double in 2005 to 200,000 units, driven by increased demand and lower oil prices.", "Toyota is leading the market with its Prius, while Honda has sold over 80,000 hybrids last year.", "Ford plans to bring out a hybrid SUV early and GM has two concept SUVs on display.", "Nissan is acquiring Toyota's hybrid technology but will release its first model in 2006, while Volkswagen focuses on clean-burning diesel engines."], "gemma2:2b": ["Hybrid car sales in the US are expected to double by 2005, driven by factors such as rising fuel prices and government mandates for low emissions.", "Major car manufacturers like Toyota, Honda, Ford, GM, and even Porsche are investing heavily in hybrid vehicles, with several models already on the market or in development.", "Despite growing interest, some companies remain cautious about the technology's long-term viability and price point."], "qwen2.5:0.5b": ["Key points:\n\n- US sales of hybrid cars are expected to double in 2005.", "- Carmakers starting to build hybrid SUVs like the Prius.", "- Some manufacturers have hybrids on the market, and Honda has three models.", "- Nissan bought Toyota's hybrid technology but plans to introduce its first model only in 2006."], "qwen2.5:1.5b": ["US sales of hybrid cars are set to double in 2005 due to increased prices and skepticism, with Toyota leading the market with its Prius and Honda selling more than 80,000 hybrids last year.", "Car manufacturers including Ford and GM are also developing hybrids, though some remain cautious about the technology's long-term impact on the hybrid market."], "qwen2.5:3b": ["US prepares for hybrid onslaught with expected sales doubling to 200,000 in 2005.", "Hybrid cars, which cut both petrol consumption and emissions by combining an electric motor with a petrol engine kept charged via extra engine power, are being adopted by carmakers including Toyota (with Prius) and Honda.", "The rise in oil prices is expected to prompt consumers towards potential fuel savings of $300-$400 annually.", "California mandates low emissions for new cars.", "While the market shows promising growth, skepticism remains due to higher initial costs ($3,000 above normal-engined car) and lingering doubt about the technology's effectiveness."], "opencoder:1.5b": ["US prepares for hybrid onslaught\n\nSales of hybrid cars in the US are set to double in 2005, research suggests.", "Carmakers are starting to build hybrid sports utility vehicles (SUVs), the four-wheel-drive vehicles which now dominate the US car market.", "Hybrids cut both petrol consumption and emissions by combining a petrol engine with an electric motor constantly kept charged by extra engine power.", "Several jurisdictions, notably the state of California, mandate low emissions for new cars.", "Equally, the rise in oil prices over the past year has sparked hopes that consumers may be tempted by potential savings of a few hundred a year on fuel.", "At the Detroit Motor Show, a range of manufacturers are prominently displaying their hybrid credentials.", "Toyota has led the market to date with the Prius, popularised by a number of celebrities keen to burnish their \"green\" credentials.", "Ford, which has sold 4,000 of its first hybrid since its launch in August, is bringing a hybrid SUV - the Mariner - to market a year ahead of schedule, with plans for three more models by 2008.", "GM has a hybrid pickup on the market and is showing two concept SUVs in Detroit.", "Other manufacturers remain more sceptical.", "Nissan has bought Toyota's hybrid technology, but plans to bring out its first model only in 2006.", "\"We want to make sure we are not concentrating on one technology,\" Nissan chief executive Carlos Ghosn said.", "\"We will not be surprised by any acceleration or deceleration in the hybrid market.\"", "Volkswagen, meanwhile, says it will focus on clean-burning diesel engines instead.", "Volkswagen's intention is to make the hybrid industry more accessible and sustainable.", "The cars are designed with efficiency in mind, replacing gasoline with electric power, and they use 85% less energy than traditional hybrids."], "smollm:1.7b": ["US prepares for hybrid onslaught"], "deepseek-r1:1.5b": ["US automakers are preparing for a booming hybrid market with sales expected to double in 2005.", "Hybrid SUVs dominate the US car market, cutting emissions and improving fuel efficiency.", "States require low emissions on new cars, driven by rising oil prices.", "Brands like Toyota, Honda, Ford, GM, and Porsche are introducing hybrids.", "Some automakers hesitate due to high costs and technology concerns, while others leverage hybrid tech for their vehicles."], "tinyllama:1.1b": ["Sales of hybrid cars in the US are set to double in 2005, according to a report by research group JD Power.", "The report suggests that carmakers are starting to build hybrid SUVs as more consumers become interested in saving fuel and reducing emissions, particularly after recent increases in oil prices.", "Several jurisdictions, such as California, mandate low-emission requirements for new cars, which has prompted some manufacturers to focus on the hybrid market rather than the conventional gasoline or diesel engine models.", "Despite concerns about premium pricing, some watchers point out that clean-burning diesel engines may still appeal, and hybrids are expected to gain popularity as average consumers become more willing to pay for eco-friendly vehicles."], "tinydolphin:1.1b": [" Hybrid cars are predicted to dominate the US automotive market by 2005, with sales set to hit 200,000 units in 2005.", "Despite higher prices and customer scepticism, carmakers have started building hybrid SUVs such as the Toyota Highlander.", "The rising oil prices have encouraged consumers to consider low-emissions cars like hybrids.", "In response, JD Power has estimated that sales of these vehicles will increase by 160% in 2005 compared to 2004.", "Despite the increasing popularity of hybrid technology, some critics predict a slowdown or even retreat from this innovative form of automotive design."], "phi:2.7b": [" Hybrid cars are expected to become more popular in the US in 2005 due to higher sales, lower emissions, and reduced fuel consumption.", "Several car manufacturers are showcasing their hybrid capabilities at a recent auto show, but some companies remain skeptical about the technology's appeal.", "While Toyota has been leading the market with its Prius, other Japanese automakers like Honda and Ford have also sold more than 80,000 units.", "Nissan plans to bring out its first hybrid model in 2006, while Volkswagen plans to focus on clean-burning diesel engines instead.", "However, some experts suggest that the higher price tag and lack of driving satisfaction may dampen consumer interest."], "orca-mini:3b": [" The US is expected to double sales of hybrid cars in 2005, according to research by JD Power.", "Carmakers are starting to build hybrid SUVs due to the popularity of these vehicles in the US car market.", "Several jurisdictions, such as California, require low emissions for new cars.", "However, higher prices and customer skepticism may make consumers hesitant to purchase hybrids despite their potential savings on fuel.", "Sales of hybrid cars have already exceeded 80,000 units last year, but some manufacturers still have doubts about the technology.", "Others, such as Nissan and Volkswagen, prefer diesel engines instead."], "hermes3:3b": ["US preps for double hybrid car sales (200k in 2005), amid higher prices & scepticism; various firms display hybrids, including Toyota's Prius, as California mandates low emissions & rising oil prices encourage potential fuel savings."], "stablelm-zephyr:3b": ["US hybrid car sales are predicted to double in 2005, reaching 200,000 units, according to research group JD Power.", "Automakers such as Toyota, Honda, Ford, and GM are starting to produce hybrid sports utility vehicles (SUVs) and displaying their hybrid credentials at events like the Detroit Motor Show.", "However, some companies, like Nissan and Volkswagen, remain more cautious about incorporating hybrids into their product lines.", "Despite higher prices and customer skepticism, there is potential for savings on fuel due to rising oil prices, which may contribute to increased sales."], "chatgpt-4o-latest": ["Sales of hybrid cars in the US are expected to double in 2005, reaching 200,000 units despite higher prices and consumer scepticism.", "Automakers are expanding hybrid offerings, particularly in the SUV segment, to meet demand for fuel efficiency and lower emissions, driven by rising oil prices and regulatory requirements.", "Toyota leads the market with the Prius and plans hybrid SUVs under its Toyota and Lexus brands.", "Honda has three hybrids, while Ford is accelerating its hybrid SUV rollout.", "GM and Porsche are also exploring hybrid options.", "However, some manufacturers, like Nissan and Volkswagen, remain cautious, citing high costs and uncertain consumer demand.", "Analysts note that the price premium and concerns over hybrid technology may limit widespread adoption."], "stablelm2:1.6b": ["US prepares for double the sales of hybrid cars in five years due to decreasing customer skepticism and higher prices, with automakers building hybrid sports utility vehicles (SUVs).", "Toyota leads the market with popularized hybrids like the Prius, while Honda has three hybrids on the market.", "Ford plans three more hybrid models by 2025, and GM has a hybrid pickup on the market with two concept SUVs in Detroit.", "Nissan's first hybrid model will be released in 2026, while Volkswagen focuses on clean-burning diesel engines.", "Despite skepticism about hybrid technology, some experts predict that the average consumer is not willing to pay the premium price for a car they won't drive more than six years."], "granite3.1-dense:2b": ["US hybrid car sales are projected to double in 2005, reaching approximately 200,000 units, according to research firm JD Power.", "Despite higher prices and consumer skepticism, carmakers are investing heavily in hybrid technology, particularly for SUVs due to their market dominance.", "Hybrid vehicles combine gasoline engines with electric motors to reduce fuel consumption and emissions.", "Mandates from jurisdictions like California and rising oil prices have fueled consumer interest in potential annual savings of a few hundred dollars on fuel.", "Leading the market is Toyota, which has gained popularity through celebrity endorsements and its Prius model.", "Other notable participants include Honda (3 hybrid models sold in 2004), Ford (with plans for three more hybrid SUVs by 2008), and GM (marketed with a hybrid pickup and concept SUVs).", "Porsche may also enter the market, though it remains uncertain.", "Nissan, having acquired Toyota's hybrid technology, will introduce its first model in 2006 rather than earlier.", "Nissan aims to diversify its engine options, not focusing solely on hybrids.", "Volkswagen, instead of pursuing hybrids, is concentrating on clean-burning diesel engines.", "Some analysts caution that the high cost and consumer skepticism might deter average buyers from embracing hybrid technology due to its limited lifespan."]}