{"raw_text": "BA to suspend two Saudi services\n \n British Airways is to halt its flights from London Heathrow to Jeddah and Riyadh in Saudi Arabia from 27 March.\n \n The airline said the decision was a commercial one due to reduced passenger demand for the services. BA currently operates four flights per week from Heathrow to Jeddah, and three weekly journeys to Riyadh. It suspended flights to Saudi Arabia for three weeks in autumn 2003 after a government warning about a \"threat to UK aviation interests in Saudi Arabia\".\n \n BA will now suspend the Saudi flights - which it says will remain \"under constant review\" - from 27 March. \"The decision to suspend flights between the UK and Saudi Arabia is a difficult one to make as we have enjoyed a long history of flying between the two countries,\" said BA director of commercial planning, Robert Boyle. \"However, the routes don't currently make a profitable contribution to our business and we are unable to sustain them while this remains the case.\" Passengers with flights booked after the suspension date will be contacted by BA for alternative arrangements to be made.\n", "llama3.2:1b": ["British Airways will suspend flights from London Heathrow to Jeddah and Riyadh in Saudi Arabia from March 27 due to reduced demand, but these services are \"under constant review\".", "The airline says it is halting the routes as they no longer make a profitable contribution to its business.", "Passengers with booked flights will be contacted for alternative arrangements by March 31."], "llama3.2:3b": ["British Airways is suspending its flights from London Heathrow to Jeddah and Riyadh in Saudi Arabia starting March 27, citing reduced passenger demand and a desire to sustain unprofitable routes."], "gemma2:2b": ["British Airways is suspending flights from London Heathrow to Jeddah and Riyadh in Saudi Arabia on March 27th, citing reduced passenger demand.", "This decision follows a history of previous suspensions related to aviation safety concerns.", "The airline states that the routes are not profitable and will remain under review.", "Passengers booked after the suspension date will be contacted for alternative arrangements."], "qwen2.5:0.5b": ["BA has decided to halt flights from Heathrow to Saudi Arabia starting on 27 March, suspending operations of four weekly flights from Jeddah and three daily visits to Riyadh.", "Key points:\n- BA has suspended flights between the UK and Saudi Arabia.", "- BA plans to resume flights in August after suspension.", "- The decision is a commercial one due to reduced passenger demand for services."], "qwen2.5:1.5b": ["British Airways suspends two Saudi Arabia flights from Heathrow due to reduced passenger demand, following similar decision in 2003.", "The suspension is effective March 27th, while routes will continue under review.", "Passengers affected may receive alternative booking information."], "qwen2.5:3b": ["British Airways is suspending its flights from London Heathrow to Jeddah and Riyadh in Saudi Arabia, effective March 27th.", "The decision is commercial due to reduced passenger demand; previously suspended in autumn 2003 after a government warning.", "Currently operating four weekly flights to Jeddah and three to Riyadh, BA will review the Saudi routes regularly.", "Passengers with affected bookings will be contacted for alternative arrangements."], "opencoder:1.5b": ["BA to suspend two Saudi services\n\nBritish Airways is to halt its flights from London Heathrow to Jeddah and Riyadh in Saudi Arabia from 27 March.", "The decision was a commercial one due to reduced passenger demand for the services.", "BA currently operates four flights per week from Heathrow to Jeddah, and three weekly journeys to Riyadh.", "It suspended flights to Saudi Arabia for three weeks in autumn 2003 after a government warning about a \"threat to UK aviation interests in Saudi Arabia\".", "BA will now suspend the Saudi flights - which it says will remain \"under constant review\" - from 27 March.", "\"The decision to suspend flights between the UK and Saudi Arabia is a difficult one to make as we have enjoyed a long history of flying between the two countries,\" said Robert Boyle.", "However, the routes don't currently make a profitable contribution to our business and we are unable to sustain them while this remains the case.", "Passengers with flights booked after the suspension date will be contacted by BA for alternative arrangements to be made."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details from the original text.", "It does not include explanations or additional information that may be relevant to the context of the text.", "The summary only includes the main points and does not provide any additional context or analysis."], "deepseek-r1:1.5b": ["BA will suspend two Saudi services, Heathrow to Jeddah and Riyadh.", "Currently, there are four weekly flights from Heathrow to Jeddah and three weekly flights to Riyadh.", "The suspension starts on March 27th due to reduced passenger demand.", "BA said the decision is commercial in nature as flight routes near profitability issues.", "Passengers booked after March 26 will be contacted by BA for alternative arrangements."], "tinyllama:1.1b": ["BA has announced it will halt two flights from London Heathrow to Jeddah and Riyahd from March 27th due to reduced demand for services.", "The airline suspended the routes for three weeks in fall 2003 after the government warned of a \"threat\" to UK aviation interests in Saudi Arabia.", "BA will now suspend flights between the UK and the two countries from March 27th and will continue to review the situation.", "Passengers with flight reservations have been contacted for alternative arrangements, but there is no further information on whether passengers will be refunded or given additional options."], "tinydolphin:1.1b": [" BA has decided to suspend its services between London Heathrow and Jeddah, Saudi Arabia from 27 March due to reduced demand on these flights.", "The airline initially operated four flights per week from Heathrow to Jeddah and three weekly journeys to Riyadh before stopping service in autumn 2003 due to a government warning regarding potential threats to UK aviation interests in Saudi Arabia.", "BA will now suspend these routes until further notice."], "phi:2.7b": [" British Airways is suspending its London Heathrow-Jeddah and London Heathrow-Riyadh flights in Saudi Arabia from 27 March due to reduced passenger demand.", "This decision was made as a commercial one, following a similar suspension in 2003 after a government warning about the \"threat to UK aviation interests in Saudi Arabia\".", "The airline will review the situation on 27 March and may resume the services depending on profitability.", "Passengers with affected flights will be contacted for alternative arrangements."], "orca-mini:3b": [" British Airways is halting its flights from London Heathrow to Jeddah and Riyadh in Saudi Arabia from March 27th due to reduced passenger demand.", "The decision was made due to the airline's financial constraints.", "The airline had previously suspended these flights in the autumn of 2003 after a government warning about a threat to UK aviation interests in Saudi Arabia."], "hermes3:3b": ["British Airways suspends flights from London Heathrow to Jeddah, Riyadh starting 27th March due to reduced passenger demand."], "stablelm-zephyr:3b": ["British Airways has decided to suspend its flights from London Heathrow to Jeddah and Riyadh in Saudi Arabia, starting on March 27th.", "The airline cites reduced passenger demand as the reason for this commercial decision.", "They previously suspended similar flights in 2003 due to a government warning about a threat to UK aviation interests in Saudi Arabia.", "BA will continue to review these flights but expects them not to make a profitable contribution to their business.", "Passengers with booked flights after March 27th will be contacted by British Airways for alternative arrangements."], "chatgpt-4o-latest": ["British Airways will suspend its flights from London Heathrow to Jeddah and Riyadh from 27 March due to reduced passenger demand.", "The airline currently operates four weekly flights to Jeddah and three to Riyadh.", "BA previously suspended flights to Saudi Arabia for three weeks in 2003 following a government warning about threats to UK aviation interests.", "The decision, described as difficult, is based on the routes' lack of profitability.", "The suspension will remain under review, and affected passengers will be contacted for alternative arrangements."], "stablelm2:1.6b": ["British Airways has suspended two Saudi services from London Heathrow due to reduced passenger demand.", "The airline operates four weekly flights to Jeddah and three journeys per week to Riyadh, but these routes won't continue given they don't currently make a profitable contribution to the business.", "BA will suspend flights between UK and Saudi Arabia until March after previously halting them for three weeks in autumn 2019 due to a government warning about threats to UK aviation interests in Saudi Arabia.", "Passengers affected by the suspension will be contacted with alternative arrangements from the suspended date."], "granite3.1-dense:2b": ["British Airways (BA) is discontinuing its London Heathrow-to-Jeddah and Riyadh flights in Saudi Arabia, effective 27 March.", "This decision is commercial, stemming from insufficient profitability for these routes despite past operations of four weekly Jeddah flights and three per week to Riyadh.", "BA previously halted Saudi flights for three weeks in autumn 2003 due to a government threat to UK aviation interests.", "Despite the difficulty, BA's director of commercial planning, Robert Boyle, affirmed that the routes do not contribute profitably to the company and cannot be sustained at present.", "Passengers with bookings post-suspension will receive alternative arrangements."]}