{"raw_text": "Lesotho textile workers lose jobs\n \n Six foreign-owned textile factories have closed in Lesotho, leaving 6,650 garment workers jobless, union officers told the AP news agency.\n \n Factory Workers Union secretary general Billy Macaefa blamed the closures on the end of worldwide textile quotas. The quotas for developing nations, ended on 1 January, gave them a set share of the rich countries' markets. They also limited the amount countries like China could export to the big markets of the United States and EU.\n \n \"We understand that some (owners)... were complaining that the South African rand was strong against the US dollar, and they were losing when exporting textiles and clothing to the United States,\" Mr Macaefa said at a news briefing in the capital, Maseru. Lesotho's currency, the maloti, is fixed to the rand. \"But we suspect that they left the country unceremoniously because of the end of quotas introduced by the World Trade Organization.\" He said the six factories were Leisure Garments, Modern Garments, Precious Six Garments, TW Garments, Lesotho Hats and Vogue Landmark. The owners - two from Taiwan, two from China, one from Mauritius and one from Malaysia - left over the December holiday period without informing or paying their employees, he said.\n \n Union leaders and trade campaigners have been warning that developing nations such as Lesotho, Sri Lanka, and Bangaldesh could lose thousands of jobs once the quotas were lifted. In the mountainous country surrounded by South Africa, it is feared as many as 50,000 textile workers could lose their jobs, and Mr Mafeca said he expected more companies to leave. The assistance of a US law had given Lesotho's textiles duty-free access to North American markets. The African Growth and Opportunity Act (AGOA), gave sub-Saharan countries preferential access to the US market for apparel and textile products as well as a wide range of other goods. A Lesotho government news briefing is expected on Wednesday.\n", "llama3.2:1b": ["Lesotho textile workers lose jobs due to foreign-owned factories closing after worldwide textile quotas ended, leaving 6,650 garment workers jobless.", "Factory Workers Union secretary general Billy Macaefa blames owners for leaving country unceremoniously without informing or paying employees.", "The closure of six factories - Leisure Garments, Modern Garments, Precious Six Garments, TW Garments, Lesotho Hats, and Vogue Landmark - could lead to 50,000 textile workers losing their jobs in the country."], "llama3.2:3b": ["Six foreign-owned textile factories in Lesotho have closed, leaving 6,650 garment workers jobless due to the end of worldwide textile quotas, which limited developing nations' access to rich countries' markets, and the strong South African rand against the US dollar."], "gemma2:2b": ["Six foreign-owned textile factories in Lesotho have closed, leaving 6,650 garment workers jobless due to the end of worldwide textile quotas.", "These closures were likely driven by increased competition and financial losses for the factories as a result of the quotas ending.", "Unions blame the owners for leaving abruptly without warning or payment."], "qwen2.5:0.5b": ["Lesotho's six factories have closed, leaving 6, 650 garment workers unemployed.", "Union leaders blame quotas from developed nations like the United States, EU and South Africa for losing jobs at the factories.", "The unions fear developing nations such as Lesotho, Sri Lanka, Bangalaland and others could lose thousands of jobs if these quotas are lifted."], "qwen2.5:1.5b": ["Six foreign-owned textile factories in Lesotho have closed, leaving 6,650 garment workers jobless due to the end of global textile quotas effective January 1st.", "Workers suspect that owners left unceremoniously without informing or paying them after the US dollar's strength against the rand ended textile quotas introduced by the World Trade Organization."], "qwen2.5:3b": ["Lesotho's six foreign-owned textile factories have closed, leaving 6,650 garment workers jobless.", "Union officers attribute the closures to the end of worldwide textile quotas that ended on January 1st.", "The quotas provided developing nations like Lesotho a set share of rich countries' markets and limited China's exports.", "Factory Workers Union Secretary General Billy Macaefa suggests owners left due to strong South African rand against the US dollar, but they likely left after quotas were lifted by the World Trade Organization.", "The closures affect six factories: Leisure Garments, Modern Garments, Precious Six Garments, TW Garments, Lesotho Hats, and Vogue Landmark, with two from Taiwan, two from China, one from Mauritius, and one from Malaysia.", "Union leaders warn up to 50,000 textile workers could lose their jobs as quotas are lifted, and Macaefa expects more companies to leave.", "Lesotho benefited from US law AGOA for duty-free access to North American markets.", "A government briefing is expected on Wednesday."], "opencoder:1.5b": ["The six foreign-owned textiles factories in Lesotho have closed leaving 6,650 garment workers jobless.", "During the week leading up to this event, union officers from various sectors including factory workers union secretary general Billy Macaefa blamed the closures for the end of the worldwide textile quotas.", "The government announced that developing nations like Lesotho could lose thousands of jobs due to the restrictions imposed on them by the World Trade Organization's (WTO) quotas.", "According to the news, a US law was instituted to provide a range of textiles duty-free access to North American markets, which further solidifies the country's position as a defiant in terms of job loss."], "smollm:1.7b": ["The summary should preserve key ideas and details, including:\n\n1.", "The six foreign-owned textile factories that closed in Lesotho, leaving 6,650 garment workers jobless.", "2.", "The end of worldwide textile quotas for developing nations, which limited their ability to export textiles and clothing to the United States and EU markets.", "3.", "The impact on Lesotho's textile industry, with a loss of jobs estimated at around 50,000 workers.", "4.", "The role of the World Trade Organization (WTO) in introducing quotas that affected the Lesotho textile industry.", "5.", "The assistance provided by the US law to give Lesotho's textiles duty-free access to North American markets.", "6.", "The African Growth and Opportunity Act (AGOA), which gave sub-Saharan countries preferential access to the US market for apparel and textile products as well as a wide range of other goods."], "deepseek-r1:1.5b": ["Lesotho textile factories closed due to global quotas ending, affecting 6,650 garment workers.", "Workers lost their jobs as owners left without informing or paying them during a holiday period.", "The rand's strength against the US dollar contributed to layoffs.", "warns that some developing nations could lose thousands of jobs if quotas were lifted, supported by tools like AGOA and free access via the US law."], "tinyllama:1.1b": ["Lesotho's six foreign-owned textile factories have closed, leaving around 6,650 garment workers jobless, according to the Union Officers of the Textile Workers Union (TWU).", "The quota system for developing nations, which ended in January, has led to some companies leaving the country unceremoniously.", "Lesotho's currency, the maloti, is fixed to the rand, and some owner companies left over the December holiday period without informing or paying their employees.", "Trade campaigners have warned that developing nations such as Lesotho could lose thousands of jobs once the quotas are lifted.", "The government news briefing is expected on Wednesday to provide details on the impact of AGOA and AGOA."], "tinydolphin:1.1b": [" The Six Foreign-owned Textile Factories in Lesotho have closed due to the end of World Trade Organization (WTO) quotas, affecting approximately 6,650 garment workers' jobs.", "The owners, including foreign entities, blamed these closures on the reduced supply of raw materials and export markets for their products.", "The textile industry in Lesotho has seen rapid economic growth over recent years, with an increase in production from both local and foreign-owned factories.", "However, the end of WTO quotas is expected to lead to job losses, as more countries impose tariffs on the products being exported.", "This could result in a loss of thousands of jobs for the textile workers in Lesotho, who rely heavily on their employers for income and survival."], "phi:2.7b": [" Six foreign-owned textile factories in Lesotho closed, leaving 6,650 garment workers jobless.", "The closures were due to the end of worldwide textile quotas which gave developing nations like Lesotho a set share of the markets of developed countries.", "Owners blame the end of quotas for their loss and left the country unceremoniously without paying or informing employees.", "The union leaders and trade campaigners warn that developing nations could lose thousands of jobs when the quotas are lifted, and Mr Macaefa expects more companies to leave Lesotho after the closures."], "orca-mini:3b": [" Six foreign-owned textile factories in Lesotho closed down, leaving 6,650 garment workers jobless.", "The closure was due to the end of worldwide textile quotas.", "The owners left the country without informing or paying their employees during the December holiday period, which could have led to the loss of thousands of jobs in the textiles industry.", "Union officers and trade campaigners have been warning that developing nations such as Lesotho, Sri Lanka, and Bangladesh could lose thousands of jobs once the quotas were lifted."], "hermes3:3b": ["Lesotho textile factories close, leaving 6,650 workers jobless due to end of worldwide textile quotas."], "stablelm-zephyr:3b": ["Six foreign-owned textile factories in Lesotho closed, leaving 6,650 garment workers jobless.", "The closures were attributed to the end of worldwide textile quotas, which limited export opportunities in the US and EU markets.", "Union leaders warned that developing nations could lose thousands of jobs as a result.", "Lesotho's textiles had benefited from the African Growth and Opportunity Act (AGOA), giving duty-free access to North American markets."], "chatgpt-4o-latest": ["Six foreign-owned textile factories in Lesotho have closed, leaving 6,650 workers jobless.", "Factory Workers Union secretary general Billy Macaefa attributed the closures to the end of global textile quotas, which had previously protected developing nations' market shares.", "Some factory owners also cited the strong South African rand against the US dollar as a financial challenge.", "The owners, from Taiwan, China, Mauritius, and Malaysia, left without informing or compensating employees.", "Union leaders had warned that lifting the quotas could lead to massive job losses in countries like Lesotho, Sri Lanka, and Bangladesh.", "In Lesotho, up to 50,000 textile jobs are at risk.", "The African Growth and Opportunity Act (AGOA) had provided duty-free access to US markets, but more companies are expected to leave.", "A government briefing is scheduled for Wednesday."], "stablelm2:1.6b": ["Foreign-owned textile factories in Lesotho have closed, leaving 6 garment workers jobless due to the end of worldwide textile quotas.", "Union officers blame the closures on the end of quotas introduced by the World Trade Organization.", "Six factories, owned by two companies from Taiwan, two from China, and one each from Mauritius and Malaysia, left without informing or paying their employees during the holiday period in December.", "The loss of jobs could be significant as developing nations such..\n```python\n{\n  \"output\": [\n    {\n      \"text\": \"Foreign-owned textile factories have closed in Lesotho, leaving 6 garment workers jobless, union officers told the AP news agency.\"", "},\n    {\n      1: \"Factory Workers Union secretary general Billy Macaefa blamed the closures on the end of worldwide textile quotas.", "The quotas for developing nations, ended on 1 January, gave them a set share of the rich countries' markets.", "They also limited the amount countries like China could export to the big markets of the United States and EU.\"", "},\n    {\n      \"text\": \"Union leaders and trade campaigners have been warning that developing nations such as Lesotho, Sri Lanka, and Bangladesh could lose thousands of jobs once the quotas were lifted.\"", "},\n    {\n      \"text\": \"In the mountainous country surrounded by South Africa, it is feared as many as  textile workers could lose their jobs, and Mr Mafeca said he expected more companies to leave.\"", "},\n    {\n      \"text\": \"The assistance of a US law had given Lesotho's textiles duty-free access to North American markets.", "The African Growth and Opportunity Act (AGOA), gave sub-Saharan countries preferential access to the US market for apparel and textile products as well as a wide range of other goods.\"", "},\n    {\n      \"text\": \"A Lesotho government news briefing is expected on Wednesday.\"", "}\n  ]\n}\n\"\n  }\n}\n```"], "granite3.1-dense:2b": ["Six foreign-owned textile factories in Lesotho, employing 6,650 workers, have shut down due to the end of worldwide textile quotas by the World Trade Organization (WTO) on January 1st.", "Union officials attribute this closure to financial difficulties caused by the strong South African rand and limited export opportunities in the US market.", "The factories' owners, from Taiwan, China, Mauritius, Malaysia, and one from an unspecified country, abandoned their employees during the December holiday period without proper notice or payment.", "Union leaders predict that up to 50,000 textile workers in developing nations like Lesotho could be jobless as a result of these quota removals.", "These closures are expected to sever duty-free access for sub-Saharan countries under the African Growth and Opportunity Act (AGOA), further impacting local textile industries."]}