{"raw_text": "Khodorkovsky quits Yukos shares\n \n Jailed tycoon Mikhail Khodorkovsky has transferred his controlling stake in oil giant Yukos to a business partner.\n \n Mr Khodorkovsky handed over his entire 59.5% stake in holding company Group Menatep - which controls Yukos - to Leonid Nevzlin. A close ally of the ex-Yukos boss, Mr Nevzlin is currently based in Israel. Mr Khodorkovsky handed over his stake after the forced sale of Yukos' core oil production unit, Yuganskneftegaz to pay a giant tax bill.\n \n Yuganskneftegaz was sold off at auction in December last year, eventually falling into the hands of state oil firm Rosneft in a deal worth $9.4bn (£5bn). \"Since the sale of Yuganskneftegaz, I have been delivered of (all) responsibility for the business that remains and the group's money as a whole,\" Mr Khodorkovsky said. \"It is all over. As before, I see my future in public activity to build a civil society in Russia.\" Mr Nevzlin is Yukos' largest shareholder but is living in self-imposed exile in Israel. Yuganskneftegaz pumps around 1 million barrels of oil a day. It was sold by the Russian authorities to recover government tax claims against Yukos totalling over $27bn. Previously considered to be Russia's richest man, with an estimated fortune of $15bn, Mr Khodorkovsky is currently on trial for fraud and tax evasion following his arrest in October 2003. However, the charges are widely seen as politically motivated and part of a drive by Russian President Vladimir Putin to rein in the country's super-rich business leaders, the so-called oligarchs. It is also believed that Mr Khodorkovsky was particularly targeted because he had started to bankroll political opponents of Mr Putin.\n", "llama3.2:1b": ["Mikhail Khodorkovsky transfers controlling stake in Yukos oil company to Leonid Nevzlin, a close ally and business partner.", "This move comes after the forced sale of Yuganskneftegaz by state-owned Rosneft at a $9.4 billion price tag.", "Khodorkovsky has handed over his 59.5% share, ceding responsibility for Yukos' remaining assets to Nevzlin, who is living in self-imposed exile in Israel and pumps around 1 million barrels of oil per day from Yuganskneftegaz."], "llama3.2:3b": ["Mikhail Khodorkovsky has transferred his 59.5% stake in Group Menatep, controlling Yukos, to Leonid Nevzlin, a close ally, following the forced sale of Yuganskneftegaz oil production unit for $9.4bn to pay a $27bn tax bill."], "gemma2:2b": ["Mikhail Khodorkovsky has transferred his controlling stake in Yukos to Leonid Nevzlin.", "This transfer follows the sale of Yukos' core oil production unit, Yuganskneftegaz, to Rosneft for $9.4 billion.", "Khodorkovsky now considers his future to be involved in public activity building a civil society in Russia.", "Khodorkovsky is currently on trial for fraud and tax evasion.", "He faces charges widely seen as politically motivated and part of an effort by Putin to control Russian oligarchs, particularly those who supported opposition to him."], "qwen2.5:0.5b": ["Mikhail Khodorkovsky transferred his control of Yukos oil company to Leonid Nevzlin, who now controls 59.5% of the shares.", "Yukos' core oil production unit was sold to Rosneft for $9.4 billion in a deal that involved paying off a huge tax bill, as reported by Alia.", "This sale disrupted Mr Khodorkovsky's business relationship with Yukos, as well as his future in public activity.", "He was arrested on October 2003 and is currently facing charges of fraud, tax evasion, and the alleged involvement in political figures' money laundering schemes."], "qwen2.5:1.5b": ["Russian tycoon Mikhail Khodorkovsky has transferred control of Yukos shares to Leonid Nevzlin, his business partner, after selling core oil production unit Yuganskneftegaz to Rosneft in a $9.4 billion deal."], "qwen2.5:3b": ["Mikhail Khodorkovsky transferred his 59.5% stake in holding company Group Menatep (which controls Yukos) to business partner Leonid Nevzlin after selling Yukos' core oil production unit Yuganskneftegaz at an auction for $9.4bn.", "The sale was aimed at paying off a large tax bill.", "Khodorkovsky now sees no responsibility in the remaining Yukos business and plans future public activities to build civil society in Russia.", "Nevzlin, who is currently living in Israel as a self-imposed exile, is Yukos' largest shareholder.", "Khodorkovsky's initial wealth was estimated at $15bn but he faces fraud and tax evasion charges that are politically motivated, with Putin's aim to curb super-rich oligarchs like him, notably due to his support for opposition figures."], "opencoder:1.5b": ["Khodorkovsky quit Yukos shares \n\nJailed tycoon Mikhail Khodorkovsky has transferred his controlling stake in oil giant Yukos to a business partner.", "Mr Khodorkovsky handed over his entire 59.5% stake in holding company Group Menatep - which controls Yukos - to Leonid Nevzlin.", "A close ally of the ex-Yukos boss, Mr Nevzlin is currently based in Israel.", "Mr Khodorkovsky handed over his stake after the forced sale of Yukos' core oil production unit, Yuganskneftegaz to pay a giant tax bill.", "Yuganskneftegaz was sold off at auction in December last year, eventually falling into the hands of state oil firm Rosneft in a deal worth $9.4bn (£5bn).", "\"Since the sale of Yuganskneftegaz, I have been delivered of all responsibility for the business that remains and the group's money as a whole,\" Mr Khodorkovsky said.", "\"It is all over.", "As before, I see my future in public activity to build a civil society in Russia.\"", "Mr Nevzlin is Yukos' largest shareholder but is living in self-imposed exile in Israel.", "Yuganskneftegaz pumps around 1 million barrels of oil a day.", "It was sold by the Russian authorities to recover government tax claims against Yukos totalling over $27bn.", "Previously considered to be Russia's richest man, with an estimated fortune of $15bn, Mr Khodorkovsky is currently on trial for fraud and tax evasion following his arrest in October 2003.", "However, the charges are widely seen as politically motivated and part of a drive by Russian President Vladimir Putin to rein in the country's super-rich business leaders, the so-called oligarchs.", "It is also believed that Mr Khodorkovsky was particularly targeted because he had started to bankroll political opponents of Mr Putin."], "smollm:1.7b": ["Khodorkovsky quits Yukos shares"], "deepseek-r1:1.5b": ["Khodorkovsky transferred 59.5% of Group Menatep, controlling Yukos, to Leonid Nevzlin after selling Yuganskneftegaz in December last year.", "The transaction involved $9.4 billion, and all responsibilities were passed over.", "The sale was part of recovering tax claims against Yukos totaling $27 billion.", "After selling Yuganskneftegaz, the company's management, including Khodorkovsky, agreed to stop operating.", "The charges for fraud and evasion are politically motivated, targeting super-rich oligarchs, possibly due to financial conflicts with Russia's President."], "tinyllama:1.1b": ["According to news reports, jailed tycoon Mikhail Khodorkovsky has transferred his control over the holding company Group Menatep to business partner Leonid Nevzlin.", "Prior to this transfer, Mr Khodorkovsky held a majority stake in the firm which controls Yuka's oil production unit, Yu-Ganskneftegaaz.", "After the forced sale of Yuka's core production unit for $9.4bn in December last year, Mr Khodorkovsky handed over his entire 59.5% stake to Nevzlin.", "The move was seen as a bid by Russian authorities to punish him for alleged tax evasion and fraud.", "In February 2010, Mr Khodorkovsky went on trial in relation to these charges but the case is widely believed to have been politically motivated to target his political opponents.", "He remains in custody, facing up to ten years in prison if found guilty of fraud."], "tinydolphin:1.1b": [" Khodorkovsky, a wealthy Russian entrepreneur and philanthropist, handed over his controlling stake in oil giant Yukos to a business partner, Leonid Nevzlin.", "This transfer marks the end of an era for Khodorkovsky and marks a significant shift in Russia's political landscape as well.", "While this move may have been influenced by Kremlin pressure, it has also been driven by Khodorkovsky's desire to pursue a more public-facing career after being forced to sell his stake due to tax evasion charges."], "phi:2.7b": [" In December 2021, Mikhail Khodorkovsky handed over his controlling stake in Yukos oil giant's holding company Group Menatep to Leonid Nevzlin, a close ally and business partner.", "This came after the forced sale of Yuganskneftegaz, the core oil production unit, at auction for 9.4 billion dollars to pay off tax claims against Yukos.", "The Russian authorities have been targeting wealthy business leaders like Khodorkovsky, who they believe are political threats."], "orca-mini:3b": [" Jailed tycoon Mikhail Khodorkovsky transferred his controlling stake in oil giant Yukos to a business partner, Leonid Nevzlin, after the forced sale of Yuganskneftegaz to pay a giant tax bill.", "It is all over for Mr Khodorkovsky as he sees his future in public activity to build a civil society in Russia."], "hermes3:3b": ["Khodorkovsky transfers Yukos control to Nevzlin, after selling Yuganskneftegaz to pay tax bill (~$27bn)."], "stablelm-zephyr:3b": ["Mikhail Khodorkovsky transferred his 59.5% stake in Group Menatep, which controls oil giant Yukos, to business partner Leonid Nevzlin after selling Yuganskneftegaz to pay a tax bill.", "Nevzlin is Yukos' largest shareholder and currently lives in Israel.", "Khodorkovsky's fortune was reduced from $15bn to $9bn following his arrest in 2003 on fraud and tax evasion charges, which many believe are politically motivated."], "chatgpt-4o-latest": ["Jailed tycoon Mikhail Khodorkovsky has transferred his 59.5% controlling stake in Yukos' holding company, Group Menatep, to business partner Leonid Nevzlin, who is in self-imposed exile in Israel.", "The move follows the forced sale of Yukos' core oil unit, Yuganskneftegaz, to state oil firm Rosneft for $9.4bn to cover a massive tax bill.", "Khodorkovsky, once Russia’s richest man, is on trial for fraud and tax evasion, though the charges are widely seen as politically motivated, linked to his support for opponents of President Vladimir Putin.", "He now intends to focus on public activism in Russia."], "stablelm2:1.6b": ["Jailed tycoon Mikhail Khodorkovsky has transferred his 5% stake in Yukos to Leonid Nevzlin, after the forced sale of its oil production unit for tax recovery.", "The transfer follows his resignation and handing over all responsibilities for Yukos and Group Menatep.", "This news was published after the $9.4bn (£5bn) acquisition by state firm Rosneft, which acquired Yuganskneftegaz in December 2018.", "Mr Khodorkovsky is on trial for fraud and tax evasion following his arrest in October 2013; however, these are seen as politically motivated actions against the oligarchs targeted by Russian President Vladimir Putin."], "granite3.1-dense:2b": ["Mikhail Khodorkovsky, a jailed Russian tycoon and former CEO of Yukos oil company, has transferred his 59.5% controlling stake in the holding company Group Menatep, which owns Yukos, to Leonid Nevzlin, a close ally residing in Israel.", "This transfer occurred after Yuganskneftegaz, a core subsidiary of Yukos, was sold at auction in December 2014 for $9.4 billion (£5 billion) to Rosneft, the state oil firm.", "Khodorkovsky relinquished all responsibility for Yukos and Group Menatep, viewing his future as public engagement in building a civil society in Russia.", "Nevzlin is now the largest shareholder of the group.", "Previously, Khodorkovsky was deemed Russia's richest person with an estimated fortune of $15 billion; however, he is currently on trial for fraud and tax evasion, charges perceived as politically motivated by President Vladimir Putin to curtail the wealth of Russian oligarchs.", "Khodorkovsky's support for political opponents of Putin may have also contributed to his targeting.", "Yuganskneftegaz produces approximately 1 million barrels of oil daily, and its sale was intended to settle over $27 billion in tax claims against Yukos."]}