{"raw_text": "News Corp eyes video games market\n \n News Corp, the media company controlled by Australian billionaire Rupert Murdoch, is eyeing a move into the video games market.\n \n According to the Financial Times, chief operating officer Peter Chernin said that News Corp is \"kicking the tires of pretty much all video games companies\". Santa Monica-based Activison is said to be one firm on its takeover list. Video games are \"big business\", the paper quoted Mr Chernin as saying. We \"would like to get into it\".\n \n The success of products such as Sony's Playstation, Microsoft's X-Box and Nintendo's Game Cube have boosted demand for video games.\n \n The days of arcade classics such as Space Invaders, Pac-Man and Donkey Kong are long gone. Today, games often have budgets big enough for feature films and look to give gamers as real an experience as possible. And with their price tags reflecting the heavy investment by development companies, video games are proving almost as profitable as they are fun. Mr Chernin, however, told the FT that News Corp was finding it difficult to identify a suitable target. \"We are struggling with the gap between companies like Electronic Arts, which comes with a high price tag, and the next tier of companies,\" he explained during a conference in Phoenix, Arizona. \"These may be too focused on one or two product lines.\"\n", "llama3.2:1b": ["News Corp eyes entering video games market, citing demand from big business and success of consoles such as Sony's Playstation, Microsoft's X-Box, and Nintendo's Game Cube.", "CEO Peter Chernin identifies Activision as a potential target firm for takeover."], "llama3.2:3b": ["News Corp is considering investing in the video games market, citing its profitability and popularity, but finding it difficult to identify suitable targets due to varying price tags and product line focus of potential companies."], "gemma2:2b": ["News Corp is exploring opportunities in the video game market.", "The company is evaluating various game companies, including Activision, and sees potential for growth.", "The success of major gaming consoles like PlayStation, Xbox, and Game Cube has fueled demand for video games.", "Despite their substantial budgets, video games are proving profitable due to their immersive experiences.", "News Corp faces challenges in identifying a suitable target company within the video game market."], "qwen2.5:0.5b": ["News Corp plans to buy Activision for $15 billion, but says it needs more time.", "Activision sells games like Pac-Man, which made them popular before video games became big business.", "Video games are fun and cost as much as real-life movies and give gamers a better gaming experience than arcade games.", "However, News Corp has trouble finding a target because some companies make huge prices while others have smaller budgets."], "qwen2.5:1.5b": ["News Corp is considering entering the video games market following Sony's PlayStation, Microsoft's Xbox, and Nintendo's GameCube successes, which have created high demand and profitability opportunities."], "qwen2.5:3b": ["News Corp, controlled by Rupert Murdoch, is considering entering the video games market.", "CEO Peter Chernin has examined most video game companies, with Activision being a potential target.", "Video games are now big business, with high-budget productions aiming to replicate real experiences.", "Successful titles like PlayStation's, Xbox's, and Nintendo's GameCube have boosted demand.", "However, identifying a suitable acquisition is difficult due to the price tags of established companies and the need for companies focused on niche products."], "opencoder:1.5b": ["News Corp is eyeing a move into the video games market, according to the Financial Times.", "The company has reported that it is seeing increased interest from video game manufacturers like Activison.", "Companies such as Sony's Playstation, Microsoft's X-Box and Nintendo's Game Cube have driven significant market demand for gaming consoles.", "The success of these products, along with other console titles like Pac-Man and Donkey Kong, have fueled demand and have led to a shift in consumers' entertainment preferences."], "smollm:1.7b": ["News Corp is eyeing a move into the video games market.", "According to the Financial Times, chief operating officer Peter Chernin said that News Corp is \"kicking the tires of pretty much all video games companies\".", "Santa Monica-based Activision is said to be one firm on its takeover list.", "Video games are \"big business\", the paper quoted Mr Chernin as saying.", "We \"would like to get into it\".", "The success of products such as Sony's PlayStation, Microsoft's Xbox and Nintendo's GameCube have boosted demand for video games.", "The days of arcade classics such as Space Invaders, Pac-Man and Donkey Kong are long gone.", "Today, games often have budgets big enough for feature films and look to give gamers as real an experience as possible.", "And with their price tags reflecting the heavy investment by development companies, video games are proving almost as profitable as they are fun.", "Mr Chernin, however, told the FT that News Corp was finding it difficult to identify a suitable target.", "\"We are struggling with the gap between companies like Electronic Arts, which comes with a high price tag, and the next tier of companies,\" he explained during a conference in Phoenix, Arizona.", "\"These may be too focused on one or two product lines.\""], "deepseek-r1:1.5b": ["News Corp is eyeing a move into the video games market, particularly targeting companies like Activison from Santa Monica.", "They believe this move will capitalize on the \"big business\" nature of video games, with brands such as Sony's PlayStation, Microsoft's X-Box, and Nintendo's Game Cube boosting demand.", "However, the paper notes that arcade classics are outdated, while modern games are being sought after for their high budgets and graphics, offering gamers a more authentic experience akin to films.", "Despite higher costs, these video games prove profitable and fun.", "Chernin suggests they're struggling with the gap between companies like Electronic Arts, which have high prices, and others focused on a few product lines."], "tinyllama:1.1b": ["News Corp is eyeing a move into the video games market.", "Chief operating officer Peter Chernin told the Financial Times that the company is \"kipping the tires of pretty much all video games companies\", and it would like to get into it.", "The success of products such as Sony's Playstation, Microsoft's X-Box, and Nintendo's GameCube has boosted demand for video games, with developers investing big budgets in creating realistic experiences for gamers.", "Video games look to be almost as profitable as they are fun, but News Corp is finding it difficult to identify a suitable target, given the range of companies available."], "tinydolphin:1.1b": [" News Corp is considering entering the video games market through its subsidiary, Vivendi, which owns the popular franchise series Grand Theft Auto and has a partnership with Electronic Arts.", "CEO Peter Chernin reportedly stated that they would like to \"get into it,\" implying their interest in entering the gaming industry is substantial.", "The success of these companies such as Sony's PlayStation, Microsoft's X-Box, and Nintendo's GameCube has had a significant impact on the market, driving up demand for video games.", "As a result, profitable opportunities are increasingly available, making it an attractive investment for News Corp."], "phi:2.7b": [" News Corp is considering entering the video games market due to its growing popularity and profitability.", "However, they are struggling to identify a suitable target as they have different price tags than established gaming companies like Electronic Arts."], "orca-mini:3b": [" News Corp is exploring the video games market by looking at various companies, including Activision, which is reportedly on their takeover list.", "Video games are a large and profitable industry, and companies are investing heavily in development to create immersive experiences for gamers.", "However, finding a suitable target can be challenging for News Corp due to the high price tags of some development companies."], "hermes3:3b": ["News Corp looks to enter video game market, aims to find suitable target between big and mid-sized developers."], "stablelm-zephyr:3b": ["News Corp, controlled by Rupert Murdoch, is interested in entering the video games market.", "COO Peter Chernin mentions that they are \"kicking the tires of pretty much all video games companies\" and identifies Activision as one potential takeover target.", "The success of major gaming platforms like Sony's PlayStation, Microsoft's Xbox, and Nintendo's GameCube has made the industry a significant profit opportunity.", "However, according to Chernin, News Corp is finding it challenging to identify a suitable target due to the high price tags of companies like Electronic Arts and the focus on one or two product lines of other companies."], "chatgpt-4o-latest": ["News Corp, led by Rupert Murdoch, is exploring entry into the video games market.", "COO Peter Chernin stated they are evaluating various gaming companies, with Activision among potential targets.", "He highlighted the industry's profitability, driven by high-budget games on platforms like PlayStation, Xbox, and GameCube.", "However, News Corp faces challenges in finding a suitable acquisition, as major firms like Electronic Arts are expensive, while smaller companies may lack diversity in their offerings."], "stablelm2:1.6b": ["News Corp plans to enter the video games market due to its success and profitability.", "According to COO Peter Chernin, they are considering taking over companies like Activison for potential acquisition.", "Video games have become an \"big business,\" with popular brands such as Playstation, X-Box, and Nintendo dominating.", "The article highlights that arcade classics have given way to more realistic gaming experiences and high-budget products.", "However, identifying suitable targets remains difficult for News Corp due to the gap between companies with varying price tags and focus on product lines."], "granite3.1-dense:2b": ["News Corp, led by billionaire Rupert Murdoch, is exploring entry into the video games market.", "Chief operating officer Peter Chernin mentioned that News Corp is assessing potential acquisitions of major players like Activision.", "The growing popularity and profitability of video games, driven by consoles like Sony's Playstation, Microsoft's X-Box, and Nintendo's Game Cube, are key motivators.", "However, identifying a suitable acquisition target has proven challenging due to the high prices associated with established companies like Electronic Arts and the focus of other firms on limited product lines."]}