{"raw_text": "US Ahold suppliers face charges\n \n US prosecutors have charged nine food suppliers with helping Dutch retailer Ahold inflate earnings by more than $800m (£428m).\n \n The charges have been brought against individuals as well as companies, alleging they created false accounts. Ahold hit the headlines in February 2003 after it emerged that there were accounting irregularities at its US subsidiary Foodservice. Three former Ahold top executives last year agreed to settle fraud charges.\n \n Ahold has admitted that it fraudulently inflated promotional allowances at Foodservice, improperly consolidated joint ventures and also committed other accounting errors and irregularities.\n \n The nine now charged, who worked as suppliers to Ahold, are accused of signing false documents relating to the amount of money they paid the retailer for promoting their products in its stores. Food companies pay supermarkets and retailers for prime shelf space. The suppliers in question are said to have inflated the amount of money they paid, providing auditors with signed letters that allowed Ahold to inflate its earnings. US Attorney David Kelley said he expects the nine vendors will plead guilty to the charges. He added that there may be more court actions in the future. \"I don't want to leave you with the impression that these were the only ones involved,\" he said. Among those facing charges are John Nettle, a former employee of General Mills; Mark Bailin of Rymer International Seafood; Tim Daly of Michael Foods and Kenneth Bowman, who worked as an independent contractor for Total Foods.\n \n Others include Michael Hannigan of Sugar Foods; Peter Marion of Maritime Seafood Processors and First Choice Foods; Gordon Redgate of Commodity Manager and Private Label Distribution; Bruce Robinson of Basic American Foods and Michael Rogers, formerly of Tyson Foods. Pasquale D'Amuro of the FBI called the nine vendors the key ingredients in \"the process of cooking the books\" at Ahold. At the time of the scandal, Ahold was seen by many as Europe's Enron. Ahold shares tumbled on the news and many market observers predicted that the fall out could damage investor confidence across Europe. It was less severe than many had envisaged, however, and since then Ahold has worked hard at rebuilding its reputation and investor confidence. Ahold is the world's fourth-largest supermarket chain. Its other US businesses include Stop & Shop, and Giant Food.\n", "llama3.2:1b": ["US prosecutors have charged nine food suppliers with helping Dutch retailer Ahold inflate earnings by over $800m.", "The charges involve creating false accounts and inflating promotional allowances at Ahold's US subsidiary Foodservice.", "The suppliers involved are accused of signing false documents that allowed Ahold to inflate its earnings."], "llama3.2:3b": ["Nine food suppliers face charges for allegedly helping Dutch retailer Ahold inflate earnings by over $800m through creating false accounts and inflating promotional allowances.", "The individuals and companies are accused of signing false documents to provide auditors with signed letters allowing Ahold to inflate its earnings."], "gemma2:2b": ["Nine food suppliers have been charged for helping Dutch retailer Ahold inflate earnings by over $800 million.", "The charges allege they created false accounts related to promotional allowances paid to Ahold.", "Ahold admitted to fraudulent accounting practices in its US subsidiary, Foodservice, with three former executives having settled fraud charges."], "qwen2.5:0.5b": ["US Ahold suppliers face charges of helping Dutch retailer Ahold inflate earnings by more than $800m (£428m).", "The charges have been brought against individuals as well as companies.", "Ahold hit the headlines in February 2003 after it emerged that there were accounting irregularities at its US subsidiary Foodservice.", "Three former Ahold top executives last year agreed to settle fraud charges.", "Ahold has admitted that it fraudulently inflated promotional allowances at Foodservice, improperly consolidated joint ventures and also committed other accounting errors and irregularities.", "The nine now charged are accused of signing false documents relating to the amount of money they paid for promoting their products in its stores, providing auditors with signed letters that allowed Ahold to inflate its earnings.", "US Attorney David Kelley said he expects the nine vendors will plead guilty to the charges.", "He added that there may be more court actions in the future.", "\"I don't want to leave you with the impression that these were the only ones involved,\" he said.", "Among those facing charges are John Nettle, a former employee of General Mills; Mark Bailin of Rymer International Seafood; Tim Daly of Michael Foods and Kenneth Bowman, who worked as an independent contractor for Total Foods.", "Others include Michael Hannigan of Sugar Foods; Peter Marion of Maritime Seafood Processors and First Choice Foods; Gordon Redgate of Commodity Manager and Private Label Distribution; Bruce Robinson of Basic American Foods and Michael Rogers, formerly of Tyson Foods.", "PASQUALE D'AMURIO, FBI's former head for financial fraud calls the nine vendors the key ingredients in \"the process of cooking the books\" at Ahold."], "qwen2.5:1.5b": ["US prosecutors have charged nine food suppliers with fraud involving $800 million in earnings manipulation for Dutch retailer Ahold.", "The charges cover both individuals and companies accused of creating false documents to inflate promotional allowances.", "Former executives settled fraud charges related to the same incident.", "The scandal has damaged investor confidence, but efforts by Ahold have improved its reputation since the fall-out."], "qwen2.5:3b": ["US prosecutors have charged nine food suppliers with helping Dutch retailer Ahold inflate earnings by over $800m (£428m).", "The charges involve false accounts creation and inflated promotional allowances signed by the suppliers for promoting their products in Ahold stores.", "Former executives of Ahold admitted to fraudulent activities, including improperly consolidating joint ventures and accounting errors.", "Nine now charged, including John Nettle from General Mills, Mark Bailin of Rymer International Seafood, Tim Daly of Michael Foods, Kenneth Bowman, Michael Hannigan of Sugar Foods, Peter Marion of Maritime Seafood Processors, Gordon Redgate of Commodity Manager and Private Label Distribution, Bruce Robinson of Basic American Foods, and Michael Rogers formerly of Tyson Foods.", "Prosecutors expect the nine to plead guilty and warn there may be more actions in future.", "Ahold was previously associated with Enron-like scandal but has since worked on rebuilding its reputation and investor confidence."], "opencoder:1.5b": ["US Ahold suppliers face charges\n\nUS prosecutors have charged nine food suppliers with helping Ahold inflate earnings by more than $800m (£428m).", "The charges have been brought against individuals and companies, alleging they created false accounts.", "Ahold hit the headlines in February 2003 after it emerged that there were accounting irregularities at its US subsidiary Foodservice.", "Three former Ahold top executives last year agreed to settle fraud charges.", "Ahold has admitted fraudulent inflating of promotional allowances at Foodservice, inconsistent consolidated joint ventures and also committed other accounting errors and irregularities.", "The nine now charged suppliers are accused of signing false documents relating to the amount paid by the retailer for promoting their products in its stores."], "smollm:1.7b": ["The text summarizes the key points of the article \"US Ahold suppliers face charges\" by highlighting the following:\n\n1.", "The US prosecutors have charged nine food suppliers with helping Dutch retailer Ahold inflate earnings by more than $800m (£428m).", "2.", "The charges have been brought against individuals as well as companies, alleging they created false accounts.", "3.", "Ahold hit the headlines in February 2003 after it emerged that there were accounting irregularities at its US subsidiary Foodservice.", "Three former Ahold top executives last year agreed to settle fraud charges.", "4.", "The nine now charged, who worked as suppliers to Ahold, are accused of signing false documents relating to the amount of money they paid the retailer for promoting their products in its stores.", "5.", "Food companies pay supermarkets and retailers for prime shelf space.", "The suppliers in question are said to have inflated the amount of money they paid, providing auditors with signed letters that allowed Ahold to inflate its earnings.", "US Attorney David Kelley said he expects the nine vendors to plead guilty to the charges.", "6.", "There may be more court actions in the future.", "\"I don't want to leave you with the impression that these were the only ones involved,\" he added.", "Among those facing charges are John Nettle, a former employee of General Mills; Mark Bailin of Rymer International Seafood; Tim Daly of Michael Foods and Kenneth Bowman, who worked as an independent contractor for Total Foods.", "7.", "Pasquale D'Amuro of the FBI called the nine vendors the key ingredients in \"the process of cooking the books\" at Ahold.", "At the time of the scandal, Ahold was seen by many as Europe's Enron.", "Ahold is the world's fourth-largest supermarket chain.", "Its other US businesses include Stop & Shop and Giant Food."], "deepseek-r1:1.5b": ["The US prosecutors have charged nine food suppliers with aiding a Dutch retailer, Ahold, in inflating its earnings by over $800 million.", "The charges involve individuals and companies, claiming false accounting practices at Ahold's Foodservice.", "These suppliers, including former executives of General Mills, Rymer International Seafood, Michael Foods, Total Foods, Sugar Foods, and others mentioned, agreed to settle the fraud charges.", "US Attorney David Kelley expects them to plead guilty and may face further court actions.", "The incident was compared to Enron-like financial losses, damaging investor confidence and investor value.", "Ahold, known as the fourth-largest supermarket chain, has lost some of its reputation and stock value but remains on the Dow Jones Industrial Average with lower valuations than expected."], "tinyllama:1.1b": ["The Department of Justice has charged nine food suppliers with helping DuTCH retailer Ahold inflate its earnings by more than $800m (£428m).", "The charges involve allegations that the suppliers created false accounting irregularities at Foodservice, improved promotional allowances at joint ventures, and committed other accounting errors and irregrularities.", "The nine now charged are accused of signing false documents to inflate Ahold's promotional expenses, with US Attorney David Kelley predicting more court actions in the future.", "The nine suppliers include General Mills employee John Nettlé, Michael Foods CEO Mark Bailin, and Michael Hannigan of Sugar Foods.", "Other accused suppliers include Michael Hannigan of Sugar Foods, Peter Marion of MariTime Seafood Processors, First Choice Foods CEO Gordon Redgate, Bruce Robinson of Basic American Foods, Michael Roger of Commodiy Manager, Pasqual D'Amuro of FBIs Bureau, and Tyson Foods' Pasqualé D'Amura.", "Ahold shares were reportedly expected to be hit by the news, but the company has since worked hard at rebuilding its reputation and investor confidence."], "tinydolphin:1.1b": [" US suppliers of food products to Dutch retailer Ahold face charges for helping it inflate earnings by more than $800m (£428m) by making fraudulent accounts.", "The charges were brought against individuals as well as companies in April 2013, following allegations that the company manipulated accounting records at its US subsidiary Foodservice.", "Ahold, which admitted to the offences and paid penalties, has agreed to pay back the $428m it had inflated in earnings.", "The nine now charged are accused of signing false documents related to their payments to Ahold for promoting products in its stores."], "phi:2.7b": [" Nine food suppliers are being charged by US prosecutors with helping Dutch retailer Ahold inflate earnings by over $800 million through false accounting documents and inflated promotional allowances for their products in Ahold's stores.", "The nine vendors have admitted to fraudulent practices that included creating fake accounts and improperly consolidating joint ventures, as well as other accounting errors and irregularities.", "Ahold has admitted its own fraud and the US Attorney expects all nine vendors will plead guilty to the charges.", "The scandal at Ahold was compared to Enron in Europe, causing significant damage to investor confidence in the company.", "Since then, Ahold has worked hard to rebuild its reputation and regain investor trust."], "orca-mini:3b": [" The text summarizes that nine food suppliers were charged with helping Dutch retailer Ahold inflate earnings by more than $800 million.", "The suppliers are accused of signing false documents related to the amount of money they paid Ahold for promoting their products on its shelves.", "The nine individuals and companies face charges, and there may be more court actions in the future.", "The scandal at Ahold, which was Europe's Enron at the time, caused shares in the retailer to tumble.", "However, since then, Ahold has worked hard to rebuild its reputation and investor confidence."], "hermes3:3b": ["US suppliers charged for $800m earnings inflation with Dutch retailer Ahold by creating false documents regarding payments to inflate promotional allowances."], "stablelm-zephyr:3b": ["Nine food suppliers have been charged with helping Dutch retailer Ahold inflate earnings by more than $800 million by creating false accounts.", "Ahold admitted to fraudulently inflating promotional allowances, committing accounting errors and irregularities.", "The charged individuals and companies are accused of signing false documents regarding the amount paid for promoting products in stores.", "US Attorney David Kelley expects the nine vendors to plead guilty and anticipates more court actions.", "This scandal was compared to Europe's Enron and had the potential to damage investor confidence across Europe, but Ahold has since worked on rebuilding its reputation."], "chatgpt-4o-latest": ["US prosecutors have charged nine food suppliers with helping Dutch retailer Ahold inflate earnings by over $800 million through false accounts.", "Ahold admitted to fraudulent inflation of promotional allowances, improper consolidation of joint ventures, and other accounting irregularities at its US subsidiary, Foodservice.", "The accused suppliers allegedly signed false documents inflating payments for product promotions, enabling Ahold to misrepresent earnings.", "US Attorney David Kelley expects guilty pleas and hinted at further legal actions.", "Among those charged are former employees of General Mills, Tyson Foods, and other companies.", "The FBI described them as key players in Ahold’s financial misconduct.", "The scandal, likened to Europe’s Enron, initially shook investor confidence, but Ahold has since worked to restore its reputation.", "Ahold is the world's fourth-largest supermarket chain, with US businesses including Stop & Shop and Giant Food."], "stablelm2:1.6b": ["US prosecutors charge nine food suppliers with helping Dutch retailer Ahold inflate earnings by over $1 million (£1 million).", "The accused individuals and companies are accused of creating false accounts and signing false documents to inflate the amount paid by suppliers for promoting products in stores.", "Key figures include John Nettle, Mark Bailin, Tim Daly, Kenneth Bowman, Michael Hannigan, Peter Marion, Gordon Redgate, Bruce Robinson, and Michael Rogers.", "Ahold has admitted to fraudulently inflating promotional allowances at its US subsidiary Foodservice."], "granite3.1-dense:2b": ["Nine food suppliers to Dutch retailer Ahold have been charged by US prosecutors for their role in inflating the company's earnings by over $800 million through fraudulent accounting practices.", "The charges allege these individuals and companies created false documents, improperly consolidated joint ventures, and misreported promotional allowances paid to Ahold for product placement.", "Previously, three former Ahold executives had settled fraud charges related to the scandal that emerged in 2003 when accounting irregularities were discovered at Foodservice, a US subsidiary.", "The charged suppliers include former employees and independent contractors from prominent food companies like General Mills, Rymer International Seafood, Michael Foods, Total Foods, Sugar Foods, Maritime Seafood Processors, First Choice Foods, Commodity Manager and Private Label Distribution, Basic American Foods, and Tyson Foods.", "The FBI's Pasquale D'Amuro described these suppliers as crucial participants in \"cooking the books\" for Ahold.", "Despite the scandal, which caused Ahold shares to plummet and raised concerns about investor confidence across Europe, the company has since rebuilt its reputation and market standing."]}