{"raw_text": "LSE doubts boost bidders' shares\n \n Shares in Deutsche Boerse have risen more than 3% after a shareholder fund voiced opposition to the firm's planned takeover of the London Stock Exchange.\n \n TCI, which claims to represent owners of 5% of Deutsche Boerse's (DB) shares, has complained that the £1.35bn ($2.5bn) offer for the LSE is too high. Opposition from TCI has fuelled speculation that the proposed takeover could fail. Rival exchange operator Euronext has also said it may bid for the LSE. Euronext operates the Paris, Amsterdam, Brussels and Lisbon bourses, while Deutsche Boerse runs the Frankfurt exchange.\n \n BBC News spoke to a number of analysts on Monday morning about shareholder worries over Deutsche Boerse's bid for LSE. Although none were prepared to speak on the record, most thought it was unlikely that TCI's opposition would halt the deal\n \n \"Obviously we'll have to wait and see, but I don't think it will make much difference. Deutsche Boerse appears very committed,\" said one London-based broker. He forecast the takeover bid would succeed and was more concerned to see improvements in the daily running of the LSE. In voicing its opposition to the planned takeover, TCI said it would prefer to see Deutsche Boerse return $500m (£350m) to shareholders. The Deutsche Boerse was prepared to pay for the LSE \"exceeds the potential benefits of this acquisition\", said TCI.\n \n Another Deutsche Boerse shareholder on Monday also appeared to back TCI's call. Another investor in Deutsche Boerse has supported the view that a payout to shareholders would be preferable to Deutsche Boerse overpaying for the LSE, Reuters news agency reported. \"We prefer a sensible entrepreneurial solution at a price that is not too high,\" said Rolf Dress, a spokesman for Union Investment. \"If that cannot be achieved, then we would wish for a distribution of liquid assets to shareholders.\" The Financial Times also reported a third Deutsche Boerse shareholder as opposed to the deal. It quoted a spokesman for US-based hedge fund Atticus Capital complaining that the planned takeover appeared to be motivated by \"empire-building\" rather than the best interests of shareholders.\n \n TCI has called for Deutsche Boerse to hold an emergency general meeting to discuss the bid for LSE. Yet under German business law, DB does not have to gain shareholder approval before making a significant acquisition. Deutsche Boerse said TCI's opposition would not change its bid approach. \"Deutsche Boerse is convinced that its contemplated cash acquisition of the London Stock Exchange is in the best interests of its shareholders and the company,\" it said. DB's shares were up 3.4% to 45.25 euros by 1030 GMT, the highest gainer in Frankfurt.\n", "llama3.2:1b": ["Shares in Deutsche Boerse rose more than 3% after a shareholder fund voiced opposition to the firm's planned takeover of the London Stock Exchange.", "The deal was valued at £1.35bn ($2.5bn), which TCI claimed is too high.", "Opponents, including rival exchange operator Euronext and some Deutsche Boerse shareholders, have fuelled speculation that the proposed takeover could fail."], "llama3.2:3b": ["Deutsche Boerse shares rose over 3% after a shareholder fund opposed the firm's £1.35bn bid for the London Stock Exchange.", "TCI claims to represent 5% of DB's shares and argues the offer is too high.", "Euronext may also bid for LSE, sparking speculation about potential deal failure."], "gemma2:2b": ["Deutsche Boerse's planned takeover of the London Stock Exchange is facing opposition from shareholder TCI, who claim the bid price is too high.", "TCI argues for a payout to shareholders instead.", "While analysts believe TCI's objection is unlikely to derail the deal, they are concerned about Deutsche Boerse’s commitment to improving LSE’s operations."], "qwen2.5:0.5b": ["Shares in Deutsche Boerse have risen after a shareholder fund opposed the firm's planned takeover of the London Stock Exchange (LSE).", "TCI, a shareholder who claims to represent owners of 5% of DB shares, has voiced concerns about the £1.35bn offer for the LSE and the potential impact on DB's daily running of the exchange.", "Other rival exchanges have also expressed interest in acquiring the LSE.", "Euronext is said to be considering a bid for the LSE, while Deutsche Boerse runs Frankfurt's Stock Exchange (FSE).", "A number of analysts believe that TCI's opposition would not halt the deal and that improvements in DB's running of the exchange could lead to better outcomes."], "qwen2.5:1.5b": ["Deutsche Boerse's £1.", "35bn takeover bid for LSE faces opposition from shareholder TCI, raising speculation that the deal might fail and causing shares of both Deutsche Boerse and LSE to rise.", "Analysts believe it is unlikely that TCI's opposition will stop the deal due to TCI's preference for repaying shareholders or returning $500m to them instead of paying a high price for LSE, which they claim does not generate adequate benefits."], "qwen2.5:3b": ["LSE shareholder fund TCI opposes Deutsche Boerse’s £1.35bn takeover bid, citing offer as too high.", "This has raised speculation that the deal could fail.", "Rival Euronext is also considering bidding for LSE.", "Analysts suggest TCI's opposition may not derail the takeover.", "TCI wants DB to return $500m to shareholders.", "Deutsche Boerse disagrees and insists on proceeding with the acquisition as it considers it in the best interests of shareholders.", "TCI has called for an emergency general meeting, but DB does not need shareholder approval before making significant acquisitions under German law.", "DB’s shares rose 3.4% after news of TCI's opposition."], "opencoder:1.5b": ["LSE doubts boost bidders' shares\n\nShares in Deutsche Boerse have risen more than 3% after a shareholder fund raised opposition to the firm's planned takeover of the London Stock Exchange.", "TCI claims that the £1.35bn ($2.5bn) offer for the LSE is too high, but insists it would prefer to see Deutsche Boerse return $500m (£350m) to shareholders.", "Deutsche Boerse appears very committed and will have to wait and see if TCI's opposition does halt the deal."], "smollm:1.7b": ["The summary should be:\nLSE doubts boost bidders' shares"], "deepseek-r1:1.5b": ["LSE doubts boost Deutsche Boerse shares as planned acquisition risks London Stock Exchange (LSE) takeover.", "TCI, owning 5% of DB shares, complains about high £1.35bn offer for LSE at $2.5bn.", "TCI's investors support this move, including unions and hedge fund applicants.", "Deutsche Boerse is considering an emergency general meeting to discuss the bid."], "tinyllama:1.1b": ["The LSE has seen a recent spike in share prices after Deutsche Boerse announced that it was considering acquiring the London Stock Exchange (LSE), with opposition from rival investor TCI being a major factor in causing concerns for investors.", "Shareholders of Deutsche Boerse, however, believe that an empire-building motive rather than the best interests of shareholders is driving the proposed takeover bid.", "TCI has called on Deutsche Boerse to hold an emergency general meeting and reject the deal, but the company stands by its plan.", "Despite the recent increase in LSE shares, some analysts predict that the deal could fail due to potential opposition from shareholder TCI."], "tinydolphin:1.1b": [" A large shareholder in Deutsche Boerse has expressed concerns about the proposed acquisition of LSE and is reportedly pressing for a more fair and reasonable deal that benefits both parties.", "This comes as Deutsche Boerse and TCI continue to negotiate the terms of the takeover.", "In light of these concerns, there's speculation that the proposed takeover may face resistance from rival exchange operator Euronext.", "Despite this, Euro's offer remains confidently anticipated by Deutsche Boerse shareholders."], "phi:2.7b": [" Deutsche Boerse, a German exchange operator, has proposed acquiring the London Stock Exchange (LSE) for £1.35bn ($2.5bn).", "However, the London-based shareholders' fund, TCI, which represents 5% of the shares, has expressed opposition to the deal and is calling for an emergency general meeting to discuss it.", "Despite this, Deutsche Boerse believes that its bid is in the best interests of its shareholders and will proceed as planned.", "The bid may be affected by the possibility of Euronext's takeover bid, but most analysts believe that Deutsche Boerse appears committed to the deal and is focused on improving the daily running of the LSE.", "TCI has proposed that Deutsche Boerse return $500m (£350m) to shareholders instead.", "Another Deutsche Boerse shareholder has also voiced support for this proposal.", "The question remains whether a payout to shareholders would be preferable to Deutsche Boerse overpaying for the LSE."], "orca-mini:3b": [" LSE doubts boost bidders' shares after shareholder fund voices opposition to Deutsche Boerse's planned takeover of the London Stock Exchange."], "hermes3:3b": ["Deutsche Boerse shares rise over 3% after shareholder fund opposes LSE takeover, despite TCI claiming Deutsche Boerse offering too high price for LSE."], "stablelm-zephyr:3b": ["Deutsche Boerse's shareholder fund, TCI, has opposed the firm's planned takeover of the London Stock Exchange (LSE), causing Deutsche Boerse's shares to rise more than 3%.", "TCI claims to represent owners of 5% of Deutsche Boerse's shares and believes the £1.35bn ($2.5bn) offer for the LSE is too high.", "This opposition has fueled speculation that the proposed takeover could fail, with rival exchange operator Euronext also considering a bid for the LSE.", "Analysts have mixed opinions on whether TCI's opposition will halt the deal; however, Deutsche Boerse remains committed to the acquisition."], "chatgpt-4o-latest": ["Shares in Deutsche Boerse rose over 3% after shareholder fund TCI, which holds 5% of DB shares, opposed its £1.35bn bid for the London Stock Exchange, arguing the price was too high and suggesting a $500m shareholder payout instead.", "TCI's opposition fueled speculation that the takeover might fail, while rival Euronext also expressed interest in bidding for LSE.", "Other DB shareholders, including Union Investment and Atticus Capital, echoed concerns about overpaying, with some criticizing the deal as \"empire-building.\"", "Despite this, Deutsche Boerse remained committed to the acquisition, stating it was in the best interests of shareholders.", "Under German law, DB does not need shareholder approval for the deal.", "DB shares rose 3.4% to 45.25 euros, making it the top gainer in Frankfurt."], "stablelm2:1.6b": ["Shareholder fund TCI opposes Deutsche Boerse's £1 billion ($2.5bn) offer for the London Stock Exchange (LSE), leading to speculation that the takeover could fail.", "Euronext also reportedly plans to bid for LSE, while analysts do not expect TCI's opposition to halt the deal.", "Under German business law, DB does not need shareholder approval for significant acquisitions; however, its shares have risen 3.4% due to the opposition from TCI and other shareholders."], "granite3.1-dense:2b": ["TCI, a Deutsche Boerse shareholder representing approximately 5% of its shares, has opposed the proposed £1.35 billion ($2.5 billion) takeover of London Stock Exchange (LSE), deeming it too high.", "This opposition has sparked speculation that the deal might not proceed.", "Rival exchange operator Euronext is also considering a bid for LSE.", "Despite TCI's concerns, many analysts, speaking anonymously, expect the takeover to succeed due to Deutsche Boerse's commitment.", "TCI prefers Deutsche Boerse returns $500 million (£350 million) to shareholders rather than overpaying for LSE.", "A third Deutsche Boerse shareholder and a US hedge fund spokesman echoed this view, suggesting the deal appears driven by empire-building instead of shareholder interests.", "TCI has urged an emergency general meeting to discuss the bid; however, under German law, Deutsche Boerse isn't required to seek shareholder approval for significant acquisitions.", "DB's shares rose 3.4% to 45.25 euros by 10:30 GMT, making it the highest-performing stock in Frankfurt."]}