{"raw_text": "Qantas considers offshore option\n \n Australian airline Qantas could transfer as many as 7,000 jobs out of its home country as it seeks to save costs, according to newspaper reports.\n \n Chief executive Geoff Dixon was quoted by The Australian newspaper as saying the carrier could no longer afford to remain \"all-Australian\". Unions criticised the possible move - which may affect cabin and maintenance staff - saying Qantas was profitable. More than 90% of the airline's staff are based in Australia.\n \n Qantas confirmed it was looking at whether it might recruit and source products overseas - potentially through joint ventures - but said it would continue to create jobs in Australia.\n \n Despite making a record Australian dollars 648m ($492m) profit last year, Qantas has argued that it needs to make considerable savings if it is to remain competitive. \"We're going to have to get the lowest cost structure we can and that willmean sourcing things more and more from overseas,\" the newspaper quoted Qantas chief executive Geoff Dixon as saying. Early this year, Qantas increased the number of flight attendants based in London from 370 to 870. If Qantas were to follow the lead of other airlines moving staff 'offshore' 7,000 jobs could shift overseas, the newspaper reported. In a statement, Qantas said it was looking to build its operations overseas. However, it stressed this would not result in large scale redundancies in its home market, where most of its 35,000 staff are employed. \"We are totally committed to continuing to grow jobs in Australia,\" Mr Dixon said. \"We are, however, operating in a global market and there is no room for complacency simply because we are currently profitable and successful.\"\n \n Unions reacted angrily to the reported disclosure, arguing that Qantas was profitable and did not need to take such action. \"We could understand if Qantas was a struggling airline about to go under,\" Michael Mijatov, international division secretary of the Flight Attendants Association, told Agence France Presse. \"Qantas announced a record profit last year and is on course this year for an even greater profit so it is totally unnecessary.\" In an effort to meet the challenge posed by low cost carriers, Qantas sought a tie-up with Air New Zealand last year However, the deal was thrown out by the New Zealand High Court on competition grounds.\n", "llama3.2:1b": ["Qantas considers transferring 7,000 jobs overseas as part of its cost-cutting efforts, despite generating record profits in Australia.", "The airline has stated that it would seek to build operations abroad while continuing to create jobs locally.", "However, unions have criticized the move, arguing that Qantas is profitable and does not need to downsize."], "llama3.2:3b": ["Qantas may transfer up to 7,000 jobs abroad as it seeks to save costs and remain competitive in a global market.", "The airline is considering joint ventures overseas and has already increased staff in London.", "Despite being profitable, Qantas believes it needs to reduce costs."], "gemma2:2b": ["Qantas may relocate up to 7,000 jobs overseas to reduce costs.", "The airline's CEO suggests sourcing products globally and moving staff offshore for cost savings.", "Unions criticize the move as unnecessary given Qantas' recent profit record.", "While Qantas plans to build operations overseas, it emphasizes job creation in Australia."], "qwen2.5:0.5b": ["A global airline in Australia has reported offshore option which could save costs and create jobs in overseas countries."], "qwen2.5:1.5b": ["Qantas may relocate up to 7,000 jobs overseas due to financial difficulties and seeks to expand operations globally while retaining most Australian staff."], "qwen2.5:3b": ["Qantas considers transferring up to 7,000 jobs offshore to save costs despite its profit of $492m last year.", "CEO Geoff Dixon stated that Qantas could no longer afford to remain \"all-Australian\" and is looking into recruiting and sourcing products from overseas through joint ventures.", "While most of the airline's staff (over 90%) are based in Australia, unions criticized the move.", "Despite being profitable, Qantas argues it needs significant savings for competitiveness.", "Unions reacted negatively, claiming Qantas does not need to take such drastic measures given its profitability."], "opencoder:1.5b": ["Qantas considers offshore option for managing large scale jobs while making substantial profits in Australia, according to newspaper reports.", "Qantas said it could potentially recruit and source products from an overseas joint venture - which may affect cabin and maintenance staff - but still retains a profitable position in Australia.", "Despite earning significant Australian dollars 648 million and operating profit last year, Qantas argued that it needs considerable savings if it's to remain competitive.", "\"We're going to have to get the lowest cost structure we can and sourcing from overseas will mean we're getting more products and services,\" the newspaper quoted Qantas chief executive Geoff Dixon as saying.", "Qantas increased the number of flight attendants based in London from 370 to 870, a report further indicated that it was looking towards expanding its operations internationally.", "However, it stressed this would not result in large scale redundancies among its staff who are all based in Australia.", "\"We are fully committed to continuing to grow jobs in Australia,\" Mr Dixon said.", "\"But we operate globally and there is no room for excessively competitive activities simply because we're profitable and successful.\""], "smollm:1.7b": ["Qantas could transfer as many as 7,000 jobs out of its home country as it seeks to save costs, according to newspaper reports.", "Australian airline Qantas considers offshore option in pursuit of cost savings.", "The carrier is looking to recruit and source products from overseas to reduce its operating costs.", "However, the move would not result in large-scale redundancies in Australia where most of its 35,000 staff are employed.", "Unions reacted angrily to the reported disclosure, arguing that Qantas was profitable and did not need to take such action.", "\"We could understand if Qantas was a struggling airline about to go under,\" Michael Mijatov, international division secretary of the Flight Attendants Association, told Agence France Presse.", "\"Qantas announced a record profit last year and is on course this year for an even greater profit so it is totally unnecessary.\"", "In an effort to meet the challenge posed by low cost carriers, Qantas sought a tie-up with Air New Zealand last year However, the deal was thrown out by the New Zealand High Court on competition grounds."], "deepseek-r1:1.5b": ["Qantas could potentially transfer 7,000 jobs out of its home country if it considers offshoring, as reported by a newspaper.", "The CEO, Geoff Dixon, mentioned that Qantas cannot afford to stay all-Australian and that unions are critical of the move, fearing it might affect cabin and maintenance staff.", "More than 90% of the airline's staff are in Australia, with over 35,000 employees.", "Despite making a significant profit last year, Qantas argues it must save costs to remain competitive, calling off the decision \"too risky.\"", "They increased flight attendants based in London from 370 to 870 staff last year, but faced criticism for this move as well.", "The company is committed to creating jobs in Australia but emphasizes a global market and avoids complacency due to profitability."], "tinyllama:1.1b": ["Qanta Airlines is considering offshoring jobs in Australia to save costs, according to reports published by The Australian newspaper.", "Chief Executive Geoff Dixon has confirmed that the airline would look to transfer as many as 7,000 employees overseas if it cannot maintain profitability in Australia.", "However, Qanta Airlines stresses that there will be no large-scale redundancies as most of its staff are employed in Australia.", "The union representing flight attendants argued that the airline was making a profit and could not afford to cut jobs, stating that Qanta Airlines is financially stable despite being profitable and currently performing well in the global market."], "tinydolphin:1.1b": [" Australian airline Qantas has considered offshoring its operations for several years in an effort to save costs and become more competitive.", "Chief executive Geoff Dixon announced that the carrier could transfer up to 7,000 jobs out of Australia as a part of this move.", "However, some have criticized the potential job losses and argued Qantas's decision should be based on its profitable nature instead of sourcing products overseas.", "In response to these concerns, Qantas has made efforts to invest in various overseas markets, such as London, to reduce costs and increase revenue.", "It has also pursued joint ventures with other carriers, including a potential joint venture with Air New Zealand, to further enhance its global reach.", "Ultimately, while Qantas may have to find ways to save money and become more profitable, it is important for the company to ensure that these moves are justified based on their overall business strategy and financial performance."], "phi:2.7b": [" Qantas may transfer as many as 7,000 jobs out of Australia due to rising costs and to remain competitive in the market.", "The airline is considering recruiting and sourcing products overseas through joint ventures while still creating jobs in Australia.", "Despite making a record profit last year, Qantas has argued that it needs to make significant savings.", "If Qantas moves staff offshore, 7,000 jobs could shift overseas.", "Unions are critical of this move as the carrier is profitable and does not need such action."], "orca-mini:3b": [" Australian airline Qantas could transfer up to 7,000 jobs out of its home country as it seeks to save costs, according to newspaper reports.", "Chief executive Geoff Dixon suggested the carrier could no longer afford to remain \"all-Australian\".", "Unions criticized the possible move, arguing that Qantas was profitable and did not need to take such action.", "The airline confirmed it was looking at whether it might recruit and source products overseas, potentially through joint ventures, but stressed that this would result in no large scale redundancies in its home market."], "hermes3:3b": ["Qantas considers transferring up to 7k Australian jobs offshore for cost savings."], "stablelm-zephyr:3b": ["Australian airline Qantas may transfer up to 7,000 jobs out of Australia as part of cost-saving measures, according to reports.", "CEO Geoff Dixon stated that the carrier cannot afford to remain \"all-Australian.\"", "While Qantas confirmed considering sourcing products overseas through joint ventures, it affirmed its commitment to creating jobs in Australia.", "Despite making a record $648 million profit last year, Qantas argues it needs substantial savings for competitiveness.", "Unions criticize the proposed move, arguing that Qantas is profitable and does not need to take action."], "chatgpt-4o-latest": ["Qantas is considering moving up to 7,000 jobs overseas to cut costs, despite being profitable.", "CEO Geoff Dixon stated the airline could no longer remain \"all-Australian\" and needed to lower costs to stay competitive.", "The company is exploring overseas recruitment and sourcing, potentially through joint ventures, but insists it will continue creating jobs in Australia.", "Unions strongly oppose the move, arguing it is unnecessary given Qantas' record profits.", "The airline has already increased its London-based flight attendants and aims to expand operations abroad while maintaining most of its 35,000 staff in Australia.", "A previous attempt to partner with Air New Zealand was blocked on competition grounds."], "stablelm2:1.6b": ["Qantas may transfer up to 7,0..", "According to reports in The Australian newspaper, Australian airline Qantas is considering transferring as many as 7,000 jobs (mainly cabin and maintenance staff) overseas due to high costs at home.", "CEO Geoff Dixon told the paper that it was not possible anymore for Qantas to remain all-Australian, and the company may have to look for cheaper sourcing of products through joint ventures.", "However, Qantas confirmed that while exploring opportunities overseas, it would also work on creating more jobs in Australia.", "Despite making a record profit last year ($Ams 1,025m), Qantas has argued it needed significant cost savings to remain competitive, noting \"we're going to have to get the lowest cost structure we can and that will mean sourcing things more and more from overseas.\"", "In response to concerns raised by unions and some staff members, Qantas stressed its commitment to growing jobs in Australia while maintaining a global presence."], "granite3.1-dense:2b": ["Qantas, Australia's leading airline, is considering transferring up to 7,000 jobs offshore, primarily to London and other overseas locations, to reduce costs and maintain competitiveness in a global market.", "This move, according to CEO Geoff Dixon, is necessary for Qantas to achieve the lowest possible cost structure.", "Despite reporting a record AUD 648 million (approximately USD 492 million) profit last year and forecasting significant profits this year, Qantas argues it must adapt by sourcing more services internationally.", "The proposed job transfer would impact cabin and maintenance staff, with over 90% of the airline's 35,000 employees currently based in Australia.", "Unions have strongly criticized this plan, stating that Qantas is profitable and does not need to cut jobs domestically.", "They argue that such actions would be unnecessary, given Qantas' financial strength.", "Qantas has clarified that it aims to expand its overseas operations, emphasizing the commitment to maintain job growth in Australia.", "The company maintains it cannot afford complacency due to competition from low-cost carriers.", "Earlier this year, Qantas expanded the number of flight attendants based in London from 370 to 870 as part of these international expansion efforts.", "In response to the reported job transfers, unions have expressed anger and disapproval, expressing concerns about potential redundancies in Australia despite Qantas' profitability."]}