{"raw_text": "Beijingers fume over parking fees\n \n Choking traffic jams in Beijing are prompting officials to look at reorganising car parking charges.\n \n Car ownership has risen fast in recent years, and there are now two and a half million cars on the city's roads. The trouble is that the high status of car ownership is matched by expensive fees at indoor car parks, making motorists reluctant to use them. Instead roads are being clogged by drivers circling in search of a cheaper outdoor option. \"The price differences between indoor and outdoor lots are unreasonable,\" said Wang Yan, an official from the Beijing Municipal Commission for Development and Reform quoted in the state-run China Daily newspaper. Mr Wang, who is in charge of collecting car parking fees, said his team would be looking at adjusting parking prices to close the gap. Indoor parking bays can cost up to 250% more than outdoor ones.\n \n Sports fans who drive to matches may also find themselves the target of the commission's road rage. It wants them to use public transport, and is considering jacking up the prices of car parks near sports grounds. Mr Wang said his review team may scrap the relatively cheap hourly fee near such places and impose a higher flat rate during matches. Indoor parking may be costly, but it is not always secure. Mr Wang's team are also going to look into complaints from residents about poor service received in exchange for compulsory monthly fees of up to 400 yuan ($48; £26). The Beijing authorities decided two years ago that visiting foreign dignitaries' motorcades should not longer get motorcycle outriders as they blocked the traffic. Unclogging Beijing's increasingly impassable streets is a major concern for the Chinese authorities, who are building dozens of new roads to create a showcase modern city ahead of the 2008 Olympic Games.\n", "llama3.2:1b": ["Beijing officials are reorganizing car parking charges amid high status and expensive fees for indoor parking lots.", "The city now has over 2 million cars on its roads, leading to congestion caused by drivers circling for cheaper outdoor options.", "Officials want to lower indoor prices to match outdoor rates of up to 250%, which can cost as much as 400 yuan per month."], "llama3.2:3b": ["Beijing residents are frustrated with high parking fees, prompting officials to consider reorganizing charges as traffic congestion worsens.", "With two and a half million cars on the streets, expensive indoor parking rates (up to 250% more than outdoor ones) are discouraging drivers from using them, causing traffic jams and road rage.", "Officials plan to adjust prices and explore new payment models to alleviate concerns over poor service and security issues."], "gemma2:2b": ["Beijing faces traffic congestion issues due to increased car ownership and high parking fees.", "Officials plan to adjust parking prices between indoor and outdoor lots to encourage people to use indoor parking.", "They may also increase parking fees near sports grounds for fans.", "Complaints about poor service in exchange for monthly parking fees are being reviewed.", "The Chinese government is tackling the problem of traffic congestion by building new roads ahead of the 2008 Olympic Games."], "qwen2.5:0.5b": ["Key points:\n\n- Beijing car owners face high parking fees and congestion in busy urban areas.", "- Indoor parking charges have become more expensive compared to outdoor lots.", "- The government plans to adjust parking prices, including indoor ones for drivers seeking cheaper options.", "They may also consider increasing public transport fares near sports grounds.", "- There are concerns about the security of indoor car parks due to high costs and potential vandalism.", "- Beijing authorities previously prohibited visitors from using motorcades with motorcycle outriggers as they caused traffic congestion.", "Summary: The government in Beijing is considering raising parking fees for cars, including indoor lots.", "They aim to make it more expensive for drivers searching cheaper options like outdoor car parks near sports grounds.", "They have also proposed increasing public transport fares near major sporting venues."], "qwen2.5:1.5b": ["Beijing officials plan to adjust parking fees to reduce traffic congestion and improve public transportation use among sports fans."], "qwen2.5:3b": ["Beijing faces traffic congestion due to rising car ownership and high indoor parking fees compared to outdoor lots.", "Officials aim to adjust prices by closing the gap between indoor and outdoor parking charges, particularly near sports grounds where they plan to increase prices significantly during matches.", "The commission also aims to reduce reliance on personal cars for sporting events by promoting public transport use, including reviewing monthly fees for residents' compulsory service.", "Previously, motorcades of visiting dignitaries were denied motorcycle outriders as these disrupted traffic flow.", "Authorities are building new roads to improve Beijing's infrastructure ahead of the 2008 Olympics."], "opencoder:1.5b": ["Beijing fumes over parking fees\n\nChoking traffic jams in Beijing are prompting officials to reorganise car parking charges.", "Car ownership has risen fast in recent years, and there are now two and a half million cars on the city's roads.", "The trouble is that the high status of car ownership is matched by expensive fees at indoor car parks, making motorists reluctant to use them.", "Instead roads are being clogged by drivers circling in search of a cheaper outdoor option.", "\"The price differences between indoor and outdoor lots are unreasonable,\" said Wang Yan, an official from the Beijing Municipal Commission for Development and Reform quoted in the state-run China Daily newspaper.", "Mr Wang, who is in charge of collecting car parking fees, suggested his team would adjust parking prices to close the gap.", "Indoor parking bays can cost up to 250% more than outdoor ones.", "Sports fans who drive to matches may also encounter difficulties due to the commission's road rage.", "It wants them to use public transport and is considering jacking up the prices of car parks near sports grounds.", "The officials said in Mr Wang’s review team that it might scrap the relatively cheap hourly fee near such places and impose a higher flat rate during matches.", "Indoor parking may be costly, but it isn’t always secure.", "The authorities have also been concerned about residents' complaints about poor service received in return for compulsory monthly fees of up to 400 yuan ($48; £26).", "Beijing authorities decided on its return two years ago that visiting foreign dignitaries' motorcasses should no longer be exempt from motorcycle outriders as they blocked the traffic.", "The Chinese authorities are pushing the boundaries of impassable streets, aiming to create a showcase of modern city ahead of the 2008 Olympic Games."], "smollm:1.7b": ["The summary should be:\nChoking traffic jams in Beijing are prompting officials to look at reorganising car parking charges.", "Car ownership has risen fast in recent years, and there are now two and a half million cars on the city's roads.", "The trouble is that the high status of car ownership is matched by expensive fees at indoor car parks, making motorists reluctant to use them.", "Instead roads are being clogged by drivers circling in search of a cheaper outdoor option.", "\"The price differences between indoor and outdoor lots are unreasonable,\" said Wang Yan, an official from the Beijing Municipal Commission for Development and Reform quoted in the state-run China Daily newspaper.", "Mr Wang, who is in charge of collecting car parking fees, said his team would be looking at adjusting parking prices to close the gap.", "Indoor parking bays can cost up to 250% more than outdoor ones.", "Sports fans who drive to matches may also find themselves the target of the commission's road rage.", "It wants them to use public transport, and is considering jacking up the prices of car parks near sports grounds.", "Mr Wang's team may scrap the relatively cheap hourly fee near such places and impose a higher flat rate during matches.", "Indoor parking may be costly, but it is not always secure.", "Mr Wang's team are also going to look into complaints from residents about poor service received in exchange for compulsory monthly fees of up to 400 yuan ($48; £26).", "The Beijing authorities decided two years ago that visiting foreign dignitaries' motorcades should not longer get motorcycle outriders as they blocked the traffic.", "Unclogging Beijing's increasingly impassable streets is a major concern for the Chinese authorities, who are building dozens of new roads to create a showcase modern city ahead of the 2008 Olympic Games."], "deepseek-r1:1.5b": ["Choking traffic jams in Beijing are prompting officials to look into reorganizing car parking charges, with increased car ownership leading to expensive indoor car parks.", "Residents opt to use roads instead of cars when out of town due to higher prices at indoor lots.", "Sports fans might face price issues near venues but could consider higher flat rates during matches.", "The government aims to unblock traffic and promote public transport access after being blocked by motorcycle tourists."], "tinyllama:1.1b": ["The article discusses Beijing's growing traffic jam and the rise in car ownership, which has led to the high price of parking fees in indoor lots.", "The article quotes an official from the Municipal Commission for Development and Reform as saying that car park charges are unreasonably high, adding that they should be adjusted to close the gap between outdoor and indoor lots.", "The article also discusses the need for commuters near sports grounds to use public transportation, considering jacking up prices of car parks near sports venues in response to increased demand.", "Finally, it suggests that poor service received by foreign dignitaries during motorcade visits may be a major concern for Beijing's authorities ahead of the 2008 Olympic Games."], "tinydolphin:1.1b": [" The Beijinger motorists face challenges due to the high cost of parking, with an average outdoor space set at over 4 square meters and two-and-a-half million registered cars on the road, making their parking fees a significant concern.", "To address this issue, Beijing officials are looking at reorganizing car parking charges to make parking more accessible, while also considering raising the prices of indoor lots to discourage drivers from circling around for longer periods and using outdoor options like public transportation or higher-priced facilities near sports venues.", "The authority is currently reviewing complaints from residents who have had poor service with their monthly fees and encouraging visitors to use public transportation instead."], "phi:2.7b": [" Beijingers are frustrated with high parking fees and congestion on their roads due to increasing car ownership.", "The government wants to reorganize car parking charges by adjusting prices between indoor and outdoor lots.", "They may also increase the price of car parks near sports grounds during matches.", "Residents who pay compulsory monthly fees for secure parking may receive poor service in return."], "orca-mini:3b": [" The text reports on the increasing number of cars on Beijing's roads and the high cost of indoor car parking fees, which is driving drivers to circling in search of cheaper outdoor options.", "The authorities are considering adjusting parking prices to close the gap between indoor and outdoor fees.", "They also want sports fans to use public transport during matches, and are considering jacking up the prices of car parks near sports grounds."], "hermes3:3b": ["Bejing residents annoyed by high parking fees, due to increasing car ownership and traffic congestion; officials planning price adjustments between indoor/outdoor parking lots and possibly raising public transport prices near sports grounds."], "stablelm-zephyr:3b": ["Beijing officials consider reorganizing car parking charges due to traffic jams and expensive indoor park fees.", "Two and a half million cars on the city's roads cause drivers to circle in search of cheaper outdoor options, leading to clogged roads.", "The Beijing Municipal Commission for Development and Reform is looking into adjusting parking prices to close the gap between indoor and outdoor lots.", "Indoor parking bays can cost up to 250% more than outdoor ones.", "Sports fans may also face higher car park prices near sports grounds during matches.", "The Chinese authorities are building new roads to unclog the streets before the 2008 Olympic Games."], "chatgpt-4o-latest": ["Beijing's growing car ownership has led to severe traffic congestion, prompting officials to reconsider parking fees.", "High indoor parking costs discourage use, causing drivers to clog roads searching for cheaper outdoor spots.", "Authorities plan to adjust prices to reduce the gap, with indoor parking costing up to 250% more.", "Sports fans may face higher parking fees near stadiums to encourage public transport use.", "Complaints about poor service despite high monthly fees will also be reviewed.", "With the 2008 Olympics approaching, Beijing is expanding roads to ease congestion and modernize the city."], "stablelm2:1.6b": ["Beijing officials are reconsidering parking fees due to increased car ownership causing traffic issues.", "Indoor parking charges are expensive, leading drivers to search for cheaper outdoor lots; this results in congestion and circling.", "Officials plan to adjust parking prices to close the gap between indoor and outdoor lots, costing up to 2.5 times more.", "They also aim to discourage sports fans from using car parks by raising match day parking fees or implementing a flat rate during matches.", "Beijing authorities are addressing traffic issues as part of their efforts to become a modern city showcase for the Olympics."], "granite3.1-dense:2b": ["Beijing faces severe traffic congestion due to its rapidly increasing car ownership, which now stands at approximately 2.5 million vehicles.", "The primary issue lies in the disproportionate parking fees between indoor and outdoor lots, with prices up to 250% higher for indoor spaces.", "This has led residents to circumvent expensive indoor parking, instead using roads for searching cheaper alternatives.", "To address this, Beijing Municipal Commission for Development and Reform official Wang Yan, in charge of collecting car parking fees, announced a review of parking prices to narrow the gap.", "Additionally, the commission intends to increase parking costs near sports venues, from cheaper hourly rates to higher flat fees during matches.", "This move aims to discourage driving by fans and encourage public transport use for these events.", "The authorities are also addressing resident complaints about subpar service for compulsory monthly fees of up to 400 yuan ($48; £26).", "Two years ago, Beijing abolished motorcycle outriders for visiting foreign dignitaries' motorcades due to traffic obstruction.", "To alleviate the city's congestion and prepare for the 2008 Olympic Games, authorities are constructing numerous new roads as a priority."]}