{"raw_text": "EU to probe Alitalia 'state aid'\n \n The European Commission has officially launched an in-depth investigation into whether Italian airline Alitalia is receiving illegal state aid.\n \n Commission officials are to look at Rome's provision of a 400m euro ($495m; £275m) loan to the carrier. Both the Italian government and Alitalia have repeatedly denied that the money - part of a vital restructuring plan - is state aid. The investigation could take up to 18 months. However, Transport Commissioner Jacques Barrot said he wanted it to be carried out as swiftly as possible. \"The Italian authorities have presented a serious industrial plan,\" said Mr Barot. \"We now have to verify certain aspects to confirm that this plan contains no state aid. I would like our analysis to be completed swiftly.\"\n \n The matter of possible state aid was brought to the Commission's attention by eight of Alitalia's rivals, including Germany's Lufthansa, British Airways and Spain's Iberia. While Alitalia needs to restructure to bring itself back to profitability, the rival carriers say it has both violated state aid rules and threatened competition. Alitalia lost 330m euros in 2003 as it struggled to get to grips with high costs, spiralling oil prices, competition from budget carriers and reduced demand. It plans to split into AZ Fly and AZ Services, which will handle air and ground services respectively. Alitalia already enjoyed state aid in 1997. EU rules prevent that from happening again in what is known as the \"one time, last time\" rule for airlines. Otherwise, EU regulations on state aid stipulate that governments may help companies financially, but only on the same terms as a commercial investor. The airline declined to comment on the Commission decision.\n", "llama3.2:1b": ["The European Commission has launched an investigation into whether Italian airline Alitalia is receiving illegal state aid due to its restructuring plans and financial struggles.", "The airline received a 400m euro loan from Rome, which both the Italian government and Alitalia claim does not constitute state aid as part of a restructuring plan.", "The investigation could take up to 18 months."], "llama3.2:3b": ["The European Commission launched an investigation into Alitalia's receipt of 400m euro loan from Rome, amid concerns it could be considered illegal state aid, following complaints from rival airlines."], "gemma2:2b": ["The European Commission is investigating whether Italian airline Alitalia received illegal state aid through a €400 million loan.", "Alitalia and the Italian government deny this, while rivals like Lufthansa and Iberia allege that it violates competition rules and harms market conditions.", "This investigation could last up to 18 months.", "The Commission aims to complete its analysis swiftly."], "qwen2.5:0.5b": ["The European Commission launched an investigation into whether Italy's Alitalia received illegal state aid by asking Italian government officials and Alitalia rivals for further details about its financial restructuring plan.", "While Alitalia plans to split into AZ Fly and AZ Services, it already enjoyed state aid in 1997 under a temporary \"one-time, last time\" rule."], "qwen2.5:1.5b": ["The European Commission has initiated an investigation into whether Italy's Alitalia received illegal state aid from its government loans of €400 million (€495 million), which the carrier claims is part of a restructuring plan.", "This could take up to 18 months, but Transport Commissioner Jacques Barrot wants the review completed quickly.", "The rivals' complaint suggests potential violations of state-aid rules and competition threats, with Alitalia facing financial difficulties due to high costs, oil price spikes, budget carriers, and reduced demand."], "qwen2.5:3b": ["The European Commission has launched an in-depth investigation into whether Italian airline Alitalia is receiving illegal state aid through a 400m euro loan from Rome's restructuring plan.", "Despite government and Alitalia’s claims of non-aid status, eight rivals including Lufthansa, British Airways, and Iberia have brought the matter to the Commission's attention.", "The investigation could take up to 18 months; Transport Commissioner Jacques Barrot wants it completed swiftly.", "Alitalia plans to split into AZ Fly and AZ Services for restructuring purposes after losses in 2003.", "EU rules prevent airlines from receiving state aid more than once, and financial assistance must be on commercial terms.", "Alitalia has declined comment."], "opencoder:1.5b": ["EU to probe Alitalia 'state aid'\n\nThe European Commission has officially launched an in-depth investigation into whether Italian airline Alitalia is receiving illegal state aid.", "Alitalia's Commission officials are to consider the provision of a 400m euro loan to the carrier, which amounts to $495m and £275m respectively.", "Both the Italian government and Alitalia have repeatedly denied that the money - part of a crucial restructuring plan - is state aid.", "The investigation is expected to take up to 18 months due to the potential risks it carries.", "However, Transport Commissioner Jacques Barrot has indicated he wanted it carried out as swiftly as possible.", "\"The Italian authorities have presented a serious industrial plan,\" Mr Barot said.", "He further confirmed that these rules are essential for the proper functioning of Alitalia.", "While Alitalia needs to restructure to maintain profitability and ensure competition, rivals like Germany's Lufthansa, British Airways, and Spain's Iberia highlight potential pitfalls and threats.", "Despite Alitalia's challenges in managing high costs, oil prices, reduced competition, and increased demand, it has shown a significant amount of state aid that could be utilized.", "Alitalia plans to split into AZ Fly and AZ Services, two distinct operations, catering to both air and ground services.", "However, Alitalia has already experienced state aid in 1997, as EU rules prohibit the issuance of state aid on repeated occasions within a limited timeframe for airlines.", "EU regulation prohibits the possibility of it again in what is known as the \"one-time, last time\" rule for airlines.", "This means that if an airline fails to meet its obligations under EU regulations and rules, it could face severe penalties without being able to make full use of any benefits previously promised by that country.", "The Commission decision indicates Alitalia's rights are limited.", "If the authorities decide not to comment on the decision made by the European Union, they will have to explain their reasoning or seek other alternatives."], "smollm:1.7b": ["The European Commission has officially launched an in-depth investigation into whether Italian airline Alitalia is receiving illegal state aid.", "The investigation could take up to 18 months and involves looking at Rome's provision of a $495 million loan to the carrier, which both the Italian government and Alitalia have repeatedly denied is state aid.", "The matter was brought to the Commission's attention by eight of Alitalia's rivals, including Germany's Lufthansa, Britain's Iberia and Spain's Iberia.", "While Alitalia needs to restructure to bring itself back to profitability, the rival carriers say it has both violated state aid rules and threatened competition.", "Alitalia lost 330 million euros in 2003 as it struggled to get to grips with high costs, spiraling oil prices, competition from budget carriers and reduced demand.", "It plans to split into two separate companies: AZ Fly for air services and AZ Services for ground services.", "Alitalia already enjoyed state aid in 1997.", "EU rules prevent that from happening again in what is known as the \"one time, last time\" rule for airlines.", "Otherwise, EU regulations on state aid stipulate that governments may help companies financially, but only on the same terms as a commercial investor.", "The airline declined to comment on the Commission decision."], "deepseek-r1:1.5b": ["The European Commission is investigating Alitalia for receiving illegal state aid.", "The focus is on Rome's loan of 400 million euros ($495 million; £275 million) to the carrier, which both Italy and Alitalia deny as state aid.", "The probe could take up to 18 months.", "Transport Commissioner Jacques Barrot requested it be completed swiftly due to financial constraints with competitors.", "Rival airlines like Lufthansa, British Airways, and Iberia are involved, whose financial actions include violating state aid rules and threatening competition.", "Alitalia lost money in 2003 due to high costs, low oil prices, and reduced demand.", "The carrier plans to split into AZ Fly and AZ Services for air and ground services respectively.", "Alitalia previously received state aid in 1997, which is not allowed under the EU's \"one time, last time\" rule."], "tinyllama:1.1b": ["The European Commission has officially launched an investigation into whether Italian carrier Alitalia is receiving state aid, following repeated denials by both the Italian government and the airline.", "The probe could take up to 18 months as Transport Commissioner Jacques Barrot stated that he wished it to be completed swiftly, and European rules stipulate that government aid must only be given in accordance with commercial terms.", "The investigation is set to examine various aspects of Alitalia's industrial plan, including allegations made by competitors such as German airline Lufthansa, British Airways, and Spain's Ibérica.", "While Alitalia has been granted state aid several times in the past, its restructuring efforts have faced competition from budget carriers and a decline in demand for travel, leading to losses of 330m euros last year."], "tinydolphin:1.1b": [" The European Union (EU) has initiated a thorough investigation into whether Italian airline Alitalia is receiving state aid in violation of EU rules.", "The Commission, which oversees various industries, has requested an in-depth examination to determine if the loan provided by Rome is indeed taxpayer money or a bailout.", "This probe could last up to 18 months and would be aimed at verifying certain aspects of Alitalia's industrial plan.", "Should it turn out that state aid has been provided, it could set back the company from its recovery efforts and potentially harm competitors in the aviation industry.", "The matter was brought to the Commission's attention by eight rival airlines, including Germany's Lufthansa, British Airways, and Spain's Iberia.", "The investigation is seen as a way for the EU to reinforce competition within the sector, while maintaining the spirit of the \"one time, last time\" rule for airline support."], "phi:2.7b": [" The European Commission has started an investigation into whether Italian airline Alitalia is receiving illegal state aid by looking at a 400 million euro loan provided by the government for restructuring.", "The rivals of Alitalia have raised concerns that the airline violated EU state aid rules and is threatening competition.", "The matter was brought to the Commission's attention, and it could take up to 18 months to complete the investigation.", "However, EU Transport Commissioner Jacques Barrot wants it done as soon as possible to confirm that the airline's restructuring plan contains no state aid.", "Alitalia plans to split into two separate entities, but has already received previous state aid in 1997.", "EU regulations prevent airlines from receiving state aid more than once, and they can only receive help if it is on the same terms as a commercial investor.", "Alitalia did not respond to the Commission's decision."], "orca-mini:3b": [" The European Union has launched an investigation into whether Italian airline Alitalia is receiving illegal state aid.", "Rome provided a 400 million euro loan to the carrier, which rivals say violates state aid rules and threatens competition.", "Alitalia needs to restructure to bring itself back to profitability, but the rival carriers argue that it has violated state aid rules and threatened competition.", "The matter was brought to the Commission's attention by eight rivals, including Lufthansa, British Airways, and Iberia."], "hermes3:3b": ["European Commission probes Alitalia state aid investigation"], "stablelm-zephyr:3b": ["The European Commission has initiated an investigation into Alitalia's possible receipt of illegal state aid, focusing on a 400 million euro loan provided by Rome as part of the Italian carrier's restructuring plan.", "Although both the Italian government and Alitalia have denied that the funds violate state aid rules or threaten competition, eight of Alitalia's rivals, including Lufthansa and British Airways, alerted the European Commission to the matter.", "Alitalia lost 330 million euros in 2003 due to high costs, competitive pressures, and reduced demand.", "The investigation could take up to 18 months, with Commissioner Jacques Barrot urging for a swift analysis.", "Under EU regulations on state aid, governments may financially assist companies but only on the same terms as commercial investors."], "chatgpt-4o-latest": ["The European Commission has launched an investigation into whether a 400 million euro loan from the Italian government to Alitalia constitutes illegal state aid.", "Both the government and Alitalia deny the claim, asserting the loan is part of a restructuring plan.", "The probe, prompted by complaints from rival airlines, could take up to 18 months, though Transport Commissioner Jacques Barrot aims for a swift resolution.", "Alitalia, which lost 330 million euros in 2003, plans to restructure by splitting into AZ Fly and AZ Services.", "EU rules prohibit repeated state aid for airlines, and financial assistance must align with commercial investment terms.", "Alitalia declined to comment on the investigation."], "stablelm2:1.6b": ["The European Commission has launched an investigation into whether Italian airline Alitalia received illegal state aid related to a €10 million ($15 million; £9 million) loan from Rome for restructuring purposes.", "Both the Italian government and Alitalia deny that the money is aid, despite eight rivals claiming otherwise.", "The investigation could take up to 3 months, but Transport Commissioner Jacques Barrot wants it completed swiftly."], "granite3.1-dense:2b": ["The European Commission has initiated an investigation into alleged illegal state aid provided by Italy to its struggling airline, Alitalia.", "This $495 million loan, part of a restructuring plan, is under scrutiny due to concerns from eight of Alitalia's competitors, including Lufthansa and British Airways.", "The investigation may last up to 18 months.", "Transport Commissioner Jacques Barrot emphasized the need for expeditious analysis to validate Alitalia's restructuring plan as state-aid-free.", "Alitalia, which has historically received state aid in 1997 and is set to merge into AZ Fly and AZ Services, lost €330 million in 2003 due to high costs, competition from budget carriers, and reduced demand.", "EU regulations generally allow financial government support for companies on commercial terms, but the \"one-time, last time\" rule prohibits such aid to Alitalia following its 1997 exemption.", "The airline remains silent on the Commission's decision."]}