{"raw_text": "Virgin Blue shares plummet 20%\n \n Shares in Australian budget airline Virgin Blue plunged 20% after it warned of a steep fall in full year profits.\n \n Virgin Blue said profits after tax for the year to March would be between 10% to 15% lower than the previous year. \"Sluggish demand reported previously for November and now December 2004 continues,\" said Virgin Blue chief executive Brett Godfrey. Virgin Blue, which is 25% owned by Richard Branson, has been struggling to fend off pressure from rival Jetstar. It cut its full year passenger number forecast by \"approximately 2.5%\". Virgin Blue reported a 22% fall in first quarter profits in August 2004 due to tough competition. In November, first half profits were down due to slack demand and rising fuel costs. Virgin Blue was launched four years ago and now has roughly one third of Australia's domestic airline market. But the national carrier, Qantas, has fought back with its own budget airline, Jetstar, which took to the skies in May 2004. Sydney-listed Virgin Blue's shares recovered slightly to close 12% down on Wednesday. Shares in its major shareholder, Patrick Corporation - which owns 46% of Virgin Blue - had dropped 31% by the close.\n", "llama3.2:1b": ["Virgin Blue's full year profits are forecast to be between 10-15% lower than last year, due to sluggish demand.", "The airline cut its passenger number forecast by approximately 2.5%.", "The company reported a 22% fall in first quarter profits in August 2004.", "Shares plummeted 20% after the warning."], "llama3.2:3b": ["Shares in Australian budget airline Virgin Blue plummeted 20% as the company warned of lower full-year profits due to sluggish demand and rising fuel costs, amid increased competition from rival Jetstar."], "gemma2:2b": ["Virgin Blue shares plummeted 20%, following a profit warning for the year ending March that predicts a decrease of 10-15%.", "The company attributed this to sluggish demand and competition from rival Jetstar, which has significantly impacted passenger numbers and profits.", "The airline's performance reflects ongoing challenges in the Australian domestic airline market."], "qwen2.5:0.5b": ["Virgin Blue's share price fell sharply after it warned of a lower profit forecast for the year.", "The airline reported a decline in passenger numbers and higher fuel costs, leading to reduced profits.", "Shares recovered slightly but remain lower than their initial prices due to market sentiment against Virgin Blue.", "Patrick Corporation, which owns 46% of Virgin Blue, has also seen its shares drop."], "qwen2.5:1.5b": ["Australian budget airline Virgin Blue saw a 20% decline in stock price following an earnings warning that profits would fall between 10%-15%, citing sluggish demand and rising fuel costs.", "The company, partially owned by Richard Branson, has faced challenges competing with rival Jetstar and cut its passenger forecast by approximately 2.5%.", "Virgin Blue's first quarter profits fell by 22% in August due to tough competition, while a 20% decline occurred earlier in November when there was decreased demand and increased fuel costs.", "It launched four years ago, now holding about one-third of Australia's domestic airline market and faces strong competition from Qantas's Jetstar.", "Virgin Blue's Sydney-listed shares recovered slightly but were still down by 12% on Wednesday; major shareholder Patrick Corporation's share price dropped 31%."], "qwen2.5:3b": ["Virgin Blue shares fell 20% after warning of a significant year-over-year profit decline.", "The airline expects profits to be between 10% and 15% lower than in the previous year, attributing this to sluggish demand throughout November and December 2004.", "CEO Brett Godfrey noted that Virgin Blue has been under pressure from rival Jetstar since its launch four years ago.", "The company reduced its full-year passenger forecast by approximately 2.5%, following a 22% profit drop in the first quarter and a 17% drop for the first half of the year due to increased competition, particularly from Qantas' budget airline Jetstar.", "Virgin Blue now holds about one-third of Australia's domestic market share."], "opencoder:1.5b": ["The output will be a concise summary of the provided text that preserves key details:\n\n\"Virgin Blue shares plunged 20% after it reported a steep fall in full year profits.", "It said profits after tax for the year to March would be between 10% and 15% lower than the previous year.", "The company has struggled to fend off pressure from its rival Jetstar in November and December 2004.", "The launch of the airline came four years ago, and now has roughly one third of Australia's domestic airline market.", "The national carrier Qantas has also fought back with Jetstar launched in May 2004.\""], "smollm:1.7b": ["Virgin Blue shares plummeted 20% after Virgin Blue warned of a steep fall in full year profits.", "The airline's share price fell 12% on Wednesday as it reported a 22% decline in first quarter profits due to tough competition and rising fuel costs.", "Virgin Blue, which is 25% owned by Richard Branson, has been struggling to fend off pressure from rival Jetstar.", "It cut its full year passenger number forecast by \"approximately 2.5%\".", "Virgin Blue reported a 22% fall in first quarter profits in August 2004 due to tough competition and rising fuel costs.", "In November, first half profits were down due to slack demand and rising fuel costs.", "Virgin Blue was launched four years ago and now has roughly one third of Australia's domestic airline market.", "But the national carrier, Qantas, has fought back with its own budget airline, Jetstar, which took to the skies in May 2004.", "Sydney-listed Virgin Blue's shares recovered slightly to close 12% down on Wednesday.", "Shares in its major shareholder, Patrick Corporation - which owns 46% of Virgin Blue - had dropped 31% by the close."], "deepseek-r1:1.5b": ["Virgin Blue experienced a 20% drop in its stock price due to significant profitability concerns, warning of a steep fall in full-year profits.", "The CEO, Brett Godfrey, noted a 10-15% decrease in profits after tax and highlighted sluggish demand for November and December, contributing to the profit decline.", "Virgin Blue also reduced its full-year passenger number forecast by approximately 2.5%.", "However, despite this, first-quarter profits were down due to tough competition from Jetstar and rising fuel costs.", "Qantas faces a similar challenge but operates as an independent major player.", "Sydney-listed Virgin Blue shares slightly recovered, closing up 12% compared to last week's high.", "Meanwhile, Richard Branson's 25% ownership in the company declined by 31%, reflecting broader market volatility caused by competitors' actions and Virgin Blue's share size."], "tinyllama:1.1b": ["In response to the warning from Australian budget airline Virgin Blue, shares in the company plunged 20%, slipping below the level of a decline recorded in February.", "The plummet is attributed to a steep fall in full year profit estimates, which are lower than those announced last year.", "Share prices also fell after Virgin Blue reported a 22% drop in first quarter profits due to competition and rising fuel costs.", "Despite this, Virgin Blue still aims for a 10%-15% fall in full year profits due to the steep decline in demand, as well as increased competition from Jetstar, which recently launched its own budget airline.", "The company also reported a 22% drop in first half profits, but this was largely due to slower demand in November and December, with sluggish demand reported earlier for November and now December 2004."], "tinydolphin:1.1b": [" In January, Virgin Blue reported a significant drop in profits after warning about lower full year profits compared to previous years due to pressure from rival Jetstar.", "The airline's shares fell by over 20% before recovering slightly on Wednesday when shares recovered and closed down 12%.", "However, its major shareholder, Patrick Corporation, experienced a significant drop in value following the announcement of lower full year profits.", "As a result, Virgin Blue's shares have been plummeting recently."], "phi:2.7b": [" Virgin Blue's profits after tax for the year to March will be between 10% to 15% lower than the previous year due to a steep drop in full year profits of 20%.", "The airline reported that sluggish demand continued for November and December and predicted further losses for the full year.", "Virgin Blue has been under pressure from rival Jetstar, and its shares have dropped 12% since August.", "Its parent company, Patrick Corporation, has also seen a 31% decrease in their share value."], "orca-mini:3b": [" Virgin Blue shares fell 20% after it warned of lower profits for the year ending March 2005.", "The airline said demand was slack and fuel costs were high, causing a 22% drop in first quarter profits.", "Its passenger numbers were down by approximately 2.5%.", "However, the share price of Virgin Blue's major shareholder, Patrick Corporation, dropped 31%.", "Virgin Blue has been competing with rival Jetstar since May 2004."], "hermes3:3b": ["Virgin Blue shares drop 20% after predicting lower full year profits and reduced passenger numbers due to competition from rival Jetstar."], "stablelm-zephyr:3b": ["Virgin Blue's shares fell 20% after revealing a decline in full-year profits between 10%-15%.", "The airline cited \"sluggish demand\" for November and December 2004, as well as competition from Jetstar.", "Virgin Blue now holds one-third of Australia's domestic airline market but faces increased pressure from rival Jetstar, owned by national carrier Qantas."], "chatgpt-4o-latest": ["Virgin Blue shares fell 20% after warning of a 10-15% drop in full-year profits due to sluggish demand.", "The airline, 25% owned by Richard Branson, has struggled against competition from Jetstar and reduced its passenger forecast by 2.5%.", "It previously reported a 22% fall in first-quarter profits and lower first-half profits due to weak demand and rising fuel costs.", "Virgin Blue, which holds a third of Australia's domestic market, faces strong competition from Qantas' budget airline, Jetstar.", "By market close, Virgin Blue shares had recovered slightly to end 12% down, while major shareholder Patrick Corporation saw a 31% drop."], "stablelm2:1.6b": ["Virgin Blue's shares fell 2% due to a drop in full-year profits, with profits for the year after tax projected between 10% and 9% lower than the previous year.", "This is largely attributed to \"sluggish demand\" in November and December and ongoing competition from rival Jetstar.", "The airline has been struggling against budget airline Jetstar since its launch four years ago."], "granite3.1-dense:2b": ["Virgin Blue, a 25%-owned subsidiary of Richard Branson's empire and an Australian budget airline with about one-third of the domestic market, saw its shares plummet 20%.", "The company forecast profits after tax for FY2004 to range between 10% to 15% lower than the prior year due to sluggish demand in November and December 2004.", "This decline follows a 22% drop in first-quarter profits reported in August 2004, attributed to intense competition from rival Jetstar, launched by national carrier Qantas in May 2004.", "Virgin Blue's passenger forecast for the year was cut by approximately 2.5%.", "Despite these challenges, shares recovered slightly at close, but Patrick Corporation, a major shareholder with 46% of Virgin Blue, experienced a more significant 31% drop."]}