{"raw_text": "Saudi NCCI's shares soar\n \n Shares in Saudi Arabia's National Company for Cooperative Insurance (NCCI) soared on their first day of trading in Riyadh.\n \n They were trading 84% above the offer price on Monday, changing hands at 372 riyals ($99; £53) after topping 400 early in the day. Demand for the insurer's debut shares was strong - 12 times what was on sale. The listing was part of the country's plans to open up its insurance market and boost demand in the sector. Deregulation is expected to boost demand for accident and damage cover.\n \n Previously, only NCCI has been legally allowed to offer insurance products within Saudi Arabia. However, the authorities have turned a blind eye to the many other firms selling insurance. Saudi Arabia now wants a fully functioning insurance industry and is introducing legislation that will clamp down on unauthorised companies. Policy-makers also want to make having insurance more of a requirement, but first have to take steps to boost public confidence in the system, analysts said. As a result, NCCI is being developed as the industry's flagship firm - publicly-listed, with audited accounts. Saudi Arabia sold 7 million NCCI shares, or about 70% of the company's total capital last month. More than 800,000 applicants got 9 shares each for 205 riyals apiece.\n", "llama3.2:1b": ["Saudi NCCI shares soar on their first day of trading at 372 riyals ($99) after being offered at 84% above the initial price and topping 400 per share early in the day.", "Demand was strong, with sales reaching 12 times what was available to buy.", "The listing is part of Saudi Arabia's plans to open up its insurance market and boost demand for accident and damage cover through deregulation."], "llama3.2:3b": ["Shares in Saudi Arabia's National Company for Cooperative Insurance rose 84% on their first day of trading, trading at 372 riyals ($99; £53), with demand 12 times the available amount.", "The listing aims to boost demand and establish a fully functioning insurance industry, as deregulation is expected to increase demand for accident and damage cover.", "NCCI was previously the only legal insurer in Saudi Arabia, but the government plans to introduce legislation to clamp down on unauthorized companies and make having insurance mandatory."], "gemma2:2b": ["Saudi National Company for Cooperative Insurance (NCCI)'s shares surged 84% above their offer price on their first day of trading in Riyadh.", "Strong demand and the deregulation of the insurance market contributed to this success.", "The listing is a significant step towards creating a fully functional insurance industry in Saudi Arabia, with NCCI becoming its flagship company."], "qwen2.5:0.5b": ["Saudi Arabia's National Company for Cooperative Insurance (NCCI) has soared in market demand.", "Shares are trading at an average price of 372 Saudi Riyals ($99), with a high of 400 rials.", "Deregulation plans include making the industry fully functioning and requiring insurance as a necessity, which would boost sales.", "NCCI is developing as the company's flagship.", "It has sold 7 million shares to raise 850,000 investors each for an offering price of 205 Saudi Riyals apiece."], "qwen2.5:1.5b": ["Shares in Saudi Arabia's NCCI rose significantly after listing on Monday, soaring over 84%.", "The initial public offering was oversubscribed 12 times with demand exceeding expectations.", "Regulatory changes aimed at opening up the insurance market and boosting consumer interest are expected to follow."], "qwen2.5:3b": ["Saudi NCCI's shares surged significantly on their first day of trading in Riyadh, with prices reaching 372 riyals ($99; £53), up to 84% above the offer price and 12 times oversubscribed.", "This listing is part of Saudi Arabia’s efforts to open its insurance market and boost demand for the sector, following deregulation and plans to enhance public confidence in the industry through new regulations requiring more companies to be licensed.", "NCCI has been allowed to sell insurance products legally, but now, with this listing, it aims to become the flagship firm, publicly listed and with audited accounts, aiming to serve as a model for others seeking to enter the market.", "Saudi Arabia sold 7 million shares last month, allowing over 800,000 applicants to purchase them at 205 riyals each."], "opencoder:1.5b": ["Saudi National Company for Cooperative Insurance (NCCI) shares in Saudi Arabia rose on their first trading day to 84% above the offer price on Monday.", "This significant surge changed the hands of the insurer at 372 riyals ($99; £53) while topping the previous high in the market.", "The demand for the insurer's debut product increased significantly, matching the increase seen in sales.", "The addition of new regulations and a shift towards more public ownership have heightened demand for insurance.", "Previously, only NCCI had been legally allowed to offer insurance products within Saudi Arabia due to restrictions imposed by the company's previous owners.", "However, with the aid of the authorities, other firms selling insurance turned their eyes on it, leading to increased competition and uncertainty.", "The new legislation in place will restrict any unauthorised trading of the NCCI, strengthening its status as a fully functioning industry.", "The addition of public confidence is another strategic factor for investors.", "As more businesses are integrated into the insurance market, analysts expect to see growth in this sector which boosts public confidence and investment opportunities.", "Additionally, the increased demand for accident and damage cover has met with increased interest from customers who require comprehensive coverage under certain circumstances.", "Lastly, as a result of these changes, NCCI is now recognized as the flagship firm publicly-listed, with audited accounts.", "Saudi Arabia's sales during the trading period are worth about 7 million shares of the company, representing approximately 70% of the company's total capital.", "Despite these new developments, it remains an industry ripe with growth and opportunity for growth.", "The NCCI continues to attract investment due to its significant market share and potential for growing business."], "smollm:1.7b": ["Saudi NCCI's shares soared on their first day of trading in Riyadh, with they being traded at 372 riyals ($99; £53) after topping 400 early in the day.", "Demand for the insurer's debut shares was strong - 12 times what was on sale.", "The listing was part of the country's plans to open up its insurance market and boost demand in the sector.", "Deregulation is expected to boost demand for accident and damage cover.", "Saudi Arabia now wants a fully functioning insurance industry and is introducing legislation that will clamp down on unauthorised companies.", "Saudi Arabia previously only NCCI has been legally allowed to offer insurance products within Saudi Arabia, but the authorities have turned a blind eye to many other firms selling insurance.", "Saudi Arabia now wants a fully functioning insurance industry and is developing legislation that will boost public confidence in the system, analysts said.", "As a result, NCCI is being developed as the industry's flagship firm - publicly-listed, with audited accounts.", "Saudi Arabia sold 7 million NCCI shares, or about 70% of the company's total capital last month.", "More than 800,000 applicants got 9 shares each for 205 riyals apiece."], "deepseek-r1:1.5b": ["Saudi NCCI Shares Sealed a Surge  \nOn their first trading day in Riyadh, Saudi NCCI shares surged, reaching 84% above their offer price.", "The initial transaction volume was approximately 372 riyals ($99, £53), setting a record.", "Demand for the shares was 12 times higher than when they went public.", "Deregulation is expected to boost demand in the insurance sector, with NCCI aiming to become a key player through public listings.", "The company aims to attract more applicants and gain public confidence by promoting its insurance products."], "tinyllama:1.1b": ["In Saudi Arabia, shares in the newly-listed National Company for Cooperative Insurance (NCCI) soared by a factor of more than 84 on their first day of trading in Riyadh.", "The offering attracted an overwhelming amount of interest - over 12 times what was on sale - and changed hands at 372 riyals ($99; £53) by the end of the day, despite being a relatively small size.", "Deregulation in the insurance market is expected to boost demand, with the authorities planning to introduce legislation that will put more emphasis on having fully functioning insurance systems.", "NCCI is being developed as the industry's flagship firm, publicly-listed, and aimed at boosting public confidence in the system.", "Approximately 7 million shares were sold, or about 70% of the company's total capital, last month, reflecting strong demand for the new products on offer."], "tinydolphin:1.1b": [" The Saudi National Co-operative Insurance (NCCI) shares soared dramatically on their first trading day in Riyadh, selling at almost 400 riyals ($99; £53) each, a record-breaking high.", "This marked the beginning of Saudi Arabia's ambitious plan to open up its insurance market and boost demand for accident and damage cover.", "However, previous attempts to regulate the industry have been met with impunity by authorities, who seem to believe that only NCCI can offer comprehensive coverage.", "The new legislation aims to bring stability and clarity to the sector, forcing unregarded companies to shut down their operations.", "Policy-makers are also keen on increasing public confidence in the system, as illustrated by the listing of Saudi Arabia's largest insurer on the stock market.", "The NCCI shares were quoted at a record high of 372 riyals ($99; £53), with investors eagerly anticipating their inclusion in the official records."], "phi:2.7b": [" The opening of Saudi Arabia's insurance market has led to a surge in demand for the country's National Company for Cooperative Insurance (NCCI) shares, which are 84% above their offer price.", "Demand was so strong that 12 times more shares were requested than available.", "Previously, only NCCI was allowed to sell insurance products in Saudi Arabia, but now authorities plan to open up the sector and boost demand through deregulation, making it mandatory for people to have insurance.", "The NCCI is being developed as a flagship firm with public listing, audited accounts, and 7 million shares sold at 200 riyals each to over 800,000 applicants."], "orca-mini:3b": [" The share prices of Saudi Arabia's National Company for Cooperative Insurance (NCCI) soared on their first day of trading in Riyadh, with demand being strong and the shares being traded at a premium of 84% above the offer price.", "NCCI is being developed as the industry's flagship firm, with the aim of publicly listing and having audited accounts.", "The insurance market in Saudi Arabia is expected to be fully functional, and the authorities are planning to clamp down on unauthorized companies to boost confidence in the system."], "hermes3:3b": ["Saudi NCCI shares soaring\nNCCI shares traded 84% above offer price on first trading day\nStrong demand (12x sale amount), as part of market opening & boosting sector\nOnly legally allowed insurer; authorities allow many unauthorised ones\nDeregulation expected to increase accident/damage cover demand"], "stablelm-zephyr:3b": ["Saudi Arabia's National Company for Cooperative Insurance (NCCI) began trading in Riyadh and saw its shares soar 84% above the offer price on its first day.", "The strong demand for NCCI's debut shares was 12 times higher than what was available.", "Deregulation is expected to increase demand for accident and damage insurance, as Saudi Arabia aims to create a fully functioning insurance industry and clamp down on unauthorized companies.", "NCCI is being developed as the industry's flagship firm, publicly-listed with audited accounts.", "Last month, Saudi Arabia sold 7 million NCCI shares, representing about 70% of the company's total capital, with over 800,000 applicants receiving 9 shares each for 205 riyals apiece."], "chatgpt-4o-latest": ["Shares in Saudi Arabia's National Company for Cooperative Insurance (NCCI) surged 84% above the offer price on their first trading day in Riyadh, reflecting strong demand—12 times the available shares.", "The listing is part of Saudi Arabia's efforts to open its insurance market and boost demand, with deregulation expected to increase coverage for accidents and damages.", "Previously, NCCI was the only legal insurer, though many firms operated unofficially.", "The government now aims to establish a regulated insurance industry, enforce legislation against unauthorized firms, and build public confidence.", "NCCI is being positioned as the sector's flagship company, with 70% of its capital sold last month, distributing 7 million shares to over 800,000 applicants at 205 riyals each."], "stablelm2:1.6b": ["Saudi Arabian National Company for Cooperative Insurance (NCCI) shares saw a significant increase on their first day of trading in Riyadh, with demand surpassing initial expectations.", "The NCCI was priced at 1.01 against the offer price, changing hands at 1 riyals ($0.12; £0.08).", "The strong demand for debut shares led to an 80% increase compared to early trading hours.", "Deregulation in Saudi Arabia's insurance market is expected to boost demand for accident and damage cover.", "Previously only NCCI was legally allowed to offer insurance products within the country, but authorities have neglected other firms selling insurance.", "To achieve a fully functioning insurance industry, legislation aiming to limit unauthorised companies and promote mandatory insurance coverage is being introduced.", "The NCCI shares were sold at 7 million units or about 10% of the company's total capital."], "granite3.1-dense:2b": ["Saudi Arabia's National Company for Cooperative Insurance (NCCI) shares surged by 84% on their debut day of trading in Riyadh, reaching 372 riyals ($99; £53).", "This robust demand was 12 times higher than the shares available.", "The listing marks the beginning of Saudi Arabia's efforts to liberalize its insurance market and stimulate interest in accident and damage cover, following deregulation plans.", "Previously, only NCCI could offer insurance; now, authorities aim to regulate unauthorized firms.", "Analysts predict boosting public trust is crucial before making insurance mandatory.", "NCCI, being the flagship company, is publicly traded with audited financials.", "The government sold 7 million shares (approximately 70% of NCCI's total capital) last month, with over 800,000 applicants each receiving nine shares at 205 riyals apiece."]}