{"raw_text": "JP Morgan admits US slavery links\n \n Thousands of slaves were accepted as collateral for loans by two banks that later became part of JP Morgan Chase.\n \n The admission is part of an apology sent to JP Morgan staff after the bank researched its links to slavery in order to meet legislation in Chicago. Citizens Bank and Canal Bank are the two lenders that were identified. They are now closed, but were linked to Bank One, which JP Morgan bought last year. About 13,000 slaves were used as loan collateral between 1831 and 1865.\n \n Because of defaults by plantation owners, Citizens and Canal ended up owning about 1,250 slaves. \"We all know slavery existed in our country, but it is quite different to see how our history and the institution of slavery were intertwined,\" JP Morgan chief executive William Harrison and chief operating officer James Dimon said in the letter. \"Slavery was tragically ingrained in American society, but that is no excuse.\" \"We apologise to the African-American community, particularly those who are descendants of slaves, and to the rest of the American public for the role that Citizens Bank and Canal Bank played.\" \"The slavery era was a tragic time in US history and in our company's history.\" JP Morgan said that it was setting up a $5m scholarship programme for students living in Louisiana, the state where the events took place. The bank said that it is a \"very different company than the Citizens and Canal Banks of the 1800s\".\n", "llama3.2:1b": ["JP Morgan admits US slavery links, acknowledging that two banks now part of JP Morgan Chase (Citizens Bank and Canal Bank) were used to collateralize loans from these banks in the 1830s.", "The admission is as a result of researching its history and meeting legislation in Chicago requiring such disclosure."], "llama3.2:3b": ["JP Morgan admits to accepting slaves as collateral for loans by two banks that later became part of the bank: Citizens Bank and Canal Bank.", "About 13,000 slaves were used between 1831 and 1865.", "The bank apologized to the African-American community and the public for its role in slavery."], "gemma2:2b": ["JP Morgan Chase admitted to owning slaves as collateral for loans from two banks (Citizens Bank and Canal Bank) that later merged with JP Morgan's Bank One.", "The admission came in response to legislation requiring companies to acknowledge their historical links to slavery.", "About 13,000 slaves were used as collateral between 1831 and 1865.", "The bank apologized for the role of Citizens Bank and Canal Bank in perpetuating slavery.", "A $5 million scholarship program was announced to support students in Louisiana, where these events occurred."], "qwen2.5:0.5b": ["JP Morgan admitted that their two lenders, Citizens Bank and Canal Bank, had links to slavery before they became part of JP Morgan Chase.", "This admission was part of an apology sent by JP Morgan's CEO, William Harrison and his chief operating officer, James Dimon, after research into the bank's history showed a historical link between their banks' operations with slavery in the 1830s and 1840s.", "This led to the current financial dealings between the two banks, Citizens Bank and Canal Bank being linked to Bank One, which later became part of JP Morgan Chase.", "The admission highlighted that citizens were involved in a tragic history and highlighted the company's responsibility for past wrongdoings, as well as its commitment to justice in addressing historical injustices."], "qwen2.5:1.5b": ["JP Morgan acknowledges its connection to slavery through loans secured by African-American slaves.", "The apology includes setting up a $5m scholarship program for descendants of former slaves and recognizing the company's role as a descendant institution.", "The bank also apologizes for its historical ties to slavery, especially those tied to Citizens Bank and Canal Bank that were closed down decades ago but are linked to JP Morgan Chase."], "qwen2.5:3b": ["JP Morgan admits to US slavery links, apologizing for using thousands of slaves as loan collateral from 1831 to 1865 by two now-closed banks (Citizens Bank and Canal Bank) that were later acquired.", "The admission led to an apology letter to staff after a research project meeting legislation in Chicago.", "About 13,000 slaves were used for loans during this period, with Citizens and Canal owning about 1,250 by defaulting plantation owners.", "JP Morgan pledged a $5m scholarship program for Louisiana students as part of its efforts to set itself apart from the past."], "opencoder:1.5b": ["JP Morgan admits US slavery links to the banking world.", "Thousands of slaves were used as collateral for loans by two banks, which later became part of JP Morgan Chase.", "An apology was sent to JP Morgan staff after the bank researched its links to slavery in order to meet legislation in Chicago.", "The banks were closed and were linked to Bank One.", "About 13,000 slaves were involved between 18th and 26th centuries.", "The issue with plantation owners and defaults led to a loss of about 1,250 slaves.", "A tragic message was given to the African American community.", "It is a matter of changing American culture by setting up a scholarship programme for Louisiana students living in Louisiana."], "smollm:1.7b": ["The summary conveys the main ideas from the text:\n\n1.", "JP Morgan admitted US slavery links: Thousands of slaves were accepted as collateral for loans by two banks that later became part of JP Morgan Chase.", "2.", "The admission is part of an apology sent to JP Morgan staff after the bank researched its links to slavery in order to meet legislation in Chicago.", "Citizens Bank and Canal Bank are the two lenders that were identified.", "They are now closed, but were linked to Bank One, which JP Morgan bought last year.", "About 13,000 slaves were used as loan collateral between 1831 and 1865.", "3.", "Because of defaults by plantation owners: Citizens and Canal ended up owning about 1,250 slaves.", "\"We all know slavery existed in our country, but it is quite different to see how our history and the institution of slavery were intertwined,\" JP Morgan chief executive William Harrison and chief operating officer James Dimon said in the letter.", "\"Slavery was tragically ingrained in American society, but that is no excuse.\"", "4.", "The slavery era was a tragic time in US history and in our company's history: The apology sent to JP Morgan staff acknowledges the role of the two banks in perpetuating slavery.", "It also recognizes the suffering of the African-American community and the rest of the American public during this period."], "deepseek-r1:1.5b": ["JP Morgan admits slavery links due to research on American history.", "Two banks (Citizens and Canal Bank) were used as loan collateral before JP Morgan's acquisition last year.", "Defaults by plantation owners led to their acquisition of 1,250 slaves from 1831 to 1865.", "JP Morgan's CEO and COO issued an apology addressing the history and legacy of slavery, apologizing to African-American communities and others for their roles in the banks' operations.", "They apologize publicly for the impact these banks had on slavery's history.", "JP Morgan also established a $5 million scholarship program for Louisiana students."], "tinyllama:1.1b": ["JP Morgan acknowledged links between its two banks and slave trading in US slavery history, which led to thousands of collateralized loans with slaves being taken as a form of loan collateral.", "The two banks that were identified were Citizen's Bank and Canal Bank.", "Citizens was responsible for around 1,250 defaults by plantation owners, while Canal ended up owning about 1,368 slaves, amounting to around $5m in total slavery-era debt, but no excuse could be found.", "JP Morgan apologized to the African-American community and public for its role in slave trading, setting up a scholarship programme in Louisiana to help students affected by the events.", "The bank also offered a $5m fund to support students living in the state of Louisiana that was established specifically for those who lived there during slavery era."], "tinydolphin:1.1b": [" JPMorgan admitted that one of its banks was involved in accepting collateral for loans with slave owners.", "This admission comes as part of an effort to meet new legislation in Chicago, which requires lenders to identify their connections to slavery.", "The lenders identified in this case were Citizens Bank and Canal Bank.", "Both banks have now been closed, but about 13,000 slaves were used as collateral for their loans between 1831 and 1865.", "As a result of these defaults by plantation owners, the banks ended up owning approximately 1,250 slaves, and this information was disclosed in an apology letter sent to JPMorgan employees.", "The company's CEO, William Harrison, and CFO, James Dimon, expressed their regret for what happened during the slavery era.", "JP Morgan has established a $5 million scholarship programme for students living in Louisiana, where the events took place.", "This initiative is intended to help them understand the history of slavery and to promote education, as JPMorgan claims its new company is very different from those banks of the past."], "phi:2.7b": [" JP Morgan Chase has admitted its links to slavery in the United States by acknowledging that two banks it acquired in the past used thousands of slaves as collateral for loans.", "They are apologizing to the African-American community, particularly those who are descendants of slaves, and have set up a $5 million scholarship program for students living in Louisiana."], "orca-mini:3b": [" JP Morgan admitted to accepting thousands of slaves as collateral for loans from two banks that later became part of its Chase division.", "Citizens Bank and Canal Bank were identified as lenders who owned about 1,250 slaves during defaults.", "The institution of slavery was deeply ingrained in American society but JP Morgan expressed regret for its role and apologized to the African-American community, descendants of slaves, and the rest of the American public.", "The bank announced a $5 million scholarship program for students in Louisiana, where the events took place."], "hermes3:3b": ["JP Morgan Admits US Slavery Links\nJPMad admits historical slavery links via former banks Citizens Bank & Canal Bank, as loan collaterals (13000 slaves between 1831-1865)."], "stablelm-zephyr:3b": ["JP Morgan has admitted to discovering thousands of slaves used as collateral for loans by two banks, which later became part of JP Morgan Chase.", "These banks were Citizens Bank and Canal Bank, linked to Bank One, now acquired by JP Morgan.", "The admission came after the bank researched its connections to slavery in Chicago to meet legislation requirements.", "Around 13,000 slaves were used as collateral between 1831 and 1865 due to defaults by plantation owners.", "In an apology, JP Morgan's CEO William Harrison and COO James Dimon acknowledged the institution of slavery was intertwined with their history, and apologized to the African-American community and the American public.", "To rectify this, JP Morgan established a $5m scholarship program for students in Louisiana, where the events took place.", "The bank emphasized it is a \"very different company\" than the ones involved during that era."], "chatgpt-4o-latest": ["JP Morgan admitted that two predecessor banks, Citizens Bank and Canal Bank, accepted thousands of slaves as loan collateral between 1831 and 1865.", "Due to defaults, the banks ended up owning about 1,250 slaves.", "This admission came as part of research conducted to comply with Chicago legislation.", "In a letter to staff, JP Morgan executives acknowledged the bank's historical ties to slavery, apologized to the African-American community, and announced a $5 million scholarship program for students in Louisiana, where the events occurred.", "They emphasized that JP Morgan is now a very different institution from its predecessors."], "stablelm2:1.6b": ["JP Morgan acknowledged its involvement in accepting slaves as collateral for loans by two banks (later part of their own) during the slavery era, when these lenders became linked with Bank One.", "About 1,000 slaves were used as loan collateral between 1 and 5.", "Citizens and Canal Banks ended up owning some, while others like Canal and Citizens owned around 1,000 slaves.", "JP Morgan issued an apology to the African-American community for their past actions, promising a $5m scholarship program for students in Louisiana.", "They emphasize that they are now a \"very different company than the Citizen's and Canal Banks of the present.\""], "granite3.1-dense:2b": ["JP Morgan acknowledges its historical involvement with two banks—Citizens Bank and Canal Bank, now merged into Bank One before JP Morgan acquired it in 2004—which used about 13,000 slaves as collateral for loans between 1831 and 1865.", "Due to plantation owner defaults, these banks ultimately owned around 1,250 slaves.", "JP Morgan executives, William Harrison and James Dimon, issued an apology on behalf of the company to the African-American community and the American public, recognizing the deep-rooted, tragic nature of slavery in American history and their bank's past role.", "As part of the apology and reconciliation efforts, JP Morgan established a $5 million scholarship program for students in Louisiana, the state where these events occurred, emphasizing the significant differences between the Citizens and Canal Banks of the 1800s and today's JP Morgan."]}