{"raw_text": "Christmas sales worst since 1981\n \n UK retail sales fell in December, failing to meet expectations and making it by some counts the worst Christmas since 1981.\n \n Retail sales dropped by 1% on the month in December, after a 0.6% rise in November, the Office for National Statistics (ONS) said. The ONS revised the annual 2004 rate of growth down from the 5.9% estimated in November to 3.2%. A number of retailers have already reported poor figures for December. Clothing retailers and non-specialist stores were the worst hit with only internet retailers showing any significant growth, according to the ONS.\n \n The last time retailers endured a tougher Christmas was 23 years previously, when sales plunged 1.7%.\n \n The ONS echoed an earlier caution from Bank of England governor Mervyn King not to read too much into the poor December figures. Some analysts put a positive gloss on the figures, pointing out that the non-seasonally-adjusted figures showed a performance comparable with 2003. The November-December jump last year was roughly comparable with recent averages, although some way below the serious booms seen in the 1990s. And figures for retail volume outperformed measures of actual spending, an indication that consumers are looking for bargains, and retailers are cutting their prices.\n \n However, reports from some High Street retailers highlight the weakness of the sector. Morrisons, Woolworths, House of Fraser, Marks & Spencer and Big Food all said that the festive period was disappointing.\n \n And a British Retail Consortium survey found that Christmas 2004 was the worst for 10 years. Yet, other retailers - including HMV, Monsoon, Jessops, Body Shop and Tesco - reported that festive sales were well up on last year. Investec chief economist Philip Shaw said he did not expect the poor retail figures to have any immediate effect on interest rates. \"The retail sales figures are very weak, but as Bank of England governor Mervyn King indicated last night, you don't really get an accurate impression of Christmas trading until about Easter,\" said Mr Shaw. \"Our view is the Bank of England will keep its powder dry and wait to see the big picture.\"\n", "llama3.2:1b": ["UK retail sales fell in December by 1% after a 0.6% rise in November, marking the worst Christmas since 1981.", "Retailers like Morrisons, Woolworths, House of Fraser, Marks & Spencer, and Big Food reported disappointing results, while some others saw similar performances.", "The poor figures were echoed by Bank of England governor Mervyn King, who cautioned against reading too much into the data.", "Despite this, other retailers such as HMV, Monsoon, Jessops, Body Shop, and Tesco reported strong festive sales."], "llama3.2:3b": ["UK retail sales fell in December by 1% from November, with clothing retailers and non-specialist stores being the worst hit, while internet retailers saw significant growth.", "The last time retailers endured a tougher Christmas was 23 years ago, but some analysts point out that figures are comparable to 2003, and consumers may be looking for bargains due to price cuts."], "gemma2:2b": ["UK retail sales fell by 1% in December, marking the worst Christmas since 1981.", "This follows a 0.6% rise in November.", "Some retailers reported disappointing figures, but online retailers saw growth.", "The Bank of England's governor cautioned against drawing strong conclusions from the December data, as other factors could influence future performance.", "However, some high-street retailers experienced poor sales while others showed strong performance.", "Investec chief economist Philip Shaw does not expect the current retail figures to impact interest rates."], "qwen2.5:0.5b": ["Christmas sales in the UK fell short of expectations in December, the Office for National Statistics (ONS) reported, with retail sales down by 1% compared to November.", "Some retailers had already reported poor results for December; clothing stores and non-specialist shops were affected more than internet retailers, as shown by the ONS revision of annual growth rates from November to December.", "The ONS also highlighted that retail volume outperformed measures of actual spending, indicating a consumer desire for bargains and lower prices.", "However, some British retailers reported strong sales figures for Christmas 2004, which were well above last year's level."], "qwen2.5:1.5b": ["UK retail sales declined in December, marking it as the worst since 1981.", "Retailers reported poor performance across categories, with only internet retailers showing significant growth.", "Analysts acknowledged weak figures but noted that non-seasonally-adjusted data suggested comparable performances with previous years.", "Christmas shopping was deemed disappointing by several major chains and retailers, while some others reported robust sales.", "The Bank of England's governor advised caution in interpreting retail data."], "qwen2.5:3b": ["UK retail sales fell in December, marking the worst since 1981 according to some counts.", "Sales dropped by 1% month-on-month, after a 0.6% rise in November.", "The ONS revised annual growth from 5.9% to 3.2%.", "Retailers like clothing and non-specialist stores saw significant declines, while internet retailers had modest growth.", "Last similar performance was 23 years ago when sales dropped 1.7%.", "Despite some positives, reports from high street retailers highlight sector weakness.", "A British Retail Consortium survey found Christmas 2004 the worst in 10 years, though other retailers reported strong festive sales compared to last year.", "Investec chief economist Philip Shaw does not expect poor retail figures to impact interest rates immediately, as accurate Christmas trading impressions are usually available only after Easter."], "opencoder:1.5b": ["The key ideas and details in the text are:\n\n1.", "The UK retail sales were dropping in December.", "2.", "Despite a significant rise in November, the growth was not high enough to make it the worst Christmas ever.", "3.", "Retailers were reported to have struggled with a tough Christmas event.", "4.", "The last time retailers endured a tougher Christmas event was 23 years ago.", "5.", "From previous figures, it can be seen that the Christmas sales did not improve significantly compared to other years.", "6.", "The non-seasonally-adjusted figures showed comparable performance in comparison to 2003.", "7.", "Despite reports from some High Street retailers, the festive period was disappointing for retailers like Morrisons, Woolworths, House of Fraser, Marks & Spencer and Big Food.", "8.", "Investec chief economist Philip Shaw indicated he did not expect the poor retail figures to have any immediate effect on interest rates."], "smollm:1.7b": ["The summary should be:\nChristmas sales worst since 1981\nUK retail sales fell in December, failing to meet expectations and making it by some counts the worst Christmas since 1981.", "Retail sales dropped by 1% on the month in December, after a 0.6% rise in November, the Office for National Statistics (ONS) said.", "The ONS revised the annual 2004 rate of growth down from the 5.9% estimated in November to 3.2%.", "A number of retailers have already reported poor figures for December.", "Clothing retailers and non-specialist stores were the worst hit with only internet retailers showing any significant growth, according to the ONS.", "The last time retailers endured a tougher Christmas was 23 years previously, when sales plummeted 1.7%.", "The ONS echoed an earlier caution from Bank of England governor Mervyn King not to read too much into the poor December figures.", "Some analysts put a positive gloss on the figures, pointing out that the non-seasonally-adjusted figures showed a performance comparable with recent averages, although some way below the serious booms seen in the 1990s.", "And figures for retail volume outperformed measures of actual spending, an indication that consumers are looking for bargains, and retailers are cutting their prices.", "However, reports from some High Street retailers highlight the weakness of the sector.", "Morrisons, Woolworths, House of Fraser, Marks & Spencer and Big Food all said that the festive period was disappointing.", "However, other retailers - including HMV, Jessops, Body Shop and Tesco - reported that Christmas 2004 was the worst for 10 years.", "Investec chief economist Philip Shaw said he did not expect the poor retail figures to have any immediate effect on interest rates.", "\"The retail sales figures are very weak, but as Bank of England governor Mervyn King indicated last night, you don't really get an accurate impression of Christmas trading until about Easter,\" said Mr Shaw.", "\"Our view is the Bank of England will keep its powder dry and wait to see the big picture.\""], "deepseek-r1:1.5b": ["Retail sales in December 2004 fell by 1%, worse than expected, reflecting a 0.6% increase from November.", "Retailers faced poor performance: clothing and non-specialist stores had losses, while internet retailers saw minimal growth.", "Similar to 1981, retail sales dropped by 1.7%.", "Non-seasonally adjusted figures showed performance comparable to 2003.", "Last year's November-December jump was around last year's averages but slightly below recent booms in the 1990s.", "Volume outperformed actual spending, indicating consumers were looking for bargains and retailers cutting prices.", "High street stores noted disappointing sales.", "A BRC survey found 2004 as the worst decade since 1981.", "Other retailers like HMV reported strong performance.", "Analysts saw positive signs despite warnings from King, who emphasized waiting to see broader economic trends."], "tinyllama:1.1b": ["The UK retail sales fell in December, despite a 0.6% rise in November, falling below expectations and making it by some counts the worst Christmas since 1981.", "Retailers suffered poor figures, with only internet retailers showing any significant growth.", "The Bank of England Governor Mervyn King cautioned against reading too much into the poor December figures, stating that the non-seasonally-adjusted figures showed a performance comparable with previous years, while some analysts saw it as a comparison to 2003.", "Figures for retail volume outperformed measures of actual spendings, indicating consumer interest, while reports from High Street retailers highlighted the weakness of the sector, with Christmas 2004 being the worst since 1981.", "British Retail Consortium survey found that Christmas sales were well up on last year, and the worst for 10 years, though other retailers reported better-than-expected figures, including HMV, Monsoon, Jessops, Body Shop, and Teacos.", "As the Bank of England will keep powder dry and wait to see the big picture, the UK economy is expected to continue growing in 2014."], "tinydolphin:1.1b": [" The UK retail sales fell by 1% on the month in December, according to the Office for National Statistics (ONS).", "This marks the worst Christmas sales since 1981.", "Despite this poor performance, some retailers are reporting positive figures, with sales up 4.7% compared to the same period last year.", "Analysts have expressed concern over the lack of a sustained improvement in sales, suggesting that the recent decline could be a temporary blip or a sign that consumer confidence is waning.", "The retail sales figures also come amidst concerns about slow economic growth and uncertainty surrounding the financial markets."], "phi:2.7b": [" UK retail sales fell in December, making it one of the worst Christmas seasons since 1991-1992.", "The Office for National Statistics (ONS) revised the annual growth down from 5.9% in November to 3.2%, with clothing retailers and non-specialist stores experiencing the most significant drop.", "However, some analysts note that the figures are not as bad as they seem, as the non-seasonally adjusted data shows a performance comparable to 2003.", "Despite this, several High Street retailers reported disappointing sales, leading to concerns about future economic growth.", "Overall, it is unlikely that these poor figures will have an immediate effect on interest rates, according to Investec chief economist Philip Shaw."], "orca-mini:3b": [" UK retail sales fell by 1% in December, the worst Christmas since 1981, revised down from 5.9% growth in November.", "Clothing retailers and non-specialist stores were hit hardest, while internet retailers showed some growth.", "The ONS echoed caution from Bank of England governor Mervyn King not to read too much into the poor December figures, and noted that retail volume outperformed measures of actual spending.", "Some High Street retailers reported weak festive periods, but other retailers including HMV, Monsoon, Jessops, Body Shop, and Tesco reported better sales compared to last year.", "The British Retail Consortium survey found that Christmas 2004 was the worst for 10 years, but the Bank of England will keep interest rates low until the big picture is seen."], "hermes3:3b": ["UK retail sales fell by 1% in December, the worst since 1981.", "Decreased from 5.9% estimated earlier to 3.2%, based on ONS data.", "Negative impact on retailers like clothing stores, non-specialist shops, while internet retailers grew slightly."], "stablelm-zephyr:3b": ["Retail sales in the UK fell 1% in December 2004, making it the worst Christmas since 1981 according to the Office for National Statistics.", "Clothing retailers and non-specialist stores suffered the most, with internet retailers being the only significant growers.", "Although some analysts point out that the non-seasonally-adjusted figures are comparable to 2003, High Street retailers like Morrisons, Woolworths, House of Fraser, Marks & Spencer, and Big Food reported disappointing festive periods.", "The British Retail Consortium survey indicated that Christmas 2004 was the worst in 10 years, but other retailers reported sales well up on the previous year.", "Investec chief economist Philip Shaw believes that the Bank of England will wait to see the bigger picture before making any decisions regarding interest rates."], "chatgpt-4o-latest": ["UK retail sales fell by 1% in December, making it the worst Christmas for retailers since 1981.", "The Office for National Statistics (ONS) revised annual growth for 2004 down to 3.2% from an earlier estimate of 5.9%.", "Clothing retailers and non-specialist stores were hit hardest, while internet retailers saw growth.", "Some analysts noted that non-seasonally-adjusted figures were comparable to 2003, and consumer spending focused on bargains.", "Major retailers like Morrisons, Woolworths, and Marks & Spencer reported disappointing sales, while others, including HMV and Tesco, saw strong growth.", "The British Retail Consortium called it the worst Christmas in a decade.", "Despite weak figures, analysts do not expect an immediate impact on interest rates, with Bank of England governor Mervyn King cautioning against drawing conclusions too soon."], "stablelm2:1.6b": ["UK retail sales fell by 1% in December, making it the worst Christmas since at least 2014 according to the Office for National Statistics (ONS).", "The ONS revised the annual growth rate down from 5.9% to 3.2%.", "Clothing retailers and non-specialist stores were hit hardest with only internet retailers showing any significant growth.", "Last year, sales plunged by 1.7%, which was the worst performance since 2012.", "However, some analysts put a positive gloss on the figures, pointing out that non-seasonally-adjusted data showed comparable performance to 2013."], "granite3.1-dense:2b": ["UK retail sales in December 2004 marked their worst performance since 1981, with a 1% decrease month-over-month, falling short of expectations.", "Annual growth was revised from 5.9% to 3.2%.", "Clothing and non-specialist stores suffered the most, while internet retailers showed some growth.", "The last comparable Christmas was in 1981, when sales fell by 1.7%.", "Despite initial concerns, some analysts noted that non-seasonally adjusted figures mirrored 2003's performance, indicating price-conscious consumer behavior.", "However, numerous High Street retailers, including Morrisons, Woolworths, House of Fraser, Marks & Spencer, and Big Food, reported disappointing festive sales.", "The British Retail Consortium survey confirmed 2004 as the worst Christmas in a decade.", "Some retailers like HMV, Monsoon, Jessops, Body Shop, and Tesco experienced robust sales.", "Investec chief economist Philip Shaw expected no immediate impact on interest rates, citing that significant Christmas trading trends wouldn't be apparent until Easter."]}