{"raw_text": "Businesses fail to plan for HIV\n \n Companies fail to draw up plans to cope with HIV/Aids until it affects 20% of people in a country, new research says.\n \n The finding comes in a report published on Thursday by the World Economic Forum, Harvard and the UN aids agency. \"Too few companies are responding proactively to the social and business threats,\" said Dr Kate Taylor, head of the WEF's global Health Initiative. Nearly 9,000 business leaders in 104 countries were surveyed for Business and HIV/AIDS: Commitment and Action?\n \n Dr Taylor described the level of action taken by businesses as revealed by the report as \"too little, too late\". The issue will be highlighted to business and world leaders at the World Economic Forum, which meets in Davos, Switzerland, next week. The WEF report shows that despite the fact that 14,000 people contract HIV/Aids every day, concern among businesses has dropped by 23% in the last 12 months. Most (71%) have no policies in place to address the disease. Nor could over 65% of the business leaders surveyed say or estimate the prevalence of HIV among their staff. The UN programme tackling Aids, UNAIDS, pointed out that having a clear strategy for dealing with HIV/Aids was a good investment as well as being socially responsible.\n \n One company that does have a plan is Anglo-American, the international mining company, which estimates an HIV prevalence of 24% among its 130,000-strong Southern African workforce.\n \n Over the last two years the company has implemented extensive voluntary counselling and testing for HIV infection, coupled with anti-retroviral therapy for employees progressing to Aids. Over 90% of the 2,200 employees who have accessed and remained on treatment are well and have returned to normal work. \"Effective action on HIV/Aids is synonymous with good business management and leads to more profitable and sustainable operations,\" said Brian Brink, senior vice-president, health, at Anglo-American.\n \n \"Companies should encourage all workers to know their HIV status, making it as routine as monitoring blood pressure or cholesterol,\" he said. \"Providing access to treatment is a critical part of this.\" Across sub-Saharan Africa, even in countries with an HIV prevalence of 10-19%, only around 7% of companies have formal HIV/Aids policies in place, according to the report. The gap is even wider in China, Ethiopia, India, Nigeria and Russia, the so-called \"next wave\" countries, which are predicted to experience the highest numbers of new HIV/Aids cases worldwide by 2010. The report adds \"an important building block to our understanding of how the business community is experiencing the HIV/Aids epidemic and to whether and how it is reacting,\" said David Bloom, professor of economics and demography at the Harvard School of Public Health.\n \n The WEF report concludes that businesses need to understand their exposure to HIV/Aids risks and come up with good local practices to manage them. A key priority, in both high and low-prevalence settings, said the WEF is to establish a policy based on non-discrimination and confidentiality.\n", "llama3.2:1b": ["Businesses fail to plan for HIV due to lack of action until it affects 20% of people in a country, according to research by World Economic Forum, Harvard, and UN aids agency.", "Research found that nearly 9,000 business leaders surveyed had no policies in place to address the disease, with most lacking confidence estimates or knowledge about its prevalence among their staff."], "llama3.2:3b": ["Businesses fail to plan for HIV/AIDS until it affects 20% of people in a country.", "Only 71% have no policies in place, while 65% cannot estimate HIV prevalence among staff.", "A few companies, like Anglo-American, have implemented effective strategies.", "Businesses should encourage workers to know their status and provide access to treatment, say experts."], "gemma2:2b": ["Businesses are unprepared for HIV/AIDS, delaying proactive planning until 20% of the population is affected.", "The report reveals that businesses are taking too little action to address the disease despite increasing prevalence and a significant drop in awareness over time.", "Many companies lack policies or accurate data about HIV/AIDS within their workforce.", "However, Anglo-American demonstrates positive examples with extensive programs for testing, treatment, and return to work for affected employees.", "Despite this, only 7% of companies have formal HIV/Aids policies in place across sub-Saharan Africa.", "This gap is even wider in China, Ethiopia, India, Nigeria, and Russia as these countries are expected to experience the most new HIV cases by 2010.", "The report stresses that businesses must understand HIV/AIDS risks and develop good local practices for management, especially with respect to non-discrimination and confidentiality policies."], "qwen2.5:0.5b": ["Companies don't plan for or have policies in place to deal with HIV/AIDS until 20% of people are affected.", "Companies lack awareness about their exposure to HIV/AIDS risks.", "The report states that companies should develop local practices to manage these exposures."], "qwen2.5:1.5b": ["Businesses fail to plan for HIV/AIDS until it affects 20% of their employees globally, new research finds.", "Nearly all businesses lack plans to address the disease, leaving companies \"too little, too late\" in addressing social and business threats posed by HIV/AIDS.", "The World Economic Forum's report reveals concern among businesses has dropped by 23% over the past year.", "Only a small percentage (9%) have formal policies in place for managing HIV/AIDS risks, with many not even knowing the prevalence of the disease within their workforce.", "Companies like Anglo-American mining company have implemented effective strategies to address HIV/AIDS, including voluntary counseling and testing programs coupled with anti-retroviral therapy for infected employees.", "However, the report highlights that despite high rates of new infections globally, only 10% of companies in sub-Saharan Africa and \"next wave\" countries have established policies addressing the disease.", "The research concludes businesses need to understand their exposure to HIV/AIDS risks and establish local practices based on non-discrimination and confidentiality."], "qwen2.5:3b": ["Businesses fail to plan for HIV/AIDS until it affects 20% of people in a country, according to new research from the World Economic Forum, Harvard, and UNAIDS.", "The report indicates that nearly 9,000 business leaders surveyed are not taking proactive steps despite rising daily HIV/AIDS cases (14,000).", "Only one in four business leaders has policies addressing HIV/AIDS among their workforce, and just over half cannot estimate the prevalence of HIV.", "Anglo-American is an example of a company with a plan; they have implemented voluntary counseling and testing for HIV infection, along with anti-retroviral therapy for employees progressing to AIDS.", "However, only about 7% of companies in sub-Saharan Africa and even fewer in China, Ethiopia, India, Nigeria, and Russia have formal policies addressing HIV/AIDS.", "The WEF recommends understanding exposure risks and establishing non-discriminatory confidentiality-based policies in both high and low prevalence settings."], "opencoder:1.5b": ["Businesses fail to plan for HIV\n\nCompanies fail to draw up plans to cope with HIV/Aids until it affects 20% of people in a country, new research says.", "The finding comes in a report published on Thursday by the World Economic Forum, Harvard and the UN aids agency.", "\"Too few companies are responding proactively to the social and business threats,\" said Dr Kate Taylor, head of the WEF's global Health Initiative.", "Nearly 9,000 business leaders in 104 countries were surveyed for Business and HIV/AIDS: Commitment and Action?", "Dr Taylor described the level of action taken by businesses as revealed by the report as \"too little, too late\".", "The issue will be highlighted to business and world leaders at the World Economic Forum, which meets in Davos, Switzerland, next week.", "The WEF report shows that despite the fact that 14,000 people contract HIV/Aids every day, concern among businesses has dropped by 23% in the last 12 months.", "Most (71%) have no policies in place to address the disease.", "Nor could over 65% of the business leaders surveyed say or estimate the prevalence of HIV among their staff.", "One company that does have a plan is Anglo-American, the international mining company, which estimates an HIV prevalence of 24% among its 130,000-strong Southern African workforce.", "Over the last two years the company has implemented extensive voluntary counselling and testing for HIV infection, coupled with anti-retroviral therapy for employees progressing to Aids.", "Over 90% of the 2,200 employees who have accessed and remained on treatment are well and have returned to normal work.", "\"Effective action on HIV/Aids is synonymous with good business management and leads to more profitable and sustainable operations,\" said Brian Brink, senior vice-president, health, at Anglo-American.", "\"Companies should encourage all workers to know their HIV status, making it as routine as monitoring blood pressure or cholesterol,\" he said.", "\"Providing access to treatment is a critical part of this.\"", "Across sub-Saharan Africa, even in countries with an HIV prevalence of 10-19%, only around 7% of companies have formal HIV/Aids policies in place, according to the report.", "The gap is even wider in China, Ethiopia, India, Nigeria and Russia, the so-called \"next wave\" countries, which are predicted to experience the highest numbers of new HIV/Aids cases worldwide by 20th century."], "smollm:1.7b": ["The summary of the text above should be:\n\n1.", "Businesses fail to plan for HIV/AIDS until it affects 20% of people in a country.", "2.", "Companies lack policies to address HIV/AIDS, despite being concerned about its impact.", "3.", "Anglo-American has an effective policy on HIV/AIDS, which is associated with good business management and leads to more profitable and sustainable operations.", "4.", "Companies should encourage all workers to know their HIV status, making it as routine as monitoring blood pressure or cholesterol.", "5.", "Providing access to treatment is a critical part of this."], "deepseek-r1:1.5b": ["HIV/Aids poses significant risks for businesses globally, with studies indicating the threshold for widespread infection should be 20%.", "Despite declining concern among businesses due to decreasing HIV cases (14,000 daily), little action has been taken.", "The WEF report highlights the need for effective strategies, emphasizing that clear HIV-AIDS policies are crucial for profit and social responsibility.", "Companies like Anglo-American International have formal plans, managing worker status and treatment access with 90% of employees returning to work post-treatment.", "However, this doesn't cover all settings, especially sub-Saharan Africa, where only 7% of companies have policies in place.", "The report underscores the importance of non-discrimination and confidentiality as key priorities for establishing effective policies.", "Key takeaways: Businesses must address HIV/AIDS proactively, educate workers on their status, ensure treatment access, and focus on local practices to reduce risks."], "tinyllama:1.1b": ["Pas de blocs d'activités pour lutter contre le chômage dans les villes égyptiennes.", "Les autorités économiques annoncent aujourd'hui que l'inflation sur la ville de Cairo s'est ajustée à 1,5% par mois pour la seconde fois en trois ans et qu'il ne s'agit donc pas d'une crise d'économie.", "L'inflation dans la région est de 2,7%, selon le ministère des Finances égyptien.", "Le bureau central d'administration de la population (CAP), qui renseigne les autorités publiques sur l'état du secteur économique égyptien, indiquait qu'en février, la moyenne de la région avait été de 1,6% et en mars de 1,5%.", "Le chômage dans le secteur des activités primaires et secondaires (APS) a augmenté de 4,7% sur l'année 2013.", "Les deux premières semaines d'année sont précisées comme ayant été marquées par une démographie positif, avec un chiffre moyen d'emploi à la population égyptienne (PME) de 69,1% pour la première semaine et 70,3% pour les deux premières semaines.", "Le CAP a également ajouté que l'inflation dans les grandes villes égyptiennes est passée en dessous du seuil de 4% pour la seconde fois en trois ans.", "Le niveau moyen d'inflation pour les quatre premiers mois de la année était de 2,9%, selon le bureau central d'administration du secteur économique.", "Le CAP annonce maintenant que la crise n'est pas d'une nature spatiale comme prévu.", "L'inflation dans les grandes villes égyptiennes est passée en dessous de 4% pour la seconde fois en trois ans et l'évolution des chiffres sera régulièrement suivie.", "Le CAP indique que le niveau moyen d'inflation pour les quatre premiers mois de la année était de 2,9%.", "Les autorités économiques ont réduit à nouveau la taux d'intérêt, cette fois-ci pour les montants en dollars égyptiens.", "Le bureau central des taux d'intérêt (CPI) a choisi d'inclure le montant de l'indice des salaires publiés par l'Institution nationale du marché du travail (INMT).", "Le CAP affirme avoir mis en œuvre un programme pour réduire les frais d'inscription dans les classes préparatoires à l'enseignement supérieur.", "L'enquête annuelle de l'INMT a été annulée pour ne pas être nécessairement corrélée avec la crise de l'éducation publique, selon le bureau central des taux d'intérêt.", "L'inflation dans les activités primaires et secondaires est passée en dessous du seuil de 4% pour la seconde fois en trois ans et l'évolution des chiffres sera régulièrement suivie.", "Les deux premières semaines d'année sont précisées comme ayant été marquées par une démographie positif, avec un chiffre moyen d'emploi à la population égyptienne (PME) de 69,1% pour la première semaine et 70,3% pour les deux premières semaines.", "Le CAP a également ajouté que l'inflation dans les grandes villes égyptiennes est passée en dessous du seuil de 4% pour la seconde fois en trois ans.", "Le niveau moyen d'inflation pour les quatre premiers mois de la année était de 2,9%, selon le bureau central des taux d'intérêt (CPI).", "Les autorités économiques ont réduit à nouveau la taux d'intérêt, cette fois-ci pour les montants en dollars égyptiens.", "Le CAP indique que le niveau moyen d'inflation pour les quatre premiers mois de la année était de 2,9%."], "tinydolphin:1.1b": [" The article discusses how companies are not prioritizing HIV/AIDS issues despite having significant impacts on people's lives.", "It highlights that businesses have plans to deal with the issue but they fail to address it at a systemic level, which hampers their operations and future growth.", "Additionally, the article shares some of the key findings from the WEF report on HIV/AIDS and its recommendations for businesses to improve their HIV/AIDS policies and practices."], "phi:2.7b": [" Businesses are not taking action against HIV/Aids until it affects 20% of people in a country, according to a report by the World Economic Forum, Harvard, and UN aids agency.", "The report shows that most businesses have no policies in place to address the disease, with over 67% not knowing or estimating the prevalence of HIV among their staff.", "However, companies such as Anglo-American have implemented voluntary counselling and testing for HIV infection, along with anti-retroviral therapy for employees, leading to more profitable and sustainable operations.", "The report recommends businesses establish a policy based on non-discrimination and confidentiality to manage HIV/Aids risks."], "orca-mini:3b": [" The report states that many businesses fail to plan for HIV/AIDS despite its severe impact on people's lives and businesses.", "A survey of 9,000 business leaders in 104 countries revealed that concern about HIV/AIDS has decreased by 23% in the last year, and most companies do not have policies in place to address the disease.", "However, a mining company, Anglo-American, has implemented effective action on HIV/AIDS by offering voluntary counselling and testing for employees progressing to AIDS and providing access to treatment.", "The World Economic Forum, Harvard, and UNAIDS report that only 7% of companies in sub-Saharan Africa have formal HIV/AIDS policies.", "The report suggests that businesses need to understand their exposure to HIV/AIDS risks and come up with good local practices to manage them."], "hermes3:3b": ["Companies neglect planning for HIV/AIDS until it affects 20% of population, new study finds; businesses have little proactive action against disease, with only 29% having policies in place."], "stablelm-zephyr:3b": ["New research by the World Economic Forum, Harvard, and the UN AIDS agency reveals that businesses often fail to plan for HIV/AIDS until it affects 20% of people in a country.", "Despite 14,000 people contracting HIV each day, concern among business leaders has dropped by 23% in the last 12 months, with most companies having no policies in place to address the disease.", "Only 7% of companies in sub-Saharan Africa have formal HIV/AIDS policies, while in China, Ethiopia, India, Nigeria, and Russia – known as \"next wave\" countries – the figure is even lower.", "The report encourages businesses to understand their exposure to HIV/AIDS risks and develop local practices to manage them, particularly in high and low-prevalence settings."], "chatgpt-4o-latest": ["Businesses are largely unprepared for the impact of HIV/AIDS, only taking action when prevalence reaches 20% in a country, according to a report by the World Economic Forum, Harvard, and UNAIDS.", "The study, based on a survey of nearly 9,000 business leaders in 104 countries, found that 71% of companies lack policies to address the disease, and over 65% of leaders are unaware of HIV prevalence among their staff.", "Despite 14,000 new infections daily, business concern has declined by 23% in the past year.", "Anglo-American, a mining company with 24% HIV prevalence among its Southern African workforce, has successfully implemented voluntary testing and treatment, demonstrating that addressing HIV/AIDS is both socially responsible and beneficial for business.", "The report highlights that only 7% of companies in sub-Saharan Africa have formal HIV/AIDS policies, with even lower preparedness in high-risk countries like China, India, and Nigeria.", "The WEF urges businesses to assess their HIV/AIDS risks and adopt policies based on non-discrimination and confidentiality."], "stablelm2:1.6b": ["Companies fail to plan for HIV until it affects 10% of people in a country, according to a report by the World Economic Forum, Harvard, and UNAIDS.", "Concern among businesses has dropped by 35% in the last month, but over 60% of business leaders surveyed have no formal policies on addressing HIV/AIDS.", "Anglo-American is an example of a company with an effective plan, which includes extensive voluntary counseling and testing for employees and anti-retroviral therapy.", "The report concludes that businesses need to manage their exposure to HIV/ AIDS risks and come up with local practices to manage them."], "granite3.1-dense:2b": ["New research reveals that businesses underestimate HIV/AIDS risks and are slow to develop proactive strategies to address it.", "A survey of nearly 9,000 business leaders from 104 countries by the World Economic Forum, Harvard, and UNAIDS found that 71% have no HIV-related policies, and 65% cannot estimate staff prevalence.", "Concern has decreased by 23% over the past year.", "Despite 14,000 new HIV infections daily, businesses are described as having \"too little, too late\" responses.", "Anglo-American, an international mining company with 130,000 employees in Southern Africa, stands out for its comprehensive HIV management plan: voluntary counseling and testing, anti-retroviral therapy, and maintaining a high treatment success rate (90% of treated employees remain well).", "Anglo-American emphasizes the link between addressing HIV/AIDS and good business management, citing improved employee productivity and profitability.", "The report highlights that only around 7% of companies in sub-Saharan Africa and even fewer in emerging HIV hotspots like China, Ethiopia, India, Nigeria, and Russia have formal HIV/AIDS policies.", "The findings underscore the need for businesses to recognize their exposure to HIV risks and adopt tailored local management practices, emphasizing non-discrimination and confidentiality as key components of these strategies."]}