{"raw_text": "Millions go missing at China bank\n \n Two senior officials at one of China's top commercial banks have reportedly disappeared after funds worth up to $120m (£64m) went missing.\n \n The pair both worked at Bank of China in the northern city of Harbin, the South China Morning Post reported. The latest scandal at Bank of China will do nothing to reassure foreign investors that China's big four banks are ready for international listings. Government policy sees the bank listings as vital economic reforms. Bank of China is one of two frontrunners in the race to list overseas. The other is China Construction Bank. Both are expected to list abroad during 2005.\n \n They shared a $45bn state bailout in 2003, to help clean up their balance sheets in preparation for a foreign stock market debut.\n \n However, a report in the China-published Economic Observer said on Monday that the two banks may have scrapped plans to list in New York because of the cost of meeting regulatory requirements imposed since the Enron scandal. Bank of China is the country's biggest foreign exchange dealer, while China Construction Bank is the largest deposit holder. China's banking sector is burdened with at least $190bn of bad debt according to official data, though most observers believe the true figure is far higher. Officially, one in five loans is not being repaid. Attempts to strengthen internal controls and tighten lending policies have uncovered a succession of scandals involving embezzlement by bank officials and loans-for-favours. The most high-profile case involved the ex-president of Bank of China, Wang Xuebing, jailed for 12 years in 2003. Although, he committed the offences whilst running Bank of China in New York, Mr Wang was head of China Construction Bank when the scandal broke. Earlier this month, a China Construction Bank branch manager was jailed for life in a separate case.\n \n China's banks used to act as cash offices for state enterprises and did not require checks on credit worthiness. The introduction of market reforms has been accompanied by attempts to modernise the banking sector, but links between banks and local government remain strong. Last year, China's premier, Wen Jiabao, targeted bank lending practices in a series of speeches, and regulators ordered all big loans to be scrutinised, in an attempt to cool down irresponsible lending. China's leaders see reforming the top four banks as vital to distribute capital to profitable companies and protect the health of China's economic boom. But two problems persist. First, inefficient state enterprises continue to receive protection from bankruptcy because they employ large numbers of people. Second, many questionable loans come not from the big four, but from smaller banks. Another high profile financial firm, China Life, is facing shareholder lawsuits and a probe by the US Securities and Exchange Commission following its 2004 New York listing over its failure to disclose accounting irregularities at its parent company.\n", "llama3.2:1b": ["Millions of dollars in funds are missing from Bank of China after two senior officials disappeared and up to $120m (£64m) is estimated to have gone missing.", "The bank's top officials may have abandoned plans to list their overseas accounts due to high costs imposed by regulators since the Enron scandal.", "Bank of China has received a state bailout in 2003, but its efforts are being hindered by bad debt and embezzlement scandals within the company."], "llama3.2:3b": ["Millions of dollars worth up to $120m went missing from Bank of China in Harbin after two senior officials disappeared.", "The bank is one of China's top commercial banks and a frontrunner for international listings, with plans potentially scrapped due to regulatory requirements.", "China's banking sector has at least $190bn of bad debt, with many observers believing the true figure is higher."], "gemma2:2b": ["Two senior officials at Bank of China in Harbin have disappeared after funds worth up to $120 million went missing.", "This incident, along with a history of scandals involving embezzlement and bad debt, has raised concerns about the readiness of China's big four banks for international listings.", "Despite receiving a state bailout in 2003 to prepare for these listings,  the two banks may have abandoned plans to list in New York due to increased regulatory requirements following the Enron scandal.", "The banking sector is burdened with high levels of bad debt and weak internal controls, leading to multiple scandals involving embezzlement and loans-for-favors.", "China's leaders see reforming the top four banks as crucial for economic stability and distribution of capital.", "However, challenges remain in addressing inefficiencies within state enterprises and ensuring transparency in lending practices by smaller banks."], "qwen2.5:0.5b": ["Two senior officials at Bank of China in Harbin reportedly disappeared during their state bailout in 2003.", "The banks are expected to list overseas after a cost-cutting move, but the situation remains uncertain due to regulatory requirements and high costs of listing overseas."], "qwen2.5:1.5b": ["Two senior officials disappeared from Bank of China in Harbin, missing funds worth up to $120 million; two banks were considering listing on foreign markets due to state bailouts but may withdraw because of regulatory costs following the Enron scandal; China's banking sector has bad debt issues and high embezzlement rates."], "qwen2.5:3b": ["Two senior officials from Bank of China in Harbin have disappeared along with up to $120m worth of missing funds.", "This scandal raises doubts about the banks' readiness for international stock market listings, crucial for economic reforms.", "Both Bank of China and China Construction Bank are frontrunners planning overseas IPOs after receiving a $45bn state bailout in 2003.", "The banking sector is burdened with at least $190bn of bad debt; recent scandals involving embezzlement by bank officials highlight internal control issues.", "Wang Xuebing, ex-president of Bank of China jailed for 12 years, was also involved with China Construction Bank during the scandal.", "Banking reforms have modernized but remain linked to local government.", "Leaders view reforming major banks as essential for distributing capital to profitable companies and stabilizing the economy.", "However, inefficient state enterprises receive protection from bankruptcy, and many questionable loans come from smaller banks.", "Additionally, a high-profile firm, China Life, is facing regulatory scrutiny due to accounting irregularities."], "opencoder:1.5b": ["Millions go missing at China bank\n\nTwo senior officials at one of China's top commercial banks have reportedly disappeared after funds worth up to $120m (£64m) went missing.", "The pair both worked at Bank of China in the northern city of Harbin, the South China Morning Post reported.", "The latest scandal at Bank of China will do nothing to reassure foreign investors that China's big four banks are ready for international listings.", "Government policy sees the bank listings as vital economic reforms.", "Bank of China is one of two frontrunners in the race to list overseas.", "The other is China Construction Bank.", "Both Banks are expected to list abroad during 2005.", "They shared a $45bn state bailout in 2003, to help clean up their balance sheets in preparation for a foreign stock market debut.", "However, a report in the China-published Economic Observer said on Monday that the two banks may have scrapped plans to list in New York because of the cost of meeting regulatory requirements imposed since the Enron scandal.", "Bank of China is the country's biggest foreign exchange dealer, while China Construction Bank is the largest deposit holder.", "China's banking sector is burdened with at least $190bn of bad debt according to official data, though most observers believe the true figure is far higher.", "Officially, one in five loans is not being repaid.", "Attempts to strengthen internal controls and tighten lending policies have uncovered a succession of scandals involving embezzlement by bank officials and loans-for-favours.", "The most high-profile case involved the ex-president of Bank of China, Wang Xuebing, jailed for 12 years in 2003.", "Although, he committed the offences whilst running Bank of China in New York, Mr Wang was head of China Construction Bank when the scandal broke.", "Earlier this month, a China Construction Bank branch manager was jailed for life in a separate case."], "smollm:1.7b": ["The summary should be: Millions go missing at China bank Two senior officials at one of China's top commercial banks have reportedly disappeared after funds worth up to $120m (£64m) went missing.", "The pair both worked at Bank of China in the northern city of Harbin, the South China Morning Post reported.", "The latest scandal at Bank of China will do nothing to reassure foreign investors that China's big four banks are ready for international listings.", "Government policy sees the bank listings as vital economic reforms.", "Bank of China is one of two frontrunners in the race to list overseas.", "The other is China Construction Bank.", "Both are expected to list abroad during 2005.", "The summary should be: Millions go missing at China bank Two senior officials at one of China's top commercial banks have reportedly disappeared after funds worth up to $120m (£64m) went missing.", "The pair both worked at Bank of China in the northern city of Harbin, the South China Morning Post reported.", "The latest scandal at Bank of China will do nothing to reassure foreign investors that China's big four banks are ready for international listings.", "Government policy sees the bank listings as vital economic reforms.", "Bank of China is one of two frontrunners in the race to list overseas.", "The other is China Construction Bank.", "Both are expected to list abroad during 2005."], "deepseek-r1:1.5b": ["The two senior officials at Bank of China, Wang Xuebing and another from China Construction Bank, have disappeared after funds worth up to $120 million went missing, which was reported by the South China Morning Post.", "They served in Harbin but are not expected to list abroad due to regulatory costs since the Enron scandal.", "As cash offices for state enterprises, their reliance on checks and creditworthiness wasn't enforced.", "Market reforms have been paired with sector modernization efforts, yet strong links between banks and local government persist.", "In 2003, a $45 billion bailout was administered but funds were later misplaced.", "The recent scandal led to the decision by regulators to scrutinize big loans, though this attempt is aimed at cooling down irresponsible lending.", "While Wang Xuebing is now at Jiaotong University, China Construction Bank's missing officials are still involved in the matter.", "China Life is facing shareholder lawsuits and a US SEC probe after its New York listing was delayed due to accounting irregularities from their parent company."], "tinyllama:1.1b": ["A report by the South China Morning Post revealed that two senior officials from one of China's top commercial banks have gone missing after their funds worth up to $120m went missing in a scandal.", "Bank of China and China Construction Bank are considered frontrunners for foreign stock market listings this year, but analysts warn that plans for listing in New York may not be feasible due to regulatory requirements.", "The report suggests that the two banks have scrapped plans to list in New York since they were exposed to scandal involving embellishing internal controls and lending policies.", "China's banking sector is burdened with at least $190bn of bad debt, and attempts to strengthen internal controls and tighten lenning policies have uncovered a succession of scandal cases involving embezzlement by bank officials and loans-for-favours.", "The report highlights the country's leaders' resolve to reform the top four banks as vital for the health of China's economic boom, but notes that poorly performing state enterprises continue to receive protection from bankruptcy because they employ large numbers of people."], "tinydolphin:1.1b": [" In recent years, China's banking sector has become increasingly troubled due to widespread corruption, embezzlement of funds, and lax regulatory standards.", "As a result, many banks have gone missing with millions of dollars reported missing from their vaults.", "Two senior officials at one of China's top commercial banks, Bank of China, are believed to have vanished after funding worth up to $120m (£64m) went missing.", "The disappearance of these two men has led many to question whether the banking system in China is adequately prepared for international listings and foreign investment.", "The scandal at Bank of China will do nothing to reassure foreign investors, as China's big four banks are now considered to be major risks due to their ties with local government.", "In an effort to prevent similar occurrences in the future, the Chinese government has implemented stricter regulations aimed at cleaning up the banking sector and improving transparency.", "However, these reforms have also raised concerns about the efficacy of the measures being implemented, as regulators may not be effectively monitoring the performance of smaller banks.", "In response to this issue, the Economic Observer reported that two banks in China are considering an overseas listing during 2005, with both of them set to list their shares in New York.", "This move comes after the country's largest foreign exchange dealer, China Construction Bank, announced plans for a listing in New York due to regulatory requirements imposed since the Enron scandal.", "Attempts to strengthen internal controls and tighten lending policies have uncovered a succession of scandals involving embezzlement by bank officials.", "Despite this concern about the safety of China's financial system, many observers believe that the country is burdened with at least $190bn of bad debt and that efforts to strengthen internal controls may be ineffective in addressing the issue.", "Attempts to toughen up banking regulations have also led to increased scrutiny of smaller banks, further exacerbating the problem of corruption and embezzlement.", "This situation is expected to become worse as China's leaders attempt to distribute capital to profitable companies and protect the health of China's economic boom."], "phi:2.7b": [" Two senior officials of China's Bank of China have reportedly gone missing after funds worth up to $120m went missing from their bank.", "The latest scandal at Bank of China will not reassure foreign investors that the country's big four banks are ready for international listings.", "Bank of China is one of two frontrunners in the race to list overseas, but may have scrapped plans to list in New York due to regulatory requirements imposed since the Enron scandal.", "China'S banking sector is burdened with at least $190bn of bad debt, and attempts to strengthen internal controls have uncovered a series of scandals involving embezzlement by bank officials.", "The two latest cases are related to loans-for-favours, which have become more common in the wake of market reforms.", "China'S leaders see reforming the top four banks as vital to distribute capital to profitable companies and protect the health of China'S economic boom, but there are concerns about inefficient state enterprises and smaller banks' questionable lending practices."], "orca-mini:3b": [" Two senior officials at Bank of China in Harbin disappeared after millions of dollars went missing.", "The two banks received a $45 billion state bailout in 2003 and were planning to list in New York, but scrapped the plan due to regulatory requirements imposed since the Enron scandal.", "Wang Xuebing, former president of Bank of China, was jailed for 12 years in 2003 for embezzling funds while he was head of Bank of China in New York.", "A China Construction Bank branch manager was also recently sentenced to life in prison for a separate case involving fraudulent loans to state enterprises.", "The top four Chinese banks are being targeted by regulators and leaders who want to protect the health of China's economic boom and distribute capital to profitable companies.", "However, many problematic loans still come from smaller banks."], "hermes3:3b": [" Millions at $120m missing in Chinese bank, 2 officials vanished; major Chinese banks expected for overseas listings."], "stablelm-zephyr:3b": ["Two senior Bank of China officials have reportedly disappeared after $120m (£64m) worth of funds went missing.", "This scandal could affect plans for Bank of China and China Construction Bank to list overseas in 2005 due to regulatory cost concerns.", "Despite attempts to strengthen internal controls and tighten lending policies, scandals involving embezzlement by bank officials and loans-for-favours continue in China's banking sector.", "Inefficient state enterprises receiving protection from bankruptcy and questionable loans coming from smaller banks persist as reforming the top four banks is seen as vital by China's leaders to distribute capital to profitable companies and protect the health of its economic boom."], "chatgpt-4o-latest": ["Two senior officials at Bank of China in Harbin have disappeared after $120 million went missing, raising concerns about the bank's readiness for international listings.", "Bank of China and China Construction Bank, both set to list overseas in 2005, received a $45 billion state bailout in 2003 to clean up their finances.", "However, regulatory costs may have led them to abandon plans to list in New York.", "China's banking sector struggles with at least $190 billion in bad debt, and efforts to tighten controls have exposed multiple embezzlement scandals, including the jailing of former Bank of China president Wang Xuebing.", "Historically, banks operated as cash offices for state enterprises without credit checks, but reforms aim to modernize the sector.", "Despite attempts to curb irresponsible lending, inefficient state enterprises and smaller banks continue to pose financial risks.", "Meanwhile, China Life faces lawsuits and a U.S. SEC probe over accounting irregularities following its 2004 New York listing."], "stablelm2:1.6b": ["Two senior officials at Bank of China disappeared after funds worth up to $10 billion went missing in a scandal.", "The pair worked in Harbin, with government policy viewing bank listings as vital economic reforms.", "Both Bank of China and China Construction Bank are frontrunners for overseas listings; however, a report suggests they may have scrapped plans for listing in New York due to regulatory requirements.", "China's banking sector is heavily laden with at least $10 billion of bad debt.", "Attempts to strengthen internal controls and tighten lending policies have unearthed a succession..\n  \nChina's banks used to act as cash offices for state enterprises and did not require checks on credit worthiness.", "The introduction of market reforms has been accompanied by attempts to modernize the banking sector, but links between banks and local government remain strong.", "China's leaders view reforming the top four banks as vital to distribute capital to profitable companies and protect the health of its economic boom.", "But two problems persist: inefficient state enterprises continue to receive protection from bankruptcy because they employ large numbers of people, and many questionable loans come not from the big four, but from smaller banks."], "granite3.1-dense:2b": ["Two senior Bank of China officials in Harbin have vanished amidst the reported loss of up to $120 million in funds, potentially impacting foreign investor confidence in China's top four banks' readiness for international listings.", "This scandal, part of a broader pattern of banking misconduct, may prompt both Bank of China and China Construction Bank to abandon plans for New York listings due to regulatory burdens.", "China's banking sector faces extensive bad debt, with estimates ranging from $190 billion to 50% of loans unpaid.", "High-profile cases include the jailing of former Bank of China president Wang Xuebing for embezzlement and a life sentence for a Bank of China branch manager in a recent case.", "China's leadership prioritizes reforming the top four banks to direct capital to profitable enterprises, but challenges persist: inefficient state enterprises shield themselves from bankruptcy due to employment; and many problematic loans originate from smaller banks.", "The China Life financial firm is also under investigation following its 2004 New York listing over unreported accounting issues at its parent company."]}