{"raw_text": "China Aviation seeks rescue deal\n \n Scandal-hit jet fuel supplier China Aviation Oil has offered to repay its creditors $220m (£117m) of the $550m it lost on trading in oil futures.\n \n The firm said it hoped to pay $100m now and another $120m over eight years. With assets of $200m and liabilities totalling $648m, it needs creditors' backing for the offer to avoid going into bankruptcy. The trading scandal is the biggest to hit Singapore since the $1.2bn collapse of Barings Bank in 1995. Chen Jiulin, chief executive of China Aviation Oil (CAO), was arrested by at Changi Airport by Singapore police on 8 December. He was returning from China, where he had headed when CAO announced its trading debacle in late-November. The firm had been betting heavily on a fall in the price of oil during October, but prices rose sharply instead.\n \n Among the creditors whose backing CAO needs for its restructuring plan are banking giants such as Barclay's Capital and Sumitomo Mitsui, as well as South Korean firm SK Energy. Of the immediate payment, the firm - China's biggest jet fuel supplier - said it would be paying $30m out of its own resources. The rest would come from its parent company, China Aviation Oil Holding Company in Beijing. The holding company, owned by the Chinese government, holds most of CAO's Singapore-listed shares. It cut its holding from 75% to 60% on 20 October.\n", "llama3.2:1b": ["China Aviation Oil has offered a $220m rescue deal to repay creditors $550m lost on oil futures trading.", "The company owes $648m in liabilities, and needs creditors' backing for the offer or risk bankruptcy.", "Chief executive Chen Jiulin was arrested upon returning from China after announcing the scandal."], "llama3.2:3b": ["China Aviation Oil offers $220m payment plan to creditors as part of restructuring deal to avoid bankruptcy amid trading scandal.", "Firm's assets are $200m, liabilities are $648m.", "Payment includes $100m now and $120m over eight years.", "Backing from major creditors such as Barclays Capital, Sumitomo Mitsui and SK Energy is needed."], "gemma2:2b": ["China Aviation Oil (CAO), a jet fuel supplier, has offered to repay creditors $220 million of a $550 million loss in oil futures trading.", "CAO aims to pay $100 million now and another $120 million over eight years.", "The offer requires creditor backing to avoid bankruptcy.", "CAO's CEO was arrested for the scandal, which is the largest in Singapore since 1995.", "The firm needs support from major banks like Barclay's Capital and Sumitomo Mitsui, along with South Korean firm SK Energy.", "CAO will use funds from its own resources ($30 million) and parent company China Aviation Oil Holding Company for the remaining payment."], "qwen2.5:0.5b": ["China Aviation Oil has offered $120 million to repay creditors for trading in oil futures.", "The firm hopes to pay $100 million now and another $120 million over eight years, with assets of $200 million and liabilities totaling $648 million.", "CAO is the biggest jet fuel supplier in China.", "It faces a reputation crisis due to its trading scandal."], "qwen2.5:1.5b": ["China Aviation Oil offers $100m repayment and a $120m deferred payment plan in exchange for creditors' backing, aiming to avoid bankruptcy while restructuring with assets of $200m and liabilities of $648m totaling $550m.", "The firm, China's biggest jet fuel supplier, was caught up in the largest trading scandal since Singapore's Barings Bank collapse in 1995."], "qwen2.5:3b": ["China Aviation Oil has offered to repay creditors $220m ($117m) for losses in oil futures trading totaling $550m.", "The company, with assets of $200m and liabilities at $648m, seeks creditor support for a restructuring plan involving payments of $100m now and another $120m over eight years.", "CEO Chen Jiulin was arrested upon returning from China amid the trading scandal, which is the biggest since Barings Bank's collapse in 1995.", "Key creditors include banking giants Barclays Capital and Sumitomo Mitsui, along with South Korean firm SK Energy.", "China Aviation Oil plans to allocate $30m of its own resources towards immediate payments, with the rest coming from its Beijing parent company."], "opencoder:1.5b": ["China Aviation seeks rescue deal\n\nChina's biggest jet fuel supplier China Aviation Oil has announced a $220m payment from its creditors for the loss it incurred in trading oil futures, which was the biggest to unfold since the $1.2bn collapse of Barings Bank in 1995.", "The firm expects another $120m payment as well over the next eight years.", "Despite the high selling points, it faces more than a few additional debts such as banking giants like Barclay's Capital and Sumitomo Mitsui, South Korean firm SK Energy, and its parent company China Aviation Oil Holding Company in Beijing."], "smollm:1.7b": ["China Aviation Oil has offered to repay $220 million (£117 million) of the $550 million it lost on trading in oil futures, according to a statement released by the firm on Friday.", "The company said it hoped to pay $100 million now and another $120 million over eight years.", "With assets of $200 million (£134 million) and liabilities totalling $648 million, CAO needs creditors' backing for its restructuring plan in order to avoid going into bankruptcy.", "The trading scandal is the biggest to hit Singapore since the $1.2 billion collapse of Barings Bank in 1995.", "Chen Jiulin, the chief executive of China Aviation Oil (CAO), was arrested by at Changi Airport on Friday evening after returning from China where he had headed when CAO announced its trading debacle in late-November.", "He was returning to Singapore from China, where he had headed when CAO announced its trading debacle in late-November.", "The firm - China's biggest jet fuel supplier - said it would be paying $30 million out of its own resources for the restructuring plan.", "The rest would come from its parent company, China Aviation Oil Holding Company in Beijing.", "The holding company, owned by the Chinese government, holds most of CAO's Singapore-listed shares.", "It cut its holding from 75% to 60% on 20 October."], "deepseek-r1:1.5b": ["China Aviation has offered a $220 million rescue deal to repay its creditors, seeking to offset the $550 million loss from trading in oil futures.", "The company aims to settle $100 million now and another $120 million over eight years, with total assets at $200 million and liabilities totaling $648 million, requiring creditor support.", "Chen Jiulin, China Aviation Oil's CEO, was arrested by Singapore police after his departure from China in 2019 due to the trading scandal.", "The firm bet on oil prices falling but faced significant price increases.", "Immediate payments will cover $30 million of its own resources, with the rest coming from China Aviation Oil Holding Company."], "tinyllama:1.1b": ["In addition to a $220m loss from trading in oil future contracts by China Avionics Oil, the firm has offered to repay creditors $100m and another $120m over eight years for its troubled operations.", "To avoid bankruptcy, CEO Chen Jiuli was arrested on 8 December and is currently under investigation in Singapore.", "Among the creditors requiring CAO's restructuring plan are banking giants such as Barclays Capital and Sumitomo Trust & Money.", "The firm has also received backing from South Korean oil refiner SK Energy."], "tinydolphin:1.1b": [" China Aviation Oil is seeking a restructuring plan after losing $550m in oil futures trading, but has reached a consensus with creditors including Barclay's Capital, Sumitomo Mitsui Bank, and SK Energy on payment terms.", "The company has agreed to pay back $100m over eight years, while another $120m is set aside for repayment now.", "Chen Jiulin, the firm's chief executive officer, was arrested in Singapore earlier this month as part of an investigation into the trading scandal."], "phi:2.7b": [" A summary of the text is:\n\nChina Aviation Oil, a scandal-hit jet fuel supplier, has offered to repay some of its creditors $300m in exchange for their support in avoiding bankruptcy.", "The firm's trading loss on oil futures was the largest in Singapore since Barings Bank collapsed in 1995.", "CAO needs backing from banks and other investors to pay back its debts, which it hopes to do with a mix of cash and bonds over eight years."], "orca-mini:3b": [" China Aviation seeks a $220 million rescue deal for itself.", "The firm offered to repay creditors $100 million now and $120 million over eight years.", "The trading scandal affected the company's operations, leading to its loss of $648 million.", "CAO was the largest jet fuel supplier in China and had been heavily betting on a fall in oil prices, but prices rose instead.", "The firm needs creditors' approval for its restructuring plan."], "hermes3:3b": ["China Aviation Oil offers $220m repayment ($100m now, $120m over 8yrs) to creditors after jet fuel supplier faces $550m loss on oil futures trading scandal."], "stablelm-zephyr:3b": ["China Aviation Oil, a scandal-hit jet fuel supplier, has offered to repay $220m of the $550m it lost on oil futures trading.", "The firm, which needs creditors' backing for the offer to avoid bankruptcy, plans to pay $100m immediately and another $120m over eight years.", "Major creditors include Barclays Capital and Sumitomo Mitsui, as well as South Korean firm SK Energy.", "China Aviation Oil is Singapore's biggest jet fuel supplier and was heavily involved in betting on a fall in oil prices during October; however, prices rose sharply instead."], "chatgpt-4o-latest": ["China Aviation Oil (CAO), facing a major trading scandal, has proposed a rescue deal to repay $220 million of the $550 million lost in oil futures trading.", "The company plans to pay $100 million immediately and $120 million over eight years, needing creditor approval to avoid bankruptcy.", "With $200 million in assets and $648 million in liabilities, CAO's crisis is Singapore's biggest since Barings Bank's 1995 collapse.", "CEO Chen Jiulin was arrested after returning from China, where he had gone following the firm's losses.", "CAO had bet on falling oil prices, but prices surged instead.", "Major creditors include Barclays Capital, Sumitomo Mitsui, and SK Energy.", "Of the immediate payment, $30 million will come from CAO, with the rest from its parent company, China Aviation Oil Holding Company, which reduced its stake from 75% to 60% in October."], "stablelm2:1.6b": ["China Aviation Oil offers to repay creditors $1 million ($1.2 million) due to jet fuel trading scandal losses and needs creditor backing for restructuring plan amidst assets and liabilities totaling $10 million.", "The offer includes $1 million now and another $1 million over eight years, requiring support from major banking firms such as Barclay's Capital and Sumitomo Mitsui, along with South Korean firm SK Energy.", "Immediate payment will come from the company's resources, while the rest will be covered by its parent holding company, China Aviation Oil Holding Company in Beijing."], "granite3.1-dense:2b": ["China Aviation Oil (CAO), a key jet fuel supplier for China, faces bankruptcy due to a $550m trading loss in oil futures.", "The firm has proposed repaying $220m to its creditors: $100m immediately and the remainder over eight years.", "CAO's assets are valued at $200m, while liabilities total $648m.", "This offer is crucial for avoiding bankruptcy, as it seeks backing from major global banks like Barclays Capital, Sumitomo Mitsui, and South Korean SK Energy.", "CAO's CEO, Chen Jiulin, was arrested at Changi Airport on 8 December while returning from China after the company announced its trading debacle in late-November.", "The scandal is Singapore's largest since Barings Bank collapsed in 1995.", "CAO had bet heavily on a drop in oil prices during October, but they rose instead.", "To facilitate the payment, CAO will use $30m from its own resources and the rest from its parent company, China Aviation Oil Holding Company, which holds most of CAO's Singapore-listed shares.", "The government of China owns this holding company, reducing it from 75% to 60% on 20 October."]}