{"raw_text": "Water firm Suez in Argentina row\n \n A conflict between the Argentine State and water firm Aguas Argentinas, controlled by France's Suez, is casting doubt on the firm's future.\n \n The firm, which serves the province of Buenos Aires, wants a tariff rise of 60% to fund water-supply improvements. The government has rejected the 60% rise and wants Aguas Argentinas to make an annual investment of 400m pesos ($136m; £72.3m) in improvements. Planning Minister Julio De Vido has offered State help but not for \"free\".\n \n Mr De Vido said that the Argentine state would not make a contribution \"in the form of a subsidy\".\n \n He has said a contribution could be made in return for a seat on the company's board. He added that the government is in discussions with Aguas Argentinas about what role it might take in the event that a State contribution is agreed. However, Aguas Argentinas told the Argentine newspaper Clarin it would not accept any change to its legal structure and, in practice, this rules out State participation on its board. The Planning Minister didn't rule out the possibility of cancelling Aguas Argentinas water concession. Yet he added that he didn't like to do \"futurology\". But last week, Argentine Economic Minister, Roberto Lavagna, told the French media in Paris that the government was considering allowing a 16% increase in tariffs and the possibility of a State contribution to Aguas Argentinas infrastructure investments. Speaking in Buenos Aires, Mr De Vido later denied the possibility of any tariff increase and insisted that the annual investment in water infrastructure was at the centre of the discussions. He added that in the coming weeks the future of Aguas Argentinas would be decided. Suez owns 40% of Aguas Argentinas (39.9%), while Spain's Aguas de Barcelona is its second biggest shareholder with 25.01%. Recently, Suez lost a water concession in Bolivia after mass protests in the city of El Alto (the poorest in the country), with citizens complaining of unfair water charges. This forced the government to cancel the contract.\n \n In Argentina, Suez's subsidiary, which has been fined for cutting the supply of water during a recent heat wave and allegedly failing to keep up investment to meet the demand for water, has maintained a tense relationship with the Argentine government. During the last financial crisis in Argentina, the firm sued the state alleging that converting its tariffs from US dollars to pesos, and then freezing them during devaluation, had affected the company and made it difficult for it to meet its contractual obligations. When President Nestor Kirchner of Argentina arrived in power he began to negotiate a solution to the disagreements with international utilities operating in Argentina. But he has rejected any tariff increases, alleging this will impoverish citizens further. He has also asked for more investments to meet the growing demand for water. On May 2004, Aguas Argentinas and the government signed an agreement to renegotiate its Buenos Aires water-concession contract. The firm agreed to invest 242m pesos. The issue has attracted European interest. Last week in Paris, President Kirchner discussed this problem and other issues with French president Jacques Chirac. The Argentine government is also under pressure from European Union countries and the International Monetary Fund (IMF) to raise utilities tariffs, because most of the utilities operating in Argentina are European.\n", "llama3.2:1b": ["Water firm Suez in Argentina faces a conflict with the Argentine state over funding for water-supply improvements.", "The state wants Aguas Argentinas, controlled by France's Suez, to increase its tariff by 60% to fund investments, but the company has rejected this and requested an annual investment of 400m pesos ($136m; £72.3m) instead.", "The government is considering either a State contribution or allowing a 16% increase in tariffs."], "llama3.2:3b": ["Argentina's water firm Aguas Argentinas controlled by France's Suez wants a 60% tariff rise to fund improvements but the government has rejected it, instead offering State help in return for a board seat.", "The company refuses to change its legal structure, making state participation unlikely.", "The future of Aguas Argentinas will be decided in coming weeks, amid concerns over water charges and investments following a recent heat wave fine from the firm."], "gemma2:2b": ["Suez's subsidiary Aguas Argentinas faces a dispute with the Argentine government over tariff increases for water services.", "The company wants a 60% tariff rise but the government demands investments instead.", "The government is exploring state contribution options but this is rejected by Aguas Argentinas.", "There is pressure on both sides to find a solution, as Suez's subsidiary has faced previous controversy in Bolivia and Argentina.", "The future of the company remains uncertain, with possible cancellations of its concession being considered."], "qwen2.5:0.5b": ["Aguas Argentinas wants a tariff rise of 60% to fund water-supply improvements, while Suez maintains a tense relationship with the Argentine government.", "The Argentine government is under pressure from European Union countries and the IMF to raise utilities tariffs, citing concerns about water supply.", "Argentina's Suez subsidiary has faced criticism for cutting water supplies during a recent heat wave and failing to invest in infrastructure upgrades."], "qwen2.5:1.5b": ["A conflict between Argentina's state-owned water company Aguas Argentinas and foreign firm Suez over a proposed tariff increase has strained relations with the Argentine government, leading some to question the future of Suez's operations in the country."], "qwen2.5:3b": ["A conflict between the Argentine State and water firm Aguas Argentinas, controlled by France's Suez, persists over a proposed 60% tariff rise for water services in Buenos Aires province.", "The government wants an annual investment of $136m for infrastructure improvements, while Aguas Argentinas refuses state participation in its governance structure or any subsidy.", "Initially considering allowing a 16% increase in tariffs and potential State contribution to investments, discussions have since shifted with Minister De Vido insisting on an emphasis on investment without tariff hikes.", "Historically, Suez has had tense relationships with the Argentine government over past disputes, including water charges during devaluations.", "European interest arises due to Aguas Argentinas' operations in Argentina and its foreign parent company's presence across Europe."], "opencoder:1.5b": ["Water firm Suez in Argentina row\n\nA conflict between the Argentine State and water firm Aguas Argentinas, controlled by France's Suez, is casting doubt on the firm's future.", "The government has rejected the 60% rise and wants Aguas Argentinas to make an annual investment of 400m pesos ($136m; £72.3m) in improvements.", "Planning Minister Julio De Vido has offered State help but not for \"free\".", "Mr De Vido said that the Argentine state would not make a contribution \"in the form of a subsidy\".", "He has said a contribution could be made in return for a seat on the company's board.", "However, Aguas Argentinas told the Argentine newspaper Clarin it would not accept any change to its legal structure and, in practice, this rules out State participation on its board.", "The Planning Minister didn't rule out the possibility of cancelling Aguas Argentinas water concession.", "In Buenos Aires, Mr De Vido later denied the possibility of any tariff increase and insisted that the annual investment in water infrastructure was at the centre of the discussions.", "But last week, Argentina Economic Minister, Roberto Lavagna, told the French media in Paris that the government was considering allowing a 16% increase in tariffs and the possibility of a State contribution to Aguas Argentinas infrastructure investments.", "While speaking in Buenos Aires, Mr De Vido later denied the possibility of any tariff increase and insisted that the annual investment in water infrastructure was at the centre of the discussions."], "smollm:1.7b": ["The conflict between the Argentine State and water firm Aguas Argentinas, controlled by France's Suez, is casting doubt on the firm's future.", "The firm wants a tariff rise of 60% to fund water-supply improvements but the government has rejected the 60% rise and wants Aguas Argentinas to make an annual investment of 400m pesos ($136m; £72.3m) in improvements.", "Planning Minister Julio De Vido has offered State help but not for \"free\".", "He said that the Argentine state would not make a contribution \"in the form of a subsidy\".", "The Argentine state will not accept any change to its legal structure and, in practice, this rules out State participation on its board.", "But he didn't like to do \"futurology\".", "Yet he didn't like to do \"futurology\".", "But last week, Argentine Economic Minister, Roberto Lavagna, told the French media in Paris that the government was considering allowing a 16% increase in tariffs and the possibility of a State contribution to Aguas Argentinas infrastructure investments.", "Speaking in Buenos Aires, Mr De Vido denied the possibility of any tariff increase and insisted that the annual investment in water infrastructure is at the centre of the discussions.", "He added that in the coming weeks the future of Aguas Argentinas would be decided.", "Suez owns 40% of Aguas Argentinas (39.9%), while Spain's Aguas de Barcelona is its second biggest shareholder with 25.01%.", "Last week, Suez lost a water concession in Bolivia after mass protests in the city of El Alto (the poorest in the country), with citizens complaining of unfair water charges.", "This forced the government to cancel the contract.", "In Argentina, Suez's subsidiary, which has been fined for cutting the supply of water during a recent heat wave and allegedly failing to keep up investment to meet the demand for water, has maintained a tense relationship with the Argentine government.", "When President Nestor Kirchner of Argentina arrived in power he began to negotiate a solution to the disagreements with international utilities operating in Argentina.", "But he has rejected any tariff increases, alleging this will affect the citizens further.", "He has also asked for more investments to meet the growing demand for water.", "On May 2004, Aguas Argentinas and the government signed an agreement to renegotiate its Buenos Aires water-concession contract.", "The firm agreed to invest 242m pesos.", "The issue has attracted European interest.", "Last week in Paris, President Kirchner discussed this problem and other issues with French president Jacques Chirac.", "The Argentine government is also under pressure from European Union countries and the International Monetary Fund (IMF) to raise utilities tariffs, because most of the utilities operating in Argentina are European."], "deepseek-r1:1.5b": ["The Argentine government faces a water firm conflict with Aguas Argentinas.", "Key points include:\n\n- **Conflict:** A dispute over water supply contracts between the Argentine State and Aguas Argentinas.", "- **Tariff Increase:** The state has demanded a 60% tariff rise, while Aguas Argentinas wants an annual investment of 400m pesos for improvements.", "- **State Help:** The Planning Minister, Julio De Vido, offered support but not free.", "He suggested contributions in exchange for board seats if received.", "- **Government Discussions:** A tentative agreement on the water-concession contract was reached, with Aguas Argentinas agreeing to invest 242m pesos annually.", "- **Financial Issues:** Suez, a French utility, faced financial losses due to protests in El Alto and canceled the water concession.", "- **State-Touching Tariff:** The government is considering a 16% tariff increase and future water investment deals with European and IMF interests."], "tinyllama:1.1b": ["In a conflict between the Argentine State and water firm Aguas Argentinas, controlled by France's Suez, over investment in the provision of water supplies, a tariff increase is expected to be discussed as part of a discussion on how to improve their investments.", "The government has rejected an 60% rise in tariffs and wants investments to improve water supply improvements to make a total annual investment of 400m pesos ($136m; £72.3m) in improvements.", "However, Minister for Planning, Juliio de Vidó, has offered aid from the Argentine state if a State contribution is agreed.", "The state will also be involved in discussions with Aguas Argentinas about what role they might take on their board.", "A move to cancel or increase tariffs would have serious implications for Aguas Argentina's legal structure and could lead to a state-initiated takeover, with the possibility of the investment of State funds into the company.", "However, Minister de Vidó ruled out the prospect of canceling Aguas Argentina's water concession.", "Argentina is currently under pressure from European Union countries and the IMF to raise utility tariffs due to most utilities in the country being European-owned."], "tinydolphin:1.1b": [" Suez is in a conflict with the Argentine State over an increase in water tariffs.", "The firm wants an investment of 400 million euros ($136 million) for water infrastructure improvements, but the government has rejected this.", "The government is offering to make a contribution to Aguas Argentinas's board if it agrees to a 60% increase in tariffs.", "This could potentially lead to Suez losing its current concession in Buenos Aires and other areas of Argentina."], "phi:2.7b": [" A water firm Suez in Argentina row, which wants a 60% tariff increase, faces conflict with the Argentine State as the Government rejects the raise and demands an annual investment of $136 million by Aguas Argentinas.", "The government has offered a seat on the board in return for contributions but the company is demanding a change to its legal structure."], "orca-mini:3b": [" Argentine water firm Aguas Argentinas is embroiled in a row with the government over a proposed tariff rise of 60% for Buenos Aires province water supply improvements.", "The government has rejected the increase and wants Aguas Argentinas to make an annual investment of $136 million.", "However, the firm wants a State contribution of 40% of this amount.", "The Planning Minister has ruled out a State contribution on the company's board, but the government is considering allowing a 16% increase in tariffs and the possibility of a State contribution to Aguas Argentinas infrastructure investments.", "Suez owns 40% of Aguas Argentinas, while Spain's Aguas de Barcelona is its second biggest shareholder with 25%.", "Recently, Suez lost a water concession in Bolivia after mass protests in the city of El Alto, and the firm has maintained a tense relationship with the Argentine government.", "The issue has attracted European interest, and Argentine President Nestor Kirchner met French President Jacques Chirac last week to discuss the problem.", "The government is also under pressure from European Union countries and the IMF to raise utilities tariffs."], "hermes3:3b": ["Argentina Suez Water Firm Conflict"], "stablelm-zephyr:3b": ["A conflict between the Argentine government and water company Aguas Argentinas, controlled by French firm Suez, has raised doubts about the latter's future.", "Aguas Argentinas wants a 60% tariff increase to fund water supply improvements, but the government has rejected this and instead demanded an annual investment of around $136m (£72.3m) in improvements from the company.", "The Planning Minister, Julio De Vido, said the Argentine state would not make a contribution \"in the form of a subsidy\", but might offer help in return for a seat on the board.", "However, Aguas Argentinas has ruled out any change to its legal structure regarding State participation on its board.", "This dispute follows Suez's recent loss of a water concession in Bolivia and highlights tensions between the Argentine government and international water companies operating within the country."], "chatgpt-4o-latest": ["Aguas Argentinas, controlled by France's Suez, is in conflict with the Argentine government over water tariffs and investment obligations.", "The company seeks a 60% tariff increase to fund improvements, but the government has rejected this, demanding an annual investment of 400 million pesos.", "Planning Minister Julio De Vido suggested state support in exchange for a board seat, but Aguas Argentinas refuses changes to its legal structure.", "The government has not ruled out canceling the firm's concession.", "Economic Minister Roberto Lavagna mentioned a possible 16% tariff increase and state contributions, but De Vido later denied this.", "Suez, which owns 40% of Aguas Argentinas, recently lost a water concession in Bolivia after protests.", "The company has had a strained relationship with Argentina, previously suing the state over tariff conversions during the financial crisis.", "President Nestor Kirchner has resisted tariff hikes, demanding more investment instead.", "In 2004, Aguas Argentinas agreed to invest 242 million pesos under a renegotiated contract.", "The issue has drawn European interest, with Kirchner discussing it with French President Jacques Chirac, while the EU and IMF pressure Argentina to raise utility tariffs."], "stablelm2:1.6b": ["Argentine water firm Aguas Argentinas is facing conflict between the state and its French parent company Suez, which could impact the future of the company.", "The firm seeks a 10% tariff increase to fund water-supply improvements but has been rejected by the government, who want an annual investment of $5m in infrastructure upgrades.", "Planning Minister Julio De Vido is discussing this with Aguas Argentinas while insisting that no tariff rise is happening.", "Suez owns 90% of Aguas Argentinas and Spain's Aguas de Barcelona is its second-largest shareholder.", "Recently, Suez lost a water concession in Bolivia due to mass protests in the poorest city.", "In Argentina, Suez's subsidiary has had tense relations with the government over tariff increases and contract disputes."], "granite3.1-dense:2b": ["The Argentine government, controlled by Suez through its subsidiary Aguas Argentinas, is in disagreement over water infrastructure investments and potential tariff increases.", "Aguas Argentinas seeks a 60% tariff hike to fund improvements, but the government proposes an annual contribution of 400m pesos ($136m; £72.3m) instead.", "Planning Minister Julio De Vido has offered state aid in return for a board seat, but Aguas Argentinas refuses structural changes to its governance.", "The government is considering a 16% tariff increase and potential State contributions but denies any future tariff hikes.", "Suez owns 40% of Aguas Argentinas, while Spain's Aguas de Barcelona holds 25.01%.", "This conflict mirrors Suez's previous issues in Bolivia, where a water concession was canceled following protests over unfair charges.", "President Nestor Kirchner has rejected tariff increases to avoid impoverishing citizens and insists on more investments for water demand.", "The issue has drawn international attention, with Kirchner meeting French president Jacques Chirac in Paris to discuss solutions, driven by European Union pressure and IMF recommendations to raise utilities' tariffs due to majority foreign ownership of Argentine utilities."]}