{"raw_text": "Algeria hit by further gas riots\n \n Algeria suffered a weekend of violent protests against government plans to raise gas prices, local press reports.\n \n Demonstrators in a number of regions blocked roads, attacked public buildings and overturned vehicles, newspapers including El Watan reported. The price of butane gas, a vital fuel for cooking, has risen to 200 dinars ($2.77) per canister from 170 dinars. Even before the hike, failing economic conditions had been fanning resentment in some of Algeria's poorest regions.\n \n Demonstrators took to the streets last week when the cost change was first announced, but police seemed to have restored order. According to local press reports, trouble flared up again on Saturday and carried on into Sunday. El Watan said that a number of hot spots centred on the villages and towns close to Bouira, about 100 kilometres (60 miles) south of the capital Algiers. Among the other main areas affected were the western Tiaret region and Sidi Ammar in the east of the country, Agence France Presse (AFP) reported. Riots also flared up in the Maghnia region close to the border with Morocco in the west, AFP said. Butane gas and fuel oil are used as the main source of fuel to heat homes and cook food in Algeria's remote mountain areas.\n", "llama3.2:1b": ["Algeria is experiencing further gas riots following a price hike.", "Demonstrators blocked roads and attacked public buildings while rising gas prices, particularly for butane, have made cooking and heating difficult for many residents in poor regions."], "llama3.2:3b": ["Algeria experienced violent protests against government plans to raise gas prices, which have increased from 170 dinars to 200 dinars per canister.", "Protests took place across several regions, including Bouira, Tiaret, Sidi Ammar, Maghnia, and near the border with Morocco."], "gemma2:2b": ["Algeria experienced violent protests against government-approved increases in butane gas prices.", "Demonstrators blocked roads, attacked public buildings, and overturned vehicles in multiple regions, including Bouira, Tiaret, Sidi Ammar, and Maghnia.", "The price hike, which raised the cost per canister to 200 dinars, has exacerbated economic hardship already faced by Algeria's poorest areas."], "qwen2.5:0.5b": ["A weekend of violent protests broke out in Algeria against plans to raise its prices for butane gas.", "Demonstrators blocked roads, attacked buildings, overturned vehicles, and raised the price of butane gas from 170 dinars per canister to 200 dinars.", "El Watan reported that most protests took place in the central region, while local press reports indicated trouble flared up again on Saturday in other affected areas."], "qwen2.5:1.5b": ["Algeria saw further protests over rising gas prices, resulting in violent demonstrations that began on Saturday and continued into Sunday across several regions.", "The price hike, from 170 dinars to 200 dinars per canister of butane gas for cooking, sparked unrest among the country's poorest areas due to economic conditions worsening prior to the increase."], "qwen2.5:3b": ["Algeria experienced violent protests over government plans to raise gas prices, particularly for butane gas which has risen from 170 dinars to 200 dinars per canister.", "Demonstrators blocked roads, attacked public buildings, and overturned vehicles in regions like Bouira, Tiaret, Sidi Ammar, and Maghnia.", "The unrest began after the cost change was announced last week but resumed on Saturday, with protests centered around areas near Bouira and affecting multiple provinces including Algiers, Tiaret, and eastern Algeria.", "These regions rely heavily on butane gas and fuel oil for heating homes and cooking in remote mountainous areas."], "opencoder:1.5b": ["Algeria hit by further gas riots\n\nDemonstrators blocked roads, attacked public buildings and overturned vehicles, local press reports reporting a price rise for butane gas.", "The increased cost of gas caused widespread protests in regions like Bouira, and the upheaval in economic conditions led to resentment among Algeria's poorest areas.", "The announcement of the gas rise caused police to restore order on Saturday.", "The change was announced last week, but trouble continued into Sunday.", "Several hot spots were reported around the villages and towns close to Bouira, indicating a possible border halt.", "Regulatory reports from AFP suggest more issues are surfacing in the Maghnia region close to the Morocco border."], "smollm:1.7b": ["The summary should be: Algeria hit by further gas riots"], "deepseek-r1:1.5b": ["Algeria experienced more gas riots following government plans to raise prices, with demonstrations disrupting roads, attacking public buildings, and overturning vehicles in various regions.", "The price of butane gas rose to 200 dinars per canister from 170 dinars, affecting basic cooking fuel for remote areas.", "Economic challenges have fueled resentment in some poorer regions, while protests reoccur on Saturday morning, spreading into multiple regions near Algiers."], "tinyllama:1.1b": ["Algaria was hit by violent protests against government plans to raise gas prices, with local press reporting that demonstrators blocked roads, attacked public buildings, overturned vehicles, and overturned canisters of butane gas in the towns and villages close to Bouira and other hotspots.", "The price hike to 200 dinars ($2.77) per canister of gas had already caused resentment among those living on low incomes, as well as economic hardship for many households.", "The situation was exacerbated by the government's announced move to increase the prices, and the poorest regions were most affected, with a number of hot spots centered around villages and towns close to Bouira and other locations.", "The situation was also reported in the western region of Tiaret, east of the capital Algiers, as well as in the Maghnia region near the Moroccan border, where fuel oil and butane gas were used for heating homes and cooking food in remote mountain areas."], "tinydolphin:1.1b": [" The protests in Algeria have resulted in violent riots against government plans to increase gas prices.", "The situation has been particularly challenging for the poorer regions, where resentment is high due to economic issues.", "This sparked several days of unrest that eventually saw the government back down on Monday, restoring some semblance of normalcy."], "phi:2.7b": [" On Saturday, a weekend of violent protests erupted across Algeria over government plans to increase the price of butane gas, causing damage to public buildings and vehicles.", "The country's poorest regions have been simmering with resentment due to failing economic conditions.", "Riots spread to various regions including Tiaret, Sidi Ammar, and Maghnia, and caused a number of hot spots in Algeria's mountain areas."], "orca-mini:3b": [" Algeria experienced violent protests against government plans to increase gas prices last weekend, which led to blocking roads, attacking public buildings and overturning vehicles, and even more protests occurred on Sunday.", "The price of butane gas increased from 170 dinars to 200 dinars per canister, which caused resentment among some regions."], "hermes3:3b": ["Algeria faces gas price protests"], "stablelm-zephyr:3b": ["Algeria experienced violent protests over the weekend against government plans to increase gas prices.", "Demonstrators blocked roads, attacked public buildings, and overturned vehicles in response.", "The price of butane gas, a vital fuel for cooking, rose from 170 dinars to 200 dinars per canister.", "Algeria's poorer regions, already struggling with economic conditions, were especially affected by the rising costs.", "Trouble initially erupted last week when the cost change was announced, and then flared up again over the weekend in various regions, including close to Bouira, the western Tiaret region, Sidi Ammar in the east, and the Maghnia region close to Morocco's border.", "Butane gas and fuel oil are crucial sources of warmth and cooking for many Algerians in remote mountain areas."], "chatgpt-4o-latest": ["Algeria experienced violent protests over a government decision to raise butane gas prices from 170 to 200 dinars per canister.", "Demonstrators blocked roads, attacked public buildings, and overturned vehicles, particularly in Bouira, Tiaret, Sidi Ammar, and Maghnia.", "The unrest, initially sparked when the price hike was announced, reignited over the weekend despite earlier police efforts to restore order.", "The protests reflect growing resentment in economically struggling regions, where butane gas is essential for heating and cooking."], "stablelm2:1.6b": ["Algeria experienced further protests over plans to raise gas prices, resulting in violence against government proposals in several regions.", "Demonstrators attacked public buildings, overturned vehicles, and blocked roads.", "The price of butane gas increased from 2 dinars to $2 per canister, fueled by economic conditions and resentment among the poorest areas.", "Violence erupted when the initial announcement was made, though police restored order before resurfacing on Saturday and Sunday.", "The main hotspots were in Bouira, Tiaret, Sidi Ammar, and Maghnia, as well as Morocco's western border with fuel oil and gas used for heating homes and cooking food in remote mountain areas of Algeria."], "granite3.1-dense:2b": ["Algerian protests escalated over the weekend due to government plans to increase butane gas prices from 170 dinars ($2.35) to 200 dinars ($2.77) per canister, exacerbating economic hardships in poorer regions.", "Demonstrators blocked roads, damaged public buildings, and overturned vehicles across Bouira, Tiaret, Sidi Ammar, and Maghnia areas, near Algiers.", "Previously announced price hike protests were met with police control, but this weekend's unrest required more significant intervention.", "Butane gas is crucial for heating and cooking in Algeria's mountainous regions."]}