{"raw_text": "Trial begins of Spain's top banker\n \n The trial of Emilio Botin, the chairman of Spain's most powerful bank, Santander Central Hispano, has started in Madrid.\n \n Mr Botin is accused of misusing the bank's funds after he approved the payment of 160m euros ($208m; £111m) in bonus and pension payouts to two former executives. However, the trial was suspended when Mr Botin's lawyer introduced a new set of documents on the day testimony was set to begin. A three-judge panel gave prosecution lawyers until Monday to study the documents, when the trial will be reconvened.\n \n The high-profile case began after two Santander shareholders filed a criminal complaint about the payments to Jose Maria Amusategui and Angel Corcostegui, who stepped down in 2001. Both executives helped Mr Botin orchestrate Spain's biggest bank merger, between Santander and Banco Central Hispano, in 1999. As he arrived at Spain's High Court earlier on Wednesday, Mr Botin greeted the waiting media, saying: \"I have full faith in justice.\" Santander's board of governors strongly reject the charges against their chairman, saying the payouts were legal and made with their unanimous support. But if convicted, Mr Botin could face a prison term of up to six years. Mr Corcostegui, a former CEO at Santander, also asked the court for new evidence to be admitted. In spite of the allegations against him, Mr Botin continues to lead Santander, and was instrumental in the £8.5bn takeover last November of the British bank Abbey National. Since taking over the chairmanship in 1986, he has turned Santander into one of the top ten biggest banks in the world.\n", "llama3.2:1b": ["Emilio Botin is on trial for misusing Spain's Santander Central Hispano bank funds.", "He was accused of paying 160m euros in bonus and pension payouts to two former executives.", "The trial was suspended after his lawyer introduced new documents that prosecution lawyers had not yet studied.", "The case began after two shareholders filed a criminal complaint about the payments, which were made with their unanimous support by Santander's board of governors."], "llama3.2:3b": ["The trial of Emilio Botin, chairman of Spain's largest bank Santander Central Hispano, began in Madrid, with allegations that he misused funds by paying bonuses to two former executives.", "The trial was suspended after new documents were introduced, and will reconvene on Monday.", "Botin has strong support from the bank's board of governors, who claim the payments were legal.", "If convicted, Botin could face up to six years in prison."], "gemma2:2b": ["Emilio Botin, chairman of Santander Central Hispano, is on trial for misusing bank funds after approving large bonus and pension payouts to former executives.", "The trial was suspended due to new documents introduced by his lawyer and will resume with the prosecution having until Monday to review them.", "Botin denies wrongdoing and maintains the payments were legal.", "If convicted, he faces up to six years in prison."], "qwen2.5:0.5b": ["The trial of Emilio Botin, the chairman of Spain's most powerful bank, Santander Central Hispano, began in Madrid and is expected to be held in early November.", "Mr Botin was accused of misusing the bank's funds after approving bonuses and pensions payments to former executives.", "He faces a maximum prison term of up to six years for each conviction.", "If found guilty, he could face up to 10 years in jail.", "The case began when two Santander shareholders filed a criminal complaint about payments made to Jose Maria Amusategui and Angel Corcostegui, who helped secure Spain's biggest bank merger between Santander and Banco Central Hispano in 1999.", "Mr Botin welcomed the charges but maintained that payments were legal and backed by unanimous support from his board of governors."], "qwen2.5:1.5b": ["Emilio Botin, chairman of Spain's largest bank, Santander Central Hispano, faces trial for misusing bank funds related to bonus and pension payments to former executives after approving €160 million (£208 million) payouts following a 1999 merger with Banco Central Hispano.", "The case was suspended due to new documents introduced on the day of testimony, leading to a three-judge panel requiring prosecution lawyers to study them by Monday for reconvening the trial."], "qwen2.5:3b": ["Trial begins for Spain's top banker Emilio Botin, chairman of Santander Central Hispano, accused of misusing funds by approving bonuses and pension payouts to two former executives.", "Trial suspended when new documents were introduced; trial reconvenes after three-judge panel allows prosecution until Monday to study them.", "Case stems from criminal complaint filed by two Santander shareholders against Jose Maria Amusategui and Angel Corcostegui, who helped orchestrate a bank merger in 1999.", "Botin denies charges, claims payouts were legal with board support; potential prison term up to six years if convicted.", "Santander's board rejects allegations; Corcostegui asks for new evidence.", "Despite the scandal, Botin continues as chairman and leads £8.5bn takeover of British bank Abbey National in November 2000."], "opencoder:1.5b": ["Trial begins of Spain's top banker.", "The trial of Emilio Botin, the chairman of Spain's most powerful bank, Santander Central Hispano, has started in Madrid.", "Mr Botin is accused of misusing the bank's funds after he approved the payment of 160m euros ($208m; £111m) in bonus and pension payouts to two former executives.", "However, the trial was suspended when Mr Botin's lawyer introduced a new set of documents on the day testimony was set to begin.", "A three-judge panel gave prosecution lawyers until Monday to study the documents, when the trial will be reconvened.", "The high-profile case began after two Santander shareholders filed a criminal complaint about the payments to Jose Maria Amusategui and Angel Corcostegui, who stepped down in 2001.", "Both executives helped Mr Botin orchestrate Spain's biggest bank merger, between Santander and Banco Central Hispano, in 1999.", "As he arrived at Spain's High Court earlier on Wednesday, Mr Botin greeted the waiting media, saying: \"I have full faith in justice.\"", "Santander’s board of governors strongly reject the charges against their chairman, saying the payouts were legal and made with their unanimous support.", "If convicted, Mr Botin could face a prison term of up to six years.", "Mr Corcostegui, a former CEO at Santander, also asked the court for new evidence to be admitted.", "In spite of the allegations against him, Mr Botin continues to lead Santander, and was instrumental in the £8.5bn takeover last November of the British bank Abbey National.", "Since taking over the chairmanship in 1986, he has turned Santander into one of the top ten biggest banks in the world."], "smollm:1.7b": ["The trial of Emilio Botin, the chairman of Spain's most powerful bank, Santander Central Hispano, began on Wednesday and is expected to last until Monday when the trial will be reconvened.", "The high-profile case began after two Santander shareholders filed a criminal complaint about the payments to Jose Maria Amusategui and Angel Corcostegui, who stepped down in 2001.", "Both executives helped Mr Botin orchestrate Spain's biggest bank merger, between Santander and Banco Central Hispano, in 1999.", "As he arrived at Spain's High Court earlier on Wednesday, Mr Botin greeted the waiting media, saying: \"I have full faith in justice.\"", "Santander's board of governors strongly rejects the charges against their chairman, saying the payouts were legal and made with their unanimous support.", "But if convicted, Mr Botin could face a prison term of up to six years.", "Mr Corcostegui, a former CEO at Santander, also asked the court for new evidence to be admitted.", "In spite of the allegations against him, Mr Botin continues to lead Santander, and was instrumental in the £8.5bn takeover last November of the British bank Abbey National.", "Since taking over the chairmanship in 1986, he has turned Santander into one of the top ten biggest banks in the world."], "deepseek-r1:1.5b": ["The trial began in Madrid regarding Emilio Botin's misuse of funds at Santander Central Hispano.", "Mr. Botin, chairman, is accused of approving bonuses and pensions to two executives who left in 2001.", "The trial was suspended due to new documents introduced by his lawyer before testimony on Monday.", "If convicted, he could face up to six years in prison.", "Mr. Corcostegui, a former CEO, asked for new evidence despite allegations.", "Santander has been one of the top ten largest banks globally since 1986 and led another British bank in November."], "tinyllama:1.1b": ["The trial of the top banker in Spain, Emilio Botin, began on Wednesday in Madrid.", "The former chairman of the Santander Central Hispano bank is accused of misusing funds after he approved payments totaling 160 million euros ($208 million) to two former executives, according to Spanish newspaper El País.", "A three-judge panel will reconvene on Monday to decide whether to continue with the trial against Botin, who has remained in charge of Santander since taking over from his predecessor in 1986.", "The high-profile case began after a group of shareholders filed a criminal complaint about payments made by Mr Botin and former CEO Jose Maria Amusa and Angel Corcosteguia to the bank in 2001, when they were all dismissed from their positions.", "Despite the allegations against him, Botin remains at the helm of Santander, which is one of the top ten largest banks in the world.", "The case has shaken investors and sparked calls for greater accountability and transparency in Spain's banking industry."], "tinydolphin:1.1b": [" Spanish top banker Emilio Botin faces a high-profile trial for allegedly misusing funds, including bonus and pension payments to two former executives.", "The case was suspended when his lawyer introduced new documents on Monday, but the trial is set to resume on Monday November 13th, with a three-judge panel determining if there's enough evidence to proceed with the charges.", "If convicted, Mr Botin could face up to six years in prison."], "phi:2.7b": [" The trial of Emilio Botin, chairman of Spain's most powerful bank, Santander Central Hispano, has started.", "He is accused of misusing the bank's funds for 160m euros in bonus and pension payouts to two former executives.", "Mr Botin's lawyer introduced a new set of documents on the day testimony was set to begin, resulting in the trial being suspended.", "The case began after two Santander shareholders filed a criminal complaint about the payments made to Jose Maria Amusategui and Angel Corcostegui, who stepped down from their positions in 2001.", "If convicted, Mr Botin could face up to six years in prison.", "However, he continues to lead Santander and played a key role in the bank's $8.5bn takeover of British bank Abbey National."], "orca-mini:3b": [" A trial has begun against Spain's top banker, Emilio Botin, who is accused of misusing funds from Santander after approving 160 million euro payouts to two former executives.", "The case was suspended when his lawyer introduced new documents, and a court hearing will be held next week.", "Despite the allegations against him, Botin remains the chairman of Santander and played a key role in the bank's takeover of Abbey National."], "hermes3:3b": ["Spain's Santander CEO Emilo Botin trial for misusing bank funds begins, after payment of 160m euros bonuses to ex-executives.", "Trial paused due to new documents presented."], "stablelm-zephyr:3b": ["Emilio Botin, chairman of Spain's powerful bank Santander Central Hispano, faces trial for allegedly misusing funds by approving bonus and pension payments worth €160m ($208m) to two former executives, Jose Maria Amusategui and Angel Corcostegui.", "The case began after two Santander shareholders filed a criminal complaint in 2004.", "Botin's lawyer introduced new documents on the day of testimony, leading to a suspension of the trial.", "If convicted, Botin could face a prison term of up to six years.", "Despite the allegations, he continues to lead Santander and played a significant role in the acquisition of Abbey National, making it one of the top ten biggest banks in the world."], "chatgpt-4o-latest": ["The trial of Emilio Botin, chairman of Spain's Santander Central Hispano, has begun in Madrid over allegations of misusing bank funds by approving €160m in payouts to two former executives.", "The trial was suspended when his lawyer introduced new documents, giving prosecutors time to review them.", "The case originated from a criminal complaint by two Santander shareholders regarding payments to Jose Maria Amusategui and Angel Corcostegui, who played key roles in Santander's 1999 merger.", "Santander's board defends Botin, asserting the payments were legal.", "If convicted, he could face up to six years in prison.", "Despite the charges, Botin continues to lead Santander, overseeing its £8.5bn acquisition of Abbey National and transforming the bank into a global financial powerhouse."], "stablelm2:1.6b": ["The trial for Spain's top banker, Emilio Botin, who is accused of misusing funds at his powerful bank, Santander Central Hispano, started in Madrid.", "Two former executives were awarded bonus and pension payouts totaling €5m ($6.03m; £4.87m).", "The case was suspended when a new set of documents introduced by Mr. Botin's lawyer needed to be studied by prosecution lawyers.", "If convicted, Mr. Botin could face up to six years in prison.", "Santander' s board strongly rejects the charges against their chairman, stating that the payouts were legal and made with their unanimous support."], "granite3.1-dense:2b": ["Emilio Botin, chairman of Spain's leading bank Santander Central Hispano, is on trial for allegedly misusing 160 million euros to pay bonuses and pensions to former executives Jose Maria Amusategui and Angel Corcostegui.", "The trial was postponed as his lawyer presented new documents, which prosecutors must review by Monday.", "Two Santander shareholders initially filed the criminal complaint in 2001.", "Botin's board of governors maintains the payouts were legal and approved unanimously.", "If convicted, he faces up to six years in prison.", "Despite the allegations, Botin continues leading Santander, which has expanded significantly under his leadership, including a 2019 £8.5 billion acquisition of British bank Abbey National."]}