{"raw_text": "IAAF launches fight against drugs\n \n The IAAF - athletics' world governing body - has met anti-doping officials, coaches and athletes to co-ordinate the fight against drugs in sport.\n \n Two task forces have been set up to examine doping and nutrition issues. It was also agreed that a programme to \"de-mystify\" the issue to athletes, the public and the media was a priority. \"Nothing was decided to change things - it was more to have a forum of the stakeholders allowing them to express themselves,\" said an IAAF spokesman. \"Getting everyone together gave us a lot of food for thought.\" About 60 people attended Sunday's meeting in Monaco, including IAAF chief Lamine Diack and Namibian athlete Frankie Fredericks, now a member of the Athletes' Commission. \"I am very happy to see you all, members of the athletics family, respond positively to the IAAF call to sit together and discuss what more we can do in the fight against doping,\" said Diack. \"We are the leading Federation in this field and it is our duty to keep our sport clean.\" The two task forces will report back to the IAAF Council, at its April meeting in Qatar.\n", "llama3.2:1b": "The IAAF (International Association of Athletics Federations) has established two task forces to examine doping and nutrition issues in athletics. A programme aimed at addressing these concerns will also be prioritized. Over 60 stakeholders attended a meeting in Monaco, where IAAF chief Lamine Diack expressed his support for the effort.", "llama3.2:3b": "IAAF launches anti-doping efforts by meeting with officials, coaches, and athletes, setting up two task forces, and planning a de-mystification programme for doping issues, as 60 stakeholders gathered in Monaco on Sunday.", "gemma2:2b": "The IAAF has convened a meeting with anti-doping officials, coaches, and athletes to discuss drug use in athletics.  Two taskforces were formed to address doping and nutrition concerns.  A program to increase public awareness about doping will also be developed.  Participants agreed that the goal of the meeting was to brainstorm ideas on how to fight doping more effectively. \n", "qwen2.5:0.5b": "The IAAF has formed two task forces to examine doping and nutrition issues, which were agreed upon as a priority for the program \"de-mystify\" to athletes, public and media. About 60 people attended the meeting in Monaco. The two task forces are led by Lamine Diack, the IAAF chief and Frankie Fredericks, who is now a member of the Athletes' Commission.", "qwen2.5:1.5b": "The International Association of Athletics Federations (IAAF) has convened anti-doping officials, coaches, and athletes to coordinate efforts against drug use in sports. Two task forces were formed to address doping and nutrition issues, with a focus on communicating the issue more openly to athletes, media, and public. This meeting aimed to gather input from all stakeholders and prepare for potential future changes rather than making specific decisions.", "qwen2.5:3b": "IAAF launches fight against drugs by setting up two task forces to examine doping and nutrition issues. A priority is a programme to \"de-mystify\" the issue for athletes, public, and media. About 60 stakeholders attended a meeting in Monaco, including IAAF chief Lamine Diack and Namibian athlete Frankie Fredericks. Two task forces will report back to the IAAF Council at its April meeting in Qatar.", "opencoder:1.5b": "The IAAF launches a fight against drugs. The activity takes place within the athletics' world governing body. Two task groups are set up to examine doping and nutrition issues. A programme to demystify the issue has been agreed as a priority. The IAAF has spoken publicly about the meeting attendees including members from the athlete's community. The IAAF will report back to the IAAF Council on April 15, 2023.\n", "smollm:1.7b": "The summary should be:\n\n\"IAAF launches fight against drugs\"", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the given text about the IAAF launching a fight against drugs. Let me read through the text first.\n\nThe IAAF, which is the world governing body for athletics, met with anti-doping officials, coaches, and athletes. They set up two task forces to look into doping and nutrition issues. The goal was to create a forum where stakeholders could discuss and possibly change things. They said nothing was decided yet; it was more about getting everyone involved. There were 60 people at the meeting in Monaco, including IAAF's chief and a new Namibian athlete now on the Athletes' Commission.\n\nSo the main points are: \n1. IAAF met with drug advocates.\n2. Two task forces set up to examine doping and nutrition.\n3. They wanted a forum to discuss together.\n4. No decision was made yet; focus on collaboration.\n5. 60 people attended.\n6. This is part of their fight against drug use in sports.\n\nI should make sure the summary captures all these key ideas without getting too detailed or missing any important points. I'll need to keep it concise and only include the main stuff.\n</think>\n\nThe IAAF met with anti-doping officials, coaches, and athletes to work on a drug ban campaign. Two task forces were set up to explore doping and nutrition issues. A forum was planned to discuss collaboration among stakeholders, with 60 attendees including IAAF's chief and a new Namibian athlete. This effort aims to strengthen the fight against drug use in sports.", "tinyllama:1.1b": "The International Association of Athletics Federations (IAAF) has convened a forum to address anti-doping issues in sport as part of their \"de-mystifying\" approach for athletes, coaches, and the public. A total of two task forces have been set up to investigate and assess the issue, with key stakeholders invited to attend meetings held in Monaco. The IAAF chief Lamine Diack and Namibian athlete Frankie Fredericks attended the meeting, which aimed to discuss ways to combat drug use among athletes and provide a forum for dialogue between officials, coaches, and athletes. The two task forces will report back to the IAAF Council at their April meeting in Qatar, where they are expected to make recommendations for addressing anti-doping issues in sport.", "tinydolphin:1.1b": " The International Association for Athletics Federations (IAAF) has convened a summit of experts, coaches, athletes and officials from around the world to address the issue of doping in sports. This comes as no surprise as athletics is one of the most popular sports globally, with millions watching at home and even millions more following on social media platforms. The IAAF has decided to take a collaborative approach to fighting against doping, aiming to de-mystify the issue and provide greater transparency for athletes, the public, and the media. This summit was held in Monaco, attended by notable figures such as Lamine Diack, the IAAF chief, and Frankie Fredericks, an Olympic-medalist who is now a member of the Athletes' Commission. The meeting saw over 60 athletes, coaches, and officials gather to discuss ways to ensure that athletics remains free from doping. The two task forces established to examine this issue are expected to provide their findings to the IAAF Council in April.", "phi:2.7b": " The IAAF has formed two task forces to examine doping and nutrition issues in sports, as well as launching a programme to \"de-mystify\" the issue for athletes, the public and the media. About 60 people attended a meeting in Monaco to discuss ways of furthering the fight against doping, with an emphasis on keeping sports clean. The task force reports will be presented at the IAAF Council meeting in Qatar.\n", "orca-mini:3b": " The IAAF launched a fight against drugs in athletics. They set up task forces to examine doping and nutrition issues. The IAAF spokesman said that a program to \"de-mystify\" the issue with athletes, the public, and media was important. About 60 people attended a meeting in Monaco including IAAF chief Lamine Diack and Namibian athlete Frankie Fredericks, who is now a member of the Athletes' Commission. They discussed what more they can do to fight against doping. The IAAF will report back to the Council at its April meeting in Qatar.", "hermes3:3b": "IAAF sets up task forces, co-ordinates drug fight in sports, aims to de-mystify doping issues.", "stablelm-zephyr:3b": "The IAAF, world governing body of athletics, has established anti-doping task forces and prioritized a program to \"de-mystify\" the issue for athletes, the public, and media. Around 60 people attended a meeting in Monaco, including IAAF chief Lamine Diack and athlete Frankie Fredericks, who is now part of the Athletes' Commission. The task forces will present their findings at the IAAF Council meeting in Qatar later this month.", "stablelm2:1.6b": "The International Association of Athletics Federations (IAAF) has joined forces with anti-doping officials, coaches, and athletes to coordinate a fight against drugs in sports. Two task forces have been set up to examine doping and nutrition issues. A program to de-mystify the issue is prioritized by the IAAF, as they believe it will help athletes, the public, and the media understand the importance of keeping sports clean. The stakeholders were invited to a meeting in Monaco where discussions were held, including attendance from IAAF chief Lamine Diack and Namibian athlete Frankie Fredericks, now a member of the Athletes' Commission. The task forces will report back to the IAAF Council at their April meeting in Qatar.", "granite3.1-dense:2b": "The International Association of Athletics Federations (IAAF) convened a high-level meeting with anti-doping officials, coaches, athletes, and Lamine Diack, IAAF chief, to collaborate on combating doping in sports. This event, held in Monaco, resulted in the establishment of two task forces focusing on doping and nutrition issues. A key priority was creating a program to clarify these matters for athletes, the public, and media members. The gathering, attended by about 60 people, aimed to foster open dialogue and generate ideas rather than implement specific changes immediately. IAAF chief Diack emphasized the importance of maintaining clean athletics as a leading body in this domain. The task forces' findings will be presented to the IAAF Council during its April meeting in Qatar.", "chatgpt-4o-latest": "The IAAF has convened anti-doping officials, coaches, and athletes to coordinate efforts against drug use in sports. Two task forces were established to examine doping and nutrition issues, with a focus on educating athletes, the public, and the media. The meeting, attended by about 60 people, including IAAF chief Lamine Diack and athlete Frankie Fredericks, served as a forum for discussion rather than decision-making. Diack emphasized the IAAF's responsibility to maintain clean athletics. The task forces will report their findings at the IAAF Council meeting in April in Qatar.", "reference": "\"I am very happy to see you all, members of the athletics family, respond positively to the IAAF call to sit together and discuss what more we can do in the fight against doping,\" said Diack.The two task forces will report back to the IAAF Council, at its April meeting in Qatar.\"Nothing was decided to change things - it was more to have a forum of the stakeholders allowing them to express themselves,\" said an IAAF spokesman.The IAAF - athletics' world governing body - has met anti-doping officials, coaches and athletes to co-ordinate the fight against drugs in sport."}