{"raw_text": "Isinbayeva claims new world best\n \n Pole vaulter Yelena Isinbayeva broke her own indoor world record by clearing 4.89 metres in Lievin on Saturday.\n \n It was the Russian's 12th world record of her career and came just a few days after she cleared 4.88m at the Norwich Union Grand Prix in Birmingham. The Olympic champion went on to attempt 5.05m at the meeting on France but failed to clear that height. In the men's 60m, former Olympic 100m champion Maurice Greene could only finish second to Leonard Scott. It was Greene's second consecutive defeat at the hands of his fellow American, who also won in Birmingham last week. \"I ran my race perfectly,\" said Scott, who won in 6.46secs, his best time indoors. \"I am happy even if I know that Maurice is a long way from being at his peak at the start of the season.\"\n", "llama3.2:1b": "Yelena Isinbayeva broke her indoor world record with a clearance of 4.89m on Saturday. This was her 12th career world record, following a 5.05m attempt in France where she finished second.", "llama3.2:3b": "Yelena Isinbayeva broke her indoor world record with a jump of 4.89m, her 12th world record, and failed to clear 5.05m in Lievin. Leonard Scott won the men's 60m event with a time of 6.46secs, defeating Maurice Greene for the second consecutive meet.", "gemma2:2b": "Yelena Isinbayeva broke her own indoor world record with a height of 4.89 meters. This was her 12th world record and came after a previous attempt at 5.05 meters. Maurice Greene finished second in the men's 60m, losing to Leonard Scott for the second time this season.  \n", "qwen2.5:0.5b": "Yelena Isinbayeva broke her world record by clearing 4.89 metres in Lievin on Saturday and became the Russian's 12th indoor world record, following another attempt to clear 4.88m at Norwich Union Grand Prix. The Olympic champion cleared 5.05m at France meet but failed that time. Scott finished second after Greene won his race by less than a tenth of a second.", "qwen2.5:1.5b": "Yelena Isinbayeva set a new indoor world record by clearing 4.89 meters in Lievin, becoming her 12th such achievement and surpassing her previous mark of 4.88 meters. Former Olympic champion Maurice Greene finished second in the men's 60m race at the same meeting despite losing to Scott again on his comeback season opener.", "qwen2.5:3b": "Pole vaulter Yelena Isinbayeva set a new indoor world record by clearing 4.89m in Lievin, breaking her own previous mark. This was her 12th career world record. Greene finished second to American Leonard Scott in the men's 60m sprint event at an indoor track meet.", "opencoder:1.5b": "\"Isinbayeva claims new world best pole vaulter Yelena Isinbayeva broke her own indoor world record by clearing 4.89 metres in Lievin on Saturday. She was the 12th world record of her career and came just a few days after she cleared 4.88m at Norwich Union Grand Prix in Birmingham. The Olympic champion went on to attempt 5.05m at France meeting but failed to clear that height. In the men's 60m, former Olympic 100m champion Maurice Greene could only finish second to Leonard Scott. He won in 6.46 secs last week. I ran my race perfectly, happy even if I know that he is a long way from beating at the start of the season.\" \n\nThis text summarizes Isinbayeva's claims about her world record and how she achieved her goal on Saturday. It also mentions Yelena Isinbayeva, who was a pole vaulter, and her results in several different sports. It touches on challenges faced and victories made, with the mention of a happy end to her efforts.\n", "smollm:1.7b": "The summary should be:\nIsinbayeva claims new world record by clearing 4.89m in Lievin on Saturday.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely while preserving the key ideas and details. The user has given me a specific response they want for their query. Let's see what they included.\n\nThe main points are about Yelena Isinbayeva breaking her world record in Lievin, and some mentions of other events like the 60m meet and Greene's performance against Scott and Leonard. I should make sure to include all these elements but keep it simple.\n\nI need to avoid explanations or any additional text beyond just a plain summary. The user emphasized preserving key ideas and details without any extra stuff. So, I'll start by stating that Yelena Isinbayeva broke her record in Lievin. Then mention the previous record there, which was 4.88m. Next, talk about other events she participated in but didn't achieve records, like the 60m meet where Greene was second and against Scott and Leonard, even though he had a good time of 6.46 secs.\n\nI should keep it concise, making sure each event is mentioned without going into too much detail. Let me structure it that way.\n</think>\n\nYelena Isinbayeva broke her world record in Lievin, clearing 4.89m, beating the previous record of 4.88m there. In Birmingham, she attempted a 5.05m height and finished second to Leonard Scott. In the men's 60m meet, former Olympic 100m champion Maurice Greene finished second against former American Olympic 100m champion Leonard Scott, who won in 6.46 secs.", "tinyllama:1.1b": "In Lievin on Saturday, Polina Isinbayev set a new world record by clearing 4.89m indoor. The Russian athlete broke her own mark and became just the 12th woman in history to achieve it. In other results, Olympic champion Maurice Green ran second to Leonard Scott, who won with his best time indoors (6.46sec).", "tinydolphin:1.1b": " Pole vaulter Yelena Isinbayeva has made history by clearing 4.89 metres in Lievin, surpassing her own indoor world record with a leap that was just one centimetre less than the previous best. This marks Isinbayeva's eleventh world record of her career and she has now broken the indoor world record five times in a row. In addition to this achievement, Isinbayeva also set a new outdoor world record of 4.88m at the Norwich Union Grand Prix in Birmingham. This is just one day after she cleared 5.05 metres at the meeting on France. Despite attempting five attempts at the 60m event during this event, Scott only finished second to Leonard Scott's winning time of 6.46 seconds.", "phi:2.7b": " Yelena Isinbayeva broke her indoor world record by clearing 4.89m in Lievin, and went on to attempt 5.05m with no success. Former 100m Olympic champion Maurice Greene won the men's 60m event, finishing second after being defeated by fellow American Leonard Scott at the Norwich Union Grand Prix a few days earlier.\n", "orca-mini:3b": " Yelena Isinbayeva broke her own indoor world record by clearing 4.89 meters in Lievin on Saturday, just a few days after she cleared 4.88m at the Norwich Union Grand Prix in Birmingham. Maurice Greene could only finish second to Leonard Scott in the men's 60m, despite winning indoors last week.", "hermes3:3b": "Yelena Isinbayeva sets indoor world record for pole vault.", "stablelm-zephyr:3b": "Yelena Isinbayeva jumped 4.89m pole vault, breaking her own indoor world record for the 12th time. She previously cleared this height just a few days ago at the Norwich Union Grand Prix in Birmingham. Maurice Greene came second in the men's 60m, his fellow American Leonard Scott winning again.", "stablelm2:1.6b": "Yelena Isinbayeva sets new indoor world record with a 4.20m clearance in Lievin, while Maurice Greene finishes second to Leonard Scott in both events at the meeting held in France and Birmingham.", "granite3.1-dense:2b": "Pole vaulter Yelena Isinbayeva set a new world record by clearing 4.89 metres during an indoor meet in Lievin, her 12th world record overall. This achievement followed her previous 4.88m clearance at the Norwich Union Grand Prix in Birmingham. Despite attempting 5.05m, she fell short. In the men's 60m event, Maurice Greene, the former Olympic 100m champion, placed second to Leonard Scott, who won with a personal-best time of 6.46 seconds. This was Scott's second consecutive victory over Greene since their encounter in Birmingham.", "chatgpt-4o-latest": "Yelena Isinbayeva set a new indoor pole vault world record by clearing 4.89m in Lievin, surpassing her previous record of 4.88m set days earlier. This marked her 12th world record. She attempted 5.05m but failed. In the men's 60m, Leonard Scott defeated former Olympic champion Maurice Greene for the second consecutive time, winning in 6.46 seconds, his best indoor time. Scott acknowledged Greene was not yet at his peak.", "reference": "In the men's 60m, former Olympic 100m champion Maurice Greene could only finish second to Leonard Scott.It was the Russian's 12th world record of her career and came just a few days after she cleared 4.88m at the Norwich Union Grand Prix in Birmingham.It was Greene's second consecutive defeat at the hands of his fellow American, who also won in Birmingham last week."}