{"raw_text": "Merritt close to indoor 400m mark\n \n Teenager LaShawn Merritt ran the third fastest indoor 400m of all time at the Fayetteville Invitational meeting.\n \n The world junior champion clocked 44.93 seconds to finish well clear of fellow American Bershawn Jackson in Arkansas. Only Michael Johnson has gone quicker, setting the world record of 44.63secs in 1995 and running 44.66secs in 1996. Kenyan Bernard Lagat missed out on the world record by 1.45secs as he ran the third quickest indoor mile ever to beat Canada's Nate Brannen by almost 10secs. The Olympic silver medallist's time of three minutes 49.89secs was inferior only to the 1997 world record of Moroccan Hicham El Guerrouj and former world record holder Eamonn Coghlan of Ireland's 3:49.78. Lagat was on course to break El Guerrouj's record through 1200m but could not maintain the pace over the final 400m. Ireland's\n \n continued his excellent form by winning a tight 3,000m in 7:40.53. Cragg, who recently defeated Olympic 10,000m champion Kenenisa Bekele in Boston, held off Bekele's Ethiopian colleague Markos Geneti by only 0.19secs to secure his victory. Mark Carroll, who will join Cragg in the European Indoor Championships next month, finished a solid third in 7:46.78. Olympic 200m gold medallist\n \n of Jamaica ran the fastest women's 60m in the world this year as she equalled her personal best of 7.09secs. World indoor 60m hurdles champion\n \n also won, improving his season-leading time to 7.51secs.\n", "llama3.2:1b": "Teenager LaShawn Merritt ran the third fastest indoor 400m of all time at the Fayetteville Invitational meeting.\n\nMerritt finished well clear of fellow American Bershawn Jackson in Arkansas.\n\nAmerican Michael Johnson set the world record for indoor 400m in 1995 with a time of 44.63 seconds, and only LaShawn Merritt (44.93 seconds) is quicker.\n\nKenyan Bernard Lagat came close to breaking Johnson's record but was beaten by Nate Brannen by almost 10 seconds.\n\nLagat ran the third quickest indoor mile ever.\n\nOlympic silver medallist Hicham El Guerrouj set the world record in indoor track with a time of 3:49.78, and LaShawn Merritt was only two seconds off.\n\nIreland's Coghlan won the women's 3000m at the Fayetteville Invitational meeting.\n\nOther winners included Mark Carroll, who finished third in the men's 400m with a time of 7:46.78.", "llama3.2:3b": "LaShawn Merritt ran 44.93 seconds at the Fayetteville Invitational, the third fastest indoor 400m in history. Bernard Lagat missed out on a world record by 1.45 secs, while Adam Cragg won the 3,000m with 7:40.53. Asafa Powell set the women's 60m record with 7.09secs, and Allen Johnson won the 60m hurdles with 7.51secs.", "gemma2:2b": "LaShawn Merritt ran the third fastest indoor 400 meters of all time (44.93 seconds). Bernard Lagat set a new world record for the indoor mile with a time of 3:49.89, and Irish runner  Andrew Cragg won the men's 3000m race. Jamaican sprinter Shelly-Ann Fraser-Pryce set a new world record in the women's 60m, while the reigning champion Noah Lyles set a new season-leading time in the 60m hurdles. \n", "qwen2.5:0.5b": "Teenager LaShawn Merritt clocked the third fastest indoor 400m in Fayetteville, winning by almost 10 seconds compared to fellow American Bershward Jackson. Michael Johnson finished fourth with a time of 44.63 seconds. Kenyan Bernard Lagat was close behind but failed to break the world record set by him. Irish athlete Hicham El Guerrouj won the 3,000m and Cragg finished third in the 10,000m with a time of 7:46.78. Jamaica's Olympic 60m hurdles champion, World Indoor 60m hurdles champion, won the event finishing seventh with a time of 7.51 seconds.", "qwen2.5:1.5b": "Teenager LaShawn Merritt ran the third fastest indoor 400m in history at Fayetteville Invitational, clocking 44.93 seconds, narrowly ahead of fellow American Bershawn Jackson and Michael Johnson's world record of 44.63 secs from 1995. Lagat missed out on breaking El Guerrouj's 200m record but ran a strong 3,000m.", "qwen2.5:3b": "LaShawn Merritt ran the third fastest indoor 400m of all time with a time of 44.93 seconds at the Fayetteville Invitational, bettering fellow American Bershawn Jackson. Only Michael Johnson has gone quicker indoors (44.63/44.66 secs). Bernard Lagat finished third in the indoor mile but missed setting the world record by 1.45 seconds, coming in third to Canadian Nate Brannen. In other events, Irish athlete Mark Carroll won the 3000m with a time of 7:40.53, just ahead of Kenenisa Bekele and Mark Geneti. Jamaica's Shelly-Ann Fitch ran the fastest indoor women's 60m of the year equaling her personal best at 7.09 secs, while World Indoor 60m hurdles champion Frankie Fredericks improved his season-leading time to 7.51 secs.", "opencoder:1.5b": "Merritt close to indoor 400m mark\n\nThe world junior champion LaShawn Merritt ran the third fastest indoor 400m of all time at the Fayetteville Invitational meeting. It was only Michael Johnson who had set the world record of 44.63 seconds in 1995 and running 44.66secs in 1996. Kenyan Bernard Lagat missed out on the world record by almost 10 secs as he ran the third quickest indoor mile ever to beat Canada's Nate Brannen.\n\nLagat's time of three minutes 49.89 seconds was inferior only to the 1997 world record of Moroccan Hicham El Guerrouj and former world record holder Eamonn Coghlan of Ireland's 3:49.78. The Olympic silver medallist's time of three minutes 47.63 seconds was not as high as 49.89 seconds but it is more than double the first place finish.\n\nMarkos Geneti, who won 3,000m in 7:40.53, continued his excellent form by defeating Kenenisa Bekele in Boston. It's hard to break even at this fast finish, especially with the distance of 400m.\n\nCragg, who defeated Olympic 10,000m champion Kenenisa Bekele in Boston, held off Bekele's Ethiopian colleague Markos Geneti by only 0.19secs to secure his victory. This defeat helped mark the climax of the race.\n", "smollm:1.7b": "The summary is concise and preserves key ideas and details from the original text. It includes the main points: Merritt's record in the indoor 400m mark, the world junior champion, Michael Johnson's fastest indoor 400m time, and the current world record of 44.63secs. The summary also mentions Lagat's missed opportunity to beat the current world record by 1.45secs, as well as the Olympic silver medallist's time in the indoor 400m mark. Finally, it includes the details of the current season-leading time for the Jamaican sprinter and the winner of the 200m hurdles event.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely. The user provided a detailed paragraph with information about track and field events involving Merritt and Lagat from New Jersey. There are multiple athletes mentioned who set records or had good performances in various races.\n\nFirst, I'll identify key details: the young runner's performance at the Fayetteville Invitational, his record-breaking time of 44.93 seconds, how he compares to others like Bershawn Jackson and Michael Johnson, and mention Kenyan Bernard who got close but lost. Then, their other achievements in races like the mile and 10,000m.\n\nI need to condense all this into a short summary without extra information. I'll focus on the runner's key moments: the indoor 400m, his record, and how he did in other events. Also, note that Lagat is in training for future competitions and continues to perform well.\n\nLet me structure it so each main event is highlighted. I'll mention Merritt's indoor 400m as his main achievement, then include the mile, and his performance in 10,000m. For Lagat, I'll focus on the indoor mile record, his performance in other events, and his training updates.\n\nI need to make sure it flows well and is easy to understand without unnecessary details. Also, ensure that all key names are included correctly and only the essential points are covered.\n</think>\n\nMerritt ran the fastest indoor 400m world champion at the Fayetteville Invitational with a record of 44.93 seconds, setting a new personal best behind fellow American Bershawn Jackson. He improved on Michael Johnson's time, who broke the world record in 1995. Lagat, an athlete from Kenya, also excelled in other events, finishing third in the mile and winning a close race in 7:40.53 at 3,000m. During training for future competitions, Lagat was preparing to break a world record over the final 400m of a 1200m race but struggled to maintain pace. Meanwhile, Cragg secured a solid finish in the 7:46.78 time at the European Indoor Championships.", "tinyllama:1.1b": "Summarize the article about Teenager LaShawn Merritt's fastest indoor 400m and Merritt winning a ti ghteen 3,000m in Boston. It mentions Merritt's world junior champion and world record indoor mile run, Cragg beating Ethiopian rival Bekele in the 10,000m and Carroll finishing third among Europeans. The article also discusses Merritt's equaling of her own personal best time for 60m hurdles and improvement of her season-leading indoor time for 60m hurdles.", "tinydolphin:1.1b": " Merritt finished third among American athletes in the men's indoor 400 meters race at the Fayetteville Invitational meeting. He clocked a personal best of 44.93 seconds, just behind the previous world record of 44.63 seconds set by Kenyan Bernard Lagat in 1995 and running an impressive 44.66 seconds in 1996. Merritt's time of 44.93 seconds was faster than the second-fastest indoor mile ever, which was achieved by Michael Johnson with a time of 44.63 seconds in 1995.", "phi:2.7b": " Teenage runner LaShawn Merritt ran the third fastest indoor 400m in history at a recent competition, beating Bershawn Jackson by almost 10 seconds. The world junior record holder, Michael Johnson, set the previous world record of 44.63seconds in 1995 and 44.66 seconds in 1996. Bernard Lagat also came close to breaking the record, but could not maintain his pace over the final 400m. Ireland's Mark Car\n", "orca-mini:3b": " Teenager LaShawn Merritt ran the third fastest indoor 400m of all time and set a new world record in the indoor mile as he beat Canadian athlete Nate Brannen by almost 10 seconds at the Fayetteville Invitational meeting. Bernard Lagat missed the world record by 1.45 seconds as he clocked the third quickest indoor mile ever, running the equivalent of 3:49.89 in the mile event. Kenenisa Bekele's Ethiopian colleague Markos Geneti held off Kenenisa Bekele to win the men's 3000m race by only 0.19 seconds. Olympic 10,000m champion Kenenisa Bekele was beaten by Mark Carroll in Boston's 2000m race.", "hermes3:3b": "LaShawn Merritt runs 3rd fastest indoor 400m with 44.93s, while Bernard Lagat sets 3rd quickest indoor mile at 3:49.89s.", "stablelm-zephyr:3b": "Teenager LaShawn Merritt achieved the third fastest indoor 400m time of all time at the Fayetteville Invitational meeting with a time of 44.93 seconds. Kenyan Bernard Lagat ran the third quickest indoor mile, missing out on the world record by 0.45 seconds. Irish athlete Ireland's Mor Wojciechowski continued his excellent form by winning a tight 3,000m race against Olympic 10,000m champion Kenenisa Bekele's Ethiopian teammate Markos Geneti. World indoor 60m hurdles champion also won, improving her season-leading time to 7.51 seconds.", "stablelm2:1.6b": "Teenager LaShawn Merritt set a new record for the third fastest indoor 200 meters ever at the Fayetteville Invitational meeting with a time of 22 seconds. This surpasses Michael Johnson's world record of 5 seconds and beats fellow American Bershawn Jackson. Bernard Lagat came in third quickest with a time of three minutes, five seconds, just missing out on breaking Hicham El Guerrouj's indoor mile record by one second. Ireland's Cragg won the men's 3000m race in 7:02. Among women, Jamaica's Olympic gold medalist ran the fastest women's 200 meters in the world this year with a time of 22 seconds and equaling her personal best. The world junior champion improved his season-leading time to 7.2 seconds.", "granite3.1-dense:2b": "At the Fayetteville Invitational, LaShawn Merritt set a new third-fastest indoor 400m record of 44.93 seconds, surpassing Bershawn Jackson. Only Michael Johnson has run faster, with records of 44.63 and 44.66 seconds. Kenyan Bernard Lagat, an Olympic silver medallist, ran the third-fastest indoor mile (3:49.89), beating Canada's Nate Brannen by nearly 10 seconds but falling short of Morocco's Hicham El Guerrouj's record by just 1.45 seconds. In the 3,000m, Ireland's Stephen Cragg outpaced Ethiopia's Markos Geneti by 0.19 seconds, maintaining his recent dominance over Bekele. Britain's Chris O'Hare finished third in 7:46.78. Jamaica's Shelly-Ann Fraser-Pryce ran the fastest women's 60m this year with a time of 7.09 seconds, also equalling her personal best as she improved her 60m hurdles time to 7.51 seconds.", "chatgpt-4o-latest": "Teenager LaShawn Merritt ran the third fastest indoor 400m ever at the Fayetteville Invitational, clocking 44.93 seconds. Only Michael Johnson has run faster, with a world record of 44.63 seconds. Kenyan Bernard Lagat recorded the third fastest indoor mile in history at 3:49.89 but fell short of Hicham El Guerrouj’s 1997 record. Alistair Cragg won a close 3,000m race in 7:40.53, narrowly beating Markos Geneti. Olympic 200m champion from Jamaica ran the fastest women's 60m of the year at 7.09 seconds, while the world indoor 60m hurdles champion improved his season-best to 7.51 seconds.", "reference": "Kenyan Bernard Lagat missed out on the world record by 1.45secs as he ran the third quickest indoor mile ever to beat Canada's Nate Brannen by almost 10secs.The Olympic silver medallist's time of three minutes 49.89secs was inferior only to the 1997 world record of Moroccan Hicham El Guerrouj and former world record holder Eamonn Coghlan of Ireland's 3:49.78.World indoor 60m hurdles champion  also won, improving his season-leading time to 7.51secs.Only Michael Johnson has gone quicker, setting the world record of 44.63secs in 1995 and running 44.66secs in 1996.Olympic 200m gold medallist  of Jamaica ran the fastest women's 60m in the world this year as she equalled her personal best of 7.09secs."}