{"raw_text": "Jones medals 'must go if guilty'\n \n World Anti-Doping Agency (WADA) chief Dick Pound says Marion Jones should be stripped of all her medals if found guilty of taking banned substances.\n \n Victor Conte, of Balco Laboratories, claims the American sprinter regularly used drugs to enhance her performance. \"If she is found guilty she should be stripped of all her medals and banned for two years,\" said Pound. Asked if there was a timescale as to what medals could be taken, Pound said: \"That is not an issue at all.\" However, under International Olympic Committee (IOC) rules, athletes can only be stripped of their medals if caught within three years of the event. Jones, who won five medals at the 2000 Olympics, denies using drugs and says she will take legal action over Conte's allegations. Balco Laboratories is the firm at the centre of a wide-reaching investigation into doping in the US. Pound continued: \"If she has indeed taken drugs it is going to be a big disappointment for a lot of people.\"\n", "llama3.2:1b": "Marion Jones' medals could be stripped if found guilty of using banned substances, with the WADA chief suggesting she should be banned for two years. She denies using drugs and plans to take legal action over Victor Conte's allegations.", "llama3.2:3b": "Jones, if found guilty of using banned substances, should be stripped of all medals and banned for two years according to Dick Pound. However, IOC rules only allow for medal stripping within three years of the event.", "gemma2:2b": "Dick Pound believes Marion Jones should lose all her Olympic medals if found guilty of using banned substances. Victor Conte claims she used performance-enhancing drugs, and under IOC rules, medal stripping can only occur within three years of the event. Jones denies using drugs and will take legal action against Conte's allegations.  \n", "qwen2.5:0.5b": "Dick Pound, chief of World Anti-Doping Agency (WADA), claims Marion Jones should be stripped of her medals if found guilty of using banned substances. Victor Conte, an Olympic athlete at Balco Laboratories, says the American sprinter regularly used drugs to enhance her performance and could face two years' ban under International Olympic Committee (IOC) rules. The investigation into doping in the US has revealed a wide-reaching affair between Powell and Conte. Jones denies using any drugs but is planning to take legal action over Conte's allegations.", "qwen2.5:1.5b": "Marion Jones could lose all her medals if found guilty of using banned substances, according to World Anti-Doping Agency chief Dick Pound. Balco Labs owner Victor Conte claims Jones used drugs to enhance her performance. While IOC rules allow stripping medals only three years after the event, WADA suggests she should be punished for life.", "qwen2.5:3b": "World Anti-Doping Agency (WADA) chief Dick Pound suggests Marion Jones should have all her medals stripped if found guilty of using banned substances, calling for a two-year ban. However, under International Olympic Committee rules, only medals from the last three years can be revoked. Jones denies using drugs and will take legal action against claims made by Victor Conte, head of Balco Laboratories, which is at the center of an investigation into doping in the US.", "opencoder:1.5b": "Jones medals must go if found guilty about taking banned substances. World Anti-Doping Agency chief Dick Pound, who has been there since 1976, made the case that if Marion Jones is found guilty of taking banned substances, all her medals should be taken immediately and she should be banned for two years. Pound also stressed that there's no need for a timeframe because it's not an issue at all under the IOC rules. Jones also won five medals at 2,000 Olympics and says she has had no other drug use after winning those medals. If she continues to misuse drugs, it would be against her will, and hence, against the law.\n", "smollm:1.7b": "Jones medals must go if guilty", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Marion Jones and the International Olympic Committee (IOC). Let me read through it first.\n\nSo, the main points are that WADA says if someone takes banned substances like steroids or performance-enhancing drugs, they must be stripped of all medals and banned for two years. But in reality, some athletes can only be taken off their medals within three years, not two. The text mentions Victor Conte, a chemist at Balco Laboratories, who claims Jones regularly used these drugs to improve her performance.\n\nPound from WADA says if Jones is guilty, she should have all her medals taken and banned for two years. But he also says that the IOC rules prevent taking off medals after three years. Jones challenges this, saying she denies using drugs and plans to fight against Conte's claims.\n\nBalco Laboratories is involved in a big investigation into doping, with pound emphasizing that if Jones has used drugs, it would be a big mistake for many people. The key points are about the rules of medals, the current controversy with Jones, and the ongoing investigation at Balco.\n\nI need to make sure I capture all these details without adding any extra information. I'll start by mentioning WADA's stance on medals, then Jones' denial and her potential legal action. I'll note the IOC rules versus WADA's request for a two-year ban. Then, mention Conte's role at Balco and the ongoing investigation.\n\nI should keep it concise, only summarizing without any explanations or formatting. So, just list the main points in a clear way.\n</think>\n\nWADA requires immediate removal of all medals if Jones is found guilty, citing a 2000 Olympics performance that included drug use. However, IOC allows for a two-year ban upon guilt, conflicting with WADA's request for three years. Jones denies drug use and plans legal action against Conte. Balco Laboratories are involved in an investigation into doping at the US level.", "tinyllama:1.1b": "Joones medals must go if guilty, WADA chief says after drug-taking claims made by World Anti-Doping Agecoffee (WADE) chief Dick Pound. Victor Conte claims American sprinter Marion Jones used banned substances to enhance her performance, and Pound said there is no specific timeline for stripping her medal collections, citing the IOC's three-year limit. However, under International Olympic Committee (IOC) rules, athletes can only be stripped of their medals if caught within three years of the event, as per WADE's allegations. Jones has denies using any substances and is considering legal action against Conte and his firm Balco Laboratoriessince WADA investigated the US Doping Agency.", "tinydolphin:1.1b": " The World Anti-Doping Agency (WADA) announced on Monday that Marion Jones, who won five medals at the 2000 Olympics, should be stripped of all her medals if found guilty of taking banned substances. This decision was made by WADA's chief, Dick Pound, and his counterpart at Balco Laboratories, Victor Conte. However, there is no explicit timeframe set for this process. Marion Jones denies using drugs and her attorney has filed a lawsuit against the company. The question of what specific medals should be taken away from Jones remains unclear under WADA's guidelines.", "phi:2.7b": " Marion Jones may have been taking banned substances, according to Victor Conte's claims. WADA chief Dick Pound believes Jones should forfeit all her medals if found guilty and should also be banned from competing for two years. However, the IOC rules only allow athletes to be stripped of their medals three years after an event occurs. Despite Jones' denial of using drugs, she has been accused by Balco Laboratories of doping, which is under investigation. If proven guilty, it would be a significant disappointment for many people.\n", "orca-mini:3b": " Jones, who won five medals at the 2000 Olympics, should be stripped of her medals if found guilty of using banned substances according to Dick Pound, the head of WADA. Victor Conte, of Balco Laboratories, claims that Jones regularly used drugs to enhance her performance. However, under IOC rules, athletes can only be stripped of their medals if caught within three years of the event. Jones has denied using drugs and says she will take legal action over Conte's allegations. A wide-reaching investigation into doping in the US is also underway. Pound continued that Jones' case is a big disappointment for many people.", "hermes3:3b": "Marion Jones should lose medals if proven doping, says WADA chief Pound.", "stablelm-zephyr:3b": "WADA chief Dick Pound recommends Marion Jones be stripped of all her medals if found guilty of using banned substances, as suggested by Victor Conte, who claims the American sprinter regularly used drugs to enhance her performance. Under IOC rules, athletes can only be stripped of their medals if caught within three years of the event; however, Pound says it is not an issue and emphasizes that if Jones is found guilty, it will be a big disappointment for many people. Jones denies using drugs and plans to take legal action against Conte's allegations, which are connected to Balco Laboratories, the center of a wide-ranging investigation into doping in the US.", "stablelm2:1.6b": "WADA chief Dick Pound suggests that Marion Jones should lose all her medals if found guilty of using banned substances, as Victor Conte and Balco Laboratories claim she regularly used drugs to improve her performance. However, under IOC rules, athletes can only be stripped of their medals within three years of the event; Jones denies drug use and plans to take legal action over the allegations.", "granite3.1-dense:2b": "Dick Pound, head of WADA, asserts that Marion Jones should lose all her medals if proven guilty of using banned substances. Victor Conte from Balco Laboratories has accused Jones of regular drug use for performance enhancement. Under WADA's stance, no specific timeframe is necessary for taking medals; however, IOC rules allow stripping only within three years post-event. Jones, a 2000 Olympic gold medalist, denies the allegations and plans legal action against Conte. Balco Laboratories is at the heart of a significant US doping investigation. Pound expressed disappointment if Jones were found guilty.", "chatgpt-4o-latest": "WADA chief Dick Pound stated that Marion Jones should be stripped of all her medals and banned for two years if found guilty of using banned substances. Victor Conte of Balco Laboratories claims Jones regularly used performance-enhancing drugs, though she denies the allegations and plans legal action. Under IOC rules, athletes can only lose medals if caught within three years of the event. Balco is central to a major doping investigation in the US, and Pound acknowledged that a guilty verdict would be highly disappointing.", "reference": "\"If she is found guilty she should be stripped of all her medals and banned for two years,\" said Pound.World Anti-Doping Agency (WADA) chief Dick Pound says Marion Jones should be stripped of all her medals if found guilty of taking banned substances.Asked if there was a timescale as to what medals could be taken, Pound said: \"That is not an issue at all.\"Jones, who won five medals at the 2000 Olympics, denies using drugs and says she will take legal action over Conte's allegations."}