{"raw_text": "Gatlin and Hayes win Owen awards\n \n American Olympic stars Justin Gatlin and Joanna Hayes have been named the winners of the 2004 Jesse Owens Awards, USA Track & Field's (USATF) top honour.\n \n Gatlin, 22, won the closest 100m final in Games history with a career-best time of 9.85 seconds in Athens. He also won bronze in the 200m and silver in the 4x100m relay, becoming the only male athlete to win three athletics medals this summer. Hayes, 27, set an Olympic record of 12.37 in winning the 100m hurdles. Established in 1981, the Jesse Owens Awards - named in honour of the late Olympic great who won four gold medals at the 1936 Berlin Games - are presented annually to the outstanding US male and female track and field performers.\n \n The 2004 awards will be presented on 3 December in conjunction with the USATF annual meeting in Portland. \"It is such a great honour to win the Jesse Owens Award,\" said Gatlin. \"It is one of the biggest honours in track and field and it is a great end to a great year. \" Hayes said: \"Knowing some of the great people who have won this award before me and knowing what it represents, I feel a sense accomplishment and pride which lets me know that everything that I have worked for is and always will be worth it.\"\n", "llama3.2:1b": "Justin Gatlin and Joanna Hayes were awarded the 2004 Jesse Owens Awards. \n\nGatlin won the 100m and 4x100m relay in Athens, and set a new Olympic record in the 100m hurdles. \nHayes broke an Olympic record with her winning time of 12.37 seconds in the 100m hurdles.\n\nThe awards were presented on December 3, 2004, at USATF's annual meeting.", "llama3.2:3b": "Justin Gatlin and Joanna Hayes win 2004 Jesse Owens Awards; Gatlin set career-best time in Athens; Hayes won Olympic record in 100m hurdles.", "gemma2:2b": "Justin Gatlin and Joanna Hayes won the 2004 Jesse Owens Awards.  Gatlin won gold in the 100m with a new record, and Hayes set an Olympic record in the 100m hurdles. They will be honored at the USATF annual meeting on December 3rd.  \n", "qwen2.5:0.5b": "American Olympic athletes Justin Gatlin (22) and Joanna Hayes (27) won the Jesse Owens Award in 2004, becoming the first US male and female track and field performers to receive this honour. The award is presented annually by USA Track & Field's President. The 2004 awards will be given at an annual meeting of the organization in Portland, Washington.", "qwen2.5:1.5b": "American sprinters Justin Gatlin and Joanna Hayes win 2004 Jesse Owens Awards.", "qwen2.5:3b": "American Olympic stars Justin Gatlin and Joanna Hayes were named winners of the 2004 Jesse Owens Awards by USA Track & Field (USATF). Gatlin, aged 22, set a record in the 100m with a time of 9.85 seconds, winning bronze in the 200m and silver in the 4x100m relay. Hayes, aged 27, broke an Olympic record in the 100m hurdles. The Jesse Owens Awards are given annually to top US track and field performers, honoring athletes like Owens who won four gold medals at the 1936 Berlin Games. Gatlin and Hayes will be presented with their awards on December 3rd during a meeting of USATF in Portland.", "opencoder:1.5b": "The American Olympic stars Justin Gatlin and Joanna Hayes have been named the winners of the 2004 Jesse Owens Awards. They achieved a prestigious position at the Games history has gained them three gold medals. Gatlin, a22 year old male, won the closest 100m final time with an impressive career record of 9.85 seconds in Athens. He also won two gold medals in the 200m and silver medal in the 4x100m relay, marking him as one of the only men to win three distinct sports records this summer. Hayes, a27 year old female, set a thrilling record at the 100m hurdles, winning it first time ever in a single season.\nThe annual USATF presentation on 3 December, with its annual meeting in Portland, has been dedicated to celebrating the outstanding track and field performers of this century. Gatlin said, \"I am sure that many of you have known some of the great athletes who have won this award before me. The Olympic spirit and discipline continue to inspire and instill in us a sense of achievement and pride.\"\n", "smollm:1.7b": "The summary captures the main ideas and key details of the text. It provides a concise overview of the winners of the 2004 Jesse Owens Awards, highlighting their achievements in athletics. The text does not include explanations or justifications for the winners' performances, nor does it provide any additional information about the awards themselves.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the given text into a concise summary. Let me read through the entire text first to understand all the key points.\n\nThe text starts by mentioning that Gatlin and Hayes won the 2004 Jesse Owens Awards. They are American Olympic stars named Justin Gatlin and Joanna Hayes. These awards are for US Track & Field, specifically the top honor.\n\nGatlin is mentioned as being 22 years old, winning the closest 100m final in Games history with a career-best time of 9.85 seconds at the 2004 Olympics in Athens. He also won bronze in the 200m and silver in a relay, making him the only male athlete to win three medals this year.\n\nHayes is 27 years old, setting an Olympic record with a 12.37 second time in the 100m hurdles. The awards were presented on December 3 at the USATF annual meeting in Portland.\n\nThe text notes that the Jesse Owens Awards are named after a late Olympic great and have been given annually since 1981. They recognize outstanding US male and female athletes in track and field.\n\nNow, I need to condense this into a summary without explanations or formatting. The key points to include are:\n\n- Gatlin and Hayes won the Jesse Owens Awards.\n- Their names are Justin Gatlin and Joanna Hayes.\n- The awards were presented on December 3, 2004, at the USATF meeting in Portland.\n- Gatlin's performance: 9.85 seconds in 100m, bronze in 200m, silver in relay, sole male to win three medals.\n- Hayes' achievement: setting an Olympic record with a 12.37 second hurdle race.\n- The awards were honoring past recipients and recognizing ongoing effort.\n\nI need to make sure I include all these points without missing any crucial details. Also, I should avoid adding my own explanations or reasoning beyond just restating the key ideas.\n</think>\n\nGatlin and Hayes won the 2004 Jesse Owens Awards for US Track & Field. They are Justin Gatlin (22) and Joanna Hayes (27). Gatlin secured his closest 100m finish with a career-best 9.85 seconds in Athens, winning bronze in the 200m and silver in the relay, earning him three medals for being the only male athlete to do so. Hayes set an Olympic record of 12.37 in the hurdles, marking his achievement as one of many honored by the awards. The ceremony took place on December 3 at the USATF annual meeting in Portland.", "tinyllama:1.1b": "In 2004, Justin Gaulin and Joanna Hayes were named the winners of USA Track & Field's Jesse Owen Awards. They won the fastest 100m final, an Olympic record and a relay bronze medal. In the 200m and 4x100m relays as well. Gaulin set a new world record in winning the 100m hurdles. The Jesse Owen Awards recognise outstanding athletes who won medals at the 2004 Games, held in Athens. The awards will be presented on December 3 and include US male and female track & field performers.", "tinydolphin:1.1b": " The Jesse Owens Awards, which recognize the outstanding US male and female track and field performers, were presented on 3 December at an event in Portland. Gatlin won the closest 100m final in history with a time of 9.85 seconds in Athens, making him the recipient of this year's Jesse Owens Award. Hayes also won bronze in the 200m and silver in the 4x100m relay, becoming the first athlete to win three track & field medals at the summer Olympics. This prestigious recognition is an endorsement of her outstanding athletic performances, and it affirms Gatlin's and Hayes' hard work and dedication to their sport.", "phi:2.7b": " American Olympic stars Justin Gatlin and Joanna Hayes were awarded the Jesse Owens Award at USA Track & Field's annual meeting in Portland. Gatlin won the 100m final with a new record time of 9.85 seconds, while Hayes set an Olympic record in the \n", "orca-mini:3b": " Justin Gatlin and Joanna Hayes won the Jesse Owens Awards, USA Track & Field's top honor. Gatlin won the 100m final in close competition with a career-best time of 9.85 seconds in Athens, while Hayes set an Olympic record of 12.37 in winning the 100m hurdles. Both athletes won three athletics medals in their respective events, making them the only male and female track and field performers to do so. The 2004 Jesse Owens Awards will be presented on December 3rd during the annual meeting of USATF in Portland.", "hermes3:3b": "Justin Gatlin and Joanna Hayes won 2004 Owen awards.", "stablelm-zephyr:3b": "American Olympic stars Justin Gatlin and Joanna Hayes win 2004 Jesse Owens Awards, presented by USA Track & Field. Gatlin wins 100m, 200m, and 4x100m relay, setting a career-best time of 9.85 seconds; Hayes sets an Olympic record in the 100m hurdles. The awards, named after late athlete Jesse Owens, honor outstanding US male and female track and field performers. Gatlin and Hayes will receive the awards on December 3 at the USATF annual meeting in Portland.", "stablelm2:1.6b": "Justin Gatlin and Joanna Hayes were named winners of the Jesse Owens Awards by USA Track & Field. Gatlin, who won three medals in Athens, set a career-best time in the 100m final and secured bronze in the 200m and silver in the 4x400m relay. Hayes, also an Olympic gold medallist, established an Olympic record in winning the hurdles event. The Jesse Owens Awards recognize outstanding male and female track and field performances annually, with the awards to be presented on 3 December alongside the USATF annual meeting.", "granite3.1-dense:2b": "Justin Gatlin and Joanna Hayes, two American Olympic track stars, were named 2004 Jesse Owens Award recipients by USA Track & Field (USATF). Gatlin, 22, achieved a career-best time of 9.85 seconds in the 100m final and secured bronze and silver medals in the 200m and 4x100m relay, becoming the sole male to win three athletics medals in Athens. Hayes, 27, broke an Olympic record with a time of 12.37 seconds in the 100m hurdles. The Jesse Owens Awards, established in 1981 to honor outstanding US male and female track performers, will be presented on December 3 during the USATF annual meeting in Portland. Both winners expressed profound gratitude for this prestigious recognition, highlighting its significance in their careers.", "chatgpt-4o-latest": "Justin Gatlin and Joanna Hayes have won the 2004 Jesse Owens Awards, USA Track & Field's highest honor. Gatlin, 22, won Olympic gold in the 100m with a personal best of 9.85 seconds, along with bronze in the 200m and silver in the 4x100m relay. Hayes, 27, set an Olympic record of 12.37 seconds in the 100m hurdles. The awards, named after Olympic legend Jesse Owens, recognize the top US male and female track and field athletes annually. The 2004 awards will be presented on December 3 at the USATF annual meeting in Portland. Both athletes expressed pride and gratitude for the recognition.", "reference": "\"It is such a great honour to win the Jesse Owens Award,\" said Gatlin.Established in 1981, the Jesse Owens Awards - named in honour of the late Olympic great who won four gold medals at the 1936 Berlin Games - are presented annually to the outstanding US male and female track and field performers.American Olympic stars Justin Gatlin and Joanna Hayes have been named the winners of the 2004 Jesse Owens Awards, USA Track & Field's (USATF) top honour.\"It is one of the biggest honours in track and field and it is a great end to a great year. \""}