{"raw_text": "Collins named UK Athletics chief\n \n UK Athletics has ended its search for a new performance director by appointing psychologist Dave Collins.\n \n Collins, who worked with the British teams at the 2000 and 2004 Olympics, takes over from Max Jones. Six candidates were interviewed for the job, including Denise Lewis' coach Charles van Commenee and former British triple jumper Keith Connor. \"We've searched long and hard to ensure we have found the right person,\" said UKA chief executive David Moorcroft. \"We have thoroughly tested the candidates. I believe David will make a great leader and I have great faith in what he will achieve.\" Collins said: \"It's a great challenge. Over the next few months I will spend time listening to those who already make a significant contribution to athletics and other elite sports in the UK.\" Collins, who has worked with javelin thrower Steve Backley in the past, started his career as a Royal Marine before becoming a PE teacher. He is currently professor of physical education and sport performance at Edinburgh University, where he helps competitors across many sports, including rugby, athletics, judo and football.\n \n He has specialised in helping competitors fulfil their potential through psychology and has worked with the Great Britain women's curling team, who won gold at the 2002 Winter Olympics. Mark Lewis-Francis sought Collins' advice in Athens when he was looking for inspiration before he ran the final leg of Britain's surprise triumph in the 4x100m relay. Collins has played rugby at regional level, was captain of the Great Britain American Football team, and competed at national level in judo and karate. He arrives with British athletics at a crossroads. Despite Kelly Holmes' golden double and the success of the sprint relay squad, the GB team failed to live up to expectations in Athens. Many older competitors have retired or are coming to the end of their careers, and Britain failed to win a single medal at the world junior championships in Italy this year. Collins will not have day-to-day coaching contact with the athletes, but will be expected to make changes to the system and coaching set-up in order to secure medals at the Beijing Olympics in 2008. The appointment of a new performance director was one of the main recommendations in Sir Andrew Foster's review of the sport, which was published in May. It was commissioned by UK Sport and Sport England, which wanted UK Athletics to justify funding of more than £40m from the Government following the failure to hang on to the 2005 World Championships, which are now being held in Helsinki. Van Commenee dropped out of the selection process to take on the same role with the Dutch Olympic Committee, while Connor's application was rejected after an arduous interview process. Foster, however, declared himself satisfied with how the appointment was made. \"The appointment of David Collins, with his strong mix of leadership skills and managerial experience, is testament to the professional and detailed recruitment process,\" he said.\n", "llama3.2:1b": "UK Athletics has appointed Dave Collins as its new chief performance director. Collins is a psychologist who previously worked with British teams at the 2000 and 2004 Olympics. He succeeded Max Jones and was selected from six candidates after an interview process that included coaching staff such as Charles van Commenee. Collins will oversee changes to the system and coaching set-up to secure medals at the Beijing Olympics in 2008, which he believes is a great challenge for him.", "llama3.2:3b": "UK Athletics has appointed psychologist Dave Collins as its new performance director after a thorough interview process. Collins, who worked with British teams at the 2000 and 2004 Olympics, will focus on making changes to the system and coaching set-up to secure medals at the Beijing Olympics in 2008. He replaces Max Jones and was chosen from six candidates, including Denise Lewis' coach Charles van Commenee and former British triple jumper Keith Connor.", "gemma2:2b": "Dave Collins has been appointed UK Athletics' new performance director. He succeeds Max Jones and was chosen after a six-person candidate pool interview process. Collins will oversee the team's preparation for the 2008 Beijing Olympics, implement changes to coaching practices, and work with athletes to improve their potential. His appointment follows a review from Sir Andrew Foster who recommended it to UK Sport and Sport England following the team's underperformance in Athens. \n", "qwen2.5:0.5b": "UK Athletics has appointed psychologist Dave Collins as its new performance director, replacing Max Jones who had been named. Collins will work with Britain's elite athletics team at a crucial time for British sport following their failure to live up to expectations in Athens.", "qwen2.5:1.5b": "Dave Collins has been appointed as UK Athletics' performance director, succeeding Max Jones in a search for a new leader following the 2008 Beijing Olympics. Collins previously worked at the British teams during past Olympic Games and will help ensure the successful performance of athletes by improving systems and coaching approaches before the 2008 Olympics.", "qwen2.5:3b": "UK Athletics has appointed psychologist Dave Collins as new performance director after interviewing six candidates including Charles van Commenee and Keith Connor. Collins' background includes working with British Olympic teams and athletes like Steve Backley and Kelly Holmes. UKA seeks his leadership to improve the sports system and prepare for the Beijing Olympics in 2008, despite concerns over an ageing team and failure to win medals at junior championships. The appointment follows a review of the sport by Sir Andrew Foster.", "opencoder:1.5b": "Collins named UK Athletics chief. \nUKA has ended its search for a new performance director by appointing psychologist Dave Collins. \nDave, who worked with the British teams at the 2,000 and 2004 Olympics, takes over from Max Jones. Six candidates were interviewed for the job, including Denise Lewis' coach Charles van Commenee and former British triple jumper Keith Connor. \"We've searched long and hard to ensure we have found the right person,\" said UKA chief executive David Moorcroft. \"We have thoroughly tested the candidates. I believe David will make a great leader and I have great faith in what he will achieve.\" Collins said: \"It's a great challenge. Over the next few months I will spend time listening to those who already make a significant contribution to athletics and other elite sports in the UK.\"\nCollins has specialised in helping competitors fulfil their potential through psychology and worked with the Great Britain women's curling team, who won gold at the 2002 Winter Olympics. Mark Lewis-Francis sought Collins' advice in Athens when he was looking for inspiration before he ran the final leg of Britain's surprise triumph in the 4x100m relay. Collins has played rugby at regional level, was captain of the Great Britain American Football team, and competed at national level in judo and karate. He arrives with British athletics at a crossroads. Despite Kelly Holmes' golden double and the success of the sprint relay squad, the GB team failed to live up to expectations in Athens. Many older competitors have retired or are coming to the end of their careers, and Britain failed to win a single medal at the world junior championships in Italy this year. Collins will not have day-to-day coaching contact with the athletes, but will be expected to make changes to the system and coaching set-up in order to secure medals at the Beijing Olympics in 2008. The appointment of a new performance director was one of the main recommendations in Sir Andrew Foster's review of the sport, which was published in May. It was commissioned by UK Sport and Sport England, which wanted UK Athletics to justify funding of more than £40m from the Government following the failure to hang on to the 2005 World Championships, which are now being held in Helsinki. Van Commenee dropped out of the selection process to take on the same role with the Dutch Olympic Committee, while Connor's application was rejected after an arduous interview process. Foster, however, declared himself satisfied with how the appointment was made.\n", "smollm:1.7b": "UK Athletics has appointed psychologist Dave Collins as its new performance director.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about UK Athletics choosing Dave Collins as their new performance director. First, the main points are that they've hired him after Max Jones left, starting from 2018. He comes with a background in British teams at the Olympics and has experience in coaching both athletics and other sports.\n\nHe's specialized in helping athletes through psychology and worked with the Great Britain curling team, which won gold at the 2002 Olympics. He started as a Royal Marine before becoming a PE teacher and is now at Edinburgh University, teaching physical education and sport performance across various sports. He also has coaching experience in rugby, American football, judo, and karate.\n\nHis career path includes competing at national levels in each of those sports. He's moving to a crossroads with British athletics and facing some challenges like the 2008 Olympics. The appointment is part of Sir Andrew Foster's review, which was due out in May.\n\nHe hasn't had day-to-day coaching contact but will be responsible for changes in the system and coaching set-up. There were issues at the world junior championships this year, with GB team failures. His background gives them a competitive edge.\n\nI should make sure to highlight his expertise, experience, background, and any challenges he faces. Also, mention his educational and coaching journey.\n</think>\n\nDave Collins, who has worked with British teams at the 2000 and 2004 Olympics, has been appointed as the new performance director for UK Athletics, starting from 2018. Collins, with a background in coaching athletics and other elite sports such as curling, is now at Edinburgh University. He specializes in helping athletes fulfill their potential through psychology and has a diverse career, including coaching in rugby, American football, judo, and karate. Despite challenges like the 2008 Olympics, his expertise and experience give UK Athletics a competitive edge.", "tinyllama:1.1b": "The UK Athletics has appointed psychologist Dave Collins as its new Performance Director, replacing Max Jones who resigned earlier in September. With former British triple jumper Keith Connor also interviewed for the job, Collins was selected by the UKA chief executive David Moorcroft following a long and rigorous process of testing candidates. The appointment was made following the failure to win a medal at the 2005 World Championships in Helsinki, which were held in September 2007. Foster, commissioned by UK Sport and Sport England to investigate the sport's funding woes, recommended that a new Performance Director be appointed despite the GB team's disappointing performances in Athens. Despite the pressure, Collins will not have day-to-day coaching contact with the athletes, but will be expected to make significant changes to the system and coachings set-up to ensure medal success at the 2008 Beijing Olympics.", "tinydolphin:1.1b": " UK Athletics has appointed psychologist Dave Collins as their new performance director. Collins will work closely with sporting legends such as Kelly Holmes and Denise Lewis to help British athletes achieve great success at the Beijing Olympics in 2008. He hopes that his experience and knowledge of elite sports will enable him to make a significant impact on the team's performance, motivating them to work hard and achieve their goals. In addition to his role as performance director, Collins will also continue to coach several British athletes, including Steve Backley, a Royal Marine PE teacher who has already made a significant difference to their careers.", "phi:2.7b": " UK Athletics appointed psychologist Dave Collins as its new performance director following the retirement or nearing end of careers of many older competitors. The British team failed to meet expectations in Athens despite their successes at the 20000 and 20040 Olympics. Collins, who has experience working with athletes across various sports and has specialised in helping them reach their potential through psychology, will make changes to the system and coaching set-up in order to secure medals at the Beijing Olympics in 2008. The appointment of a new performance director was one of the main recommendations in Sir Andrew Foster's review of the sport, which was commissioned by UK Sport and Sport England.\n", "orca-mini:3b": " The UK Athletics has appointed psychologist Dave Collins as its new performance director after a rigorous recruitment process that involved interviewing six candidates including Charles van Commenee and Keith Connor. Collins worked with British teams at the 2000 and 2004 Olympics and is currently professor of physical education and sport performance at Edinburgh University, where he helps competitors across many sports including rugby, athletics, judo and football. He has also played rugby at regional level, was captain of the Great Britain American Football team, and competed at national level in judo and karate. His appointment comes at a time when British athletics are facing challenges with the retirement of many older competitors and the failure to secure medals at the world junior championships in Italy this year. Collins will take over from Max Jones and is expected to make changes to the system and coaching set-up in order to secure medals at the Beijing Olympics in 2008.", "hermes3:3b": "UK Athletics appoints Dave Collins as new performance director after thorough testing of candidates. Collins succeeds Max Jones and has worked with British teams at 2000 & 2004 Olympics.", "stablelm-zephyr:3b": "UK Athletics has appointed psychologist Dave Collins as the new performance director, ending their search for a replacement after interviewing six candidates, including Denise Lewis' coach Charles van Commenee and former British triple jumper Keith Connor. UKA CEO David Moorcroft expressed confidence in Collins' abilities, while Collins himself highlighted his intention to listen to established athletes in order to help them achieve their potential through psychology. His appointment follows a recommendation from Sir Andrew Foster's review of the sport, which was commissioned by UK Sport and Sport England.", "stablelm2:1.6b": "Psychologist Dave Collins has been appointed as the new performance director for UK Athletics, following the departure of Max Jones. Six candidates were interviewed before the decision was made, including Charles van Commenee and Keith Connor. Collins will not have day-to-day contact with athletes but is expected to make changes to improve the system and coaching setup to secure medals at future events. UKA chief executive David Moorcroft praised Collins for his experience in psychology and leadership within elite sports in the UK.", "granite3.1-dense:2b": "UK Athletics has appointed Dave Collins as its new performance director, succeeding Max Jones. Six candidates were evaluated for the position, including Charles van Commenee and Keith Connor. Collins, a former Royal Marine and PE teacher now professor at Edinburgh University, specializes in psychology to enhance athletic performance. He previously worked with British Olympic teams, including the javelin thrower Steve Backley, and helped various sports like rugby, football, and judo. The appointment was one of Sir Andrew Foster's key recommendations from his review of UK Athletics, aimed at justifying £40 million in government funding following the loss of the 2005 World Championships. Collins will focus on improving Britain's performance for the 2008 Beijing Olympics, addressing issues such as retiring athletes and recent junior championship disappointments. Despite his extensive background in sports psychology and leadership, he will not have direct coaching contact with athletes but is expected to implement systemic changes for better medal results.", "chatgpt-4o-latest": "Dave Collins has been appointed as the new performance director of UK Athletics, replacing Max Jones. A psychologist with experience working with British Olympic teams in 2000 and 2004, Collins was selected from six candidates, including Charles van Commenee and Keith Connor. UKA chief executive David Moorcroft expressed confidence in Collins' leadership. Collins, a former Royal Marine and PE teacher, is currently a professor at Edinburgh University, specializing in sports psychology. He has worked with top athletes across various sports, including Olympic gold medalists. His role will focus on restructuring the coaching system to improve Britain's medal prospects at the 2008 Beijing Olympics. The appointment follows Sir Andrew Foster's review, which recommended leadership changes after Britain's underwhelming performance in Athens and failure to secure the 2005 World Championships. The selection process was rigorous, with van Commenee withdrawing to join the Dutch Olympic Committee and Connor being rejected. Foster endorsed Collins' appointment, citing his leadership and managerial expertise.", "reference": "Collins has played rugby at regional level, was captain of the Great Britain American Football team, and competed at national level in judo and karate.Collins said: \"It's a great challenge.UK Athletics has ended its search for a new performance director by appointing psychologist Dave Collins.Collins, who worked with the British teams at the 2000 and 2004 Olympics, takes over from Max Jones.He has specialised in helping competitors fulfil their potential through psychology and has worked with the Great Britain women's curling team, who won gold at the 2002 Winter Olympics.The appointment of a new performance director was one of the main recommendations in Sir Andrew Foster's review of the sport, which was published in May.It was commissioned by UK Sport and Sport England, which wanted UK Athletics to justify funding of more than £40m from the Government following the failure to hang on to the 2005 World Championships, which are now being held in Helsinki.\"The appointment of David Collins, with his strong mix of leadership skills and managerial experience, is testament to the professional and detailed recruitment process,\" he said.He is currently professor of physical education and sport performance at Edinburgh University, where he helps competitors across many sports, including rugby, athletics, judo and football."}