{"raw_text": "Kenteris denies faking road crash\n \n Greek sprinter Kostas Kenteris has denied claims that he faked a motorbike crash to avoid a doping test days before the start of the Olympics.\n \n Kenteris and fellow sprinter Katerina Thanou are set to learn if they will face criminal charges this week. Part of the investigation has centred on whether they staged the crash. Kenteris insisted: \"The accident happened. I went crazy when I found out I had supposedly missed a test and I wanted to rush to the Olympic village.\" Kenteris, speaking on Greece's Alter Television station, also claimed that he asked to be tested for banned substances in hospital after the crash. \"I told the hospital, which was an Olympics-accredited hospital, to call the IOC and have me tested on the spot but no-one came.\"\n \n After a drama which dominated newspaper headlines in Greece as Athens prepared for the start of the Athens Games, Kenteris and Thanou eventually withdrew. But Kenteris has continually protested his innocence - and on Sunday blamed Greek Olympic Committee officials and his former coach Christos Tzekos for failing to inform him of the test. The 31-year-old insisted he will be happy if he is charged so he can clear his name. \"If a decision is taken to have charges filed against me, I will accept it gladly. \"A prosecution means that the case will be cleared... I want to go to the end and then we'll see who's right and who isn't.\" Kenteris, a Greek hero after winning gold in the 200m at the 2000 Olympics in Sydney, also confirmed that he was due to light the flame at the Athens opening ceremony. \"I had even rehearsed lighting the cauldron,\" he said.\n", "llama3.2:1b": "Greek sprinter Kostas Kenteris denies faking a motorbike crash to avoid a doping test days before the start of the Olympics, claiming he wanted to rush to the Olympic village after learning he missed a test and his former coach blamed Greek Olympic Committee officials for not informing him about the test.", "llama3.2:3b": "Kostas Kenteris denies faking a motorbike crash to avoid a doping test days before the start of the Olympics, claiming he went crazy when informed of missed test and asked for immediate testing in hospital. He blames Greek Olympic Committee officials and his former coach for failing to inform him of the test, stating he will be happy if charged as it clears his name.", "gemma2:2b": "Kenteris denies faking a motorbike crash to avoid doping tests before the Olympics. He claims he asked to be tested for banned substances after the crash and believes the delay in doing so was due to Olympic officials not following protocol. Kenteris insists he will accept any charges filed against him if they are brought, seeking to clear his name.  He also confirmed he was scheduled to light the cauldron at the Athens opening ceremony. \n", "qwen2.5:0.5b": "Kostas Kenteris denies faking a motorbike crash for doping testing and is currently under criminal investigation for staging it days before the Athens Olympics. He claims to have told Olympic officials not to call him due to his test result, but this has been questioned as he also claims to have asked the hospital to conduct a test on his behalf.", "qwen2.5:1.5b": "Kostas Kenteris denies faking a road crash for doping test evasion and claims hospital tested him after an Olympic motorcycle accident. The sprinter, who is due to light the Olympic flame at the Athens opening ceremony, has been accused of staged incidents by Greek officials and former coach, with plans to face criminal charges this week.", "qwen2.5:3b": "Greek sprinter Kostas Kenteris denies faking a motorbike crash to avoid doping tests ahead of the Olympics. He claims he panicked upon learning about the missed test and rushed to the Olympic village. Kenteris also requested a banned substance test at an accredited hospital post-crash but no action was taken. He is facing potential criminal charges along with fellow sprinter Katerina Thanou, which he views as a chance to clear his name. Despite withdrawing from the investigation, Kenteris insists on being charged and wants to see who is right—him or those responsible for not informing him of the test.", "opencoder:1.5b": "Kenteris denied faking a motorbike crash, which was part of an investigation centered on whether Kostas Kenteris staged the crash. He and Katerina Thanou are set to learn if they face criminal charges this week. The main objective of the investigation was to determine if they staged the crash as opposed to other incidents.\n", "smollm:1.7b": "The summary is concise and to the point, preserving key ideas and details from the original text. It provides a brief overview of the main points without going into too much detail or providing explanations. The summary focuses on the central arguments and claims made by the author, while omitting supporting evidence and background information.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text concisely. Let me read through it carefully.\n\nKenteris denies faking a road crash before the Olympics because of his doping test issue. He's set to face charges for the accident and also asked about testing for substances. He emphasized innocence but is still upset with authorities. They withdrew from the event, and he keeps protesting. He also plans to light the flame at the games. I need to capture all these key points without adding extra information.\n\nFirst, identify the main events: Kenteris denying doping-related crash, charges, allegations of drug tests, his protest stance. Also, the outcome where they withdrew because of the athlete's defiance.\n\nI should mention that he and Thanou are facing charges, with evidence pointing towards the crash being a test-failure. He explained the situation to the hospital but no one approved testing. The Greek Olympic Committee didn't inform him about the test. He wants the case cleared regardless and plans to light the flame at the Games.\n\nI need to condense this into a short summary without any explanations or formatting.\n</think>\n\nKenteris denies faking the 2002 Olympics road crash due to doping allegations, claiming he was actually involved. His team faces charges for the accident and substance testing. He explained the situation but faced criticism from authorities. They withdrew because of his defiance. Kenteris is set to face charges and light the flame at the Games despite being innocent.", "tinyllama:1.1b": "In a highly anticipated event days before the start of the Olympic Games, Greek sprinter Kostas Kenteriis denies claims that he faked a motorbike crash to avoid a drug test. Kenteriis insists that when he found out he had failed a doping test in August 2015, he \"went crazy\" and asked to be tested immediately. He also alleges that he was denied information about the procedure, which led to him being unaware of the test. In a statement, Kenteriis called for an investigation into whether he staged the accident and if so whether he should face criminal charges. The 31-year-old has insisted that he will abide by any decision regarding his case. Kenteriis has also criticized his former coach Christos Tzekos and the Greek Olympic Committee for failing to inform him of the test.", "tinydolphin:1.1b": " The key points of this text are:\n1. Greek sprinter Kostas Kenteris denies claims he faked a motorbike crash to avoid a doping test, days before the start of the Olympics.\n2. Kenteris and fellow sprinter Katerina Thanou are set to learn if they will face criminal charges this week.\n3. The investigation has centred on whether they staged the crash.\n4. Kenteris claimed he asked for a test and was told it would not be done at his hospital. \n5. However, after the drama dominated newspaper headlines in Greece as Athens prepared for the start of the Athens Games, Kenteris eventually withdrew, blaming Greek Olympic Committee officials and his former coach Christos Tzekos for failing to inform him of the test.\n6. The 31-year-old insisted he will be happy if charges are filed against him so he can clear his name.", "phi:2.7b": " Kostas Kenteris has denied claims of faking a road crash to avoid a doping test before the Olympic Games. He is set to face criminal charges this week, but insists that the accident happened and he asked for a drug test in hospital. The drama surrounding the incident has been reported extensively in Greece's media.\n", "orca-mini:3b": " Kenteris denied faking a motorbike crash to avoid a doping test days before the start of the Olympics.", "hermes3:3b": "Kenteris denies faking road crash; claims accident happened, not knowing about doping test avoidance.", "stablelm-zephyr:3b": "Greek sprinter Kostas Kenteris denies accusations of staging a motorbike crash days before the Olympics to avoid a doping test. Kenteris and fellow sprinter Katerina Thanou faced potential criminal charges, with part of the investigation focusing on whether they staged the accident. Kenteris claimed he wanted to rush to the Olympic village after discovering he had supposedly missed a test. The athletes eventually withdrew from the situation but Kenteris maintains his innocence and is willing to accept charges if they result in clearing his name.", "stablelm2:1.6b": "Greek sprinters Kostas Kenteris and Katerina Thanou deny faking a road crash for the purpose of avoiding a doping test prior to the Olympics. Kenteris maintains that the accident occurred, and claims he requested testing for banned substances in a hospital after the crash. Despite facing criminal charges, Kenteris remains hopeful about clearing his name and plans to accept any charges if decided upon.", "granite3.1-dense:2b": "Greek sprinter Kostas Kenteris has firmly denied allegations that he staged a motorbike crash to evade a doping test before the 2004 Athens Olympics. Kenteris, along with fellow sprinter Katerina Thanou, faces potential criminal charges for the incident, which was widely publicized in Greece. In an interview on Alter Television, Kenteris stated that he crashed out of fear of missing a doping test and later requested immediate testing at a hospital accredited by the IOC, but no officials arrived. He blamed Greek Olympic Committee officials and his former coach for not informing him about the scheduled test. Kenteris expressed willingness to accept charges if they are filed, believing it would clear his name. Despite the controversy, he confirmed he was set to light the Olympic flame at the Athens opening ceremony and had even practiced doing so.", "chatgpt-4o-latest": "Greek sprinter Kostas Kenteris denied faking a motorbike crash to avoid a doping test before the Olympics. He and fellow sprinter Katerina Thanou await possible criminal charges, with investigations examining whether the crash was staged. Kenteris claimed he was unaware of the test, rushed to the Olympic village upon learning of it, and requested a doping test in the hospital, but no officials arrived. He blamed Greek Olympic Committee officials and his former coach for not informing him. Kenteris, who withdrew from the Games amid controversy, insisted on his innocence and welcomed prosecution to clear his name. He also revealed he had been set to light the Olympic flame at the opening ceremony.", "reference": "Greek sprinter Kostas Kenteris has denied claims that he faked a motorbike crash to avoid a doping test days before the start of the Olympics.Kenteris insisted: \"The accident happened.Kenteris, speaking on Greece's Alter Television station, also claimed that he asked to be tested for banned substances in hospital after the crash.But Kenteris has continually protested his innocence - and on Sunday blamed Greek Olympic Committee officials and his former coach Christos Tzekos for failing to inform him of the test.Kenteris, a Greek hero after winning gold in the 200m at the 2000 Olympics in Sydney, also confirmed that he was due to light the flame at the Athens opening ceremony.Kenteris and fellow sprinter Katerina Thanou are set to learn if they will face criminal charges this week."}