{"raw_text": "Greek pair set for hearing\n \n Kostas Kenteris and Katerina Thanou will fight the provisional two-year bans imposed on them by the IAAF at an independent tribunal this weekend.\n \n Athletics' ruling body took action against the pair for failing to take drugs tests before the Athens Olympics. An independent tribunal of the Greek Track and Field Federation will meet to decide whether to ratify the sanction. The sprint duo face charges of failing to give information on their location and refusing to submit to a drugs test. Kenteris' lawyer Gregory Ioannidis told BBC Sport: \"We refute both charges as unsubstantiated and illogical. \"There have been certain breaches in the correct application of the rules on behalf of the sporting authorities and their officials, and these procedural breaches have also violated my client's rights. \"There is also evidence that proves the fact that my client has been persecuted.\" Ioannidis, who is a law lecturer at the University of Buckingham, added: \"One of the important rights and foundations of law and justice - that the accused should be presumed innocent unless proved otherwise - has been tarnished.\" The panel will also decide on the two-year ban imposed on the athletes' controversial coach Christos Tzekos by the IAAF. Kenteris, the 2000 Olympic 200m champion, and Thanou, the women's 100m silver medallist from the same Games in Sydney, quit the Olympics on 18 August after failing to give samples on the eve of the opening ceremony.\n \n Testers could not find them at the Olympic village and the duo were later admitted to hospital after claiming to have been involved in a motorcycle accident. They also missed tests in Tel Aviv, Chicago and Athens before the Games. In imposing two-year suspensions on the duo on 22 December, the IAAF described their explanations for missing the tests as \"unacceptable\". Whatever the findings of the independent tribunal, all parties will have the right to appeal to the Court of Arbitration for Sport. The tribunal hearing will take place at the Hellenic Olympic Committee building. It will start at 1200 GMT on Saturday and is expected to finish early next week. The tribunal panel will consist of five members - president Konstantinos Panagopoulos and Panagiotis Dimakos, Haralabos Hrisanthakis, Stilianos Perakis and Ioannis Karmis. Kenteris and Thanou also face criminal charges in Greece for allegedly faking the motorcycle accident. Eight criminal charges have been laid against the sprinters as well as Tzekos, an eyewitness to the accident and hospital officials. But there has been speculation that the charges could be dropped.\n", "llama3.2:1b": "Kostas Kenteris and Katerina Thanou will fight two-year bans imposed by the IAAF at an independent tribunal on Saturday after failing to provide information about their whereabouts before the Athens Olympics. The pair is facing charges of failing to give location information and refusing a drugs test. An independent panel will decide whether to ratify the sanctions, which also include imposing a coach with two-year ban.", "llama3.2:3b": "Kostas Kenteris and Katerina Thanou will fight provisional two-year bans imposed by the IAAF at an independent tribunal this weekend. They face charges of failing to take drugs tests before the Athens Olympics, as well as refusing to give information on their location. Their coach Christos Tzekos also faces a two-year ban imposed by the IAAF, while they and others face criminal charges in Greece for allegedly faking a motorcycle accident.", "gemma2:2b": "Katerina Thanou and Kostas Kenteris are facing two-year bans from athletics for failing drug tests before the 2004 Athens Olympics. They will appeal to an independent tribunal this weekend, challenging the IAAF's sanctions on grounds of procedural breaches and lack of evidence. The pair missed tests in several cities and also refused to provide information on their location. Their coach Christos Tzekos was also banned by the IAAF for two years. \nThe hearing is set to begin on Saturday and will decide whether to ratify the initial sanctions, with the possibility for an appeal to the Court of Arbitration for Sport. They are also facing criminal charges in Greece for faking the motorcycle accident that led to their absences. \n", "qwen2.5:0.5b": "Katerina Thanou and Kostas Kenteris will fight two-year bans at an independent tribunal on drugs testing in Greece this weekend.", "qwen2.5:1.5b": "Kostas Kenteris and Katerina Thanou face an independent tribunal for failing drug tests at the Athens Olympics, two-year bans from athletics by the IAAF, and criminal charges in Greece over a motorcycle accident. The hearing is expected to resolve these issues.", "qwen2.5:3b": "Greek athletes Kostas Kenteris and Katerina Thanou will face a hearing at an independent tribunal regarding provisional two-year bans imposed by the IAAF for failing to take drugs tests before the Athens Olympics. The case involves allegations of breaching rules, refusal to submit to drug tests, and providing false information about their whereabouts. The athletes' lawyer argues procedural violations and accuses the sporting authorities of persecuting his client. A panel of five members will decide on the ban imposed on controversial coach Christos Tzekos as well. All parties have a right to appeal to the Court of Arbitration for Sport, with the tribunal set to start at 1200 GMT on Saturday. Criminal charges against all involved are under consideration but may be dropped.", "opencoder:1.5b": "Greek pair set for hearing\n\nKostas Kenteris and Katerina Thanou will fight the provisional two-year bans imposed on them by the IAAF at an independent tribunal this weekend.\n\nAthletics' ruling body took action against the pair for failing to take drugs tests before the Athens Olympics. An independent tribunal of the Greek Track and Field Federation will meet to decide whether to ratify the sanction. The sprint duo face charges of failing to give information on their location and refusing to submit to a drugs test.\n\nKenteris' lawyer Gregory Ioannidis told BBC Sport: \"We refute both charges as unsubstantiated and illogical.\" There have been certain breaches in the correct application of the rules on behalf of the sporting authorities and their officials, and these procedural breaches have also violated my client's rights. Evidence has also pointed out that my client has been persecuted.\n\nThe panel will also decide on the two-year ban imposed on the athletes' controversial coach Christos Tzekos by the IAAF. Kenteris, the 2,000 Olympic 200m champion, and Thanou, the women's 100m silver medallist from the same Games in Sydney, quit the Olympics on 18 August after failing to give samples on the eve of the opening ceremony.\n\nTesters could not find them at the Olympic village and the duo were later admitted to hospital after claiming to have been involved in a motorcycle accident. They also missed tests in Tel Aviv, Chicago and Athens before the Games. In imposing two-year suspensions on the duo on 22 December, the IAAF described their explanations for missing the tests as \"unacceptable\".\n\nWhatever the findings of the independent tribunal, all parties will have the right to appeal to the Court of Arbitration for Sport. The tribunal hearing will take place at the Hellenic Olympic Committee building. It will start at 12 p.m. GMT on Saturday and is expected to finish early next week. The tribunal panel will consist of five members - president Konstantinos Panagopoulos and Panagiotis Dimakos, Haralabos Hrisanthakis, Stilianos Perakis and Ioannis Karmis. Kenteris and Thanou also face criminal charges in Greece for allegedly faking the motorcycle accident. Eight criminal charges have been laid against the sprinters as well as Tzekos, an eyewitness to the accident and hospital officials. But there has been speculation that the charges could be dropped.\n", "smollm:1.7b": "The Greek pair set for hearing is a sprint duo from Athens who were fined by the IAAF for failing to give information on their location before the Olympics. The athletes faced penalties of up to €10,000 (approximately $12,500) each and also had to undergo drug testing. The independent tribunal will decide whether to ratify the sanctions imposed on the duo by the IAAF.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text into a concise summary that preserves key ideas and details. The user specified that the output should only be plain text without any explanations or formatting. \n\nFirst, I'll read through the entire text carefully to identify the main points. The main focus seems to be on two athletes from Greece fighting a temporary ban imposed by the IAAF. They were disqualified for failing drug tests before the Olympics in 2008 and have now quit after being found unvaccinated.\n\nNext, there's mention of an independent tribunal meeting to decide on the ban and another charge related to a motorcycle accident. The athletes are accused of faking the incident and providing false information to test authorities. There's speculation about whether those charges might be dropped.\n\nI need to make sure all these details are included but presented in a clear, concise manner without unnecessary jargon. Also, I should avoid any explanations or reasoning because that's what the user specified.\n\nNow, I'll structure this into bullet points or short sentences to ensure clarity and brevity while retaining all key information.\n</think>\n\nGreek pair set for hearing: Kostas Kenteris and Katerina Thanou will fight a temporary ban imposed by the IAAF at an independent tribunal. They allegedly failed drug tests before the 2008 Olympics and now quit after being found unvaccinated. An independent tribunal will decide on their ban and another charge related to a motorcycle accident. Both athletes are accused of faking the incident and providing false information, with eight criminal charges laid against them and coach Christos Tzekos. Speculation exists about dropping those charges.", "tinyllama:1.1b": "The Greek Athletics Ruling Body took action against athletes Kostas Kenteri and Katerin Thanou for failing to take drug tests before the Athens Olympic Games. In doing so, they faced a two-year suspension from competition by the Independent Athletic Association of Fencing (IAAF). The duo was found guilty of neglecting their responsibilities as athletes and failed to give information on their location and refused to submit to drug tests before the event. The pair's counsel, Gregory Ioannidis, contests the IAAF's sanctions and argues that they are unsusuant and illegal. As part of the hearing at the Helleni Clinic in Athens, the tribunal panel will consist of five members - the president, Panagiotis Dimakoe, Haralambos Hrisanthaiki, Stilianos Peraki, Ioannis Karmis. The duo's criminal charges in Greece are also being probed, with eight charges laid against them and an eyewnight to the accident at the hospital where they were admitted after failing to give samples on the opening ceremony of the Games. However, there have been speculations that charges could be dropped by the athletes' lawyers.", "tinydolphin:1.1b": " The Greek pair, Kostas Kenteris and Katerina Thanou, are set to face a tribunal to decide whether they should face a two-year ban imposed on them by the International Association of Athletics Federations (IAAF). The decision is set to be made in an independent tribunal meeting this weekend. A hearing will take place at the Hellenic Olympic Committee building in Athens, and the outcome could affect their careers, future athletic pursuits, and legal rights as well.", "phi:2.7b": " Greek pair of athletes, Kostas Kenteris and Katerina Thanou, will fight provisional bans imposed by the IAAF at an independent tribunal this weekend for failing to take drugs tests before the Athens Olympics and refusing to submit to a test after being unable to attend in time due to unspecified circumstances. The tribunal's decision could be appealed to the Court of Arbitration for Sport. Additionally, Kostas' coach, Christos Tzekos, faces a two-year ban from athletics for taking unauthorized drugs tests.\n", "orca-mini:3b": " The text reports on the hearing of two Greek athletes facing charges for failing to give drugs tests before the Athens Olympics and their coach's suspension by the IAAF. It also mentions an independent tribunal meeting to decide whether to ratify the sanction, as well as the possibility that the two athletes could appeal to the Court of Arbitration for Sport. The article reports that Kenteris and Thanou were admitted to hospital after claiming to have been involved in a motorcycle accident and missed tests in Tel Aviv, Chicago, and Athens before the Games. The text also mentions the two-year suspension imposed on Kenteris and Thanou by the IAAF and their coach's controversial suspension. Finally, the article reports that the hearing is expected to take place at the Hellenic Olympic Committee building and will start at 1200 GMT on Saturday.", "hermes3:3b": "Athletes Kenteris and Thanou set to challenge two-year drug ban at tribunal for missing tests before Athens Olympics.", "stablelm-zephyr:3b": "Athletes Kostas Kenteris and Katerina Thanou are set for a hearing this weekend regarding their two-year bans imposed by the IAAF for failing to take drug tests before the Athens Olympics. An independent tribunal will decide whether to ratify the sanctions, which also involve charges of not providing information on their location and refusing a drug test. The panel will consider the cases of Kenteris, the 2000 Olympic 200m champion, and Thanou, the women's 100m silver medallist from Sydney, who quit the Olympics on 18 August after failing to provide samples before the opening ceremony. The IAAF previously described their explanations as \"unacceptable.\" All parties involved have the right to appeal the decision to the Court of Arbitration for Sport.", "stablelm2:1.6b": "Two-time Olympic champions Kostas Kenteris and Katerina Thanou will face a Greek tribunal in lieu of their two-year bans from athletics by the IAAF due to failing to take drug tests before the 2004 Athens Olympics. The tribunal, headed by five members from the Greek Track and Field Federation, will decide whether to ratify the sanctions imposed on the duo. Kenteris and Thanou also face criminal charges in Greece for allegedly faking a motorcycle accident. The hearing is scheduled for Saturday at the Hellenic Olympic Committee building with an expected completion within a week. Both Kenteris and Thanou face similar charges but could potentially have their cases dropped, as there has been speculation that the prosecution might seek leniency due to procedural breaches by the IAAF's officials.", "granite3.1-dense:2b": "Kostas Kenteris and Katerina Thanou, Greek Olympic medalists in 2000, are set to face an independent tribunal this weekend to contest two-year bans imposed by the International Association of Athletics Federations (IAAF) for failing to provide drug test information and refusing tests leading up to the Athens Olympics. Their legal team, led by Gregory Ioannidis, argues that the charges are unsubstantiated and that procedural breaches have infringed upon their clients' rights. Kenteris, a 2000 200m champion, and Thanou, a silver medalist in the women's 100m, withdrew from the Games on August 18, 2000, citing motorcycle accidents that prevented them from taking tests. The IAAF deemed their explanations \"unacceptable\" and imposed the bans on December 22, 2004.\n\nThe tribunal panel, comprising Konstantinos Panagopoulos as president and four other members, will also consider a two-year ban for Kenteris' coach, Christos Tzekos. Kenteris and Thanou face criminal charges in Greece for allegedly faking the motorcycle accident, with eight charges against them including hospital officials. Speculation suggests that these charges might be dismissed. The tribunal's decision is expected to influence their appeals to the Court of Arbitration for Sport.", "chatgpt-4o-latest": "Greek sprinters Kostas Kenteris and Katerina Thanou will challenge their provisional two-year bans by the IAAF at an independent tribunal. They were penalized for missing drug tests before the Athens Olympics and face charges of failing to provide their whereabouts and refusing tests. Their lawyer argues the charges are unsubstantiated and their rights were violated. The tribunal will also review the ban on their coach, Christos Tzekos. The athletes withdrew from the Olympics after missing tests and claiming involvement in a motorcycle accident. They had also missed tests in other locations before the Games. The IAAF deemed their explanations unacceptable. Regardless of the tribunal's decision, appeals can be made to the Court of Arbitration for Sport. The hearing will take place at the Hellenic Olympic Committee building, with a five-member panel. Kenteris and Thanou also face criminal charges in Greece for allegedly faking the accident, though these may be dropped.", "reference": "Kenteris and Thanou also face criminal charges in Greece for allegedly faking the motorcycle accident.Kostas Kenteris and Katerina Thanou will fight the provisional two-year bans imposed on them by the IAAF at an independent tribunal this weekend.The sprint duo face charges of failing to give information on their location and refusing to submit to a drugs test.The panel will also decide on the two-year ban imposed on the athletes' controversial coach Christos Tzekos by the IAAF.But there has been speculation that the charges could be dropped.They also missed tests in Tel Aviv, Chicago and Athens before the Games.Eight criminal charges have been laid against the sprinters as well as Tzekos, an eyewitness to the accident and hospital officials.Kenteris, the 2000 Olympic 200m champion, and Thanou, the women's 100m silver medallist from the same Games in Sydney, quit the Olympics on 18 August after failing to give samples on the eve of the opening ceremony."}