{"raw_text": "Jones files Conte lawsuit\n \n Marion Jones has filed a lawsuit for defamation against Balco boss Victor Conte following his allegations that he gave her performance-enhancing drugs.\n \n The Sydney Olympic gold medallist says Conte damaged her reputation and she is seeking $25m (£13m) in the suit. Conte, whose company is at the centre of a doping investigation, made the claims in a US television programme. He and three others were indicted in February by a federal grand jury for a variety of alleged offences. In an email to the Associated Press on Wednesday, Conte said: \"I stand by everything I said\". Jones won three gold medals and two bronzes in Sydney in 2000. Her lawsuit, filed in the US District Court in San Francisco, said the sprinter had passed a lie detector test and that she \"has never taken banned performance-enhancing drugs\". Conte's statements, the suit added, were \"false and malicious\". After the ABC television program earlier this month, Jones' lawyer Richard Nicholls said: \"Marion has steadfastly maintained her position throughout: she has never, ever used performance-enhancing drugs. \"Victor Conte is a man facing a 42-count federal indictment, while Marion Jones is one of America's most decorated female athletes. Mr Conte's statements have been wildly contradictory. \"Mr Conte chose to make unsubstantiated allegations on television, while Marion Jones demanded to take and then passed a lie detector examination.\n \n \"Mr Conte is simply not credible. We challenge him to submit to the same lie detector procedure that Marion Jones passed.\" The sport's ruling body, the IAAF, is taking a cautious approach to Conte's allegations but contacted the US Anti-Doping Agency. Communications director Nick Davies said the IAAF would seek to contact Conte \"for further information\". But Davies stressed it would be up to the American authorities to decide whether they will take action against Jones in light of Conte's television interview and the world governing body would monitor the situation closely. \"If it is felt there is case to answer, it would be for its national governing body (USA Track and Field) to take the appropriate disciplinary action,\" he added. \"The US Anti-Doping Agency has proved itself to be very diligent in its anti-doping war. \"And I am sure, like ourselves, they will be watching the television programme with great interest.\" Jones, who is under investigation for steroid use by the US Anti-Doping Agency, has continually denied ever taking illegal substances since being investigated in the Balco scandal, although she praised a zinc supplement Conte marketed. Jones, who did not win any medals in Athens in August, has never failed a drugs test. Meanwhile, Conte, who has been charged along with three other men of distributing illegal steroids and money laundering, is due to face trial in March.\n", "llama3.2:1b": "Jones files lawsuit against Conte for defamation over allegations he gave her performance-enhancing drugs.\n\nJones claims Conte damaged her reputation and wants $25m in damages. Conte denies the allegations and says \"I stand by everything I said\". \n\nThe situation involves a 2000 Sydney Olympic gold medalist named Jones who is facing a US federal indictment for steroid use, while Conte's company Balco was at the center of a doping investigation.", "llama3.2:3b": "Marion Jones files $25m defamation lawsuit against Victor Conte, who accused her of using performance-enhancing drugs, claiming his statements were false and malicious. Conte's company is under investigation for doping. The IAAF will seek further information from Conte but will monitor the situation closely, while the US Anti-Doping Agency continues to investigate Jones.", "gemma2:2b": "Marion Jones filed a defamation lawsuit against Victor Conte for damaging her reputation after he alleged she used performance-enhancing drugs.  Conte, facing 42 counts of federal indictment for his role at Balco, made the claims on television. The suit demands $25 million and cites a lie detector test Jones passed as evidence of her innocence. The IAAF is taking a cautious approach while USADA continues their investigation. \n", "qwen2.5:0.5b": "Marion Jones filed a lawsuit against Balco boss Victor Conte for defamation. The suit claims Conte gave her performance-enhancing drugs that damaged her reputation. Conte had made false statements during an TV interview. Jones won medals in Sydney 2000 and was one of America's most decorated female athletes. She is seeking $25 million (£13 million) in the lawsuit. Conte faces a federal indictment for 42 counts and is a man facing a 42-count federal indictment while she is a US athlete. The sport's ruling body, the IAAF, has taken a cautious approach to Conte's allegations but will consult with the US Anti-Doping Agency.", "qwen2.5:1.5b": "Marion Jones sues Victor Conte for defamation over allegations he gave her performance-enhancing drugs, seeking $25m. Conte claims his statements were false and malicious. Jones won Sydney Olympics gold medals but denied taking banned substances; Conte faces federal indictment for steroid distribution. The IAAF contacts US Anti-Doping Agency, while Jones' lawyer challenges Conte to lie detector test.", "qwen2.5:3b": "Marion Jones filed a $25m defamation lawsuit against Victor Conte after his claims about giving her performance-enhancing drugs. Jones maintained she had never used banned substances and demanded a lie detector test from Conte, who denies the allegations made during a TV program but is under investigation for distributing illegal steroids. The IAAF remains cautious, awaiting US authorities to decide on potential action against Jones based on Conte's statements. Jones has consistently denied using illegal drugs since her Balco scandal in 2003, though she praised Conte’s zinc supplement.", "opencoder:1.5b": "Jones files Conte lawsuit against Marion Jones\n\nThe court held that the plaintiff filed an evidence-based lawsuit against the defendant, Marion Jones, for defamatory material, allegedly alleging that her reputation could be damaged by alleged accusations of inappropriate behavior.\n\nConte, a private informer at the DoCoMo company, was indicted in February, under multiple charges. The lawyer said that the defendants had made unsubstantiated allegations on television and email, and also demanded to pass a lie detector examination. \"The evidence presented by Conte’s statements were deftly false and malicious,\" he added.\n\nOn Wednesday, a US-based Associated Press statement stated that Conte was indifferent to the truth about Marion Jones's actions. The verdict came as a result of the ABC television program earlier this month, when Conte referred to \"everything I said\" and made accusations of false and malicious statements. The suit also argued that Conte had not taken banned performance-enhancing drugs before her interview.\n\nJones won three gold medals and two bronzes in Sydney during 2000, which is a testament to the sport's dominance over other countries. The claim that Conte damaged her reputation and demanded money from a US agency sparked suspicion. \"I stand by everything I said,\" Jones added. The US Anti-Doping Agency, who has a proven track record of defending against drug-related violations, contacted Jones after a hearing in San Francisco.\n\nJones's lawyer Richard Nicholas said that the IAAF maintained a cautious approach to her accusations and directed them towards the agency. The agency was seeking information from Conte for further clarification about her conduct, which he dismissed as unsubstantiated.\n\nIn light of the facts presented by Conte’s interview and the investigation by the IAAF, Jones' case has been closed on both sides, with the USA Track and Field deciding that it is appropriate to take action against Marion Jones. The IAAF also noted that the verdict was not \"unanimous\" but more likely a matter of public confidence in the defendant's conduct.\n\nJones, who had a history of negative experiences and failed tests related to drugs, has continually denied ever using illegal substances, although she praised a zinc supplement Conte marketed. The court further upheld her testimony, arguing that the only evidence was deftly false and malicious accusations made by Conte at her television interview.\n", "smollm:1.7b": "Jones files lawsuit for defamation against Balco boss after alleging he gave her performance-enhancing drugs.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the provided text concisely while preserving key ideas and details. The user specified that only the summary should be output as plain text without any explanations, formatting, or reasoning.\n\nFirst, I'll read through the entire text carefully to identify the main points. It's about a defamation suit against Marion Jones for suing Victor Conte after claims he used performance-enhancing drugs.\n\nKey details include:\n- Jones filed a lawsuit against Conte in a defamation case.\n- Jones is a gold medalist and won multiple medals.\n- The suit included details like passing a lie detector test, never using banned drugs, etc.\n- Conte's company is part of an doping investigation, and he was indicted with three others.\n- He made false statements on a US TV show and stood by them in an email.\n- Jones' lawyer mentioned her steadfast position on not taking any performance-enhancing drugs.\n- Contest claims credibility issues, especially his lying about using steroids.\n\nI should make sure to capture all these elements without missing any critical points. I'll structure the summary to highlight Jones' case against Conte, the specifics of their statements, the athlete's background, and the ongoing investigation by both parties.\n\nNow, putting it all together into a concise paragraph that includes all key ideas.\n</think>\n\nMarion Jones has filed a defamation lawsuit against Victor Conte after claiming he used performance-enhancing drugs. Jones, a 2000 Sydney Olympic gold medalist, is seeking $25 million in the suit. Conte, involved in a doping investigation, made false statements on a US TV show and stood by them. Jones' lawyer emphasized her steadfast position of not using banned substances. Contest claims credibility issues, while Jones has never failed a drug test and is under investigation for steroid use by the IAAF.", "tinyllama:1.1b": "The Australian sprinter Joones has filed a legal suit for defamation against his former coach, Victor Conte, who alleges he provided him with performance-enhancing drugs. The suit claims that Conte made false and malicious statements in an ABC television program, leading to Jones filing similar charges in the US District Court. The suit states that Conté's claims are \"false and malicious,\" and that he was asked to submit to a lie detector examination but refused. The IAAF, which regulates international athletics, is taking a cautious approach to Conte's allegations while awaiting the outcome of his trial in March, while maintaining close communication with the US Anti-Doping Agency. Meanwhile, Jones, who has denied ever using performance-enhancing drugs, praised a zinc supplement Conté marketed.", "tinydolphin:1.1b": " Marion Jones, the Sydney Olympic gold medallist, has filed a lawsuit against Victor Conte for defamation following his allegations that she gave performance-enhancing drugs. In her lawsuit, Jones claims Conte damaged her reputation and seeks $25 million in compensation. The Australian television program revealed Conte's claims were \"false and malicious\". Marion Jones, one of America's most decorated female athletes, maintained her innocence throughout the allegations. Conte's statements have been widely criticized as false and malicious, with Jones' lawyer arguing that his statements have been inconsistent. The sport's ruling body, the International Association for Athletics Football (IAAF), is investigating the situation and may take action against Conte if it deems necessary. Meanwhile, Conte has been charged along with three other men in a US federal grand jury investigation into alleged drug offenses at the company where he works.", "phi:2.7b": " Marion Jones has sued Victor Conte, the boss of Balco, a supplement company linked to doping, for defamation following allegations he made about her taking performance-enhancing drugs during the 2000 Sydney Olympics. Conte claims that Jones admitted to him on national television that she had taken illegal substances, and seeks $25m in damages. However, Jones has provided evidence from a lie detector test which showed she was telling the truth, and says she has never used such drugs. The lawsuit accuses Conte of damaging her reputation and calls his statements false and malicious. Meanwhile, the International Association of Athletics Federations (IAAF) is monitoring the situation, as it could have implications for Jones' anti-doping record and the US Track and Field's disciplinary measures against her.\n", "orca-mini:3b": " Marion Jones has sued Balco boss Victor Conte for defamation, seeking $25 million in damages. She claims that Conte damaged her reputation by stating that she took performance-enhancing drugs. Jones passed a lie detector test and denies using banned substances. The IAAF is monitoring the situation closely after Conte's allegations and the US Anti-Doping Agency has also expressed interest in pursuing disciplinary action.", "hermes3:3b": "Marion Jones sues Victor Conte for $25m over defamation after he accused her of receiving performance-enhancing drugs.", "stablelm-zephyr:3b": "Marion Jones files a $25m defamation lawsuit against Balco boss Victor Conte, after he alleges she used performance-enhancing drugs. Conte's claims damaged her reputation; Jones passed a lie detector test and maintains she has never taken banned substances. The sport's ruling body, IAAF, is monitoring the situation closely but it is up to American authorities to decide any disciplinary action.", "stablelm2:1.6b": "Marion Jones filed a defamation lawsuit against Balco boss Victor Conte after his allegations she received performance-enhancing drugs from him were made during a US TV program. The lawsuit seeks $1 million damages for damage to reputation. Conte maintains the claims are true and has been indicted by a federal grand jury for various offenses, including doping. Jones' three gold medals and two bronze in Sydney 2000 have not been tainted by banned drugs; her statement indicates she never took them. Despite contradicting statements from both parties, the IAAF remains cautious about Conte's allegations. Under US law, disciplinary action would be taken by USA Track and Field if deemed appropriate by the national governing body. Jones has repeatedly denied using illegal substances, while praising a zinc supplement endorsed by Conte.", "granite3.1-dense:2b": "Marion Jones, an Olympic gold medallist and Sydney 2000 champion, has filed a $25m (£13m) defamation lawsuit against Victor Conte, the founder of Balco, following his allegations on ABC that she used performance-enhancing drugs. Jones maintains her innocence, having passed a lie detector test and never tested positive for banned substances. Conte, along with three others, faces federal charges for distributing illegal steroids and money laundering. Conte stands by his claims, asserting that Jones is not credible and has encouraged her to submit to the same lie detector test she passed. The International Association of Athletics Federations (IAAF) is cautious about Conte's allegations but plans to contact the US Anti-Doping Agency for more information. Jones, who is under investigation by the USADA for steroid use, continues to deny ever using performance-enhancers. Conte's trial is scheduled for March.", "chatgpt-4o-latest": "Marion Jones has filed a $25 million defamation lawsuit against Balco boss Victor Conte after he alleged on television that he provided her with performance-enhancing drugs. Jones, a decorated Olympic athlete, insists she has never used banned substances and has passed a lie detector test. Her lawsuit claims Conte's statements were false and malicious. Conte, who faces a federal indictment for distributing illegal steroids and money laundering, stands by his claims. The IAAF is monitoring the situation but defers to US authorities for any disciplinary action. Jones, under investigation by the US Anti-Doping Agency, has never failed a drug test. Conte's trial is set for March.", "reference": "\"Mr Conte chose to make unsubstantiated allegations on television, while Marion Jones demanded to take and then passed a lie detector examination.Marion Jones has filed a lawsuit for defamation against Balco boss Victor Conte following his allegations that he gave her performance-enhancing drugs.Jones, who is under investigation for steroid use by the US Anti-Doping Agency, has continually denied ever taking illegal substances since being investigated in the Balco scandal, although she praised a zinc supplement Conte marketed.After the ABC television program earlier this month, Jones' lawyer Richard Nicholls said: \"Marion has steadfastly maintained her position throughout: she has never, ever used performance-enhancing drugs.\"Victor Conte is a man facing a 42-count federal indictment, while Marion Jones is one of America's most decorated female athletes.But Davies stressed it would be up to the American authorities to decide whether they will take action against Jones in light of Conte's television interview and the world governing body would monitor the situation closely.Conte, whose company is at the centre of a doping investigation, made the claims in a US television programme.\"Mr Conte is simply not credible.We challenge him to submit to the same lie detector procedure that Marion Jones passed.\"Communications director Nick Davies said the IAAF would seek to contact Conte \"for further information\"."}