{"raw_text": "IAAF awaits Greek pair's response\n \n Kostas Kenteris and Katerina Thanou are yet to respond to doping charges from the International Association of Athletics Federations (IAAF).\n \n The Greek pair were charged after missing a series of routine drugs tests in Tel Aviv, Chicago and Athens. They have until midnight on 16 December and an IAAF spokesman said: \"We're sure their responses are on their way.\" If they do not respond or their explanations are rejected, they will be provisionally banned from competition. They will then face a hearing in front of the Greek Federation, which will ultimately determine their fate. Their former coach Christos Tzekos has also been charged with distributing banned substances. Under IAAF rules, the athletes could receive a maximum one-year suspension. Kenteris and Thanou already face a criminal trial after being charged with avoiding a drug test on the eve of the Athens Olympics and then faking a motorcyle crash.\n \n No date for the trial has yet been set and again Tzekos is also facing charges. The IAAF issued an official warning to the trio last year after they were discovered training in Qatar rather than in Crete, where they had said they would be. All athletes must inform their national federations where they are at all times, so they can be available for out-of-competition drugs tests. But Kenteris and Thanou then went on to skip tests in Tel Aviv and Chicago, when they decided to fly back to Greece early. Then just before the Olympics, the pair dramatically missed another test in Athens and withdrew from the Games.\n", "llama3.2:1b": "Kostas Kenteris and Katerina Thanou have yet to respond to doping charges by the IAAF, who issued an official warning after they were discovered training in Qatar instead of Greece. The athletes face a one-year suspension if they do not respond or explain themselves. Their former coach Christos Tzekos is also charged with distributing banned substances and could receive a maximum one-year ban if found guilty.", "llama3.2:3b": "Kostas Kenteris and Katerina Thanou have yet to respond to doping charges from IAAF after missing routine tests in Tel Aviv, Chicago, and Athens. They face a maximum one-year suspension if their responses are rejected or their explanations are not accepted, with a hearing set by the Greek Federation potentially determining their fate.", "gemma2:2b": "Kostas Kenteris and Katerina Thanou face doping charges after failing drug tests in multiple locations. They have until December 16th to respond and face possible provisional suspension if no response or unsatisfactory explanations are provided. The Greek Federation will then hold a hearing to determine their fate. Their former coach, Christos Tzekos, is also facing charges for distributing banned substances.  Kenteris and Thanou already face criminal trial regarding the missed drug test before the Athens Olympics and faking a motorcycle crash. \n", "qwen2.5:0.5b": "A Greek pair was charged with doping in three recent international sports events due to missing routine drug tests. They are expected to respond on December 16th at midnight and will face possible bans or trials if they do not provide accurate explanations. The IAAF has warned them about training abroad, but the pair had already made a deal for an early return flight home to Greece.\nThe Greek athletes have been charged with distributing banned substances in their past, and Christos Tzekos is also facing charges related to avoiding drug tests during the Olympics. The International Association of Athletics Federations (IAAF) issued an official warning last year after they were found training in Qatar but returned to Crete before making a decision.", "qwen2.5:1.5b": "IAAF awaits Greek pair Kostas Kenteris and Katerina Thanou's response to doping charges; could face provisional ban or hearing with possible one-year suspension if no response or rejected explanations. Christos Tzekos also charged with distributing banned substances. Olympic ethics breach investigated, including a criminal trial and IAAF warnings.", "qwen2.5:3b": "IAAF awaits response from Kostas Kenteris and Katerina Thanou regarding doping charges stemming from missing routine drug tests. They have until December 16th to respond; failure or rejected explanations could result in provisional ban and hearing with Greek Federation, leading to potential one-year suspension. Both athletes previously charged criminally for faking a motorcycle crash before the Athens Olympics. Former coach Christos Tzekos also faces charges. Last year, they were warned for training elsewhere than Crete as instructed by national federation. The trio skipped tests in Tel Aviv and Chicago, with Kenteris and Thanou then missing an Athens test prior to the Games. No date has been set for their criminal trial; Tzekos is facing further charges.", "opencoder:1.5b": "IAAF awaits Greek pair's response.\n\nKostas Kenteris and Katerina Thanou are yet to respond to doping charges from the International Association of Athletics Federations (IAAF).\n\nThe Greek pair were charged after missing a series of routine drugs tests in Tel Aviv, Chicago and Athens. If they do not respond or their explanations are rejected, they will be provisionally banned from competition.\n\nThier former coach Christos Tzekos has also been charged with distributing banned substances. Under IAAF rules, the athletes could receive a maximum one-year suspension. Kenteris and Thanou already face a criminal trial after being charged with avoiding a drug test on the eve of the Athens Olympics and then faking a motorcyle crash.\n\nNo date for the trial has yet been set and again Tzekos is also facing charges.\n\nThe IAAF issued an official warning to the trio last year after they were discovered training in Qatar rather than in Crete, where they had said they would be. All athletes must inform their national federations where they are at all times.\n", "smollm:1.7b": "The summary should be:\nIAAF awaits Greek pair's response\nKostas Kenteris and Katerina Thanou are yet to respond to doping charges from IAAF.\nThe text is concise, without any explanations or reasoning processes. The key ideas and details are preserved in the summary.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about the Greek pair and doping charges. Let me read through it carefully.\n\nThe first sentence mentions that the IAAF is waiting for Kostas Kenteris and Katerina Thanou's response. They haven't been charged yet but were involved in some routine tests in Tel Aviv, Chicago, and Athens. The IAAF said they have until midnight on December 16th to respond. If they don't, or their explanations are wrong, they'll be provisionally banned from competition.\n\nThen there's a statement by an IAAF spokesman: \"We're sure their responses are on their way.\" So the team is expected to respond but hasn't done so yet.\n\nThe Greek pair was charged for avoiding a test before the Olympics and faking a motorcycle crash. They had been training in Qatar, not Crete as they initially said. \n\nKaterina Thanou's former coach, Christos Tzekos, is also charged with distributing banned substances under IAAF rules. Maximum one-year suspension.\n\nThey already faced criminal trials after avoiding a test in the previous Olympics and faking a crash. So this is their second trial now.\n\nThe warning from the IAAF last year says athletes must inform their federations about their location at all times, so they can be available for drug tests elsewhere. But they skipped those tests in Tel Aviv, Chicago before going back to Greece early. Then they missed another test in Athens and withdrew from the Olympics.\n\nI need to condense this into a summary without explanations or formatting. Just plain text.\n</think>\n\nThe Greek pair Kostas Kenteris and Katerina Thanou have been charged with avoiding a drug test before the 2016 Greek Olympic Games, faking a motorcycle crash, and were also involved in routine tests in Tel Aviv, Chicago, and Athens. They are scheduled to respond by midnight on December 16th but are provisionally banned from competition if they fail to do so or their explanations are rejected. Their coach Christos Tzekos is also charged with distributing banned substances under IAAF rules, facing a maximum one-year suspension. The trio previously faced criminal trials for avoiding a test in the Olympics and faking a crash after training in Qatar rather than Crete. The IAAF warned athletes to inform their federations of their location at all times to be available for drug tests elsewhere. However, they skipped tests in Tel Aviv and Chicago before returning early to Greece, missing another test in Athens and withdrawing from the Games.", "tinyllama:1.1b": "Outcome: The International Association of Athletics Federation (IAAF) has awaited a response from the Greek athletes Kostas Kenteriš and Katerinė Thanoù regarding their suspected drug-taking charges. If they do not respond, they will be provisionally banned from competition, with the former coach Christos Tzekos also facing criminal proceedings for distributing prohibited substances. The trio has until midnight on 16 December to provide a response, and if their explanation is rejected, they may face a hearing in front of the Greek Athletics Federation. The IAAF issued an official warning to athletes last year after they were discovered training in Qatar, but this time around, all three are expected to appear in court.", "tinydolphin:1.1b": " The International Association of Athletics Federations (IAAF) is waiting for the responses of Greek athletes Kostas Kenteris and Katerina Thanou from doping charges after they failed to pass routine drugs tests in Tel Aviv, Chicago, and Athens. If they do not respond within midnight on 16 December, an IAAF spokesperson stated that their responses will be sent out via the Greek Athletics Federation. However, if their explanations are rejected or if new test results are received after the deadline, they could face a provisional ban from competition. If not, the athletes could receive one-year suspension. The pair has been charged with avoiding a drug test on the eve of the Athens Olympics and faking a motorcycle crash. They also face a criminal trial for avoiding an Olympic drug test.", "phi:2.7b": " Kostas Kenteris and Katerina Thanou have not responded to doping charges from the International Association of Athletics Federations (IAAF) after missing routine drugs tests in Tel Aviv, Chicago, and Athens. They face a criminal trial for avoiding a drug test on the eve of the Athens Olympics and faking a motorcycle crash. If they do not respond or their explanations are rejected, they will be provisionally banned from competition for up to one year. Their former coach Christos Tzekos is also facing charges. All athletes must inform their national federations where they are at all times to ensure availability for out-of-competition drugs tests.\n", "orca-mini:3b": " The International Association of Athletics Federations (IAAF) awaits a response from Kostas Kenteris and Katerina Thanou after they were charged with doping charges. The Greek pair failed to respond to routine drugs tests in Tel Aviv, Chicago, and Athens. If they do not provide an explanation or face suspension, they could be banned from competition. Their coach Christos Tzekos has also been charged with distributing banned substances. The IAAF warned the trio last year after they were discovered training in Qatar rather than in Crete. All athletes must inform their national federations where they are at all times, so they can be available for out-of-competition drugs tests.", "hermes3:3b": "IAAF waits for Greek athletes' response to doping charges. Kenteris, Thanou yet to respond to charges after missing routine tests in Tel Aviv, Chicago and Athens; face possible one-year suspension if no response or explanations rejected.", "stablelm-zephyr:3b": "Greek athletes Kostas Kenteris and Katerina Thanou have been charged by the International Association of Athletics Federations (IAAF) for missing multiple drug tests in Tel Aviv, Chicago, and Athens. They have until Dec 16 to respond, with a hearing before the Greek Federation determining their fate. Their former coach Christos Tzekos has also been charged for distributing banned substances. If they do not respond or their explanations are rejected, they will be provisionally banned from competition. Kenteris and Thanou previously faced a criminal trial for avoiding a drug test before the Athens Olympics and faking a motorcycle crash.", "stablelm2:1.6b": "The International Association of Athletics Federations (IAAF) is waiting for a response from Greek athletes Kostas Kenteris and Katerina Thanou regarding doping charges. If they fail to respond or refuse explanations, they could face temporary bans from competition. The pair were charged after missing routine drug tests in Tel Aviv, Chicago, and Athens. Kenteris and Thanou must answer by midnight on December 1st if they haven\nto do so. If they do not respond or their explanations are dismissed, they will be banned provisionally from participating in future competitions until a hearing before the Greek Federation is conducted. Former coach Christos Tzekos has also been charged with distributing banned substances, and Kenteris and Thanou face a criminal trial for avoiding a drug test on the eve of the Athens Olympics and faking a motorcycle crash.", "granite3.1-dense:2b": "Kostas Kenteris and Katerina Thanou, Greek athletes, have been charged by the IAAF for missing routine drugs tests in Tel Aviv, Chicago, and Athens. They were notified of these charges and now have until 16 December to respond. Failure to respond or provide acceptable explanations could result in a provisional ban from competition, followed by a hearing before the Greek Federation. The pair's former coach, Christos Tzekos, is also charged with distributing banned substances. Kenteris and Thanou are already under criminal trial for avoiding a drug test prior to the 2004 Athens Olympics and staging a motorcycle accident. Their training location in Qatar contradicted their stated intention to train in Crete, violating IAAF rules requiring athletes to notify their national federations of their whereabouts for out-of-competition drug tests. If found guilty, they could face a one-year suspension.", "chatgpt-4o-latest": "Greek sprinters Kostas Kenteris and Katerina Thanou have yet to respond to doping charges from the IAAF after missing multiple drug tests in Tel Aviv, Chicago, and Athens. They have until midnight on 16 December to reply, or they face provisional suspension and a hearing by the Greek Federation. Their former coach, Christos Tzekos, is also charged with distributing banned substances. The athletes could receive a one-year suspension under IAAF rules and already face a criminal trial for allegedly avoiding a drug test before the Athens Olympics and faking a motorcycle crash. The IAAF had previously warned them for training in Qatar instead of Crete. They later skipped tests in Tel Aviv and Chicago and missed another in Athens before withdrawing from the Olympics.", "reference": "Kenteris and Thanou already face a criminal trial after being charged with avoiding a drug test on the eve of the Athens Olympics and then faking a motorcyle crash.The Greek pair were charged after missing a series of routine drugs tests in Tel Aviv, Chicago and Athens.Kostas Kenteris and Katerina Thanou are yet to respond to doping charges from the International Association of Athletics Federations (IAAF).But Kenteris and Thanou then went on to skip tests in Tel Aviv and Chicago, when they decided to fly back to Greece early.Their former coach Christos Tzekos has also been charged with distributing banned substances.Then just before the Olympics, the pair dramatically missed another test in Athens and withdrew from the Games."}