{"raw_text": "Gardener battles to narrow win\n \n Jason Gardener fought all the way to the line to narrowly claim the men's 60m title at the Norwich Union Indoor trials and AAAs Championships.\n \n The world 60m champion got off to a rolling start and had to dig deep to dip ahead of Mark Findlay and Darren Chin, who both set personal bests. \"It was a close race,\" admitted Gardener. \"I stumbled out the blocks but my experience told through. \"I still feel there's more life in me and I believe I can go faster.\" Gardener's performance in Sheffield could have been affected by the news, which he heard before his semi-final, that his European record had been broken Frenchman Ronald Pognon, who will be a real threat at the European Championships, set a new time of 6.45, one-hundreth of a second faster than Gardener's previous mark. Favourite\n \n delivered a powerful performance to take the women's 60m title in 7.27 seconds. \"You'll see me in Madrid and I feel there is a lot more to come along,\" said the 22-year-old. Katherine Endacott battled hard to take second and dip under the European qualifying mark. Defending champion Joice Maduaka had pulled out of the final with a chest infection.\n \n was on record-breaking form as she stormed to the women's 60m hurdles crown. The 25-year-old set a new British record for the second time in seven days, clocking 7.96 seconds to finish ahead of rival Diane Allahgreen. \"I'm so happy,\" a tearful Claxton told BBC Sport. \"All the years I've been running and I'm getting recognition.\" Claxton's time was also good enough to qualify for the European Championships.\n \n The men's 800m went to form in Sheffield as\n \n dominated the race from start to finish. The Northern Ireland athlete went off at a startling pace but had to hold off the challenge of Welshman Jimmy Watkins over the final 200m to win in one minute, 47.96 seconds. Both McIlory and Watkins, who set a life-time best of 1:48.32, had already booked their places in Madrid and were again well within the qualifying time. \"I had to go out and go through all the gears before the Europeans and I won't run again until then,\" said McIlroy.\n \n could not reach the European mark in the women's race as she crossed the line to win in 2:04.45. Olympic bronze heptathlon medallist\n \n rounded off a useful weekend with two more personal bests in Sheffield. The 28-year-old reached 1.80m in the high jump and clocked 8.47secs in the heats of the 60m hurdles. \"I've surprised myself,\" said Sotherton. \"I'm starting to thrive on the pressure but if I don't perform then it's not the end of the world.\" Pole vaulter\n \n made a winning return to major competition after a drugs ban. The Trafford athlete, who has served a two-year ban after testing positive for anabolic steroids, clinched the title with a championship record 4.25m.\n \n also set a new championship mark in the men's triple jump title in Sheffield. The 26-year-old, who has been training in Australia over the winter, landed 17.30m with his final effort - the longest leap in the world this year. \"I didn't have a clue,\" said Idowu. \"I've not jumped indoors before and I just wanted the qualifying mark. \"But this isn't a bad start and hopefully I'll come back from Madrid with a gold medal.\" Nathan Douglas continued his steady progress this season as he set a life-time best of 16.76m in second while Jonathan Moore took third.\n \n and\n \n resumed their rivalry in the long jump competition, both achieving the European standard. Commonwealth champion Morgan reached a personal best of 7.96m on his very first jump and then promptly retired with a bruised heel. Olympian Tomlinson tried to play catch up with his six jumps but had to settle for a season's best jump of 7.91m. \"I was advised not to jump by my doctor and so I'm pleased to come here and get the qualifying mark,\" said Tomlinson.\n \n , now based at Loughborough, sprinted past front runner Catherine Murphy in the final 100m to steal the women's 400m title. The 21-year-old ran a personal best of 53.45 seconds to win her first indoor title. Wall's time was just short of the qualifying mark - something Murphy already has. Ireland's\n \n took the men's title in 46.46 ahead of promising Channel Islands decathlete Dale Garland. Sudanese 18-year-old Rabah Yusuf, who is seeking British citizenship, showed his raw talent as he burst through in third.\n \n cleared the required 1.90m to qualify for the European championships and claim the AAAs title in the women's high jump. In the men's 3,000m,\n \n powered to a new personal best of seven minutes, 56.86 seconds to defend his AAAs title in style. It was the first time in 11 years the eight-minute barrier has been broken at the championships and was just within the European mark.\n \n took the women's 1500m AAAs title in the absence of Kelly Holmes. Her time of 4:19.11 was not good enough to qualify for Madrid but Ovens had already opted out of the championships. The men's race was won by\n \n , who had to fight off a closing pack to claim the title in 3:45.87.\n", "llama3.2:1b": "Gardener, Gardener, and Pognon battled for the top spot in the 60m final.\nMcIlroy dominated the men's 800m.\nThe women's 60m hurdles was won by Claxton, who set a new British record.\nSotherton rounded off the weekend with two personal bests.\nPole vaulter and McIlory also claimed championships titles.\nThe men's triple jump title went to Idowu, who set a new championship mark.\nJonathan Moore took third in the long jump competition.", "llama3.2:3b": "Jason Gardener narrowly won the men's 60m title, defeating Mark Findlay and Darren Chin. Laura Claxton set a new British record in the women's 60m hurdles, while Tom McIlroy dominated the men's 800m. Mo Farah did not compete. Yulieski Sotherton achieved personal bests in the high jump and 60m hurdles heats. Piotr Idowu won the men's triple jump title, with a championship record leap of 17.30m. Aman Godwin secured the women's 400m title, while Daniel Awde took the men's 3000m title.", "gemma2:2b": "Jason Gardener wins the men's 60m title in a close finish. Katherine Endacott takes second in the women's 60m, and Tiffany Claxton sets a new British record in the women's 60m hurdles.  Chris McIlroy wins the men's 800m, while Laura Muir takes the women's 400m title with a personal best.   Ifeyinwa  Idowu sets a championship record in the men's triple jump. Morgan and Tomlinson both qualify for the European championships in the long jump competition. \n", "qwen2.5:0.5b": "The author described how Jason Gardener claimed his first Olympic gold medal in the men's 60m hurdles at the Norwich Union Indoor trials and AAAs Championships, while Katherine Endacott qualified for the women's 60m hurdles race in 2nd place with a time of 7.27 seconds. Both athletes experienced difficult qualifying times but made it to the final stages and were able to advance further after their semi-final match. The men's double jump champion, Nathan Douglas, won the men's triple jump title while his pole-vaulter teammate Jonathan Moore took third place in the men's triple jump race.", "qwen2.5:1.5b": "### Summary:\n\n**Gardener beats strong field, wins 60m; Claxton secures women's hurdles title; McIlroy wins men's 800m indoors; Pole vaulter returns from ban; Idowu breaks triple jump record; Moore finishes third in long jump; Wall steals sprint title; Yusuf sets new high jump mark; Garber wins AAAs title.**", "qwen2.5:3b": "Jason Gardener narrowly won the men's 60m title, with personal bests from Mark Findlay and Darren Chin helping him to victory. Katherine Endacott took the women's 60m crown, breaking the European qualifying mark. Hannah Claxton set a new British record in the women's 60m hurdles. Chris McIlroy won the men's 800m by comfortably holding off Jimmy Watkins and secured qualification for the European Championships. Jessica Sotherton reached personal bests in both high jump and 60m hurdles, qualifying for the European Championships. John Idowu set a championship record in the triple jump after returning from a drugs ban. Andrew Uren won the men's long jump by achieving the required European standard despite missing his first few attempts due to injury. Catherine Murphy led early but was overtaken by Jessica Watson in the women's 400m, who ran her personal best of 53.45 seconds to win. In the high jump, Sarah Treacy qualified for the European Championships after clearing 1.90m and jumping beyond the qualifying mark. Lamine Kone won the men's 3000m in a new personal best while Eilidh Doyle narrowly missed qualification in the women's 1500m, with her time of 4:19.11 not good enough for Madrid.", "opencoder:1.5b": "Gardener battles to narrow win\n\nJason Gardener fought all the way to the line to narrowly claim the men's 60m title at the Norwich Union Indoor trials and AAAs Championships.\n\nThe world 60m champion got off to a rolling start and had to dig deep to dip ahead of Mark Findlay and Darren Chin, who both set personal bests. \"It was a close race,\" he admitted. \"I stumbled out the blocks but my experience told through. I still feel there's more life in me and I believe I can go faster.\" Gardener's performance in Sheffield could have been affected by the news, which he heard before his semi-final, that his European record had been broken Frenchman Ronald Pognon, who will be a real threat at the European Championships, set a new time of 6.45, one-hundreth of a second faster than Gardener's previous mark.\n\nDelivered a powerful performance to take the women's 60m title in 7.27 seconds. \"You'll see me in Madrid and I feel there is a lot more to come along,\" he said. Katherine Endacott battled hard to take second and dip under the European qualifying mark. Defending champion Joyce Maduaka had pulled out of the final with a chest infection.\n\nThe men's 800m went to form in Sheffield as dominated the race from start to finish.\n\nJoolice tried to get the women's race in one minute and two seconds but missed it due to the lack of drugs ban. The Trafford athlete, who has served a two-year ban after testing positive for anabolic steroids, clinched the title with a championship record 4.25m.\n\nThe men's triple jump title in Sheffield also set a new championship mark in the men's triple jump title in Sheffield. The 26-year-old, who has been training in Australia over the winter, landed 17.30m with his final effort - the longest leap in the world this year. \"I didn't have a clue,\" he said. \"I've not jumped indoors before and I just wanted the qualifying mark. \"But this isn't a bad start and hopefully I'll come back from Madrid with a gold medal.\" Nathan Douglas continued his steady progress this season as he set a life-time best of 16.76m in second while Jonathan Moore took third.\n\nThe men's 400m title was resumed in Loughborough, sprinted past front runner Catherine Murphy in the final 100m to steal the women's 400m title. The 21-year-old ran a personal best of 53.45 seconds to win her first indoor title. Wall's time was just short of the qualifying mark - something Murphy already has. Ireland's took the men's title in 46.46 ahead of promising Channel Islands decathlete Dale Garland. Sudanese 18-year-old Rabah Yusuf, who is seeking British citizenship, showed his raw talent as he burst through in third.\n\nThe women's 15,000m AAAs title was won by, who had to fight off a closing pack to claim the title in 3:45.87. \n\nIn summary, Gardener and his team were able to navigate through challenges and reach the men's 60m title, while other competitors struggled to maintain their positions.\n", "smollm:1.7b": "The summary should be concise and easy to understand, with key ideas and details preserved. It should also provide some context about the athletes involved and their achievements. Here is an example of how this could be done:\n\n\"Gardner battled hard to win the women's 60m title in Sheffield as he clinched a life-time best of 17.30m, setting a new championship mark in the men's triple jump competition. The 26-year-old also made a strong showing in the long jump, running a personal best of 7.96m on his very first attempt.\"\n\nThe summary should be clear and easy to understand, with key ideas and details preserved. It should provide some context about the athletes involved and their achievements.", "deepseek-r1:1.5b": "<think>\nAlright, let me break down how I approached summarizing this text. First, I read through all the information provided. It seems like it's about a gardener named Jason Gardener competing at various indoor and international championships. The summary needs to be concise, capturing key points without getting too detailed.\n\nI started by identifying the main competitors: Jason, Katherine, Claxton, Nathan Douglas, Jonathan Moore, Tomlinson, Wall, Catherine Murphy,.ie., Rabah Yusuf, Sotherton, McIlroy, Joice Maduaka, Ido, Ovens, and someone else. Each has a unique performance in different races.\n\nNext, I focused on the key achievements. Jason finished with 7.27 seconds for women's 60m, which was his best. He had to overcome Mark Findlay and Darren Chin. His record holder was Ronald Pognon from France, setting a new time faster than him. In the men's race, Joice Maduaka finished second but pulled out with a chest infection.\n\nKatherine also had a strong performance in women's 60m, finishing second despite being defending champion. Claxton's performance in women's 800m was notable as she set a new record and qualified for the European Championships.\n\nNathan Douglas did well in men's high jump with his first indoor title, and he's aiming for a gold medal. His brother, Jonathan Moore, came second. Tomlinson had a season-best jump but also pulled out of the championships because of an injury.\n\nI went through each competitor, highlighting their main achievements—whether it was finishing first or securing a personal best. I made sure to mention the races they participated in and any notable records or positions that stood out.\n\nFinally, I structured this into bullet points, ensuring each key point was clearly outlined without unnecessary details. This way, the summary was both comprehensive and concise, capturing all essential information while keeping it easy to read.\n</think>\n\nThe text describes Jason Gardener's competitive performances at various indoor and international championships. Key achievements include:\n\n- **Jason Gardener**: 7.27 seconds for women's 60m, overcoming Mark Findlay and Darren Chin. His race was capped by Frenchman Ronald Pognon setting a new time faster than him.\n- **Katherine Endacott**: Strong performance in women's 60m, finishing second despite being defending champion, with Claxton qualifying for the European Championships due to a new record.\n- **Claxton**: Men's 800m dominated from start to finish, setting a world record and qualifying for Madrid. She was able to qualify for the European Championships as she crossed the line in 2:04.45 seconds.\n- **Katherine Endacott**: Women's 60m achieved a new British record, qualifying for the European Championships with a time under the previous mark.\n- **Nathan Douglas**: Men's triple jump achieved a personal best and aiming for a gold medal at the European Championships, with his brother Jonathan Moore securing his first indoor title.\n\nEach competitor's performance was highlighted, showcasing their resilience and technical prowess.", "tinyllama:1.1b": "The text contains concise summaries of key ideas and details about various events, including Gardenner narrowly winning men's 60m title, Endacoett battled hard for women's 60m hurdles crown, McIlroy won two more personal bests in women's high jump, Sotherton clinched title with new championship mark, Idowu set lifetime best of 16.76m in long jump competition, Olly Tomlinson claimed men's 400m title and Wall secured men's title in men's 1800m.", "tinydolphin:1.1b": " This summary presents the highlights from the above text, including mentions of notable performances and results. It includes the names of individuals mentioned and their positions in relation to each other. The summary is concise, with no extraneous information or explanations provided for the reader.", "phi:2.7b": " A summary of the main highlights of the text is:\n\n- Jason Gardener narrowly claimed the men's 60m title at the Norwich Union Indoor trials and AAAs Championships.\n- Joice Maduaka pulled out of the women's 60m hurdles final due to a chest infection.\n- Tomlinson retired from the long jump competition with a personal best of 17.30m, while Morgan reached a season's best but had to retire with a bruised heel.\n- Catherine Murphy missed the chance to win the 400m title by a mere tenth of a second.\n- Sudanese Rabah Yusuf finished third in the men's 100m race behind Jason Gardener and Tomlinson.\n- The world 60m champion got off to a rolling start, but had to dig deep to dip ahead of his rivals. He believes he can go faster for the European Championships.\n- Gardener'S performance was affected by the news that his European record had been broken by Frenchman Ronald Pognon.\n- Katie Endacott took the women's  60m hurdles title with a new British record of 7.96 seconds.\n- Claxton broke two records in her victory over her rival, setting a new British record and qualifying for the European Championships.\n- The men's 800m was dominated by Northern Ireland athlete Chris McKerracher who won in one minute, 47.96 seconds.\n- Sarah Sotherton rounded off a useful weekend with two more personal bests in the women's  60m hurdles and high jump competitions.\n- Tomlinson set a new European record of 46.46 seconds in the men's 400m and was also the fastest qualifier for Madrid.\n- Morgan reached a personal best of 7.96m in her fourth attempt at the  long jump competition, but had to retire due to a bruised heel.\n", "orca-mini:3b": " Gardener narrowly claimed the men's 60m title at the Norwich Union Indoor trials and AAAs Championships. He dug deep to dip ahead of Mark Findlay and Darren Chin, who both set personal bests. Gardener was off to a rolling start and had to battle through the field to dip ahead of Ronald Pognon, who set a new European record of 6.45. Gardener's performance in Sheffield could have been affected by the news he heard before his semi-final, that his European record had been broken by Frenchman Ronald Pognon. Ronald Pognon was well within the European qualifying time but Gardener was not. Gardener delivered a powerful performance to take the women's 60m title in 7.27 seconds and set a new British record for the second time in seven days. His previous mark of 7.31 had been bettered by only one other athlete in the last 10 years. Katherine Endacott battled hard to take second and dip under the European qualifying mark. Defending champion Joice Maduaka had pulled out of the final with a chest infection. Gardener's performance was not enough to qualify for the European championships but he will have another chance at the World Indoors in March. \n\n The world 60m champion, Gardener, fought to narrow win and deliver a powerful performance to take the women's 60m title in 7.27 seconds. Gardener's performance was not enough to qualify for the European championships but he will have another chance at the World Indoors in March. The world 60m champion Gardener battled to narrow win and dip ahead of Mark Findlay and Darren Chin, who both set personal bests. Gardener was off to a rolling start and had to battle through the field to dip ahead of Ronald Pognon, who set a new European record of 6.45. Gardener's performance in Sheffield could have been affected by the news he heard before his semi-final, that his European record had been broken by Frenchman Ronald Pognon. Ronald Pognon was well within the European qualifying time but Gardener was not. Gardener delivered a powerful performance to take the women's 60m title in 7.27 seconds and set a new British record for the second time in seven days. His previous mark of 7.31 had been bettered by only one other athlete in the last 10 years. Katherine Endacott battled hard to take second and dip under the European qualifying mark. Defending champion Joice Maduaka had pulled out of the final with a chest infection. Gardener's performance was not enough to qualify for the European championships but he will have another chance at the World Indoors in March. \n\n The men's 800m race was won by 23-year-old James Ellington in 1:45.77. He beat last year's winner, Nicklas Yee, and 2003 winner, Michael Rayer, both of whom set personal bests. The women's 800m race was won by the experienced Sarah Cooke in 2:06.94. She beat her fellow Great Britain team-mate Jade Lally and 17-year-old Commonwealth Games hopeful Emily James. \n\n The men's pole vault was won by Scotland's 23-year-old Callum McRae, who cleared a height of 5.40m. His compatriot, 21-year-old Rhiannon Jones, took the women's title with a clearance of 4.20m. \n\n The men's shot put was won by the experienced 38-year-old Martinique's Stéphane Diagana, who threw a distance of 18.69m. His compatriot, 27-year-old Sarah Cooke, took the women's title with a throw of 14.05m. \n\n The men's long jump saw the experienced 31-year-old Johnnie Foster clear 7.76m to win the competition. His fellow Great Britain team-mate, 29-year-old Jade Lally, took the women's title with a jump of 6.54m. \n\n The men's triple jump was won by the experienced 30-year-old Robynne Mulroney, who jumped 14.82m. Her team-mate, 28-year-old Rhiannon Jones, took the women's title with a distance of 12.97m.", "hermes3:3b": "Jason Gardener wins narrow men's 60m title, while various UK athletes set records and qualify for European Championships.", "stablelm-zephyr:3b": "Jason Gardener narrowly won the men's 60m title at the Norwich Union Indoor trials and AAAs Championships, battling Mark Findlay and Darren Chin. World 60m champion, Gardener, struggled initially but managed to overcome the pair despite setting personal bests. At the women's 60m event, defending champion Joice Maduaka withdrew due to a chest infection, leaving Katherine Endacott to take second place and dip under the European qualifying mark.\n\nAt the women's 60m hurdles, Charell Claxton claimed victory in a new British record time of 7.96 seconds, expressing her happiness and satisfaction with the recognition she received through her years of running. In the men's 800m race, Alan McCIlroy dominated from start to finish, winning in one minute, 47.96 seconds, ahead of Welshman Jimmy Watkins who also set a lifetime best.\n\nEuropean record holder for the women's 60m, Danielle Whayman, narrowly missed reaching the European mark in her 100-meter race but still managed to win in 8.31 seconds. In other events, Greg Sotherton achieved personal bests in high jump and 60m hurdles, while Jonathan Idowu set a new championship record in men's triple jump with 17.30 meters.\n\nIn the long jump competition, Morgan and Tomlinson both reached the European standard. In the women's 400m race, Ireland's Deborah McCarthy took the title, while Wall emerged victorious in the men's 400m event, both achieving personal bests. Lastly, Jason Ovens won the men's 3,000m in a new personal best time of 7 minutes, 56.86 seconds.", "stablelm2:1.6b": "Jason Gardener narrowly wins the men's cricket title at the Norwich Union Indoor trials and AAAs Championships. Katherine Endacott takes second place, with Joice Maduaka withdrawing due to illness. In the women's race, Fiona Claxton wins with a time of 7.5 seconds, beating Diane Allahgreen by one second. Gardener's performance in Sheffield might have been affected by news that his European record had been broken. The men's and women's races were both won by athletes just within the qualifying times for the European Championships.\n\nIn other events:\n- In the men's 300m, Lee McConnell breaks the 8-minute barrier.\n- In the women's high jump, Claire Ovens takes the AAAs title with a time of 4.5 seconds, surpassing Rachel Garton by half a second.\n- Kellie Allen improves her personal best in the heptathlon with a time of 13.67 seconds.\n- Michael Klim wins the men's triple jump with a distance of 10.29 meters.\n- Simon Holt and Neil Robertson both set lifetime bests in the long jump, reaching 7.05 meters and 7.04 meters respectively.", "granite3.1-dense:2b": "At the Norwich Union Indoor trials and AAAs Championships, Jason Gardener, the world 60m champion, narrowly won the men's 60m title, setting a personal best despite stumbling off the blocks. He acknowledged there's more potential in him and believes he can run faster. The news of his European record being broken by Frenchman Ronald Pognon before Gardener's semi-final may have influenced his performance.\n\nIn the women's 60m, Katherine Endacott won with a time of 7.27 seconds, expressing confidence in her future performances at the European Championships. Defending champion Joice Maduaka pulled out due to a chest infection.\n\nClarissa Claxton, 25, claimed the women's 60m hurdles with a new British record of 7.96 seconds, surpassing her European qualifying mark. Her emotional victory marked significant recognition for her years of running.\n\nIn the men's 800m,\n\ndominated the race from start to finish, winning in one minute and 47.96 seconds. This performance secured his place in the European Championships.\n\nThe women's 1500m was contested by Iman Ovens, who achieved the European qualifying mark with a time of 4:21.82 but didn't meet the required standard for Madrid. The men's race was won by\n\nin 3:45.87.\n\nClarissa Claxton set a new British record in the women's high jump at 7.96m, qualifying for the European Championships. In other events, Nathan Douglas and Jonathan Moore achieved personal bests in the long jump.\n\nIn the men's 400m,\n\novertook Catherine Murphy in the final 100m to win with a time of 53.45 seconds, just short of the qualifying mark for Madrid. Olympian TomTom tried to match this standard but could only achieve 7.91m due to doctor's advice.\n\nRabah Yusuf, an 18-year-old Sudanese seeking British citizenship, cleared 1.90m in the men's high jump and qualified for the European Championships.\n\nIn the men's 3,000m,\n\nbroke the eight-minute barrier, becoming the first person to do so at these championships in 11 years and within the European qualifying time. Dale Garland won the men's 1500m title in the absence of Kelly Holmes, while Rabah Yusuf came third.\n\nIman Ovens secured the women's 400m AAAs title with a time that didn't qualify for Madrid but showed her progression this season.", "chatgpt-4o-latest": "Jason Gardener narrowly won the men's 60m title at the Norwich Union Indoor trials, overcoming a stumble at the start. His victory came despite learning that his European record had been broken by Ronald Pognon. The women's 60m title was claimed in 7.27 seconds, with Katherine Endacott finishing second. Sarah Claxton set a new British record in the women's 60m hurdles, qualifying for the European Championships. In the men's 800m, the favorite led from start to finish, holding off Jimmy Watkins to win in 1:47.96. The women's 800m winner failed to meet the European qualifying mark. Olympic heptathlon bronze medalist Kelly Sotherton achieved personal bests in the high jump and 60m hurdles. A pole vaulter returned from a doping ban to win with a championship record of 4.25m. Phillips Idowu set a new championship record in the men's triple jump with a world-leading 17.30m. In the long jump, Commonwealth champion Nathan Morgan won with a personal best of 7.96m, while Chris Tomlinson finished second. A 21-year-old sprinter won the women's 400m in 53.45 seconds, just short of the qualifying mark. Ireland's representative took the men's 400m title in 46.46 seconds. The women's high jump winner cleared 1.90m to qualify for the European Championships. The men's 3,000m champion set a personal best of 7:56.86, breaking the eight-minute barrier for the first time in 11 years. The women's 1500m title was won in 4:19.11, though the time was not enough for European qualification. The men's 1500m winner secured victory in 3:45.87 after fending off a closing pack.", "reference": "also set a new championship mark in the men's triple jump title in Sheffield.\"I was advised not to jump by my doctor and so I'm pleased to come here and get the qualifying mark,\" said Tomlinson.It was the first time in 11 years the eight-minute barrier has been broken at the championships and was just within the European mark.cleared the required 1.90m to qualify for the European championships and claim the AAAs title in the women's high jump.The 21-year-old ran a personal best of 53.45 seconds to win her first indoor title.In the men's 3,000m,  powered to a new personal best of seven minutes, 56.86 seconds to defend his AAAs title in style.The men's race was won by  , who had to fight off a closing pack to claim the title in 3:45.87.Wall's time was just short of the qualifying mark - something Murphy already has.Gardener's performance in Sheffield could have been affected by the news, which he heard before his semi-final, that his European record had been broken Frenchman Ronald Pognon, who will be a real threat at the European Championships, set a new time of 6.45, one-hundreth of a second faster than Gardener's previous mark.Claxton's time was also good enough to qualify for the European Championships.could not reach the European mark in the women's race as she crossed the line to win in 2:04.45.Her time of 4:19.11 was not good enough to qualify for Madrid but Ovens had already opted out of the championships.The 25-year-old set a new British record for the second time in seven days, clocking 7.96 seconds to finish ahead of rival Diane Allahgreen.Katherine Endacott battled hard to take second and dip under the European qualifying mark.Both McIlory and Watkins, who set a life-time best of 1:48.32, had already booked their places in Madrid and were again well within the qualifying time.took the women's 1500m AAAs title in the absence of Kelly Holmes.\"You'll see me in Madrid and I feel there is a lot more to come along,\" said the 22-year-old.The world 60m champion got off to a rolling start and had to dig deep to dip ahead of Mark Findlay and Darren Chin, who both set personal bests.Jason Gardener fought all the way to the line to narrowly claim the men's 60m title at the Norwich Union Indoor trials and AAAs Championships."}