{"raw_text": "McIlroy wins 800m indoor title\n \n James McIlroy motored to the AAA's Indoor 800m title in Sheffied on Sunday in a time of one minute, 47.97 seconds.\n \n The Larne athlete dominated the race from start to finish although he had to hold off a late challenge from Welshman Jimmy Watkins in the final 100 metres. \"I had to go out and go through all the gears before the Europeans and I won't run again until then,\" said McIlroy. ''I though if I got lucky I'd get close to the British record but I blew up in the end.'' McIlroy has been in superb form at the start of the season and will now start his build-up for the European Indoors at Madrid on 4-6 March. Meanwhile, Paul Brizzel and Anna Boyle reached the semi-finals of the 60m hurdles with Boyle setting a season's best of 7.48. In the women's 60m final, Ailis McSweeney broke Michelle Carroll's long-standing Irish record by clocking 7.37 which left her in third place. David Gillick showed that he is a genuine medal contender in the European Indoor Championships by claiming an impressive 400m victory. Gillick was more than half-a-second clear when taking gold in 46.45 - .02 outside his personal best set in Saturday's semi-finals.\n \n The Irishman is now the fastest European this season. Derval O'Rourke broke her own Irish 60m hurdles record by clocking 8.06 which left her third behind new British record holder Sarah Claxton (7.96). James Nolan (3:46.04) took second in the men's 1500m behind Neil Speaight (3:45.86) but the Offaly man was outside the European Indoor standard. Colin Costello was seventh in the 1500m final in 3:48.82). Deirdre Ryan was second in the women's high jump with a clearance of 1.87m while Aoife Byrne took silver in the 800m in a personal best of 2:06.73. Lisburn's Kelly McNeice Reid (4:31.34) was seventh in the women's 1500m while Gary Murray (8:11.22) was 11th in the men's 3000m. Meanwhile, Stephen Cairns and Jill Shannon claimed the individual titles at Saturday's Northern Ireland Cross Country Championship in Coleraine. Cairns came in ahead of Paul Rowan and Allan Bogle in the men's race. Willowfield claimed their first men's team title in 72 years while Shannon helped Lagan Valley win the women's team honours.\n", "llama3.2:1b": "James McIlroy won the AAA indoor 800m title with a time of one minute, 47.97 seconds.\n\nMcIlroy dominated the competition from start to finish but held off Jimmy Watkins' late challenge in the final 100 meters.\n\nThe Irishman will continue building up his fitness for the European Indoors at Madrid on March 4-6.\n\nOther top performances included:\n\n* Paul Brizzel and Anna Boyle reaching semi-finals of the 60m hurdles\n* Ailis McSweeney breaking her own record in the women's 60m final with a time of 7.37 seconds.\n* David Gillick winning an impressive gold medal in the European Indoor Championships by 400m, which is his first victory this season.\n\nOther top performances included:\n\n* Derval O'Rourke breaking her own record in the 60m hurdles\n* Sarah Claxton setting a new British record in the women's 60m final.\n* James Nolan finishing second in the men's 1500m behind Neil Speaight.", "llama3.2:3b": "James McIlroy won the AAA Indoor 800m title with a time of one minute, 47.97 seconds, ahead of Jimmy Watkins. David Gillick took gold in the 400m with a time of 46.45 seconds. Derval O'Rourke broke her Irish 60m hurdles record with an 8.06 second clocking.", "gemma2:2b": "James McIlroy won the AAA's Indoor 800m title, setting a personal best of 1:47.97 seconds.  David Gillick took gold in the men's 400m. Ailis McSweeney broke Michelle Carroll's Irish record in the women's 60m final. Derval O'Rourke broke her own Irish 60m hurdles record, and Sarah Claxton set a new British record.  Stephen Cairns won the men's cross country title, and Jill Shannon helped Lagan Valley win the women's team title. \n", "qwen2.5:0.5b": "James McIlroy won the AAA indoor 800m title with a time of one minute, 47.97 seconds on Sunday. He dominated his race and held off an early challenge from Jimmy Watkins in the final 100 metres. McIlroy was in excellent form at the start of the season and will participate in the European Indoor Championships starting March 4-6. Meanwhile, other Irish athletes made their mark: Derval O'Rourke became the fastest European this season with a time of 8.06 in the 60m hurdles; Colin Costello claimed the bronze medal in the 1500m final; Deirdre Ryan finished second in the women's high jump, clearing 1.87 meters while Aoife Byrne took silver in the 800m in a personal best of 2:06.73; Alison Miller won the women's long-distance race at the Northern Ireland Cross Country Championship in Coleraine with Willowfield claiming their first men's team title in 72 years and Shannon helped Lagan Valley win the women's team honours.", "qwen2.5:1.5b": "James McIlroy wins AAA Indoor 800m title; other athletes achieve personal bests or advance to semi-finals at Northern Ireland Athletics Championships.", "qwen2.5:3b": "James McIlroy won the AAA's Indoor 800m title with a time of 1:47.97, dominating the race from start to finish and holding off late challenge from Jimmy Watkins. He will now prepare for European Indoors in Madrid. Paul Brizzel and Anna Boyle reached semi-finals in the 60m hurdles, with Boyle setting her season best at 7.48. Ailis McSweeney broke Michelle Carroll's Irish record in the women's 60m final with a time of 7.37. David Gillick won the European Indoor Championships' 400m race with a personal best time of 46.45, leaving him as a genuine medal contender. Derval O'Rourke set her own Irish record in the women's 60m hurdles with an 8:06 effort. James Nolan took second place in men's 1500m and Colin Costello was seventh in the same event. Deirdre Ryan won the women's high jump, while Aoife Byrne took silver in the 800m race with a personal best time of 2:06.73. In cross country championships, Stephen Cairns claimed an individual title, helping Lagan Valley win the women's team title under Jill Shannon.", "opencoder:1.5b": "McIlroy wins the 800m Indoor title.\n\nJames McIlroy motored to the AAA's Indoor 800m title in Sheffield on Sunday. He took a minute and 47.97 seconds to complete his race. The Larne athlete dominated the race, but he was forced to hold off a late challenge from a Welshman Jimmy Watkins in the final 100 metres.\n\nMcIlroy said, \"I had to go out and go through all the gears before the Europeans. I thought if I got lucky I'd get close to the British record but I blew up in the end.\" He has been in top form since the season began and plans to continue his build-up for the European Indoor Championships at Madrid on 4-6 March.\n\nPaul Brizzel and Anna Boyle reached the semi-finals of the 60m hurdles. They set a season's best of 7.48.\n\nAilis McSweeney broke her Irish record in the European Indoor Championships by clocking 7.37 which ended her in third place.\n\nDavid Gillick showed that he is a genuine medal contender for the European Indoor Championships by claiming an impressive 400m victory. Gillick was more than half-a-second clear when taking gold in 46.45 - .02 outside his personal best set in Saturday's semi-finals.\n\nThe Irishman is now the fastest European this season and Derval O'Rourke broke her own record by clocking 8.06 which left her third behind new British record holder Sarah Claxton (7.96).\n\nJames Nolan took second place in the men's 15,000m race with Neil Speaight, but the Offaly man was outside the European Indoor standard.\n\nColin Costello was seventh in the women's high jump with a clearance of 1.87m while Aoife Byrne took silver in the 800m race with a personal best of 2:06.73.\n\nLisburn's Kelly McNeice Reid, who was seventh in the women's 15,000m final, came ahead of Gary Murray (8:11.22) in the men's race.\n\nWillowfield claimed their first team title in 72 years while Shannon helped Lagan Valley win the women's team honours.\n\nStephen Cairns and Jill Shannon also claimed the individual titles at Saturday's Northern Ireland Cross Country Championship, placing them ahead of Paul Rowan and Allan Bogle.\n", "smollm:1.7b": "The summary should be:\n\nMcIlroy won 800m indoor title with time of 47.97 seconds. James McIlroy motored to the AAA's Indoor 800m title in Sheffied on Sunday in a time of one minute, 47.97 seconds. The Larne athlete dominated the race from start to finish although he had to hold off a late challenge from Welshman Jimmy Watkins in the final 100 metres. \"I had to go out and go through all the gears before the Europeans and I won't run again until then,\" said McIlroy. \"I though if I got lucky I'd get close to the British record but I blew up in the end.\" McIlroy has been in superb form at the start of the season and will now start his build-up for the European Indoors at Madrid on 4-6 March. Meanwhile, Paul Brizzel and Anna Boyle reached the semi-finals of the 60m hurdles with Boyle setting a season's best of 7.48. In the women's 60m final, Ailis McSweeney broke Michelle Carroll's long-standing Irish record by clocking 7.37 which left her in third place. David Gillick showed that he is a genuine medal contender in the European Indoor Championships by claiming an impressive 400m victory. Gillick was more than half-a-second clear when taking gold in 46.45 - .02 outside his personal best set in Saturday's semi-finals. In the women's high jump, Colin Costello was seventh in the 1500m behind Neil Speaight (3:46.04) but the Offaly man was outside the European Indoor standard. Colin Costello was seventh in the 1500m final in 3:48.82).\n\nThe summary should be concise and easy to understand, using simple language and avoiding technical terms or jargon.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the provided text into a concise summary. Let me read through it carefully.\n\nThe text is about two men who won some international cross-country races. James McIlroy won the 800m indoor title in Sheffied on Sunday, finishing at one minute forty-seven and ninety-seven seconds. He dominated the race except for a late challenge from Jimmy Watkins in the final 100 meters.\n\nThen, Paul Brizzel and Anna Boyle qualified for the semi-finals of the 60m hurdles with Boyle setting their season's best. Ailis McSweeney broke Michelle Carroll's record in the women's 60m final, clocking seven seconds and three hundred seventy milliseconds, leaving her third. David Gillick secured his European Indoor Championships victory with a impressive 400m race, four and a half seconds clear. He was more than half a second ahead of his personal best.\n\nThe Irishman is the fastest European this season, holding Derval O'Rourke's 60m record at eight seconds and seven hundredths, but she's still third behind Sarah Claxton. James Nolan came second in the men's 1500m with Neil Speaight slightly behind his personal best. The Offaly athlete was outside the European Indoor standard. Colin Costello finished seventh in the 1500m final at 3:48 and eight hundred twenty milliseconds, scoring third. Deirdre Ryan was second in the women's high jump with a clearance of one meter eighty-seven centimeters. Aoife Byrne secured the silver in the 800m with a personal best of two minutes sixty-six seconds. Lisburn's Kelly McNeice Reid came seventh, and Gary Murray finished eleventh in the men's 3000m.\n\nMeanwhile, Stephen Cairns and Jill Shannon won individual titles at the Northern Ireland Cross Country Championship in Coleraine. They placed second to Paul Rowan and Allan Bogle in the men's race, though there was a gap of one place. Willowfield claimed their first men's team title in 72 years. Shannon helped Lagan Valley win their women's team honours.\n\nI need to extract the key points: McIlroy's victory, his performance details, Brizzel and Boyle qualifying for hurdles, Ailis breaking a record, Gillick winning with 400m, O'Rourke's record, Nolan finishing second, Claxton's position, Berry's high jump, McNeice's finish, Murray's positions in races, and the championship results.\n\nI should make sure to include McIlroy's time, who he was beaten by, Brizzel and Boyle's qualifying, Ailis breaking a record, Gillick winning, O'Rourke's record, Nolan finishing second, Claxton third, Berry's high jump, McNeice's place, Murray's positions in the final two races, and the championship standings.\n\nI need to ensure I capture all these details without getting bogged down by specifics. The summary should be concise but include all key names, times, records, positions.\n</think>\n\nJames McIlroy won the 800m indoor title in Sheffied on Sunday, finishing at one minute forty-seven and ninety-seven seconds. Paul Brizzel and Anna Boyle qualified for the semi-finals of the 60m hurdles with Boyle setting their season's best. Ailis McSweeney broke Michelle Carroll's record in the women's 60m final, clocking seven seconds and three hundred seventy milliseconds, leaving her third. David Gillick secured his European Indoor Championships victory with a 400m race of four and a half seconds clear. The Irishman is the fastest European this season, holding Derval O'Rourke's 60m record at eight seconds and seven hundredths but still third behind Sarah Claxton. James Nolan came second in the men's 1500m with Neil Speaight slightly behind his personal best. Colin Costello finished seventh in the 1500m final at 3:48 and eight hundred twenty milliseconds, scoring third. Deirdre Ryan was second in the women's high jump with a clearance of one meter eighty-seven centimeters. Aoife Byrne secured the silver in the 800m with a personal best of two minutes sixty-six seconds. Lisburn's Kelly McNeice Reid came seventh, and Gary Murray finished eleventh in the men's 3000m. Stephen Cairns and Jill Shannon won individual titles at the Northern Ireland Cross Country Championship in Coleraine, placing second to Paul Rowan and Allan Bogle in the men's race. Willowfield claimed their first men's team title in 72 years while Shannon helped Lagan Valley win the women's team honours.", "tinyllama:1.1b": "The AAA Indoor 800m champion at Sheffield was James McIlroy, who clocked a time of 1:47.97 seconds. He was chased down by Welshman Jimmy Watkins in the final stages, but held off the late challenge to win comfortably. In the women's event, Ailis McSwyeney broke Michelle Carroll's Irish record with a time of 7.37, putting her in third place behind David Gillick's impressive 400m victory in Satuday's semi-finals. The Irishman was the fastest European this season and has now broken his own Irish 60m hurldes record by over half a second. In the men's 1500m, Derval O'Rourk broke her own Irish 60m hurdles record with a time of 3:46.04, which placed third behind Neil Speaigh's world-leading time. Colin Costello was seventh in the men's 1500m final with his clearance of 3:48.82, while Deirdre Ryan took silver in the women's high jump with a clearance of 1.87 meters. Lisburn's Kelly McNeice Reid was seventh in the women's 1500m, while Gary Murray finished ninth in the men's 3000m. In the Northern Ireland Cross Country Championship, Stephen Cairns and Jiill Shannon claimed individual titles with Cairns coming ahead of Paul Rowan and Allan Bogle in the men's race. Lagan Valley won the women's team championship.", "tinydolphin:1.1b": " The European Indoor Championships, a prestigious event in track and field, took place in Sheffield on Sunday. James McIlroy won the men's 800m with a time of one minute, 47.97 seconds, while James Nolan broke the British record with a time of 3:46.04. The Larne athlete dominated the race from start to finish, although he had to hold off a late challenge from Welshman Jimmy Watkins in the final 100 meters. McIlroy will now start his build-up for the European Indoors at Madrid on 4-6 March.", "phi:2.7b": " Irishman David Gillick wins 400m race, breaking European Indoor record, while James McIlroy dominates 800m and won AAA's indoor 800m title in 1:47.97. Paul Brizzel and Anna Boyle reached the semi-finals of 60m hurdles with Ailis McSweeney setting a season's best of 7.37. Irishman Derval O'Rourke clocked 8.06 seconds, breaking her own record to claim third place. Colin Costello was fifth in the men's 1500m and Lisburn' s Kelly McNeice Reid finished seventh in the women's 800m with a personal best of 2:06.73. Stephen Cairns won the men's race while Lagan Valley claimed their first women's team title in 72 years.\n", "orca-mini:3b": " McIlroy wins 800m indoor title, setting a personal best of 1:47.97 in finishing first among other athletes.", "hermes3:3b": "_James McIlroy wins AAA Indoor 800m title_\n_McIlroy beats Watkins in final stretch, sets up for European Indoors at Madrid_", "stablelm-zephyr:3b": "James McIlroy won the AAA's Indoor 800m title in Sheffied, dominating the race from start to finish and finishing with a time of 1:47.97. He will now prepare for the European Indoors event in Madrid on March 4-6. Paul Brizzel and Anna Boyle reached the semi-finals of the 60m hurdles final, while Ailis McSweeney broke Michelle Carroll's Irish record in the women's 60m final. David Gillick claimed gold in the 400m event, becoming the fastest European this season. Derval O'Rourke set a new Irish record in the 60h hurdles, and Colin Costello finished seventh in the 1500m final. Deirdre Ryan and Aoife Byrne had notable performances in high jump and 800m events respectively. Additionally, Stephen Cairns and Jill Shannon won individual titles at Northern Ireland Cross Country Championship for Willowfield and Lagan Valley respectively.", "stablelm2:1.6b": "Northern Irish golfer James McIlroy wins the AAA's Indoor Sheltysan title with a one-minute, 17-second run in Sheffield. Despite being challenged towards the end of the race by Jimmy Watkins, McIlroy maintained his dominance throughout. McIlroy is now targeting the European Indoors at Madrid on March 4-6th. Meanwhile, Paul Brizzel and Anna Boyle reached the semi-finals of the 300m hurdles. In women's sprint final, Ailis McSweeney broke Michelle Carroll's Irish record with a time of 7.2 seconds which earned her third place. Derval O'Rourke also set an Irish record by finishing third after breaking her previous record by clocking 8.2 seconds. The European Indoor Championships saw David Gillick win gold, making him the fastest European this season. James Nolan and Neil Speaight finished second and third respectively in the men's race. Colin Costello was seventh in the men's event while Deirdre Ryan secured second place in women's high jump. Ailis McSweeney took silver with a time of 7.2 seconds, breaking Sarah Claxton's British record by finishing third behind Claxton (7.0 seconds).", "granite3.1-dense:2b": "James McIlroy secured the AAA Indoor 800m title in Sheffield on Sunday, finishing with a time of 1:47.97. He dominated until the final 100 meters when Welsh athlete Jimmy Watkins challenged him. McIlroy, who has been performing well this season, plans to focus on building up for the European Indoors in Madrid (March 4-6).\n\nPaul Brizzel and Anna Boyle advanced to the semi-finals of the 60m hurdles, with Boyle setting a season's best time. Ailis McSweeney broke Michelle Carroll's Irish record in the women's 60m final, placing third at 7.37 seconds.\n\nDavid Gillick claimed victory in the men's 400m with a time of 46.45 seconds, now the fastest European this season. Derval O'Rourke improved her Irish record to 8.06 seconds in the 60m hurdles.\n\nIn other events:\n- James Nolan finished second in the men's 1500m (3:46.04), just outside the European Indoor standard.\n- Deirdre Ryan took second in women's high jump with a clearance of 1.87 meters, while Aoife Byrne secured silver in the 800m (2:06.73).\n- Kelly McNeice Reid was seventh in the men's 1500m and Gary Murray finished 11th in the men's 3000m.\n- Stephen Cairns won the men's race at the Northern Ireland Cross Country Championship, and Jill Shannon helped Lagan Valley win the women's team title.", "chatgpt-4o-latest": "James McIlroy won the AAA's Indoor 800m title in Sheffield with a time of 1:47.97, leading from start to finish despite a late challenge from Jimmy Watkins. McIlroy, in strong early-season form, will now prepare for the European Indoors in Madrid. Other notable performances included David Gillick winning the 400m in 46.45, making him the fastest European this season, and Ailis McSweeney setting a new Irish 60m record at 7.37. Derval O'Rourke broke her own Irish 60m hurdles record with 8.06, finishing third. James Nolan placed second in the men's 1500m but missed the European Indoor standard. Deirdre Ryan and Aoife Byrne secured silver in the women's high jump and 800m, respectively. In cross-country, Stephen Cairns and Jill Shannon won the Northern Ireland Championship, with Willowfield taking their first men's team title in 72 years and Lagan Valley winning the women's team event.", "reference": "James Nolan (3:46.04) took second in the men's 1500m behind Neil Speaight (3:45.86) but the Offaly man was outside the European Indoor standard.Lisburn's Kelly McNeice Reid (4:31.34) was seventh in the women's 1500m while Gary Murray (8:11.22) was 11th in the men's 3000m.Gillick was more than half-a-second clear when taking gold in 46.45 - .02 outside his personal best set in Saturday's semi-finals.In the women's 60m final, Ailis McSweeney broke Michelle Carroll's long-standing Irish record by clocking 7.37 which left her in third place.Deirdre Ryan was second in the women's high jump with a clearance of 1.87m while Aoife Byrne took silver in the 800m in a personal best of 2:06.73.Colin Costello was seventh in the 1500m final in 3:48.82).Derval O'Rourke broke her own Irish 60m hurdles record by clocking 8.06 which left her third behind new British record holder Sarah Claxton (7.96).McIlroy has been in superb form at the start of the season and will now start his build-up for the European Indoors at Madrid on 4-6 March."}