{"raw_text": "Balco case trial date pushed back\n \n The trial date for the Bay Area Laboratory Cooperative (Balco) steroid distribution case has been postponed.\n \n US judge Susan Illston pushed back a preliminary evidentiary hearing - which was due to take place on Wednesday - until 6 June. No official trial date has been set but it is expected to begin in September. Balco founder Victor Conte along with James Valente, coach Remy Korchemny and trainer Greg Anderson are charged with distributing steroids to athletes.\n \n Anderson's clients include Barry Bonds, and several other baseball stars have been asked to appear before a congressional inquiry into steroid use in the major leagues. The Balco defence team have already lost their appeal to have the case dismissed at a pre-trial hearing in San Francisco but will still argue the case should not go to trial. The hearing in June will focus on the admissibility of evidence gathered during police raids on Balco's offices and Anderson's home. Conte and Anderson were not arrested at that point but federal agents did obtain statements from them. The defence are expected to challenge the legality of those interviews and if Ilston agrees she could could reject all the evidence from the raids. Balco has been accused by the United States Anti-Doping Agency (USADA) of being the source of the banned steroid THG and modafinil.\n \n Former double world champion Kelli White and Olympic relay star Alvin Harrison have both been banned on the basis of materials discovered during the Balco investigation. Britain's former European 100m champion Dwain Chambers is currently serving a two-year ban after testing positive for THG in an out-of-competition test in 2003. And American sprinter Marion Jones has filed a lawsuit for defamation against Conte following his allegations that he gave her performance-enhancing drugs.\n", "llama3.2:1b": "The trial date for the Balco case has been postponed due to a preliminary evidentiary hearing scheduled for June 6, which is now expected to start in September. The defense team will argue against going to trial. Former clients of Balco founder Victor Conte and coach Remy Korchemny are expected to testify about police raids on their offices and home.", "llama3.2:3b": "The Bay Area Laboratory Cooperative (Balco) steroid distribution case trial date has been postponed to September, with a preliminary evidentiary hearing set for June 6. Balco founder Victor Conte and others are charged with distributing steroids to athletes including Barry Bonds. The defense will challenge the legality of statements gathered during police raids on Balco's offices and Anderson's home, which could affect the admissibility of evidence.", "gemma2:2b": "The trial date for the Balco steroid distribution case is being pushed back, with a preliminary evidentiary hearing now scheduled for June 6th. The case involves Victor Conte and others who are accused of distributing steroids to athletes.  Anderson, known for training Barry Bonds, faces charges related to his clients' alleged steroid use. The defense aims to challenge the admissibility of evidence gathered during police raids on Balco offices and Anderson's home, potentially leading to a dismissal of the case. \n", "qwen2.5:0.5b": "The trial date of the Bay Area Laboratory Cooperative steroid distribution case is pushed back to June 6, 2018, with no official trial scheduled but set to begin in September. The defendant Balco founder Victor Conte and his defense team have appealed against a preliminary evidentiary hearing held on Wednesday, with Anderson's clients being asked to appear before a congressional inquiry into steroid use in the major leagues, while Conte is expected to argue the case should not proceed to trial.", "qwen2.5:1.5b": "Balco steroid distribution case trial date delayed until September, with initial hearing rescheduled to June. Anderson's clients facing congressional inquiry over steroid use, accused of providing banned substances including THG and modafinil by Balco founder Victor Conte and trainer Greg Anderson. Defense team appeals dismissal at pre-trial hearing in San Francisco but plans to contest evidence admissibility.", "qwen2.5:3b": "The trial date for the Bay Area Laboratory Cooperative (Balco) steroid distribution case has been postponed until June 6th. The preliminary evidentiary hearing originally scheduled on Wednesday was moved to this date. US judge Susan Illston is expected to set an official trial date in September, though none have yet been officially announced. Charges include distributing steroids to athletes for Balco founder Victor Conte and other individuals like James Valente, Remy Korchemny, and Greg Anderson. The defence team has already lost their appeal against dismissal but will still challenge the admissibility of evidence from police raids on Balco's offices and Anderson's home. Evidence gathered includes statements taken from Conte and Anderson without arrest; the defence is expected to contest their legality. USADA accuses Balco of being a source of banned steroids THG and modafinil. Several athletes, including Kelli White and Alvin Harrison, have been banned based on materials from this investigation. Dwain Chambers serves a ban for positive THG test in 2003, while Marion Jones has filed defamation lawsuit against Conte over allegations of performance-enhancing drugs.", "opencoder:1.5b": "The trial date for the Bay Area Laboratory Cooperative (Balco) steroid distribution case has been postponed. US judge Susan Illston pushed back a preliminary evidentiary hearing - which was due to take place on Wednesday - until 6 June. No official trial date has been set but it is expected to begin in September. Balco founder Victor Conte along with James Valente, coach Remy Korchemny and trainer Greg Anderson are charged with distributing steroids to athletes. The defence team have already lost their appeal to have the case dismissed at a pre-trial hearing in San Francisco but will still argue the case should not go to trial. The hearing in June will focus on the admissibility of evidence gathered during police raids on Balco's offices and Anderson's home. Conte and Anderson were not arrested at that point but federal agents did obtain statements from them. The defence are expected to challenge the legality of those interviews and if Ilston agrees she could reject all the evidence from the raids. Balco has been accused by the United States Anti-Doping Agency (USADA) of being the source of the bannedsteroid THG and modafinil. Former double world champion Kelli White and Olympic relay star Alvin Harrison have both been banned on the basis of materials discovered during the Balco investigation. Britain's former European 100m champion Dwain Chambers is currently serving a two-year ban after testing positive for THG in an out-of-competition test in 2003. American sprinter Marion Jones has filed a lawsuit for defamation against Conte following his allegations that he gave her performance-enhancing drugs.\n", "smollm:1.7b": "The trial date for the Bay Area Laboratory Cooperative (Balco) steroid distribution case has been postponed until 6 June. The US judge Susan Illston pushed back a preliminary evidentiary hearing - which was due to take place on Wednesday - until 6 June, no official trial date has been set but it is expected to begin in September. Balco founder Victor Conte along with James Valente, coach Remy Korchemny and trainer Greg Anderson are charged with distributing steroids to athletes.\n \n Anderson's clients include Barry Bonds, and several other baseball stars have been asked to appear before a congressional inquiry into steroid use in the major leagues. The Balco defence team have already lost their appeal to have the case dismissed at a pre-trial hearing in San Francisco but will still argue the case should not go to trial. The hearing in June will focus on the admissibility of evidence gathered during police raids on Balco's offices and Anderson's home. Conte and Anderson were not arrested at that point but federal agents did obtain statements from them. The defence are expected to challenge the legality of those interviews and if Ilston agrees she could reject all the evidence from the raids. Balco has been accused by the United States Anti-Doping Agency (USADA) of being the source of the banned steroid THG and modafinil.\n \n Former double world champion Kelli White and Olympic relay star Alvin Harrison have both been banned on the basis of materials discovered during the Balco investigation. Britain's former European 100m champion Dwain Chambers is currently serving a two-year ban after testing positive for THG in an out-of-competition test in 2003. And American sprinter Marion Jones has filed a lawsuit for defamation against Conte following his allegations that he gave her performance-enhancing drugs.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely by preserving key ideas and details. Let me read through it carefully.\n\nFirst, the main event is Balco's steroid distribution case being pushed back. The date was originally set for Wednesday, June 15, but now it's postponed until June 6. There will be no official trial date yet; it starts in September.\n\nThe suitors include Victor Conte, James Valente, Remy Korchemny, and Greg Anderson. They're charged with distributing steroids to athletes.\n\nAnderson's clients include Barry Bonds and other baseball stars, who are appearing before Congress to investigate steroid use. The defense lost their initial appeal but will still argue the case shouldn't go to trial yet.\n\nThe hearing in June focuses on evidence gathered during police raids on Balco's offices and Anderson's home. Conte and Anderson weren't arrested there; federal agents obtained statements from them. The defence may challenge interviews' legality if Susan Ilston agrees.\n\nBalco is accused of being the source of banned steroids like THG and modafinil by the US Anti-Doping Agency (USADA). They've been banned based on materials found during their investigation, including a test in 2003 where Dwain Chambers tested positive for THG. Jones has a defamation lawsuit filed against Conte.\n\nI need to make sure all these points are covered succinctly without extra details. Let me structure this into a clear summary.\n</think>\n\nBalco's steroid distribution case was pushed back, with the preliminary evidentiary hearing scheduled from June 6 instead of June 15. The trial is expected to begin in September and will focus on evidence gathered during police raids. Balco's clients include Barry Bonds and others, appearing before Congress. Contes are charged with distributing steroids. The hearing in June will examine evidence from raids. Contes were not involved but statements obtained by federal agents were. Balco is accused of being the source of banned THG and modafinil by USADA. Contes have a defamation lawsuit filed against Jones for claims about giving her performance-enhancing drugs, while Anderson was banned in 2003 due to a test result.", "tinyllama:1.1b": "The Balco steroid distribution case has been postponed due to a change in trial date. The preliminary evidentiary hearing, which was scheduled for this week, will now take place on June 6th instead of Wednesday as originally planned. The reason for the delay is that US judge Susan Illston pushed back the hearing until September to allow Balco founder Victor Conte and his co-defendants James Valentine, coach Remy Korchemny, and sports trainer Greg Anderson the opportunity to appeal their case in court. They have already lost their appeal at a pretrial hearing in San Francisco but will now argue that none of the evidence gathered during police raids on Balco's offices and Anderson's home should be admitted into the case. In addition, former double world champion Kelli White and Olympic relay star Alvin Harrison were also banned by USAADA based on materials discovered during the investigation. And American sprinter Marion Jones filed a lawsuit against Conte for defamation after he accused him of giving him performance-enhancing drugs.", "tinydolphin:1.1b": " Balco, a laboratory cooperative located in the Bay Area, was scheduled to commence its trial on June 6th. However, an extension of the preliminary evidentiary hearing has been granted, pushing back the actual date of the trial until September 6th. The main charges against Victor Conte, James Valente, and Remy Korchemny involve the distribution of performance-enhancing substances to athletes in the major leagues. Balco founder, Victor Conte, and other defendants, including Barry Bonds and several other baseball stars, have been subpoenaed by a congressional inquiry into steroid use in professional sports. The hearing in June is focused on admissibility of evidence gathered during police raids on Balco's offices and Anderson's home. Conte and Anderson have not been officially arrested but federal agents obtained statements from them. The defense team is expected to challenge the legality of these interviews and if Judge Susan Illston agrees, she could reject all the evidence collected during these raids. Balco has been accused by USADA of being the source of the banned substances THG and modafinil.", "phi:2.7b": " The trial date for the Bay Area Laboratory Cooperative (Balco) steroid distribution case, which includes charges against Balco founder Victor Conte, James Valente, coach Remy Korchemny, and trainer Greg Anderson, has been postponed to June 6th. A preliminary evidentiary hearing was scheduled for Wednesday, but it has now been pushed back until June 6th. The defense team has lost their appeal to have the case dismissed, and no official trial date has been set yet. The hearing will focus on the admissibility of evidence gathered during police raids on Balco's offices and Anderson's home. If the prosecution agrees with the exclusion of this evidence, Conte and Anderson may still argue that the case should not go to trial. Former athletes Kelli White, Alvin Harrison, Dwain Chambers, and Marion Jones have all been banned for performance-enhancing drug use based on materials discovered during the Balco investigation.\n", "orca-mini:3b": " The trial date for the Balco steroid distribution case has been postponed. The judge Susan Illston pushed back a preliminary evidentiary hearing scheduled for Wednesday until June 6th. No official trial date has been set but it is expected to begin in September. Victor Conte, James Valente, Remy Korchemny, and Greg Anderson are charged with distributing steroids to athletes including Barry Bonds. The defence team will argue the case should not go to trial, and they plan to challenge the legality of interviews conducted with them during police raids on Balco's offices and Anderson's home.", "hermes3:3b": "Balco steroid trial date postponed, new evidentiary hearing to 6 June; Balco founders & staff charged with distributing steroids to athletes.", "stablelm-zephyr:3b": "The trial date for the Balco steroid distribution case has been postponed, with a preliminary evidentiary hearing moved to June 6th. The official trial date is expected to begin in September. Balco founder Victor Conte and others are charged with distributing steroids to athletes, including Barry Bonds. The defense team plans to argue that the case should not go to trial, and they will challenge the legality of police interviews obtained during raids on Balco's offices and Anderson's home. The United States Anti-Doping Agency (USADA) accused Balco of being the source of banned steroids THG and modafinil.", "stablelm2:1.6b": "The trial date for the Bay Area Laboratory Cooperative (Balco) steroid distribution case, featuring Balco founder Victor Conte, James Valente, coach Remy Korchemny, and trainer Greg Anderson, has been postponed. The preliminary evidentiary hearing scheduled for June 6th will now be held on September 6th, with no official trial date yet set but likely in September. Clients of Balco's trainer, Greg Anderson, include Barry Bonds and several baseball stars asked to appear before a congressional inquiry into steroid use in the major leagues. The defense team plans to argue that Balco should not go to trial due to the admissibility of evidence gathered during police raids on Balco's offices and Anderson's home; however, if US judge Susan Illston agrees, she could reject all the evidence from the raids. Balco has been accused by the United States Anti-Doping Agency (USADA) of being the source of the banned steroids THG and modafinil.", "granite3.1-dense:2b": "The trial date for the Balco steroid distribution case, involving founder Victor Conte, coach Remy Korchemny (who trains Barry Bonds and other baseball stars), trainer Greg Anderson, and James Valente, has been delayed until at least September. Initially set to begin in June, the preliminary evidentiary hearing was postponed by US Judge Susan Illston on Wednesday. The defence aims to challenge the legality of evidence obtained during police raids on Balco's offices and Anderson's home, which could potentially exclude crucial proof against the accused.\n\nBalco is charged with distributing performance-enhancing drugs, specifically THG and modafinil, according to the US Anti-Doping Agency (USADA). This includes former double world champion Kelli White, Olympic relay star Alvin Harrison, and British athlete Dwain Chambers, who is currently serving a two-year ban. American sprinter Marion Jones has also sued Conte for defamation following his allegations of drug use. A congressional inquiry into steroid use in the major leagues has asked several baseball stars to testify, including Anderson's clients.", "chatgpt-4o-latest": "The trial date for the Balco steroid distribution case has been postponed, with a preliminary evidentiary hearing rescheduled for June 6. No official trial date has been set, but it is expected to begin in September. Balco founder Victor Conte, along with James Valente, coach Remy Korchemny, and trainer Greg Anderson, are charged with distributing steroids to athletes, including Barry Bonds. The defense team has already lost an appeal to dismiss the case but will argue against proceeding to trial. The June hearing will determine the admissibility of evidence from police raids on Balco's offices and Anderson's home, which the defense may challenge. Balco has been accused by USADA of supplying banned substances THG and modafinil. Several athletes, including Kelli White, Alvin Harrison, and Dwain Chambers, have been banned due to the investigation, while Marion Jones has sued Conte for defamation over his doping allegations.", "reference": "The trial date for the Bay Area Laboratory Cooperative (Balco) steroid distribution case has been postponed.Balco has been accused by the United States Anti-Doping Agency (USADA) of being the source of the banned steroid THG and modafinil.The Balco defence team have already lost their appeal to have the case dismissed at a pre-trial hearing in San Francisco but will still argue the case should not go to trial.Balco founder Victor Conte along with James Valente, coach Remy Korchemny and trainer Greg Anderson are charged with distributing steroids to athletes.No official trial date has been set but it is expected to begin in September.Former double world champion Kelli White and Olympic relay star Alvin Harrison have both been banned on the basis of materials discovered during the Balco investigation."}