{"raw_text": "Mido makes third apology\n \n Ahmed 'Mido' Hossam has made another apology to the Egyptian people in an attempt to rejoin the national team.\n \n The 21-year-old told a news conference in Cairo on Sunday that he is sorry for the problems that have led to his exclusion from the Pharaohs since July last year. Mido said: \"There isn't much I have to say today, all there is to say is that I came specially from England to Egypt to rejoin the national team and to apologise for all my mistakes.\" Mido was axed by former coach Marco Tardelli after failing to answer a national call-up, claiming he had a groin injury. But he then played in a friendly for his club AS Roma within 24 hours of a World Cup qualifying match at home to Cameroon last September. Mido added: \"It's not my right to give orders and say when I want to play ... at the same time I will always make sure that I put the national's team's matches as my top priority. \"I feel that the national players are playing with a new spirit as I saw them play against Belgium (Egypt won 4-0 on Wednesday) and I simply want to add to their success. \"I do confess that I was rude to the Egyptian press at times but now I have gained more experience and know that I will never go anywhere without the press's support. \"Many of the international stars like David Beckham and (Zinedine) Zidane had the press opposing them. \"So I'm now used to the fact that the press can be against me at times and I don't have to overreact when this happens. Meanwhile, Egypt FA spokesman Methat Shalaby welcomed the apology and said no one had exerted pressure on Mido to apologise. \"Mido's apology today does not negatively affect Mido in anyway, on the contrary it makes him a bigger star and a role model for all football players,\" Shalaby said. Shalaby earlier said that after an apology Mido would be available for the national side if coach Hassan Shehata chose him. Mido joined Tottenham in an 18-month loan deal near the end of the January transfer window, scoring twice on his debut against Portsmouth.\n", "llama3.2:1b": "Ahmed 'Mido' Hossam has made a third apology to the Egyptian people after being axed from the national team for failing to answer a call-up and subsequently playing in a friendly match without permission. Mido apologized for the problems that led to his exclusion, claiming he was injured and will always prioritize the national team's matches. He also expressed remorse for not giving orders to his club teammates and acknowledged that international stars like David Beckham and Zinedine Zidane had been opposed by the press.", "llama3.2:3b": "Ahmed 'Mido' Hossam has made another apology to the Egyptian people after being excluded from the national team since July last year due to problems including playing for AS Roma despite claiming a groin injury and behaving rudely towards the media.", "gemma2:2b": "Mido apologized to the Egyptian people for his past actions that led to his exclusion from the national team. He hopes to rejoin the team and contribute to their success. The apology did not affect Mido's status in any way and he has the possibility of being included in the next game with the team depending on coach Shehata's decision. \n", "qwen2.5:0.5b": "Egyptian player Ahmed 'Mido' Hossam apologized to Egypt after a recent international call-up request was rejected by former coach Marco Tardelli. Mido played in a friendly game for AS Roma two days later and expressed regret about not playing earlier due to a groin injury. He added that he will always put the national team's matches first, emphasizing his commitment to the Egyptian national squad. Mido recently joined Tottenham, scoring twice in his debut against Portsmouth.", "qwen2.5:1.5b": "Mido, having apologized to Egyptians over their exclusion from the national team due to poor performance and misbehavior, rejoined Egypt's football squad as a role model for up-and-coming players.", "qwen2.5:3b": "Mido Hossam has apologized to Egyptian people and the national team after being dropped by former coach Marco Tardelli for not responding to a call-up due to a claimed groin injury. Despite playing in a friendly match shortly after being omitted from the national team, Mido now claims he will prioritize national team matches. He apologizes for his past behavior towards the press and assures they can no longer affect him negatively. Egypt Football Association (FA) spokesman welcomed his apology without mentioning any pressure to apologize. Mido's availability for the national side is contingent on coach Hassan Shehata's decision, with Mido joining Tottenham in an 18-month loan deal.", "opencoder:1.5b": "Mido makes another apology to Egypt's national team in a situation where he made significant mistakes and made it clear that he would rejoin the team if coach Marco Tardelli chose him.\nThe 21-year-old told a news conference in Cairo on Sunday, his feelings for Egypt were expressed but no specific reason was given. Mido added: \"I am sorry to say that I have made a few mistakes along this journey and I will do my best to meet the expectations set by the national team and the Egyptian people.\"\nMido was excused after making a mistake answering a national call-up, accusing him of having a groin injury. The club played with AS Roma during a World Cup qualifying match last September, and Mido added: \"The country's players are playing well with a new attitude as I saw them play against Belgium. I feel that the football was very friendly and fun to play.\"\nMido's apology today does not negatively affect him in any way. He becomes an asset for all football players, thanks to the press who supported him. Egypt FA spokesman Methat Shalaby said: \"After an apology Mido would be available to serve the national team if coach Hassan Shehata chose him.\" Mido joined Tottenham in a loan deal near the end of January and scored twice on his debut.\n", "smollm:1.7b": "Mido made a third apology to the Egyptian people after making another apology for his mistakes.", "deepseek-r1:1.5b": "<think>\nAlright, let's see what I need to do here. The user has given me a text about Ahmed Mido, a young footballer from Egypt, making an apology for not joining the national team in 2019. They want a concise summary that preserves key ideas and details.\n\nFirst, I'll read through the original text carefully. It's a brief piece by Mido himself, so the summary should reflect his emotional journey. He's apologizing because of past issues and mentions the reasons behind his joining the national team again in 2019 after being excluded. \n\nHe was(axed) by a former coach, which shows he wasn't selected for that call-up. Then he played against Roma, playing despite the pressure. His message is about reuniting with the team and looking forward to their success.\n\nLooking at his statements: he's apologizing, emphasizing no mistakes today and wanting all his actions to contribute to success. He also mentions the press's reactions but adjusts accordingly. The FA spokesman, Shalaby, supports him without any pressure. \n\nHe's used to facing criticism when it matters, so this apology is seen as a boost. Later, he's available for the team if chosen in January. So his new role isn't due to his performance but because of his experiences.\n\nPutting it all together, I need a summary that captures his feelings, his actions, and the aftermath of the apology.\n</think>\n\nMido made an emotional apology about not joining the national team in 2019. He acknowledged past issues, stating he was excluded from the team since July due to personal problems but felt included again upon rejoining after playing for his club AS Roma against a friendly match last September. He expressed gratitude towards the national team's success, mentioning their performances against Belgium and hoping for their continued success. Mido also addressed criticism from the press, using his role in Tottenham's loan deal as an example of how he can face criticism without losing his position. The FA spokesman later acknowledged his apology without pressure, and Mido is now available for the national team if chosen.", "tinyllama:1.1b": "Mido has made another apology to Egyptian people after being axed from the national team by former coach Marco Tardelini for failing to answer a call-up in July last year. The 21-year-old said he came specially from England to join the national team and apologized for his mistakes, adding that he would not seek revenge on the Egyptian press or the national players who supported him. Meanwhile, Egyptian football authority metaphorically welcomed Mido's apology as a positive move by the player, who has been praised in the past for being a role model and making an impact in the national side. The international star was also welcomed by Egypt FA chief Methat Shalaby, with the latter saying that Mido's apology did not affect him negatively and would make him a bigger star if coach Hassan Shehata chooses to include him in the squad.", "tinydolphin:1.1b": " Mido apologizes to Egypt for exclusion from national team\nMido Hossam, a 21-year-old Egyptian footballer who was axed from the national team after he failed to answer a national call-up, has made an apology in Cairo on Sunday. The apology comes as Mido's previous apology for being late for camps and practices was not accepted by Egypt FA. Mido has also said that he will always put his team's matches first and admits to making mistakes during the press conferences.", "phi:2.7b": " Ahmed 'Mido' Hossam made another apology to the Egyptian people in an attempt to rejoin the national team after being excluded since July last year due to a failure to answer a call-up and claims of a groin injury. Mido said he is sorry for all his mistakes and wants to make sure that the national team's matches are always his top priority. He added that he has gained more experience and no longer overreacts when the press opposes him. Egypt FA spokesman Methat Shalaby welcomed Mido's apology and said it would not negatively affect him, but would make him a bigger star and role model for all football players.\n", "orca-mini:3b": " Mido has made another apology to the Egyptian people to rejoin the national team after being axed by former coach Marco Tardelli.", "hermes3:3b": "Mido makes 3rd apology to Egyptian people, expressing regret for exclusion from national team and admitting mistakes.", "stablelm-zephyr:3b": "Mido apologizes to the Egyptian people and the national team after being excluded since July last year. He expresses regret for his mistakes and commits to prioritizing the national team's matches. The Egypt FA spokesperson welcomes the apology and confirms that Mido will be available for the national side if coach Hassan Shehata chooses him.", "stablelm2:1.6b": "Ahmed \"Mido\" Hossam made a third apology to the Egyptian people and attempted to rejoin the national team after failing to answer a call-up due to alleged health issues. Mido apologized for his mistakes and played in a friendly match within hours of a World Cup qualifying match at home to Cameroon last September. He expressed commitment to prioritizing national matches while maintaining good relations with the press. Egypt FA spokesman Methat Shalaby welcomed the apology, stating that it won't negatively affect Mido's reputation as an inspiration for other football players. Mido had previously been suspended by former coach Marco Tardelli due to a failed call-up and playing in a friendly match within hours of another qualifying match.", "granite3.1-dense:2b": "Mido, a 21-year-old Egyptian footballer currently playing for AS Roma, has issued another apology to the Egyptian public in an attempt to rejoin the national team. He expressed regret for his past mistakes, which led to his exclusion from the Pharaohs since July 2018, when he failed to answer a national call-up due to a purported groin injury. Despite this, Mido played in a friendly match for AS Roma shortly after a World Cup qualifying game against Cameroon.\n\nMido acknowledged his past rudeness towards the Egyptian press and gained experience understanding their role in supporting players. He emphasized that he prioritizes national team matches above personal preferences. Upon witnessing Egypt's recent 4-0 victory over Belgium, Mido desired to contribute further to his nation's triumph.\n\nThe Egypt Football Association (EFA) spokesman, Methat Shalaby, welcomed the apology and stated that it enhances Mido's status as a role model for players. Post-apology, Mido would be eligible to join the national team under coach Hassan Shehata's choice.\n\nMido recently joined Tottenham on an 18-month loan deal towards the end of the January transfer window and scored twice in his debut against Portsmouth.", "chatgpt-4o-latest": "Ahmed 'Mido' Hossam issued a third apology to the Egyptian people in hopes of rejoining the national team. Speaking in Cairo, he expressed regret for past mistakes that led to his exclusion since July. Mido was dropped by former coach Marco Tardelli after skipping a national call-up due to a claimed injury but then played for AS Roma shortly after. He acknowledged past conflicts with the press and vowed to prioritize the national team. Egypt FA spokesman Methat Shalaby welcomed the apology, stating it enhanced Mido’s reputation and confirmed his availability for selection by coach Hassan Shehata. Mido recently joined Tottenham on loan, scoring twice on his debut.", "reference": "Shalaby earlier said that after an apology Mido would be available for the national side if coach Hassan Shehata chose him.Mido said: \"There isn't much I have to say today, all there is to say is that I came specially from England to Egypt to rejoin the national team and to apologise for all my mistakes.\"Ahmed 'Mido' Hossam has made another apology to the Egyptian people in an attempt to rejoin the national team.Meanwhile, Egypt FA spokesman Methat Shalaby welcomed the apology and said no one had exerted pressure on Mido to apologise.Mido added: \"It's not my right to give orders and say when I want to play ... at the same time I will always make sure that I put the national's team's matches as my top priority.\"Mido's apology today does not negatively affect Mido in anyway, on the contrary it makes him a bigger star and a role model for all football players,\" Shalaby said."}