{"raw_text": "Hearts 2-1 Livingston\n \n Hearts wrapped up their Scottish Cup quarter-final tie against Livingston with two goals in the first 10 minutes.\n \n Lee Miller scored inside the opening 60 seconds, heading over Colin Meldrum and into the net from a Jamie McAllister free kick. McAllister himself scored the second when he met Saul Mikoliunas' cross at the back post to put the game beyond the visitors. Craig Easton headed in a controversial goal after an hour but Hearts held on. The opening goal came after Gus Bahoken had clumsily fouled Miller 35 yards from goal. McAllister floated the free kick into the Livi box and Miller outjumped the static visiting defence to loop his header from 10 yards over Meldrum. With just 10 minutes on the clock, the home side doubled their lead. Mikoliunas sprinted down the right, crossed to the back post where McAllister raced in to head past Meldrum. Moments later Miller came close to grabbing his second with a first-time drive from 16 yards, which skimmed the bar.\n \n Then McAllister picked up a pass from Stephen Simmons and drove an angled shot from 20 yards narrowly past Meldrum's far post. The impressive Mikoliunas twice went close before half time - a low drive was comfortably gathered by Meldrum and then he curled a left-footed shot past the keeper's right-hand post. Livi manager Richard Gough made three changes at the interval, bringing on defender Goran Stanic, midfielder Gabor Vincze, and striker Ferenc Horvath for Bahoken, Derek Lilley and Mark Wilson. But, in the opening stages of the second period, little changed. However, the West Lothian side gave themselves a lifeline with a controversial goal. Eric Deloumeaux sent Jason Dair away on the right and he tried to give the ball to McPake, who looked to be in an offside position. The Livi striker ignored the pass, however, and Dair ran on to it and played Easton in at the back post and he headed home from close range. The home side called for offside against McPake but referee Alan Freeland ignored their claims and pointed to the centre-circle. Livi went all out for the equaliser. In the 87th minute, Burton O'Brien was hauled back at the edge of the box by Neil MacFarlane, but Dair sent his shot just inches wide.\n \n Gordon, Webster, Miller, Hartley, Neilson, McAllister, Simmons (MacFarlane 64), Berra, Burchill (Wyness 82), Mikoliunas (Cesnauskis 77), Wallace.\n \n Moilanen, Kizys.\n \n Berra, Webster.\n \n Miller 1, McAllister 10.\n \n Meldrum, McNamee, Bahoken (Stanic 45), Deloumeaux, Strong, Dair, Easton, Mark Wilson (Vincze 45), Lilley (Horvath 45), O'Brien, McPake.\n \n McKenzie, Hand.\n \n : Vincze, Horvath.\n \n Easton 60.\n \n 9,796\n \n A Freeland\n", "llama3.2:1b": "Hearts 2-1 Livingston: \n\nHearts scored two goals in the first 10 minutes, with Lee Miller scoring one and Jamie McAllister scoring another. Craig Easton also scored a controversial goal after an hour. \n\nHearts doubled their lead later on by Mikoliunas, who scored from a free kick, and then had a second chance at his goal when MacFarlane was brought back for the 87th minute. \n\nIn the second half, Livingston equalized with Eric Deloumeaux scoring from close range. \n\nHearts made changes in both halves but ultimately held on to win the match.", "llama3.2:3b": "Hearts scored two goals in the first 10 minutes against Livingston in their Scottish Cup quarter-final tie. Lee Miller scored the opening goal from a Jamie McAllister free kick, and McAllister doubled the lead by heading past Colin Meldrum at the back post. Craig Easton scored a controversial equaliser for Livi after an hour, but Hearts held on to win 2-1.", "gemma2:2b": "Hearts won the Scottish Cup quarter-final against Livingston with a 2-1 scoreline. Lee Miller scored twice in the opening ten minutes for Hearts. Livingston scored one goal through Craig Easton (controversially) but were unable to equalize despite late pressure.  The game saw several chances for both sides, and a total of 9,796 spectators attended. \n", "qwen2.5:0.5b": "Hearts beat Livingston 2-1 with two goals in the first 10 minutes. Lee Miller scored and then two more from Mikoliunas. The game was close at half-time when Mikoliunas twice went close. Livi manager Richard Gough made changes, bringing on Goran Stanic, Gabor Vincze, Ferenc Horvath and Derek Lilley. At the end of the second period, Gordon, Webster, Miller, Hartley, Neilson, McAllister, Simmons (MacFarlane 64), Berra, Burchill (Wyness 82), Mikoliunas (Cesnauskis 77), Wallace, Miller 1, McAllister 10, Meldrum, McNamee, Bahoken, Deloumeaux, Dair, Easton, Mark Wilson (Vincze 45), Lilley (Horvath 45), O'Brien, McPake.", "qwen2.5:1.5b": "Hearts won their Scottish Cup quarter-final against Livingston 2-1. McAllister scored twice for Hearts early on and added a header in the second half. Livingston equalized after a controversial goal by Berra but Hearts held on to win.", "qwen2.5:3b": "Hearts won their Scottish Cup quarter-final match against Livingston with a two-goal lead in the first 10 minutes. Lee Miller opened the scoring with an early free kick header and Jamie McAllister scored the second from a back post cross. Saul Mikoliunas assisted both goals. Craig Easton scored controversially after heading in a ball that had been passed offside by Livingston's Jason Dair. Hearts held on despite Livingston's late attempt to equalize. The match attendance was 9,796 with referee Alan Freeland dismissing Livingston's claims of an offside for the goal.", "opencoder:1.5b": "\"Hearts 2-1 Livingston\"\n\n\"Home team scored 2 goals in the first 10 minutes by Lee Miller inside a free kick against Livingston. After the game, Hearts doubled their lead and achieved a double win.\"\n\n\"In the opening stages of the second period, little changed. However, the West Lothian side gave themselves a lifeline with a controversial goal by Eric Deloumeaux sent Jason Dair away on the right and he tried to give the ball to McPake, who looked to be in an offside position. Livi manager Richard Gough made three changes at the interval, bringing on defender Goran Stanic, midfielder Gabor Vincze, and striker Ferenc Horvath for Bahoken, Derek Lilley and Mark Wilson. But, in the opening stages of the second period, little changed.\"\n\n\"Hearts managed to double their lead after a low drive by Meldrum's close pass from 20 yards. The match ended in a win for the home team.\"\n", "smollm:1.7b": "The summary should be: Hearts 2-1 Livingston\n\nIn the first half of the match, Hearts won 4-3 against Livingston. The home side scored two goals in the first 10 minutes and then went on to win 9-7. The visitors had a good chance of winning but were beaten by Hearts' defense.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely. The user provided a football match summary with key details and points. My task is to extract the main ideas without any explanations or additional formatting.\n\nFirst, the game was Hearts vs Livingston in a Scottish Cup quarter-final. Hearts won 2-1 with two goals in the first half. Lee Miller scored early from a free kick, and then McAllister scored his second. Then McAllister had another goal, which was controversial because it went against his own team.\n\nIn the second period, Livi had an offside issue after Eric Deloumeaux's shot. The game ended 2-1 with Heart's goals in the first half and a long-range goal in the second.\n\nI need to include both teams' names, their scoring, key players, and the significance of the goals. I should mention the visitors winning, the substitution changes at halftime, and the controversial goal.\n</think>\n\nHearts 2-1 Livingston  \nHeart team won the game 2-1 after securing two goals in the first half and holding the draw back until halftime when Livi gave up a controversial equalizer.", "tinyllama:1.1b": "After a goalless first half, Hearts broke the deadlock in the opening minutes of the second half to secure a convincing Scottish Cup quarter-final victory against Livingston. Lee Miller's header and Saul Mikoliunas' goal were both scored inside the opening 60 seconds, while Craig Easton headed in an additional goal for good measure. The away side doubled their lead just minutes later, with Goran Stanić and Mark Wilson also scoring for the visitors. However, a controversial goalkeeping error gave Hearts some hope late on, as Mikoliunas headed home to reduce the deficit, before the final whistle brought an end to a thrilling match. With just 10 minutes left on the clock, Miller scored with a first-time strike from outside the box and McAllister added a second with a header off a free kick. Livingston made three changes in the second half, bringing on defenders Goran Stanić and Mark Wilson for Jason Dair and Eric Deloumeaux, but it was not enough to stem Hearts' dominance as they secured a 3-1 victory.", "tinydolphin:1.1b": " The game ended in a 2-1 victory for Hearts with Lee Miller scoring two goals and Craig Easton netting the third. Both managers praised their teams after the match. Colin Meldrum's men were at the wrong end of the table while Hearts, who had secured a quarter-final tie against Livingston, played their best football in the first half. The visitors took the lead with two goals inside the opening 10 minutes, but Hearts fought back to equalize and eventually win 2-1.", "phi:2.7b": " In the Scottish Cup quarter-final match between Hearts and Livingston, Lee Miller scored two goals in the first 10 minutes to put the home side ahead. Despite a controversial goal from Livi, Hearts held on for victory with another goal by Mike McAllister. The match was decided by penalty kicks after a disputed goal, which Livingston won.\n", "orca-mini:3b": " Hearts won the Scottish Cup quarter-final tie against Livingston with two goals in the first 10 minutes. Lee Miller scored inside the opening 60 seconds, heading over Colin Meldrum and into the net from a Jamie McAllister free kick. Gus Bahoken clumsily fouled Miller 35 yards from goal, and McAllister floated the free kick into the Livi box where Miller outjumped the static visiting defence to loop his header from 10 yards over Meldrum. Then McAllister picked up a pass from Stephen Simmons and drove an angled shot from 20 yards narrowly past Meldrum's far post. Livi manager Richard Gough made three changes at the interval, bringing on defender Goran Stanic, midfielder Gabor Vincze, and striker Ferenc Horvath for Bahoken, Derek Lilley and Mark Wilson. However, in the opening stages of the second period, little changed. The home side gave themselves a lifeline with a controversial goal. Eric Deloumeaux sent Jason Dair away on the right and he tried to give the ball to McPake, who looked to be in an offside position. The Livi striker ignored the pass, however, and Dair ran on to it and played Easton in at the back post and he headed home from close range. Hearts called for offside against McPake but referee Alan Freeland ignored their claims and pointed to the centre-circle. Livi went all out for the equaliser. In the 87th minute, Burton O'Brien was hauled back at the edge of the box by Neil MacFarlane, but Dair sent his shot just inches wide.", "hermes3:3b": "Hearts won the Scottish Cup quarter-final against Livingston 2-1. Hearts scored two goals within the first 10 minutes.", "stablelm-zephyr:3b": "Hearts won 2-1 against Livingston in the Scottish Cup quarter-final tie, scoring two goals within the first 10 minutes. Lee Miller and Jamie McAllister each scored one goal, with a controversial goal from Craig Easton coming later in the match. Hearts held on to their lead despite Livi's efforts for an equalizer.", "chatgpt-4o-latest": "Hearts secured a 2-1 victory over Livingston in their Scottish Cup quarter-final, scoring twice in the first 10 minutes. Lee Miller opened the scoring within the first minute, heading in from a Jamie McAllister free kick. McAllister then doubled the lead, heading in a cross from Saul Mikoliunas. Hearts dominated the first half, with Miller and McAllister both coming close to adding more goals. Livingston made three substitutions at halftime but struggled to change the game. They pulled one back controversially in the 60th minute when Craig Easton headed in after Jason Dair's pass, despite offside claims. Livingston pushed for an equalizer, with Burton O'Brien coming close in the 87th minute, but Hearts held on to advance.", "stablelm2:1.6b": "Hearts defeated Livingston 2-1 in a Scottish Cup quarter-final match after Lee Miller scored the first goal just seconds into the game and Jamie McAllister added another from a cross by Saul Mikoliunas. Craig Easton's header brought a contentious goal from an own goal, but Hearts held on to their lead. The game remained goalless for most of the second half until Livi gave themselves hope with a questionable goal from Eric Deloumeaux. Hearts attempted an equalizer multiple times throughout the match but ultimately secured their victory.", "granite3.1-dense:2b": "In the Scottish Cup quarter-final match between Hearts and Livingston, Hearts secured a 2-1 victory with two goals within the first ten minutes. Lee Miller scored just six seconds in, heading Jamie McAllister's free kick over goalkeeper Colin Meldrum. McAllister then doubled the lead by nodding home from Saul Mikoliunas' cross at the back post. Craig Easton controversially scored for Livingston in the 60th minute after a challenge by Gus Bahoken, heading the ball past Meldrum. Despite Livingston's efforts to reduce the deficit and score an equalizer with three substitutes, including offside calls that went unchallenged, Hearts held on to win, with 9,796 spectators in attendance. The match ended with goals from Miller (1) and McAllister (10).", "reference": "Meldrum, McNamee, Bahoken (Stanic 45), Deloumeaux, Strong, Dair, Easton, Mark Wilson (Vincze 45), Lilley (Horvath 45), O'Brien, McPake.The Livi striker ignored the pass, however, and Dair ran on to it and played Easton in at the back post and he headed home from close range.Miller 1, McAllister 10.Mikoliunas sprinted down the right, crossed to the back post where McAllister raced in to head past Meldrum.McAllister floated the free kick into the Livi box and Miller outjumped the static visiting defence to loop his header from 10 yards over Meldrum.Gordon, Webster, Miller, Hartley, Neilson, McAllister, Simmons (MacFarlane 64), Berra, Burchill (Wyness 82), Mikoliunas (Cesnauskis 77), Wallace.The opening goal came after Gus Bahoken had clumsily fouled Miller 35 yards from goal.Lee Miller scored inside the opening 60 seconds, heading over Colin Meldrum and into the net from a Jamie McAllister free kick.McAllister himself scored the second when he met Saul Mikoliunas' cross at the back post to put the game beyond the visitors.Craig Easton headed in a controversial goal after an hour but Hearts held on.The home side called for offside against McPake but referee Alan Freeland ignored their claims and pointed to the centre-circle.The impressive Mikoliunas twice went close before half time - a low drive was comfortably gathered by Meldrum and then he curled a left-footed shot past the keeper's right-hand post."}