{"raw_text": "Robben sidelined with broken foot\n \n Chelsea winger Arjen Robben has broken two metatarsal bones in his foot and will be out for at least six weeks.\n \n Robben had an MRI scan on the injury, sustained during the Premiership win at Blackburn, on Monday. \"Six weeks is the average time to heal this injury and then I need a few more weeks to be completely fit again,\" he told Dutch newspaper Algemeen Dagblad. \"I had a feeling it was serious but because of the swelling it was impossible to make a final diagnosis.\" The 21-year-old missed the first three months of the season with a similar injury after a challenge with Roma's Olivier Dacourt. And he added: \"It felt different then last summer when I had the same injury on my other foot. \"Then I could walk already after three days but I stayed sidelined for a long period. I hope that it will now take me six to eight weeks.\" Chelsea physio Mike Banks was hopeful that Robben could return at some point in March. \"The fractures are tiny and he could be playing next month,\" Banks told the club's website. \"One is a chip on the side of his foot, the other is a small break on the third metatarsal. \"But this is not the traditional metatarsal that has become so famous since the last World Cup and which has kept Scott Parker out for two months.\"\n \n David Beckham suffered a broken metatarsal in the build up to the 2002 World Cup in Korea and Japan. Robben, who has been a key part of the Blues' push for four trophies, claims he knew instantly something was wrong when he was felled by Blackburn midfielder Aaron Mokoena. \"I felt my leg go,\" he said. \"I felt it straight away after Mokoena hit me with a wild kick on my left foot.\"\n", "llama3.2:1b": "Arjen Robben has broken two metatarsal bones in his foot and will be out for at least six weeks. He had an MRI scan, which confirmed the injury, and is likely to miss at least three months of Chelsea's season. The 21-year-old missed the first month due to a similar injury last summer.", "llama3.2:3b": "Arjen Robben broke two metatarsal bones in his foot during the Premiership win at Blackburn and will be out for at least six weeks. He previously missed three months of the season with a similar injury to this one, but hopes it will take him six to eight weeks to recover this time. Chelsea physio Mike Banks believes Robben could return in March, citing tiny fractures that may allow for quicker recovery.", "gemma2:2b": "Arjen Robben has broken two metatarsal bones in his left foot and will be out for at least six weeks. He expects to need several more weeks to fully recover.  The injury occurred during Chelsea's match against Blackburn, and while the fractures are small, he will miss significant time due to its severity. \n", "qwen2.5:0.5b": "Robben sustained metatarsal fractures in his foot during a Premiership win against Blackburn and will be out for six weeks. Chelsea physio Mike Banks has been hopeful Robben could return at some point in March. David Beckham had suffered a broken metatarsal injury in the build-up to the 2002 World Cup in Korea and Japan, though he is not known to have ever played professional rugby league.", "qwen2.5:1.5b": "Arjen Robben, Chelsea winger, has sustained broken metatarsal bones in his foot and will be sidelined for at least six weeks. The injury occurred during a Premiership match against Blackburn. Robben missed the first three months of the season due to a similar injury. Banks expects him to return after March with the fractures healing in about four to eight weeks.", "qwen2.5:3b": "Robben, Chelsea winger, has broken two metatarsal bones in his foot and will miss at least six weeks. The injury occurred during a Premiership win against Blackburn. Robben had missed the first three months of the season due to a similar injury. Chelsea physio Mike Banks hopes Robben could return by March. Beckham suffered a broken metatarsal before the 2002 World Cup, which kept Scott Parker out for two months. Robben knew instantly something was wrong when Mokoena kicked him in the left foot.", "opencoder:1.5b": "Robben sidelined with broken foot.\n\nChelsea winger Arjen Robben has broken two metatarsal bones in his foot and will be out for at least six weeks.\n\nHe had an MRI scan on the injury, sustained during the Premiership win at Blackburn, on Monday. \"Six weeks is the average time to heal this injury and then I need a few more weeks to be completely fit again,\" he told Algemeen Dagblad. He had a feeling it was serious but because of the swelling it was impossible to make a final diagnosis.\n\nThe 21-year-old missed the first three months of the season with a similar injury after a challenge with Roma's Olivier Dacourt. He added: \"It felt different then last summer when I had the same injury on my other foot. Then I could walk already after three days but I stayed sidelined for a long period. I hope that it will now take me six to eight weeks.\" \n\nChelsea physio Mike Banks was hopeful that Robben could return at some point in March. \"The fractures are tiny and he could be playing next month,\" Banks told the club's website. \"One is a chip on the side of his foot, the other is a small break on the third metatarsal.\"\n", "smollm:1.7b": "Robben suffered two broken metatarsals in the build-up to the 2002 World Cup, and will be out for at least six weeks. He had an MRI scan on Monday and was told he needed a few more weeks to be completely fit again. Robben also missed the first three months of the season with a similar injury after a challenge with Roma's Olivier Dacourt. And he added: \"It felt different then last summer when I had the same injury on my other foot.\" Then he could walk already after three days but he stayed sidelined for a long period. He hopes that it will now take him six to eight weeks. Chelsea physio Mike Banks was hopeful that Robben could return at some point in March. \"The fractures are tiny and he could be playing next month,\" Banks told the Blues' website. \"One is a chip on the side of his foot, the other is a small break on the third metatarsal.\" But this is not the traditional metatarsal that has become so famous since the last World Cup and which has kept Scott Parker out for two months.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text into a concise summary. Let's read through the entire content first to understand all the key points.\n\nThe main characters mentioned are Robben sidelined with a broken foot and Chelsea winger Arjen Robben who had an MRI scan on his injury. The MRI showed it was serious and he would be out for six weeks or more. He missed the first three months of the season after a challenge against Roma's Olivier Dacourt.\n\nAlso, there's mention of Robben having a broken metatarsal, which is similar to the famous Scott Parker injury but much smaller. He felt different from last summer and might return in March when he could play next month, with other breaks on his foot.\n\nNow, I should extract the key points: Robben is out for six weeks, had an MRI showing it's serious, missed three months, was out due to beating Dacourt, and now expects a chance to come back by March. Also, Robben's metatarsal injury might have been noticed when he fell in Korea during the World Cup.\n\nI need to make sure I include all these points but keep it concise. Maybe start with Robben's sidelined, then the MRI details, the time out, who caused the injury, and his hopes for return.\n</think>\n\nRobben is sidelined with a broken foot after missing at least six weeks due to a serious injury detected during an MRI scan. He missed the first three months of the season after a challenge against Roma's Olivier Dacourt and was out indefinitely before being re-injured on October 16, 2023. Robben had an MRI showing it as a minor recurrence, similar to Scott Parker but smaller. He felt a different injury compared to last summer when he had the same issue on his other foot. He expects to return in March after experiencing a broken metatarsal during a World Cup challenge in Korea.", "tinyllama:1.1b": "A prominent AI assistant has provided an exclusive summary of the latest news and updates regarding Liverpool FC's star player, Roberto Firmino. The summary highlights the Brazilian's return to training after receiving treatment for an injury sustained during a game against Manchester United. It also mentions that Firmino is expected to be back in action within six weeks or so. The article provides detailed information on the nature of the injury and how it affected Firmino's progress, as well as mentioning that he has undergone further tests and is now awaiting a final diagnosis. The summary concludes by stating that Firmino will have to wait for several weeks before returning to full training, but Liverpool FC's manager, Jurgen Klopp, remains hopeful that the star player will be back in action soon.", "tinydolphin:1.1b": " Robben, a highly talented winger for Chelsea, suffered an injury to his right foot that will keep him out until at least the end of March. The Dutchman broke two bones in his foot during the game against Blackburn on Monday, which required an MRI scan and subsequently led to his inability to train or play throughout the recovery process. This is a significant setback for Chelsea, who have missed Robben's presence in the squad for their recent matches. In addition to dealing with his injury, Robben will need to undergo further examinations and rehabilitation in order to fully recover and regain his form.", "phi:2.7b": " Chelsea winger Arjen Robben has suffered a broken foot and will be out for six weeks, according to the newspaper Algemeen Dagblad. The injury was sustained during the Premiership win at Blackburn and is caused by two small breaks on his third metatarsal bone. This is not the first time he has had this injury - it happened last season after he broke a similar bone in his other foot.\n", "orca-mini:3b": " Robben sidelined with broken foot, sustained an MRI scan on the injury after being felled by Blackburn midfielder Aaron Mokoena during the Premiership win at Blackburn. He will be out for at least six weeks and hopes to return in March. David Beckham suffered a broken metatarsal in the build up to the 2002 World Cup in Korea and Japan.", "hermes3:3b": "Arjen Robben broken 2 metatarsal bones, foot injury will keep him out for at least 6 weeks.", "stablelm-zephyr:3b": "Chelsea winger Arjen Robben broke two metatarsal bones in his foot and will be out for at least six weeks. He had an MRI scan, which showed tiny fractures—one on the side of his foot and another small break on the third metatarsal. The injuries are different from the ones that kept Scott Parker out for two months during the last World Cup. Robben's recovery time is estimated to be around six to eight weeks. Chelsea's physio, Mike Banks, hopes he can return to play in March. The 21-year-old player revealed he knew something was wrong immediately after being felled by Blackburn midfielder Aaron Mokoena during a match.", "chatgpt-4o-latest": "Chelsea winger Arjen Robben has broken two metatarsal bones in his foot and will be sidelined for at least six weeks. The injury occurred during a Premiership match against Blackburn, and an MRI confirmed the fractures. Robben, who previously missed three months with a similar injury, hopes to recover within six to eight weeks. Chelsea physio Mike Banks is optimistic about a return in March, noting the fractures are minor. Robben sustained the injury after a challenge from Blackburn's Aaron Mokoena and immediately sensed something was wrong.", "stablelm2:1.6b": "Chelsea winger Arjen Robben has broken two metatarsal bones and will be sidelined for six weeks due to an injury sustained during the Premiership win at Blackburn. This is similar to his previous injury in 2010 when he missed three months of the season with a similar injury after a challenge with Olivier Dacourt. The average time to heal this injury is six to eight weeks, and Robben hopes for a similar recovery period. Chelsea physio Mike Banks is hopeful that Robben could return towards the end of March.", "granite3.1-dense:2b": "Arjen Robben, Chelsea's 21-year-old winger, has sustained two fractured metatarsal bones in his foot during the match against Blackburn. The injury, which occurred after a tackle by Aaron Mokoena, was diagnosed via an MRI scan on Monday. Robben anticipates being out for at least six weeks due to swelling, but the club's physio, Mike Banks, is optimistic he could return by March. This isn't his first metatarsal injury; he previously missed three months of the 2010-2011 season with a similar issue. Robben, a crucial player in Chelsea's pursuit of multiple titles, felt immediate pain upon being tackled. The fractures are described as minor, unlike those that sidelined Scott Parker for two months following his injury at the 2006 World Cup.", "reference": "Chelsea winger Arjen Robben has broken two metatarsal bones in his foot and will be out for at least six weeks.And he added: \"It felt different then last summer when I had the same injury on my other foot.Chelsea physio Mike Banks was hopeful that Robben could return at some point in March.Robben, who has been a key part of the Blues' push for four trophies, claims he knew instantly something was wrong when he was felled by Blackburn midfielder Aaron Mokoena.\"But this is not the traditional metatarsal that has become so famous since the last World Cup and which has kept Scott Parker out for two months.\"\"I felt it straight away after Mokoena hit me with a wild kick on my left foot.\"Robben had an MRI scan on the injury, sustained during the Premiership win at Blackburn, on Monday."}