{"raw_text": "Giggs handed Wales leading role\n \n Ryan Giggs will captain Wales as he wins his 50th cap in Wednesday's friendly against Hungary in Cardiff.\n \n John Toshack, in his first game as coach after succeeding Mark Hughes, admits he is surprised that Giggs has only just reached the landmark. \"With the games he's played for United, proportionately it doesn't seem that many for Wales,\" Toshack said. \"But he's one of the greatest of all Welsh internationals and on his 50th cap it's appropriate he's captain.\" Giggs admits he had briefly considered retirement from the international game, but is now targetting playing for Wales in the 2008 European Championships. The Manchester United wing revealed how club manager Sir Alex Ferguson talked him into extending his Wales career. \"I briefly discussed my international future with Sir Alex, but he urged me to carry on,\" Giggs said. \"He feels, like myself, that I have no weight problems and keep myself fit, so in three or four years' time I will be able to play in the European finals if we get there. \"The manager has always wanted me to play for my club and country and he was keen for me to continue because I am fit enough.\"\n \n Giggs admits he was wavering and considering joining the likes of former Wales skipper Gary Speed and United team-mate Paul Scholes in committing the remaining years of his career to club football. But Giggs is now focussed on making the Toshack era even more successful than the time Hughes spent at the helm. The Manchester United winger won his first cap as a 17-year-old in 1991, an away loss to Germany, and now faces his landmark appearance at the age of 31. With Giggs leading Wales out against Hungary, there is every chance that he will become the permanent successor to Speed. However, Toshack refused to reveal whether he sees Giggs as a long-term option. \"For this particular game I think it is appropriate that Ryan Giggs will be captain, it's his 50th cap and he's known for some time about that,\" Toshack said. On Wednesday night Toshack takes charge of his first match since replacing Hughes, and Giggs said: \"It's my 50th cap and I am looking forward to it, and I hope to play a lot more times from here on in. \"It's important to be here, all the players feel the same. It's a new start and all the top players certainly see it as important. \"I see myself leading by example, it is something I have taken on for Wales as well as United these past few seasons. \"The way John is looking at things, he is aiming to build his side around the experienced lads right up to the next tournament, the Euro 2006 event. \"I have told John I will be around for the next European tournament, by then I will be 35 so hopefully I will still be okay. \"A lot can happen, but I'm hoping to be around.\" Giggs' own personal future at Old Trafford is still up in the air as he has yet to reach agreement on a new contract, with Manchester United offering one extra year and Giggs seeking two. \"I have put the contract thing to the back of my mind at the moment,\" said Giggs. \"It is an important period for the club and I am just concentrated on that. \"I've heard the suggestions, hopefully there is a two-year deal about to be offered because that is what I am looking for, to get it sorted out. \"I'm enjoying my football, the way United have been playing and my own form, you have to enjoy it. \"We have massive games coming up: Manchester City this week, then the Everton cup tie, followed by AC Milan in the Champions League, and my first Wales game under John Toshack, so it's an important time.\"\n", "llama3.2:1b": "Ryan Giggs will captain Wales as he wins his 50th cap on Wednesday against Hungary. He was only 17 when he won his first international cap in 1991. The Welsh team under coach John Toshack is taking a new start after Toshack replaced Mark Hughes, who had been the manager for many years. Giggs' captaincy comes with high expectations from club manager Sir Alex Ferguson. Giggs' playing career has slowed down, and he considers retiring to play in the European Championships. However, he is now focused on leading Wales under Toshack. The Welsh team faces Hungary and other challenges before the Euro 2006 tournament.", "llama3.2:3b": "Ryan Giggs will captain Wales for his 50th cap against Hungary on Wednesday. He had briefly considered retirement but was urged to continue by Manchester United manager Sir Alex Ferguson. Giggs is now focused on helping new coach John Toshack succeed Mark Hughes and making the team competitive for the European Championships in 2008.", "gemma2:2b": "Ryan Giggs will captain Wales for his 50th cap on Wednesday against Hungary. He is considering a long-term future with Wales as he targets the 2008 European Championships. Giggs' club manager, Sir Alex Ferguson, urged him to continue playing for Wales and sees him as fit enough for future international play. John Toshack, the new Welsh coach, aims to build his team around experienced players, including Giggs, for the 2006 European Championship. Giggs is currently negotiating a contract extension with Manchester United after recently turning 31. He is focused on his performance and upcoming games while remaining hopeful for a two-year deal at Old Trafford. \n", "qwen2.5:0.5b": "Giggs becomes 50th Wales captain after winning landmark match against Hungary. John Toshack says he is surprised that Giggs has only just reached the landmark as a Welsh internationals captain. Ryan Giggs admits to briefly considering retiring but now wants to play for Wales in European Championships and sees him joining John Toshack era. UK manager, John Toshack, hopes for a two-year deal with Giggs to avoid the possibility of him being relegated under United's contract terms.", "qwen2.5:1.5b": "Ryan Giggs will captain Wales for their friendly against Hungary. The 31-year-old has reached his 50th cap and aims to play in the 2008 European Championships. Giggs discusses his career goals, including playing for both United and Wales, and plans to lead by example as part of a successful Toshack era. His contract situation at Old Trafford remains uncertain.", "qwen2.5:3b": "Ryan Giggs will captain Wales for their friendly match against Hungary after reaching 50 caps. John Toshack, taking over as Wales coach from Mark Hughes, surprised by Giggs' achievement but sees him fit to continue representing the country. Despite considering retirement to focus on club football, particularly with Paul Scholes and Gary Speed leaving the team, Giggs is focused on playing for Wales until the 2008 European Championships. Toshack aims to build his squad around experienced players for that tournament, including Giggs who hopes to be available at 35 years old. While negotiations on a new contract with Manchester United are ongoing, Giggs emphasizes the current importance of club commitments and personal enjoyment of football.", "opencoder:1.5b": "Giggs handed Wales leading role\n\nRyan Giggs will captain Wales as he wins his 50th cap in Wednesday's friendly against Hungary in Cardiff. \n\nJohn Toshack, in his first game as coach after succeeding Mark Hughes, admits he is surprised that Giggs has only just reached the landmark. \"With the games he's played for United, proportionately it doesn't seem that many for Wales,\" Toshack said. \"But he's one of the greatest of all Welsh internationals and on his 50th cap it's appropriate he's captain.\" Giggs admits he had briefly considered retirement from the international game, but is now targetting playing for Wales in the 2008 European Championships.\n\nThe Manchester United wing revealed how club manager Sir Alex Ferguson talked him into extending his Wales career. \"I briefly discussed my international future with Sir Alex, but he urged me to carry on,\" Giggs said. \"He feels, like myself, that I have no weight problems and keep myself fit, so in three or four years' time I will be able to play in the European finals if we get there. \"The manager has always wanted me to play for my club and country and he was keen for me to continue because I am fit enough.\"\n\nGiggs's own personal future at Old Trafford is still up in the air as he has yet to reach agreement on a new contract, with Manchester United offering one extra year and Giggs seeking two. On Wednesday night Toshack takes charge of his first match since replacing Hughes, and Giggs said: \"It's my 50th cap and I am looking forward to it, and I hope to play a lot more times from here on in. \"It's important to be here, all the players feel the same. It's a new start and all the top players certainly see it as important. \"I see myself leading by example, it is something I have taken on for Wales as well as United these past few seasons. \"The way John is looking at things, he is aiming to build his side around the experienced lads right up to the next tournament, the Euro 2006 event. \"I have told John I will be around for the next European tournament, by then I will be 35 so hopefully I will still be okay. \"A lot can happen, but I'm hoping to be around.\"\n", "smollm:1.7b": "Summarize the following text concisely, preserving key ideas and details.\nOutput only the summary as plain text—no explanations, no formatting, no reasoning process.", "deepseek-r1:1.5b": "<think>\nAlright, let me try to figure out how to approach this query. The user has provided a text that needs summarization into plain text. They want only the summary without any explanations or formatting.\n\nFirst, I need to read through the entire paragraph carefully. It seems like it's about Ryan Giggs and his upcoming game against Hungary. He will lead Wales as captain for his 50th cap, which is a big milestone. The text mentions his coach John Toshack's comments on his achievement, the club manager Sir Alex Ferguson encouraging him to stay in club football, and details about his personal contract negotiations.\n\nI should capture the key points: Giggs' 50th cap, leading Wales, the mention of Toshack's surprise, Mike Toshack's comments, his desire to play in future European Championships, upcoming matches against Manchester City, Everton Cup tie, AC Milan, and his first Wales game. Also, he's still unsure about his contract terms.\n\nI need to make sure I include all these elements in the summary while keeping it concise. The output should be a single paragraph without any extra words or explanations. Let me structure this by starting with Giggs' role, then his achievements, Toshack's comments, his future career goals, and the upcoming matches.\n</think>\n\nRyan Giggs will lead Wales as captain for his 50th cap against Hungary at Cardiff. John Toshack, Giggs' coach after joining United, commented on Giggs' achievement, expressing surprise that he reached the milestone. Giggs admitted considering retirement but now targets European championships. Manchester United manager Sir Alex Ferguson encouraged him to stay in club football. Giggs aims to play longer with Wales before future European tournaments. Upcoming matches: Manchester City (week 1), Everton Cup tie (week 2), AC Milan (week 3), and a first Wales match under John Toshack. He is still unsure about contract terms.", "tinyllama:1.1b": "In a Wednesday friendly against Hungary, Ryan Giggs will captain Wales as he approaches his 50th cap. John Toshaick admitted that Giggs is not the only Welsh international to have surpassed this number, but he believes it's appropriate for him to lead in this particular match due to his experiences and fitness levels. Giggs admits that he briefly considered retirement from international football and is targeting playing for Wales in the 2008 European Championships, where he will be captain. The Manchester United wing player has been given weight problems and believes he can still play at club level for a few more years after having won his first cap as a teenager in 1991. Despite his future at Old Trafford being uncertain, Giggs is focusing on securing a two-year contract in hopes of getting it sorted out to ensure he can concentrate on football.", "tinydolphin:1.1b": " Ryan Giggs is set to captain Wales as he will become the first ever player to reach 50 caps for his country. Giggs, who scored his 50th international goal in this year's friendly against Hungary, has been given the role of captain by manager John Toshack. The Manchester United winger expressed his excitement at being chosen to lead Wales and hopes to continue playing as part of a successful transition of players at club level while maintaining his fitness for the next international tournament in 2006.", "phi:2.7b": " Ryan Giggs will captain Wales against Hungary, reaching his 50th cap. He briefly considered retirement but is now aiming to play for Wales in the European Championships. Former Wales skipper Gary Speed is seen as a potential successor to Giggs, and manager John Toshack wants to continue the success of the Hughes era. Giggs won his first cap at 17 and is now 31, with the chance to lead Wales for many more years. He will captain Wales against Hungary in Wednesday's friendly in Cardiff.\n", "orca-mini:3b": " Ryan Giggs will captain Wales as he wins his 50th cap in Wednesday's friendly against Hungary in Cardiff. The Manchester United wing revealed how club manager Sir Alex Ferguson talked him into extending his Wales career. \"I briefly discussed my international future with Sir Alex, but he urged me to carry on,\" Giggs said. He admits he had initially considered retirement from the international game but is now targetting playing for Wales in the 2008 European Championships. The Manchester United winger won his first cap as a 17-year-old in 1991, an away loss to Germany, and now faces his landmark appearance at the age of 31.", "hermes3:3b": "Ryan Giggs leads Wales team on 50th cap as captain for match against Hungary. Toshack, his new coach, hopes to build side around experienced players for Euro 2006 tournament.", "stablelm-zephyr:3b": "Ryan Giggs will captain Wales for his 50th cap against Hungary in Cardiff, with coach John Toshack admitting he is surprised that Giggs has only just reached the milestone. The Manchester United winger had considered retirement from the international game but now targets playing for Wales in the 2008 European Championships. With Giggs leading Wales out against Hungary, he may become the permanent successor to former captain Gary Speed.", "chatgpt-4o-latest": "Ryan Giggs will captain Wales in his 50th international appearance during a friendly against Hungary, marking John Toshack’s first game as coach. Toshack expressed surprise at Giggs reaching this milestone relatively late but praised him as one of Wales' greatest players. Giggs had considered retiring from international football but was persuaded by Manchester United manager Sir Alex Ferguson to continue, aiming to play in the 2008 European Championships. He hopes to contribute to Wales' success under Toshack, who is building his team around experienced players. Giggs, who debuted for Wales in 1991, may become the permanent captain but Toshack has not confirmed this. Meanwhile, Giggs' future at Manchester United remains uncertain as he seeks a two-year contract extension while the club offers only one. Despite this, he remains focused on upcoming key matches for both club and country.", "stablelm2:1.6b": "Ryan Giggs will captain Wales in a friendly against Hungary as he reaches his 15th cap. John Toshack, new Wales coach after Mark Hughes' departure, is surprised that such a legendary player hasn..\nGiggs briefly considered retirement from international football but was urged to continue by Manchester United manager Alex Ferguson. He aims to play for Wales in the European Championships and hopes to extend his career with Old Trafford. As for Giggs' personal future at United, he has yet to agree on a new contract, aiming for two years instead of one.", "granite3.1-dense:2b": "Ryan Giggs, a 31-year-old Manchester United winger, will captain Wales for his 50th international appearance in a friendly against Hungary on Wednesday. Coach John Toshack, replacing Mark Hughes, expressed surprise at the low number of caps Giggs has earned due to his extensive club career with Manchester United. Giggs considered retirement but is now targeting the 2008 European Championships. Sir Alex Ferguson, Manchester United's manager, persuaded him to continue playing for both club and country. Giggs aims to lead Wales in future tournaments, potentially becoming the permanent captain after this match. Toshack has not confirmed Giggs as a long-term option but sees his leadership as appropriate for this specific game. Giggs' personal future at Manchester United remains uncertain, with contract negotiations ongoing. Despite this, he is focused on contributing to Wales and Manchester United's success in upcoming high-profile matches.", "reference": "\"For this particular game I think it is appropriate that Ryan Giggs will be captain, it's his 50th cap and he's known for some time about that,\" Toshack said.On Wednesday night Toshack takes charge of his first match since replacing Hughes, and Giggs said: \"It's my 50th cap and I am looking forward to it, and I hope to play a lot more times from here on in.John Toshack, in his first game as coach after succeeding Mark Hughes, admits he is surprised that Giggs has only just reached the landmark.Giggs admits he had briefly considered retirement from the international game, but is now targetting playing for Wales in the 2008 European Championships.\"With the games he's played for United, proportionately it doesn't seem that many for Wales,\" Toshack said.Ryan Giggs will captain Wales as he wins his 50th cap in Wednesday's friendly against Hungary in Cardiff.\"We have massive games coming up: Manchester City this week, then the Everton cup tie, followed by AC Milan in the Champions League, and my first Wales game under John Toshack, so it's an important time.\"Giggs' own personal future at Old Trafford is still up in the air as he has yet to reach agreement on a new contract, with Manchester United offering one extra year and Giggs seeking two.Giggs admits he was wavering and considering joining the likes of former Wales skipper Gary Speed and United team-mate Paul Scholes in committing the remaining years of his career to club football.The Manchester United wing revealed how club manager Sir Alex Ferguson talked him into extending his Wales career.But Giggs is now focussed on making the Toshack era even more successful than the time Hughes spent at the helm.With Giggs leading Wales out against Hungary, there is every chance that he will become the permanent successor to Speed."}