{"raw_text": "Newry to fight cup exit in courts\n \n Newry City are expected to discuss legal avenues on Friday regarding overturning their ejection from the Nationwide Irish Cup.\n \n The IFA upheld its original decision to throw Newry out of the cup following the Andy Crawford registration row. ''A law firm will put a case forward for Newry FC, and see what the legal implications of all this is are,'' said Newry boss Roy McCreadie. ''This is a big issue, now that we have an appeal pending,'' On Wednesday, a fresh IFA hearing into Crawford registration saga, ruled that last week's original verdict had been correct. It meant that Bangor, beaten 5-1 by Newry on the field, will take on Portadown in the sixth round. Newry had claimed they had uncovered \"fresh evidence\", in respect of the dates relating to the registration. But McCreadie is not further annoyed that full details of Wednesday's meeting was not relayed to the club. ''Even to this day, we have as much information about what happened during the meeting on Wednesday as that told to the media. We are being kept in the dark,'' McCreadie told the\n \n News Letter\n \n . ''We want an explanation. There is no good sending us the same fax message the press people received. ''It's a real sad case. If we are not back in the Irish Cup after our appeal, and guided by our legal advise, we will seek to lodge an injunction in the courts to stop Bangor playing Portadown.''\n", "llama3.2:1b": "Newry FC is set to discuss overturning their ejection from the Nationwide Irish Cup due to a registration row. The IFA has upheld its decision, and Newry boss Roy McCreadie plans to appeal. A fresh hearing was held on Wednesday, which ruled that the original verdict was correct. Newry claims they uncovered \"fresh evidence\", but the club is still not informed about details of the meeting with IFA representatives.", "llama3.2:3b": "Newry City FC is discussing legal options to overturn their ejection from the Nationwide Irish Cup due to a registration issue. A law firm will put forward a case, and Newry's boss Roy McCreadie is seeking explanation for why full details of an IFA hearing were not shared with the club. If unsuccessful, Newry may seek to lodge an injunction in courts to stop Bangor from playing Portadown in the next round.", "gemma2:2b": "Newry City is considering legal action to overturn their ejection from the Nationwide Irish Cup. They plan to consult with a law firm to explore possible avenues for appeal. The IFA upheld its previous decision, and Bangor will now face Portadown in the sixth round of the competition. Newry claims they have uncovered \"fresh evidence\" regarding registration dates but received limited information about Wednesday's hearing, which confirmed the original verdict. They are considering legal action (potentially an injunction) to prevent Bangor from progressing if they cannot be reinstated. \n", "qwen2.5:0.5b": "Newry City is expected to discuss legal avenues regarding overturning their ejection from the Nationwide Irish Cup. The IFA upheld its original decision to throw Newry out of the cup following the Andy Crawford registration row. A fresh IFA hearing into the Crawford registration saga revealed that Bangor, beaten 5-1 by Newry on the field, will take on Portadown in the sixth round. Newry had claimed they had uncovered \"fresh evidence\" regarding the dates relating to the registration. However, the club is not further annoyed that full details of Wednesday's meeting were not relayed to them. They want an explanation and are being kept in the dark about what happened during the meeting. If Newry City are not back in the Irish Cup after their appeal and guidance by their legal advice they will seek to lodge an injunction in the courts to stop Bangor playing Portadown.", "qwen2.5:1.5b": "Newry City plans to discuss legal action over their removal from the Nationwide Irish Cup following a registration dispute. The IFA has upheld its original decision on Crawford's registration; Newry wants to appeal and see if there are any new implications. McCreadie, the club president, is not happy with having details of Wednesday's meeting withheld from them. They plan to seek an injunction in court to stop Bangor playing Portadown unless they return to the Irish Cup after their appeal fails.", "qwen2.5:3b": "Newry City expect to discuss legal options regarding their ejection from the Nationwide Irish Cup following Andy Crawford's registration issue. The Irish Football Association (IFA) upheld its decision to eject Newry, which saw Bangor proceed to the sixth round instead. Newry boss Roy McCreadie is seeking full details of an IFA hearing on Wednesday and demands explanation for being kept in the dark. If successful with their appeal, Newry intends to seek legal action through courts to prevent Bangor from playing Portadown in the next round.", "opencoder:1.5b": "Newry to fight cup exit in courts\n\nNewry City are expected to discuss legal avenues on Friday regarding overturning their ejection from the Nationwide Irish Cup. The IFA upheld its original decision to throw Newry out of the cup following the Andy Crawford registration row. A law firm will put a case forward for Newry FC, and see what the legal implications of all this is have been discussed by Newry boss Roy McCreadie. This issue has become a big issue now that we have an appeal pending. It meant that Bangor, which beat 5-1 last week, will take on Portadown in the sixth round. The claim made by Newry had been correct. The club is not further annoyed that full details of Wednesday's meeting was not relayed to the club. On Wednesday, a fresh IFA hearing into Crawford registration saga, it was ruled that last week's original verdict had been correct.\n", "smollm:1.7b": "The summary is concise and clear, capturing the main points of the text without including unnecessary details. The key ideas are preserved, such as the newry to fight cup exit in courts, the IFA upholding its original decision, the IFA ruling that last week's original verdict had been correct, and the legal implications of the decision for Newry FC.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text concisely while preserving the key ideas and details. Let me read through it carefully first.\n\nThe main points are: Newry City is discussing how they'll handle their ejection from the Nationwide Irish Cup on Friday. The IFA upheld their decision against Crawford's registration row, which was an issue because of the dates involved. The IFA boss, Roy McCreadie, mentions that a law firm will present evidence and that this is a significant problem now. There's also mention that Newry had claimed they found fresh evidence about the meeting date, but McCreadie isn't happy to know it hasn't been shared with them yet. The result was that Newry plays Portadown in the sixth round, which is sad because they didn't get their suit dismissed and want an injunction if they don't play again.\n\nI should keep this all in a short, clear summary without any extra explanations or formatting.\n</think>\n\nNewry City are discussing legal matters regarding their ejection from the Nationwide Irish Cup on Friday. The IFA upheld its original decision against Crawford's registration row, which involved dates related to the case. A law firm will present evidence, creating a significant issue now. Newry had claimed they found fresh evidence about the meeting date but McCreadie isn't happy with not being told it hasn't been shared. They play Portadown in the sixth round, leading to a sad outcome, wanting an injunction if they don't play again.", "tinyllama:1.1b": "Newry City are expected to discuss their legal options on Friday regarding their expulsion from the Nationwide Irish Cup after a decision made by the IFA was overturned. The club is now facing an appeal process, and they have reportedly sent a letter to the media requesting explanations for not being informed about the meeting in question. Despite receiving a similar message from the press, the club has stated that it remains frustrated with being kept in the dark, especially given the fact that they are set to face Bangor in the sixth round of the cup. The club is now seeking legal options to contest the decision and prevent their return to the tournament after the appeal is lodged.", "tinydolphin:1.1b": " In a recent court hearing involving Newry FC, the club's management has had a conversation with lawyers about legal proceedings. The issue at hand is the decision made by the Irish Football Association (IFA) to kick out Newry City from the Nationwide Irish Cup. This follows an incident where Andy Crawford was involved in a registration process during the match against Bangor, which resulted in Newry being expelled from the tournament. A fresh appeal hearing has been scheduled for July 16th.", "phi:2.7b": " Newry City is considering legal options due to being ejected from the Nationwide Irish Cup over registration issues with Andy Crawford. They plan to seek a legal case against IFA's decision and discuss their plans on Friday. The court hearing on Wednesday upheld the original verdict, meaning that Bangor will play Portadown in the sixth round. Newry has claimed they have new evidence but McCreadie is not satisfied with the information provided by the press. He believes the club needs to be informed of any legal developments and will seek to prevent Bangor from playing Portadown if necessary.\n", "orca-mini:3b": " Newry City are planning to fight their expulsion from the Nationwide Irish Cup by filing legal appeals. They had claimed they uncovered fresh evidence during a hearing on Wednesday, but their claim was dismissed by the IFA. The club is considering lodging an injunction in the courts to stop Bangor playing Portadown in the sixth round, should their appeal fail.", "hermes3:3b": "Newry City likely to take legal action over Irish Cup expulsion.", "stablelm-zephyr:3b": "Newry City plans to discuss legal options to overturn their ejection from the Nationwide Irish Cup. The original decision was made following the Andy Crawford registration row, and a law firm will present a case for Newry FC. Despite a fresh IFA hearing ruling in favor of the original verdict, Newry claims they found \"fresh evidence\" regarding the dates of registration. If their appeal is unsuccessful, the club may seek an injunction to stop Bangor from playing Portadown in the next round.", "chatgpt-4o-latest": "Newry City is considering legal action to overturn their ejection from the Nationwide Irish Cup after the IFA upheld its decision regarding the Andy Crawford registration issue. Despite presenting new evidence, Newry's appeal was rejected, allowing Bangor to advance. Manager Roy McCreadie expressed frustration over the lack of transparency in the IFA's decision-making process. If their appeal fails, Newry plans to seek a court injunction to prevent Bangor from playing Portadown in the next round.", "stablelm2:1.6b": "Newry City plans to discuss legal options with a law firm to challenge their ejection from the Nationwide Irish Cup following an original decision upheld by the IFA. The club expects to take on Bangor in the sixth round, after the latest IFA hearing overturned the initial verdict. If they are not allowed back into the competition, Newry will attempt to obtain an injunction against rivals Portadown to prevent them from playing.", "granite3.1-dense:2b": "Newry City football club plans to explore legal options on Friday to challenge their exclusion from the Nationwide Irish Cup due to the Andy Crawford registration controversy. Club boss Roy McCreadie stated that a law firm will assess the legal consequences, following an IFA hearing on Wednesday upholding the initial decision to disqualify Newry. This ruling means Bangor, who lost 5-1 to Newry in their previous match, will proceed to face Portadown in the next round. Despite Newry's claims of new evidence regarding Crawford's registration dates, McCreadie expressed frustration over limited communication about Wednesday's IFA meeting, which he believes should have been shared with the club. If unsuccessful in their appeal, Newry intends to file an injunction in court to prevent Bangor from playing Portadown.", "reference": "''A law firm will put a case forward for Newry FC, and see what the legal implications of all this is are,'' said Newry boss Roy McCreadie.The IFA upheld its original decision to throw Newry out of the cup following the Andy Crawford registration row.Newry City are expected to discuss legal avenues on Friday regarding overturning their ejection from the Nationwide Irish Cup.Newry had claimed they had uncovered \"fresh evidence\", in respect of the dates relating to the registration.It meant that Bangor, beaten 5-1 by Newry on the field, will take on Portadown in the sixth round.''This is a big issue, now that we have an appeal pending,'' On Wednesday, a fresh IFA hearing into Crawford registration saga, ruled that last week's original verdict had been correct."}