{"raw_text": "Israeli club look to Africa\n \n Four African players, including Zimbabwe goalkeeper Energy Murambadoro, are all ready to play for Israeli club Hapoel Bnei Sakhnin in the Uefa Cup.\n \n Bnei Sakhnin are the first Arab side ever to play in European competition and will play English Premiership side Newcastle United in the first round. Warriors' goalkeeper Murambadoro, who made a name for himself at the African Nations Cup finals in Tunisia, helped Bnei Sakhnin overcome Albania's Partizani Tirana 6-1 in the previous round. Murambadoro moved to Israel recently after a brief stint with South African club Hellenic. The club won the Israeli Cup final last season and are based in Sakhnin, which is near Haifa. The club have a strong ethic and are high profile promoters of peace and co-operation within Israel. The three other Africans at the club are former Cameroon defender Ernest Etchi, DR Congo's Alain Masudi and Nigerian midfielder Edith Agoye, who had a stint with Tunisian side Esperance.\n", "llama3.2:1b": "Israeli club Hapoel Bnei Sakhnin is playing in the Uefa Cup for the first time, featuring four African players: Energy Murambadoro (Zimbabwe goalkeeper), Ernest Etchi (Cameroon defender), Alain Masudi (DR Congo midfielder) and Edith Agoye (Nigeria midfielder).", "llama3.2:3b": "Hapoel Bnei Sakhnin, an Israeli club, is set to play Newcastle United in the Uefa Cup. The team has four African players: Energy Murambadoro (Zimbabwe), Ernest Etchi (Cameroon), Alain Masudi (DR Congo), and Edith Agoye (Nigeria).", "gemma2:2b": "Israeli club Hapoel Bnei Sakhnin has four African players, including Zimbabwe goalkeeper Energy Murambadoro, ready for their Uefa Cup match against Newcastle United. The team is the first Arab side to participate in European competition and are known for promoting peace and cooperation within Israel. \n", "qwen2.5:0.5b": "Four African players (Murambadoro, Masudi, Agoye) have agreed to join Israeli club Hapoel Bnei Sakhnin in the Uefa Cup. The team plays English Premiership side Newcastle United in the first round. Murambadoro is a former goalkeeper from Tunisia who has recently moved to Israel after a short stint with South African club Hellenic. The club won the Israeli Cup final last season and are based in Sakhnin, which is near Haifa.", "qwen2.5:1.5b": "Four African players signed by Israeli club Hapoel Bnei Sakhnin for Uefa Cup, including Zimbabwean goalkeeper Energy Murambadoro, who previously played in the African Nations Cup and won Israel's national title earlier this season. Murambadoro's team will face Newcastle United in their first round match against Albania's Partizani Tirana 6-1 after defeating them in the previous round. The club also features three other Africans: former Cameroon defender Ernest Etchi, DR Congo's Alain Masudi, and Nigerian midfielder Edith Agoye who played for Tunisian side Esperance before joining Bnei Sakhnin.", "qwen2.5:3b": "Israeli club Hapoel Bnei Sakhnin, featuring four African players including Zimbabwe goalkeeper Energy Murambadoro, compete in the Uefa Cup. They are the first Arab team to play in European competition and will face Newcastle United. Murambadoro, who played for Albania's Partizani Tirana 6-1, moved from South Africa recently. The club won the Israeli Cup final last season and promotes peace and cooperation. Other African players include former Cameroon defender Ernest Etchi, DR Congo midfielder Alain Masudi, and Nigerian midfielder Edith Agoye.", "opencoder:1.5b": "Israeli club look to Africa\n\nFour African players, including Zimbabwe goalkeeper Energy Murambadoro, are all ready to play for Israel club Hapoel Bnei Sakhnin in the Uefa Cup.\nBnei Sakhnin are the first Arab side ever to play in European competition and will play English Premiership side Newcastle United in the first round. Warriors' goalkeeper Murambadoro, who made a name for himself at the African Nations Cup finals in Tunisia, helped Bnei Sakhnin overcome Albania's Partizani Tirana 6-1 in the previous round. Murambadoro moved to Israel recently after a brief stint with South African club Hellenic. The club won the Israeli Cup final last season and are based in Sakhnin, which is near Haifa. The club have a strong ethic and are high profile promoters of peace and co-operation within Israel. The three other Africans at the club are former Cameroon defender Ernest Etchi, DR Congo's Alain Masudi and Nigerian midfielder Edith Agoye, who had a stint with Tunisian side Esperance.\n", "smollm:1.7b": "Israeli club look to Africa\nFour African players, including Zimbabwe goalkeeper Energy Murambadoro, are all ready to play for Israeli club Hapoel Bnei Sakhnin in the Uefa Cup. Bnei Sakhnin will play English Premiership side Newcastle United in the first round. Warriors' goalkeeper Murambadoro, who made a name for himself at the African Nations Cup finals in Tunisia, helped Bnei Sakhnin overcome Albania's Partizani Tirana 6-1 in the previous round. Murambadoro moved to Israel recently after a brief stint with South African club Hellenic. The club won the Israeli Cup final last season and are based in Sakhnin, which is near Haifa. The club have a strong ethic and are high profile promoters of peace and co-operation within Israel. The three other Africans at the club are former Cameroon defender Ernest Etchi, DR Congo's Alain Masudi and Nigerian midfielder Edith Agoye, who had a stint with Tunisian side Esperance.", "deepseek-r1:1.5b": "<think>\nAlright, let me break this down. The user has provided a text about Israeli players heading to Africa for a competition, specifically the Uefa Cup against Hapoel Bnei Sakhnin. They want a concise summary, only the key points in plain text.\n\nFirst, I need to identify the main elements: the team name Hapoel Bnei Sakhgin, their home club Bnei Sakhnin's history as an Arab side entering Europe for the first time, the players involved including Zimbabwe goalkeeper Energy Murambadoro and others from different continents. The recent move of Murambadoro to Israel after a brief role with South Africa.\n\nI should focus on the team's new challenge in Europe, their strategic approach, the notable players' backgrounds, and Bnei Sakhnin's unique first-time involvement. I'll make sure each key player is mentioned but keep it brief since the user wants only the summary without explanations or formatting.\n</think>\n\nHapoel Bnei Sakhgin are set to join the Uefa Cup against Hapoel Bnei Sakhgin, aiming for an exciting European challenge with their home side Bnei Sakhnin. The Arab side is launching its debut in European competition for the first time. Notable players include Zimbabwe goalkeeper Energy Murambadoro and former Cameroon defender Ernest Etchi, Nigerian midfielder Edith Agoye, and DR Congo’s Alain Masudi. The team is based near Haifa but has a strong European ethos, promoting peace and cooperation in Israel.", "tinyllama:1.1b": "Israeli Club Looks to Africa: Four African players have left Israel for the Israeli club HaPoel Bnei Sakhnin in the UEFA Cup. Warriors' goalkeeper Energy Murambaadoro, who made a name for himself at the African Nations Cup finals in Tunisia, helped the team overcome Albanian side Partizani Tirana with a 6-1 victory earlier this month. The club is based near Haifa and has a strong ethic of peace and cooperation within Israel. Three other African players are currently playing for the Israeli club, former Cameroun defender Ernest Etchi, DR Congo midfielder Alain Masudi, and Nigerian forward Edith Agoye, who had a stint with Tunisian side Espra.", "tinydolphin:1.1b": " A summary of the text provided would be: Four African players, including Zimbabwe goalkeeper Energy Murambadoro, have joined Hapoel Bnei Sakhnin in the Uefa Cup. They are playing for an Arab team, which is the first ever to enter European competition. The team comes from the African continent and will face English Premier League side Newcastle United in the first round of the competition. Murambadoro's journey to Israel began at the African Nations Cup finals in Tunisia where he played against Partizani Tirana, helping his team overcome Albania 6-1. The players are part of a promising young group that will represent Hapoel Bnei Sakhnin in European competition for the first time.", "phi:2.7b": " Israeli club Hapoel Bnei Sakhnin is preparing for the Uefa Cup with four African players: Energy Murambadoro (Zimbabwe), Ernest Etchi (Cameroon), Alain Masudi (DR Congo) and Edith Agoye (Nigeria). The team has already beaten Albanian side Partizani Tirana in the previous round. They have a strong commitment to peace and co-operation within Israel, with their club based in Sakhnin near Haifa. \n", "orca-mini:3b": " An Israeli club, Hapoel Bnei Sakhnin, seeks to field four African players, including Zimbabwe goalkeeper Energy Murambadoro, in the UEFA Cup. The club won the Israeli Cup final last season and is based in Sakhnin, near Haifa. The club promotes peace and cooperation within Israel, with African stars from Cameroon, DR Congo, and Nigeria.", "hermes3:3b": "Israeli club Hapoel Bnei Sakhnin signs African players (Zimbabwe's Murambadoro, Cameroon's Etchi, DR Congo's Masudi, Nigeria's Agoye) for Uefa Cup.", "stablelm-zephyr:3b": "Four African players, including Zimbabwe's Energy Murambadoro, will play for Israeli club Hapoel Bnei Sakhnin in the UEFA Cup. Bnei Sakhnin is the first Arab team to compete in European competition and will face English Premiership side Newcastle United in the first round. The club won the Israeli Cup final last season and promotes peace and cooperation within Israel. The three other Africans at the club are former Cameroon defender Ernest Etchi, DR Congo's Alain Masudi, and Nigerian midfielder Edith Agoye.", "chatgpt-4o-latest": "Israeli club Hapoel Bnei Sakhnin, the first Arab team to compete in European competition, will face Newcastle United in the Uefa Cup first round. Four African players, including Zimbabwe goalkeeper Energy Murambadoro, are set to play for the team. Murambadoro, who impressed at the African Nations Cup, recently joined from South African club Hellenic and helped Bnei Sakhnin defeat Albania's Partizani Tirana 6-1 in the previous round. The club, based in Sakhnin near Haifa, won the Israeli Cup last season and promotes peace and cooperation in Israel. Other African players in the squad include former Cameroon defender Ernest Etchi, DR Congo's Alain Masudi, and Nigerian midfielder Edith Agoye.", "stablelm2:1.6b": "Four African players, including Zimbabwe goalkeeper Energy Murambadoro, will join Israeli club Hapoel Bnei Sakhnin in the UEFA Cup. This is the first time an Arab side participates in European competition. Hapoel Bnei Sakhnin will face English Premiership side Newcastle United in the first round. The team has previously defeated Albanian club Partizani Tirana with a score of 6-1. Energy Murambadoro, who helped them achieve this victory, is now also playing for Israeli club after briefly serving at South African club Hellenic. The other three Africans on the club roster include former Cameroon defender Ernest Etchi, DR Congo's Alain Masudi, and Nigerian midfielder Edith Agoye.", "granite3.1-dense:2b": "Israeli team Hapoel Bnei Sakhnin, an Arab club making its debut in European competition, secured four African players for the Uefa Cup. The group includes Zimbabwe's goalkeeper Energy Murambadoro, known for his performance at the African Nations Cup finals in Tunisia, who aided Bnei Sakhnin in their 6-1 victory over Albanian team Partizani Tirana. Murambadoro recently relocated from South Africa's Hellenic club to join the Israeli side. The Warriors also welcomed Cameroon defender Ernest Etchi, DR Congo's Alain Masudi, and Nigerian midfielder Edith Agoye, who had previously played for Tunisian Esperance. Bnei Sakhnin, known for its commitment to peace and cooperation within Israel, recently won the Israeli Cup final and is based in Sakhnin near Haifa. Their upcoming opponents are English Premier League team Newcastle United.", "reference": "Four African players, including Zimbabwe goalkeeper Energy Murambadoro, are all ready to play for Israeli club Hapoel Bnei Sakhnin in the Uefa Cup.The club won the Israeli Cup final last season and are based in Sakhnin, which is near Haifa.Murambadoro moved to Israel recently after a brief stint with South African club Hellenic."}