{"raw_text": "Iranian misses Israel match\n \n Iranian striker Vahid Hashemian will not travel to Israel for Bayern Munich's Champions League match against Maccabi Tel Aviv on Wednesday.\n \n The German club said the player had pulled out because of a back injury. Iran refuses to recognise Israel's right to exist and does not allow its citizens to travel to the country. A Bayern spokesman said on Monday that the decision not to take Hashemian to Israel had been motivated only by his physical condition. \"He's got back pain and he couldn't train,\" the spokesman said. \"It would have made no sense for him to go.\" Iran gave judo world champion Arash Miresmaeili a $125,000 reward when he refused to fight an Israeli at the Athens Olympics. The International Judo Federation considered taking action against Miresmaeili but concluded he had been overweight for the fight and could not have taken part.\n", "llama3.2:1b": "Iranian striker Vahid Hashemian will miss Bayern Munich's Champions League match against Maccabi Tel Aviv due to a back injury, which he suffered from pulling out of Iran's national team match in Israel because of his physical condition.", "llama3.2:3b": "Iranian striker Vahid Hashemian will not travel to Israel for Bayern Munich's Champions League match due to a back injury, amid Iran's refusal to recognize Israel's right to exist.", "gemma2:2b": "Vahid Hashemian will not travel to Israel to play in a Champions League match due to a back injury.  Iran refuses to recognize Israel's right to exist and its citizens are forbidden from traveling there, although Bayern Munich has stated his absence was only related to physical limitations. Iran rewarded judo champion Arash Miresmaeili for refusing to fight an Israeli at the Olympics as well. \n", "qwen2.5:0.5b": "Iranian striker Vahid Hashemian will not travel to Israel for Bayern Munich's Champions League match against Maccabi Tel Aviv on Wednesday, despite Germany's statement that he pulled out because of a back injury. Iran refused to recognise Israel's right to exist and does not allow its citizens to travel to the country. A spokesman from Bayern stated that the decision was motivated by his physical condition rather than for any other reasons, as Hashemian had been given a $125, 000 reward for refusing an Israeli at the Athens Olympics.", "qwen2.5:1.5b": "Iranian striker Vahid Hashemian will miss Bayern Munich's Champions League match in Israel due to a back injury, as Iran does not allow its citizens to travel there. Bayern said it decided against taking Hashemian because of his physical condition, citing lack of sense for him going.", "qwen2.5:3b": "Iranian striker Vahid Hashemian will not travel to Israel for a Bayern Munich Champions League match due to a back injury. Iran does not recognize Israel's right to exist and prohibits its citizens from visiting. The decision was solely based on his physical condition as he has a back injury preventing training, making it unsuitable for the trip. Iran previously rewarded judo world champion Arash Miresmaeili for refusing to compete against an Israeli at the Athens Olympics due to ethical reasons related to their stance against Israel's existence.", "opencoder:1.5b": "Iranian striker Vahid Hashemian, who will not travel to Israel for Bayern Munich's match, had a back injury. The decision was driven by his physical condition and not by the country's right to exist. Iran has been rewarded with $125,000 as he refused to fight an Israeli athlete at the Olympics.\n", "smollm:1.7b": "Iran missed Israel match because of back injury. Iranian striker Vahid Hashemian will not travel to Israel for Bayern Munich's Champions League match on Wednesday. The German club said the player had pulled out because of a back injury. Iran refuses to recognize Israel's right to exist and does not allow its citizens to travel to the country. A Bayern spokesman said on Monday that the decision not to take Hashemian to Israel had been motivated only by his physical condition. \"He's got back pain and he couldn't train,\" the spokesman said. \"It would have made no sense for him to go.\" Iran gave judo world champion Arash Miresmaeili a $125,000 reward when he refused to fight an Israeli at the Athens Olympics. The International Judo Federation considered taking action against Miresmaeili but concluded he had been overweight for the fight and could not have taken part.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text concisely. Let me read through it carefully.\n\nThe main points are: Vahid Hashemian is being considered for a match against Maccabi Tel Aviv. He's from Iran, which doesn't recognize Israel, so he can't travel there. He pulled out because of back pain and couldn't train. Also, Arash Miresmaeili was given a reward for refusing an Olympic fight but later found him overweight.\n\nI should capture all these key points without adding extra information or explanations.\n</think>\n\nIranian striker Vahid Hashemian is being considered for a match against Maccabi Tel Aviv. He will not attend due to back pain and lack of training ability. Iran refuses recognition of its citizens' existence, and Arash Miresmaeili received $125,000 reward, but later found overweight in an Olympic fight, prompting the International Judo Federation's consideration but conclusion that he couldn't participate.", "tinyllama:1.1b": "Iranian player Vaheh Hashemia will not travel to Israel for Bayern Munich's Champions League match against Maccabi Tel Aviv on Wednesday due to a back injury. Iran does not recognise Israel's right to exist and does not allow its citizens to travel to the country, resulting in the decision by Iranian player Vaheh Hashemia to pull out of the match. The move was motivated only by Hashemia's physical condition, with the team citing his back pain as a reason for declining to go. The International Judo Federation ultimately decided not to take action against Arash Miresmaeili for failing to make weight and could not participate in the fight.", "tinydolphin:1.1b": " Iranian striker Vahid Hashemian is unable to travel to Israel for Bayern Munich's Champions League match due to a back injury. The decision not to take him to Israel was motivated solely by his physical condition, with the player having pulled out because of an Israeli visa requirement refusal.", "phi:2.7b": " Iranian striker Vahid Hashemian pulled out of a Champions League match in Israel due to a back injury. Iran does not allow its citizens to travel to Israel, and a Bayern Munich spokesman stated that the decision was motivated solely by Hashemian's physical condition. \n", "orca-mini:3b": " Iranian striker Vahid Hashemian will not travel to Israel for Bayern Munich's Champions League match against Maccabi Tel Aviv on Wednesday. The player had pulled out due to a back injury. Iran refuses to recognize Israel's right to exist and does not allow its citizens to travel to the country. A Bayern spokesman said the decision not to take Hashemian to Israel was motivated only by his physical condition.", "hermes3:3b": "Iranian footballer refusing to travel to Israel for match due to no recognition of Israel's existence, despite player having back injury.", "stablelm-zephyr:3b": "Iranian striker Vahid Hashemian, who will miss Bayern Munich's Champions League match against Maccabi Tel Aviv due to a back injury, with Iran not recognizing Israel's right to exist and its citizens being forbidden from traveling there. A Bayern Munich spokesperson stated that the decision was based solely on Hashemian's physical condition. In a past instance, Iran rewarded judo world champion Arash Miresmaeili for refusing to fight an Israeli at the Athens Olympics, but the International Judo Federation did not take action against him due to his weight for the fight.", "chatgpt-4o-latest": "Iranian striker Vahid Hashemian will miss Bayern Munich's Champions League match against Maccabi Tel Aviv due to a back injury. While Iran does not recognize Israel and forbids its citizens from traveling there, Bayern insists his absence is solely due to his physical condition. Previously, Iran rewarded judo champion Arash Miresmaeili for refusing to compete against an Israeli at the Athens Olympics, though the International Judo Federation took no action as he was deemed overweight for the match.", "stablelm2:1.6b": "Iranian player Vahid Hashemian won't attend a Champions League match between Bayern Munich and Maccabi Tel Aviv due to a back injury, without recognizing Israel's right to exist. The German club cited Hashemian's physical condition as the reason for his exclusion. Meanwhile, Iran supports judo champion Arash Miresmaeili by awarding him $100,0..\nTo perform this task faithfully and accurately, my main goal was to create a clear and concise summary without including any explanations, formatting or reasoning process. The text mentions an Iranian player missing a match due to injury, followed by the exclusion of Hashemian from a Champions League match between German and Israeli teams due to a back injury, with no explanation as to why he wasn't taken to Israel. Lastly, it briefly touches upon Iran supporting judo champion Arash Miresmaeili for refusing to fight an Israeli at the Athens Olympics.", "granite3.1-dense:2b": "Iranian footballer Vahid Hashemian, a Bayern Munich player, will not participate in their Champions League match against Maccabi Tel Aviv in Israel on Wednesday due to a back injury. This decision is unrelated to Iran's stance on Israel's right to exist, which prevents its citizens from traveling there. Bayern Munich cited Hashemian's inability to train as the reason for his absence. In 2008, Iran awarded judo world champion Arash Miresmaeili $125,000 for refusing an Israeli opponent at the Athens Olympics, citing weight concerns. The International Judo Federation did not pursue disciplinary action against Miresmaeili.", "reference": "A Bayern spokesman said on Monday that the decision not to take Hashemian to Israel had been motivated only by his physical condition.\"He's got back pain and he couldn't train,\" the spokesman said.Iran gave judo world champion Arash Miresmaeili a $125,000 reward when he refused to fight an Israeli at the Athens Olympics.The German club said the player had pulled out because of a back injury."}