{"raw_text": "Chelsea denied by James heroics\n \n A brave defensive display, led by keeper David James, helped Manchester City hold the leaders Chelsea.\n \n After a quiet opening, James denied Damien Duff, Jiri Jarosik and Mateja Kezman, while Paul Bosvelt cleared William Gallas' header off the line. Robbie Fowler should have scored for the visitors but sent his header wide. Chelsea had most of the possession in the second half but James kept out Frank Lampard's free-kick and superbly tipped the same player's volley wide. City went into the game with the proud record of being the only domestic team to beat Chelsea this season. And there was little to alarm them in the first 30 minutes as Chelsea - deprived of Arjen Robben and Didier Drogba through injury - struggled to pose much of a threat. Indeed, it was the visitors who looked likelier to enliven a drab opening played at a lethargic pace. Shaun Wright-Phillips - watched by England boss Sven-Goran Eriksson - showed his customary trickery to burst into the right of the area and deliver a dangerous ball, which was blocked by John Terry. But Chelsea suddenly stepped up a gear and created a flurry of chances. First, Duff got round Ben Thatcher and blasted in a shot that James parried to Kezman, who turned the ball wide.\n \n Soon afterwards, Jarosik found space in the area to powerfully head Lampard's corner goalwards but James tipped the ball over. Chelsea were now looking more like Premiership leaders and James kept out Kezman's fierce drive before Bosvelt and James combined to clear Gallas' header from Duff's corner. City broke swiftly up the field and the last chance of a frenetic spell should have resulted in Fowler celebrating his 150th Premiership goal. Wright-Phillips raced down the left and crossed to Fowler but City's lone man up front, left free by Terry's slip, contrived to head wide when it seemed a breakthrough was certain. The second half started as quietly as the first, although James was forced to divert a cross from the lively Duff away from Eidur Gudjohnsen's path. There was a nasty moment for Petr Cech, looking for a ninth straight clean sheet in the league, when a series of ricochets saw Fowler chase a loose ball in the area and collide accidently with the Czech Republic stopper. Another quiet spell followed, which Duff interrupted with a surging run that was halted illegally on the edge of the penalty area by Bosvelt. Lampard stepped up to blast a shot through the wall and James somehow blocked it with his legs. Another timely challenge, this time from Richard Dunne in time added on, prevented Gudjohnsen from getting in a shot. There was still time for James to produce a sensational save to tip Lampard's volley round the post.\n \n Cech, Paulo Ferreira, Gallas, Terry, Bridge, Jarosik (Tiago 56), Lampard, Makelele, Duff, Gudjohnsen, Kezman (Cole 63).\n \n Subs Not Used: Johnson, Smertin, Cudicini.\n \n Makelele, Gudjohnsen.\n \n James, Mills, Distin, Dunne, Thatcher, Shaun Wright-Phillips, Bosvelt, Barton, Sibierski (McManaman 85), Musampa, Fowler.\n \n Subs Not Used: Macken, Weaver, Onuoha, Jordan.\n \n Bosvelt.\n \n 42,093\n \n H Webb (S Yorkshire).\n", "llama3.2:1b": "Manchester City held Chelsea despite a heroics by keeper David James. Chelsea's Arjen Robben and Didier Drogba were injured, giving City an early advantage as they created several chances in the first 30 minutes. James denied Shaun Wright-Phillips' header and blocked Robbie Fowler's shot, while Jiri Jarosik found space to power a goal but James tipped it over. The visitors then broke quickly and had several other chances, but James kept out Mateja Kezman's drives before clearing Gallas' header from Duff's corner. City continued to press in the second half, with James making several saves, including one stoppage-time block on Fowler's shot.", "llama3.2:3b": "Manchester City held Chelsea to a draw with a brave defensive display led by keeper David James. Despite being the underdogs, City kept out most of the chances and prevented Lampard from scoring. Fowler had a late chance but sent his header wide, while James made several crucial saves throughout the match.", "gemma2:2b": "Manchester City held Chelsea to a draw despite being outplayed for large periods of the game. David James made crucial saves against Chelsea attackers, including a volley from Frank Lampard and a header from Mateja Kezman.  Robbie Fowler missed a clear chance in front of goal during a frenetic period of the match before David James' saves prevented further Chelsea threats.\n", "qwen2.5:0.5b": "Chelsea managed to stay afloat despite an underwhelming performance from the visitors. James provided the heroics by leading the defense and keeping out many Chelsea players. Manchester City struggled at first but eventually held on. The game was characterized by the goalkeeper's efforts, with James providing crucial saves. City showcased their strength in the second half but failed to break through.", "qwen2.5:1.5b": "Chelsea was denied a first league victory over City by James' heroics in a defensive display led by David James.", "qwen2.5:3b": "A brave defensive display by Manchester City's David James kept Chelsea at bay during the first half. Despite a quiet start for Chelsea, James denied multiple shots including from Kezman and Fowler. In the second half, James made key saves against Lampard, Kezman, and Gudjohnsen. Chelsea struggled to find the net, with only one chance taken by Fowler resulting in him heading wide. James continued his stellar performance with a spectacular save off Lampard's volley. The game ended 0-0, with both teams performing well defensively. Manchester City entered the match as the only team to have beaten Chelsea that season.", "opencoder:1.5b": "\"After a quiet opening, James denied Damien Duff, Jiri Jarosik and Mateja Kezman while Paul Bosvelt cleared William Gallas' header off the line. Robbie Fowler should have scored for the visitors but sent his header wide. Chelsea had most of the possession in the second half but James kept out Frank Lampard's free-kick and superbly tipped the same player's volley wide. City went into the game with the proud record of being the only domestic team to beat Chelsea this season. The visitors looked likelier to enliven a drab opening played at a lethargic pace.\" \n", "smollm:1.7b": "The summary is concise and to the point, capturing the main ideas and key details of the original text. The summary does not provide any explanations or reasoning process, so it is a straightforward representation of the text. The summary includes all the main points mentioned in the original text, including the key players involved, the events that occurred during the game, and the final score.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely. Let me read through it carefully.\n\nThe main points are Chelsea's performance against Man City, their attacking displays, and the key players involved. The text talks about James dominating, clearing shots, creating chances, and how Chelsea managed to keep City close even when they were struggling defensively. They had a strong record of beating Chelsea this season, which is probably why it's considered an unusual victory.\n\nI should mention the key players like David James, Frank Lampard, Shaun Wright-Phillips, etc., but I don't need to list every sub or not-sub. Just focus on the main events and key names that matter for the summary.\n</think>\n\nChelsea defeated Man City by showcasing a daring defensive display led by David James, who efficiently cleared key shots and provided crucial chances. James kept out Frank Lampard's free-kick and tipped his shots wide, creating an unlikely win despite Chelsea's lack of attacking strength in the latter part of the game.", "tinyllama:1.1b": "As predicted by James heroics, Manchester City held Chelsea to a goalless draw in the Premier League on Sunday evening. After a quiet opening period of play, the Citizens defended well and goalkeeper David James kept out William Gallas' header from a free-kick by Robbie Foxton. The hosts had most of the possession for the second half but James denied Keyman's volley and superbly saved Foxton's attempt, while Foxton himself was denied by the woodwork in the first 30 minutes of action. City had trouble scoring and Chelsea created a few chances, including Duff's close-range shot that was blocked by James, but the hosts held firm to secure the win.", "tinydolphin:1.1b": " The game between Manchester City and Chelsea ended in a goalless draw with both teams sharing possession and creating numerous chances throughout the match. Despite having more of the ball at the beginning of the second half, Chelsea struggled to make any meaningful progress towards their goal and eventually failed to score when it mattered most. Manchester City, despite having more possession in the opening minutes of the game, struggled to create any significant chances against their opponents' excellent defense. In the end, neither team managed to break through the other's resolute defenses and ended up with a goalless draw.", "phi:2.7b": " Manchester City's keeper David James led the way with a brave defensive display that kept Chelsea's hopes of winning alive. Despite losing Arjen Robben and Didier Drogba to injury before the game, Chelsea struggled to pose a threat in the first half. They had a few chances to score but missed their opportunities. It wasn't until the second half that they started to create more chances, but Manchester City's defense held strong with James making some impressive saves. In the end, it was an exciting finish for the fans of both teams, but Manchester City came out on top in front of 42,093 people at Old Trafford.\n", "orca-mini:3b": " Chelsea was denied by James' heroics as Manchester City held the leaders to a scoreless draw in a closely contested Premier League match.", "hermes3:3b": "Manchester City's David James denies Chelsea in football match. Manchester City defended well led by keeper James and denied the league leaders several chances.", "stablelm-zephyr:3b": "Manchester City played against Chelsea, led by keeper David James, resulting in a brave defensive display that helped City maintain their position as the only domestic team to beat Chelsea this season. Despite Chelsea having most of the possession in the second half, James denied multiple shots on goal including a volley from Frank Lampard. The game saw a series of key saves and moments, with Paul Bosvelt clearing a header off the line and David James producing impressive saves against Damien Duff's shot, Jiri Jarosik's corner attempt, and Mateja Kezman's drive. Despite Chelsea creating chances towards the end of the game, City managed to hold on for a victory.", "chatgpt-4o-latest": "Manchester City held Chelsea to a draw with a strong defensive performance led by goalkeeper David James. Chelsea dominated possession and created several chances, but James made crucial saves, denying Damien Duff, Jiri Jarosik, Mateja Kezman, and Frank Lampard. Paul Bosvelt also cleared a William Gallas header off the line. Robbie Fowler missed a key opportunity for City. Despite Chelsea's second-half pressure, James continued his heroics, blocking Lampard's free-kick and making a stunning save to tip his volley wide. City's defense, including Richard Dunne's late challenge, ensured they remained the only domestic team to beat Chelsea that season.", "stablelm2:1.6b": "Manchester City's goalkeeper, David James, led a strong defensive performance to help the team hold leaders Chelsea. Despite Chelsea dominating possession in the second half, James saved Frank Lampard's free-kick and volley. Manchester City has become the only domestic team to beat Chelsea this season with their proud record of beating them. In the first 10 minutes, Chelsea struggled to pose a threat due to injuries of Robben and Drogba. The visitors looked likelier to score in that period. Afterward, Chelsea stepped up a gear and created several chances but failed to convert any. City maintained possession with minimal breaks, resulting in no clear opportunities for the team. A nervy moment occurred when Fowler tried to head a loose ball towards Gudjohnsen; however Sven-Goran Erikson's England squad watched from the sidelines. In a frantic spell of play, Manchester City had their final opportunity with Robbie Fowler. Unfortunately, Fowler missed the chance to score, and the game ended in a draw.", "granite3.1-dense:2b": "Manchester City held Chelsea, the Premier League leaders, to a 0-0 draw thanks to exceptional goalkeeping by David James. Despite having most of their team injured, including Arjen Robben and Didier Drogba, Chelsea struggled to create clear chances in the first half due to James' strong defensive performance. The match saw several near-goals and chances for both teams, with James making crucial saves from Frank Lampard's free-kicks, a powerful header by Mateja Kezman, and a volley from Lampard. City's Robbie Fowler missed an opportunity to score in the second half when he headed wide. The game was played at a lethargic pace until Chelsea increased their pressure, creating more opportunities, but James' heroics kept the score level.", "reference": "Chelsea were now looking more like Premiership leaders and James kept out Kezman's fierce drive before Bosvelt and James combined to clear Gallas' header from Duff's corner.After a quiet opening, James denied Damien Duff, Jiri Jarosik and Mateja Kezman, while Paul Bosvelt cleared William Gallas' header off the line.First, Duff got round Ben Thatcher and blasted in a shot that James parried to Kezman, who turned the ball wide.James, Mills, Distin, Dunne, Thatcher, Shaun Wright-Phillips, Bosvelt, Barton, Sibierski (McManaman 85), Musampa, Fowler.Chelsea had most of the possession in the second half but James kept out Frank Lampard's free-kick and superbly tipped the same player's volley wide.There was still time for James to produce a sensational save to tip Lampard's volley round the post.Another quiet spell followed, which Duff interrupted with a surging run that was halted illegally on the edge of the penalty area by Bosvelt.The second half started as quietly as the first, although James was forced to divert a cross from the lively Duff away from Eidur Gudjohnsen's path.Soon afterwards, Jarosik found space in the area to powerfully head Lampard's corner goalwards but James tipped the ball over.Cech, Paulo Ferreira, Gallas, Terry, Bridge, Jarosik (Tiago 56), Lampard, Makelele, Duff, Gudjohnsen, Kezman (Cole 63).A brave defensive display, led by keeper David James, helped Manchester City hold the leaders Chelsea."}