{"raw_text": "Rangers seal Old Firm win\n \n Goals from Gregory Vignal and Nacho Novo gave Rangers a scrappy victory at Celtic Park that moves them three points clear of the champions.\n \n Rangers had rarely threatened until Celtic goalkeeper Rab Douglas let defender Vignal's 25-yard drive slip through his grasp and into the net. Opposite number Ronald Waterreus had been Rangers' hero, saving superbly from Craig Bellamy and John Hartson. Striker Novo secured victory, lobbing Douglas with eight minutes remaining. It ended Celtic's 11-game unbeaten run at home in Old Firm derbies and gave Rangers manager Alex McLeish his first victory at the home of his Glasgow rivals. Celtic had won their last six meetings on their home pitch, including twice already this season. They started confidently, with new signing Bellamy, on loan from Newcastle United, given his Celtic debut up front with Wales international colleague John Hartson and Chris Sutton dropping into midfield. It took Bellamy just four minutes to threaten, taking on Marvin Andrews before delivering a low drive that was held by Waterreus at the second attempt. He had an even better chance after Hartson dispossesed Sotiris Kyrgiakos and sent his strike partner clear with only the goalkeeper to beat. But Waterreus did well to beat away Bellamy's disappointing low drive from 16 yards. Waterreus came to the rescue again when the ball fell to Hartson just inside the box and the Dutch goalkeeper made a brave block. It was an Old Firm return for Barry Ferguson as McLeish stuck by the side that thumped four goals past Hibernian. But Rangers found Celtic harder to break down and Douglas was not threatened until 10 minutes after the break. Dado Prso turned inside Neil Lennon only for the Celtic goalkeeper to beat away his powerful 18-yard drive. A great defensive header by Andrews prevented Hartson pouncing from five yards out. Hartson foxed Vignal at the edge of the Rangers box, but the striker's shot on the turn was again beaten away by Waterreus. Rangers were beginning to dominate the midfield and Vignal, collecting a knock back from Fernando Ricksen, broke the deadlock, Douglas somehow letting the Frenchman's dipping drive slip through his grasp. Novo pounced on a moments' hesitation in the Celtic defence to latch on to a long ball from Ricksen and lob the ball over the advancing Douglas. Ricksen appeared to be hit by a coin, but it could not prevent Rangers' celebrations at the final whistle.\n \n : Douglas, McNamara, Balde, Varga, Laursen, Petrov, Lennon, Sutton, Thompson, Bellamy, Hartson.\n \n Subs: Marshall, Henchoz, Juninho Paulista, Lambert, Maloney, Wallace, McGeady.\n \n : Waterreus, Hutton, Kyrgiakos, Andrews, Ball, Buffel, Ferguson, Ricksen, Vignal, Prso, Novo.\n \n Subs: McGregor, Namouchi, Burke, Alex Rae, Malcolm, Thompson, Lovenkrands.\n \n : M McCurry\n", "llama3.2:1b": "Rangers secured a scrappy 3-2 victory over Celtic at Celtic Park with goals from Gregory Vignal and Nacho Novo. Rangers had rarely threatened before Celtic's goalkeeper Rab Douglas made several crucial saves, including one from Ronald Waterreus in the first half. \n\nCeltic started strongly, but Rangers equalized through goals from Vignal and Novo after halftime, forcing a second-half comeback. The Scottish side dominated midfield and Rangers' striker Nacho Novo scored again with a long ball over Douglas's head.", "llama3.2:3b": "Rangers won 1-0 at Celtic Park in the Old Firm match. Goals from Gregory Vignal and Nacho Novo sealed the victory. Rab Douglas let Vignal's 25-yard drive slip through his grasp before Novo scored with an 8-minute remaining lob over Douglas. The win moves Rangers three points clear of Celtic, ending their 11-game unbeaten run at home in Old Firm derbies.", "gemma2:2b": "Rangers won 2-0 against Celtic at Old Firm derby in a scrappy game.  Goals by Vignal and Novo secured the win for Rangers, moving them three points ahead of the champions.  Douglas made key saves for Celtic, but was ultimately beaten by Vignal's goal and Novo's late strike. \n", "qwen2.5:0.5b": "Rangers sealed their 10th Old Firm victory of the season with a thrilling 3-0 win over Celtic. They scored goals from Nacho Novo and Gregory Vignal, while Ronald Waterreus saved well from Craig Bellamy and John Hartson. The Scottish Premiership team returned home after not winning since September, ending Celtic's 11-game unbeaten run at their ground. Rangers dominated the midfield with Dado Prso finding Neil Lennon for a goal, but they struggled to break down the defense. Novo added an equalizer in the final period as well. Defender Waterreus made some crucial saves, and goalkeeper Ronald Waterreus also played a big role. The Scottish Premiership side will now enjoy their first victory at home since October 2019.", "qwen2.5:1.5b": "Rangers won 3-1 against Celtic in the Scottish Premiership to move three points ahead of their rivals.", "qwen2.5:3b": "Rangers secured a narrow win at Celtic Park against Celtic, improving their position by three points. The match saw Rangers score twice, with Vignal and Novo scoring in the 25th and end of the first half respectively. Celtic's Rab Douglas allowed Vignal to put Rangers ahead from close range after conceding a sloppy goal. Bellamy provided early chances for Celtic but was denied by Waterreus, who also thwarted Hartson’s efforts. Late in the game, Novo finished off a counter-attack with a lob over Douglas, securing the win for Rangers. This victory halted Celtic's 11-game unbeaten run at home against Glasgow rivals.", "opencoder:1.5b": "Rangers seal Old Firm win by delivering a thrilling 11-game unbeaten run at Celtic Park. They have earned a scrappy victory with a cleverly maneuvered defensive header and the keeper's effort to save the ball in time. However, it is important to note that they had not been able to threaten despite the goalkeeper’s attempt to let Vignal slip through his grasp. Despite their loss, they continued confidently, moving ahead with new signing Bellamy, on loan from Newcastle United. The match was a series of defeats followed by victories for Alex McLeish and his home team, which finished the season. The final match saw Ricksen in a fantastic duel against Wigan, marking an Old Firm return for Barry Ferguson.\n", "smollm:1.7b": "Rangers sealed Old Firm win", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this football text. Let me read through it carefully.\n\nThe main event is Rangers winning against Celtic. They have a three-point lead. Rangers had rarely threatened until Douglas was involved in that critical drive. Watereus saved from Bellamy and Hartson. Novo scored the last goal. They also mentioned some key players like McGeady, Hartson, Vignal, etc.\n\nI need to make sure I include the goals, who started, ended, key players, and a few other notable names briefly.\n</think>\n\nRangers sealed their three-point lead over Celtic with a scrappy victory at Celtic Park. Rangers had rarely threatened until Douglas scored from a risky drive involving Vignal, who was saved by Bellamy and Hartson. Novo lifted the lid for his own goal. The game ended 11-game unbeaten for Rangers at Old Firm, moving them to Glasgow's rivals. Key players included McGeady (subbed by Marshall), Hartson, Vignal, and others. Notable goals: Douglas scoring from a dangerous move, Novo hitting the crossbar, and Watereus recovering from a poor save.", "tinyllama:1.1b": "Rangers secured their three-point lead in an Old Firestriker derby with a scrappy victory at CeltiC Park, thanks to a brace from Daed Dodo Prso and one from John Hartson. Both goals came during the second half, as Rangers' new signing Marvin Andrews set up the first goal before Bellamy converted for the second. Waterreu's mistakes kept CeltiC in the game, as the home side managed to secure a point through their goalkeeper Rab Douglas. Despite being down a man with Barry Ferguison suspended, Rangers showed more defensive resilience and were rewarded with a winning performance. The visitors' loss was further compounded by a red card for Andrews, who had scored in the first half.", "tinydolphin:1.1b": " The Old Firm derby between Celtic and Rangers ended in a 1-0 victory for the home team. Celtic manager Alex McLeish's first win at the home of his Glasgow rivals came with the help of goalkeeper Ronald Waterreus, who made some incredible saves to keep his team ahead. The match saw several chances for both teams and ended in a tie, leaving Celtic seven points clear of their opponents. This victory was achieved despite being outclassed on the day by Rangers, who had rarely threatened until Vignal's goal sent them over the line. The Rangers team started with new signing Bellamy up front, while John Hartson, Chris Sutton, and Danny MacKenzie returned to their midfield roles. It took Bellamy just four minutes to threaten, taking on Marvin Andrews before delivering a low drive that was held by Waterreus at the second attempt. He had an even better chance after Hartson dispossies him with only the goalkeeper to beat. But Waterreus did well to beat away Bellamy's disappointing low drive from 16 yards. Rangers found Celtic harder to break down and Douglas was not threatened until 10 minutes after the break, when he forced a brilliant save from Waterreus. Dado Prso also tried to find an opening for Celtic but was foiled by the heroics of Barry Ferguson and defender Neil Lennon. Despite the scoreline, Rangers' dominance in the midfield saw them have more shots and more possession, making this a competitive encounter from start to finish.", "phi:2.7b": " Rangers won a game against Celtic with goals from Gregory Vignal and Nacho Novo. The win moves them three points clear of the Champions League title race.\n", "orca-mini:3b": " Rangers won at Celtic Park with a scrappy goal by Gregory Vignal and a superb save by Rab Douglas from Nacho Novo's shot. Ronald Waterreus kept Rangers ahead with a fine save from Craig Bellamy, while John Hartson was offside in the build-up to Chris Sutton's goal for Celtic. Rangers won their first match at Celtic Park since Alex McLeish took over. Barry Ferguson returned for Rangers, but the side from Govan had to work hard to keep Celtic at bay, with Neil Lennon making a strong debut for his club. Gregory Vignal scored the only goal of the game.", "hermes3:3b": "Rangers won against Celtic with goals from Gregory Vignal and Nacho Novo, moving them ahead by 3 points.", "stablelm-zephyr:3b": "Rangers secured a victory against Celtic at Celtic Park, scoring goals from Gregory Vignal and Nacho Novo. The win moved them three points clear of the champions and ended Celtic's 11-game unbeaten run in Old Firm derbies. Goalscorers Vignal and Novo's performances were crucial, with Vignal sealing the victory by scoring a dipping drive that slipped past Rangers' goalkeeper Douglas. This result marked Alex McLeish's first win against his Glasgow rivals as manager of Rangers.", "chatgpt-4o-latest": "Rangers secured a 2-0 victory over Celtic at Celtic Park, moving three points clear of their rivals. Gregory Vignal opened the scoring with a 25-yard shot that slipped through goalkeeper Rab Douglas' grasp. Rangers' keeper Ronald Waterreus made crucial saves from Craig Bellamy and John Hartson to keep Celtic at bay. Nacho Novo sealed the win with a late lob over Douglas. The victory ended Celtic's 11-game unbeaten home run in Old Firm derbies and gave Rangers manager Alex McLeish his first win at Celtic Park.", "stablelm2:1.6b": "Rangers secure Old Firm win with goals from Gregory Vignal and Nacho Novo at Celtic Park, moving them three points clear of champions Celtic. After a goalmouth scramble, Vignal's 75th-minute strike gives Rangers the lead, followed by Novo's lobbed equalizer in the final minute. This victory extends Rangers' unbeaten run and marks manager Alex McLeish's first win at Celtic Park.", "granite3.1-dense:2b": "Rangers secured a crucial 2-0 victory over Celtic in the Old Firm derby at Celtic Park, moving three points ahead of their Glasgue rivals. Goals from Gregory Vignal and Nacho Novo decided the match. Despite Rangers' defensive resilience, Celtic started strongly, with Barry Ferguson returning to the lineup. New signing Craig Bellamy and John Hartson tested Rangers' goalkeeper Ronald Waterreus early on, but he made several crucial saves. The turning point came when Douglas's error allowed Vignal's 25-yard shot to enter the net. Novo then capitalized on a defensive lapse, scoring with eight minutes left to secure the win and end Celtic's 11-game unbeaten streak at home in Old Firm derbies for Rangers' manager Alex McLeish. This was Rangers' first triumph at Celtic Park under his leadership.", "reference": "Rangers had rarely threatened until Celtic goalkeeper Rab Douglas let defender Vignal's 25-yard drive slip through his grasp and into the net.Hartson foxed Vignal at the edge of the Rangers box, but the striker's shot on the turn was again beaten away by Waterreus.But Rangers found Celtic harder to break down and Douglas was not threatened until 10 minutes after the break.: Waterreus, Hutton, Kyrgiakos, Andrews, Ball, Buffel, Ferguson, Ricksen, Vignal, Prso, Novo.Opposite number Ronald Waterreus had been Rangers' hero, saving superbly from Craig Bellamy and John Hartson.Dado Prso turned inside Neil Lennon only for the Celtic goalkeeper to beat away his powerful 18-yard drive.Goals from Gregory Vignal and Nacho Novo gave Rangers a scrappy victory at Celtic Park that moves them three points clear of the champions.: Douglas, McNamara, Balde, Varga, Laursen, Petrov, Lennon, Sutton, Thompson, Bellamy, Hartson.It took Bellamy just four minutes to threaten, taking on Marvin Andrews before delivering a low drive that was held by Waterreus at the second attempt.Rangers were beginning to dominate the midfield and Vignal, collecting a knock back from Fernando Ricksen, broke the deadlock, Douglas somehow letting the Frenchman's dipping drive slip through his grasp."}