{"raw_text": "SFA awaits report over Mikoliunas\n \n The Scottish Football Association is awaiting referee Hugh Dallas's report before acting against Hearts winger Saulius Mikoliunas.\n \n Mikoliunas, 20, barged linesman Andy Davis, who had advised Dallas to award Rangers an injury-time penalty in Hearts's 2-1 defeat at Tynecastle. \"He was sent off for violent conduct in the 90th minute but we don't know if he did something else after the whistle. \"We don't know how many red cards he was shown,\" said an SFA statement. Hearts could also face action after three fans were arrested for throwing coins on the pitch. Rangers' striker Dad Prso was also sent off during the same incident when he received a second yellow card for wrestling the ball away from Craig Gordon and leaving the Hearts keeper on the ground. The SFA said: \"Once the referee's report comes in then we'll immediately look at things.\n \n \"We don't normally get the reports until a couple of days after the game but we're well aware of what happened here. \"Prso was sent off for two cautions, and that will just be a one-match suspension.\" The SFA is certain to come down hard on Mikoliunas after Southampton's David Prutton was banned for 10-games on Wednesday by the English FA for shoving referee Alan Wiley. Hearts' boss John Robertson said: \"Mikoliunas has thrown his chest against the assistant referee's chest and got a red card for it. \"The officials have got to take into account the fact he's a young lad. \"But people have got to take into account why he was incensed. Why were 10,000 Hearts fans incensed? \"Why did nobody from the Rangers' bench claim for a penalty kick?\" Rangers' boss Alex McLeish accepted referee Dallas had no option but to send Prso off. McLeish said: \"I'm glad to see the spirit of the players fighting to the very end - literally with Dado trying to get the ball back from Craig Gordon. \"But it was over-zealousness and I don't think Hugh had any option.\"\n", "llama3.2:1b": "The Scottish Football Association (SFA) is awaiting a report on Hearts winger Saulius Mikoliunas after he clashed with linesman Andy Davis, leading to his red carding in the 2-1 defeat at Tynecastle. The SFA also notes that Hearts fans threw coins on the pitch and Rangers' striker Dado Prso was sent off for wrestling the ball away from Craig Gordon.", "llama3.2:3b": "The Scottish Football Association is awaiting referee Hugh Dallas's report on Saulius Mikoliunas, a Hearts player who barged linesman Andy Davis in the 90th minute of the game. The SFA may take action against Mikoliunas due to violent conduct, while Rangers' striker Dad Prso was given a one-match suspension for two yellow cards. Three Hearts fans were arrested for throwing coins on the pitch during the game, which ended with a 2-1 defeat for Hearts.", "gemma2:2b": "The Scottish Football Association is waiting for referee Hugh Dallas' report on Saulius Mikoliunas's sending off during a Rangers vs. Hearts match.  Hearts also face potential punishment for fans throwing coins onto the pitch.  David Prso was sent off twice by the referee, and will miss one match. \n", "qwen2.5:0.5b": "The Scottish Football Association is awaiting referee Hugh Dallas's report before acting against Hearts winger Saulius Mikoliunas, who reportedly barged linesman Andy Davis during the game at Tynecastle. Rangers' striker Dad Prso was also sent off for a second yellow card for wrestling the ball away from Craig Gordon and leaving the keeper on the ground. Rangers manager John Robertson stated that David Prutton was banned for 10 games by the English FA after being charged with shoving referee Alan Wiley. The Scottish Football Association will look at these reports when it receives one.", "qwen2.5:1.5b": "Scottish Football Association awaits referee's report on Hearts player Mikoliunas for potential ban, while Rangers striker Prso faces a one-match suspension after red card incident involving an assistant referee.", "qwen2.5:3b": "The Scottish Football Association is awaiting referee Hugh Dallas's report regarding Saulius Mikoliunas, who received a red card for violent conduct during Hearts' 2-1 defeat at Tynecastle. Rangers striker Dad Prso was also sent off after being cautioned twice. Three fans were arrested for throwing coins on the pitch. While Mikoliunas may receive harsher punishment due to David Prutton's ten-match ban, Prso could face a one-match suspension. Alex McLeish defended Dallas's decision and criticized fans' lack of protest during the incident, which involved Rangers receiving an injury-time penalty call disputed by both teams.", "opencoder:1.5b": "SFA awaits report over Mikoliunas\n\nThe Scottish Football Association is awaiting referee Hugh Dallas's report before acting against Hearts winger Saulius Mikoliunas.\n\nMikoliunas, 20, barged linesman Andy Davis. Advising Dallas to award Rangers an injury-time penalty in Hearts' 2-1 defeat at Tynecastle. \"He was sent off for violent conduct in the 90th minute but we don't know if he did something else after the whistle.\" We do not know how many red cards he was shown.\n\nHearts could also face action after three fans were arrested for throwing coins on the pitch. Rangers' striker Dad Prso was also sent off during the same incident when he received a second yellow card for wrestling the ball away from Craig Gordon and leaving the Hearts keeper on the ground.\n\nThe SFA said: \"Once the referee's report comes in then we'll immediately look at things.\n\nWe don't normally get the reports until a couple of days after the game but we're well aware of what happened here. Mikoliunas was sent off for two cautions, and that will just be a one-match suspension.\" The SFA is certain to come down hard on Mikoliunas after Southampton's David Prutton was banned for 10-games on Wednesday by the English FA for shoving referee Alan Wiley.\n\nHearts' boss John Robertson said: \"Mikoliunas has thrown his chest against the assistant referee's chest and got a red card for it. The officials have got to take into account the fact he's a young lad.\"\n\nBut people have got to take into account why he was incensed. Why did nobody from the Rangers' bench claim for a penalty kick? Rangers' boss Alex McLeish accepted referee Dallas had no option but to send Prso off. McLeish said: \"I'm glad to see the spirit of the players fighting to the very end - literally with Dado trying to get the ball back from Craig Gordon.\n\nBut it was over-zealousness and I don't think Hugh had any option.\"\n", "smollm:1.7b": "The summary is concise, preserving key ideas and details:\n\n1. The Scottish Football Association (SFA) awaits a referee's report before acting against Hearts' winger Saulius Mikoliunas.\n2. Mikoliunas was sent off for violent conduct in the 90th minute but we don't know if he did something else after the whistle.\n3. Mikoliunas could also face action after three fans were arrested for throwing coins on the pitch. Rangers' striker Dad Prso was also sent off during the same incident when he received a second yellow card for wrestling the ball away from Craig Gordon and leaving the Hearts keeper on the ground. The SFA said: \"Once the referee's report comes in then we'll immediately look at things.\"\n4. We don't normally get the reports until a couple of days after the game but we're well aware of what happened here.\n5. Mikoliunas has thrown his chest against the assistant referee's chest and got a red card for it. The officials have got to take into account the fact he's a young lad. But people have got to take into account why he was incensed. Why were 10,000 Hearts fans incensed? Why did nobody from the Rangers' bench claim for a penalty kick?\n6. We're grateful to see the spirit of the players fighting to the very end - literally with Dado trying to get the ball back from Craig Gordon. But it was over-zealousness and we don't think Hugh had any option.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize the provided text into a concise summary without explanations or formatting. Let me read through each part carefully.\n\nThe main topic is about a report on Mikoliunas by the Scottish Football Association (SFA). The SFA is waiting for a referee's report from Hugh Dallas before dealing with Hearts' winger. They mention several key points: Mikoliunas was sent off for violent conduct but didn't get red cards, and two of his teammates were also sent off after receiving yellow cards each.\n\nThere are other details too, like Hearts facing possible action after fans were arrested for throwing coins. Rangers had a player sent off after another yellow card. SFA said they process the report once it comes in, just immediate action based on Dallas's report.\n\nSouthampton banned referee Alan Wiley by giving him 10 games for shoving referee. It was mentioned why heart fans got angry and why Rangers didn't claim penalties. McLeish agreed that players were fighting but over-zealousness from the managers wasn't okay.\n\nI need to capture all these points concisely, focusing on the key events without extra details. Make sure to include the referee's report delay, the specifics of Mikoliunas' actions, the other fans' situation, and the decisions about players.\n</think>\n\nThe Scottish Football Association is awaiting referee Hugh Dallas’s report before dealing with Hearts’ winger Saulius Mikoliunas. Mikoliunas was sent off for violent conduct but not red cards. Two teammates received yellow cards each. Hearts faced potential action after fans were arrested for throwing coins. Rangers had a player sent off after receiving another yellow card. The SFA processed the referee's report once it arrives, and they agreed to act based on Dallas’s findings. Southampton banned Alan Wiley by banning him for 10 games. Mikoliunas was thrown out due to his anger, with fans in Hearts being angry and Rangers not claiming penalties. McLeish acknowledged players fighting but suggested managers overstepped their duties.", "tinyllama:1.1b": "The Scottish Football Association has awaited a report from Hugh Dallas on the incident between Heart of Midlothian player Saulius Mikoliunas, who was sent off for violent conduct in the Tynecastle match after he grabbed and wrestled away a Heart of Midlothian player. The report will be considered by the SFAs after three fans were also arrested for throwing coin to distract the referee. The Scottish FA is expected to impose severe sanctions on Mikoliunas, who has already been suspended for one match following Southampton's decision to ban David Prutton for his brutish tackle on Alan Wilde. Heart of Midlothian boss Alex McLeish expressed relief that the Spirit of the Players (SoP) have fought to the very end and conceded that Da'do Prso was sent off for a second yellow card, but also stated that referee Hugh Dallas had no choice but to send Mikoliunas off.", "tinydolphin:1.1b": " The Scottish Football Association (SFA) is currently awaiting a report by referee Hugh Dallas about the incident involving Hearts winger Saulius Mikoliunas. The report is expected to be released in due course, but in the meantime, the SFA is determined to act against Mikoliunas if there are any further incidents. SFA president John Robertson has stated that he believes Mikoliunas should not have been sent off for violent conduct, but his actions could also lead to consequences for Hearts. In the case of Rangers' striker Dad Prso, three fans were arrested for throwing coins on the pitch after their team's match against Hearts. The SFA is expected to look into any disciplinary action that may be necessary following these incidents.", "phi:2.7b": " The Scottish Football Association (SFA) is waiting for a report on referee Hugh Dallas's red carding of Hearts winger Saulius Mikoliunas before taking action. Both teams will also face consequences after fans were arrested for throwing coins, with both Rangers and Hearts receiving suspensions for their actions. It's expected that the SFA will be strict on Mikoliunas following Southampton's David Prutton's 10-game ban by the English FA for shoving a referee.\n", "orca-mini:3b": " The Scottish Football Association is waiting for referee Hugh Dallas's report before taking action against Hearts winger Saulius Mikoliunas. Mikoliunas pushed the assistant referee's chest during a collision, which led to him receiving a red card for violent conduct in the 90th minute. The incident happened when Rangers' striker Dad Prso was also sent off for wrestling the ball away from Craig Gordon and leaving the Hearts keeper on the ground. The SFA statement said that they will investigate once the report comes in, and if necessary, they will take tough action against Mikoliunas. John Robertson, the boss of Hearts, expressed his dissatisfaction with the red card decision, but he accepted that the officials had no option but to send Mikoliunas off.", "hermes3:3b": "Herts' SFA waits Dallas's report on Mikoliunas's potential disciplinary for violent conduct during game.", "stablelm-zephyr:3b": "The Scottish Football Association (SFA) is waiting for referee Hugh Dallas's report regarding Hearts winger Saulius Mikoliunas, who was sent off for violent conduct in the 90th minute of their 2-1 defeat at Tynecastle. The SFA is also investigating an incident involving fans throwing coins on the pitch and Hearts striker Dad Prso being sent off for two cautions, which will result in a one-match suspension. Mikoliunas' actions against assistant referee Andy Davis led to his red card and ongoing investigation by the SFA.", "chatgpt-4o-latest": "The Scottish Football Association (SFA) is awaiting referee Hugh Dallas's report before taking action against Hearts winger Saulius Mikoliunas, who was sent off for violent conduct after barging linesman Andy Davis. The incident occurred after Davis advised awarding Rangers a late penalty in their 2-1 win over Hearts. The SFA is expected to take strict action, especially after a similar case in England resulted in a 10-game ban. Hearts could also face consequences after three fans were arrested for throwing coins onto the pitch. Rangers' striker Dado Prso was also sent off for a second yellow card during the same incident. Hearts manager John Robertson defended Mikoliunas, citing his frustration, while Rangers boss Alex McLeish acknowledged Prso's dismissal as justified. The SFA will review the situation once the referee's report is received.", "stablelm2:1.6b": "The Scottish Football Association is waiting for a report from referee Hugh Dallas before taking action against Hearts winger Saulius Mikoliunas. Mikoliunas allegedly barged linesman Andy Davis during a game in 2011, resulting in him being sent off for violent conduct. SFA awaits the report but will take action after examining the situation. The incident involving Rangers' striker Dad Prso has already led to an English FA ban for Southampton's David Prutton, who shoved referee Alan Wiley. Hearts could also face action due to fans throwing coins on the pitch and potential disciplinary issues.", "granite3.1-dense:2b": "The Scottish Football Association (SFA) is holding off on punishing Hearts winger Saulius Mikoliunas, 20, until receiving referee Hugh Dallas's report. Mikoliunas received a red card for violently charging linesman Andy Davis, who advised Dallas to award Rangers an injury-time penalty during their 2-1 match at Tynecastle. The SFA will also consider potential actions against Hearts fans arrested for throwing coins on the pitch and Rangers' striker Dad Prso, who was sent off for a second yellow card after wrestling the ball from Craig Gordon. Despite the incidents, Mikoliunas' actions were deemed excessive. The SFA is expected to impose a severe punishment on Mikoliunas, possibly mirroring Southampton's David Prutton's 10-game ban for shoving referee Alan Wiley. Hearts' boss John Robertson argued that Mikoliunas' actions were understandable given the intense crowd's frustration, while Rangers' boss Alex McLeish agreed with Dallas's decision, deeming it a matter of over-zealousness rather than bias.", "reference": "\"We don't know how many red cards he was shown,\" said an SFA statement.Rangers' striker Dad Prso was also sent off during the same incident when he received a second yellow card for wrestling the ball away from Craig Gordon and leaving the Hearts keeper on the ground.\"But people have got to take into account why he was incensed.\"But it was over-zealousness and I don't think Hugh had any option.\"Hearts' boss John Robertson said: \"Mikoliunas has thrown his chest against the assistant referee's chest and got a red card for it.\"He was sent off for violent conduct in the 90th minute but we don't know if he did something else after the whistle.\"Prso was sent off for two cautions, and that will just be a one-match suspension.\"Rangers' boss Alex McLeish accepted referee Dallas had no option but to send Prso off."}