{"raw_text": "Souness eyes summer move for Owen\n \n Newcastle boss Graeme Souness is lining up a summer move for England and Real Madrid striker Michael Owen.\n \n He sees Owen as the ideal replacement for Alan Shearer, who is due to retire in the summer, although he hopes to persuade Shearer to carry on. \"Michael is in the category of players who would excite the fans and we're monitoring him,\" he told BBC Newcastle. \"He is a great centre-forward and only 25 but I don't think we're the only ones monitoring the situation at Real.\" Souness has also hinted he thinks Shearer may carry on despite his stated intent to retire at the end of the season. He believes the prospect of breaking Jackie Milburn's club scoring record may influence the striker's decision.\n \n Milburn scored 200 league and cup goals between 1946 and 1957, while Shearer currently has 187 goals to his name. \"Without giving too much away, I am confident he will be here next season,\" said Souness. \"I can't imagine him leaving without breaking Jackie Milburn's scoring record.\" Souness also revealed he tried to bring back Nolberto Solano during the January transfer window. The Peruvian international was sold to Aston Villa a year ago but in the phone-in for BBC Newcastle, Souness said tried to re-sign him, but Villa were not interested in selling.\n \n The former Rangers and Liverpool boss is also looking to bring in a number of new acquisitions once the current campaign has been completed. \"I'm after three, four or five new players in the summer - we have got lots of targets,\" he said. \"Don't think we will wait to the last day of the season to say: `Who are we going to target now?\"'\n", "llama3.2:1b": "Graeme Souness is considering a move for Michael Owen due to his potential replacement for Alan Shearer, who is set to retire. Souness believes Owen has the ability to excite fans and wants him to stay with Newcastle. He also thinks Shearer may continue despite saying he intends to retire at the end of the season.", "llama3.2:3b": "Graeme Souness is planning a summer move for England and Real Madrid striker Michael Owen as a potential replacement for Alan Shearer, who may consider staying if he breaks Jackie Milburn's scoring record. Souness also tried to re-sign Nolberto Solano during the January transfer window but was unsuccessful.", "gemma2:2b": "Graeme Souness is interested in signing Michael Owen as a replacement for Alan Shearer, who is expected to retire. Souness believes Owen would excite fans and that he may convince Shearer to stay on. He also hinted at Shearer potentially staying to break Jackie Milburn’s scoring record, which currently stands at 200 goals.  Souness attempted to re-sign Nolberto Solano during the January transfer window but was unsuccessful. Souness plans to recruit three to five new players in the summer. \n", "qwen2.5:0.5b": "Owen is an England striker currently under 25 and could be a replacement for Shearer, who is set to retire in summer. Souness has also suggested Shearer might continue despite his stated intention to retire at the end of the season. Souness wants To solve this problem, he suggests Milburn, a former Newcastle United player who has scored 200 league and cup goals between 1946 and 1957, could join Newcastle. Also, he plans to bring in new acquisitions such as Nolberto Solano and potentially some players from Aston Villa that the Peruvian international was sold to, in his summer moves.", "qwen2.5:1.5b": "Graeme Souness is considering a summer move for England striker Michael Owen, seeing him as an ideal replacement for Alan Shearer due to his youth and potential impact. He also hints that Shearer might extend his career despite retiring at the end of the season due to breaking Jackie Milburn's club scoring record. Souness also discusses trying to bring in new players before the campaign concludes, mentioning a desire to add three to five players during the transfer window.", "qwen2.5:3b": "Newcastle boss Graeme Souness is considering a summer move for England striker Michael Owen, seeing him as Alan Shearer's replacement due to retire in the summer. Souness believes Shearer may stay at Newcastle, possibly influenced by breaking Jackie Milburn's scoring record. Despite this, Souness has also hinted he will try to re-sign Nolberto Solano from Aston Villa. He is set to bring in three to five new players in the summer, not waiting until the end of the season.", "opencoder:1.5b": "Summarizing the following text:\n\nSouness looks forward to a summer move with the team and finds Owen an appealing replacement.\n\nOwen, a mid-range forward with only 25 years left, is known for his exceptional attacking skills and forward-thinking personality. He has scored a league and cup record of 200 goals in the club's match history. Despite the prospect of breaking Milburn's scoring record, Souness believes Owen will be ready to play the season. Additionally, Souness hints that Shearer may continue despite his stated intention to retire.\n\nSouness also shows a keen eye for a talented Peruvian international during the January transfer window and has tried to bring back Nolberto Solano during the campaign. Despite Villa's interest in selling, Owen has been an effective defender for them as they have shown consistency and potential in defending themselves.\n", "smollm:1.7b": "Owen is looking for a replacement for Alan Shearer who would be suitable for England and Real Madrid striker Michael Owen. He believes Owen may carry on despite his stated intent to retire at the end of the season. He thinks that breaking Jackie Milburn's scoring record may influence Owen's decision.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving key ideas and details. Let me read through it carefully.\n\nThe main points are about Graeme Souness moving Michael Owen for Real Madrid after Alan Shearer's retirement. He says he sees Owen as a replacement who excites fans, especially at Newcastle and Real Madrid. He mentions that he hopes Shearer continues even though he was planning to retire. There's some discussion about the potential impact of breaking Milburn's scoring record on his decision.\n\nAlso, Souness is considering bringing in new players after this move. He plans to bring back Solano from Villa and maybe others. The text also mentions how Owen excels as a centre-forward and his age advantage.\n\nI should make sure I capture all these details without adding any extra information. Keep the summary straightforward but include the main events and quotes.\n</think>\n\n Graeme Souness is moving Michael Owen for Real Madrid after Alan Shearer's retirement. He sees Owen as a replacement excelling at Newcastle and Real Madrid, aiming to break Milburn's scoring record. He hopes Shearer continues despite planning to retire. Souness also plans to bring in new players after the move, including Solano from Villa.", "tinyllama:1.1b": "The headline presents a brief summary of a news article featuring Newcastle United star player Graeme Souness and Real Madrid ace Michael Owen. The article highlights Souness' interest in potentially lining up with the England international, as well as his belief that Sheawerr may retire from football despite his stated intention to continue playing for another season. The article also mentions that Souness has previously attempted to bring back a player he sold during the January transfer window but was not successful in his bid. Overall, the headline highlights the potential acquisitions of new players before the end of the current campaign, with a focus on the possibility of bringing in three, four or five targets.", "tinydolphin:1.1b": " \n Souness: We are lining up a summer move for Michael Owen, who is currently out injured and is expected to retire at the end of this season. Owen could be an excellent replacement for Alan Shearer. Graeme Souness is monitoring the situation closely and believes that the 25-year-old's skills and capabilities can excite the Newcastle fans. He thinks it would be a great opportunity for Shearer to continue playing at the top level, despite his stated intention to retire at the end of the season. Souness is also hoping that Milburn's record of scoring 200 league goals between 1946 and 1957 may influence Shearer's decision to continue playing.", "phi:2.7b": " England and Real Madrid's Michael Owen is being considered as a replacement for Alan Shearer, who is due to retire in the summer. Newcastle boss Graeme Souness believes Owen would be the ideal choice to excite fans but hopes to convince Shearer to continue playing. He also hinted that shearer may carry on despite his stated intent to retire. Souness is monitoring other potential replacements like Nolberto Solano, although he was not interested in selling him a year ago. Once the current campaign has been completed, Souness plans to bring in at least three new players for the next season.\n", "orca-mini:3b": " Newcastle boss Graeme Souness is interested in signing England and Real Madrid striker Michael Owen as a replacement for Alan Shearer, who plans to retire in the summer. Souness sees Owen as an ideal center-forward and is monitoring his situation at Real. He also believes that breaking Jackie Milburn's club scoring record may influence Shearer's decision to carry on playing. Souness has tried to re-sign Nolberto Solano during the January transfer window but was not successful in Aston Villa. He is looking for three, four or five new players in the summer and already has several targets in mind.", "hermes3:3b": "Hes moving for Owen\n- Souness wants Newcastle to sign Michael Owen\n- Sees Owen as potential replacement for retiring Alan Shearer\n- Hopes Shearer may change mind about retirement\n- Milburn's record might influence Shearer's decision\n- Souness also wants 3-4 new players in summer", "stablelm-zephyr:3b": "Newcastle manager Graeme Souness plans to bring in Michael Owen, an England and Real Madrid striker, as a replacement for retiring Alan Shearer. Souness hopes that Owen will excite fans and sees him as the ideal choice despite monitoring other potential players. He also hints at Shearer possibly carrying on playing despite his stated retirement. Furthermore, Souness reveals plans to bring in three or five new players once the current campaign concludes.", "chatgpt-4o-latest": "Newcastle manager Graeme Souness is planning a summer move for Real Madrid and England striker Michael Owen as a potential replacement for Alan Shearer, who is set to retire. However, Souness hopes Shearer may continue playing, especially with the chance to break Jackie Milburn's club scoring record. Shearer currently has 187 goals, while Milburn scored 200. Souness also attempted to re-sign Nolberto Solano from Aston Villa in January but was unsuccessful. Additionally, he aims to bring in several new players in the summer, stating that Newcastle has multiple transfer targets.", "stablelm2:1.6b": "Newcastle boss Graeme Souness aims for a summer move for Michael Owen, hoping to replace retiring Alan Shearer. He sees Owen as exciting for fans and a great center-forward but acknowledges others are monitoring his situation. Souness also hints at Shearer's potential decision due to breaking Jackie Milburn's club scoring record. He will not guess what influence this could have on Shearer's decision. Souness mentions he tried to re-sign Nolberto Solano during the January transfer window, but Aston Villa was not interested in selling him. Souness aims to add around 3-5 new players in the summer and doesn..\n  \nGraeme Souness, Newcastle boss, aims for a summer move for Michael Owen to replace Alan Shearer who's retiring. He thinks Owen is exciting for fans and a great center-forward; however, he mentions others are monitoring his situation. Souness hopes to persuade Shearer to continue but may reveal influence on his decision due to breaking Jackie Milburn's club scoring record. He won't guess how that will impact Shearer's decision. Souness tried to re-sign Nolberto Solano in January, but Aston Villa wasn't interested in selling him. Souness wants 3-5 new players in the summer and aims not to target them after the season ends.", "granite3.1-dense:2b": "Newcastle United manager Graeme Souness is considering a summer transfer for England and Real Madrid striker Michael Owen, who could potentially replace retiring star Alan Shearer. Souness believes Owen, at 25, would excite fans and is not the only club monitoring his situation. Despite Shearer's stated intent to retire, Souness is optimistic he'll stay, motivated by the chance to surpass Jackie Milburn's record of 200 league and cup goals. Shearer currently holds 187 goals.\n\nSouness also attempted to re-sign Peruvian Nolberto Solano during January but was unsuccessful due to Aston Villa's reluctance to sell. For the upcoming season, Souness aims to sign three to five new players, indicating a proactive transfer strategy.", "reference": "Souness has also hinted he thinks Shearer may carry on despite his stated intent to retire at the end of the season.Newcastle boss Graeme Souness is lining up a summer move for England and Real Madrid striker Michael Owen.\"Without giving too much away, I am confident he will be here next season,\" said Souness.The Peruvian international was sold to Aston Villa a year ago but in the phone-in for BBC Newcastle, Souness said tried to re-sign him, but Villa were not interested in selling.Souness also revealed he tried to bring back Nolberto Solano during the January transfer window.He sees Owen as the ideal replacement for Alan Shearer, who is due to retire in the summer, although he hopes to persuade Shearer to carry on."}