{"raw_text": "Arsenal through on penalties\n \n Arsenal win 4-2 on penalties\n \n The Spanish goalkeeper saved from Alan Quinn and Jon Harley as Arsenal sealed a quarter-final trip to Bolton with a 4-2 victory on penalties. Lauren, Patrick Vieira, Freddie Ljungberg and Ashley Cole scored for Arsenal, while Andy Gray and Phil Jagielka were on target for the Blades. Michael Tonge and Harley wasted chances for the underdogs, but Paddy Kenny was inspired to keep Arsenal at bay. Arsenal, stripped of attacking talent such as Thierry Henry and Dennis Bergkamp, partnered 17-year-old Italian striker Arturo Lupoli with Ljungberg up front. It was a revamped Arsenal line-up, and they were almost a goal behind within seconds as Tonge wasted a glorious chance. Gray ran free down the right flank, and his cross left Tonge with the simplest of chances, but he blazed over the top from six yards.\n \n Arsenal were barely seen as an attacking force in the opening 45 minutes, although Ljungberg turned a half-chance wide after good work by Cesc Fabregas. Arsene Wenger introduced Quincy Owusu-Abeyie for the ineffective Lupoli at half-time, and the pacy Dutch youngster had an immediate impact. He ran clear after good work by Mathieu Flamini, but his finish was tame and Kenny saved easily. Owusu-Abeyie then fired in a testing cross, which was met by Fabregas, and it needed a desperate clearance by Kenny's legs to save the Blades. Arsenal were now totally dominant, and were desperately unlucky not to take the lead after 62 minutes when Fabregas crashed a rising drive against the bar from 20 yards. It then took a brilliant tackle by Jagielka to deny Ljungberg as he was poised to strike. Arsenal continued to press, and once again Kenny was called into action with eight minutes left, diving low to clutch another close-range effort from Fabregas. Neil Warnock's side almost snatched victory in the dying seconds when Derek Geary's cross found Harley at the far post, but his diving header was brilliantly turned over by Almunia. Owusu-Abeyie's pace was causing all sorts of problems for the Blades, and as extra-time began, another surging run into the penalty area almost set up a chance for Ljungberg. Pascal Cygan missed Arsenal's best chance after 106 minutes, blazing across the face of goal when he was unmarked at the far post. Arsenal sent on Jeremie Aliadiere with seven minutes of extra-time left, and he almost broke the deadlock with his first touch. Kolo Toure's misplaced free-kick landed at his feet, but Kenny once again blocked from a tight angle. Arsenal laid siege to Sheffield United's goal in the dying minutes, but they somehow held on to force penalties. Almunia was then Arsenal's hero as another brave Blades cup campaign came to a losing end.\n \n Kenny, Geary, Morgan, Bromby, Harley, Liddell, Montgomery, Jagielka, Thirlwell, Tonge (Quinn 97), Gray.\n \n Subs Not Used: Francis, Kabba, Shaw, Haystead.\n \n Morgan.\n \n Almunia, Lauren, Cygan, Senderos, Cole, Fabregas (Toure 90), Vieira, Flamini (Aliadiere 113), Clichy, Lupoli (Owusu-Abeyie 45), Ljungberg.\n \n Subs Not Used: Eboue, Taylor.\n \n Clichy, Lauren, Senderos.\n \n 27,595\n \n P Dowd (Staffordshire).\n", "llama3.2:1b": "Arsenal won 4-2 on penalties against Bolton after a 4-2 victory in extra time. The team consisted of Lauren, Patrick Vieira, Freddie Ljungberg, and Ashley Cole, with Arturo Lupoli scoring for Arsenal. The match featured a revamped line-up that included 17-year-old Italian striker Arturo Lupoli at the forefront. Andy Gray's goal was disallowed due to a foul on Paddy Kenny.", "llama3.2:3b": "Arsenal defeated Sheffield United 4-2 on penalties after the match ended 0-0 in extra time. The Gunners saw little attacking threat in the opening half but were revitalized by the introduction of Quincy Owusu-Abeyie at halftime. Arsenal dominated the second half, with Ashley Cole and Freddie Ljungberg scoring before Cesc Fabregas hit the bar twice, while Pascal Cygan and Jeremie Aliadiere both missed chances. Almunia saved Michael Tonge's penalty to seal the victory for Arsenal, who advanced to the quarterfinals.", "gemma2:2b": "Arsenal won a penalty shootout against Sheffield United to advance to the FA Cup quarterfinals.  They secured the victory with a 4-2 scoreline on penalties after a closely contested match. Arsenal's young squad overcame the loss of key players such as Thierry Henry and Dennis Bergkamp. Despite a sluggish start, they eventually dominated the game in extra time and ultimately won on penalties. Key moments included Almunia's heroics in goal for Arsenal,  a missed chance by Pascal Cygan, and crucial saves from Kenny. \n", "qwen2.5:0.5b": "Arsenal won the Premier League on penalties, leading Bolton to a quarter-final game. Arsenal's attacking play was hindered by underperforming players like Thierry Henry and Dennis Bergkamp. Arturo Lupoli played a crucial role for the young team.", "qwen2.5:1.5b": "Arsenal wins 4-2 on penalties after beating Bolton 3-1 in the first leg. Arsenal's revitalized lineup featuring Arturo Lupoli and Quincy Owusu-Abeyie impresses, particularly goalkeeper Michael Tonge who saves crucial penalty attempts. Sheffield United's Derek Geary missed a last-minute penalty that would have ended Arsenal's campaign.", "qwen2.5:3b": "Arsenal won a quarter-final match against Sheffield United on penalties with a 4-2 scoreline. The game was tight until the shootout where Arsenal's Lauren, Vieira, Ljungberg, and Ashley Cole scored while Sheffield United’s Andy Gray and Phil Jagielka found the back of the net. Arsenal, led by their revamped lineup featuring Arturo Lupoli and new signing Quincy Owusu-Abeyie, dominated play but were unlucky not to take an early lead. Their chances were thwarted by Michael Tonge's miss and Paddy Kenny’s heroics in saving penalty attempts. The game ended with Arsenal winning 4-2 on penalties, showcasing a resilient effort despite being stripped of some attacking talent like Thierry Henry and Dennis Bergkamp.", "opencoder:1.5b": "Arsenal have won the penalty shootout in the most significant way - they scored for four different teams- England, France, Holland and the Netherlands. The match was between Alan Quinns and Jon Harley who took 2 goals on penalties. \n\nThe Spanish goalkeeper saved the game by scoring a penalty against them. He then allowed for an entire quarter-final trip to Bolton, where Arsenal were ahead of the competition by 4-2 points.\n\nScoring player injuries, including Thierry Henry, Dennis Bergkamp and Paddy Kenny who helped finish the match in under 45 minutes, added another layer of complexity. \n\nArsenal had been stripping away attacking talent from their lineup for over a decade, with them taking three goals in three tries within the first half. They were now completely dominant, and they were almost a goal behind after 62 minutes when Fabregas crashed a rising drive against the bar from 20 yards. \n\nIn the match, Lupoli (Ljungberg) was able to clear a penalty shot down by Cesc Fabregas, who dived low for the second chance with eight minutes left. Almunia's side won 4-2 points and then won another penalty in 113 minutes, but they somehow held on to force penalties. \n\nAlmunia had scored against Sheffield United in the dying minutes and was the final Blades to make it through the match - who didn't get a chance to score? \n\nOverall, Arsenal have won many things in footballing competitions, with their scoring record and performance providing a solid stand-off against the likes of England, France, Holland, and the Netherlands.\n", "smollm:1.7b": "The summary should be concise and to the point, preserving the key ideas and details of the original text. Here is a possible summary:\n\nArsenal won 4-2 on penalties against Bolton in their quarterfinal match. Arsenal were able to win due to good attacking play from Ljungberg and Fabregas, who made effective runs down the left flank. The Spanish goalkeeper saved from Alan Quinn and Jon Harley as Arsenal sealed a quarter-final trip to Bolton with a 4-2 victory on penalties.\n\nThe summary should be clear and easy to understand, without using unnecessary words or phrases. It should also provide an accurate representation of the original text, but in a shorter form.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text about Arsenal's penalty shootout match. The user wants a concise summary with key points preserved.\n\nFirst, the article talks about Arsenal winning the 4-2 penalty shootout against Manchester United in their quarter-final. It mentions specific players like KevinisValid (Kenny), PhilGeary, Morgan, and so on who played in. \n\nI should include the main events: Arsenal's attack, the goalkeeper saving chances, and key players involved. Also, I need to note who was substituted out. The summary should be around 50 words.\n\nLet me list the important details:\n\n- Arsenal wins 4-2.\n- Keystakes from KevinisValid, PhilGeary, Morgan, Bromby, Harley, Liddell, Montgomery, Jagielka, Thirlwell, Tonge.\n- Subs not used: Francis, Kabba, Shaw, Haystead, Eboue, Taylor, Clichy. \n- Key players in subs: Morgan, Lauren, Cygan, Senderos.\n\nI'll structure the summary to include the main outcome, key players with their stats, and the substitutions that were allowed.\n</think>\n\nArsenal secured a 4-2 penalty shootout victory against Manchester United, showcasing a resilient team led by KevinisValid (Kevin Jordan) and PhilGeary. The stylish Kevin Jordan saved crucial chances, while Morgan and Bromby provided solid contributions. Key substitutes included Lauren, Cygan,Senderos, and Cole, allowing the goalless team to push through despite starting with Francis (Francis Keagles) and Kabba (Kabby King).", "tinyllama:1.1b": "Arsenal through on penalties after a 4-2 victory over Bolton in the quarterfinal of the UEFA Europa League. The Spanish goalkeeper saved from Alan Quinn and Jon Harley, while Phil Jagielka was the standout player for Arsenal. Michael Tonge and Harley wasted opportunities for the underdogs, but Paddy Kenny was a vital performer in the line-up. Arsenal played an overhauled lineup with Italian striker Arturo Luppoli partnered by Ljuangberg up front, and it led to them barely seeing an attacking force in the first 45 minutes. Arsenal scored two quick goals within seconds of each other after Tonge's cross was wrong-footed, but they could not find another goal against slow midfield play and poor finishing. Arsenal introduced Quincy Owusu-Abeyie for the ineffective Luppoli at half-time, and he quickly made an impact as he fired in a testing cross that was met by Fabregas's rising drive for an easy save from Kenny. Despite being down to 10 men due to referee's red card, Arsenal were dominant and dominated the final 62 minutes before penalties were needed. Arsenal was unlucky not to take the lead early on, but Kenny was called into action with eight minutes remaining when Ljungberg headed at Almunia in goal. It took a brilliant tackle from Jagielka to deny Fabregas, but the keeper saved another close-range effort from Owusu-Abeyie and a diving header by Harley in extra-time. Arsenal's pace troubled Bolton for most of their second half, while Almunia saved from two penalties to secure victory over the underdogs.", "tinydolphin:1.1b": " Final summary: Arsenal secured a 4-2 victory in the quarter-finals over Bolton Wanderers with goals from Ashley Cole, Alan Quinn, and an own goal by Cesc Fabregas. The Spanish goalkeeper, Alan Quinn, made 10 saves to secure the win for the Gunners.", "phi:2.7b": " Arsenal win 4-2 on penalties after a goalless first half against Sheffield United in the third round of the FA Cup. Despite being stripped of their star players, the team was bolstered by the addition of Italian striker Arturo Lupoli and 17-year-old midfielder Quincy Owusu-Abeyie. The game went into extra time, during which Arsenal's pace caused problems for the Blades' goalkeeper, while Ljungberg scored a penalty in injury time to secure a spot in the quarter-finals.\n", "orca-mini:3b": " Arsenal won 4-2 on penalties after a 1-1 draw with Sheffield United in the FA Cup quarter-final. The Blades had a chance to take the game into extra time but Pascal Cygan missed a header, and Almunia was Arsenal's hero. It was a revamped Arsenal line-up with Michael Tonge on as a substitute, while Arturo Lupoli was replaced by Quincy Owusu-Abeyie. Arsenal were without their attacking stars Thierry Henry and Dennis Bergkamp, but they still had Cesc Fabregas, who scored one goal. Mathieu Flamini, Jeremie Aliadiere, and Kolo Toure also scored for the Gunners. Pascal Cygan and Derek Geary missed chances for Sheffield United, while Michael Tonge wasted a gilt-edged chance for the underdogs. Almunia denied Sheffield United in extra-time with some heroics, and Arsenal won on penalties.", "hermes3:3b": "Arsenal won quarter-final match against Sheffield United through penalty shootout, with final score 4-2 in favor of Arsenal.", "stablelm-zephyr:3b": "Arsenal secured a 4-2 victory on penalties against Sheffield United, advancing to the quarter-finals. The match saw goals from Lauren, Patrick Vieira, Freddie Ljungberg, and Ashley Cole for Arsenal, while Andy Gray and Phil Jagielka scored for the Blades. Arsenal, without key attackers Thierry Henry and Dennis Bergkamp, fielded a revamped lineup featuring 17-year-old striker Arturo Lupoli in partnership with Ljungberg. The match saw several opportunities missed by both teams, with Almunia earning Arsenal's hero title after a close call for Sheffield United.", "chatgpt-4o-latest": "Arsenal advanced to the quarter-finals after defeating Sheffield United 4-2 on penalties, with goalkeeper Manuel Almunia saving crucial spot-kicks from Alan Quinn and Jon Harley. Despite missing key attackers like Thierry Henry and Dennis Bergkamp, Arsenal fielded a youthful lineup, including 17-year-old Arturo Lupoli. Sheffield United had early chances, with Michael Tonge missing a clear opportunity, while Arsenal struggled to create threats in the first half. Quincy Owusu-Abeyie was introduced at halftime and made an immediate impact, but Sheffield United's goalkeeper Paddy Kenny produced several key saves. Arsenal dominated the second half, with Cesc Fabregas hitting the crossbar and Freddie Ljungberg denied by a last-ditch tackle. Extra time saw further Arsenal pressure, but Sheffield United held on to force penalties. Almunia's heroics in the shootout secured Arsenal's victory, setting up a quarter-final clash with Bolton.", "stablelm2:1.6b": "Arsenal advance to quarter-finals with a 4-2 penalty win against Sheffield United. Spanish goalkeeper saves three penalties for Arsenal, while Andy Gray and Phil Jagielka score for the visitors. Arsenal's revamped lineup included Arturo Lupoli and Freddie Ljungberg up front, with Arturo Lupoli replacing Italian striker Quincy Owusu-Abeyie at halftime.", "granite3.1-dense:2b": "Arsenal defeated Sheffield United 4-2 on penalties after a 0-0 draw in their FA Cup third-round match. The young Italian striker Arturo Lupoli, partnered with Freddie Ljungberg, struggled to create opportunities. Quincy Owusu-Abeyie, introduced at halftime, significantly impacted the game with his pace and creativity. Arsenal's best chances fell to Ljungberg and Aliadiere, both denied by goalkeeper Paddy Kenny. In extra time, Arsenal pressed relentlessly but couldn't find a breakthrough until penalties. Despite having two goals dispatched, Sheffield United's Phil Jagielka made crucial saves. Lauren, Vieira, Ljungberg, and Cole scored from the penalty spot for Arsenal, while Andy Gray and Phil Jagielka replied for the Blades. The match ended 4-2 in favor of Arsenal after 10 penalty kicks.", "reference": "Michael Tonge and Harley wasted chances for the underdogs, but Paddy Kenny was inspired to keep Arsenal at bay.It was a revamped Arsenal line-up, and they were almost a goal behind within seconds as Tonge wasted a glorious chance.Arsenal continued to press, and once again Kenny was called into action with eight minutes left, diving low to clutch another close-range effort from Fabregas.Almunia, Lauren, Cygan, Senderos, Cole, Fabregas (Toure 90), Vieira, Flamini (Aliadiere 113), Clichy, Lupoli (Owusu-Abeyie 45), Ljungberg.Lauren, Patrick Vieira, Freddie Ljungberg and Ashley Cole scored for Arsenal, while Andy Gray and Phil Jagielka were on target for the Blades.Arsenal were barely seen as an attacking force in the opening 45 minutes, although Ljungberg turned a half-chance wide after good work by Cesc Fabregas.Kenny, Geary, Morgan, Bromby, Harley, Liddell, Montgomery, Jagielka, Thirlwell, Tonge (Quinn 97), Gray.Owusu-Abeyie's pace was causing all sorts of problems for the Blades, and as extra-time began, another surging run into the penalty area almost set up a chance for Ljungberg.Arsenal win 4-2 on penalties  The Spanish goalkeeper saved from Alan Quinn and Jon Harley as Arsenal sealed a quarter-final trip to Bolton with a 4-2 victory on penalties.Neil Warnock's side almost snatched victory in the dying seconds when Derek Geary's cross found Harley at the far post, but his diving header was brilliantly turned over by Almunia.Owusu-Abeyie then fired in a testing cross, which was met by Fabregas, and it needed a desperate clearance by Kenny's legs to save the Blades."}