{"raw_text": "Boro suffer Morrison injury blow\n \n Middlesbrough midfielder James Morrison has been ruled out for up to eight weeks after an operation on Tuesday.\n \n The 18-year-old, who has played in 13 of the club's last 14 games, had surgery to repair a double hernia. A club spokesman confirmed: \"It is a bilateral sportsman's hernia, which was operated on yesterday.\" Morrison was sent for scans after being substituted at half-time during Boro's 2-1 UEFA Cup win over Graz AK in which he scored the equaliser. His injury is the latest blow for the Teessiders, who have been without Gaizka Mendieta, George Boateng and Mark Viduka for extended periods. Meanwhile, the kick-off time for Boro's Uefa Cup match at Sporting Lisbon on 17 March has been brought forward from 2115 GMT to 1945 GMT.\n", "llama3.2:1b": "Middlesbrough midfielder James Morrison has suffered an injury blow after undergoing surgery to repair a double hernia, ruling him out for up to eight weeks. The operation was performed yesterday and he had previously been substituted during Boro's UEFA Cup match win over Graz AK due to the injury.", "llama3.2:3b": "Middlesbrough midfielder James Morrison will be out for up to eight weeks after undergoing surgery for a double hernia. The injury occurred during their UEFA Cup win over Graz AK, where Morrison scored an equaliser.", "gemma2:2b": "Middlesbrough midfielder James Morrison is out for up to eight weeks after surgery for a double hernia.  This latest injury adds to the club's long list of absent players, including Mendieta, Boateng and Viduka. The Uefa Cup match against Sporting Lisbon has been moved to 1945 GMT from its original time slot. \n", "qwen2.5:0.5b": "James Morrison of Middlesbrough will miss up to eight weeks due to an injury operation on Tuesday, after having undergone surgery for a bilateral sportsman's hernia. He was sent for scans following his substitution during the club's win against Graz AK in which he scored the equaliser. The incident marks the latest setback for Boro and their squad, who are without Gaizka Mendieta, George Boateng, and Mark Viduka as substitutes due to their injuries.", "qwen2.5:1.5b": "James Morrison of Middlesbrough is out for up to eight weeks with a double hernia after an operation; it was his sixth injury this season, affecting four different players since December. The club's Uefa Cup match against Sporting Lisbon has been rescheduled from 21:45 to 19:45 GMT on March 17th.", "qwen2.5:3b": "Boro midfielder James Morrison, who has played in 13 of the club's last 14 games, is ruled out for up to eight weeks after undergoing surgery for a bilateral sportsman's hernia. The injury comes as Middlesbrough continues without Gaizka Mendieta, George Boateng, and Mark Viduka, with kick-off time for their Uefa Cup match against Sporting Lisbon on 17 March moved from 21:15 GMT to 19:45 GMT.", "opencoder:1.5b": "The midfielder James Morrison has been ruled out for up to eight weeks after an operation on Tuesday. The 18-year-old midfielder had surgery to repair a double hernia, Morrison was sent for scans after being substituted at half-time. His injury is the latest blow for the club's sportsman's fitness and mental health services.\n", "smollm:1.7b": "Boro suffer Morrison injury blow: Middlesbrough midfielder James Morrison has been ruled out for up to eight weeks after an operation on Tuesday. The 18-year-old, who has played in 13 of the club's last 14 games, had surgery to repair a double hernia. A club spokesman confirmed: \"It is a bilateral sportsman's hernia, which was operated on yesterday.\" Morrison was sent for scans after being substituted at half-time during Boro's 2-1 UEFA Cup win over Graz AK in which he scored the equaliser. His injury is the latest blow for the Teessiders, who have been without Gaizka Mendieta, George Boateng and Mark Viduka for extended periods. Meanwhile, the kick-off time for Boro's Uefa Cup match at Sporting Lisbon on 17 March has been brought forward from 2115 GMT to 1945 GMT.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely while preserving key ideas and details. Let me read through the provided query again.\n\nThe user shared a news item about Boro losing Morrison's injury and some other details. My task is to extract just the summary without any explanations or additional formatting.\n\nFirst, I'll note that Borodino's player James Morrison was ruled out for up to eight weeks after surgery. He had a double hernia, confirmed by a club spokesman. He played in 13 of last 14 games but was substituted early in a recent victory over Graz AK, scoring the winner.\n\nAdditionally, Boro is moving their Uefa Cup match to Sporting Lisbon at a time earlier than usual because of the injury. Gaizka Mendieta, George Boateng, and Mark Viduka have been out for extended periods due to Morrison's loss.\n\nI should structure this summary by mentioning the key events: Morrison's injury ruling him out, the surgery details, his substitution in Boro's game, the Uefa Cup move, and the reasons behind his absence.\n\nI need to make sure all important points are included without getting into too much detail. Let me put it all together concisely.\n</think>\n\nBoro have announced that James Morrison is ruled out for up to eight weeks due to an injury after undergoing surgery on Tuesday. He had a double hernia confirmed by the club, and he was substituted early in Boro's 2-1 UEFA Cup win over Graz AK. Borodino are also moving their Uefa Cup match at Sporting Lisbon back from 2115 GMT to 1945 GMT due to Morrison's injury. Gaizka Mendieta, George Boateng, and Mark Viduka have been out for extended periods because of his absence.", "tinyllama:1.1b": "Boro suffer Morrison injury blow, Tuesday operation repairs double hernia and he will miss up to eight weeks in Uefa Cup match against Sporting Lisbon on 17 March at 2115 GMT. Midfielder James Morrison will be out for a week or more after having an operation to repair a double hernia, confirmed a club spokesman. The Teessiders have been without Gaizka Mendieta, George Boateng and Mark Viduka for extended periods.", "tinydolphin:1.1b": " In summary, Middlesbrough midfielder James Morrison has suffered a double hernia and will be sidelined for at least eight weeks due to an operation on Tuesday. The 18-year-old player is the latest casualty for Boro in recent weeks, with manager David Fliton expressing disappointment that his team was not able to secure a victory in the UEFA Cup against Graz AK despite being ahead at half-time.", "phi:2.7b": " Middlesbrough midfielder James Morrison had surgery to repair a hernia after being substituted in a 2-1 UEFA Cup win over Graz AK. He will be out for up to eight weeks and the kick-off time for Boro' s Uefa Cup match has been brought forward from \n", "orca-mini:3b": " Middlesbrough midfielder James Morrison has been ruled out for up to eight weeks after an operation on Tuesday. He suffered a double hernia which was operated on yesterday. The club spokesman confirmed it. This injury is the latest blow for Boro who have been without Gaizka Mendieta, George Boateng, and Mark Viduka for extended periods.", "hermes3:3b": "Middlesbrough player James Morrison out for 8 weeks due to double hernia surgery.", "stablelm-zephyr:3b": "Midfielder James Morrison suffers a double hernia injury that will sideline him for up to eight weeks. This follows the absence of several other players, including Gaizka Mendieta, George Boateng, and Mark Viduka. Morrison's injury also impacts Boro's upcoming UEFA Cup match against Sporting Lisbon, which now begins at 3:45 PM.", "chatgpt-4o-latest": "Middlesbrough midfielder James Morrison will be out for up to eight weeks after undergoing surgery for a double hernia. The 18-year-old, who played in 13 of the club's last 14 games, was injured during Boro's 2-1 UEFA Cup win over Graz AK, where he scored the equaliser. His absence adds to the club's injury woes, with Gaizka Mendieta, George Boateng, and Mark Viduka already sidelined. Additionally, Boro's UEFA Cup match at Sporting Lisbon on 17 March has been rescheduled to start at 1945 GMT instead of 2115 GMT.", "stablelm2:1.6b": "Middlesbrough midfielder James Morrison is out for up to eight weeks after surgery for a double hernia. This is the latest injury setback for the Teessiders, who have lost Gaizka Mendieta, George Boateng and Mark Viduka recently. The match against Graz AK was postponed from March to March 5th due to this injury.", "granite3.1-dense:2b": "Middlesbrough midfielder James Morrison, 18, is out for up to eight weeks due to a bilateral sportsman's hernia operation on Tuesday following an injury sustained during the 2-1 UEFA Cup victory over Graz AK. Morrison has played in 13 of Boro's last 14 games, including scoring the equalizer. This injury adds to Boro's previous player absence issues with Gaizka Mendieta, George Boateng, and Mark Viduka. The Uefa Cup match against Sporting Lisbon, originally scheduled for 21:15 GMT on March 17, has been advanced to 19:45 GMT due to scheduling changes.", "reference": "Morrison was sent for scans after being substituted at half-time during Boro's 2-1 UEFA Cup win over Graz AK in which he scored the equaliser.Meanwhile, the kick-off time for Boro's Uefa Cup match at Sporting Lisbon on 17 March has been brought forward from 2115 GMT to 1945 GMT.The 18-year-old, who has played in 13 of the club's last 14 games, had surgery to repair a double hernia."}