{"raw_text": "QPR keeper Day heads for Preston\n \n Queens Park Rangers keeper Chris Day is set to join Preston on a month's loan.\n \n Day has been displaced by the arrival of Simon Royce, who is in his second month on loan from Charlton. QPR have also signed Italian Generoso Rossi. R's manager Ian Holloway said: \"Some might say it's a risk as he can't be recalled during that month and Simon Royce can now be recalled by Charlton. \"But I have other irons in the fire. I have had a 'yes' from a couple of others should I need them.\"\n \n Day's Rangers contract expires in the summer. Meanwhile, Holloway is hoping to complete the signing of Middlesbrough defender Andy Davies - either permanently or again on loan - before Saturday's match at Ipswich. Davies impressed during a recent loan spell at Loftus Road. Holloway is also chasing Bristol City midfielder Tom Doherty.\n", "llama3.2:1b": "Chris Day will join Preston on loan for a month, leaving Queens Park Rangers after being displaced by Simon Royce who can be recalled by Charlton later in the season. QPR have signed Italian goalkeeper Generoso Rossi and manager Ian Holloway is looking to complete signings including Middlesbrough defender Andy Davies and Bristol City midfielder Tom Doherty before Saturday's match at Ipswich.", "llama3.2:3b": "Chris Day, QPR keeper, to join Preston on month's loan. Simon Royce now starts for Rangers. Ian Holloway says signing others if needed; contract expires in summer. Andy Davies and Tom Doherty being considered signings.", "gemma2:2b": "Chris Day will be loaned to Preston for one month. QPR have signed Generoso Rossi and are considering other goalkeeper options while Simon Royce can still be recalled by Charlton. \nIan Holloway is hoping to sign Andy Davies from Middlesbrough, either permanently or on loan. He is also pursuing Tom Doherty from Bristol City. \n", "qwen2.5:0.5b": "Chris Day has been replaced by Simon Royce, who is in his second month on loan from Charlton Athletic. Ian Holloway said it might be a risk for Day to stay on the pitch but that he had other options if needed. Rangers are looking at taking on Andy Davies or Tom Doherty.", "qwen2.5:1.5b": "Chris Day, QPR keeper, set to join Preston on month-long loan; Royce in Charlton loan, Rossi signed by QPR; Holloway's interest in Middlesbrough defender Andy Davies and Bristol City midfielder Tom Doherty pending signings before Ipswich match. Rangers contract expires in summer.", "qwen2.5:3b": "QPR keeper Chris Day will join Preston for a month on loan, following the arrival of Simon Royce from Charlton. QPR has signed Italian goalkeeper Generoso Rossi. Manager Ian Holloway expressed confidence in his squad despite the loss of a loanee, mentioning other potential signings like Andy Davies (Middlesbrough) and Tom Doherty (Bristol City). Day's QPR contract expires next summer.", "opencoder:1.5b": "The QPR keeper Chris Day who is set to join the city on a month's loan has been displaced by the arrival of Simon Royce, who is in his second month on loan from Charlton.\n \nPreston has been signed by Italian Generoso Rossi, who has also signed Ian Holloway and Tom Doherty. The Rangers contract will expire in the summer, while Andy Davies, either permanently or again on loan, looks promising before Saturday's match at Ipswich. Day, however, seems to have been displaced by the arrival of another player, a message from the manager suggesting a risk for his retirement during that month.\n", "smollm:1.7b": "QPR keeper Chris Day has been set to join Preston on a month's loan from Queens Park Rangers.\n\nSimon Royce, who was in his second month on loan from Charlton, will be joining QPR.\n\nIan Holloway said: \"Some might say it's a risk as he can't be recalled during that month and Simon Royce can now be recalled by Charlton. But I have other irons in the fire.\"\n\nHolloway has had a 'yes' from a couple of others should he need them.\n\nIan Holloway is hoping to complete the signing of Middlesbrough defender Andy Davies - either permanently or again on loan - before Saturday's match at Ipswich.\n\nHolloway is also chasing Bristol City midfielder Tom Doherty.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text into one concise paragraph while preserving all key ideas and details.\n\nFirst, I'll identify the main points: QPR keeper Day is moving from Queens Park Rangers to Preston with Simon Royce on a loan. Day has been displaced by Royce, who's now on a second month in Charlton. QPR have also added Rossanimo, their manager Ian Holloway mentions concerns about his transferability over the next month, but he has others backing. Day's contract expires this summer, and Holloway is aiming to sign Davies from Middlesbrough or possibly move him again before their match at Ipswich.\n\nI need to make sure all these points are included without adding extra information.\n</think>\n\nDay has moved from Queens Park Rangers to Preston with Simon Royce on a loan, displacing him. QPR have added Rossanimo and aims to sign Andy Davies from Middlesbrough or transfer him again before their match at Ipswich. Day's contract expires in the summer, and Holloway is focusing on signing him.", "tinyllama:1.1b": "QPR goalkeeper Chris Day will join Preston on a month's loan after being displaced by the arrival of Simon Royce, who has already joined on loan from Charlton. QPR have also signed Italian defender Generoso Rossi, while Ian Holloway hopes to secure the signature of another player before Saturday's match against Ipswich. A midfielder, Andy Davies, may return to Midlothian or be loaned out again by QPR before the end of January.", "tinydolphin:1.1b": " Queens Park Rangers (QPR) goalkeeper Chris Day has signed a one-month loan deal with Preston North End, as part of the management's efforts to bolster their options ahead of Saturday's Premier League match against Ipswich Town.\n\nIn making the move, manager Ian Holloway sought to ensure that he can redeploy Simon Royce if needed, while also allowing Day himself to continue his development and gain experience during his initial period on loan.\n\nThe transfer of Day follows a series of recent signings for QPR, which include Irish midfielder Generoso Rossi from Charlton Athletic and Italian striker Matt Ritchie from Newcastle United. Holloway also intends to make further additions in the coming weeks, including a marquee player or two to bolster his squad ahead of the crucial season-opener at Loftus Road against Bristol City on Sunday.", "phi:2.7b": " QPR keeper Chris Day will be loaned to Preston for one month, while Simon Royce has joined Charlton from QPR. Ian Holloway has signed Generoso Rossi and has other players available if needed. He is also hoping to sign Andy Davies or Tom Doherty before the end of the season.\n", "orca-mini:3b": " Chris Day, the Queens Park Rangers keeper, is expected to join Preston on a month's loan. The move follows the arrival of Simon Royce from Charlton and the signing of Generoso Rossi by QPR. However, Ian Holloway has other plans in mind and is hoping to complete the signing of Middlesbrough defender Andy Davies before Saturday's match against Ipswich.", "hermes3:3b": "QPR keeper Chris Day joins Preston on one-month loan.", "stablelm-zephyr:3b": "QPR keeper Chris Day will join Preston on a month's loan, as manager Ian Holloway works on other signings. Day replaces Simon Royce, who returns to Charlton. Ian Holloway hopes to complete the signing of Middlesbrough defender Andy Davies and Bristol City midfielder Tom Doherty before Saturday's match.", "chatgpt-4o-latest": "QPR goalkeeper Chris Day is set to join Preston on a one-month loan after being displaced by Simon Royce and new signing Generoso Rossi. Manager Ian Holloway acknowledges the risk, as Day cannot be recalled and Royce could be recalled by Charlton, but he has backup options. Day's contract expires in the summer. Holloway is also looking to sign Middlesbrough defender Andy Davies, either permanently or on loan, and is pursuing Bristol City midfielder Tom Doherty.", "stablelm2:1.6b": "Queens Park Rangers goalkeeper Chris Day will join Preston on a month-long loan, after being replaced by Simon Royce. Italian Generoso Rossi has also been signed by QPR. Manager Ian Holloway discusses the risks associated with Day's move and notes his interest in signing Middlesbrough defender Andy Davies before Saturday's match at Ipswich.", "granite3.1-dense:2b": "Chris Day, Queens Park Rangers' goalkeeper, is expected to join Preston on a month-long loan due to being surpassed by the arrival of Simon Royce from Charlton. QPR has also signed Italian Generoso Rossi. Manager Ian Holloway acknowledges potential risks, including Day's ineligibility for recall during his loan period and the possibility of Royce being recalled by Charlton. However, he's optimistic about securing other signings: Middlesbrough defender Andy Davies, either permanently or on another loan, and Bristol City midfielder Tom Doherty, before a match against Ipswich.", "reference": "Day has been displaced by the arrival of Simon Royce, who is in his second month on loan from Charlton.Queens Park Rangers keeper Chris Day is set to join Preston on a month's loan.Meanwhile, Holloway is hoping to complete the signing of Middlesbrough defender Andy Davies - either permanently or again on loan - before Saturday's match at Ipswich.R's manager Ian Holloway said: \"Some might say it's a risk as he can't be recalled during that month and Simon Royce can now be recalled by Charlton."}