{"raw_text": "Celtic make late bid for Bellamy\n \n Newcastle striker Craig Bellamy is discussing a possible short-term loan move to Celtic, BBC Sport understands.\n \n The Welsh striker has rejected a move to Birmingham after falling out with Magpies manager Graeme Souness. The Toon boss vowed Bellamy would not play again after a bitter row over his exclusion for the game against Arsenal. Celtic are in no position to match Birmingham's £6m offer but a stay until the end of the season could suit Bellamy while he considers his future. According to Bellamy's agent, the player dismissed a permanent move to Birmingham. And it is unlikely that Newcastle would allow the player to go on loan to another Premiership club.\n \n Bellamy was fined two weeks' wages after a live TV interview in which he accused Souness of lying, following a very public dispute about what position Bellamy should play in the side. Souness said: \"He can't play for me ever again. He has been a disruptive influence from the minute I walked into this football club. \"He can't go on television and accuse me of telling lies.\" Chairman Freddy Shepherd described Bellamy's behaviour as \"totally unacceptable and totally unprofessional\".\n", "llama3.2:1b": "Craig Bellamy is in talks to join Celtic on a short-term loan, after rejecting a move to Birmingham due to a disagreement with manager Graeme Souness. The two had a public dispute over Bellamy playing out of position, and it's unlikely that Newcastle would allow him to go on loan elsewhere.", "llama3.2:3b": "Newcastle striker Craig Bellamy is discussing a possible short-term loan move to Celtic due to his strained relationship with Magpies manager Graeme Souness. Bellamy was fined two weeks' wages after a public dispute, and the club may not allow him to join another Premiership club on loan.", "gemma2:2b": "Craig Bellamy is in talks with Celtic about a loan move until the end of the season. Newcastle rejected Birmingham's offer for Bellamy after he was excluded from the Arsenal game and refused to play again, due to a public dispute with manager Graeme Souness.  Bellamy has turned down a permanent move to Birmingham. \n", "qwen2.5:0.5b": "Celtic are in no position to match Birmingham's £6m offer, but a stay until the end of the season could suit Bellamy while he considers his future. Bellamy was fined two weeks' wages for an interview with Newcastle TV station.", "qwen2.5:1.5b": "Craig Bellamy, Newcastle striker, discusses possible loan move to Celtic, considering a stay until end of season while considering future, BBC Sport understands. Birmingham offered £6m transfer fee but Celtic cannot match; Bellamy has fallen out with manager Graeme Souness over exclusion in game against Arsenal.", "qwen2.5:3b": "Celtic are considering a possible short-term loan move for Newcastle striker Craig Bellamy, who has rejected a move to Birmingham due to falling out with manager Graeme Souness. Despite Celtic not being able to match Birmingham's £6m offer, a stay until the end of the season could suit both parties as well as Bellamy, who reportedly does not want a permanent move to Birmingham. Newcastle is unlikely to allow him to go on loan to another Premiership club. Bellamy was fined after accusing Souness of lying in a live TV interview and has been dismissed by the manager for being \"a disruptive influence\".", "opencoder:1.5b": "The Celtic player has made a late move to Newcastle, suggesting he could reconsider his decision at the end of the season. The player's decision was dismissed by the manager, who agreed that he would not allow this move on loan to another club. The player received two-week fine for being found deliberately, which led him to the live interview in which he accused Magpies' manager of lying and discussed his stance on disruptive influence. Despite the perceived public argument, Souness agrees with Bellamy's views and suggests that they can't go on television and will not be further affected by the impact of the game against Arsenal.\n", "smollm:1.7b": "Celtic make late bid for Bellamy", "deepseek-r1:1.5b": "<think>\nAlright, so the user provided a query where they want me to summarize a given text concisely. The output should be plain text without any explanations or formatting.\n\nLooking at the text, it's about Bellamy moving to Celtic but being rejected by Souness. I need to capture the key points: Bellamy was initially considering a move, then he said he wouldn't play again after a dispute with Souness regarding his position. There are financial offers involved too—Celtic offered £6m while Souness wanted Bellamy for Birmingham.\n\nI should make sure to include where all these elements are mentioned and keep it concise without losing any important details.\n</think>\n\nBellamy has initially considered a short-term loan move to Celtic but was rejected by manager Graeme Souness. He criticized Souness for a past dispute over his position, stating he won't play again. Celtic offered £6m to stay until the season ends, while Souness wanted him for Birmingham. Bellamy's agent dismissed a possible permanent move there and suggested Newcastle might consider another club instead.", "tinyllama:1.1b": "Newcastle United are reportedly discussing a short-term loan move for Welsh striker Craig Bellamy after rejecting the opportunity to sign him permanently. While the player dismissed a loan offer from a Premier league side, the Toon bosse voiced that they would not match the club's £6m valuation. Despite being in no position to match CeltiC's bid, a stay until the end of the season could suit Bellamy while he considers his future. Bellamy was fined two weeks after a live TV interview where he accused manager Graeme Souness of lying and subsequently refused to play for Newcastle again. Despite being a disruptive influence, Chairman Freddy Shephered described Bellamy's behaviour as \"totaly unaccepable and totally unprofessional\".", "tinydolphin:1.1b": " Newcastle United has made a late bid for Celtic's striker Craig Bellamy, offering to pay the striker's £6m wages for an extra season while they consider their options. The move would see the highly-rated player potentially join the Premier League's top club until the end of the season before making a decision on his future. However, Celtic have already stated that Bellamy will not play again and are unlikely to match Newcastle's £6m offer for the Welsh striker. The move could see both parties involved reach a compromise in the coming days, potentially keeping the player with Newcastle until the end of the season.", "phi:2.7b": " Craig Bellamy, a Newcastle striker, is discussing a possible short-term loan to Celtic due to a falling out with Birmingham's manager. He rejected Birmingham's £6m offer for a permanent move but may consider a stay until the end of the season while considering his future. He was fined two weeks' wages after making false claims about his exclusion from a game against Arsenal, which led to a public dispute with his former manager and ultimately resulted in him being banned from playing for Birmingham again.\n", "orca-mini:3b": " Celtic are in talks with Newcastle over a short-term loan deal for Craig Bellamy, who has turned down a move to Birmingham and is considering his future. The player has been fined two weeks' wages after a live TV interview in which he accused the manager of lying about his position in the team. Newcastle chairman Freddy Shepherd described Bellamy's behavior as \"unprofessional\" and said the club would not allow him to go on loan to another Premier League club.", "hermes3:3b": "Celtic make last-ditch bid for Bellamy (striker), after rejecting Birmingham deal, due to dispute with Newcastle manager Souness.", "stablelm-zephyr:3b": "Newcastle striker Craig Bellamy is considering a short-term loan move to Celtic after rejecting a move to Birmingham. Bellamy's agent confirmed that the player dismissed the permanent move to Birmingham, and it is unlikely Newcastle would allow Bellamy to go on loan to another Premiership club. However, a stay at Celtic until the end of the season could be suitable for Bellamy as he considers his future. A previous dispute with manager Graeme Souness led to Bellamy being fined two weeks' wages and ultimately damaging his relationship with the team.", "chatgpt-4o-latest": "Celtic are in talks to sign Newcastle striker Craig Bellamy on a short-term loan after he rejected a permanent move to Birmingham. Bellamy fell out with Newcastle manager Graeme Souness, who vowed he would never play for the club again following a public dispute over his position in the team. Bellamy was fined for accusing Souness of lying in a TV interview. While Birmingham offered £6m, Celtic can only afford a loan deal until the end of the season. Newcastle are unlikely to loan him to another Premiership club. Chairman Freddy Shepherd criticized Bellamy's behavior as unprofessional.", "stablelm2:1.6b": "Newcastle striker Craig Bellamy is reportedly discussing a short-term loan move to Celtic, following a public dispute with manager Graeme Souness. Despite Celtic's inability to match Birmingham's £6m offer, a stay until the end of the season could benefit Bellamy as he considers his future. Bellamy was also fined two weeks' wages for accusing Souness of lying during a TV interview.", "granite3.1-dense:2b": "Craig Bellamy, Newcastle United striker, is considering a short-term loan to Celtic. After rejecting a permanent move to Birmingham due to disagreements with manager Graeme Souness, Bellamy now faces a decision between Birmingham and Celtic. Despite Celtic's inability to meet Birmingham's £6m offer, a temporary stint at the Scottish club could benefit Bellamy as he contemplates his future. The player has been fined two weeks' wages for accusing Souness of lying during a TV interview, leading to Newcastle potentially preventing any loan move to other Premiership teams.", "reference": "Newcastle striker Craig Bellamy is discussing a possible short-term loan move to Celtic, BBC Sport understands.Bellamy was fined two weeks' wages after a live TV interview in which he accused Souness of lying, following a very public dispute about what position Bellamy should play in the side.The Welsh striker has rejected a move to Birmingham after falling out with Magpies manager Graeme Souness.And it is unlikely that Newcastle would allow the player to go on loan to another Premiership club.Souness said: \"He can't play for me ever again."}