{"raw_text": "Edu describes tunnel fracas\n \n Arsenal's Edu has lifted the lid on the scenes that followed Manchester United's win over the Gunners.\n \n The Brazilian confirmed tempers had flared but could shed no light on reports that food was thrown at United boss Sir Alex Ferguson. \"I saw people being pulled apart, people pushing, pointing and shouting,\" he told Uefa's official website. \"The United players were trying to wind us up about the result but I didn't see any soup being thrown at anyone.\" However, Edu tried to play down the incidents, adding: \"There was nothing that I haven't seen in Brazilian derbies. \"Derby matches in Brazil are worse. I like to play in games like this with this intense rivalry.\" But Edu was highly critical of the ferocity of some of United's challenges during the game, particularly on Jose Antonio Reyes. \"I think we were a lot fairer in the tackles than United,\" he said. \"Reyes was being kicked all over the park - they were beating up the boy and Gary Neville was tackling in such a way that he should have been sent off.\" Following the game, the Football Association said it would look into events in the tunnel. It also charged Ruud van Nistelrooy with serious foul play while Arsenal boss Arsene Wenger has been asked to explain comments he made about the referee.\n", "llama3.2:1b": "Arsenal's Edu described scenes following Manchester United's win over Arsenal, including tempers flaring and food being thrown at United boss Sir Alex Ferguson.", "llama3.2:3b": "Arsenal's Edu confirmed tempers flared after Manchester United's win, including reports of food being thrown at Sir Alex Ferguson but denied this happened. He also criticized United's tactics on Jose Antonio Reyes and called for referees to be more vigilant. The FA will investigate tunnel incidents and has charged Ruud van Nistelrooy with serious foul play.", "gemma2:2b": "Edu described the tense moments following Manchester United's win over Arsenal. He confirmed heated exchanges occurred but denied reports of food being thrown at Sir Alex Ferguson. Edu compared the rivalry to Brazilian derby matches, suggesting they are similar in intensity. He also criticized the ferocity of some United tackles, particularly on Jose Antonio Reyes and Gary Neville's tackling style. The FA has started an investigation into the tunnel incident. \n", "qwen2.5:0.5b": "A Brazilian soccer player named Edu confirmed that tempers had flared after Manchester United's win over Arsenal, but he couldn't shed any light on reports of food being thrown at Sir Alex Ferguson. He also criticized some United players and their opponents for challenging each other during the game in the tunnel. After the match, Uefa looked into events in the tunnel to investigate whether food was thrown or if someone was kicked by the United team. They also charged Ruud van Nistelrooy with a serious foul play while Arsenal's manager Arsene Wenger explained his comments about the referee.", "qwen2.5:1.5b": "Arsenal player Edu describes a heated post-match confrontation between Manchester United and Arsenal at Euro 2012, mentioning reports of food being thrown but denying it was true. He criticizes United's aggressive behavior during their game against Arsenal, particularly targeting José Antonio Reyes, arguing they were fairer in tackles than the other team. The FA investigates incidents that occurred in the tunnel and charges Ruud van Nistelrooy with serious foul play after a match comment by Wenger.", "qwen2.5:3b": "Edu of Arsenal describes chaotic scenes following their defeat by Manchester United, including pushed and shouted at players. He criticizes United's challenging behavior towards Jose Antonio Reyes but downplays the severity, noting it as typical in Brazilian derbies. The Football Association is investigating incidents in the tunnel, while Wenger and Van Nistelrooy face disciplinary action.", "opencoder:1.5b": "Edo describes a fracas in a tunnel. Arsenal's Edu shows his sensitivity and calm when it comes to player encounters during a game against Gunners. The Brazilian, however, insists on caution, as it appears there were attempts to throw soup at United boss Sir Alex Ferguson. Uefa's official website is mentioned as the source of this information, but its absence or interpretation could influence his stance. He also mentions that some Uefa fans have questioned the significance of some instances where they see people being pulled apart and so forth. Despite this, he remains critical of the intense conflict between Brazil and the Gunners during a game and frequently critiques the actions of players. \n\nThe game following the win highlights the importance of player behavior and the potential for friendly fire. However, Edu's calm and focus on player encounters also highlight the sensitivity to perceived injustice or perceived disregard for fairness in decision-making.\n", "smollm:1.7b": "The summary is concise and focuses on key ideas, avoiding unnecessary details and explanations. The main points are:\n\n1. Edu describes tunnel fracas\n2. Arsenal's Edu has lifted the lid on the scenes that followed Manchester United's win over the Gunners\n3. The Brazilian confirmed tempers had flared but could shed no light on reports that food was thrown at United boss Sir Alex Ferguson\n4. I saw people being pulled apart, people pushing, pointing and shouting\n5. The United players were trying to wind up about the result but I didn't see any soup being thrown at anyone\n6. There was nothing that I haven't seen in Brazilian derbies\n7. Derby matches in Brazil are worse\n8. I like to play in games like this with this intense rivalry\n9. Ruud van Nistelrooy with serious foul play while Arsenal boss Arsene Wenger has been asked to explain comments he made about the referee", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely. Let me read through it carefully.\n\nThe main points are about a tunnel incident in a football match between Arsenal and Manchester United. The text talks about how the game went smoothly after the result, with Sir Alex Ferguson being calm despite reports of food thrown at him by fans. However, there were some incidents involving United's challenges against Jose Antonio Reyes that caused tension.\n\nThe players tried to wind the crowd during the match, but some things didn't add up. The text also mentions that referee Van Nistelrooy was charged with serious foul play by the FA, and Arsenal's manager, Arsene Wenger, is being asked to explain his comments about the referee.\n\nI need to capture all these points in a short summary without any extra information or explanations. I should mention the smooth outcome, the reaction from fans, the tension faced during the game, and the FA's charge against the referee.\n</think>\n\nThe game between Arsenal and Manchester United concluded smoothly despite reports of food being thrown at manager Sir Alex Ferguson. The match went well after the result, with players trying to calm the crowd. There were some incidents involving United's challenges against Jose Antonio Reyes that caused tension, but the players tried to wind the crowd. The FA charged Van Nistelrooy for serious foul play and asked Arsene Wenger to explain his comments about the referee.", "tinyllama:1.1b": "Edu describes an intense match at Old Trafford, where the intensity of some United fans was fierce compared to their opponents' play. He also mentions a series of tough tackles during the game that left Arsenal bosse Arsene Weiner questioned. The incident with Manchester United players was described by Edu as \"being pushed apart\" and \"people pointing and shouting,\" but he avoided giving more details about what happened in the tunnel. The FA is reported to be investigating the match, while Weiner faces accusations for his comments about the referee.", "tinydolphin:1.1b": " The summary of this text is that Edu, a Brazilian football player who played in a derby match between Manchester United and Arsenal, described various incidents during the game, including people being pushed and pulled apart by the opposing team. He further mentioned that these actions were quite aggressive compared to those seen in Brazilian derbies. The Football Association is now investigating events in the tunnel and has accused players of serious foul play.", "phi:2.7b": " Edu described a chaotic atmosphere following Manchester United's win over Arsenal in the tunnel, but denied reports of food being thrown at Sir Alex Ferguson. He was critical of some of United's tackles on Jose Antonio Reyes and expressed frustration with the game. The Football Association has opened an investigation into events in the tunnel, while Arsenal manager Arsene Wenger faced scrutiny for comments he made about refereeing.\n", "orca-mini:3b": " Arsenal's Edu described scenes following Manchester United's win over Arsenal where tempers flared and food was thrown at Sir Alex Ferguson, but he couldn't confirm or deny reports of soup being thrown. The FA is investigating events in the tunnel, and Wenger and Ferguson were asked to explain comments made by Wenger about the referee.", "hermes3:3b": "Edu descriptions tunnel fracas after Arsenal v Manchester United match. Tempers flared but no soup thrown at Sir Alex Ferguson. Brazilian derby games worse, criticizes some United challenges on Reyes and Neville's tackles. FA investigates post-game incidents.", "stablelm-zephyr:3b": "Arsenal's Edu revealed that tempers flared during Manchester United's win over Arsenal, but didn't confirm reports of food thrown at Sir Alex Ferguson. He described intense rivalry and said United played unfairly hardball, especially towards Jose Antonio Reyes. The Football Association is investigating the incidents, charging van Nistelrooy with serious foul play, and asking Arsene Wenger to explain his comments about the referee.", "chatgpt-4o-latest": "Arsenal's Edu described the tense scenes following Manchester United's victory over Arsenal, confirming heated exchanges but denying seeing food thrown at Sir Alex Ferguson. He noted that United players provoked Arsenal but downplayed the incident, comparing it to intense Brazilian derbies. Edu criticized United's aggressive tackles, particularly on Jose Antonio Reyes, and claimed Gary Neville should have been sent off. The Football Association announced an investigation into the tunnel events and charged Ruud van Nistelrooy with serious foul play, while Arsene Wenger was asked to explain his comments about the referee.", "stablelm2:1.6b": "Brazilian player Edu spoke about the intense rivalry between Arsenal and Manchester United during a match, revealing tempers flared but no food was thrown at Sir Alex Ferguson. Edu mentioned people being pulled apart and shouted, while the United players tried to wind them up about the result. However, he clarified that there were no incidents of throwing soup at anyone. He also acknowledged that Brazilian derby matches are worse than this one. Edu expressed disappointment with some United's challenges on Jose Antonio Reyes, stating they should have been sent off. The Football Association will investigate the events in the tunnel and charged Ruud van Nistelrooy with serious foul play while Arsenal boss Arsene Wenger has to explain comments he made about the referee.", "granite3.1-dense:2b": "Arsenal's Edu detailed post-match chaos following their defeat to Manchester United, stating tempers flared but no soup was thrown at Sir Alex Ferguson. He likened United's behavior to Brazilian derbies as intense, yet criticized their tackling of Arsenal player Jose Antonio Reyes as excessive and potentially warranting a red card for Gary Neville. The Football Association is investigating the incidents in the tunnel and will also examine Ruud van Nistelrooy's serious foul play charge, while Arsene Wenger must explain his comments about the referee.", "reference": "But Edu was highly critical of the ferocity of some of United's challenges during the game, particularly on Jose Antonio Reyes.However, Edu tried to play down the incidents, adding: \"There was nothing that I haven't seen in Brazilian derbies.The Brazilian confirmed tempers had flared but could shed no light on reports that food was thrown at United boss Sir Alex Ferguson.\"Reyes was being kicked all over the park - they were beating up the boy and Gary Neville was tackling in such a way that he should have been sent off.\"I like to play in games like this with this intense rivalry.\""}