{"raw_text": "Uefa approves fake grass\n \n Uefa says it will allow European matches to be played on artificial pitches from the start of next season.\n \n European football's governing body made the decision at a meeting of its Executive Committee on Wednesday. Uefa explained that the move \"follows comprehensive studies into the sporting and medical aspects of using artificial playing surfaces.\" They can be used subject to complying with Uefa quality criteria but there use will not be made obligatory. Luton, Preston, Queens Park Rangers and other clubs used to have plastic pitches during the the 1980s but, after a two-year study, Uefa insists the surfaces have moved on. International matches can also be played on such pitches, although games at major tournaments have to be contested on grass. Uefa spokesman Rob Faulkner said: \"People in England have bad memories of the artificial pitches of Luton and QPR in the 1980s, but the latest generation are completely different and are much more like grass. \"We have sanctioned its use from the start of next season but only as long as it is the latest generation of artificial turf and meets a whole series of standards.\" Several leading clubs from Scandinavia, Russia and eastern Europe - especially those who only play Champions League or Uefa Cup matches in winter - are now expected to instal artificial pitches.\n", "llama3.2:1b": "UEFA approves use of artificial grass for European matches starting next season. The governing body conducts studies on the sporting and medical aspects of using artificial surfaces before allowing their use. UEFA sanctions their use from the start of next season but requires they meet certain standards and be the latest generation of artificial turf. Several leading clubs in Scandinavia, Russia, and eastern Europe are expected to install artificial pitches, including Luton and Preston.", "llama3.2:3b": "Uefa approves use of artificial grass for European matches starting next season after comprehensive studies on its sporting and medical aspects. The surfaces must meet Uefa quality criteria, but will not be obligatory, and can be used for international and Champions League matches except at major tournaments.", "gemma2:2b": "Uefa approved the use of artificial grass for European football matches starting next season.  Artificial pitches will be permitted based on specific quality criteria and will not be mandatory. The change is intended to reflect technological advancements and address past issues with early versions of the surfaces. \n", "qwen2.5:0.5b": "Uefa approves European football's use of artificial grass starting next season.", "qwen2.5:1.5b": "Uefa approves European matches starting next season to be played on fake grass due to advancements since the 1980s. Only latest generation meets standards set by Uefa.", "qwen2.5:3b": "Uefa approves use of fake grass for European matches starting next season following comprehensive studies. Clubs previously used plastic surfaces in the 1980s but insist modern versions, meeting Uefa's quality criteria, are similar to natural grass. Use is permitted for international matches and major tournaments must be on grass. Artificial pitches from latest generation can be installed by leading clubs from Scandinavia, Russia, and eastern Europe who only play Champions League or Uefa Cup matches in winter.", "opencoder:1.5b": "Uefa approves fake grass - it will allow European matches to be played on artificial pitches from the start of next season. The decision at a meeting of its Executive Committee is made by Uefa, which follows comprehensive studies into the sports and medical aspects of using artificial playing surfaces. These surfaces can be used subject to compliance with Uefa quality criteria but there will not be any optional use. Luton, Preston, Queens Park Rangers and other clubs have also played on such pitches before, but only after a two-year study has been carried out by Uefa. The memories of the artificial pitches of Luton and QPR in the 1980s have been sanctioned from the start of next season but are only available for as long as they meet certain criteria.\n", "smollm:1.7b": "Uefa approves fake grass for European matches.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Uefa approving fake grass for European football matches. Let me read through the text carefully.\n\nFirst paragraph says Uefa approves fake grass and will allow matches on artificial pitches starting next season. It mentions specific clubs like Luton, Preston, Queens Park Rangers who had plastic pitches in the 80s but now are using different materials. The study said these plastic surfaces moved on to real grass after two years.\n\nSecond part talks about how international matches can be played on artificial, though major tournaments must use grass. Uefa's spokesperson says bad memories from Luton and QPR don't apply anymore; the latest use is more like grass now. They have to check against standards but only for their latest generation.\n\nThird point mentions several clubs in different regions are switching to artificial pitches, especially those playing specific matches in winter.\n\nI need to keep the key ideas: Uefa approves fake grass, next season's matches on artificial from start until certain criteria met, major tournaments on grass, different use of artificial by various teams and players, and expected infrastructure changes.\n</think>\n\nNext season, European football matches can be played on artificial pitches approved by Uefa. The decision came at a meeting of the Executive Committee, with specific clubs using plastic pitches in the 80s now adopting different materials. Uefa's statement highlights that these surfaces moved to grass after two years of studies and that international matches can use artificial surfaces while major tournaments must opt for grass. Leading clubs from various regions are switching to artificial turf, especially those playing specific matches in winter.", "tinyllama:1.1b": "Uefa approves fake grass for European football matches starting next season. The governing body made the decision based on comprehensive studies into the sporting and medical aspects of using artificial playing surfaces, as well as strict quality criteria put in place by Uefa. Clubs with artificial pitches from 1980s can still play on grass but international matches must be contested on grass. Uefa spokeman Rob Faulkner said: \"People in England have bad memories of artificial pitches, but modern artificial turf is a completely different product compared to the fake grass of the past.\" The sanctioned use of fake grass will start from the 2019-20 season for European matches.", "tinydolphin:1.1b": " The European Football Association (UEFA) has approved the use of fake grass for football matches starting next season. This decision will be made subject to complying with Uefa's quality criteria. Clubs that currently use plastic pitches during the 1980s can continue using them as long as they meet the new requirements. FIFA, which organizes international competitions like World Cups and Confederations Cup, has already confirmed its support for artificial surfaces. Players in international matches will also have the option of playing on fake grass if they prefer.", "phi:2.7b": " The Union of European Football Associations (Uefa) has decided to allow European football matches to be played on artificial pitches from the start of next season. This decision was based on a study into the sporting and medical aspects of using such surfaces, which had been conducted by Uefa in recent years. The use of artificial playing surfaces will not be made obligatory but must comply with quality criteria set by Uefa, including being part of the latest generation of artificial turf.\n", "orca-mini:3b": " UEFA approved fake grass for European matches starting from the next season. The decision was made after studying the sporting and medical aspects of using artificial playing surfaces. Although it is not mandatory, clubs can use these surfaces subject to meeting Uefa quality criteria. International matches can also be played on such pitches, but major tournaments have to be contested on grass. However, the use of artificial pitches has been sanctioned by UEFA from the start of next season, but only for certain clubs who play in winter.", "hermes3:3b": "Uefa allows European matches on artificial pitches starting next season, after assessing sporting and medical aspects.", "stablelm-zephyr:3b": "Uefa allows European football matches to be played on artificial pitches starting next season, following comprehensive studies into the sporting and medical aspects of using artificial playing surfaces. Artificial turf will be allowed subject to complying with Uefa quality criteria, and several leading clubs from Scandinavia, Russia, and eastern Europe are expected to install artificial pitches for Champions League or UEFA Cup matches played in winter.", "chatgpt-4o-latest": "Uefa has approved the use of artificial pitches for European matches starting next season, following studies on their sporting and medical aspects. These surfaces must meet Uefa's quality criteria but are not mandatory. While international matches can also be played on artificial turf, major tournaments will still require grass pitches. Uefa insists modern artificial surfaces are significantly improved compared to those used in the 1980s. Clubs from Scandinavia, Russia, and Eastern Europe, particularly those playing in winter, are expected to adopt them.", "stablelm2:1.6b": "UEFA approves fake grass for European matches starting next season due to comprehensive studies on its sports and medical aspects. Clubs like Luton, Preston, and Queens Park Rangers previously used plastic pitches during the 2010s but improved surfaces are now acceptable subject to meeting quality criteria. International matches can be played on such pitches, although games at major tournaments must be on grass. The latest generation of artificial turf must meet strict standards for use from next season onwards.", "granite3.1-dense:2b": "Uefa authorizes European football matches to be held on artificial turf beginning next season following thorough evaluations of its sporting and medical implications. This decision, made by the organization's Executive Committee, applies only if the surfaces meet Uefa's stringent quality standards and are the latest generation, distinct from the notorious pitches of the 1980s in clubs like Luton and QPR. International matches can also be played on these artificial fields, except during major tournaments. This move is expected to benefit several Scandinavian, Russian, and Eastern European teams hosting Champions League or Uefa Cup matches in winter due to their chilly climates.", "reference": "Uefa says it will allow European matches to be played on artificial pitches from the start of next season.Uefa spokesman Rob Faulkner said: \"People in England have bad memories of the artificial pitches of Luton and QPR in the 1980s, but the latest generation are completely different and are much more like grass.Several leading clubs from Scandinavia, Russia and eastern Europe - especially those who only play Champions League or Uefa Cup matches in winter - are now expected to instal artificial pitches.Luton, Preston, Queens Park Rangers and other clubs used to have plastic pitches during the the 1980s but, after a two-year study, Uefa insists the surfaces have moved on."}