{"raw_text": "Arnesen denies rift with Santini\n \n Tottenham sporting director Frank Arnesen has denied that coach Jacques Santini resigned because of a clash of personalities at White Hart Lane.\n \n There had been newspaper speculation that Santini had felt undermined by Arnesen's role at the club. \"It is absolutely not true,\" Arnesen told BBC Radio Five Live. \"There is only one thing that made him resign and that is his own personal problems. \"He has talked to me recently and said this matter is absolutely for himself.\" Arnesen said he was unable to throw any light onto the problems that caused Santini to quit after just 13 games in charge. He added: \"Jacques has never gone into exactly what it was. But I trust him in that; you have to accept it. I think we should respect it.\n \n \"The plan is now that over the weekend we will have talks with the board and then on Monday we will clarify the situation.\" Arnesen countered criticism at the timing of the announcement, coming less than 24 hours before Tottenham's Premiership fixture with Charlton. \"When it comes down to personal problems, I don't think we should talk about timing,\" he said. And he also denied reports that Santini had been given a £3m pay-off. \"That is absolute nonsense. He is the one who said 'I will go' and so he went'\", said the Spurs sporting director. Tottenham's structure of having a sporting director working alongside a coach is based on a continental model and Arnesen sees no reason why they should change it.\n \n \"I have confidence in this structure. I am confident that we have started something here in July and I still have a lot of confidence in Tottenham and what we are doing,\" he said. However, former Spurs and England defender Gary Stevens said he would not be surprised if the system had caused a rift. \"I think the problems go a lot deeper, between the director of football at White Hart Lane and Santini,\" Stevens told Five Live. \"On paper they could have worked together. But Frank Arnesen was a very creative, forward-thinking and expansive player - whereas I think Santini was very much the opposite, more a case of being organised, disciplined and happy not conceding goals. \"That sort of arrangement can work if the two people have the same principles and ideals and work very closely. But it seems that has not happened.\"\n", "llama3.2:1b": "Tottenham sporting director Frank Arnesen denies claims that coach Jacques Santini resigned due to a clash with Arnesen, saying Santini quit after personal problems rather than a disagreement with Arnesen's role at the club. Arnesen disputes reports of a £3m pay-off and says he trusts Santini to discuss his situation privately with the board over the weekend before clarifying matters on Monday.", "llama3.2:3b": "Frank Arnesen denies coach Jacques Santini resigned due to personality clash, citing personal problems as cause; Arnesen trusts Santini's explanation but acknowledges potential rift between their differing styles; Spurs will discuss situation with board over weekend.", "gemma2:2b": "Frank Arnesen denies rumors of conflict with coach Jacques Santini's resignation, stating personal problems as the sole cause. He emphasizes a trust in Santini's explanation and maintains their unique system of having a sporting director working alongside the coach will remain unchanged.  While some suggest that the structure may have created tension between them, Arnesen is confident in its effectiveness. \n", "qwen2.5:0.5b": "Arnesen denies resignation due to personality clash with Santini, but admits he didn't talk much about it. Tottenham will discuss plans with board members over the weekend, while former Spurs manager Gary Stevens claims problems are deeper between Arnesen and Santini in terms of personality and work ethic.", "qwen2.5:1.5b": "Tottenham sporting director Frank Arnesen denies Jacques Santini's resignation was due to a clash with him, citing personal issues as the reason for his departure after 13 games. He also dismisses claims of a £3m pay-off and maintains Tottenham’s structure allows confidence in its structure.", "qwen2.5:3b": "Tottenham sporting director Frank Arnesen denied claims of a rift with coach Jacques Santini, stating that Santini left because of personal issues rather than personality clashes. Arnesen emphasized he was unable to reveal the specific problems leading to Santini's resignation after 13 games in charge and expressed trust in their professional relationship. He confirmed plans for discussions with the board and clarified the situation soon. Arnesen defended Tottenham’s structure, which includes a sporting director alongside a coach, as based on continental models and sees no need for change. Former Spurs player Gary Stevens suggested that differences between Arnesen's creative approach and Santini's more disciplined style could have contributed to potential issues in their working relationship.", "opencoder:1.5b": "Arnesen denied rift with Santini\n\nTottenham sporting director Frank Arnesen denied that coach Jacques Santini resigned for a clash at White Hart Lane. The reason was a misunderstanding or miscommunication between them, both of whom had feelings about the situation. It is not true that Santini was underestimated and felt unsafe because of his personal problems, which Arnesen mentioned was beyond doubt.\n \nOver the weekend there was speculation that Santini had felt threatened by Arnesen's role at the club. \"It seems entirely possible,\" Arnesen said on BBC Radio Five Live. \"There is only one thing that made him leave,\" he added: \"He has talked to me recently and said this matter is absolutely for himself. He has faced many personal challenges, but I trust in him as he has done in other matches.\"\n \nAfter 13 games, Arnesen said he was unable to throw any light onto the problems that caused Santini to quit. He added: \"Jacques has never gone into exactly what it was. But I'm sure he would have understood.\n \nHowever, former Tottenham and England defender Gary Stevens made a point of criticizing Arnesen when he pointed out the system could create an rift between Santini and Arnesen. He said he wouldn't be surprised if the system had caused a rift. \"I think the problems go a lot deeper, between the director of football at White Hart Lane and Santini,\" Stevens told Five Live. \"On paper they could have worked together. But Frank Arnesen was forward-thinking and expansive, who seemed to think that would be beneficial for both players.\"\n \nAfter all, it is important to maintain consistency in player development and performance despite personal conflicts or unresolved issues.\n", "smollm:1.7b": "The summary is concise, preserving key ideas and details while omitting unnecessary information. The main points are:\n\n1. Arnesen denies rift with Santini\n2. Tottenham sporting director Frank Arnesen denied that coach Jacques Santini resigned because of a clash of personalities at White Hart Lane\n3. There had been newspaper speculation about Santini having felt undermined by Arnesen's role at the club\n4. Santini had talked to Arnesen recently and said this matter is absolutely for himself\n5. Arnesen did not give any explanation or reasoning process for his decision, only stating that he trusts Santini in that he has accepted the resignation\n6. Arnesen denied that Santini resigned because of a clash of personalities at White Hart Lane\n7. There had been newspaper speculation about Santini having felt undermined by Arnesen's role at the club\n8. Santini did not give any explanation or reasoning process for his decision, only stating that he trusts Santini in that he has accepted the resignation", "deepseek-r1:1.5b": "<think>\nOkay, so I need to help summarize this text. The user provided a detailed passage about Frank Arnesen's response regarding Jacques Santini's resignation at Tottenham. They asked for a concise summary in plain text without any explanations or formatting.\n\nFirst, I'll read through the original text carefully to understand the key points. Arnesen denies that Santini resigned because of personality issues and claims his personal problems led him to leave. He also mentions talks with Santini but can't confirm what caused the resignation. He counters some criticisms about timing and the timing being too close, especially before their upcoming match. He supports the current structure of Tottenham's leadership, pointing out that Arnesen was forward-thinking compared to Santini.\n\nI should identify the main ideas: Arnesen's denial on Santini's resignation due to personal issues; he denied a £3m pay-off report and criticized the timing of the announcement; he supported the existing football director/coach structure. Also, he mentioned that Arnesen was forward-thinking while Santini was more organized.\n\nI need to make sure the summary captures these points concisely. I'll mention that Arnesen denies the resignation being due to personal reasons and doesn't have any info on why Santini left after just 13 games. He also notes the criticism about timing, especially before a big match, and supports the current structure because of Arnesen's leadership style.\n\nI should avoid using any additional explanations or markdown, keeping it straightforward. Make sure all main points are included without going into too much detail.\n</think>\n\nFrank Arnesen denies that Jacques Santini resigned due to personality conflicts at White Hart Lane, stating his personal issues led him to leave. He criticized the £3m pay-off report and condemned the timing of the announcement before their upcoming match. Arnesen supports Tottenham's current leadership structure, noting he was forward-thinking compared to Santini, who was more organized.", "tinyllama:1.1b": "Arnesen denies rifts with Santini after Tottenham sporting director Frank Arnesen refutes newspaper speculation, stating that personal problems were behind Santiñ's resignation from the position, which had been for himself. He also refutes accusations that he made any pay-offs and emphasizes the importance of a structured approach at Tottenham. Stevens concludes that while there could have been issues between the two, they worked well under Arnesen's leadership.", "tinydolphin:1.1b": " Frank Arnesen initially denied rumors about Jacques Santini resigning due to a rift with Tottenham Sporting Director, saying that the situation was only for him. However, Arnesen later told BBC Radio Five Live that there had been newspaper speculation suggesting the coach's departure had been influenced by his role at the club. \n\nArnesen also mentioned that it is not accurate to say that Santini felt undermined by Frank Arnesen's position, and he assured that he had no knowledge of any pay-off or personal problems behind the resignation. He emphasized the importance of respecting both parties and their individual goals within the Tottenham framework.\n\nArnesen also rejected rumors about a £3 million payment to Santini following his departure, stating it was \"absolute nonsense.\" The Spurs sporting director added that he had confidence in this structure and saw no reason for them to change it.\n\nFormer Spurs defender Gary Stevens, however, expressed surprise at the nature of the rift between Arnesen and Santini, saying he would not be surprised if the system had caused a rift.", "phi:2.7b": " Arnesen denies that he caused Santosnini to resign as Tottenham sporting director by clashing with him over personalities, instead stating that Santini's personal issues were the reason for his resignation. He also clarifies that there are no problems between him and Santini. The plan is to have a meeting with the board soon after Santini resigned, but Arnesen denies any rumours of a pay-off. Despite this, Stevens, a former Tottenham player, believes that the director and coach may not have had similar principles and ideals which led to their failure in working together effectively.\n", "orca-mini:3b": " Arnesen denies rift with Santini, despite newspaper speculation", "hermes3:3b": "Arnesen denies Santini quitting due to personality clash, claims personal issues as reason for resignation.", "stablelm-zephyr:3b": "Tottenham's sporting director Frank Arnesen denies that coach Jacques Santini resigned due to a clash of personalities at White Hart Lane. Arnesen says the only reason for Santini's resignation is his personal problems, and he cannot reveal more. The plan is to have talks with the board to clarify the situation. Former Spurs and England defender Gary Stevens suggests that the system of having a director of football working alongside a coach might have caused rifts between Arnesen and Santini, whose contrasting personalities could not work together effectively.", "chatgpt-4o-latest": "Tottenham sporting director Frank Arnesen denied that coach Jacques Santini resigned due to a personality clash, attributing his departure solely to personal reasons. Arnesen stated Santini never disclosed the exact nature of his issues and urged respect for his decision. He dismissed speculation that Santini felt undermined or received a £3m pay-off. Arnesen defended Tottenham's sporting director-coach structure, despite former player Gary Stevens suggesting a deeper conflict between the two due to differing football philosophies. The club planned to clarify the situation after discussions with the board.", "stablelm2:1.6b": "Tottenham sporting director Frank Arnesen denies that coach Jacques Santini resigned due to a personality clash, instead citing personal problems as the reason. Speculation in newspapers suggested that Santini was undermined by Arnesen's role at the club. Arnesen maintains confidence in the continental model of having a sporting director alongside a coach and has no intention of changing it. Former player Gary Stevens suggests that the system may have caused a rift, but both Arnesen and Santini were described as having different principles and ideals.", "granite3.1-dense:2b": "Frank Arnesen, Tottenham's sporting director, refutes claims that coach Jacques Santini resigned due to a personality conflict at White Hart Lane. Instead, Arnesen asserts that Santini's departure was personal and not disclosed in detail. Santini recently shared this information with Arnesen, who plans to discuss the matter further with the board on Monday. Arnesen dismisses concerns about the timing of the announcement and denies reports of a £3m pay-off for Santini. Despite criticism, he maintains confidence in Tottenham's structure, which involves a sporting director working alongside a coach, based on a continental model. However, former player Gary Stevens speculates that the rift between Arnesen and Santini might be deeper due to their contrasting personalities: Arnesen as creative and forward-thinking, while Santini is described as organized, disciplined, and goal-concession averse.", "reference": "Tottenham sporting director Frank Arnesen has denied that coach Jacques Santini resigned because of a clash of personalities at White Hart Lane.\"When it comes down to personal problems, I don't think we should talk about timing,\" he said.He is the one who said 'I will go' and so he went'\", said the Spurs sporting director.\"I think the problems go a lot deeper, between the director of football at White Hart Lane and Santini,\" Stevens told Five Live.Arnesen said he was unable to throw any light onto the problems that caused Santini to quit after just 13 games in charge.\"He has talked to me recently and said this matter is absolutely for himself.\"But Frank Arnesen was a very creative, forward-thinking and expansive player - whereas I think Santini was very much the opposite, more a case of being organised, disciplined and happy not conceding goals.Tottenham's structure of having a sporting director working alongside a coach is based on a continental model and Arnesen sees no reason why they should change it.I am confident that we have started something here in July and I still have a lot of confidence in Tottenham and what we are doing,\" he said.\"It is absolutely not true,\" Arnesen told BBC Radio Five Live."}