{"raw_text": "Mansfield 0-1 Leyton Orient\n \n An second-half goal from Andy Scott condemned Mansfield to a ninth successive game without a win.\n \n Early in the second half Wayne Carlisle's cross was met by Scott and he blasted the ball home from just outside the penalty area. As Orient chased a second, Mansfield had to clear Alan White's header off the line and Kevin Pilkington saved well from Michael Simpson. By the end Mansfield fans were chanting for the head of chairman Keith Haslam.\n \n Pilkington, Talbot, Buxton, Dimech, Artell, Corden, Murray, Curtis, Neil, Warne, Barker. Subs Not Used: White, McIntosh, Wood, Lloyd, Herron.\n \n Harrison, Lockwood, Donny Barnard, White,Mackie, Scott, Saah, Simpson, Carlisle, Lee Barnard, Ibehre. Subs Not Used: Morris, Wardley, Newey, Zakuani, McMahon.\n \n Scott 51.\n \n 3,803\n \n S Mathieson (Cheshire).\n", "llama3.2:1b": "Mansfield 0-1 Leyton Orient\nAndy Scott scored for Mansfield in the second half to condemn them to a ninth consecutive game without a win.\n\nMansfield's match was marked by chaos off the pitch. Fans chanted the chairman Keith Haslam's head after his dismissal.\nMansfield's subs included Kevin Pilkington, Talbot and Buxton.", "llama3.2:3b": "Mansfield lost to Leyton Orient 1-0 in the second half with a goal from Andy Scott. The loss is Mansfield's ninth game without a win, prompting chants of \"get out\" from fans towards chairman Keith Haslam.", "gemma2:2b": "Mansfield lost to Leyton Orient 0-1 in a match where they were denied by Scott's goal in the second half. Fans protested against chairman Keith Haslam for their team's poor run of form.  \n", "qwen2.5:0.5b": "A recent game saw Mansfield, the underdogs, losing their last two games without a win. However, in the second half, the players managed to score a goal against Orient and encourage fans to cheer for Keith Haslam as chairman of Mansfield.", "qwen2.5:1.5b": "Andy Scott's late second-half goal secured Mansfield's ninth consecutive loss as they were condemned to a defeat by Leyton Orient. Fans called for chairman Keith Haslam's head during the match.", "qwen2.5:3b": "Mansfield lost 1-0 to Leyton Orient in a second-half match with Andy Scott scoring the only goal. Mansfield cleared an early header off the line and Kevin Pilkington made a save from Michael Simpson. Mansfield's fans chanted for the chairman, Keith Haslam. The teams were: Mansfield - Pilkington, Talbot, Buxton, Dimech, Artell, Corden, Murray, Curtis, Neil, Warne, Barker; Orient - Harrison, Lockwood, Donny Barnard, White, Mackie, Scott, Saah, Simpson, Carlisle, Lee Barnard, Ibehre. Attendance was 3,803, with S Mathieson (Cheshire) as the match official.", "opencoder:1.5b": "The goal of the game between Mansfield and Andy Scott from the second half was to go nine games without a win. The ball was intercepted by Wayne Carlisle while playing at the penalty area. Carlisle chased the ball into the opponent's possession, and when Scott tried to return it, he blotted it. The Orient also cleared Alan White's header off the line, and Kevin Pilkington saved Michael Simpson. By the end of the second half, fans were arguing for the head of Keith Haslam.\n", "smollm:1.7b": "The summary is concise and to the point, capturing the key events of the match without including any additional information or analysis. The main points are:\n\n1. Mansfield's second-half goal from Andy Scott was condemned by Orioles in a ninth game without a win.\n2. Early in the second half, Wayne Carlisle's cross was met by Scott and he blasted the ball home from just outside the penalty area.\n3. As Orient chased a second, Mansfield had to clear Alan White's header off the line and Kevin Pilkington saved well from Michael Simpson.\n4. By the end of the match, Mansfield fans were chanting for the head of chairman Keith Haslam.\n5. Pilkington, Talbot, Buxton, Dimech, Artell, Corden, Murray, Curtis, Neil, Warne, Barker, and Harrison were all players who played a key role in the match.\n6. The final score was 3-1 Mansfield.\n7. The main points are: Mansfield's goal from Scott was condemned by Orioles in a ninth game without a win; Early in the second half, Wayne Carlisle's cross was met by Scott and he blasted the ball home from just outside the penalty area; As Orient chased a second, Mansfield had to clear Alan White's header off the line and Kevin Pilkington saved well from Michael Simpson; By the end of the match, Mansfield fans were chanting for the head of chairman Keith Haslam.\n8. The summary does not include any additional information or analysis about the match.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to help summarize the given football text. Let me read through it again.\n\nThe game is between Mansfield and Leyton Orient. It's a second-half goal from Andy Scott that ends Mansfield without a win for their ninth straight loss. \n\nIn the second half, Wayne Carlisle crosses, and Scott hits it home with the penalty area just outside. Both teams had to clear headers, and Kevin Pilkington saved well from Michael Simpson.\n\nAt the end of the game, fans were cheering the chairman at Keith Haslam, which shows support for his team.\n\nThen there are a bunch of substitutions: players like Talbot, Buxton, Dimech, Artell, Corden, Murray, Curtis, Neil, Warne, Barker came in. Others stayed out.\n\nFinally, it says Harrison, Lockwood, Donny Barnard, White, Mackie, Scott, Saah, Simpson, Carlisle, Lee Barnard, and Ibehre scored for Mansfield, totaling 51 points.\n\nThe game ended with a total of 3,803 goals. \n\nI need to make sure the summary includes key ideas: who won, who lost, who came in (substitutes), goals, and the final score.\n\nSo, summarizing it all in one sentence without any extra explanations or formatting.\n</think>\n\nMansfield 51-3, Leyton Orient 0-1. An eighth consecutive loss for Mansfield. Wayne Carlisle's cross led to Andy Scott scoring from outside the penalty area. A goal by Scott ended the game with 3,803 goals scored. Key players: Talbot, Buxton, Dimech, Artell, Corden, Murray, Curtis, Neil, Warne, Barker came in. Substitutions: Harrison, Lockwood, Donny Barnard, White, Mackie, Scott, Saah, Simpson, Carlisle, Lee Barnard, Ibehre scored for Mansfield.", "tinyllama:1.1b": "The second-half goal from Andy Scott condemned Mansfield to a ninth consecutive game without a win, with the team forced to clear their own header off the line and save Kevin Pilkington's shot. Supporters were vocal in chanting for the head of chairman Keith Haslam. The match ended 1-0 to Orient, who went on to secure three points despite losing two players due to injuries. The team finished in last place with just one point from their first nine games.", "tinydolphin:1.1b": " To summarize this text: Mansfield lost 2-1 to Leyton Orient. The summary should be short and to the point, focusing on key players' names and scores. In addition, it should provide details about where the game took place, the opposing team's name and their score, and a brief description of how the game ended.", "phi:2.7b": " In the match between Mansfield and Leyton Orient, Andy Scott scored a second-half goal that condemned Mansfield to another game without a win. Kevin Pilkington saved well from Michael Simpson's header in the second half. The final score was 2-0 in favor of Leyton Orient.\n", "orca-mini:3b": " Mansfield's second-half goal from Andy Scott ended up being the game-winner, as Orient chased a second for the second time. However, the visitors cleared Alan White's header off the line and Michael Simpson saved well from Pilkington. By the end, Mansfield fans were chanting for Haslam's head.", "hermes3:3b": "Mansfield lost to Leyton Orient with a second-half goal from Andy Scott, resulting in their ninth straight game without winning.", "stablelm-zephyr:3b": "Andy Scott scored the only goal of the match for Leyton Orient, giving them their ninth consecutive win and leaving Mansfield without a victory. Early in the second half, Scott's powerful shot secured the win for Leyton Orient. Mansfield's fans showed dissatisfaction towards chairman Keith Haslam by chanting for his head at the end of the game. No substitutions were made for either team during the match.", "chatgpt-4o-latest": "Andy Scott's second-half goal secured a 1-0 victory for Leyton Orient over Mansfield, extending Mansfield's winless streak to nine games. Scott scored from just outside the penalty area after meeting Wayne Carlisle's cross. Mansfield had to clear Alan White's header off the line, and goalkeeper Kevin Pilkington made a key save from Michael Simpson. Frustrated Mansfield fans chanted for chairman Keith Haslam's removal by the end of the match.", "stablelm2:1.6b": "Mansfield loses to Leyton Orient 1-0 with Andy Scott scoring the only goal in the second half from a cross by Wayne Carlisle. Mansfield fans chant for Keith Haslam's head. Key players include Kevin Pilkington, Alan White, Michael Simpson, and Michael Ibehre, but no substitutions were used during the match. The most substituted team was Leyton Orient with 7 different players appearing in their starting lineup.", "granite3.1-dense:2b": "Leyton Orient defeated Mansfield 1-0 in their match, with Andy Scott scoring the only goal from a cross by Wayne Carlisle midway through the second half. Despite Mansfield's efforts to prevent a second goal, including clearances and saves by goalkeeper Kevin Pilkington, they were unable to secure a win, extending their losing streak to nine games. Frustrated fans began chanting for Chairman Keith Haslam's dismissal. The lineups for both teams are listed, along with the scorekeeper and attendance.", "reference": "Scott 51.An second-half goal from Andy Scott condemned Mansfield to a ninth successive game without a win.Harrison, Lockwood, Donny Barnard, White,Mackie, Scott, Saah, Simpson, Carlisle, Lee Barnard, Ibehre.As Orient chased a second, Mansfield had to clear Alan White's header off the line and Kevin Pilkington saved well from Michael Simpson."}