{"raw_text": "Wolves appoint Hoddle as manager\n \n Glenn Hoddle will be unveiled as the new Wolves manager on Tuesday.\n \n The club have confirmed that the former England coach will be unveiled as the successor to Dave Jones at a news conference at Molineux at 1100 GMT. Hoddle has been linked with a return to former club Southampton but Wolves have won the race for his services. He has been out of the game since being sacked at Spurs in September 2003 and worked alongside Wolves caretaker boss Stuart Gray at Southampton. Hoddle began his managerial career as player-boss with Swindon before moving on to Chelsea and then taking up the England job.\n \n His spell in charge of the national side came to an end after the 1998 World Cup when he made controversial remarks about the disabled in a newspaper interview. The 47-year-old later returned to management with Southampton, where he again succeeded Jones - as he has now done at Wolves. He engineered an upturn in Saints' fortunes before being lured to White Hart Lane by Tottenham - the club where he made his name as a player. That relationship turned sour at the start of the last campaign and he left the London club early last season. Since then he has applied unsuccessfully for the post of France manager and had also been linked with a return to Southampton. Wolves are currently 17th in the Championship and have a home game against Millwall on Tuesday.\n", "llama3.2:1b": "Glenn Hoddle will be unveiled as the new Wolves manager on Tuesday, succeeding Dave Jones at a news conference at Molineux. Hoddle has been linked with a return to Southampton but is now the preferred choice for Wolves.", "llama3.2:3b": "Glenn Hoddle will be unveiled as the new Wolves manager at a news conference on Tuesday, succeeding Dave Jones. He has no previous managerial role since being sacked by Spurs in 2003 and worked with Stuart Gray at Southampton. Hoddle previously managed Swindon and Chelsea before England's 1998 World Cup.", "gemma2:2b": "Glenn Hoddle will be unveiled as new Wolverhampton Wanderers manager at Molineux on Tuesday. He succeeds Dave Jones and was favored for the position over Southampton, where he previously worked. Hoddle's managerial career includes spells with Chelsea, England, and Southampton. \n", "qwen2.5:0.5b": "Former England coach Glenn Hoddle, now Wolves' new manager, will take over as caretaker boss following his release from his role at Southampton, where he had worked for six years. Hoddle's brief stint with Southampton came to an end when he was sacked in 1998 during the World Cup.", "qwen2.5:1.5b": "Wolves announce Glenn Hoddle as new manager, replacing Dave Jones, who was sacked by Spurs earlier this year after controversial comments about disabled players during his time managing England. Hoddle previously managed Southampton under Jones before taking over at Wolves following the latter's departure from Tottenham. The club is currently 17th in the Championship and has a game against Millwall on Tuesday.", "qwen2.5:3b": "Glenn Hoddle will be unveiled as new Wolves manager on Tuesday, succeeding Dave Jones. The former England coach has worked with Wolves caretaker boss Stuart Gray at Southampton before moving to Chelsea and then managing England. He was previously at Tottenham but left early last season. Hoddle is currently 47 years old and has managed Southampton twice. Wolves are 17th in the Championship, hosting Millwall on Tuesday.", "opencoder:1.5b": "Wolves appoint Hoddle as manager.\nGlenn Hoddle will be unveiled as the new Wolves manager on Tuesday.\nThe club confirm that the former England coach will be unveiled as the successor to Dave Jones at a news conference at Molineux at 11:00 GMT. Hoddle has been linked with a return to former club Southampton but Wolves have won the race for his services. He has been out of the game since being sacked at Spurs in September 2003 and worked alongside Wolves caretaker boss Stuart Gray at Southampton.\nHoddle began his managerial career as player-boss with Swindon before moving on to Chelsea and then took up the England job. He spell in charge of the national side came to an end after the 1998 World Cup when he made controversial remarks about the disabled in a newspaper interview. The 47-year-old later returned to management with Southampton, where he again succeeded Jones - as he has now done at Wolves. He engineered an upturn in Saints' fortunes before being lured to White Hart Lane by Tottenham - the club where he made his name as a player. That relationship turned sour at the start of the last campaign and he left the London club early last season. Since then he has applied unsuccessfully for the post of France manager and had also been linked with a return to Southampton.\nWolves are currently 17th in the Championship and have a home game against Millwall on Tuesday.\n", "smollm:1.7b": "The summary should be:\nWolves appoint Hoddle as manager\nGlenn Hoddle will be unveiled as the new Wolves manager on Tuesday.\nHoddle has been linked with a return to former club Southampton but Wolves have won the race for his services. He has been out of the game since being sacked at Spurs in September 2003 and worked alongside Wolves caretaker boss Stuart Gray at Southampton. Hoddle began his managerial career as player-boss with Swindon before moving on to Chelsea and then taking up the England job.\nHoddy's spell in charge of the national side came to an end after the 1998 World Cup when he made controversial remarks about the disabled in a newspaper interview. The 47-year-old later returned to management with Southampton, where he again succeeded Jones - as he has now done at Wolves. He engineered an upturn in Saints' fortunes before being lured to White Hart Lane by Tottenham - the club where he made his name as a player. That relationship turned sour at the start of the last campaign and he left the London club early last season. Since then he has applied unsuccessfully for the post of France manager and had also been linked with a return to Southampton. Wolves are currently 17th in the Championship and have a home game against Millwall on Tuesday.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Glenn Hoddle joining the Wolves. Let me read through it again.\n\nThe text starts by saying Wolves appoint Hoddle as manager. Then, there's a news conference at Molineux at 1100 GMT. He will be unveiled after Dave Jones is away. Hoddle was linked with Southampton but was ultimately chosen over him. He started as player-boss in Swindon and managed Chelsea and then England, even making controversial comments about disabled athletes during the World Cup in 1998. After Tottenham, he tried to get back there but left early because of sour relationships. He also applied for France manager position but failed. Wolves are currently 17th in the Championship, and they'll play Millwall tomorrow.\n\nSo the key points are: Hoddle joins Wolves after Dave Jones is gone, he was linked with Southampton, became the manager despite a history of controversial comments, managed Chelsea/England before Tottenham, tried back to work at Southampton, failed to secure France manager position, currently in 17th place in the Championship.\n\nI need to make sure the summary captures all these points concisely without extra info. I'll list each main point clearly.\n</think>\n\nWolves appoint Glenn Hoddle as their new manager after Dave Jones is announced away. Hoddle was linked with Southampton but chose Wolves, having worked alongside Stuart Gray at Southampton and previous roles in Chelsea/England. He criticized disabled athletes during the 1998 World Cup and managed Tottenham before leaving for London's White Hart Lane. Currently ranked 17th in the Championship, he faces a successful attempt to secure France manager status. Millwall is their next game on Tuesday.", "tinyllama:1.1b": "Wolverhampton Wanderers will announce their new manager, former England coach Glenn Hoddle, at a news conference at Molineux Stadium on Tuesday (tomorrow). Hoddle has been linked with several clubs, including Southampton and Chelsea FC, but Wolves have secured the services of his predecessor, Stuart Gray, as caretaker manager until an official replacement is appointed. The 47-year-old coach was out of active management in the Premier League since being dismissed by Southampton in September 2003, and he worked alongside Wolves' caretakeboss boss, Derek Bosh, at Swindon Town FC before taking up the England job. His managerial career began as a player-coach with Swindon and he later served as manager of Charlton Athletic FC. HoDDLE has now been appointed as manager by Wolves after former coach Dave Jones was sacked. He led Southampton to the FA Cup semi-finals in 2003, but his tenure at the helm ended abruptly due to controversial comments he made about disabled people during a newspaper interview. HoDDLE has now been linked with several clubs, including Tottenham and Chelsea FC, but Wolves have secured the services of Gary Gray as caretaker manager until an official replacement is appointed.", "tinydolphin:1.1b": " The news of Glenn Hoddle being appointed as the new Wolverhampton Wanderers manager comes following an announcement at a press conference on Monday afternoon, where the club's management announced that the 47-year-old English coach will take charge from Dave Jones. This comes after a protracted search for a replacement for the former England manager who left Molineux in September 2003 and worked alongside the current interim manager Stuart Gray. Hoddle has been out of action since his sacking at Tottenham Hotspur, but he was initially linked with the Southampton job before rebuffing that opportunity to take charge at Swindon. The appointment of Hoddle comes as a surprise to fans who were hopeful for a change in managerial strategy after recent struggles under Dave Jones, and they eagerly await what this new chapter in Wolverhampton Wanderers' history will bring.", "phi:2.7b": " Glenn Hoddle, a former England coach, will be unveiled as the new Wolves manager on Tuesday at a news conference at Molineux. He has worked alongside caretaker boss Stuart Gray at Southampton before being out of the game since 2003. He began his managerial career with Swindon and has since taken up several other management roles, including at Chelsea and Tottenham. His controversial remarks about the disabled in an interview ended his spell as England manager but he returned to manage Saints where he made an upturn in their fortunes. He is now back at Wolves after being out of the game for over a decade.\n", "orca-mini:3b": " Wolves appoint Hoddle as manager after confirming him as their new boss at a news conference at Molineux at 1100 GMT. He has won the race for his services, having been out of the game since being sacked at Spurs in September 2003 and worked alongside Wolves caretaker boss Stuart Gray at Southampton. Hoddle began his managerial career as player-boss with Swindon before moving on to Chelsea and then taking up the England job.", "hermes3:3b": "Glenn Hoddle appointed Wolves manager.", "stablelm-zephyr:3b": "Glenn Hoddle appointed as new Wolves manager, replacing Dave Jones. Former England coach previously linked with Southampton and had management stints at Chelsea and Swindon before his 1998 World Cup controversies. Hoddle returns to former club Southampton shortly after leaving Tottenham early in the last season. Wolves currently 17th in Championship.", "chatgpt-4o-latest": "Glenn Hoddle will be unveiled as the new Wolves manager on Tuesday, succeeding Dave Jones. The former England coach, previously linked with Southampton, has been out of management since being sacked by Spurs in 2003. Hoddle, who started his managerial career at Swindon before moving to Chelsea and England, left the national team after the 1998 World Cup following controversial remarks. He later managed Southampton and Spurs, but his tenure at Tottenham ended early last season. Wolves, currently 17th in the Championship, will face Millwall at home on Tuesday.", "stablelm2:1.6b": "Glenn Hoddle will become the new Wolves manager, succeeding Dave Jones at a news conference. He previously managed Southampton and engineered their success before leaving Tottenham. Hoddle began his career as player- boss with Swindon and has worked as a caretaker boss at Southampton. His stint with England was cut short by controversy in an interview about disabled individuals. Hoddle returned to management with Southampton, where he replaced Jones. He improved Saints' performance but was lured by Tottenham. Since leaving Tottenham, Hoddle tried unsuccessfully for the France manager position and has been linked with a return to Southampton. The Wolves are currently in the Championship and will face Millwall in their next home game.", "granite3.1-dense:2b": "Glenn Hoddle, the former England coach, will be officially named as Wolverhampton Wanderers' new manager at a news conference at Molineux on Tuesday at 1100 GMT. Despite being linked with Southampton and France's national team, Wolves secured Hoddle's services. Hoddle, now 47, began his managerial career as a player-manager with Swindon before moving to Chelsea, then the England coach, and eventually back to management at Southampton in 2013, where he replaced Dave Jones. He led Southampton to improved performance until joining Tottenham in 2004, but their relationship soured, leading to his departure early last season. Since then, Hoddle has pursued the France manager role and been linked with a return to Southampton. Currently, Wolves are 17th in the Championship, preparing for a home match against Millwall on Tuesday.", "reference": "Hoddle has been linked with a return to former club Southampton but Wolves have won the race for his services.Glenn Hoddle will be unveiled as the new Wolves manager on Tuesday.The 47-year-old later returned to management with Southampton, where he again succeeded Jones - as he has now done at Wolves.He has been out of the game since being sacked at Spurs in September 2003 and worked alongside Wolves caretaker boss Stuart Gray at Southampton.Since then he has applied unsuccessfully for the post of France manager and had also been linked with a return to Southampton."}