{"raw_text": "Wenger keeping faith with Almunia\n \n Arsene Wenger has pledged to keep faith with stand-in keeper Manuel Almunia for the crunch week which could define Arsenal's season.\n \n Almunia will start Tuesday's Champions League group tie against Rosenborg and is likely to face Chelsea on Sunday. Wenger said: \"You don't think I would take out one goalkeeper for just one game, do you? I don't do that. \"I have to give him a run for a few games. It's just that I don't want to make this story bigger than it is.\" Wenger insists he has complete faith in the 27-year-old Spaniard, who was signed last summer from Celta Vigo as back-up to Jens Lehmann.\n \n \"If you look at my career, you will see that I have left many big players out for a long time. I've done it with Dennis Bergkamp, Kanu, everybody. \"It's because it's a goalkeeper, that's all. It's a usual situation for me. You put your best team out, no matter who it is. \"For me, it was not a big mistake at Old Trafford and I wasn't alarmed by what happened against Birmingham either. \"It's nothing against Lehmann. I think he's a great keeper, as is Almunia. You can only play one of them. \"These people are not robots - they have good periods and less good periods. Just because Lehmann doesn't play for two or three weeks, or longer or shorter, it doesn't mean I've lost faith in him.\"\n \n But former Arsenal keeper David Seaman believes Lehmann has been harshly treated. Seaman told the Daily Mail: \"Jens is a fantastic keeper. He deserves another chance. \"He has made a few mistakes but on form he deserves to be the first-team choice.\" With Arsenal hit by injuries and suspension, inexperienced midfield pair of Mathieu Flamini and Cesc Fabregas will line up against Rosenborg but Wenger is confident they will prove more than capable. \"It puts a lot of pressure on them but it's a good learning process,\" said Wenger. \"I'm not worried as they are both mentally strong and will put in the needed workrate.\"\n \n The Gunners go into the game boosted by the news that defender Sol Campbell is on the verge of signing a new deal with the club. And the 30-year-old, whose current contract runs out in the summer, has made it clear he is determined to achieve Champions League success with Arsenal. Campbell said: \"It means a lot to me to go through, it's everything. We want to carry on in this competition. \"That's where the best teams in Europe are. To be in there, playing against these guys and trying to win the trophy, is the first thing in my mind.\"\n \n Meanwhile, Thierry Henry believes he will be blamed if Arsenal fail to qualify for the next stage of the Champions League. Henry will captain the side in place of the suspended Patrick Vieira as the Gunners seek the required victory over Rosenborg. And the striker said: \"If we don't win and we go out of the competition, like it or not, it's going to be my fault. That's the way it is. \"If the team don't win I know I will be criticised, no matter how I play.\"\n", "llama3.2:1b": "Arsene Wenger has stated that he will keep faith with stand-in goalkeeper Manuel Almunia for the upcoming Champions League matches despite having the option to replace him with Jens Lehmann. Wenger believes Almunia is a good backup and has complete confidence in his ability to perform under pressure. Wenger also expressed concerns over the treatment of former Arsenal keeper David Seaman, who believes Jens Lehmann should be given another chance. Meanwhile, Thierry Henry will captain the team as they seek victory against Rosenborg and potentially face criticism if they fail to qualify for the next stage of the Champions League.", "llama3.2:3b": "Arsene Wenger has pledged to continue using Manuel Almunia as Arsenal's goalkeeper despite criticism of his decision to bench Jens Lehmann. Wenger believes that giving Almunia a run in games is essential for his development and has faith in the 27-year-old Spaniard. The team, meanwhile, faces pressure with injuries and suspensions affecting midfielders Mathieu Flamini and Cesc Fabregas, but Wenger remains confident in their abilities. Defender Sol Campbell is close to signing a new contract, while Thierry Henry believes he will be blamed if Arsenal fail to qualify for the next stage of the Champions League.", "gemma2:2b": "Arsene Wenger plans to keep Manuel Almunia in goal for Arsenal's crucial Champions League games against Rosenborg and Chelsea. He believes Almunia deserves a run of starts and that he has faith in the 27-year-old Spaniard despite some recent mistakes.  Former goalkeeper David Seaman disagrees with this decision, stating that Jens Lehmann deserves another chance. While there will be pressure on young midfielders Mathieu Flamini and Cesc Fabregas, Wenger believes they are up to the task. Sol Campbell is nearing a new deal at Arsenal as he seeks Champions League success. Thierry Henry will captain the team against Rosenborg in place of the suspended Patrick Vieira.  Henry anticipates facing criticism if Arsenal fail to advance in the competition. \n", "qwen2.5:0.5b": "Arsenal forward Manuel Almunia has been kept in place as a stand-in goalkeeper for the week ahead of their Champions League group tie against Rosenborg. Wenger says he doesn’t believe he is taking out one goalkeeper for just one game and adds that he will give him \"a run for several games\". He admits his faith was put to test by Lehmann last summer, but believes Almunia has proven himself with the transfer from Celta Vigo. Almunia made a few mistakes but Wenger says he is confident he can make a difference in this game. Arsenal have made a significant change in their midfield line-up with defender Sol Campbell on a new deal and former Arsenal keeper David Seaman thinks Lehmann deserves another chance at being the first-team choice. Thierry Henry believes Arsenal will face challenges if they fail to qualify for the Champions League next stage, while Arsenal captain Thomas Hogg claims he will play his part in the game if they don't win.", "qwen2.5:1.5b": "Arsene Wenger pledges faith in Arsenal backup goalkeeper Manuel Almunia for key Champions League matches, despite concerns about his playing time and past performances. Former player David Seaman defends Jens Lehmann's form while Arsenal faces injury-hit opponents, but Thierry Henry admits he could be blamed if the club misses out on European qualification.", "qwen2.5:3b": "Arsene Wenger has vowed to keep Manuel Almunia as Arsenal’s backup keeper for a crucial week including Tuesday's Champions League match against Rosenborg and Sunday's clash with Chelsea. Despite concerns over Lehmann’s form, Wenger insists he trusts Almunia fully. Former keeper David Seaman criticizes Lehmann's treatment. Arsenal faces significant injury and suspension issues but Wenger is confident in Mathieu Flamini and Cesc Fabregas. Defender Sol Campbell is nearing a new contract that includes Champions League success ambitions. Thierry Henry will lead the team, accepting responsibility for potential failure in qualifying if Arsenal loses to Rosenborg.", "opencoder:1.5b": "Wenger has kept faith with Almunia for the crunch week which could define the season. Almunia starts Tuesday's Champions League group tie against Rosenborg and faces Chelsea on Sunday. He insists he has complete faith in the 27-year-old Spaniard who was signed last summer from Celta Vigo as a back-up to Jens Lehmann. The Spaniard has made a few mistakes, but he is determined to achieve success with Arsenal. This story promises a lot of learning and challenge, and it's worth noting that former Arsenal keeper David Seaman believes Lehmann has been harshly treated.\n", "smollm:1.7b": "Wenger keeping faith with Almunia for the crunch week which could define Arsenal's season", "deepseek-r1:1.5b": "<think>\nAlright, let me try to figure this out. The user wants a concise summary of a given text about Arsenal and their manager, Arsene Wenger. They provided a detailed paragraph with several key points: Wenger's commitment to Almunia for the Champions League week, his confidence in the team despite Lehmann facing criticism, the current injury situation for Arsenal, and specific quotes from Seaman and Henry.\n\nFirst, I need to identify the main ideas. The text is about Wenger keeping Al munia, his support for him, his belief that neither Lehmann nor Almunia will change their abilities, and the team's resilience despite some issues.\n\nI should make sure to include both positive and negative points. Positive aspects like Wenger's confidence and the team's adaptability, as well as the criticism from Seaman about Lehmann.\n\nThe user wants only the summary in plain text without any explanations or formatting. So I'll need to condense all this information into a clear, concise paragraph that captures each of these elements without getting bogged down by details.\n</think>\n\nArsene Wenger is committed to keeping Stand-in Goalkeeper Manuel Almunia with his team for the crucial Champions League week, hoping to secure Arsenal's season. He believes neither manager will change their abilities but is confident in the team's resilience, despite criticism from former player David Seaman about Lehmann. The Gunners are strong, overcoming injuries and uncertain suspensions while facing new additions like Thierry Henry.", "tinyllama:1.1b": "The Arsenal manager, Arwe Weingar, has announced that he will stick with Manuel Almunia in the crucial Champions League match against Rosenborg. Weingar emphasized that Almunia should get a chance to showcase his quality for the club after losing him out for just one game during their last fixture. However, the manager is not worried about the injury and suspension of Mathieu Flamini and Cesc Fabregas in Arsenal's midfield. Weingar believes that Almunia deserves a chance to prove himself and will be a mentally strong player when he returns from his injury. As for Sol Campbell, the Gunner defender has made it clear that he wants to stay with the club and win the Champions League in future seasons. This goal is not only important for him but also for the team's overall success. Meanwhile, Arwe Henry believes that if Arsenal don't qualify for the next round, it would be unfair of him to blame him or the suspended Patrick Vieira.", "tinydolphin:1.1b": " The Arsenal football club has pledged to keep faith with stand-in goalkeeper Manuel Almunia despite facing fierce criticism for not taking up the opportunity to start against Chelsea in their Champions League group tie. Arsene Wenger, who is expected to make a surprise move to sign Mathieu Flamini and Cesc Fabregas as backup options, expressed his confidence in Almunia's abilities while discussing the importance of patience with younger players in winning big trophies. Meanwhile, Thierry Henry has assured that he will not be blamed if Arsenal fails to qualify for the next stage of the Champions League.", "phi:2.7b": " Arsene Wenger has pledged to keep faith with Manuel Almunia for Arsenal's upcoming games, including a Champions League group tie against Rosenborg and a match on Sunday against Chelsea. Wenger believes in Almunia, even though he is not starting the first game against Birmingham City, as it's common practice to give back-up goalkeepers some playing time. Despite this, there are concerns about Lehmann's future at Arsenal due to his absence from the team. David Seaman believes that Lehmann deserves another chance and should be the first-team goalkeeper. With injuries and suspensions affecting the team, the midfield pair of Mathieu Flamini and Cesc Fabregas will line up against Rosenborg, but Wenger is confident they will learn from the experience. The news that defender Sol Campbell is on the verge of signing a new contract has boosted his morale, as he wants to be part of the team's success in achieving Champions League glory. Meanwhile, Thierry Henry believes he will face criticism if Arsenal fail to qualify for the next stage of the competition.\n", "orca-mini:3b": " Arsenal manager Arsene Wenger has pledged to keep faith with stand-in keeper Manuel Almunia for the crucial week that could define their season. Almunia is likely to feature in Tuesday's Champions League group tie against Rosenborg and could also face Chelsea on Sunday. Wenger said: \"You don't think I would take out one goalkeeper for just one game, do you? I don't do that. It's just that I don't want to make this story bigger than it is.\" However, former Arsenal keeper David Seaman believes Lehmann has been harshly treated and that Jens deserves another chance. Wenger is confident that inexperienced midfield pair Mathieu Flamini and Cesc Fabregas will prove more than capable of handling the pressure in the game against Rosenborg. Sol Campbell is close to signing a new deal with the club and has set his sights on achieving Champions League success with Arsenal. If the team doesn't win, Wenger knows he will be criticized, but he remains confident in Almunia's ability.", "hermes3:3b": "Arsene Wenger pledges faith in keeper Manuel Almunia over Jens Lehmann for crucial Arsenal matches.", "stablelm-zephyr:3b": "Arsene Wenger trusts stand-in goalkeeper Manuel Almunia and believes he should continue playing in important matches. Wenger has confidence in Almunia and wants to give him a chance, despite facing criticism for leaving Jens Lehmann on the bench. Former Arsenal goalkeeper David Seaman thinks Lehmann deserves more playing time. Arsenal's season could be defined by a crucial week, with games against Rosenborg and Chelsea coming up. The team is also dealing with injuries and suspensions. Defender Sol Campbell is signing a new contract, hoping to help Arsenal achieve Champions League success. Striker Thierry Henry will captain the team in place of suspended Patrick Vieira, acknowledging the responsibility he bears if the team fails to progress in the Champions League.", "chatgpt-4o-latest": "Arsene Wenger has confirmed his faith in goalkeeper Manuel Almunia, who will start Arsenal's crucial Champions League match against Rosenborg and likely face Chelsea. Wenger insists he has confidence in Almunia despite criticism and denies losing faith in Jens Lehmann. Former Arsenal keeper David Seaman believes Lehmann has been treated unfairly and deserves another chance. With injuries and suspensions affecting the squad, Wenger trusts young midfielders Mathieu Flamini and Cesc Fabregas to perform well. Arsenal is encouraged by Sol Campbell nearing a new contract and his determination to achieve Champions League success. Meanwhile, Thierry Henry, captaining in Patrick Vieira's absence, feels he will be blamed if Arsenal fails to progress in the competition.", "stablelm2:1.6b": "Arsene Wenger has committed to keeping Manuel Almunia in the starting lineup for important games despite potential injuries and suspensions affecting other players. Almunia is set to face Rosenborg and Chelsea during a Champions League group stage match. Wenger does not want to make decisions about who will play based on one game, emphasizing that his faith lies in the young Spanish goalkeeper's abilities. Arsenal's Mathieu Flamini and Cesc Fabregas are expected to perform well against Rosenborg but face significant pressure. The Gunners also benefit from news of Sol Campbell potentially extending his contract with the club. Henry is preparing for criticism if Arsenal does not qualify for the next stage of the Champions League despite captaincy duties on the weekend.", "granite3.1-dense:2b": "Arsene Wenger has decided to continue trusting stand-in goalkeeper Manuel Almunia for crucial matches against Rosenborg and Chelsea in the coming week. Despite concerns about Jens Lehmann's inconsistent form, Wenger maintains faith in both goalkeepers, emphasizing that they are not robots and have good periods followed by less so. Former Arsenal keeper David Seaman disagrees, arguing that Lehmann deserves another chance as a first-team choice due to his fantastic form.\n\nArsenal's inexperienced midfield pair, Mathieu Flamini and Cesc Fabregas, will face Rosenborg, but Wenger is confident they can handle the pressure and perform well. The team also benefits from Sol Campbell's impending contract extension, which signals his commitment to achieving Champions League success with Arsenal.\n\nThierry Henry, set to captain the team due to Patrick Vieira's suspension, acknowledges personal accountability for Arsenal's qualification status. If the team fails to advance in the competition, he anticipates facing criticism, regardless of his performance.", "reference": "Wenger said: \"You don't think I would take out one goalkeeper for just one game, do you?\"If the team don't win I know I will be criticised, no matter how I play.\"But former Arsenal keeper David Seaman believes Lehmann has been harshly treated.And the striker said: \"If we don't win and we go out of the competition, like it or not, it's going to be my fault.Wenger insists he has complete faith in the 27-year-old Spaniard, who was signed last summer from Celta Vigo as back-up to Jens Lehmann.And the 30-year-old, whose current contract runs out in the summer, has made it clear he is determined to achieve Champions League success with Arsenal.\"It puts a lot of pressure on them but it's a good learning process,\" said Wenger.Arsene Wenger has pledged to keep faith with stand-in keeper Manuel Almunia for the crunch week which could define Arsenal's season.I don't do that.\"That's where the best teams in Europe are.\"He has made a few mistakes but on form he deserves to be the first-team choice.\"You put your best team out, no matter who it is.Just because Lehmann doesn't play for two or three weeks, or longer or shorter, it doesn't mean I've lost faith in him.\"It's just that I don't want to make this story bigger than it is.\"Campbell said: \"It means a lot to me to go through, it's everything."}