{"raw_text": "Wenger steps up row\n \n Arsene Wenger has stepped up his feud with Sir Alex Ferguson by claiming the Manchester United manager is guilty of bringing football into disrepute.\n \n The pair's long-running row was put back in the headlines on Saturday when Ferguson said his Arsenal counterpart was \"a disgrace\". Wenger initially refused to bite back, saying only: \"I will never answer any questions any more about this man.\" But now he claims Ferguson should be punished by the Football Association. The latest twist in the Ferguson-Wenger saga came on Saturday when the United boss, in an interview with The Independent newspaper, discussed the events after the game between the two sides in October. United won 2-0 that day, at Old Trafford, but the game was followed by a now notorious food fight which saw Ferguson's clothes covered in soup and pizza. The sides meet again at Highbury on 1 February. \"In the tunnel Wenger was criticising my players, calling them cheats, so I told him to leave them alone and behave himself,\" Ferguson said on Saturday. \"He ran at me with hands raised saying 'what do you want to do about it?' \"To not apologise for the behaviour of the players to another manager is unthinkable. It's a disgrace, but I don't expect Wenger to ever apologise, he's that type of person.\"\n \n Those allegations were put to Wenger after Saturday's game at Bolton, which Arsenal lost to slip 10 points behind Chelsea in the title race. At first he said only: \"I've always been consistent with that story and told you nothing happened. \"If he has to talk, he talks. If he wants to make a newspaper article, he makes a newspaper article. \"He doesn't interest me and doesn't matter to me at all. I will never answer to any provocation from him any more. \"He does what he likes in England anyway. He can go abroad one day and see how it is.\" But later on Saturday, according to The Independent, Wenger spoke to a smaller group of reporters and expanded on his reaction. \"I have no diplomatic relations with him,\" the Arsenal boss is quoted as saying. \"What I don't understand is that he does what he wants and you (the press) are all at his feet.\n \n \"The situation (concerning the food fight) has been judged and there is a game going on in a month. \"The managers have a responsibility to protect the game before the game. But in England you are only punished for what you say after the game. \"Now the whole story starts again. I don't go into that game. We play football. I am a football manager and I love football above all ... no matter what people say.\" Reminded that Ferguson called him \"a disgrace\", Wenger added: \"I don't respond to anything. In England you have a good phrase. It is 'bringing the game into disrepute'. \"But that is not only after a game, it is as well before a game.\"\n \n Ferguson had also claimed that United chief executive David Gill and Arsenal vice-chairman David Dein had agreed at boardroom level not to discuss the incident in public. But Ferguson added: \"In the ensuing weeks all you got was a diatribe from Arsenal about being kicked off the pitch and all that nonsense. Gill phoned Dein three times to complain but nothing was done. \"The return is on 1 February and they will come out with another diatribe. \"David Gill and I feel we should set the record straight because Arsenal have not written to us to apologise and we would not let that happen here.\" Meanwhile, the League Managers Association have offered to act as peacemakers in the hope of resolving the on-going row. During that stormy game in October, United striker Ruud van Nistelrooy caught Arsenal's Ashley Cole with one particularly strong tackle. Wenger later accused Van Nistelrooy of \"cheating\" and was fined £15,000 and \"severely reprimanded\" by the Football Association. Ferguson admitted on Saturday that Van Nistelrooy's tackle, which earned the Dutchman a ban, \"could have given (Cole) a serious injury\", but he believes Arsenal were the main aggressors.\n \n \"Wenger is always complaining the match was not played in the right spirit,\" he added. \"They are the worst losers of all time, they don't know how to lose. Maybe it is just Manchester United, they don't lose many games to other teams. \"We tend to forget the worst disciplinary record of all time was Arsenal's up until last season. In fairness it has improved and now they are seen as paragons of virtue. \"But to Wenger it never happens, it is all some dream or nightmare.\"\n", "llama3.2:1b": "Arsene Wenger accused Sir Alex Ferguson of bringing football into disrepute after the Manchester United manager was criticized for a food fight involving his players at Old Trafford in October. \n\nWenger claims that Ferguson should be punished by the Football Association and says he will never answer any questions about the incident. \n\nFerguson responded to Wenger's comments saying that he doesn't respond to provocation and that Wenger is \"that type of person\". \n\nThe two managers' feud has been ongoing for years, with both men having made public statements criticizing each other. \n\nWenger said that the Football Association should have punished Ferguson for bringing football into disrepute after the food fight, but that they did not take any action.", "llama3.2:3b": "Arsene Wenger claims Sir Alex Ferguson is guilty of bringing football into disrepute after Ferguson called him a \"disgrace\" over the October food fight incident. Wenger says Ferguson should be punished by the Football Association for not apologizing and that the FA only punishes players, not managers, for misconduct.", "gemma2:2b": "Arsene Wenger criticizes Sir Alex Ferguson for bringing football into disrepute and claims he should be punished by the FA.  Wenger acknowledges accusations of unprofessional conduct by both himself and Ferguson during a game in October but insists his response to Ferguson's actions should not affect his performance on the pitch. \nA truce attempt is made through the League Managers Association, while Ferguson highlights Van Nistelrooy's alleged foul play and suggests Wenger's team has a history of aggressive behavior despite improvements since last season.  \nWenger remains unmoved by Ferguson's accusations and maintains he will not respond to his provocations. \n", "qwen2.5:0.5b": "Arsene Wenger claims Ferguson brought football into disrepute by criticizing players' behavior at Old Trafford in October. He says he will never answer questions about Ferguson's actions and that Arsenal manager David Dein has not admitted fault. The row may continue as the United team meets again on February 1.", "qwen2.5:1.5b": "Arsene Wenger rages against Manchester United manager Sir Alex Ferguson after a food fight during their October match led to Ferguson being called a disgrace by Wenger. Ferguson has been accused of agreeing with Arsenal's board not to discuss the incident publicly but says he received no action for Van Nistelrooy's tackle on Cole, which cost him a ban. Wenger claims Ferguson \"brings football into disrepute\" and refuses to apologize. The League Managers Association offers to mediate in their ongoing feud, with Ferguson accusing Arsenal of being \"the worst losers of all time.\"", "qwen2.5:3b": "Arsene Wenger and Sir Alex Ferguson continue their long-standing feud with Wenger accusing Ferguson of bringing football into disrepute after the 2010 food fight incident at Old Trafford. Initially refusing to respond, Wenger now demands Ferguson be punished by the Football Association. The incident occurred during an October game where Arsenal lost, widening the dispute between the two managers. Wenger maintains no diplomatic relations with Ferguson and criticizes his approach of attacking opponents publicly before games instead of addressing issues post-match in England. Ferguson disputes that claim and alleges Arsenal had agreed not to discuss the incident at boardroom level, leading to complaints from United chief executive David Gill and Arsenal vice-chairman David Dein. The League Managers Association suggests mediating the ongoing dispute between the two clubs.", "opencoder:1.5b": "The text provided does not contain any key ideas or details that can be summarized in plain text. The text focuses on a football match involving three professional football clubs - Manchester United, Arsenal and Liverpool - which have been fighting over the rights of fans due to the coronavirus pandemic. The context is about a game between these clubs, where a player was involved in a particularly violent incident, involving a team's goalkeeper against a team's attacking midfielder. Wenger, who has since made several statements accusing the footballing associations of unfair and unjust accusations, has also questioned the credibility of the other club members' statements and actions. However, these statements do not contain any key ideas or details that can be summarized in plain text.\n", "smollm:1.7b": "Summarize the text concisely by focusing on key ideas and details:\n\n1. The article discusses the controversy surrounding Wenger's criticism of Ferguson after the 2013-14 season.\n2. The article mentions that Ferguson has been accused of bringing football into disrepute, but Wenger denies this.\n3. The article reports on the return to play in February and the League Managers Association offering to act as peacemakers.\n4. The article emphasizes that Wenger is always complaining about the match being played in a \"wrong spirit\" by Arsenal.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about Wenger and Ferguson's football incident. Let me start by reading through the entire passage carefully.\n\nFirst, I'll note that Wenger has stepped up his criticism against Ferguson after he refuted certain statements he made before. He claims that the food fight at Manchester United should be investigated. There were some specifics about the game and the diatribe between players and officials, which was a big part of the story.\n\nI also need to remember that this is a longer text with multiple points and details. I'll have to make sure not to miss any key details like the months when they met again, the consequences of the food fight, and the specific incidents involving Ruud van Nistelrooy and Ashley Cole.\n\nNext, I should identify the main ideas: Wenger's response after the October game where he criticized the management for bringing football into disrepute, his comments about Diatribe, and the ongoing debate with both teams. I also need to mention the involvement of the Football Association in handling the case and the report from The Independent.\n\nI have to ensure that the summary is concise, capturing all these points without unnecessary details. It should be clear and include all the important elements mentioned in the text.\n</think>\n\nWenger has stepped up his criticism against Ferguson after he refuted claims about their past relationship. He now claims the food fight at Manchester United should be investigated. The game was won by United but led to a Diatribe involving players and officials, which is a big part of the story. The managers have a responsibility to protect the game before it, but only for what they say afterward. The situation is ongoing, with the Food Fight being judged. Wenger has criticized players for Diatribe, and the managers need to set the record straight by addressing their mutual disputes. There's also news about David Gill and David Dein agreeing at a boardroom level not to discuss the incident publicly. Meanwhile, the Football Association will act as peacemakers. Wenger is frustrated that the match was played in disrepute, referring to it as \"the worst losers of all time.\" He has criticized Arsenal for losing too many games to others and comparing themselves to other teams like Chelsea. The food fight involved Ruud van Nistelrooy, and he later fined Ashley Cole £15,000. Wenger admitted that the tackle could have caused Cole's injury but believes Arsenal was the main aggressors. Wenger often criticizes matches for being played in wrong spirit, referring to them as \"the worst losers of all time.\"", "tinyllama:1.1b": "Weingier steps up row\n\nArsenal's Arsène Wenger has stepped up his feud with Manchester United boss Jose Mourinho by claiming the Frenchman was \"a disgrace\" and guilty of bringing football into disrepte. The pair's long-running row was put back in the headlines on Saturday when the Football Association revealed that United's boss had demanded Arsenal apologise for his players' behaviour after the game between the two sides in October. Wenger accused Mourinho of being \"cheap\" and \"disrespectful\" to his players, saying their behavior was \"not consistent with any of us playing football.\" However, now Wenger has claimed that he will not be responding to Mourinho's requests for apologies. He claimed the pair have a \"responsibility to protect the game before the game,\" adding: \"The situation (concerning the food fight) has been judged and there is a game going on in a month. The whole story starts again.\" Despite this, Wenger has admitted that he expects United's boss to apologise for his actions. In a new statement, United said that they would not be making any comments until Mourinho had \"completely\" apologised and that the matter was now closed.", "tinydolphin:1.1b": " Summarized for clarity: Arsene Wenger says Manchester United's manager, Sir Alex Ferguson, is guilty of bringing football into disrepute with his accusations against Arsenal's player-manager Arsene Wenger. The row has been going on for years between the two and has become increasingly bitter as both have strong opinions on the matter.", "phi:2.7b": " Arsene Wenger claimed that Manchester United manager Sir Alex Ferguson brought football into disrepute by refusing to apologize for a food fight between the two teams in October. In response, Ferguson called him a disgrace and did not plan on apologizing. The Football Association has yet to take action against either party involved in the controversy.\n", "orca-mini:3b": " Arsene Wenger has stepped up his feud with Sir Alex Ferguson by claiming the Manchester United manager is guilty of bringing football into disrepute and should be punished by the Football Association. The pair's long-running row was put back in the headlines on Saturday when Ferguson said his Arsenal counterpart was \"a disgrace\". Wenger initially refused to bite back, saying only: \"I will never answer any questions any more about this man.\" But now he claims Ferguson should be punished by the FA. The latest twist in the Ferguson-Wenger saga came on Saturday when the United boss, in an interview with The Independent newspaper, discussed the events after the game between the two sides in October. United won 2-0 that day but the game was followed by a now notorious food fight which saw Ferguson's Arsenal side. Wenger initially refused to respond to any provocation from Ferguson and has no diplomatic relations with him.", "hermes3:3b": "Arsene Wenger claims Alex Ferguson should be punished by Football Association for bringing football into disrepute.", "stablelm-zephyr:3b": "Arsene Wenger, Arsenal manager, has escalated his feud with Sir Alex Ferguson, Manchester United manager, by accusing Ferguson of bringing football into disrepute. The conflict was reignited when Ferguson called Wenger \"a disgrace\" and Wenger claimed that he should be punished by the Football Association. This came after a game between the two teams in October which ended in a food fight, resulting in Ferguson's clothes being covered in soup and pizza. Both managers have a responsibility to protect the sportsmanship of football and Wenger accused Ferguson of bringing the game into disrepute both before and after games. The League Managers Association has offered to act as peacemakers between the two managers.", "chatgpt-4o-latest": "Arsene Wenger has escalated his feud with Sir Alex Ferguson, accusing the Manchester United manager of bringing football into disrepute. Their long-standing rivalry resurfaced after Ferguson called Wenger \"a disgrace\" in an interview, referencing a heated post-match incident in October that included a food fight. Wenger initially refused to respond but later criticized Ferguson's influence and the media's deference to him. Ferguson claimed Arsenal unfairly blamed United for aggressive play and that Arsenal never apologized for their conduct. The League Managers Association has offered to mediate the dispute. The feud continues ahead of their next match on 1 February.", "stablelm2:1.6b": "Arsene Wenger has sparked a row with Sir Alex Ferguson after claiming Manchester United manager is bringing football into disrepute. The feud between the pair was reignited when Ferguson called Wenger \"a disgrace\". Wenger maintains he will not answer any questions regarding this matter and that it is irrelevant to his football management duties. The disagreement centres around a 2004 game in which Manchester United won 2-0, with a notorious food fight involving both teams taking place afterward.", "granite3.1-dense:2b": "Arsene Wenger and Sir Alex Ferguson's longstanding feud intensified when Ferguson labeled Wenger a \"disgrace\" following Arsenal's 2-0 victory over Manchester United in October. This incident, known as the food fight, involved Ferguson's clothes being covered with soup and pizza after the game at Old Trafford. In an interview, Ferguson claimed Wenger had criticized his players as cheats in the tunnel. Wenger initially dismissed these allegations but later expanded on his stance, asserting he has no diplomatic relations with Ferguson and that Arsenal managers must protect the game before matches. He emphasized he is primarily focused on football and not concerned by Ferguson's public behavior.\n\nFerguson further alleged that Arsenal, through vice-chairman David Dein and United chief executive David Gill, had agreed to refrain from discussing the incident publicly but had since made negative comments about it. In response, Ferguson suggested they set the record straight before their upcoming match on February 1 at Highbury. The tension escalated with Wenger's accusation of Van Nistelrooy's dangerous tackle on Ashley Cole and his fine from the Football Association.\n\nFerguson defended United's disciplinary record, stating it was worse than Arsenal until last season, but now believes Arsenal are the worst losers. He believes Wenger is overly sensitive to losing and ignores other teams' superior records in this aspect. The League Managers Association has offered to mediate the ongoing dispute between the two managers.", "reference": "I don't go into that game.\"The managers have a responsibility to protect the game before the game.\"But that is not only after a game, it is as well before a game.\"Arsene Wenger has stepped up his feud with Sir Alex Ferguson by claiming the Manchester United manager is guilty of bringing football into disrepute.But in England you are only punished for what you say after the game.The pair's long-running row was put back in the headlines on Saturday when Ferguson said his Arsenal counterpart was \"a disgrace\".Maybe it is just Manchester United, they don't lose many games to other teams.Wenger later accused Van Nistelrooy of \"cheating\" and was fined £15,000 and \"severely reprimanded\" by the Football Association.Reminded that Ferguson called him \"a disgrace\", Wenger added: \"I don't respond to anything.\"In the tunnel Wenger was criticising my players, calling them cheats, so I told him to leave them alone and behave himself,\" Ferguson said on Saturday.It is 'bringing the game into disrepute'.Those allegations were put to Wenger after Saturday's game at Bolton, which Arsenal lost to slip 10 points behind Chelsea in the title race.But now he claims Ferguson should be punished by the Football Association.But Ferguson added: \"In the ensuing weeks all you got was a diatribe from Arsenal about being kicked off the pitch and all that nonsense.United won 2-0 that day, at Old Trafford, but the game was followed by a now notorious food fight which saw Ferguson's clothes covered in soup and pizza.The latest twist in the Ferguson-Wenger saga came on Saturday when the United boss, in an interview with The Independent newspaper, discussed the events after the game between the two sides in October.\"Wenger is always complaining the match was not played in the right spirit,\" he added.It's a disgrace, but I don't expect Wenger to ever apologise, he's that type of person.\"I am a football manager and I love football above all ... no matter what people say.\"\"The situation (concerning the food fight) has been judged and there is a game going on in a month."}