{"raw_text": "Bomb threat at Bernabeu stadium\n \n Spectators were evacuated from Real Madrid's Bernabeu stadium on Sunday following a bomb scare during the game between the hosts and Real Sociedad.\n \n More than 70,000 people abandoned the ground with the score at 1-1 and only three minutes left to play. The Basque newspaper Gara apparently received a telephone call saying a bomb was due to explode at 2100 local time. But after searching the stadium with sniffer dogs, the police said that no explosive device had been found.\n \n \"The police have said they have completed their search and have not found anything,\" said Real Madrid president Florentino Perez. \"The best thing we can all do now is to put this nightmare behind us.\" Madrid midfielder Guti told private Spanish radio station Cadena Ser: \"I have never seen this before and sport should be above it all.\" Real took the lead just before the break when Brazilian striker Ronaldo cracked home with his left foot. Sociedad levelled the match midway through the second half when Turkish striker Nihat Kahveci smashed home with an acrobatic finish. It is not yet clear if the remaining three minutes of the game will be played at a later date or if the result will be allowed to stand.\n \n If the result remains at 1-1, Real will drop to third place in the standings, 11 points behind leaders Barcelona, who snatched a late 2-1 win at Albacete on Saturday. Initial reports suggested the Basque separatist group ETA may be responsible for the bomb threat after issuing similar warnings before a series of small explosions in recent days. The Bernabeu was targeted by ETA on 1 May, 2002, when Madrid were about to play FC Barcelona in a Champions League semi-final. A car bomb exploded in a street outside the stadium and 17 people were slightly injured.\n", "llama3.2:1b": "Bomb threat at Real Madrid's Bernabeu stadium; spectators evacuated due to reported bomb near the stadium. Police searched without finding explosive device, but it is unclear if game will continue. If not, Real Madrid may drop to third place in standings with Barcelona winning 2-1 against Albacete on Saturday.", "llama3.2:3b": "Spectators evacuated from Real Madrid's Bernabeu stadium following bomb scare during game against Real Sociedad; no explosive device found; game result uncertain; police investigating ETA as potential source of threat.", "gemma2:2b": "A bomb scare at Real Madrid's Bernabeu stadium led to the evacuation of over 70,000 spectators during a game against Real Sociedad. No explosive device was found after a search by police and sniffer dogs. The match was stopped with Real leading 1-0, and the outcome may be revisited if play resumes later. ETA, the Basque separatist group responsible for earlier attacks on the stadium, is suspected in this incident. \n", "qwen2.5:0.5b": "A bomb threat at Bernabeu stadium resulted in hundreds of fans abandoning their seats due to an explosion before half-time. FIFA president Florentino Perez stated that they have completed their search for the source, but are not sure if a replay could be played later. Real Madrid midfielder Guti called it \"the best thing we can all do now\" and reported that he had never seen a bomb before. Real Madrid won 1-0 at FC Barcelona on Saturday, with Sergio Ramos' goal against AC Milan being the only other match-winning strike for the team. The previous weekend's events, including the explosion in Madrid, led to fears of possible terrorism in Spain.", "qwen2.5:1.5b": "Real Madrid's Bernabeu stadium evacuated after suspected bomb scare during match against Real Sociedad on Sunday night, with Basque separatist group ETA previously linked to previous attacks.", "qwen2.5:3b": "Bomb threat at Real Madrid's Bernabeu stadium leads to evacuation of more than 70,000 spectators during a match against Real Sociedad. After searching with sniffer dogs, no explosive device was found. Real took an early lead but later leveled the score. The outcome is uncertain as it's not clear if the game will continue or result in a draw affecting league standings. Initial reports suggested ETA responsible for threat after similar warnings and attacks recently. Bernabeu had previously been targeted by ETA with a car bomb on May 1, 2002.", "opencoder:1.5b": "Bomb threat at Bernabeu stadium. The incident occurred around the Bernabeu stadium on Sunday, during a match between Real Sociedad and the hosts of the Bernabeu football game. More than 70,000 people were dropped from the stadium grounds as it was noticed that there was a bomb in the area. The newspaper Gara received a call saying a device had been found with the bomb detonating at a local time, but after searching the stadium, the security officials confirmed their findings were nothing and did not cause any damage to the premises.\nReal Madrid president Florentino Perez explained that they have already made the final search in the stadium and confirmed that no explosive device has been detected. \"The best thing we can do now is to put this nightmare behind us,\" mentioned Real Madrid midfielder Guti. The match continued at 2:00 PM, followed by a football match between Spanish striker Ronaldo and a Turkish striker Nihat Kahveci, who both scored with his left foot.\nIf the result remains at 1-1, Real will drop to third place in the standings behind Barcelona, which snatched a late win at Albacete on Saturday. The initial reports suggested that the group ETA, an expert team of bomb-seeking separatists, had been involved in the incident after issuing similar warnings in recent days.\nThe Bernabeu was targeted by the ETA on 1 May, 2002 when Madrid were about to play FC Barcelona in a Champions League semi-final. A car bomb exploded in a street outside the stadium and 17 people were injured. However, it's not clear if the remaining three minutes of the game will be played at a later date or if the result will be allowed to stand.\n", "smollm:1.7b": "The summary is concise, preserving key ideas and details of the original text while omitting unnecessary information. The main points are:\n\n1. The Bernabeu stadium was evacuated due to a bomb threat during the match between Real Madrid and Barcelona.\n2. More than 70,000 people abandoned the ground with the score at 1-1 and only three minutes left to play.\n3. The police received a telephone call saying that an explosive device was due to explode at 2100 local time. But after searching the stadium with sniffer dogs, no explosive device was found.\n4. The best thing we can all do now is to put this nightmare behind us and allow the remaining three minutes of the match to be played at a later date or if the result remains at 1-1.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about a bomb threat at Bernabeu Stadium after a football match. The user has given specific instructions, so I should make sure not to include any explanations or formatting.\n\nFirst, I'll read through the entire article carefully to understand the key points. It starts by mentioning that 70,000 people were evacuated from Real Madrid's stadium due to a bomb scare during the match between Real Madrid and Real Sociedad.\n\nNext, there's information about when the evacuation happened—21:00 local time—and how the police didn't find any explosive devices. The Gara newspaper received a call but couldn't locate anything. The real Madrid president said they've finished their search and no evidence has been found yet.\n\nThen, some specific incidents happen towards the end of the first half: Guti from Cadena Ser says he hasn't seen this before, Real takes over just before halftime, Ronaldo scores again, Sociedad levels the game midway through the second half. The result isn't clear on whether it's 1-1 or will be determined later.\n\nFinally, if the game remains tied, Real Madrid drops to third place in the standings, losing two points to Barcelona, which snatched a late win against Albacete. There's also mention of ETA's bomb threat from May 2002 affecting the stadium with similar explosions nearby.\n\nI need to condense all this into a concise summary without any extra details. I'll focus on the key events: evacuation numbers, police findings, specific match highlights, and the possible impact of the bomb threat on team standings.\n</think>\n\nThe Bernabeu Stadium in Madrid experienced a bomb scare during a football match against Real Sociedad when over 70,000 spectators were evacuated due to a potential explosive device. The explosion was reported at 21:00 local time, but after thorough search using sniffer dogs, no devices were found. Real Madrid's president stated that the police had completed their investigation and no evidence had been uncovered yet. Specific incidents include Guti from Cadena Ser noting he hadn't seen this before, Real Madrid taking over just before halftime, Ronaldo scoring in mid-division time, and Sociedad level the score midway through the second half. If the game remains tied, Real Madrid would drop to third place, down two points from Barcelona, which snatched a late 2-1 win against Albacete on Saturday.", "tinyllama:1.1b": "The Boomb threat at Bernabeu stadium has led to an evacuation of thousands of spectators during the Real Madrid vs Real Sociedad match, prompting police to search the stadium for any suspicious device. The Basque newspaper Garo claims a bomb was about to be detonated in the stadium, but after searches with sniffer dogs and police searching, no explosive device was found. The best thing that can now happen is for the match to be played later with the remaining three minutes being allowed to stand. If the result remains at 1-1, Real Madrid will drop to third place behind Barcelona, who gained a narrow 2-1 win against Albacete in the last matchday. The Boomb threat has not been officially attributed to any specific group, but the ETA separatist group has issued similar warnings in recent days.", "tinydolphin:1.1b": " A bomb threat has evacuated spectators from Real Madrid's Bernabeu stadium during their match against Real Sociedad, leaving more than 70,000 fans at the ground empty with less than three minutes left in play. The incident occurred amidst the football match between these two teams, which ended up resulting in a draw at 1-1 and prompted an investigation by both the police and the Spanish newspaper Gara to determine if there was any explosive device in or near the stadium.\n\nHowever, as of this writing, neither the police nor the newspaper has found anything suspicious, leaving many fans frustrated and unsure about their safety while waiting for the results of the investigation. If a result remains at 1-1, Real Madrid will have to play a rearranged match later in the season.\n\nShould the result remain as it is, Real Madrid could potentially move down to third place in the league standings, 11 points behind leaders Barcelona after they defeated Albacete in a decisive 2-1 victory on Saturday. The initial reports of ETA issuing similar warnings before small explosions in recent days might indicate a connection between the Basque separatist group and this bomb threat event.", "phi:2.7b": " In Bernabeu Stadium, Real Madrid lost to Sociedad after a bomb threat caused the evacuation of more than 70,000 spectators during the game at 21030 local time. The police found no explosive device. If the match ends at 1-1, it will make Real drop to third place in the standings behind Barcelona. There is speculation that ETA may be responsible for the bomb threats after a similar incident in 2002.\n", "orca-mini:3b": " Bomb threat caused the evacuation of Bernabeu stadium during a Real Madrid vs. Real Sociedad game on Sunday, with the score at 1-1 and three minutes left to play. The Basque newspaper Gara received a telephone call saying a bomb was due to explode at 2100 local time, but no explosive device was found by the police after searching the stadium with sniffer dogs. The police have completed their search without finding anything, and the best thing we can all do now is put this nightmare behind us. If the result remains at 1-1, Real will drop to third place in the standings, 11 points behind leaders Barcelona. Initial reports suggested ETA may be responsible for the bomb threat after issuing similar warnings before a series of small explosions in recent days. The Bernabeu was targeted by ETA on 1 May, 2002, when Madrid were about to play FC Barcelona in a Champions League semi-final.", "hermes3:3b": "Bernabeu stadium bomb threat; 70k spectators evacuated during Real Madrid-Real Sociedad match; no bomb found after search; game status unclear.", "stablelm-zephyr:3b": "At Real Madrid's Bernabeu stadium, 70,000 spectators evacuated due to a bomb scare during the game against Real Sociedad. Although Gara newspaper received a call claiming a bomb would explode at 2:10 local time, police found no explosive device. The score was 1-1 with three minutes left in the game. It is unclear if the remaining time will be played or if the result will stand. ETA bomb threats had occurred before, including one car bomb that injured 17 outside the stadium in 2002.", "chatgpt-4o-latest": "Spectators were evacuated from Real Madrid's Bernabeu stadium due to a bomb threat during a match against Real Sociedad. Over 70,000 people left the stadium with the score at 1-1 and three minutes remaining after a Basque newspaper received a warning call. Police searched the venue but found no explosives. Real Madrid president Florentino Perez urged people to move past the incident, while midfielder Guti expressed disappointment. The match's conclusion remains uncertain, and if the result stands, Real Madrid will drop to third place. Initial reports suggest the Basque separatist group ETA may be responsible, as they have issued similar threats before, including a 2002 car bombing near the stadium that injured 17 people.", "stablelm2:1.6b": "A bomb threat was issued at Real Madrid's Bernabeu stadium during a game between hosts and Real Sociedad. Over 10,0..\nNo explosive device was found after a police search. The match ended 1-1 with Brazilian striker Ronaldo scoring for Real Madrid and Turkish striker Nihat Kahveci equalizing for Sociedad. If the result remains at 1-1, Real Madrid will drop to third place in standings, 2 points behind leaders Barcelona. Reports suggest Basque separatist group ETA may be responsible for the bomb threat. The Bernabeu was previously targeted by ETA on May 1st when a car bomb exploded outside the stadium during a Champions League game between Madrid and Barcelona.", "granite3.1-dense:2b": "On Sunday, Real Madrid's Bernabeu stadium was evacuated during their match against Real Sociedad (1-1) due to a bomb threat from an unknown source. Over 70,000 spectators left the venue after receiving a phone call from Gara newspaper claiming a bomb would detonate at 8:00 PM local time. Police searched the stadium with sniffer dogs but found no explosives. Real Madrid president Florentino Perez confirmed the absence of any explosive devices, and manager José Murculo stated the game's outcome should stand if not played later. The threat may link back to Basque separatist group ETA, which previously targeted the stadium in 2002 with a car bomb during a Champions League semi-final, injuring 17 people. If the match result remains 1-1, Real Madrid would drop to third place, 11 points behind leaders Barcelona, who won their match against Albacete 2-1.", "reference": "Spectators were evacuated from Real Madrid's Bernabeu stadium on Sunday following a bomb scare during the game between the hosts and Real Sociedad.\"The police have said they have completed their search and have not found anything,\" said Real Madrid president Florentino Perez.The Bernabeu was targeted by ETA on 1 May, 2002, when Madrid were about to play FC Barcelona in a Champions League semi-final.Real took the lead just before the break when Brazilian striker Ronaldo cracked home with his left foot.If the result remains at 1-1, Real will drop to third place in the standings, 11 points behind leaders Barcelona, who snatched a late 2-1 win at Albacete on Saturday.A car bomb exploded in a street outside the stadium and 17 people were slightly injured."}